{"text":"Nori is always a great experience. Not only is the fish the freshest you will find in Arizona, but the service is extraordinary. The ambience is a cool, modern look with lime green colors and dark woods. 

Happy hour runs until 6:00 and features some basic rolls. However, for those who are a bit more experienced, go with with an adventurous roll on the main menu or a chirashi bowl (not on the menu).  Enjoy!"}
{"text":"Great place, great sushi, great service, and great hang out spot. Open till late!!! Ordered soft shell crab roll, yellow tail sashimi and crunchy roll, everything was do fresh!"}
{"text":"Do not order from here! They are in the business to SCAM you. I placed an ordered yesterday and the ordered included tips 2$ plus. Total of 32$ plus. I gave the driver 40 bucks and she just took off!! Didn't ask if I need changed and she should know since tip is already included in my bill. What kind of business Steals 8 dollars from their customer. They should fire that women if they want to save their business!!!!!"}
{"text":"I had an excellent lunch! Emilie M. was on point and on top of her game! The food and drinks were on our table quickly, even though she was busy with tables outside and in. I watched the other servers and they were obviously trained well or carefully picked. I love to eat and actually get Service! I will recommend this place to everyone!  Great job Emilie!"}
{"text":"Update 10/5/15:  I was surprised to hear from Brent, Director of Operations, less than an hour after posting my review.  He apologized for the negative experience and encouraged/invited us to give Nori Sushi another try.  Impressed with the sincerity of his message, we decided to visit Nori again before returning to California -- and I'm glad that we did.  This time around I ordered the Chicken Katsu, and it was delicious and beautifully presented.  My husband had the Nori Teriyaki (rib-eye) and was pleased with it as well.  Manager, Chris, and our server, Beth, made sure that our second visit to Nori was an enjoyable, flawless experience.  Thanks to them (and also to Brent) for caring about their customers' dining experiences as well as Nori's reputation."}
{"text":"Just had an amazing meal! Great service, atmosphere and food. We had crunchy Rice, ahi tuna tataki, ahi tuna poke and chicken Katsu bento box. Highly recommend to everyone."}
{"text":"My kids and I really enjoy sushi. The boys (9 and 12) would rather go to a sushi restaurant than McDonald's - am I a good parent or what?

Nori is a nice addition to Desert Ridge.  There are some OK places to eat at Desert Ridge but nothing out of the ordinary.

The restaurant is quite large. Nicely laid out, comfortable seating and friendly service.
The menu has something for everyone. Hot dishes, salads, Tempura (the shrimp is terrific), nigiri, and shashimi.

It's a bit pricey but worth it."}
{"text":"I have been here twice, both times they are out of chow fun.  Each time, the server says how great it is but I just missed it.  Now I am a bit upset, third time same story:  no chow fun.  It's not that I really love Chow Fun, but come on.

Sushi is very good.  Typical atmosphere for a mall, but pleasant.  

Goyoza is okay, but eggrolls are better.  The short ribs are horrible, small amount, not rendered enough and (the cold kind of fat, not melty) as such the fat is more like gristle.  

Still, it is best for area.  Prices are fair.  Service is average.  Will I go back, yes.  

I should probably give this 4 stars because there is a lack of good sushi in the area, but I should stay true to the actual product."}
{"text":"I LOVED this place!! At first I was a little nervous as the hostess seemed kinda rude and no one greeted me for a few minutes even though there was 5 of them up there, a little awkward.

Emilie was our waitress and she was amazing! Super friendly and so accommodating. I wasn't a fan of the drink I ordered so she kindly took it back and let me get something else. I was awfully surprised as she did it with a smile and didn't seem annoyed. She also was so sweet and had a DELICIOUS cake brought out for my birthday. Seriously, this cake was amazing (chocolate lava cake). 

The food is also amazing. The rolls were so delicious and the sushi bar worker was so friendly, unfortunately didn't catch his name. Definitely would come back."}
{"text":"The first clue to flee from this place was that it was practically empty on a Friday night.  All the other restaurants were PACKED (with a 45 minute wait) so we chose Nori.  

We sat down and the server asked immediately if we knew what we wanted.  \"Umm, no, we haven't even seen the menu.\"  Then she disappeared for 15 minutes.  We finally had to flag down the busser to find our server.  Once we ordered, the order took FOREVER.  I felt like I aged a decade.

Our server finally comes back and asks if we want separate checks, and we say yes.  She returns with one check.  Sigh.  We brought it to her attention and started to explain how we needed to split AND SHE WALKED AWAY WHILE WE WERE STILL TALKING... And she didn't even get it right the second time.  

Food was good but overpriced and service was HORRIBLE.  Never again."}
{"text":"I live in a rural town in Arizona and the sushi is 100 times better for half the price. This place is terrible."}
{"text":"Just WOW!  I didn't have a Yelp account until this. Not only did they forget to put my order in, then lied about what happened, and then still no order 20min later, and then \"we took it off your bill\" No s#1t! (Pardon my language!) I didn't get it!!! What exactly were you going to charge me for?! Food I didn't get?! Manager sucked even worse! Huge disappointment for my SO and I on date night...With baby at Granny's...I left without eating and my SO feeling guilty that he ate and I didn't...Just WOW...Our first and last visit...On my Birthday night too...Just don't bother!"}
{"text":"Awesome place to eat. I always come here before I go to the movies. The happy hour is awesome and the manager always comes and says hi and recognizes me by my name. Excellent costumer service. Great food and great prices. Very nice looking place too!"}
{"text":"Always amazing food.  My hubby and I come here a lot and like to try whatever they have on special as well as choose a different specialty roll every time.  Never have been disappointed.  Great drinks, great selection of sake.  Can't wait to try their second location."}
{"text":"Food was fantastic the people working there we're great and very efficient bartender was extremely close and made me my favorite drink that I've ever tasted in my life the food again was absolutely amazing you have to come and see it leave them a good tip"}
{"text":"What a treat. Sashimi chef platter was wonderful. The waiter then tells me that people come here for the green tea waffle. After his recommendation of the ahi tuna salad delighted my savory buds to no end, I went for the Korean dessert waffle in Desert Ridge at a sushi restaurant . It did not disappoint. Must have. Thanks Nori!"}
{"text":"The Sakana Trio roll is the best thing to ever happen to a rainbow roll. The food here was delicious: fresh fish, microgreens, and citrus boba!!!! Service was also excellent."}
{"text":"Been here twice so far and can say without a doubt it's the best sushi place in greater Phoenix area. The staff are very nice and attentive and the sushi itself is very fresh and delicious. There is a good mix of traditional sushi and more modern rolls, all taste wonderful. It is pricey but worth every cent. I plan on being a regular."}
{"text":"Love this place...great service and the sushi was fabulous. Everything very fresh and flavors were superb. Nori crunchy roll was really delicious. Will definitely be back as we travel to Phoenix regularly. Deserving of all 5 stars!! Highly recommend."}
{"text":"This is THE BEST SUSHI in the Valley!!! 

We've been going to NORI, at least once a week, for the last 3 years, service is spot on, Brent is always congenial and Lee is one of the most gracious Restauranteurs I have ever had the pleasure of meeting.

Both of Nori's restaurants are excellent; they are kept immaculately clean, with the freshest fish in Town.

They deserve a 10!"}
{"text":"Lots of sushi places in the area, but none of them will get my money as long as Nori is around. They offer (BY FAR) the widest range of selection, including the always fun \"chef's selection\" option where you basically say, \"give me something awesome for XX dollars,\" and in response, you are presented with...awesomeness. Everything is always fresh, dishes are always consistent after multiple visits, and it still manages to have a bit of suave-ness though in the super family centric area of desert ridge. Yay Nori!"}
{"text":"Was going to a movie at Desert Ridge, and looking for a restaurant to follow.  Read the reviews on Yelp before picking Nori.  Sorry folks, either you are related to the owners or need to get out more.  Over-priced, and under good."}
{"text":"The food is delicious and probably the best sushi I've ever had. The sushi chefs are incredible and deserve the separate tip. The waitress serving on the other hand is atrocious. They are skimpy servers and will rip you off."}
{"text":"Restaurant is clean, very very nice atmosphere, food came out crazy fast, saw the cook he was so nice and polite.
Waitress- assisted everytime asked. I get what others may say about not too friendly but she wasn't rude either at all just neutral. People are too sensitive working as waitstaff isn't easy and this area is iffy-rough around the edges so I get her neutral demeanor and it didn't bother me. 
Food- there I ordered gyoza and an avocado and cucumber roll. I liked that the gyoza was pan fried and not deep fried. The  Maki roll was good too. 
I ordered another Maki roll To go and a bento box-chicken teriyaki. My husband didn't enjoy it. He said the chicken was fatty, I did see all the fat he spit out. And the dumplings-temura were just OK. I asked him overall and he said 'just ok'.
He isnot a picky person at all so his review is what it is.
For me the seaweed wrap used for the roll was different both times. The texture is not the same I don't know if this is due to lack of quality or maybe just doesn't travel well. 
Cost- the maki-appetizers OK, should be a tad less however if it was cheaper you probably wouldn't trust it, but the bento box meh..... for that cost it should be better quality more in terms of actual chicken and tempura-dumplings. I'm an avid sushi enthusiast so based on my visits to many other places this review is accurate.
If you are going to eat here dine in, It is better fresh. The food I brought home didn't carry-hold up well. If I need a quick avocado maki or gyoza fix I would go again.
For my food in the restaurant I say 3.5 out of 5. But for the takeout 3 out of 5. I have to give it a overall 3 based on my experience at other establishments. 

Need a quick lunch go in give it a try. I would go to try their all you can eat lunch to sample other things."}
{"text":"I have recently been back for Happy Hour.  And I highly recommend it. Warm sake for $2. And we tried almost every dish on the happy hour menu and liked everything. Great decor, ambience, food and service."}
{"text":"What I like the most about this place is it's location. It's located in the heart of Desert Ridge mall right next to the Yard house and the AMC theater. Perfect for a movie night. Rolls are the standard fare for Arizona, nothing over the top but a decent sushi. We usually start by sharing an edamame and a sake bomber, and get couple of rolls... and then it's off to the movies."}
{"text":"Great afternoon enjoying sushi and wine. Will was a fabulous server catering to all our needs!"}
{"text":"Really great sushi, fresh, clean and super nice service from their small staff. Sashimi was fresh, and the rolls were expertly prepared. Definite must-try."}
{"text":"Where do I start?  Sushi arrived before my 8 year daughters child plate.  Waitress mentioned that it was because I ordered raw fish.  Waitress brought my straw with her fingers on the straw where I'd place my lips.  I first thought I overreacted with the straw thing until I visited the men's room.  It was was too nasty for an establishment that serves food....considering the straw thing.  Lastly, a neighboring waitress was more friendly than my own waitress.

 Bad experience.  Enter at own risk...."}
{"text":"Went to this spot yesterday afternoon for happy hour (3 - 6 pm).  What a great deal! Got a vegas roll for $6 and had a nice conversation with one of the sushi chefs, Ozzie.  He took my order at the sushi bar and i was eating within 5 minutes.  It was really good sushi- especially for AZ.  All about the rice in my opinion. 

Not only do I enjoy the food here, but I also think it is a hidden gem for atmosphere in Desert Ridge.  Nori has a nice modern vibe to it and has always been a pleasant place for drinks and food.  I will be back to try more and report!

The menu was not cheap during times other than happy hour, but its what you'd expect to pay for sushi in Scottsdale."}
{"text":"Great food.  I was surprised at the quality and options. Really liked some of their specialty rolls. Baked lobster roll was one of our favorites. We had 3 big guys with lots of drinks and it was under $200."}
{"text":"Sushi is good but the location is pretty small! Patio is nice but for the summer it's very hot. They have a decent happy hour but I wouldn't go here often"}
{"text":"I went here for a going away party last night. The restaurant was not very busy, probably 6 tables in total. We were the only large group and seated on the patio. The service was poor. The waitress would show up and take orders from half of the table, leaving the other half to try to flag her down to order more drinks or food. One member of our party had to wait anywhere between 25 and 40 minutes for her food, very long waits for vegetable tempura and frustrating when people that ordered after her got their food within 5 minutes. The food delivery was a bit chaotic as 5 different people delivered the food, none of whom knew where it was going. They would stand at one end of the table holding the food, leaving us to direct whom ordered what and where it belonged. The food itself was average. We ordered a variety of items off of the menu and shared around. We did not have anything that was a real standout. With as quiet as the restaurant was, I don't see why the service was so delayed or confusing. I had hoped that I would enjoy it and have someplace new to go, but based on last night's service, I would not return here again."}
{"text":"Food was very fresh and service was great! We got the rainbow roll and shrimp yaki soba. Would have liked to see cocktails on the menu that weren't sweet martinis, but that's pretty standard for sushi. Happy hour is available"}
{"text":"I always love this place. Natalia is our favorite bartender and Brent always has a smile and makes sure everyone is satisfied. Keep up the good work"}
{"text":"My girlfriends and I had a lovely time at Nori.  Our waitress was adorable and very attentive (I wish I remembered her name!)  We loved the happy hour drink specials and the check-in perk of free edamame.  Thanks, Yelp!  The salmon sashimi is the reason to go here.  It was amazing!  I still think about it.  Delish!"}
{"text":"Great sushi, ambiance, and service. We had one of the tempuras and the sauce around the roll was awesome. Also tried the green tea waffle for dessert and it was amazing. Definitely recommend trying Nori's!"}
{"text":"Was not impressed at all..overpriced for the quality of the sushi, service was not very friendly.  The presentation of the food was surprisingly poor.  We will stick with Yume Sushi in Scottsdale.  Hands down the best on all levels!"}
{"text":"The place is overpriced, portions are small and food is nothing special. Service extremely lousy, had to ask for things multiple times, waiter forgot multiple items. We had eaten there before and things were better but this last experience was just too bad. Not going back."}
{"text":"I've been there 3 times and service is everything.  They have always been pleasant and attentive.  I have tried the lunch bento boxes tempura and the salmon, both delicious, also the seafood ramen,... it is awesome!  I have been dying to find some decent ramen and this is it!  The only suggestion is if the veggies were cut smaller, I like veggies but they should be julienned, since everything else is presented in the same way.  My daughter had the tempura udon and the broth was yummy!  It is clear and has a clean taste, not oily like it normally is.  They were even gracious enough to put the tempura and veggies on the side for her.  My husband had the spicy tuna and some other rolls that were all very tasty.  I will definitely be going back time and again especially since my 7 year old likes it :)."}
{"text":"Best sushi in North Phoenix! The fish is always fresh and everything on the menu is delicious! Definitely try the green tea waffle! This is my go to sushi restaurant. Ventured to many other places in the valley and always end up back at Nori"}
{"text":"Ordered baked lobster sushi and it was heavenly! other dishes like cucumber salad and calamari are just meh.. small servings.."}
{"text":"The restaurant is on the inside of desert ridge mall, close to amc and the Yard. The place is super clean. The bar manager gave us Excellent service. The sushi is Fresh and the dsert was amazing. Wish they had reverse happy hour and I would eat here twice."}
{"text":"The best sushi I have found in a very long time. This restaurant converted my daughter to a sushi lover. The seafood is fresh and served quickly. The chefs are willing to explain or chat. It's been a long time since I was very enthusiastic about sushi but NORI turned that around."}
{"text":"Au premiers abords, ce restaurant ne paye pas de mine mais c'était sans compté sur les excellents mari et sushi proposés! Franchement n'hésitez pas à y aller c'est frais et original!"}
{"text":"Like I don't love this place enough...they now have punch cards for lunch !! Pretty exciting, especially for lunch regulars like me!"}
{"text":"I'm a huge fan of sushi, but prefer to eat sashimi instead of the rolls. I ordered the lunch special sashimi plate and was very impressed. There were three pieces each of yellowtail, tuna, and salmon that were all well over an ounce each and only for $10! It's so rare to find a sashimi plate that is reasonably priced that doesn't leave you hungry after you finish. I also ordered the calamari...it was a pretty small portion, but was paired with a pesto sauce that was to die for. The only problem I had when eating here was the sake prices. Normally, the sake and beer are combined into a sake bomb combo, but here you have to pay for each part separately! $13 each sake bomb sounds a bit pricey to me. I won't be ordering any sake bombs from there again but will definitely be back for the sashimi and that pesto sauce!"}
{"text":"Had dinner with the the family based on a recommendation of a friend. Yum!
 The sushi was fresh, the kids menu great, and the green tea waffle with vanilla ice cream to die for."}
{"text":"I am a sushi connoisseur and was very impressed with Nori Sushi.  Sushi was super fresh and delicious, even the rice was perfect.  Nori had some creative rolls as well.  Takana Trio Roll I tried had great blend of crisp flavors without it being over powered by rich sauce.  Great service and cool atmosphere.  Will definitely be back next time in the area."}
{"text":"I have loved sushi for a long time until I came to Nori. I LOVE, LOVE it more than ever. I'm a big sashimi and nigiri kinda girl, but I really enjoy the rolls here. Whether they are raw or cooked every one of them is worth a try. They're not so complicated or \"Americanized \" like a lot of sushi places. I love that that Nori is traditional Japanese and even their  cooked rolls are genuine and divine. The sushi chefs are incredible to watch, very talented, and some of them will talk to you for hours if you let them, lol... I have learned a lot from these wise men. I have ventured away from the sushi and I am thrilled. Just because I don't really get to talk to them like the sushi chefs, I'm not going to forget the amazing talent in the kitchen! Everything from simple or garlic chili edamame, crispy salmon, jjam pong, all the tempura. .. I could go on and on... I could eat here everyday and not get tired of the same menu! Every weekend there is always a special menu... with choices of fresh food and drinks (which are always unique and sublime ) The bar staff is inventive and knowledgeable. If you don't know exactly what you want or in the mood for, anyone of the entire staff will help you out with that (food and drink). The atmosphere is chic and really inviting; whether you sit inside or out. The staff is very attentive, friendly, and I could tell that they all work together, kind of like a family/team. The management definitely knows what they're doing! I love introducing friends and family here, everyone I have brought here has had a wonderful experience. ( I also like coming by myself sometimes;))  Thanks for being here, Nori! I enjoy it everytime"}
{"text":"Fresh very fresh food.  That is the key to sushi.  The service was fantastic.  Priced right. I would highly reccomend this place to anyone.  Simply brilliant experience.  I almost forgot you have to try the waffle desert."}
{"text":"Visiting Scottsdale we stumbled on this great sushi bar. Nice fresh fish. Tasty rolls. Decent wine list. My sake was really fantastic. Very friendly and prompt service from Lindsay - her recommendations were tasty as well. Nice location with lots of outside dining near the mall plaza with palms, fountain, and big fireplace. Worth visiting again."}
{"text":"Wow, we finally found a great sushi place! Incredible! The tuna takao and lister roll was spectacular! Everything we ordered all 64 peieces were fresh and unique! We sat outside and just loved it! We will be back again and again! And the prices were just right! PS loved the green tea waffle for dessert!"}
{"text":"One of our favorites places for a quick mid-week lunch. Despite being in the Desert ridge marketplace (outdoor mall) - we have never seen it crowded.  Equally enjoyable outdoor or indoor seating. Excellent food (not just sushi) - in fact we always order the bento box lunches - that come quick and are delicious. Excellent service."}
{"text":"Yummy sushi. The prices have gone down from a few years ago. The only down side was that the air conditioning was broken so it was hot and muggy inside."}
{"text":"The food was highly disappointing for somwhat of an upscale sushi reataurant. For a sushi fanatic like me, this restaurant is everything but impressive. Food took a very long time as well as coming out in different times for my whole party to finish their meals at different times and waiting for one another. The sushi portions are small and very unimpressive for the price and location. I would much more recommend going across the street to Sushi Station where they have a conveyor belt sushi restaurant. I also didn't appreciate that i had to ask for my spicy tuna roll until waitong until everyone else, myaelf included, had finished eating."}
{"text":"Have been here multiple times for lunch special. Sushi is always fresh and love that there is a patio. Have been trying other places in the area but keep coming back to Nori!  Great addition to Desert Ridge!"}
{"text":"Excellent service and nice decor. Unfortunately the sushi wasn't that great. The rice on the rolls was dry (not very fresh perhaps?), the taste of salmon roll and tuna roll were strangely too close to distinguish, the tuna sushi almost looked like it was colored. The sushi fish taste was B grade at the best. I am sorry guys your sushi quality needs improvement."}
{"text":"The Food and service was excellent. I left feeling highly satisfied and will absolutely be coming here again to fulfill sushi cravings. I especially recommend the calamari."}
{"text":"i recently went here with some friends for happy hour even though I'm allergic to all seafood and shellfish i was pleasantly surprised they had a lot of options for me I had fried tofu and a vegetable roll! it was delicious!!!! I will definitely tell all my friends to try this place out!! great prices and great food!!!"}
{"text":"Nori is a great sushi spot that I'm not sure why took me so long to find. Amazing service, Danielle was my server and she gave me the best service I've had in a long time! Amazing staff and even better food! Working my way through the great happy hour menu right now!"}
{"text":"I want to say it was great great sushi restaurant in Arizona.  Everything is awesome and service is also wonderful."}
{"text":"Great service and nice clean place!! Will come back here again! Give it a try you won't be disappointed."}
{"text":"I had never been to Nori before and am not a sushi expert by any means, but I had just about the best meal and experience there ever! Make sure you request Lindsey as your server. She's very fun and knowledgable. She helped my table and I pick out the best rolls and paired them with the best and most appropriate sake. I will definitely be coming here again... And again...! Never knew that a sushi joint at a mall could taste so great and leave such a lasting impression."}
{"text":"Great vibe. Alayna was a very personable waiter. Great happy hour menu! Would definitely order the crispy rice, coconut shrimp, and Vegas roll again. (The tempura shrimp roll was good, but nothing to write home about.) Also ordered the sakana trio, which I really loved, but my husband thought was lacking flavor. I was dipping it in a good amount of wasabi, though. Our new stop before MIM concerts."}
{"text":"I ordered from here on the weekend. I usually go here the majority of times to fix my sushi cravings and have never been disappointed. But when me and my significant other wanted to stay in and order delivery, i cannot believe the service!! We placed the order at 6:24pm, at about 7:15pm, we were wondering why we havent gotten our order delivered. I had called them to check the status on my order, a lady answered and after taking my information down, she said so sorry busy, and just hung up on me twice! Might i also add that i live literally 5 minutes away, so decided to pick up my order instead. As i walked inside, the restaurant wasnt even busy, yet they claimed they were so busy and hung up!! Only 4 booths were filled and the other side of the restaurant! EMPTY! Was very disappointed!!"}
{"text":"The sushi was good  - we tried the salmon, eel and the salmon roe. The katsu was ok and the Udon was too salty. So why 4 stars - they took the Udon off the bill when we complained. And unfortunately, I lived in Japan for years, and anybody who has done that knows that it leads to an very high expectations when it comes to Japanese food !"}
{"text":"Great happy hour 3-6..  Food fresh and service was good.   Nice selection of $3
 beers...We will definitely be back!"}
{"text":"I think this place is, considering the area around, a gem in the rough if you will.  I cannot comment on their take out service but I have had their AYCE multiple times and I am always impressed with its... quality.    

I really love the interior of the restaurant.  As a resident of the neighbourhood around, I am accustomed to dingy hole in the wall interiors and going to Nori Sushi always pleasantly surprises.  The restaurant has a really nice modern feel to it and I forget that I am steps from Albion Mall.  They constantly have a TV playing somewhat out of place music but usually fitting to the modern feel of the interior.  I'd have to give the ambience a 4/5 here but of course this is a part of the review that is subjective.

The service is bittersweet.  The servers are incredibly quick and food comes out fast but without much enjoyment or happiness.  This does not bother too much as I would not prefer the opposite scenario however I could see how this would be bothersome to some.

The food, however, is what I come back for.  I am much too used to the generous servings of rice that sushi places downtown serve and going to Nori always puts many of the places downtown to shame (i swear their salmon handroll is 60% salmon, a very respectable portion).  I really appreciate their portions along with their freshness.  The kitchen items always come out very hot and they offer so many items that trying everything in one go would require intense mental fortitude.  Now I personally am not a very picky person, however I would not hesitate to bring my friends here as I am sure they would appreciate the food here as well.  I must give the food a 4.5/5 however since they do not serve shrimp tempura at lunch but then still have essentially everything you'd need.

I'm happy that this restaurant exists as I do not need to travel far to have good AYCE sushi.  Sure, the service is not the greatest and they are missing some items on the menu.  But its probably my favourite place to get AYCE sushi just because they do a lot of things right.  Good, generous sushi, quick service, a multitude of choices and a clean restaurant is what you are getting here for a pretty decent price.  I hope Nori Sushi keeps up the good work!  I'm giving a 4.5/5 as its not completely perfect, but it is perfectly suitable."}
{"text":"First off, THE PLACE IS INSIDE THE MALL. I'm from Iowa Visiting Arizona and I spent a really long time trying to find this place. After 10 minutes of trying to find it, I went with my gut and looked inside the mall. It is by the islands which you can see from outside the mall. Our waiter was very informative about the sushi and came out with our drinks and food promptly. We got 3 different rolls, edamame, udon noodles and ALL of it was amazing!!!!! I need to go back here next time I visit Arizona!"}
{"text":"Love love love their happy hour! Much better then their competitor across the road (sushi station) their happy hour had great prices and a great selection! We had 7 people fed and it was still under $120. Not bad for about 10 rolls and 5 appetizers plus who knows how many drinks. We will definitely be returning. Although I was a little disappointed with their Tuna Poke; I've had better. Still 5 stars in my book though, just wouldn't order that again."}
{"text":"It was our first time trying this place and I can't say it was a great experience. The food was okay and the wait was a little long. There were maybe 8 tables and two waitresses so not too busy. 
While waiting for our food we witnessed a head sushi chef yelling at a cook in the back. It was absolutely inappropriate. We heard him calling the cook stupid and talking down to him pretty much throughout our entire lunch. There's a lot I'd like to say about this situation but I'll bite my tongue. Needless to say, we won't be going back and it's a shame because we love sushi and it's close by."}
{"text":"New favorite date night spot: classy & fresh quality sushi, sashimi & nigiri! 

My hubs and I have been here twice and really enjoyed the cocktails: Thai Heat martini was my favorite but I tried the pear martini which was well balanced.

Summary:
The baked lobster roll- rich & creamy
Yellowtail- fresh
Dragon roll- gorgeous & yummy
Freshwater eel: amazing
Sea eel: ok

We sat inside the first time and patio the second- which I prefer indoors due to the random families & people passing by staring at your food. Love the weather through!  Maybe next time well try sitting in the bar area.

The service is very consistent!  Both gals who took care of us were polite, helpful, well timed, and accurate."}
{"text":"I don't know what's happened since I was here 2-3 months ago, but something has changed. My rainbow roll had fish sliced so thin that you can see through it.  Sad.  Siting at the bar to eat and the bartender/server (who is a really nice guy) messed up my order and basically said my bad with no offer to fix the order.  Food is good, but aside from the sashimi, it is overpriced.

They totally redeemed themselves.  They addressed the issue with the fish.  It was an issue that they took the inisciative to correct.  kudos to them!  I upped my stars to 3 instead of 1."}
{"text":"This had been one of our go to places for sushi. The quality ha always been good as has the service. What came us coming back was the amazing seafood pancake that they inexplicably dropped from the menu.  It was sort of like a scallion pancake but more tender and packed with seafood.  This one dish took a good sushi place and elevated it to a favorite. 

Thee stars without seafood pancake. Hoping they bring it back and in ok then I can go to equally good places without dealing with Desert Ridge parking."}
{"text":"Service was terrible. My whole family was finished with their meal before they brought out my food. No apologies were made. I didn't see the waitress at all once food was brought. We had to track the manager down to complain. Will never eat here again"}
{"text":"Our \"go to\" Japanese restaurant! 

Being an American Japanese born & raised in Hawai`i, it's been a challenge to find fresh fish & sushi here in AZ.  

Nori's has become THE place for us to satisfy our Ahi Poke (poki as they spell it) & sushi cravings.

Nice, small place that has tvs so we can still watch football while eating in the dining area.

Have only been there twice (in 1 week's time) and service has been friendly and attentive.

Food is yummy & fresh.  Closest thing to \"Hawai`i local Japanese grinds\" that we have found.

The only thing we have ordered that we haven't really enjoyed was the green Tea mochi ice cream.  From the flavor of it, it is made from authentic Japanese green tea, which I like to drink, but for my dessert...not so much. I would have preferred the (fakey, sweetened) \"flavor\" of green tea.  Can't fault them for being authentic though.

We will probably be regulars here."}
{"text":"Nori is awesome. Dragon roll and crab cakes delicious. Fun patio. (Manager should try smiling and being a little friendly, tho.)"}
{"text":"5 stars for NORI!!!

We came for happy hour last week and sat at the sushi bar. Our server was very friendly, as well as the sushi maker! Young?? (Forgive me if I spelt your name wrong). We ordered 3 rolls and they were all delicious! I'm super glad we live so close because this will be our new sushi spot. Thank you for the great service"}
{"text":"Came with my husband one evening. It was ok. I wasn't too impressed and I thought they were a little over priced. We had some sushi and then we also ordered the Yakisoba noodles to share and we both thought it was a little flavorless. The sauce that came with the Gyoza was gross."}
{"text":"Absolutely best sushi in Phoenix. Food is always consistent. Price is very fair. Lunch specials are awesome and fish is always fresh."}
{"text":"Can't believe a place this good sits smack dab in the middle of desert ridge. Interesting rolls but it just goes down to the quality of the fish. I plan to come here regularly. Great owner and staff. Fantastic sushi chefs. What are you waiting for? Get over here already!"}
{"text":"My bf and were excited to try this place bc I love sushi and he likes the non-sushi dishes. I made a reservation several weeks ago. We arrived and were seated right away. It wasn't busy at all when we got there. We ordered drinks (bf got a beer and I got a watermelon martini) and then ordered the steamed pork dumplings which were OMG sooo good!! We should have ordered 2 of them! 
We then ordered salmon and tuna sushi (the kind that is on the rice). He ordered the chicken teriyaki and I ordered 2 Philadelphia's and 2 Spicy Yellowtail. Bf got his dish before mine but refused to eat until I got my meal. About 10 minutes later, I get 1 each of what I had requested. Both were very good. However, they forgot to bring out the rest of my order (which was fine by me bc I was full any way) lol
The bill comes and we got charged for 4 sushi rolls when I only had 2. We explained it to the waitress who quickly apologized and fixed the mistake.
I would come back again :)"}
{"text":"This isn't my first time being here. Usually I get great service. However, this time was less then stellar. This was my first time sitting at the actual sushi bar. We thought it would be fun. So my friend and I asked to be seated there. We came to a decision on our sushi and asked it to be slightly modified. When we asked for soy paper and light rice our sushi chef snickered and laughed at us like it was a joke and gave us attitude! We were both very taken back by this cause when we ask at other sushi places they just say ok! We didn't know this was such an odd request! Needless to say it really left us not only to the point we didn't really enjoy our food but I have no desire to ever go back! The amount of disrespect was appalling. The food was ok, but you should teach your staff to be more respectful when it comes to people's dietary choices."}
{"text":"I have gone a total of 3 times for their AYCE for lunch and have been impressed. This is sushi restaurant is fairly new and was skeptical at first due to the surrounding area. But after trying it was pleasantly surprised. 

Firstly, the lunch is only $13.99 + %10 off if you're paying by cash ($1 more on weekends and possibly Friday) which is cheaper than its competitors around the area. In comparison to another place not to far which charged $14-$15.99, I feel like they surppased them in certain areas.

1. The rice to fish/meat ratio was very good they didn't try to cheat you by stuffing a sushi or roll with extra rice.

2. Freshness was all there, it could be because they do have a Chinese super market near them but in terms of fresh taste of the fish they score higher marks than the some of the others in the area.
 
Areas where they lacked versus the higher priced establishments were, customer service. They did their jobs and got the food in a timely manner just not with a smile or sense of going beyond expectations. Slight lack in lunch item choices in terms of what rolls or items other places offered versus what they offered. And I guess no iPads?

In conclusion I would differently recommend this place for their AYCE for their price, freshness and flavor. I am actually going again right now.

Extra note: They do offer delivery and have a nice setup for their delivery though their mobile site. Only thing is I haven't tried it personally so I can't speak for their speed and order accuracy."}
{"text":"The Las Vegas rolls were really good! Nice location too. Went during Christmas time and walked out to \"snow\"  pretty cool."}
{"text":"We were pretty excited about this placed based on the reviews and photos. We went for an early dinner on a Saturday. The atmosphere was nice and our server was nice. We were handed a few menu's and they also had a drink menu and happy hour menu on the table already.

We immediately noticed the fair prices on the happy hour menu for both drinks and some food options. It said on the menu 3-6pm. When our server came over she saw us looking at the happy hour menu and I also pointed to that menu when we ordered a few rolls, an appetizer and a drink. We also ordered one of the more expensive daily special rolls too. The food was pretty good and the service was as well though almost too attentive. We were asked how the food was at least 10 times. It was nice that they were checking in on us but almost too much so.

Then we got the bill and it was drastically more than we thought it would be. We noticed all the prices on the bill were their regular prices and not happy hour. We brought it to the waitresses attention and she said happy hour is only Monday - Friday. We looked at the menu while she was there and it does not say that on it anywhere. She simply replied \"Well that is when it is.\" We mentioned that they should really put that on the menu or not put those menu's out if it isn't happy hour but she didn't seem to care. She also saw us read straight from that menu and point to it when we were ordering so she really should have said something to us about it at that time.

It just isn't fun to get a $70 bill for 2 people when you were expecting closer to $45 and then to have them care less about the mix up when it was due to lack of information on their part. At least put the days on the happy hour menu to avoid this completely in the future. We would probably go back but only during happy hour for sure since their prices are a little too high in my opinion ($16 for some of their slightly fancier rolls and $7-10 for an everyday roll)."}
{"text":"Nice people, especially Brianna. Very clean and well organized. The four tvs don't hurt. The indoor/outdoor seating makes the experience fun."}
{"text":"great place for sushi,  small  menu, but very fresh ingredients, after multiply visits never was disappointed in food or service"}
{"text":"The Desert Ridge area is a predominately white neighborhood, and it shows with the review inflation.

If you enjoy the typical california roll and fried rolls, this place is probably fine. However, the quality does not extend to nigiri. we tried some salmon nigiri, and it was not good. Even worse than the nigiris one can get at an AYCE buffet... 

I'd avoid Nori if you like raw fish."}
{"text":"For a sushi bar so far from the ocean they had an extensive selection of good quality fish. I tried the toro sampler. This consisted of 3 slices of chutoro sashimi, two pieces of otoro sushi, a toro hand roll. Next came an order of scallops sushi, large fresh scallops with a hint of ponzu sauce. I tried the halibut, yellow tail and sea bass and all where good. We also ordered two rolls but they weren't really memorable so I can't recall there names."}
{"text":"I'm a pretty big fan of Kona Grill, usually the Scottsdale Quarter location and Fashion Square. But I have to say, my first visit to Nori Sushi at Desert Ridge Marketplace left me pretty impressed. I think I can say on this first impression that I might actually prefer the sushi rolls here over Kona. 

Met my buddy Jim this afternoon for Happy Hour. We ordered a few California rolls, a Crunch roll and a Spicy Salmon roll. The quality, to me - particularly the Crunch roll, was a step above Kona's. The garlic edamame was also a real winner. We had the house red wine that was really quite good as well. The Happy hour prices are great, so you can't go wrong with having a few glasses of vino and some sushi. Sitting out on the patio was the perfect spot to enjoy the mild weather and just relax. Our server, Jess, was very attentive, friendly with an easy smile and made our time there easy-going and fun. 

Nori Sushi seems like a really good spot to stop in and hang out for a few Happy Hour drinks and some time with friends. More visits will be necessary, of course, to form a more solid impression overall but I'm confident I've found a nice new addition to my sushi / Happy Hour rotation."}
{"text":"Had the coconut shrimp and the lobster rolls...they use fresh and healthy ingredients and it tastes great! Good location and value...I'd say skip the more well known joints and check this place out it was great."}
{"text":"This is one of my new favorite sushi restaurants. Nigiri and sashimi were top notch, rolls were nicely prepared, and the presentation was phenomenal!"}
{"text":"Nothing special.  Not amazing but not bad.  My girlfriend had a coupon that the manager did not want to accept because it was on her phone and not printed out.  Psh!  He did end up taking it after giving us a little grief."}
{"text":"I'm beyond thrilled I found this place! Nori is outstanding!! 

Sushi- Try the Poke Poki Roll, I love tuna poke so I was anxious to try this roll. The crumbled Doritos on top give it an awesome crunch. The Sakana Trio might be one of the most delicious rolls I have ever had. This roll has fresh Ahi, Yellowtail and Salmon layered atop and garnished with citrus popping BOBA. Another must try is the Ahi Tuna Tataki roll! I love the crispy onions and house made tataki dressing that make this roll one of my favorites.

Don't pass up the Tropical Hamachi and The Tuna Carpaccio both served sashimi style, which I love! 

For all you non sushi foodies there is plenty to choose from! Try the Yakisoba noodles with chicken, you won't be disappointed. A few other noteworthy non-sushi dishes include, The Rib-eye Yakitori, The Galbi short rib plate, Breaded Pork Katsu and The melt in your mouth Miso Chilean Sea Bass. Honestly I have yet to try one bad thing on the menu, even the salads are amazing (try the Ahi Tuna Tataki Salad).  I almost forgot to mention that they also have a Prosciutto \"sushi\" roll thats made for those who don't eat fish.

Be prepared to have your socks knocked off after trying the Green Tea Waffle with Vanilla Ice Cream for dessert... All I can say is YUMMMMMM!

Okay so I know I raved about the amazing food but what makes me love this place even more is the extensive Sake list and awesome cocktails. Being a sake lover I was thrilled to see the amazing choices of sake I could choose from. My two favorites are the nigori and The Zipang, but If you're more into cocktails try the Thai Heat which has a fiery kick to it or the Blueberry Shisojito for a nice refreshing drink.

All in all this place has super fresh, one of a kind sushi, and amazing kitchen menu, amazing beverages to choose from not to mention their knowledgeable awesome team makes for a great experience all together. I'll be back and i'm bringing friends!! 

Oh and one more thing... They have an awesome Happy Hour (M-F between 3-6pm) and an awesome wine special on Mondays!!"}
{"text":"Loved this place my wife and I brought the kids there and loved everything. Service could of been slightly better but the hostess never told the waitress that she sat us. Their Nigiri was to die for and we tried three different rolls and they were amazing. I live in Vegas but will go back there next time I visit"}
{"text":"I really like the food here, particularly the yaki udon. I've tried various sushi plates here as well, but I don't get it too often since most of my friends who go with me aren't usually in the mood for sushi. Regardless, I came here the other night with a friend for my birthday and it was very nice, other than the fruit flies. I noticed fruit flies are a problem in a few restaurants here in the valley, unfortunately. Usually some people would make this a 1-star rating just because of that, but I really like this place and they weren't anywhere near my food so it wasn't a big deal. Our waiter was very nice (I think he had glasses and no hair) and I could tell that he was working hard. Unfortunately we didn't get the green tea waffle this time, but that's my favorite thing to get every time I get a chance to visit Nori."}
{"text":"I would give them a better review if I ever recieved my food. We waited 40 minutes and nothing came out. The place seems pricey for mall sushi. I would recommend Cafe Hiro in Scottsdale if you want decent sushi."}
{"text":"Meilleur endroit rapport qualité/prix. Les deux proprios sont toujours derrière le comptoir. A recommander"}
{"text":"Food was really good, great ambiance, seems pretty fancy. Hot dishes were great and we loved the tempura. Sushi rolls took longer to come out and weren't the greatest my family has ever had, but good. Service was not the greatest, it wasn't busy but we were kept waiting several times. Probably wouldn't come back, but it was good and might recommend to it to a friend."}
{"text":"Nori.  First thing I thought of was Kanye and Kim's daughter, Nori aka North.  But no Kardashians in sight here!

One of the reasons we stopped and ate here instead of the other restaurants is because it didn't look as busy as the others.  It's located near the movie theater which is the main reason we were in the area.  We chose outdoor seating since the weather was nice out.  It wasn't too busy either since we came on a weeknight.  

Service was good but food came out slowly.  I'm not sure if they had a Happy Hour but it wasn't mentioned if they did or else we would have jumped all over it.  Prices are eh and our bill was way more than we expected.  Food was good and tasted fresh.  It's a cute, hip spot to try if you're in the area."}
{"text":"Favorite sushi place in Phoenix because they don't have any rolls that have cream cheese. Cream cheese ruins all sushi rolls and I appreciate their non cream cheese sushi rolls. Thanks for keeping it more traditional Nori. You will continue to have my business with your cream cheese-less rolls!"}
{"text":"I came here before going to see a movie, as it's located next door to a theater.  Wanted to grab a good drink before the show and saw they had a very attractive looking drink menu.  Lots of drinks sounded good, but I was pressed for time so we each got one...me the the Monkey Margarita and my date the Mito Mule.  Both were soooo good, though I personally liked mine better...if you like a spicy margarita that doesn't seem fake (overly sweetened or artificially flavored) this is a great choice!  The mule was good too, though I thought it was a bit too sweet.  Service was not the best; we sat for 5 minutes before being helped, which would have been fine if they were busy but we were one of four couples on the patio and a server took the time to clear a table before even saying hello to us.  Anyway, I would still go back, everyone has a bad day now and then and the drinks are worth it!  Next time I'll also order food, as the menu looked really good!!"}
{"text":"Looking for a refreshing meal to cool you down during the summer? Order the Sakana Trio ($16) and the Asian Pear Green salad ($10). The sushi roll comes topped with citrus boba that adds a whole new dimension to your eating experience. Although \"non-traditional\", it's a fun and delightful twist that I thoroughly enjoyed. The pear salad was light and crisp. There was a good avocado:pear:cucumber:radish:green ratio so that each bite was just as good as the first. The waiter at lunch was friendly and attentive. The indoor decor is chic and you won't have to worry about parking - there's plenty! Everything is great until the bill arrives; it's pretty pricey, so perhaps plan on coming on an empty stomach...or maybe just to snack on 1 roll and some free edamame."}
{"text":"We were in Phoenix and had a sushi craving. Nori was simply excellent. We sat at the sushi bar and watched the young men cranking out the sushi. The ingredients were fresh, the service was supreme, and the atmosphere was great. We got there during their late afternoon \"happy hour.\"  We had the edamame and a sampling of about six rolls. Superb."}
{"text":"A gem in the Desert Ridge shopping center. Great rolls - LOVE the one with Doritos on top :) very reasonably priced and the service is awesome (super quick if you're in a rush). I had some awesome unfiltered sake the other day for $9 a bottle. Unheard of!! 

Minus one star bc of the layout. The outside bar area and patio are great, but are right by the kids fountain. If we are having a date night, screaming kids aren't our thing. But this area was in need of good sushi and you'll find it at Nori."}
{"text":"This is good food! That's what you'll say when you eat here. Great atmosphere, plenty of seating, and as many have said, what a great patio to people watch. That's exactly what the wifey and I did.

First of all, we had great service. What is great service? A smile and warm greeting from the hostess. An opportunity to like or not like the table given. Detailed information about the specials and food. Finally, not too many or little check ups on water or how we are doing. This place has great service.

Make sure to check in to enjoy your free edamame. Lightly salted but definitely delicious! I ordered the Ahi Tuna Tataki and the wifey ordered a moist salmon dish that was tasty. The ahi was quality and had a refreshing taste at the end of the chew. I highly recommend. My wife's dish was very delicious and I found myself enjoying a roll while going over my plate and stealing a piece of her fish. This place is that good.

This place has all the bells and whistles. It's elegant, but casual. The menu is clean and not too extensive. Overall, this is good food and we will definitely be back!"}
{"text":"We were REALLY excited to have a new sushi place in desert ridge!  The good... The sushi was really good.  The bad, I felt the number of specialty rolls was limited, and at the price this place was more of a occasion place not a \"let grab some sushi\" kinda place.  I'll give happy hour a shot..."}
{"text":"What a terrible experience! I ordered the sweet corn salmon with mashed potatoes and told the waitress I needed it gluten free. So, my husband gets his (small portion) food that he said tasted like a frozen entree from the grocery store and I sit waiting for mine....waiting....waiting...oh here it comes (he's half way through his at this point) and I see this MAYBE 7\"X2 1/2\" plate set in front of me with about 4 oz of salmon over steamed veggies, a 1/4 cup scoop of white rice, and some weird crunchy things on top.  When the waitress comes by I ask her what happened to the mashed potatoes and buttery corn...apparently they had gluten in them...wtf?! Did the potatoes come from a box?! Anyway... The manager comes by and argues with me about the dish. That there would have only been \"18 pieces of corn anyway\" and he didn't understand why I didn't want it. WELL... The only thing on my plate (tiny little plate that it was) was the salmon. Dry, boring, no sauce salmon. So, he said he'd take the food back....so I gave it to him and told him not to charge me the $17.00 either! He was such a jerk. So 0 stars from me.... Terrible food, terrible customer service, but the fries next door at the burger place rocked! :)"}
{"text":"The freshest salmon I have tasted in the Phoenix area! A great spot to grab good food, and a drink! Will definitely be returning just for the salmon!"}
{"text":"really good sushi. great service. my favourite food there is pizza sushi. really great tasting sushi."}
{"text":"I just love the sushi bar and my five-year-old daughter and I eat here frequently because the prices are great and they even put one of the TVs on a cartoon station for her when it wasn't busy. The service is very friendly and helpful and the bathrooms are clean. it's in a great location and has an outdoor patio as well. The coconut shrimp was delicious and they make a special avocado roll just for my daughter. Even have cider beer. I found they're stylish margaritas very interesting."}
{"text":"Nori = seaweed. As a child I remember eating nori as a snack and to this day still love it. It's kind of funny seeing it evolve and have become the healthy form of chips and even sold in Costco. Eating nori solo is an acquired taste for some. Anyway, nori is what you see in your sushi, the part that wraps the main ingredients, just inside of the rice layer. 

Going for family style for a table of 5 we chose the following:
Cold and raw sashimi:
 - Toro (tuna belly) - 5 pieces of sashimi. This is my favorite because it's a firm piece of the tuna belly yet melts in your mouth. You almost have to savor the bite or bites while eating it. When these types of fish are bought in a bidding war at the fish market they are well worth the battle. $28. 
- Tako (Octopus) - 6 slices of octopus tentacle with lemon slivers. This probably is not my favorite because it was just too chewy. The penetrating white color against the yellow lemon looked nice on the bed of ice. $12
- Ika (Squid) - a mini bowl filled with squid decorated with masago (those tiny little orange fish eggs). These were better tasting than the octopus by far and were more edible to chew. $5

Cooked and warm sushi:
- 2 Vegas rolls - this puts the American spin in 2 ways: the cream cheese and the fact that it's fried. This also has eel, salmon (I think) imitation crab, asparagus. If not salmon, then the imitation crab replaced it. And if not asparagus then some places use cucumber. Then the batter on the outside with some eel sauce. 
- Shrimp Tempura Roll - another fried favorite. Shrimp tempura with imitation crab and asparagus. $10
- Soft Shell Crab Roll - fried soft shell crab with the same contents of the shrimp tempura. $13

Noodle dish: 
- yakisoba - stir fried Japanese soba noodles with shrimp, red and green bell peppers, onions. A favorite noodle dish that anyone would love. $14

Then we decided to eat more.  So we ordered a handful of nigiri raw fish on a little mound of rice. 
- Tuna (maguro) = red color fish which is the basic of all fishes. It is firm in texture and robust in taste. $6
- Salmon - light peachy color with some white. This is your omega 3 fish!! Semi-soft in texture and a mild soft taste. $6
- Yellowtail (hamachi) - light white with hints of red flesh. This is considered an oily texture and intense in flavor. $6
- Mackerel (Saba) - silvery-shiny fish that is delicate and flakey in texture and salty, cured in taste. $5
- Sweet Egg (tamago) - an egg cooked to a sweetness in a rectangular form. $5 
- Salmon egg (Ikura) - large translucent dark orange salmon eggs toppled into nori and glazed over rice. Light bubble in texture and salty in taste. $5
- Fresh Water Eel (unagi) - Soft fish with a sweet taste because of the eel sauce made of soy sauce, rice wine and sugar. $6

There were a couple Kirin Lite and a large sake to show the spirit of the American way: Sake Bomber. 

The waitress and the owner/manager, as well as the bus boy were all spectacular in service. Our waitress always had a smile and was helpful. The owner/manager was also helpful and professional to our table. The bus boy did his best to fill waters attentively. Nori hit the spot for a Friday evening!"}
{"text":"Crazy good sushi rolls, great happy hour food, unique dishes and good place to go for sushi because it's in Desert Ridge! Desert Ridge has live music on the weekends so be sure to eat on the patio so yo can listen to the band. I will say that the sushi takes a long time to prepare this is not a quick in and out so make sure yo have some time to spend there. Try the green tea ice cream, its served on a Belgium waffle with strawberries/blueberries, caramel sauce and whipped cream! its wonderful!!"}
{"text":"Beautiful decor and a lovely patio, the color scheme is very zen and appropriate for sushi. Any roll with eel sauce and spicy mayo is awesome."}
{"text":"My rating is for service only... or lack of it. Went in for a couple  of beers and an appetizer. The host sat us without a bit of a greeting. we waited for a server to come by, for over 10 minutes, then we ordered 2 draft beers and some edamame. We waited over 15 minutes, no beers, no food, no one to say \"your beer is coming soon. We finally left. what a 25 min waste of time, and no one seemed to care."}
{"text":"The California rolls were good. I also ordered edamame which was so hot, I literally got a burn on my finger and they didn't care or apologize. Super lame."}
{"text":"The Tempura Lobster was AMAZING!!!!!!!!!!!! The cucumber Martini was good, did not taste like alcohol at all. Chicken Tempura was good, the mashed potatoes were nice with it too but for me the highlight was the Lobster Tempura and cucumber salad. I wish there was one closer to me."}
{"text":"Most honest review:
As I've heard good things about this place, I had some expectations coming here for the first time. 

The sushi/sushi rolls were at best okay. The fish seemed to be kept at a cooler temperature then it should be. 

Aside from that, the service here is the worst I've ever experienced from an all you can eat place. They had a paper order form, which one would think is beneficial, but when the waiters don't punch it in, or forget about it, you never get your food unless you verbally complain. Also, the waiters are unfriendly and don't care for assisting when things go wrong on their end.

When we were ordering dessert, the waiters asked if we wanted the rest of the food we order (this being an hour+ waiting for it). Frustrated, we said no.. We waited more than an hour for rice/noodles/sushi/everything.. And wanted dessert so we can leave. They replied with \"but all your food is ready\". You would think, maybe the place is busy, maybe they're short staffed... We were a party of 9, one of 2 other tables taken up, and they had more than a handful of workers. 

I've been to many AYCE places, and although this might be the one only in the rexdale area, travelling 5-7mins north to hwy 7 is worth the drive. Better service, better sushi, better over all experience.

Gave it 2 stars because the food wasn't so so bad.. But wouldn't dare give it more. 

Cheers,
J"}
{"text":"I love sushi...Who am I kidding? I love food!  But sushi is towards the top of my list when I'm deciding where to go to dinner.  So when I searched for new sushi places near me, I found Nori.  The reviews seemed good, and the recommendations were right up my alley.

Had a little trouble finding the place, since the address directs you basically to  Desert Ridge Marketplace, but to the corner of Deer Valley and Tatum.  Ended up calling them after driving around for 5 minutes without having a clue where to go.  When we got there, the patio had a couple tables open and the inside was half full, so we decided to sit outside.  

I took advantage of the check-in free edamame and we looked over the menu.  I love tuna poke so the tuna poke roll was a must have, along with the softshell crab appetizer and another of their specialty rolls.  The server was incredibly nice and attentive.  She came by several times to fill up our water, and make sure we didn't need anything else.  I'd give that part of the experience 5 stars.

Now for the food.  The tuna poke roll had crushed Doritos on it, which was an unnecessary addition.  Plus they were stale and just stole from the taste of the fish.  The softshell crab, which I've had at other sushi restaurants, was bland and the mango salsa it came with was hardly salsa at all.  It was more a salad, sans lettuce.  Just large chunks of cucumber, tomato, mango, and red onion that had very little flavor.  

I think the biggest reason I gave this place only 2 stars was the price.  We had two rolls and an appetizer, without drinks, and walked out of the place for $50 after tip.  Hardly the price point I search for when it comes to so-so food.  Unfortunately, I don't see myself coming back to this place."}
{"text":"Not bad. It was ok. I'll probably come back to try other menu items. Nice restaurant, great location there inside Desert Ridge. Our Yelp check-in gave us free edamame."}
{"text":"The beer was cold, the service and sashimi were great. Got a free edamame for checking in with yelp. Overall I'm glad I decided to go to Nori instead of Kona. I'll be going back for sure."}
{"text":"Nice service and manager was nice to me and my family. We went to this one because the other Sushi nori in scottsdale treated me and family bad. I convinced them to give Sushi nori another shot at this location because I have not had a bad experience. They did and liked it. Hope they don't disappoint!"}
{"text":"We love Nori at Desert Ridge. Great happy hour! Great outdoor seating. Love the sushi and main dishes."}
{"text":"Nori is inside of the mall next to yardhouse.  Siri is almost useless in this area so dont trust her.

I tried several items: gyoza, tuna sashimi, green tea, tuna carpaccio, and a philly roll.

The gyoza was too soft and the sauce was a bit weak.  I would have liked more of a crunchy texture to the dumpling and some seasoning in the sauce.

The tuna sashimi was tough and didnt melt in my mouth as a good piece of tuna should.

The carpaccio was cold and wrapped around asparagus.  I prefer hot oil carpaccio but there were some nice flavors in this dish.

The philly roll was very average.  Nothing special but good.

After this first impression I would say this place is decent but I doubt I would come back or recommend it to others as there are far superior sushi places for the same price or less."}
{"text":"I ordered food from them on Jan 1st, 2016 at 6:42PM. The order was supposed to be delivered by 7:35PM, and it is now 8:32PM and no food has arrived. I called about 20 minutes ago and they said the driver would arrive within the next minute, but nobody has called or came to my door. 

I ordered from Nori Sushi several times previously with no issue, and the sushi is delicious from what I remember, but between the $5 delivery fee (to which I expect premium service if I have to pay that much for delivery with a minimum order amount) and the crappy delivery service, I will not being ordering from here again. I recommend that you don't either. Thoroughly upset.

EDIT: The food did eventually arrive at 8:40PM, but I must say, it was nowhere near as delicious as it was previously. It was actually some of the worst sushi I've had in Etobicoke, and by far the worst I have had all year. I have no idea what happened to this place, but STAY AWAY!"}
{"text":"Great sushi and friendly staff.  I have become a regular to the point where I can sit down and will have a Yamazaki served neat ready for me.

I generally get the Sushi Omakase (or the Chef Sashimi Platter according to their menu), but have sampled almost everything on the menu.

The green tea waffle is a **must eat** if you can fit it in your stomach.  Don't share it (you'll understand after your first bite)!"}
{"text":"No complaints and we'll go back again for further exploration.  The kitchen menu is pretty interesting.  I like a sushi place that has other items that are easy to peruse and choose.  We had the salmon with sweet corn and loved it.  Eager to work our way through the other kitchen items.  The sushi was fine;  it didn't blow my mind but it was very good and honestly, it's nice to have a sushi place right in the middle of it all.  This is a very welcome and classy addition to Desert Ridge, right by the theater, (and good riddance to lame old San Felipes.)"}
{"text":"This was the first sushi place I came to a couple months ago.  The menu is nice. It's in a great location.  I got the $40 sashimi platter. It an assortment that is picked out by the chef. It looked  great. I just felt like the fish was bland. The texture was appropriate, but the taste was just not quite there. This was the first time I had sashimi outside of Hawaii or California so I'm using that as my reason. The service was amazing. Good service, just by itself can make a dining experience fun."}
{"text":"Food isn't horrible, heard they have a high turnover rate, the underage servers may be indicative of that. Waited a while to be greeted, sat, and no one seemed to be concerned we were just sitting. Writing this as we wait for drinks....we may possibly be the worst table to serve (3 female servers who just worked all day at a busy breakfast restaurant, all we want is water and alcohol). Not to mention the hair in my dish, we're pretty laid back and whatever about that stuff, but the only reason I wrote this yelp is to share the picture of the server in his cell phone- that's the sh!t that pisses me off."}
{"text":"I read one of the reviews on here from someone saying this is the best maki sushi they have had in the valley and they have lived in Japan for 2 years. That's bull. I lived in japan for two years and this is nothing like traditional sushi. 1st. Sushi with rice on the outside is an American thing adopted by the Japanese for cheap revolving sushi bars in Japan. Secondly, the maki here is pressed way too hard especially the way nigiri is made here. Overcooked rice and no sushi making technique. Obviously just another hit and run spot if you're hungry. The guy behind the cutting board whom I will refuse to call a sushi chef was very unenthusiastic and constantly asked what we wanted with shit attitude like he didn't want to be at work. The ingredients are sweet in taste and I won't argue but it really isn't anything special. 

Plus I knew it was going to be shit when i saw the man take a honing steel to his yanagi which is ok i guess considering that it looked like a 10 dollar knife anyways. But what got me was the staff just sitting around even if it was slow. If you got time to lean you got time to clean, especially with a dirty sushi bar."}
{"text":"Been here a number of times now and one word to describe Nori Sushi is: WONDERFUL :)

This is my new favorite Sushi place in Phoenix.  Stumbled upon it a few months ago and been back frequently.  The toro melts in your mouth, so good!  I've tried 3 or 4 of their specialty rolls and my absolute favorite is the Sakana Trio Roll.  It is mouth-watering and has soft citrus filled boba on top - so unique!  Could tell the fish was fresh and top quality from the first bite.  Quality has been superb every time.  Everything is good from the fish to the service to the cleanliness to the location to the patio and the desserts.  I don't drink sake but I saw they have a huge selection too! 

Thank you Nori for bringing yummy sushi to our neighborhood.  Always pleasant."}
{"text":"Absolutely amazing place a must check out if you haven't already. All of the staff was very friendly and had an answer for exert question I had. The fish was very fresh and made promptly after I ordered. Great kids menu and awesome happy hour. Will be returning very soon for more sushi and drinks"}
{"text":"The first two times I went for the lunch special, service was slow but the sashimi was fairly good. The edamame was hot and well salted, an overall good experience. However the third time for the happy hour special was not. 
Service was extremely, extremely slow and servers were inattentive. The food was average in terms of taste, however portion sizes were ridiculously small. The entrees were the size of small appetizers. The tuna poke, listed under entrees was four dollops of finely diced tuna on a large plate with bits of watercress sprinkled around the plate. The rice was mealy and over cooked in all of the sushi - spicy salmon, salmon nigiri, sashimi choice, and crispy tuna - and rolls were heavily sauced with \"out of the bottle\" sauces. For the prices, the sauces shouldn't taste like the were poured straight out of a bottle of grocery store sauce. Not an experience I would ever repeat."}
{"text":"I loved Nori. It was my first time here.  We were immediately greeted and sat. Given, it was 230pm in the afternoon so there was no wait. 

I ordered a Tempura Bento Box. It included:
-Shrimp Tempura
-Vegetable Tempura
-White Rice
-Green salad
-Daily side (which was pork dumplings)
-Miso soup

I will say that I liked everything and ate all of it! Their tempura was very crispy. Their miso soup stood out to me because it had more ingredients than I've normally had in the past. YUM!

Others items that I tried off my friends plate was:
-Short back ribs
-Cucumber Roll 

The ribs were very tender and flavorful. The cucumber roll was crunchy and fresh. 

Our server, Jeanette, was awesome. She was kind and attended to our needs very promptly and accurately. 

Awesome service, great food, beautiful decoration. I would definitely return :)"}
{"text":"Joey at nori is the best!! Great service, great attitude, and great person!! Food was delicious as always. Thank you!"}
{"text":"I had originally left a very negative review about Nori because we had one of the worst restaurant experiences we've ever had there.
The owner got in touch with me immediately and discussed the issues with me. He was very helpful and genuinely concerned with the experience we had.

My wife and I went back there for the first time since we had the problem and it was like being at a totally different restaurant. The staff was awesome, the food was out very quickly and tasted amazing, everyone was attentive and caring. Exactly how a trip to a restaurant should be.
We couldn't have been happier. So thank you to the management that addressed our concerns and made obvious changes due to negative feedback. It was like night and day, and we can't wait to come back now."}
{"text":"Fabulous new Sushi Bar in Desert Ridge! Oishi So!!"}
{"text":"I was really disappointed the first time I tried this place. The sushi was just mediocre and the dessert was probably the worst I'd ever had. Decided to give it another try, and brought my little dog with me to sit on the patio. Was promptly turned away due to dogs on the patio being a \"health code violation.\" So my little dog and I left and went to Modern Margarita where they love and cater to dogs. Definitely done with Nori."}
{"text":"Yum, yum and yum.  It's hard to think of good sushi being nestled between Yard House and Dave & Busters but it is.  

Drinks were delicious - the Thai hot is the perfect combination of sweet and spicy with neither overpowering the other.  I do not like cilantro but the tiny little bit they sprinkle on top adds a little something-something.  

The salmon sashimi was delicious as were our rolls.  Husband can't handle spicy but we took a chance and ordered a few of the spicy rolls - he deemed them acceptable.  Rolls were creative, interesting and fresh.    

It's a bit on the spendy side but you're eating raw fish in the desert.  You should spend a little money.  :)"}
{"text":"I wish I was able to give a lesser rating than 1 star. I even created an account here just to write this review. I have been coming to Nori Sushi since it opened. Constantly giving this place a chance each time I go in hopes it will improve. 

My last straw was pulled on the weekend when I attended there with a few friends for dinner. They were not busy in the slightest. Two servers working and I am assuming adequate staff..

For $25.00 you get average food and absolute horrible service. The servers do not notify you if they do not have something that you ordered off the AYCE menu. There was only three of us there and we did not order a lot. We ordered a few things each time and we did not receive even half of them. Upon asking the server where the rest of our food is, they just gave us a dumb look and told us they do not have that at the moment. (Well, they should of said that the moment they noticed, right?) I mean, the food is average. It's not amazing and it's not that bad. The service is what kills the entire mood. These servers do not know the first thing about customer service and that saddens me given the fact that a lot of people in the Etobicoke area like sushi! I would rather drive an hour to Sushi Legend than drive 5 minutes to Nori. I suppose this place is about average if you are doing a la carte or takeout. However, dining in for AYCE is an absolute tragedy."}
{"text":"The wait staff was very prompt and friendly. I had the sea bass with a spicy salmon roll and both were fantastic. The spicy salmon was true cut up salmon and not a mix and the bass was moist and full of flavor. I recommend both."}
{"text":"This is my new place to go. The quality is dang good and compared to my old favorite spot RA-xxxxx I prefer to come here for my hangouts."}
{"text":"Came here for my son's birthday. We were a party of 4. First timers. Our servers name was Allie. She was sweet & very good at keeping up drink refills. Food & service were good. We all had different favorites. For the 4 of us the bill was about $80 & there were leftovers. Only downfalls were that it took a while to get the check & they don't do anything special for birthdays. 

Overall, good experience & we'd come again if in the area."}
{"text":"BEST sushi I've ever had. I sat at the sushi bar and the cooks were very attentive and polite. Overall great experience. Definitely recommend and will be back. I don't know my waitress's name but the cool was Ozzie."}
{"text":"This place is always empty so we try to give it business when we can. We brought our 6 year old and she brought pizza. It's never been a problem but they said she cannot eat it there. I wouldn't have had a problem but the waitress was rude and told us after we already placed our order. 

This is why the place is empty. End of story."}
{"text":"The sea bass was fantastic, hamachi really good and rolls very good. 5 stars for the quality, selection and speed. A little pricey especially for the portions, but it's sushi in the desert. Was just happy it was so delish."}
{"text":"Wow! I think this was the best sushi I've ever had and I'm a picky new yorker! It all tasted so fresh. We had the spicy tuna roll which had chunks of jalapeño and was the perfect amount of spicy! We also had the crunch roll and an ahi tuna roll that the server recommended which was amazing! Service was fast and friendly. The atmosphere was clean and classy. This will definitely be our new sushi spot here!"}
{"text":"One of the better restaurants in the land of chain restaurants (Desert Ridge).  Solid Service and delicious food.  I would compare the food to Ra Sushi but the atmosphere is more laid back and less stuffy!"}
{"text":"I've been here for lunch twice while in town for business. This sushi place is located in desert ridge- essentially the middle of nowhere. It's amazing that you can find such fresh fish in the middle of the desert! I ordered the lunch time sashimi special ($9.99). I was impressed. Big pieces of fish and it was fresh! Comes w a side if rice and miso soup. The service is pleasant and the bathrooms are clean. Overall great place to go grab some lunch!"}
{"text":"AmaZing new sushi for the Angus area. It's surprisingly tasty and varied. Great fusion in sushi types and quality. 

It is about time we have good sushi around here !!! 

So bring out your sticks and I pity the fool who ain't liking this sushi!"}
{"text":"We decided to try Nori for lunch on Mother's Day. We walked in and were seated right away.  We ordered the Seaweed Salad, Rainbow Roll, California Roll and the Baked U10 (Scallop Roll). The Baked U10 was good, but the sauce was a bit overwhelming and too mayo-y for my taste. I did like the big pieces of scallops they used on top though. It is a very filling roll. The other rolls were fine...pretty standard for sushi. 

They had a pretty good variety on the kids menu, which was nice for a change. My oldest son ordered the Yakisoba and was disappointed because he thought it was a soup dish, so we order the Tempura Udon for him instead. My picky youngest son had the Katsu and actually ate it all up. I wish I had known their meals came with Cali rolls, or I would not have ordered an extra roll. 

As part of their Mother's Day promotion, I received a free \"Mom-omsa\" and my choice of dessert at the end, which was Tempura green tea ice cream. Very nice touch to this special day. My family devoured the Tempura ice cream. Delish! 

Overall, the service was great. Our waitress and other staff were very nice as well. I would definitely go there again, perhaps on our next date night."}
{"text":"My menu had food stuck to it, so the hostess stood there at my table scrapping it off with her fingernail instead of just grabbing a clean menu.  And the food she scrapped off the menu was left on the table right in front of me until she came back many minutes later with my tea.  I'm not a neat freak but that was gross.

Only had some yakisoba which was pretty good.  Can't comment on their other dishes."}
{"text":"My lil sis is a frequent visitor of this spot and has tried almost everything on the menu. So when it came to suggesting a place to eat it was easy. I love sushi so I was totally open to try and new spot when I was visiting for the weekend. 

The ambiance was nice, inviting and very open. I was greeted by a lovely hostess who seated us right away. We opted to sit outside since it wasn't super hot yet. It was nice to talk, eat and people watch. 

Our server greeted us and took our drink order, we weren't very sure on what to order so we asked a few questions. She unfortunately didn't seem too knowledgeable on the drinks or what was or wasnt on the menu. Nonetheless we ordered some wine and a sparkling lychee. The lychee drink wasnt too sweet which was good but it didn't have a very prominent lychee taste, so that was a bit disappointing.  

We had a few dishes and just shared them. A couple recommendations that stood out the spicy, chili tofu. Delicious, it had a crunchy outer layer which was just right. The spicy sashimi salad was really good as well. The dressing was light and not too overwhelming with the fish. Yellowtail jalapeño, definitely try! Who doesn't like Yuzu sauce?!! 

To end your meal you must try the signature green tea waffle and ice cream. Sounded a lil different when they told me about it but I must admit, my curiosity paid off this time. Sooooooo good!!!!!!"}
{"text":"The sushi here is over priced and so~so~
Very mediocre~ 
If their price range was little lower maybe it's doable~~"}
{"text":"I have lived in the desert ridge area for quite some time now, and have always hoped that they would bring in a sushi restaurant that I can brag about. My friends and I went for lunch last week and can honestly say it was fantastic sushi with unbeatable happy hour prices. Highly recommend it."}
{"text":"After my husband had a bad experience, I had debated about coming to this place. But I decided to give them a chance and convinced him to come with me.  I liked this place, it is pretty cute.  Nothing fancy, but comfortable. The edamame is a no brainer, I am not sure anyone can mess this up, so it was good.   The rolls are nice.  I had one of the tempura ones, and besides being really tasty the presentation was really pretty.  I was on a crunchy mood.  It hit the spot.  Service was quick and amiable."}
{"text":"The atmosphere is ok but nothing special. We had a very nice waitress who was attentive and helpful. The sushi was ok. I had a spicy yellow tail roll and mackerel nigiri. Neither of these really stood out for me. I've had both of these things at other sushi places and have liked then much better. I may give this place another chance but I have other sushi places I enjoy more like Ari Sushi off Tatum and cave creek."}
{"text":"Amazing happy hour with appetizers and rolls from $3-$5 along with $3 beer and and saki. Sushi is very good, one of my favorites."}
{"text":"Delicious food. I wish they were a little more attentive considering how many staff members there were and how few tables were occupied. However, the staff was super friendly and accommodating. I also wish they had a few more specialty rolls and that there were more specialty rolls available during happy hour. Overall, it was a good experience and yummy food. Will be returning."}
{"text":"As I sit at Nori sushi on a Saturday night, people watching and taking myself out on a date... I figured I'd write my review. 

Let me start off by saying that damn I'm one good date! I mean, I picked Nori sushi... And their sushi is pretty bomb! This date went so well, I think there's gonna be a second one. Haha.

So I walked in, and was greeted by a super awesome waiter. It wasn't too busy and was told I'd be helped quickly... Well, I wasn't in a rush but cool. I walked inside and immediately another gentleman (who I found out later was actually the GM -- his name is Kevin) came over and was extremely friendly and hospitable and asked me about my night. Very genuine and kind. I asked if I could sit outside and he told me that I could even pick me own table... Yay! (My date with myself started off well).

Kevin then brought over a menu and asked me if I wanted something to drink. Not knowing what amazing drinks they had on their menu, I asked for a water. Kevin was hesitant to walk away and asked what kind of drink I'd like... So I gave him my usual response, \"surprise me\". He asked what my poison of choice was (tonight I decided on vodka), and he told me he'd have a drink for me. He brought me out a fancy shmansy martini (see pic I posted), and told me it was the \"Praying Mantis\" although he modified it to make it with vodka rather than gin. On a hot summer night in Phoenix, you GOTTA have a refreshing drink -- and Praying Mantis hit the spot! It was made with cucumber vodka (super refreshing), and some other yumminess; not to sweet either. (Order it! You won't be sorry.)

I couldn't decide on what kind of sushi I wanted so of course I asked Kevin what he recommended -- he said the Hamachi Fire roll. Done and done! 

**Side note: I also checked into Nori off Yelp and got a free edamame. Woohoo!!!**

While I waited for my sushi, I munched on steaming hot and fresh edamame and sipped on my fancy martini. 

Then my sushi roll came out... And wow! It was an explosion of flavors bite after bite! The sushi was so tender it melted in my mouth; and each piece had the perfect kick to it... Enough to add spice, but not to overpower the other flavors of the roll. So so good! 

As I was sitting by myself, Kevin came over and chit-chatted with me. I gotta say, it's nice to have management come and just say hello and get to know their customers just because -- not just when there's a complaint. It was so awesome to have Kevin come over and chat; it's nice to see that there still are genuine, humble people in the world nowadays. Thanks, Kevin, you made my night that much better! 

Overall, I really enjoyed Nori -- the customer service is above and beyond what I've experienced at other places around the valley, and the food is incredible! I will definitely be back again... And soon!"}
{"text":"Sit at the bar and ask for Dustin! Took my mom for her birthday on my second visit and He remembered my name, and made my mom feel like we were life long customers. Spectacular service - and the HH is so reasonably priced! I love 28 miles away but I will be visiting for HH over any other restaurant! Must try and I am not easily impressed!"}
{"text":"This place is only meh.  Considering all of the great reviews this place has, I have to question the taste buds of people trying this place.  I guess it's fine for rolls smothered with teriyaki sauce, all of those rolls tastes the same to me, but for sushi or sashimi, this place is pretty bland tasting.  I even had the lobster roll, which should taste lobster, but all I tasted again was the teriyaki sauce.  Given that though, the service was ok, and the location in the mall doesn't really help much for ambiance."}
{"text":"I absolutely loved this sushi place.  We sat at the sushi bar and watched them make the most delicious sushi!!!"}
{"text":"I've always been a fan and been coming here since their opening; however, the food has been mediocre over the last year.  It's typically my goto place before or after a movie.  From now on I would consider dining somewhere else before heading back here."}
{"text":"This is a top shelf dining experience. The food is very good and presented well. Just walked through the upscale shopping mall and found this restaurant. Will definitely eat here again when I'm in the Phoenix area. Modern decor and super friendly staff."}
{"text":"Chocolate lava cake is so good.  Thank you Elizabeth, your smile is so lovely. You made father-daughter day so enjoyable."}
{"text":"Just went there for dinner. I had the \"all you can eat.\" The place is very clean and the food is fresh and tasty. The service is fast and friendly. The best part is that it is located beside The Beer Store and they will give you a 10% discount if you pay with cash. That means you can buy beer, get some cash back, and enjoy some awesome sushi. I will be coming back."}
{"text":"Honestly the first time I saw this new restaurant, hardly anyone was inside, I was hesitant to try it. I'm so glad we did! This place is less than a year old so they were just getting started.  In my opinion they have an excellent happy hour, drink menu and great sushi. We usually get the chicken skewers, sushi, potstickers and Sangria. Their lunch deals during the week are filling, fresh and a good deal.  They offer lunch combos such as a Teriyaki Chicken, miso soup, rice, potstickers and salad...for about $8. The waitstaff has always been professional and sweet to us.  It is now part of our regular jaunts at Desert Ridge.

Check in deal: free edamame!"}
{"text":"This is a decent sized place with great service, awesome drinks and a sushi menu that doesn't make you scratch your head. I will be visiting this place monthly!"}
{"text":"My boyfriend and I like to think of ourselves as \"sushi connoisseurs\", as we satisfy our raw fish cravings at least 2-3 times per week.  Nori has officially made our Top 3 of places to go when we need our fix. 

It's beautiful, clean, and contemporary inside and the service at the sushi bar was excellent. 

The Sakana Trio with the citrus boba is our absolute favorite.  Yum!  The Hamachi Fire and Poke Poki are amazing.  The Sake Sake wasn't our favorite, but we think that's because of the pickled jalapeño. The salmon sashimi is really fresh-tasting and we love that it's served extra cold on ice. Outside of sushi, the Grilled Prawn and Mango salad is a must. 

It's harder for \"non-kid friendly\" places in Desert Ridge, but we're hopeful this place will stay around!"}
{"text":"Nori is another great sushi restaurant.  Food here is plated nicely, and quality is always exceptional.  The menu offers some traditional Japanese noodle dishes which is really nice to see.  I've never had to return anything I've ordered here.  The tuna tataki salad is incredible.  The drink prices seem a little high if you're not eating at happy hour, but the food makes up for it.  Great place to satisfy the sushi craving if shopping in desert ridge."}
{"text":"So we've frequented Nori quite a few times and have had some issues, but none to the level we had this last week. When we entered the hostess was on her phone with what appeared to be an IT problem but after about 1 minute she still had not acknowledged our existence. I work with the public so I totally get when you're on the phone and a customer approaches, but typically I make eye contact and say \"be with you in a minute\"..... that did not happen here. Ok no biggie. We were greeted by a nice waitress and when my husband asked if they had any Japanese whiskey she said she would have to check. She came back about 6 minutes later to say they only had some scotch..... I then inquired about their yelp check in for a free edamame and she said she had never heard of that (even though I showed her on my phone) and she had to ask her manager. She again left and this time didn't come back for another 8 minutes. By this point I had put a timer on my phone just to see how long it would take, once it hit 8 minutes I'd had enough and we got up and left. If it took that long to just get seated and not even get our drinks, I wasn't about to test how long it would take to actually order our food and receive it. Mind you, there were only 2 other patrons inside the restaurant at the sushi bar and 2 chefs, 2 servers and a few busers.... so they were clearly not shortstaffed so I have no clue why it took so long and there was so much confusion. We've been here a few times before and in the past we have not had the friendliest encounters with their hostesses and one time I ordered a salad to go and when I got home a green bug climbed out of it. I took a pic and went back. Now I cannot totally blame Nori for this since I know bugs can get in food sometimes.... But last week was the final straw. They need to get their act together with how to treat customers.  Their food in the past has been decent but nothing exceptional. We ended up going to Yard House where we were happily greater by their hostess and had a wonderful experience!!"}
{"text":"Really fresh delicious fish. I was here for lunch today and had the Sakana Trio Roll and 2 pc salmon nigiri. The salmon was delicious and completely hit the spot. The roll was so good and very filling! Service was fast and I was in and out like I wanted to be. I will definitely be back!"}
{"text":"Gave nori nother chance.. Way better experience this time. Good enough that I removed my not so shining review. Sushimi presentation was cool.  Noodle soup was  full of big noodles and lots of broth. Close to movies. Little pricey butt tasty. Go cubs! Ya never know.."}
{"text":"So-so pseudo-Japanese fare in Desert Ridge.  It's pretty hard to find a decent restaurant in the Desert Ridge area. I often feel like I'm at a theme park and I only have burgers, fries and pizza to choose from in the area.  Nori will satisfy the craving but it's just meh as far as Japanese/sushi go.  I guess they consider themselves fusion which is probably true.  Their tempura udon actually was pretty good until I saw all of the bell peppers in there.  While I know we're in AZ, it was just an unusual touch and totally twisted the flavor profile of broth that I'm used to having with my udon. No umami, just tasted like a pizza!
At least this place wasn't loud like Kona Grill, so I'd rather go here.  I just wish these places would have combo plates....where you choose two items and get a soup and salad...bento box style.  I hate paying so much for inferior Japaense food!"}
{"text":"Friday 11/14/2015 My wife called Nori's roughly around 6:00 PM and asked if they had room for five. They said yes so we went over. We were only a few minutes away so I was a little surprised  when we got there the hostess suddenly was not sure she had a table for five so she looked around and found a very tight corner for us in the back. So we sat down and started out wait process for some one to come over and acknowledge us. Roughly around ten minutes went by still no one. My wife had liked this place before so I decided to be patient. My wife then excused herself to go to the restroom only to find the women's restroom had an out of order sign on the door. I would think that a restaurant in Desert Ridge would make sure they had working facilities on a busy Friday night. She came back so we continued to wait. No less than six servers walked back and forth but not one took the time to let us know what is going on. After twenty minutes with still no acknowledgement by anyone, my wife who initially liked the place decided it was time to go. As we left one of the other hostesses said goodbye as if we had some wonderful time. I think that is adding insult to injury. I am not a restaurant snob but I have been in customer service for over 30 years so I know good customer service when I see it and when I don't. I definitely did not see it at Nori's and will not be returnin0 because of that. I can't comment on the food because it never got to that point"}
{"text":"An excellent addition to the Desert Ridge array of unique and chain restaurants.  This is a welcome change from the typical bar and greasy food you find in the surrounding area.  We have been here a number of times and we do keep coming back.  It is a good local sushi joint and the ambiance is also a plus.  Great outdoor seating and inviting indoor decor.  

If you go, I would recommend HH as a lot of their small bites and alcohol is discounted.  However, the food is decent enough that I would not mind paying full price for a few items. 

Try the sweet and sour Tofu.... Sounds gross to someone who doesn't regularly eat tofu, but trust me, we really like it.  Edamame is good and not overdone.  Spicy yellowtail and salmon rolls are also great.  The only non-sushi thing we had was the chicken yakisoba and we enjoyed that as well.  

Service is a bit on the slow side at times, but they are extremely polite and accommodating.  A solid 4-4.5 stars!"}
{"text":"Best sushi I've had in awhile. Amazing quality! Highly recommend this place to any sushi lover."}
{"text":"The sushi was good, near the top against the other AZ sushi restaurants we've eaten at over the years.  We sat outside on a pleasant night so that was enjoyable.  The menu is good, we had a few interesting rolls (Poke Poki the best) and salmon and yellowtail sashimi.  Miso soup was good, edamame was good.  Lava cake dessert was killer.  The best part of all was the service.  Our server was super nice and without my prompting came and filled my sake glass all night.  Thanks for preserving my good luck and getting me loaded!"}
{"text":"Pretty mediocore sushi at premium prices. While the service was great, I wasn't impressed by the food."}
{"text":"My son was visiting and I took him here for lunch.  Food is very good but their menu, I think, is limited and very pricey.  I've been there for happy  hour also, and its pretty good for drinks and appetizers.  If I were to go for sushi, I would consider another place because of the limited menu and prices."}
{"text":"Amazing and fresh sushi with cozy atmosphere and attentive staff. We Love this place. Don't forget to try the signature green tea waffle!"}
{"text":"Chose this spot in a bind when I had to find a nearby option to the hotel (JW Marriot Desert Ridge).  I was pleasantly surprised at how good this place was and once again, Yelp did me right.

Everything we ordered was delicious.  The ama-ebi was fresh (which is always a concern of mine when I'm in the desert).  The winner was hands-down the black cod.  It was amazingly prepared with sweet sticky rice, and fantastic combination.  The green tea mousse desert wasn't too shabby either.  The service was friendly.  The space was clean and new.

If I'm around here again, I'd definitely re-visit."}
{"text":"Had it for my cousins birthday, we ordered in. I plan on visiting soon based on the all you can eat sushi.  Loved the goshi ,Tuna roll,salmon roll and green dragon... The delivery was pretty fast especially since we are  no where near the restaurant. Generous portion sizes compared to what I've experienced in the past(at other sushi places)"}
{"text":"I'm not sure why , maybe it's bc of there location in the mall but there prices are the most expensive I ever had . 
We got there on HAPPY HOUR , we ordered 2 rolls each and a drink ( we got free Edamame  check in yelp) 
The service was really nice and fast , the place is clean , the table are a little bit to close to each other you can hear what everyone are talking about . 
I think this place can do good if they will understand the marker . THERE IS NO WAY TO END UP PAYING $80 for sushi for 2 rolls and a drink . 
Even if I like the place , even if I'm a bilinear , even if I eat only sushi I can't see why I should pay that much 
Find other place to go too"}
{"text":"So disappointed. Just to be clear, the sushi and shashimi were spot on! The server was professional and the beer prices in the afternoon was great! I sat at the sushi bar and my server introduced me to Chef Daniel. Went downhill from there. When I was ready to order, I simply spoke up. But Chef Daniel seemed preoccupied even though there was only one other table occupied. He finally acknowdged me asking I was ready to order. I attempted to tell him my order but kept asking me to \"speak up\". I carefully read the menu items I wanted but three times he quoted something different. So I showed him the menu. Should he know that salt-water eel is the same as sea eel? Guess not. As I sat there confused, I ate some then asked for more ginger. He heard me fine that time. So now I am convinced that he was shading me because of my hearing aids. The whole experience was awkward. I suggest you not eat here, there is a perfectly good sushi place right across the street, to the West. If not, I encourage you to not sit at the Sushi bar, especially if you too have some sort of handicap"}
{"text":"I think this place gets the crown for best sushi in North Phoenix.  All the fish is really fresh, and most of the chefs are Japanese, which is a welcomed site in my opinion.  Their lobster tempura has great flavor, the anago (sea eel) is a definite must try, the ama ebi (sweet shrimp) is one of the best I've had in AZ, and the maguro (ahi) is ruby red.  Can't wait to go back!"}
{"text":"As a California native who visits Japan annually, I know that good sushi in AZ is hard to find. They probably have the best fresh fish selection in the entire valley. The salmon nigiri is spot on, and offer fantastic fatty tuna (which true sushi connoisseurs know is a rare treat). The fatty tuna sells out, so get there as early as possible so you don't miss out. 

The ambiance is okay-ish. The outdoor tables are kind of crammed together, but it's not a huge restaurant and they're really popular. It gets pretty noisy on the weekends, so taking my hard-of-hearing grandma there for dinner wasn't the best idea. 

It's a great choice for a post-movie dinner date, but be sure to make reservations since there is always a wait. Great fish though, so it's often worth it!"}
{"text":"Great location, comfortable, clean, and we'll decorated.... The food was fantastic! High quality, we'll made rolls.  Soy was high quality, the tea flavorful, and the miso was best I've had.  I'll be back!"}
{"text":"My server was nice enoug but so soft-spoken that I couldn't understand her. Also, my nigiri came out as sashimi. It was corrected quickly enough and tasted amazing, however. Overall, great sushi, but not the best service."}
{"text":"A bit on the fusion side of true sushi, but tasty and creative. We came for lunch on a weekday. There was no wait, staff was helpful and attentive. The food warrants a 4 star rating, but the service took it to the 5 stars. One of our three dishes took a long time to come out. While we noticed, we didn't say anything. The manager came out to acknowledge the delay, apologized, and brought us a very yummy dessert.

Great experience! These guys care about their food and service!"}
{"text":"If there was a negative star rating that would be the most appropriate.  If you like special rolls or ask for no rice don't come here. We heard the sushi \"chef\" (right) complaining about having to make a roll with no rice as he couldn't \"keep it together.\"  Then said some other things that were rude while the manager was standing next to him.  This is a true sushi place? Really - wrong chef today - we won't be back and for the price service and quality is no where near standard - pass --- !! 
The \"manager\" contacted me after this review oblivious of any situation or how \"his\" operations run.  Now you should know why this so-called sushi restaurant is empty most of the time - Brent Pitts, you need to perhaps go back to MANAGEMENT 101.  Again,, folks. Pass on this place. Scroll down and review Tracie W's review.... Nothing has changed perhaps that may be one of the issues...."}
{"text":"Quality of sushi during a recent luncheon was fresh and delicious. Tried the halibut and snapper and just had to have a couple more orders of the same, once tasted."}
{"text":"This place is amazing. The sushi is always so fresh, and the service is top notch. Make sure to order the pickled wasabi for your sushi. It's amazing! Great place for date night!"}
{"text":"This is a good little sushi spot. It's a bit expensive but compared to other sushi places this is one of the better places. Their rolls are usually pretty good, they have a really good Green Tea Creme Brûlée. Their fish tastes pretty fresh as well especially for being in the middle of the desert lol."}
{"text":"I'm back and delighted to retry the drink that was unavailable from my last visit. The vibe is terrific and the bartender Chris is very engaging. There is of course no doubt the food will be excellent."}
{"text":"I usually come to Nori Sushi for happy hour or before a movie at AMC.  The patio is great place to sit for ambiance and people watching, but if there is live music playing it can get really loud.  The service has always been really friendly and I've never had to wait for a table.  My favorite things on the menu are the garlic edamame, spicy tuna roll, and California roll.  I think the best time to go is for happy hour during the week and it could be good for groups up to 8 people.  Parking is really easy and it's easy to find."}
{"text":"I would give zero stars if I could, however, the lowest amount possible is a solid single star. Arrived here on a busy Saturday night at the Desert Ridge shopping center, but Niro appeared to have quite a few open tables inside the dining area...so naturally thinking it was a good decision to eat here due to no wait time, we entered and were sat immediately...and that's the highlight of this experience. There were servers and busers all over the restaurant and we were walked passed by numerous of the aforementioned employees with no one stopping. We waited 10 minutes, mind you as we watched all other tables get served, until I flagged down a buser or server and asked if we could put our drink orders in. I was told he was not our server and would get ours...approximately 10 more minutes pass and nothing...at that point we gathered our stuff and left the restaurant. We never got to try the food so I cannot review that, all I can review is the poor service. We ended up getting back in the car and drove about 10 minutes away to \"Ohya Sushi\" which I would highly recommend."}
{"text":"We must have walked in right as it opened - always a bit nervous about an empty sushi place...BUT. Within a few minutes they were full - and it was Tuesday!  We checked in on Yelp and received free edamame (not valid on spicy - which the server did take the time to tell us).  Lollipops were VERY good.   Shared lollipops along with two other rolls and we were full.  Nice drinks - friend had the craft manhattan and I had a nice martini.  

Great food and service and perfect ambiance (noise and pace of meal) to catch up with a good friend."}
{"text":"Unexpectedly amazing!  The location is good but the food and service is consistently great.   Being new to sushi, I like it when the server is friendly and offers helpful hints asking us what we like.   These people take care of their guest and the server checked on us to see how we liked out first few bites.   We loved it, but it was great knowing they were on top of checking.

In Desert Ridge they could be probably be average and stay busy, but they raise the bar for other places.   Will definitely return.  

(P.S.  don't forget to check-in for the edamame app)"}
{"text":"Awesome spot with fantastic clean fresh sushi! Nestled inside the desert ridge mall I discovered this spot while my niece was having her Bday at wishing Well next door. We at down the staff was extremely helpful, friendly and attentive! The waiter recommended the JJAM-PONG noodle soup and let me tell you, it is the BOMB!! I Highly recommend this place!!"}
{"text":"New to Phoenix, transplant from Pittsburgh, PA... LOVE this place. Happy Hour from 4-6pm has great selection of Sushi, appetizers, and drinks..enough for dinner. The service is good and the atmosphere is nice. You can dine inside or outside while watching the courtyard. 
This is now my go to place... Enjoy"}
{"text":"fresh sushi. Great service. try the pyong yang (sp) its a seafood soup dish with awesome flavors. Also, you must have the lobster tempura. It has an amazing flavor combination."}
{"text":"Being that I was born and raised near the ocean in Japan until teenage years spoiled me and I've come to have a very high expectations especially from a restaurant with good reviews from fellow Yelpers. Well Nori didn't disappoint. The way I \"rate\" my sushi is by trying out scallop and Ikura Nigiri. Scallop's freshness is difficult hide when it's served solo on a rice. And Ilura speaks for itself just by how they look. Nori' scallop and Ikira nigiri passed with flying colors! I'm so ecstatic to find a sushi place so close by!"}
{"text":"Well, here is the five star.  I had a perfect experience at Nori Sushi.  Being a Yelper, I look at things from a wide eyed lens and try to find something that appeals to everyone.

The sushi in this restaurant was amazing.  Service was fast.  Staff, including manager, were genuinely kind and wanted us to have a good experience.

The rolls were delicious but let me talk about the ahi salad which was true art contained in a delicious bowl.  Fresh and satisfying while being light and, well, perfect.

If you have room, please try the green tea waffle.  It was so pretty and so decadent.  

Thanks Nori Sushi.  So glad you have a California location so I can go back again and again."}
{"text":"Love, love, love this place. Great atmosphere, friendly staff, great food, convenient location. We've been coming here the last few months and can't get enough of it. It's a good atmosphere for a families or even a date night. I would definitely recommend a few things: Lobster Tempura (amazing), although it will take longer to come out, but it's not a long wait and certainly worth it. Also, the Nori Crunchy Roll, the edamame with Garlic Chili sauce and the red sangria. But everything else is pretty great, too. If you're in the area (or if you're not), it's definitely worth checking out."}
{"text":"Best sushi in the valley! They have great food that is always presented in an artistic way. The sushi is extremely fresh. One of my favorite rolls is the lobster roll. For dessert don't miss the green tea waffle(with vanilla gelato.) It is absolutely amazing! Honestly there probably isn't a bad thing you can order on the menu"}
{"text":"My first impression when I walk in the place is very open, spacious. There's a half circle bar with a big screen TV to the left by the entrance. The place wasn't too busy when we were there although it was still early for dinner. 
It seems like most Sushi places I go the Happy Hour menu mostly offer deep fried stuff and this place is no exception. We started with Edamame (free with Yelp check-in) it was little too salty as they were putting too much Kosher salt. Then we had a small Hot Sake for just $2. Crunchy Roll was normal nothing special to make me wow. Potato Croquette was the only one that I like out of all that we ordered. It is crunchy outside and soft inside with mashed potatoes taste like. Sweet & Chili Tofu was good with the sweet and chili sauce, but if they use the soft instead firm tofu that might be taste a lot better."}
{"text":"Wow!! Unbelievable food, seafood pancake, crab cakes, Yakisoba - best ever!! Mango mochi ice cream to top it all!! will be back soon. Please stay this way!"}
{"text":"Udon was amazing... sushi was pretty good. 
Off the menu Vegas roll was pricey for the quality. 

Servers were horrible. Waited 15 minutes to order, no water in our glasses throughout the meal. Waitress was nowhere to be found yet there were several walking around aimlessly or standing with their trays doing nothing. Server could not recommend anything on the menu and when questioned about ingredients (avoiding a food allergy) she had no idea what was in it and didn't offer to find out. Midway through the meal we had to ask another server for food and she looked like we asked her to kill someone - like she couldn't believe we asked her for help.... well our waitress was nowhere to be found. Not impressed. 


Will probably come back for the food, but the servers needs some major training. Especially for the price point I shouldn't feel like I'm \"bugging\" you to order more food."}
{"text":"Clean modern resto in the Desert Ridge Market Place.  The sushi was very good and the service was friendly and helpful.  We enjoyed the crunch roll, the rainbow roll, and eel avocado roll.  I'm not doing sushi at the moment and chose the salmon entree.  Really well-cooked and served with a sweet corn sauce over veg.  Hit the spot.  They have a pretty extensive bar menu.  Beer, wines, fun cocktails.  Good choice if you are in the area."}
{"text":"Great sushi. Friendly staff. And a really cool shopping center. I definitely would recommend dropping in. We sat at the bar and enjoyed watching the chefs create our delicious rolls."}
{"text":"Now, this turned into a GREAT experience! I stopped for Happy Hour. Good Choice! $3 Garlic Edamame. Really tasted awesome! 

The they offer several rolls at Happy Hour for $4 each. Rolled right and mighty darn delicious may I add. I asked for a taste of the house wine, I never do that, and to my surprise it was super tolerable. My friend scoffed until I have him a taste. Guess what he drank? $5 a pop.

Service was excellent and the patio is a fantastic setting. I hate to say it but everything was better than our staple; Kona Grill. Surprised to say the least! #rebelfoodandwine #nori

Phil and I both walked away saying that this is a new front runner for Happy Hour for us. I had a Cali and a  Crunchy Crab roll... wonderful. Check them out. Lots to do here and a water feature and seating for the kids to good around in. There are theatres too. Eat, catch a movie, shop or get wet (water feature). Come on guys! Enjoy!

#irishcatv2 #vinosquared #vino2 #vino2ultimate #rebelfoodandwine
#norisushi #jimsboisset"}
{"text":"This place is very cool! I love the desert ridge spot, they keep the large glass garage door open so you can hear the live bands, which is fun for a dinner date. The miso soup was good, the edamame was okay. We had the double dragon roll (delicious), the roll with the citrus BOBA on it (forgot the name, but this was yummy as well) and I forgot the name of the last one, but it has a shrimp tempura in the middle, that one was good too. 

The service was outstanding, our waitress was very sweet and constantly checked to make sure we had everything we needed.

The drinks were just okay, a little pricey, but that was to be expected. 

Overall, 4/5 stars - will definitely be visiting again - excited to try their happy hour!"}
{"text":"Ordered the black dragon, my go to sushi, and it really hit my sushi craving. The fish to rice ration were perfect but the roll kept falling apart every time I picked it up. Got spicy mayo on the side and it was actually spicy, unlike other places. Also was disappointed that they didn't serve any ginger and wasabi though"}
{"text":"A generous 6 oz portion of salmon in the $8 bento box. It came with miso soup, was served over sauteed vegetables (zucchini/squash), rice, and 2 gyoza. I've only been here once but I will definitely return. I've got my eye on a $15 sushi roll and some fascinating dessert options like a green tea waffle."}
{"text":"So goood and our hostess/server was super nice and i appreciated her suggestions! Pokey pokey and hamachi fire i think it was... try itttt"}
{"text":"Excellent food and the fastest service I've ever had. When I'm in the west end I'll definitely be back for more. We did the lunch all you can eat and tried a bit of everything. Very happy with the food and services."}
{"text":"I had a really bad experience tonight!!! I ordered food from there and one of my plate I received had a long hair! I called them, and they refused to replace the plate or to refund...  and they hung up on me!!! Really bad service!! I will never order from that place again and I suggest you to do the same!!!"}
{"text":"Really good all you can eat sushi place!  Not much pickens in Etobicoke but this place is definitely a must!  Closest General Tao chicken to the original that I've had.  Beef Teriyaki sushi is amazing as are the crab rolls"}
{"text":"The restaurant is very nicely laid out. It has an open feeling: something that I place a premium on. 
On a Friday evening it was not very busy. Many tables were open but, dining solo, I chose to sit at the sushi bar. 
I must have waited for at least 10 minutes before one of the sushi chefs, feeling sorry for me, asked if I needed a menu. You bet Jose. 
He beckoned another person who listesssly dropped a menu in front of me. But alas no beverage menu. OMG, now I have to ask again. I did and I was rewarded with a beverage menu. 
From hereon it gets better. 
The sashimi was good but much overpriced. 
The sushi chefs were friendly and you felt they were on your side. What a relief!
In summary, the food was not that exceptional that I would return to tolerate the less than mediocre service. 
Sayonara!

Earlier today, several moons after my original review above, I sat at the sushi counter with high expectations based on my earlier visit. Alas!!!!
Words from a famous song by Rod Stewart came to mind: \"first cut is the deepest\". With respect I beg to disagree!!!
I am lowering the rating from 4 stars to 2. Why?
The service continues to be horrific!!!!
But more importantly, the quality of the fish today was way under par. The tuna was tasteless! Almost felt that it was synthetic!!
The snapper was good, but the yellowtail was mediocre. 
Combine this with lethargic service and one becomes passionate about looking for a new place for sashimi.
In all fairness, the chef was apologetic but it was not enough to overcome the disappointment of shelling out $60 on a meal that, I hope, is less traveled by others!
What a shame!!!!"}
{"text":"(Lyrics - Lorde - Royals)

I've love to eat my sushi extra fresh
I sink my teeth in nigiris by the movies (AMC Theater)
And I'm very proud of my reviews
In the Desert Ridge, my postings to envy

But everybody's like
Bo Bites
Yelping
Diamonds stars on your reviews
Food Porn
Reviews
Readers on my lyrics

We all care, we caught up in your food affairs!

And let's all go to Nori (Sushi)
Asian Kitchen for lunch
That kind of thought is just for us, we crave a different kind of brunch
And let's all go to Nori (Sushi)
Asian Kitchen for some beef
And Bo Bites we'll eat, we'll eat, we'll eat
Let me taste that Sushi

I like this place.  Nestle nicely in the heart of Desert Ridge Marketplace, this little Asian eatery is a nice treat away from your chain restaurants littered all over this area!

My mentor and I ordered the; Shrimp Katsu Burger, Nigiri Select, and Galbi Short Ribs.  Yeah it was a lot of food and very inexpensive!  The Katsu Burger was unique, it was like a crab cake breaded in panko and layered with the Nori BBQ and honey mustard dressing.  I like the texture; crunchy and savory at the same time.  However, I would like to disregard the hamburger bun; maybe a lettuce wrap to make it lighter since it's already a heavy dish.  The Nigiri Select was a delight for only $10; I'm in!  Great tasting and great price.  I wasn't too impress with the Galbi Short Ribs since they were very fatty.  Maybe it's supposed to be that way, but I didn't care for it. 

The place itself is very modern and organic looking.  Sleek, polished and appealing in my opinion

Overall, a nice experience and definitely a place I can come back to for drinks and hopefully more lunch time. - Enjoy!"}
{"text":"I have a sushi problem. I can't even say I crave it at this point because it's constant! It would be like saying I crave air- I need it! In the last few years I have been to Nori Sushi probably 1000 times and it's consistently fresh and delicious. I was caught in a downpour this afternoon while doing some shopping at Desert Ridge and it was the perfect excuse to treat myself to some lunch.

Since it looked like a scene from the cinematic masterpiece Sharknado outside, I was the only person there. I shimmied my way up to the bar and was greeted quickly by the bartender. She made a great recommendation on Sake and I'm glad I listened to her and ordered the Mio sake that was not on the menu. Fresh and bubbly!

For lunch I started out with quail egg and yellowtail. Their quail egg was some of the best I've had, and I get it everywhere. Perfectly spicy and flavorful. The yellowtail was good- a pretty basic cut of fish. Next was the Poke bowl. A generous serving of Ahi Tuna and sticky rice. Add a bit of Poke sauce, some avocado, wasabi and voila! Party in your mouth! Everything tasted fresh and great. My only complaint is that I wish I could have options for more ingredients in the bowl. This was very basic. But did the job. 

In the past I've had just about everything. I would highly recommend their Toro, Spicy Sashimi Salad, Tempura Udon, Gyoza, and Crispy Green Tea Waffle for dessert!"}
{"text":"Visited the establishment yesterday.  Service and food quality exceeded my expectations.  Nori Sushi has a Happy Hour from 3-6 (correct me if I'm wrong) where you can get 1/2 price drinks."}
{"text":"Came here for lunch the other day, well actually I was brought here for lunch. It wasn't my choice. 

Located at the Desert Ridge, this restaurant is near the AMC theater, so many people are around, I thought it would be a good place for people watch.

They ordered sashimi and a couple of rolls for appetizer for a group of share. Sashimi was served in a nice presentation. Quality of fish wasn't bad at all but I had them better at a nearby sushi restaurant. 

I ordered sushi plate for lunch. 7 pcs came with an order and it was $15. They added rice inside the egg, I thought that was interesting.  Lunch comes with miso soup, they did good with dashi but mushroom sort of ruined it. 

Service was a bit slow side. Well, sometimes too fast, she wanted to clear plates before we finished. It was business lunch, and we often paused eating to discuss, she thought we finished eating.

I wouldn't expect anything authentic here. Good place to come for people watching from patio seats."}
{"text":"Love this place. Had a shrimp advocado roll. It was so fresh and just tasted awesome.
Love the bartender, they have speciality drinks that are to die for.
The drink with the habanero infused tequila is great
The bartender at night makes an awesome 'Running Naked'"}
{"text":"Not an official review but omg I had a ball at Will's expense...ty for entertaining us. 

It was a,great night. 

Kameran"}
{"text":"stopped here for drinks. Did not know this place existed. The bartender was great. Gave my niece a free drink for her 21st. We will be back soon for dinner. Great customer service."}
{"text":"Live in the area and like to go to this place for dinner on occasion.  The last time I got the Katsu and it was good. The portion is a little small though. The service was excellent and our server was funny and made jokes throughout the night.  The lava cake is amazing. Definitely give that a try."}
{"text":"La salade étais meilleur que les sushis... sa vous donne un avis!!! Et contrairement au place de bon sushi ou on retrouve cette sauce soya légèrement sucrée ce qui complète bien les sushi... Celle-ce étais trop salée déçu!!!"}
{"text":"The prices are far too high for the small portion of food you get. Ive been to much better sushi restaurants for far less cost. The restaurant is only a quarter full and I still barely received service."}
{"text":"We were looking for an outdoor dining on a Sunday evening and found Nori Sushi at the Market Place.  When we arrived we were promptly seated with the menu; however, after waiting for a server for a while I had to ask a busboy to send someone to us.   The place was pretty empty at the time,

Started off with fried calamari, which was tasty but they were very tiny.  Good miso soup.  Ahi poke was fresh and had good flavor.  Spicy salmon was very good.   Hamachi sashimi was okay.   Good service."}
{"text":"Enjoyed eating here last night with my husband and some friends.
They have this really great vegetable tempura- they shred the veggies and mix them in little bird nests.
I only gave 4 stars bc I ordered a crunchy roll and the serving was adequate. Ordered an eel avocado roll and it was less then impressive- very skimpy.
Overall, the sushi was decent and would try it again- maybe happy hour next time"}
{"text":"I've avoided this place for years but a friend told me they had upped their game.  I cautiously went there for lunch.  They have decent lunch & bento specials.  I went there for dinner and could easily get a spot at the sushi bar but the patio was busy. I was happy to see the bizarre rolls are gone.  The fish is pretty fresh.  I saw them break down a full yellow tail and then cut it up and serve it to me right there - nice touch.  I was also pleasantly surprised to see Toro on the menu - bummed that they said sold out.  Credit where credit is due - they improved their food and lasted a lot longer than I thought they would."}
{"text":"Sure, it's out of my normal 3 mile radius, but having dinner with girlfriends is always worth a bit of a drive...

When my friends that live in the Desert Ridge area suggested we meet at Nori, I was hesitant.  Sushi in AZ can be hit or miss, so I of course checked Yelp before committing... I was pleasantly surprised to see so many positive reviews.  And I'm proud to say that yelpers didn't steer me wrong! 

I made my way to Nori for a little girls' dinner last night with three friends.  It was a beautiful evening, so we sat outside... and while our waitress wasn't the best (I think she was new), the atmosphere, food, drinks, and company made it a very positive experience!

I checked in on Yelp to find a check-in offer for a free edamame as their check-in offer... thanks for that!  We started by sharing our edamame and ordering drinks.  Two of us had wine and the other two had the Asian \"Pear\" Adise signature cocktail.  We then proceeded to share a couple of seaweed salads and lot of sushi including the following:

-salmon nigiri
-spicy scallop handroll
-soft shell crab roll
-yellowtail and avocado roll
-ahi tuna tataki special roll
-hamachi fire special roll
-saki saki special roll
-poke poki special roll

And then we had a crispy green tea waffle for dessert!

Yes, it was a feast!

I didn't take a bite of anything I didn't like, but the favorite of the table was the poke poki roll!  The dessert was pretty tasty too.

I'm told by my friends that the noodle dishes are pretty satisfying also, but I admit... when I return, it will be hard for me to order anything but sushi.

Nice to have another quality sushi choice here in the Valley... hopefully they will improve their service in due time as well!"}
{"text":"I have lived in the Desert Ridge area for 10 years now and have witnessed what seems like hundreds of sushi places come and go there.As a result and as a sushi lover I have a tumultuous relationship with Desert Ridge. Its the hopeless romantic in me that walked into Nori, like so many places before her, with an open mind and a desire to like it  like I had done so many times before at DR. My group sat at the bar and engaged in conversation with the bartender who for the life of me name I cannot remember but he was an awesome guy. Engaging, genuine, definitely not the forced small talk type conversation you get at a lot of places. It was happy hour so we got a few sushi rills and some chicken skewers. The sushi was great and fresh, not the best sushi Ive had but pretty close. What set this place apart for me and bumped it from 4 stars to 5 was the service. The bartender walked up to us and gave us a free salmon roll to try, then about 10 minutes later he asked if we wanted to try some drinks he's been working on. Overall one of the best experiences I've had with customer service. Very glad this place is here and I pray to Zeus it sticks around to beat Malee's record. Remember Malee's?"}
{"text":"Quality and tasteful dishes presented elegantly.  Seafood imported from overseas. We tried big eye from Spain. Knowledgable and helpful wait staff. Currently, their new Japanese sous chef is introducing authentic portions and preparation techniques to existing menu.  Delicious cocktails all around. Nori will have a professional review in the coming weeks."}
{"text":"Been here a handful of times and I'm never disappointed. Their shrimp tempura appetizer is hands down the best shrimp tempura I've had. The sushi is always fresh, oh you HAVE to try the yellowtail carpaccio. To. Die. For. 
Recently went there and my boyfriend and I were craving soup so we got a ramen and an udon noodle soup. The jjam pang ramen (I think that's how you spell it) was HUGE! Pretty good too, had baby scallops, shrimp, calamari, and fish cakes. 
I had the udon nabeyaki and it came out piping hot! I literally had to wait 5 minutes to let it cool before I could eat it. But that's not a complaint lol. And it was just as good! Came with a Japanese veggie tempura cake and a piece of shrimp tempura. I advise you take it out right away or else it'll get soggy quick.
Don't forget to try going there for happy hour M-F 3-6pm!"}
{"text":"So I was a little skeptical for sushi in the marketplace but it was pretty damn good.   Got there for happy hour and was pleasantly surprised ... Enough  items on the menu made it worth while.   Nigiri was good. Fish was excellent but rice was a little  off    Rolls were tasty too.    Bartender / waitress was awesome.    Friendly and attentive to drinks etc.    thanks to my SoCal manager!"}
{"text":"Their garlic Edamame is like crack. A little bit of spice. A lotta bit of garlic. It's the Edamame of my dreams. Their happy hour sushi is great (Happy Hour 3-6 M-F). Decent amount of options for a happy hour menu. Lots of options on the regular menu. They don't have many options for beer on tap though, unfortunately. We came in at 2:50 on a Wednesday and our server mentioned it would be happy hour soon and it would be totally fine to wait. So we did! Sushi is fresh, rice is perfect, $5 sake bombs on happy hour and like I said -- the garlic Edamame is crack. I literally had 3 orders of it because I couldn't get enough. I could eat 10 pounds of that stuff!"}
{"text":"Good sushi bar in Desert Ridge. Good service, employees are friendly. Good experience"}
{"text":"Fish is very fresh. Pretty fast service. Would definitely go back. Checked in on Yelp and got a free edamame app. Yeah!  My son had tuna and he had to ask chef to cut it thinner (came out too thick for his liking). They did accommodate his request. I had the yellowtail and it was very delicious. Still can't believe I can get good sushi in the desert. Miracles do happen."}
{"text":"Small restaurant in Vieux-Rosemont that doesn't look like much from the outside, but don't let that fool you, they have some of the best sushi in town; this is currently my favourite sushi shop!  I've gotten takeout several times (they have takeout!) and everything has always been fresh and tasty, and they have several very creative (and delicious) rolls.  It's in a small strip mall with ample parking to boot, huge plus for me compared to other places that are a nightmare to park (especially downtown).

A bit on the pricy side albeit on par with other quality sushi joints in Montreal, and well worth the price. Highly recommended!"}
{"text":"Nice and friendly staff. Sushi was fresh and tasty, not to mention it wasn't on a rotating hot conveyor belt! Great happy hour prices! I would go back here any day!"}
{"text":"Great food and ok service. The manager is rude to the staff and that is why I only gave this restaurant a 3 out of 5. Overall great restaurant with ok service."}
{"text":"I really loved the sushi here! I have definitely found a new sushi place. The staff was friendly. Our server was so nice and thoughtful. Apparently there was a mixup in orders on a dish of Green Tea ice cream. She had an extra bowl of it and offered it to us as a complimentary treat. I had never had Green Tea ice cream before but I definitely will again. The sushi chef was great and very attentive. I'll be back."}
{"text":"I've been to Nori twice and both times were impressed with the food and service. I enjoy the bright, green decor, staff is super friendly and we were even presented with $5 cards for a return visit. On one visit we had a couple specialty cocktails. I believe one was a strawberry mojito and it was quite delicious and not skimpy on the alcohol. 

I've had edemame (free with yelp check-in), philly rolls and shared another roll with a friend. Everything was tasty and at the perfect temperature. I will be back when I am in the area and have a sushi craving."}
{"text":"Finally made it here with a bunch of friends for HH. While the HH items were abundant and well priced, I opted for the hamachi sashimi, California roll and free edamame with Yelp check in. Which was plenty of food for this girls. 
We had a table of about 20 people. The gal who organized the gathering was a regular so we got prompt and fantastic service. 
I would not say the price is the cheapest but the quality of the food is worth the price tag. 
There is an outside patio where you can sit to people watch those milling around Desert Ridge. 
Pleasant decor and atmosphere. Everything from the sushi to the rolls to the cooked food items looked delicious- will be back again!!!!"}
{"text":"It upsets me that I have to write another bad review for this restaurant... I said I would never return to this place again because of the poor quality of sushi but I did. My boyfriend and I were waiting for our movie to start and wanted a drink so we sat at the bar for one. We ordered grey goose on the rocks with lime. A drink that we get every time we go out to drink. It's a very smooth vodka that we truly enjoy the taste of. Once we get our beverages we realize something is wrong, this drink tastes sweet with a kick at the end. We ask the bartender if she gave us grey goose, she reassured that she did. But still we disagreed as she made us another. Very sweet of her to offer. We get the second drink and watched her poor it this time. The drink she made for us was not grey goose, yet it tasted a little like soju. I know what grey goose tastes like, and this was not it. So my only speculation is that they are mixing half and half grey goose and soju. Because grey goose does not have a kick at the end, it is very smooth tasting and is not sweet. Anyway, there is no proof to my theory, only a strong belief. This restaurant is not getting enough business and they have to cut costs somewhere and I get that. But it's unacceptable. I now have to pay full price for grey goose when it's not what I'm consuming."}
{"text":"A bit pricey. The sushi is standard, nothing mind blowing. The service is great though and if you check in you get free edamame. That's all I've got."}
{"text":"Waited for 10 minutes at a table - no greeting, no service, anything. Wednesday night, they weren't busy, and at least 5 servers walked by us. Zero stars."}
{"text":"Love coming here. My daughter and I always fuel up here before we hit the stores.  Fish is always fresh. Love the Spicy sashimi salad! Definitely recommend it."}
{"text":"Great happy hour, best prices on average sushi rolls, and craft pints for $3! Very nice and engaging staff, except for the manager, who is hopelessly aloof and arrogant. You are a restaurant manager!??"}
{"text":"FANTASTIC!! 
The service was attentive and friendly. We ordered seaweed salad which was good. Salmon, red snapper, and octopus for sushi. All delicious. The octopus/tako was the best I ever had. We ordered 2 rolls and we thought they were the best rolls ever. 
We will be returning but want to try the Phx location."}
{"text":"Pretty good sushi here, and I loved the fact that Yelp got me a free edamame appetizer. Me and my buddy sat at the bar and the bartender was sassy but good sassy and added to the experience. I would recommend their dragon roll, edamame, shrimp tempura and any rolls here. Now I'm not saying it's the best sushi I have had, as sushi in Phoenix seems to be meh at best, but it was pretty good (go for the rolls not the nigiri). And drink their house sake and Kirin on tap, as me and my friends bill combined with drinks and a bunch of rolls was like $73.00 which isn't bad after 5 hot sakes and 3 Kirins as well."}
{"text":"Great new place would recommend Sushi Chefs awesome. Lee is a cool dude. Wish they had Sapporo light in small bottles but otherwise food awesome. Bathrooms should also need to be redone. It seems someone forgot"}
{"text":"Got delivery from Skip the Dishes. Crystal roll was barely edible, salmon had so many tough parts could barely chew. Salmon set had BONES in the salmon, and the rice smelled off. The fish quality was abysmal, which is absurd for a restaurant that specializes in fish. I have only had one other sushi experience where it was inedible, and I eat a lot of sushi. I literally cannot choke down this food, not to mention I can't anyway because there are bones in the salmon. Taste, presentation, everything is just bad. They then would only refund the salmon set, despite the Crystal roll having salmon in it as well...  now I have to get dinner elsewhere and pay again, not the mention the inconvenience. Very upset."}
{"text":"This place is horrible! They have no idea what service is!

I will take my money elsewhere. This was our first time and LAST!

Walked in and they had told several in front of us that the sushi was running behind? That's weird for a sushi joint! Second we were seated and nobody had come to our table for 15 minutes to get us water or any drinks including taking our order. We decided to walk out an nobody questioned or stopped us. 2/10/2018 at 7:30pm. 

Please look at your service because it was not up to par Tonight!

We will not return to your location!

If I could give zero stars I would. 

Management look at your staff on this day and this time. It's lacking. 

All you review readers. Go somewhere else! They clearly do not want to serve or even greet you!"}
{"text":"Ok. We went back. Brent and Chris treated us like royalty. True gentlemen. Taryn ( so sorry if I am misspelling her name) was wonderful and offered great choices. Definitely order the seafood pancake it was delicious.
 You have got to try the green tea waffle and green tea ice cream for dessert. Yummmmy. Great service, food and atmosphere.

Overall wonderful experience. Great job everyone.

Thank you...."}
{"text":"Very good sushi with some really creative options.  I find it hard to get good sushi in arizona for obvious reasons.  Nice atmosphere and good service.  Probably the best sushi place I have been for kids.  Recommend."}
{"text":"Torn between giving them 2 or 3 stars.  Decided on 3 stars because they ultimately did the right thing.  However, we won't be back because we have a bigger issue with the value Nori offers.  

My husband ordered Nabeyaki Udon(assorted seafood and vegetables/$15).  I had the Tempura Udon (shrimp and vegetable tempura/$14).   We also had a caterpillar roll which was okay, nothing special.  

Our soups arrived in identical bowls with a tempura shrimp visible on top of each.  To their credit, they were piping hot. As we dove into our meals, the discrepancy between the two became surprisingly apparent.  My tempura udon had the one shrimp on top and that was it!  There was a bunch of chopped peppers, onion and zucchini, but no vegetable tempura.  On the other hand, my husband was also fishing out mussels, clams, a scallop and calamari.  Assuming there had to have been a mistake made in the kitchen or the price difference between the dishes must be greater than we thought, we asked the waitress.  She answered it was $1.  To be sure, I asked if the tempura should have come with only ONE piece of shrimp and she confirmed it.  However, there was a discussion about the vegetable tempura that should have also been on top.  I said I hadn't seen it and was even surer that I didn't eat it.  In fact, the waitress said, \"Now that you mention it, I don't recall seeing it either when we brought the dishes to the table.\"  My husband hadn't seen it either.  Discussions went back and forth between the waitress, manager and kitchen.  

Here's where it gets a little weird.  The manager came by and asked if I was sure it wasn't in the dish.  He said they have a julienne of vegetables that is fried in the tempura in a kind of ball and placed on top of the soup with the shrimp.  \"Was I sure it wasn't there and it disintegrated into the soup, because the kitchen said it was there?\"  Huh?  First of all, why would you julienne vegetables for tempura and if it can meld into the dish to the point that the customer can no longer discern what it is, you should rethink the dish.  Vegetable tempura aside, we told him how dismayed we were that for $1, the nabeyaki came with twice the ingredients.  His answer, \"Yes, I know.  The problem is that we couldn't get away with charging $20 for the nabeyaki.\"  News flash, the problem is not current price of that dish.  Both dishes seemed over price.  Prices of tempura udon at other area restaurants:  SushiKo on Shea ... $8.95 (2 shrimp with a good portion of vegetable tempura) and $9.95 nabeyaki.  Sakana ... $8.99.  Toyama .... They don't have udon, but their mixed tempura appetizer with 2 pieces of shrimp and 4 vegetables is $7.95.  I could go on, but you get the point.  The manager did take the tempura udon off the bill for the \"missing vegetables\" and our server was great, but we just see no way to justify the cost to make future visits.  It might also explain why at 7:00pm on Friday night, all the other restaurants in the Desert Ridge mall were packed and Nori was barely half full."}
{"text":"Guess what?!  There is a real sushi bar in Desert Ridge, and it is GOOD!

I was a little skeptical when Nori first opened, because Desert Ridge has not had the best luck with sushi (I lost count of how many places have opened and closed in the past few years).  However, I was pleasantly surprised at how much I liked everything about this latest (and greatest!) sushi spot.

The restaurant has a really open and airy feel, with an indoor/outdoor bar and high ceilings.  The sushi bar is large, with plenty of seating to enjoy the view of the chefs working their sushi magic.  There is also booth and table seating, if the sushi bar isn't for you.  

I have enjoyed everything I tried - some favorites are:

Yellowtail sashimi - perfectly fresh and sweet, a great presentation served over crushed ice

Ahi tuna tataki roll - a savory blend of spicy tuna, asparagus and cucumber topped with seared ahi and sprinkled with crunchy fried onions.  I get mine without avocado, and love it.

All of the nigiri has been fresh and flavorful as well - definitely try the salmon, freshwater eel and spicy scallops.  Yum!

Thank you, thank you for adding great sushi to Desert Ridge!!"}
{"text":"I was sat at the back booth of Nori right by the bug zappers (in the kitchen doorway) and was eaten ALIVE by mosquitos. Within 15 minutes of sitting there we noticed a SWARM of mosquitoes (which are disease carrying if you didn't know) and when we mentioned the swarm to our server he admitted that this is a permanent continual problem and that they \"have to leave the front doors open in order to attract business\" into their mosquito filled restaurant. The server then pointed out a large permanently installed bug zapper adjacent to our table and kitchen door. When I advised management to not seat people at the SAME table UNDER the SWARM, she smirked and gave a perfunctory apology and sent us on our way not even offering to comp the bill we already paid (with cash so we could run as fast as we could to a restaurant without a bug problem) NASTY."}
{"text":"Great sushi!!! The crab and tuna sushi's were great (can't remember the names) definitely will go there again. The ribs were good but there is definitely room for inprovement in the ribs. I would suggest just eating sushi because they are all great."}
{"text":"Food is consistently great. Atmosphere is great , both inside and outside. I love there downtempo music that's always played."}
{"text":"Decided to try this place out but man do I regret it now.  Lunch for 3 people was $55 after tax and tip... which I honestly feel was a rip off for the quality of the food.

First off - the deep fryers are WAY too high in temp.  So the outside of anything deep fried (spring rolls, tempura, etc) is burned and the inside is either soggy or raw.  Nasty.

The sushi was terrible.  Although the fish portion of the sushi and rolls was okay, the rice was over-cooked and tasted old, stale and terrible.  We ended up picking the fish off everything and eating it and leaving all the rice on the plate. 

The service was also poor.  We would have to put our hands up in like in school in order to get her attention.  Otherwise, she would just stand at the bar and watch the music videos on the screen.

I will say though that the ice cream was fantastic... as was the deep fried bananas.  Both of which I would bet were bought from external sources (the banana batter was completely different than anything else they had - so they had to be bought pre-made).

I should have left when we were given the plates and my plates were all dirty... that should have been enough of a sign.

Do yourself a favour, try somewhere else.  This place was nasty."}
{"text":"I love trying sushi at new locations whenever I travel, just to experience the variety and quality. Aside from the obvious location where I would expect sushi to be the best (Japan), I have visited Vancouver, Hawaii, Atlanta, Ohio, Missouri, California, Texas, Colorado, Utah, Florida, and a handful of other states.  

I would never have expected some of he best quality and variety to come from this gem in Phoenix!  The quality, freshness, texture, or sushi here is  some of the best, if not THE best I've had.  The variety is exciting, and eclectic.  Their presentation (which we hold highly in Japanese cuisine) is one of the best, as we eat with our eyes first.

I definitely will be back for more...especially to try the desserts!  Usually Japanese restaurants do not focus on desserts as their strong suit, this place shows pride in all their preparations it seems.  Green tea waffles, chocolate lava cakes, bravo!"}
{"text":"You feel like you are getting a fine dining experience at a casual dining price. The quality of the sushi was very good. The lunch specials were an excellent value. Will definitely come back."}
{"text":"Service was greatly. Sushi is amazing. Wonderful ambiance. Came in with a party of seven- everyone was great to the hostess, servers and chef. Great outdoor patio as well. TVs so we could still watch the game. Will def be back."}
{"text":"Sorry folks, in my honest opinion about the food here is average. I had spicy tuna rolls and it wasn't spicy at all, it was average for my taste. My husband had fried noodles yakisoba it was blend.

Service was okay, our waitress forgot to bring soy sauce for my sushi.

What a bummer that the bento box lunch is only served on Monday through Friday not in the weekend.

You get 1 free edamame for check in here that was nice.
Thank you anyway and perhaps next time I will get wow food here."}
{"text":"We really enjoyed Nori! We tried an awful place that was close by because we didn't see this place as it's hidden inside Dessert Ridge. Upon watching a movie at Dessert Ridge we found Nori and decided to try it. I don't exactly remember the names of the rolls we got because we got so many of them- I think we got the Nori Tempura Crunchy, Hamachi Fire, Nori Tempura Roll and a Sashimi Roll. Every single one of them were really delicious and I'd have all of them again. They all had a great texture and flavors. This is going to a frequently visited sushi place for us!!"}
{"text":"The ambience is relaxing and a cool place to escape the heat. Delicious cocktails, had the Cosmo which was light, sweet and subtly interesting. The avocado eel roll was divine. Edamame perfectly seasoned. Chicken lollipops were a bit on the spicy side, it would be nice if the dikon wasn't saturated with the chicken sauce as to be able to provide a cooling contrast. I'll be requesting them to do that the next time I'm there. 

I would give 5 stars but a few knocks on the board. Crab cake was incredibly small for the price. Also the prices vs quantity is a bit skewed. Other than that great service, our server was attentive and timely. Also, they through in tempera ice cream dessert for birthday. Delicioso!"}
{"text":"Amazing!!! The food was great, service was great.... But the green tea waffle, now that was on a completely different level. Can't wait to come back and I haven't left yet."}
{"text":"Great wine menu, includes all the Saki you could want, mixed drinks are incredibly good and the food is very good. Garlic edamame is one of the best ever, salty, but this is why your are drinking beer in this place. Sushi is as good as anyplace in Phoenix, happy hour pricing makes it better. Good place to go after a movie. Give this place a try for sure. We hit this place again, went through the whole menu ordering like drunk sailors, everything, it appears, s good here."}
{"text":"Round of a huge applause goes to Nori today! Wow. Their sushi blew me away today, truly.

Excellent service (frequent water refills and check in's) goes a long way with me.

Elaborate, user-friendly menu and order sheet.

Love their interior design - their choice in chartreuse green and muted gray works very well. Very clean and sleek. Contemporary vibe.

Their sushi was very fresh and impressive.  This girl will definitely be back for more!!"}
{"text":"My daughter requested to try this place out for her 18th Birthday  dinner place on a Tuesday night at 7 pm.  I made reservations over a week in advance for 5 of us which grew to 7 but only 6 showed up.  I have lived in Arizona for over 28 years and have frequented Sushi  restaurants all over the US and Arizona.  This place had good Sushi but small servings, not very spicy tuna but I added my own wasabi and service was slow.  We waited over 30 minutes for our order and the waiter was not very personable and for it being 6 people you would think he would have put some effort in knowing the bill would be large ( over $200.00 ) and tip would be good.  Nope  service was very much lacking and attitude was non existent.  If your looking for Sushi before or after a movie this may or may not be the place as you might be waiting.  Prices were on the higher side for the portion sizes. If they hire the right people with great attitudes and either increased portion sizes or cut costs this place will make it otherwise I give it another year and they will be gone."}
{"text":"Nori is my absolute favorite sushi restaurant! The service is amazing and the sushi is even more amazing! Their strawberry sake is one of my favorite drinks, I get a bottle every time. I have tried many other sushi restaurants and nothing compares, I always leave disappointed trying new places. I would give Nori Sushi 6 stars if I could!"}
{"text":"We wanted to catch a movie at the AMC Desert Ridge so I looked up dining options in the area and sushi is always a winner. It's a nice spot, plenty of outdoor seating but we opted to sit at the bar where we could watch the chefs at work.

The lighting in this restaurant is dimmed and spotty, which made for a relaxed environment but tough to get good pictures of our food. We got a free edamame appetizer for checking in and I also ordered the sweet and chili tofu dish. The tofu was soft and had a stringy, cheese-like texture to it, it was interesting but the sauce was tasty. We ordered one of their specialty rolls, the ahí tuna tataki, as well as a classic Philly roll. It was neat seeing how everything was made in front of us and the results presented us with delicious, fresh sushi. They had some unique creations and a lot of them had asparagus, which I didn't expect. I'm pretty simple when it comes to my rolls so I don't usually venture outside my comfort zone, I know what I like. But the ambiance was modern and sophisticated and our server checked up on us appropriately. A nice place to dine considering the other options around, which are mainly fast food and/or casual."}
{"text":"We were immediately greeted and seated when we arrived in our party of 2. The waitress came and took our drink order minutes later, nothing to complain about. 10 minutes rolls by..ok no big deal maybe they're just busy. Then 30 minutes rolled by and we started getting a bit upset. At this point we hadn't even received waters. I asked a busboy if he could bring us some water and explained our situation to him. Minutes later, our waitress came by with our saki drinks and took our order. From there, our order took another THIRTY minutes to get to us. The rolls were tiny and we were both still hungry after splitting three of them. They were fresh, but I have had much better sushi for much better prices in Phoenix. I have to say, this was a disappointing and frustrating experience and we probably won't be coming back."}
{"text":"Wonderful food, great menu selection. Reasonably priced, try the seared scallops they were devine. Perfectly cooked, great sear, simple perfect execution. Would go back there again!"}
{"text":"Great happy hour 3 to 6 pm. The presentation of all the food was nice. Made it feel really expensive when it wasn't.  They had a kids menu as well, which is rare at a sushi place. Would definitely come back again, especially for the 3 dollar Blue Moons."}
{"text":"I just went here with my girlfriend and it turned out to be really good. The sushi was fresh and tasted great. We checked in and got a free edamame order, so don't forget to check in if you go there.

We got the spicy tuna and eel roals. The only thing that I could complain about is that it was pretty darn cold in there. It felt like they didn't have the heat on at ALL."}
{"text":"Great place to get lunch with the kids.  Mackenzie always take great care of us.  Everything we have tried has been delicious.  The mango shrimp salad is my all time favorite."}
{"text":"Nori may be on of my new favorite sushi places in Phoenix... I was a bit skeptical walking in here the other night and had pretty low expectations because of its location in Desert Ridge. But alas I was pleasantly surprised and had an absolutely fantastic meal here - drinks, food and service were all on point! 

For dinner we ordered a bit of everything -  We started off with some Nigiri, Tuna, Salmon and yellowtail. All 3 selections featured surprisingly fresh fish and the rice was cooked perfectly. It wasn't gummy and didn't fall apart. 
The Seaweed salad was solid. For rolls we ordered a Poki Poki which featured their house speciality tuna poke and crab. It was recommended by our server as one of her favorites and she didn't disappoint. Soft Shell Crab roll was flavorful as was the Salmon Skin roll. We ordered a bottle of their unfiltered Sake which was placed in an ice bucket on the table to ensure that it was kept cool and their Strawberry lemonade Martini was to die for! 

I will def be back!"}
{"text":"Slow, Slow, Slow, Slow, Slow. 4 tables seated and our bento boxes took 30 min to get to us.

Update- got a nice note from the manager and he's actively engaged with their product.  Food is really good- just tough to do in an hour or less.  One other thing- the iced green tea is the best in Phoenix."}
{"text":"Love this place! Ty is always killing it behind the bar. The food is amazing and the staff is always on point. Kevin is the man!"}
{"text":"Went to Nori last night for sushi. We ordered shrimp tempura roll and Philadelphia roll. Both were good but could've used less cream cheese in the Philly roll. Drinks were excellent (5 stars really went for the drinks). I'm a gin girl so I got gin grapefruit and a splash of cranberry. Bartender hooked us up with a nice sake and new drink called Praying Mantis! Will definitely be returning!"}
{"text":"Delicious! The fresh is super fresh. We ordered the garlic edamame, chef special, lobster yakitori, miso sea bass, Ika sashimi, and unagi. Nice variety of sake. Great service."}
{"text":"I can't believe I've never been here before! It's a great spot for some great sushi... nice, clean modern atmosphere, good music, nice & attentive staff... we'll be back!"}
{"text":"Yet again violating my rule against eating sushi in landlocked states, I decided to try out Nori's food happy hour. My cousin and I split three rolls: spicy salmon, crunch, and Las Vegas. The fish was reasonably fresh considering the price and distance from the ocean. They had a Yelp Check-in deal for a free order of edamame. We were full by the time we were done, and the whole bill for the sushi came out around $15. I'd recommend this place if you want a quick afternoon sushi fix and don't want to break the bank."}
{"text":"We recently tried Nori and had a really good meal. The atmosphere is nice, cool bar area and an outdoor patio section. They have a decent drink menu and lots of yummy rolls. We had the baked lobster roll and the crunchy roll, both SO GOOD! For sushi this is one of our favorite spots in the neighborhood, they got the food and ambiance right!"}
{"text":"It was a late night fix after a long day of travel and touring.   Enjoyed the food and staff.  Surprisingly, very good edamame garlic chili and sushi."}
{"text":"Food was expensive for the small portions you get, awesome drinks but still to expensive. Don't know if I would come back with my wife"}
{"text":"This place was delicious!  They had some specialty sushi's like none I had ever tried before.  I ate so much more than I would of normally eaten because I wanted to task as many of them as I could.
The staff was super friendly and the waitress came and refilled my iced green tea without me even asking.  That is very rare.  Also the sushi chef saw how much I was enjoying my meal, (I sat at the bar) and offered to make a special sushi for me.  I was so full by the time I was done, but sooo worth it!  I loved everything about this place, even the iced green tea was delicious."}
{"text":"First time eating here.. It's been a struggle to find a decent sushi place around this area. Although on the pricey side, I think it's worth it. Fish tasted very fresh....May try and go at happy hour as they seem to have good deals."}
{"text":"We've been regulars at nori since they've opened and have never had anything but awesome service and better food. They make us feel appreciated and are always trying new things for us that have never failed to be amazing!!!! Highly recommended!!"}
{"text":"I ordered a rainbow roll and it was hands down the worst rainbow roll ever. I've had grocery store sushi that was better and less expensive . Based on the rainbow roll I wouldn't eat here. Cheap ingredients, small portions and high prices."}
{"text":"Heard really good things about this place from 2 friends so was excited to try it. 

My verdict would be go for the sashimi buy stay away from the maki/rolls. 

The fish is extremely fresh...The salmon was fatty just the way I like it! 

I found that the rolls had way too much rice and the rice was also too muchy for me. 

The price for the items are reasonable and it is a bring your own wine."}
{"text":"When we first moved here from California it took us some time to find a decent sushi restaurant that actually serves fresh fish. My husband loves sashimi and oysters so we go to Nori's once a week to once every two weeks. Their fish is always fresh which is why we continue to come back. Our son loves the lobster roll and so does everyone that we bring there who tries it. I'm not a huge sushi fan but they have a few rolls that I will usually order. I do wish they would offer new rolls maybe some without asparagus. The staff has always been kind and attentive to us. From the manager to the waitresses to the sushi chefs. The only change I could possibly recommend is to add new specialty rolls."}
{"text":"This place truly deserves MY five stars. World class service and delicious sushi is the blanket statement, here are the details:

Went to Nori on a blind date, I arrived first.

Staff:
I was promptly greeted and seated (within 30 seconds of arriving). My waitress introduced herself-- she had a stellar personality and I told her I was on a blind date. She courteously offered to \"check in\" with me as the night progressed to ensure I was comfortable, and she held to her word! Several times she'd pass by and look at me, I'd smile back. Everything we ordered came out quickly. Both she (our waitress) and the person I assume was the manager, poured the sake for us, even refilling our glasses as needed. She was truly one of the BEST servers I've ever had the pleasure of dining with. 

Food:
I like my rolls nice and tight. We ordered three rolls: a spicy tuna, a spicy salmon and a yellowtail roll. All of them came out at the same time, all of them looked absolutely perfect. The fish was fresh and light, as it should be in sushi. The edamame that we ordered as an appetizer came steamed and warm (as it should be) and was perfectly delicious. My date ordered a bottle of cold sake (~$20) and we liked it so much, we ordered a second one, haha! 

Ambiance:
Beautiful layout, with patio, booth, table and sushi bar seating available. Ambient lighting and music throughout the restaurant. Restrooms were clean and well stocked. Gave off a fine-dining vibe without too much fuss. 

I don't often rave, but when I do... it's for a place like Nori. It's a bright, sparkling example of how dining establishments should be."}
{"text":"This experience just left a really bad taste in my mouth. Clearly the decision makers are creating Happy Hour Menu's and Pricing that are clearly deceptive and take advantage of customers. I will not be returning again simply based on principal. CAUTION - ASAHI 16 OZ DRAFT BEERS ARE EXCLUDED FROM THE HAPPY HOUR PRICING EVEN THOUGH THERE IS NO MENTION OF IT BY THE MENUS OR THE STAFF. Additionally if you need to reach management don't bother, their e-mail inbox is full. Very poorly run establishment.
Overall I would probably give this experience 3 or 4 stars if I wasn't deceived and taken advantage of. The food was pretty par for Happy Hour Sushi in Phoenix. There was a hair on our edamame which I am not going to freak out about I just picked it up, stuff happens. The floors were disgusting but it was raining outside so again not a big deal. The Happy Hour Menu was mediocre and definitely not as good as RA, Kabuki, or Kona which I would put Nori on the same playing field. An average experience until I got the bill, then it was a pretty terrible experience. 

On the Happy Hour Menu was $3 16 oz draft beers, so my girlfriend and I ordered the 16 oz Asahi draft beer which was listed in the same place as all of the other draft beers with no exclusions or asterisks. When I got the bill I was charged $28 for 4 16 oz Asahi Draft beers instead of the $12 that I was anticipated as outlined by the menu. When I asked the waitress about it she explained \"oh Asahi is excluded from that\". I asked \"does it say that anywhere?\" and she said \"No, but how do I explain this. Asahi is in its own class which is why its excluded.\" I replied \"even though it is listed in the exact same class under all the other draft beers but I am supposed to just know that this one beer on the list is excluded even though it doesn't say that anywhere??\" And she responded yes.... I explained to the waitress that it was a little frustrating that nothing said that, but went out of my way to say \"hey nothing against you at all thank you, you provided great service and I know you don't design the menus, please just let your manager know from the menu perspective that is misleading.\" I felt so bad that the waitress had to try and explain something that we both knew made no sense, and I felt bad that either of us were in that position so I made sure to tip her 30%. The menu says nothing to make anyone think that this beer would be excluded and the happy hour menu doesn't mention any type of exclusions just that 16 oz draft beers are 3 dollars on Happy Hour. 

This deception cost me only $16 dollars, so again not a huge deal. But taking advantage of customers and having deceptive pricing absolutely is a big deal to me. What if I was with a group of 10 and we each had 2 16 oz Draft Beers listed at 3 dollars and then got a bill for $140 instead of $60 as the menu ultimately states? Who in my position would ever want to go back to this type of establishment. The food was par for Sushi, the floors were very dirty, there was a hair in our edamame, the Happy Hour Menu mediocre, based on all these things I probably would have no problem returning and certainly easy to look past when you out for Happy Hour Sushi. However, being deceived and put in an awkward situation is enough to not return strictly on principal, especially when you combine it with anything else that is less than satisfactory."}
{"text":"We went on a Saturday for lunch, got two of their noodle dishes (udon soup and the sautéed udon) and two plates of sushi. The sushi came out fast but we literally waited 30min for the noodle dishes and there were only three other tables of people there. The sushi tasted fine but fell apart easily upon being picked up. The noodle dishes were good however their primary vegetables that they seem to use in a lot of the hot dishes are: asparagus, bell peppers, zucchini, and button mushrooms. There were no Asian veggies at all (ex. Bok choi, Asian turnips or mushrooms, seaweed for the soup) so the dishes were kind of like Panda Express, except even less traditionally Asian if you can imagine that."}
{"text":"Fantastic flavorful and fresh sushi!  This place is hip, clean, and provides great service.  I had a California roll and Spicy Shrimp roll but they have many options, including hot dishes like yakisoba.  I was here on a Sunday but they have an awesome Happy Hour Mon-Fri 3-6 with $3, $4, and $5 apps.  Hey also have a beverage Happy Hour with $3 draft beers and hot sake, $5 and $8 wine and drink options.  Sad I'm flying out today."}
{"text":"If you love paying premium prices for small portions of marginal sushi (at best) and crappy service then Nori is the place for you. Went there on a Tuesday night at 7PM and it was virtually empty. Not a good sign. But the Yelp reviews were generally good so I assumed it was just a slow night. Note to self and fellow Yelpers: If you show up at a restaurant in the middle of what should be prime-time for dinner and the restaurant is 90% empty, leave.  

The Food: I ordered two rolls and they were both tiny and tasted just OK. Nothing I would order again or come back for. 

The Service: Let's just say that if sushi makes you thirsty or you get dehydrated easily this is not the place for you. I had to flag down someone other than the waitress twice to get a refill on an iced tea. I was probably fortunate though because my waitress brought me a roll I never ordered then debated with me as to whether I had ordered it when I told her it didn't seem to have any of the ingredients she told me were in it. That certainly was a lot of fun when you combine it with below average food. 

The Price: Insane for what you get here. I wanted to call 911 and report a crime when the bill came. 

Do yourself a huge favor. Don't come here. You can get better sushi off the conveyor belt at Sushi Station across the street for a fraction of the price and the server probably won't argue with you and you're less likely to have to tackle someone going by when you are thirsty. As tempted as I am to give Nori one star I didn't get physically ill when I got home and there was no 1.5 star option."}
{"text":"Excellent sushi! Would highly recommend this place, for sure the best sushi we have had in Scottsdale. Be sure and sit at the Sushi Bar. The Sushi Chef was very friendly and took great care of us! He gave great recommendations including the Blue Tuna Belly sashimi, which was on special and if is available is a MUST!! I can in all honesty say it was the best piece of fish I have ever had, truly melt in your mouth, it came with fresh wasabi (not the powdered stuff they form into a wad) which complimented the flavor perfectly. Also would highly recommend the prosciutto roll, a unique blend of flavors very much worth trying."}
{"text":"The sushi is great. Prices are very good. Just don't order off of this app. They don't actually subscribe to it. The manager was very accommodating though. I'll definitely be going back."}
{"text":"Good sushi restaurant.  Egg rolls were good.  Chicken skewers good.  Seaweed salad good.   Very good sashimi.  Good chef special rolls.  Good service. 

Wife thought the udon noodle dish was excellent."}
{"text":"Took the waitresses advice and ordered the Poke Poke roll- it is your typical crab mix with avocado in the center, wrapped in rice, seaweed and avocado and topped with ahi Poke and Dorito chips. It's a unique blend and $15 for 8 pieces. I also ordered the Eel with Avocado roll $8 for 8 pieces- and it was absolutely delicious.. actually prefer it over the specialty roll. They have happy hour 3-6pm and 10pm-close Mon-Fri and offer $3 16 oz drafts and large hot saki, $5 well drinks, sake bimbos, flavor infused sake and house cab/chard and $8 lemon drop, Moscow Mule, white cosmo and cocktail of the week. My bartender recommended the white cosmo! Give this place a shot. 3 TVs in bar area for sports watching, if that's important to you!"}
{"text":"My boyfriend and I were in town for the 4th of July weekend and were craving some yummy sushi and based on reviews we chose this place. There was nothing too wrong with our experience, but we found it weird that we were the only ones dining in the restaurant, so the atmosphere was pretty weird since they were only focused on us. The rolls were good, but they were rather small for the price we paid."}
{"text":"I went here last week with my manager for dinner and drinks. The deco is pretty modern for an Asian restaurant and I liked it. To start, we had edamame (free with Yelp check-in), pan seared scallops, and sake. For our main course, we shared chicken yakisoba and the baked lobster roll, and I had a california roll, all very good. To end, we shared the green tea waffle which was bomb.com. Much smaller than I would have liked because I would have eaten 1,000. 

The service was a little spotty and they were mopping/sweeping the floor in the sushi bar area which was a little distracting. I'd probably return."}
{"text":"This is the best maki sushi I have had in the valley. Being from the Pacific Northwest and having lived in a Japan for two years, I don't have a long list of sushi places that I enjoyed or would want to go back to here in PHX. I had the hamachi fire and California roll. The California roll was very good, standard maki fare. The hamachi fire was super delicious with a spicy kick, soft flavorful tuna, veggies, and crab. I love when sushi chefs add ponzu to yellowtail and jalapeño, such a winning combination. Just writing about this roll makes me want to run straight out and get one. I can't wait to come back and try more.  We also were very impressed with the waitstaff, being so prompt and checking in on us at all the right times. All around an enjoyable experience between the food, ambiance, and friendly staff.

They have a busy outdoor patio and nice modern dining room. The entire restaurant is in view of the sushi chefs and kitchen. Great atmosphere for family, date night, and even a nice lunch."}
{"text":"I haven't been here in awhile, was in the area for lunch on a Thursday around 12:00... was not busy at all, just a few people seated in the outdoor patio. We chose to sit at the Sushi bar. Our Sushi Chef took very good care of us and made our lunch very enjoyable. Though we only ordered Sushi, we did order drinks and the service was very attentive, refilling our waters and tea and asking if everything was OK.

We ordered Hamachi Sashimi, Salmon, Uni, Smelt Egg and Eel Sushi, Spicy Tuna Handroll and a Salmon Skin Handroll along with an Omakase order. All The fish was fresh and presented nicely.

Atmosphere: nice, Service: very good, Sushi Chef: excellent, Food: very good. Nice place to stop for lunch."}
{"text":"Visiting Phoenix from Iowa. First time here last night. Was not disappointed! Have to say we were very impressed with the speed our food came out after we ordered. Sure it was a Monday night, and they were not very busy, but still impressed. 

The squid salad was fresh, refreshing, kind of citrusy (if that is a word). The sashimi was as excellent as I have ever had. We also had a vegetable tempura ... relish The tuna carpaccio was absolutely tasty and literally melted in your mouth. 

I was not very impressed with the coconut shrimp. I felt like the focus was on the breading and not the shrimp, or even a balanced focus on the two. Small potatoes, compared to the other great items we enjoyed. 

We don't get to Phoenix often, but when we get back this spot will be on the list."}
{"text":"Delicious sushi. We had a few yellowtail dishes after edamame and miso soup. The server recommended rolls as well. Every bite was eaten we just loved it!"}
{"text":"Went to Nori based on word of mouth, im a little late in writing this review.  I initially went in to Nori to try them out for a review in another publication.  Lobster Tail tempura did not dissapoint, tempura was perfectly fried, not overly greasy like a lot of places I have tried out.  Chefs Sashimi platter was so fresh and wonderful.  Did not even need a drizzle of soy had a perfect balance on its own.  The proscuitto roll was very intriguing.  Lots of layers of flavor and perfectly balanced.  The star of the show for me was the Green Tea waffle with vanilla ice cream, fresh fruit and mochi on top.  Sinfully delicious and worth every penny to upgrade it with ice cream.  If you have a sweet tooth this dessert does not dissapoint.  It is a must try."}
{"text":"We have been here several times. I love their baked lobster roll, although the last time I noticed a little too much mayo. Also great are the edamame and California roll. If we could we would come here often! Also, it's loud enough that I can bring my toddler and not worry about noise."}
{"text":"Came in for lunch for the first time yesterday. The ambiance of the place is great, as is the food! I ordered the Unagi Bowl & Tempura Bento Box and it came with miso soup, a small salad, gyoza, and some cucumber. My coworkers and I were all impressed with the miso soup, which was a good sign. The Unagi bowl was BOMB AF. I try not to eat too much rice, but the rice under the unagi was mixed with fish eggs and furikake and I could not stop eating it. Super good find and will be back!"}
{"text":"Hands down the BEST sushi happy hour in Scottsdale.  The service is fast, friendly and very efficient.   Happy hour sushi starts at only 3$ and are fantastic.   If you haven't been to nori yet do yourself a favor and try it out.  !"}
{"text":"Went here for the 2nd time. I went during lunch.

My thoughts have changed for this place. I realized how overpriced they are. If this place didn't have the nice, clean, and modern setting with beautiful decor... it wouldn't be any different than any other hole-in-the-wall type sushi restaurants.

Some of the food is unique and tasty, such as the ahi poki tuna, but it so very  expensive for what its worth. 4 very small pieces for ~$12 is expensive for what they claim as a \"main dish.\" I think if they served around 6 pieces, I wouldn't be complaining. 

The bento boxes are a rip off, IMO. Salad is okay. Gyoza is nothing spectacular. Tempura is greasy and battered up. Rice is okay. Nothing spectacular. Nothing disgusting, either. Just a bit overpriced.

My husband and I spent around $50 for LUNCH for 2 bento boxes and the ahi poki tuna. RIP OFF, if you ask me. If you compare it to other decent sushi restaurants, $50 would probably get you almost 2 separate meals during lunch for 2 people instead of just 1 at Nori. 

It's all about value. And this place... is not up there on my list. Sorry. Money not well spent."}
{"text":"I lived in Japan for three years and I can tell you this is the best sushi restaurant in Montreal. The chefs are very creative and focused in providing high quality ingredients, which are a great combination in a sushi restaurant.
Prices are really reasonable for such high quality plus it is \"a bring your own wine\". If you are looking for great food and amazing service you cannot miss this place!"}
{"text":"I lived in Hawaii for almost 30 years and only miss two things: friends and food! This place comes very close to what we used to get in Hawaii. Very fresh, very tasty!"}
{"text":"This place is fantastic. The fish is so incredibly fresh relative to other sushi joints around the valley who lie in the same price range. Service was very quick, staff was friendly, and my yelp check in got us free edamame which was also very fresh and delicious. Will have to come back, thanks guy!"}
{"text":"Staff is always friendly and sushi has been fresh and beautifully presented."}
{"text":"This is a hidden gem! This place had great service, beautiful presentation and amazing fresh seafood! If you love sushi you will love this place!"}
{"text":"1/11/2017 7:10pm .I ordered some sushi to go. I was disappointed with the scraps used on my rainbow roll. I felt like it was not the same presentation and cuts of fish I would have received had we been dinning in. I expressed my disappointment to the sushi chef and he got aggressive with me. The waitress asked if everything was ok and I told her what had transpired. The manager stood around with his head in the clouds and said nothing. When I told him about the experience he starred at me with the deer in the headlights look and said nothing. He was lost. Disappointing experience, will not be back."}
{"text":"The atmosphere is cute and trendy. The staff was helpful seemed happy to be there. The patio is a little small and can feel as if you're encroaching on others space and conversations. 

The sushi was good, but overpriced for what you get. The chicken lollipop was tasty. I also tried the nori prime ribeye, which had a pretty good flavor, although, I kept searching for the kimchi and veggies in the dish, but to no avail. They were much needed to break up the creme fraiche, which really had no business being in this dish. 

Overall pretty good, the sushi was yummy. I would go back, but probably not order anymore of the entree dishes."}
{"text":"The staff is super friendly!! The sushi is so fresh and amazing!! I had such a lovely time for lunch here. Monday's are half off select wines and sake!!"}
{"text":"I had the Sakana Trio roll and it was very unique, colorful, fresh, and the citrus boba was an interesting touch. Also had the halibut nigiri and was pleased. I cannot say that the food was spectacular, but I was not disappointed. However, it was quite pricey overall (spent $28 for two rolls and a drink before tip) and they did not have very good specials. The interior is very modern Japanese feel, but it also looks a bit too much like Ikea. The location is also pretty lame; right by the water play area at Desert Ridge so there loud kids throwing balls around as we sat in the outdoor patio area. If you can make it during a happy hour, I recommend Nori."}
{"text":"Joseph was our waiter . Amazing service ... he gave us some great recommendations on foods.  Ask for him . You will not be disappointed! The edamame garlic flavor was to die for!"}
{"text":"Service was great and sushi was delicious. Favorite roll was the shrimp tempura, but all were really good. Will definitely be back"}
{"text":"Excellent! Shrimp tempura was so delicious and fresh! Our rolls were delicious :scallops and lobster!"}
{"text":"Absolutely love this place been coming since they opened can be a little pricey but definitely well worth it. My daughter and I always sit at the sushi bar we love Oscar he's one of the best sushi chefs."}
{"text":"Nori is AMAZING! Great food, great staff, great atmosphere. The owners are very friendly as well and always say hi. Overall always a good experience!"}
{"text":"Gave this restaurant another chance, and I must say that the experience was certainly much better. The food here never fails me! It's always so yummy. This time I had the Chilean Sea Bass and I would definitely recommend it. 

I sat at the sushi bar, and it was nice and quiet. Both my server and the guys at the sushi station where awesome with all of my questions and there recommendations, where exactly what I wanted. I also had the fresh water eel, and it was also delicious. I was so content with my dinner, and appreciated the excellent customer service. The only thing I would change, is maybe adding some more choices to their hot menu. I mean, I realize it's a sushi restaurant but some variety would be nice as well :) 

Wonderful experience over all though. My server was wonderful, the food was great, and Clayton the manager was very attentive."}
{"text":"Best sushi/sashimi in N Scottsdale Area! This is our favorite Japanese restaurant! My husband and I go once a week for date night! I'm ashamed that it's taken me over a year to write this review! 

First, we are sashimi connoisseurs. We've traveled to Japan and my husband is half Japanese, so I think we can say that with much validity.  Secondly, they have gluten-free soy sauce and they don't treat me like a difficult customer because I request GF! 

The sashimi is our main course 90% of the time and it's always extremely fresh and properly prepared. You can order the platters which start at $30 and go up from there in increments of $10. Obvious the larger amount, you will get the variety as well as upper grades of seasonal fish available. *Ask your server what the specialties are of the day. We recommend the Shochikubai chilled sake to go with. It's our Japanese style \"wine with dinner\" concept. 

The bartender, Chris, is very creative with making new and hip cocktails. The most recent favorite of mine is the Fig and Cherry Mule. Yummmmo! It is made with imported Italian cherries, lime, fig flavored specialty vodka and organic real ginger beer! There's many options of specialty drinks, so explore!

We've had a few cooked dishes too! My favorite is the Baked Chilean Sea Bass. I've had it the usual way served, but I'm gluten-free, so they prepare it a little different for me without the sauce. It's excellent either way! Also, I love the scallop dish! Chicken Katsu is my husbands favorite. It's always tender and juicy! It's crisp and light on the outside! Seafood pancakes are my friend's favorite! All of their dishes are a nice size portion too!

Lunch is perfect to have a bento box. Great value and you can check out different dishes. 

Happy Hour:  Very simple and great value! Tempura is so light and crispy! Chicken Yakitori is our personal favorite appetizer. Sushi rolls are awesome on the HH menu and regular menu. As crazy as it my sound, they have the best edamame that is never over cooked! I've had that happen at other restaurants numerous times. Not here!

We highly recommend Nori! Excellent service, friendly staff and cool decor! We've referred numerous friends and strangers there. Every single one of them had positive feedback and continue to dine there. I've posted a picture of most of the items I mentioned, so please check them out. 

On a final note. There food is always so strategically prepared and beautiful when presented to you! We are always impressed and have to take pictures!"}
{"text":"I would say they had the worst service but they would in fact have to serve you.

Sat down and waited for 15 minutes and still not a hi or I will be with you in a minute.

Got up and left and they could have cared less."}
{"text":"This is my favorite sushi place. Slightly pricey but super fresh. The sashimi melts in your mouth. Service is excellent.  Brought my brother who is a sushi snob. He said it was one of the best places he has been and wished he lived in state. Highly recommend the happy hour for great deals!"}
{"text":"One star is even to much, food is not good at all, o tried different items and not even one was good. The one that was a little better was the General Thao chicken. Service was horrible the girls there never came to table to ask if anything was needed, waited almost 15 before I could ask for a drink. Food takes forever to be served. To make it worst is the music they have on the tv, don't know about others but I don't like to be listening to loud rap music when am eating. Please if you have a choice don't come here!!!
And P.S. The shouldn't pick up the table when you still sitting down, they put there armpits almost in our noses!"}
{"text":"After dining here several more times, this place has earned 5 stars.  Food, service, and value(especially during HH) are all outstanding.  Friendly staff - especially the bartender Brent who is engaging, attentive and a really cool guy. We've sampled the majority of the menu and it has proven to be consistently fresh and delicious. Green tea waffle or crime brûlée are great ways to finish the meal. They have a kids menu, which can be rare in places serving sushi.  Great open indoor/outdoor areas when the scorching Phoenix summer is not cooking our flesh. HIGHLY recommended for those interested in Asian fusion, sushi, happy hour and yummy deserts"}
{"text":"Been here a few times. It's a bit pricey for what you get so I normally don't go here unless it's happy hour. I am a big fan of their hh. Good menu and food with all the good rolls. Also have a nice selection of drinks. Check this place out sometime if you are looking for a new hh joint."}
{"text":"Very tasty sushi, the udon was delicious too. Sitting outside after shopping in Dessert Ridge was lovely. I had their cilantro and habanero margarita which was really tasty. A touch on the pricey side for somewhere in a shopping mall."}
{"text":"Best sushi in town. Glad to see the master, Ozzie, again. If you have the chance, try the bluefin tuna & the chef's sashimi platter"}
{"text":"Great sushi bar. Everything is extremely fresh and flavorful. Service is lovely and fast."}
{"text":"Eat here when visiting from out of town had Sushi rolls and nigiri the service was good. Quality was good Shrimp salad was small not many shrimp for the price. I would say give it a shot good quality and pricing was decent other then the shrimp salad."}
{"text":"This place, unquestionably, has the best sushi in the desert ridge area.  It is close to a five star restaurant.  If i could give it 4.5 stars, I would.  There is a slight degree of inconsistency depending on the chef rolling your fish.  To be sure, a few of the chefs deserve a five star rating."}
{"text":"I came here last night for a dinner date with my mom. I found that the directions on Yelp were super confusing and tried to take me to the Albertson's in the Desert Ridge complex, but luckily I did see their awesome logo over by the Yard House instead of going to another restaurant. 

We ordered two drinks that were definitely delivered quickly and we ordered the Edamame (yummyyyyyy), that was also out soon. We split 4 rolls, all really fresh. The rainbow roll was the first that came out and the fish tasted delicious. Our server was super cute and had a bubbly personality! The other three rolls we had were the shrimp tempura, the crunch roll, and the spicy tuna. All were delivered quickly and had a great presentation. The sushi chefs all said thank you and waved as we left, which is always a plus! 

I would definitely come back in if I was in the area, but do advise them to check on the map on Yelp to better direct people trying to get directions in the massive complex."}
{"text":"Came here for lunch with my family everything started off good appetizers came out on time server was friendly. In the middle of lunch we noticed what seemed to look like fruit flies around the table a few landing on our food and in soy sauce tray  I had told the server and she communicated with her manager and she the manger stated that there was nothing she could do. The manager walking up to the table with her stomach showing was less then professional not friendly and seemed to know about the bugs in the restaurant. Probably will not return with that management service. After back and forth conversation she removed roll from our bill. I was not asking for a free meal but good customer service would have been nice"}
{"text":"Dear Nori, until tonight, you were my family's favorite place to eat dinner at Desert Ridge. However, after spending $22 plus tax and gratuity for udon soup (yes, approaching $30 for a cup of soup), and getting home to find that the container was just over half full, your manager politely argued with me by phone that all the servings are measured. I offered to email her a photo, and just as politely let her know that this was certainly not $22++ worth of soup. Unfortunately, there was a language barrier, and she continued to reassure that me that the udon was not on happy hour (never thought it was) and that the servings were measured (as if this prevents all mistakes at all times). In conclusion, she told me she appreciated me calling and one more time that the servings are measured. The most hilarious part? Your hostess who initially answered the phone had the better sense to call it unacceptable. You are unreasonable, out of touch with what customer service is, and you have lost a regular customer."}
{"text":"Fresh fish & great service. We got the ahi poke roll and it was mouth watering! The rolls were a little expensive but can't complain with the quality. Can't wait to come back to this restaurant."}
{"text":"Good location, food and anything that you would really expect. It's always very cold inside the restaurant; however the outside and this time of the season it's better to be outside enjoying the weather. Prices are average; however checking in Yelp you get free edamame."}
{"text":"Bento box is of good quality and pretty cheap! We will try the all you can eat sushi next time. We will come back."}
{"text":"Didn't expect good Asian food in Arizona but I was wrong. This place has great lunch deals and food. 

First off, my friend's salad was made perfectly. The teriyaki salmon I ordered was overflowing with sauce. 

The portions were also huge for lunch. 

I don't eat sushi but they had a very specific menu to order from. 

Awesome times. It's right next to The Yard next door. If you're debating which one to pick for FOOD, go to NORI."}
{"text":"Went here for a quick lunch date and although pricey, they had great service and have a wide selection of sushi, soups, and entrees. Great place"}
{"text":"Love love this place! Always walked by in when I was in Desert Ridge but never tried it. Today I finally went here for a early dinner with my mom at around 4:30 and the place was not super crowded / busy at all so that was good because that meant not a long wait for food! The server we got was super nice, recommended stuff since we had never been here before and always asked if we needed anything else, how the food was, and if we needed drink refills. We sat at the sushi bar and the sushi chefs were very nice and actually talked to us unlike some other sushi chefs at other sushi restaurants. We ordered 3 things. We got the Spicy Tuna Roll, Crunchy Roll, and the Baked Lobster Tempura. The Crunchy Roll came out first and it was to die for! So good! It came with a lot of pieces so it was a good sharing roll if you are going to share it with someone! The next was the Baked Lobster Tempura and it was so good! It had baked lobster on top which i don't like lobster so much so I just took it off the top and just ate the roll and it was just as good! The spicy tuna came out last and it was pretty good! There was definitely a lot of tuna in it which Made it very filling but still very good! Everything was amazing, good prices, fast and friendly service! Great location! Definitely will come back here a lot more often!"}
{"text":"We are trying so hard to like this restaurant. Tonight is our third visit and once again the bartender/ hostess is much more interested in flirting with the manager (they are sitting together in a booth in the back of the restaurant as I write) than taking care of the very few customers in the place.  The sushi is good but the bar, management and wait staff are so inattentive it's insulting.  I sat in front of my empty martini glass with my sushi menu filled out for so long my husband just got up and delivered our order to the sushi chef himself. The atmosphere and location are great but sadly this was their last shot."}
{"text":"My favorite sushi place ever. Food is always tasty and fresh. Great quality and good service! The yellowtail jalapeño is one of my favorite sashimi dishes! The sea bass on the kitchen menu is absolutely delicious, another one of my favorites. Don't forget to try the green tea waffle dessert!"}
{"text":"My time at nori went from mediocre to impressed.my only issue was there was only one cook for all the tables and we were a Lil pressed for time since we were going to see a movie.the sushi was AMAZING!! some of the best I've personally had.even though half our food came out at different times because of so many tickets to the one cook.the manager was very nice! He apologized for everything took like 10 bucks off our bill and gave us this incredible green tea waffle.i work in food service management and I always say an issue that pops up is also another opportunity to make a customer into regular. Thanks for the great food and service I will be back."}
{"text":"This place looks great and the food tastes great as well.  The poki poki is fantastic.  Presentation is good and there is enough food for a reasonable price.  I'm pleasantly surprised to find fresh fish in the desert but all the sashimi tasted fine."}
{"text":"It was fine.  I had a seaweed salad, and salmon nigiri.  Seemed like the portions were on the small side.  The decor was nice.  Customer service was ok.  I do not like to sit at the sushi bar, I prefer a booth.  The hostess asked me if I wanted the sushi bar, I said no, a booth please.  I felt like she was not happy about my choice.  There were plenty of booths, so I wasn't taking up a larger party's space.  It also took the waitress a long time to get to me.  I've written about the whole dining alone thing.  Sometimes it feels like they ignore you when you are by yourself.  Which is a shame, I am a good tipper, but not if you ignore me."}
{"text":"Good food that was served at a surprisingly fast pace. I've never been to a sushi restaurant that cranked out the rolls as quickly... Or included asparagus in so many of the specialty rolls. Perhaps that's a trend in Phoenix, but I chose to go with the more standard options without asparagus. My daughter had an udon bowl that was wonderful."}
{"text":"This place is okay if you order take out, the sushi is subpar quality but the food itself is okay. Way over priced. The employees look like they don't want to be there and if you eat in, your server will probably not check in on you. You could get the same quality sushi at the revolving sushi place across the street for much much cheaper. If you want quality sushi though, don't go here. Many other places with better fish and the same price."}
{"text":"This is now my \"local\" Japanese restaurant. For sure. Tiny and cozy. Soothing Japanese music on ambience. Excellent food. Kudos for the chef and his special sauce. 

Service was perfect. They took note of all (my best half's) allergies with care.

We decided not to have any combos so we could play with our orders and share every dish... however, the cone is just AMAZING... next time we are ordering one for each, for sure. 

A plus... they delivery!!!!!!!

They are closed all January long (2017) but they are back early feb. and I can say that I'm looking forward to it."}
{"text":"Excellent sushi!!! About time we got a great sushi place. We have been waiting for a place like this."}
{"text":"I honestly love this place, it's a lot different in price from sushi station down the street but the quality is worth it. I have had some of the most delicious sushi here. all very fresh tasting too.
Happy hour is a good time to come in if you just want a couple of sushi rolls and a yummy cocktail for cheaper than usual price! 
And for a dessert I would suggest the green tea waffle with vanilla ice cream on top. It's to die for!"}
{"text":"Food was amazing and the service was excellent! Alayna was our server and she rocked!! Looking forward to going back soon!"}
{"text":"Go for happy hour, prices are good for both sushi and drinks. Sashimi portions are small, but the roll portions are larger."}
{"text":"Have dined here twice and was pleased both times with the service and the food was delicious..."}
{"text":"Have been to Nori once before with my girlfriend and had a blast. The GM or owner was behind the bar our first visit, very attentive and helpful. Today coming into what seemed to be a two staffed dinning room (bartender and cocktail waitress). There was a handful of people people on the patio and two tables inside with no one at the bar. My girlfriend and myself sat at the bar, were given waters and a menu and that's the extent of our visit today. The bartender walked to the bar to drop off dirty pints and with out even a word to us left the bar. After waiting 5-10 minutes with no interaction we decided to leave. It is extra unfortunate because the GM or owner from the first visit was on the other side of the bar and didn't take the time to lend his bartender a hand."}
{"text":"Oh my how I love this place-especially at Happy Hour.  My hubby and I imbibed in their specialty cocktails and swooned.  More importantly, we ordered EVERYTHING off of the Happy Hour Menu and were in sushi heaven.  Great portions, fabulous presentation and accommodating service.  Fresher than ever sushi-with a great variety to choose from.  My new fave spot!"}
{"text":"Very average sushi, in my opinion, for the high price. Miso soup and edamame were good, but the rolls we got were just ok. Had a spicy tuna, and two specialty rolls which were pretty mediocre. Nice ambiance, though, sitting outside on the patio. Service was good, no problems there!"}
{"text":"Great fresh food, great service, reasonable prices.  You can't ask for anything else.  The bartender and wait staff are obviously proud of the food they serve.  The sushi chefs themselves are like quiet, honorable ninjas doing a great job in the name of honor, not glory.  Will go back time and time again."}
{"text":"Nori had some good fish - the scallops were fresh as was the tuna on one of the rolls I tried. The salmon and sea bass entrees were tasty as well. However some of the other vegetarian rolls tasted kind of stale, with very dry rice. The service was also very slow and inattentive, despite there only being three parties at the restaurant during dinner time and plenty of staff standing around.  For the service I would have to knock off a star, but I would consider giving this place another chance because the fish was good."}
{"text":"Nori, great sushi. Nice to have because they are hard to find. My husband and myself frequent this place. Staff is good . The GM is always reaching out to guest and accommodating."}
{"text":"Great sushi at fair prices. The staff is amazing and the food is consistently great.

Amazing, friendly bar staff - Kevin and Will in particular are awesome. We go back almost weekly for the company, refreshing drink menu, and sushi."}
{"text":"Tried Nori before but wasn't too impressed so I haven't been back for over a year. I thought I give them another try since its in a convenient location, right next to the AMC theater. Their menu is very limiting. They must have another menu since I saw some food items on Yelp that wasn't on their menu I was given. We were there at 5:00 pm on a Wednesday but wasn't offered a happy hour menu.  We ordered couple of rolls including spider roll ($13). Their roll pieces are tiny! Barely any fish and not enough rice to hold the roll together. They are also on the pricier side. They tasted good though. But for the price and small portions, I wouldn't recommend."}
{"text":"So as a frequent Nori customer, tonight I was extremely disappointed by the management. Our server Allie, was delightful and apologetic when it took our appetizers 20 minutes and when our sushi arrived first she gave us our edamame for free. 

The reason for my poor review and stars is because the female manager on duty ignored me THREE times as I tried to talk to her about my missing appetizers. She ran around like a chicken with her head cut off without actually completing any tasks. I think during the hour we were at Nori, I saw her empty one load of clean glasses onto the bar. I don't know if she just doesn't care for her job or what. After explaining my (polite) frustration to the server, she was super nice and just continued to explain that the manager was ignoring her too! As a fellow server I'm disgusted by this woman I really hope the owners sees this because even if I were to grab a hold of her attention I'm pretty sure she would have brushed off my complaints anyway."}
{"text":"First time here! We had several appetizers from the kitchen during happy hour. Everything was very good. It took the server a while to get to us and then it took a while for our drinks to come despite the fact that there were only three other tables. I'll definitely go back, dinner next time!"}
{"text":"Was hoping the sushi rolls would be better. 
My husband felt that the fish was fresh. 
He enjoyed. 
On the expensive side for average sushi"}
{"text":"We came here on a date night and our service was good enough, but the sushi was forgettable.  I always make it a habit to try one of my favorites and then pick a specialty roll.  We weren't very impressed and the décor/wall colors reminded me of a hospital waiting room.  There aren't many sushi restaurants up north, so I will give this place another go and try something else."}
{"text":"Don't waste your time or money on the happy hour sushi, very salty and bland. However, the regular priced sushi rolls were awesome. Unfortunately, we filled up on the discounted junk and couldn't eat the good stuff."}
{"text":"Incredible service..awesome sushi..tried the nori tempura roll..gotta try the miso Chilean sea bass..just heard they are opening a nori in west Hollywood!!!!"}
{"text":"Ordered pick up of sushi through Yelp today for 220 pm , it's 250 I'm still sitting here and waiting , there's a few waitresses walking by and no one seems to care . I don't even care about how the sushi taste , where is the customer service ?"}
{"text":"Looooove nori sushi! My fiancé and I go there often because it's so close to our house. The ambiance outside is relaxing and fun. Fresh tasting sushi and great drinks!"}
{"text":"This place is a hidden gem in the heart of Desert Ridge!  Amazing Garlic Chili  Edamame my wife and I get every time, have tried  to duplicate at home however it doesn't come close.  Also get the Yakisoba, both of these with the Belgium Beer are the perfect combination for a Sunday Funday or any other day for that matter!!  Great service great outdoor seating on top of the unbelievable food!"}
{"text":"I have lived up in the Cave Creek area for over 10 years.  I went to Desert Ridge when all that was open was the movie theater and we were the only ones in the theater one time.  Hands down, this is the BEST restaurant to open in DR ever!!!  I'm from Hawaii and know good sashimi and sushi.  The sashimi is top of the line, melt in your mouth, super fresh!  Prices for dinner, IMO, are average for this area.  If you want a smokin deal, go here for the lunch specials.  The sashimi lunch platter is ONLY $9.99 and the 9 pieces of sashimi you get are the best quality, biggest, most delicious you have ever had.  I don't know how they do it.  I suspect they will have to raise those lunch prices as the restaurant gets more popular, but its worth every penny and more.  They could easily charge $15-$18 for this same platter anyplace else.  Its a lot of sashimi!  Also, they have a kids menu, served on cute divided plates (for kids who don't want their food to touch).  Awesome, awesome, awesome!!!!   I've been telling all my friends to go here.  We cannot lose this place in DR.  We've been waiting sooooooo long for something as good as this.  If I could give them 6 stars, I would!!!  P.S. - Signature drinks are also excellent.  The cucumber one and the one with the spicy tequila...too die for!!!"}
{"text":"Sadly we read the reviews. Went tonight with reservations!!  Forgot our drink order. That's ok!  But FORGOT to put in our dinner order and an hour later, when asked, our waiter didn't own up to it. Left and at another restaurant. Had our wine in 5 minutes!!!  It is ALL about service!"}
{"text":"Heard about this place a week ago and decided to check it out. My first impression was really good! The restaurant is very clean and the decor is amazing. The staff was very accommodating and knowledgeable of the menu items. My wife and I ordered some sushi roles and the beef ribs. The sushi was amazing, fish was fresh and rice was cooked to perfection. The beef ribs were pretty good, but a little fatty for my taste. I love that there is a classy fresh sushi joint in desert ridge, and I plan on going back to taste other items from their menu"}
{"text":"Worst service I've ever had! The food was decent but the service was awful and nobody was even in here"}
{"text":"Great sushi.  Great atmosphere.  Well worth the trip.  And yes I will be returning.  Jeanette was amazing and made the experience that much better!"}
{"text":"Hubs and I always tend to favor this place when we are at Desert Ridge over all the other many restaurants in the area.  On the occasion, we'll get a pizza at Slices, but overall, we're generally at Nori.  We always order tha jjam-pong noodle dish which consists of ramen noodles, mussels, scallops, calamari, shrimp, red & green bell peppers.  The broth is flavorful and the ramen noodles perfectly al dente.  They also have great sushi - but my favorite is the california hand roll.  Not the sushi roll, but the hand roll.  Service there has always been great and we enjoy eating out on the patio during cooler weather."}
{"text":"Very nice Asian restaurant and sushi place.  Good sushi and good menu items as well.  They have everything that you would expect and a bit more.  The quality is great, and everyone at the table liked their dishes.  I have been there a few times now, and will be back for more.  I have only gone during lunch, but the portions were perfect as well."}
{"text":"We appreciate Nori Shusi bar, It's very fresh and tasty. The employees are wery welcoming. My favorite are salmon and Thuna Sushi and California Rolls."}
{"text":"My friend took me here for lunch and we sat outside. They have very nice patio seating, and the service was good. My friend is a regular and ordered a roll that had crushed Doritos on top, which was intriguing to me. She felt like they didn't put enough dorito crumbs on the roll, and her experience wasn't consistent with what she usually gets at the Bell Rd location. We might go to that location next time. I'll be back simply for the dessert that is the green tea waffle! Heavenly flavors and textures, hard to describe, you just need to taste it."}
{"text":"Pretty good sushi! I really liked the roll with scallop inside and another roll that had yellow tail and a jalapeño on top. Spicy and delish. Service was decent, the restaurant was clean, a bit pricey, but all in all pretty good."}
