{"text":"Ahhhh....Hot wings.....  We called one night to ask about the wings - we'd heard a rumor they were grilled after being tossed in the sauce. The bartender answered the phone and answered all of our questions so kindly and patiently.  We placed an order over the phone and proceeded to the restaurant to wait for our takeout.  The bartender was friendly in person as well.  The service was great, the wings were even better.  They deep fry them, toss them in sauce, and throw them on the grill.  This process cooks the sauce into the wings for more flavor (I think), and less mess on your fingers.  The ONLY way to eat wings!  The place could use a little sprucing up though.  I heard it was the old Dirty Drummer and there is a sign propped up on the back wall to confirm the rumor.  We didn't try anything else there, but that doesnt' mean we won't be back.  It's def a neighborhood bar with regulars who are very protective of the bar and it's employees.  (kind of nice to see)  Unfortunately, we don't live in the hood.  But it is closer than JT's for wings and their wings are quite tasty!!"}
{"text":"WOW..........Horrible experience.  The waitress, wings and Friday Fish Fry were awesome.  The bar manager SUCKS.  Waited 30 min. for drinks and damn near 2 hours for food.  Then wants to charge us 50 cents for a 3 oz. cup of ranch dressing. Will NEVER go there again"}
{"text":"total dive bar.... paper plates, over-cooked food, yucky....."}
{"text":"North 51 Grill is pretty much on the corner of the 51 and Shea, in a mostly dead strip mall with a Pizza Hut and a Subway, and the newly opened Storm Wisdom.   We stopped in for lunch recently and discovered that it used to be a Dirty Drummer. They even still had a DD neon sign on the wall (turned off). The place was nearly empty, but so were our tummies, so we stayed. It wasn't exactly spotless, so I guess they're keeping the spirit of the old name. The waitress was good, made helpful suggestions, and kept our iced teas full.   We shared a cheese crisp, which came out hot and cheesy, with a really really good house-made green salsa. Hubby had a cheese enchilada with green sauce, which was kind of smallish and the cheese was not melted through. He really liked the green sauce, though, and the grilled broccoli he chose as a side. The refried beans were pretty flavorless. I had a ribeye sandwich. It was fine, cooked a tad more medium than I would like, but was flavorful and sparsely topped with grilled onions and mushrooms. My side salad was decent and quite large.   Will we be back? Maybe if we're in the area and starving again, but it's certainly not destination dining."}
{"text":"Stopped after driving many times with a couple of Biker Friends and the food rocked. I had to take a bite of everyone sandwich!"}
{"text":"Great food for such a weird place.  The vibe just doesn't work for me to want to hang out here for drinks."}
{"text":"Used to be good, now as bad as it gets.  This location used to have great wings that were meaty and flavorful. Under the new ownership it is apparent that every penny of food cost comes before quality. They switched to wings that are about 1/4 the size of the old wings. Nachos also changed - now they use cheese sauce (on stale chips) instead of melted cheese. Ground beef? Not exactly. They chop up precooked burger patties and spread those chunks on the nachos.   I was a loyal customer for six years. I'm done with this place now. It's going to be hard for them to try and eke out further profits when they don't get the dollars in the first place."}
{"text":"Had a great dinner here the other night.  I know that they are known for the Wings and Wine burgers but the pizza was outstanding.  Nice local place to grab a bite, watch a game, and have a cold beer."}
{"text":"I found this place here in Yelp searching for 'huevos rancheros'... : (  We got there around 10:45am, the place was open but empty... we came in and asked if it was open and a girl (looking at her phone almost all the time and with earphones on) said she was going to be our server. She seemed to be texting or something, I almost felt guilty to 'interrupt her'.  We ordered water and a diet Coke and when she brought them we asked about breakfast menu. She said they didn't have any, just the regular menu. When I told her I had seen reviews about breakfast she said they could cook eggs and bacon. We were not ready to order an she decided to give us some time... and then she forgot about us. We decided to order pizza and wings, but honestly she never came back.  Then we found out the diet Coke tasted really funny and, oh well, decided to leave. We went to the bar and 3 people were chatting in the back (among them our server) and we had a hard time getting their attention. I told her we would probably be back for lunch some other time and that we were leaving, and wanted to pay for the drink.  In other circumstances we would have complained about the weird taste, but didn't want her to think we were just trying to get out of paying... however, we barely took a sip and I think any good business place would have waived the cost of the soda in hopes to keep a customer, given the odd circumstances and not so good service.  Anyway, so we paid and went in our merry way to 5 and Diner.  PS, we found out on our way out they seem to serve Pepsi products. I am not picky about my soft drinks, but the hubby is... The best servers always ask: Is Diet Pepsi OK? and then is when he asks... 'do you have iced tea?'"}
{"text":"My family and I went here to eat this last week.  I was pleasantly surprised!  Our server (who has worked there for a long time), was efficient.  My side salad was delicious!  The pizza was nice and crispy, even though the sauce was a little too acidic for my liking.  My philly cheese steak was also tasty! Impressed...will go ahead"}
{"text":"No. Big fat NO.   Came here with a group of friends (8 of us total). We were the only people in the whole place aside from another couple. We ordered 2 plates of chicken nachos, 2 orders of wings, and a pizza. Which took no less than 45 minutes to prepare and bring out to us. And I think I'm being pretty generous with the time it took.   It was literally ridiculous, unless they were out back catching, slaughtering and butchering a chicken for our nachos and wings. Which I doubt. IF the food was amazing, that would have redeemed a little bit of this visit. However, the food was entirely lackluster, and therefore a huuuuuge waste of time and money.   Don't waste your time or your money here.  5 thumbs down."}
{"text":"This seems like a pretty sweet place to come for the game and get some bar food. Portions are large, just like what you want from a bar. The bar food is better than the average, the wings are probably the best item on their menu, that we tried this day.  I would definitely come back for a game, or just to kick back with friends.  Um what's pretty cool is the smoker they have going in the front of the place. Don't park next to it or else your car will smell like food...i mean of course unless that is what you want.  I'd love to be back to try other items on their menu...  The sandwich was just an eh... btw"}
{"text":"A wanton desire for wings drove us to drop in to one of our old haunts. Don't bother going anywhere else for wings! Rick is still turning out some great food.  Met him at the door and he let us peek at his latest masterpiece. He was smoking some brisket or pork in this huge smoker out back.  You could smell the scent of pecan smoke in the parking lot ( reminded me of being outside the Rokerji). Rick was preparing for a concert event they were working. Man I wish we could have gone to hat concert just to eat whatever he was putting together!  As always, this place is a no frills, good service, good food, great wings kinda place."}
{"text":"Best dive bar with awesome grilled chicken wings, and one of the best chicken quesadillas in town. You can go there on any night of the week and find live music, and a great crowd."}
{"text":"A group of us visited again.  It was empty again... we decided to do the same dishes because they were decent last time--nachos and wings.  it took quite a while for the food to come out, even though no one was there... and like i said, it was just nachos and wings....   im not sure if they had game day specials the last time we were there.. but everything was more expensive and the nacho portions were way smaller.  our friends ordered nachos too.  if you put our two orders together, it would have made the same size as the order last time........ we also were not asked about the wing option.  so my wings were grilled and not saucy at all."}
