{"text":"If I could give 0 stars I would. I came here for a staff Christmas lunch with about 40 people. We were all told by the organiser that we could order set menu or the actual menu. When we arrived at 12:15 the frantic waitress told us we had to order pre-set. Fine. I'm not ordering what I really want, but I'll go with it. After 40 min we finally ordered. We then waited another 15min for the complimentary bread. Starter salad came at 1:20 and was wilted and obviously had been sitting out for a while.  The main course at 1:35. Some of my coworkers ordered penne a la vodka, that was luke warm. I ordered salmon after cutting into it, I realised that is was not cooked. I sent it back and 2 min later they brought back the same plate, still undercooked.... Seriously!!??!!? ....I'll have a soup...at 1:55 we had still not been served desert...I have never had such poor service in my entire life. One of the managers apologised to the group stating that they weren't expecting 3 large parties....We RESERVED weeks ago!!!!!"}
{"text":"Returned for a second visit with a friend and we decided to have our dinner on the patio.  The food and service were both excellent.  We shared a delicious Caesar salad and then I had rigatoni with a gorgonzola cream sauce.  It was silky and incredible.  My friend had a Mediterranean penne dish that she said was good but there were more regular tomatoes (which she didn't think had been mentioned on the menu) in it than sundried tomatoes (as was apparently described in the menu) so she was mildly disappointed about that.  For dessert we shared sticky toffee pudding and it was amazing again.  The menu has lots to choose from so I'll be ready for a return visit soon."}
{"text":"This was my first time here... Def gotta try the penne  a la vodka Its tasty! The mussels in white wine garlic sauce were good and my buddies pizza was phenomenal."}
{"text":"This uncommonly large, boisterous, and well lit eatery is nondescript from the outside. It is a family-friendly pub with a serious kitchen. It occupies a former theater. The waitstaff is young, pleasant, and efficient. The fair is based on Italian food and generally well executed. It's very difficult to find a truly well mixed Caesar salad. Their attempt was good enough but nothing special.  Chicken Parmesan was solid with excellent texture for both the pasta and the chicken. Food was ample. Chicken wrapped in pancetta was good but it was on a bed of polenta, chopped portobello mushrooms, and pesto olive oil which was too busy, too many things going on to say it was a well-coordinated dish. Espresso coffee did not have Crema, suggesting that their barista did not know how to use the machine or that they did not have a high-pressure espresso maker..... Unforgivable for a restaurant that would call itself Italian. I would return however as experience was above average. Overhead screens with Charlie Chaplin, a basketball game, a baseball game, a game show, and a nature show suggest that they are trying to please all demographics at the same time, but again, the concept may be too busy as well as was my pancetta wrapped chicken. The food was beautifully plated and ingredients were fresh.  The pizzas at other tables were beautiful and I would try those next time."}
