{"text":"Ok, so here is the problem I am having rating this place...  The food was really good, the drink menu had something for everyone (the chocolate martini was really good) Design and atmosphere was comfortable and trendy... Dessert was really fun! We had asked for a dessert menu but instead the waiter brought out 6 mini desserts to choose from and when you choose, he gives you the mini dessert!  All good right?  The Service was HORRIBLE!! Our waiter looked as though we were interrupting something that he would have rather been doing, (like washing his socks)... Even taking our order seemed to irritate him!  And to top off the evening, my husband had ordered a beer that was brought out in a frozen beer glass...CRACKED all along the rim! We finally got it replaced and the waiter came over and without apologizing explains that the glass must have been frozen too long... Not even a free drink was offered!  We would probably go again if it is a last minute plan because they don't take reservations, so it's not a long wait..."}
{"text":"Tried out O for lunch this week and thought it was pretty good. Decor is nice and the food is good.  Tried the Tombo Tuna Tartare which was nice although the presentation was slices of pan seared tuna as opposed to the tartare I was expecting.  Nevertheless, it tasted great and was presented nicely. Place was busy with a wide mix of clientele...must draw nicely from the surrounding residential and nearby businesses. Will definitely go back on a weekend night to try out their drink and dinner menu.  Looks promising."}
{"text":"We have been to O maybe a dozen times since it opened. It has always been hit and miss. I found if one stuck to the burgers, pizza and a few other simple dishes and avoided ordering main courses or drinks such as a mojito ( there has never been a bartender at O who could make one properly) you could expect a decent meal.   After a recent experience on Wednesday during stampede, I doubt I will return out of pure principal.   After a great wine tasting event at J Webb we headed down to O with the intention oh having a small bite and a bottle of wine. We walked in at 9:02 and we were greeted by an employee who said \" I hope you are not here to eat\". I asked why and he responded \"we close the kitchen early on Mondays\". I replied \"it is Wednesday\". The host looked confused and said \"well... I lose track of the day, but the kitchen is closed. You could come in for a drink if you really want, but the kitchen is closed\". He then almost tried to convince us to leave as he continued \" well we are not really licensed for just drinks...but I guess you could still come in if you really want ... It's up to you\"  We all looked at each other. At that point I wanted to leave but we collectively decided to stay for a cocktail.   We sat down and the server came by right away. I ordered a Cuba Libre and she had no idea what that was. No surprise there. So I explained it. \" oh a rum and coke\" she said in an annoyed tone.   We then jokingly asked if we could order some food. She told us the kitchen was closed which we knew. Then another server at that exact moment took a food order from the table beside us!!! It turns out they arrived at 8:55 just before the kitchen closed.   For a business that has been struggling since day 1, this was ridiculous. They ended up with a $40 bill when we probably would have spent close to $200 had the five of us ordered a little food and a bottle of wine after cocktails. L  Just another example of a business with zero leadership and no common sense whatsoever.  I don't expect O to be in business this time next year. They started off half way, got marginally better and then went downhill."}
{"text":"I've been to O for 3 dinners, 1 lunch, 1 breakfast and 2 after work beers.  To me, this is enough of a sample to come up with an informed review.  The service at each visit bordered from non-existent to average and the food from ok to poor.  When my dinner companion and I left most of our meals uneaten one evening the staff was responsive and asked us to fill out comment cards for the kitchen.  I believe the menu has changed a few times since then.  The environment is kind of a cramped restaurant (if I'm not in a booth I get hip checked by servers the whole time) and not very cozy as a pub (the great table is often reserved).  As a summer spot OJ's down the street will have a 30-45 minute wait for the patio whereas O's patio is barren.  Perhaps the full place setting and cloth napkins aren't exactly what patio goers are looking for.  As a saving grace my in-laws (seniors) seem to like the place so it's a nice fallback when they are with us.  The free underground parking is a plus, although the elevator ride to the bathrooms could be a problem on a proper drinking night."}
{"text":"While I didn't 'O\" at this place, it IS gorgeous and creatively planned. I've never seen such care, thought and aesthetics put into lighting! And a rather small space has been fully utilized in very creative seating arrangements. Let's face it...everyone likes to sit at a certain kind of table for a certain kind of feel. Well, many of us do. So O offers beautiful brown or blue booths, 4 seater tables, one long counter table with chairs on either side (a lil modern medieval) and also seating at the bar. Needless to say, there's a very cool social aspect due to seating. I will have to visit on weekends to get a feel for the vibe.  I went for lunch and had a fabulous take on the mojito - mine was a strawberry rhubarb version (pie, anyone?), and tho it was $10, it was yummy. Lunch was a grilled panini chicken sandwich with a side salad and everything was delish and nicely presented. Our server was fantastic, friendly, helpful and not too pushy.  Lunch was pricey at $30 for a drink, food and tip but I'd go back when aesthetics and quality are worth paying for and it's fantastic to see places like this pop up in Marda Loop."}
{"text":"Uber-hip atmosphere, service OK, parking ample. Ribs were so-so, a trifle overcooked for my taste. Didn't have dessert. Experience was coloured, somewhat since Marda Loop has sucked lately for traffic, parking (except for underground at O) and that big butter-yellow eyesore across the street from O. Condos? Anyway, I'll give O a solid average grade, sort of Earl's-ish, without that franchise-y feel."}
{"text":"Sleek atmosphere with a good floor plan make this a relaxing joint to head to for a nice dinner in Marda Loop.  I've had the burger here that is jim dandy; and the bison meatloaf, which isn't bad--but the service can be hit and miss.  The gal we had recently was clearly a bit uncomfortable being on the floor, despite her obvious enthusiasm to please."}
{"text":"The live DJ at O was a little too loud for the loungey late night dinner I was expecting and he looked really lonely over there in the corner.  But to he was spinning some really great tunes, I just wish it was a couple of notches lower and he had more of an appropriate audience to play for.  We were put into a wonderful spacious booth and having heard many great things about this place, I was so eager to try the dinner menu. Unfortunately this request was dampened in that their menu changes to a lighter appy one after 10pm.    But not to let this affect my night I did order a glass of great Merlot and the Lamb flatbread which was in the end more than filling enough for my tummy.  It was quite huge, with nice ground lamb, tomatoes, fried beans and a nice delicious yogurt.  Very Tasty.  The interior of O doesn't disappoint, very sleek with sexy wall coverings and dim lighting, I really appreciated the hint of light floral arrangements in sleek vases.  The waiter was sweet and very informative and another waiter behind him did a catwalk runway walk to please the tables.  Good feelings all around at this dining dig.    I would like to return however to savour the dinner menu, there are items there that are worth a return visit, and this visit was just an appy."}
{"text":"onion rings okay.  prosciutto pizza lacked saltiness.  ambience and place design - chic, cool, refreshing.  love the long tables where different groups can share, if you're in the mood for it.  service great  price - reasonable.  washrooms are not very accessible - elevator up then around the corner."}
