{"text":"Not very good customer service. Wine glass was dirty. I won't be stopping through again"}
{"text":"Out of beer? Going out of business or poor management? Hopefully a new place comes in that cares."}
{"text":"Very nice waitress who accommodated all our substitutions.

Otherwise, the food was very meh. Not horrible.

The turkey burger was not very big, and not tasty. Needed salt."}
{"text":"Bartender made a great bloody mary with jalapeño vodka. I just wish they had the NFL network.
Nice airport bar."}
{"text":"Terrible. The burgers were completely under cooked maybe for two minutes a side.. then overheard the cooks fighting. I've worked in a kitchen before and it's not nearly as stressful in the back then what waitresses have to deal with. Obviously no management or the cooks would have been fired on the spot. The cooks looked like thugs and totally in acceptable and un qualified to touch food. Hospitality was good but the management and cook staff was a"}
{"text":"Figured with over an hour before my flight boards I would have enough time to order a salad and eat...............
WRONG!!!!!!!!!! Upon notifying that I would have to cancel my order they tried to give me some funky salad that they had sitting in a display case? ARE YOU KIDDING ME???????"}
{"text":"I love that Sky Harbor is showcasing some of the best local eats of the Phoenix area. OHSO has finally made their way into the airport. My one knock with some of the other restaurants is that they offer limited menus and aren't always as good as their original locations. What I love about this OHSO location is that they offer quite a bit of food options and have a pretty large beer selection. The other thing I love is that they are open late. I caught a red eye out and was happy I was able to grab a bite before my flight. OHSO makes their own beer and liquor and is expanding across the Valley. This airport location is housed in terminal 2."}
{"text":"This is your basic airport food. The only \"sit down\" place in the terminal so that's a plus. The burger and sweet potato fries were good to be airport food. It was a little overpriced but that's not surprising at the airport. I'd definitely come back."}
{"text":"Like people have said, not bad for airport food. Beer was meh. Seems as though most breweries these days are becoming basically all the same with nothing new to add. This place along with others are just mediocre at this point. Not really impressed with the beer and this was not made at the airport. Food was decent but not a great selection and waitress and crew are CLUELESS."}
{"text":"Waited 20 minutes while the seevers walked by us. Finally ordered from the bar, terribly slow bartender, while waiting, the server told me that she would have taken our order. Sure, 35 minutes into our visit. Not friendly and not recommended. It's too bad, looked promising upon initial arrival."}
{"text":"Overall we had a good experience here and was worth grabbing a sandwich and beer as we waited for our flight.

Food - for a brewery, this place had medium quality food. On the level of chili's or ruby Tuesday which was fine for me. The value is on the expensive ends of what you get but still ok 

Drinks - good beer here and would definitely try 

Service- very good here and friendly at the bar. We were served quickly and drinks refilled often"}
{"text":"First.  Do you pronounce this place \"Ohso\" or do you say each letter \"O. H. S. O?\"  I have no clue and no one greeted us by actually saying the name of the place.  In fact, no one really greeted us at all.  I was sharply told I couldn't sit where I was sitting because I was blocking the computer the servers input orders at.  Ooooook, I'm just sitting where the host sat me, lady.  Chill out.  Our server hardly said two words to us.  My husband and I both looked at each other wondering how PHX can [presumably self-proclaim] they are called \"America's Friendliest Airport\" with people like this working inside its walls.  The saving grace from completely tanking this place in the reviews is that our burgers came out SUPER quick - almost suspiciously quick - like they had been sitting back there pre-cooked waiting to be slapped on buns the moment the order hit the kitchen.  They tasted alright and the beer wasn't terrible.  It was pretty much our only option in the Alaska Airlines terminal, so we didn't have much choice."}
{"text":"Waiting for my United flight stopped in just to grab a coffee and Bailey's.  Bar staff was super friendly and attentive to the fact that people sitting there will prob need to dash out quickly.  

Check out this spot in terminal 2 while you wait!"}
{"text":"My wife and I got sat right away. We were hungry for breakfast but it was past breakfast. We asked if we could still get breakfast and even though we couldn't I was impressed with the customer service. The staff did everything they could to see if I could get some biscuits and gravy haha. 

We ended up getting a jumbo mimosa and IPA and shared a burger. It came out pretty quick. Great taste with everything. The bun the burger quality the pablano peppers were bomb. The fires tasty and I ordered the aioli form a different burger and they brought it out. We shared the diablo burger and we're satisfied. Some of the best fries in the state fo sho'. 

Great staff. Greater food! Airport 1st class feeling."}
{"text":"Trying to figure out what all these bad reviews are about.....

We started with the pork wings, those were delicious. I had a Cobb salad with chicken, also delicious. It was a little pricey but you're in an airport so it's to be expected! Service was just okay but again, we had time to kill before our flight and were hungry."}
{"text":"Stopped in for a quick refreshment before a flight. I had Underwood Pinot Noir.  Very fast friendly service."}
{"text":"I've passed by the spot several times during my travels. Today I had time to stop in. I had the gobbler (turkey burger) it came with a pear jam. Very tasty and satisfying. Nice selection of craft beers too. You can choose a side of fruit, fries or sweet potatoes fries. Servers were friendly."}
{"text":"The host at this location is rude and lacks any customer service skills whatsoever. On my last two visits his attitude about seating sucked and when we spoke to the manager they acknowledged it isn't the first time they heard this about him, well then fire the guy"}
{"text":"We enjoyed a meal (burgers for us both) before we boarded out flight home to Seattle this past weekend.

The wait was about 15 minutes but once we were sat, the service was pretty quick and friendly.

Prices are a bit high but I suppose that is to be expected in an airport.

Our few substitutions were made with ease and the food was really great!

We come through this airport at least twice a year so I'll be sure to stop here again for a very filling and freshly cooked to order meal."}
{"text":"If I could give this a zero star I would. Both of the items I ordered were unavailable, and the server thought it was funny. And apparently saw no desire to amend the situation. And she just showed up with the wrong drink for one of my friends. I'm just gonna head over to the bookstore and I'll just refill my water bottle I guess!"}
{"text":"I was in a hurry and went through TSA to be able to get to a sports bar and you DON'T HAVE the NFL Network!!! How are you a bar and don't have basic sports channels that come with DirectTV packages??

Bartender is nice. Haven't tried the food because let's face it, I'm too bitter."}
{"text":"My wife and I dropped into this place on a recent trip, while waiting for our flight out of Phoenix. In a nutshell, the food was good but the service was absolutely terrible. 

When we strolled up, we stood at the hostess stand like we were supposed to (there's a sign indicating at such), but it took quite a while for someone to finally help us. Our would-be waitress was too busy chatting it up with the bartender. Both of them had the personality of a fruit fly, and it was clear from the get-go that we were impeding their precious morning rants (about customers, tax cuts, etc.). When we finally got seated, menus were more or less checked at us, no recommendations, no friendly greeting, no interest whatsoever from the server. How can you be that burned out 30 minutes after starting your shift? Wow.

We did finally order, including the biscuits and gravy dish and their classic breakfast. The food came out in short order, but service continue to be poor. Nobody asked if the food was okay, no drink refills offered, basically just ignored us until the plates were all but empty. The chatter and personal conversations kept going the whole time, so nobody at the bar got any service either. At one point the bartender even went to a table and just sat there to eat, where the lone server stopped numerous times to continue conversation with him. Apparently neither of them gave a shit.

Also observed a couple of disgruntled workers wander out of the kitchen into the terminal, just out front of the restaurant, and proceed to bitch about work, including numerous f-bombs, right in front of the open patio. Keeping it classy, right?

The food itself wasn't bad, and I actually really liked the bacon and the amount of kick in the gravy. I would definitely eat it again, although not at this airport location. That's the only reason this place gets 2-stars instead of the 1-star it probably deserves. If the server had been even remotely pleasant or given a single refill, I could have easily given a couple more stars, but service matters. 

Can't recommend this place. As someone else put it, next time I'll get breakfast before going to the airport."}
{"text":"For airport food, actually pretty good. My waitress checked on me multiple times and was prompt when I needed to go. She gave me suggestions with the food, and was friendly. Prices are about average for an airport restaurant. I had the Pilgrim sandwich and would recommend it."}
{"text":"After a week in the Valley for Spring Training and a couple of great visits s a great Brunch on Sunday at O.H.S.O. in Arcadia, we had the misfortune of trying the PHX Terminal 2 branch.  Some employees argue with each other, making comments about customers loud enough for other customers. As I write this at the bar the woman to my right was trying to get someone to take her money for her check. These employees are not the same caliber of the employees at other locations.  I get the contract employees thing at airports but wow."}
{"text":"Maybe the worst hot breakfast. Cold and expensive, service ok. Coffee average. Tv's for sports. Servers friendly enough. Passed up a coffee stand with baked goods for this. Won't make that mistake again"}
{"text":"The food was good! I got the AZ burger. The waiter let me try a few samples of some beers (didn't end up liking any of them lol) and I ended up ordering a Bloody Mary, which was great! We sat outside and there were umbrellas that protected us from the sun.

Only complaint was the waiter. He was younger but didn't act professional. He asked us if we wanted to talk to his manager about 3 times for small issues that he could of handled."}
{"text":"To be fair, terminal 2 PHX is pretty grim.  This place doesn't do anything to help.  Beer is brewed in prison toilets apparently, waitresses are bitchy, and the bar is too full.  I had to sit at a table with random people (which is fine--at the bar), I couldn't see who was playing on the TV and I disappointed the waitress by not ordering food.  The beers posted on the board on the wall were not available.  Skeezy vibe.  But it's your only option so suck it up."}
{"text":"Depending on the waitress you might get service or not. Drinks didn't get refilled unless we asked. Fries were cold. Took 15 minutes even after asking to get our check. It was a mistake to visit this location. Avoid it if you can. If I had had change she wouldn't have gotten a tip"}
{"text":"A good location in the busy terminal. Staff mediocre - and the food...... bland and not thoughtfully prepared.  When it was dropped off I swear I thought it was the scraps from another diner.  Sadly not.  I would make sure you eat (breakfast) prior to heading to the airport."}
{"text":"We had an hour before our boarding time and these clowns couldn't process an order of chicken/waffles and a Cobb salad in 35 minutes.  After being told once, spontaneously, after about 15 minutes, \"coming soon\" and then waiting 20 mins and being told, \"I don't know what's going on,\" we left.  Avoid."}
{"text":"Not a bad option for food in the PHX Airport! Local Arizona beer and a good burger right before a flight. 

Don't expect something fancy because you're not going to get it. Service at the bar was quick!

The AZ Burger was really good! It also came with fries! I had a Hefeweizen to compliment the beer which was a good choice!"}
