{"text":"I booked this place for my mom's 60th's birthday and was happy with the turnout.  For our party of 13, I selected Dinner Set A (from their website) and substituted the dessert for Creme Brulee instead of the listed one.    The starter was a Tomato Bacon soup which was excellent.  Flavourful and not too salty.  For the main course, I had Chicken Ballentine stuffed with mushrooms & Goat Cheese, served with a Merlot sauce.  This was AMAZING.  I usually find chicken prepared at restaurant - especially white meat - dry.  But Oakland Hall Inn did a great job of making sure the meat was tender and moist.    Dessert was the most disappoint part.  Now, I'm not an expert on creme brulee but I'm pretty sure a nice warm brulee is better than a cold one.  The creme brulee was cold and topped with fruit.  I would have much preferred if it was warm and melted in my mouth.  Meh you can't win them all.  The atmosphere of the restaurant was amazing.  It's in a 18th century house which makes it cozy with a lovely warm ambiance.  It was a bit difficult to find for my guests because it's hidden right after an intersection and up a little.    Overall, great place.  A tad bit too pricey for an everyday meal but great for special occasions."}
{"text":"As mentioned by other reviewers, Oakland Hall is pricey. For the food it would be overpriced although everything they offer is exceptional. What justifies the extra price is the ambiance. The restaurant is set in an old home built in 1865 set on a hill at the corner of Yonge Street and Saint John Sideroad in Aurora.   I most recently visited with my wife for Valentine's Day. We sat in the solarium and were serenaded by David who played romantic songs on a grand piano.  The service was superb and we were never left waiting. Although we were there for a total of 90 minutes, the time flew and the food delivery was perfectly timed.  I highly recommend Oakland Hall a rememberable, special occasion where the Keg just isn't good enough."}
{"text":"We had a dinner for six where everyone was disappointed. Both the 5oz and 10oz tenderloin was over done and grisly, the shrimp wasn't tasty, the duck was plain and smothered in a blueberry sauce (which was OK but way too much) that over powered the duck itself.  The dinning room was very hot as they AC was turned down to accommodate the dinner who sat near the one vent in the room.   There is better for much less elsewhere."}
{"text":"This restaurant has been CLOSED FOR BUSINESS for some time now. Does not look like it will open up anytime soon."}
{"text":"I was desperate for a good meal on Sunday evening in Newmarket.  The good French place closed over a year ago, the good Italian place doesn't open Sunday, nor does the good fusion place.  So, I tried my luck at Oakland Hall Inn.    The ostrich carpaccio was an absolute marvel, truly the outstanding dish of this trip.  The wine was good, if not outstanding.  The duck really needed to be cooked substantially more.  I did, however, leave it up to the chef.  Not something I'll do again here.  The desserts were mostly not made on site (which was obvious from the pictures of them in the menu).  The home made ice cream was pretty good.  The 20 year old tawny port was outstanding.  The service was not good enough for this price point.  All in all, if the experience had been up to the standard of the ostrich carpaccio, I would have been thrilled and would be writing a five star review.  As it was, I felt vaguely disappointed as the place failed to live up to the promise of one dish and to the prices it charges."}
{"text":"I finally got around to coming here. I was unsure how the food and service would be after having read the other reviews. In terms of the restaurants I. Newmarket /aurora it is one of the best meals that I have had locally. They were very accommodating in meeting my dietary needs. Their raspberry dressing for Thor garden salad was outstanding.  The only criticism I can make is the food is over priced. My fish entree was $36 for 2.5 ounces of salmon, two scallops and one shrimp with veggies and rice.  I would go again but I would reserve my visit to special occasions due to pricing."}
