{"text":"This is a great neighborhood bar.  They just opened up an outdoor deck which is really nice. Darts, Golden Tee and Pinball. A million TV's. And the food is pretty good. They usually ahve live bands on Friday and Saturday nights."}
{"text":"Visited in December.  I was a bit disappointed to find that this dive is somehow exempt from the new PA anti-smoking laws.  They must not get that much money from the food they serve as that, I believe, is a major qualification for becoming exempt.  I'm not sure why PA can't catch up with the rest of the NE when it comes to forward thinking on health.  I stayed at this bar for as long as I could until the haze of smoke forced me to take my leave.  Complaints on air quality aside, this is definitely a local dive with reasonable prices, sparse lighting save for the glowing blue aura from the neon beer signs on the right-most wall.  They even have an old cigarette vending machine where you have to pull those levers or whatever you'd like to call them.  You can get something to eat, like a burger and fries, but I don't know why you'd bother.  Parking is on street and I imagine you'd get towed trying to park at the Uni-Mart down the street.  We were there too late to catch any happy hour specials, so instead we had $2 Miller Lite bottles.  When someone in our group ordered tequila shots, the bartender filled the shot glasses up all the way to the rim (just in case you're wondering, this is a good thing).  Overall, I would avoid visiting this bar again at all costs.  Now if you'll excuse me, I have to go wash my smokey clothes for the second time."}
{"text":"Been there twice. Had ribs that didn't fall off the bone. To me they not done right til they do. 2nd time ate outside. Service was extremely slow. One waitress to bar tend and Waite on tables. Not sure if I will be back."}
{"text":"Great atmosphere, exp. During the summer months the patio is the best and drinks are amazing. Only downfall is the smoking downstairs but thats my only complaint. The staff is great, food is delicious. I highly recommend."}
{"text":"Good food, pleasant waitress, comfortable but smells smokey"}
{"text":"5 star establishment...1/2 bit bartender... I'm sure this is ordinarily a great neighborhood bar with competent staff, but they must have put the b team in the rooftop bar tonite."}
{"text":"A very solid local bar. The bottom bar can get loud and crowded depending on the night, but the upstairs patio is pretty great to sit in during the summertime. A decent variety of beers, and very reasonably priced. The food here is your standard bar food, but everything I've had there has been really good. Even attended a birthday party here, and the service was fantastic. They really took care of everything."}
{"text":"Three times you're out. The menu looks awesome but food portion, ingredients quality and taste, freshness, presentation just suck as do the lazy folks that are employed here. I have mediocre expectations for waitstaff anymore, but every time we went, a mistake was made either with forgetting a side order or mispouring a drink or spilling one all over me and the table. Ugh. I'm just so done with spending $40 on a bitch session with a friend about your restaurant."}
{"text":"This place is very smokey since many of the customers smoke INSIDE the bar.  The food menu is your typical bar fare at typical bar prices.  I ordered the pizza and it was unfortunately on a frozen pizza shell that tasted like it was old.  If you are a pizza lover, I do not recommend the pizza.  I have been here for live music, which is nice when you are feeling live music for the evening.  However, no matter if I have come for the band, a drink or something to eat, the waitstaff are consistently subpar and you feel like you are inconveniencing them.   The tall woman behind the bar downstairs was just downright miserable.  I really want to like this place and not have to go the whole way downtown to watch a Penguins game, but I just can't put up with not being treated well by the waitstaff. Having many choices in the city, I will not be choosing this place again."}
{"text":"Very dirty bar.  Most of the bartenders are just texting and could care less about the people spending money.  Filled with smoke and it is dripping from the ceilings."}
{"text":"I went here last night to hear a band, but alas, I had to leave less than a 30 minutes after they started playing, the smoke become overwhelming. I didn't realize that it was \"smoker friendly\". The server was very helpful, but I will never return. We did not order food, so I can't comment on that."}
{"text":"great neighborhood bar and as for the smoking- who cares!  your drinking anyway! and if your a smoker than its even better. they usually have live music which is awesome, and they even have a upstairs patio deck which is awesome in the summer. good bar food also i ordered the fries and they were delicious. this place is usually packed on the weekends its hard to find a spot on the street to park. bartenders are usually nice and you never have to worry about a drink not strong enough!"}
{"text":"Went here with my friends a couple days ago. The older male bartender was really rude and over charged all of us to pocket the money. He also made us feel uncomfortable by staring at us the whole time. There is supposed to be an absolute special for four dollars all day everyday, but was charged 6.75 for each drink. Though that's not a big difference, I expect specials to be up held. Would not recommend if you are looking for a friendly environment."}
{"text":"If you like disgusting cigarette smelling atmosphere, then this place is for you.   Would have loved to try the food with my family, but were immediately turned off by the repugnant smell.  Eliminate the smoke and we'll give a shot maybe."}
{"text":"The Oakmont Tavern is a friendly , low key atmosphere with great bar food, drinks and TVs to watch games etc. The Sicilian pizza is awesome, but order extra cheese. Taco night is great too!"}
{"text":"I went to the Oakmont Tavern last night to visit with some high school chums and see a crack, cracklin' Motley Crue tribute band. Rest assured, this is most certainly not a dive.  When you order a chicken salad at a dive, that is if they even have chicken salad, it doesn't look like a culinary grad made it.   My lovely ladyfriend picked for me, as I just couldn't make up my mind. Her finger landed on the Pub Chicken Salad, and it was magnifique! Red onion, crumbled bits of blue cheese, mandarin oranges, walnuts, and raisins adorned the gigantic plate. The poppyseed dressing was a creamy, tangy opiate, and the grilled chicken breast was tender and slightly charred. Notice I mentioned the chicken last, as the salad was so good, you almost didn't need any meat in it, and I barely finished it. Yes, a salad filled the belly of this 200 lb. muscled workingman.   I also had the Loaded Baked Potato since I cannot pass on any hot spud made by someone other than me. You get two toppings. I went with sour cream and chili. Aside from the plate being too small, I have no complaints. It was monster, a headbanger's side dish, fluffy, with a chili that had a corned beef hash quality to it. Memories of Parkway Center Mall's Potato Patch filled my grey matter. In my opinion, a restaurant baked potato should be akin to an ice cream sundae, rich, creamy, and topped with things you don't have everyday. It should be as gaudy as it is gratifying. If Baskin Robbins added a lunch and dinner menu, The Oakmont Tavern's Loaded Baked Potato would be on it.   The live band playing that night was Dr. Feelgood, a tribute to everyone's favorite Kings of LA Sleaze. Professionals through and through, the band played expertly amidst arena quality lights and fog. My only complaint regards the location of the band set-up; it was in a corner of the bar not easily viewable and partially obscured by pillars.  Could a better space be made for the bands to play in?    That minor caveat aside, I urge you to go there and have a good time.  It's posh sans the upscale prices, the service is terrific, the people are fun, and their brand of barfood  will please any bon viviant. Pardon the smoke and loud music though. It's essentially Gullifty's run by rockers, so perhaps I'm a little biased. Hey, they're my people y'know?"}
{"text":"Likes...good \"bar style\" fish sandwich, love the beer selection and service is decent.  Knocks...I am bar fly but the smoke and noise are at times are horrible.  It is like a bad episode of Jersey Shore meet the Marlboro man at times."}
{"text":"This is the worst establishment I've ever been to. I've had multiple poor experiences here, but gave them the benefit of the doubt since I am an Oakmont resident. I wanted to like this place and kept giving them more chances than they deserved.   The staff is horrible and rude. They over charge you when you cash out your tab if the server/bartender feels they deserve a bigger tip. You will wait extended periods of time for your food and drinks or for anyone to even greet you at your table. The wait staff stands around and makes you feel like you are an inconvenience. There is a female server with a major attitude problem. I've had her a total of three times and she has been nasty every time.   This last time broke the camels back and pushed me to write this review. I attempted to order a French dip sandwich and asked for provolone instead of swiss, she said \"you want soup?\" with an attitude. I said no it's a sandwich and it comes with au jus. She rolled her eyes and snapped at me and said \"I don't even know what that is.\" I again said it is a sandwich. She continued to huff and puff and gave me dirty looks. I let the rest of the table order and decided to cancel my order. I have worked in the food industry for years as a server and never treated patrons the way this server treated me.   My table waited for the bill for a good 20 minutes after everyone was done eating. She came out and stated that she gave another table our bill and we now can pay their bill and it was working in our favor, because this bill was $5 less. This is not the first time there has been mix ups with the bills in my experiences.   Save yourself the headache and go to the Pub 333 or The Lot. Don't waste your time or money for the poor service and mediocre food."}
