{"text":"We ordered $50 of take out. Most went in garbage. Can't describe how bad it was. Take a pass on this place. Check my pic."}
{"text":"This place is subpar, even for Canadian Chinese. The fried rice tasted like it had been cooked over a campfire, and not in a good way. \"Spicy noodles\" were supposed to be Shanghai noodles- they were some kind of weirdly yellow spaghetti noodles or something with some chili flakes and chicken. No flavour, no vegetables. Even the red goo that comes with chicken balls was flavourless. it might be cheaper than others here, but not worth it."}
{"text":"Haven't dined in but had takeout. The food was exactly what you'd except for typical Canadian Chinese food and that's a good thing. Sometimes you want chicken balls in orange sauce. Excellent egg rolls. Reasonably priced as well."}
{"text":"Reasonably priced, good portions, and the ingredients were fresh.  This was our first order here, to be safe I asked for \"less oil\", and the friendly staff taking our order said \"no problem\". We brought our order home and it was excellent. It reminded me of the take out we would get when I was a kid, in Toronto.  If you ever wanted to know what Canadian Chinese food was like in the 80's, this is it."}
{"text":"I will not order from them again. We ate at the restaurant recently and the washrooms filthy, the light switch black with dirt  - grossed out"}
{"text":"I've ordered take out from them twice and really liked it. I use the Beyond Menu app to specify what time I'd like to pick it up and they've been on time. The food is hot and social if you ordered spicy dishes. The Szechuan Crispy Shrimp was so good."}
{"text":"This restaurant has the BEST general tso's I have ever tasted. The chicken is crispy on the outside and soft on the inside, and the sauce is flavorful and delicious. Because I love it so much, I won't order anything else - I'll leave that to my Husband, who has had around 9 different dishes from this restaurant, including the pad thai, and he loved them all.   I've tried other chinese restaurants in the area, and this one is my #1 go-to. Definitely check them out."}
