{"text":"I dont know what the food tastes like but after 15 mins of nobody taking my order I decided to take my hunger to Papa Joe's ( delicious btw) . Get your customer service together guys"}
{"text":"Food was ok they didn't bring out my friends meal about 15 minutes after mine it wasn't hot. Highlights greens although don't add salt. Waffle tasted like a piece of fish had been dropped in the batter but that was only one bite. Overall I'll be looking for a different place next time I eat in the area."}
{"text":"The food was amazing.  Everyone who work there really seem to love their jobs.  The food was home cooking at its finest I can't wait to go back."}
{"text":"My wife had a Groupon for this place and we're always looking for something different.  When we arrived we were greeted immediately and invited to choose a seat.  The building is not that big and looks to be set up mostly for take-out.  A young man came out from the back and let us know what the special of the day was as well as the next day's special.  I was sold.  I had the rib tips with collard greens and mac-n-cheese.  My wife had the smothered chicken with the same sides.  It was served with a big piece of cornbread and sweet tea.  The food was delicious and the staff was friendly like family.  We saved 50% off with the Groupon on our meal so it was a complete WIN.  In short this place offers a nice variety of classic soul food dishes with daily specials like ox tails and jambalaya.  I would really love to see these brothas turn this idea into something much bigger and I not only wish them success but they have my business and my family will be back for more."}
{"text":"Yippie, Off Da Hook is back open! I went for my old go-to smothered pork chops, greens, and cabbage. There was a miscommunication and they didn't have cabbage ready so I had a double dose of greens. Everything was as good as I remembered, I'll be back soon. Now all we need is to get them to carry diet soda."}
{"text":"My first time at Off Da Hook was also my last day living in Phoenix. I came in feeling a little sad with my good friends and just wanted to eat my depression away. Of course the best way to do that is to order the all you can eat meal and stuff yourself until your eyes droop, it's only 9.99 so you kind of have to.

For my first plate I got the chicken, mashed potatoes, and red beans and rice, oh and a piece of corn bread. Everything was perfect. The breading on the chicken was delicious, not greasy, and surprisingly thin. It packed so much flavor and texture into such a small amount of space that I was able to eat more than I thought. The gravy could have been drenched over the whole plate and I would have been happy and on top of the fresh and soft mashed potatoes it was divine.

My friends got the pork chops and catfish which were both equally amazing. The breading was just as thin, crunchy and delicious and it kept everything warm and moist inside. Sadly they were sold out of greens, cabbage, yams, and green beans which I have heard are the best sides. So I suggest you get there early if you can cause things sell out.

I've been to Lolo's and that place is really good but nowhere near as good as here. My friend mentioned to the chef that he thought the waffles at Lolo's were better and the chef took it as a challenge. He said that it was because the waffle batter wasn't 100% and that he would make us a fresh batch and see if he could change our minds. And he did. He even made us a waffle with bacon in it because we said we wanted to try one that way. It's delicious if you like bacon, which come on, who doesn't?

This place has great food and the staff are incredibly friendly. They gave me hugs as I left because I was moving and we took pictures with them. They made the amazing food even better with how personable and fun they were. 

If you are in the mood for soul food then this place is worth a trip. No matter where in the valley you are, drive the extra fifteen minutes to get here."}
{"text":"This place is right around the corner, so I was excited to try it out, especially since they recently added hours for during the week.  We went in on a Tuesday at 7, only to be informed that they were trying to close down an hour early because they had a busy day.  We got the chicken and waffles with a side of Mac and cheese and two drinks.  It came out quick enough, but were disappointed with the product.  Spending $31 to have my meal packaged in styrofoam to go, was not cool especially since they were supposed to be open until 8pm.  The chicken tasted like salt and not much else.  Mac and cheese was dried out.  Waffle was limp and soggy when I got home; and I only live 1 mile away.  I most likely would not return.  The restaurant did not seem very clean and may have looked better if they paid more attention to presentation instead of just slapping labels on the plexi glass.  I love supporting local business, but this one doesn't win any awards."}
{"text":"Andre, the owner of Off Da Hook Soul Food Restaurant, is a true foodie. When he noticed that the fried chicken breast on my plate might be a little dry, he cooked up a new one for me. His goal is to serve the same quality food in his restaurant that he'd want to eat at home. He can invite me there anytime.
     We each ordered a plate: smothered pork chops ($10.50) for Ken and fried chicken ($9.50) for me. Each came with two sides, so we opted for mac and cheese, cabbage, greens, and yams (all the sides are $4 if ordered a la carte), and corn bread. Since it was busy, Andre gave us some corn bread to \"keep us busy\". It was burn-the-fingers hot. Whether it got that way in the microwave I don't know, because it was so buttery-sweet-good it got eaten before it could change texture. The chicken was delicious, with a light peppery crust and moist meat. The two pork chops on Ken's plate were huge, and to use Ken's word, \"astounding\". They had also been breaded and fried, but they remained succulent. All the sides were outstanding, to a great extent because they're not loaded with salt. The cabbage was nice and sweet, and the mac and cheese gooey and rich (although I have to say that Bobby Q is still has my #1). The yams were fabulous - in a nice, lightly spiced syrup, they could have been dessert. Since the portions are more than generous, we took home a piece of sweet potato pie ($3). I'm glad that we hadn't tried it at the end of our meal as it was disappointing. The filling was one-dimensional and the crust unpleasant. Hopefully the peach cobbler or red velvet cake are better. 
     There are lots more things on the menu I'd like to try. I'm not sure Ken will ever be able to get beyond the pork chops. Ribs, meatloaf, fried shrimp, and oxtails. Some of Andre's family is from Louisiana, so there's gumbo and red beans and rice. Catfish and red snapper. You can even get baked chicken - but why would you?
     The restaurant is small, with an active take-out business. It's clean, tables get bussed quickly, and everybody is friendly. In fact, we spent a pleasant half hour talking food with Andre. There's another location at the swap meet at 5115 N. 27th Ave."}
{"text":"Super service and scrumptious food!  The greens are AMAZING!  Very friendly people.  Very clean, and I mean clean!  I went here for my birthday and one of the customers serenaded me and I got to sign the wall!  WooHoo!"}
{"text":"My pork chop could have been a little meatier and seasoned a little better. My wife said the fish was outta sight. It was fast and friendly service and I am likely to come back."}
{"text":"I had the pleasure of experiencing Off Da Hook during its first week of business at the new Glendale Avenue location. Without a doubt this is THE BEST soul food restaurant in Phoenix!  

You first notice the cleanliness of the establishment upon entering. Not your typical hole in the wall joint that you expect. Nice large booths, tile floor, bright colors, and that oh so sweet aroma of soul food !
 
I experienced soul food at its best. I concur with another reviewer that Off Da Hook by far exceeds Lolo's Chicken and Waffles.

The serving sizes are HUGE so go with appetites ready to be satisfied with all the traditional eats we are familiar with.  Prices are extremely reasonable, service was fast, and staff was very friendly.

Glad to finally have a place to call home for good soul food in the valley."}
{"text":"We were visiting from out of town and looked this place up. First it wasn't anything like I imagined. It was very hard to find because they don't even have a sign on the building. We walked in and it was much smaller than I thought especially for our party of 9! We went in June and the air conditioning was broken! We were so tried from traveling that we still decided to stay vs going somewhere else. We wanted to give them a chance. When we finally found something that they weren't out of, it took a while for the food to come. Even our drinks took forever. When we finally got the food it was very good and we were satisfied with what we had. I think they need to invest in their business and make this place so much better. If we're ever in the area we wouldn't go back because for the money we paid we could have gone somewhere much nicer with air"}
{"text":"After reading yelp reviews, and craving soul food closer than Lo Los, I decided to try Off Da Hook.  I really liked it.  It's a small place and you can see your food being prepared in the kitchen.  The fried chicken was different than what I have had, in a good way.  Really good seasonings.  I also ordered the red beans and rice and greens, and cornbread.  All of it was very tasty.  I especially loved the cornbread.  I ordered kool-aid, but it didn't taste as good as Lo Los.  

The only reason I'm giving it 4 stars is the service was a bit slow and I thought the menu could have been done a little better.  The man who took my order wasn't too friendly, but the two men in the kitchen who came out frequently were very nice.  The ambiance isn't great, but that's not what I went there for.  I will be back to try the cabbage (someone mentioned it in another review), the mac n cheese, and the breakfast special with chicken, waffle, grits, and eggs."}
{"text":"One of the best things I've ever tasted! 
I got the Town Bizziness Chicken. It's supposed to be a chicken ranch sandwich on the lunch menu, but I got it without the bread. It was unbelievable. The chicken was cooked perfectly - so moist. The ranch sauce on top was REALLY yummy. The fries were excellent. Ate there for lunch today and I want to go back already. They have several sides I want to try too. My son got the chicken fingers - delicious!
We enjoyed the friendly wait staff and the atmosphere.  I'm so glad we tried it. We'll go back soon."}
{"text":"I'll keep this short: Service was good. You will wait a bit for your food because it is made to order. The chicken was mediocre, and wasn't very flavorful. The sides that I tried including the cornbread, yams and beans were actually really good. I got the peach cobbler to go and it was like soup; not very good at all."}
{"text":"This place is soul food. We ordered the catfish dinners with sides of Mac n cheese and red beans and rice, absolutely delicious. The portions are huge! I'm born and raised in the south, and this is as authentic as you can get out here. Just like fish frys on Friday's at aunties! Great food, can't wait to go back and try more!"}
{"text":"Don't let the way the joint and guys looks fool you.
These guys KNOW how to throw down in the kitchen.

I have never in my entire life had anything this good. Everything they cooked tasted like home. When I think of the south. I think of this place. Everything is freshly made right in front of you. So you know its good.
Hands down the best chicken place you can go to. 
This is like a diamond in the jungle, small place, but the food is the best I've ever had. 

Trust me, I've had my shares of chicken. This beats it all out of the water. In my opinion, this beats that bobby Q place. 

You will not regret going there."}
{"text":"Chicken was actually fried to order and was so so juicy!  First bite of Mac & Cheese gave me chills down my spine! Delicious! Very well kept up on; compared to others my husband and I have been to. Will definitely be coming back!"}
{"text":"Some of the food is ok, but half cooked greens don't tell anyone you are from Chicago, cause we know how to cook. anyways they have a menu but sometimes the food on the menu isn't available. If you gonna sale rib tips after 5 please put it on the menu after 5 on such day. I went there for lunch and they said that i was suppose to get two fried pork chops but they only giving me one cause the pork chop was a big one. What pork chops come small, medium, and large now? I found another Place that I can get my rib tips from. i gave them two stars because their Kool-Aid is Off Da Hook."}
{"text":"Right off the bat... its a little ghetto.  A hole in the wall place w/ not much charm at all.  The staff is friendly and a little slow moving, but they make up for it in other ways.  The food is amazing, reminds me of my moms cooking.  You know.... southern crap thats f'ing terrible for you.  They're way over priced for the presentation of the food and look of the restaurant.  But then again, it taste really good.  Their proportions are large and you will definitely be full afterwards.  If you're more interest in the look and feel of the restaurant, then pass on this place.  But if you enjoy soul food, this is the place for you."}
{"text":"If ya'll don't keep this place nice and busy and it shuts down, I'm going to go ballistic.  With service as sweet as can be and hefty portions of what I call \"down home goodness\" it doesn't get much better than this.  It's what you'd make at home but don't because it takes too long, because you're cooking for one, because it's almost cheaper to eat here - I can't say enough good things about it.  My mouth is watering just thinking about it.  If I lived closer I'd be in big trouble."}
{"text":"Amazing hole in the wall, greens, red beans and rice were just like I remembered from North Carolina. Chicken had an amazing taste and service was out standing. Will add this location to my monthly travel."}
{"text":"This was my 2nd visit to this location... I just failed to write about it. This place is kind of GHETTO! I like that you can view them prepare the food. They had not made the MAC & CHEESE for the day. Hmmm...its 130pm! I ordered the Red Snapper Dinner and he brought out one piece of fish. I ordered Greens and yams which were quite tasty. Ok, I'm Lying! They were THE BOMB! BF ordered the Fried Chicken and Side of Shrimp with Potato Salad. SOOOO Good. The food made up for the slow service. As we paid he hands me a side of Red Snapper! I will be going to the other location on 27th maybe they are different service wise."}
{"text":"The food is incredible. Had a last minute celebration I had to plan for work and Andre helped me out on getting everything organized! The food was fresh and exactly what I expected and more!! 
Try them out! It won't disappoint!"}
{"text":"went there for dinner last night i had the catfish w/greens n mac&chez was all very good ...amazing breading on the fish i wish i knew how they did it, service was ok but slow and the place wasnt busy, on the upside self service soda fountain w/RC Cola (yae son) im going back there for some more good food"}
{"text":"I hear great things. Maybe they will be open the next time I go. Several friends say they are the best soul food in town. I went once but they closed early. I might give them one more shot."}
{"text":"Really good food, there is not much to choose from, however the choices they have will definitely be worth it. Food is fresh and hot. The customer service is okay, a little different then what im used to seeing at a restaurant. It wasn't l unwelcoming  so thats a plus. The place was clean, and the only negative thing I can say is that  they need to go menus. I would recommend this place to anyone try it out you will love it."}
{"text":"Clearly, a lot of love goes into Off Da Hook's N'Awlins home-style cookin'. Catfish and shrimp crunchy and NOT overcooked, chicken crispy and light. Great greens and the best yams I've ever tasted. Cornbread was yum-buttery. I wasn't crazy about the sweet potato pie, but next time we're calling ahead to reserve some peach cobbler (our first choice, but it sells out earlier than we lunch). Terrific friendly service, too. Our server invited us to take home a menu, but we'd already chosen our next lunches at Off Da Hook. My new fave soul food and southern hospitality go-to."}
{"text":"I love Lolo's Chicken & Waffles just as much as the next sheep but Off Da Hook Soul Food is where its at...NOW.  There's a new place that popped up on Glendale just east of 19th Ave which is a must go.  All Soul Food...All the Time...7 days a week in fact.

Get there asap..for a soul food experience you just might like more than Lolo's..Im just keeping it real because I think I rushed to this place because although Lolo's was my go-to spot, it was starting to become my have-to spot who occasionally gave me soggy waffles and fried chicken someone dropped the salt shaker in that day.

Note. I did not get to try the Mac & Cheese at Off Da Hook so that Lolo's still holds my top Macaroni and Cheese spot.

OK

Fried Chicken Wings:
Moist, Crispy, Not Greasy (seriously, it was all crispy grease-free skin, weird but very pleasant), less salt-mo pepper seasoning which is what I meant by this is a whole notha chicken compared to what I am used to... but I am freakin in love with it

Fries:
Good and with the all necessary seasoned salt

Corn Bread:
Bread, not a muffin, but I can live with that as long as I can slather hot sauce or honey on it I'm good

Waffle:
Extra Brown, Extra Crispy, Moist on the inside, and served with a modest amount (not a half cup) of whipped butter and some thick a** syrup in that pretty little glass syrup bottle.  Best waffle Ive ever had.  I always felt something missing from all the waffles Ive done before, but now I know the lasting brown crisp was what I have been missing because something needs to stand up to syrup.  Don't anyone come after me saying their waffle was burnt because just wait till your syrup lays all over that and you will know what it is I'm talking bout.

Kool-Aid:
Kick you in the pants sweet, but with all that ice it all smooths out

Price:
Average soul food prices
$7.00 - $9.00 a plate
$1.00 - $4.00 per side
Great basket specials like 8 wings & fries for $10, or 2 wings & fries for $4 I think? 

Atmosphere:
Typical, but lotsa people for only being a week, and it was nice to bask in a restaurant stinking with the sweet spice smell of homemade sweet potato pie.

Service:
Great service, waiter repeats all you ordered back to you, got my drinks to me within 5 minutes, food within 20 more minutes and totally-totally made up for the macaroni and cheese shortage.

4 stars for now...I wanted to do 5 but I didn't get to try more since my tummy can only handle so much goodness on one Friday night.

You will love it as an incredible change from the typical have-to spot."}
{"text":"Is this place still open?  Just moved into the neighborhood and DYING to try their food.  Called and called and called and called and called and... no answer, no voicemail box.

I've read on here that they sometimes close their doors whenever, without notice.   What's up, Off Da Hook??

Looks like dinner tonight is gonna have to come from somewhere else.  I will give y'all one more chance soon..."}
{"text":"Well I'm a little torn about this place. When we 1st walked in we were greeted & told to have a seat, someone came over to ask what we wanted to drink. Our only options were grape cool aide or sweet tea due to their fountain drink machine being out of order. I love sweet tea but WOW I think theirs was more like drinking strait sugar water. 
We ordered our food with the waitress, my boyfriend ordered the pork chop dinner & wanted spaghetti and red beans with rice as his two sides. They were out of spaghetti so he got Mac n cheese instead. I ordered the smothered chicken dinner but had to change to fried chicken dinner because they didn't make any gravy that day. I wanted mashed potatoes and Mac n cheese for my sides. A few minuets after ordering the waitress came back & said they didn't have mashed potatoes either. Red beans and rice it is then. 
It took 30 min easy for our food to come out. We were the only people in the restaurant. If it had only been my boyfriend & I we might not have cared but we did have our kids with us and they do get a little impatient. When we did get our dinner, wow, it was hot and fresh. My fried chicken was perfectly cooked and the seasoning in the breading was delicious. The Mac n cheese was ok along with the red beans and rice. My boyfriends pork chops were delicious, breaded of course & cooked perfectly. He loved the red beans & rice but not so much the Mac n cheese. Our dinners came with corn bread which was good as well. 
The food here was good, I would go back. My only suggestion would be for them to maybe make a daily menu of items that have so you don't sit & read a menu, decide on something only to be told over & over they don't have it that day. They really are hurting themselves there. 
Another couple came in before we left & wanted corn or green beans with their dinner and was then told all they have for veggie's that day were greens. 
The food was good but lack of options & not being informed of what you could or couldn't order until you tried to order it was a little annoying. Oh, I almost forget. The waitress / hostess girl was a little rude & was walking around texting & talking on her cell phone. A man kept asking her to put it away & she just ignored him. It didn't look very good."}
{"text":"Over priced and over rated comes to mind, my chicken leg was tiny, tiny , TINY and very pricey. It had a very good taste, for the 4 bites I got. Everything is custom fried, so plan on waiting for it.
 I ordered rice with gravy and the gravy had no taste. Don't think I will be back here again."}
{"text":"I'm a Nashville native and I was totally impressed with Off Da Hook.  
I ordered the smothered pork chop plate with greens and red beans & rice.  Everything on my plate was excellent and greens were some of the best I've had anywhere!

The staff was all incredibly nice and accommodating as well.  I now have my go to soul food spot in Phoenix, and I'd recommend this place to any southern born Phoenicians looking for a taste of home."}
{"text":"Off Da Hook is on the north-side of Glendale just across the street from the Fry's gas station.  There is limited parking in the front and more in the back.  They also take all credit cards.

I tried it out for lunch.  I ordered the 6 piece chicken wings with fries and kool-aid.  YEEEAAH!

The woman at the front had a great personality.  The inside is very simple.  Half a dozen tables, a soda machine, and a menu board.  The cashier brought out my drink and asked about condiments.  The food came out in 10-15 minutes and was 100% fresh, hot, and crispy.  

The wings had a nice crispness to them and almost tasted like chicharrones.  The fries were just as fresh and hot and had a good seasoning to them.  The house hot sauce had a strong bitterness from the vinegar but could have used a bit more heat.

Unfortunately the place was dead and it was lunchtime on a busy street.  Anytime you have 5 employees to 1 customer is not a good sign.  

I personally don't think I will return but here are a few issues that can be easily taken care of and bring in some more business:
When I came in a cook was cursing out another employee.  I'm cool with curse words but there was a 4 year old girl waiting with her mother and that's just not cool.
An employee took a smoke break behind the kitchen and the door was wide open.  I don't like to be smoked out when I am eating.  
The cook came out and blew his nose right after my food came out.  Poor form.  I was really hoping it was allergies and I don't get sick.  
The wings while good were tiny.  I have eaten tons of wings throughout my life and these were the smallest I ever seen.  I actually feel bad for the baby chickens that were sacrificed for my eating pleasure.
Lastly, the meal ended up being over 8 bucks with a tip.  For a lunch meal of 6 baby hobbit wings, fries, and koolaid is a bit high.  They would get a bigger lunch crowd if they put this closer to 5."}
{"text":"The food at this place is extremely good! But, they are hardly ever open so I don't know how they can make money. It's difficult to return to a restaurant that's hardly ever opened!"}
{"text":"PATHETIC!! I showed up at opening and was told \"We don't have waffle mix, should be here some time soon.\" It took 45 minutes for us to get our food and they were asking us what our order was.  Other people were getting their orders before us. Finally we get our order they FAILED to include the eggs and grits.  Pathetic service, pathetic portions, and completely over priced!"}
{"text":"Review #300. For my milestone review, the 300th of the year, I review a fun place for soul food. This family owned place serves up fine viddles. Be afore warned, though soul food might have had humble origins, but these flavors are fine and be prepared to pay for it, too. Thanks to my Yelping friends, especially Norm R., I chose the fried pork chop meal. The breading was crispy and delicious. The meal came with 2 good sized chops and 2 sides. I was struggling with which to choose. I decided on the cabbage and the candied yams. I was lamented over wanting to try the red beans and rice, and my wonderful server brought me a tasting of red beans and rice. The cabbage was okay, but the candied yams had lovely texture and flavor. The red beans and rice were AMAZING. I could have just made a meal of a bowl of that with their sweet corn bread. I enjoyed a tall glass of southern sweet tea. My meal came out around $18 including tax and tip. I was transported back to my haunts in Birmingham, Alabama. I can't wait to come back to try the fried chicken and get me some more of that red beans and rice. Compliments to the chef!"}
{"text":"If I could give this place zero stars I would. I am going to California next weekend and was told to try Roscoes Chicken and Waffles. That sounded like a good idea to me and I thought I should try a chicken and waffles place here in Phoenix and compare. Well, I found Off Da Hook and thought it sounded pretty good so off I went. 
   Sadly I will never know if this place is good or not. When I walked in, the place was pretty full with a few people sitting on the little couch in front of the area where you pay. I stood for a second then asked the people on the couch if they had ordered already. This is when then wheels came off. The guy sitting on the couch was rude when he told me they had already ordered. I thought I would wait a sec for the guy standing at the register to finish before I went up to place my to go order. When he left I walked up and waited for the person to come back and take my order. As I stood there I looked around the place and saw a very large employee looking at me. After a minute or so he walked over to me and said, \"why dont you have a seat and someone will take your order.\" I said no problem and mentioned it was a to go order. He looked at me and very rudely said, \"yah thats fine just sit down and we will be with you in a minute.\" I then sat down and the asshole stepped behind me about a foot and started talking to the people sitting on the couch. He sat there and very loudly started insulting me. Telling the people on the couch how stupid I was for standing in front of the register to place a to go order. He was no more than a foot away from me while he was doing this. This is nothing but disgusting behavior. No way in hell am I every going to let anyone to treat me in this manor. I stood up and walked out. This guy is a pig and nothing but. DO NOT GO TO THIS PLACE FOR ANYTHING OR ANY REASON. On the way to this dump I drove by Chik-a-rib just down the street so I went there instead. The people there were incredibly nice and bent over backwards to help me while I was there. I ordered the chicken and waffles with onion rings and mac n cheese. THERE FOOD WAS FANTASTIC!!! If you want chicken this is the place to go. Not where the rude assholes work."}
{"text":"I don't know what the negative reviewers are talking about. I just finished stuffing myself with 2 chicken legs & a waffle. It was delicious. I tried bites of my friends' catfish and porkchops, also good. The porkchops are deep fried rather than pan-fried. Everything arrived perfectly breaded, hot and fast. I love deep fried anything unless its overly breaded, the breading isn't spiced correctly or its greasy.  None of that is the case with anything we ordered. The mac n cheese was clearly homemade (the only thing we had that wasn't fried). My only disappointment was I didn't save room for the red velvet cake."}
{"text":"At last, a soul food place not too far from where I live! Ryan C. was right - the pork chop is scrumptious, and the breading is fantastic: an ambrosial crispness/flavor combination. And thanks to Deb. L's review, I knew I had to order a side of cabbage, too -- and I'm glad I did; the sausage and bacon made that vegetable side really delicious. I know I'll certainly be back for more goodies, such as the chicken and waffles... though not very soon because this foodie is on a budget and they're a bit on the pricey side."}
{"text":"At first glance, the place seemed small and ambiance is minimal. 

The catfish is great, and the prices are decent considering the amount of love that goes into the making of the food. Everyone that works there truly cares about your appetite satisfaction. From the busboy to the cook-- they each asked us about the taste of the food numerous times throughout the meal. 

Even though I was sitting 1 step away from the fountain drinks station, the cashier kept my drinks full. 

The fact that they sell kool aid pretty much made them the coolest place in town for my kids. Our family meal was delivered in homestyle china bowls, which reminded me of my Granny's house."}
{"text":"If you advertise as being open from 11am to 8pm on a Sunday and you're closed at 3:15pm...this doesn't win you any new customers. 

Right before I left, a guy pulled up in his SUV. I thought he was a customer, so I told him that the place was closed. Imagine my surprise when the reply I got was \"I know\".

Right after this, he unlocked the door and went inside.  

You may have noticed that I haven't given a score, but since there was no service, this business gets this scathing review and a negative rating."}
{"text":"I do not even know where to start...

It brought me back to North Carolina, Georgia and Alabama. Its the real deal, with real food and real people. Smothered fried chicken with greens, mac and cheese so fresh and cabbage made authentically. They make a joke and throw in some cornbread without you even having to ask. The food took me back to a simpler time. I just sat there silently eating with a beautiful goddess I call my wife just smiling while eating. Brought tears to my eyes and I ain't even lying. God bless ya'll and thank you again. I mean that. The 7 up cake and the peach cobbler are excellent desserts as well. And I never get dessert ha ha"}
{"text":"Great food. Catfish was good. If they had bigger catfish portions they would be comparable to my southern friends catfish which I have not been able to find. Closest I have seen in any restaurant. Tartar sauce was homemade and awesome. Potato salad was excellent as well."}
{"text":"Kind of a weird place.  It's ran by a couple really nice dudes.  I had the 3 piece chicken meal, and the chicken was really juicy.  The fries were fried just right as well, extra crispy.  I'd like to come back and try a bunch of different things from their menu."}
{"text":"They were closed for a while...when we were driving by last Friday, I noticed they were open again...score!!!

Just happened to find myself (sort of) in the area Saturday...around lunch time...since I was almost right there (within 5 or 6 miles), I dropped by for lunch.

Man...if you want good fried chicken in Phoenix, this is the place to go.  Got 2 pieces with mac-n-cheese and red beans with rice.  Mmm-mmm-good!

Everybody was really friendly, too...makes it extra nice to visit.

Give them a try!!!"}
{"text":"Little hole in the wall spot, but don't let the size sway you. Hot juicy made to order chicken, dreamy Mac n cheese and flavorful greens.  Friendly staff and 3 kinds of Koolaid  Call ahead for takeout, chicken takes about 15 minutes to fry."}
{"text":"I got a delivery order but I'm sure my review would be the same as if I dined in...fish and chips was pretty much not edible, the fish tasted to heavily of dirt I couldn't eat it (I catch catfish and know this is not the way it should taste) and the fries were thick cut but limp.  The chicken and chips my husband had (3 pieces) he only ate 2 pieces because although the chicken was well cooked it was extremely boney and the breading was tasteless. Sorry, I really wanted some good food on July 4th, but this was not it."}
{"text":"The first time I came here, the owner (Dre) was there but the restaurant was closed for renovation. However, after I told him I wanted to try his chicken and waffles, he let me in and personally cooked my meal. I loved being catered to as the only person there and the fact that he opened up and cooked just for me made my day. He's a really down to earth guy and kept me entertained and laughing while I waited.The chicken (breast) was flavorful and juicy and the waffle was delicious. Lemonade wasn't on the menu but its there...and surprisingly good. 

The second time I came, I had more fried chicken (cliché I know) cabbage and rice and gravy. Chicken was still good so consistency seems to be a factor here, cabbage was great! Seasoned perfectly. The rice and gravy was ok...gravy needed a bit of salt. Cornbread was plentiful, melt in ur mouth delicious, soft and moist. Overall, both experiences ensured I'd continue to come back again and again as they can outcook LoLos (I call it No-Nos) anyday. You may have to wait a bit since it is made to order, and all soul food is a bit pricey but it's worth it! Satisfied customer :-)"}
{"text":"Fried chicken and waffles just don't get better than this place. They work hard to make their customers happy and they do a great job. All food is cooked to order, so it's hot and fresh, no lights keeping it warm. Chef talked me into having my chicken \"wet\" (smothered in homemade gravy), awesome! The difference between 4 and 5 stars is; is it clean, is the staff friendly. Off da Hook is spotless and the staff is great, well deserving of 5 stars."}
{"text":"I'm going back.  I'll get that out right off.  
This was my first experience with chicken and waffles and I was NOT disappointed. 
 I have to agree... the service was a little slow, but when I explained it to other people, I did it like this: \"If you just walked into your awesome neighbors house, and said, 'Hey, I'd like you to make me ____for dinner, and they just whipped up with a smile on their face, and you can taste the LOVE in the food....\"  seriously.  
Who needs ambiance when you have amazing collard greens?
I don't give 2 snorts how the place is decorated or if there are mirrors in the bathroom, because honestly, I don't want to see myself stuffed to the button poppin limit like that, ha!  It was clean, the folks in the kitchen were happy to school me with my greens technique... and that cornbread....was like a warm hug at the end of the meal.  GO."}
{"text":"Not bad...Taste like what I make at home...

It looks like a hole in the wall joint but the server was very friendly."}
{"text":"Tonight we found our new little hole in the wall joint. Brand new at this location ( the owner has another in the camelback swapmart)  this is one sweet little find. Housed in a small restaurant that just opened in the beginning of January . 

Clean and neat as you enter this place ,  it seems ready to meet all your soul food needs. The menu offers such standards as fried chicken , fried catfish , ribs,  waffles and my new favorite  fried shrimp. We we first entered the service was a bit off , with many people coming in for take out and us sitting down we kind of got lost in the crowd. But soon our waiter got back to us with apologies and we were ready to start the meal.   For tonight's meal we had Catfish , cornbread , yams , fried shrimp, cabbage , beans and rice and sweet potatoe pie.   From the first taster we were happy with our choice to stop in. With tons of pepper and soul this food made us feel homestyle good. We were impressed with each item with exception to the macaroni and cheese , which  was a bit bland in comparison to bursts of flavor in everything else.  Big favorite were  the cabbage -wow what a tasty surprise great home seasoning and velvety taste. 
We also really liked the sweet potato pie , it was in a light crust and had a delicate flavor not overly sweeten and very smooth. 

The owner is a big sweetheart of a guy and offered us a taste of his new macaroni salad which tasted like dear old moms.  Yum! 

If you go give a call and ask if they are serving your favorite because with the great tastes they are serving they go quick!   Can't wait to go back and try the ribs!"}
{"text":"Off Da Hook Soul Food is a catchy name. A small whole in the wall place with a friendly staff. They seem to do a lot of take out orders. There's not a lot of parking for dine-in patrons.

I had the fried pork chops with a side of red beans and rice and cabbage for $9.50 plus tax. The skinny pork chop was definitely fried but the taste wasn't the greatest; probably the worst pork chop I have ever had. They didn't have mashed potatoes, who eats pork chops without mashed potatoes? They give you a lot for the sides. The red beans and rice were great and the cabbage was good as well. The corn bread was a little dry and not at the top of my list. They don't have a choice of diet drinks at the help yourself soda station. But it looks like they may sell canned diet drinks."}
{"text":"Food was fresh. Cabbage was on point! Great customer service. Could've been a little bit more clean. Would definitely go again."}
{"text":"Food was really good. The Pecan Pie was good as well. The place could be cleaner. I'll go back for sure"}
{"text":"I think they are closed. Phone's been disconnected for months. Very sad, loved eating here."}
{"text":"I've been meaning to try this place for a few months now. Today was the day it came to mind at the right time to satisfy my lunch hunger. Rolling in, I immediately noted 'Under New Mgt' posted out front. So, the first thing I asked my server, Stacey, was when they took it over, which was mid-October. Just FYI if your experience was sometime before then. 

I don't know why, but I immediately began scoping the BBQ offerings, rather than the soul. I chose a $9 rip-tips special, with fried-okra as the side, and then went for a 3-meat plate with sliced brisket, hot-link, ribs, and greens for the side. I was assured that the latter were NOT canned, LOL, as has been rumored to be the case at one well-known establishment in town. 

I snapped a picture of the platter that came out, and was able to post it here. It was well-plated, and what I would consider a fair value for the dollar. The okra batter was light, and not all greasy. This really let the taste of the slimy little nuggets come through. Greens were as-stated, and did not disappoint, right down to the delicious broth. There were four nice slabs of the beef, three ribs, and a link that was already cut-up. While not disappointing, the link was by no means spicy as one might think. The beef had one nice edge of fat along one side, and was reasonably moist. Ribs were quite tender, with enough smokey taste to let you know they were cooked right. The rib-tips were quiet large, more like you would see with burnt-ends. Each one was more than a few bites. This was the only meat that was at all tough. However, the side of delicious vinegary BBQ sauce took the edge off of it. 

As another viewer noted, there was no tea on-hand, but my server said he would make some for me. He said that with the soda-fountain in the dining room, nobody really asks for tea. The walls are entirely covered with notables in Black History, and it took up most of my wait for the food taking them all in. Many of the pics are captioned, but a few are not. After the owner, Terry, was done cooking for those present; he graciously took the time to answer my questions on the few pictures that I didn't immediately recognize. Neat stuff! 

Another couple in there with me were up from Tucson. They both had some soul-food choices, and told me that they were pleased, and would return when in town. That's what I'll explore on my NEXT visit."}
{"text":"I was very pleased with my meal. I ordered catfish, rice & gravy, greens, cabbage & yams. They called me to say that the rice was taking too long to cook. I chose mac & cheese rather than wait on the rice & gravy. My meal was great & so was the sweet tea. I'll definitely eat here again."}
{"text":"We can't give anything more than a 1 star. We hate feeling that way because we love to support local businesses. It might've been that we came on the wrong day but we weren't the only unhappy patrons there. Since we've moved to Phoenix,  we have really been craving soul food. And the reviews have led us here first. 

To start off, we walked in and the first thing was the smell. Just got done cleaning maybe? But it shouldn't smell like you're reusing the water or rag or whatever it is that you're using to clean. 

As we are looking at the menu on the wall, the chef walks up to the front and hands us the menu & informed us that the guy taking our order will be right back. (He was across the street buying ice for the soda machine). Shouldn't this have been taken care of before you open? We were there for 15 minutes waiting for him to come back when the chef finally decides to put our order in first. So we're sitting & waiting & still waiting. For a very long time. The guy with the ice finally comes back & fills the machine & heads to the back. A woman then walks in & heads back there as well. Now we are a little less agitated, given that the chef finally has help, maybe our food would be out sooner. By the way, the other patrons were there before us and had been sitting down & looked comfortable when we walked in. Anyways, needless to say, almost 40 minutes later, the food comes out for both tables. Ours came first even though they were there way before us. Now at this point we were both thinking, this better be the best damn food in town considering it just took 3 people almost an hour to prepare. Nope. We were so wrong. My face definitely showed. And we figure the other couple thought the same because they just packed up the food & left. I tried the platter with a little bit of everything, porkchop, catfish & fried chicken. With Mac & cheese & greens for my sides. Far from soul food & left a pretty bad taste in our mouth. The catfish was powerfully salty. The chicken was tremendously greasy & you can certainly tell the grease was not properly cleaned. The porkchop was dry & more breading than meat. Now I love spicy and the greens were spicy. Too spicy because we couldn't taste the greens. Not good. So far everything is just upsetting me more and more & at this point I just want to go. We just spent $55 for not even mediocre food. He ordered catfish dinner with 2 sides of mac & a Waffle that never came because they said it kept burning. How do you burn a Waffle using a wafflemaker? So they packed our Waffle and sweet potato pie togo. We never left a restaurant ready to go to another but we were starving. We had to decide though because we just spent $55, so we would just have to settle for something cheap and fast. Smh. 

Before we left, the guy that went and got the ice comes out and ask how the food was. I, on one hand couldn't say anything because It wasn't going to be nice. My husband however wanted them to feel good. I wanted to punch him because he lied and that's not helping them if he lied and said it was good. He proceeded to tell us that he had just got back to the restaurant and that he use to be the cook. He knows the food wasn't good and next time he'll be sure he is the one cooking. I was shocked. So you know the food was bad and still served us but more shocked because he came out talking bad about his coworker. That's not a good look. Even worse, the chef comes out 2 minutes later & apologized for the wait & also apologized for the food & that next time we come, it will be better! You guys could only imagined my face at this point. So you also knew we didn't enjoy the food and still took our money. Shame. Oh but he wasn't done. He then proceeded to inform us that he was working with 2 adults that acted like children. That he was better off by himself. Double shocked!!!! They are in there just bashing each other behind one another's back. SMHx2. 

We said thank you & we left. Walked up to the car and trying to decide where to go eat because we were starving. We got in the car and decided to try the pie & waffle. Oh to my horror, the pie filling looked like it came out of a can. And the pie crust wasn't all the way ready. I was sick looking at it but I tried the filling and bad, it was bad. On to the waffle. My husband opened the boxed & just threw up his arm & asked me WTF IS THIS? They still managed to give us a burnt one. But of course, we tried it anyways & yes, it was the absolute worst Waffle in history. It actually made the food look really good. We were really disappointed and only hoped this is not a daily occurrence. Needless to say, we gave our dog the food. Even though she ate it, I don't trust her because she drinks out the toilet & loves to sniff butt."}
{"text":"Off Da Hook Soul Food is a solid 3 to 3.5 stars but I will upgrade them to 4 stars based on the exceptional service we received. Don't judge a book by it's cover.  The same thing holds true for places to eat and that includes this place.  They are a very small \"hole in the wall\" kind of dinner.  If you blink twice while driving past them you may miss them.  They are a nice alternative to the usual dinner's in Phoenix. 

They offer some of the basic Soul Food options with almost everything fried of course ~ pork chops, catfish, chicken.  No oxtail, rabbit, ham hocks or chitlins though.  Not that I order chitlins but it's hard to beat good rabbit and ham hocks when dinning at a Soul food place!  They offer some of the more popular Soul food types of sides such as collard greens, mac-n-cheese, yams, beans & rice, cabbage, and some others.  However they don't offer fried or cooked okra or turnips, which are Soul food staples.  Corn bread comes with your meal and they offer Kool Aide in addition to soda and tea.

I had the fried Pork Chops with sides of mac-n-cheese and red beads in rice.  The breading on the Pork Chop was DELISH! It had a lot of crunch, with an excellent balance of seasoning that was \"finger licking good\".  The sides were ok, nothing special but good.  I wanted their Collard Greens, but they weren't ready which was unfortunate ~ maybe next time. 

We also had their fried chicken and waffles.  WOWsers!  The fried chicken had the same or similar breading as did the Pork Chop.  The chicken was fried to almost  perfection and their Waffle had an great taste that wasn't too heavy and complimented the fried chicken very well.  Look out LoLo's!!  This place is just as good if not better!"}
{"text":"As others have noted, the hours here seems a bit more arbitrary than posted. Kind of frustrating because -- and I don't know about you -- I pretty much go to soul food when I got a hankering for soul food. 

Service is great and I appreciate what they are doing there. Everything is cooked to order and everything I've tried has been spot on. Excellent greens, mac n cheese, chicken, and catfish (of note) but the star is the peach cobbler, in my opinion, while Jenny votes for the sweet potato pie. 

I love that they offer Kool-Aid even though the meal is rich enough without adding like a liter of sugar. All in all (and if it's when they are open and cooking) ODH is my soul food restaurant of choice."}
{"text":"Off Da Hook is just amazing! The prices are very reasonable, the takeout offers in particular. But the food is pure awesomeness. The fried chicken is lightly battered and simply perfect. We also had and loved the smothered pork chops, rib tips, and catfish. The latter two while very good couldn't keep up with the chicken and pork chops which were a standout!

Sides were fries, yams, and greens. All great choices! And for dessert (despite having no room) peach cobbler and ice cream. Andre takes obvious pride in the food preparation and his wife Tora couldn't possibly provide better service in the front of the house!

WE... WILL... BE... BACK!!!!"}
{"text":"Hours are wrong. 
They stay open till 9-9:30 on Friday and Saturday nights. 
Hopefully will have longer hours on these nights. 

4 booths of 4. 
1 larger corner booth. 

1 table for 6
1 table for 8."}
{"text":"My Husband and I have been searching for GOOD fried chicken and fish since we moved to Phoenix over 2 yrs ago. We both agree that Off Da Hook is the absolute best!! Both were fried perfectly and the seasonings used were amazing!! The staff was very friendly and made us feel right at home. I promise you won't be disappointed!! We will definitely be visiting them again!!!"}
{"text":"Cornbread, crispy fried chicken and a waffle..mmmm..mmmm!!
I've friends that rage about that other place in south phoenix, and would be glad to visit, but i came across this place while doing some shopping with a friend. It's located where one of my favorite greasy spoons used to be, but sadly they closed. The place was in desperate need of a makeover, and it got it! bright and clean when I was in a couple months ago, and the owners were cheerfully at work in the kitchen. They'd been open for awhile and are not new to the phoenix restaurant scene. If you're looking for Soul Food in the north-central valley, give this place a shot!"}
{"text":"Best fried catfish I've had in a long time. The customer service was good. The restaurant was clean."}
{"text":"In my opinion, probably one of best in town for soul food.What makes Off Da Hook different from the competition is their chicken. Very well prepared and seasoning that you can actually taste. My next visit I will try the catfish"}
{"text":"I'm trying to understand why I have been here twice during open hours listed and they are closed????"}
{"text":"This is a hit and miss, seems like they opened when they feel like, I had there chicken it was good, but not the Wow factor, wanted to keep trying different food there, but like I said, it's one of those hit and miss if there open or not. I heard the owner was ill, but they could have at least put a sign up and letting us customers know about it, oh well If I drive in that side of town and if it's open great, if not oh well"}
{"text":"This review makes me sad, but yeah. 

So we went back for another go of this place, we love chicken and waffles. 

We walk in and are seated. Our server comes over and rattles off a list of about 5 or 6 things they are out of, kinda disappointing. But whatev. We find things we want to eat. 

The Mac and cheese tasted like it was 5 days old and had been re-heated and re-heated and re-heated more then it should have. 

The corn bread was very lack luster this go around. 

AND THEN IT HAPPENED. Something NO restaurant wants to happen. I am eating my chicken breast and half way into it, RAW chicken! I wanted to die and instantly felt sick to my stomach... 

The server was very apologetic and did take my meal off the tab, but dang, that was upsetting. It will be a while before the husband can convince me to give this place another chance."}
{"text":"This place was not bad at all. But i have a few complaints, soo i will continue this yelp....

Service was good, seated immediately. The server was very friendly and always had a smile. BUT we waited after ordering about 45 mins to 1 hour for our food. (at least we know its made to order). We only ordered the big chicken and waffles breakfast combo and a thigh and waffles on the side. So not a big order for that long of a time. The cook knows what he is doing, and the food came out great.

Unfortunately since i am yelping my experience, they didn't seem familiar with their menu and forgot my eggs :( , but when i mentioned it they were more than happy to get that out :) which is a plus. 

I really was bouncing between 3 and four stars, but it landed at a 3 after further deliberation here is what it came down to:

-The waffle and chicken were skimpy for the price (on the combo), i have had some really good CnW. 
-Wait time for food was too long
-Price was too high for not getting a lot, I would recommend getting a thigh and waffle a la carte instead. a lot more meat"}
{"text":"An acquaintance of mine posted a picture of his food from here yesterday so I decided to give it a try, was REALLY excited and drove 17 mins. I get there at about 4:45 and there's an open sign on their door but the door is LOCKED. WTH! I was highly pissed off! Doubt I'll ever give them another try."}
{"text":"As a west coast girl, knowing what good soul food consisited of never my forte. 
Then I moved to Atlanta for almost a year...driving...so i got to experience diff states in the souths sould food.  Collared greens always sounded scary to me and if you werent tuna, salmon or something i usually find on my sushi menu...you are prob a fish i havent bothered to give a chance :)
well after having fried catfish with some great traditional sides while in Nashville, then again while living in ATL, i feel i can give a better opinion.
Living in AZ, I was weary to even attempt to find some soul food.  But after reading some Yelp reviews, I decided Off Da Hook was worth a shot.   And thank goodness, because their catfish was amazing, collards were great and red beans and rice phenomenal.  
Needless to say, i'll be back.  
If you are in AZ and appreciate great soul food, then maybe ill run into you :)"}
{"text":"This place is amazing! The food was delicious, the waffle was like no other.  The service was great, very attentive and nice. I will be returning."}
{"text":"Off Da Hook as improved 1million percent since the last time I was there, which I believe was late last year. I purchased a great deal on Groupon and went in with my wife on a Saturday and had the Pork Chops, while she had the Fried Chicken, both with Rice and Gravy and Greens and it was fantastic! I will definitely be going to back soon. The only hangup is that there's only 5 tables, so you may not always be able to eat in the restaurant, but they offer carry out so it's not too bad."}
{"text":"I had lunch here based on the good ratings posted on Yelp. The place is definitely a hole in the wall and the service was good and very nice. I have never had soul food and therefore can not judge it's authenticity, but I can say that the food tasted great and was prepared with love. The catfish was very tasty and flavorful, the mac-and-cheese that came with it were okay. I would go back to eat at this restaurant."}
{"text":"The place is old school home cooking. Chicken is breaded in cornmeal and fried crispy brown. The fries are thick cut and fried good and brown. It is served in an aluminum pan. They serve the best rib tips. And they have kool aid. The place was open until ten last night. The owner has been ill. His legs are still wrapped. That is why it was closed for so long. We are glad he is back open"}
{"text":"3 Stars because they can be hit-or-miss with service and they are often out of items on their menu. With their short hours (they open at 11am and close at 7pm, why?) and standard menu, it's puzzling when they're out of multiple menu items. 

They're pretty friendly, in fact, we've never had a \"server\" who wasn't ready with a smile, but can be fairly slow at times, even when there's hardly anybody else in there. With their kitchen door open to the dining area, you can pretty much watch them cooking, so when they're goofing around and you're waiting a while for food or for your order to be taken, you can tell it's just because they're in no hurry. Not a good place to go if you are on a schedule.

That being said, for the days you don't mind possibly waiting around and not getting what you came in craving, it can be a lot of fun to just experience their operation. 

The food has always been good. Overall, very low-key and a bit divey, but clean."}
{"text":"So, I was hungry, and I didn't want to cook. I felt like I needed some Chicken and waffles, so I came here today for some lunch.  It's a small little place, pretty simple inside with a great menu of chicken, waffles, kool aid and a variety of other menu items that are tasty.

Staff here was friendly and awesome and I had a really good time. I went with the Chicken and Waffle Combo for $10 and it was tasty! The girl who waited on me was awesome and even had a mohawk.  I'm happy, full and ready for a nap. I will be back!"}
{"text":"The Best SSSSOOOOOUUUULLLL FOOD IN ARIZONA.
Hit food
Tasty
Nice portions
Great Service!!!!
Visit this place .......
You won't be disappointed.!!!!"}
{"text":"Excellent all around. Great people and down to earth food. Sides are great. Brisket is perfect. A hidden gem in Central Phoenix"}
{"text":"This establishment is lacking professionalism. AZ went there several times to order food, at the date and time if there are scheduled to be open. This place was not open and does not adhere to hours and days that are posted. Also, the food is great, however I believe it's overpriced. Also, customer should not be hearing the workers conversation as they prepare a customer's food."}
{"text":"Had delivery horrible old food chicken dry mac n cheese greasy n old yams had a hunk of brown sugar 4.50
For a cake that was really a bite size muffin never again the shrimp dinner had corn old and green beans cold. Could use cornbread as a door stop never never eat here again"}
{"text":"The best Soulfood in Phoenix. Fresh and Homemade.  Service is great and people are great!!!!Open for lunch mon-fri 11-2:30 And Dinner everyday mon-sun. Feel blessed when there, have some real 7Up cake, just like I make.  Real Pecan Pie and Cheesecake and sweet potato pie!"}
{"text":"I love the ambiance. It is a small little place- it has a ma and pop type feel to it, which I love because it is not a chain or trendy. It is just a little place with some delicious home cooked soul food.

The staff are very friendly, welcoming and hospitable. They make you feel comfortable as if you are visiting a friend or family member's home. The food is amazingly good!! My spouse and I have visited 2 times so far and have yet to be disappointed. We got the fried chicken both times and all I can say is -- it is on point!!!!!  Juicy and crisp :-)  The mac and cheese was my fave. The greens are to die for and a must try. The red beans are some of the best that i've ever had. And the cabbage - YUM. I recommend finishing off with the peach cobbler which is a deliciously sweet way to end your meal.

Note---- We were informed that Sunday's after church are busy days and they have a tendency to run out of greens and depending on what people are craving that day some of the other sides may run out as well."}
{"text":"Had Fried Chicken today  and a side of greens and mac and cheese definitely was off the hook"}
{"text":"I tried this soul food restaurant today with high hopes of some delicious home cooking style Soul food. I got a to go order with a Good old 10 piece of fried chicken, corn bread and some rice and gravy... Sounds delicious right? Well, let me tell you, after waiting 25 minutes for my food, I stood up from my seat and peered into the open kitchen to see if there was any hope of my food coming any time soon, just in time to see my rice and gravy come out of the microwave!!! Not only that, but they put the Styrofoam take out container directly in the microwave! Anyone that knows anything about Styrofoam knows that it is hazardous to the food to put it in the microwave.. I won't get into the details, Google it for details.  Another 5 minutes and my food was hand delivered to me in the dinning room. I drove the 4 minutes home, and realized then that they didn't even give me the corn bread I paid an extra $2.50 for, as it \"didn't come with the 10 piece chicken\"... The only saving grace whatsoever is that the chicken itself was pretty good. But I would never go back here.. And I would certainly not suggest anyone else venture in."}
{"text":"Whenever I get a craving for fried chicken or catfish like my North Carolina-born grandmother used to make, I head to this place (so incredibly grateful they are in my 'hood!). Both dishes are homemade, the side dishes, too! (no canned yams here! You can see the print on the yams where the skin's been removed and taste the brown sugar and butter baked in.) The cornbread is crumbly and delicious. You can taste the hints of butter in the crust and the portions are generous, but not embarrassingly so. They really get the right way to fry chicken (if you've only had fast food chicken, just drop what you're doing now and head over to Off Da Hook!) The skin is crispy, not too salty and the meat underneath tender and juicy (not dry!!).

Soul food is about so much more than just the taste of the food. It's the hospitality and warmth of the cooks, the way they make you feel like you're at home.  Everyone here is welcoming (and I sincerely appreciate the old school R&B coming from the sound system.) 

I truly hope this place has a long run here in Phoenix."}
{"text":"very small and dirty looking and nearly no parking.  as we were in the mood for soul food and lolo's was closed, we read reviews for this place and decided to give it a shot. we called ahead, as we are 30 minutes away, the young lady on the phone told us that they would be open until 10pm. great we thought. we showed up around 645 pm and there was nobody but a gentleman at the register, chatting it up and belly laughing as we stood there awkwardly not being acknowledged. we decided to seat ourselves, we sat nearly 5 before the gentleman motioned that the menus were up where he was, still on the phone mind you. we sat and looked over the menus, still not having been greeted by anyone. 10 minutes or so later, a young woman comes out from the back and rudely states that we must leave. we asked, why? her response was they were closing in a couple minutes, and if we wanted to order we could only choose from their two specials. we mentioned that we spoke to a young woman over the phone and she had stated that they would remain open until 10pm. she replied no, nobody said that. we are certain it was her to which we spoke, as we even double checked the phone number dialed against the one on their flyers that were at the register. sorry can't review the food, may have been great but their hospitality was not. this horrible experience didn't ruin the night as we had great bbq at famous daves instead."}
{"text":"Went in with a group of 6 people today and apparently overwhelmed the 5 workers that were there by ordering 5 meals off their menu (no special requests).  They quickly got their lunch out of the way and wiped down our table w/bleach (which came off on one person's clothing) then took our drink order and gave us time to look over the menu.  We ordered within 10 minutes of entering the restaurant then the wait was on.  We waited for about 30 min for the first entree to be delivered then slowly over the next 20 minutes and with much prodding we got the rest of the order delivered.  The quality of the prepared food was alright, but nothing to write home about.  We did have to go looking for condiments and one of the bottles of ketchup was spoiled.  Needless to say we will not be going back"}
{"text":"The yams are going to make me come back again and again. The fried chicken is really good as well. A little surprised that I couldn't find an on line menu but ordering over the phone was easy enough. Our portions were pretty descent sized but could have been a little larger compared to other soul food restaurants we have tried. We'll go back but I'll fore go the somewhat tasteless mac and cheese next time and try another side."}
{"text":"I'm fi'in to be back soon.  Oh yea.

It won't matter what you get it on, as long as you get the breading.  

The breading.   !!    Somehow this stuff defies the laws of physics and packs more good stuff into its thin, crispy layers than should be able to fit.  !!

I had a Pork Chop Sandwhich with fries for $6.50, and the chop was HEE-UGE.  You can get catfish, chicken, whatever.  Get something breaded.   (!!)  I'm sure the ribs are great, but they don't have them breaded, so forget it.  (Just kidding - I wanted ribs, but they weren't ready yet. \"He won't serve them until they're tender enough,\" said the server, of the chef.)

I also overheard a neat conversation about how they wanted to be sure to be able to advertise \"GREEN\", and that, among other things to that effect, all of the interior decorating -- chairs, tables, wainscotting, etc -- was recycled.   Fabulous.  Do they come breaded?"}
{"text":"This place is off da chain!!! Love it, it's my close go to besides hauling across town to go to LoLo's. I did not think this place could compare by looking at the outside but I surely was wrong. I got the two piece dinner and before I could take pictures of my meal it was gone! Luckily, there is always tomorrow. This place is a definite must try."}
{"text":"Tried this place a couple of weeks ago on a Sunday.  The food was great but there are a few things that could be corrected.
The menus (there is one on the wall and one at the register) they are not clear with everything that they serve. When I asked if they made orkra because it was not on the menu she informed me that they actually do sell it but not at that moment because it was all out, wasn't even on the menu. 
The cook behind the see through wall almost created a fire in the kitchen by making a silly mistake. 
The mac and cheese was a little dry.


The owner was there and was VERY nice and considerate.  
We will definetly be back."}
{"text":"This place is fine if you don't know what good soul food is. The greens were typical canned greens that they added smoked ox tails to. The rice and beans lacked the standard gravy that comes from when you slow cook beans the right way. 

The catfish and the cornbread were great. Especially the cornbread! That was probably the best part of the meal, it was like the 'cake' cornbread I grew up with in the south. I would have given it 1 star, but the cornbread was amazing!

The owner was there and talked about his medical issues going on... then snapped at another guest who asked about a former employee. That guest, who mind you was SUPER excited about coming here and was clearly a raving fan. It also seemed like the staff there had a communication issue. 

I also thought it was Hilarious the fact they call themselves a soul food place, but doesn't serve sweet tea."}
{"text":"Fans of the Fantastic Indoor Swap Mart may recognize Off Da Hook as one of the dining options at that swap. Now, you can get your soul on without being inundated by the minor freak show that is FISM, unless you're like me and enjoy such things. 

Off Da Hook is appropriately named, because they have the best soul food north of downtown, hands down. The chicken and waffles combine perfectly, with crispy juicy chicken atop a wonderfully tasty waffle. The greens were wonderful, but I found the mac and cheese a little on the weak side. Nothing a little hot sauce didn't fix. 

As has been our experience as all soul food restaurants, the service was impeccable. Attentive, amicable and efficient. 

Ambiance is lacking, but who has time to look around the room once you get this food? 

The prices did seem a tad high, but if you want great food and service, it's just what you have to do. Solid."}
