{"text":"This is probably my new breakfast eatery. My husband I went and immediately loved the vibe and decor. Our waitress, Maggie, was very friendly and the food was delicious. We will most definitely be back in the future."}
{"text":"What a great breakfast experience! Ambience is charming, coffee is strong without bitter aftertaste, food quality is superior, portions are medium (not too large), and service was excellent without being intrusive. Bravo, brava!"}
{"text":"Cute neighborhood cafe with good food.  Despite being busy, we were able to be seated immediately.  The space is a little cramped and  it did take a while for our food to be served.  I ordered the soup of the day and a half sandwich and was happy with both.  With the frigid A/C and wooden seats, it's not a place you'll want to linger.    Would definitely eat here again when I stop in the neighborhood."}
{"text":"This neighborhood eatery could not get any better. I loved the picture of Odgen on the front door to walking into such an inviting space. Our breakfasts were cooked perfectly and our server could be any kinder. We will return more than once."}
{"text":"This new diner is everything that dreams are made of, including Collectivo and individual pies. The space is warm and friendly and impeccably decorated. You can tell how much love and sweat was poured into this place. Everyone was amazing. The potato leek soup was to die for, the french toast was solid, and the quiche was killer. Get a cold brew and relax. Rumor has it they'll have a patio space out back soon!"}
{"text":"Wife and I stopped here for brunch - great service and my ham and cheese omelette was exemplary (hook's five year cheddar!) good coffee and kudos on the turkey sausage"}
{"text":"A+ everything at Ogden's! Friendly and attentive service, fabulous food, and spotless, stylish decor.  I had the special poblano & andouille scramble, which sounded tasty but was even better than I'd imagined, and came out appealingly bright yellow due to their fresh local eggs. Hashbrowns were perfect, bacon was the best in town (so was my boyfriend's pancake) and the coffee, while strong, as others have mentioned, didn't veer into bitter territory. We were eyeing the individual pies with whipped cream on neighboring tables, but both of us were too full. Surely there will be a next time and we will try them then-- lunch menu also looked intriguing and worth a try. Very happy to have this within walking distance of our house!"}
{"text":"Such a great addition to this part of Madison. Trendy cute quasi-industrial decor. Bright and clean. Got a table right away on a Thursday while the restaurant was consistently filled. Great attentive service. Excellent strong coffee always a big plus for me. Fresh menu choices. I had a veggie scramble with quest fresco, hash browns (crispy and well - seasoned) and English muffin. I can imagine coming here often but the charm of the small neighborhoody space likely tough on weekends .  Definitely give it a try!"}
{"text":"The atmosphere is awesome and the food was great. Our server was engaging and made sure everything with our meal was great. Even got my mom a free piece of pie for her birthday"}
{"text":"Homey little neighborhood spot. Simple food done right.   Big fan of the little pies they serve daily. Have tried blueberry and peach (with fresh whipped cream) and both were delicious. Small enough to enjoy solo without hating yourself but large enough to share for a sweet happy-tizer or dessert.    For breakfast I usually go for the two egg breakfast. The hash browns are really crispy (and really good) and I love that they serve meatloaf for breakfast. They take a slice of meatloaf and sear it on both sides... Really tasty and a unique addition to the brunch world. The pancakes are also delicious.   Nice selection of sandwiches for lunch. Also nice that they have daily soup/quiche specials. I'm still thinking about the loaded potato soup I had this winter. Served with green onions and crumbled hook's cheddar on top. Yum!    There isn't a ton of seating in general and there's no outdoor seating so there can be a bit of a wait for brunch. They offered us coffee both times we had to wait outside which was a really nice touch.    Overall, a cute spot I keep going back to. Have always left happy!"}
{"text":"I wish this cute little diner was closer to where I live! It's become my favorite place for breakfast/lunch lately and I can't gush enough about their menu and the place itself.  The restaurant feels very open with a wall of windows along one wall. The simple furnishings and consistency in the decorations create a very welcoming and homey atmosphere.   Onto the food! I've tried many of their scrambles, Cari's from the menu and others from the specials menu, and they are always cooked perfectly. The eggs are never rubbery and the flavors are well balanced. Their hash browns are my favorite thing here because the crispiness can't be beat! I love how they place two layers of hash browns on top of each other for that extra crunch in the middle. I've also tried some soups, some sandwiches (tuna melt sticks out in my memory) and have never been disappointed.   Honestly I've never had so many great things to say about the texture of foods but this place makes me notice, and their attention to detail on that front elevates their dishes beyond typical diner food.   The prices are great, the atmosphere is friendly, there's always fresh flowers on the table, and water is served in cute little ball jars. Couldn't ask for more!"}
{"text":"The best sour dough toast in the Midwest.   Stopped in on Mother's Day as my usual diner spot had a huge wait.   We were able to grab a table within 10 minutes of arrival. They have a weekly specials board and page long menu. The specials reflect what is in season and available locally.   I had a salami scramble which came with hash browns and the above mentioned toast.   The restaurants interior is modern and gave me a Northern California vibe. Tables are a little bit tight but they do not have a lot of square footage in the dining area. You won't be elbow to elbow with neighboring tables but be mindful when stepping into the aisle.   I hope to come back sometime soon."}
{"text":"Stopped in to Ogdens diner on Saturday morning, man that's some hi-performance coffee! It's a nice neighborhood diner with friendly help. I got the standard breakfast and asked for sausage patties and got two! The noise level is high but so what. I'll be back."}
{"text":"We were on a biking tour and stopped here on a Sunday early afternoon to try the new restaurant, Ogden's North Street Diner where we were served pancakes, scrambles-tofu and bacon and broccoli, hash browns , toast and their cherry pie with fresh/homemade whip cream! --Great breakfast joint, if you like cherry pie-good stop was amazing!"}
{"text":"I went with friends and we really wanted to like this new Diner. It offers breakfast and lunch and is in a residential neighborhood on the near east side of Madison. It is freshly renovated and is extremely inviting. The owner and staff are friendly and very helpful. We felt like guests in their home. But, unfortunately, the food did not live up to the experience. We had gone for lunch and I ordered a tuna melt sandwich on whole wheat with a side of hash browns. From the looks of my dining companions plates, mine was the best at the table. My wife ordered the veggie burger which looked like a half inch thick hockey puck and she claimed it probably tasted similar. One of my other dining companions ordered a sandwich and the bread was toasted to nearly burnt. The other dining companion ordered a meatloaf sandwich and the dryness of the meatloaf equals the previously burnt toast. Unfortunately, there was nothing special about our lunch. The final bill was 40 bucks for the four of us and I will give them Kudos on service and friendliness. But I think that any novice would be able to do a slightly better job for our lunch. I really wanted to like this place."}
{"text":"The things I like the best about Ogden's are not related to the food. I love the location, the look and feel of the restaurant and the staff. Whether is is a sunny summer day or a freezing winter morning, Ogden's feels \"homey\" and relaxing. You can't be shy. We often get into good conversations with those sitting at the next table. The restaurant is small and folks sit very close to one another. In this case, this is a plus. I have met many very lovely folks while dining.  The staff is very friendly and are good at their jobs. We are remembered by name and they always keep the coffee coming. The coffee is strong and hot. My guy drinks tea and he appreciates the options.  I find the food to be fairly simple and the bread choices could be more eclectic . I have only eaten breakfast dishes so I cannot speak to their sandwich offerings. I think if the bread was better it would really sway my judgement. Challah, a grainy rye, something of substance.The one breakfast item I love is their pancakes. They are PERFECT. I never had a better pancake. Writing this makes my mouth water.  All that said, I would eat here daily for the ambiance and kindness, if my pocket allowed. Oh, they are closed on Tuesday and open on Monday! Easy to make that mistake."}
{"text":"Came here for brunch and  loved it! The coffee was delicious and the bacon was perfectly done. Got the spinach feta omelette, I was amazed by how bright and flavorful the cage-free eggs were! The staff was super helpful and kind. Will be back very soon."}
{"text":"A tiny little breakfast and lunch place about a mile from the airport. I liked the place as soon as I walked in. Quality furniture and well thought out design. Had a pot pie with hash browns and a cherry pancake. Pot pie was good and not creamy. This was my first ever cherry pie and I loved it. Not too sweet but sweet enough not to need syrup. This place is cool."}
{"text":"Did not like.   Bacon was mediocre but the best part.  French Toast was under cooked.  Mac and cheese pancake was one of the things I've ever eaten."}
{"text":"My son lives within pie tin throwing distance so we gave it a try this morning Very small place, but the wait was only about 15 minutes Our waitress was incredibly on the ball and our food came surprisingly quickly. I had a scramble and really enjoyed it. I was quite surprised to get artisanal bread with my meal, not the usual grocery store pre sliced stuff. I want to go back sometime and try lunch."}
{"text":"Fast, friendly and trendy.  Portions are good... service is great.  They need a Benedict, but I'm happy to say that nothing is too greasy as is often the case with other all day breakfast places."}
{"text":"I have raved about Merchant's brunch to everyone on earth. I have tried the other brunch spots in Madison, and they've never come close to exceeding Merchant. I have always thought that Merchant was the Madison brunch winner, hands down.  And then I tried Ogden's. Merchant has new competition.  I originally saw Ogden's during my meals on wheels delivery route. It's off the beaten path, and the building itself is quite small. I thought I should give it a try. I'm glad I did!  The interior is very bright, cute and clean. The farmhouse decor is very fun and makes for a delightful brunch experience.   Because the place is so small but so crowded, we waited for about 10-15 minutes for a table. The hostess was very friendly and accommodating and poured us coffee as we waited for a table. The coffee was very bold and delicious! Our server also was very prompt and friendly.  I ordered the lox scramble. Anytime I can get my hands on lox or smoked salmon, I do it. I received a HUGE plate of food with the lox scramble, hashbrowns and English muffin, and amazingly, I finished the whole thing. The food tasted that incredible that I ate a terribly huge portion of food that I'm still astonished somehow fit into my stomach.  I've eaten lox with scrambled eggs plenty of times before, but Ogden's lox scramble was really the best I think I've ever had.   Ogden's is on my list of Madison-area restaurants of which I will take my out-of-town visitors to go eat. And I'm ready to go back for some more incredible brunch!"}
{"text":"This place is a gem!!! The most adorable spot.  Their tuna melt is the best in madison.  Ask for hash browns instead of chips and ask for them with cheddar and onions!!!"}
{"text":"I had such high hopes,  I love diners and as soon as you enter you get that diner feel with specials on the wall, the smell of breakfast and coffee.  We were seated pretty quickly and went over the menu.  I ordered the 2 eggs over easy with hash browns and bacon.   It took forever to come out, there was no update on the status of our order and we had to ask for an update.  My eggs must have been sitting a while because they came out hard.  The hash browns were very peppery and I had to steal my girlfriends butter from her pancakes for my toast.   That is when I realized that the cute jar of jam I was using is probably shared between customers as I didn't want to get butter in there.  I then watched a few tables leave and they never replaced the jam for the new customers.  This just made me feel ill.  They really didn't talk to us about the issues but they were nice enough to give us a discount.  Overall I can't give them higher stars with the jam fiasco and I'm not sure I can try them again."}
{"text":"Stopped in with a party of six for Mother's Day brunch. A small place, but seating opened up fairly quickly. I had a fantastic spinach & feta omelet with crispy hash browns. Others tried the day's featured quiche with fruit. The quiches are individual, formed in a large muffin pan it appears. Really cute. The whole place is cute & we'll definitely be back."}
{"text":"This is such a nice addition to the neighborhood.  The interior is incredibly chic and looks fresh and clean.  I can see myself going here often.  Do yourself a favor and try this place on a week day (but not Tuesday - they're closed).  There was there was a line out the door during opening weekend and although the hype will die down a bit, this place is so tiny that I imagine trying to get in on any weekend during breakfast or brunch hours wouldn't be the most relaxing experience.  We tried the bacon, pancakes, and tofu scramble.  Everything was good.  The tofu scramble was tossed with tahini which added a very subtle but welcome hint of flavor that you don't get at other restaurants with a similar dish.  The prices were reasonable and the portions were filling.  Their breakfast and lunch menus both look pretty robust, and all of their specials sounded pretty delicious.     The only thing we didn't like was the coffee.  I'm a fan of strong, black coffee but this stuff was so strong it gave me stomach cramps.  We've only been once so maybe it was an off day for whoever brewed it, but you may want to ask for some cream and sugar."}
{"text":"I've eaten there twice and both times it was fantastic! I love what they've done with the space; it's cozy, yet bright and airy; the staff is wonderful; and the food rocks my world. I'm on a gluten-free diet, and they cheerfully accommodated my request for a substitution of fruit for toast. A delightful addition to the neighborhood, but beware, there's bound to be a wait during popular breakfast/brunch times. I'm adding a star here () because I like it so much, that I wanted to give the place six stars."}
{"text":"This is a really cute hidden gem. At least, \"hidden\" in that it's tucked away far from my usual stomping grounds.   Came here for my dad's birthday brunch. The diner is small but brightly lit. The atmosphere reminded me more of restaurants I visited in Toronto, than of Madison, so it was almost like a pleasant little vacation.   Coffee was great, as others have mentioned. Their omelettes are good, but nothing extraordinary.   I recommend this restaurant for breakfast/brunch/lunch. It's cozy and good for groups of two."}
{"text":"We were in this area of Madison today.  There were some positive reviews for the North Street Diner so we gave it a shot.  Its deceiving when driving up.  Kinda makes you wonder if this was a good idea.  But inside its quite nice.  Wood floor, ceramic tile, fresh lighting.  The service was prompt.  We sat at the counter on two of the four stools! Did I say this is not a large diner?  We had the ham and cheddar quiche with fruit.  Nothing fancy, just good food.  Friendly service.    A nice find.  Oh yeah, we took a blueberry mini-pie to go."}
{"text":"Great neighborhood place..waitress said they opened in May. Arrived at 8:30 Saturday to a full house which gave us time to peruse the menu and the expansive \"specials\" board. Hot chocolate...hot & chocolatey...bacon cheeseburger scramble w/ tomatoes & onions and hash browns and english muffins ( seriously good! ), blueberry pancake, ham, hashbrowns. Obviously lots of locals by the way they were greeted. The lunch menu also looked tempting but too early for us. Great, friendly service. Reasonable prices. Glad we found this gem on Yelp!"}
{"text":"Always is excellent, local and wow is the food good!!!  Service is excellent even when they are busy."}
{"text":"Went to Ogden's a couple of weeks ago. I enjoyed the food and the decor was cool and new. My only complaint is that they have odd seating practices. Normally the bars are first come first serve but not here. I would definitely change that. We also put our name in and waited for about 30 minutes to be seated. No big deal when its a weekend morning at a small place? Two parties were seated before us that put their name in after us..... The host needs to do a better job of seating. Even if we are a party of two and there is a 4 top available, we should be seated, instead of you waiting for a group of 4 to come in and seat them ahead of us. A small issue, but the food was great! Hopefully things run a bit smoother for them."}
{"text":"Awesome diner and great food. Good coffee and the ambiance is clean and contemporary. Great addition to the neighborhood"}
{"text":"Restaurants like Ogden's (and the Tip Top) are bringing a stronger sense of community to our neighborhood. Ogden's is a small diner with simple (and reasonably priced!) breakfast and lunch fare in a beautiful space filled with light. It was truly a joy to spend an hour here this morning.  I ordered two eggs, bacon, and hashbrowns (with cheese and onions) and an iced tea. My partner ordered the Denver omelette and coffee. For ~$20 we both received generous and delicious portions. In Madison these days, it's hard to come by places that have a list of tried and true breakfast fare - this place was exactly what we wanted for Sunday breakfast.   And I would be remiss to not mention that our server was fantastic and everyone at Ogden's was friendly.  We will be back!"}
{"text":"Loved it!  We found this place by accident.  The chalkboard on the sidewalk caught our eye & we went in for breakfast.  Just loved it.  The best hashbrowns I've had in years.  Would definitely go back."}
{"text":"The decor and ambiance of this place is amazing. There was quite a wait for Sunday morning, but we expected that. The place is really small, but very beautiful and with a great atmosphere. The service was great and extremely accommodating.   I ordered two sunny side up eggs with hash browns and an English muffin and I found my breakfast to be really enjoyable and decently priced. My friends ordered the eggplant omelette which was one of the specials of the day, and my sister ordered the cari's favorite scramble. They didn't like their dishes as much, but really enjoyed the hash browns."}
{"text":"Best service in Madison.  Food is consistently excellent.  A real treasure."}
{"text":"Giving three stars - my honest reflection is \"meh, I've experienced better\", but they are new, and I want them to continue to improve over time. Third star for potential.  My mom and I stopped in here a few weeks ago - we love exploring new neighborhood spots and were excited to see the completed reservation. We arrived toward the end of their opening hours - but you never would have known based on the friendly service we got! We were greeted right away and directed to sit anywhere. The decor is beautiful - lots of locally crafted/sourced items, reclaimed wood, and a beautiful color scheme. Bright and cheerful - and the bathroom is excellent! A strange thing to note in a review, maybe, but it really was so pretty and well-appointed - very pleasant.  The menu was typical breakfast/lunch fare. The server came and told us the soups of the day, which sounded good, and that the quiches are individual, not slices off a large. I didn't order one, but absolutely loved the concept. One problem - there are no gluten free bread options for the sandwiches or toast, which left the remaining menu somewhat spare for me - runs heavy to pancakes and paninis - things that are hard to modify.  I ultimately ordered the ham and cheese omelette and hashbrowns. The omelette was a normal size (sometimes they come out huge, which I hate as re-heated eggs are terrible and I always end up wasting) and contained a lot of cheese - not the cheese I ordered, but it was still ok. The strange part was that the ham was not cut at all - 3-4 round deli slices of ham that were somehow ice cold, while the cheese was melty. The hashbrowns were overcooked and dry, and the cheese on them was not fully melted. I finished most (hungry!) but definitely not the best breakfast in town.  My mom ordered a BLT - and asked if the bread was grilled or toasted, and was told toasted. Nope, on arrival, the bread was clearly grilled and saturated with whatever oil they use on the grill. Disappointing.  Coffee was good, water was plentiful, and the staff clearly take great pride in the space. Hoping food execution improves with time!"}
{"text":"Not impressed at all. Coffee was way too strong, menu was lacking anything special, food was all very bland. I ordered the turkey, blue cheese, shallot omelette which was a special for that day and it was loaded with filling but very dry. Needed some type of sauce or cream on top to bring it all together. Hash browns are very basic. My husband's ham and cheese omelet omelet was lacking cheese and bacon was beyond burnt. They also forgot his toast. My daughter ordered oatmeal and she left hungry after finishing it all. Overpriced and we felt cramped the whole time. We also had to wear our sunglasses while eating due to no window coverings. Won't be back."}
{"text":"After my second visit I am upping my score to 5 stars.  The food and service is so good.  I had the french toast and sausage.  OMG, this was so good.  The french toast was covered with excellent maple syrup and melted in my mouth.  The sausage patties were large and nicely accented the french toast.  I was about to leave and they brought out a try of muffin looking items.  I inquired and learned they were cherry pear pies, the special dessert of the day.  So i got one to bring home for my wife.  She loved it.  My ticket, before tip, was $9.76.  Ogden is so unique and excellent you must visit for an excellent meal."}
{"text":"This is probably the only breakfast/brunch restaurant we'll ever go to again, which is saying a lot since we live in Madison and there are a lot of places to choose from. This place is spectacular! I have only superlatives to use in describing it:  The food is outstanding. We split an order of plain pancakes and the pot pie of the day, which was chili beef with cheese. They were both fabulous! One of the reasons we decided to go to Ogden's was that we were celebrating our anniversary and they serve pie for breakfast. My partner loves pie, so this was a great treat for her. There's a pie of the day and they're actually more like tarts: individual little gems in a pastry crust almost as light and delicately flavorful as a pate choux. It's a must with their homemade whipped cream.  Our server was perfect and perfectly attentive. He can apparently read minds since he was always at hand, anticipating our needs. He was knowledgeable and had a terrific sense of humor! He also introduced us to the patron sitting next to us who is a regular. She had some great tips about best times to come (not on weekends if you don't want to wait) and about how wonderful everything on the menu is.  We're hoping to become regulars, too, so even though it's probably the best restaurant in Madison, please don't go there so we can always get a table!"}
{"text":"First visit at the new neighborhood breakfast place.  I went with a friend for a mid-morning meal and was pleased that lunch Items would be a possibility if I came a bit later. We ordered breakfast and tea and coffee (Collectivo). Out items were good even though they took a bit longer than expected to arrive. My friend's French toast was golf but my egg scramble needed more seasoning while cooking as it was bland. We both had hash browns and they were great. Crispy on the outside and not at all greasy (the way I like but maybe less appealing to others).   It is still new so I will be back for sure as I'll be pulled by the location and the clean, bright, and welcoming interior. The staff was friendly and helpful. It is small so don't try to get in during a rush with a bigger party!  I'm so glad that this building that has been empty for so long is getting used and that it is an easy walk from my house. The neighborhood feels even more vibrant now!"}
{"text":"Stopped to have lunch before the long track back to Twin Cities. I will highly recommend this place. It's a cute dinner with neat decor, friendly service, and good food. It's a small place, about 10 tables so one may have to wait during peak hours.   We had variety food items and it was all well made.  Kids enjoyed their meal and so did my wife and I. Eggs were well cooked, pancakes were good, and my sandwich was yummy. House-made jelly/jam is good."}
{"text":"Stopped in for a weekday breakfast and was pleasantly surprised. The interior is nicely done and benefits from big bright windows and plenty of sunshine. My server was friendly and willing to answer questions about the menu, although service was a bit slow despite there being only a few diners around. Food was good and came out fast. Hashbrowns were nicely done - crispy on one side, soft and melty on the other. They could have used more seasoning but a little salt solved that problem. Overall a nice breakfast option in the area."}
{"text":"I love this diner! Almost didn't want to do a review because I want to keep it my secret little breakfast spot but it's too good not to rave about them. Tiny but cute area with a fun vibe. I'm all about their quiches, different every day and have never been disappointed. Oh did I mention they serve Colectivo coffee?"}
{"text":"Love supporting small local businesses as this in one of those gems. Found this place on yelp and decided to try it and was not disappointed at all. When we arrive, the place was full and the host had told us it would be a 10 min wait so we waited. As we waited, more and more customers showed up and was given over 30-40 min wait time, but they all waited anyways with free coffee provided by the host. At this time, my wife and I were amazed they would wait 30-40 min for brunch. As we got seated, waitress was on point and was always there to help with recommendations and all sorts. We ordered our food and received it promptly with good portions. Everything was cooked perfectly. Great atmosphere and small enough place to be cozy.  I would recommend everyone to try this small gem."}
{"text":"Really nice vibe. Seating is pretty tight and mostly you  don't get much privacy to talk. Great waitress. Under staffed w/ only one waitresses for Fri. Lunch. I felt bad for her. Limited menu, but wonderful fresh food. Top notch ingredients! Great for the neighborhood! I hope it stays around. Prices are a little expensive, but you get what you pay for."}
{"text":"Madison needs way more of these quaint neighborhood diners.  Oh sure, there's nothing but street parking....but the food is SO worth it!  Yeah you'll probably have to wait a bit for a table...but they'll serve you coffee while you wait.  Once you are seated, the servers operate like ninjas to efficiently serve you what your stomach desires.  We enjoyed breakfast and pie. OK ya got me, PIE is the ultimate reason we came.....and the pie was incredible!  You must be sure to opt for whipped cream on your pie....WOW. Just wow.  My mouth is watering just thinking about that Cherry Pear Pie....Heads up there's only one flavor of pie per day....guess I'll need to visit on a regular basis!"}
{"text":"The restaurant is in a residential area. A nice change from the norm. We walked in and right away were blasted with AC. It was COLD on a rainy 60 degree day. Weird. Anyways, just a warning, you may want to bring a sweatshirt or light jacket. The diner is a little smaller than most but it has a nice comfy feeling.   After being seated, I saw the plate the lady next to us was eating - blueberry pancake with blueberries covering the pancake. That looked yummy, so I ordered the same. Over 25 minutes later, our food still had not been brought to our table. I had to ask our waitress where our food was. It was delivered 5 minutes later. The waitress apologized and said she entered the order late. She later gave us a discount for the error which was much appreciated. We are human after all which means we all will make mistakes. I appreciated that she told us what happened. It would have been nicer to know a little earlier.   Back to the blueberry pancake. When the food arrived, my pancake had no blueberries on top. Oh well, I'm just chalking it up to not having been to this restaurant before. I also ordered turkey sausage and one egg. The turkey sausage was ok, it had an interesting spice but overall not too bad. My partner ordered 2 eggs over easy with his meal and one egg came out over hard while the other was over medium.   The strawberry jam came in a tiny canning jar that was already on the table. The thing we were wondering was if people lick their knives and then dip it into the am jar, do they replace the jam jars in between guests?  We found the answer to be no - the jars are not necessarily replaced with a new one when the next guests sit at the table. I'm not saying that people lick their knives... but it was a curious thing we saw.   Overall, the visit could have gone better. We will decide later if we go back."}
{"text":"I'll be upfront, I hate diners.  This place blew me away and is already a favorite spot! They always have fantastic and diverse seasonal specials, great breakfast and lunch options. Everything on their lunch menu made my mouth water, and I was not disappointed!  When I walked in my partner and I were immediately greeted like a friend by servers and the hostess. They were punctual in making us feel welcome, and we were even seated pretty quickly regardless of their well earned popularity.   If I could give more stars I would!"}
{"text":"A chef friend had heard of this place, so we tried it.  It was excellent in all regards.  The overall appearance was well thought out (I think Joanna Gaines was their decorator), very clean, organized.  The staff was all very friendly, funny, super personable. Coffee in my hands, just seconds after walking in the door.  Many points scored on that alone. And, the food, I don't care how great a place is if the food is mediocre.  Not the case here, I loved it.  I had one of the specials, an andouille and poblano scramble, which I left only microscopic remnants of on the plate.  Sadly, I was too full to try one of their fruit pies which, from appearance alone, is reason to go there, and insurance I will be back."}
{"text":"AMAZING BREAKFAST at a super cheap price. My fiancé enjoyed his individual quiche, while I got a classic BLT. Overall a cute neighborhood diner"}
