{"text":"This is one of those true \"finds.\" Ogden Pizza has some of the best pizza I have had in Calgary. They have a number of specials and the kitchen had no problem with is adding or making ingredient substitutions. We had a starter salad to share - the Greek salad was definitely big enough for two and it was fresh and tasty.  The pizza came out super hot and fresh. Loads of cheese and toppings. The dough had a nice crust - a but of crunch but still soft in the middle. Yum. The waitstaff were laid back but very efficient. It's a real \"homey\" kind of place. We've been back for pizza a few times but I haven't tried any of the other menu items yet. There are always a few people in there who look like regulars having a beer, and always at least one family. The price seemed reasonable. Under $40 for both of us including salad and drinks."}
{"text":"Seriously. The Feta Spinach and Pineapple pizza made me cry a little. The sauce reminds me of my childhood of long summer days playing in the river. 
Great servers who are very patient with children.
They still have Stampede decorations up - which makes it better."}
{"text":"best pizza in the city! A hidden gem in S.E Calgary"}
{"text":"I've been back several times since writing this review, the pizza is back to the quality we have come to expect."}
{"text":"Solid 1980's pizza. Not bad, what I ate as a kid, not fresh but solid honest pizza."}
{"text":"Don't know what's up with this place. Food and quality seems to have down hill a bit. Used to a great spot but now a days , mediocre. Service is great and friendly, but quality , they need to re up their game."}
{"text":"Not bad but not good....pizza was pretty much like something i would make at home with a pre-made crust.  My takeout order wasn't ready on time (they hadn't even started it after 45min) but at least they gave me a free beer while I waited another half hour.  Wish it was better because it's at the end of my street."}
{"text":"My family and I came in for dinner on a Friday night. It wasn't very busy. There were 3 servers on shift. Our server took about 5 min to bring us menus. She brought us our drinks and we ordered our food. The food came out fast, and wasn't very appetizing. I had the potato skins and they were over-cooked, greasy and obviously microwaved. Our server came by once for a drink refill. Near the end of the meal we didn't see her at all. We asked another server for a refill and she went over to the bar and put on her coat and left. We waited a bit longer for our server but she refused to even acknowledge us. She just was clearing tables and doing dishes. We finally said \"screw it\" and walked up to the counter to pay our bill that was never delievered to our table. Horrible service. Awful food. This place has gone dowwwwn hill. Never going back again. Such a shame as its close to home."}
{"text":"I'm a big pizza buff and this still stands as one of my top three pizza places in Southeast Calgary. Very cozy almost diner-like feel to it and they also deliver. Food can be a bit greasy sometimes, but is perfect for a lazy Sunday dinner. I highly recommend the Billy's special and the dry ribs."}
{"text":"This is the BEST place to eat in Ogden. It is a nice family restaurant, clean, friendly staff, and okay food.

The pizza I'm not a fan of, it is nothing special and kind of simple. I've always been more of a think crust (think Famoso or Double Zero) kind of guy.  For pub food it is not bad. Decent Chicken Quesadilla and deep fried zucchini sticks, I also had the pasta again nothing special but decent prices and convenient location. 

The drink specials are pretty good. $3 highballs at happy hour, discounts various days in the week.

This is not a place I would drive more than 10 minutes to eat at, but if you are near Ogden and want an okay meal for a good price check it out."}
{"text":"I used to love this place, but tonight changed my mind. Order took over an hour and a half for delivery. Food arrived cold and dried out. Garlic toast was harder than a hockey puck. I complained, their response was a small discount on my next order???  No thanks!!!  Spend your hard earned money elsewhere!!"}
{"text":"Well, another season of team beers at Ogden Pizza comes to a close! We enjoyed our fill of beer and a free large 2 topping pizza with a team of at least 8 coming in over the summer after our Ultimate Frisbee games. Today, we were told that special had changed to buy any sized pizza and receive your free large 2 topping pizza with a team of at least 8.

Most times, there's one server working a few large tables of players. Sometimes they forget things, or something from the kitchen takes a little longer than it should. But hey, the food is plentiful and cheap and most of us aren't in a hurry to get home anyway.

On the drink side, it's the kind of place you can still find a bottle Schmirnoff Ice on special (seriously, do people still drink that stuff? Apparently in Ogden! There was a couple at the other table and they each had a bottle). 

Pizzas will run you anywhere from $9.95 for an 8\" 1-topping pizza to $27.50 for a large House pizza (ham, pepperoni, mushroom, shrimp, green pepper & black olive). The Create Your Own variety can turn into a bit of a choose your own adventure with 19 different toppings available. We got creative with a small back bacon, mushroom and green pepper pizza and a large with half spinach and olives and the other half pepperoni and banana peppers. Tip: Spinach and olives isn't enough to make a flavourful pizza all on its own. If you're going veggie, at least throw some tomatoes on there. Otherwise, include some meat!

Other menu items include things like a steak sandwich, veal cutlets, mushroom chicken or beef/chicken souvlaki. They come with ridiculous portions and most are under $20. There's a decent list of appys, soups, salads, pastas and seafood. Don't go expecting gourmet. But if you're hungry, most of the dishes I've tried hit the spot!

Note: I'm pretty sure the team special now applies to any night of the week.
Double note: It really is all about the pizza. The crust is never burnt nor is it too thick, plenty of toppings and cheese... and it always comes out piping hot. Oh, and apparently if you live in Ogden or Riverbend, delivery is free!"}
{"text":"I have ordered pizza for delivery twice now. Both times I was quoted 45 minutes. The first time it took an hour and twenty minutes and tonight it took an hour and fifteen minutes. When I phoned just after an hour, my complaint was that you can't over promise and under deliver. I asked how they expect to keep customers like that and the lady's response was that their food is awesome so that's how. I'm sorry, but both food quality and quality service are required for a restaurant to be successful. There was no customer service, the lady wasn't at all apologetic and the pizza was decent, but definitely not good enough to be treated like that. Will not be ordering from them again."}
