{"text":"I had a very nice meal at this establishment.  The entire staff really cared that our table had a good dining experience.  The manager visited our table shortly after the food was delivered (I really like to see this), followed by the waiter.  Everyone at our table enjoyed their meal.  Pasta was cooked to perfection.  The restaurant is small so arrive before the dinner rush.  Gets a bit noisy as the place fills up."}
{"text":"Delicious. Family and I had Calamari, the soup, lasagna, chicken parm and clam linguine...   All was awesome, best italian in charlotte"}
{"text":"From amazing food & cocktails to amazing service, OGGI is a must for any special occasion, date night or a night on then town! The ambiance is friendly & chic. We had the blackberry old fashioned which was amazing to start. The ravioli was very tasty as well ! The octopus and chicken parm  was also out of this world. Don't forget to ask for dessert ! Highly recommended for anyone looking for a great ambiance and amazing cuisine !"}
{"text":"My Fruta del Mar was FABULOUS. The mussels and calamari - everything was so fresh. The sauce was mildly and perfectly seasoned, and the handmade fettucine prepared with squid ink was thin and tender. My husband's Chicken and Vodka sauce over Penne pasta was delicious, and everything was so good we had to order a side of risotto just to be sure we had found our little piece of Italian heaven and were not disappointed.   The staff was attentive and helpful. The atmosphere was clean and intimate. We have found our new favorite place. They can count on our regular business."}
{"text":"OmiOGGI!  Had dinner in the North End in Boston a few weeks ago, and it was wonderful, however, it did not compare with Oggi.  Truly, Oggi's food is better than in Little Italy.  The home-made pasta makes all the difference.  I had the Agnolotti all Panna,..that delicious alfredo sauce was so light and flavorful.  That's right, I said light! And the raviolis were like little pillows of heaven!  Thank goodness this restaurant is in Charlotte - I will enjoy frequently!"}
{"text":"This was our first time to Oggi. My wife and I were taken there by friends who had dined in this establishment 3 times in recent weeks. This was their fourth. It is clear why Oggi has become their favorite spot in Charlotte. It is now ours as well.   The lobster fra  diavolo, veal parmigiana, fettuccine Alfredo and lasagna were all superb! The flan was outstanding. The service was world class. The atmosphere is casual chic. This is a family run enterprise and is managed with tender loving care. We were served by a very personable yet reserved young man named Eloy. He is the son of the owner and exhibits a great passion for his work.   We would recommend Oggi without hesitation and can't wait to return! It deserves every bit of 5 stars."}
{"text":"The food here is phenomenal but the service the two times we have been there has been SO bad that I can only justify 2 stars for the good food. And I'm one who can deal with mediocre / slow service. But we've had two different waiters each time and not once were we asked how our food was, or if we wanted another round of drinks. Both times we had to flag someone down for bread.  This past time specifically, the waiter was using ALL of his attention on his party of 6 rather than giving much attention at all to me and my husband. He cleared our empty glasses before the entree came out without asking if we wanted more. Which I did. We had to ask for cheese, more water. Etc. We felt blatantly ignored. What makes it worse was he kept looking at us from a far and then just turning away.  I'm not really sure what's going on with the service.. The lasagna is heavenly, as is all of the other food we've tried so far. But the terrible experience is enough to make us not go back.. Sorry Oggi."}
{"text":"Charlotte. I have eaten at Oggi's at least a dozen times. I try something new almost every time I go and everything I have tried has been wonderful. The service is great! Lynn has waited on us several times and she is always fun, nice and and an excellent server. So far, everyone I have taken to Oggi's, has not been disappointed!"}
{"text":"AWESOME! Handmade pasta, great service good atmosphere and good wine selection. We had calamari, linguini frutti di mare (seafood pasta dish), crab meat ravioli and tiramisu for dessert. I will be back several times and I have never found an Italian restaurant I like."}
{"text":"My boyfriend and I have been trying somewhere new weekly since we've moved to Charlotte.  We chose this place as this week's date night since I love italian food. I usually make my own pasta and ravioli at home but this was fantastic homemade italian fare with a great, casual yet upscale atmosphere. I'd definitely go back!"}
{"text":"My husband and I had dinner at Oggi last night. So impressed. Appetizer was awesome( risotto) based. We had Lasagna and Penne Vodka. Both were very good. We added a little spice, because we like on the hot side. The desert,a flan with caramel sauce was the best!!! All the staff were so accommodating. They now have a liquor license so we had martinis, as well.That is one of the reasons we had not visited for dinner in the past. Can't wait to return!!"}
{"text":"The trick is to get here early! We arrived a little before six, received a friendly greeting and were seated promptly. We are normally very happy with our meals here, though the specials can be a bit expensive. As it gets more crowded naturally the service slows but last night we had a great waitress! I wish we could remember her name! Naturally a great place for pasta and I always enjoy their hand crafted cocktails"}
{"text":"We went there for lunch and sat outside. The food was delish, but the service wasn't that great. They brought out the wrong food and walked away and took forever to come back to check on us. When they finally did, they replaced the food and didn't apologize. It's no biggie, but I hope they remember at least three things to keep in mind going forward.....service, food and atmosphere! I feel if you master that, you've beat the odds and the restaurant will actually survive!"}
{"text":"Good service, friendly staff.  Great bread with quality olive oil and balsamic.  The rest of the meal was priced too high for its level of execution.  I got the chicken parm for roughly $19/20.  Yes the pasta was fresh, but it was cooked with no salt in the water which left it very bland.  Tomato sauce was eh.  Chicken was just not right.  Too salty, a little overcooked.  Basically Id expect this kind of execution at an applebee's or a red robin (back when they did chicken parm).  Wife had the arugula salad which came with a honey mustard dressing that was too strong on the mustard.  Her crab ravioli was good.  Overall they had a nice atmosphere and almost were good.  Will I go back? Unlikely.  The chefs have room to grow."}
{"text":"Had a wonderful meal last night with my mother and sister at OGGI.  We had the Boconccino Emiliana appetizer, crab meat ravioli, penne vodka, and one of the specials.  Everything was flavorful and fresh.  Our waiter was very attentive and pleasant.  He overheard my sister saying something about my birthday and surprised us with a tiramisu which was really nice and light.  Really enjoyed our evening and will be going back."}
{"text":"I went back last night for dinner because it was so delicious the last time I went. After a bit of a wait at the deserted host stand I was asked if I wanted to sit and eat some dinner by the hostess. (Generally, when coming to a restaurant, that is the goal.) I was seated outside in a surprisingly comfy patio chair. My waiter put down a napkin underneath the utensils and bread plate so that there were no drips or dirt getting on the plate. Genius! I wish more places thought of that.  I ordered the Linguine Frutti de Mare with the white clam sauce. I was quite excited because it had a nice variety of seafood and homemade black linguine. Unfortunately it didn't live up to my excitement or the previous meal I ate at Oggi. The linguine was heaped into a pile in the middle of the plate with the clams and mussels around the edge. The pasta itself was a little bland and seemed quite thin for linguine. I always expect that black pasta is made with squid ink so it tends to have a nice subtle ocean-y flavor, but this may not have been. The seafood was adequately cooked but they went a little heavy on the calamari. I realize squid is relatively inexpensive compared to other seafood products, but I didn't need enough calamari for an app sitting on top of my pasta. The sauce was, at best, meh. It severely lacked seasoning. I had to ask for some Parmesan and mix in the herb garnish to help give the dish some flavor. It was mostly unsuccessful.  My waiter was very attentive which is what is saving this from a 2 star review. He refilled my water several times, which is a huge plus in my book. I almost always only drink water when I go out to dinner and I have to nearly beg for a refill. I'm not cheap; I just really like water and don't really like to drink soda often! He seemed equally attentive of all of his tables and not just this solo diner. All in all, I think some of the food quality has slipped and I think the patrons have noticed. There was only one table seated inside and 4 outside. I'm not sure if I'll be back on my next trip to the QC. It's a shame because it was so tasty last time!"}
{"text":"The food was great but WOW they are not kidding when they call them \"small plates.\"  We assumed, since they had both appetizers and small plates on the menu, that the small plates would be enough for a light dinner.  Just kidding.  I ordered the raviolis and got a grand total of four pieces; my wife ordered the chicken parm and got a whopping 5 pieces.  Don't get me wrong, the food was great, but the portions were a bit ridiculous, especially given the price.  Perhaps we missed the memo on how the small plates worked (but maybe a memo from the waiter or on the menu is in order?), but we left hungry."}
{"text":"Atmosphere is strange, 2 large tv's and uncomfortable seating. There were 5 of us and we were sat four in a booth and 1 person at an extra table added to the end of booth. Food : gnocchi are not homemade, taste frozen.  We were told the  flat pastas were made in house, not so.  Linguini was definitely out of box, which is fine, unless expecting homemade.  Fettuccine was house made and very good.  The chicken piccata was decent, but not great.  Overall food was average and not worth the prices. The service was terribly slow.  Dirty dishes sat forever, no refills on drinks, just a real disappointment."}
{"text":"I brought my family to Oggi for lunch to celebrate my sister's birthday.  We each got something different to try and it was all fantastic (Lasagna, Agnolotti, and Penne Napoli).  Everything was light and very fresh tasting.  We had the Calamari for the appetizer, which was delicious.  The server was very attentive and friendly.  Always made sure our drinks were full and everything was tasting great.  The tiramisu was to-die-for!  Best I have ever had.  My family is 1/2 italian and it has been a long time since we have enjoyed a great italian meal out.  I will be a regular here and would recommend this place to everyone!"}
{"text":"The Seafood squid meal was delicious.  The red sauce was about the best I've had.  The service was exceptional.  I'll be back soon...,"}
{"text":"Good food. The caprese was delicious. Pollo Monserrat is great!  We did wait an exceptionally long time for our entries with minimal acknowledgement of wait. The limencello and chocolate dessert were delicious"}
{"text":"Since this restaurant is across the street from my health club, I was curious about what it had to offer. I believe I had read some reviews early on that were not too complimentary. However, since it was close to where we live, we decided to give it a try. We were not disappointed.  We made a reservation for 6:30 on a Friday night. We were seated immediately. Our waiter, Jose, was excellent from start to finish. My wife had the strip steak and I had the trout Livornese. Both came with linguine with oil and garlic. Both dishes were excellent. My wife and I are originally from a New York City suburb and I can only say that the oil and garlic on this pasta was the best I have ever tasted and was certainly equal to and probably better than anything we have eaten in New York City. This chef knows how to properly season dishes and it shows. Even though prices were a little on the high side for Italian food and it got a little noisy toward the end of the meal, it was well worth it."}
{"text":"The best pasta I have had in Charlotte,  made fresh every day. The crab ravioli were out of the world. It was also refreshing to have great service for a change here in Charlotte.  Wine list was simple with some good values.  A plus will be going back soon."}
{"text":"I had such a lovely meal at OGGI yesterday with my sister. Great menu and service with a few complementary amuse-bouches from the Chef. The pasta is made fresh, daily from scratch! I tried  the penne alla amatriciana and mussels, and would recommend both. The ambiance is very similar to Miro's (Spanish tapas) - dark, tasteful, cozy and inviting.   Two critiques. 1) I hate seeing veal on a menu and would love to see it go. 2) A dash more seasoning would take the dishes up to perfection.   Looking forward to going back, especially during the holidays."}
{"text":"Have been here five or six times in the last couple of months. Mostly dine-in, and a couple of to-go orders. The food is for the most part AMAZING. Between the hubby & I we've tried stuffed pastas, the vodka, alfredo, and aglio e olio sauces, and some trout specials - all unbelievably yummy! The mussels sambuca were also delightful - sweet and fresh tasting. We were only unimpressed by the calamari and a dessert that was essentially ice-cream with caramel & jack daniels. Love that the portions are reasonable (not those giant portions at typical american restaurants) and the ingredients always taste fresh. The place is usually a little crowded for my comfort (and we've had to wait to be seated sometimes even with a reservation), but the servers are very attentive and the food is served at a  good pace. So, in our book it's worth the price and wait to dine here."}
{"text":"Hate to rain on anyone's parade here but the food at best is just average.  Called ahead to reserve table for anniversary party - then emailed to see if we could bring in our own wine.   They responded that we could bring in outside wine for $15 corkage fee which is a little high but we had a special bottle for the occasion so agreed.  We were seated promptly but as soon as the restaurant began to fill up, it was apparent the there were just too many tables in the space.  Felt cramped and little privacy for our conversation.  Split a house salad which was not crisp and fresh.  Lettuce had begun to soften.  Appetizer of calamari and zucchini was very.  Ordered 2 specials and lasagna.  Disappointed with lasagna - absolutely no flavor, dull marinara sauce - the entire dish was just bland.  Chicken special was very good and salmon special with blood orange sauce was also very good.  Our waiter went MIA right after salads were delivered.  Never once checked on our entrees.    Getting back to the interior ambiance - this space misses it by placing very tall centerpieces so that you can not see the person across from you.  This could be improved greatly by replacing the centerpiece with candles.    Was disappointed after letting management know it was a special occasion that they never recognized it - a small dessert for the anniversary couple would have been a nice touch.  All in all, this restaurant did not impress me like it has other Yelpers.  Maybe I am just spoiled by Riccio's.  Sorry Rick - we went to the dark side but we are back!  Riccio's rules!"}
{"text":"We are new in town and wanted to give this place a try after seeing the good reviews and liked that they are open late. We were not disappointed.  Very nice restaurant with upscale feel and a great menu with reasonable prices.  The food was incredible and was complimented with excellent service from our waiter, Roger. So many good choices on the menu that it will be fun coming back and trying more. We will be regulars."}
{"text":"Food is way overpriced.  $20 for spaghetti.  $15 for a glass of sangria.  Gnocchi's were ok but too much  cheese.  We will not be going back.  $83 for two people."}
{"text":"I have enjoyed Oggi's since they first opened at least 6-7 times and have brought many friends who did not know about it here. But after tonight on a Wednesday, it may be a different venue for me. I called two nights ahead of time to request a reservation at 6:30 for 6 at the only round table they had. Thomas? took the reservation and said he would make a note of it. I got there early at 6:15 to make sure we did not lose our spot and \"lo and behold\" - they had just given our table away to 6 men. Oh well - but that was just the beginning. Eric, our waiter, seemed to be in a fog. He would disappear for minutes on end. Never any refills of water for the whole night. We had to flag him down to request wine, bread, a chance to order and fresh ground pepper. If it had not been for some of the other waiters, I don't think we would have ever gotten our food. After a grueling evening, we finally stepped out of the place at 8:30 pm.The food was OK (veal portobello was very heavy on garlic tonight and I like garlic). I was embarressed for having bragged on Oggi's and not receiving what we expected. (By the way, the \"greeter\" was nice eye candy for the guys - not sure what other function she served)."}
{"text":"I loved this restaurant!  Small and intimate. Amazing service and the food was out of this world. I had the skirt steak ...the flavor was delish and the steak melts in your mouth! The house salad was fresh and tasty. There wasn't a thing I didnt like about this best kept kept secret!"}
{"text":"All I can say is our dining experience was wonderful. We felt as if we were being cooked for personally. The wait staff was awesome. The food out of this world. This is a must stop if you want authentic Italian food."}
{"text":"I had heard good things about Oggi and my husband and I decided to try it out a few weeks back.  We went in on a Saturday evening early around 6:00 without a reservation.  The hostess was able to accommodate us at the bar or said that she had a table if we did not mind being more rushed and could be out in a hour.  We were planning on an movie and said an hour would not be a problem.  I have to say that everything was fabulous!  We were seated out on the patio and it was a perfect evening.  I believe that one of the managers was our server and he was very pleasant and we enjoyed him.  The food was wonderful.  We started with the caprice and their complimentary bread.  The mozzarella was so good.  My husband got the lasagna and I got the Frutti di mare.  We were both very happy with our choices.  Since we were off to the movies we did not get dessert, but I did on my next visit 2 weeks later!  So, we enjoyed our experience so much that I took my Mom back 2 weeks later when she was in town visiting.  She loves Italian and I knew that she would love this quaint restaurant.  I made a reservation this time and we were seated inside.  I have to say that I think that I prefer outside as the interior is rather small and it was very loud.  With that being said, everything else was perfect.  Our waiter was wonderful and the food again was superb.  My Mom got the lasagna and loved it as much as my husband did, and I enjoyed the seafood special.  For dessert we split their mango cheesecake and the cannolis.  I think I liked the mango cheesecake the best, but both were very good.    I think this is now my go to Italian spot in Charlotte!"}
{"text":"Well, where do I start:  we were seated on the patio and flies were everywhere. We had to smell the cigarette smoke coming from the screens, since the employees would go outside to smoke. They didn't have any flexibility to accommodate any changes to the dishes because they were too busy on the weekends (really?) As for the food, we got the simplest dish:  meatballs. How can you screw that up?  They were so bland, including the sauce. Note to the chef: please call me. I can give you my recipe to redeem yourself.  $19 for terrible meatballs is crazy. Save your money and go elsewhere."}
{"text":"Love this place.  Mussels w/sambuca sauce is wonderful.  We get extra bread just to dip in the sauce.  Heck, I have even had them sub it out on other pasta dishes."}
{"text":"Oggi is located in the Ballantyne area, and is casual with an upscale feel. I went with a group of 9 other ladies on a Sunday for lunch.  They have an outside seating area which would be quite pleasant when the weather is cooler, but it was a little too warm and sunny to sit there on this day. We were seated in the inside covered patio area, and had the area to ourselves the whole time that we were there, which was nice.  We asked for several baskets of the warm bread which they serve. The bread was crispy outside and soft inside, and served out of the oven with cold butter packs.  One of the ladies ordered the Calamari with tangy marinara. The calamari rings were sizeable, and not overly breaded. The marinara had a taste of spicy freshness. Risotto was also ordered for the table, and while it was cheesy and appropriately coked, it lacked somewhat in flavor.   I ordered the Penne Vodka with shrimp, which I thought was good, but not significantly better than recent pasta dishes which I've had. The shrimp were medium sized, and the sauce was flavorful-the pasta was cooked al dente. Surprisingly, the dish tasted better today, when I rewarmed it for lunch.  Service was friendly and efficient, and the staff did well with our party of 10.  I would go back if I were in the area and friends who were with me wanted to go, but I wouldn't make a special trip to Ballantyne to return."}
{"text":"We have known Eloy since he was selling his home made pasta to the trade and began offering it to the public over 20 years ago in Miami.  We celebrated many milestone events in his restaurant over the years and was sad to see him move to Charlotte.  We were in Charlotte this weekend and made it Oggi and am happy to say it is better than ever.  Eloy and his family have a passion for providing great food in a family atmosphere.  The chicken parm is still the best and no one makes angel hair with garlic and oil better.  The eggplant parm and arancini were exquisite."}
{"text":"We had a wonderful meal here with friends!  Service, Food, Atmosphere was all great. The indoor area can get loud, but a fantastic find south of Charlotte/Ballantyne."}
{"text":"This was our first visit to this restaurant and highly anticipated based on the review by Charles Jenkins.  This is also my first review of a restaurant because I was so insulted by our server.  It is also the first time in my long life of over sixty years that I have not tipped one cent to a server.  When asked about our beverage choices I ordered a glass of wine and my husband asked me if he could have a sip because he rarely drinks.  Before I could respond, our server told my husband that he should probably order his own wine because I didn't look like a person who would share.  His remark set the tone for a terrible experience within minutes of our seating. The food?  Rather hard to evaluate when you are upset upon ordering a glass of wine.  My message is to train your servers to use some judgment.  Please give this restaurant a chance.  I am sure the management will make this right."}
{"text":"Amazing food and service. Great service, loved the environment. Keep up the good JOB! I can't wait to come back"}
{"text":"One of my favorite Italian restaurants. It is one of the few in Charlotte that makes me think I am in Italy. My favorite server is Roger. It is a restaurant I take friends and out of town guests and we frequent it at least once a month."}
{"text":"Oggi's food is excellent and the staff is always wonderful even when they are super busy. I would highly recommend making reservations if you have a large party."}
{"text":"Whole cow - this is the best Italian restaurant in this area. The food and service was amazing. Fresh pasta and Italian food that was better than Italy.   Don't te too many people bc this is a gem that should be kept quiet...  Been 3 times will go back for sure"}
{"text":"Service was awesome! Had a margarita flatbread appetizer, which was amazing. Cheese packed Lasagna was delicious! Best to have a reservation but appetizers and drinks are swerved in outside waiting area.  Great restaurant overall."}
{"text":"Went here for the first time on Valentine's Day.  It did not meet my expectations for various reasons.  I was surprised that my seating was on the heated patio.  Each couple was sat in a row with no deviation of table between us.  We choose to split the salad which was nice.  I ordered the Fettuccine (added chicken) and my husband had the Fish special (Sea bass).  I was disappointed that my dish was dry.  I do enjoy having extra sauce on my plate to roll my noodles in.  My husband said the Sea bass was the best he's ever had!  Yet, he was surprised at the $46 dollar price that came with it later. The service was attentive and not lacking.   I do believe this place is good for a casual meal, not a special occasion.  Perhaps the food and atmosphere would be better when not under pressure."}
{"text":"I moved here from New Jersey & this is the best Italian restaurant I have found in the area. The pasta is home made, the sauces delicious & I find the staff very friendly. Only negative is it is a small restaurant."}
{"text":"I was pretty excited to try out OGGI after reading the reviews and wow, what a disappointment. To start with the restaurant was hot and muggy and was immediately swatting 2 flies that continued to bombard us the entire meal. I was meeting a friend who had not yet arrived and was left sitting at the table with no service or water for several minutes. Finally, our server came over, which was one of 3 total times he decided to serve our table that night. I decided to order one of the chef's specials of chicken and shrimp with a white wine sauce, mashed potatoes and broccoli. Not sure if there was something lost in translation but what came out was definitely not white wine sauce. The chicken was chewy, the shrimp puny, and both the broccoli and mashed were drowned in salt. I would have sent the plate back but given that I had to hunt down another waiter just to get bread and water, I didn't have the time or the patience. My friend got the lasagna, which she rated as \"okay\".  I once again had to have another waitress get our check since our waiter was no where to be found, only to have my salty stomach turn at the price of the chicken special - $27! I've had better meals at olive garden. Definitely over priced, under rated and under serviced."}
{"text":"I don't often give 5 stars, but I loved this restaurant.  The ambiance was good, the service exceeded my expectations, and I loved the food.  I went on a Friday night at 6:30 with a group of 4.  We were greeted and seated promptly, and service didn't miss a beat from there.  We ordered the caprese salad appetizer and it was fresh and delicious.  I had the gnocchi (minus the bolognese) and it was some of the best gnocchi I've ever had.  So soft and tasty!!  The other people with me liked their dishes a lot, especially the ravioli.  I would highly recommend this for a nice night out."}
{"text":"Was excited to give this restaurant a try after reading other reviews. From a customer service perspective I was immediately turned off given that we had to wait 30 minutes to be seated WITH a reservation and didn't even get a visit from the manager to apologize. Good customer service is almost as important to me as the quality of the cuisine, so I'm not sure if I'll go back. That said, the service from our waiter was great. I did also like the menu as it offered something for everyone: pasta, seafood, and other appealing options. The food was also very good."}
{"text":"Perfect Girls Night Out. This was our first time at this restaurant but not our last.  We ordered a couple bottles of wine and since everything on the menu looked delicious we ordered a bunch of small plates to share - mussels, crab ravioli, eggplant parmigiano, caprese salad, calamari. They did not disappoint. We also tried the pollo piccatta with a side of risotto. Everything was fabulous.  We will definitely be back with the husbands.  The server let us know that the kitchen closes at 9pm during the week but we didn't feel rushed."}
{"text":"First time here. The food is very good. We had the calamari, bread, chicken Parmesan and veal Parmesan. Only complaint is the seats were hard."}
{"text":"So this place just isn't for me, I'm sure it's for lots of other people though.. so I will try not to pass blame onto the restaurant itself but just describe my experience for anyone who may read this, so they can decide if it's for them:  The atmosphere of this restaurant is kind of casual, but the service we received was very formal. Granted we did arrive before the dinner rush, so we had our waitors full attention. The waitstaff are well rehearsed in describing the dishes and wine selection, they deliver fresh silverware on clean napkins draped over their arm and gently remove crumbs or sauce from the table between each course. I think many people love that kind of service, I personally find it uncomfortable. I just want to concentrate on who I'm eating with and stay indulged in my conversation and meal, but the waiters need to check in, fill a water glass or wipe a crumb makes me feel rude if I don't thank them, smile & engage their curiosity of my feelings on a dish each time they stop by. Reminds me of the formal meals I watch being served on Downton Abbey. Aside from the overly polite waitors, the food is good! It's expensive, but homemade and unique. Please learn from our own mistake though, and ask how much the specials are before agreeing to them. Tonight my husband enjoyed a bowl of soup that might as well have cost him his birthright.. (($35 for one bowl of soup is never okay)) and last but not least, the lobster sauce that comes over the crab ravioli is VERY salty! The servant boy who checked in on us every 5 minutes assured me that it was supposed to be very salty, so once again... just not my thing!"}
{"text":"A nice hidden gem of a spot with consistently good food with both indoor and heated outdoor seating.  A bit crowded at peak times due to the tasty food.  The service staff and management are quite disorganized, and in some cases rude to customers often canceling on customers with reservations at the last minute etc. Food is designed for eat in only, take-out is not recommended."}
{"text":"We have eaten here several times and have always liked the food ordered.  We have gone on Saturday afternoons and there is never a wait.  The service is decent."}
{"text":"I love eating at Oggi's every time I visit Charlotte.  However, on my last visit, the lava cake (which I dearly love) proved to be merely mediocre.  After having sent back the first piece for not being warm, the second piece was warm, but had a solid core.  It wasn't that luscious runny chocolate that is usually served up.  That was a big disappointment after a delicious meal."}
{"text":"Stopped in tonight for the first time. Sat at the bar. The bartender was personable and attentive. He suggested a drink special, I got it and he was right it was delicious. I ordered a chicken special, and it was amazing! I tend to not order chicken cause I think it's blah and you can make it yourself but this was soooooo good. I was going to order another drink and was suggested a different one, and again so good. Being new to the area it was great to get such good food and amazing service. Will definitely be back!"}
{"text":"Teeny little place, and sat under air vent that turned me into an icicle every time it kicked on. Service was impeccable and the food had great potential - but it juuust missed the mark. A couple of appetizers were pretty tasty, but entrees fell flat. Our table was pretty high-maintenance though...so maybe we made them mad. ;)"}
{"text":"Best Italian food I've had outside New York. 4 small plates served as starters and four excellent mains followed. Veal, meatballs, risotto and ravioli. All perfect. Portions were ample without being too much. Service attentive without being overpowering. We will be back."}
{"text":"I don't understand all of these \"great food\" and \"excellent restaurant\" reviews. First off, our server was very good, and the bread was excellent. We ordered two Ginger Berry Snap drinks. At $12.00 each, I expect the glass to be full, not 2/3 full.  As for my spaghetti and meatballs, nothing special here and certainly not worth $19.00. To be fair, husband's $18.00 Risotto Primavera was pretty good.  They do not have salt and pepper on the table - you'll have to ask for it. Keep in mind that everything is à la carte.  All that being said, what was our first visit - also became our last."}
{"text":"The service was perfect, I mean by the book!  Very happy with their great quality food, good size portions,  good wine, good pasta, had a whole grain pasta option for me, and good tasting coffee.  Very reasonable prices!   I can't wait to go again."}
{"text":"One of the best Italian restaurant I have ever been to.  Great service and our waiter made excellent recommendations."}
{"text":"The food was excellent as was the service. However it is hard to hear as the acoustics were not so good. The owner came by the table and told us it was going to be fixed in the winter.  Highly recommend this restaurant"}
{"text":"Good apps. Great salads. Wonderful entrees. Decent wine list. Spectacular service.   And for some bizarre reason they have two TV's mounted on the walls that were tuned to ESPN sport center with the volume muted. So where am I? Am I in a sports bar or am I in a fine dining restaurant?  There was muzak playing. Lame, lame ass muzak. Annoying tedious muzak.  And why am I sitting on a board? A board that never becomes less hard as time passes. No, really, they have you sit on a board."}
{"text":"Well,  I am going to go off the assumptions that most people eating here are native to North Carolina. The food is NOT bad at all. It's also not good enough to be called a restaurant, if it was a pizza place, I'd give it more stars.   We had the Pasta and meatballs and flatbread and pasta with clam sauce and my mom had some minor small dish. To be quite honest,  nothing was restaurant worthy.   Also,  take note,  they have No AC unit and its hot as crazy in there and has been for two months per the staff.    Anyhow, tbh don't waste your money if you are used to real food. Lorenzos does it much better but in a pizza type place."}
{"text":"Absolutely the best, no question, pasta in Charlotte!! Nothing even close exists in town. Portions are a bit small...but that might just be how you feel because it's that good!...Try the angelotti it is to die for, and the creme brûlée for dessert!!"}
{"text":"Had an amazing experience at Oggi a couple months ago. Our visit started off on the wrong foot when our table was not ready even though we had a reservation. We ended up waiting quite a while for our table because they don't have many tables that are able to seat large parties. Once we finally got seated, they completely made up for the inconvenience. We received complimentary appetizers: the bocconcino emiliana, calamara & zucchini croccanti, bruschetta - all delicious! The entrees were even better. They make their pasta fresh daily and the pasta noodles just melt in your mouth. Great ambiance and nice decor, fantastic service. We will absolutely be returning."}
{"text":"Delicious gnocchi pasta with bolognese sauce and good wine selection. It was a little noisy the weeknight we ate there but I liked the service and will return again."}
{"text":"The food is good, maybe a little better than good. Not a fan though of he atmosphere. Too open and felt like we were at a lobby with Tvs."}
{"text":"The food  was amazing !!! They modified the menu to accommodate my wife that can't eat red sauce !! I eat the chicken special and my plate was totally clean !!!"}
{"text":"Coupon for a free kids meal with any adult entree during the month of March 2014 at the end of the blog! MomAboutCharlotte.com  I'm an Italian girl (don't let the red hair fool you), and since I've moved from Upstate New York I've been on the hunt for amazing Italian food like we had at home. My search had been full of meh marianaras and not as good as my Aunt Regina's meatballs.  We were invited to dine at Oggi in Ballantyne for the 'Mommy's Favorite Thing to Make for Dinner is Reservations' blog series. BEHOLD, the Italian cuisine hole in my soul was filled with fresh made pasta, to-die-for calamari, and one exquisitely tasty meatball! We had the two tots in tow and they were happily greeted with a basket filled with crayons, coloring sheets and fresh made Italian bread with butter. If my daughter had three wishes, the first would be to live on a diet of Italian bread and butter. So she was happy at the get go.    Our waiter explained that Oggi means \"today\" in Italian and that they chose that name because everything from the sauces, to the pastas, to the bread and desserts are made fresh at Oggi each day - from scratch. The veggies and fresh ingredients are purchased from local growers.    We began our meal with two appetizers. First was the boconccino emiliana which were lightly fried croquettes made of risotto and filled with a decadent mozzarella, pesto, sundried tomatoes and presented on marinara sauce - de-lish. The second was the calamari & zucchini croccanti which was slightly spicy, and hands down the best calamari I've ever had. I made the mistake of taking our daughter to the bathroom while we were enjoying the appetizers and when I came back the remaining calamari had quickly vanished into my husbands stomach. Well played Jim, well played.  We requested that Eloy, the owner and chef, choose the entrees for us and he was spot on with his decision. Eloy selected the crab meat ravioli served in creamy lobster sauce for me - and oh my. The ravioli were like pillows, light and savory - it's like he knew I am a huge seafood fan. They were unlike any of the dense cheese filled ravioli I've tasted before in other restaurants. This dish has firmly planted itself on my 'must try again' list.  On our way to the restaurant I started telling S about where we were going and asked her if she could think of any foods that she had eaten that were Italian. She paused for a moment and said, \"Um.. well, yea - a latte.\" Which left Jim and I in stitches as he asked her \"When have you ever had a latte?!\" She hadn't, but we all giggled and began talking about her Italian heritage and all the things we thought were going to be on the menu when we arrived.    S's favorite Italian dish is fettuccine alfredo, and score, they offered this and many more choices on their children's menu. S told me it was her new favorite fettuccine alfredo place to go. She gave Oggi two glitter nail polished thumbs up.  Our son loves marinanra, ravioli and meatballs. He inhaled his portion, exclaiming 'MMMMmm!' He's getting to be such a little person with opinions he wants to share with the rest of us at 19 months old. The restaurant was somewhat quiet because of the time we arrived (5PM on a Monday), so I was a little nervous our LOUD son was going to interrupt other people's meals with his outbursts of excitement or dislike. Luckily the restaurant began to fill as we ate and our kid's voices fell into the background of other diners talking and enjoying their meals.  Then came dessert, which was a decadent cheese flan with fresh made gelato, drizzled with caramel happiness. I couldn't think of a more delicious way to end our meal. The kids simply inhaled it as we 'shared' and I savored each bite I was able to sneak. If you go - save room for dessert - you can thank me later.   The ambiance home-style casual but posh enough for date nights and MNO's, and the prices are quite reasonable ($15-$20 for most entrees) - especially for the homemade, fresh, quality and quantity of the food.  The only down side to our experience was the lack of a changing table in the bathrooms, something I was told the owner is looking into adding soon. The entire restaurant was clean, trendy and the taste of the food made it an absolute Italian Gem in Ballantyne. I highly recommend trying out this little slice of Italy.  Jim's take on Oggi: Oggi is a top notch Italian restaurant.  All of the food is prepared fresh daily, and it really shows in the quality of the food.  Everything I tried was excellent.  I could have left happy after the fresh Italian bread and the Calamari & Zucchini Croccanti appetizer (fried calamari and zucchini with a spicy marinara sauce).  Fortunately we didn't, because then I got to experience the rich, delicious Pollo Marsala, featuring a tender chicken breast, sliced Portobello mushrooms, and linguine tossed with fresh garlic."}
{"text":"Wen to Oggi for a date with my husband. The food was so good! Fresh baked warm bread was delicious. Chicken parm and pasta bolenese were fresh and delicious. Desserts and coffee sooo good. We were celebrating my birthday and thought maybe they would bring a complimentary birthday dessert over like many restaurants do but they didn't. Overall great meal would go back."}
{"text":"AMAZING new little place.  I wasn't sure what to expect, and WOW was I surpised.  The food was SO fresh, staff so attending, and THE best Tiramisu I've ever had.  A new favorite!!!!!"}
{"text":"Wow, great food and great service. This was our first visit and Ivan was a tremendous help with great recommendations. We will defiantly be back very soon."}
{"text":"been once and experience was awesome,had pasta and meatballs and sauce was the best ever tasted,patio was heated and waitress was very helpful in picking food choices and appitizers.would recommend and go back"}
{"text":"EPIC, period!!!  Been coming here over a year now, it's our entire family's favorite, kids choose Oggi for birthday and special occasions over ANY other restaurant! We skip lots of weekday eating out so we can try to get here every 2 weeks but sometimes we come weekly! If I could afford a private chef, the food here would be my every day menu!  Food is always FRESH, taste of every dish is outstanding, staff is amazing....this restaurant is quite honestly one-in-a-million.  They take reservations, so on a Friday or Saturday you should call a day before if possible! We've gotten in though if we were flexible with early/later seating.  Recently they did a menu change, so lots of updates based on the past year of operation & customer feedback. The great staples like lasagna, veal/chicken picatta, salmon dishes & great kids options still are on the menu!  It's Italian Mediterranean style.  They make their own pasta fresh on site too!  No Italian place in Charlotte compares, but you'll have to try it for your own opinion!"}
{"text":"As reviewers have noted food is very good.  Our Ravioli dish came out cold but was still good.   They allowed us to get the largers salads as side dishes (which were smaller) which was nice.  My biggest complaint was the small wine pour for a $10 glass of wine.   So disappointing.   Additionally, for the price of our meal approx $85 for 2 I'd like to see them use table cloth's.   They did give us a free appetizer for our Anniversary which was very nice.  Overall a nice experience."}
{"text":"Terrible nightmare, rude staff, terrible food. What a dump. Your neighbor table might as well have dinner with you. Owner son is a nightmare."}
{"text":"I did not have particularly high expectations for Oggi and figured it was just another typical American-style Italian restaurant.  I must say, I was pleasantly surprised.    The restaurant was decorated a bit nicer inside than I expected it to be given that this space used to house a fast-casual Mexican place.  I was there for a lunch and on the day of my visit, there was a good crowd there.    I decided to order one of the specials which was a chicken dish served with pasta and choice of soup or salad.  I was a bit surprised when they brought the bread out and also brought 2 pieces of bruschetta.  I was really impressed with the bruschetta - it was true Italian style - simple fresh ingredients consisting of garlic, tomato and basil.  Perfect!   My salad  was a fresh mix of spinach & greens and the champagne vinaigrette was very tasty.   But the best part of course was my entrée.  I can't remember the name of the dish, but it was delish.  It consisted of a sautéed chicken breast served with a side of pasta in a fresh tomato sauce.  Everything was very fresh and flavorful.    Prices were very reasonable at lunch. I think my dish was around $11."}
{"text":"The food at this restaurant is very tasty.  They accept reservations and are always in time.  I have eaten there several times now and every time their service is fantastic and friendly!"}
{"text":"So sad cause this place is so good but we had a very bad experience here. They close the front door and have people come in threw side now but when you go threw side there's a stand that looks like some one checks you in there but they don't you have to walk in and check in at the bar. They kept coming out side when we were waiting on table and calling wrong names and skipping people I saw two separate couples get skipped and get very angry.  We almost got skipped and I said no we had a reservation and got here before them any ways so they sat us. Then the waitress was a b with resting B face the whole time. That wasn't a big deal what was a big deal was when we sat down we got wine and carpaccio 15 mins later still not at the table. I asked her when it would be out and she had a lost look in her face and said yea it will be right out. I saw her run to the computer I'm assuming she just then put the order in, 45 mins later still no carpaccio. She said that carpaccio doesn't come out as a appetizer it comes out as a entree that's what set me off. She had no idea what she was doing and kept lying about stuff finally manager took over and apologized and admitted that she was incorrect about the carpaccio being A entrée. Needless to say but it will be a long time from now IF I do ever go back."}
{"text":"Really good menu selections and tasty food. Attentive friendly service. Just wish the ambience was nicer(reason for 3 stars)"}
{"text":"great food!  great service!  reasonabley priced!"}
{"text":"What a great find in this area! I have driven by this place 100 times but never stopped in. So glad I finally did! The place is romantic, modern and stylish.  Went for dinner on a week night and was surprised at the number of people there. Once I tasted the food, I knew why!  First off, the waiter was so professional and made great food recommendations. We started with the rissotto balls -- in a word -- DIVINE!  Then went on to the homemade lasagna (a MUST HAVE)! The food was so great and authentic, I will be back here! The best part is that they make most of the pasta from scratch!! Very hard to find in Charlotte! Great for a romantic dinner or just when you are in the mood for some delicious pasta!"}
{"text":"Great service.  Good quality food.  Will become a regular here!"}
{"text":"Not from the area and my son and his family and my wife tried this restaurant based on yelp only. We were all very happy with our meals. The Zuppa DePesce was out of the world good. Not over price for the quality of food, presentation and service. I will be coming back the next time I am in town for sure!!"}
{"text":"We dined at Oggi yesterday for the first time.  We had reservations at 12:30 and were seated right away.  The food was amazing. My husband and I ordered the carpacchio and grilled octopus to start. Both were really good!  For our entrees, we ordered the prosciutto caprese roll, chicken picatta and brown butter/sage agnolotti.  The flavors were spot on! I would say that the chicken portion was pretty small with the picatta.  We had one small piece of a breast and then two little pieces on the side. I would have preferred one piece, or one filleted breast. The only disappointment of the meal was our server.  He was pretty bad, never introduced himself or talked about the menu. My husband and I both thought he was the busboy, until he asked us what we would like to drink.  He also assumed I wanted the caprese salad when I know for sure I asked for the prosciutto caprese roll.  After sending it back, he said he assumed it was the salad because why would we order three entrees? Well, I wasn't planning to cook dinner and wanted left overs, so that is why. I just wish he would have asked instead of assuming. The food was great though, so we will be back!"}
{"text":"QUICK: EXCELLENT Food - but overpriced   We visited the establishment on 5/28 and had a lovely meal. Service was prompt and polite, meals were well portioned and prepared thoughtfully. Atmosphere was quiet at 5pm, but quickly bustling with larger parties just an hour later.   Bruschetta - ripe tomatoes, balsamic glaze, perfectly crisp ciabatta, delish! Mussels (red sauce) - tender and spicy Penne vodka - dressed in a refreshingly light variation of the sauce.   Gnocchi - texture textbook pillow - we swapped the gorgonzola for bolognese ($1.50 charge)   The only reason I removed a star is the prices. While the food here is wonderful, this restaurant seems to benefit from supply and demand - being far and few quality Italian restaurants around the Fort Mill/Ballantyne area. Yes, my family is Italian, Yes we were spoiled in NY and Italy, but $19 for Spaghetti Meatballs, OUCH, great-grandma is rolling over in her grave.   As with most restaurants the wine is double or triple what you'd pay directly, completely understand they have to make a profit, but I'm hesitant to pay $66 for a bottle from Avignonesi when I have the exact one at home purchased for a fraction of the price at the winery itself. More affordable options on the per glass menu would help take the sting away a bit.   We'll definitely be back for special occasions, but will keep whipping up Italian favorites at home till we find a more wallet friendly option for frequent date nights."}
{"text":"Ate at Oggi with wife & daughter for the first time last night.  What a nice experience! All 3 entrees  & appetizers were fantastic!  The chef/owner makes everything from scratch.  Nice clean & relaxing atmosphere!  Waiter was very professional! I'll definitely go back!  H"}
{"text":"I am not sure if everyone is talking about the same restaurant. The Oggi that I went to in Ballantyne was great. I have only had lunch here on two occasions and both times the food was excellent and the service was not an issue. Service is not in quick out quick but my drink glass was kept filled as was my father-in-law's coffee and the bread basket arrived soon after we requested it.  The food is top notch and as good as or I think slightly better than Toscana or Fiamma my other go to Italian restaurants. The linguine with octopus ink and seafood is first rate and the lasagna, which they claim is the best, may just be the best in a Charlotte restaurant. As for the prices their lunch prices are cheap, if you ask me and while I have not had dinner here yet their dinner prices look on par with other similar restaurants. I highly recommend you give the place a try. First try it for lunch and if you think I am blowing smoke you are out very little money but if you agree with me and many other happy diners you can then go for dinner with little risk and have a first rate Italian meal."}
{"text":"This was our third visit to Oggi and by far our most satisfying! I ordered the mushroom risotto, as an appetizer and an evening special of Gnocchi in a pork ragu.  The maitre'd made an excellent recommendation on a bottle of Italian red. From start to finish, the service and the quality of food was worthy of five stars.   But oh that risotto.... deserving of five stars alone. A diverse blend of fresh mushrooms and a delicious sauce bathing the PERFECTLY prepared risotto. The entree was delicious potato pillows, perfectly sauces with just enough pork to provide a contrast in flavor. But on our next visit it will be the risotto as an entree......it was that dam good period!"}
{"text":"The food was absolutely divine. We ordered the bruschetta appetizer, house salad , I ordered the lobster ravioli and my husband ordered the special which was pumpkin ravioli. All the pasta is made in house fresh everyday. Everything was absolutely delicious and the service was impeccable . They have a full bar and excellent wine choices.  Reservations are suggested the only non reserved seating they have it out on the patio. If you plan on sitting out on the patio bring a jacket or a sweater the wind between the two buildings really gets moving."}
{"text":"Friends recommended OGGI and it was indeed fantastic. I had the lasagna and hubs had the halibut special, which he said was the best he'd ever had. I enjoyed every sip of my Cucumber Cocktail and the bread was fabulous. I haven't had service this on point in a long time. I think the family touch and true teamwork displayed by the staff made it a lovely dining experience."}
{"text":"Ate there recently and hostess was not accommodating. She offered us a table on top of the bar and when we asked for other open tables instead she said they were all taken (we had a reservation). Another hostess finally seated us at another table after we started to leave. Inside is very noisy and no way to carry on a conversation. Food is good but overpriced. Wife had 3 small slices of eggplant and a scoop of mashed sweet potatoes for $19. Server was very good. Won't be back soon. Other more accommodating, quieter and more price appropriate Italian restaurants available."}
{"text":"Perhaps I was too hard on Oggi during previous visit when I was not served.  On latest try at same evening time, Oggi was open much later, for unknown reason.  Bartender gave perfect menu recommendation for dinner, and excellent service.  I intensely dislike giving bad reviews to small businesses, and Oggi is exactly the type of family-owned business that deserves everyone's patronage.  Really great food and drinks at Oggi.  Highly recommended.   So glad that my second experience here was wonderful."}
{"text":"We had a take out order, the food is amazing!!!! We had the fried calamari/zucchini appetizer, great seasoned light breading , and the marinara sauce that comes with it, it's perfect! It's not your generic marinara \"paste\" ,  their marinara sauce is light, fresh,with a hint of lemon and not too tangy. I would say it's probably my favorite marinara sauce ever!!!  We had the homemade fettuccine with fresh pesto, hmmm it feels like I'm in Italy ! The pesto is super fresh and the pasta is delicious , though I wish I had picked a cream based sauce for the fettuccine or spaghetti to go with the pesto instead,still we devoured the pasta!   This is definitely one of the best Italian restaurants in Charlotte! Excellent quality of food, great service.    The food is soooo good, I still think about it hours after!   I came back and got the risotto croquettes ! They're pretty tasty, but also it's a bit filling!"}
{"text":"Ok. Great food when you can get it. Hours per Yelp , \"dinner is until 10:00pm.\". Tonight, at 9:12 pm. I walked in and they said they're closed. (!) This is the second time this has happened to me. Be warned, if the sun has gone below the horizon you're apparently taking a chance."}
{"text":"I would have given this restaurant 1 star, but the food was actually decent. The A/C was blowing so strongly at our table that it cooled my food down very quickly (and it was uncomfortable as well). The service was terrible. They were out of the ciabatta rolls that all of their sandwiches are supposed to be served on, and substituted another bread. The substitute was ok, but you would think that since all of their sandwiches are made using this bread, they would try not to run out of it. The worst part was the poor communication of the server. We were not advised of the daily special, but then overheard the table next to us being told the special by another server. When we were told about the bread situation, we asked what the substitute was. She was unable to explain it more than \"it's like the bread that we bring out before your meal.\" When we asked what that bread was like, she really couldn't tell us. There is no written kid's menu, which would be fine if the options were clearly explained by the server. She listed a number of items (chicken tenders, macaroni and cheese, spaghetti and meatballs, pizza), and after listing them all said \"and you can get fries with that if you want.\" So, our daughter ordered the Mac and cheese with fries. After we paid our bill, we realized that we were charged $8 for a regular sized order of French fries, in addition to the $7 they charged for the macaroni and cheese. When we asked about it, they told us that was \"only with the chicken tenders\" and left it at that. Our daughter's $15 \"kid's\" meal\" ended being the most expensive part of our order."}
{"text":"Great Italian food in South Charlotte. We went with a huge party and the place was packed - made reservations ahead of time but still could only get an 8:30 p.m. reservation. Oggi's homemade pasta is awesome but requires an upcharge if you're wanting to replace one of their other imported pastas in the entrees. Very accommodating with our party's dietary needs. Will definitely be back!"}
{"text":"The food here is beyond delicious and very fresh. I had the penne vodka and it was hot and had lots of fresh ingredients. The manager and wait staff is friendly and very attentive. We even got a small plate to try on the house. The atmosphere is inviting and has a nicer feel to it. They have a great selection of wine and other cocktails. Price wise the special which was chicken, shrimp and ravioli was $27 and the penne vodka was $15. I definitely recommend this restaurant if you are looking for a new nice restaurant."}
{"text":"Terribly disappointed with the service here. Showed up just before 6:15 for dinner and was told that without a reservation, we couldn't be seated either outside or in the restaurant unless we sat outside the front door. More than 75% of the tables were empty at that point and so we even asked if there was a certain time that we needed to be out by since there were clearly seats available, but were told this couldn't be accommodated by the kitchen. I would have tried to eat here another time, but won't be back due to the rude manner of the host and the other individual who may have been the manager."}
{"text":"The penne past dish with the mozzarella pearls was delicious! I added the meatball, one was plenty. There were slivers of fresh garlic, Oh so yummy!  Our server was cordial and friendly."}
{"text":"Best Italian ever!!!!!  This is my favorite restaurant in town.  Food and cocktails are fantastic every time."}
{"text":"Taking Oggi to five well deserved stars.  They have continued to be consistently good in food quality, menu development, service and accommodation of customers.  Dinner was early.  When we entered there was a table for 14 and another for 8, so a reminder to get reservations (yes, they are getting that well known and loved) and to arrive early rather than late, especially for dinner.  Special was a frutti de Mare with a small lobster tail, shrimp, clams, mussels over linguini.  I asked for lemon-wine-oil rather than the creamy sauce and it was just fine.  I ate everything except the shells!  Wife had a wonderfully rich chicken in port wine sauce and Gorgonzola cheese which had a pasta side.  Absolutely rich and flavorful, so much so that we took some home.  Excellent combination.  Ordered one salad to split.  They are OK with splitting as the salads are huge and you have to be really ravenous to handle that and a meal.  They split it and serve it on two equally pretty plates.  Bravo.  I had a glass of wine that I thought had turned into the vinegar area.  Our server, Alejandro, immediately wanted to replace it but I suggested that he have some people taste that bottle as sometimes my taste might be off.  A good test of excellence is to see how a restaurant handles a problem.  Oggi's manager and Alejandro came back to the table and without saying anything about the wine glass I had presented my with two new glasses.  One was from a different bottle of the same wine I had ordered and the other with a nice Cabernet.    Yep, both wines tasted fine, so my bottle was bad, but they smoothly avoided that by offering now the both of us with replacements.  We appreciated and continued with our meals.    A classy and fully appropriate management and server intervention.  Think that will bring us back?  Absolutely.  Oggi has become a great restaurant.  Enjoy."}
{"text":"I have only ordered takeout from Oggi.  The food was good, but overpriced for the portion size.  The cannoli were not homemade; they tasted like the ones you can get at a grocery store.  They may have put the filling in the shells, but the shells were pre-made.  The crab meat ravioli was good but the eggplant in the eggplant and mozzarella appetizer were too tough.  The people working were very nice.  Sanitation grade was relatively low at 90.5.  I'll go back to eat in and see if it's a little better."}
{"text":"Visiting from Chicago. Came to check out the Ballantyne area. It's really nice. Tons of nice restaurants in the area. We agreed on this spot because of the yelp reviews, and my teenager really wanted Italian food.   We sat outdoors in their tent area. Our server was decent. Felt like her mood kind of changed after we placed our order because we didn't order big ticket items. I'm pregnant so I can't drink. My husband didn't drink either. Plus we both were not really hungry. We had a big heavy late lunch. So we ordered salads. He ordered chicken caesar and I ordered the same with no chicken. We both didn't like their caesar dressing.   My teenage daughter ordered gnocchi. She is a vegetarian. We always eat where my husband and I want to eat, so we let her make this night's dinner choice. We were specifically there just for her. She wasn't crazy about the gnocchi. It was kind of spicy. She said she's had better, and would give it 3 stars. That's why I'm rating my review with 3 stars. We also ordered pizza for our younger kids off the kids menu. I have a 3 year old and 1 year old. They shared the pizza and loved it.   Our bill was $50...$60 with the tip. We were kind of annoyed because we spent that and then our teenager said she would have preferred Mac and cheese from Panera. Waste of money trying to please her."}
{"text":"Food was excellent.  Service was slow We had pasta, quinoa salad, and bruschetta.  Manager noticed we were getting tired and stepped in to help.  Great food, even for vegetarians."}
{"text":"Just came here for the first time and could not be more pleased. The food and service was great. Would highly recommend this charming restaurant."}
{"text":"Some of the things I find in reviews.... Must be written by the same princess who slept on the pea!  We stopped in tonight with no prior knowledge about Oggi. Knew it was here, saw it while scouting for a place to dine, and we're so glad we stopped! From the outside, you wouldn't expect \"nice Italian restaurant\", but it is indeed! Great menu, superior service, very well prepared food, good wine list... those things (to me) mean four stars!  Yes, I heard Italian vocal music, and yes there are two TVs w/sports tuned in, and I haven't a clue what I sat on while I ate. But I DO know, I'll be back!"}
{"text":"This restaurant used to be my favorite place for Italian food in Charlotte. The food was always good and same thing with the service. Having said that, something seems to have changed and they really missed the mark with service tonight.   Service with our waiter was really slow (other tables that arrived 30 minutes after us got their food before us),. My food order came out wrong but I didn't bother to say anything because of how long it took. Finally, when we asked for a dessert menu our waiter told us that we couldn't have one because our table was reserved and the other party had arrived.  I can't say I've ever heard that anywhere before let alone a place where you've thrown down $300 on dinner.  I gave them two stars because the food was good but the service was terrible."}
{"text":"food, service, drinks, restrooms, bar, dessert, parking, music, variety... all good. prices disappointed part of my group but that was the only concern. i loved it and so did everyone else in my group (of 7)"}
{"text":"Love love loved it!! Can't wait to go back.  Can't wait for family and friends to come visit to take them there.  Good food, good atmosphere.  Had to try the whole nine from app to desert and everything was amazing"}
{"text":"Sorry, but this is not a particularly good Italian restaurant. The food was, across the board, bland. Admittedly, I'm jaded. Where I grew up, Italian restaurants of every range are ubiquitous. This place looked the part, but didn't deliver. Service was fine, but the food was tasteless and boring."}
{"text":"One of my favorite restaurants in Charlotte.  All my family loves it.  The food and service is outstanding. Sal is the best.  Not many great Italian restaurants in Charlotte , but this is as good as you get here.  We have been here multiple times and it just gets better and better."}
{"text":"I must say that I was pleasantly surprised at how great the food and service was at OGGI.  Me and a couple of girlfriends decided to eat lunch here and had heard good things about the food so we were excited to try a new place.  We were greeted by the waiter who sat us immediately and offered us water as we made our selection.  We told him we had never been here before so could he give us a few minutes and he graciously did so.  He asked if we had any questions and helped us make our selections.  We ordered the bruschetta for an appetizer and it was wonderful.  I love their bread, not the typical garlic and oil dipping kind of bread or breadsticks but wonderful rustic bread.  When our meals arrived they were steaming hot, an indication that they were fresh.  One of the meals was a little to spicy and he quickly whisked it away and brought another shortly afterwards.  He explained that sometimes using the fresh garlic can give it a stronger spice and the second dish was much better.  I did taste the dish and would have been satisfied with the first one which goes to show how each of us prefer our dishes.  All in all the serving sizes were fantastic, service was outstanding and very pleasant and the atmosphere was very enjoyable.  We spoke with the waited about the history and was surprised to learn each dish is made from scratch per order.  So if there is a little bit longer wait for the meal that is why.  But then again when I go to a nice restaurant I hate to be rushed or have the meal come out while I am still eating my appetizer of salad.  I truly look forward to my return visits."}
{"text":"I was very impressed with the atmosphere and quality of the food. The restaurant is very quiet and you get personalize service.  I was disappointed that they charged a $20 corking fee without telling me... I don't like surprises and the waiter did not care when I mentioned it.   We will be back but disappointed with the lack of transparency."}
{"text":"I have wanted to check out Oggi since moving here from CA. They did not disappoint! My entire family enjoyed their dishes, and the sleek, modern look creates a lovely ambiance. We will definitely be back - so many other dishes to try!!"}
{"text":"I love this place my favorite dish is there chick picanha. I also like there spaghetti and meatballs the meatballs reminds me of my mama meatballs . There tomato sauce is a bit salty but I still like it . The staff is very friendly as well."}
{"text":"Very attentive service! A team of folks keep the table clear, bring your food and fill glasses. Good wine list. The food was delicious. Don't miss the risotto croquettes (named Bocconcino Emiliana on the menu). Available as an appetizer or small plate. The marinara served with the risotto croquettes is house made and is so fresh and tasty. This small plate was my favorite dish of the evening.   Our server gave us the option of having half servings of the salads which was just right with a full meal. Both the Baby Spinach salad with goat cheese (Spinaci Contadina) and the Chopped Oggi salads were great. For entrees the Pollo Picatta had the right lemon zing and lots of capers. My husband enjoyed the Gnocchi Bolognese. We ended with one very large piece of Tiramisu. We will be back.  It is a very small restaurant and some tables are close. The seating reminded us of another Italian restaurant we used to frequent when we lived in Ohio. If you are at a table vs a booth, it is \"cozy\" and you are close to other diners. Yes, I would have preferred a booth, but once I had the marinara, I forgot all about sitting in a booth. If close seating bothers you, plan to go during slower days of the week or at non-peak dining times."}
{"text":"My husband and I have been to Oggi's too many times to count.  We have never had a bad meal, or bad service.  My only complaint is with our most recent visit.  My husband and I went to dinner over the weekend.  It was a Friday night, and not as busy as you'd expect.  Once we were seated, our waiter came over to get our drink orders.  When he came back, we ordered our appetizers.  Our waiter then told us that we need to order everything at one time, because they were sure to get a rush any minute and we would end up waiting for close to an our for our entrees if we didn't order right then and there....and that was kind of the way our whole evening went.  He was a little overbearing and pushy throughout the entire meal.  One of the reasons why we enjoy Oggi's is the fact that the atmosphere is so relaxed.  It normally is just like being in Italy...you're welcome to stay as long as you like.  We felt very rushed throughout the entire meal.  Our waiter was very nice, but seemed to be a little more interested in getting rid of us for a new table.  Also, they never did really get overly busy. This definitely won't deter us from coming back.  As I stated before, we absolutely love this restaurant.  We were just disappointed with the service this time around."}
{"text":"We just moved to the area and were disappointed in the selection for nice places to dine until we found Oggi. I was surprised that it was so full on a Sunday evening but I understand why now. The food and service was great. Drew, our awesome server, walked us through the specials. We never even looked at the menu they sounded so delicious.  Great food, great service, going back for sure."}
{"text":"So delicious! We have eaten at Oggi several times and each time have had great service and a great meal! My favorite is the linguini with clams...delicious! Best Italian in South Charlotte!"}
{"text":"Phenomenal scratch made Italian good. Amazingly good. Reservations are recommended but a wait would still be worthwhile.  Our favorites are fettuccini, lasagna and chicken parm. Everything is super fresh and the service is impeccable. We've been several times now and never disappoints!"}
{"text":"Our first visit and most likely last.  The food presentation was ok. One of us had the  Spinach Salad which was ok, and the Lasagna, which had unusual spices.  The other had the Ceasar salad which did not taste like a Ceasar and the Penne Vodka with chicken, which did not have much flavor.  Would choose others over this one.   Had a couple of large groups..one was very rowdy and created a lot of noise for all guests to endure."}
{"text":"Omg the mango cheesecake is amazing. The fork cuts through it like butter and the mango flavor is fresh. Had lunch here today and it was thoroughly enjoyable."}
{"text":"Our favorite Italian restaurant in the Charlotte area. Flavor filled menu items with an artisan approach to their beverage choices. Vast majority of dishes homemade. Friendly, attentive staff."}
{"text":"Good food, good service, nice selection of food... what more can one ask for? Didn't try the desserts, but they sounded yummy. There were four of us and each of us enjoyed our meal immensely. Will definitely be back."}
{"text":"We have been to Oggi on a few occasions, but this restaurant never disappoints.  The experience starts with the service and attention to detail.  The service team is just fantastic and this is absolutely a family friendly restaurant.  The kids placemats has a crossword puzzle and a few of the questions need assistance from the wait staff, but they are thrilled to help out even telling the kids to let them know when they need a few hints.  I love a restaurant that puts an emphasis on helping the kids enjoy the experience of eating out. And the food is truly great.  I often get bored of eating the same types of food at Italian restaurants, but there are a bunch of creative dishes on the menu that provide a great variety along with the traditional staples.  But I have to admit that during our last visit, my husband tried the chicken parmigiana, and honestly it was one of the best I've ever tasted (and I grew up in NYC).  This restaurant is truly worth every penny in my mind.  It's the place my in-laws ask to go when they visit from Florida, and it's a place I trust recommending to others."}
{"text":"Awesome experience. Fresh flavorful scratch cooking. Bruschetta was amazing as it was grilled and they used a very high end balsamic . We also had the chicken piccata and a gnocchi dish with marinated skirt steak. Service was impeccable."}
{"text":"This is our favorite restaurant in the Ballantyne area. Delicious Italian/Cosmopolitan cuisine is served from an Argentinian Chef/Owner. My favorite dish is the grilled veal scallops served over aglio/olio linguine pasta (garlic and olive oil.) It melts in your mouth! We have had perfect steaks, seafood (delicious squid and calamari appetizers) and pasta dishes here, and all were amazing! We have even dined here for New Year's Eve. I highly recommend Oggi for fine dining at its best. My only suggestion for improvement would be to ditch the TVs!"}
{"text":"Great food ! The Crab ravioli is amazing ! This tucked away restaurant will surprise you ! Also any chiefs creation for the day is worth a taste"}
{"text":"This is one of the best Italian restaurants around.  The service is impeccable and the food is even better.  Definitely recommend the calamari, the crabmeat ravioli, and the chicken piccata.  Make sure to call and make reservations on the weekend because they are always busy."}
{"text":"This was my second visit to Oggi and I was delighted yet again. Our food was delicious!!  My husband had a pasta in some sort of vodka sauce and it was fantastic!!  Our appetizers were great and everything tasted authentic, fresh and not at all salty. This is good food....you won't be disappointed."}
{"text":"What a gem! It's in my backyard, and I had no idea... til I found it on the 1,000 Open Table list. The fella and I made reservations for a Wednesday at 8 pm, and I'm glad we did since the place is fairly small and was fairly packed. The atmosphere is dark and cozy, and we were warmly greeted the minute we walked in.  Our waiter, Brandon, struck the tricky balance of being enthusiastic about the menu without being annoying - he was amazing! Since we didn't have much time, we skipped the awesome sounding, smelling, and looking calamari and jumped right into entrees.   I got the Pollo Picatta ($19), which had delicious capers (YUM) and came with broccoli and sweet potato puree, which was a little more savory than sweet. The fella decided to go with the rigatoni - pasta special of the day ($21) - over the lasagna. It came with chicken and marinara sauce and had a great smoky taste with a little spice. We also sadly skipped the delicious-sounding chocolate mousse dessert Brandon told us about. However, between the calamari, lasagna, and dessert, we have many reasons to go back!  Two entrees and three glasses of wine cost us $63, which seemed pretty reasonable. Amazing service, food, and atmosphere. Oggi, where've you been all my life?"}
{"text":"Lots to like about OGGI. As good as they are, this place could be a whole lot better and it is my hope that management will pay attention to this post. The food requires no attention. Everything was delicious. The service must improve. Our server was very nice, but simply would disappear at times. After our first course appetizer, our empty plates sat on our table for over 10 minutes. It seems that OGGI uses busboys to clear tables, not servers. Neither felt it was necessary to remove the plates. Finally, I just pushed them toward the end of the table and another server saw me do this and immediately took them. This is a training issue that needs to be resolved. If a server sees empty dishes on a table and it may not be his job to remove them, he still should.  Our main course came and we enjoyed everything along with the wine we were drinking. Our glasses were empty and we were hoping to buy another round, but our server simply never returned. Again, this is just unacceptable for a restaurant. Customers wanted to spend more money, but our server was no where to be found. Again, he was very nice, but either had too many tables or not trained properly. These may appear to be small things, but I want this place to succeed and if they keep doing what they did to us even though the food was good. Most people will not return."}
{"text":"I was teetering  between 3 or 4 stars.  The bread and olive oil were incredible.  However the chicken parmigiana was very thin and came out overcooked and dry.  When we wanted to tell our waiter he was nowhere to be found as it got really busy so we asked another waiter to bring more marinara sauce to make it more juicy.  No luck.  Still dry after adding sauce. Everything was flavored perfectly (not too salty)...just overcooked.  Our waiter when he finally returned (think he's the owner's son) comped the chicken and asked us to come back again for another try.  That was the right thing to do and we will be back."}
{"text":"The absolute BEST, but SALTIEST and PRICIEST lasagna I have ever eaten; too bad!  Just moved from the NYC metro area where homemade lasagna, and a soup or salad is ~$12; anywhere in NY or NJ in a similar trattoria setting.  This one was $19 BUT WOULD  BE WORTH IT if not for the salt. I honestly drank three glasses of water after coming home.  Red wine was served WELL ABOVE appropriate temp of ~60-65; likely about 10 degrees too high.  Wife's Gnocchi Bolognese sauce was excellent; just the right amount of sauce, and NOT over salted. Again too bad."}
{"text":"My family goes to OGGI several times each month. The food is incredible and the service is even better.  The owners, Eloy Sr and Eloy Jr., are always there to greet us and their staff goes out of their way to make our experience a great one.  I highly recommend OGGI for great Italian food!!!  Try the lasagna.  It is wonderful."}
{"text":"Great food and amazing crew. They are very welcoming and there food is always good. I went there for the first time for lunch and then tried it for dinner. They have a big variety of wine and there menu is rich. It is always good to call and make a reservation first. Great service and it will always be one of my favorite places in Ballantyne, NC"}
{"text":"After reading the reviews we gave this place a shot!  The people wether it's management, bartender, waiters, or someone you just come across going to the bathroom..VERY friendly staff!  The atmosphere is somewhat modern take with refreshing colors and design.  I would say it is definitely considered fine dining as well as the prices.   Food- we ordered the Carbonara, Penne al la vodka, and their crab ravioli with lobster cream sauce.  The carbonara as it should, was very rich and flavorful.  The house made fettuccine was perfectly al Dante and a great chew in texture.  The ravioli, The Crab taste was definitely flavorful as well as the rich lobster sauce.      The Penne was good but definitely choose the ravioli or carbonara over any day!  Oh btw tip, the house bread with the olive oil and balsamic is amazing and make sure you replenish your bread for the extra sauces on your main course!   In summary, great quality ingredients, atmosphere, and very friendly staff!  The prices are definitely on the expensive side but to me food is priceless as long a it's done right and quality ingredients!  My one complaint would maybe be a little more on the portion size but hey helps me watch my figure I guess...   Definitely be back!"}
{"text":"Oggi was great. We dont typically eat Italian out so we were impressed by the menu and the freshness of the food. The service was some of the best I have had, Roger was great! Great wine and cocktails too."}
{"text":"Service was very good; Food was good but you can find the same type of fare at Bravo, nearby for less.  I was surprised at the small size of dining area so we chose to eat outside which was delightful.  It was a covered open air patio with heaters and plants.  Very nice and less claustrophobic.  I also don't mind a TV at the bar.  I rather like it, but when you are charging this much for food, a TV in the dining room is just out of place."}
{"text":"Had the pleasure of dining at Oggi with my family and as a foodie--and a skeptical New Yorker--to say I was impressed would be an understatement.   The service was fantastic. Very attentive, willing to explain everything and pleasant. Kid's menu is great and comes with free ice cream.  The food was wonderful. We had the salsiccia peporoni and pulpo as appetizers. My wife has never had octopus and was apprehensive about trying it--she ended up eating the bulk of it. Her crab ravioli was excellent and the penne vodka was good as well.   All in all, a great experience that has given this cynical Big Apple native hope for dining in Charlotte. And even if all other restaurants disappoint, at least I know I can always rely on Oggi to come through."}
{"text":"This place is simply delicious. I started with a wine as he started with a brew. Both were smooth and heavenly. As an appetizer we order the bruschetta. You can not go wrong ordering that. The taste of the tomatoes were so fresh and crisp. For entree I had the penne vodka. The sauce is a delight to the mouth. I would've eaten every bite if I wasn't filled already from the bruschetta. The atmosphere is spot on and everyone is so friendly. You can not go wrong eating here."}
{"text":"We are from Coral Gables, Florida and have a cabin in Boone, NC.  We came up to spend Christmas and visit our nephew in Charlotte.  We wanted to have dinner with him and his girlfriend and he suggested OGGI.  All I can say is WOW, from the beautifully decorated restaurant, to the wonderful, personal service and the excellent food and desserts.  The crab meat ravioli is out of this world and as for the desserts, the mango cheesecake is a MUST!! The owners are a father and son who make you feel so welcomed that you can't wait to come back.  This was our first time here, but definitely won't be our last."}
{"text":"Best Italian food in Charlotte; hands down. Food is delicious and affordable. Unlike most American Italian restaurants, the portions are \"just right\". Try the lasagna and the fried calamari and zucchini small plate!"}
{"text":"11/4/17   Had dinner here tonight every thing was Great Leonardo B Our waiter was outstanding great suggestion on wine that was terrific and very good suggestion on our entrées and appetizers place was packed very good sign on a Saturday night will go back as often as possible highly recommend this to everyone Price is excellent for the value in service that you get     dinner here tonight with friends Drinks apps and entree and deserts very good Service was excellent Owner came over to see how things were Will go back Prices very good value"}
{"text":"I'm really suprirsed by any good reviewes here.  I've been twice as I had a gift certificate.  The first time we had a 7pm reservation, and weren't seated for 45 minutes after.  The hostes(who I believe was the owner's wife told another customer \"Oh Well\" who had a reservation after they said they won't come back.  The food is decent, but very overpriced for the atmosphere and location.  The service wasn't very good.  The second time was better, but very noisy."}
{"text":"Right from the moment I walked in the door to pick up a carry out it was extremely unpleasant. The young chubby hostess acted very weird and there were young men who must have worked there just standing around in front of the kitchen. Not sure why I even left a tip.  Once I got the food home more issues. The salmon entree had a sauce and the cardboard container they used was leaking. I'm all for avoiding using plastic but find something that works.  It was scattered all over the container and believe me I kept everything upright. The containers used were too big and I had to scrape the cheesecake off the container it came in as it was smeared everywhere. The arugula salad came with a honey mustard dressing which was way too sweet.  Not a very good first impression of Charlotte's restaurant scene."}
{"text":"We were the couple that took an earlier reviewer here. We have now been here 4 times and can't wait to go again. The food is amazing and the prices are very reasonable. We have asked for Eloy every time. We were lucky enough to have him the first time and now he is an important part of our visit. What a classy and professional young man. Service reminds me of the professional manner in which you are served in other countries but not as often in the USA.   The food is amazing. Last night I asked Eloy to bring me whatever he thought I should have that I had not tried yet. He brought lasagna. Not your mama's lasagna or for sure mine! This was the best lasagna I have ever had. Really fantastic. My wife had a special mussel appetizer that she had once before. She was in heaven again! The chicken is great, all the variations. The veal parm is to die for. The deserts.... You can go basic italian comfort food, or fancy interesting combinations not available anywhere else.  The atmosphere would make you comfortable to bring a date of bring the family. Unusual to find a restaurant that can cater to both families as well as a romantic couple.   It s forty minute drive for us from Huntersville. But it is one we will gladly drive just to enjoy Eloy and the food of his fantastic restaurant. Best Italian in Charlotte without the attitude or expenses. They actually treat you like they appreciate your business.   Love it."}
{"text":"Have been here twice in one week and ready to go back!  Every dish has been better than the last one. Oggi's makes some homemade pasta and the warm bread tastes homemade too.  The spaghetti and meatballs come with at least 4 large sized meatballs. See pics!   The veggie platter is one of my favorites, and I add chicken to it. It comes with fresh portable mushroom, zucchini, asparagus, squash, eggplant. This dish is probably a great dish to share at the table with the group as an app or a nice variety of sides.   The sausage was good in one of the creamy pasta dishes.   The steak was made to order very nicely.   The entrees come with sides either sweet potato and broccoli or pasta."}
{"text":"Excellent. The food was great. Homemade dishes were very good. Services was excellent. We ate at the sister restaurant in Miami some years back. This site is more upscale but not stuffy.  We will go back."}
{"text":"We made a last minute reservation on Father's Day as we arrived in Charlotte midday.  Saw some good reviews, they were close to our hotel. We were sat on the covered outside patio, it was a warm day so the patio had fans going, bit it felt like the ceiling heaters were going (they weren't on) guess the heat was trapped by the brick outer wall and the dark black patio ceiling.  Our waiter, Sal, was very attentive and well versed with the menu. We were served the bocconcino emiliana (risotto croquettes) on the house drizzled with pesto served on an very flavorful marinara sauce. My daughter ordered the fettuccine alfredo (het fav at almost every italian restaurant) which is \"off menu.\" She really enjoyed the thin fettuccine noodles which had a light coating of sauce, not heavy or too cheesey as you would normally find alfredo. Oddly no grated cheese to offered to the table. l had the veal picatta, very thinly pounded and super lightly coated, it was quite tender and very delicious. The lemon white wine caper sauce was so tasty.  I was not asked which sides I would prefer with my veal. It was served with a sweet potato mash (which I don't eat) & garlic sautéed broccoli, it was OK, I prefer broccoli a little more al dente. The Chocolate Molten Vesuvius cake was awesome, served with vanilla ice cream on a bed of creme fraiche. Overall an amazing dinner in the burbs of Charlotte, NC. Highly recommended"}
{"text":"If you truly want real deal Italian cuisine then this is the place to go! Always fresh and always consistently excellent. The food is prepared and served with Love! Anybody that's gives this place less then 4 stars is either a jerk off or someone that doesn't know what authentic Italian food is supposed to taste like!"}
{"text":"I absolutely love this restaurant. This is the best Italian food I've had in Charlotte. I love the crabmeat ravioli. I took my friends from out of town and they thought the food was delicious also."}
{"text":"3rd visit and our last. Adding a 20% tip for adult table of 6 is Bush League. Waited 30 minuets for our reservation, sent one meal back each visit, noisey and the worse element of our visit is that everyone thought their meal was bland and uninspiring. There are so many better restaurants including Italian in Charlotte. We won't be going back."}
{"text":"The food was top notch everything was fresh, made from scratch and the selections were excellent -good specials too. The decor was chic and modern.   Also, we had some of the best service here of any place we've ever been to. They were very friendly and attentive to out every need - I highly recommend Eric. My wife has a lot of allergies and they were extremely accommodating - they mentioned they didn't use the same pan and cooking utensils to avoid cross contamination."}
{"text":"Still excellent 5 months later. The lunch deal is gone but $10 for a very nice serving of lasagna is still a deal. Had the flan made with marscapone for dessert and it comes with dulce de leche ice cream-/ yumm!"}
{"text":"Went here with my hubbs, very romantic spot! Food was absolutely wonderful! We started with the calamari, he had seafood linguini and I had the lasagne. Everything was delicious!"}
{"text":"Went there tonight. Ordered a bottle of malbec and the waiter suggested another bottle . I hate saying the word but his pick was fabulous. Then we ordered  the bruschetta which was great. I ordered the ossobuco the best I've had in Charlotte. The wait staff was the best, every one came to the table to ask how everything was if we needed anything. It was one of the best wait staffs we've had BRAVO!!"}
{"text":"By far the best Italian food around! The waiter was knowledgeable about the menu and guided us to an incredible meal. I would say this is more a date night restaurant although there were children there. The atmosphere was nice and inviting my husband had the ciopinno and I had the lobster ravioli both were delicious. The service was super fast as well especially for a Friday night! If you want some absolutely amazing food this is definitely the place to go!"}
{"text":"ALL I can say about OGGI is OMG ! Can't say enough about food. Freshmade pastas! Definitely get the mussels sambuca and fried calamari appetizers."}
{"text":"Great meal- had calamari , bruschetta and flat bread apps. Thin chicken parm   Relaxed atmosphere. Good service."}
{"text":"Best Italian Restaurant in Charlotte. Food like you're really in Italy. Amazing service, fresh food, ambience. Perfect place to eat"}
{"text":"I am - yet again - disappointed by the customer service I have been given at Oggi. They are extremely strict in how they \"allow\" you to buy their foods. They do not appreciate any deviation from their menu as presented. No matter how few customers they have at the time. Sauce, pasta, protein .... of all types of foods, how much effort does it require to switch linguini for penne?? It is an unhappy unpleasant place."}
{"text":"I'm not sure that I can identify one or two things in particular that affected my 3-Star rating. It was a series of small things that were hard to overlook. I asked for black coffee and Pam delivered an Americano. ($4.00@) My  Caprese sandwich, $14, contained little of value, bland, bland, bland! The tomato was awful and their choice for buffalo mozzarella needs review. Additionally, my shoestring fries were cold,ugh. I switched to Diet Coke and was brought Coke's small bottle.($2.34@) My bride enjoyed her Eggplant entree. My Pasta e fagioli was great. I'm hoping a return visit for dinner brings me better luck than lunch..."}
{"text":"I'm an Italian NYer and friends used to ask me what my favorite Italian restaurant was. I always said, \"Home!\"  Then I found OGGI! I go a few times a month. Amazing food, spot-on service, very accommodating & I've been enjoying sitting at the new bar. Thankfully, they are waiting for permits to install an A/C unit that'll keep the room cool. They are 3 months out for a Saturday night reservation, but opened another at the NC Music Factory."}
{"text":"Went last week for  dinner with a group of seven.  It's small and intimate, very clean, and the servers were attentive.  It's was everyone's first time, and we weren't sure what to expect other than it was an Italian restaurant.   I had vitello Romano, and it was delicious.  Simple sides of sweet potato mash and steamed broccoli complimented the veal.  It wasn't your run of the mill Italian restaurant.  It was a bit pricey, but when every single plate is left without a morsel of food, it proves everything was perfect.  We stayed a while after dinner drinking and talking, but we're never rushed or made to feel we were holding anyone up from going home .  I will definitely be back.  Great find and I highly recommend."}
{"text":"I live in the Ballantyne area and this is definitely my favorite restaurant. The food is made from scratch, so if it is not on the menu, they can make you any dish if they have the ingredients. Which is what I love the most because I'm very picky sometimes and always change something about my entree. I have been coming here for about 2 years and enjoy the food and service every time."}
{"text":"First, lets talk about the air conditioning that wasn't working on a day where it was 96F outside.  We were all roasting during dinner!  Our clothes were sticking to us!  Yes, we were inside!  Really?  You couldn't fix the air conditioning for your clientele?  We could not wait to get out of there!    Server was super nice, and I'll leave it at that.  Menu's are handed to us and they look crumpled and have what appear to be wine stains on the front and back of them.  Seriously? You can't keep on hand one page menu's that are crisp and clean?  It starts the experience poorly.    The food?  Bread was tasty.  House salad was tasty, but tomatoes weren't even ripe looking.  Hubby loved the lasagna, but $20 for an average piece?  I ordered the veal marsala...the plate came and it looked all dark dark brown from the marsala demi.  The linguini portion could have fit in a one cup measuring cup and was smothered in the same sauce.  Pasta, the cheapest thing you can buy?  Don't good Italian restaurants offer a sprinkle of fresh parm for pasta? All you saw was dark brown everywhere.  Somebody needs to watch the Food Network and learn that you need to put some color on the plate.  A sprig of parsley?  The veal?  I thought it wasn't on the plate!  It was such a small portion buried under sauce and mushrooms.  The taste was great though.  Our friend ordered shrimp parmigiana and I could see the pasta was overcooked and puffy from where I was sitting.  Sure enough it was when I asked him but he was not going to say anything.  His wife ordered the lobster, clam special and it came smothered in a spicy sauce.  A half lobster with the meat side down covered in sauce? Server offered lobster cracker?  Who is going to grab a lobster covered in red sauce to crack it?  Seriously?  She asked the kitchen to take out the lobster meat and it took over 10 minutes to bring it back.  Then she tasted it and it was way too spicy for her.  I'm sure that was frustrating to the kitchen, but they did replace it with a nice grilled fish (had to ask for lemon).  They get props for that!  Add a bottle of wine and the bill was over $200 without a tip.  2 salads, 4 entrees and a bottle of wine.  I would have taken photo's but it being a special occasion and with company it's just not very nice.  It was my friends birthday so she was hot, miserable and not thrilled with the dinner experience that was supposed to be special.  So many other places to eat for that price!  Not coming back any time soon."}
{"text":"I would have given Oggi a 5 star review.  The food and service was excellent!  The only gripe I have is that a member of the kitchen and what seemed to be a few managers were sitting behind us and they very audibly made negative noises when a party walked in 30 minutes before closing time.  That soured our experience a bit. Other than that, I would probably come back.  The food was great."}
{"text":"I'm torn with my 3 star review fellow Yelpers.  I really am and almost feel badly about it.  But, no....I'm not changing it.  I showed up at around 6:00 on a Friday night and it was close to 9:00 leaving.    When the 7 of us arrived, I must say I was impressed.  We were promptly greeted and sat by who I think was the owners son.  They brought us drinks and after looking at the menu I kept kicking myself for not having been here sooner.  The waiter told us how the pasta was mostly handmade by he and his dad that day.  He described the pasta making process perfectly and as a self proclaimed foodie I was impressed.    We started with the calamari and zucchini appetizer and it was very good.  Perfectly breaded and seasoned served with a light marinara for dipping, yum.  Things are going nicely!  I ordered the black linguini frutti di mare and they made the red sauce fra diavolo.  The homemade linguine was perfect, just a touch of squid ink and the \"di mare\" was wonderful, calamari, shrimp, mussels, clams OMG I was in heaven.  I would of ordered dessert but here's what the problem was.  I didn't have time, I was already there for 3 hours.  SLOW & INATTENTENTIVE SERVICE from the salad on.  We waited what seemed like forever for everything.  We didn't get drink refills unless we asked twice, the time between courses was crazy.  It's not a big place and they seemingly had enough servers but they were the biggest group of lollygaggers I have ever encountered.  So much so that the awesome food was way overshadowed by the slow service.  The waiters would have 10 minute conversations with some tables, I counted.  We asked for the check and had to get up and interrupt the server from BS'ng with a table.  Even then he grabbed a water pitcher before going to the back to get our check.  He certainly wouldn't come by to refill our drinks during the meal.  Someone said in another review that they try to provide a relaxing dining experience and the service is not slow.......malarkey, I say.  These servers and kitchen need to pick up the pace, plain and simple.    Bottom line.  I really liked the food, really.  I may go back....but it will be lunchtime on like a Monday.    Roll credits."}
{"text":"I enjoyed Oggi, we went on a Friday night and got a very last minute reservation on Yelp with no wait upon arrival. The hospitality and service was AMAZING. My husband loved the Chicken Parmasean with hand made fettuccini pasta. I created my own dish of linguini pasta, shrimp and garlic white wine sauce, I didn't love it but I will definitely be back to try a dish that is actually on the menu."}
{"text":"Oggi is top notch!  I knew it was the perfect spot for date night, but then last night discovered Oggi is an optimal venue for large groups as well.  We hosted my daughter's birthday celebration last night and have nothing but rave reviews for this establishment.  Management was incredibly accommodating to our needs, the service was superb and our dinner was delicious.  The fresh mozzarella sticks and calamari for the younger ones were unlike any they had eaten before.  The adult entrees were outstanding.  I will most definitely return for these dishes: Crab Meat Ravioli with creamy lobster sauce, Skirt Steak Oggi with caramelized onions & port wine sauce and the Caesar Salad with Marinated Anchovies.  Thank you Oggi for making this a memorable night for all!"}
{"text":"Food was really good and huge portions. The only problem I had was the services was very slow! But on a brighter not we did get to watch two couples in their sixties sharing a both and making out like college kids in a bar at 1:30am!"}
{"text":"We are all happy and full!  My husband had the lasagna, mother had ravioli with crab and I had the chicken parmigiana. We all started with salads. Food was good, service was good. We will be back!"}
{"text":"Yeah, it's a little overpriced, loud and cramped.  BUT, the pasta is fresh, the service is great, and the food authentic.  You'd be hard pressed to find better Italian south of 485 for date night or the whole family."}
{"text":"My husband is a chef & it is unbearably difficult to go out to eat while pleasing him and our kids all at once.  We took him here for his birthday this week and it was fantastic!  I had the skirt steak which is prepared in an Argentinian style... The chef is from Argentina and wow... It was really good. My husband had a special that included mussels and a lobster tail over linguine.  He really enjoyed it.  Best of all my daughter (17yrs) had a veal dish with portobello mushrooms and ate every bite.  My 9 year old eats like a bird but they make chicken fingers & French fries for kids like him lol...   The very, very best part though was the service.  Eric served us & he was so nice, funny, attentive.  He made dinner a fun time.  He gave my son a voided duplicate bill to sign in cursive.  It was really cute... My son thinks he paid for dinner :-)  I do wish this was a slightly more casual restaurant.  It's a bit fancy for eating out often... Which we do! But incredibly great!"}
{"text":"This is a decent Italian place. The prices are a little high for the portion size IMHO. I was in a party of five for lunch on a weekend. I had the lasagna which was average. Others in the party had the Pennsylvania Trout, the special which was some kind of Chicken dish, the Gnocchi, the Meatballs and seemed generally pleased with their meals. The trout came with pasta and the diner asked to substitute if for something else and was told he could not. He wanted asparagus which was $8 extra for a portion that really did not seem worth it. And the trout while well cooked was not a large portion as well. We also ordered Tuna Tartare and Fried Calamari and Zucchini  for appetizers. I don't eat raw fish, but the others liked the tuna. The calamari/zuke was good.  It was the middle of the day but some reason it was very dark in there. They had the shades pulled down and there was insufficient lighting in the room- didn't really understand that. Service was good. I admit that I am very biased about Italian places- my favorite is Mama Ricottas, so while I was willing to try a new place, I still think MR would be my go to for Italian cuisine in the future."}
{"text":"meh. The food was bland, and there were no desserts available at 6 pm Valentine's Week because they \"ran out\". It definitely put a damper on our evening. the atmosphere was nice, it was very clean and our waiter was super pleasant. lots of locals love it but we are from the NY area so I guess we are pickier. 3 stars because I feel bad leaving 2."}
{"text":"Not busy on Sunday, we're the only ones here!  A/C not working when we came in but they turned it on after finding out it had been repaired.   The bread (ciabatta) bread is delicious! It was soft and soaked up the oil & vinegar perfectly.  They brought out a complimentary appetizer (possibly due to the AC), a risotto mozzarella fried ball on an incredible sauce.     I tried the black linguini and shrimp, wife (vegetarian) tried the spinach and ricotta ravioli.  The freshness, textures, and flavor profiles (how well they work together) were just right."}
{"text":"Awesome service and always such good food! Every time we've been, we've had to have a late reservation because it's so popular! They handmake some of their pastas, so be sure to swap out any pasta in your entree for their handmade one (for a fee). Desserts have never been impressive but food has always been great!"}
{"text":"Average food at above average prices. I ordered veal piccata and it was a very small portion and significantly over-seasoned.   Service was underwhelming - probably due to the fact that they applied a 20% gratuity to our party of six. Our server didn't earn it as she knew she'd be getting a good tip regardless of the quality of her service.   One and done with Oggi."}
{"text":"Amazing service, amazing food, amazing atmosphere. Definitely try all of their small plates for dinner paired with a cocktail, and don't forget dessert! We always feel welcome when we eat here. You may think the prices are high, but since everything is cooked in house and fresh, the price is well worth it. The owner always make sure we are enjoying our meals and goes above and beyond to make us feel special. This place is definitely a hidden gem and Ballantyne. They also have many vegetarian options available!"}
{"text":"After initially being skeptical of a loud, crowded small space on a Saturday night, my wife and I were extremely impressed with both the food and service. The Italian dishes were unique, tasty and freshly made. I had an excellent crab meat ravioli and my wife the shrimp Parmesan both, great. Alejandro, our server was a professional and very attentive. Several other people stopped by to check on us. The sides were very good as well and they have a decent wine menu with reasonable prices. We would recommend and will return."}
{"text":"My boyfriend and I went here for a valentines dinner (on the 13th.) The restaurant is small but a nice intimate setting. The menu was a limited menu for the weekend which I was a little upset about because I had already scoped it out!  We ordered Bocconcini Emiliana (risotto croquettes) for an appetizer. They were really good. I ordered one of the specials - salmon stuffed with lump crab in a lobster cream sauce. It was delicious! I normally don't like sauces on my salmon but this was amazing. He ordered the crab meat ravioli in the same lobster cream sauce. The pasta is handmade and you can tell!  The service was a little slow; our food was very spaced out. Our waiter didn't seem extremely attentive. He never asked if we wanted another round of drinks.  Despite that, we will definitely be back. The food was great!"}
{"text":"I'm from NYC.  I know Italian food.  There isn't much in the way of real Italian in Charlotte. That's why I wasn't too hopeful about Oggi's.  I was very pleasantly surprised.  The hostess was pleasant, knew what she was doing and didn't have an attitude.  This was a nice change from the usual vapid teenager in a tight outfit.  The wait staff were attentive, knowledgeable about the menu and the wines.  And, the food was terrific!  We had chicken in a port wine reduction with figs and the lobster special.  The deserts were wonderful, although the coffee was weak.  Is everything perfect?  No, but this a little unpretentious place in a strip mall.  For a neighborhood place, this one is a winner.   A wonderful meal with great service by pleasant staff, and at a reasonable price.  Who knew this was obtainable in South Charlotte?  We have been searching for a new neighborhood place since giving up on our old one (see my other reviews).  This is definitely our new favorite."}
{"text":"Such a lovely little place! Absolutely love the food--low prices & delicious!! Also the staff is very friendly & helpful! Will definitely be coming back again."}
{"text":"I always have the weakness for Italian food, but this was a great choice to go out for dinner last week. They had great service and the food was amazing! I absolutely fell in love with the Bocconcino Emiliana and the Agnolotti Alla Panna was a fine choice for dinner. Not to mention the chef was so sweet to give us a creme brûlée for dessert. I'm definitely coming back!"}
{"text":"Oh my goodness.  What a nice establishment onto which we've stumbled!  We started out our journey looking for something entirely different.  But when our original selection fell through, we drove by this little restaurant and thought \"Eh, why not?\"  I am SO glad we did!  From start to finish we were given the royal treatment; they even accommodated us despite our lack of a VERY necessary reservation!  The salmon dish I had was cooked to perfection, and my husband's chicken dish was the perfect combination of savory and just a hint of spicy.  Our salad was delicious, and the mango cheesecake melts in your mouth!  The staff checked on us so many times we lacked for nothing.  I can't begin to help you how delighted I was with this ristorante.  We're already planning which occasion will bring us back to experience this place again!"}
{"text":"Crab Ravioli and Shrimp Parm are to die for.  Also, Canolis are  homemade... Hard to find in Charlotte."}
{"text":"Great affordable dishes without sacrificing quality food & upscale atmosphere. There's a new specialty dish almost every visit I make. Sea food specials are particularly delicious. I hear their pasta is hand made fresh every day. There's also a full bar with specialty drinks & decent beer selection. Oggi is always my family's choice for large dinner outings. Highly recommend!"}
{"text":"I hosted a surprise 50th birthday dinner for my dear friend and 9 of our friends and it was a fantastic night!!! I had never been to Oggi, but one of my friends that I was planning with suggested it and her rave reviews were spot on!  The Mgt and staff were very accommodating with my special requests (I brought a cake, I had a special drink served as everyone was arriving, and they gladly agreed to separate checks for all of the guests). The service was super friendly and the heated patio location was perfect and cozy....even on a freezing cold night!    We had a couple of appetizers for the table to start and they were fantastic!! Everyone loved their entrees, too. Ingredients were fresh, our food arrived hot, and the plating was beautiful.    It was a memorable night for everyone, but especially the birthday girl!  Thank you, Oggi....it was a flawless dining experience!!  I can't wait to return with my family!"}
{"text":"We dined at Oggi for Valentines Day (technically the Saturday before). We ended up with a very early reservation which was fine, but we felt extremely rushed the entire time. We ended up having a 'romantic' dinner that took 30 minutes including dessert. I get wanting to turn tables, but if we wanted fast food we would have went to Nothing But Noodles and saved ourselves a bit of money!   I went with the Seafood Ravioli and my husband had the lasagna. I am not confident that this is house-made pasta as advertised. The ravioli had the black striping on it like the fresh pasta at the grocery store (Costco), and it tasted similarly. My sauce was very salty, and was lacking in any detectable seafood. For $22 it was a let down. My husband's lasagna was a much better choice though a bit pricey for what it was. The mango cheesecake was good.  In a nutshell, the food quality was not on par with other $20+ per person meals I've had. The atmosphere is much more casual and not very relaxing nor romantic (that's on us for choosing it).  Our server was kind and did a good job, but was going way too fast. If you don't mind a busy/fast paced meal where servers stand in front of your table throughout the duration of your meal than Oggi is your place."}
{"text":"This is now my favorite Italian restaurant. The food was delicious and fresh. The staff was friendly, upbeat and took care of our needs as guests there. I had one of the specials of the night, Risotto Primavera with three large grilled shrimp. The flavors were unreal and the meals was seasoned to perfection. I actually told my husband they must be pretty confident because there isn't even salt:pepper on the table. Well you don't need it!! I should say we also started off with their Mussels Stratos small plate. The mussels were cooked in a spicy red clam sauce! This was pure heaven! Again, seasoned perfectly and we used the leftover sauce to dip the fresh bread in. I could have honestly created a meal out of that!! My husband had their crab stuffed ravioli with a lobster sauce. Again, perfectly seasoned and full of flavor!! I'd highly recommend eating here at least once!! A little on the expensive side, but worth EVERY dollar!!"}
{"text":"My wife and I tried Oggi for the first time tonight and were very pleased. Fresh house made pasta and sauces made us feel we were back in Italy again. Nice atmosphere, good (not perfect) help, and reasonable prices. Wish there was a place like this closer to my neighborhood so I wouldn't have to come down from the university area. Will definitely return."}
{"text":"If you are looking for homemade pasta, a small intimate restaurant, and terrific italian food this place is for you. I don't feel service is slow as they are trying to give you a relaxed environment in which to have dinner. Not a lot of tables and we waited about 15 minutes at 8:30pm on a Saturday night. The fettuccine carbonara was rich and decadent and a perfect 10. The Bocconcino risotto balls were a wonderful appetizer with homemade marinara sauce. Wife had the chicken marsala and it was a large portion and delicious. The house wine is $24 a bottle and it changes. Go for it."}
{"text":"The best italian food in the Charlotte area!! I was so impressed; the food is very authentic and the service was excellent. I got the lemon-butter, white wine gnocchi which was one of the specials the night I was there and it was AMAZING! Can't even describe how good it was. I definitely recommend coming here."}
{"text":"This is a neat little Italian restaurant that my boyfriend's parents frequent all the time.  It seems like the must have dish is the homemade crab raviolis with lobster cream sauce. My boyfriend had this dish and he literally licked the plate off.  He hugely enjoyed it and didn't share with anyone.  I had the chicken marsala with pasta which was quite good.  However, the dessert was a disappointment. We ordered the tiramisu for dessert and thought it looked a little sad on the plate.  It seemed like it was the last scoop of whatever they had left for the night and the chef placed tons of cream on top to make it look decent to serve. Yikes!  They should have told us that they were out of it and offer us other dessert options.    Our server was such a great Southern gentleman with a good sense a humor who kept us entertained with his sparkly personality. Gold star for him."}
{"text":"Good food , small portions.  Ordered the eggplant park was only 1 layer and  could have just been the appetizer."}
{"text":"Excelente lugar para comer bien italiano! Buena atención y muy buenos vinos!  Excelent place, the little italy chic in Charlotte! Excelent food and wine!"}
{"text":"Vodka shrimp was excellent, my husband tried the chicken eggplant special and it was so so, sauce was not very flavorful, very bland.  Kids menu was very minimal, very small and very bland. Service was very good but over all not impressed."}
{"text":"Submitted on behalf of my mom!...  Recently I had a significant birthday party for my son at Oggi Ristorante Italino.  Since I live in Asheville, all details had to be conducted long distance via email.  I dealt with Melanie Roy, Office Manager, and she could not have been more accommodating, nicer,and even humorous.  My Grandaughter and daughter who were participating with me LOVED her.  The night of the event went better than I hoped.  Melanie arranged for Lynn and Pam to take care of us, and the food and service, not to mention wine, were outstanding.  All 20 of the guests lingered a long time (probably too long),  but the staff never showed signs of impatience.  All in all, a memorable evening"}
{"text":"Very disappointing. Ambience is horrible. Way too small for a restaurant and very loud!!!! It was also very warm. I don't know if it was because there were so many people in such a small area. So we just ate and left. Food was ok. There are much better Italian restaurants in Charlotte than wasting my time and money here. Also, It was very expensive for the horrible ambience. I will not recommend and I will not go back."}
{"text":"Outstanding restaurant every single time we visit. Best of Ballantyne period. Outshines every restaurant regardless of cuisine. Fettuccine Carbonara and Lasagna is life changing."}
{"text":"This is a great little Italian restaurant tucked away in the corner of the Ardrey Kell shops. The food is great the service is great but for all the time it's been open the beer selection is terrible. Italian restaurants need to understand that they don't have to only serve Italian beers and Budweiser. They make a great martini but they really have to do something about the beer selection"}
{"text":"New favorite Italian restaurant!!  While the dishes were all very tasty- the drinks blew me away! Both of the feature burnon cocktails are The best i've ever had. I can still smell The sage and honey in the glass- YUM. The bartender made the entire meal and enjoyable experience for me and both of my parents. He was born to bartend! The entire staff was very attentive and the manager checked in to make sure that we were being well taken care of and told us about the background of the restaurant. Everything felt very personable. This is a place where you should make a reservation, but we did not as we were on our way to another restaurant and decided to give this one a try instead! I was very happy that they helped accomadate us on such short notice.  They claim to have the best lasagna and I woukd have to agree! I switched the rest of my plate for my mom's leftover lasagna and almost licked the plate clean . If you're not a lasagna fan, try the meatballs!! I may go back just for those and a cocktail (:"}
{"text":"Coming from Seattle to visit my brother. WOW. This place was amazing. Cozy ambience. Very attentive server. Excellent wine selection albeit a bit pricey. All leading to the food. The Lasagne was the best we have ever had. The calimari was delicious.  The best Italian restaurant we have been to in a very long time"}
{"text":"We ordered to go. It only took 10 minutes for our order to be ready. (Had the Chinese takeout place beat by 5 mins!) Emily the hostess was very nice. Tom the manger made sure our food was served to perfection.  I ordered spaghetti & meatballs + lasagna with extra sauce. Both cooked to perfection. Yes you must get extra sauce, because it's amazing!!!  My only complaint is that the food is pricey. Lasagna $19, spaghetti $18... But the food is good.   We will be back!!!"}
{"text":"It's good. Service is always above and beyond, but I tend to find the food slightly inconsistent. Sometimes they're so focused on being fast they bring pasta that's slightly undercooked - their fried items are occasionally too greasy (no time to let the oil drain off or get absorbed). The fresh bread is delicious and their sauce isn't ever over killed by oregano or other powerful spices. We are big fans of Oggi, great wine selection and the desserts are really really worth saving room for. Our son prefers pasta over pizza here (it's a soggy flatbread rather than a \"pizza\") - so don't make that mistake -- kiddos will be far happier with ravioli or noodles with bread. Shrimp parmigiana is delightful!"}
{"text":"Oggi's owner, Eloy Roy, is not new to the restaurant business and it shows. The food is about the BEST Italian food that you can find in Charlotte. There is something here for every taste. I've been to Oggi's a few times and have never had anything but a GREAT meal. Everything is super fresh and homemade. You just know that Eloy loves what he's doing in the kitchen because every dish is made with that love.. Ezra,is host and he certainly makes you feel at home. The service is incredible. Roger was our server tonight and he is the consummate pro. So, if you want GREAT Italian food Oggi's is THE place to go. Reservations are a must. The word is out about this treasure."}
{"text":"Went to Oggi for the first time.  Our waitress asked if it was our first time, and told us the meaning of the name of the restaurant (today), and that their pastas are fresh made every morning, and their sauces are made to order.  Nice menu - we split an Oggi chopped salad.  It was delicious, and plenty big.  The waitress advised you could do half portions of the salad as well if you wanted.  For dinner we chose small plates.  We selected their meatballs.  Two nice sized meatballs, with cheese melted on them, in a pool of marinara sauce. The sauce was delicious.. we kept it after we finished the meatballs, and used their delicious bread to sop up the remaining sauce.  We then had the crab ravioli and ricotta ravioli in pink sauce... Both were amazing... the pasta perfect and fillings delicious, well balanced by the sauces...  Highly recommended!  Make reservations too."}
{"text":"Nice little place, staff were very friendly and knowledgeable, the beef carpaccio looked of it was the color of bologne, that seemed strange and lacked in flavor, calamari and zucchini tasted OK but nothing special, the price for the dishes are high, its pasta for Christ sack, need a better beer selection, It worth a try"}
{"text":"We were there on a Saturday evening and it was packed the entire time we were there. We didn't make reservations but the girl said she would be able to seat us if we agree that we'd be done eating within an hr. I thought that statement was a little weird because it would depend on how fast they wait on us & serve our food?   Anyway, We ordered the gnocchi special and pappadelle dish. Both were fantastic and the reason why we'd go back!"}
{"text":"Went there the first week they open. The services was good and the place was a little dark. But that's my problem with the lighting.  I had the veal parm for my main dish and it was tough, cooked a little to long, too much parmigiano cheese on top. Also,I had an appetizer of eggplant that was a little bitter. The pasta ( We call it macaroni ) was a little mushy.  The sauce  ( We call it gravy) was very good. Haven't been back since that week they opened.  It could have been first week jitters and hopefully they worked out the bugs. I will go back this month ( October) to see how it is."}
{"text":"Fresh Today. Italy at its best, this restaurant reminded me of a special outing in Italy with friends. The staff attentive, food scrumptious made to order, or friends/family were thrilled. Food was very authentic -- not Americanized. Small facility also added to the charm of the location making it much like those 'great finds\" in Rome. Highly recommend for special occasions. Pricing is a la carte and averages $40 a person."}
{"text":"House made pasta was very good here. Lasagna was flavorful and had plenty of tasty meat sauce. The rice balls were one note - sun dried tomatoes. The carbonara was very flavorful with lots of pancetta and plenty of black pepper. Good service. Bread for the table was very good and fresh however the dipping oil was very bitter."}
{"text":"Another great dinner served at OGGI. Consistently great meals and then never disappoint. Service is at a higher level than most places. You will not be disappointed eating here. Recommend reservation in most cases."}
{"text":"Food was tasty and excellent  Service was slow A couple of our dishes were wrong  Very noisy environment  Limited wine selection"}
{"text":"So, How many stars does one remove for price gouging?    We can start with the food.  It is good.  My wife likes it a lot.  Enough for me to look past what I feel are higher than usual prices for a restaurant of this caliber.  The service is excellent.  Very attentive.  Just want I would expect from a nice Italian restaurant.  But we went for Mother's day.  And they had a special Menu.  What was special about it?  The prices were higher.    Chicken Parmesan: Regularly $19.00 but today it was $22.00 House Salad: Regularly $7.00 but today it was $9.00. Bruschetta: Regularly $7.00 but today it was $9.00.  More than 15% increase.  For the exact same food.  I can't tell you what a bad taste this has left in my mouth.   I was here with my wife and toddler son.  So I'm not going to make a scene.  Had it been just me.  I would have walked out.  And I'm not going to take it out of the tip.  It's not the server's fault.  Ultimately this cost me about $7.00.  But It has cost Oggi my business.  There are other decent Italian restaurants in the Charlotte area and I will likely try every one of them before I ever go back.  What a shame."}
{"text":"Today we went to Oggi for my moms 69th birthday and when we got there we were seated immediately by a very friendly hostess.  When we all sat the waitress that was assigned to our table was very pushy and we felt very rushed. We ordered dinner for our kids and an appetizer. Then the waitress came back and immediately asked if we wanted to order dinner again felt rushed. We ordered and then within a few seconds our appetizer and kids diner had come. We thought that was great. But within 5 minutes our entrees came and the waitress started to clear out our appetizer plates while still eating. There was no time between the appetizer and meal. They need to work on timing.   We asked to speak to the manager and he offered to re cook our meal when we were ready, but we were not going to let them toss the food, there are children in the world that are starving so no way we were gonna let them toss the food. The manager was very friendly after we spoke to him about the issues and he personally took care of our table. He was probably the best part of the dinner. Oggi def has a winner in this manager and we would return because of him and probably would request that waitress would not serve us.   We will return due to how the manager reacted to the situation.   The food was great and the kids loved the deserts as well.   I gave a 5 Star because even though we had issues the manager knew how to treat customers."}
{"text":"We made reservations but it wasn't needed the night we came.  Everything was very tasty, fresh and hot.  I liked the lasagna and the fresh bread.  They really fill it was tender meat and the sauce was not heavy at all.   Tasty food."}
{"text":"Wish I lived here! food was delicious and service was perfect. Had calamari app ,  crab ravioli and eggplant parm with chocolate lava cake. Perfect portion s and perfect service must visit if your in ballantyne!"}
{"text":"Was a bit nervous after reading  the  negative feedback, but honestly it was a great experience across the board. Very friendly hostesses,  attentive server who really tried hard to deliver a quality service to very solid food.  We ordered the ceasar and chop salads, both were excellent. I had the baked Chicken parmigiano, which was nice and thin and yet  flavorful. The pasta was good as well. My wife got the Rissoto, which was a giant portion...enough for two.  Good wine list with the typical 2x markup, but smart choices to give you options.  The homemade Tiaramisu was actually very tasty.  Overall  a great experience."}
{"text":"I can't say enough about how Eric (Manager) and Leonardo (Waiter) went above and beyond to make our 4th Anniversary AWESOME. I delivered roses to the restaurant @ 11:00 a.m. with chocolate covered strawberries as a surprise for my bride when she got there. They kept both in a cooler for us and had the table decked to the nines when we arrived with a reserved section labeled \"The Davises\".   From the time we arrived (7 pm) to the time we left (8:30 pm) we were taken care of with exceptional service. And the story goes as followed....  We started off with the INSALATA DEL MAESTRO salad which we split between the two of us. We then moved on to the CALAMARI CROCCANTI (small plates section) but when it arrived it was  actually a huge portion for a small dish which was \"The Money\". Leonardo and Eric highly recommended the SKIRT STEAK OGGI which was huge and freaking delicious. My wife had the LASAGNA OGGI which was recommended as well. He also went beyond the call of duty by having it prepared spicy for my beautiful Trini bride.  Drinks were on point and not overpriced at all.  The strawberries were delivered to the table after dinner with a creme brulee center piece that was to die for.  After dinner we were escorted to the door and thanked personally by the owner, Eric and Leonardo."}
{"text":"A great little italian restaurant. Its small and initmate in the inside and they make their pasta fresh.  I tried their Lasagna after the menu noted it as being the best.  And it was indeed good.   I liked that their lasagna only used mozzerella cheese and no ricotta cheese.   The staff was beyond friendly and they also have a patio.  It would definitely recommend this place."}
{"text":"I went to Oggi today for the first time and my meal was incredible!!  I had whole wheat pasta with chicken and sundried tomatoes..amazing! The owner is very pleasant, accommodating, and a true professional! The decor is modern and upbeat and the prices are very reasonable!!!  I well definitely be back with my family and friends!!"}
{"text":"See what happens when it's busy, the service slows. Additionally, the bruschetta  was burned and nobody asked how our food tasted.    Our entrees were delish! I got the lasagna, tasty sauce and fresh pasta. My husband got the penne vodka with shrimp and ate it all. My son got the best ever chicken parm. My son and I got leftovers packed up to go.   We will come again, but not at prime time. We came around 5:30 before and service was better."}
{"text":"Can be a bit pricey, but well worth it.  We enjoyed the house special (a seafood plate with lobster and linguini); an Italian presecco; and decadent desserts.  The wait staff was excellent."}
{"text":"Food was gross, lasagna was filled with carrots and onions. So much so I could only taste that. Server acted as if we were inconveniencing her by being there. Very disappointing. Will not be back."}
{"text":"I've reviewed this place a few times and have always had great things to day. However, tonight wasn't as awesome as our previous visits. They have a new menu that has eliminated many of the items I always went for (the Flounder Milanase sp?) for one. We also tried the new appetizer of the homemade fries. Well, when the waitress asked how they were, we said they we pretty good. Then she asked how we liked the truffle oil on them. We'll, I had no idea they had any. I'm a big fan of truffles and truffle oil. Didn't taste any at all. It's always a bit pricey going there. Three meals... Parpadalle with simple marinara, gnocci with fra diavalo sauce and a clam linguini with sausage and shaved zucchini. Two adult beverages for each of us plus the side of (un)truffles fries totalled $150+ before tip.    Not sold on the new, smaller menu. Service is still outstanding. Will go less often than before now. Unfortunately. It was my favorite place to go."}
{"text":"Went to dinner for the first time with my wife Thursday night.  Nice atmosphere and deco in a cozy dining room.  Servers were very attentive and knowledgeable.  Started with the calamari, very large well seasoned portion with a nice marinara sauce.  Nicely done.  My wife had the gnocchi and I had the chicken park.  Clearly fresh homemade pasta was impressive and cooled properly.  Chicken was a large piece pounded to a good thickness and appeared to be coated in a thin panko crust.  Very good with a high quality cheese topping.  The hot Italian bread that was included with the meal was excellent!  The only drawback was the price of the en tree's, especially when no salad is included with meal.  $18 for chicken park seems a little off, however the food was very good and we will be back!"}
{"text":"Food and service were very good - nice menu, very difficult on what to choose.  A bit pricey though.  I had swordfish, and was cooked perfect, and it had a fried risotto cake, which was absolutely delicious. Our server was excellent, very tentative.  I definitely will be back to try some of their other menu options."}
{"text":"Went here for our small office Christmas dinner and was expecting a really good Italian meal but was not so impressed. The place is small, the waiter was pleasant but the dinner was so, so. I wouldn't rush back."}
{"text":"First time here for lunch at OGGI and man was I surprised! If you want a good pasta dish for a reasonable amount of money this is the place to go! I had the Agnolotti Alla Panna and although it looked like it wasn't going to fill me up boy was I wrong. Looks can definitely be deceiving! And remember OGGI is not only pasta they have sandwiches, panini, and more. I would definitely go again and I would definitely bring a girl here, it was great."}
{"text":"Tried Oggi for the first time today at the new Music Factory location and I see why Ballantyne stays so busy! The atmosphere is beautiful (I even took a picture.) The service was outgoing and friendly. The food was perfect. I had a Caesar salad with sauteed shrimp and a unique tasty dressing. It was perfect. My friend had the Alla Panna. It was a ravioli with a cream sauce that I gladly soaked my bread in. So delicious. Did not get a drink today but next time I will try a cocktail from the bar. I work in the Music Factory area and I will surely go back often."}
{"text":"Great Italian food, drinks and wine. The food and service stand out. Our faves are the bruschetta, calamari, caprese, skirt steak, mare and vongole. We love the owner - very accommodating and has great recommendations. One of our go-to Italian spots!  In the winter, they enclose the outdoor space and use patio heaters. The interior is small so it's best to book reservations ahead."}
{"text":"Since my last review of Oggi, in October, I have dined twice at the request of others.  And, both times the food continues to disappoint.  This past Friday we arrived shortly after 7 and received a table immediately, luckily before a line started.  A line, yes, still amazes me based on the food.  The host was very friendly and our waiter arrived, took our drink order and went over the specials.  We started with the calamari and zucchini which was breadly perfectly and served with a light marinara sauce that was great!  I chose the trout almondine for my entree, which was one of the specials, which we were not told the price, and realized later it was $25..so not worth it.  The trout was covered in a lemon white wine sauce and almonds, which left no room to taste the trout. Very disappointing for a special. We also ordered the muchroom risotta, which was too stickey for risotta and the mushrooms did not seem fresh.  Risotta should be creamy..this was so not. For a restaurant that prides themselves on freshness and flavor, I am truly disappointed. And, I think this was my last shot at Oggi, too many other Italian restaurants in Charlotte I would like to enjoy, and spend my money at."}
{"text":"Very, very, very overrated and very, very, very over priced.  Bartender was so obnoxious and intrusive. We were shocked. Two at the bar waiting for 2 more to arrive and couldn't wait to get seated. Hostess was great as we have 2 no shows and she moved 4 of  us into a both. Seats were not comfortable or padded well. Uncomfortable for all of us.  Food was so disappointing. The portions were so small. My pasta Carbonara was so dry it was gummy.  Poorly seasoned and not really Carbonara.  Yes, I'm an Italian food freak. I lived in Italy 35 yrs. ago, lived outside of New York City and live in San Francisco for 25 years so I know my Italian food. Beside, when I can cook it better than the Chef and I'm being charged a 200% mark up on pasta. I say \"Basta\".  Wine was cheap Italian Sangiovese (inexpensive Italy wine) that is $8 at Total Wine. They charged $14 for large glass that is 1/3 full, I gotta say \"No, bene\".  We tried it. I would never go back there again.  Brick's Pizza has better pasta at 1/2 the price.  Live and learn.  Ciao, arrivederci tutti!"}
{"text":"This is some of THE BEST Italian food I have had outside of Italy. The food is authentic, fresh and amazing. The service is great too. It can get a little loud when it is full - but worth it for the food."}
{"text":"My wife and I have been to this restaurant several times, and each time I have requested a booth in my reservation. I have never received a booth. Today I confirmed via telephone with a manager at the restaurant who said to me \"I promise you will have a booth.\" As you may have guessed, I arrived for a 5:45 reservation and there were two booths available. The manager told me I could have either of the tables by the front door but the boots were spoken for.  I'm not sure why I would make a reservation that early and get a table by the front door, but we immediately left.  The food is pretty good, but the seating situation is miserable. The tables in the center of the restaurant are all about 6 inches apart, so if you would like the waiters butt near your food you're in for a treat. If you don't, you should avoid this restaurant because the seating situation and the loudness makes it difficult to enjoy your experience. I don't think we will ever return to this place!"}
{"text":"So this has been one of my top 3 favorite restaurants in Charlotte, the food was always that good. Our last experience, super disappointing. First we asked for a booth. Were told we couldn't sit at booth for 4, we were too small a party (3). So we were then sat at a \"table\" for 4. This made no sense and I didn't want to get into a scene with the hostess, but this set the tone for the meal. I guess she was saving it for someone more important than we were? We did have a reservation btw.  The menu's were a single page folded in half. They were Dirty with sauce and slightly torn. I noticed this on another review below also so it's not a one-off. Not acceptable and gross.  We ordered the Caprese as we usually do. They changed it (again) . 1 small heirloom tomato quartered (not sliced traditionally) that was not sweet.  The weirdly shaped half-moon Mozzarella was watery and not very tasty. They used to use a Burrata but I prefer a firm creamy Mozzarella.  The basil was slivered (not whole leaves) and didnt look or taste fresh. They need to go back to the drawing board and do a traditional Caprese it's not that hard?! The Balsamic reduction was very good. Very disappointing, they've gone backwards on a simple dish for some reason.  I ordered the Veal Marsala. The Veal was pounded very thin, that was good. They use a traditional dry marsala I think (since it had no sweetness) but it also had no nuttiness? It was just a brown oversauced mess on the plate, without flavor except excess salt. They also used it on the nicely spun but not al dente pasta, the hot marsala sauce may have cooked it further and softened it to the point of being overcooked. Just not a good dish My wife's Veal Piccata was way over-lemoned (common rookie mistake, unfortunately) and therefore bitter. How about less lemon, and serving a lemon garnish (none) with the dish so the diner can add to taste?  The Creme Brulee was the highlight of the dinner. Outstanding! The service was friendly, but mixed. The bread finally came out after we finished the salad, the water was not refilled (my first glass had something floating in it)  and she forgot to bring the requested butter.  Lastly, I'll say I don't like spending $135. on dinner and having to look at the ugly hairy toes of men in flip-flops and shorts like its a sports bar. It must be the official uniform of Ballantyne because at least 75% of the men were in shorts, and I saw at least 4 men with flip-flops. Sorry, that's gross. I wear pants and dress shoes when I go out for dinner at a \"nice\" restaurant. Maybe the standards have fallen here due to their success and always being busy? I'll try again in a few months with an open mind (sticking to the usually great skirt steak, lasagna etc) and post a follow-up review."}
{"text":"Took my wife there based on a Yelp review. We had a nice dinner for two. Everything was fresh and tasty. We split the a la carte salad. It was on the high end of moderately priced."}
{"text":"Overall dining experience was good. Service, even though we chose an outdoor table, was terrific. Food was good not great. Marinara sauce was thin and bland. Veal parm was overcooked and the accompanying pasta was way too al dente. Will likely give it another try because the staff was so nice. In the meantime I am heading back to Portofinos."}
{"text":"I have been meaning to check this place out for a while but haven't had a chance. My husband and I finally made it there to celebrate our anniversary. We showed up on a Friday night with no reservations so our options were to sit outside or at the bar. We chose to sit at the bar. Chad, the bartender, was awesome. He told us all about oggi and how the pasta is made fresh, the chicken in free range and everything is made with local ingredients. Awesome guy! I had a half order of both raviolis and my husband had the chicken parm. Both dishes were great. We also had the chocolate Vesuvio which was delicious. We will definitely be back!"}
