{"text":"I do not recommend using their online ordering system.   Great interface, but they had no idea that I had ordered when I arrived.  They very unapologetically told me they don't know where my order was.

Actual sushi (when I got it) was decent.  Not the best, but what you could expect in Whitby."}
{"text":"Went on Easter Sunday for lunch.  Absolute disaster!

If you enjoy long waits for your food and leaving a restaurant hungry, this place is for you!

Restaurant wasn't full by any stretch.  Food took forever to come and the service was dismal.  Never again!

Examples... 20 mins for a bowl of white rice, 30 mins for 3 chicken skewers.  They finally brought the chicken skewers (I asked 3 times) after we were got up from our table to leave.  

The two servers were obsessed with a larger group at the back of the restaurant and practically ignored the diners at the front."}
{"text":"This places lunch menu is Bullshit! Not good at conveying whats on it. Lunch ends at 3. Nothing good to say about this place."}
{"text":"Me and my boyfriend go sushi every weekend.  We have our regular spots in toronto which we recommend on yelp. This place overall was horrible. 

The avacado salad had a single tiny piece split into 2 ontop of lettuce.  When I asked the waitress she pointed at the tiny pieces and smiled. She could tell I was upset but so what. .. I have a picture of it which I hope I can post.

..
Then the menu was like 12 items.  Tiny selection and not a single dragon roll option let a lone a decent salmon selection. 

The sushi came and it was basically salmon wrapped in thick layers of rice. .. it's quite apparent with this place that the goal is to make you full with rice so you leave full but not with sushi. ... 

We have eaten in many great ayce sushi restaurants to know when a place is being cheap. 

One of the worst sushi we have ever had. If you want 
Sushi in whitby. . You can find better places down the street on dundas towards Oshawa."}
{"text":"I had the best bowl of Chicken Miso Ramen there, the flavor was just incredible and the service was stellar! I will definitely be eating there again, Believe It!!!"}
{"text":"Was looking for a good AYCE sushi joint in Durham and this place has been my favourite so far.
They have a large dinner menu with lots of variety, and even have bubble tea as part of the AYCE dinner menu. 
The food has always been fresh and the service has always been good. They have very nice dish presentations for an AYCE restaurant as well."}
{"text":"My friend and I were passing through Whitby and needed to get some dinner. After seeing reviews of Oishi Maki, we thought we'd give it a try. We regret our visit.

Our first clue should have been how quickly the food came out. My buddy had the gyoza udon soup and I had a sushi combo. The udon was bland and unappealing. My sushi was haphazardly assembled and didn't taste fresh. My ball of wasabi had a crust on it - the kind that forms when something has been sitting out for too long. I felt like the sushi was made by someone that just wanted to get their day over with.

As much as I disliked the food, our waitress was attentive and polite. I was hoping she wouldn't ask how our food was, but she did. We told her that we didn't enjoy the meal. She explained how the udon broth was made. I think she was trying to say that maybe he just didn't like that kind of soup. Maybe that's fair. I volunteered that I didn't like my sushi and she offered that it was because they are typically an all you can eat place. I explained to her that, be that as it may, given that we ordered a la carte in an empty restaurant, perhaps more care could have been taken in preparing our meal.

1 star for the food. 3 for the service."}
{"text":"For all you can eat sushi I sure love this place service is a good speed and food quality is great. I normally go there for lunches because it is the beat buy $16.99."}
{"text":"I've been to many Japanese restaurants, ranging from traditional/true Japanese to the all you can eat.  This is definitely an \"all you can eat\" type, but the quality of food compared to other \"all you can eat\" is very good.  There are many varieties of foods available, my favorite being the sushi options and spicy seafood ramen.  The staff and service is typically amazing and they really try to accommodate your requests.

There are two criticisms I have, 1) when it's busy, expect to a slower than usual meal.  The workaround to that is, to arrive earlier.  2) sushi options - very standard fare for an \"all you can eat\" in GTA...certainly cannot compare to some of the \"all you can eat\" that I've been to in Vancouver, but hey, Oishi's food quality and service is great and is good value for the money.  You certainly won't leave disappointed.

Enjoy"}
{"text":"Great service, happy staff and good food. Been going there since I was in high school."}
{"text":"Our order got mixed up with someone else's and we got only half of the things we ordered and the other half was some unknown rolls!  Service was extremely slow.  They apologized but only gave 10% off the bill which was already $80 for 3 people.   We have had better rolls, sashimi and ramen soup in a more traditional Japanese restaurant.  Will not be back."}
{"text":"I've been coming here for years and it's my favourite sushi spot in Whitby. Food is always good, servers are polite, and it's always been consistent in terms of quality. On a few occasions I've had to deal with certain items never making it to the table, which was a little annoying, but overall I love this place and I always come back."}
{"text":"I was there with my friends to celebrate a birthday. We booked an early dinner, when we got there it wasn't busy. The waitress was very attentive and tried hard to explain each dish. The place was great and has a nice decor. The food was great and we didn't have to wait for long to get our food. I would definitely go back."}
{"text":"I have eaten sushi all across North America and Europe and by far this was the worst experience I have ever had, for food and service!! Walking into the establishment it smelled of urine. Poorly lit and decorated in an eclectic and messy way. The server who came to my table was quite rude, she did not explain that the all you can eat menu was no longer available and proceeded to grossly overcharge for my meal! The sashimi was clearly not fresh at all, and the restaurant had the feel of a Chinese buffet! I would not send my worst enemy here!!!!!"}
{"text":"Terrible service food was ok ordered the all you can eat only received 2 of my 6 iteams"}
{"text":"Excellent food. They bring the sushi in a boat which is really cool. First time we tried last night and will be back for sure"}
{"text":"Very disappointed with their food and service. I got take out and specifically asked for no spicy mayo, and they put spicy mayo on every thing and asked me if it was okay if they gave it to me like that...... ridiculous! And then they put the ones which spicy mayo on another separate plate and served it to another customer...... this is just not acceptable..... and one chef touched the sushi roll with his bare hands (no glove on)..."}
{"text":"Excellent sushi place. 

Each dish we ordered with only one exception was excellent. Fried Udon could have spent more time in the pan, though my wife and her parents preferred them more boiled than fried so who knows. 

Definitely recommend the short ribs, beef teriyaki, and bacon wrapped asparagus!

Only thing preventing a 5 star was the service speed. Not bad, but only three servers doing everything for the entire place meant they were a bit over worked, so you did have to flag them down if you needed something. 

Great spot! Will be back!"}
{"text":"At 12.99 the price isn't bad, neither is the atmosphere. The dinning area is tastefully decorated and the service is fair but the food is truly made for the city of Whitby, and like Whitby it is nothing out of the ordinary, exactly what you would expect, bland or filled with soy, etc. It is one of the better sushi places in Whitby and I would recomend going there but they haven't made a regular out of me."}
{"text":"LOVE! This is hands down my favourite sushi restaurant in the area, I come here at least 3 times a month with either my friends or boyfriend and we are never disappointed. The food is amazing and the staff is excellent, no complaints. I would definitely recommend this place to anyone!"}
{"text":"Been here about 4 times in the last 2 months and have been extremely pleased each time.... sushi rice is always cooked proper and seasoned well... sashimi is pretty good really.... they have grilled shrimp which is excellent and fully pealed... the AYCE menu also includes free bubble tea which was very tasty.... a pop is only 50 cents and then free refills which comes in cans.... overall I really do enjoy this place... also try the (yeah sushi) I think it's called.. it's salmon sushi and the salmon has been lightly seared and then placed on the ball of rice with a drizzle of mayo... very good worth trying.... overall great place. ..."}
{"text":"What an awesome sushi place - I wish I knew it earlier and I've drove passed this place many times.  We went for dinner on a weekend and it was relatively packed but the service was great and the food was even better. HIGHLY recommended for sushi in Durham.

Food: 5/5, the sashmi is very fresh, well cut and displayed well on a plate.  The yoyogi sushi roll was great too.  The steak skewer was also medium rare level and unlike other places where it is like rubber.  The tempura was crispy and every roll had a good 70/30 fish/inner-meat vs. rice ratio.  The only thing we didn't enjoy as much was the ramen since it was just a lot of ramen and not much broth or meat content. 

Service: 4/5, overall, great - they were fast and very attentive.  The staff are also often seen smiling and can really see that they care about their customers

Ambience: 5/5, great wide seating even for the chairs and very large area where you don't feel like you can hear everyone else's conversations.  The music is also not too loud and well air-conditioned.

Price: 4/5, about $27-ish per person with tip.  It's quite solid for AYCE and wit the quality of food and service, totally worth it."}
{"text":"Great bang for your buck AYCE sushi. Cheapest AYCE I've ever had, 17.99 special in Tuesday's. Quality is fresh, food comes fast and great selection. However if you order salmon sashimi make sure you don't over too much they tend to give more than what you order and make you pay for wasted food."}
{"text":"Avoid at all costs. This isn't the first time I have attended this place. I tried giving it many chances. Unfortunate that this is the example they send out. The manager would not come and provide additional help. The waitresses started to speak Chinese when we were there, which is a poor example of customer service. I had a fly over my food. We left rice and they charged us 7.00$. Avoid."}
{"text":"Went there yesterday for a late lunch and early dinner. Had all you could eat. Good selection and food was tasty. Nice atmosphere and staff friendly. I would go back again."}
{"text":"Very good sushi, beautifully presented. Small but nice atmosphere. Staff is fine; most don't seem to speak English well but they're attentive and it's not an issue. We go regularly. Just make sure you're there in good time before they close - otherwise,  you'll feel rushed to order and they aren't quick. One of the best local sushi joints."}
{"text":"Oishi Maki offers an all-you-can-eat dining option, as well as a regular menu.  It's not a hot steam table.  Instead, you order what you want, and they will make it for you, including fried green-tea ice cream (dinner option).  Great atmosphere, great service, great food.  Yum.  CAD 6.99 lunch options 11am-3pm, CAD 12.99 lunch or CAD 20.99/21.99 dinner all-you-can-eat option order off the menu or a la carte.  Credit cards accepted, street parking, open daily 1100-2200 hours."}
{"text":"They close at 10:30 on Fridays but when we walked in at 9:30 for ramen, we were told very rudely and loudly from the back that it was takeout only, because the kitchen was 'clean'. If it was clean, then you'd have to use it for takeout or dine-in regardless. Absolutely horrible first impression, not sure if I will ever be back."}
{"text":"All time fav sushi restaurant in Whitby. We tend to order in than eat in. Usually a late Friday and too lazy to cook moment so sushi comes to mind. 

All the rolls are delicious. The rice is a good consistency - not mushy or hard. 
Our favourite a are the spider roll, green dragon roll, the spicy crab pizza, and the sashimi is always fresh. 

The apps are just tasty. We enjoy the calamari and tempura.

For a delivery service, I'm very impressed with their presentation. The platter is garnished well and they really know how to piece all the rolls together perfectly. 

The overall experience from the phone order to the delivery man is wonderful. 

Thumbs up!!!"}
{"text":"This is our favourite AYCE sushi in Whitby. Very affordable and lots of choices. Clean and prompt service."}
{"text":"Make sure you come to this place if you're a bit strapped on cash and you're looking to eat as much as you can. The sushi is okay--you won't die from it, but if you've had really good sushi before, you won't exactly love it either. The wonton soup is weird, but it's not half bad. It's got one wonton dumpling and the rest of the soup is basically a miso soup. The maki was okay. The California roll was decent with crab and avocado, but it lacked the usual flavor found in other Cali rolls I've have in the past. The chicken katsu roll was, again, okay. The chicken was good, but they need to work on the ratio of avocado to chicken. There were some bites of the roll that all I could taste was avocado. I didn't personally like dumplings (they're deep fried), but the other members of my party did enjoy. Additionally, the biggest problem we had was that there was no ponzu sauce. Any good Japanese restaurant will have ponzu. One of the good things was the spicy tuna roll. I didn't personally have it, but two members of my party (who do know good sushi very well) found it tasty. The other redeeming qualities were that the entire place including the restrooms were very clean and that they offer 50% off for birthday. Overall, it's not bad. If you've got only $20 and are super hungry, it's not a bad choice at all. But beware--order a little at a time, any uneaten food is charged at full price."}
{"text":"Most of the food is pretty good, but somethings were really off. Thousand Island dressing on their green salad, fake crab, and the sad excuse for bubble tea. We also found the service lacking. 

Not bad, just not good."}
{"text":"This is one of the best (if not the best) AYCE sushi place in the Durham region. The fish is always fresh and the wait staff are very helpful, educated on their menu and friendly. The variety is excellent and creative. This is also one of the few places you can get an actual sushi boat. They are accommodating as well when it comes to preferences (ie no avacado) 

Excellent place if you can check it out!"}
{"text":"This is my favourite sushi place - best value! I go here all the time and bring all of my friends.

The rolls are the perfect size, well wrapped, and very tasty. I get all you can eat when I go, and the service is fast.  

The shrimp/yam tempura is great and warm. The rolls are fresh and well made. They have lots of unique little dishes that I like to get - lemon chicken is one of my favourites. They have lots of different flavours of ice cream included in the AYCE, my favourite is green tea. The tea is delicious and always hot. The service is great and fast. I always wonder why the restaurant isn't more busy because it is such a great place. 

Bonus: the bathroom is really cute!

The prices have gone up a bit since I started going, so I try to make it in time for lunch, but I still won't turn anyone down if they want to go there for dinner."}
{"text":"Great sushi choices for an ayce! Will definetely go back. Have been to the Momo sushi chains and oishi maki is MUCH better quality. Decor is okay and they don't have the tablet menu but who cares? The food is great!"}
{"text":"Was impressed that Whitby could muster a real sushi joint! 

They have AYCE for $12.99 and the menu was really extensive.

I wasn't feeling super hungry so I opted for a rainbow roll ($8.99). It was huge, rolled nicely and pretty tasty.

Staff was very friendly. Décor is quite uninspired here, the restaurant is clean and functional with a few generic Japanese decorations thrown on the wall for good measure."}
{"text":"This place has the best sushi around town! Been a loyal customer for the past 6 years! Food is always delicious and fresh, staff is always very pleasant."}
{"text":"Great sushi, with a very big selection in their AYCE! Quick service, and a very nice restaurant. They have a great lunch menu, but their dinner menu in amazing!

Great place for a quiet dinner with a friend, or even a few friends!"}
{"text":"Enjoyed this place immensely!  Dined here on a Monday afternoon for lunch and had a great experience!  The staff here are great, very friendly and accommodating. The sushi was very tasty for ayce, I wasn't disappointed, extremely happy with the selection they had. I most definitely will be coming back to this establishment."}
{"text":"This is my go-to sushi place in Whitby! The restaurant is always very clean, the service is friendly and fast, and one time my friend spilled his water everywhere and all of them came running with rags to help clean. They're portions are HUGE and filling and always delicious. Their shrimp tempura is melt in your mouth, I'm drooling just thinking about it. Their sashimi portions are also HUGE, you definitely get your moneys worth! The decor is beautiful, I love their black tables and the lighting really sets the calm atmosphere. Their plating presentation is AMAZING, sometimes I need to get all hipster and take pictures before I eat it! I definitely always recommended this place if someone's looking for a sushi place!"}
