{"text":"This place serves Chinese food and it's extremely delicious. It's not too crowded and the prices are reasonable!! Ideal for family meals or big get-togethers. They have an abundance of Beijing styled dishes-- definitely worth the try!!!"}
{"text":"Came for dinner last night. Thankfully, I made a reservation, because the restaurant had a small wait list almost the entire time I was there.  The lamb skewers were just as good as the first time. $4.99/4. Good price. Good skewers. Decent portion. This is now my favorite place for lamb skewers.  Also ordered the sheep belly with dry bean curd stick in hot pot ($23.99). Expensive, but it's a lot of food. The veggies were fresh. Lots of dry bean curd stick, but could have had some more lamb, especially in a pot that big.  We also had a $18.88 set meal for two which included a steamed fresh fish and a plate of garlic fried bok choy. They're having a promotion right now where if you get certain set meals (including this one), you get a plate of lion head meatballs for free. Lion head meatballs don't contain lion or head. They're called that due to their traditionally large size. These ones were typical meatball size. They're $3.99 on special right now, even without ordering the set meal, but we didn't know it was free until we ordered it. That was a nice surprise. Even without it, the $18.88 meal I'd consider a cheap eat. Steamed fish is pricey. This was a pretty big fish, and it was definitely fresh. The bok choy was tasty as well.  For a dinner for four, it costed $51 before tips, but we brought home three takeout containers of food.  Bonus: This restaurant, as of last night, has Grandpa's seal of approval. That's got to count for something. I'll definitely be back."}
{"text":"It's probably a new place as it was different restaurant when I last visited. Wasn't too busy when we got there around 6:30pm for dinner.    Their skewers are one of the cheapest although not the best I have tasted. They have tomato dumplings!! Never had that before so ordered it. Not bad actually. Service was good."}
