{"text":"Stopped in with family on a Friday afternoon around 430pm. There were many lanes available and we were quickly given shoes and designated a lane.   A member of my party ordered a pizza which smelled and looked delicious!  We played two games and paid when we were finished. It was a reasonably priced and fun afternoon activity! I would return."}
{"text":"The Best pizza in town. They're always consistent in their product is always great. The staff there is always on top of things. There are other food is also good great environment"}
{"text":"It was a really good place, I wasnt expecting it to be mini bowling, but it was as fun as the regular one. It is very cheap, around 4 dollars per person. I didnt try the food, but it is supposed to be good. Definatly coming back!"}
{"text":"I will not be coming back after today.  The waitresses have always been terrible and rude.  I used to come once a month for pizza, which doesn't taste as good as it used too but is still decent.  Today, our waitress was rude and we never saw her after we got our food.  If you like terrible service and no refills, then this is the place for you!"}
{"text":"Nice updated (from what it was last summer), food is pretty good. When it comes to getting a lane during the week make sure you call ahead! Holidays it is packed and they have a waiting list, bowling leagues are so big that they don't have bowling even available after like 3:30 to walk in customers. Also, the 2 bartenders are also the waiters for the restaurant and patio. So good luck ordering drinks while bowling."}
{"text":"Great pizza!!"}
{"text":"Stopped in after attending the Home Show. Excellent 'Monical's' 8\" pizza, crisp salad, soda, and a beer special, $9.01. Cant' beat it. Sat near the bar in a sunroom, was quiet, warmer than inside, and had attentative service."}
{"text":"Really good thin, has been pretty consistent over the years. Don't get too fancy; keep it simple with toppings and it will not disappoint."}
{"text":"I love me some pizza. The thin crust with extra cheese was so darn yummy!!! Didn't need extra toppings, just a great cheese pie. Excellent cheese, sauce was a tad sweet but quite good, crust was perfect. I eat Pizza Hut and Dominoes but Old Orchard easily has them beat. Side salad was fresh and nice with that delicious pizza!!!"}
{"text":"The pizza is awesome! It's thin crust- highly recommend the spicy sleeper. Typical bowling alley bar- nice thing is they have a small patio if you feel like sitting outside. The bowling lanes are fine- but it can become quite crowded at times and sometimes unattended children."}
{"text":"Been here a couple times for meet ups with friends and co-workers and it's always a good time. Staff are always friendly and are able to get you set up with a shoes and a lane quite quickly. For the record though, I'm an abysmal bowler but the food, drinks, and good company always make up for it. The pizza here is surprisingly good and is able to serve a large group. They have a nice selection of drinks as well. When I'm in the mood to embarrass myself in front of large groups of people, I'll always go to Old Orchard."}
{"text":"I went there with my Wingman and I had the sausage and ham pizza. It was good. It was really busy but we were waited on quickly but the staff were nice to us and the service was good. We will be back again soon you guys should check it out."}
{"text":"Up until recently, my wife and I was a \"once a week\" regulars at Old Orchard Lanes. We would pop in usually on either Mondays or Thursdays between 11 am and 3 pm. We never went on weekends or after 5 pm due to the younger staff. The younger staff would not come to your table and wait on you. You had to go to the counter if you wanted any food or drink. The younger staff was not in a hurry to get our food out in a reasonable amount of time and actually once had them forget an item we had ordered and then tried to charge us. We found this out when we actually tried going there on a weekend. We only had one bad experience during our usual lunch experiences, the lettuce in our salads was old and bitter.  We went in today a little after 1 pm and was informed that their menu has changed. They trimmed the menu size down and got rid of some items that probably wasn't the best cost efficient. Instead of a small and a large chef salad, they own have one size which was supposed to be between the old two sizes, The old small chef salad was $3.59 and the large was $4.59; now their chef salad is about the same size as their old chef salad. It is priced at $5.99. Basically, kept the old size and upped the price.  Did not see the same familiar faces of staff or management that we were used to seeing. My wife and I left wondering if they changed staff or even owners. Saw a sign stating they were looking for kitchen staff on our way out. If you asked me months ago my opinion on this place, I would have gave 4 stars as long as you went during lunch hours and maybe 2 stars on the weekends/nights. Now, I can only give it two stars, sadly. If just bowling or drinking alcohol is what you want, then by all means, this is probably your best bet. Having a sit down meal is better served by going down the street to Applebee's or Buffalo Wild Wings."}
{"text":"The Pizza is what makes the stop worthwhile. If it wasn't for that; Bowling would just be Bowling."}
{"text":"I would give five stars for the pizza, which is awesome; but the service here is just horrible.  I come here at least once a week and the service is always poor. No refills, tables sitting dirty, lack of caring by staff, the list goes on.  They really need friendlier staff and a bar manager.  The bar staff have to wait on the tables, so depending on the night, the food can take forever.   I usually end up getting waited on by the blonde mentioned in a previous review.  I like to refer to her as \"smiley\", because she seriously never smiles.  Apparently, she's not concerned with getting tips.  She walks past dirty tables multiple times without cleaning them and never offers refills, boxes, etc unless you're a hot guy.  Pizza is amazing, service sucks."}
{"text":"I am not sure why people are so fixated on the food and the service for the food...cmon guys, this is a BOWLING ALLEY. Don't judge this place by the food but by its lanes! Came with the bf after we'd already had dinner, and was just looking for a recreational activity to do before we getting drinks later. Since I was a just a visitor to this bowling alley and have rarely gone bowling before, I thought this place was definitely buzzing - we could hardly find a parking spot and I was told this place was packed every night. Between that, the Blind Pig, and Savoy 16...what else is there to do around Champaign-Urbana? Anyways, came in and after waiting about 10 minutes for an alley, was quickly given our sized shoes. I don't know about their food service, but their bowling alley shoes service was perfect - they even gave me nail clippers when I chipped a nail using a heavy bowling ball! They have tons of accommodations for all sorts of bowlers: rails or no rails, multiple sizes/weights and finger holes for bowling balls, and they even have this little bowling ball slide that smaller kids can use if they can't pick up the bowling balls (I've never seen any other bowling alley have these). Bf and I played 3 games without rails, and I impressed even myself at how good I was at keeping the ball going in a straight line (was it me or was it the bowling ball itself? haha).  Only one complaint: unlike other places I've been, the games are not linked, so literally after every game the score would reset to zero. In other places I've been, 1 round of bowling consisted of 3 games, and the scores would sum at the end. In addition, they'd charge per round, not per game - so, I guess a different way of paying. Here, they charge per game, and after every game the score would reset :(  Still, we had a wonderful night, had tons of fun, and service was great!  If you're looking for a good place to eat, I suggest you go somewhere that is NOT a bowling alley...then come back for the bowling xD  Next time, I might try hitting a bar/grabbing some drinks, then coming here - lets see if i can still make those strikes haha!"}
{"text":"This is my least favorite place in town to bowl.  The lanes are not kept in good shape.  I have a feeling the ball returns would damage my ball if I bowled there often, as they are rickety and seem dangerous.  There are sometimes floorboards missing near the lanes, and the oil patterns are, well, let's just say.... adventurous.    Instead of calling it \"Old Orchard Lanes\", it could be called \"Old Equipment Lanes\".  Everything looks dingy.  On the other hand, the mini-golf that is connected here, is pretty decent.  If they showed as much care for the bowling, then things would be a lot better.  This place is still always busy, most likely because it is easy to get to from campus."}
{"text":"I'm only rating them on their bowling, not food.  I took relatives to this place and it was so welcoming and friendly.  I'm a terrible bowler and we were just there to have fun and goof around with family.  Sometimes I feel like an outsider at bowling alleys, because some people take it way serious.  But during the day at Old Orchard, there were groups of kids, older adults, families, such variety!  And everyone was having a great time.  The staff was friendly, we had to have our computer set up for us and the man at the counter was super-helpful.  Clean bathrooms, lots of lanes and ample parking!"}
{"text":"Best place for pizza in the C-U hands down!  I've been eating pizza here since I can remember and it's always good.  Hint: they have Monical's original recipe and use more cheese = better pizza!  It's a family run establishment and you can be sure the pizza will be first rate if Rhonda is in the kitchen cooking it up.  Bowling, pizza and beer/pepsi makes for a first rate night in the C-U!"}
{"text":"Great food and cheap bowling. Good drink specials as well!"}
{"text":"the only reason i am giving this place 1 star is because of the service we had at the lounge last night. i dont give may 1 stars...and it takes a lot for me to give 1. but i dont know who this waitress thought she was last night or if she was having a bad night....but she was by far the worst waitress i have ever come in contact with at a place to eat. it took forever for everything. she never once offered refills on any of our parties drinks, ...i had to ask for more water and the girl didnt even replace the ice so i got warm water...had to send the cup back with the guy who brought over our pizza to get more ice, we asked for popcorn and she never brought the refills for that. it took forever to get our pizza. we had a good size party of 8, ordered 3 pizzas, they all came out one at a time and about 10 minutes apart of each other. it was horrible service.  which by the way the pizza was AMAZING!!!! it was the closest thing to Monicals pizza i think you can get now. if i was rating this on the food it would get 5 by far, but i was soooo disappointed in the service i had to vent about how horrible this blond waitress with her \"stay away from me diamond ring\" was. from what i hear when you go there...ask for Nicky! she is the best!!!! Sorry I was not able to get the Nicky Customer Service Experience!!!!"}
{"text":"I generally love this place. It is family owned and my children grew up there on Saturday mornings in youth bowling league. The food is always great. The issue that I have is that the service SUCKS!  I have been in the service industry for over 40 years. I understand when unexpected bumps happen and servers are in the weeds. I am more than patient and always tip over the percentage.  Tired of their short staffing!  There have been many occasions that I would have spent more. Tab would have been increased. Tip would have reflected that!  Tonight was the worst.  Ordered a chef salad and a 14 inch pizza soon after arriving.  A group of 5 came in 45 minutes to an hour after my arrival and their food came before mine. When my food finally arrived was told that they had dropped my pizza as an explanation for the wait. No apologies or an offer to comp anything.  If someone had come out and explained or apologized I would have been okay with that!  A lifetime regular that hopes they get their heads out of there asses!  Not a way to run a family business. Makes me sad!"}
