{"text":"ONLY pay in cash!!! ......be careful.
They are not using chip and pin technology for credit cards!!!  Thanks to reading a recent review....while in the restaurant, I learned that someone's Visa card was compromised the week before.  They tried to walk off with my Visa when I went to pay.  I insisted to see how they were going to use it. I wouldn't allow them to swipe my magnetic card on their computer as this is obviously how the other reviewer's credit card was compromised. They wanted me to use my BANK CARD on a chipped devise attached to the computer? by a cable. Highly suspect.
To pay I got cash at an ATM across the road and complained to the owner.  This arrogant German hollered that I was not allowed to come back.
Which is just fine because I like my Caesar salad WITHOUT hair!
A huge dog on the patio barked through out the meal... couldn't even hold a conversation.
Run do not walk away."}
{"text":"Decided to come check out this place this past sunday afternoon. The food was decent and the service was absolutely horrible. Three tables that ordered after us got their food first. Not sure what the reason is but I felt racism played a factor. The food came after an hour and a half. I do not recommend and will never come back here again. This is the worst customer service I have ever experienced."}
{"text":"Always a reliable place to visit for quality home style meals that are reasonably priced. The house wines are of good selection and also well priced. You wont feel hungry 2 hours later after you had a great meal here !"}
{"text":"The Viennese Wiener Schnitzelis fantastic. It is made fresh! The portion is large!

The service is very good, it's not unusual for the owner to come by and ask about the service. I have been going here for 15+ years.... I have never been disappointed. however the china is very old... do it's time to get new china. 

The washrooms are clean, however, you have to walk upstairs (fine for me, but you should be aware of this)"}
{"text":"The old country in has been our \"go to\" place for local schnitzel for many years. I've herd that they sometimes turn people away without a reservation so we called an hour beforehand and we were set. 

When we go for schnitzel we always have the jäger schnitzel with the mushroom sauce which is fabulous. A traditional schnitzel meal is best with spätzle and red cabbage and at any place we have been to, including Old Country Inn in the past, it's a standard item that can be substituted at no extra charge. This time it was a different case. They informed us when we ordered that they would only substitute one of them for the sides and that the red cabbage would be an extra charge. We love both so we decided to get it anyway, and the red cabbage was delicious. The meal was tasty and the service was good but to our surprise and disappointment when we got the bill, they had added an extra charge for the spätzle as well.   Since this combination is what we always get when going for schnitzel this will be a big factor in weather we come back."}
{"text":"My family has been eating at the Old Country Inn for over 20 years on a mostly weekly basis.  The food is superb from the schnizel (done in various ways to your tastebud likings), goulash, soups, salads, and Friday night prime rib. Desserts are fantastic from the chocolate crepes, peach melba, cheesecake and apply strudel which is the best that I've tasted anywhere.  The staff are all friendly and cater to your individual needs if you wish to make a change to your meal, they are more than willing to accommodate.  Average cost including a glass of wine or beer, a salad as an appetizer and your main course costs on average about $30.00/person.  I highly recommend this restaurant and I'll be there again tonight - and looking forward to it as usual!"}
{"text":"After searching from the yelp, there is only one or two restaurants popped up for authentic German food. Finally we (with friend) came here for a Saturday lunch today. Stepping into the restaurant, I really like the place with very cozy and well-decorated ambiance. There is No playing music, but very quiet and lots of natural light through the windows, love it!!!! 

We ordered some of their so-called must try items as follows ^0^

. Escargot... my favorite one
. Potato soup
. 10 oz. New York center cut... tender and flavourful 
. Saturday special German Pork Hock cut... delicious with special gravy 
. 2 crepes filled with apricot jam and coffee
. Complimentary bread

We really enjoyed all of the food served on our table. The portion size of our food is quite enough for two of us. Will come back to try different kinds of food with more friends!!!!!"}
{"text":"Very cozy restarant and the waitreses are very friendly. Food is good - we had the platter and we love the sausages. We recommend to give it a try!!"}
{"text":"We have been going to the old country in for many years now. Usually we go for celebrating a birthday or anniversary.  I have to admit the food is very good and my usual order is the Jager Schnitzel which comes with the mushroom sauce. In the past I've been able to switch up vegetables for red cabbage and spätzle and they've been able to do it without having a price change for switching sides. To our surprise in the past three months they have changed their pricing. We were told we could could only pick one side dish, therefore, I selected the spätzle and one side order of red cabbage to share.  We were charged extra for the spätzle and red cabbage because they were substituted.  Our dinner was approximately $27.00 each without tax."}
{"text":"It's a really nice atmosphere, the food is decent. Waiter was very friendly. The only complain I have is that their plates and the glasses looked old and had marks on them. Reasonable price. It's a nice place for a quiet lunch or romantic dinner."}
{"text":"Went: 12:00 pm Sun Apr 12 2015
Ordered: creamy shrimp dish and beef dish wrapped in pastry
Cost: incl. tax and tip $25-30
Comments: I am reviewing restaurants that I've been into in the last 3 months, but I'm forgetting the details. My apologies.
I've been to a lot of German restaurants and generally find it bland and the best and worse of all those experiences would be like 3.4 to 3.7 stars. The patrons here are definitely older and of European descent. The food was good, but not spectacular.
Bottom line: I might come back with a friend who likes German food, but would not return otherwise. This is 3.5 stars."}
{"text":"Came here for lunch on a Wednesday. Not busy at all. Food and service were great. The lady serving us was super friendly. 

I ordered the Wiener schnitzel and it was delicious! It came with broccoli and home fries. The schnitzel itself was super thin (in a good way), flavourful and crispy. 

This place gets busier on a Friday or weekend. I will be back!"}
{"text":"Had the Bleu Cheese NY Steak and it was great.  The service was very good.  I enjoyed the place."}
{"text":"I've never had such rude service in my life. We had come to have drinks on the patio, but the owner and server made us feel extremely unwelcome for not ordering food. We even overheard the owner talk about how he dislikes customers who only come for drinks. 

It's a shame. We were gonna come back to try the food but have decided to never step foot there again after the scheisse treatment we got

They told us they didn't allow JUST drinks on the patio because it was dinner time and we were taking up potential space for customers ordering dinner. BEST PART: The restaurant was empty.."}
{"text":"If you're looking for some authentic german grub, this is the place to be! I wouldn't have known \"Old Country Inn\" was a German restaurant if not for Yelp! 

I made a dinner reservation for five and thank goodness I did otherwise we'd be waiting awhile for a table. Our server had a thick German accent and I admit I had a hard time understanding her when she provided details on the menu..

Service was slow because our server seems to be the only person running the floor. This would be my only complaint & also the interior is very dark (probably to match the Old Inn ambience). 

We ordered the house platter for two to share and let me tell you this platter is large enough for four people to share. The schnitzels and sausages were very tasty and tender. The pork loins looked very dry but was juicy to the taste! All this protein is laden over a bed of potato mash and sauerkraut! 

Next time, the platter is all that I'm ordering because you'd be way too full to finish whatever else is ordered. I'm sad that I was too full to try out their apple strudel that seems to be a favorite.. 

A big thumbs up - ample parking in the back!"}
{"text":"Came here for lunch on a sleepy weekday. The interior is well-decorated (almost posh), but the food is not priced to match the fancy decorations (thank goodness!).

My boyfriend and I shared two items from their a la carte menu - the cabbage rolls and beef goulash. Each dish was under $12 and was the perfect amount of food for us. Loved the bread dumplings served with the goulash and their home fries are delicious pan fried potatoes. Loved both the cabbage rolls and beef goulash.

Would definitely come back!"}
{"text":"A rare treat for the wife and I as we managed to find a baby sitter crazy enough to watch our four kids :)

We wanted to do something different, as it is very easy to fall into the Pan-Asian Cycle in Markham -- (chinese, japanese, thai, hakka, indian, repeat) and this is very very different!
Opened 30 years ago (and not changing since) this is a very nice romantic location for a quiet meal. In fact there were a few first dates happening around us (the awkward conversation and body language give you folks away!) -- although i think our hostes thought wife and i were also on a first date :)

The decor is pure Kitsche with musical instrumetns and posters of a by-gone area attached to the walls. Wood paneled dividers endorned with (dusty) plastic ivys but large comfortable chairs and room enough between tables that it is intimate but private. (I do know one Mr. Ramsey would haev a hay day in the dining room) :)

They have a banquet hall as well as two smaller private dining rooms available for groups as well. 

For the menu, we started with  the Fried Camembert with jam and melon -- and the escargot.

We were warned the escargot would take some time to prepare -- but that was fine.

The deep fried camembert was wonderful -- served with hard biscuit and two slices of ripe cantaloupe. The hard fried crust was golden brown and the inside was soft and gooey -- 

The Escargot were serves broiled in garlic butter with parmesan cheese --  they were well done and tasty -- but i am used to them being on a mushroom cap and I missed the texture that provided. 

Overall we were very happy with the appetizers.

For our main we opted for the fabled \" House platter for 2\" which came with house potatoes, sauerkraut, schnitzel, pork loin, and two types pf sausage, with pots of hot mustard on the side. 

The potatoes were inconsistent -- from steaming hot to really cold -- and bland as well despite their beautiful color --  but the meats -- oh the heavenly meats.

Tender and juicy and cooked to perfection -- the schnitzel was crispy  on the outside and warm and juicy - -the loins were tender and melt in your mouth and the sausages were just  drool worthy...  so amazing.

the sauerkraut had a snap and a bite that perfectly complemented the food and topped off the meal.

We were so full at this point that we skipped dessert --- but they have some awesome looking \"adult only \" desserts infused with alchol -- -as well as the standard cakes and cheesecake offerings. 

I do not drink so did not look at their provided wine list, but it appeared to be extensive (my wife got the house Rose and said it was \"good\"

Overall -- a great place to go for a quiet evening out with a date -- or with family and friends for a great night out.

Our total experience was about 120 minutes from check in to exit,  and we left smiling and happy.

Our bill including drinks (no free refills on soda and it is a small glass!) was $88 plus a tip for an average of $50 per person -- but we will return -- possibly with the youngsters  --

They do have two \"vegetarian\" items as well as a number of seafood and chicken dishes for those that do not enjoy vast quantities of pork. :)"}
{"text":"Excellent food and service, my husband's family is Austrian and they approve too. Decor is a bit dated but who cares!"}
{"text":"You always feel at home (especially if you're German/Austrian) in this homey restaurant with their great selection of beers, generous portion of schnitzel and friendly service.  I'd recommend the schnitzel and the gem salad.  The house riesling wine is quite decent.  Groups are definitely welcome.  If I were a diehard carnivore, I'd give it 4 stars."}
{"text":"Love the decor and atmosphere... very nice, cozy, and like a real country inn restaurant! And the menu is certainly unique... it's the only German/ Austrian restaurant I've come across in Markham.
However, the food is pricy for the quality. I found the dumplings and schnitzel a tad dry, and soft drinks are quite expensive considering the fact that they don't offer refills. As another review said, they are very skimpy on the condiments.
The breaded mushrooms were delicious though, and the staff was very friendly-- the service was great and the food arrived quickly.  If you haven't been here before, it's worth a visit, if not just for the experience, but I definitely wouldn't call this one of my favourite restaurants."}
{"text":"i love it when everything out of the kitchen looks super appetizing as goes by! you can order KRAINER (smoked sausages) or BRATWURST (pan fried sausages), or, you can have the best of both worlds and get one of each. both are super juicy, good texture, and a nice snap from the casing. served with mustard, \"home fries\" (boiled, seasoned potatoes - not fried), and sauerkraut. remarkably tasty.

the CABBAGE ROLL is stuffed with ground pork and what looked like rice, and served with tomato sauce. there wasn't any particularly discernable flavours but altogether was nice and homey. served with the same \"home fries\" as above.

quaint, calm, and rather popular with locals after sunday service. the different sections of the restaurant can easily accommodate large groups. it'd be a nice location for a special event, i think."}
{"text":"Yo lemme say firstly I love em Germans. Ima snatch me a blue eyes german Blondie soon after bulking season. Also fifa. Schweinsteiger. GOAT

Now for this. The place itself and the staff. Legit. The old white dude that greeted us and gave us tables.  Dude needed an Oscar for how nice he was. That short cute white waitress that kept eyeing me. Oh mia MA, just might be using a tank of gas to see her again. That mixed with them flatbread cracker things I devoured (she brought us more bless her soul),  good opening. 

Errthing was good but then when the food came. Errrr.. Maybe it was just me and schnitzel but it was just bland. I seen some kitchen nightmares in my time and presentation was groce for a 20$ plate. My friend with me ordered the some mushroom type soup schnitzel and I got Parmesan. His looked worse than mine but tasted better. I axed for extra sauce because they breaded my veal but the breading had no taste.. And the extra sauce was literally like pasta sauce lol. Was not a fan and my friend didn't even end up finishing his. 

This was my first time trying German and schnitzel so don't be taking my review out of order as this place sucks cuz I ain't good with this typa food maybe 

The fries was good doe lol"}
{"text":"To look at Old Country Inn from the outside it's possible, that like me, you might judge it. The historic home that has been transformed to accommodate this Unionville Main St legend looks ornate, old, and perhaps not really your bag. I would strongly implore you to look past the fancy facade and venture to the side of the restaurant where its main entrance lives. There you'll find yourself in a little part of historic Markham (initially settled by Germans) in the heart of Main st. 

The lunch crowd is a touch older BUT clearly wisdom comes with age and these folks know something that we younger cats don't because today this spot was bustling. From the petite, picturesque garden patio that wraps around the face of the restaurant, to the traditional Bavarian inspired interior, there are times where I lost myself and felt as if I was in a traditional German Bierstube (beer hall) with an elegant restaurant twist. 

The authentic design is only heightened by the authentic German and Austrian beer selection. I especially liked it when my server Roula referred to my choice in beers (Hacker-Pschorr) as a Good. German. Beer. She was right. Amazing!

The lunch menu is larger than most restaurants dinner menus and I had a tough time deciding. Thankfully Yelp reviews aided my decision and I ordered the Wiener schnitzel (a la carte) served with home fry style potatoes (not deep fried) and veggies covered in a cheese sauce. Un-Funkin believable. It was PERFECT with only a squeeze of lemon on it. And only $11.50 for the meal. Wow.

Honorable mention also goes to the free appetizer salad that comes with your meal it's an excellent size and has a fantastic light dressing on it (a slightly sweet vinaigrette). 

Overall my experience was exemplary and I can see myself coming in for some German home cooking more often in the future. Next step, bratwurst and potato salad!

Eatcrest Out!

PS - Huge parking for patrons around back and for those yelper partiers they have a massive party room for up to 70 towards the rear - can anyone say Oktoberfest celebrations :)"}
{"text":"Came here for Mothers Day dinner. The portions of the food was great, unfortunately, the wien schnitzel I ate lacked flavour and required salt and pepper on top. The plate combo my parents ordered was delicious, especially the wvurst."}
{"text":"Enjoyed a Ruben with fries on the patio with family for lunch. Service was friendly and the owner even managed to chat a bit. The sandwich was good and the portions were fine. The Old Country Inn is definitely classic Unionville Main St. fare. Would definitely suggest dining on the patio when the weather permits."}
{"text":"I came here for dinner with family. What caught my eye was the affordable pricing on the menu, as well as excellent service from whom I presume is the owner. Food wise though, I thought the restaurant was fairly mediocre. We ordered a sausage as an appetizer, which tasted like a specialty hot dog that I could have bought at a grocery store, unfortunately. I also tried the variety of schnitzels that my family ordered which were yummy but not quite extraordinary and portions do run a little small in my opinion. Overall this is a good restaurant, but not great. Service is excellent though."}
{"text":"I wasn't sure what to expect but absolutely loved it. Easy 4.5 stars, maybe 5 stars! Here's the scoop:

- amazing service - they explain everything
- Great German & Austrian beer selection
- For starters, had Goulash soup and Austrian salad plate - amazing
- Main course was the House Platter for two. You get a giant platter to share with chicken schnitzel, two kinds of homemade sausage and Pork. They give you big portions of home fries and sauerkraut for a side dish. Everything was so good and a nice change from standard restaurants.
- Apple strudel for desert - incredible.

The restaurant is very large and unique looking. Very \"old school\" in style. Prices are good for what you get.

I can't recommend this place enough - I will be back for sure.

Warning - this is not a low fat meal...."}
{"text":"Just came for a lunch with a few friends. Some of the waitresses were rude when we entered. The food was good and tasted authentic according to my Austrian friend. But it took a long time for the main dishes to come out, although it wasn't busy. 

Our server was ok. The food made up for today. The decor was classy and gave a homey feel. 

Will be back for the food, goulash soup and schnitzel is a must."}
{"text":"Worst experience ever. The manager gave our table to another party of people because them were friend of the chef. Unbelievable! Worst service ever I experienced."}
{"text":"I really really like this place. I came here on yelp's recommendation as I had a huge, random craving for schnitzel. This place is surprisingly huge and so old-school atmospheric. Located inside a former doctor's mansion in Unionville, it really was perfect for a double date night.

I came here specifically for the classic weiner schnitzel, and the huge, thin, lightly-breaded thing was incredible. It was so juicy and tender. The fried, seasoned potatoes and steamed broccoli with sauce complemented it perfectly. The hubs had a version with cheese and mushroom folded in the middle of his schnitzel. That was a great update as well. We had their 5-game pate on their seasonal games menu as appetizer. The salty, slightly chunky pate with thin crisps, melon and a sweet cranberry sauce is really something that you need to try.

The service was great, and there's also free parking in the back."}
{"text":"Great food, absolutely delicious, but, incompetent staff and even worse management.  We waited one hour for our food because our winner of a waitress and kitchen had a mixup which resulted in the delay.  She came by our table numerous times and noticed we weren't eating and when I asked what the issue was she said it was being prepared(which was a lie), they were busy, etc.  15 minutes after I ask again and this time she actually decides to investigate.  Turns out our food wasn't even input.  Finally the food arrives and it's great but that idiot server ruined a special occasion because of her laziness and incompetence.  What did management do? Nothing!  I should have walked out.

&$@$ this place."}
{"text":"long wait for bland food and mediocre service. they also rearranged a set of tables far too close to mine so everything was awkward to maneuver"}
{"text":"I've been going to this place for over 15 years. People are friendly and warm and make you feel welcomed. The decor / interior looks dated, but to me this is a part of the charm of this place. 

Now, the food - really good schnitzels and similar to what we'd had in Vienna; because there are several versions, plain or stuffed, with or without anchovy, everyone I'd gone with was always able to find something to his/her liking. 

Oh, they have the famous Viennese chocolate cake (Sacher Torte) on the menu. I didn't know its history until I visited Vienna. It is said that only two places - Hotel Sacher and Café Demel, both in Vienna - have the \"original\" recipe and everyone else is just imitation. Must try it again in Old Country Inn and give you a report of how theirs compare to the \"original\"."}
{"text":"The food always gets me coming back for more, but the service is something that really lacks for me.

I have been frequenting this restaurant for a couple of years now, and whenever I have a hankering for some Austrian food I never fail to get a friend or two to come with me to have some delicious wiener schnitzel. To compliment the heaviness of the meaty main, I also get the gem salad, which is a medley of pickled cucumbers, carrots and beets, some potato salad, and ham & cheese on some lettuce.

In terms of the ambiance, the place is usually quietly filled with an older crowd, but can get lively when there are large parties around. With that being said though: beware! Even when the place is not filled, the service is slow at best, and sometimes the wait-staff can be a little inattentive. So if you're not in a hurry during the lunch/dinner rush, I do recommend coming here for your meal!

Bonus: If you ever have time to just walk around Main St. Unionville in the summer time and need a place to sit, Old Country Inn opens up its sidewalk patio, and is a nice place to people watch on a sunny day!"}
{"text":"Wiener Rostbraten (10oz New York Centre cut) $18.95
Medium rare

Was perfect, done to perfection

Couldn't have asked for a better dish.
Would recommend this place in a heart beat.

Please do give this place a try if you happen to be in the Unionville area.."}
{"text":"Schnitzel with homemade fries was a good choice. We also ordered turkey salad which was OK. However, It took them so long to bring our order but I don't hqve any complaints since we enjoyed the weather and view. Totally, the place is nice and the servant is polite."}
{"text":"I just changed the restaurant \"type\" to German.  I went here based on the number of Yelp reviews and the fact it said \"Canadian (new)\" for restaurant type.  I was intrigued enough to take some friends here.  

The good news is that we discovered a quaint little area of GTA with a bunch of restaurants, pubs and shops.  The bad news is that when we come back, we won't be heading back to Old Country Inn.  

It's not that it was bad - the food was ok, but nothing special to come back for.  I had the gazpacho soup (which is seasonal, don't expect it all of the time), which was better than my entree - but again nothing to write home about.  My friends had potato soup to start.

For main course, we each tried a different schnitzel.  I had the Schweizer Schnitzel (think chicken cordon bleu) which is served over a mess of potatoes and steamed brocolli with a cheese sauce (just like the menu describes it).  Again, it is not that it was BAD, it just was \"ehhh\" (like the 2 stars I am giving the place).

Service was middling - inattentive and unfriendly.  Plus she never filled my water glass.

The decor is just what it looks like outside - an old house.  Not quite romantic enough for a dinner with your sweetie, and not posh enough for a business dinner.  If you're grandparents come to town, this would be a nice place to take them,  In fact, there were quite a few diners when we walked in at 7:30pm on a Thursday night, but by the time we left at 9, we were the only people."}
{"text":"Original Hungarian food. Schnitzel is amazing and also the mushroom soup. The place has a unique historical atmosphere and it's worth to see the many pictures that represent life as it was 200 years ago. You MUST enjoy the delicious Apple Strudel! Amazing."}
{"text":"Old Country Inn is a Viennese restaurant housed in a 140-year-old house located on Main Street Unionville.  This restaurant showed up as one of many restaurants on Main Street Unionville and I had always been curious about it since their ratings were quite solid.

We arrived at 7 p.m. and chose to sit inside.  Although their patio was really nice and the weather was nice, I knew that once our food arrived in the evening, it would be cold and less comfortable to sit outside.

Their dining room was in a very classic and traditional style.  Our server for the night was very friendly.

The Hering in Rahm was a soused herring served with a sour cream apple salad.  The last time I had had had fish served like this was at Aragvi, a Georgian restaurant, which I had had with fondness.  I enjoyed this Hering in Rahm dish too.  The soused herring means that it is a cold dish where raw herring is soaked in a mild preserving liquid -- it can be raw herring in a mild vinegar pickle or Dutch brined herring.  The vinegar was indeed strong but the fish was very smooth and firm.  T thought the pickling was too strong for her though.  I enjoyed the sour cream apple salad too!

The Gem Salad was a mixed salad plate with cucumber salad, potato salad, carrot salad, pickled beets, ham and cheese.  Essentially, it was a platter of a mixture of different salads which was a neat concept.  All of the salads were fresh and tasted good.  I especially liked the smooth cheese.  As T said, it tasted like Swiss cheese except that it didn't have the characteristic holes of Swiss cheese.

All of their schnitzel dishes had vegetables served with white wine sauce.  The Tiroler Schnitzel was a breaded cutlet with mushroom and cheese filling, served with home fries and vegetables.  Instead of their home fries though, I wanted to try their spätzle pasta.  Thus, we paid an extra to have the the home fries substituted for the spätzle in order to try it.

The spätzle was decent but I thought that it could have been more flavourful.  The vegetables in white wine sauce were moderate -- I couldn't really detect the white wine sauce.

The Tiroler Schnitzel was huge!  It was nicely breaded and a little crispy (but not crispy enough for my taste) and had mushroom and cheese filling.  At the time of eating it, I thought it was also quite bland in flavour.  It wasn't seasoned much at all.  Perhaps this is how authentic German food is?  (I have had German food before in Germany and it wasn't as bland as this but T said this was similar to the German food she had had before too.)

We didn't finish everything so I took home the rest of my schnitzel and the Gem Salad.  When I ate the Tiroler Schnitzel the next day at home, I thought it tasted much better.  Why is it that leftovers taste better than when the food is freshly made?

Anyway, I'm glad that we tried out Old Country Inn.  Despite not having the most satisfactory tasting dishes, I thought it was still a decent Viennese food experience.  I wouldn't mind returning again to try more of their other dishes -- their menu is quite extensive!

(They have a parking lot in the back of the restaurant!  I wish I remembered seeing this fact before I decided to park at another lot on Main Street Unionville.)"}
{"text":"Walking into this restaurant always feel like you are out of town, with a quiet sensation as if you were at St Jacobs, or Waterloo, it feels so cosy. I've always order the Gluhwein, a hot red wine with a cinnamon stick. Almost take like a warm sangria. Perfect for a cold snowy night. I drank two order myself tonight. 

Holstein Schnitzel
Breaded Cutlet served with Fried Egg, Anchovies, Home Fries and Vegetables $18.50

Usually I am very picky with fried food. At this venue, they don't use old oil to fry and they pound their meat. It's a thin cut of meat that doesn't taste too greasy.

Sole Filet à la Maison
Lightly Fried in Butter to Perfection, served with Rice and Vegetables

$17.95

The fish tasted good in a sense it was only lightly fried to golden and no batter. The side broccoli can use more flavour. Overall the fish was nicely done. 

Currently, they just started serving the Game season menu such as Bison, wild boar, Venison, Rabbit, and Fresh Pumpkin Soup, and pumpkin cake."}
{"text":"Good delicious food - can definitely come back to try other things. The house platter for 2, as mentioned in other reviews, can probably feed 3 or 4 people.

That slow service though...

Prepare to wait and test your patience."}
{"text":"Came here before for christmas and waffles and it is a really nice german restaurant. Once a house, this restaurant is very large with many rooms and a patio. They bring the outside in with vines and greenery among the ceilings and open french doors. My friend and I shared the classic schnitzel and a sacher torte for a weekday lunch because reviews here said they were good.

First, a basket of rye bread and butter came- nothing special, a little dry if anything. The schnitzel is a large piece of white meat and is very crispy. Even better with a squirt of the lemon wedge. Also on the plate, is some boiled and buttered broccoli and some cubed potatoes.
I was fairly disappointed in the chocolate cake. It's a very moist sweet spongecake with whipped cream on the side. The top is like a thin slightly melted chocolate bar. Neither decadent nor light and fluffy.

Came to about $20. The waitress is very prompt and present. Just when we finish the meal, she brings the dessert, and at our last bite of cake she brings the bill.

I say the atmosphere wins over the food. Food gets an average 3/5, atmosphere gets a cozy 4/5."}
{"text":"I've been coming here with my family since I was born. The food is always good and the wait staff and owner are extremely friendly. I adore the potato soup, even if it is a bit too slaty. The gulasch and gulasch soup are also both excellent. I usually go with the weiner schnitzel which comes with home fries (ok) and broccoli with a cheese sauce. I've never left here disappointed."}
{"text":"This was the first German/ Vienna restaurant I have been to. There was quit a few dishes I wanted to taste; however, I choose to eat the Schnitzel. The dish comes with a standard vegtable which I swapped out for sauerkraut.

The dish was delicious and the sauerkraut was good too. I did find the portion lacking as I was still hungrey afterwards.

The most surprising dish was the red cabbage. My mother who was born and lived in Germany has always  prepared red cabbage like sauerkraut (sour). I was happy to discover that the dish is traditional made sweet and sour which is delicious!"}
{"text":"After visiting Main Street Unionville for the Christmas parade, I was extremely excited to dine at Old Country Inn for the first time! As soon as we wandered into the restaurant, its historic past could immediately be felt - the decor was festive and beautiful and the servers were nice. However, service was a little slow :( 

For the appetizer, my family shared the escargots which were seasoned well but for the price, was underwhelming. However, the price for the schnitzels and the spatzel pasta was decent! The spatzel pasta was delicious with the sauce being aromatic and thick. However, the most disappointing aspect of the entire night was the schnitzels. Although they had large portions, the schnitzels were not very crispy or flavorful. The sides accompanying the dish were well-paired with the schnitzels but regardless, I would have enjoyed a crispier and more seasoned schnitzel by itself. Overall, the experience was still pleasant and I would rate it a 3.5 :)"}
{"text":"Goulash entree was not terribly tasty, quite bland. Dumplings were alright. Weiner schnitzel fried up very nicely, but also bland. Home fries were pretty boring. I guess it's good for older folks though. Old quaint environment."}
{"text":"I've been coming to the Old Country Inn for as long as I have lived in Markham!  The food is delicious and the most authentic I've been able to find in the GTA. The service is always exceptional, even when the restaurant is busy! I often order the schnitzel but switch up my sides. The sauce that comes with the vegetables is delicious. I must say though, the vegetables are often a little bit on the underdone side, so if you don't like them to be crunchy, definitely ask for them to be cooked a little bit longer. The red cabbage is amazing though! If you have room for dessert, the apricot crepes are out of this world!!!"}
{"text":"My family and I had a lovely Christmas dinner at Old Country Inn Restaurant. Even though the restaurant has been located at Unionville Main Street for quite a while, we haven't visited until now - glad we did! Service was lovely. Our server was very friendly and cheery the entire night. I'd recommend this place for family gatherings.

* STEAK INNSBRUCK (4/5)
Very tender and juicy! Loved the gravy for our steak. It's a big portion. We ordered 3 of these to share amongst 9 people. It came with veggies on the side.

* PORK HOCK (3.5/5)
The pork hock was delicious. I was surprised at how well this was marinated because the \"grilled\", \"non-saucy\" pork hocks are fairly dry in taste. This pork hock was flavourful and the sauerkraut as side dish was a good pairing for the switch of taste buds.

DESSERTS:
* APPLE STRUDEL (5/5)
The apple strudel came nice and hot :) The crust was crunchy and the apple sauce in the middle (with real apples) were delicious. The apple filling was a mix of sweet and sour."}
{"text":"The Old Country Inn is a 140 year old house located on Main Street, Unionville.  The restaurant has been in business for 35 years and is the only restaurant in Markham offering German/Austrian cuisine.

We ordered the following :

Gulasch Suppe (Goulash Soup) $6.95 - a thick soup which has potato, tomato, beef chunks

Steak Innsbruck $24.95 - Served with Sauteed Mushrooms, Bacon, Home Fries, and Vegetables   

Franz Josef Schnitzel $18.95 - Breaded Cutlet with Cheese Filling, Served with Home Fries, and Vegetables 

Note : Home Fries can always be substituted for spatzles which is a type of egg noodle found in german/austrian cuisine

While the food took a while to come, it was overall fantastic.  This place is known for its excellent schnitzels (which is breaded boneless chicken/pork/beef, etc).  Great romantic atmosphere, excellent service, nice decor.  They also give out a free rose, or cupcake, etc after the meal.  The waitress who served us has been working there for 32 years!"}
{"text":"Read the review Mel C. wrote and it was very helpful.

It was a very nice day so had the meal outdoors. Waitress brought out some bread to start off. To my surprise there was no butter. I thought to myself, \"maybe this is a German thing?\" - so I ate the bread without butter. After finishing the bread there were other customers seated across from us and when the bread arrived at their table it came with butter. So its not a German thing after all :)

Wiener schnitzel $11.95 - comes with a side salad (recommend the blue cheese dressing). The schnitzel itself was nice and thin and had a nice crispy layer of batter. I thought this dish could have used a sauce for the schnitzel like a gravy or something similar. It also comes with broccoli and home fries (3 stars).

Roast turkey salad $9.95 -  the turkey meat was chopped into small chunks and was mixed with a creamy dressing and some raisins. There was also fresh cantaloup, cucumbers and lettuce. Overall a pretty good healthy and light dish (3 stars).

I thought the dessert stole the show. Thank you Mel C. for recommending. 

Sacher torte $7 - rich, moist and filled with chocolate flavor. I loved it (5 stars)."}
{"text":"Decided to visit Old Country Inn for dinner last week.... Made a reservation and was glad we did as the place filled up fast and everyone appeared to have had made reservations.

We were seated in the back portion of the restaurant.. nothing special. The front portion of the restaurant contains the best seating as it is in general a nicer dining room as well as lit much better.

We each ordered the mushroom soup to start...this was delicious.  It tasted home-made and we remarked we would return if even just for this!  There is an abundant supply of fresh bread brought to the table...which was nice as we were starving...and service was unfortunately really slow.  

For our mains I ordered the schnitzel with mushroom and cheese filling - this was a large portion of schnitzel as well as potatoes and some broccoli with hollandaise sauce.   The schnitzel was just ok.  The 'stuffing' was hard to find and the batter felt a bit over fried.  The potatoes were very tasty.  The hollandaise sauce was too thick.

My husband ordered the same dish as me but opted for the chicken option.  He shared my sentiment regarding his order.

Our server was nice; very pleasant....its just that service was way too slow.  To get our drinks took ages and then the timeframe in between appetizers and mains was far too long.

It was an ok experience.  I wouldn't return as I felt the food to be bland, ( aside from the starter soup!)."}
{"text":"I've been here twice now, both time for birthday celebrations and both time witnessed other birthday celebrations going on, so this seems to be a popular choice for birthdays. The restaurant itself has multiple rooms so can fit groups just fine. It is a bit slow both times though so don't be surprised if it takes awhile for your order to be taken, food to come, etc. 

The first time I came here, I ordered the steak and enjoyed it. It's not a steakhouse by any means but they do steak just fine. The meat was flavourful and it was cooked just right. The second time I came here, I tried game meat. That's when I learned I really don't like game meat. It has this distinct smell that's just not my thing. I had the bison and it was cooked well. The red cabbage slaw that it came with is so CRAZY GOOD that they should sell that canned so I can eat it every day. I seriously love that slaw no joke. They also serve a great bread basket and it was placed right in front of me so I just nibbled away until the basket of carbs disappeared. I also recommend trying one of their German beers. I asked the server for a recommendation and while I can't recall the name of the brew (I blame the alcohol), it paired with the food really well. I'm looking forward to trying something new again next time!"}
{"text":"I came back a second time and the experience is fantastic!  The waitress was a bit on the slow side but the food was great and the prices are amazing as well.  

We order the house platter for 2 but it could have probably fed 4 people.  We also asked the resturant to reserve a pork hock for us and it was very tender.  Still can't eat the skin though..."}
{"text":"This really is a fantastic place!  The name does say a lot but not all.   

Old?  Yes!  In a very charming way
Country?  Most definitely!  That classic farmhouse feel is everywhere.
Inn?  I have no idea. 

This was our second visit and we were there for a birthday dinner. The hungry eleven of us were seated in the more private dining room at the front of the Inn. As you walk in, you will notice what living in Unionville was like maybe 50 or more years ago. 
 
Pictures on the wall show historical Unionville shots. And the creaky floors and warmth with a hint of drafts really makes you feel like you are going back in time. 

What the name does not tell you is that the food is basically German/Austrian fare and it is done very well. There is a little bit of fusion going on but overall it is a very European menu. You can get, sausages, pickled herring, traditional soups like goulash and mushroom, and even escargot for appetizers. 

I had a smoked trout appetizer which was delicious and my wife had a mushroom soup that disappeared very quickly. 

Mains show lots of schnitzel options as well as roast pork, beef and fish dishes to choose from. 

For our main, three of us at the end of the table had the platter for three which includes three schnitzels, three roast ham pieces (all full size) and sausages with sauerkraut and potatoes. We did not finish but what we did we really enjoyed. While the ham was good I have never been crazy about it and somehow it feels like an unexciting and cheap filler.  The schnitzels were delicate and just broke apart in your mouth. Perfect. 

My wife enjoyed a schnitzel stuffed with mushrooms and cheese and said it was great. I did not try due to the cheese.  

They have a full bar, and wonderful desserts but we were all so full that only one chocolate cake and one apple strudel were ordered. 

The beer is great. The service is very very good and you do feel treated like a noble countryman. Perhaps this was a Sunday dinner place in the past and people came here once a week after working hard long hours all of the other days!  Regardless, you do feel really good eating here and it just all works well together. 

The price is mid to high but it is well worth it. The family and I will be back for sure!"}
{"text":"Old Country Inn is a staple in my family.  Every year for my Brother-in-law's birthday, we take a trip away from the city, to the quaint town of Unionville.

Every year we order the same thing.  The Schnitzel.  Where we disagree is what type of schnitzel we want.  Do you want to cheese and ham?  Do you plain?  Do you want one of the many other options available?

Every year I tell myself there is more to the menu.  Old Country Inn offers more than just Schnitzel, but - really - that's what they do best.  And, I didn't come all the way out of the city for a sausage.  Although, I have no doubt that the sausage is equally fantastic.

They have a couple of decent beers on tap, and while it isn't the most inexpensive of locations, for the quality of service, food, and location, it seems undervalued.

Of all the reasons to jump on a subway, then a subway, then another subway, then a bus, then a final bus, this is one of the best!"}
{"text":"Good restaurant, good food, great staff and in a good location. I had a Jager Schnitzel and I recommend it. It's slightly pricey and their service is a bit slow which did not bother me at all because I was not in a rush."}
{"text":"\"Just like my mom used to make\" my friend kept exclaiming. 
Schnitzel 
Baby beef liver with mushrooms
Palaschinkie - crepes with apricot jam
Apple fritters

We would come back here again from Mississauga for this taste of family cooking. 

Service was prompt and friendly."}
{"text":"My boyfriend and I came here for lunch on Friday. We were greeted right away and there was no wait for a table.

It took us a while to decide on what we want but we finally settled on fried Camembert cheese with fresh melon ($9.95) for our appetizer, he ordered the schnitzel fingers with french fries ($9.95), I got the wiener schnitzel with home fries and vegetables with cheese sauce ($11.95) and we split a Sacher torte ($5.25) for dessert.

The fried Camembert went deliciously well with the accompanying jam. I personally prefer the cheese to be more melted. Overall, it was a good dish and we finished it quickly.

I think my boyfriend enjoyed the schnitzel fingers because he finished it quickly. My dish was also good. The home fries are prepared differently from other restaurants; it's not the deep fried home fries you usually think of. The vegetables with cheese was not the best though. My meal came with a house salad and I chose balsamic vinegar as my dressing. It tasted very odd and almost like a Japanese salad dressing. I would recommend that you get another salad dressing if you do order the salad.

The Sacher torte was the star of the show. I've never had a chocolate cake quite like this one. It's very stiff, not too sweet and goes perfectly with the whipped cream. This is definitely a perfect dessert to share."}
{"text":"Went here for a taste of the homeland last night. 

A very cozy restaurant with friendly staff to greet you.
The only complaint I have it the lighting situation - it's a little too dark.  Although the tables have tealights to make a little more 'romantic', I had a hard time reading the menu.

The service was excellent and the meals came fast.  The manager even came up to make sure everything was okie.

The food was really good.  I had the goulash which is my favourite.  It came with a more creamy sauce and sauerkraut. 
The dumplings were a little dry.
My friends basically all had schnitzel.  The portions were generous and it came with homefries and veggies.  They all enjoyed it. 
Beer and wine selection were decent - and reasonable priced.  International german beer was $5.75

THE BEST part was their home made apple studel! SOOO good. 
Save some room for dessert if you ever go to this place.

2 main course, a beer, soda, and a shared dessert came to $50.
Definetely worth the trip back! 

Cute thing is - if you are younger - you will be the youngest person in the place! :P  The crowd is for the retired folk! :P 

Guten appetite!"}
{"text":"We came here a few years ago and was in Unionville so stopped in again. Was nicely greeted when we came in by owner and the server was very nice. Interesting decor to look at (I love the antiques on the wall). The server helped me by recommending a beer (don't know all the German beer). Good choice because it was nice. 
I ordered the Jäger Schnitzel (mushroom bacon sauce with dumplings) and my wife ordered the baby beef liver. She asked to substitute the home fries for mashed potatoes and it was no problem. A bread basket was given while waiting (3 kind of bread). We waited a bit for the food but not too long. My schnitzel was delicious, especially with the sauce. My wife had no complaints about her liver (I don't like liver so I can't say if it was good or not). We browsed the desert menu which looked delicious but we were a bit full.
The price was reasonable. When we left there were more friendly \"thank you\" and \"have a nice evening \" from the staff. Will probably go again when I'm in unionville."}
{"text":"This place always has great service.   We've been here multiple times and each time had a different server but guess what - the service has always been fantastic!  Oh yes, the food is pretty awesome too :-)

The cabbage rolls are great but the schnitzel's are awesome.   The ambience I must say is very purposely old fashioned and it comes across very nicely, creating a great ambience for family and close friends to gather for a nice meal.   Will continue to come back..."}
{"text":"Went for a wedding. They tried their best but it just seemed to be lacking in several departments. I'll chalk it up to the large crowd we had. the steak was good but the salad was very wet. They were very skimpy on the continents and we had to ask for a fork several times before getting one. As I said, it was a large crowd so I can't overly knock it for its faults and overall I still had a good time (mostly again from the wedding.)"}
{"text":"Its has a unique menu and the best location.  Awesome schnitzel.  Perfect dining experience"}
{"text":"German/Austrian comfort food, in a restaurant with menus and decor possibly frozen in time. The atmosphere is quaint with lots of flowers and greenery surrounding the restaurant building, and if you're looking for a casual, tableclothed dining experience, come here! Our server was generously polite with Thank Yous and we loved that. We never get \"service\" service in the city these days (for the drama-llama anecdote, please read my review of Firefly restaurant). 

We had lunch in the front room and really enjoyed examining the stained glass windows and framed historic photos of Unionville. We ordered sauerbraten and cabbage rolls. The sauerbraten is a slowcooked roast marinated in a winesauce with redcabbage, cinnamon, raisins, parsley, and homemade dumplings. The cabbage rolls were stuffed with pork and rice, covered in a tomato sauce with a side of homefries and sourcream.

The meals were perfectly satisfying for a famished late lunch, and really hit the spot in terms of comfort food that tasted homecooked and unprocessed.

Didn't have room for dessert, but we eyed the apple fritters, and had a good chuckle at seeing peach melba and banana split on the menu........perhaps to entice the children after they dine on the children's menu. Because we definitely couldn't have eaten another bite to fill us."}
{"text":"Definitely try the chicken schnitzel here! You won't be disappointed. Great ambience and perfect place to hang out with a bunch of beer loving friends. 
You sort of do feel like you're in Germany."}
{"text":"Lunch Specials Review 4.5 stars

I never expect Old Country Inn Restaurant to be that good!! All these time I been looking for good schnitzels in Toronto and all these time, it is Markham!

Nice and homey decor, really old country stylish! Even the waitress has this old time charm, sweet and caring! Giving us really good advice of what to order and how many items to order!

The follwoing were what we ordered to share with 4 of us:

Starters: 
Gulasch Soup ($2.95) 
Potato Soup ($2.95)
Smoked Trout ($10.05)
Chicken Waldorf ($9.95)

Mains:
Weiner Schnitzels ($11.95)
Two Bratwurst Wurste ($12.95)

Desserts:
Apple Strudel with ice cream ($6.35) 
Chocolate Cake ($6.95)

They were all really good!! Especially the Schnitzel so tender and the batter is really light and golden brown.

Must order the Apple Strudel... made in house though with raisins is one of the best one I ever had. 

Lunch menu is a little cheaper than the dinner menu, strongly suggest to come for a leisure lunch."}
{"text":"I like that this is not a franchise/chain restaurant and they have a hundred year old wine press from Austria, so that earns them 1 star right off the bat. I have been to this restaurant a few times and it is nice, if a bit dated. On our most recent visit I had the Szegediner Gulasch which was just ok. I tasted the schnitzel that my husband had and it was very good. My brother enjoyed the baby beef liver but described the red cabbage side as tasting like 'imam?n abdest suyu' which roughly translates into 'the water the Imam uses for his ablutions\" meaning having all the flavour of room-temperature water. Gotta love the Turkish language. My mother's red cabbage, on the other hand, was somewhat sweet but she thought that it worked. The service was very attentive and pleasant and patient so I have to also give them a lot of credit for that. The decor could use an update but it is clean and cozy."}
{"text":"The schnitzel was really good! The service wasn't that great. Location! Location! Location!"}
{"text":"My friend and I came for lunch on a Sunday. The hostess/server that greeted us asked if we had a reservation and we told her that we did not. She was very frazzled and a customer walked by to ask her something so she got turned around when her attention was back on us. She asked us again if we had reservations and we told her no. We were starting to wondering if we should look for somewhere else to eat. The restaurant didn't seem busy but who knows.

She finally got a couple of menus and led us to a table. The restaurant is quaint and we sat by a window with lots of light streaming in. It wasn't too long after we sat down that we had placed our order. The waitress that served our table seemed to be the only one on our side of the restaurant. My friend's salad came out fairly quick and we were given complimentary bread. 

A very long time had passed and we were still waiting for our meals. The table that had sat down after we did was almost done their meal. We asked the waitress and she said that our meals would be right out. Let me tell you that it took a very long time! The schnitzel was good but the service that we had received up until that point left us not exactly happy."}
