{"text":"Old Whedon Grille is a good place to have lunch or dinner in Downtown Hudson. The space is pretty small, but it's cozy, which is always nice when the weather gets colder, especially for a neighborhood hangout. The main dining area is tiny, as is the bar, but there is a decent sized patio and a private dining area upstairs. Also, there is a basement with a couple of archaic video games and an old pool table. The area is cool in its own way. The staff is overall very friendly. Now for the food. I used to hate the food here. It used to taste awful. But recently I decided to give the place another try and left impressed. I stopped in for lunch and had a steak caesar wrap and enjoyed it. The dressing was great and even had a little kick to it. There was also steak, lettuce, and asiago cheese, which stood out to me because I'm used to parmesan in caesar salads. It tasted great. Overall, if you're looking for a place to eat in Hudson, consider heading over to the Old Whedon Grille. You'll get good food and a good atmosphere."}
{"text":"This place is awful! The menu is has a strange combination of foods, the service is terrible, the food is terrible. It's an old restaurant in a lovely historic building but the inside seems dirty. The silverware was dirty and he whole time I was sitting there eating I was a little creeped out by the cleanliness. I have been there once and will never go back. Gross"}
{"text":"PLEASE DO NOT GO TO THIS RESTERAUNT!
There are so many great places to eat in Hudson that you don't need to waste your time here. Owner is extremely rude.  Gave HERSELF an 18% gratuity on our check when it took her over and hour and 15 minutes to serve us our food and never refilled our drinks.  She said we had a \"large party\" which is why tip was included.  Our \"large party\" consisted of two moms and 5 children, all under 8 years TWO of which were under 4!  Are you kidding me?  When we questioned the tip after our poor service THE OWNER got really defensive, became extremely rude in front of the kids to the point where my friend left in tears. THIS is the kind of management running this place and explains why the service is very poor on a regular basis. Not worth it for \"just OK\" food. Not an establishment to give your money to.
Go to the Flip Side or Hudson's Grille.  WAY better all around."}
{"text":"all the comments in earlier reviews are spot on - owners/workers are rude and certainly don't have any customer service skills whatsoever.  Food is mediocre at best, draft beer is nasty (i don't think they ever clean out the lines), and the last time I was there (summer), the bathroom was in pretty bad condition.  They do draw a crowd of locals but for the life of me, I don't know why.  I only go here if I'm out with a group and the consensus is to go to OWG, but I usually do my best to steer us to another place in Hudson."}
{"text":"We only went here for drinks, so I can't judge the food very well. The inside did, however, smell strongly of sate sauce, which appeared to be good, so I'll give them the benefit of doubt. There is an okay selection of tap beers. I thought there were too many flat screens showing ESPN for my taste. The bar service was good looking and friendly, although my second Martini had some leftovers of a strawberry daquiry (for which apologies) and a strange white substance at the bottom. My friend thought there was something missing in his G&T. The artichoke dip wasn't bad  but a little too greasy for my taste. My friend informed me this place has the reputation of being a cougar bar on Fridays and Saturdays."}
{"text":"Terrible service.  Our party ended up having three different servers (we were only a party of six) because the first two backed out of serving us.  The first server threw menus on the table and asked what we wanted to drink.  We never saw her again.  The second server brought two of us our drinks (one of them was wrong) and then he left.  The third server was somewhat apologetic about the first two but still had an air of huffiness while serving us.  I wouldn't go back."}
{"text":"This is a most confounding place, fun historic location. Food is fine, fairly priced. BUT ....
Service is just awful, not rude, but just slow, agonizingly slow.

We have been there many times, friends have same experience. We even know server by first name. The managers are just inept!!

Friday we waited 15 mins for drinks, she NEVER checked on refills, don't owners care?

Owners seem determined to piss off everyone with their own stupidity, why, why why?

We leave everyone shaking our heads, trying to explain away what these owners are thinking...."}
