{"text":"Pretty great for some inexpensive tasty meals. The pasta was way over salted, but the meat was beautifully tender and delicious."}
{"text":"Great lunch! Different selections daily, fresh! Only thing is, only a little bar area for seating"}
{"text":"I have to try this place again. I came here with a lot of expectations, but I found the food to be sub par. The price was fab. I had the jerk chicken. My husband had the fried chicken, that was really good! Based on other reviews though, I have to give it another shot."}
{"text":"Nice lunch place that tastes like home cooked food (and is yummy). Very reasonable prices."}
{"text":"Went here for lunch and had the lemongrass chicken with steamed veggies and pasta salad. It was great! It was freshly made and good whole some food. You have the option to pick which every side you want and how ever many. The quantity depends on the size of box you buy, but you're not limited to a set amount like many other places. It has great service, very friendly staff. The place only has around 4 spots so not a sit down.

Moral: I would highly recommend for a cheap and quick lunch. Good quality and real food for a low price. I am planning on returning and trying the rest of their menu."}
{"text":"Super friendly staff! Really welcoming and they take the time to talk to you. The food is good although I would say the value is a little on the pricey side, the quality is there. 
But a very good affordable option for those in the area!"}
{"text":"My boy bleu! This place is not bad.  Had the spice beef, chicken cutlet, coleslaw, rice, and tuna salad pasta.  Good size portion! I like! Pasta was good, and I dont even like pasta salada lol. Beef was nice and tender though. Delicious! Chicken cutlet was meh. Coleslaw went well with the beef. All for just 9.75! Get to pick two meats and whatever sides you want to fill up your container. I work 600 meters away, so might be visiting this place again in the future. 1.2km round trip lets me get in my exercise before I yam that food down."}
{"text":"Awesome little place that serves great food.  Staff is really friendly and took the time to explain their menu items.  I've been here 2 days in a row so far, tried their pork (really tender and delicious) and their fried chicken (not dry, boneless and yummy).  Would definitely recommend for anyone on a tight budget that wants great food!"}
{"text":"Lovvveee the foood!!!!! 
Not too salty not too plain!
Also fried chicken was boneless too!! Soooo easy to eat!
Service was terrific!! The lady that works there is super nice !!
The tuna pasta salad was lacking flavor but still yummy ! 
The beef was so tender makes me  want more !!
 I recommend this place if you're around st michaels hospital ;)"}
{"text":"I come here for lunch almost everyday. The people who own and work at this cafe are awesome! Their friendly faces always cheer me up.

The small lunch box is my go-to order. They really fill it up full of healthy delicious food for less than $5. Where can you find that these days??

Tomato meatball is the best."}
{"text":"How are there only 2 reviews on this?

Having a hot daily special of porc de la provencal. Tender succulent pieces of pork (shoulder?) with fresh sides! Not sure if they have a veggie option

Two daily special every day. 

Also, having the option of small, medium to large portion is convenient!

They also have sandwich choices but have yet to try those!"}
{"text":"Great! Delicious food, cheap quick, cute little shop that's a great place to work, or chat with a friend! coffee on fleek!"}
{"text":"Looks like reviews are rather old and reflect this cafe under previous management.
Now this place is just a regular take out joint with slightly better food variety but rather regular food quality taste wise. Not a 4-5 star material for sure, rather shabby interior in dire need of renovation and a lack of seating not helping. (Only 3 seats inside)
In a nutshell - good not great.
I think over time the rating will come down as people realize it's no longer the same place as before."}
{"text":"Love the food! Especially for the price :) Chose the medium sized box and got a choice of one meat and unlimited choice in salads, all for only $8 (taxes included)! I was stuffed!!

The place doesn't look too fancy and there's very limited seating, but the food is fresh, full of flavour and the staff super friendly. I think I've found my new go-to lunch spot!"}
{"text":"Awesomee food w/ menu changing daily, found my lil heaven on earth. French trained chef offers an exciting twist to the usual palette"}
{"text":"I had the small lunch box for around $6.  Today's special was the chicken basque and I had that with the tuna salad and veggies instead of rice.  I didn't think the chicken would go with the tuna pasta but the reviews were so good for this salad I decided to try it and I was not disappointed.  The chicken was simply amazing.  Incredibly tender in a delicious sauce which would have gone well over rice.  The pasta was very tasty and the portion size of the entire meal (and price) were just right.  The servers were very friendly.  The only drawback is the limited counter seating (for 3 people max) so count on taking your food to go."}
