{"text":"I Love to try different wine and there's no better place in Glendale than the Old Town Glendale Wine and Beer bar.

I Love Washington Wine and its really very difficult to find it, as most of wine and beer bars are serving CA Wine. 

This has become my  preferred wine bar, it's the best place to hang out with some buddies!! The staff is really very pleasant. It's a good place for wine lover, I suggest to visit this place and take an advantage of the wide range of wine's.:)"}
{"text":"This place is wickedly awesome!  Friendly staff, interesting selection of wines and beers and the bruschetta is amazing!  It is as good (if not better than) Postino's without a two hour wait."}
{"text":"What a cute little bar. It almost has a speakeasy kind of feel. The bartender/server was great and his recommendations on beer were really helpful since that is a subject I am less knowledgable on. I even got to try a mini stein of beer, which was a lot of fun!! I highly recommend coming here and enjoying the different wine options as well as some great beers on tap or by the bottle! There are even some great little food options!!!!"}
{"text":"My girlfriend and I were walking around Old Town Glendale and spotted this gem... We decided to look over the menu and knew we had found the right place for dinner... We ordered a bottle of wine, olive appetizer and a Bruschetta platter. What an amazing value! Pick 4 different kinds of bruschetta for $14. We were blown away! All of them were amazing! We had smoked salmon with burrata, capers and red onion... Goat cheese with mint jelly and lime zest... Triple cream Brie with fig spread, apple slices and honey drizzle... And prosciutto, figs and cream fraise... I posted a picture of our plank as well. They were all absolutely amazing!! All of that for only $45. We were very impressed with the value and we will be back soon."}
{"text":"Stopped for a glass of wine. They had a great selection of wines, craft beer, wiskeys etc. and the bartender Stephen was really good at suggesting the right wine for us. We had fun talking with him, then went and finished our wine on the back patio under the stars. Perfect night!"}
{"text":"Fabulous for date night! My husband & I enjoyed a champagne toast on our 1st anniversary! Wonderful ambiance & beautiful historic details. Friendly staff, just a wonderful experience."}
{"text":"This is a wonderful place to relax in Old Town Glendale! I love it here. The food, beer, service, and patio are all great! They have a cigar and dog friendly patio! As a matter of fact, they also sell some cigars if you forgot your sticks at home. That is a HUGE plus for me since it is becoming so difficult to enjoy a cigar in Arizona. Another thing that I like is that even though they do have a large craft beer selection, it isn't just ales and IPAs. They have a craft pilsner as well. The back patio reminds me of my travels through europe, where many outside seating areas are between two buildings. Haus Murphey's is next door and you can often hear their music while sitting outside."}
{"text":"This place is a real gem that I'm surprised doesn't get more traffic. They're pretty serious about the non-mainstream beers they keep on tap except for the Lagunitas which I was surprised to see but all the other ones. A really great range too, from stouts, to sours, to ciders. Food is really good here to. I'm used to great craft beer at a craft beer bar but great food too! It's an all win here."}
{"text":"GREAT beer selection, great atmosphere, great bartender! This is a can't miss place!  Try the KWAK!!! You need to go there!!!"}
{"text":"This is a new wine and beer bar. They are just starting out and are developing their identity and style. We met Jody and Dixie, and they took great care of us. The cheese plate is just enough for two to share with a couple glasses of wine. They are connected to the Gaslight Inn B&B so they have the capacity to spread out if they need the room. 
Watch this place... It will soon be the place to go. My wife and I plan to visit on a regular basis."}
{"text":"I have a home I am remodeling right around the corner and we love walking over for some good beers.  The bartenders are very nice, they go out of their way to let you try new things. This is one of those places where the prices are still good.  Not too high like alot of other spots.  This year they just started with some food service..YEAH! Thanks for listening....it is a nice selection.  We will keep coming back.  We consider ourselves regulars!"}
{"text":"My fiance and I used to absolutely LOVE this hidden gem- were there all the time last year.  Since re opening after the summer we've been really disappointed and probably won't be back.  They no longer serve food and their craft beer list is a very unimpressive 1/4 of what it used to be.

Staff keeps telling us to try out Desert Rose (obviously the same owner), but we were even more disappointed by that establishment both times we tried it."}
{"text":"Small inside, patio is nice but not enough heaters for the winter. Great rotating beer and wine selection - knowledgeable staff!"}
{"text":"This is one of my favorite places a Hidden Gem, quiet patio, good beer, excellent bruschetta."}
{"text":"I'm impressed by the attractive old world aesthetic of the building. The actual bar, from what I hear, is a couple hundred years old or so and brought in from London, and the tin ceiling, though painted (which makes me sad, because authentically distressed tin ceilings are the 'rage'- don't they know?) is original to the building and adds a lot of character. 

It's a small cozy spot that lacks trendy pretension.  I think it has more of a friendly neighborhood feel. The clientele kind of reminds me of clientele at a sports bar, but not as rowdy and the bartender is very boisterous and friendly. It's an interesting combo and a nice atmosphere with a decent libation menu.

I'm giving OTG Wine and Beer 3 stars, because I think it's a welcome and needed addition to the neighborhood and hopefully a sign of good things to come. I would advise against eating here, as the food is made at the Bed and Breakfast that's attached next door (owned by the same people) and it is very poor quality. It's mainly just frozen foods brought in. They do not offer anything that's really house made, fresh or healthy. To me that's pretty terrible. I eat a \"clean\" diet, and I can't trust that there is anything on the menu I can consume. Who knows, maybe some cool restaurants will pop up in the area in response to a nice looking wine bar."}
{"text":"On my recent stay in Glendale I found this lovely wine bar.  It's a cozy little place that doesn't seat many people.  The whole place is so unlike the rest of downtown Glendale that you feel like you're somewhere else while you're inside drinking.  

Nice selection of wine.  I settled on glass of chianti but they had plenty of other reds to choose from."}
{"text":"Great place to hang out! We stopped in here during the Glendale Chocolate Festival for a drink and to get away from the crowds. The bartender was super friendly without being overbearing, and he happily brought me a generous sample to try. They had a sweet moscato that I liked and enough unique brews to satisfy my beer-loving hubby. We didn't actually order any food so I can't way if that was good or not, but I love the atmosphere of this place and we'll definitely be back."}
{"text":"Brand new Beer and more importantly, Wine Bar in the heart of Downtown Glendale.  Makes me so happy!  I had the opportunity of going in over the Glitters weekend, and having a glass of great wine, for a decent price too! (6.5)  They are nestled between the AZ Skin Clinic and the Gaslight Inn B&B (which also just opened up).  There selection of wine is about 12-15 or so options, with about 10 beers on tap, and around 40 total.  I may be off just a bit, but trust me, it's totally worth stopping by for a try!"}
{"text":"These reviews say it all,great craft beer selection,food is delicious(try the black fig bruschetta) friendly staff,quint and comfertable ambiance.just a great local spot to have a beer or glass of wine."}
{"text":"We stopped in, out of the blue, on a Tuesday night in January and were the only patrons in the place -- perfect. The staff member that greeted us was welcoming from the start, and had a great sense of humour which fit nicely for a place as laid back as this. We asked for recommendations and were pretty picky in setting our criteria for the beer we wanted to drink. Regardless, each of us loved the recommendation she selected, and ultimately had a wonderful time here. The atmosphere is far from any hustle-and-bustle, the music choice was both familiar and nostalgic, and the interior was just good ol' pub style without any modern snobbery. This place checked all the boxes for us."}
{"text":"Beautiful bar. Great food.  AWESOME craft beer/wine selection.  Friendly and helpful service.  Fun local hangout that is very welcoming to first-timers...definitely going back!"}
{"text":"This place is great.  The staff is very friendly and even gave me a little tour of the building.  Great prices and an amazing selection.  I live 30 minutes away and will be making this a regular hang out.  If you show up while i am there, chances are, i will buy you a round."}
{"text":"Super modern happening place in Downtown Glendale! Definitely give this place a try , bring a group from work. Gives Scottsdale bars a run for their $. Great hang out or romantic date night in the fall and winter!!"}
{"text":"Been to this place many times and it's fantastic. The food is great - especially the turkey panini. There is also a nice rotation of local brews on tap. Plus, the staff is friendly and helpful."}
{"text":"Wow!!! Excellent beer and wine selection. Great atmosphere. Delicious food and superb service."}
{"text":"Another great little spot in Old Town Glendale! Clean, cute decor with a vintage vibe, good prices on wine, and can cork the bottle to go if you don't finish. There is also a nice outdoor patio in the back of the weather is nice. My husband and I like this spot a lot!"}
{"text":"Amazing place - went on a date with the hubby and it is truly a hidden gem. Exactly right next to Haus Murphy.  Bruschettas are amazing, ordered beer and was there for wine. I'm a bee girl and they had so many selections of beer with new arrival beers every week. It's the most amazing place ever and planning on having my 40th bday there. #YOLO. Great place and great food. Service is awesome and the locals are just as wonderful. 

There is a back patio that is spacious with a great view of the sky. Overall --- AMAZInG!!"}
{"text":"This is a great little hole in the wall bar. Inside just a few high tops and about 8 bar stools but it makes for a great speakeasy feel. I would definitely recommend this for a date night or as the waiter mentioned to me... Wednesday's are wine night and all the wine is half off. I will absolutely be coming back again."}
{"text":"Since reopening last fall, OTG has made so many adjustments that anyone who discovered it in 2013 needs to become reacquainted. Pronto. As for all you newcomers, remember that the end of Glendale Glitters doesn't mean the end of fun in the Historic District. Authenticity is scarce around here. Enjoy the oasis of culture while you have a drink, eh?

I've gotta say I've only enjoyed a glass of wine here just once in the last few visits. It's just not at the forefront of the product any more. Now, the beer is more prevalent with the tap selections doubled to twelve (all rare finds!) and the bottle selection is one of the best in town. Seriously, for about $3-$6 a pop, you can find some really good stuff without the drive over to Total Wine. Emphasis on quirky flavors not usually seen at other trendy bars. Kudos for standing out. 

Other expansion to things OTG does well is the food menu, upgraded and imported from the Inn next door. Nosh on bruschetta, chow down on a small cheese plate, or go all out on a panini. You can't go wrong, it's respectable food at very competitive prices. 

As if I didn't already have you hooked, they cell cigars, and if you wanna be a manly man, you can have a puff out on the beautiful patio. I cannot tell you how aesthetically pleasing it is to chill out between all the plants and the trickling fountain on a fair winter night. Bring friends...relax. This is a slice of the good life at a modest price, all with some of the best service around. It's a real contender for my favorite (and most frequented) bar in the valley."}
{"text":"I love going to this wine bar when in old town Glendale, and not too many people have figured out it's there yet so it's not usually too busy. That's a good thing because it does not fit many people. The wine list doesn't change too often and the wine is pretty pricy without many specials ever going on, but it's one of the only places on this side of the valley to get a decent glass of wine. They also have a huge beer selection. The staff is very nice and always willing to let you taste. I have never tried their appetizers but it looks like they have yummy options. It's right next to Haus Murphy so I always drop by before or after dinner."}
{"text":"Went in for lunch.  Nice and quiet.  Had a sandwich, beer.  Good service.  In a good part of town, get lunch and go antique shopping.  Very enjoyable."}
{"text":"Awesome hidden wine and craft beer spot with a lot of options. Friendly staff and great atmosphere."}
{"text":"I live in Glendale and I find it really difficult to find a good place nearby for craft beer that I can take a Lyft/Uber to and not shell out a ton of money for. OTG wine and beer is the perfect destination for anyone in my position.

There is a large section of craft beer bottled that you can purchase to take home or drink at the bar. On top of that their draft selection is impressive. What really impressed me was how affordable their prices were for such quality beer.

On top of the amazing selection and great prices, the staff is top notch. One employee was throwing out several recommendations while the bartender(and owner I believe) also presented a ton of recommendations to make my experience more enjoyable. 

While it can be quite packed on a weekend night and the inside part of the bar is small, there is a really nice patio you can also drink out on that is still plenty enjoyable. 

The only thing I would add to this place is the ability to purchase growlers. But thats just me being picky. I can easily see this place becoming one of my go to destinations in Glendale."}
{"text":"What an amazing find.  Delicious local talent that deserves recognition.  Perfect spot for girls night out or a special evening with your special someone.   Amazing, hard to find Washington wine.  Most places only have CA wine, not here, many choices.  The food is worth writing home about.  Value, flavor, and originality make this a grand place to go."}
{"text":"I am so disappointed!!!! I check out their website. Check the menu. Click on \"Make A Reservation\". It has me send an email to do this. I make a reservation for Saturday night 6pm. My wife and I are going to see a play and thought this would be a fun place to have a meal before the play. Just to make sure I call to check if they received my reservation I call, no answer so I leave a voicemail with my number. We show up, and the place is completely empty with someone sitting at the bar. I tell her that we are there for dinner and she says they don't serve food anymore. I told her about the website, my making reservations, and my calling and leaving a voicemail, and she says \"I'll have to talk to the owner about that\". I am sorry, but I just don't have forgiveness for this kind of nonsense. Luckily just down the block is this wonderful Italian place La Piazza Al Forno. Now this is a 5 star place to eat in old town Glendale. If your looking for a place in Old Town Glendale to get a great meal, a drink, etc. stay away from Olde Town Glendale Wine and Beer Bar. I have a feeling it isn't going to be around much longer, and there are so many other places. You'll know because there will actually be people there."}
{"text":"Went there last night with my girlfriend and had a great Bruschetta spread. They still had my favorite fall beer as well (always worth a star or 2). The staff was friendly; it's not too crowded or loud to hear your friends. Great food and great atmosphere."}
{"text":"A true hidden gem! To date, thee most beautifully reconstructed ole time bars I have ever been in.  I love the atmosphere, totally unpretentious. Great craft beer selection. The food and service is always on point."}
{"text":"There are not many taps at OTG. But they get rotated frequently. The bartender is always friendly and just the right amount of helpful while letting the wife and I chat after working too often.

The selection of bottles is top notch for such a small pub. The run specials often and have plenty of events and even do fun things when downtown Glendale is running an event. They recently started serving app style food but I haven't tried anything yet.

If you want a nice casual hangout for a couple of friends after work, this is the place to go."}
{"text":"Awesome to see an independent restaurant that caters to foodies. So much better to invest in small local business owners than large chains, especially when the food is amazing and well priced. Just as good as tostinos. Will be back, lovely ambiance and friendly staff."}
