{"text":"This place is hit and miss with me.  If they actually make your pizza the way you order it, it's delicious and worth the wait.  When they screw it up 3 times, you start to lose faith.  I love the pizza here.  It's always loaded with cheese and toppings, but they've got my order wrong too many times and I've decided to go elsewhere."}
{"text":"Beware of over charging. Ordered a pizza and had an entertainment book 50% off coupon. Notified them when I ordered.  When the pizza arrived it had a $10 off instead of the $14 off that should have been taken off.   Delivery guy wasn't any help with the matter despite giving him the coupon.   Pizza was mediocre at best. Sauce has no flavor."}
{"text":"Never will set  myself in this place again after they tried to charge me a minimum charge of $20  for a glass of  coke.When l told them to get the manager, because l refused to pay, they backed off.For awhile l thought l was In a 3rd world country."}
{"text":"This place has the BEST pizza but you might die of old age waiting for it to get delivered. Pick up is your only option. I have ordered from them 3x for work and 3x for home and I feel like Charlie Brown with the football every time they tell me - PROMISE me - what time it will be delivered and then show up a solid hour after that. Never again. Magically, if you are willing to pick it up they can have it ready in 20mins."}
{"text":"Olive Grove, I am a fan.  Been ordering from you for quite some time now, and have never walked away disappointed.  You're always so generous with your toppings..  Will you marry me?"}
{"text":"Won't be going here again. We live about 15 mins away and ordered 2 donairs for delivery. Since a donair takes about 10 mins to pretty shocked that it showed up an 1hr and 10 mins later and both were Ice cold.   I actually had to heat it up in the microwave. It was horribly dry, the pita was stale and hard. Certainly not worth $30.00  total wasted cheat day :("}
{"text":"We were recommended by a coworker to try their pizza and they deliver. We were told an hour 15, it was an hour 35. We ordered 2 pizzas and an order of dry ribs. The pizzas arrived but the dry ribs didn't. I phoned and the girl laughed and said you weren't charged, I said I know but we ordered them because we wanted them!!  About 5 minutes later, someone else called back and said the same thing that they would be on your next order.  The pizza was bland, the sauce didn't have any flavour.  Can't see us ever ordering again!!"}
{"text":"I can't remember the last time we had such a great pizza. The dough was perfectly cooked, lots of flavourful sauce and topping including FRESH mushrooms were plentiful. Didn't skimp on the cheese either. Will definitely order here again"}
{"text":"Pizza was good, Macaroni was yummy. Hummus was watery and hot and was not very good."}
{"text":"November Challenge - 15/30  \"I think there's a shisha place nearby.\"   A shisha bar? In suburbia? Olive Grove, you tapestried Unicorn, you DO exist! I can't believe I've never been inside. I've lived close by for so long, but resisted going inside because someone I know told me that the pizza was nothing to write home about.  Then, I realized that this is also someone that willingly listens to Creed, so their argument for this place is invalid. Also, I wasn't nearly as interested in their pizza as I was in their shisha. Shisha! In the suburbs! No longer do I have to trek downtown to somewhere where the smoke tastes ashy after two tokes, the cushions are suspect, the staff is surly and the music is being blasted on speakers that saw their best days 10 years ago when they blew out.   Olive Grove is clean, spacious, EMPTY on a Wednesday evening; with beautiful artwork surrounding you and the service is excellent and incredibly friendly. Relax with your hookah, while a cross stich of an old man toking up and having his tea and pizza overlooks you.   Open until 11 on a weekday, late on the weekends; I really appreciate that there is somewhere close by where I can grab Falafel and Shisha, then stumble home if I want to. Will have to come back and try their food! According to the server, they are very vegan friendly.  Bonus points for running after me and giving me back my Yelp glove that I left on the couch."}
{"text":"Had my first eat here since I recently landed a job in the area. I ordered the 2 slices of pizza and Coke for $6. It was a smokin deal, a real full meal, and super delicious. Thick, generous portioned slices with excellent flavor. This was honestly some of the best pizza I have tasted in my life. I'm 56. I've been back 3x's times since. My mouth is watering just writing this review. Dont listen to the negative posts.  I highly recommend this Pizzaria !"}
{"text":"Had a schwarma/donair today for lunch. TERRIBLE!!! I couldn't even eat more than a third of it. I don't remember the last time I ate something so awful. The pita was so soggy and falling apart. The vegetables weren't t. The freshest. Everything was completely soggy. The 'sweet' sauce had NO flavor what so ever. The beef was the worst I've ever had. Chunky and oddly seasoned. Lots of fatty bits and spit it out once when I heard a crunch as I bit into it. Yuck Yuck Yuck!"}
{"text":"Just got my order. 1 pizza an hour late. We called and were assured that it was on its way. ( we live 5 min away max) fast forward another 20 minutes until the bell rings. Almost cold pizza with no apology or explanation.  I would have called back but what's the use ? No standards or customer service."}
{"text":"Started working in this end of town and was happy that I could now get a schwarma or a donair for my lunch. I Specifically didn't bring a lunch today so I could try this place. I will never do it again! by far the worst sandwich I have ever had. pickled items were all dried out and it tasted like the taco. I not joking they must have seasoned there Lebanese food with Mexican seasonings.  reading the other comments people say the pizza is good so I'm sure that one day the office will have a pizza day and Ill maybe try it at that point but for now I will not be back."}
