{"text":"We ordered from here for the first time because we had a coupon. The pizza is really good. But we may be hesitant to go back due to ordering 20 hot wings and receiving sauceless plain fried chicken wings. Very disappointing."}
{"text":"This place has great food all around. The place is clean and their food comes in fresh. I've been there many times and have always been greeted and treated well. I highly recommend their pizza and salads."}
{"text":"Good pizza.  Great prices.  I judge my pizza by how it handles/tastes during reheat. Really like how there's no difference in the crust from the time it comes out of their oven and later when reheating a slice to munch on"}
{"text":"I like the food.  I've had hoagies, salad, and pizza.  It is three stars because honestly, I like Pizza Hut's pizza better which is in the same shopping center.  Best thing about Olive Oil is the $1.99 4 slice special on Mondays.  $2.99 with topping."}
{"text":"I have celiacs and the owner here is very knowledgeable about gluten free. They offer pizza crust and hoagie buns, and are very careful about cross contamination. The GF crust and buns are also really good! The owner is also incredibly nice, and it is a pleasure getting to talk to him when he is there."}
{"text":"Ordered a basic pepperoni pizza. It was very greasy with a thin soggy crust. Bethel Park has better options for pie like; Red Onion or Luciano's."}
{"text":"Best Pizza in Bethel Park. Not expensive and menu has a lot of options for people with allergies. Delivery was earlier than expected."}
{"text":"We have ordered from here several times but will not again. Delivery took over 1 1/2 hours. When we opened the boxes we noticed that we received a pepperoni  intead of a plain pizza and called immediately.  We were told the driver would be back out in 10 minutes.  Well when the pizza still did not arrive over an hour later I called the shop.  The person on the phone could not tell me where the pizza was or if it had even been baked. He \"thought\" it must be in route. When I kept pressing the issue he just keep saying he was sorry. I said well I need to know if I need to place a new order. He just kept saying he didn't know. I said what should I do - call back in a half hour?  He said I guess. I called back a while later. The person tried to find the order and then said we were supposed to pick it up. I told him I was told the driver would be out in 10 minutes so how would that mean I was to pick it up.  He clearly did not care and needless to say we never got our pizza. I won't be back. There is no excuse for treating customers so poorly.  There are too many other pizza places around that value my business."}
{"text":"After ordering from Here 30+ times I decided I was in the mood for a Pizza. I called, placed my order paid with my debit card and was told 20-25 minutes. 35 minutes later the phone rings. No the driver wasn't lost it was the other store telling me my order was VOIDED because it was too far away, and did I want to order from them!!! I always called Bethel store and it shows as 1.7 miles from me on this app. My order was $50!  I'm so annoyed. It's not as if it's my first time ordering ... I have 8 saved receipts from Bethel on my fridge. Now it's too far!  Won't be ordering again!  Left a bad taste in my mouth. This is how you treat good customers!"}
{"text":"Great gluten free pizza, the crust was thick too! The gluten free Italian hoagie was perfect! I was so happy to be able to enjoy a hoagie after a year of not having one! The staff was knowledgeable too and asked if if was allergy related or diet so they made sure it was cooked properly."}
{"text":"Good food, but...  

My husband and I ordered for the first time here tonight and although the food is good it took over an hour for delivery.  From what we gather, the food is good, but was cold by the time we received it.  The shop called right after we ordered stating it was out of aomething which was no big deal.  

The only complaint about the food, other then it being cold, is the marinara for the breadsticks was not flavorful.  

I dont know if we will order again because it took so long for delivery.  An hour and 15 minutes for a monday night is just rediculous."}
{"text":"Pizza is okay. Wings not great - asked for extra crispy and they were anything but. Salad was best part, but the garlic bread was soggy and gross."}
{"text":"Had olive oil for dinner yesurday & it was awesome. I ordered the shrimp Alfredo so yummy it came with a side salad and garlic bread. My friend order the same but with chicken and he enjoys olive oil everytime. We had a coupon for 2 entrees for $16.99 Cant beat that! I would recommend olive oil to anybody who lives in pittsburgh."}
{"text":"My significant other and I order from here often for our lazy Sunday football watching days. We can never agree on just one pizza so we end up getting two, BBQ chicken pizza for him and a spinach gourmet for myself. For being a chain/franchise this pizza joint has great quality. We are skeptical when getting chicken on a pizza, you never know if it's chicken or if it's 'imitation chicken.' Pleasantly surprised with the quality of the BBQ chicken pizza and the gourmet spinach pizza is delicious, I crave t once a month. Only downfall is the mushrooms, I know my ingredients and I know what canned mushrooms look and taste like as oppose to fresh mushrooms. Sure it's more convenient for the company but with the other fresh ingredients (minus the spinach) it downgrades the pizza by having canned mushrooms on it. The crust is light and airy and the white sauce as well as the BBQ sauce is always tasty. Prices are off which contributes to the three star rating. I don't mind paying more for pizza with fresh ingredients but when I pay the same as other restaurants who use all fresh ingredients, it just doesn't make sense. They must be doing something right, they're in the midst of opening another in Brookline I believe."}
{"text":"nicely spiced, great selection and fast delivery.  Love the pizza named after his daughter.  worth a try."}
{"text":"I will preface this review by saying I come from a state known for really good \"mom and pop shop\" pizza.  I am picky. Keep that in mind.
My husband and I relocated to Pittsburgh recently, and are on the hunt for a pizza place. This is our second attempt.  It was not bad.
The crust was pleasantly sweet and only slightly too chewy. The toppings tasted fairly fresh. We found it to be pretty oily though. I shouldn't have to wipe my hands every time I pick up my slice.
The pizza was ready in a timely fashion. We opted to go pick it up rather than risk overly long delivery time."}
{"text":"I would go there again.
We picked up an order from the Washington, PA location for the first time tonight, they were slammed and running a little behind but it was worth it.
We had a large pepperoni and mushroom... The sauce was delicious and they used fresh mushrooms."}
{"text":"The artichoke pizza is one of the best pizza's I've ever had, and I consider myself a pizza connoisseur. The flavors, crust and topping combinations were perfect. Delivery service was good. I'm only ordering from this place from now on!"}
{"text":"I got unbelievably ill after eating an Italian hoagie from this place.  I have had food poisoning before and that is definitely what it was.  Steer clear."}
{"text":"I can't say enough about the employees or the pizza.  My new place to go.  Been looking for a good pizza in Bethel Park and I found it.  I wish they had seating.  The sauce makes the pizza and this is right-on."}
{"text":"Absolutely amazing pizza and wings! 

My boyfriend and I ordered delivery from here over the weekend and it arrived within 30 minutes. The employee we placed our order with and the delivery man were both very nice. 

We used their deal for a large two topping pizza and one dozen wings for $18.99 and ordered their traditional crust pizza with feta and sausage and an order of garlic butter wings. The pizza was one of the best we've had in Pittsburgh (and we order pizza from a different restaurant every Sunday)! The crust and sauce were well seasoned and the toppings tasted very fresh. The wings were crispy and had a generous amount of sauce on them. Both items arrived very hot too. 

Their menu contained a lot of items that I'm excited to try out! We will definitely be ordering again soon!"}
{"text":"My husband and I absolutely LOVE this place. 
When they first arrived in the neighborhood, I stopped in out of curiosity on my way home from work. When I walked in, it smelled like paint and the guy behind the counter was super apologetic because they weren't open yet. He was very nice and gave me a menu, and I assured him I'd be back when they did open. Good first impression!

* Pizza - First, we tried the cheese pizza, which I think is a fair way to judge a place. It was great (think Italian Village with less basil and better topping choices!) We were suprised by the wide selection of toppings (sun dried tomatoes!!) and gourmet choices. The feta cheese topping is great too!
*Breadsticks - Homemade (hand stretched) and delicious!
*Cheese fries - Baked in a metal tin with shredded cheese on top- very good!
*Pasta- The manicotti seems to be homemade and is SO good (both the plain and spinach alfredo.) The portion size is very large, too- along with the side salad and two pieces of garlic bread, it's very filling! 
*Desserts - INCREDIBLE! The chocolate cake (mostly mousse and ganache) and tiramisu are restaurant quality. Nothing beats being able to have an entire meal- including dessert- delivered to my door!

Also, the girl who usually takes my phone order is so friendly and upbeat. I honestly don't have one bad thing to say about this place!"}
{"text":"Called in an order for two 16\" pizzas (meat monster and Philly steak and cheese).  Arrived for pickup and lady handed me one pizza and a 12\" Philly sub.  I told her I ordered the pizza which she argued with me that I specifically ordered a pizza and not the sub.  She then made the pizza while I waited.  While waiting, someone else came in to pickup a 12\" Philly sub and she handed him a 6\" instead.  He told her he specifically ordered a 12\". She apologized and said to keep it and she would deliver a 12\". The first reaction if a business should not be to accuse a customer of being wrong. Rather  fix the problem. When leaving she did apologize which was appreciated. Overall the pizza was thin,chewy, not greasy which is a plus, and lacked topping volume and cheese.  Meats were crumbled on top and this. After waiting for the Philly the meat pizza was cool from sitting. It seems no one in the south hills can make a decent hearty authentic gourmet Italian pizza.  It seems they all copy each other and the only difference is the business name and location. Pepperoni's had a pretty decent pizza but unfortunately the went out of business."}
{"text":"My new favorite pizza place in the area even though they forgot my pepperoni, but that's ok I forgave the nice young gentleman who was no older than a high school student who took my order (ppppst thus the reason for the 4 stars)! The pizza was great and the price was amazing for a pizza anymore...sad I know right! I got an xl 2 topping pizza even though it only came with one on it...for under $11(carry out special)! It was a healthy 12 cut pizza that was light on the sauce (love my pizza like this) which was a a tad on the sweet side and a thin crust. The order was ready quickly and the staff was very nice. Highly recommend."}
{"text":"Agree with others, for take-out 5 stars!  food is excellent, generous portions, great prices, very friendly service. have never left unhappy!"}
