{"text":"Gutes Essen. Grosse Portionen. Nettes Personal. Bedenkenlos zu empfehlen. Waren schon öfters da. Am besten vorher reservieren."}
{"text":"Diesem Lokal wollte ich schon seit längerem einen Besuch abstatten und an diesem Sonntag haben wir dann den Weg dorthin gefunden.
Das Lokal verfügt über einen großen Aussenbereich und einen noch grösseren Innenraum. Es wirbelten 5 Kellner an diesem Abend durch den Saal und der Terasse, die aber keinerlei Hektik versprühten. Wir fanden einen Platz direkt am Fenster und wurden prompt mit Speisekarten ausgestattet und Getränke geordert. Nach dem servieren der Geträke bestellten wir als Vorpeise einmal die gefüllten Weinblätter (Dolmadakia), als Hauptgerichte je einmal den Kreta- und den Grill-Teller. Die gefüllten Weinblätter waren leider ein Fertigprodukt und konnten geschmacklich nicht überzeugen. Die Hauptgerichte hingegen waren guter Standard, an dem es nichts auszusetzen gab. Das Gyros war gut gewürzt, das Fleisch gegrillt und saftig, kein Grund zur Beanstandung.
Einzig der Sauberkeit sollte man etwas mehr Aufmerksamkeit widmen. Die Fenster waren von innen verschmuzt, auf den Bänken lagen vertrocknete Blätter und vom Parkplatz schaute man auf leere Gläser und Dosen. Insgesamt wirkte es um das Lokal herum etwas ungepflegt.
Mein Fazit: eine gute Alternative zum Dimitra in Düren, leider muss man dafür etwas Fahrzeit opfern"}
{"text":"Wir wollten das Restaurant schon länger mal besuchen und waren Anfang März nun auch da. Alles in allem waren wir zufrieden und werden das Lokal sicherlich wieder besuchen.
Die Lage ist gut und ausreichend Parkplätze sind auch vorhanden.Das Restaurant war gut besucht und das Publikum war durchaus sehr gemischt bei sehr lockerer Atmosphäre. Sonderwünsche beim Essen wurden anstandslos berücksichtigt."}
{"text":"Allgemein
Aufgrund unserer Betriebsweihnachtsfeier, sind wir auf Empfehlung einer Mitarbeiterin dorthin gefahen. Ausreichend Parkplätze und Sitzplätze
Bedienung
Da es sehr voll war, mußten wir länger warten. Bis auf eine Ausnahme, war die Bedienung freundlich.
Das Essen
4 von uns haben sich für die Rinderfilet- und Schweinefilet-Gyrosplatte entschieden. Gab es als Platte für 4 Personen, mit Folienkartoffel, wir bestellten zusätlich Fritten und Kartoffelchips. Eine Mitarbeiterin hatte dieses Gericht als Tellergericht. 1x hatten wir Lammfilet und 1x Wiener Schnitzel. Geschmacklich war es toll. Nur kommt jetzt das negative: Für uns allen(!) war es weder Rinderfilet, noch Schweinefilet. Nach unserer Meinung war es Rumpsteak und Schweinerücken. Wir arbeiten alle in der Gastronomie. Darauf angesprochen wurde die Restaurantleiterin(Chefin?) nicht einsichtig. Das wäre Filet!!!Wir blieben alle höfflich, sagten auch das es schmeckt, nur das man das nicht als Filet verkaufen soll.Sie fragte wie sie es gut machen könne, wenn wir der Meinung seien, das es kein Filet ist. Darauf habe ich ironisch gesagt,wenn nichts falsch ist bräuchte Sie doch nichts gut machen.............! Von unserer Mitarbeiterin erfuhren wir, das nach dem Essen zu einem Getränk eingeladen wird. Wir wurden, trotz einer Rechnung über 180,00 NICHT eingeladen. Das empfinde ich als Armutszeugnis. 
Das Ambiente
Grieschische Einrichtung. Es ist mittlerer Standart.Im großen und ganzen in Ordnung
Sauberkeit
Die Toietten sind nicht mehr zeitgemäß. Und der Geruch war nicht so angenehm."}
{"text":"Das Olympia in Inden Lucherberg existiert seit Mitte 2015 nicht mehr.
Es läuft unter dem neuen Namen \"Zum Olymp\" und unter neuer Führung!

Wir waren früher sehr oft im \"Olympia\" essen. Kurz nach der Übernahme waren wir mit 8 Personen noch \"einmal\" im \"Zum Olymp\"."}
