{"text":"Sat down for 15 minutes today at the sushi bar.  There were 4 people working and no one even acknowledged my existence, asked if I was picking up an order or if I'd like something to drink.  3 people walked in and either picked up call-in orders or placed an order, had it fulfilled.  I sat there watching, made eye contact with two of the people working, and still no one spoke to me.  After 15 minutes, I left and will never go back."}
{"text":"Worst service I've been to in years! Waited for service and the waitress totally ignored us, ended up leaving and going to another restaurant and it wasn't even that busy on a Sunday!! Too bad lost our business"}
{"text":"The service was pleasant but slow. The food was subpar and overpriced for what you get. Would not return."}
{"text":"Worst service ever There were two servers and maybe about eight people including my boyfriend and I and the waitress still forgot to bring us our waters. She took so long to come out and take our order that the sushi chef had to come out and ask us if we were ready to order. When she finally took our order we had to ask for our waters for a second time. She never came back for our refills even though she watched me finish my water and then drink my boyfriends. When we were done eating we sat with empty dishes, waiting for the bill while she stared at us and then continued to clean off the tables. To top it all off she was texting in front of everyone in the restaurant and tried to hide it by going in a corner. She must have forgotten that we were outside and the restaurant has windows around it.   Needless to say, the sushi is decent but overpriced with mediocre service. The location is the only thing this restaurant has going for them.  I recommend Squid Ink around the corner where you can get more bang for your buck. They have excellent service and even better sushi."}
{"text":"I absolutely adore Sushi Kokoro. I tried this delicious sushi bar with my sister last week & we were amazed at the size of the menu.  This restaurant offers decadent sushi as well as a wide array of Japanese cuisine.  We were also blown away by the incredible Happy Hour prices. I got the California & Las Vegas rolls and my sister ordered the Rattlesnake & Spicy Tuna rolls. We both left feeling very satisfied not only because of the tasty cuisine, but also because of the terrific service. Our waiter was very attentive, but not overbearing.   Because of the exceptional sushi & service, I would certainly return to Sushi Kokoro.   As a side note, this restaurant validates parking for 2 hours."}
{"text":"Had a pretty good lunch at Kokoro. The food was decent to good and service was quick and courteous. We lucked out because we were able to try their lunch combo which they normally don't serve on the weekends but due to St. Patty's day they were offering the special. The shrimp tempura was delish. The spicy chicken teriyaki combo was enough for my 11 yr old daughter and I to share.   We came across an ecoupon from Light Rail Deals in phoenix and I chose to send it to my phone. It was for 10% off lunch with an expiration date of 08/15/12. Unfortunately, the waitress was not allowed to honor it per the owner. We needed a paper copy and she was not aware of the coupon at all. My recommendation is to call ahead so there are no surprises. Better yet, if you are staying in a nearby hotel, print it there before you go.   Had I been the owner, I would have honored it and called LR deals and discussed it with them. I think word of mouth is more powerful than any other advertising. It made me feel like they were not doing so well as a business so they were afraid to give us the 10% off. The irony of it all is that the owner was handing out get a free drink with lunch coupons (which we didnt get but the server ultimately gave us one after I was surprised that they wouldn't honor the ecoupon, visible on my phone and presented at the beginning of the meal. We found out we couldn't use it when the check came!)  Considering that we are at a convention with about 500 other people (which I informed the waitress of), we would have recommended this place and the coupon and it would have generated some business for this small yet comfortable restaurant. Still good food at a reasonable price. It's just the principal of creating potential new customers for life."}
{"text":"I wanted to give this place a second try on its food and service which might just be my last. You either get a really upbeat and nice waitress or you get one that is apparently too good to work there. Lucky for me I got the snobby waitress. I wanted a simple salmon roll (which wasn't too big in its taste) and asking for takeout was apparently a dumb question because there was a \"A small sign\" that says take out orders here? It was so small I seriously could not see it up close. The food is mediocre and there's no real blast of flavor that Japanese food should bring."}
{"text":"It's tucked in the Arizona center mall. The seating arrangement is kind of cramped in the inside. You have to order at the counter and they will bring you your food out. I tried their lunch combo and it was so so. The California roll was nothing great but for $8.50 there was a lot of food on my plate for lunch. Overall it's forgettable."}
{"text":"Man oh man what can I say. First of all, reading all these negative reviews makes me so sad! I absolutely love this place and adore the owners and Ace, the sushi chef, he is incredible! I have been coming to Kokoro for the last year practically every Wednesday for lunch and I have never been let down! Every person I bring with me or suggest to come on their own would agree with me. The food is always fresh, service is timely, I'm always greeted by a friendly face, and their restaurant is always clean. I always look forward to my Wednesday lunch date with Kokoro's sushi. I usually order Edamame, the Las Vegas Roll, and the Caterpillar Roll. When my friend comes with me she usually orders the Honey Sesame Chicken or the Teriyaki Chicken. Both of our meals are a hardy helping and we are both satisfied and full when we leave. I can't tell you how obsessed I am with their Las Vegas Roll. I consider myself a sushi connoisseur of sorts. I've lived in the Phoenix/Scottsdale area for 10 years now and have tried many sushi spots. Kokoro, hands down, has the best Las Vegas Roll in the valley. I will continue to recommend Kokoro sushi as one of the best places to get sushi in the Phoenix area!"}
{"text":"Good sushi. It's small but quaint.  There's food seemed fresh. It's definitely not a fancy place but it has a great feel!"}
{"text":"Great location, but I have to say that the food, not so good.  I have visited this place two times and tried different types of meals.  First time I had a spicy tuna roll with Jalepenos and the the rice was extra warm which should be at room temperature, then I had the the Reman noodle with pork.  The Noodles were under cooked, stiff like chalk and the broth was SO-SO.....  Second time around I had Chicken Katsu which was over cooked, hard, and barely any chicken I felt like I was eating bread crumbs. and the soup was luke warm.  Just not my cup of tea.  NYC and SFO have better places and so much more REASONABLE..  The second time around my meal nearly cost me $19.  Comparable to Kyoto bowl but double in price.  :/"}
{"text":"i only gave this 1 star because i had to so i may write this review.the service was ok.the decor was cute.i ordered the beef ramen.bland,overcooked meat,and way too many bean sprouts in a very watery bland broth.i also ordered the chicken pho.meat was bland,no seasoning of any kind,and no Hoisin sauce on the table.in every asian place,they always have sriracha&Hoisin on the table.but whatever.i also ordered the gyoza which was delicious because it wasn't made from Kokoro, frozen and came out of a bag which they just had to deep fry.i ordered a salad and the dressing was ok,could have used more ginger.i also ordered beef bulgogi which was such a sad disappointment..i left my food on the table as full as it was went it left the kitchen.from the few bites i took,it never got better.the only reason my kids ate the bulgogi was they were very hungry,but even the little ones were surprised at how monumentally bad the food was.my bill was $60.00 and it was an expensive lesson learned..never again.."}
{"text":"My husband and I had a nice dining experience at Sushi Kokoro. We weren't going to have a fancy dinner experience, but really just wanted to get a quick bite before the movies. The place is small but cozy and the staff was really nice. We both had the seafood noodle soup (can't remember the exact name) but it was really, really tasty! The price point was reasonable and we were in and out in a good amount of time. I think is a great addition to Arizona Center and downtown Phoenix and will go back again."}
{"text":"My girlfriend eats phô religiously and is wary of places that serves it. I've never eaten phô till I met her. Two years and some change later, this place has been consistent in how they make their beef phô. We've had other meals here, but their phô is by far the best. When we walk in, the waitress greets us and says she hasn't seen us in awhile. Plus, she knows our order very well. She knows that my girlfriend doesn't like Phoenix water, so she brings her a bottled water without asking. Overall, good food and great service! Would definitely recommend giving it a try!"}
{"text":"LOCATED INSIDE THE AZ CENTER.  Can be a little tricky using your iPhone to find the place.  The restaurant itself is a tad on the cramped side, but what Japanese place isn't a little crowded at lunch time? We took advantage of the lunch special which gave you (2) six piece rolls and a house salad. I thought that deal was pretty legit for about $9.50 including tax.   I don't recommend the chicken terriaki roll. Just isn't that impressive, looked like he took chicken chucks, rolled it into the rice paper and squirte sauce on it. Go with something else. I LOVED the calamari roll. I would get that again.   Outside seating is nice too. I wound't go back here in a heartbeat but it satisfied the hankering I was having for some sushi."}
{"text":"They use MSG in all of their food, I found out after eating there.  I didn't know Japanese restaurants used it,  I thought this was a chemical of the past.  I have a strong allergy to MSG and would really appreciate them listing this at the door and / or on the menu."}
{"text":"I've been going to this place for it's convenience (pre-movie dinner), but each time the service has gotten worse! There are usually 1 or 2 other people in the restaurant at a time, but last night there were 3 tables and the server was completely in over her head. She snapped at a guy who tried to order a to-go order, \"Can you wait?!\" Poor kid.  There was a new sushi \"chef\" last night who butchered the nigiri. He was reading the ingredient list for each of the sushi rolls (as he was making them) and looking blankly at each of the sauce bottles, clearly confused by what each bottle contained. Our rolls came out bland, poorly presented and without any sauce. Overall, it's NOT worth the convenience. We will NOT be back. YUCK. Night-Ruin-er"}
{"text":"I've had plenty of sushi in my life.  This by far was the worst.  The disinterested staff don't even acknowledge you when you walk in. Not a glance or a smile.  I've been here 3 times but only ate twice.  I wanted to give them a second chance.  But every time it's the same thing.  Ordered a bunch of rolls. The pregnant waitress forgot some of our food (which is fine) but had an attitude about bringing the rest that I had paid for mind you.  Ordered salmon sashimi. The raw fish was slimy , not fresh (smell, texture, taste) and HAD BONES IN IT AND SLIMY WHITE things that looked like worms.  I pulled them out and Google before just to know if I was being paranoid. I ate it anyway and it was gross. Food was mediocre and the staff almost give a vibe that they don't want you there.  I've always gone with a few friends and they say the same thing.  I would steer clear of this place because I found several bones in my sushi and it wasn't the freshest. Zero ambiance.  Cold service."}
{"text":"Not very good at all.  Zero ambiance (loud pop music), mushy rolls, seaweed salad that is mostly lettuce.  There has to be better."}
{"text":"It's alright. Nothing great. More of an asian fusion opposed to just being a Japanese restaurant. Food seems a tad overpriced. The woman who was at the register also served the food at out table, she was not very friendly. I'm not sure if the rest of the staff is as grumpy as she is, but hopefully not. The sushi and sashimi weren't bad."}
{"text":"I got the spicy Korean chicken rice bowl, which is a lunch special. The chicken was super oily and rice clumped together. For having to wait thirty minutes for an easy order and fast food quality. I'd say it is not worth going. Go to Panda Express instead. Now with that said, I have not tried their sushi, so you should make your own option on that subject."}
{"text":"Great lunch place even tho construction is going on the restaurant was clean and quiet (which I like). Ordered the steamed tofu and veggie rice bowl and it came out hot, fresh and beautiful presentation. Reasonably priced and friendly staff. Very much enjoyed the place and will return"}
{"text":"I went here on a whim because my friend and I weren't looking for an upscale dining place for dinner. It was a huge mistake.  I ordered vegetable tempura and ramen, and I've never been so underwhelmed. The tempura sauce wasn't even the right sauce, and I think you'd have to really be trying hard to get it wrong.  I didn't expect much from the ramen, especially it being only $9. Unfortunately for me, I had more to complain about after I received it. The ratio of noodles to broth was 1:3 and worst of all, the noodles were packaged. Meaning they were thrown in absentmindedly before dishing it out of the kitchen and onto the dinner table. The noodles still being stuck together, matched with the alarmingly salty broth was not ramen.   We also ordered food for takeout, and they had the nerve to leave the udon noodles in hot broth to get soggy. We also ordered an appetizer of edamame that never came, but they still charged us for it. Never going back."}
{"text":"I should have read the reviews. Got the lunch special rolls and added a shrimp tempura roll. As you can see in the picture the rolls look decent sized but each piece might be a 1/4 inch wide. So small and not worth the price. Where's the beef? How about where's the rice and fish. The shrimp tempura roll shrimp was like small salad shrimp. Total waste of my time and money. Wasabi had no flavor."}
{"text":"They used to have a great happy hour, but now don't offer any happy hour or specials. The sushi was okay. The volcano roll stated the scallops were baked, so I was expecting a warm soft scallop. They were steamed and very cold. I told the waitress I thought it was warm because it said baked, she said no they are steamed, so I had to show her the menu where it states baked. She didn't offer me if I wanted something new or to take it off my bill as it was a $13 roll. I also asked to add cream cheese in it, and they just put small bits of cream cheese on top of the roll, not even in it. My partner only ate it because she was hungry, after we scrapped all the cold scallops off. I was not happy about the service nor the food. Definitely not coming back."}
{"text":"We had the ramen noodle soup with tempura, and the Korean sliced beef noodles.  The ramen was the best.  Good broth, fresh noodles, and good tempura.  The Korean beef was good but not great.  Made from dried noodles and the beef was a little dry at times.  We'll be back to try the sushi.  The green tea was very good.  Its definitely a cafe style, with almost all stool style seating.  We sat in the few chairs with a back - which were comfortable.  I didn't much care for the KDKB radio selection but if they turned it down a bit, it wouldn't matter as much.  They had good service.  We'll definitely try it again."}
{"text":"The staff was really nice and they had 'convention specials'.  I stopped in because I really wanted ramen.  It's a good thing I also ordered gyoza, shrimp tempura, and a philly roll.  Those were decent.  The ramen just wasn't and I was disappointed."}
{"text":"Finally, another sushi place downtown!  This one is casual, order at the counter and take away or sit at one of a few tables inside the small interior.  Only three employees were there, the sushi chef, a kitchen assistant who ran the fryer and probably cooks the noodle dishes and a woman who was order taker/cashier/waitress.  We went around 5pm and ordered two appetizers and four rolls.  the appetizers were not stellar, overly fried gyoza when we prefer them steamed and small shrimp in the tempura which seemed oily as well.  The sushi special rolls run between 10 and 12 dollars, plain rolls between 5 and 8 dollars.  The best of the ones we ordered was the Las Vegas roll with the Tootsie roll running a close second.   We ended up taking a couple rolls to go for coworkers and the Rattlesnake Roll looked fantastic.  We will try it again and maybe order from the noodle menu, too."}
{"text":"Love their tempura Cali roll and veggie tempura! Different lunch menu and specials than dinner"}
{"text":"The workers are very nice, they attend immediately! The place is well kept and the food is amazing"}
{"text":"Nisha was very generous and attentive. The food tasted great and the service was quick. Will return when I am back in Phoenix!"}
{"text":"This place is so small, takes a very long time to get service and the chicken Pho! really. My Chicken Pho order has pieces of grilled chicken and tasted like watered down broth. very Disappointing."}
{"text":"Nisha is the best waitress ever!!! Thank you for making my dining experience so amazing! The food is amazing I recommend the gyoza!"}
{"text":"Not terrible- flaws on the menu make ordering difficult and patio tables are not cleaned regularly. $5.50 for a regular (and rather small california roll) and $10 for a specialty roll. Overall, the rolls taste fine but StingRay on camelback has the place beat in style, pricing, and service. Not a terrible place, great location, but definitely needs to take it up a few notches."}
{"text":"I have eaten the Udon Tempura dish before; however, suddenly the portion has changed.  It now has 1 shrimp and fewer vegetable tempuras.  When I inquired I received attitude and the suggestion that perhaps the last few times I ordered extra shrimp, which I did not.  I don't appreciate being ripped off - I would have returned it but I was hungry and it is a fairly good dish, although the broth seemed more fishy than normal this time"}
{"text":"A great small sushi place hidden in the Arizona Center. I've been coming here for years and the quality is always fantastic. I've introduced my fair share of friends and acquaintances to Omoide with happy reviews after. One of the people I brought lived across the street and had no idea this place existed. It's low-key and delicious. I more or less always order the Las Vegas because of my weakness for Eel. Their gratuitous use of eel sauce and spicy mayo make this one of my favorite restaurants because I never need to ask for extra sauces!"}
{"text":"The previous reviews seem to be very accurate.  It seems like when you walk in you know that what you're getting might not be the most consistent on a day to day basis. The prices are super cheap for their lunch specials which is what attracted me.  It's also the closest sushi place to where I work so that was important to me being a gluten free and dairy free person. You'd be surprised how difficult that is.  The seaweed used to wrap the sushi is kinda stale. The ingredients aren't the freshest. I wish they displayed what was in their sushi... instead of me guessing.   I wasn't impressed. I was looking for a steal in sushi, but I paid for what I recieved, cheap prices, cheap sushi.  ALSO THEY FORGOT PART OF MY ORDER??? I had to go back and get my food..."}
{"text":"I love sushi, but don't do shellfish.  Virtually all of their fancy rolls have shell fish so I asked the itamae (chef) for something custom.  He asked me what I like and made me a custom roll with salmon and tuna.  Bonus star for great service.    We got there just before they closed.  Arizona Center is a ghost town at 9 PM with the Colleges on break.  Parking can be a hastle, but if you like sushi and are at AZ Center, give Kokoro a try."}
{"text":"Stupid worst service I have ever had in my life. I totally ignored my husband and I. Could not get a menu so my husband asked for one then they passed us by for 30 minutes so we left and spent our money at the kettle black even though we wanted Asian"}
{"text":"The service was friendly and quick. It was a Sunday afternoon so it wasn't crowded about 4 other tables. Waitress was polite and efficient. We tried 3 sushi rolls; dragon, rattlesnake and rainbow roll. All fresh but a little too much sauce for my liking. A decent price but no bargain."}
{"text":"Few veggie options. They have 12-piece avocado roll for $9.95 but I was served 6 pieces. Was told it's the same thing, my pieces were just twice as big. They were normal size and not worth $10. My food came 10-15 min later than my boyfriends. He got pineapple chicken that he didn't like, said the chicken was cooked weird."}
{"text":"It's been a few months since I ate decent Japanese food. It was alright. Although it says its a Japanese restaurant, there were other dishes on the menu that are Chinese, Korean, and Vietnamese. I order the tempura udon, it wasn't that bad.   I thought it was a little expensive for the amount of food and price. I guess depending on what you order. But still...  The service was kinda bad. The waitress seems a little grumpy when providing service. A bit rude.."}
{"text":"I literally eat here at least 2-3x a week for lunch because it's right by my work.  The sushi and pad Thai have been amazing!  The service is extremely friendly and it's fast.  My coworkers love it as well and also eat there several times a week."}
{"text":"Did not know it was possible to make this food this badly. Ordered the lunch combo with Korean Beef Steak to go. Was immediately struck by how small the portions of everything were. Really pretty poor value for $8.50. The beef was a massive disappointment, brutally dry and chewy with absolutely no tenderness as good beef would have. It felt like I was eating microwaved leftovers. The 4 pieces of sushi were all tiny, far smaller than average sushi would be, and tasted fairly mushy to boot. They did not have that freshness that one wants from sushi. I asked for wasabi on the side, and rather than bothering to put some in a small plastic container, they just threw a glob of it in the middle of my takeout box. How lazy! Tempura was not even vaguely resembling crisp, and again did not taste fresh, really flavorless and gross. The sauce included for it was tasteless and bland, so that didn't help. At least the salad was ok.  Honestly, decent to good japanese/fusion places are a dime a dozen in the Phoenix metro area, and every one of them has a much better lunch special (in both taste and price) than this one. Don't waste your time, energy, and money."}
{"text":"I won't be coming back here, I would give it zero stars if possible. I had just moved to Arizona and was looking on yelp for some Asian food to try. I saw this place and it was close so I decided to try it out. I ordered some sushi and chicken pho. The broth for the pho was chicken bullion, it tasted like the kind I buy at safeway. I ordered a tuna roll and salmon roll. Those two were also very disappointing. The rice was old and hard, the sushi wasn't fresh. After eating my food, I received the bill, the prices were different from what was posted online when I first looked at the restaurant. To add icing on the cake, the service was horrible. It was me and two other people there, but the server was always on her phone and I had to try and get her attention multiple times. If you are looking for sushi, there are better places. Don't waste your time or money here."}
{"text":"First time at KoKoRo tonight with friends.   Arrived at 7:30 on a Thursday eve and there were three of the eight tables full, a good sign. We were grabbing a bite before a movie so we kept it simple: three orders of the 2-roll specials, while I ordered a Sunset Roll, since I wasn't too hungry.   The orders took a lot longer than they should've, considering the small crowd and small order. What should've taken 15 minutes actually took 30. We weren't pressed for our movie, we were just hungry.   Perhaps they had the 'B' team that night?  The sushi was good tho: fresh, cool and flavorful. Next time we might go next door tho."}
{"text":"Not the best sushi I've had and certainly not the worst.  I tried some unagi and udon and wasn't blown away by either.  The unagi was actually a lot better than I've had at other places the udon felt like it was missing something.  The noodles themselves where actually pretty good but the soup didn't have anything special about it.  The one thing this place does have going for it over other sushi joints is it's very close to home, so I'm sure I'll give them another chance."}
{"text":"Good effort by the sushi chef in an otherwise uneventful dining experience.  Full disclaimer, I live in coastal California, blessed with fresh fish and sushi options, so I apologize if I'm being too hard on Kokoro.  The good: a) Sushi chef and the waitress was very friendly and efficient b) Decent selection of seafood, even thought they did not have tobiko/ikura  The improvement areas: a) I didn't order any kitchen food, but was a witness to how they prepared one of their noodle dishes.  It was based on a packaged ramen that I don't even use since there are better brands.  Maybe I'm a snob, but I expect better quality ingredients used at a restaurant b) Price was not cheap, dinner for one totaling about $45 (with tip).  However, perhaps fresh fish isn't cheap in a landlocked city."}
{"text":"You know, this place is tricky. Why do i love it, because i love sushi, i love good sushi, i love a nice staff, i love customer service. Do they have it?, yes. Would you like this place if you are not into sushi? hmm, not really. I mean, i see a lot of people coming in because the Mexican place next door is full; well people, what can i tell ya, they do not serve chalupas, or however you say that. They serve raw fish. If you like gourmet sushi, sashimi, etc, then this place will satisfy. Get there, enjoy and be stay safe."}
{"text":"First time trying Kokoro and the last time.  I wanted some ramen and who can mess that up?  I had the shrimp ramen and it just didn't taste right, the shrimp seemed off.  I didn't eat more than the first, but stuck to just the noodles.  I won't get too detailed, but very soon after eating I knew for sure that something was wrong with what I had eaten. I will not be going back."}
{"text":"The sushi is way over priced. It was poor quality fish thrown together and wrapped up."}
{"text":"Terrible.  WAY overpriced for very small portions of low quality sushi.  The smallest rainbow roll I've ever received."}
{"text":"I ordered a spicy tuna roll, and it was basically a kimbab, which is a type of Korean roll (aka NOT A SUSHI ROLL). The rice was thick and there was too much of it."}
{"text":"Four years later I decided to give this place another try since my first time was not the tastiest experience.   I stopped in for lunch. The resturant was full but there was an open seat. The line was not long at all which allowed me to walk up and order. The establishment has a great lunch special menu with a variety of entrees and sushi options. I ordered the orange chicken bowl and my friend ordered the spicy teriyaki bowl. It took forever for us to get our food. There was only four people working. One person ringing, another person serving then two people cooking who played around a lot. Oddly as long as we waited our food was cooked to order but was cold. Not sure what they were doing back there but not a fan. Which is sad because the place looks nice however they can't seem to get the food right."}
{"text":"I'm not sure what everyone is talking about, but this place is pretty good. The specials are great and the suhi's good too. It's not super high end, but you're not paying for super high end either. You get what you pay for with anything and this place is no different. I've never had a bad meal here."}
{"text":"Dropped in here during Phoenix Comicon and ended up coming back every day I was there. Location can hardly be beat. The wait staff was very friendly and helpful, probably one of the best parts of eating at Kokoro, actually.   Whoever did their interior design really knew what they were doing. The place really has a great feel to it.   I went with a friend, and we focused more on the dinner items and less on the sushi, so I can only speak to that. Katsudon was great. They added a bit of kick to it for a southwestern touch, which turned out really well. Their salmon teriyaki was great considering the price. My friend ordered their fried rice, and liked it so much that he kept ordering it three days in a row.  My friend also tried the tempura, which he said was a bit sub-par, but considering the price, well worth it.   Their \"dinner\" items come with miso soup and a salad as well. Salad is, to be honest, rather plain, but it's nice that they include it considering how inexpensive the dinner sets are. The miso soup was a bit salty for my taste, but still good. I would not recommend the spicy korean beef steak. In all honesty, the katsudon had more kick to it, and the flavor of the korean beef was fairly weak.  Overall, eating here was a great experience. The food, on average, is a great deal. Prices are fairly low, especially considering their prime location in the heart of downtown. In general, you get more than you pay for here, but don't expect it to be the best in the city.   For good food on the cheap, in the heart of downtown Phoenix, I would  recommend Kokoro, although not necessarily my first choice.  Update: Went back twice since I was in town again. Had some trouble with the service....during lunch the line was huge, and during dinner it was so packed that they were too busy to take my order. I ended up going somewhere else. Hopefully that's not a trend but...  I should also comment on the chicken teriyaki. It really wasn't any good. Try ordering something else."}
{"text":"Charged more than the posted price on the menu.  The service was a bit slow and inattentive.  For a good sushi experience, seek elsewhere."}
{"text":"Kokoro is located inside the Arizona Center in Phoenix, AZ.   I'm a semi-regular customer to this little sushi bar because I absolutely love it. It's small but it's very clean. It has a comfortable atmosphere too. Overall, the inside is very pleasant. They have a patio but I never really ate out there because well, it's Phoenix.   They have a wide variety of options on their menu. My personal favorite and most frequently bought item is the New Mexico Roll. Crab meat, cream cheese, seaweed and rice with a deep-fried jalapeno. I can't seem to get enough of that dish. The spice in the jalapeno and in the chipotle-like sauce is a delicious mix of culinary cultures. My only complaint about the entire establishment is that when I finish eating my New Mexico Roll, I feel regret that there isn't at least one more bite. It would be nice if the portion was just a bit bigger.   The chicken fried rice is also great and they give you a lot of it too. It's about the price of a meal because they give you so much of it. I can't even get through a plate of the fried rice by myself but I sure do try whenever I get it.   The Phoenix Roll is another good choice, though I don't favor it as much as the New Mexico Roll. Just personal preference on that one, they both rock!   I saw a few reviews that negatively commented on how packed it was during their visit. Most of the time, Kokoro has enough space for everyone and food is received quickly. The only thing I can think of that would explain the place being overly busy is some kind of convention or conference in one of the hotels or at the Convention Center, just two blocks down. Every time I have been there (again, a semi-regular customer), the place has more than enough tables and speed of service expected of a sit-down restaurant.   Lastly is the price. The price is competitive with literally every other restaurant in the Arizona Center. It actually has some of the lowest prices in the entire Arizona Center.   Bottom line is that if you want some asian food with a twist, this is a fine choice."}
{"text":"I don't love this place. The staff is not very knowledgeable. When I went, they were out of ramen and asked me if I wanted something completely different. I didn't think the food was very good, and I was starving at the time.   I don't think I will be back very soon. There are other sushi places around that are much better.   I do like that they have magic eye pictures on the walls."}
{"text":"Amazing service every time I go. The New Mexico roll extra spicy is my fav as well. They do close a bit early, but with all the new spots opening up around here I'm sure that will change."}
{"text":"Writing this as I sit in restaurant.  Ordered lunch, Pad Thai.  So greasy that I keep piling the noodles on top of each other to let the grease drip down to the plate so I can take a bite!  Chicken is so dry and tastes as if it were marinated in straight soy sauce.  All this for a mere $11!  Also, I am a student so I ordered \"for here\" and sat down with my backpack.  Pulled out my laptop and the owner or manager came order and looked at my laptop and said, this was to go right?  It was obvious he didn't want a student sitting here but it's 1:40 in the afternoon and this place is dead.  First and last time I eat here."}
{"text":"Horrible food, friendly service but there is nothing else to say that is positive about this place.   I ordered the 8PC sushi with spicy tuna roll and my friend spicy tuna and california roll.  Can you belive that the miso soup came out of the fridge and he actually microwaved it to serve us. The sushi was not really sushi at all. The rice wouldn't even stick to the fish and it wasn't even fresh. I am sorry to bag somebody's business so bad but this is exactly how I felt. They need to impove or they will soon have a RIP on their sign."}
{"text":"The waiter was very nice and explained to me when I asked about the difference between a Korean Ramen  and a Japanese Ramen in the menu. He sounded very knowledgeable and suggested me to take Korean Ramen as it is much firmer compared to Japanese Ramen. I ended up ordering Spicy Korean Ramen since I love spicy food. I waited for almost 25 minutes and the Ramen came in. When the waiter put the noodles in front of me, it just looked like Korean instant noodles that I cook at home. I took the first bite and it was exactly the same taste as what the Instant Korean Spicy Ramen I bought from Asian grocery store. Still, I forced myself to eat at least half bowl as i paid almost 12 dollars for the Ramen which I could easily get for less than a dollar at store. The worst meal I had at Phoenix."}
{"text":"Yeah, what nearly everyone else says.  Sushi should have a \"Do not order\" sign.    Rice was overcooked and NOT seasoned.     I've never had a more tasteless California roll.  I couldn't even taste the cucumber, let alone the crab stick and avocado.   Tempura shrimp, ahh, OK.  They were pre-fried and then re-fried to reheat.  This leaves them a little on the greasy side from fresh tempura.    Service on the sushi was slow, anything else is just a reheat and serve.    I'm going to stop one more time to check out the ramen.  If they mess up pork ramen, then it's not worth to walk."}
{"text":"This was probably the worst noodle and sushi place I have experienced here in the Valley. I ordered the spicy ramen bowl--bland! Not spicy at all! I could have done better at home with a 25cent packet of ramen and siracha! The service was mediocre! Server never came to check on us, even when we sat down and informed her we were on a bit of a time crunch to make our movie on time. I won't be back. This place was not worth the $30 I spent. On a positive note, the Asahi beer was ice cold."}
{"text":"This shop is small and the staff is very friendly. I had the teriyaki beef and my boyfriend had the ramen noodles. We both loved it and it was very delicious. We will come back for sure."}
{"text":"Kokoro Sushi & Noodle Bar is located in the Arizona Center.  We went there once for lunch, and had one of their luncheon specials, an $8.50 Korean beef steak meal.  We went through a long line at the counter to select and order our meal, among crammed quarters of customers seated at square wooden tables on high chairs in very tight quarters.  It was so tight that one of the waitresses dropped and broke a plate while cleaning up, after being bumped.  It took a good 15 minutes for my order to arrive, and it looked like a TV dinner, with globs of food in piles on a large white rectangular serving tray.   Besides the main dish, the meal came with a generous portion of white rice, two tempuras: vegetable and shrimp, salad,  and four California rolls.  The Korean beef steak did not resemble any Korean beef steak I had eaten in the past, but looked like the minced beef you see in canned cat food.  It tasted a bit like chili beef, and was not tender like you would expect a steak to taste like.   Speaking of portion size, the beef steak was about the same size as a 5.5 can of cat food!  LOL, we did not dare inspect their garbage can for empty cans of cat food!           The salad was OK but the dressing far too strong -tasted like bottled French dressing.  At least there were no brown leaves.  The white rice was freshly cooked, and consisted of three scoops of rice.  A very nice portion, whereas in a lot of other restaurants they give too little rice for my taste.     The four California rolls came glued together, like the refrigerated packages you can get at Costco.  No hint of crab flavor, and the seaweed lining was very tough to eat.  I used a knife and fork to cut the roll in half, before eating.  The vegetable and shrimp tempuras were the highlight of the meal, as they were hot to the touch, and crisp from being freshly made.    We looked through the glass wall to the outside table, and watched a patron eat his teriyaki chicken.  The portion size of the chicken was at least double that of the Korean beef steak.  A thought for next time.  I ate lunch with two other business conference attendees.  My wife loves sushi, but I didn't dare bring her here for dinner that night, given the lack of quality in the California rolls."}
{"text":"Ordered the Spicy Teriyaki Chicken lunch special. Along with a Salmon Roll and a Spicy Tuna roll. All were really delicious. Food was made and served quickly, chicken was a little over cooked and dry but all in all, worth the visit. You get what u pay for."}
{"text":"This place is great! The food is good, service, is good, prices are great!  Obviously, its not the best sushi in the valley, but look at its location. It's perfect for the spot and price point. Last time I checked the Arizona Center doesn't boast the best mexican, greek, itilain, etc.  Try it out! You will not be dissapointed!!"}
{"text":"Yeah! I'm a fan.  Was in Phx a few weekends ago for the D'back game with the kids. One wanted sushi... in ARIZONA? where's the ocean??  This was within walking distance and is in the Arizona Center. Needed to have something other than good sushi too as one of the kids doesn't care for sushi.  Had tempura, goyza, ramen, nigri and of course beer for mama! It was all very good! So pleased to stumbled upon this gem!"}
{"text":"\"Meh\" is a pretty good description of the experience I had at Omoide Sushi & Noodle Bar today. I stopped in for a quick lunch and was encouraged that it was decently busy at 11:45. It's a fast casual set up where you order and they deliver to you. I ordered pork ramen and yellowtail nigiri and took my seat. The yellowtail came out first and it didn't look like the freshest fish I've seen and tasted bland. The pork ramen came out piping hot and generously sized which I liked. However the flavor of the broth and noodles was seriously lacking and left much to be desired. Everything was somehow bland and tasteless and for $18.43 I'd say skip it."}
{"text":"Well, I am going to come right out and say it, this place sucks.   I ordered their Pork Ramen, Gyoza, house salad and two spicy tuna rolls.   I will review the items in the order that they arrived.   1. House Salad: Prechopped salad with what tasted like bottled peanut ginger dressing. It also has a slew of uncooked noodles on top. It was boring, bland DRENCHED in dressing. Yuck.   2. Pork Ramen: Miso broth with Pork chunks, noodles, bean sprouts and carrots. The broth was terribly bland. Not even the Miso paste could rise any flavor. The most prominent flavor was of the earthy sprouts and to me they taste like dirt. I had three (3) miniscule pieces of Pork in it. Again, yuck.   3. Gyoza: Fried, old and greasy.   4. Spicy tuna rolls: About a third of the rolls has any rice on them. Also, two of the ends had no tuna in them at all. They were also warm and tasted like they'd been out for a while. Ugh.   All in all, never coming back."}
{"text":"We told the waitress that we were still waiting on our last party member as we sat outside at the tables, but then no one ever came back out to get our order. And we just sat there talking and hanging out. And then it was an hour and a half later and we just left. haha. I mean, I guess we could have flagged someone down but we would have had to walk inside and... I don't know... do a lot of extra work. We just left since it looks like they only had one waitress serving the entire restaurant."}
{"text":"I've one or two good experiences here, but also a handful of not-so-great experiences. I keep coming back because it's the only Asian food in Arizona Center close enough for lunch.  So let's start with the good: Their sushi used to be pretty decent, and for the lunch special, you can get two rolls for about $9, so that's a deal. I've also tried out their ramen. When it was brought out to me, I noticed that the broth looked very creamy, so I asked the server if there was dairy in it. (I know this is a common practice at some Japanese restaurants, so I figured it was best to ask instead of getting sick later.) He told me the soup did contain dairy, and when I told him I was lactose intolerant, he was very kind and offered to make it again in plain broth. I was very grateful for that.  These good experiences were about a year ago. Recently, things have changed: the sushi is no longer reliable, and even though I just about always order the same two rolls, they've been getting my order wrong a lot, giving me the spicy salmon instead of regular salmon roll. (The spicy salmon, by the way, seems like it is probably just chopped up salmon mixed with Sriracha.) Additionally, the ramen has not been as good either. When I ordered it a few weeks ago, I again asked about whether there is dairy in the broth so they can make it plain instead. The girl  taking the order told me it's just miso broth, so I believed her, thinking that maybe they changed the recipe. Well, later, I learned that it definitely had milk in it, so I was not at all pleased with being lied to. On top of that, the veggies and meat in the ramen did not seem fresh. I have never had ramen like that anywhere else. It looked like they took a really bad salad of iceberg lettuce, and basically dumped the veggies in the soup. The chicken too was something else; I'm pretty sure it was the teriyaki chicken without the sauce.  I hope they go back to cooking food the way they used to. It's quite a disgrace to Japanese food the way it is right now."}
{"text":"Service isn't the best. I waited 30 min for my pho soup ! Rating 1 star because although the broth was good, the chicken wasn't done right and felt old and overcooked. I will never come back here again. As for the sushi, we've been to many different sushi places and honesty, you can find better sushi at Fry's than this place."}
{"text":"I'd been looking forward to trying out Kokoro ever since I walked by and saw the \"Coming Soon\" poster. For the sake of clarity, I'm not a sushi snob. I don't know the intricacies of the cuisine. I know what I like and what tastes good to me. It doesn't have to cost an arm and a leg or be served in an ultra modern, mono-syllabic restaurant. That being said, I like Kokoro.  For $8.50, I walked away thoroughly satisfied and pleasantly full. The place is small and definitely more of a cafe-style establishment (borderline fast food). The staff was friendly, the place was clean and the rolls were excellent. They even whipped up a very delicious salad and gave it to me \"on the house,\" which was much appreciated. I mean, giving me something for free is always good, but give me something for free when I didn't even ask for it AND it tastes awesome?   Count me a definite fan. I will be back.  EDIT: Yeah, I've been back...twice already! And I'm happy to report their liquor license has been approved! So I'm upping my original Four Stars to Five. A bomber of Kirin Light (or Sapporo) and a large sake is a fine way to say \"good afternoon.\" I really hope this place makes it. I've been the only person in there on two occasions."}
{"text":"At best. I've had much much better sushi elsewhere (Phoenix or Maryland).  This place is located in the Arizona center, which I guess is pretty convenient for ASU and UA students in the downtown Phoenix area.. but the restaurant is pretty small and tight. Prices are definitely not cheap for mediocre sushi. They have a lunch menu that is decent- including rice bowls and a variety of sushi options. $10 for 2 rolls of choice.  I've tried the sushi here on several occasions because it's so convenient, but unfortunately, their sushi rice is pretty dry. It's an alright option for grab and go, but I'd never go out of my way to grab sushi here."}
{"text":"I never knew this place existed until I went out to lunch with a coworker. She is obsessed with sushi and would go here everyday all day if she could. For me, I have to be in the mood for sushi but this place has a lot more options for those that want something a little different. The first time we went, I ordered sushi since that is what my coworker recommended. I thought it was very good and really enjoyed the shrimp tempura and chicken teriyaki rolls that I ordered. Since I am a teacher, I can't always afford sushi so I have also tried the ramen, yakisoba, and lunch bowls. Every dish was great and I always went home with left overs. I really liked the way these dishes were seasoned. I have never had too much sauce or not enough.    I have to say that the owners are fantastic too. Every time we go in, I am greeted by name and asked how my day is going. They knew my name after the first trip. It also feels great knowing that I am supporting a local business and not a chain. I have recommended this place to others because I really liked every dish I ordered. My fiancé went with us one day and he liked it as well. If you are looking to support a local sushi business, this is definitely the place to go. It does get a little cramped during lunch time but that just solidifies the fact that the food is good."}
{"text":"One word to summarize the food here... Meh. I ordered the korean spicy ramen. The broth had ok flavor. I wish that it had more depth to it but it was pretty flat one flavor from start of bite to end. There was very little veggies in the bowl, which comprised of kimchi, bean sprouts, and a few slivers of carrot. There was one egg scrambled in and that was the only source of protein in the bowl. I was expecting meat but there was none in there. I basically paid $10 for ramen I could've bought at Safeway.   The girl at the counter that took my order was really nice though."}
{"text":"Small place, easy to get to. Variety of rolls a bit limited on veggie options.  They did happen to run out of miso soup. Prices are very reasonable"}
{"text":"Went in for the lunch special and although you get a lot of food for the price, I can't say I was moved by the meal. Pretty standard or comparable to any other fast food rice bowl joint. My lunch special included sesame chicken, tempura veggies/shrimp, side salad, California roll and a scoop of rice. My meal was only $8.50 but it was more than I would typically consume during lunch. I will note, the ordering process is a little unorganized. You order at a small section of the sushi bar which could result in crowding those trying to enjoy their meal. I would hate that. The outside seating area needs a little reworking. The tables are too large for the space.   I agree with some of the other Yelper comments about working out the kinks. Kokoro, let's raise the bar you've got potential."}
{"text":"I am now sitting in the nearby Starbucks eating sweets to get rid of the awful taste of the food I just had at Kokoro. I felt so strongly about this place that I needed to write a review immediately, before I forget.  I ordered Katsu Don and thought it was disgusting; it was not only very salty, but was covered with Vietnamese chili paste. I like salt and spice, but Katsu Don is not supposed be very salty nor should it be spicy! I ended up not finishing it.  Everything on the menu is wayyyy overpriced for what they are serving. I noticed that the other table also left without finishing their food. I can't believe this place has been around."}
{"text":"This place is at a disadvantage given the construction in the area.  The service was excellent on an this afternoon visit.  The shop is small with a nice atmosphere.  We ordered three meals yakisoba, teriyaki chicken and an 8 piece sushi meal.  All of the food came out together in around 10 minutes.  The teriyaki chicken came with rice, salad and miso soup.  The soup was plain, but adequate.  The meat was tender and delicious.  The other two meals were gobbled up by my family and both were enjoyed.  The waitress was very friendly mentioning that we were a beautiful family.  Overall, I would recommend this place given my experience."}
{"text":"Service was okay. Took them a minute to realize I was there.  I ordered the Caterpillar roll. It was a little different than usually, put a sold 7/10.   Service wasn't as good though. I was sitting up at the bar, yet it took a while for them to realize I was empty on water.   Location is great downtown. I expected more, but overall it was just meh. Would not recommend."}
{"text":"Going to try to keep this short food was terrible and gave me food poisoning the ramen was nothing but oil and noodles the sushi was literally just sauce and rice Chris the counter guy though was Fan-Tastic Chris gets 5 Stars this place gets no stars but I have to give it at least one star or I can't write a review"}
{"text":"I'm not sure why this place gets such bad review because I thought the place was good. Good food (I had sushi, salmon nagiri, edamame, miso soup and the Denver bronco roll (what? I was hungry) everything tasted great and was decently priced. The servers were very nice and friendly as well."}
{"text":"This place is located in the downtown center of Phoenix. We stopped in for lunch on a weekday. The place was crowded. The restaurant is small, does not offer much for indoor or outdoor seating. I felt somewhat claustrophobic, we ended up having to sit at the counter and had people bumping us while we were trying to eat. I think next time, I will get it to go and sit on a bench outside and down the way a bit to eat. I ordered the chicken teriyaki bowl lunch special and a drink. The chicken teriyaki was good, and the rice was cooked perfectly. I will be back when I am in the area, but it will not be my first choice and I will be getting my food to go."}
{"text":"Great little place for Ramen and just ok sushi.   I prefer the soup really.   Never had bad service."}
{"text":"Decient sushi.  The restaurant lacks any sort of distinct decor and looks to be mostly for takeout.  Prices are fair, not cheap.  Great lunch spot. I'd go elsewhere for dinner."}
{"text":"friendly service and delicious noodles!  Ask Ace to make you a \"korean chirashi bowl\".  He adds a spicy korean red chili sauce on top and omg, you won't regret it.  Off the menu, and it's absolutely delicious!!!"}
{"text":"I'm so glad we stumbled on this place. We were hungry and there weren't too many places open on a Sunday night downtown. But this saved us! It's a small space, probably not great for too many groups. But we were seated right away, and given menus. They were a bit busy, so it took awhile to place our orders, but our server was incredibly nice. She got us our drinks, and since it took long for our orders and food she brought us out complimentary rolls. So kind. When we did get our food, the Las Vegas roll, the sunset, a veggie roll, and some seaweed salad, it was all delicious. BUT. This place has the most delicious Las Vegas roll I've ever ever tried. THE BEST. I will probably have dreams about it. So great service, amazing food, I'll for sure be back!"}
{"text":"First off, no bathrooms, and for a restaurant, that should be against code/regulations. The only bathrooms in the Arizona Center were closed. I had to sneak my son into Hooters to go pee.  The Yakisoba was plain, not much flavor. Chicken was really dry. We also ordered sushi and nothing exciting to report. Checked into Yelp and got a free order of gyoza, but all we got was one piece!!! We spent 90+ bucks and all they could afford was one piece of gyoza?!?  I'd give this place one star, but giving it two stars since the waitress was nice."}
{"text":"I feel like I can't entirely judge this place to the fullest. However, based on my first lunch here, I ordered the lunch \"special\"! 2 selected rolls for $9! Well turns out you get the lunch portion. On the plus side, the service and staff were nice and quick!"}
{"text":"This place is rancid and the staff project the same warmth as the menu: cold dead fish."}
{"text":"This place is an absolute hidden gem! I ordered a Vegas Roll and a Rainbow Roll with edamame on the side- and a Ketel One and Seven to top it off. The rolls were phenomenal - beautifully made, fresh and very tasty. The edamame came with just the right amount of salt and was piping hot. And best of all, my drink was made right in front of me- and \"generous\" doesn't adequately describe the mix!  The staff is friendly and fast, I liked the music selection and the volume inside, and the decor is tasteful and modern.   Five stars from me! I'm new to Phoenix but will be coming back to Kokoro's next time I'm downtown."}
{"text":"Yeah, if you just need something that resembles a bowl of noodles and a piece of sushi this place works I guess. No real flavor and authentic should never be used. Staff was nice but the prices are ridiculous for what you get. Good spot for a noodle house, hopefully they can take the reviews and make a change."}
{"text":"Something fun and enviting, Omoide deserves your attention. Do not accidently pass up this long-standing location during yet another Arizona Center facelift. Sitting across from \"Cold Stone\" and right next to \"1130\", Omoide offers Sushi, Ramen, Gyoza, imported beers and so much more.  For the last 10 years, my family has traveled here, off and on, for authentic ramen and Pho noodles. The prices have gone up gradually, but the portions have ALWAYS been big. Our family of 7 only needs to order 5 bowls of noodles for everyone to get full.  If you are on a budget and like heat, I recommend the Spicey ramen for only 8.95USD They also keep trained sushi chefs on staff at all times. After so long, I finally tried one. I thought, for the price, the sushi may not be much, but I was wrong. I tried the tempura roll and loved it. Last, keep in mind, the menu is short and sweet. I like it when a business limits what they do so they can focus on doing those things well. They may not be some fancy place but they are consistant, friendly and generous. Please check it out!"}
{"text":"Great place to eat.  Ate here when I was on vacation in Phoenix. Loved the sushi.  It was fresh and tasty and I had good service."}
{"text":"I'll give an extra star for the decent gyoza.  However, the rice bowl (Korean style) was pretty bad.  The chopped vegetables were too large, the sauce was pretty bland, and the beef was mostly gristle."}
{"text":"I really wanted to think this place was an ok-option for a quick bite during a work day. I ordered a California roll and a spicy tuna roll thinking \"Hey, it can't be thattt bad.\" Meh.   Both of the rolls were only 6 pieces each and not big enough to not have included two more pieces each. But the real kicker was that the rice was semi-uncooked. Every bite that I forced myself to eat took more chewing and dare I say 'crunch' than should be required for basic rolls. You could actually see on the rice that it had not been completely cooked with the whiter centers of each grain.   I am someone who loves pretty much all things sushi, and even I had a hard time finishing them. For what was just about $11 for the complete order...do yourself a favor and go to the Sheraton's The District for one of their $9 lunches and leave feeling satisfied and not full of regret."}
{"text":"I'm going to give Kokoro 4 stars out of the gate but there is plenty of room for improvement. Caution: I was there on their 2nd day of business, before even their grand opening (and without serving their full menu) so I will update this review after a few more visits.  The good? A good selection of sushi at reasonable prices. Until now the only downtown sushi has been Moira (and it is good... but expensive!) The priciest roll on Kokoro's menu is nine bucks. I hope this brings in some ASU downtown kids to keep this place open where others have failed (including its previous occupant, a curry place that lasted about 15 minutes.)  The lunch special is a terrific deal. Chicken or beef and rice, a salad, 4 piece California roll and 3 pieces of tempura for $8.50. It is a belt-loosening lunch portion. Salad & tempura were solid. Chicken (both teriyaki and honey sesame) could use some work but they are early in the game.   The not-so-good?  For the terrific lunch special, if you get it to go -- you walk with 3 styrofoam containers. A bunch of people from my office got food and everyone reacted the same way. A good amount of food but it felt wrong to throw all that away.  UPDATE: Looks like they've remedied this down to 2 containers. But the greener way to eat at Kokoro is definitely to eat in-house.  Flow of traffic to place orders is a little crammed (partially due to nobody wanting to sit outside). But making you way to the counter requires Formula 1-style maneuvering.  Four stars for bringing a modestly-priced, casual but legit sushi place to downtown Phoenix.  The owners have 2 West Valley Asian restaurants I have not been to but I applaud the move. I work in the area and hope this place does well."}
{"text":"Been here one time and will not return. Our server was accommodating and friendly. The sushi did not taste fresh and our hot saki was served cold. The atmosphere is rather drab. We left still hungry and dissatisfied. There are better sushi restaurants downtown."}
{"text":"Great place for a quick lunch! We stopped in before a movie and it was so good! Service was really fast and prices were affordable. We had the calamari and Las Vegas rolls which were good. My husband had the Korean chicken rice bowl and he said it was perfectly made with enough spice. We also had the egg rolls which were great as well.   We will definitely be stopping in here again whenever we are in the area for entertainment again!"}
{"text":"I love this little place and the food is soo Good all their noodle dishes are very tasty and affordable sushi is good and always fresh I really recommend this place for a quick bite before a movie"}
{"text":"I really like this place and I come here regularly since I work downtown.  The food is very good and the sushi is very fresh. At one time the man I presumed to be the owner recognized me each time I visited.  Lately I haven't seen him and something is off. Today they were busy and the staff was really hustling.  There were 2 cooks and the sushi chef and the cashier. The cashier was really working hard but couldn't keep up with the dirty tables.  When my dish was ready there was nowhere to sit at a clean table. The staff is working hard, this is a management issue. I hope they pull it together."}
{"text":"I don't eat sushi but my other half recommended Kokoro for their fried rice. So we went with a friend on my birthday. I ordered the pork fried rice and they both ordered rice bowls. My food came out first. The rice had very good flavor, however it was overcooked. It had some crunchy bits. Their fried rice also has corn, which I could do without, and green beans, which is different but I don't mind. A lot of time had passed and my fellow diners still hadn't received their rice bowls. My b/f went up to check on it. They said it was 8 minutes for the rice. What the heck is taking so long? Others who arrived after us had gotten their food... It was at least 30 minutes between the time I got my food and when they got theirs. That's just crazy. It's not like we were on separate tickets. We were all together on one ticket. I don't understand why they couldn't time it better so our food came out together. I tried some of the teriyaki chicken and it was very good. Before we left, I saw someone else's fried rice and it looked normal, not dark like mine. So a pretty disappointing experience overall, but I feel like I need to eat here again so I can try the fried rice as it's supposed to be. It had potential."}
{"text":"I really want to give the place 5 stars.  This is where I first had sushi, and I've never had anything but really, really great sushi here.  They have a big menu, and while exploring the menu on subsequent trips, you can find things that aren't too great.  It's a common problem with restaurants.  However, never was the food bad, or anything bad!  This is why I can't give 5 stars.  You can order something deep in the menu and make a mistake.  When I want sushi, I come here.  I love their sushi."}
{"text":"Service was great, food was great, and I had a great time. Thank you for feeding me your delightful cucumber rolls! I will never forget the moments we had together."}
{"text":"To start with, check your receipt carefully. They tried to charge us $12.95 per soda instead of $2.95 and the very disinterested and unpleasant cashier just said \"oh, it does that sometimes\" AFTER she ran our card. Gave us cash back for the difference. But we would not have gotten it back if we hadn't noticed it.  Half the menu was \"out\", so my first two choices of meal were not available. Ice machine for sodas was out of ice.   Friend had pad Thai and I tried some. Was a bit bland in my opinion but not horrible. Salad was just greens with dressing, nothing to rave about.   My food was about ten minutes behind my friends and they tried to say our order was done without my food being out. Got it finally. Had pork tonkatsu.   The cutlet was dry and overcooked, pieces of it too burnt to eat. Rice was possibly the worst white rice I've ever had and that's hard to mess up. On the other hand, it was so burnt, I'm pretty sure it can't give me food poisoning.  I was afraid to eat the sushi we ordered, but had one piece and it was maybe mediocre. Seaweed definitely stale and chewy and ingredients not fresh.  The doors were locked while we were in the patio and we could not get refills and no one checked in on us. They had a random patron doing the doors for them to let people out. Unacceptable treatment.   I'd give it a 0 if I could. Don't bother even trying."}
{"text":"We had wonderful service by a young woman who had an obviously very tired, but adorable, girl following her around. I don't know the circumstances that led to this young lady having her child with her at work, but she was there. She took very good care of us, the one other occupied inside table, and and a group of three on the patio. No one complained about the kid, rather, we heard the other inside customers comment about how cute she was, as were we. She had a few cries/squeals, but we hardly even noticed. Then out of no where, this man (blonde ponytail, believe his name is Ace) screams across the restaurant, \"That's fucking enough! Take her outside! Do you hear me? That's fucking enough!\" And then proceeded to talk to another young woman who was somehow tied in to the restaurant without actually working, just sitting there texting on her phone (the entire time we were there), and repeatedly used the f word to her. It went absolutely dead silent. Who I believed to be the father of the child, and I also think he was one of the cooks, took the baby out, and the waitress continued working. The next time she came to our table she was visibly struggling to hold back her tears. We told her to just hang out at our table for a second to catch her breath, and she just stood their crying, and profusely apologizing. It was the most heartbreaking moment. We were there late, they were closing as we were finishing, the were pretty dead, more staff than customers, and the kid hadn't bugged anyone, or done anything wrong. It's a family restaurant, nothing fancy in the least bit. It was very loud in there as is. The kid wasn't out of control, or hurting anything, it was so uncalled for. A very detestation moment to see a hardworking mother be degraded like that. And in front of her innocent baby, those cuss words. Such an ugly moment.  Otherwise, the food is just mediocre. But because of how I saw him treat those people, I'll never be back."}
{"text":"Place is a bit crowded in seating but the food is top notch. Service was fair and prompt. The Korean Spicy Noodle Soup was fantastic and the sushi sashimi plate was incredible. The fish was very fresh and preparation was perfect. The sushi rice was a bit too sweet for my taste but that is a very slight criticism. Pricing extremely competitive. Would highly recommend!"}
{"text":"This is a great sushi place in general! Good service, good food, nothing to complain about!"}
{"text":"Not a bad place for a quick lunch fix. Hey have great lunch specials. I always order their fried rice, sushi rolls, and I really like their crispy egg rolls. This is not my favorite go-to sushi joint but it definitely does the job since my office is close to this location."}
{"text":"This place has the worse sushi and noodle dishes ever. I gave my dish back and the staff got upset. This is not authentic at all. The host told me I wasn't used to eating the dish. So unprofessional."}
{"text":"My parents and I went to this place for a quick lunch before watching a movie. We ordered the spicy Champong noodles which were pretty bland. Did not taste anything like Korean and the shrimp was undercooked hence the grayish color. So I left the shrimp inside the soup to cook more thoroughly. The shrimp pad Thai was good. And the Arizona roll was amazing!! So I would recommend the sushi here only"}
{"text":"We stopped here for lunch on a weekday. This place is located in a downtown plaza. It was pretty crowded. There is outdoor seating which was full. The only place to sit was at the counter right in front of the guy making sushi rolls. The good thing is you get to watch your food being made. The bad thing is this is where the line forms to order. The cash register is at the end of the short counter. I felt a little closed in with the line behind me and people brushing against me while I was eating. The chicken teriyaki was good, the rice was perfect. I would go back, but when it is not so busy."}
{"text":"This is from two separate visits.  I was there during one lunch rush and both the food and service was terrible.  It felt like a McDonalds that we had to order from the counter and the Champon was a mediocre soup and the octopus salad was so coarse like a tough gum.  Not only that, the table was not cleaned.    It had to sit outside in the sun ray beating down on me at 105 direct sunlight which the food simply died.  This last time we had a Korean lady served us who was great plus the food was cooked perfectly with table side service.  The octopus salad was decorated with both seaweed  which was missing last time and it was finely sliced like a real fine Japanese restaurant."}
{"text":"This is a great little place to grab sushi for lunch. The staff are friendly and the prices are fair. A great alternative to the typical lunch fair."}
{"text":"I've eaten here twice now and tried both the sushi and the udon. The sushi was pretty good for Arizona and the specialty rolls were worth the premium price because they offered unique flavor combinations and they didn't skimp on portions.  The udon however leaves something to be desired, like noodles. There was plenty of broth, but not many udon noodles and while it stayed my craving, I can't say that I'll be coming back for udon anytime soon. The basic flavors were there, but the price seemed kinda steep. I would have preferred less broth for a smaller bill, or an option to add more noodles.  On the bright side if you check out a movie at the 24 theater AMC and bring your ticket with a student ID you get 20% percent off your entire order!"}
{"text":"Sushi is all about the interplay of textures, temperature, and art (presentation).  Therefore one should evaluate all sushi places by those criteria. The reviews on this place are pretty spot on-- this is a solid three-star place serving average sushi.   The service is polite and moderately efficient (completely forgot my seaweed salad) but my server was charming. My presence was acknowledged with an enthusiastic greeting upon entering and I was told to sit anywhere I pleased in this small establishment with about a seven tables inside and about five outside.  Now on to the food: the rice was mediocre and reminiscent of Minute Rice. Cold and a little too hard and not seasoned in a manner consistent with tastiness. The fish was meh, the miso soup had plenty of sodium but not enough flavor. More like beige, cloudy hot water with the green onions providing the only identifiable flavor. The Rattlesnake Roll sounded delicious, but was shockingly devoid of the flavors one would associate with the ingredients.   Not terrible, but not great either. It's ok.  Bottom line- good enough for a quick lunch during the week, but if your goal is make it a special night with great sushi... Then no."}
{"text":"My fiancé and I are always on the hunt for local joints that have both sushi and Pho on their menu. Up until coming here we hadn't  found a location that nailed both dishes! Homerun for both the sushi (lots of variety) and the Pho here! We were looking for a place that was close to home (we live downtown) and had menu options for both of us! Consider us regulars now!! It's an added bonus that this place is located next door to the movie theater. Makes for lovely impromptu date nights .   The menu items are reasonably priced (2 appetizers two beers 3 sushi rolls and Pho = less than $60) There is a good beer selection (GIANT Kirin bottles) and expansive saki selection. The sushi menu is fully loaded. There is lots to choose from: sushi for beginners and sushi for the connoisseurs. The fish tasted fresh and the sauces they use here boast lots of flavor that didn't over take the fish in the rolls. The Pho had an intoxicating aroma and the broth flavors were intense...in a tasty way. The soup comes with a side of lime cilantro and sprouts which makes for a traditional pho experience. Overall we love this place and will continue to come back and try new sushi with our Pho. We found it randomly and we're delighted that we did. Oh and the staff is friendly and professional, but even if they weren't we would still be back ;)"}
{"text":"These reviews are crazy. Great food! Amazing service.  Just moved from San Diego and this is my new place. Fresh sushi, awesome Katsuya and pad thai!"}
{"text":"So you just got out of a long, dull meeting, and you find yourself craving Safeway-quality sushi as a way to continue the dullness. If so, Kokoro is a fantastic fit. This place is to Japanese Bento boxes what Subway is to a New York deli sandwich: reliable, decent, inexpensive, edible mediocrity that bears little resemblance to the real thing.  You won't hate it, and you might even like it if you go in expecting what it offers. Just don't plan on being amazed."}
{"text":"For a quick sushi meal, this place really isn't bad. Their menus have different choices in sushi rolls , noodles and combos. However, it is a big pricy."}
{"text":"This was how my chicken pho turn out. I asked for the vegetables instead of chicken and the waitress said yes. She brought the pho for me and me like what the h*.. Where are vegetables???? I came and asked the lady she said the vegetable in the side we didn't put them together. I came back my seat and look at the pho ... Oh... Come on the sprout always go with pho. I tasted the soup... Feel like I never wanna eat soup again. I didn't even get second spoon and left. $9 something for nothing. Never ever go here again."}
{"text":"Will not be going again!!!!!!!!!!!!!!!!!!!!!!!!!!!!! I was super excited to check out Kokoro because I live down town but the best it had to offer is location.  First of they have no bath rooms hello where do you wash your hands......  The food was not fresh at all I watched as the waitress took the edamame out of the freezer and placed it in the microwave I am not a sushi snob but the rice fell apart upon touch the fish and ginger was dry. My husband and I paid our bill and actually went to another restaurant where we ordered the exact same thing and paid 10 dollars less at another down town sushi bar"}
