{"text":"Decor is great, clean washrooms, the place looks fantastic. Service was friendly in a toting family way. Owners, husband and wife team, married 41 years very welcoming best part of the dining experience at Omonia.
Dips were excellent, flaming cheese was fun and very tasty. The good food came to a close after the dips.  Went with the Prix Fixe special, $25.00 four course.  Dip was excellent, fresh warm pita with a generous serving of dip. Followed by a sad Greek salad,  chopped head lettuce a slice of crunchy tomato just like a sushi bar salad. Ordered the roast. lamb, horrible, is this what mutton is all about? A large chunk of boney fatty boiled meat served with boiled potatoes and rice swimming in a watery runoff. Looked bad tasted worse. Three of the group ordered it all of us were disappointed and left the majority of the plate untouched. Deserts were tasty.  
Best dish ordered seemed to be the red snapper.
Too bad, great looking renovation, caring staff in a nice uncle sort of way. Will stick with the Astoria next time."}
{"text":"went there for lunch during the greek food festival. Food was pretty lousy and really really expensive. A dried souvlaki pita with some letuce and chicken shishkabob for $15 - what a ripoff!!!

Messini on the other side of the street, has much better/fresher food for 1/3 of the price."}
{"text":"I love this place.  The owners and servers are friendly and welcoming.  They accommodate reasonable dietary requests, which for me is a gluten allergy.  I have to say I usually have the same thing every time I go here - but that's probably because it is so well executed. 

My husband, who has a very healthy appetite, started with saganaki opa, followed by lamb sausage as his pre appetizer appetizers.  Then we both had greek salad - the feta cheese is very soft (I suspect it may come from high end Alex Farm Cheese across the street but can't confirm) and the dressing is soft and delicious.  He then had chicken souvlaki and I had the gyros dinner (just rice for celiac/gluten free people as the potatoes are delicious but sadly are lightly dusted with flour).  

This place is friendly, warm and predictable.  My husband said that he has come to rely on Greek restaurants tasting all the same but the flavours at Omonia were different yet delicious.  And I am very comfortable coming alone and they have no problem with a table for one.  A quick trip on the Bloor line to Chester, walk one block east and there you are.  Enjoy."}
{"text":"Had to write this review, I'm hosting Christmas Eve dinner this year and decided to do a platter of Calamari. Called this morning and a lady picked up the phone and I asked if we can do a medium platter for pick up and she was kind of rude over the phone stating basically that's too small of an order. I found this kind of odd since they did this last year for us and the year before, granted it was a nice gentleman is who I dealt with. 

Her service was extremely poor and since the restaurant is sold to new owners hopefully they change the name of this restaurant. 

Good riddance!"}
{"text":"Oh, dear. I'm admittedly new to Toronto and have not made the rounds of the Danforth Greek restaurants, but this was A Major Dissapointment. This place is lovely, nicely decorated, cute bar, lovely patio. We enjoyed the bottle of wine we ordered and the dips were fine... for that I'll give it an extra star. But that was it for good stuff. I had the prix fixe menu - and it turned out to be a hamburger patty on a plate next to fries. I'm not exaggerating. It was supposed to be \"stuffed with cheese\" and eventually I found a small amount of rubbery something hiding in the middle. My friend got a steak, which was bland and overcooked, and more fries. Meanwhile we spent most of the meal in a futile effort to flag down their disinterested wait staff. All of this for \"nice restaurant prices of $15-$20+ per plate?? Hell no. Whatever this place is, it isn't Greek and - atmosphere or no - I won't be returning to waste money again."}
{"text":"Top Greek restaurant I've been to in Greektown. They offer a great vibe while being busy as well as when there are few tables full. Thy offer one of the best souvlakis I've had. The perfect place for a date. The entrance with the bar is great for long waits and the bartender is always friendly. Great place!"}
{"text":"We had a groupon, which you have to make a reservation, which I totally don't know why. the food was ok, but much smaller portions, and when the food came there was no rice, so we had to ask for rice, We asked the server to recommend a wine, and he brought us one, but must have chosen the most expensive, as it was half litre for $29.00, when I got my bill. I don't think I will be returning there anytime soon. When I went to pay at the front, because the server, was taking too long to come back, the hostess, said so your giving a $2 tip, to him, I said I think there is 7.50 there, and I was giving this $5, I should have just asked for all of my change back.

Next time I will try somewhere else, I feel it has gone down hill, since the renovations"}
{"text":"Ordered delivery. food arrived hot and under an hour. I ordered the pork souvlaki dinner and fried Calamari. The rice was so good! The potatoes melted in my mouth! The pork was delish. The  dried calamari could have been crispier but that's probably due to the condensation of the container it was packaged in. It was a little pricy but also really enjoyable. For takeout/ delivery, it was better than most. I will definitely order again."}
{"text":"We ordered delivery. It took over an hour and when our food finally came it was very disappointing. I love Greek food so I can't say it was awful, but it was definitely mediocre. I would not order from there again."}
{"text":"Just because the restaurant has been around a long time doesn't mean its good. Its overpriced with nearly non-verbal wait staff and out of 4 mains, no one was impressed. When we asked for pita the response was... \"we already gave you bread\"  :-)  $21 lamb chops were thin sliced to appear like a large portion undercooked filled with bone grizzle and fat - inedible. With a great location on the Danforth I guess they don't care."}
{"text":"I actually quite enjoyed my experience at this restaurant!  Went on a lovely summer evening and sat outside, great way to watch the Danforth happenings while eating good food with nice wine.

Pros:
Great service! Super friendly staff that were helpful and even joked around with us a little bit, I liked that.
Clean, very nice and subtle decor
Great patio, we were asked if we smoked and placed on the side away from smokers which was great
Tasty enough food, no complaints there at all (had calamari, gyro plate, greek salad, chicken souvlaki, and the saganaki which was SO GOOD!)
Not too bad of a wine list with different size options

Cons:
Prices were a little more expensive, but pretty standard with Greek restaurants
Greek salad came with iceberg lettuce in it (not really a fan of that)

Overall, I enjoyed the experience and may even be back again if I'm in the area."}
{"text":"Hi everyone! 

My family is Greek and we are major foodies. We appreciate a burger from South Street and great food from Susur Lee. We have eaten all over the world. We live in Toronto. This restaurant is an embarrassment to Greek cuisine. It's over priced slop.  We already knew, based on YELP that it wasn't great. However, my wife who is pregnant wanted crappy frozen gryo meat. This place has it. However,  they are criminal in the amount they charge you for it. Forget about quality. It doesn't exist. Who am I? I used to be a private chef. I love crap food, but at a good price. I will spend $400 per person on a meal if it is amazing. However, this place deserves to be shut down. DO NOT WASTE YOUR TIME HERE. 

They get one star for the nice wait staff. That is about it."}
{"text":"Food was good. Service was good. Staff was friendly.

The food didn't knock me out (though it wasn't bad)  but the service was much better than most places.

Seated on the patio, nice."}
{"text":"I went yesterday for lunch. The service was good but not the food. The avogolemono did not taste like lemon at all - tasted more like chicken noodle soup with rice instead of noodles. Then I had the lamb roast. It was very dry, and came with rice ( I had one bite and spat it out- was dry, old and salty) and potatoes. The potatoes were mushy and soft. I've only ever had roast potatoes at Greek restaurants not boiled ones. I thought I'd be okay, but had diarrhea the rest of the afternoon!!! Do NOT go there! You are better off eating food court Greek food!! :("}
{"text":"Never again!  This place is very inconsistent.  Went August 3, 2013 for dinner with a group of people. 2 of them got sick later.  I had gyros dinner.  You can tell the gyros was from frozen.  Even the calamari was from packaging.  I am never eating here again!"}
{"text":"We had a voucher for this restaurant and had to reveal that we did so when we reserved....the place itself is well appointed but the service and the food was substandard...maybe because we were 'voucher people'...We would not return, with or without a voucher"}
{"text":"I'll preface this review by saying this is my very first written restaurant review. I only see myself reviewing places that are either absolutely out-of-this-world good, or so bad that the public (and restaurant owners) should be alerted. OK, here we go!

Motivated by a mutual craving for Greek food, my mother and I ventured to the Danforth in hopes of finding quality food at a reasonable price. (RIP Zorba's!) We stumbled upon Omonia and, recalling a past recommendation from a friend, decided to eat there. 

We were seated on the front patio, it was nice, and our waiter was charismatic, making us feel comfortable and confident that we'd picked the right place (we couldn't have been more wrong). After some deliberation, we ordered the 'chicken souvlaki' and 'oven roasted lamb' (which was highly recommended by our server as one of the chef specialties!).  

Here's where things went downhill. 

1) The wait. We WAITED OVER AN HOUR for our food to arrive, and considering the restaurant was only moderately busy, this is simply unacceptable, and a red-flag I suppose. I was assured by our server that the wait was due to the oven roasted lamb being one of the more high quality dishes, and that it's absolutely worth the wait! 

2) The portions. When our food finally came, the portion sizes were noticeably stingy. My mom's souvlaki was a single measly skewer of small chicken pieces on a blanket of rice, not a bed, a blanket! My lamb was the normal size for a shank, however served with just 2 small potato wedges and, again, a small serving of rice. At this moment I thought to myself: \"this is either going to be the best food we've ever eaten, or we just got gipped!\" Unfortunately, the latter proved true. Again, unacceptable. 

3) The taste. The chicken had an odd flavour. The only way I can describe it is stale. It was also noticeably dry. Not even the thimble of tzatziki they provided could remedy this. The rice was hard and bland and without a doubt contained what had to be McCain's frozen peas and carrots. The best part of the dish was the few lemon potato wedges, but, even then, average at best. And when the potatoes are the highlight of the meal, something sure ain't right. 

The roasted lamb. Where do I even begin with this? The lamb looked, tasted, and had the texture of a piece of meat, devoid of any seasoning or marination, that somebody simply seared in a pan, and then 'finished' in the oven until it was deemed a passable texture to maybe serve. There was not a drop of moisture or flavour to be found in this meat. For something that was sold to me as being \"braised in mouth-watering gravy\" (Omonia Menu), I felt, and still feel deceived to put it lightly. The souvlaki was bad, but the lamb was criminally bad! To whoever cooked this stuff: Why?...... Just why? 

The food is honestly below what I'd expect from a food-court Greek chain. In fact, I'll take Mr.Greek souvlaki that's been sitting under heat-lamps over this place any day!

4) The price! For what you get, this food is nowhere near worth the $$$ they charge. We got off relatively easy as we didn't get any alcohol, appetizers or dessert. Our bill would've been at least double if we had. You and your hard-earned money deserve A LOT better than this!

My mom and I don't go out to eat all that much, but we still go out enough to know when we've been wronged and both agree this has to be one of the worst experiences we've ever had at a restaurant. I'm shocked this place is still in business. Skip this one! You can absolutely do better on the Danforth or anywhere really! 

Afterwards we washed the bad tastes from our mouths with a good ol' gyros ($5) from Messini's and some loukoumathes (Honey Puffs) from Athens Pastries. Delish! 

Omonia is not Greek food, it is Bad food.  

1/2-star out of 5."}
{"text":"Overpriced Greek food and the food wasn't even spectacular.  I'm not sure why the price range is at $$.  It should be more like $$$.  I will never go back.  There are other restaurants on the Danforth with better quality food at a margin of the price Omonia charges.  What a rip-off!

The staff was pleasant but the manager/owner wasn't friendly."}
{"text":"Kind of an unfortunate name- reminds of Ammonia... 
Nonetheless, I had heard good things, so I took my parents here for dinner when they got tired of the other exotic cuisines of Toronto.  We got the cold appetizer platter which would have been enough for dinner for at least 2 of us! I've been craving their spicy feta dip ever since! We also ate some other stuff that was OK. Greek salad- of course they have it.  Aside from the food, the setting is beautiful. The service can be slow, especially when they get busy. Also, when busy, it's so loud, it's hard to hear your tablemates.  If you can get a table on the patio, that's the way to go, but sit back and relax. That's not going to be easy."}
{"text":"Went here to take a break after walking Taste of Danforth. Like any warm Friday night, patios are always busy and today was no exception. We order two pitchers of beer for the table and calamari to share. The calamari was okay, nothing different nor exciting. Just deep fried. 

A number of tables ordered the Omonia's Saganaki: crusted cheese and flamed when it arrives at the table. It was so good but of course if would be good, its deep fried cheese. I don't regret it!

I would go again for the atmosphere and patio. Its so cute with its shades and hanging baskets. It reminds me of back home, down to the flowers at the entrance. Service was good. The owner greeted us at the door and him and his wife ensured we received a table cause it was 6 people and everywhere was packed.

Everything costs $130 including tax and tip."}
{"text":"My wife & I had a Groupon for this place, and for the price, it was very poor value & quality.

We ordered the grilled calamari, the saganaki (it's cheese on fire, we have to do it), and the combo souvlaki.  In summary:

Grilled calamari: Didn't even taste like calamari.  My wife couldn't even finish her share.

Saganaki: OK, most are better than this.

Souvlaki: Wouldn't do that one again.

Even for half price, we wouldn't return.  Not the worst, but pretty bad."}
{"text":"I came here a sometime in March for lunch. My experience here was FANTASTIC and would 100% come back. The food was GREAT. All the portions were extremely large (almost got full just from the salad itself - which was fantastic). My main meal was fantastic and service was absolutely great. The waiter recommended we tried a dessert, and I'm so glad he did. The dessert was amazing and the presentation was superb!!! Everything was great and because it wasn't as busy the owners even had a quick chat with us which was nice. Would definitely recommend anyone to come here, I definitely will!"}
{"text":"The portions are very generous here so beware. Their olive tapenade is delicious, as is their eggplant dip, and their taramousalata. Actually all their dips are great. Their pies are light and satisfying. They do everything in-house, which is evident. I love the fact they don't serve the same old bland rice pilaf everyone else does on the danforth; they have integrated subtle herbs and spices without overpowering the rest of the entrée. I recommended trying this place; it is a friendly atmosphere."}
{"text":"Better than most on the Danforth but still pricey for what it is.  I would pay the premium and go here over some of the other places. The beef-tek was amazing, a hamburger patty stuffed with amazing cheese etc... and the portions are huge. 

What made the Danforth popular in days gone by was good cheap Greek food served from a steam table, they all did it that way at one time. Everything dish under the sun was available, you pick what you want as you walk by and then they would bring it to you all at a very low price. The Danforth seems to be struggling with going high-end and I personally just don't class iceberg lettuce, pork, rice and potato's as high end. 

This place is good but I would like to see a return to the old style steam table."}
{"text":"Meh. Went for Date Night w/wife and was not impressed. Wife has suggested Pappas..should have listened. Walked past and Pappas patio was half full, Omonia's was full. Now we wonder why.

Nice people watching seats on the patio. Service was good contrary to previous reviews. 

Cold Dip Platter to start - Tzatziki was pedestrian, runnier than I like. Hummus was goopy and plain. Tirokaftieri was ok, but not near spicy enough. Pita seemed sufficient, along with the free Bread Basket to eat the dip.

Wife - Small Village Salad + Lamb Chop Side + 2 Pork Sticks Side. Salad was fine, Chop was overcooked, fatty and gross. When my wife says a Lamb Chop is gross, trust me it is gross. She thought the sticks were mediocre. Not worth the price.

Me - Chicken Feta Pie + Greek Salad - Pie was actually pretty good. Large portion, Great flavours. Salad was a joke. Wilted cut iceberg lettuce covered in way too much oil sprinkled with some flavourless feta.

Overall, seriously overpriced for a seriously under average meal. Great patio, but I dont see us ever going back.

Honestly, we have had a better meal at Mr. Greek for half the price every time we have been there."}
{"text":"I had the most disappointing experience here.

Nice weather outside, but the patio leaves much to the imagination.  You're on uncomfortable chairs, with children running around and on a slant.  Not great.  Service was awful.  I think the guy, in the right environment, could have been a good server - at one point we were told they were \"down 4 staff members\" - but given his current circumstance, he was not.  It was slow, rude and inefficient.  Telling someone constantly, \"I'll be right back,\" but never doing anything is not super helpful.  They messed up both our orders.  The food was lacklustre and pretty tasteless.

This will be my last time going for Greek food in the Danforth.  Too far for no reason."}
{"text":"A friend and I were hankering for some greek food a couple months back. Popped up to Danforth to see what looked good. We walked by the dueling patios of Omonia and Pappas Grill. We chose Omonia simply because it didn't look as desolate. It was already pretty late for dinner, but we didn't want to be the only customers on the patio.  
First let me say that our waiter was awesome. Steve i think his name was. Oh Steve! He was so chill and non challant, yet chatty in a super endearing way. He told us what was good and recommended a nice Greek wine. I just felt like appetizers so I had a saganaki , and a plate of several dips with pita. Wow! The dips were SO good. I had hummus (how could I pass up hummus?), tirokafteri (cheesy garlicy goodness), scordalia (Mmmm potatoes), and the olive tapenade (just to mix it up a bit). I was so full that I cold barely eat my delicious side greek salad. The wine Steve recommended to us was surprisingly delicious! I hate to say that I didn't expect much from a Greek wine, but it was perfect.
My friend had a lamb dinner and said he enjoyed it very much. Can't say I tried it myself, as I don't eat lamb. But he cleaned his plate, so I'm sure it was good.
We had no room for dessert as we were both busting at the seams. 
I'd definitely go back again. It was so nice to sit on the patio. In the winter I'll have to try sitting inside and see if I like the vibe in there."}
{"text":"I've been going to Omonia for more than 25 years now, and I just keep coming back because they have the best pork souvlaki in Toronto.
The décor is modern greek chic thanks to the renovation a couple of years ago, but the atmosphere is casual and the volume is low enough that you can easily carry on a conversation.
Service is definitely inconsistent. This is a family run place, and not all members of the family are good waiters, so this can be a real problem, especially when it's busy.
The wine list is small, so forget the name brand stuff and go with the house wines - they are better than most of the rest of the list and half the price. You don't need to know how to pronounce the wines, just order them and enjoy!
The food leans very heavily to the traditional greek fare, so you can get quite a selection of dips, salads and hot and cold appetizers, as well as a wide selection of entrees. All of them are good, but the real reason I come here is the pork souvlaki. Unlike most places that make a bland version from tenderloin, Omonia uses pork from the part of the leg that usually is turned into ham. They marinate it for 24 hours to ensure the meat is tender and flavourful, and then cook it over fire to ensure it has the best flavour. The result is, well, I said it already, the best in town.
I'm much more into flavour and quality than monster proportions, so the portion size is adequate for me, but if you are used to all you can eat buffets, you might be disappointed with the potion size to cost ratio.
I kind of miss the days of the pig or lamb roasting on a spit in the front window, but it's good to see the quality and flavour of the food hasn't changed.
Opa!"}
{"text":"Normal Greek food that is VERY overpriced for what it is. The only reason I come here is because they have Kokoretsi (the only place now on the Dandforth that has it) since Zorba's closed, and it's no where as good as the Kokoretsi from Zorba, so sad.

the protions here are small, and not worth it, for delicious cheap greek food, keep walking."}
{"text":"Frozen outside a window fireplace and a strong sell from a beckoning manager drew our work group in.  Tuesday night was not busy at all in Greektown, I saw barely more than a table filled everywhere including here.  Economy or not a happening night up here?  Flaming cheese, you'd think would be a priority.

At any rate, I'm only interested in the grill... sizzling meat visible through windows on the walk here piqued my 6th sense for meat.   I ordered a Gyros dinner sans rice and went with Greek sausage instead.  The meat was expertly cooked, grilled to crisp, sizzling, blackened edges but moist not overcooked interiors.  This was damn near the best sausage I've had and the gyro slices were along the same lines.  

Could have been a bit more happening but the service was nice and the food importantly to me, was excellent.  Thick Greek coffee to finish served espresso style."}
{"text":"Overpriced add-ons
Mediocre appetizer plate
Ordinary very dry and hard Bacala fritters
Noisy locale
Inattentive Service
Average at higher prices

Let me begin by saying that I really liked this restaurant a few weeks ago. It seemed a cut above the other \"brochetteries\" on the Danforth. We returned with some friends, and even induced this couple away from their favourite \"Astoria\" as we had really been pleased by the offering here.

This time it was not very good. The mixed drink was (Margarita), was ok but a bit thin and the non-alcoholic lemonade was in a 5 oz. glass including the ice.

The mixed cold appetizer platter was a composed of a few dips and very few olives surrounded by pita a few pita wedges, certainly not enough to eat the offering. When we requested more bread, we were asked if we preferred regular bread or pita. We were indifferent and naturally we got a few more wedges of pita for an additional $ 2.00. If the scant appetizer platter had cost much less than $ 22.00 I would have been a lesser insult. This is really taking advantage and we understood why we had  been offered a bread 'option', after the fact.

The men opted for Cod fritters a Greek Specialty. The fish had not been re-hydrated, and the fritters were tough and dry. I opted for the Horitiaki salad 'upgrade'. The piece of feta that was presented was truly bite-sized. The ladies opted for seasoned grilled chicken breasts. Our friend asked for some tzaziki to eat with her chicken. A very small container (1/2 ounce) was promptly provided and naturally was charged out at $ 4.00 extra. That was another insult. The chicken was mediocre and accompanying vegetable totally bland.

We were then pandered to by the Owner (?), who said that she had never seen her pikilia platter be finished by one of her guests. What a crock! Why do people say such nonsense and believe that it will be a compliment?

We had an open mind still for desserts and asked for the list. It turned out that nothing was made on the premises, and at that point we decided to have our dessert somewhere else.

It is a radical change in this restaurant's practices over a few weeks ago, both in terms of service and quality. What happened?"}
{"text":"Ordered delivery from here tonight... New Year's Day and just too lazy and tired after all the holiday gallivanting to cook!

Mr. Rosie S. ordered the Lamb Souvlaki Dinner and I got the Vegetarian Dinner #2 (spanakopita & Greek salad). We also ordered extra pita bread and tzatziki.

The tzatziki, as others have said, is incredible. EXTREMELY garlicky! I thought it was pepper-spicy at first, but no. THAT is how much garlic they use. I love it, and it's worth the dragon breath.

PLUS you're about to eat a (fabulous) Greek salad - feta, raw red onions, olives, etc. - more breath fun there. We both really liked the salad (his came with a small, mine with a large which could have fed four). 

D loved his lamb and the rice was very lovely - had a lemon tinge to the flavour. Potatoes were not so good - when it says \"roasted potatoes\", I think the browned, thick/crispy outside, soft inside. This was the peeled-potatoes-sitting-in-hot-liquid-all-day type. Basically mashed potatoes still in the shape of mashed potatoes.

The spanakopita was very nice - not mushy, quite crispy, good flavour. I feel that the majority of the time, Greek pastry (especially delivery/take-out) tends to be very oversalted or completely bland). This one is great - no gross frozen spinach aftertaste, great cheese blend... loved it. 

We will probably end up ordering from here again - a nice break from the pizza and Asian delivery!"}
{"text":"I'm very surprised by the reviews here, as I had a really great experience at this restaurant.

Firstly, the place is well decorated with good light and huge windows. The noise level isn't bad, we were able to all hear each other perfectly fine.

We had to wait a while for some of our party to show up, but they were very attentive and accommodating. They brought us drinks and some bread to start. I had a Chardonnay from their collection of Greek wines which was very good and very reasonably priced. We had a great waiter who was very patient and had a great sense of humour.

We ate a LOT haha. I had the soup, which was very thick and flavourful which is a nice change from your average run-of-the-mill runny and relatively tasteless avgolemono soup. It had the perfect amount of lemon in it. We also had the saganaki, which was excellent, the dolmades (which I didn't eat, but everyone else said they were good), and the three-dip platter which was also very good. The calamari was very tender and well-seasoned, I enjoyed it very much. The complimentary tapenade was also tasty.

After so many appetizers, it was difficult to find room for our mains. I had the Greek salad with shrimp, which is pretty hard to mess up. The shrimp was tender and well-seasoned and the salad was very fresh and flavourful, with a good balance of vegetables. A lot of Greek restaurants basically hand you a plate of lettuce, but this was not the case with Omonia.

The soup was definitely my favourite part of the meal along with the appetizers. We had a great time and left stuffed full of Greek goodness! OPA I would definitely come here again! :)"}
{"text":"Possibly the worst service I've had in recent memory. The food itself was not good and largely forgettable, but the service really did us in. I dined with one other person, and I had been served and finished my entire dinner, and she never got hers. The waiter brought my dinner, didn't question the fact that he did not bring my guests, and then proceeded to ignore us for half an hour. We had to repeatedly call out to him and when we pointed out the lack of her meal, he vaguely blamed the kitchen which doesn't even make sense and then walked away. We never received an apology or even acknowledgement, and when we asked for our bill, he charged us for a salad we didn't order. Absolutely horrible, there are a dozen other places in walking distance that can do mediocre greek food and manage to actually feed all parties."}
{"text":"we've been coming here for years; food is ok, portions kind of small for the price, but quality is generally good.  came for my birthday and waited 40 minutes plus for food.  came only after I slightly freaked out at the wait.  grumpy older waiter says, we make our food fresh, ok?  totally the wrong approach to take with a pissed off customer.  no one ever explained, apologized or addressed this.  I can get mediocre over priced Greek food from any number of dives along the Danforth, so I think I'll take my appetite somewhere else.  soon enough you'll have enough empty tables at this place that you can easily keep up with the service, if you keep this up (and judging by the other more recent reviews the service is sliding).  the owners need to take heed soon."}
{"text":"Got takeout a couple times here, but probably wouldn't again. The food isn't very consistent. The first time was pretty decent, so we opted to order there again. But this time the food showed up 23 minutes sooner than we asked for it. As our guests were coming at the time we requested.. The souvlaki was over cooked, dry and tough. Two of the tzatziki containers had mold/fuzz on them... The pita was dry and hard... Definitely not worth another try considering there are so many other Greek restaurants around the Danforth."}
{"text":"Always love to eat out at The Danforth. Have  my regular places that are always guaranteed great food. We decided to live a little and try a different restaurant ..... Omonia. Don't know if they were having an off day, the service was very slow, the food took forever to reach our table. Portions were small. Don't think I'll be back any time soon. On a positive note our waiter was very nice and tried his best to serve many tables at once."}
{"text":"I had lunch at Omonia and ordered a chicken souvlaki pita and was dismayed with the soggy pita, the tough chicken, which, although highly \"flambayeed\" but  once inundated with very creamy tzaziki sauce, was alright. The raw onions, however could have been more crunchy and a little less soft. Moving  on... The pita came with a choice of a side; An extremely small portion for a side; My salad was of garden variety by default which meant soggy, no crunchy and just healthy. The servers were polite and soft-spoken. Service was timely and just at par. To further my dismay, my server accidentally overcharged me almost twice the amount for my souvlaki. Well, that would be enough for me to think twice before trying Omonia again."}
{"text":"Good service, had the Saganaki and it was really good, they give free bread plus plus.


Got the chicken souvlaki and it was dry asf, worse, the rice was hard... The roast potatos were mehh....

Go to Astoria when on the Danforth or even Pantheon, skip this place"}
{"text":"I'm suprised to see the reviews on here for Omonia. I think it's one of the better Greek restaurants on the Danforth but we're all here because we have our own opinions right?

VIBE 
Shiny. Clean. Super white benches inside. The patio can make you feel like you're in a Mr. Clean commercial but it's one of the most spacious patios rounding off the corner on Arundel off the Danny.  Service has always been spot on for me here. 
Clientele is a mix mash. Mainly adults but families are welcome here. A great place for a long, leisurely lunch in the summer. 

I EAT 
The chicken souvlaki is one of the more generous portions I've received in Greektown; moist and tender. Accompanients of rice and roast potatoes are nice but there is no orange sauce. I kind of like the orange sauce. It's probably better for my health that I don't have the orange sauce. 

OBLIGATORY CATCHY REMARK 
Omonia is not ammonia and though a bit pricier than its competitors, still worth a try. At least you'll get some ample patio space."}
{"text":"This place has been a favourite of ours for many years we discovered it about 5 years ago at taste of danforth and have kept coming back despite the distance because of the quality of food, ambiance and the warm welcoming faces of the owners and servers. The Gyro plate is a MUST have! Their tzatziki is fresh and so flavourful and the Chicken Exohico (a phyllo pastry filled with vegetables cheese and meat) is literally to die for."}
{"text":"First visit to this place 15 years ago when I moved into the area. Our dinner party was 6 friends who all helped me move into my new home. I myself am a chef, and between my friends and I we had expertise in both food, wine and service. It was a Saturday night and we were searching for a restaurant who can take a party of 6. 

We walked from Danforth all the way over to Omonia tired from moving furniture all day. It was the only restaurant that looked rather empty and should easily take our party of 6. They made us wait 20 mins to be seated when we can easily see how empty the restaurant was. The food was frozen goods, the wine was wino brand, the service looked like they hired the town idiot.

Party over 4 they automatically tack on a party charge even though they didn't cater to us as a party. Some of us got food and even finished it before the rest of us even ate. Even in the low lighting we could tell the salad had dead bits in it... In the end an appetizer and dinners with wine for all six of us cost over $480 including the tacked on 15% party charge, when they didn't serve us as a party.

I've been back once since 2000... a friend's b'day party (2015). It was pretty much the same over priced, over saturated, over bearing. The french fries tasted like Calamari, and the Calamari tasted like french fries (same deep fryer used). This time party of 5, cost over $400... not going back if someone drags me by the hair.

Decor is cheesy and best for ignorant tourist."}
{"text":"1.5 star?


We should have listened to the other Yelp reviews, but Eric L and I were hungry and this was one of the only places that had tables available (now we know why!)

Basically just terrible. Food was all awful and prices were jacked way too high. For the same price I could have had something much tastier at Ouzeri, Pan or Pantheon.

We tried the dolmades to start. $8 for 4 measley dolmades. The avgolemeno sauce they were doused in was TERRIBLE. I'm not sure wtf but it's supposed to be a bit runnier, and it was thick and gooey as if it had been made with cornstarch or something. Not good.

Then we had a mixed souvlaki dinner to share. I think it was $20 and super disappointing. We were expecting LOTS of meat (after all, it was supposed to come with chicken, beef AND lamb) but you only got two little skewers with maybe 8-10oz of meat in total. Plus it was all dry/completely overcooked. 

Best part of the meal was the half litre of house wine in which I drowned my sorrows. 

Servers were friendly but it just does not make up for the absolute crap quality of the food."}
{"text":"I had a pretty horrible experience here. I went there for a friend's birthday in a group of four. We ordered some calamari and each of us ordered a dinner. They gave us some bread, our calamari came out at a reasonable time and all was well. 

Then half an hour later we still didn't have our food. They basically told us it was taking a while because of a big takeout order that had just come in. Another half hour later, we were told that it was taking a long time because they \"made [their] food fresh\". We finally received our food at some point and it was definitely nothing to write home about for what we paid. 

Ridiculous reasons for the food coming out so late - at least apologize for the wait and own up to the fact that you probably forgot to put the order in or there was some other mix up. I definitely won't be returning."}
{"text":"We spotted Omonia and decided to try it. The place sits on a corner with a large dining room that is filled with doors that open to the side street. You enter off of the Danforth into the bar section of the restaurant which is separated from the dining room by the waiter's station and cash. The place is dark and cozy decorated with that 70s Brady Bunch faux stone that has been popular with a younger hipper crowd. In the dining room a two-sided glassed fireplace provides a focal point that is again framed in the faux stone. The floors are a dark laminate further giving the place a cozy feel, especially on a cold winter night. There are a selection of tables and a couple of banquettes. The menu has cold and hot appetizers, meat, seafood and vegetarian entrees and a small selection of sides. The prices are in line with the decor but not as expensive as some of the more upscale places that have been popping up along the Danforth. The service was quick and attentive and everything arrived plated beautifully. There was a great deal of attention to how everything looked but the food was really just the basic Greek food updated and stylized. You were paying for the plating and the atmosphere, not the quality of the food. The servings and the quality of the food was good, but not exceptional. We ordered a selection of appetizers and mains. Sadly, the attention to detail did not address the fact that the place became progressively colder as the evening wore on, one of the problems of laminate flooring and floor to ceiling glass doors."}
{"text":"We were here for New Year's Eve dinner and it wasn't that crowded when we were there...  We had mango smoothies which were really good and Melitzanosalata (eggplant dip) to start.  The eggplant dip was really tasty.  For the entree we had Stuffed Lamb Exohiko (which was a featured dish, basically it was lamb in filo pastry) and grilled chicken breast.  the portion size was definitely good, there was still lots left over, the lamb was very good, but the chicken was way too salty.  We mentioned this to the owners and they offered to do an exchange, but we just let it go.

Overall, this was a great new year's eve dinner and a great way to end the year."}
