{"text":"This is a nice, clean restaurant serving a population that seems to be in love with the shawarma. The name, for the uninitiated (hey, my teenage son had to clue me in...) is the dish served on a bed of rice. I chose the chicken on lentil rice. It was good while my son felt that the basmati was not as good. I am not sure why, but the service was slow. While the young woman was preparing our food, the manager or owner butted to the front and served himself his dinner while she waited to finish our dishes. Not sure why he felt the need to do this but it shows me that he lacks common courtesy and sense. And yes, like the other place down the street, the food was served just this side of cold. I have a suggestion. You take the time to set up a nice place. You prepare what looks like good food. Please serve it hot! And for the manager....let the customer be served and yes, they will come back!"}
{"text":"I am a long time Yelp lurker and an avid shawarma lover. Osmow's is very overrated. Lazeez is good but I noticed there was a new opening in Streetsville and found out On-Z-Rocks is open till 2 on the weekends. I work late everyday so it's nice to find a shawarma place open late other than disgusting Osmow's. I tried the on the rocks and the rice they use is my favourite - basmati. Although they also offer lentil rice as well. The chicken is so tender even when cold. The sauces are good and they provide plenty of sauce unlike many places where you go through sauce and have to eat the remainder of rice dry. They have three different sizes which is nice. The large is $9 taxes in which is on par to Lazeez. Some say too many shawarma places in the area but I think if On-Z-Rocks keeps up the consistency they will be here a long time. The few tables and chairs outside seem intriguing for a summer time hangout. The location is also perfect on the corner of the street with parking easily accessible."}
{"text":"Rice was tail but had nice staff gave us free desert but also found a hair in my food so ik it's not the best not a fan of the food but great people not that good zbela"}
{"text":"Service was terrible.. Couldn't get my order right, made me pay the difference because THEY messed up my order..  The quantity was way too small for $9 for chicken on the rocks. In that case, I'll walk over to osmows and get the same thing but more quantity. After finishing it, I wanted $4 of my $9 I spent for it back because they shouldn't be charging anything more than $5 for a large with the amount they serve.   They use long grain rice, which is nice, but their chicken is more or less the same as Osmow's or Lazeez. Their hot sauce is like a watered down Franks Red Hot, and their garlic/tahini sauce is too sweet.  That will be my first and last visit.. On Z Rocks is real late to the \"chicken on the rocks\" game, and they have no unique value proposition.   I literally walked out of this place and debated going to Burrito Boyz next door to get something to fill me up. Too bad they can't live up to their hype.. Oh well."}
{"text":"Awesome tasting shwarmas for an even better price! Full menu of amazing items to choose from. Great options for toppings/sauces (I love the hot sauce they use). Shwarmas are made with both breast and thigh meat giving it a nice mix, and grilled (not pressed) to perfection. Very clean restaurant with tons of room for in-house dinning. The owner is humble and knowledgeable, a rarity in today's food world. Will definitely be back to try the rest of the menu very soon!"}
{"text":"I ordered a large Chicken Shawarma. It cost $8.50 total and was massive. Very tasty as well. Great value. I'm glad I ate there rather than takeout because the last few bites were messy due to the ample sauce. The restaurant itself was clean and comfortable and the service was fine. I would go back there."}
{"text":"I simply can't stop coming here for the great food and amazing service. Call ahead to save some time . Definetly beats waiting in line like a zoo at osmos ."}
{"text":"About a year ago, I went to NYC for the first time and I was told that I must try the Halal Guy's famous chicken and rice dish. I did and I fell in love. Since then, I've been trying to find a similar dish here in the GTA.  Eventually I heard about a dish called \"on the rocks\". From the pictures, this looked very similar to the Halal Guy's chicken and rice dish, so I decided I needed to try this dish. From my research, there's three restaurants that sell an on the rocks style dish. On-Z-Rocks is the newest of the three, and I decided to give it a go because I heard the service was faster at this restaurant.  I decided to try On-Z-Rocks on a Friday night and it did not disappoint. Here are the highlights: - Lots of parking behind the restaurant. - Establishment is new and clean. Plenty of seating available. - Food was made relatively quickly. It took about 10 minutes. - Portions were large. - Food was great! I ordered the On-z-Rocks and I thought it was really great. Chicken was well seasoned, sauce was good and they did not skim on the sauce as well. Only disappointment was the hot sauce is not very hot at all.  Cons: - Hot sauce is not very hot. - Cashiers were a bit new and thus a bit slow at taking orders. Not a big deal though, they'll speed up with time.  On-z-rocks was definitely not the same as the Halal Guy's chicken and rice, but I still found it to be pretty great. Since trying On-z-Rocks, I've tried another one of the 3 restaurants that server an on the rocks style dish. On-Z-Rocks is still my favorite though :).  Also note: I've read some of the other reviews posted here and I'm pretty surprised. I did not find this place 'disgusting' (as it was a brand new establishment that was pretty clean), I found the chicken to be very flavorful compared to another competitors on the rocks, and I actually like having a lot of sauce on my chicken :)."}
{"text":"I've been to many shawarma restaurant but this one has the best kick of taste of all them in mississauga. I would recommend to friends and I would love to come back to try other menus as well. Friendly service and ya! can't say much just taste really good even it was closing hour i went !!!"}
{"text":"First time in and I gave the \"on z rocks\" ( rice,french fries, and chicken ) a try, it was good but the suicide sauce wasn't hit at all. The restaurant itself was relatively clean, plenty of seating, and the staff was very friendly and helpful."}
{"text":"Went for lunch today. Had a falafel platter for me and two falafel wraps for my members. The place fairly new and perhaps they are trying to figure out a few things. The cashier seemed to be owner and two folks had bit of a rough time decipher the order on their screen.   The food took longer to prepare. I had the platter with Greek salad, fries and lentil rice and four falafels. The cashier asked me onions ok in the salad and I said yes but the salad had no onions or feta cheese. The falafel a bit in the dry side. The salad was OK. The rice  was simply amazing. Nice flavour and perfectly cooked.   The wraps were good. We ordered the large ones so they take two pitas and makes them. The place where the two pitas meet overlapped  too much causing it to be too doughy in that spot. Otherwise good. The fries with falafel were less for the upgrade price we paid for a canned drink as well.   Would give it a try again for sure."}
{"text":"It's another copy cat of Osmow's down the street. The lady at the cash is somewhat friendly, but the girl making the food has some kind of mental or health issues. I mean I ordered large Chicken and Rice, but the amount of chicken she put on the rice was awful ridiculously small quantity.  The taste is mediocre, quantity is Okay. Staff is horrible. Place is clean. They do not have much customers as Osmow's takes away all the business. Only reason I went here was because there was a huge lineup coming all the way outside in the parking lot for the Osmow's. Else I would have never come here.  If you have come to this review, you obviosuly have either doubts about this place or just checking out reviews before coming here for food. Plead take my advice and go to Osmow's instead. Even if you have to wait for some time.  Sorry, but you guys have a lot to work on."}
{"text":"Another mediocre shawarma restaurant in Mississauga, but wait - with a twist.  Pro: great location  Con:  1) B- to C+ for quality of food. 2)  D+ for extraordinary poor service  Explanation:   I went there for lunch today while taking a break from bicycling.  I saw the posted student menu so I asked for an item on it.  He flatly refused simply saying \"it is for school people.\"  I take classes in UTM and had my ID with me but he was so adamant and foreboding, I quickly gave up and ordered off the regular menu.    The proprietor looks like Marlon Brando after a night of alcohol binge, and too many midnight snacks, simply refused when I kindly asked for a cup of water with my meal. But the best part of his response was - get this - he rolls his eyes and sighs when I asked him for a cup of water and says, \"I don't have any cups.\"   It was a surreal experience.  I looked around the restaurant, and there was one other patron - a lone hobo who was barely coherent.  And I looked at myself.  I drove there in a $3000 bicycle and dressed better than the the hobo patron at the restaurant, so I just don't get it.     Verdict:  If you want mediocre shawarma at cheap prices with less than cordial attitude, go to On-Z-Rock.  I for one prefer to eat at places that have higher standards in food quality and customer service.   As consumers, we don't expect restaurant workers to bend backwards to cater to us, but at least we expect to be treated with minimum standard of human civility.  Billybob L."}
{"text":"Headed to the Bread and Honey Festival with my Baes when \"the feeding\" overcame me and I Zombied into:  On Z Rocks. My order: one large Rocks and one regular Chicken Shawarma.  The Rocks is Chicken Shawarma meat laid atop a bed  of fries, rice (lentil or yellow) or a mix thereof, then smothered with Tahini, Garlic and Hot Sauce. (sauces optional but then it would be the Rocks). On the advice of the owner or manager, I chose the French fry/lentil rice mix - HOT. Oh ya!  Chicken Shawarma fully loaded - HOT.  Chips B likes it Spicy!!!!  In about three minutes, the place went from three customers to a full house. Wow.  In about 5 mins I got my food and sat down with my Baes, who were stuffing their faces with Strawberry Gelato's from Swirls.  I opened up my Rocks only to observe that the fries were not added as ordered. Hmmmmm.  Oh well. I peeled back my Shawarma wrapper and with a fork in one hand and shawarma in the other, \"The Feeding\" commenced.  Bite of Shawarma, nom nom swallow.  Fork full of Rocks, nom nom swallow. Repeat. A pleasant discovery was the fried onions that were layered underneath the chicken on top of the Lentil Rice. Note, the rice had the consistency of Japanese/Korean rice. Sticky.  A bit on the salty side too. Hmmmm.  Was it an error and the rice was made too soggy or is it their thang???  Well, the combination of the sauce, chicken, onions and rice was \"ok\". Just to let you know, the \"Hot\" was mild.  The Shawarma was \"ok\".   The only thing that concerned me was a couple hours later, I couldn't stop drinking water. In fact, I couldn't stop chugging water.  Ahhhh was it my old friend MSG???  How long has it been since I suckled at your teet????  I have missed you my old friend.  Lol. Don't think I will be back for more anytime soon but it was worth the try.  Peace out my fellow Yelpers."}
{"text":"Thank God for this place! When Lazeez is too busy, we come here. Loved the Rocks and chicken shawarma. Tastier than Osmows and not to mention more space and quicker service."}
{"text":"I worked at this place for two weeks and the reasons I left were as follows: 1. The owner (Shady or as he calls himself Jason) claims his veggies are all freshly cut every morning, lies! He uses left overs from past days puts them in a new tub and just adds more. Ends up feeding people almost expired veggies. 2. He claims he has fresh new chicken shawarma every morning, another lie! If you went to him as soon as he opens and until lunch time he'll serve you chicken that's been in his fridge over night claiming that it's cooked fresh.. Also with the rice, same exact thing, brings it out heats it in a microwave and makes you think it's fresh food. 3. Anyone that orders lentil soup, is being absolutely ripped off! It's soup that's made at the beginning of every week if not every two weeks and is heated in a microwave per order and again serves it as fresh \"lentil soup\".. 4. Jason the owner, smokes inside the restaurant premises!!! Something that if found out by the city would lead to a hefty fine!  But obviously he won't admit it.. And the most disgusting part is, after he smokes he will go upstairs to the kitchen and work with his filthy hands and touch all the food like nothing had happened.. 5. Also for anyone looking to get a job, DONT GO THERE! He is the stingiest man I have ever worked with.. Worked with him for two weeks for extremely long hours! And only got paid for one week.. When he was asked about the second paycheque, his excuse was that I didn't submit my hours (which I had done) but he was trying to be smart about it.. Lastly, I wrote this review to raise awareness against such filthy places that shouldn't even exist in our city.. But it's a matter of time until people actually realize the kind of garbage Shady or so called Jason feeds the people."}
{"text":"Went there on an off day for lunch and has the \"On Z Rocks\" dish with half fries and rice. For the most part the food was actually quite good and I found it had more taste than Osmows. My only gripe would be the service; they had these two girls, while they were quite pleasant it wasn't my best experience there. I also like the fact that this place isn't as busy as Osmows so you can get in and out very quickly. Parking is also less dicey than Osmows (anyone's who's been there knows what I mean)."}
{"text":"Located in streetsville on the main strip can't miss it. Great parking out back with a lot of space. Outside and inside very appealing and clean. Friendly customer service.  Now to the nitty gritty, ordered a larger chicken on the rocks, yellow rice, medium hot with standard sauces (tahini, garlic, and hotsauce).  Also ordered the comparable equivalent from Osmows (large chicken on rocks, medium hot). On-Z-rocks loaded, and I mean loaded up on the sauce where it completely covered the entire dish. They have yellow basmati rice and lenti rice of which you can choose between (we chose the yellow basmati rice for comparison purposes) and they give you a larger portion then Osmows by around 20-30% by weight and are at a better price point.  I felt that the amount of chicken they used is just slightly less than Osmows but they used more rice and a heck of a lot more sauce. I also find that the basmati rice doesn't give it as good a bite and mouth feel in comparison to parboiled.  Overall, I found the dish to be overly saucy and had a milky and slight greyish undertone to its aftertaste.  The viscosity of the sauce was slightly thinner than that of typical sauces and the taste was much more neutral that added to its dominant presence in the dish.  The chicken shawarma shavings less flavorful and overall tougher and not as thinly sliced. Overall I give the dish a 5-5.5 out of 10. The amount of sauce should be tweaked, better chicken to rice ratio needed, and a revisit on the type of rice used in my opinion. While eating it, the milky saucy taste drowned any other flavors and the bits of chicken tasted tough and was an overall unpleasant experience. I feel it has a lot to live up to and needs a lot of work to be a better dish. No comparison to osmows chicken on the rocks."}
{"text":"Boyfriend came here tonight after a long day of work because he was starving.   He's a HUUUUUGE fan of shawarma plates and has gone to multiple Osmow's/LAZEEZ etc. Having heard about this place he begged me to come give it a try with him.  Verdict? Not so great. The establishment itself is easily accessible and has ample parking. It's clean inside and has a good number of tables and comfy chairs for patrons.  We ordered Chicken on the Rocks with rice \"medium\". Compared to LAZEEZ the plate itself felt really light. When we opened it sure enough there wasn't that much food in there. Also, we ordered a large and he was given a small instead. For $9 the amount we got was NOT worth it.   The garlic sauce was a bit on the sweet side and quite runny and the hot sauce wasn't very hot at all. It also smelled like Frank's red hot sauce.  All in all, I think we will be sticking to LAZEEZ from now on!   The only plus to this experience was the chicken they used which was actually quite soft and flavourful."}
