{"text":"Prices decent, customer service good, and quality of products also quite good.  My mother wanted me to bring her some Russian type of food items that she's used to, so I found this Ukranian grocery type of store that had just the type of items I need not far from where I work.  Customer service was very decent with the staff giving directions when I couldn't find certain items. They accept card (debit and/or credit) for purchases over $10.  Their prices were all-in-all decent, and the quality of their food was very good, with lots of variety (eg at least 5 kinds of sunflower seeds, tonnes of varieties of black bread, etc.).  At this point, I'd definitely be willing to return to this store for any Russian food types of needs."}
{"text":"I think I've found a new \"go to place\"!! Fresh & Tasty International food market is actually a relatively large Ukranian deli that also sells a smaller variety of Eastern European non-deli products.  I have to say right away that my deli experience was absolutely fantastic, and I haven't been this happy since I used to visit Fairway on the Upper West Side! Realizing I'm somewhat clueless about the special meat, the fellow behind the counter wasted no time in suggesting some of his favourite meats and providing samples. Now we're not talking a paper thin slice, but rather a large piece (~50-80g) cut off from 3 or 4 different and delicious varieties. Needless to say I was basically fed before I even left the store.  They cure, marinate, and roast several traditional varieties of ham/kielbasa etc. The smoked&cooked pork loin is more or less phenomenal, and I'm sad I didn't pick up more! Trying to find their website, I also realized that they have won at least a few national awards for their kielbasa. All the more reason to go back and try these varieties.  Before leaving the store, the lady at the register also informed me that fresh sweet cheese crepes have just come out the oven! The simple crepe was also very tasty and as promised, as fresh as could be!  3 varieties of meat (~1lb total), and a crepe all for under $10. All in all a very pleasing experience and I will be back."}
{"text":"Amazing hidden gem! Awesome service, very welcoming and very bilingual. Thought I'd feel silly only speaking English but they were super accommodating. They gave me samples of meat and cheese, told me their favorite. Lots of cool things-- Ukrainian, Russian, Polish, foods  Cool!"}
