{"text":"We had an absolute amazing time at Onyx Bar and Lounge!!!  We had purchased a deal on Travel Zoo that covered 4 cocktails and 2 appetizers for the amazing value of $45!  To be honest, everything was so over and beyond anything we could have imagined that had we known what we were in for, we would have dined there without the travel zoo deal!  

Our server Ian was so knowledgable about both the cocktails and the menu items.  All that he recommended was delicious!!!  We enjoyed the bone marrow and tomato and burrata boards, both outstanding (and filling) and washed them down with a few fantastic tequila cocktails our server talked us in to.  Nothing disappointed!  Ian was so friendly and fun to chat with, very personable!  He definitely knew what he was talking about when it came to the menu, and for that we thank him!

The ambiance was so welcoming, which to be honest, I did not expect.  I felt underdressed and out of my league pulling into the Four Seasons after being greeted by the prompt and professional valet, but once we walked in to Onyx, I knew these were just good people serving great food and Four Seasons did a wonderful job at making this a place for anyone!  

We finished off our night by enjoying one of their cigars (my fiancé loved it) over a cup of french pressed decaf (outstanding by the way, some of the best coffee I've had in a long time) and a couple of desserts.  The salted caramel macarons and chocolate truffles.  Both were unique and well balanced and full of perfect sugary goodness!!!  Overall, this was one of the best dining experiences we've had in a long time and we will absolutely return...not just to Onyx, but now we will try a night out a Talavera and Proof.  If the resort bar was this good, I can only imagine what their other on property concepts are like.  Try Onyx and ask for Ian and you are sure to have an unforgettable evening!"}
{"text":"As Donkey would say: Wo O O W.  Have you SEEN the views from here?!  Nestled beside Pinnacle Peak Mountain, with views that last forever into the valley - and hey!  ck out that sunset - do you see the moon?  Look at those STARS!

Ken was the most efficient, knowlegable and attentive server - good grief, I was almost (but not quite) getting uncomfortable by his outstanding attention and prompt service - I mean did i look like a celebrity ???

YUMmmEE caramlized pear flatbread pizza!  And funky handmade potatoe chips with sweet & spicy dip.  Huh, interesting!

We later moved inside, onward and into the catacombs of a private wine room in Talavera, the adjoining dinning area ... but THAT is another story... review.... experience..... 

Of course - i'll be back!  r u kidding ?!?!"}
{"text":"A nice place to catch up with a friend at the end of the week.  We selected one of the tall tables near the bar and enjoyed a pitcher of sangria.  Service was very attentive with both the bartender and manager stopping by frequently to see if we needed anything.  For a light meal, we tried the jamón and fig, and the roasted beets flatbreads.  I enjoyed the former with fig jam and blue cheese, savory and sweet flavors to accompany the jamón.  If you are still hungry afterwards, make sure you make reservations for Proof or Talavera with their outdoor (and indoor) dining."}
{"text":"I have to say over the last several months the staff has made great improvements in the service and timeliness in serving of the food. We're going more regularly to Onyx now and really enjoying it. A big shout out to Marissa who is my fave"}
{"text":"$5 for a soda and no refills.  This place has really refined their ways of screwing their customers. If they are screwing you on a fountain soda, imagine how else they are ripping you off. What a joke! Management must have their heads shoved so far up their a55, completely out of touch, but in touch with milking you for every dollar. Needless, to say won't be coming back."}
{"text":"We live so close by an have been coming here for over 10 years.  The views from the terrace are awesome.  There are some tables and comfy couches.  The last time we were there, a musician was serenading us, it was so beautiful.  I am not sure if the life music is only on Saturdays.  The margaritas are so delicious, the make them with fresh squeezed juices.  This is definitely a place to relax and enjoy the views or a sunset with a delicious cocktail or a glass of wine."}
{"text":"We were staying at the Four Seasons and decided to enjoy all the resort had to offer.  We stopped in to Onyx for a drink on the patio before our dinner at Talavera.  The patio affords beautiful views of the entire Valley and they had a nice wine selection to choose from.  Nice service, nice drinks and great views!"}
{"text":"5 star view, 2 star service...so I settled on a 3. Took them 25 mins to take our order: two virgin prickly pear margaritas. Then when it came after 20 additional minutes, I took a sip and they definitely weren't virgin! I pointed it out and she immediately realized she'd ordered them with tequila and said, \"Ohhhh no! My mistake! That's a HUGE factor!\" Uhh yeah, one could say it's the BIGGEST factor in a virgin cocktail. After another 15 minutes, our correct drinks came. Our server was very sweet and accommodating but man are they slow here. The moral of the story is this: if you plan on sitting down for drinks or food at Onyx, you'd be wise to clear your plans for the remainder of the evening!"}
{"text":"Great food, wine and service here. It's truly living up to being a Four Seasons establishment. Loved the squealing pig Sauvignon Blanc. Can't find it anywhere else but I continue to look. 
Excellent food. Staff made great suggestions. Highly recommend."}
{"text":"It's the Four Seasons, when you get an invite for free apps and drinks- YOU GO! They had the most breath-taking views and the live music was on point. I had a moscow mule and then some bubbly, the apps were fabulous! I hope to go back again one day!"}
{"text":"Wow!! The view are great here!  A nice spot to watch the sunset and enjoy some cocktails. My husband loves this spot.  Their staff and service is excellent.  The drinks are fabulous!!  We are so lucky to have Onyx in our backyard (super close to our home)......we can drive right up, valet our car, find a seat on the patio, order snacks and drinks and just relax!

Also a great spot to take visitors!"}
{"text":"The Onyx Bar & Lounge has some of the most breathtaking views in Phoenix making it in my humble opinion one of the best kept secrets in Phoenix. Located in the Four Seasons Resort it's a bit of a trek but if your looking for a romantic spot to share a cocktail and enjoy the beautiful Arizona weather then the drive is so worth it. They have a great cocktail menu and light bites and the live music on the weekends just takes the ambiance to another level! It's worth every penny for the pricey cocktails! A Phoenix must!"}
{"text":"You just can't beat the views here.  AND it IS the Four Seasons.  The patio is gorgeous and they often have live music on weekends. They also have a great 5 for $5 deal on Fridays for Happy Hour.  

The service last time was exceptionally slow and it took 25 minutes to get waited on last night so we were rather disappointed.  We first were approached by a female who said she'd be right with us.  Yet she never was.  So then 25 minutes later we stopped a male server and asked if he could help us. He told us that he'd get our server. We told him we had been sitting for over 20 minutes and she'd never come back to us.  He was gracious and did take over.

It's the Four Seasons, so drinks are pricey as is the food.  I recommend the salmon flatbraed.  Delicious and light.  We ordered the burata with pesto and bacon, but it was a bit bland.  

You come here for the picturesque scenery and gorgeous sunsets.  I've been a few times to various spots on the property and all are beautiful"}
{"text":"Was invited here to happy hour and was reluctant to make the 45 minute drive north but the view and experience was definitely worth it. 

Onyx is located at The Four Seasons and the resort is just beautiful. The views from Onyx are perfect and will probably be my top place to go for drinks if I ever want to impress someone with the views or make it seem like I have good taste haha. 

The drinks were amazing. I ordered a prickly pear margarita and it was so tasty(pretty too) and my fiancé ordered their drink of the day which was a raspberry martini.  

They had live music playing and when the sun set, I didn't want to leave! The scenery and ambiance is just gorgeous and calming. 

I believe happy hour ends at 6. Beer was $6 and cocktails were a couple dollars off."}
{"text":"The Brisket Burger is absolutely delicious and always cooked perfectly to order. It comes with candied red wine onions, truffle brie, and fries that you should be dipping in the provided truffle aioli. By default it comes with a brioche bun but you should instead ask for it to be served on the potato bun as the potato bun provides the perfect meat-to-bread ratio without the sweetness of the brioche.

I've had nearly every burger in town and Onyx's Brisket Burger is the second best burger in all of metro Phoenix."}
{"text":"Okay, the view is spectacular!  We had appetizers and drinks.  The appetizers were awful!!!  Very sparse servings and just blah.  The drinks were okay, but very expensive.  Service was ok.  There is just a rude vibe here.  There are so many other places to go where your dollar goes a lot farther and the food tastes great.
We will not return.  We have had much better luck at Proof, which is on site and much better offerings.  Go figure!!"}
{"text":"A cozy little lounge at the Four Seasons (Troon N). $15 cocktails but with the service to match, and a patio view to simulate a little getaway of tranquil serenity. I left feeling refreshed; that couldn't have been a bar."}
{"text":"Steven is one of the best bartenders! Excellent drinks but also kind, thoughtful and funny. Great combo. Repeat customers and my best friends and I will return. Samara is great too."}
{"text":"Always a good idea. This hotel bar has a life of it's own, beyond the resort.

I've enjoyed my stay at Troon North a few times and always find myself at the bar...but not just for the drinks. This hotel watering hole is a destination for more than just hotel guests. A place to see and be seen pouring a decent drink at Four Seasons prices. But you get what you pay for.

Beautiful people and views fill your eyes and the quick service, even from a packed house, will keep your glass filled. Onyx is great for a date night, pre-funk or to close the house down. I suggest all the above."}
