{"text":"Whenever I'm in a food court, which is quite often, my number one pick for lunch is Opa Souvlaki.  I always order the chicken pita, with the works (yes even the jalapenos).    The thing I love about Opa is the consistent good service and the fresh ingredients.  I like watching the cooks grill my chicken and put together my meal.  Even though it's a franchise, all the Opas I visit feel like mom and pops places where they care about your business and want you to come back.  The two Opas I visit the most are in Market Mall and Northland Mall."}
{"text":"Very good fast food! Best fast food I've ever had! Ordered the lamb gyro wrap and it was delicious! Very flavorful. Fluffy, warm and perfectly toasted pita bread. Choice of toppings with tzaziki sauce. Extra sauce at no additional cost. The side salad is huge and flavorful, chunky vegetables and traditional Greek salad. Needed some pepper but that's not to complain about."}
{"text":"Favourite Greek food restaurant in Calgary :) love the chicken pita wrap. And other than my face going numb and tears forming from too much jalapeno in one area, I've never had an issue :) I can look past that one issue"}
{"text":"Prior to moving to Calgary, I had never been to an Opa.  It is now firmly entrenched in my top 3 fast food places.  In fact, it is #1 on that list.  I have been to several Opa's in Calgary, but none more often than the location in Market Mall.  What I enjoy most about Opa is the healthier option available to me, or at least the illusion of health (I've never actually checked how healthy it really is, I just hope it's a better alternative).  The fact that the food is, for the most part, prepared right in front of me is a huge bonus.  It ultimately feels less fast food because of this, but is still prepared quickly enough to suit my immediate needs.  The quality of the food and service has always been great, specifically at this location.  That is a rarity for any fast food establishment.  I have also noticed that the employees are usually older than other places, even prior to the current economic downturn.  Perhaps irrelevant, but it makes me feel better having an adult prepare my food and not a teenager."}
{"text":"When I think  of Opa, I think of tzatziki and calamari.  Absolutely tender calamari and the best tzatkik sauce ever!  Try the Greek Salad - so fresh.  The dressing is the best I've ever tasted, great seasonings and great olive oil.  Stingy on the olives, though.  If you're looking for a low carb lunch/dinner, try their low carb plate - salad with choice of a meat kabob -  I've tried the chicken (very tender) and lamb (so succulent).  All for $7.99 + gst.  Pretty good deal for a low carb meal!"}
{"text":"Wanting a quick bit to eat and not wanting to spend time in a restaurant, I headed for the food court.  Now I wanted something quick, but tasty and good for me.  Opa was the answer, extremely fast walk thru service, ordered lamb souvlaki, with Greek salad combo and a small soft drink at $10.   Added some lettuce, tomato, red onion and my ever oh so favourite slabs of tzatsiki sauce.  If you are in the Market mall and want to eat quality restaurant sit in like food but don't have the time then this is your answer.    The lamb was so succulent and it was a nice large portion (5 huge skewered chunks). The pita bread was large and chewy, the tzat sauce just the right blend of tart and lemon and the Greek salad they give you is surprisingly huge.  Imagine, lamb, spices, tzat sauce and bits of feta, refreshing drink ... Opa delivers at 10 dollars."}
{"text":"For awhile there, I wasn't big on eating Meditarranean-style food (nothing against it, but was sure glad to discover it). I tried the Opa! Souvlaki at Market Mall, and I admit the hummus dip was too lemony for my taste. That's just for my own taste, some people prefer stronger flavors, and some don't. However, to my joy, I discovered they sell Baklava in sets on a plate, so that kept my mouth busy for awhile :)"}
