{"text":"Excellent food and service.  Great place for a quiet date. Tried 6 different dishes.  The Mushroom Phyllo was the best.  Will definitely come back soon to try the flatbread."}
{"text":"Excellent food and excellent service! Great for a huge group or an intimate dinner with your loved one. The open concept is great so that the waitresses can always see my table and check up on us when the water is low or if we need anything. Definitely a place you must try!"}
{"text":"Not your typical Markham restaurant. I think it makes for a perfect date night spot. The decor is chic, the tables aren't too close together, the atmosphere is classy yet comfortable, service is friendly and most importantly the food is great for the price.   This restaurant is known for their wine selection which is apparent by the wall decor behind the bar and the visible wine coolers. Ora has wine not on their menu so don't be shy to see if they have the type you like.  Its a tapas style menu with tons of selection - enough to satisfy the pickiest of friends or date.   Must eats: bone marrow, mussels, garlic shrimp (huge pieces) mushroom flatbread, steak, butternut squash ravioli, lamb  Honourable mentions: salmon tartar guacamole, leek soup  Room for improvement: scallops (mine was overcooked but a friend said it was good the last time she ordered it), jerk chicken wings (they're spicy and yummy but not jerk)  Desserts, soup and i think salad change daily."}
{"text":"Visited on Sat Dec 20 party of 10. We were able to make reservations in advance easily. The place is a bit hard to find as it's within idarts. A bit wierd that they have a designated washroom for Ora customer only and idarts customers can't use this washroom. They had a sign on the washroom to state this rule. The food was generally good with the option of ordering the set menu for $35 or their full menu. Service was definitely lacking. The server didn't take down our orders completely. She missed a soup, one guest's salman tartare was completely missed and we had to order it for a second time.    I ordered 3 flaming lambourgini's and the bill came to $66! I should have asked how much the drinks were before I ordered them, if I had known they were $22 each I would not have ordered them. The place was very quiet for a Sat night, and was about half-full. We were able to talk and have fun for 3 hours and they didn't rush us out which was good. We went next door to play idarts afterwards. Plenty of free parking in the lot outside."}
{"text":"Well I wanted to try out this restaurant because they said it was very good for wine. So we finally went in and try it. The service was good and the was good too but very small portion. We sat down at 6:30pm and finished at 7:30pm and thats because we never order a bottle of wine which I usually do. We did had couple beer. We were about to leave by 8:00pm and surprisingly the waitress came and said she have a reservation if we don't mind. Like WOW! There was 2 lounge table which can be seated 4 people was not offer. I promise that I will not go back again! I hope the owner will correct this manner."}
{"text":"From the name and location you wouldn't expect this place to serve Western food. It's a hidden gem for Western food in a Chinese influenced community. The style of dinner is my fav, tapas style, where I am able to try numerous items on the menu. We ordered the leek soup, scallops, mushroom flat bread, steak and Fries, salmon tartar, avocado salad, bone marrow, Chilean sea bass, mussles, garlic shrimp, steak, lamb and ravioli. I tried basically everything on the menu and it's pretty damn good !!  Some dishes were so good that I even ordered 2nd's eg. The bone marrow and mushroom flat bread is a must try! Items I didn't really like were the Jerk Wings. It taste more like a honey garlic jerk wing instead of Jerk flavour.   As for desserts, they said it's in house but I think they are from Dufflet as Ive had the exact same cheesecake from Dufflet. But I'm not complaining because I love Dufflet desserts and I would totally go to Ora just to eat the Dufflet desserts. lol   I've been told they have a very big wine selection, however, I'm not a wine connoisseur so I can't confirm this but they do have a large selection of wines from what I see.   The ambiance of this place is something you wouldn't expect as it's located inside I Darts. I love the atmosphere as it, nice and relaxing. The music isn't too loud so you are able to carry a dinner conversation. Tables are spaced out well so you aren't all packed together.  I would def come again to eat or  to just have a few drinks with some friends or have a nice quiet date night."}
{"text":"We came for a dinner using a Groupon coupon.  Food: Hits and misses, but overall 4 stars.  I loved the Mixed Mushroom Flatbread ($9) for it was fresh and bold in flavour.  The Seafood Croquettes ($7) were well made and well portioned, but the taste was subtle. I recommend eating it as the first course so you can taste the seafood better.  The Salmon Tartar Guacamole ($9) was very fresh and well presented.  I do hope there was a hint of lime to lift it up, but I could have asked for a slice of lime but I didn't, so it was my fault.  The Grilled Calamari ($9) was actually squid.  The flavour profile was Asian not Greek or Italian (the menu did state that it was marinated with ponzu).  It was tasty and the texture was just right.  The portion was small for the price and in comparison to other items ordered.  The popular Bone Marrow ($7) was stunning in presentation but was too oily to be my fav.    Services:  Attentive, polite, effective and gentle.  Everything was smoothly executed.  Interior decoration: With the variety of beverage and alcohol, plus the general cool, contemporary yet relaxing atmosphere, 4.5 stars as a lounge and as a dining venue.  The reason of the 0.5 star deduction was because the room was rather cold during my visit.  I escaped to the ladies room twice throughout the meal.  Value:  I am a value conscious diner (note: I used a Groupon coupon).  But I frankly think that the value is good at Ora.  The portion is not small for tapa.  The two of us were seriously stuffed with $41 of order.  We could use 1 fewer order, but who would do that when a coupon covered $40 of food.  Overall: 4.5 stars.  I would love to return to enjoy Ora as a lounge mainly and a dining venue occasionally.  To me, the venue has a stronger lounge vibe than a dining vibe."}
{"text":"Don't come here! We were given set menus, which should speed up he serving. To the contrary, we still did not recieve our mains three hours in. At that point, they were still figuring out who had what main.  The food itself was burnt to edible. Don't come. I believe the four star average rating and the prior reviews were written by the owners and family."}
