{"text":"Great local Restaurant, with Full Bar, Friday there is a fish fry with large portions of cod at a very good price. If you like local places and memories of years ago please stop in here before a chain restaurant, when these places are gone your only choice will be McSomething, with brass rails or playgrounds. The fish fry Friday has been going on now for 40 plus years."}
{"text":"This place is a hidden treasure! They have fish/seafood every Friday here! The portions are large & meals include fries & coleslaw for under $10!! Everything is cooked to order and you can tell the oil and the ingredients are fresh. This is the best fish sandwich & oyster sandwich I have ever had! There are also other things on their menu but I come for just the seafood. My family & I have been coming here for years!!!!"}
{"text":"I had a taste for fish on a Friday night and this place was recommended by a family member, so I said I would try it out.

I ordered a fish dinner and a plan fish sandwich to go, when I got home I was shocked by how much fish I got in one meal three large pieces of fish, fries, and coleslaw.  I can say I didn't care for the coleslaw it was dry and a little bland, the fish was fresh, flaky, but needed a little more seasoning so I had to add tarter sauce and hot sauce.  All and all the food was ok.  The price was reasonable for the amount of food you get."}
{"text":"***Avoid this place****

We just got home from the fish fry at Orbits restaurant in Ambridge.  Our party of six all agreed that we should have stopped at McDonald's for a filet-o-fish.

The place is a dive bar- usually my favorite for fish or wings- but this place is beyond awful. 

Friday is the only day the place is non-smoking, so it smelled like a dirty ashtray.  Dimly lit- and thank goodness for that- it obviously was not very clean.

We arrived and were glad that the only area to seat more than 4 was available (though I honestly wish it were not, and we had been forced to go elsewhere). 

They don't serve iced tea, except for cans of Lipton, and that should have tipped me off. 

We ordered after only a few minutes of being seated, but then the wait began.  

After an HOUR AND A HALF, we noticed other tables being served before us, despite arriving well after we had.  The waitress then told us that our order was next in line, but a full 20 minutes later, the same waitress told us that she had two more orders, \"and then ours would be right out.\" 

I am NEVER one to complain about my meal to the owners.  I figure that if I get lousy service or  bad food, I simply won't go back. 

For the first time, EVER, I was forced to knock on the kitchen door to get an answer.  The manager was INCREDIBLY RUDE, and failed to even apologize.  She just said that the regulars get served first, and that I should have known that, somehow.  At the time I was invited into the kitchen, the ladies were cracking up and eating French fries from an order. Probably ours. 

Eventually, we got our fish, which was nothing special.  Far greasier than average, fish with a bonus--  soggy black skin was visible under the breading. 

We will never return to this disgusting hole-in-the-wall.  Rude management and sub-par food make this dive a no-go."}
