{"text":"Awesome breakfast, I usually head their after I've been on a bender from the night before.  Always really tasty, the only drawback is one of the waitresses looks like a meth head and if she's working prepare to 'hurry up and wait'  I often find myself pouring myself coffee if she's working.  All in all, never had a bad meal there!"}
{"text":"Pros:
- The homefries were good
- Cheap

Cons:
- Poor service, gets orders wrong, takes forever
- Ugly decor
- Poor location (inside Agincourt mall)"}
{"text":"Pros:
-Great prices for the quality & quantity of food
-All day breakfast
-Surprisingly large selection of dishes from such a quaint restaurant
-One of the top 3 best steaks I had while dining out which was a HUGE surprise

Cons:
-Service could be slow at times because there's usually only one waitress on staff
-Decor could use some work especially since they haven't changed anything since I first went to this mall around 15years ago

I went for lunch and ordered a super sized breakfast for $14 which includes a 9oz NY striploin steak, 2 eggs, toast, home fries & coffee. I could barely finish everything and the steak was more tender and flavourful than fillet mignon I had at other fancy restaurants. The home fries were crunchy on the outside and soft inside, even the toast was buttered correctly and toasted properly.

My GF ordered a lasagna special for $10 which included lentil soup. The soup was amazing and that alone was enough to almost fill her up so we had to doggy bag half of the lasagna which was also epic: they did not skimp out on the ground beef or cheese or sauce.

The atmosphere for this restaurant isn't the best especially since it's inside the mall and you can see random people walking past, but the quality, quantity & low price will MORE than make up for any negatives."}
{"text":"Turns out I was wrong in my last review. They follow mall hours during weekends so that explains the early closing.

However I was back there again today and found that the entire restaurant had permanently closed down! You will be sorely missed."}
{"text":"I come to orchid garden somewhat regularly. I used to always get the fish and chips which are GREAT. They have pretty decent breakfast, and good calamari. The service depends on who is there. There is a lady with long red hair and she is an awesome server, so sweet, friendly, fast and upbeat. There is also another lady who is much more quiet and slower but they always get your order right, they're pretty fast and it is fresh. So 4 out of 5 stars for food and service. But decor is outdated (not that it should really matter) also random addition sometimes the cutlery looks kind of dirty but it's just water that left marks. They do loose points for that because they could take the extra minute to wipe down the cutlery."}
{"text":"Quiet restaurant located in Agincourt mall. As a side note: Many customers who were there are seniors.  Their Greek food is mediocre but I love how it's quite cheap. Kinda dark and they have slow service."}
{"text":"Best prime rib sandwich!! Serious hidden gem in a dumpy mall (Agincourt Mall) in Scarborough looks like a dump but the sandwich I've had since I was a kid. I sometimes do the 40 mins drive just so I can get this freshly carved off the roast piece off perfection. Word of advice, just have the kaiser sandwich with the beef no accompaniments except their amazing jus and a sprinkle of salt. Better then the Keg's and seriously just a notch below the prime rib sandwich I tried at Harbour 60 - difference is this one is only $10 for thick slabs of juicy prime rib. One of the best things I've ever ate in Toronto - and no one knows about it!"}
{"text":"Very Slow, the girl on service is nice, but really slow, getting a coffee refill was nearly impossible.

This place is a good rest stop when visiting Agincourt Mall, but after watching a 20/20 show last night about how filthy restaurants are it was a bad place to go.
The menu's were sticky, my girlfriends coffee cup had a stain on it (I think it was a stain?)

The plate I had was ok, $9.50 for a ramekin filled with scrambled eggs and some meat, along with toast, home fries, and the saddest salad I ever saw (a piles of shredded iceburg topped with 4 tomato slice).

They do make a good Philly Cheese, but one time I ordered it, the meat was rare (red!! ewww) so I haven't had it again. 

As I mentioned, the place is a good rest stop while shopping, other than that, avaoid it."}
{"text":"Pretty standard cafe with lots of food choices and specials. Could really use some extra cleaning, as the tables feel sticky sometimes.

Anyways, though the looks of the restaurant may not be that neat, the food is surprisingly tasty and always made fresh. There is a little bit of a wait when they are busy, but overall I come back here as their food is good."}
{"text":"Ordered the gyro on a pita and fries to go. Came to $7.85 after tax. Man at the counter was very friendly. They seem to know their regulars well. I overheard a man letting the cook know that his steak was done perfectly. The pita wasn't dry. The gyro (mix of beef and lamb) wasn't dry either. In fact, it was crisp on the edges and tender where it needed to be. There was also a lot more of it than I expected. I'm not a small eater, but I couldn't finish the sandwich. I had like three fries. The fries are made to order, but they came out of a bag. They're thick cut. I've heard their burger ($3.95?) is really big and really tasty. Perhaps I will try that next time. They've been at Agincourt Mall for as long as I remember. I'm glad I finally tried it. I'll most likely come again. The amount of food you get for the amount of money you pay seems really good."}
{"text":"i like here. And firendly service. I just want to try and chef give me I really want. I love beef!"}
{"text":"Went here for the burgers, which I enjoyed thoroughly.  The guy in the front was very welcoming and friendly, it was clear that he was a nice guy. Reasonable prices but the waitress had some attitude; however, the nice guy deserved an extra star on his own"}
