{"text":"I had high hopes going for dinner at Oretta. The interior truly is beautiful. However, the food was entirely disappointing. We ordered some appetizers, all of which were disappointing, especially the fritto misto, which was all broken up, with many pieces of deep fried breading. The pasta I ordered (tomato sauce with straciatella) was extremely al dente. As an Italian, I'm used to having pasta al dente, however, this pasta was hard and almost inedible. The sauce was bland and unappealing. Everyone sitting at my table had meals they were also disappointed with. Almost everything was left untouched. The bill was almost $100 per person including some drinks and was absolutely NOT worth it. I would much rather frequent Terroni, Campanoglo or even Vesuvios for better Italian in this city. Let the out of towners come here for their Instagram shot and don't waste your money."}
{"text":"Visually very appealing, very busy and seems to be the spot to go these days, but the food - not so great. I had the fried olives stuffed with pork, they were decent, but the pizza was pretty bad. Crust was burned, and absolutely no flavour to it at all."}
{"text":"I wanted to like this place. It's exceptionally beautiful. If the rating was based on design alone, I'd give it five stars. But alas, the restaurant seems to be all style and no substance. The food is average at best. We ordered the fritto misto to start; mixed calamari and beet chips, which was a strange combination all around. Plus the way it was plated made it look like it was thrown together haphazardly. 

We also tried the tortelloni and the special of the evening, carbonara with truffle. I think they meant for the truffle to save the dish, but it was bland and not particularly creamy.

Overall: beautiful space but really disappointing food and not worth the price tag. :("}
{"text":"Decided to try Oretta for the first time as I've heard a few people talk to me about this place. Good interior design and vibe, which I've heard Oretta is known for.

As for the food, mixed reviews.

Great location, interior/vibe, service, and okay food/drinks.


We tried the Bruschetta which I thought was awesome! Perfectly crisp bread topped with fresh tomatoes drizzled with olive oil. 

Polpette which is beef and pork meatballs drenched in their delicious home made tomato sauce. It came with warm thick pita bread to kill the sauce with.

Cardinale pizza which was a warming delight. 

Agnello which is a lamb striploin. Heard their lambs are from Ontario farms so I had high expectations of it. It was too gamey, tough, and the meat smell was too strong. I normally loveee lamb but was verry dissapointed with Oretta's lamb.

For their daily special they had a Ravioli which was also mediocre..

Other than that we had the chef's choice of mixed desserts which was a delight. A board full of 2 tiramisu, 2 mini matcha icecream stuffed croissants, and mini biscuits. Which went extremely well with my Espresso Martini which was pretty good. Normally Espresso Martinis are my favourite to go finishing drinks!

Service was awesome overall! Our waiter was fast and humourous. We got 2 bottles of reds and both were recommended by him. Second was better than the first but both were average wines."}
{"text":"The service was amazing
I wish they had a bigger selection of pastas
I got a risotto it was really good.
I loved the atmosphere, definitely a very busy location.
The food came sooo fast.. it was kinda weird lol but thats a good thing!

Will def go back again to try the pizza"}
{"text":"My friends and I had a wonderful experience at Oretta. Our waitress was very helpful and friendly as she thoroughly explained some of the traditional Italian dishes to us. Food was excellent and very fresh. Bread was straight out of the oven, and the bruschetta was topped with deliciously fresh tomatoes. Tried the ravioli for my main dish with brown butter sauce. The ravioli was delightful although the sauce was a bit bland, probably should have stuck with their regular red sauce. We were just visiting Toronto for the night and I'm really thrilled we chose this spot. It's very pretty as well!"}
{"text":"The interior design of the restaurant is absolutely stunning; however, the food can be better.

What I liked: 
- The interior design and decoration was absolutely stunning- a great place to take nice photos.

- Good selection of food

- Service was amazing. Checked-in to see how the food was and always helped us refill our water. 

Areas for improvements:
- Food was okay, nothing too special, especially for the price."}
{"text":"Just had a lovely lunch with friends. The interior is amazing. Very stylish. I didn't have that much high expectation for the food to be honest. I went for to check out the interior lol! But the food was very very delicious!! We had polenta(highly recommend if you like some snacks), Brussels sprouts salad(yum!), pizza and a pasta(with seafood in it.. that was amazing!) None of them was a disappointment!! It's a bit more than I want to pay but I will go back for some occasion! :) the staff is super friendly!"}
{"text":"Came in at 10:15 pm, was seated, not particularly busy... 15 minutes passed, no one even offered water... Left."}
{"text":"A beautiful restaurant. For drinks, for someone from out of town, this is the place to bring a person you want to impress. High cathedral ceilings, art deco wall decals and millennial pink plush. 

For food, I've never been upset with my order, but I've never been quite amazed either. I love a nice pasta, but the ravoili I received was lukewarm, with unsatisfying ricotta salata cheese and a sauce too simple ; it could've very well just been pasta water. Came for brunch out another time and all was well, but not memorable a dish either. 

The service is great and attentive. The room is stunning (it must be said twice). But with so many places in the city, if food really is your reason for going out, you can spend the same amount of money elsewhere for more transportive food."}
{"text":"Hi everyone. If you want some yummy Italian home made food with a fancy twist this restaurant is a perfect choice. I really like the location as it's in the heart of King street. I was  there for Tiff weekend, star watching from their patio. Best spot in the house. So dress up and call your friends for a fun night out. HIGHLY RECOMMENDED

 P.S. Pictures come out great with the beautiful atmosphere."}
{"text":"Overall experience: 8/10
Food: 7.5/10
Atmosphere: 9/10
Service: 9/10

Full disclosure here. My ratings will seem high considering I've only given this place 3 stars, but that is because above all, food is what matters most. And at Oretta, the food was just okay. 

The restaurant does a brilliant job at making you want to eat there. While your eyes get a feast of the beautifully decorated walls, plush seats, and an overall 'gram-able interior, the place is also bustling at night. The high energy and \"in\" crowd make you feel like you're in THE spot in Toronto. 

Service is great. They are friendly and attentive, not much to complain about there. 

When it came to the food, I found that the appetizers were much stronger than their mains. We got one of the specials (mozzarella straight from Italy), the cheese/meat combo, pane e olio (seasoned bread - I would stick with the complimentary bread for the table), insalata salad, and fritto misto (variety of deep fried seafood). 

The mains were sub-part. I had the classic margharita pizza. While the dough was fine, it totally lacked in delicious cheese and there were maybe 5 pieces of basil on the entire pie. For an Italian place, finding this classic sub-par was not very encouraging. 

THE BOTTOM LINE: the food is just okay, but if you want an otherwise good experience, check Oretta out."}
{"text":"There was big hype surrounding this restaurant and I couldn't wait to try

The restaurant decor and layout was very nice, they even managed to make a nice ambiance on the main floor 

We were a party of 6 and started out with some appetizers (buratta, calamari , salumi platter) all good 

When it came to the mains the table decided to each order a pasta  and split a second

For me, when trying an Italian restaurant I like to try the pasta with red sauce and their pizza 

The pasta came, it aaa just a plain spaghetti with basil tomato sauce and was very tangy. Had a slice of the pizza and it wasn't half bad, but you wouldn't make a special trip for it 

The tomahawk which we all split was delicious, the best part of the meal by far.... cooked and seasoned to perfection 

Overall, I did leave disappointed because it did not live up to the hype, I thought it would have been a little more fine dinning with more refined dishes but that didn't happen, and by looking at the bill at the end of the meal..... it didn't leave a good taste 

Overall if you're looking for casual Italian with a decent ambiance and don't mind overpaying, give it a try"}
{"text":"Beautiful decor and the hostess was very nice but the service was terrible, only 1 waitress for the entire restaurant and  although she tried her best everything was so slow it was painful! They really should have more staff. Also the food wasn't that great. The pizza was thin and small and had no flavour. The salad awful. It definitely doesn't live up to all the hype! Very disappointed."}
{"text":"Vibe is everything here. Inside Oretta, you feel like you're dining at a contemporary art gallery. 

I stopped so many times to snap pictures of the decor on my way to their restroom on the second floor. Everything needs to be on Instagram!! 

I made a reservation for 8:30PM on a Sunday night, and was able to get seated around 7PM because I was in the area. The restaurant was busy, but not packed or overly loud. 

We ordered deep fried olives stuffed with pork and polenta fries as appetizers. The polenta fries needed more honey, and tasted too dry. Oretta just opened, so I can understand that menu items are still in the \"testing\" phase. The olives were also not what I pictured based on their menu description. The batter used, could use some work because it tasted like the skin of frozen tater tots. 

I ordered the Ravioli with pureed carrots and it was drenched in oil. This did not sit well in my tummy because of how greasy it was. So, this is also another menu item they need to tweak. 

The pizza here, however, is DELISH! My friend who normally won't touch pizza crusts, devoured the whole thing. They got their pizza game right at least! 

I'm very intrigued to come back and visit their bakery section (open only till 4PM). The selection seems vast and everything looks amazing! 

Overall, the food items need some work but I can see why people are flocking here to Instagram the interior. I'll be back!"}
{"text":"Cute place. Desserts here are great, especially the tiramisu which I highly recommend. Vegetarian options are limited though."}
{"text":"Had amazing customer experience from start to finish. Was on a mission to look for a restaurant downtown to host my birthday. Little did I know that it is a very stressful process. Factors includes time, space, pre-fixed menu, minimum spend, and separate billing. This is when I came across Oretta as it was on my list of places to try. To make this all happen, the event coordinator Miriam that I was directed to assisted me every step of the way. Oretta does have a strict booking policy for large groups but Miriam was very accommodating and flexible to my requests. 

The restaurant is spacious with a gorgeous interior. My party was held in the Cambusa room which is a cafe during the day. My guests and I really enjoyed the private space. 

The pre-fixed menu I chose was $75 per person which includes family style apps (sharing style), main dish, and dessert. For the most part, it was an enjoyable meal. I do think the main dishes could be slightly better, but the apps and desserts were delicious. 

Couldn't be happier with my decision on coming here to celebrate my birthday."}
{"text":"Rating is more of a 3.5. 
They have a fixe prix menu of $18 for lunch, which includes the insalate, a main of chicken, margherita pizza, or cheese tortellini, and a rotating dessert. For the price it is a such a good deal! 
Food was decent, the potatoes and veggies with the chicken didn't have much taste but the chicken was pretty delicious. The pizza was good. The tortellini was chewy so if you like softer pasta it may not be to your standards but the sauce with it is delicious! 
The decor in this restaurant is amazing and the servers are super nice!
Overall really nice experience for a quick lunch!"}
{"text":"The ambience is nice, as is the presentation of the food (perfect for Instagram influencers!). However, once you take a bite of the food, the presentation does not match the taste. I ordered the steak for brunch and the meat was over cooked and tasteless. A little salt would have gone a long way. The fried potatoes were great though, and so were the deep fried artichokes.

There are some gluten free options, but the options are limited. Some salads and meat options are available but the choices are very grain heavy. Prices are also a bit higher due to the central location in King West and environment. There's also lots of room for groups and they didn't have gratuity included. 

The service was great though and our server was very accommodating!"}
{"text":"I'd definitely come back! 

We told the staff to just bring us a variety of their best menu items and everything was delicious. The pizzas were my favorite, and I loved the Mezzi Paccheri di Mare (seafood pasta) and The Salmerino. The Cavoletti (Brussels sprouts salad) was a bit dry but the crispy pancetta made up for it!

Their desserts were fantastic - we got the tiramisu and molten chocolate cake with almond gelato. I LOVE almond flavoring and it was absolutely perfect, the cake was decadent and smooth without being too rich - it was perfect. I also usually dislike tiramisu but I really appreciated the flavors of this one and I would get it again. 

My only gripe, hence 4/5, is that it is so unbelievably LOUD in there... we were seated at the table inside that is nearest to the patio (where the partition opens up to outside) which we thought would help so that the sound wouldn't be bouncing off the walls next to us but it was still brutal. I couldn't hear what my friend directly in front of me was saying. 

So the food is fantastic, and the atmosphere is very chic... but if you want to hear what anyone is saying, maybe sit on the patio or come during odd hours when it's quieter."}
{"text":"Agree with most of the sentiments here - beautiful decor (bold tropical deco very different than the narrow wood table/Edison light aesthetic that populates this part of town) but very mediocre food. My friend and I had instantly forgettable seafood pasta, buffalo mozzarella with pickled vegetables (the combo really didn't work, the classic buffalo mozzarella with tomato and basil would have worked so much better), tepid ravioli. The chestnut cream donut for dessert was the only decent dish. 

On the plus side, service was wonderful and accommodating with a baby and stroller. The cocktails we had with prosecco and pear purée were very nicely done as well. But for a $135 lunch the food really fell flat. Would not return without a dramatic food re-invention."}
{"text":"Experience this place with friends today , we had seafood pasta, risotto and bottle of wine . Food just average, nothing special but really overprice . You definitely could find better place for your dining experience . Also , I would like to mention extremely intrusive service."}
{"text":"Fantastic. End of review.

JK, You know I can't just do that, I have far too many words and things to say about this place to leave it just at a 5-star one-word review. Heck no! I'm honestly not sure how this place is averaging a 3-star, everything about Oretta was top-shelf and all class.

My feeling is that it got a lot of press and hype when it first opened in other Toronto publications and sometimes it's hard to live up to the hype when you're just ramping up, but having been established for about a year now, I can say that my experience at Oretta this past Friday for my Anniversary was flawless.

From the moment I made my reservations online the service was exceptional. I made a special request with the online reso letting them know it was a special occasion and that I was looking for the best table available AND to have some bubbly waiting at our table as soon as we arrived. Within minutes of submitting my request, I got an email congratulating me on the special occasion and asking me what kind of bottle or glasses of bubbles I would like. 

We arrived on Friday @ 7 pm and the restaurant had yet to get busy (likely due to weather). The hostesses were smiling coyly once they looked up our reso because they knew I had made the little romantic inquiry and were super happy to have us celebrate - thankfully they didn't give it away. We were given an amazing corner booth on the main floor next to the window but overlooking the entire space. It was really special and then our server came (Adriano I believe) shortly with two tall glasses of champagne.

To begin we ordered their bruschetta and their fried artichokes to share. The bruschetta was done with sliced cherry tomatoes that were sweet and didn't have that strong \"tomato\" taste that sometimes makes me gag a little - they were amazing. We're usually fried calamari people but when we saw the artichokes we went for it. OMG, the truffle infused aioli for dipping was pure evil it was so good. This would not be the last we saw of truffles that night.

Moving into our mains we ordered a couple glasses of their Chianti to go along with our pasta mains. She had the freshly made ricotta stuffed ravioli (which were massive) served in a brown butter sauce and topped with a large slice of black truffle on each ravioli - wow! I went with the evening's pasta special which was a house made parpadella pasta served with a lamb ragu (and to give a little hat tip to the traditional way of serving lamb there was a faint hint of mint amongst the dish). WOW... WOW... WOW.... WOW..........(wow)! To quote Will Ferrel's impersonation of James Lipton 'If I were going to make up a word for this dish it would be Scrumtrulescent\". That about sums it up.

Finally, we came to dessert. A pair of speciality coffees were the perfect accompaniment for the chocolate/hazelnut Zeppole and the fresh tasting Tiramisu. I'm not usually a dessert person but that Zeppole, man, what an end to a spectacular meal.

I don't commonly say this but I wish I could give Oretta 6 stars, they made the evening special, the meal fantastic and were reasonably priced for all that we ate and drank, pre-tip the bill was $166 (that's for two apps, two champagnes, two wines, two mains, two coffees, and two desserts). All that in a gorgeous modern venue!

Eatcrest Out"}
{"text":"OK, if you're a restaurant and you charge a lot for your food, then your food better be great. This place suffers from the typical \"we've got expensive real estate and paid a lot to renovate, so let's not bother with the food part, cause rich suckers will be distracted by the area and how nice our staircase looks\". The food is expensive AND basic AF - nothing to be writing home about. You're so much better off going to Little Italy for tastier and cheaper Italian food than Oretta. They should just rename themselves to \"Total Tourist Trap\". 

On the positive side, their servers & hosts are very good and the coffee is superb."}
{"text":"This restaurant really epitomizes dining in some of Toronto's \"trendy\" neighborhoods - beautiful space and location with mediocre at best food.

I came here on a Saturday for lunch with 3 friends and a baby. The restaurant was busy but definitely not packed. We were seated at the very back even though there were tables up front. It took them 10 minutes to come back to our table to ask us for drinks. I believe it was the manager who noticed we were sitting there perplexed and she took our drink order. It took a few more minutes for us to order our food.

When the food finally came out it was ho hum at best. Three of us ordered the paninis and mine was luke warm, the vegetables on the inside were cold - it was a panini I would make at home. 

Overall the service left a lot to be desired but I am hoping that is just new restaurant kinks. I have similar hopes for the food but with all of the amazing dining options in the city, I won't be back."}
{"text":"We went here for a family birthday and were happy with our experience. The staff were very friendly and the food was good (although not out of this world). We shared apps - shaved brussel sprouts, pizza, carrots and the beet salad. All were good - the pizza was especially delicious. 

Everyone had a mix of the fish (both types), lamb and spaghetti. The two fish dishes were the most popular. 

For dessert we had tiramisu and ice cream. All in all, the dinner was very good and reasonably priced. I would come back again."}
{"text":"My fiancé and I visit Oretta regularly. Interior décor is absolutely beautiful; a mix of modern contemporary with a side kick of French. The staff is very polite and make you feel comfortable the minute you walk in. The crowd is typically young professionals; hence, the place is perfect even for networking or just a normal night out. We have tried most of the items in the menu and loved every single one of them. Oretta is definitely one of our favorite restaurants from a food quality, decor, service and price perspective. In addition, they also have a space upstairs which could be used for private events and we just received confirmation to hold my wedding shower there. This is a MUST VISIT restaurant if you are in Toronto!!!"}
{"text":"This place is awesome! Been here only a couple times so far and all the times is has been amazing! They change up their assortment of pastries. 

1st time, I got a small coffee (americano) and an apricot pastry, it was amazing! Decided to come back for the same pastry, but he 2nd time they didn't have the apricot pastry, so instead I got a rose roll. The rose rolls aren't made there often since its costly, but amazing! If you ever see the rose pastry, highly recommend getting it (because it's made rarely) but delicious. Even better when they warm it up.

The cafe entrance is on the left thru an alley, but front is another entrance that Connects to the cafe. 

The staff are all super friendly and welcoming.

Next time, id love to stop by there for dinner!"}
{"text":"Although absolutely glamorous, the menu seems a bit dull compared to other Italian restaurants in the city; therefore I decided to stop in for a drink instead of a meal. The cocktails were strong but not in a good sense, in a way that they weren't mixed correctly. Not overly enjoyable. If it wasn't for the décor and the fabulous people dining here on a late Saturday afternoon the whole experience would have been... underwhelming. Happy I went to experience it. 

Apparently, they're working on a brunch menu.... until then."}
{"text":"Visited Oretta for brunch on a Sunday morning. We didn't have a reservation but luckily there was a table available. It is easily accessible by the TTC. Ordered the Fritelle (pancakes, mascarpone, pear jam and maple syrup). The pancakes were super light and fluffy and paired well with the jam, mascarpone, and syrup. The portion was quite generous and not unreasonably priced. The restaurant itself was decorated beautifully with the pink walls and gold accents. The service was quick and the wait staff was very friendly. Perfect place go-to place for brunch!"}
{"text":"Orietta has been hiding something: it's gorgeous little cafe tucked away in the alley beside the main restaurant. With heaps of takeaway goodies like Italian baking, focaccia & panini sandwiches, spinach crostata, bomboloni and  pizza, they look poised to give Forno a run for their money. The coffee can be a tad bitter for my tastes and they don't offer cream, but they do serve almond milk and cold pressed juices. The real highlight here is the stunning space and the staff, who are exceptional. There's even a gorgeous event space upstairs you can rent out, and that they'll soon have open to patrons who need a quieter spot to work during the day. I'm sure the patio will be great in summer, too. A brilliant addition to the neighbourhood!"}
{"text":"Came here on a Saturday for 6:30 p.m. with a few friends. It was fairly crowded, so I would recommend making a reservation online. 

Note: We were not offered the complimentary bread until we noticed other tables getting them from their servers. So be sure to ask for it if you would like some and were not given any :)

MAIN COURSE: Mezzi Paccheri de Mare (Squid ink pasta with seafood)

This was quite delicious! The squid ink itself has no flavour, but rather, it gives the pasta a unique black colour. The bay scallops and shrimp were very well seasoned; coupled with the buttery pasta sauce and tomatoes, which freshened up the dish, the thick pasta was a delight to eat! 

DESSERT: Chocolate brownie with ice cream and tart crumbs (I cannot find the name of the actual dish online nor do I remember it from last night, but this was essentially the crux of the dessert)

The brownie was very dense and creamy, perhaps too creamy for my liking, as it felt very heavy. Nevertheless, the blood orange sauce on top of the brownie was refreshing and delicious. The pistachio-like flavoured ice cream also had quite a unique and light taste, which complemented the almond/tart crust and dense brownie."}
{"text":"Stopped by for a quick bite between meetings and I must say this King Street restaurante had both style and unparalleled service!! I was acknowledged right away and almost by everyone with their warm smiles. The manager on duty recommended the Insalate covoletti which I loved! It was very authentic and the crispy proscuitto topped it off perfectly! Overall I thoroughly enjoyed the atmosphere and service!!!!"}
{"text":"Oretta is a beautiful restaurant on trendy King west with delicious Italian food. The interior is absolutely gorgeous and a total feast for the eyes, but the food experience I had here was equally impressive. My girlfriends and I decided to share a few starters and were loved the meatballs, burrata and calamari. The pizza and pasta were executed well, but for me the star of the show was the dessert: the chestnut zeppole. Don't miss out on the bomboloni at the Oretta cafe."}
{"text":"Great place in terms of location, seating, environment. They allowed me to take lots of Instagram worthy pictures because of their cool decor. Friendly staff. Took our coats to hang. Ordered the margarita pizza. It was very hard, got cold quickly and not enough cheese. That was a bit disappointing. Still lots of other Italian options on the menu to try."}
{"text":"I really liked Oretta!

I was recently in the neighbourhood and decided to drop by. I had a latte that was DELICIOUS and a veggie panini that was really really good too!

The place was clean, well lit and so cute. Not sure if they have wifi.

The only thing I would say is that is does get quite busy during the weekdays past noon and I feel like they should staff more people. Other than that, great place and I'd definitely return again!"}
{"text":"Very swanky looking place. Very well designed and decorated. Lots of space for large groups including an entire second floor that looks like an amazing space to entertain engagement parties, bachelor/bachelorette parties, or corporate holiday parties. I didn't read too many reviews of people having dinner here as it seems many people come here for coffee and their pastry bar. For dinner, the food is pretty good, crowd is very hip and full of yuppies, service is pretty good but price is not so much.

Atmosphere 5/5
Taste 3/5
Price 2/5
Service 5/5

Atmosphere - Had dinner here on a Monday night with a group of 6. We couldn't make a reservation online as this place was not on open table so we just showed up. There was tons of seating and they were very cozy. They did not cheap out on comfortable chairs and lounge areas at all. 

Taste - I ordered the ravioli which was interesting as it was made with carrot and ricotta cheese sprinkled with hazelnuts and rosemary on top. Interesting flavours. I wasn't quite satisfied with the cheese though. Wish they had offered to sprinkle some cheese on top as well. My friends mentioned the pizzas were excellent but the risotto not so much.  

Price - The ravioli I ordered was $18 which is pretty typical for a swanky place like this. It is a little overpriced given the amount of food you get with this dish. What I don't like is that the first option for tip when you pay using the credit/debit machine is 18%. 

Service - The staff here are all pretty professional starting right from the moment you step into this place. They greet you at the door, fill your water and always check back. They don't take too long to give you the menu, take your order and serve the food. The billing process was quick and easy and everyone is really friendly here. It seems like they may have implemented a really good customer service principles here."}
{"text":"Hope its just growing pains - but the food and staff dont live up to the warm decor.  The staff seemed too confused to take our order at first (3 members of staff came to the table and left before taking our order ) and when the food arrived the paninis were mediocre at best - I asked for cheese in mine and a cold piece of buffalo mozzarella was shoved between layers of cold porchetta.  The grilled veggie panini was slathered in mayo and the risotto was dry and unappetizing. 

Didnt try the cocktails because they were all made with bar rail brand alcohol ( Tanquerray / Finaldia )

The washrooms are individual and have no toilet paper holders (rolls just stacked on top of the toilet tank) and no paper towel to unlock/open the door."}
{"text":"Location and atmosphere good. Food was just below average though. Don't recommend ordering any of the apps or pasta. The pizza was decent."}
{"text":"Oretta is the place to go for a casual, yet sophisticated lunch on King Street. It's a spacious restaurant with high ceilings and a contemporary and slightly retro feel. 

The food was tasty but not really innovative - it was pretty much classic Italian food just in a really nice restaurant. I particularly enjoyed the fried artichoke as an appetizer. It was crunchy and salty with a tangy, creamy dip (that's actually made from soft tofu!) For my main, I had a pasta that they made vegan for me. It had penne pasta, tomato sauce, and mixed veggies. This was a very simple dish but it was more flavourful than any pasta + tomato sauce that I've had before. 

I would definitely go back again, but I won't be expecting anything particularly unique."}
{"text":"Loved the atmosphere and overall vibe of this restaurant. Beautifully decorated inside & is the main attraction to this place which drew me in to try. Food wise was nothing outstanding and just like any average italian food. If you want a fancy classy place to dine in - this would be a good choice!"}
{"text":"Swanky restaurant makes great pics and a fun time but don't come here for the food...

The good:

- The decor is breathtaking. Art deco meets midcentury modern. This is the kind of place you take a date to impress them.

- Service is fantastic. They are very attentive and did a great job taking care of our large party.
 
- Good selection and quality of wine

The not so good:

- The pasta selection is surprisingly limited

- The food was underwhelming. I ordered the seafood pasta and while it had a nice and subtle flavour, it completely paled in comparison to similar pasta offered by other Italian ristorantes. It wasn't disappointing, it just wasn't great. Others in our party ordered pizza and weren't wowed, either.


Bottom Line: Come here for the drinks, decor, and insta-worthy pics, but don't expect to be blown away by the food."}
{"text":"I've been to the restaurant for dessert before and it's GOOD. So my friends and I decided to make resos Friday night to try the food to. We had the pizza, the carrot ravioli, the bolognese pasta which was recommended by the server and a salumi board to start. Overall it was just ok. Thankfully I saved space for the dessert cuz I knew it would be good. The chocolate torte with pistachio ice cream is my #1, the tiramisu was delicious to!!!!! So go for the desert!!!!"}
{"text":"For the price, there are better options around the area. I would say the food was a little above average. The pizza was nothing special and soggy upon arrival. I would recommend the Arctic char if you're looking for dish to try."}
{"text":"The decor and staff were excellent. However I wouldn't say the same about the food. They actually ran out one of the appetizer we went on a Saturday night....  So we ordered the crispy artichoke which was too salty in my opinion.  Our waitress was very tentative with our water however lacked the common sense we were waiting for our mains for 30 mins..... She was waiting for us to finish our appetizer. I've never been to a place that wait for the dish to be finished before bringing the mains.  She was literally waiting for us to finish the last piece of the artichoke. 

Until I finally asked her where is our pizza. It really shouldnt you take this long for the pizza to come. 

The pizza was meh. Mine tasted like apple pie."}
{"text":"Arrived pretty much at the door after taking the street car on a day where the TTC was free in celebration of the expansion of the subway line in Toronto. A very nicely decorated restaurant that has the Gatsby feel with simplistic decor, nice light fixtures and a second floor event space that overlooks the entire restaurant and the bar. It's a very comfortable and welcoming space with large windows and lots of natural lighting for nice photos. 

I had ordered the Uova Barrata E Tartufo which consisted of scrambled eggs, burrata, black truffle, and focaccia from the brunch section of the menu. Not being Italian, there were some menu items we couldn't even pronounce or ingredients my friends and I weren't certain about, so maybe more simplistic names or dumbed down descriptions may be helpful. It could just be us. All the food was presented nicely on plates that were labeled with the restaurants name which was a nice touch. Slices of truffle were served on top of the scrambled eggs, but I'm not sure if that was the best way of applying the ingredient to the dish. Personally, truffles to me give off a very strong aroma and flavour so it would have been better if it was incorporated to the eggs a different way than just thinly sliced and placed on top. That's just a personal preference. The eggs were very fluffy and creamy. The focaccia was nicely baked but very hard to cut with a knife, so I recommend just eating it with your hands. Don't even bother trying to be polite about it. 

My friends and I had a lovely time at this restaurant and I'll definitely come back to such a beautiful place."}
{"text":"Oretta just opened off King St and I'm extremely excited about it. I finally had the time to stop in their cafe in the back and was super impressed by the design and the quality of their Cappuccinos. 

I came in with a coworker through the entrance between King and Stewart and was served almost immediately. The host was really friendly and suggested we try a pistachio biscotti along with our orders, which was great. 

Super colourful and really quick service. Only complaint was that there wasn't a menu in sight, this could be because Oretta is extremely new - but adding a menu or a little sign somewhere with bakery goods/drink options would be super helpful!"}
{"text":"Busy Saturday night. We made reservations and the table was not ready because the previous guests were still seated. Should they not have the table ready in time for the reservation? We waited for over an hour. I do empathize with the staff who were trying to accommodate us. They did ask the guests who have already paid that there's a reservation. However we were literally standing in front of the table by the entrance and the guests didn't make any movements. Mind you there were 10 of us. Instead we made our orders while we were standing and waiting. 

The food was brought out promptly once we were seated. They were able to meet dietary requests. I added spinach to the Piemonte pizze. It was tasty except I felt it would've been better if there was less crust/bread and more toppings. I have to come back to experience the food again. We were obviously rushed to attend our other engagement."}
{"text":"Great atmosphere and decor.  Was a bit too loud and found it hard to talk to my friends.  Service was ok, felt very rushed and the waitress kept clearing out plates without asking if we were finished, so our plates were taken away before really being finished.   Was a special 50th birthday and they didn't even give a complimentary piece of cake.  We were a group of 8, spent a lot of money and felt at least the birthday person should have had a complimentary dessert.  Food was pretty good , pizza was a bit wet in the centre though.  Salads were a very small portion for the cost.  Overall not bad, not over the top great though."}
{"text":"Sitting here this very moment... ordered the ravioli and I'm not impressed. As I'm eating it the consistency of the ravioli is not bad but there is zero flavor. My friend in front of me who ordered the same thing isn't impressed either. We both agree it's too watery. Errr wondering if I should tell my waitress but I don't want to be one of those people who complain. But to be honest I'm not liking my pasta at all. I just can't eat this. I love pasta and to say that this place makes their own pasta.... I really am not liking the flavor of this order."}
{"text":"Ok first off, let me say that this place is gorgeous, totally 'grammable, but I didn't get to take any good pics for my 'gram, so hopefully you will. 

Anyways on to the service: I came here with a group of 10 for a friend's birthday on a Saturday night, and they were really attentive and friendly, we were always checked up on and our glasses were always full. There was a party coming in to use the table we had right after us but we were never rushed out and we were able to take our time having dinner. 

Food: I shared Carciofi e Tartufo (crispy artichokes with truffle aioli), Barbabietole (a beet salad), Capricciosa pizza, and Puzzona pizza. They were all quite good! I also heard great things about the pastas that were had around the table. 

Overall, good place to eat and hang out, and take some cute pics for your 'gram :)"}
{"text":"My partner and I walked along the street in the cold weather, trying to navigate our way to this restaurant. I kept looking through windows to make sure we didn't miss it. When I saw the elegant decor, I knew we were in the right spot.

We were early to our reservation (as usual), but they let us sit in a cozy area.

We had crispy calamari, addictive salad, and enticing pizza. The calamari was breaded, ever so slightly, and gave a good crisp factor. The calamari itself was cooked perfectly - not rubbery, but soft. The salad had an amazing vinaigrette to it. And the pizza! Very delicious with the white sauce and the prosciutto. A really good texture came from the walnuts, as it added a crunch. 

The service was spectacular and friendly. Very professional. 

Well done, Oretta! We'll be back soon."}
{"text":"My coworkers and I decided to enjoy a late dinner at Oretta last night. The interior of Oretta is quite beautifully designed which we acknowledged and enjoyed. However, we, unfortunately, did not enjoy the experience. Although initially warmly welcomed and provided with a customary testing of the wine ordered, the service quickly turned abysmal with the waitress being quite rude and short with us. Then, when we received our meals, I was stunned at the small portion of risotto I got for $22 plus taxes. The risotto, itself, was ordinary, at best but did not provide the type of flavour I was looking for from the description, and certainly not the portion size. The waitress continued to be hostile rather than accommodating. Then, we decided to order dessert. For a nice restaurant, it was appalling that the dessert took 30 mins to come out to the table, and even more appalling that one of the dessert orders was wrong. Once the incorrect dessert order was brought to the attention of the waitress while we were paying at the end, she found her manager and brought him to the table. I spoke quite blatantly and told him that I did not believe the incorrect dessert order should be allowed on the receipt on top of the poor service we had already received. Since we were a party of 10, it was mandatory to pay the 18% gratuity, which I directly vocalized to him, was unfortunate considering we, as a table, felt as though the waitress did not deserve such a tip. I, myself, would've given her $0.01 of a tip if we had been a smaller group. When met with these complaints, the owner/manager acted very poorly, telling us that he would try to make our experience better next time and that he would provide his email to us (which, incidentally, never actually happened). He also asked the person whose dessert order had been incorrect if she was \"able\" to pay the 18% gratuity, suggesting, as we had vocalized that we were retail workers, that she was not able to afford the bill. He did take the incorrect dessert order off the receipt but the damage had already been done. None of us will be going back to Oretta.

EDIT: The original bill was fixed on paper to remove the wrong dessert, but when my friend checked her bank account, the amount taken out reflected the amount of the original bill. I have never been so disappointed in a restaurant's service before."}
{"text":"The food, service, drinks, and ambience is amazing. Great experience! We will definitely be back

Jassie M."}
{"text":"Had lunch here today. Let's start where I always do - decor. This place is stunning !! Art Deco vibe with metallic accents. An explosion of color that transports you back in Time. Great layout centered around s beautiful bar - not a bad seat in the house. I chose to sit at the bar and soak this place in. 

Decent wine list with a good choice by the glass or bottle. Menu is simple but straight forward and very Italian traditional. I ordered a glass of white wine , bruschetta and gnocchi. 

The bruschetta blew my mind. I've never had better and I'm including in Italy. Outstanding. Fresh basil and tomatoes on exquisite bread. Simple but Excellent. 

Next up the Gnocchi. Not quite as outstanding as the bruschetta but good. Tasty and a nice sized portion. Not to big. Not to small. 

I didn't have dessert but Looks like they had some nice choices along with espresso. 

Service was good. Very attentive and quick. 

Get ready -- this place is not cheap. With tip my bill was over $75. But I'd say it's worth it! 

Beautiful space. Great food and service. I'll be back !!"}
{"text":"Went here on a Saturday night. I had high expectations for this place due to the many positive reviews I've heard and it was very good. The atmosphere was very lively and had a great vibe however, my only criticism is that  it was very dark and noisey and you could barely hear the person s
For the food, we ordered the calamari as an appetizer. And for the main meal, I ordered the Gomiti all'Amatriciana (fava bean pasta). 
Food was pretty good, however, I would order something different next time I come visit."}
{"text":"The saving grace for this place is the service. I had dinner there a few nights ago, and the food was bad. The calamari app was chewy, and under-seasoned. The presentation was all off - it looked like it came from a cheap pub. I had the lamb shoulder main. It was very fatty and underwhelming. It didn't wow me. My server however was amazing. So the two stars I'm giving are because the service was good. Although they did seem to be in a big hurry to feed us and get us out. And it wasn't even that busy."}
{"text":"Beautiful decor, horrible food. I ordered the mussels that were on special, and they tasted horrible and sandy. I would not recommend anything other than pizza or pasta in this place. Don't be swayed otherwise."}
{"text":"Came with a group and tried several appetizers.  Fritto Misto was oily tasting and way too much reading.  Mozzarella Di Buffala was good and fresh, one of the top apps.  Polpette meatballs were good, but meat is a bit bland although sauce was good.  Insalata was a decent salad.  Cavoletti salad I enjoyed.  Nice dressing and serving size. Carciofi Tartufo, fried artichokes, too fried and didn't enjoy. 
Had the branzino as a main, substituted the pasta for the shaved artichoke.  The meal was well flavoured, although I asked for lemon as there wasn't any sauce.   The Florentina for $120 was over cooked and a bit chewy.  My friends actually sent it back.  Piazza was good.  
Place is beautiful and hip crowd.  Definitely la King St hip spot.  For the price I believe it's a fair value and I would come back."}
{"text":"The pros: the food and the decor. The cons: everything else.

Definitely won't be going back to Oretta, ever. There are so many better restaurants in this beautiful city of ours, don't waste your time on this one. 

My three girlfriends and I had a reservation for 7 pm. The hostess was super friendly (and had great eyebrows!) and led us to a cute pink booth beside the bar. 

We ordered a few drinks and appetizers to start the night off. We were laughing and having a great time, enjoying the food and drinks, when suddenly, the large, metal wall sconce above our heads falls out of its socket! We all jumped in fright! Thankfully, the sconce's power chord prevented the light from crashing into our heads, but needless to say, it was quite dangerous. 

The staff apologized, the manager came by and apologized, and then quickly moved us to another table. They helpfully transferred our plates and drinks, albeit accidentally throwing out my friend's drink in the process. She then proceeds to order another one to replace it, and not one, not two, but three different people come by to clarify her one drink order to replace what another staff member inadvertently tossed out. Her drink arrived almost 30 minutes later; did they carve the ice by hand? What took so long? The restaurant was nearly empty.

Regardless, we were fine, we were alive, no one was electrocuted, and so we laughed it off and continued our dinner. The manager even offered to get us a bottle of prosecco to apologize for having his resto's light fixture almost crack our skulls. 

Next issue: I ordered a second drink. The Rosso di Sera sounded interesting so I gave it a shot. It arrived, looked beautiful, and I went to take a sip, when I noticed a dead fruit fly floating in my drink! Ugh. Flagged down a staff member, told them about the fly, and they removed the drink while offering their apologies and simultaneously offered to get me another drink. I declined.

The rest of the evening progressed smoothly. We wanted to have a good night and genuinely enjoyed the food. The service, on the other hand, was deplorable. As we finished our meal, we were waiting for our server to come by and clear our plates, and offer us dessert and coffee. Standard resto procedure, right? Not for Oretta, apparently. 

We sat around for a good 30 minutes, waiting for someone to come by. Our server did pass by our table a few times, but she didn't catch the arms we were waving in the air, nor the attempts to catch her eye, nor the polite \"excuse me\"s. This happened a few times. Mind you, she may have been busy or in the back on her break, fine. I get it. I worked in the restaurant industry all throughout university, so I understand that servers take a break when things are slow. But that doesn't mean you leave your tables unattended! What makes it worse is that the \"manager\" was just hanging out at the bar having dinner himself. You'd think the restaurant manager would notice a table of four looking around for their server, especially given the light fixture incident, but no, he didn't. 

We order espressos and desserts to share. Drinks arrive, great. Two desserts arrive but we are waiting on the third. Assuming it will arrive shortly, the four of us proceed to enjoy our coffees and the desserts. About 15 minutes go by, and the affogato hasn't yet arrived. We try to flag down our server once more, and ONCE MORE, she is no where to be found. We get the attention of another staff member and inquire about the missing dessert. Another 20-30 minutes pass, and our server re-appears with the dessert in hand, and mumbled apology about the delay. The affogato was not what my friend had expected, but at this point, our collective patience had worn thin. We asked for the bill, paid, and left."}
{"text":"Came here fore brunch with my friend. We shared the pancakes (YUM) and the Uova Affogate (poached eggs, beans, sausage, focaccia - not so YUM). 

The pancakes were super fluffy and came with a orange marmalade that was not too sweet but very flagrant. It was also served with dollops of fresh mascarpone. Definitely a good pick. 

The egg dish on the other hand, was so disappointing... The beans tasted like canned beans, the sausage had a foul taste to them and the red pepper sauce just tasted like canned pasta sauce... We ended up just eating the focaccia.

The decor was on point, I wished that the food was as on point as well. If it wasn't for the pancakes, this restaurât would have been a 1/5."}
{"text":"Thanks to reviews, I knew to pass on the pasta and go for the pizza. I had the Piemonte pizza ($19) which is with a cream rather than tomato-based sauce. It was delicious! It had a nice creamy, buttery garlic flavour, the perfect amount of cheese, and plenty of yummy mushrooms! The crust was nice although it was slightly too soft in the center. One thing that I found really odd was that the pizza was cut into quarters so that means four giantic slices of pizza (I had to cut them into smaller pieces myself). Six or eight slices would be ideal. 

We also had their calamari special for $9. It was a nice light batter with the right about of crispiness however it really lacked flavour. It still tasted bland even with the dipping sauce it came with. I'd recommend passing on this.

I also tried the squid ink pasta which was quite underwhelming. It looked cool since it was black pasta rings but other than that it was pretty average tasting. Nothing special at all and definitely not worth $25! Also, FYI the ravioli serving size is ridiculously small. 

The service was excellent! Our server was very friendly and efficient. He came by quite often to ensure our water glasses were always full (even though we could've poured the water ourselves), which was much appreciated. 

We got seated at the front but they have really cozy looking booths towards the back of the restaurant which I would've loved to sit in instead!

Come here knowing what to order and you'll have a wonderful experience. Go for the Piemonte pizza, pass on the pasta, and you'll be all set."}
{"text":"Nice to try  pure Italian food.. I tried deer meat with pasta, it has a flavour like a lamb that I don't like. On the other hand  their pizza is good"}
{"text":"I came for a bachelorette dinner on a Saturday and were seated immediately upon arrival. Our server was attentive and the decor was to die for! To start off we got some fresh baked bread but it was like a fluffy pizza dough, it was okay but nothing interesting. Then got the burrata as an appetizer and it was great, how can you go wrong with cheese! 

My main was mezzi paccheri di mare which was squid ink pasta with seafood. It was okay as well, the pasta was cooked to perfection but the flavour in the sauce was a little underwhelming. Got to try the bite of linguine cacio e pepe and it was bland. The pizza had way too much dough/crust and soggy centers. It was difficult to eat without cutlery. 

I have yet to find a place better then Pizzeria Libretto but Oretta gets 3 stars instead of 2 just because of their interior decor. The price is also slightly high for the food and the server included a 18% tip because we were 6+ group which.. is understandable. I'm pretty sure what draws in the customers from the first place is the interior and yes, indeed, it's beautiful!"}
{"text":"I had an amazing experience at Oretta! Myself and my friend booked a reso for 1pm on a Saturday. We were amazed we got a beautiful and spacious booth. As one other review said below, Oretta = Vibes!! It is visually stunning. We shamelessly took many pictures. I loved that Oretta felt fancy but also casual. The waiters were wearing jeans and t-shirts and were so friendly and helpful. I was definitely expecting a uppity king west vibe and was pleasantly surprised.

We started out with 2 lattes which were perfect.  We started with an artichoke appetizer that was pretty beige and not enough side dip . But, all was redeemed with the amazing risotto! I am still dreaming about it. We also had a butternut squash ravioli with brown butter and sage. It was more subtle than the risotto,but we shared both.  We also hit up the cafe afterwards which was also visually stunning and was like round 2! It kept the party going. By this point, we were stuffed so..more coffee. I got a lemon beignet to go,ate it several hours later and it was still killer. 

Cant wait to go back for cocktails next time :)"}
{"text":"First impression of this place is that it's beautiful with chic and contemporary decor, arched ceilings resembling a cathedral Oretta is impressive. They've got a beautiful bar at the centre along with a second floor for more intimate and larger parties.
Unfortunately coming here early for an 8:30pm bday surprise dinner our table wasn't ready closer to 9pm which didn't sit well with our party.
As for service, it was great and overall food presentation was to my expectation.
As for food I had the following:
**Tartar de manzi was a great dish, I loved the versatile flavor mixed in with the pomegranate and aioli sauce and crostini
**Margarita pizza- gourmet, couldn't complain, great presentation, tastes was as expected. However I found the crust was way too hard to chew, and I don't have dentures lol. Not yet anyways.
As for drinks I had Campari and Aperol on the rocks.
Unfortunately for my friend, she had a scary moment as her Sangria had a piece of porcelain in it which was eventually brought to the attention of management. 

Would I come back here, probably not, Its a great place of you love drinks and beautiful ambiance."}
{"text":"Truly such a terrible and disappointing experience at Oretta for my friends birthday. After waiting an hour and a half for our first round of drinks and appetizers, we received all our food at once, and finally received our drinks 30 minutes after our food arrived. Our whole party understood that it was a Friday night and the restaurant was extremely busy, and knew it was not our servers fault, however we couldn't help but feel disappointed since we were celebrating a special birthday. We ensured the waitress that we were extremely full and didn't care for anymore drinks, however the manager still came out with champagne for all of us. This was extremely kind and generous, however at this point in the night, we didn't care for any more drinks, and most of the champagne was left untouched at the table. A girl in our party asked if she could order a dessert, and immediately without being asked, the waitress told her that the dessert would not be taken care of since we had already received complimentary champagne. No one in our party was looking to get free stuff, but in hindsight, a free birthday dessert or comped drinks would have gone a long way from the restaurant. Disappointed with our whole experience and how we were treated, I asked to speak to the manager after we had all paid. I can honestly say I have never had anyone speak to me the way the manager at Oretta did. I understand that it was a busy night for her and that we were a big party, but the goal of anyone in the hospitality industry is to take care of their guest. Instead of coming up with a solution that works for both parties, the manager had no desire to improve our experience"}
{"text":"Im going to try to keep this short.

This place is very pretty but the food was just okay. 

For a place this nice I wish there was some pazaz in my mouth. 

Fried rissto - one of the top dishes on the menu even that I got sick of by the end. 

*note I came here for Lunch."}
{"text":"I was looking for a restaurant to host a dinner for a group in the King West area and I chose Oretta only because they allow large groups to order from their regular menu unlike most other restaurants where they have groups order from a group menu (with limited choices) for a set price. 

My first impression of the restaurant is that it is lovely with bright colors. Love the ambience and the decor. 

Service: For groups, they seat you upstairs. The upper floor is great because it is more intimate and quiet. However, this also means there are less servers walking around. This shouldn't be an issue if the assigned server to the table is attentive though. In our case, our server wasn't very attentive and we rarely saw her after we got our food. After placing our orders and getting our entrees, there was no one around for us to request for more water. 

Food: The food was just an okay. I ordered the ravioli and it was extremely bland. The texture was nice but that was about it. I thought maybe it was just the ravioli that was mediocre here, but I tried my friend's squid ink pasta and I thought it was bland as well. 

Overall, I was disappointed in both the service and food. Again, I only chose this restaurant for dinner because they don't force groups to order from a set menu unlike other restaurants in the area. If I wanted to have an Italian meal, there are so many other options for Italian fare in the area and I would not choose to come back."}
{"text":"I was very excited to try Oretta. I love Italian food and absolutely fell in love wit the decor. I made an early reservation and arrived at around 5pm. The restaurant decor is absolutely a work of art. It was so pretty, I was getting excited. 

I had already looked over the menu and knew exactly what I wanted. I ordered the Calamari and the Cardinale Pizza (Tomato, fior di latte, spicy salami, & black olives) to start off with. For mains I ordered the Gnocci with Meat Sauce and the Tri-Coloured Pasta with Scallops. 

Well let's start off by saying, the Cardinale Pizza was pretty good. I loved the Spicy Salami and Olive Combo. The Calamari was undercooked and had zero flavour. I couldn't finish it, it was very badly undercooked. 

Next up the mains arrived. I can't even begin to explain my disappointment. I love the comfort of Italian food and this was anything but comforting. The tri-coloured pasta was so al dente, it was hard to chew on. The scallops were the smallest scallops I've ever seen. The sauce was non existent, no flavour at all. 

The Gnocci was a bit better, it was cooked properly but the meat sauce also had no flavour. It would have been really good if something attention was given to the meat sauce. 

I didn't finish either dishes, asked for my bill and the manager was very nice by coming by and apologizing. I will not be going back, and have not recommended this to any of my friends. King St has tons of amazing eats, this is not one of them. 

Keep Eating, 

Angela"}
{"text":"Came for bunch to celebrate my best friend's bday. Decor is beautiful, probably the best thing about this place. Very modern, colourful, and princesses like. Our server was pleasant, but forgetful. We ordered a veal pasta, gnocchi, and steak and eggs. I ordered the juice of the day, which was a strawberry mango. It wasn't worth $7 as it came in a small glass, but it was delicious. Our server came about 15 minutes into our wait for our food to tell us that it will be coming soon. To our horror, we watched as everyone else around us get their food who came later than us. We waited 40 minutes before I asked my server what's was up. She said she checked several times and the orders were punched in. She alluded to the fact that the kitchen was slow. We got our food and it was pretty underwhelming. My veal pasta was pretty hard and tasteless. I tried the steak and it wasn't bad, but my friend was not asked how to cook it. The gnocchi was soft and tasty, but my friend thought it was vegetarian because it didn't specify on the menu that it had meat. 

I spoke to the manager who came by to clear our order. I didn't know it was her but I wanted to ask why our food came so late. She was very apologetic stating that the kitchen messed up and it was their fault. She ordered us a complimentary dessert board as a result, which I thought was very nice, and showed a good level of customer service. The desserts were pretty good. My faves were the lemon donut thing (don't recall the name) and the cannoli. Unfortunately, our server forgot to pack our desserts so we couldn't enjoy them after hence my initial comment re: forgetfulness.

I probably won't come back here as the food was so-so. I'm glad I spoke to the manager or else my review would have been a 2 star! I was happy she took accountability and the dessert was a good bonus. 

Ps: they have tables upstairs to accommodate large groups."}
{"text":"Stunning interior design but the quality of the food wasn't really good. A great place for couples and group gatherings."}
{"text":"Oretta

633 King Street West
Toronto, Ontario
www.oretta.to


Vibe: Cavernous art deco space with u-shaped bar at the centre anchoring the dining room.  Elegant with gilded fixtures, retro marble and teak tables, and plush chairs and banquettes.  Most seating on the main floor and some on the mezzanine overlooking the massive bar.  It was a busy Friday night.  The place was buzzing with what I imagined was a post-work, pre-club crowd in business casual attires.   

Price: $120 for 2 (excluding tip) 
1 bottle Italian mineral water
4 drinks (2 wines and 2 drafts)
1 shared app
 2 entrées (pasta and pizza)
1 shared dessert

Food: Traditional high end ('chichi') Italian

Drinks: Good selection of wines by the glass and by the bottle. Drafts (Peroni and Kronenberg).  Variety of cocktails including a few Aperol-based drinks.

Service: Friendly staff.  Sometimes lacking organization and communication.  
(Had to ask for wine/drinks menu.  Waited for our cocktails while having our app).  

What we had: I came with a friend and we started with marinated olives, served warm in a huge mound in a mini-skillet.  The briny green fruits came in a variety of types and sizes.  We soaked up the juice and oil in the bottom of the pan with the soft, thick focaccia served on the side.

For entrée, we shared the Cardinale pizza and Gomiti pasta.  The thin-crust pizza topped with salami, black olives and fior di latte was scrumptious.  Savoury without being salty.  The cheese was creamy and not so stringy.  The kitchen tops all their pizzas with fior di latte (think mozzarella but using milk from cow instead of buffalo).  The Gomiti (fatter, shorter ridged elbow macaroni) with pancetta and pecorino was douced with a rich-tasting tomato sauce.  It was a bit too al dente, which I attribute to the fact that it was made from fava-beans instead of wheat.  But the sauce was too good that we ended up mopping it up with our pizza crust.

We ordered the zeppole for dessert.  The chestnut cream filling drew us to it.  Instagram-worthy, but after the first bite, we looked at each other and decided it was a  big 'miss'.  The pastry was like churro that had been fried in a not-so-hot oil.  Heavy and chewy.  The thick gooey filling did not help brighten the dish.  We described the experience as getting sucked into a 'vortex' of glue and goo.  Fortunately, our server was very understanding and ask if we'd like to try the tiramisu.  If the zeppole was like Wagner's \"Die Valkyrie\", the tiramisu was Mozart's \"Marriage of Figaro\".  Light and playful.  We devoured it in seconds.

Rating:  4 stars / 5
My dinner mate said she still prefers Terroni for traditional Italian fare, but would definitely return."}
{"text":"Oretta's interior design is beautiful and the main reason why I came for brunch. The food and cappuccino were just average. 

For starters, we all loved the shaved Brussel sprouts - must try! The complimentary bread was good. Can skip the beef tartare. 

For main, I had the lemon pancakes - not bad but the texture is like a lemon cake. 

Our mains took very long (40+ minutes) and was disappointing to see other tables arriving later than us but getting their orders sooner."}
{"text":"Really expensive food for what you actually get. Food is tasty, but nothing out of the ordinary and portions are extremely small. 
What we found the most problematic was the service. The server was extremely rude. She had a huge \"I don't want to serve you\" sign written all over her face. Honestly. No smile, and zero courtesy. When she was taking away our plates, she didn't even wait for one of my friends to finish. As my friend was grabbing the last bite of her plate, the server was urging her to finish because \"she had to take the plates away\". 
When we ordered desserts, it took them over half an hr to bring them to the table. And when they finally did, one of the orders was wrong. 
The manager approached us after we complained, but he only offered to make our experience better next time. There would definitely not be a next time. 
Only good thing, the decor. The place is beautifully designed and decorated. It is very pleasant. Would have been nice to see food and service at that same level."}
{"text":"Came here for Saturday brunch with my roommate to check out the new \"Instagrammable\" restaurant that opened up near us. They have huge windows at the front of the restaurant, which gives amazing natural lighting for photos. The Art Deco architecture features beautiful arches and a bar in the centre just screaming for you to instagram this place. 

On to the food... I had the Uova Affogate, which kind of reminded me of an Italian version of a shakshuka. Served with lightly buttered and toasted focaccia. The dish was flavourful, and surprisingly filling. The poached eggs were cooked just right, and posed into the sauce once poked. 

The service was mostly good. The wait staff were very knowledgeable about the menu and had some good recommendations. They were also very attentive and refilled our coffees and water fairly frequently. My one complaint is that the food came out very slowly, despite very few other diners at the time. We got so hungry waiting for our food!

All in all, I'd come again. The food was delicious and the environment is beautiful."}
{"text":"Beautiful architecture, warm service with very knowledgeable staff and delicious food. What more can you ask for! May I also add that they have pizza and pasta as well. I don't know about you but carbs make everything better for me. Had dinner here tonight with colleagues and we had a great experience. During weekdays, it's not too busy and you are able to chat and carry on a conversation which was nice. I also loved their vegan dessert, not many restaurants carry that option and for them to have one was a nice touch. Great wine selection, open to making accommodations if you can't have dairy or gluten and make sure to make a reservation as I can see how this space fills up on a Friday or weekends."}
{"text":"The decor is great, convenient location. My friend and I were seated, very friendly waitress. No complaints about the service. Food is where the issue is: my pizza was lukewarm, under salted, didn't get offered fresh ground pepper or parmesan.

What really got me is I asked for olive oil... and the waitress told me they didn't have any. I was in shock, it  felt almost laughable. What Italian restaurant don't have or offer olive oil.

Overall, won't be going back. It's a higher price point reasonably for the area and vibe. The food was a huge disappointment. Won't be going back or recommended Oretta.

It felt like all flash and no substance."}
{"text":"Went there for Sunday Brunch and I loved it! Food was great, and atmosphere was amazing."}
{"text":"A beautiful art-deco decorated restaurant that would be the perfect backdrop for a Great Gatsby party or a fancy brunch on the weekend. The ambiance is romantic, airy and splashed with gold accents. We came for late night drinks and desserts. I had a Batch 1904 Cider from Brickworks Ciderhouse (came in a can) while my friends descended on the dessert menu instead. They both enjoyed their Terimisu and Torta Firenze (dark chocolate tart with pistachio gelato) respectively. It seemed a little pricey for the portion size that they got, but I guess you pay for the ambiance of the space. Expect there to be a constant din of conversation and laughter, so just join in with your own!"}
{"text":"This review is for the side cafe. It's a cute place. Servers are nice even though the line up can be chaotic at times so while they try to serve everyone at their seat, my boyfriend found it was odd they didn't serve my apple tart goodness but I was the only one picking it up from the counter. I don't mind it, but I can see some people would. Ordered a flat white, it wasn't strong enough. Rather go to Portland Variety for my coffee and for a good one, i'll walk to Early bird. Will definitely go back for food next time. 

All the food be it pizza, sandwiches, or desserts look great. 

There was a private party there at the same time. They seem to be enjoying themselves."}
{"text":"This restaurant is beautiful - grand, high ceilings and a very sophisticated vibe. Social media worthy for sure, but I think the positives stop there.

We visited on a Saturday evening as a group to celebrate a friend's birthday. Service was incredibly slow - the servers also forgot to deliver a friend's third course (her dessert) and we gave up flagging them to complete her order (and ended up paying for something we never got) since the servers were nowhere to be found for almost an hour. 

The food itself was okay, but nothing special - I think the main draw for this restaurant is the location and ambiance, but nothing more. The standouts were the deep-fried artichokes as a starter (super crispy, salty and delicious), but all the other food items we ordered were forgettable.

This could be a nice choice if you come here as a couple, and you don't visit as a large group. But even then, the food is average at best. You are probably better off saving your money and making the food at home, or alternatively, going to another Italian restaurant in the area where you don't have to wait a million years for food, pricing is more reasonable, and food is tastier/better quality."}
{"text":"Ambience is dim and loud. You can come casual or dressy depending on the occasion. Their waiter really gave me points as he was very interactive and fun. However the food wasn't the best. Considering the price, I had expected something more. If it wasn't placed on nice plates and the portion was bigger, I probably would think it would be like pickle barrel food (their food is not bad but it's cheaper for sure). Anyhow, with bottles after bottles of wine... I had a good time"}
{"text":"I had an early reservation at 6:30 p.m. and the place wasn't packed.  We got a great service from our time of entry to when we were leaving.  You can tell everyone is properly trained and tries their best to provide the best service possible.
The food was good but I can't say it's the best option out there.  The vibe and atmosphere is nice as well.
I'll definitely come back for a quick coffee/desert..."}
{"text":"Came here with a group of friends for lunch on a Saturday afternoon. Place is very pretty just like the pictures with its pink and gold walls. Wasn't very busy though, maybe 1/3 full but service was pretty slow. I had the pancakes with pear ham and syrup which was okay. Large portion but slightly dry. Not a fan. My friends had the striploin with eggs which were pretty good.as well as the chicken breast and rapini. We ordered from the brunch menu so can't comment on other items. Overall a great place to hang out with friends, take pretty pictures, , eat some good food and experience friendly but slowwww service."}
{"text":"I had a really disappointing experience with the staff and owner here last night.

I arrived dressed casually, but not slovenly, with my friend after spending the day at the Toronto Islands. As we arrived the bouncer(?) hustled my friend to toss his coca cola bottle that he was still carrying around from earlier. It was really bizarre for an upscale bar to inconvenience a patron like this over something like a coke bottle. This was not a movie theater. It is a very expensive high-end restaurant and our server could have offered to throw it out for us if they really were bothered by it. Anyways, the hostess was quite embarrassed about this and sat us at the bar quickly.

We then ordered some drinks, and my friend decided we should do a shot of some flavorful whiskey with someone random at the bar. This is how we typically start chatting up people at new places and get to know the local crowd. Yelpers are a sociable crowd and we tend to ask people about their experiences and knowledge of the places we explore. Well, we picked the wrong guy, who strangely enough turned out to be the owner. As soon as our server delivered the shot to the man beside us, upon informing him that we had purchased it for him, he turned over and cringed. He then did his best to ignore us for the rest of the time we were there. He could not have been more disgusted by two human beings. While typically I would not have cared by this reaction (hey, not everyone is open to speaking with people they don't know), I was deeply concerned by this man's complete disregard for the patrons of his own establishment. He should have politely declined the drink and asked how we were enjoying his venue, like almost anyone with any social skills can manage. 

After that we felt pretty uncomfortable and a bit humiliated in front of the server who had awkwardly witnessed all this. So we finished our drinks off pretty quick and headed next door to Lavelle. I don't think we would have stayed much longer anyways, because it was pretty slow/tame for a Saturday night. I am guessing from the reviews here that the food and drinks aren't keeping customers. Anyways, the whole experience soured the night a bit and to be honest I do think we were treated poorly there because we did not fit a certain image. From the moment we arrived we were made to feel unwelcome there. It was weird. 

The Sangria - was a bit dry for my liking. Generally sangria is sweeter than what they offer here. I would recommend trying Gusto or Cactus Club nearby for their sangria."}
{"text":"I came here for brunch with my girl friends and we all loved it. 4 stars for the food + 1 star for the atmosphere and decor. It's such a pretty restaurant, I felt like I walked into a West Elm showroom.

Our server was pleasant and recommended popular items off the menu for us. I ended up getting their most popular brunch choice - Uova Affogate, which is poached eggs, barese sausage on red pepper and cannellini beans. It comes with two pieces of focaccia bread so you can dip them in the mixture of goodness. It was delicious even though I am not a big fan of beans in general. I tried my friend's Rutta pizza, which was really good as well. Not your traditional tomato sauce pizza, it has cheese and pancetta bacon and a fried egg on top. For dessert, we ordered the Tiramisu, which I really enjoyed and the bread pudding which my friends really liked.

Before we left, we snapped a couple pictures around the restaurant because it's so pretty. Overall, an excellent experience and I will be back for more brunches."}
{"text":"Food was good but not that amazing, definitely overpriced. Staff were nice and friendly and environment looked nice. I don't however think I will go back."}
{"text":"I went to Oretta on a Saturday morning for brunch at 12pm. There was no line and ample amounts of seating (now I know why), the interior decor was nice and modern. The wait staff were nice throughout. 

I ordered the Uova Affogate (which was $15.00) on their brunch menu. This dish consists of beans, sausage, and two poached eggs. The beans were not very good, bland tasting and a bit cold. The sausage and poached eggs were also sort of cold. Now that I think about it, my best guess was that it was reheated in one way or another as I got it rather quickly (which makes sense for this dish, but it was certainly not reheated enough). I most likely caused my upset stomach afterwards - given the food wasn't reheated enough.

I also ordered a drip coffee at the start of my meal ($2.75). This was perhaps the highlight of my meal and what bumped up my rating from a 1-star to a 2-star. The black coffee was very good for a medium-roast (although they did not have the dark roast that I preferred). They also offered milk / cream / sugar / almond-milk if you so wish to add it. At the end of my meal, the waitress refilled my cup.

It was an OK experience with the pro being the ambiance, speed, price, and wait-staff - the main thing that dragged the experience down was the food and my stomach after the food. 

My only caveat is that Oretta is an Italian restaurant, not a Spanish one, so this dish might not have been one of the best. Albeit, I am sure that most Italian restaurants can heat Spanish food up to the correct temperature."}
{"text":"Going to be honest here: I wanted to go to Oretta because of their oh-so-instagrammable pink wall and stunning decor. It really is beautiful in there. The pink and gold risks looking like 1980s Miami, but Oretta somehow pulls it off.

It seems like other Yelpers have had mixed feelings about this place. I went for a celebratory dinner date and quite enjoyed it. Service was friendly, and our meals were delicious. We had the polenta, beet salad, and pizzas. It certainly wasn't my favourite pizza in the city, but it was quite good. You definitely also seem to pay for the flashy-ness, as well, but I am not surprised given the location. Oh, but note that you aren't able to make reservations beyond 6pm, which is a little ridiculous.

I think I'll go back to try out the cafe as well! (And maybe get some good Instagram content.)"}
{"text":"Booked a reservation for brunch for my partner's birthday on Saturday. Four stars because the food and decor was really good, but the service was just average. 
We ordered the Uova Affogate and the Galletto alla Milanese, both of them were very, very good. Lots of flavour and big portions for the price. 
With regards to service, it seemed we were an after thought every time the server came by. They took our coats, but after the meal, did not give them back to us. Had to rummage through a full coat rack to find them again. I mentioned in the online reservations we were celebrating a birthday, but no mention of it when we arrived. When the server was with us, it was like she was trying to get away as quickly as possible. 
No personal touches or connection with us, especially when it wasn't even busy yet. This type of service is fine at Jack Astors, but if Oretta wants to be considered an above average restaurant, their service should match what they're selling. Come for the food, but have low expectation on the service."}
{"text":"Had brunch with the family...steak & eggs Italian Style! Friendly staff, sophisticated Art Deco decor, delicious home-style Italian cuisine...YUM!"}
{"text":"We got to Oretta on Friday night, half an hour earlier than our reservations. They were very accommodating and definitely tried their best to find us a table or spot at the bar earlier but it was very busy so we stepped out and came back at 9, when our table was ready for us. 
Our waitress was great, very attentive and knowledgeable and her recommendations were delicious. The ragu pasta and calabrese pizza were both delicious and we were more than satisfied. 
The atmosphere and decor inside is also great, we enjoyed ourselves very much."}
{"text":"A very fancy place for Saturday morning brunch. It's very upscale along King West in the downtown core. 

The decor is very modern and elegant with mostly whites and neutral colour. It is alittle cramped though with little space to walk between tables. 

Our waitress was very nice. I ordered a black English breakfast tea for $3.25. I was alittle sad that I had to ask for milk after tea was brought to my table. I didn't like that I was given a single cup of hot water. It was obviously just for a single cup. 

I had several questions about the menu as I like my eggs a certain way. I ordered their bean and egg dish. It originally came with sausage. However, I could not substitute for anything else which was quite disappointing. I ended up having herb bread, a fried egg and beans. Not sure why we had to ask for condiments as these are standard at any place. I did get extra bread which was appreciated. I think the bread was the star of the dish. There was no butter on site. Olive oil, salt and chilli oil were the condiments. The beans were soft but lacking in flavour. I did love the presentation of the dish a lot.

Brunch arrived on a timely schedule. Gratuity was charged at 18%. I paid with a credit card. 

Overall, I would definitely visit here again for brunch though."}
{"text":"I went to Oretta today for a quick solo working lunch, and it was a pleasant but not outstanding experience! 3.5 is what I rate it overall.

The decor is gorgeous, with high ceilings and beautiful soft colours everywhere in the room, from the furniture to the menus. The designer is really brilliant, kudos. 

The food was pretty good, as was the service. I had the fritto misto to start, and while I loved that it wasn't over-salted, a little sauce or something more than a dry lemon wedge would have been nice. Then I had the Contadina, which was delicious except that the chef clearly forgot about the panini in the kitchen and burned the bread badly. No one came to do a quality check on me for about 10 minutes after dropping off the food, and I was so hungry, I just ripped the outside bread off and ate it. I had half the sandwich and salad when I saw my server finally, and told her to that although it was delicious, the bread was hard as a rock. I didn't want another one, but the kitchen made one to go for me anyway, which was kind of them. The salad was hearty and well dressed. The napa cabbage in it was a nice crunchy touch, and made me think of Korea! 

I think I will come again with my husband sometime, as we live two minutes away from the restaurant, and hopefully we will be wowed further. Prices were very decent, which was nice!"}
{"text":"My boyfriend and I went to Oretta for lunch last Sat. The place looks very posh, nice decor, etc. However, both Calabrese pizza and seafood pasta that we shared were average at best. The service was friendly though and the food arrived fast, even though the place was busy."}
{"text":"Lots of hype for this new trendy restaurant, so had to check it out. Excellent service! We had a wonder Italian server. His energy and flare made our night. Beautiful interior and design, reminded me of piano piano. We ordered the beet salad, swordfish carpaccio, and the Piemonte pizza. Highly recommend the white pizza. Otherwise, food was mediocre, but great effort on presentation."}
{"text":"Atmosphere is great

Staff are nice, knowledgeable and prompt for the most part

Food is bland and lacking flavour.. for me nothing else matters.  

Was not impressed.. went to Bar Buca after for a proper bit of food."}
{"text":"Sooo I don't understand why more and more restaurants, bars, and merchants are adding cafe to their already existing and established enterprises...Oretta Cafe is another example of that.. 

I ordered their tiramisu bombolone which was tasteless...another example of things that look pretty not always turn out to be flavourful...Almond milk latte was weak...and I mean boneless weak..

My advice if you're a bar/restaurant stick to being one and let the master con·nois·seurs in the coffee/cafe industry do the rest.

Disappointed.."}
{"text":"First off make sure you have a reservation.

The service is impeccable

I tried Beretta cheese for the first time here...absolutely delicious

The Margarita pizza was good. but too much crust for me.

The Ambiance is very art deco and definitely impressive."}
{"text":"I'll keep it short and sweet.  We stopped in on a busy Friday and were very happy.  This place is fantastic.  Good, drinks, service and decor was above and beyond.
We will be back and will be recommending this restaurant to friends and colleagues."}
{"text":"Oretta is alright. We visited on a Tuesday night and it was decently busy.

We started our dinner with a Tagliere Misto charcuterie plate, which consisted of parma ham, spicy salami and two kinds of very yummy cheese ($22). The parma ham was excellent and I appreciate the spicy kick of the salami.

For mains, I had the Tagliatelle - it has a \"Nonna Lea\" (granny style) ragu. I thought it tasted good and I like the fact that the meat sauce is hearty with chunky pieces of minced meat.

My companion ordered the calabrese pizza (fior di latte, pepper, rapini, and n'duja). Tasted good as well.

We shared a dessert (Torte Firenza) with 70% dark chocolate and pistachio gelato. It was delish.

Service for drinks were a bit too slow for us. It took a good 10 minutes to get a beer, and another 10 to get a refill - there is only 1 bartender on duty and it was busy. This could definitely be improved on with additional staff.

I liked the spacious interior and the art-deco like decor here at Oretta. The food isn't meant to blow your mind, and the prices reflect this (reasonable and mid-range) - It's a good place for a regular meal.

Overall, recommended."}
{"text":"Beautiful resto in the heart of King west. 

We came here to celebrate the Mr's bday on a Friday night. The atmosphere was very lively and the space was gorgeous. We were seated on the second floor near the back, it was a perfect space for a party of 16. 

Despite a perfect location and decor, we didn't find the food to be as good as we expected, it was just average.  My husband's seafood pasta was a bit blend and while my fish lacked flavour. I found myself desperately trying to eat it with whatever else was on my plate just to add some flavour to it.  It hindsight, I just I could of just asked for some salt.  We found the appies to be quite tasty tho, between the fried calamari, meatballs and burrata, we thought the burrata stole the show! 

Overall, I would come back here for drinks and a light bite. It's has a great atmosphere, good service and decent pricing."}
{"text":"Oretta is a new Italian restaurant with 3 sections  - cafe, causal dining and private dining. 

The place is beautiful, service is very friendly 

Price is very reasonable as other reviewer commented. 

My friends and I tried quite a number of pastries and pizza from the cafe. All are tasty and price is very reasonable. I would definitely come back for more. It would be my to go place for Italian pastries. 

The Cafe entrance is a little hidden. That is the alley  on the left side of the main restaurant entrance.

My friends are already planning to go back to try their lunch/dinner at the dining area."}
{"text":"My friends and I went here for a reunion brunch. Some were stuck in traffic so we definitely overstayed (3 hrs?) but the waiter was very patient as it took us over an hour after our actual reservation before everyone finally was seated and ready to order.


Restaurant: very instagram-friendly/worthy place with high ceilings, bright pink walls and cool interior furniture. There was actually an instagrammer/influenced behind us doing a photo shoot while we had brunch. Washrooms are upstairs and you can take a photo from up there of the whole restaurant. 

I think the atmosphere/restaurant decoration makes up most of the ratings...

Food: there were about 10 of us and I seem to have chosen the only dish that was up to its visual presentation. I chose the roasted chicken breast, which was super tender, juicy, and well seasoned. Potatoes were fried and crispy. The veggies though were a bit too oily and salty but overall a solid dish. If it was only based on this dish I might have even given this place a 3.5-4. 

The rest of my friends were not impressed. Most common comment: taste didn't meet the presentation. 

Pretty pricy but expected for this type of fancy restaurant on a popular street downtown TO."}
{"text":"Beautiful restaurant and it gets really busy on weekends. The food was average and there wasn't that much wow factor to it. Though I would recommend their pizzas and their seafood pasta."}
{"text":"This place SUCKS! 
I walked by one day and they were offering complimentary pizza slices. I was told they hired the best pizza maker in the city. Meanwhile the pizza was bland and the crust was rock hard, I had a couple of bites and threw the rest in the trash.
But I still decided to give the place another shot and took my folks for lunch.
They charge $5 for bread/breadsticks and claim they don't have butter nor olive oil. The bread they served was stale.
I ordered a coffee but they don't carry cream! Like wtf?
I ordered pasta and was not offered parmesan cheese! The pasta was cold too!
Our initial waitress was brutal. After mentioning this to the manager, she was replaced with someone a lot friendlier and the service was better.
Overall, Oretta was a terrible experience and would never go back. With Gusto, Masseria and Buca located in the vicinity, I doubt this restaurant will have any success. Total bush league operation."}
{"text":"Space: There were about 9-10 of us and the area where we sat was notably dimmer than the rest of the restaurant, which was bright and airy. We asked for the extra lights to be turned on but they refused for whatever reason. \"We usually keep this area dim\" was the reply. Later on the lights turned on anyway, which was great, but then they went off again 

Food: Awful. Some people switched plates with each other in hopes of maybe finding something better. Some said the gnocchi and ravioli tastes like defrosted and microwaved frozen food. I ordered the arctic char, which was mediocre. The appetizers (calamari + bruschetta + deep fried artichokes), on the other hand, were great. 

Would not recommend."}
{"text":"My fave local haunt. Authentic Italian food. Fresh ingredients. Lovely deco and atmosphere. Formerly and helpful staff. Kate at the bar was thoughtful and chef Edward made home made Italian recipes second to none. 
It also has a great cafe at the back. And the coffee is killer good!!!"}
{"text":"Really mediocre food... also, the interior of the resto looks WAY more impressive in pictures."}
{"text":"Honestly our stop by Oretta's cafe really dampened our day. Despite the beautiful ambience the service was terrible and the food was mediocre. The red head that took our order was so unfriendly, and it was blatantly obvious she did not want to be there let alone have us bother her with questions about the baked goods.

I ordered a cappuccino and a slice of tangerine cake, and then went to go
sit. The red hair barista didn't even let us know when she finished making our drinks, just left it there in the corner of the counter. :/ As well when she cut out slice of cake she used her hands to move it off the display. Like have you not heard of utensils?! She never washed her hands at any point during our stay, even after going to and from the bar, which is unacceptable. 

In terms of food the cappuccino was really  good (the only reason this place is getting anything above 1 star) but really small. The tangerine cake was way to sweet, the flavour lacked depth and it was kinda dry. 

Overall I don't plan on coming back, and will definitely not recommending this place to anyone."}
{"text":"This is a really pretty restaurant, but unfortunately my friends and I were seated at a table in the back corner, so we didn't get to enjoy the full effect of the ambiance. Toronto is full of good Italian restaurants, so the bar is set pretty high. Compared to other places, I would say Oretta is just average.

My friends and I got the fritto misto platter ($14) to share first, which was just a seafood platter with fried calamari, smelts, shrimp and haddock, and beet chips. This wasn't bad, but overall was just okay - I've definitely had better calamari at other places in Toronto.

We shared a couple of other main dishes, including the pizza capricciosa ($18) (tomato, fior di latte, proscuitto, white mushrooms, artichoke, basil), tortelloni ($19) (carrot and ricotta, brown butter, hazelnut, sage) and torcetti ($24) (seafood pasta with shrimp, scallops, cuttlefish, mussels, cherry tomato).

Of all the dishes, the tortelloni was surprisingly my favourite, despite being so simple and a vegetarian dish. I think there were some chopped nuts sprinkled on top of the dish, and overall with the brown butter gave the dish a really nice and light but nutty flavour that added some depth to the dish. There was also a slight sweetness to it that I enjoyed. Otherwise, the seafood pasta was pretty standard, as well the pizza, although it was enjoyable (read: nice, thin, chewy crust).

I wouldn't be opposed to returning to Oretta again for the ambiance, or maybe for drinks and dessert on another occasion, but it wouldn't normally be my first choice for Italian food. However, the prices were pretty reasonable. While I really did like the ambiance and the service was quite good, I think this restaurant will need more than just a pretty space to stand out in Toronto's food scene."}
{"text":"Oretta just opened earlier this week.
I was here Friday night for dinner and liked the food, service and atmosphere. The restaurant was fully booked for the evening and the only reservations available were for 5 and 6pm, however they will accept walk-ins on a first-come-first-served basis and there are no reservations at the bar. I was there at for my 6pm reservation and there were only a couple other people there and the dining room didn't start to fill up until almost 8pm.
The bistro-styled vaulted 2-storey space has a really nice feel with plenty of art deco touches and an impressive bar are dominating the center of the dining room. It feels comfortable, modern and not at all stuffy. I especially like that it is not a loud restaurant and you could comfortably have a conversation with others at your table without yelling, unlike many restaurants out there.

I started with the Bison tartare which was nicely prepared and seasoned. The breaded soft boiled quail egg made for a nice creamy sauce for the tartare. For my main I had the Gnocchi with squash and healthy shavings of truffles which was really comforting and satisfying dish. I ended my meal with very nice zeppoli (a Italian doughnut), which was more crunchy and flaky than a typical zeppoli and filled with a light and a mildly-sweet chestnut cream filling. It's a nice dessert if you are not into sweets.

My meal was very reasonably priced, especially for King West (and considering Buca is across the street), and everything about it was great which is very impressive for a newly opened restaurant. I will definitely be back again!"}
{"text":"From outside this restaurant looks very spacious and welcoming.  Friendly wait staff who are very knowledgeable about the menu and open to recommendations  Starter of deep fried polenta and deep fried artichoke with truffle sauce amazing taste and presentation. Main dish was ravioli stuffed with a hazelnut purée and  a butter sauce which was a melt in your mouth taste sensation.  To end I chose a chocolate Firenze super sweet but a nice finish.  Overall highly recommend this restaurant Monday night was quiet with a gentle Buzz weekends would be fun"}
{"text":"New restaurant in the fashionable king west neighborhood. Diverse menu with a good selection of pasta, pizza, seafood and meats. 

I had the seafood pasta (starts with a T) which was tasty. 

Upscale but non pretentious environment with friendly staff makes the restaurant a great place for dinner with friends, family or colleagues. Would be good for a first date as well."}
{"text":"This was one of the worst dining experiences that I have ever had. We had a reservation for my friend's birthday, but didn't get our table for 30min. The hostess offered to let us get drinks at the bar while we waited, but the service was so slow that only one person actually managed to order a drink. Once we were finally seated, the extremely slow service continued for both drinks and food. It took over an hour from when we were seated (over 90min from our original reservation) to get an appetizer. Once the food arrived, it was basic at best. I spoke to our waiter, as well as the manager, who gave me a non-apology. Absolutely terrible service top to bottom."}
{"text":"A friend asked to meet me for dinner and wondered if I was okay with Oretta as an option, and I actually got really excited because I'd never heard of the place. Going to a restaurant without knowing exactly what I'm going to order? What a novelty!

We decided to start with the Tagliere Misto (\"selection of two cheese and two meats with pickles and jam\") and it was very good. It also came with a whipped ricotta spread that was nothing short of delicious, while the meats and cheeses were also excellent. We could've used more than three slices of bread, but that's a fairly minor complaint.

For my main, I decided to order one of the pizzas: the Calabrese (\"tomato, fior di latte, n'duja, rapini, pepper\"). It's pretty tasty but falls short of excellence. My biggest problem was the inclusion of the rapini, which, although I usually enjoy it, was so bitter than it obliterated the other flavors in the pie. I enjoyed this pizza well enough but it doesn't quite compare to something like Pizzeria Libretto, unfortunately.

I should also add that the service was above average, although the restaurant does do that thing where they place the tables way too close together."}
{"text":"Positive: Drink was great for the price. Ambiance is so comfortable. Service is extremely friendly and always attentive. Seriously loved the service. 

Negative: Food was not worth the price, at all. Although the food was okay, it was not flavored enough (from someone who hates too much), and the presentation was like someone just slopped food down on a plate. I suppose I expected, with the atmosphere and price of food, that my food would look and taste amazing."}
{"text":"The decor in this place is interesting but a bit mixed matched. We had reservations for 8:30pm but didn't get our table until about 9:00pm. What's the point of making reservations if they don't honour them? We were throwing a friend a surprise party and we were waiting right at the front. One of us asked the host to keep us hidden in the back so that we could surprise the birthday girl, which they accommodated to(that was really nice) I was craving a sangria and they offered to make me on but as I finished my drink...there was a piece of ceramic in it! OMG how embarrassing!! How does that even happen?! They offered to comp my drink which I thought was a given. The pizza was delicious...I let our waitress know I was vegan and they accommodated to that. Other than the great service from our waitress, I would never come back here. I think it's all hype with no delivery."}
{"text":"the steak and eegs were really good. i usually don't eat steak and eegs for breakfast, but i really enjoyed it."}
{"text":"Three of us popped in around lunch time mid week so not very busy. Staff were lovely! We had entered off Stewart Street into the small cafe and was immediately greeted by the hostess who escorted us to the front. Our server was just as friendly so in a nutshell, the staff we encountered were great! We all ordered the panini and have to say, they were ok. Not great, but not bad. The salad accompaniment was light and fresh and very good. I had the vegetable pannini and it was a bit greasy for my tastes. My friends had the pulled pork and both enjoyed theirs. The decor (mentioned by other reviewers) was fun and looks like the huge glass windows will open up in the summer. Will definitely go back and try other menu items given the friendly staff and relaxed vibe!"}
{"text":"Went here with some friends for happy hour. We tried all the food on the happy hour menu, delicious! The drink prices are good and the service is amazing, I would go back for sure :)"}
{"text":"I'd say this is the best Italian resto in the neighbourhood!! Friendly staff. Excellent selection of wine and cocktails. Delightful dishes. Stylish decor. Highly recommended!!"}
{"text":"This review will only be about Oretta's cafe.

I decided to head to Oretta to try out the coffee and pastries at the cafe. The entrance of the cafe is located left of the main restaurant entrance down an alleyway. You may miss it if you don't know it's there. 

Upon arrival, the interior of the cafe is bright and colourful. The colourful floor tiles draw you in and the big windows allow natural light to flow into the small space. The cafe counter is connected to the main restaurant kitchen so you can see the cooks hard at work making pizza and pastas. I went up to the counter to order a pastry and a coffee. The lady who served me didn't seem approachable as if she didn't want to be working there. I asked her about the pastries that were displayed and she answered in a judgmental tone with attitude. She also forgot to enter in my coffee when I was paying (I was nice enough and told her that I had also ordered a coffee other than the pastry). After getting my items, I sat down.

The cafe space is small and can fit about a handful of people before it gets too crowded. The big table in the middle is a great addition but also makes the space much smaller and more crowded as people try to find seats here and there. 

I had ordered an Americano and a cheese croissant pastry that was in the shape of a bagel (I have no idea what it's called). Both were good, Americano was made well and the pastry was enjoyable. When I finished my items, I took my dirty dishes to the counter. However, I found that there was no place to drop them off (I'm not sure if staff are supposed to clean it up but I wanted to be nice and clean up after myself). I stood at the counter area for a solid minute trying to get someone's attention before someone (probably a cook) noticed that I was holding dirty dishes. Both employees at the counter failed to notice that I needed help nor did they seem that interested in trying to help.

Overall, the cafe is a beautiful addition (in terms of the interior) to the restaurant but it lacks that friendly service that you expect. The experience left me a bit disappointed with the cafe, however, I am willing to still try the restaurant in the future as I do love Italian food."}
{"text":"I tried Oretta a little while ago for my friends birthday. Another friend and I took her there for lunch. Luckily we went on a Monday afternoon so it was pretty dead and we were able to walk around and take all the insta- worthy photos we desired. The interior is absolutely beautiful! I'll give them that! Also be sure to check out the cafe tucked away on the side.

The food was fine but nothing to write home about. There is definitely better Italian in the city for more reasonable prices. It's clear the prices are jacked due to the area and interior, that's how they get away with it. But all in all service was good and the food was good. Definitely was feelin' those polenta fries!! 

Would I return? We'll see!"}
{"text":"This is an odd place. Located on King, you'd think this would be a very luxe, high end establishment where you might meet the Queen, or like...Billy Dee Williams. But it isn't really that fancy. Oretta is the kind of restaurant where people who think they have a lot of money go to flaunt but it's like c'mon Steve; you're like upper middle class at best. Anyway, I went here for a work dinner with a large group and the staff were very friendly. I ordered ravioli and some apps and a dessert and everything was alright but not spectacular. To me it's not fair to charge so much for food that is ultimately just okay. Like all restaurants, I had hoped that they would be more mindful of including vegan options; perhaps something they can work on. The decor inside was cool but I just couldn't get over this almost faux high-end experience they were offering. I noticed a couple of families seated around and I feel like that's probably the type of group that would really enjoy Oretta. Overall, a good experience but nothing that would compel me to recommend it over other places."}
