{"text":"Amazing restaurant. Love the authenticity. Service was attentive and knowledgeable. Fried anchovies were a nice surprise. Organic salad was perfectly dressed with simply good olive oil, lemon and salt and pepper. Plenty of food and good friends made for a great dining experience."}
{"text":"Excellent Italian food. Portions are small, so you'll probably want three courses.  It's not cheap but the quality is very high. Nice wine list, reasonably priced for a resturant."}
{"text":"I have visited Osteria 3 times since it first opened. It's a beautifully designed room with a long communal table surrounded by smaller tables that seat 2-4 people. Italian wines are sorted along one wall according to region. The first time I went was for lunch and the meal was great. I was impressed by the changing menu and the fresh apps were fantastic. It was a flurry of nice and clean tasting dishes from Italy, accompanied by a bottle of Prosecco. I could barely go back to work and almost fell asleep at my desk with a smile on my face. 

The second time I went I had an octopus carpaccio and I was sick shortly after. My initial experience here was so good that I couldn't believe it. I wanted to like this place but the severity of my runs scared me. 

The third trip to Osteria was barely better. We sat at the communal table next to some loudmouthed elementary teacher that reminded me why I hated school as a kid. Fearful of my last experience, I went for a simple lamb and maccheroni dish. I ended up sending this dish back twice because it was under cooked. How hard is it for an Italian joint to cook pasta? My server tried to explain to me that semolina pasta was supposed to be white and crunchy in the middle. I told her to forget about it and asked for my bill. 

Pass on this place. I wanted to like it but t's overpriced, overrated and made me sick. Their sisters at Terroni are much better."}
{"text":"Antipasti fixed menu is interesting

Had the pasta today, it was home made gnocchi and absolutely perfect"}
{"text":"If I were rich, I'd eat at this place every night. Great salads, great pizza, great wine, great atmosphere. Highly recommend."}
{"text":"Great concept. Almost every dish is $15: antipasti (a plate of five little bites), primi (pasta, risotto), secondi (meat, fish). You can have two courses for $28, or three for $35. Menu changes often, dishes tend to be rustic and traditional.

Execution: on this week's visit, the antipasti were kind of dull -- two were kind of bready, rabbit wrapped in bacon was a bit dry, soup wasn't bad, and the eggplant parmigianna was the only one I really enjoyed. Pasta? Ordered it because guanciale was listed as an ingredient, but where was it? Dish was OK, but I wouldn't order it again. The only stand-out was dessert - semifredo al torrone, with chocolate ganache and incredibly rich sabaione. 

Also, it would be nice to have more reasonably priced wines by the glass."}
{"text":"I like the food here.  The antipasti fixed-menu concept is great, and being able to select a main/pasta is enough choice if you don't want the fixed antipasti.

If I have to find fault I would say:

- food is slightly too salty on average
- portions are fairly small and price is fairly high, so if you're sensitive to either (or both) then this place may infuriate you."}
{"text":"My friend and I ate at this lovely Italian restaurant last night.  We had the charcuterie board and shared two pizzas.  

The charcuterie board was okay came with two types of house cured meats (only 3 of slices each). Two cubes of cheese, olives, artichoke hearts, fried pizza bread, and a couple pretzel-like rings.  It seemed a bit skimpy but for $18 we couldn't complain.   

The pizzas were very good; we ordered the white pizza with pears, pusutto, walnuts. And the other was with a tomato sauce and house made Italian sausage.  The one with Italian sausage was a bit soggy (maybe too much tomato sauce) but the crusts on both were quite thin and there was a delightful crunch in every bite. The pear pusutto pizza was delicious (might be a bit sweet if this is your eating on its own though). Both pizzas were $18 each. 

The only issue I had with osteria was that we ordered wine right when we were seated and it came after we ate half of the  charcuterie board.....it also saw the other table being served their wine mid way through their main.

It was also a bit confusing as it seems that they have consolidated with the restaurant next to them but there are still 2 names on the building."}
{"text":"Very nice atmosphere on first glance but misses all the marks. we grew more disappointed as the evening wore on:

1. tables are too close together. I could barely get to the bench side of the table and i'm thin. we were on top of the two people next to us. terrible idea for a date place. also, the place is loud and echoey. 

2. the cocktails are ridiculous. of the 10 \"special\" cocktails, there wasn't even one classic. we both had ones with aperol in it. i can't imagine many people like this flavouring, why put it in so many cocktails?

3. the tapas is very overpriced and the flavours are bland and seem uninspired. 

4. service is flippant and elusive. there seems to be a real arrogance in the staff.

5. after the above disappointments we left before ordering a main course. considering the cost, this place was a huge rip off."}
{"text":"Been here once for dinner, once for lunch.  My Italian friend swears it is real Italian.  
Most recent visit was for lunch.  it was a nice place for a quiet, leisurely meal.  The server, who had just returned from visiting family in Italy, was very helpful.  Thank you Claudia.

The bread was some of the best I've had in a long time.  Fresh, chewy, airy on the inside with a crisp crust. Also, two kinds, whole wheat and white.  Tasted like maybe a little sourdough as well. Olive oil on the side had flavour and bite.

I ordered two appetizers for lunch.  The swordfish carpaccio was amazing.  I hoovered it up in no time.  Very fresh, very thinly sliced fish, olive oil, oranges, fennel, pistachios, and arugula - with a big slab of fresh bread.

Next course was a roasted beet salad with ricotta - also lovely, but anything would have been anticlimactic after the carpaccio.  Nice wine recommendation by Claudia.

I did not stay for dessert but did stop for an espresso and pastel de nata (Portugese custard tart) at St. Lawrence market to keep everything in balance."}
{"text":"Had high expectations, but will not be returning. If you want food poisoning, small and overpriced portions, and unreliable service, I suppose you could give this place a try....... 

I had pasta with beef ragu, which was fairly decent at $15. It was handmade, but many other restaurants offer handmade pastas as well.  A few of my friends had decided to get a $16 scallop dish (as an appetizer) and was served literally 2 scallops, which were paired with little sauce and a piece of stringy cabbage on the side.  The dishes here were mediocre.  Not much to brag about, and definitely not enough to pay over $15 for fist-sized dishes (pretty much everything on the menu). 

Since it was our friend's birthday, we wanted to surprise her with a dessert, and secretly asked the waiter to serve a caramel mousse with a candle (we had seen another table receive the same service). In the end, the waiter seemed to have forgotten about our little request and casually walked up to the table with a dessert (no candle), and asked who had ordered it.  Our surprise was effectively ruined. 

To boot, the birthday girl ended up with food poisoning from her dinner. Strike three!"}
{"text":"I pass by this place every now and then and it is always packed, not surprising as Terroni seems to have a handle on Italian food establishments all over the city and the location is quite central.
Reservation was via open table though it will show up under Le Bettola Osteria. For starters they don't have the prix fix menu anymore. Never mind they have combined the menu of both spots so one can order things from both sides. 
I was a bit early so went through it again as had to rethink what to order. 
After a bit of contemplating we settled on ordering Burrata cheese pizza as an app to share I ordered a halibut for the main. My friend ordered a pesto pasta. 
We were given some good bread to start with a nice olive oil for dipping. Good start. The Burrata pizza is served with cold topping and was good. Then the wait started even though we were checked on regularly there was no sign of the main courses.
Halibut though cooked well was nothing special. Not much seasoning which is fine but the sides could have elevated this dish a bit. I did taste the pasta and being my jaded self when it comes to pasta dishes didn't care for it much. 
For what one pays here I would say I expect better.
2.5 stars."}
{"text":"Nice decor. Food is really good. Plate are just the right size.  Service is good. They come check on you just the right ammount of times without being overwhelming."}
{"text":"Can see why this is becoming a chain! We were there on a busy Thursday night and our mains were on the table within 10 minutes of ordering. Professional, attentive service, and a really great meal. I had a super interesting salad with pumpkin seeds and beets - great combo. They have a bakery/specialty shop at the front of the Adelaide location that is very attractively set up and smells amazing. Will return! Note that this is probably not great for a first date as it's quite loud in there."}
{"text":"Great place and food. The combination of antipasti is really a paradise for foodies. Do not expect big portions."}
{"text":"Seating was tight as others have complained but service was not bad. The food is amazing though and I thought was fairly priced. Our server recommended great dishes and the ambience was lively, not quiet. I will be back for sure"}
{"text":"We went there on a Friday, and they had a seafood prix-fix menu. I got itand it was really worth it. 5 different appetizers, a pasta and a branzino, all delicious.
I would definitely recommend this place"}
{"text":"I'm loving the atmosphere in here. Casual Fine Dining, I think they call it.  We need more restaurants like this.... that serve more than just Italian Food. 

OsteriaCT is in the heart of downtown, just a few steps away from the Core. It's neighbour, La Bettola De Terroni (also own by Terroni et al.) is a bar/loungey feel, with a very similar daily menu and the added bonus of pizzas. 

Thursday night at OsteriaCT was bustling. The menu has variety and well priced (except some tricky math...), except a bit confusing (as was the bill later).  

It says (per person):
5 Antipasti ($15)
5 Antipasti + Primo ($23)
5 Antipasti + Secondi ($28)
5 Antipasti + Primo + Secondi ($35)

In the menu, you will see:
-  the Antipasti for the day. There are no prices. You get all or you get none.
- Primos (Pastas) for ($15, except one for $12)
- Secondis (Main Dishes, meats and such) for ($15)
There are also specials for $22/$28 on the wall, that include the 5 Antipasti

If you break this all down, essentially your best deal is the last Full combo, getting the Antipasti + a Beet Salad for free. 
If you're getting Primo, you're paying an extra $8 (instead of $15)
If you're getting Secondi, you're paying and extra $9
If you're getting both, you're paying an extra $5  

At first I was annoyed by the math in all this, and we decided to be cheap and order only 3 combos for the table, and share the Antipastis. 
I take this back after they came, because they were quite yummy. I might even say better than my Primo. Well worth the extra $8. And you won't want to share.

I also feared the portions will be tiny, especially since I\"ve been to other restaurants and they take the Primo part of it seriously. I was pleasantly surprised when it was somewhere in between, and because it was pasta, quite filling. 
I would recommend getting a Secondi, only if you're planning on sharing with one or two other people. You want room for dessert!

Our server was okay. She wasn't super friendly, and I felt she was a little cold and condescending, but it wasn't anything either way.  She spoke fast, explaining to us how the menu worked, and when taking our order, assumed everyone will get getting the Antipasti. 

I got the Orecchiette with Rapini, Anchovies, Chilli + Garlic. Since on the menu they had a Spelt Orecchiette for another dish, I asked if I can substitute. I was given a blunt \"No\" and an annoyed look. I gave an equally annoyed look back when I realized that these dishes are either premixed (unlikely) or made in huge batches (more likely, but why not just do another pasta? I'd pay extra). It was an instant minus-one-star moment for me. 

My pasta was yummy, but some of the pieces slightly too al dente. My boyfriend's Gnocchi in Lamb Ragu was over powered in Cheese flavour, less of the Lamb. Good, but disappointing. Maybe it was the Bread Gnocchi instead of the potato. 

My cousin ordered the full deal and we got to try the Mung Fish... or wait, was it Munk Fish? (probably) Sitting on top of fennel and olives, and hidden under a pile of shave onion that looks like bonito flakes, were 2 small pieces. Flavourful for sure, but a small ratio between fish and the rest.. 

For dessert we shared the decadent flourless chocolate cake $9) covered with zabaione (which I learnt is egg yolk+sugar). It's made \"especially for you\", says the menu - as opposed to everything else....

The olive oil sponge cake was something different ($8) with white chocolate butter cream. We found the butter cream a bit too artificial tasting, but the cake itself was moist and sweet. 

Perhaps I haven't had Italian food in a long time, and although it used to be my favourite, I've come to realize that ingredients are really basic, but methods and techniques are something to appreciate. 
The pastas shouldn't cost more than $15 a person, and that's what they do here. 

With no wine, and dessert it came to about $30-35 per person including taxes and tip. 

----

Overall, 4 stars for food taste, prices and quality. Minus one star for the bumps along the way.
I recommend the place for groups or a casual meal after work. 
 
note: they change their menu everyday, however, I'm looking at it now at the menu dated for March 17th and it does look really similar to last night (March 24th)with a few exceptions. I'm just saying."}
{"text":"Came in for dinner with friends.

Pretty nice ambiance. A tad loud due to design so great for social butterflies but not so good for dates, you won't be able to comfortably carry convos! There is also the italian \"Communal table\" so daters, consider yourselves warned!

Dishes taste pretty good but the pasta feels a bit undercooked to me and my SO. Overall not hugely impressive but definitely a very good fare and decent service to boot.

Would go back."}
{"text":"The food was pretty good here, but it's not hard to find good \"authentic\" Italian food in Toronto. At issue for me was the massive shared table where our group of three was seated, and the proximity to other customers, such as the one who elbowed me all lunch long even when there was no one on his other side. This is Toronto. People here aren't friendly, so don't force us to sit side by side with strangers. Yuck.

They do make good homemade pasta, and the pasta I had with pork ragu was quite tasty.  The wines are all Italian. The staff were busy but generally pretty nice. I just absolutely hated being elbowed by a rude older man all lunchtime long, and because of that giant shared table, I probably won't go back."}
{"text":"I was totally prepared to give this 5 stars upon walking in the front door. Beautiful interior and great menu. Thing is... the portions don't match the prices. 

I'm not saying I expect Applebee's portions but they could have bumped ths size of the antipasti up a little. The food was excellent, tho. Octopus carpaccio and fried zucchini flowers were wonderful as was the  seared tuna with capers and dandelion greens.  

But it's no Gio Rana's! Regardless, a perfect place to hit before going out on the town. Just a little steep for what you get."}
{"text":"Started off well but ended poorly would describe my experience at Osteria.

The antipasti were all really great (especially the seafood one). They were small but had we stopped right there it would have been fine. But we decided to try more things and it all sort of ended up crashing and burning.

The ciceri e tria pasta was a bit strange. It was really soup-y and had a lot of chickpeas. The grilled sea bass (or something like that) wasn't particularly good either. The bottom was quite burnt and it was kind of tasteless.

I think the best advice I can give is to stick with the antipasti and give the desserts a try. Although I didn't try any dessert, it seems as though other Yelpers have had a good experience with it."}
{"text":"Fantastic italian - homemade pasta. Had the truffle and sausage chitarra! Amazing and will go again. Great service as well."}
{"text":"My friend and I finally got to meet up for dinner yesterday and we ended up at Osteria for some delicious food.  

We saw the menu LAST week, and there were about 4-5 different times of gnocchi - including one that had eggplant.  \"WE MUST GO,\" my friend said.

I'm supposing they change their menu quite often -- because when we went, they didn't have the eggplant gnocchi anymore (sad face for my friend). 

Anyhow, I ended up order the gnocchi with the shrimp, and my friend ordered the orecchiette with the eggplant.  We had the antipasti to go with it - and it was pretty good; I thoroughly enjoyed the croquette.  My gnocchi was absolutely delicious -- I love gnocchi and it was absolutely well done.

I ordered dessert: a flourless dark chocolate hazelnut cake.  It was okay - I liked the dessert selection better at both Terroni and La Bettola better.

Service was mediocre.  I don't know if the waitress was having an off-day or if she's always like this.  She was being a bit b*tchy, which I didn't really appreciate.  Otherwise, I had a good time there, but I would prefer the sister restaurants more.   (However, if you're craving good gnocchi, this is a definite recommend)."}
{"text":"Love this place. Food is fantastic! The staff are great and most all speak Italian! The truffled pasta is one of my fav dishes. I also love the gelato."}
{"text":"Cute authentic Italian place, but I still prefer Terroni's next door, which I think is owned by the same owners.  The fixed antipati taster menu + main is definitely interesting and in retrospect I would have ordered that but I'm not a big eater and could not finish my heavy ox and pasta.  Went here with a few coworkers and an out-of-towner and we were all planning to hit up a pub afterwards but the bread, pasta and wine was enough to knock us out on a weeknight.  We ended up going home immediately after.

The pasta, like at Terroni's was perfectly cooked, but I found that my dish did not have enough sauce and was a little dry.  I had a taste of my friend's gnocchi and it was very perfectly done.  The environment was moderately loud and the place had a rustic and cozy feel, which can also be seen as a little crowded.  I would imagine that in the middle of winter when everyone will have winter jackets, this place might be a little uncomfortable."}
{"text":"My partner and I stumbled upon Osteria while hunting for dinner one Saturday evening.  We didn't realize that this petite diner is also run by ... surprise, Terroni!

The prices are steeper than its sister locations and I felt out of place; the clientel here reek of money and it shows.  Boccaccini, artichokes and minestrone were all fantastic.  I'd like to give Osteria 5 stars, but the two of us left a bit inebriated from half a litre of red wine and my memory was a bit fuzzy ...

Definitely a good secret to be kept for the die-hard foodies.  Just wish I could afford to come more often!"}
{"text":"The food is pretty good but if you have FOOD ALLERGIES, intolerances, sensitivities, etc. I'd suggest NOT going here. I have an allergy to pine nuts and the proper precautions were not used to ensure that there were no pine nuts in my food. In fact an entire dessert was full of them and I broke out in an allergic reaction which only worsened tremendously once I left. The waitress removed the cost of the dessert off our bill. Gee, thanks. I'm fortunate that I'm not deathly allergic to them otherwise I would've died in the restaurant! Maybe if I died they'd have taken the wine off the bill too. The waitress did not assume any responsibility and actually blamed the kitchen staff when later after my friend talked about it it ended up being her fault after all. She was rude about the whole thing and has no compassion about food allergies because she doesn't know what it's like. I would not risk eating there if you have a food allergy. The service was rude and insensitive, the food was only ok, the atmosphere was cute, but the rude service and ignorance of everyone involved really made me never want to go back. As a restaurant you need to take food allergies seriously because you can kill someone. All staff need to be properly trained on proper procedures."}
{"text":"Besides the long communal table that takes up a third of the dining room, the remaining tables (2 or 4 tops) are quite small in this rustically decorated and atmospheric room. After having been sat at a rather awkwardly placed table right beyond the foyer, we wondered aloud whether a larger table might be more suitable, but weren't moved until after drinks (a half litre of Camestri, served from a cute little painted pitcher) were served and our food arrived. 

It would have been nice to have been sat at the banquette right off the bat and not have needed to follow the train of servers (carrying our many antipasti) while salivating from excitement like hungry puppies. 

The pleasingly multi-coursed pesce dinner for two - $50/person, and included ever so lightly battered and fried dainty little calamari arms, sweet and perfectly thinly sliced octopus carpaccio, fresh and meaty tuna tartar, cod fritters which could have used a nice cream sauce or dip, an entire seabream baked in salt that was a bit too salty in some parts, shellfish ravioli that was a bit dry on the edges, but plump and juicy on the inside, roasted fingerling potatoes, a huge tossed salad, and vodka sorbet ) was a fantastic way to sample Osteria's large Southern Italian menu. The flavours were simple but perfectly balanced with the abundance of lemon wedges supplied.

The service was excellent throughout the evening and despite the hussle and bustle of a Friday night, the flow was considerably constant. I look forward to returning to try some of the other dishes a la carte and saving room for dessert."}
{"text":"Modern atmosphere and standard service. Good food but nothing really special.  
Had Spaghetti alle Vongole. Clam was cooked very well. Pasta was okay. Not sure why but something in the pasta tasted like instant noodle soup powder. Meh. 

I heard pizza was very good and it is made in the authentic Italian style, so I might try pizza if I happen to come here again."}
{"text":"Fantastic Food with an interesting menu concept, sort of like a pre-fix menu only with more options.

You can order just 5 antipasti, or add one of a selection of primi(pasta), and/or one of a few secondi, along with the options of sides. The antipasti are small but flavourful and vary daily, I especially liked the fried ball of octupus and calamiri,  and the horse meatballs. 

And the dolci (dessert) was excellent, a molten chocolate cake with zabaglioni sauce on top, sitting in a bed of chocolate sauce"}
{"text":"Wish I could give this a better review. Food was actually quite good seems quite authentic Italian.  Atmosphere lively and nice decor.

The service from my server could have been much better. Barely a greeting, no introduction, no follow up during my meal to ask how I was doing, if I wanted pepper etc.; after a long wait if being ignored plate finally cleared without asking if I wanted dessert, a quick brusque query if I wanted coffee . Disappointing service by server (greeter at door was very nice).

Secondly the glasses of wine start at $11.  And they aren't even very generous, a small portion for a crazy price. That's pretty outrageous given that it's not really a super fancy restaurant.

Wish I could rate it higher but can't."}
{"text":"Great meal. everything was fresh, tasty and well presented. Service was attentative. Second visit and will return."}
{"text":"This review is solely based on the first impression and service of the restaurant. My friend made a reservation at 6pm for table of 4 on a Thursday night. I got there early so I've decided to get a table first. I entered into the restaurant and waited patiently since the hostess was ushering guests into the dining table. 2 minutes later, an older couple came in and waited next to me. The hostess completely ignored me and greeted the couple and seated them to a table. I was upset but maybe its not that big of a deal. I told the Hostess that we made a reservation using open table. She said she couldn't find the name of the reservation and asked us to call Open table instead. We have a reservation number and confirmation number on the cell phone, but she didn't check or honor our reservation. This is the worst service I've ever encountered and I'm surprised that she works for a service industry. Totally unacceptable!!!is this the type of response or service you were trained to give? I'm sorry but your incompetency is hurting the reputation of your company."}
