{"text":"I love this place, I have checked in 3 times but you can bet I have been here at least 30. The food is great. The drinks are always good and dont forget to use the Yelp offer for free edamame when you go."}
{"text":"I had lunch one time and the sushi was pretty good but I think they're overpriced for a lunch menu. I can get sushi just as good 4 miles down the road for a lot less. The restaurant itself is very clean and has nice decor. The staff was also very friendly."}
{"text":"The food was very good, the service excellent (I really liked our waitress). Some of the sushi came a tad slow and they did forget a roll we ordered. That said, I'd definitely go again. The I love salmon roll was outstanding as was the red blossom roll. There was also an issue with the restroom but overall I would give it a B+ and am sure it will only get better from here!"}
{"text":"The atmosphere at Otaku was wonderful! This was my first time coming here and all of the staff was extremely friendly and welcoming. As soon as I walked in I noticed how amazing decorations are and got the feeling that it was a more upscale restaurant. The whole place was very lively and fun, definitely not stuffy.  This was only my first time eating sushi, or even any type or seafood, so I wasn't really sure what to order. The menu was huge and had so many choices things to order so I decided to ask what the waitress recommended. The waitress was very friendly and after asking what kinds of foods I liked she recommended I get the spicy tuna roll with rice paper instead of seaweed. The presentation of the sushi was quite nice. However, I was not a fan of how the sushi actually tasted.   This being my first time trying sushi, I was not impressed. It could have been that I just don't like the taste of sushi because the other people I was with seemed to enjoy their meal. The food was definitely a little pricy, but the atmosphere and friendly wait staff was spectacular. I had a wonderful experience for my first time at Otaku and would recommend it to anyone who enjoys sushi."}
{"text":"Beautiful place! Unfortunately, the food was only mediocre. Went with a groupon and the waiter was nice enough to ring up two separate tickets for us, since we couldn't use our groupon on happy hour items. We got the Las Vegas Roll, which was not very good. We also had edamame, which was good (hard to mess that up). For our entrees, we had the Mongolian Beef and Combination Chow  Mein. Both were very heavy handed with salt. Probably the worst part was the manager, who spent quite a bit of time at a table in our area. He was very loud and overly assertive with his authority. At one point, he called our waiter over to have him fill their water glasses whereas a good manager would have taken care of it himself. He seemed eager to impress the patrons of the table. A bit later, he commented \"That's how we do it at Otaku.\" Ew! Obnoxious! Overall, not somewhere we will go again."}
{"text":"This is only my second review on Yelp and I'm reserving my judgement on the whole idea of Yelp due to  my first post being removed from the site for reasons unknown.  That being said, we had dinner last night at Otaku - we've been there in the past, enjoyed it and decided to visit them again.  We enjoyed the sushi - it was very good - Ben and Jesus were fun to talk to with and we found our taste in fish very similar.  The service was great, our beer glasses filled when needed and we felt very welcomed.  We will definitely go back to see what other specials they have to offer."}
{"text":"Nice decor and tasteful layout.   Went there for lunch and the food was nothing spectacular.   Service was rather slow, given that there was'nt much of a lunch crowd.    The sushi was just ok, have tasted better and the Bento box was interesting but nothing to write home about.  In summary great place if you have a GroupOn or for Happy Hour"}
{"text":"Went to Otaku last night (3/5/11) - it was horrible.  It took us an hour to get a noodle bowl - how long does it take to cook noodles?  It was SO salty it was inedible.  We did not eat it, paid for our drinks, and left.    The service was also terrible!  They did not have enough menus to go around, we had to share.  They didn't have enough forks so I had to wait 10 min to eat (yes, I eat Asian food with a fork).  I actually wish they had never found me a fork so I wouldn't have found out how awful the food was.    One more place near home that I will never go to again...it's too bad."}
{"text":"Went here for the first time and loved it. The server was super knowledgable and friendly. The atmosphere was great as well.   Finally, I tried two specialty rolls( the cheetah and the fire in the mouth roll) And my girlfriend got an order of chicken teriyaki and everything tasted great! Definitely quality and reasonably priced. Would definitely recommend to friends."}
{"text":"Ambiance:  Its a brand new restaurant in a new area and the setting is very nice. I dont quite get the dark brown chairs with the black tables (maybe it was dark when the purchase decision was made?) and I probably wouldnt have introduced all the golden fixtures which makes a somewhat kitchy in my opinion but nevertheless is a nice and modern decor.  Food: Had a bento box lunch here the other day and the food is just really good. You can really taste the fish and other components of the sushi and the honey chicken I had was also very tasteful.  Their own blend of soy sauce just adds a very nice touch to the food.  Service: There was more staff than there were customers so the service was pretty good.  Overall:  We live right around the corner and we're sushi addicts so we'll definately be back. Otaku is a little pricey though so it might not be for our weekly sushi run but I hope they'll stick around for a long time."}
{"text":"Went for lunch. It was our 1st time here. Nice atmosphere and the place looked very clean. They have a large menu with a variety of Asian food options. We had the shrimp tempura roll, regular California roll and a snow crab California roll. All were really fresh. Service was friendly, helpful and attentive. If your looking for a nice sushi place in this area, give Otaku a try."}
{"text":"I went to Otaku because i had never tried sushi before. I was suprised as soon as i walked in this sushi bar did not smell like raw fish. Which is one of the main reasons I had never one into a sushi place before. The resturant had an amazing atmosphere. Not extremely loud like Benihana. If you're looking for a nice quiet dinner this is the place to go.       This was my first time eating sushi, the waiters were very helpful when it came to me ordering. I choose a very generic sushi, the California roll. The food is a bit more pricey then other places i have been too, that also happen to have sushi. If you go during happy hour prices are much more reasonable though. The chow mein was the best I have ever had.       Though i did enjot the resturant, I did not enjoy the sushi. It could of just been my tastebuds though. The place was very steadily busy, and everyone looked like they enjoyed their food. I probably will not be back because I didn't enjoy the food. But i would be willing to go again for the atmosphere!"}
{"text":"Very delicious meal- we ate the bento box for lunch- all of our food was delicious, light and fresh.  The large portions made up for the higher prices, but we did skip a drink because they were all over 9$.  We loved the environment, nice open space and lighting."}
{"text":"Me and my boyfriend came around 3:30 on Valentines Day to beat the crowd later. It was not busy at all so we decided to sit at the bar. The place is beautiful and you can tell they spent a lot of money on the decor. Our waitress/bartender told us that the place is beautiful at night for us to check it out sometime. I am definitely a huge sushi fan and I do go often trying new places to eat sushi so I was excited to try this place since it was close to our house. We ended up ordering two cokes and a total of five rolls since they didn't have the Kim bop roll which our waitress told us they usually run out of earlier in the week until they re-stock. So we ended up just getting five rolls since the last one ruined my night or we might have ordered more. The first three we ordered was the Las Vegas roll Happy hour price $5, Tootzy roll $5, and the Roll which was $14. All of which were delicious. These were bite size compared to how often I see others make the Las Vegas roll so huge in size. After enjoying the first three rolls we decided to try two more, the superman roll $12 and the spider roll $11. First one I tried out of the last two rolls was the Spider roll which was great since it has soft shell crab in it and that is one of our favorites. The one I had a problem with was the superman roll which is a spicy tuna/cucumber roll topped with white tuna. The first thing I tried was the white tuna on top of the roll and the second I put it into my mouth I got sick. There was just something so funny about the taste and the smell of the fish was foul. Mind you I have had white tuna many times before and never have I experience this smell and taste. My boyfriend suggested I try another bite of the roll since it may have be the sauce they put on it, so I wiped as much sauce as I could off and tried the roll again which didn't improve at all. At this point I was just plain sick & I couldn't even eat the rest of the other yummie roll we ordered.  I told my boyfriend we had to go because otherwise I would have to run to the bathroom and be sick.  So we asked our waitress for the check which they run our cards on iPads, something I haven't seen before which was cool. Our total bill came to $65 with the tip but with all the talking the bartender/waitress did she never minded to ask us how or rolls were so I made sure to let her know how sick I was before I gave her my card to pay. She informed me that white tuna is high in oil and that some people can't handle eating a fish like that and that the white tuna roll must have been us and not the them. So I informed her that I had eaten white tuna many times before and this just tasted completely foul. She did not offer us a discount which might have changed our mind in trying this place again and recommending it to our friends.  I just wanted to review this place to say how much it did make me sick enough to ruin the rest of our valentines day plans and that I am still sick the next day. We will not go back. If we do I guess it won't be for a while and we won't order the White tuna."}
{"text":"What a great place for sushi.   Service was second to none.  Sat outside and enjoyed well prepared entrees.  Thanks for a great night Robin"}
{"text":"Pro:  had a groupon; cute waitresses; clean bathrooms; better than expected decor  Cons: Dirty dishes- came with a group of 4- two of the plates had food stains on it - 2 of the bowls for the soup had food particles on it - hard to get over that hump - food is mediocre and pretty tasteless  - if looking or Asian fusion, save yourself the time and money and jut head over to Pei Wei.  Flies liked our food, though"}
{"text":"Tonight was a wonderful evening! We are visiting our grandparents from Los Angeles, and who knew the Gparents liked sushi and his is their favorite place !! We walked in to be seated right away. Codi was our server. She was very attentive and got our order in right away. She was kind to my gramma and very patient with her.  She suggested the Monster roll which we had and was delicious.  The Salmon and tuna sushi was melting in out mouth it was so fresh and delicious.  We can't wait to come back and visit and go here for all around great time!!"}
{"text":"This place is overpriced. They're charging premium prices for mediocre food. The food and service was good, but it's not $6.50 for two pieces of sushi good. I get that importing fish to Arizona may not be cheap, but if they're going to charge that much for sushi then it better be damn good. They also stuff their rolls to the brim with rice to make them seem bigger. In the end you just end up with a fart sized amount of fish, a shit ton of rice, and a bill that might require a loan."}
{"text":"Pretty solid sushi spot. Came in for an early dinner and we were seated very quickly and the staff was very accommodating. We ordered the chefs nigiri, tiger roll, and edamame. The nigiri was great, clean and fresh; and the tiger roll was fantastic, not too sweet with some crunchy tempura in the center which gave it a good texture."}
{"text":"Well let me say when a Sushi place smells like fish you better run away. My wife and I have gone to this place 3 times and it seems like it is dying. The last time we dined for lunch and the place stank of fish the moment we walked through the door. The wait staff was over zealous in trying to upsell us. Needless to say we drive by regularly and wonder why they still are in business. Thankfully we had a groupon the last time we were there, but we still didn't feel we got our money's worth. Sorry, but here are many places better than this one."}
{"text":"Good but off the beaten path. If the location wasnt so weird and the prices a bit steep, Id give em 5 stars. That being said, it's worth a try....better than the big chains!"}
{"text":"Sushi not fresh today.  This is the first time so We will try it again.  Calamari very good."}
{"text":"The restaurant has a nice upscale atmosphere.  We are at the bar, sampled the Moscow Mule and Martini's. I would recommend the Hot and Messy along with the I love shrimp. The Dynamite is pretty good too."}
{"text":"Sushi is always fresh and the fresh wasabi is great.  Service is amazing as well.  The food is always consistent. The restaurant is always clean."}
{"text":"Interior is nice and has that \"hip\" feel that most sushi places seem to be going for these days but the food was less than average which was disappointing. Dined there at lunch on a Saturday afternoon and were the only guests in the building. The biggest downside was the blaring r&b music that was so loud you couldn't have a conversation with your companions. Lots of unique and modern rolls if you enjoy that but the sashimi we had was cut so thick and had sinew running through it which was very off putting. I would probably stick to a more conventional sushi restaurant next time that focuses more on the art of sushi than trying to be hip."}
{"text":"It is a good place that we have enjoyed a few times. The atmosphere is pretty neat and different too. Especially for the area that is starting to be developed. Has s good menu and service seemed to be good as well.  We have no complaints."}
{"text":"Hmm. Went here with some friends on a Sunday night. Service was excellent. Friendly staff. Ordered orange yellowtail special and a California roll. Sushi was decent however in-house soy sauce was just absolutely horrible. If that was low sodium I don't even want to imagine the normal soy sauce. Normally I like to just add wasabi however this time I had to dilute with almost half a glass of water, the juice from a wedge of lemon and chili oil before I could consider the soy sauce minimally acceptable. Cut back on the salt or keep some Kirin on the side please!"}
{"text":"Excellent sushi.  Had the Matador, and it was outstanding!!!  The stuffed jalapeños for an appetizer, yum!!!  Very nice atmosphere in the restaurant, very clean.  Service was very good.  My sushi took a while, but the quality and taste more than made up for it.  I was in no rush."}
{"text":"Came here for Happy Hour Friday, blue moon - white ale on draft, fish was fresh, music and ambience was great, and they had a good selection of sashimi - including uni.  Service was quick and Samantha our server was friendly."}
{"text":"Had drinks and some happy hour sushi with the wife.  Great atmosphere and the service with good too.  I had to order one more roll and went with the big mouth and it was amazing."}
{"text":"We had an excellent time @ Otaku last night. A girls night out was full of laughter with an amazing fun bartender Kevin!  The food was fantastic and the service was amazing this time around!!!  We will be back for sure!!!"}
{"text":"Great atmosphere! Amazing sushi! Great service! Our new Go-to sushi bar! Hip and modern, definately recommed!"}
{"text":"This is a favorite spot of ours. I have yet to have anything less than spectacular. The service has always been great but today we had a young man named Tony who made our lunch experience excellent. He was very attentive without being overbearing and he was vet genuine. 5 stars for hiring a great wait staff!"}
{"text":"I absolutely love this place, we've been going here for years. Never had a bad experience or a bad meal. Always clean friendly and all the rolls are amazing, even the cheetah roll which I wasn't sure about but we tried it and it was delicious! They even went as far as to make our anniversary and Valentine's day even more special roses, and desserts! Owners friendly and always making sure everyone is having a good experience."}
{"text":"This review is based on the company's response to my previous review.  One of the owners sent me a message and gave me his personal cell asking me to call him regarding my experience.  He took my call while in the middle of a vacation with his family and insisted we speak then - he took the time to fully listen to me and emphasized repeatedly the dedication they have to providing an excellent dining experience for every single patron.  I know that every business - especially restaurants can have an \"off night\" and after speaking with this owner, I will be pleased to give them another chance next time I'm in the PHX area.  This 5 star rating is based on the willingness of the owner to address my concerns in the way that he did... not many businesses in my experience do that and it gives me confidence that the experience in my review was simply an anomaly!"}
{"text":"Love this sushi restaurant. He food, ambiance, the service. I was happy with all of it. Their menu has a pretty big menu. They also have lunch specials as well that isn't bad either. I would definitely recommend this restaurant."}
{"text":"We miss the old happy hour. It's not what it used to be. The food is good if you're okay with the prices and fish portions. They should be bigger portions for the price."}
{"text":"we went last night for my husbands birthday dinner, I made reservations and glad because it was pretty full. We sat in the tree room which was awesome. It has a very nice decor in there. The food was really good. The service was really nice. We will definitely go again! Pretty awesome having such a cool place near our home in the boonies."}
{"text":"Good stuff... Not going to change the world but if you love sushi, check this place out for sure!!"}
{"text":"Their soy sauce had a smokey flavor. Affected the taste of standard rolls.  Las Vegas roll - tasted a little like bologna, prolly because of the soy. Spicy Salmon roll - spicy and delicious Sexy Girl roll - crab meat, sweet mayo, and a slice of strawberry. Mellow, fruity, almost like a dessert.  The staff were polite, helpful."}
{"text":"Great looking place. Beautiful ambience. Looks better then P.F. chang but food is more like Pei Wei. Service was good, but server and restaurant is not prepared for someone who cannot eat gluten. Server went through menu saying \"this is gluten free\" when it obviously wasnt. He was guessing. He finally went and asked the chef and got clarification. But why not in this day and age just put it on the menu? Food though was mediocre. Had the beef ribs which were mostly bone and fat. Orange chicken wasnt that great either."}
{"text":"Update: This is now my Sushi Go to place. Sushi is fresh and thry usually have three  Chefs behind the bar, fast ad well. Thr scallop poppers are awesome.. Really liked the Samurai roll and Superman!!"}
{"text":"One of our new favorite places for sushi. Service was amazing and the sushi was the freshest we have had around gilbert. Different unique rolls and we can't wait to go back."}
{"text":"Short story review:  Food:  2/5 Service:  5/5 Atmosphere:  4/5 Value:  2/5  =======  I recently went to this restaurant with my girlfriend for lunch.  We both love sushi and have been trying different places in the east valley.  As some of our other staples were closed on Sunday afternoon, we decided to try Otaku.  The first thing we noticed about Otaku was its nice, modern look.  The restaurant decor and layout is pretty appealing, with large glass windows separating the main dining rotunda from the patio outside.  We went on a sleepy, hot summer afternoon, but I imagine it must be pretty nice to sit outside on a cooler evening.  We ordered their jalapeno poppers, which were fried jalapenos with a tuna filling and an eel glaze, to begin our meal.  The poppers came out with a dark brown breading, as if old oil had been used in the fry.  The breading itself tasted bland, and the jalapenos were mushy and tasteless.  There was hardly any spice or flavor to the dish outside of the spicy mayo in the filling.  Not too good.  Then came our main course.    I ordered their Vegas, Philadelphia, and Monster rolls.  The Vegas rolls were OK.  They were a bit too soft for my liking (not having a crispy outside), but the actual taste was good.  The Philadelphia rolls were very good in terms of taste and texture, and the appropriately named Monster rolls were also OK.  They were a bit lukewarm, but OK.  That said, the rolls weren't as good as the ones I've had at Shimagomo, Ryu Sushi & Teppanyaki, Sushi San, and Sushiya.  My girlfriend fared worse with her order.  She ordered the Mongolian beef, which came with fried rice, a house salad, and a vegetable roll.  I ended up trying most of her food.  The house salad was actually very good.  Whatever ginger-teriyaki dressing they used was excellent.  The fried rice was just bad...to the point where it shouldn't have been advertised as fried rice.  It looked as if someone had taken steamed rice, thrown it in a pan with onions and eggs, added soy sauce, and called it a day.  Again, the texture was off.  It was too wet, and there was no sesame, garlic, or ginger to at least anchor the rice as something resembling traditional fried rice.  The texture of the Mongolian beef was strange.  It was too soft, to the point that it had the texture of ham.  We couldn't finish it.  She also had peach tea, which turned out to just be tea with peach syrup added.  The waitress who served us was attentive enough to know that something was wrong with the food and ask us about it.  The manager came by shortly thereafter to ask about the food and ended up taking the Mongolian off of the bill.    Overall, not a great experience.  We may try Otaku on another busier night, but it probably won't be soon."}
{"text":"Came here on a Monday night. The location in a half empty business seems a bit strange, and it's easy to miss if you aren't looking for it. However, it's definitely worth a trip!  I'm not hugely adventurous when it comes to sushi, so my friend ordered for us. Was quite good! Will definitely return"}
{"text":"*recommending the cheetah roll, moon festival fried ice cream and the orange chicken.   Otaku has great food but even better customer service! My wife, brother and I decided to get Chinese, and let me start by saying we are not big fans of chinese, but my brother was in the mood. The enviorment is very trendy with a circular  window-wall like dining room. Everything we ordered was delicious! (***The cheetah roll with hot cheetos sounds wrong but it taste amazing!). We got a dragon roll were the eel was very salty (just took it off and continued with our chow) but our waitress Stephanie with her great customer service plus making sure that our drinks were constantly topped off made us overlook it.  She was great,  definitely ask for her. Had great knowledge of her food and really made us feel like guest. Even though we didn't complain about it, a passing  waiter,  Stephanie and the manager all would ask us about the eel and if there was anything they could do. It's incredibly refreshing to have this kind of customer service. I will definitely return on the customer service alone (food is a bonus!). In the end the manager decided to give us our orderd dessert free as an apology. Try it out"}
{"text":"First time in, we will be back but won't order the same dishes.  Service seemed a little slow and the soy sauce needed to be replaced twice because it was empty.   Sushi was good we will try another time."}
{"text":"Tried this place during Happy Hour... food was okay - nothing special compared to other Sushi places in town.  We thought it was a bit pricey as well for Happy Hour.  Ambiance is nice - inviting!   We may give it another chance soon!"}
{"text":"My wife received a gift card to Otaku, so we decided to go at the most awkward time of day for Japanese food....very early Sunday afternoon. First off I'll start by saying Otaku has sooo much potential. Decor, ambiance, and cleanliness were great. We were actually amazed at how cool and modern the inside was. Not sure how long it has been around, but everything looked brand new. Service was great as well. Menu looked packed with a lot of potentially delicious rolls and dishes. We both ordered bento boxes, teriyaki chicken for me and she ordered shrimp. Food was decent, I've had better Japanese....my fried rice was really dry but the rest of my bento box was alright. I'm actually not surprised there are several reviews saying the food was okay, because it was just that. I wouldn't mind going back to try ou their rolls."}
{"text":"I can't believe anyone has rated this place with less than 5 stars. We first went in ~3-4 weeks ago and had Tatum as our server. She found out it was our first time in and spent tons of time with us explaining the menu, answering questions, giving suggestions, etc. The food came out and it was DELICIOUS. Prices were normal for sushi but quality was better than average by far. Came back tonight and had a similar experience, although tonight had several managers stop by to make sure our dining experience was ideal. Tatum even remembered us AND WHAT WE HAD ORDERED weeks ago (more than we even remembered!).  I honestly can't say enough about it - if you go ask to be in Tatum's section.  Wow. Probably the best waitress I've had in years and the food and atmosphere were truly wonderful."}
{"text":"Really like the atmosphere inside. It was very modern and clean. The service was excellent and the waiter was attentive. In general, I would recommend this place to others.   The sushi was slightly above average. The Vegas Roll was par for the course. The Red Blossom was recommended by our waiter, but I didn't love it because I'm not a huge mustard fan--the flavor was a little overwhelming especially for someone who isn't a fan to begin with. Partially my fault for ordering that though. The Dynamite roll was dynamite!   It would be a good place for a date night or to go grab a drink."}
{"text":"I thought they had little selction outside of sushi, it was not the best but not the worst as I didn't have any sushi and the options were limited,  I was also surprised and how few noodle dishes there were. There was only one and it was not the best."}
{"text":"This restaurant has been there for about six years I'm told. I met friends there for dinner tonight and it was fabulous. We sat outside at a table with the fire and everything was delicious.  The inside of the restaurant was also beautiful and everything was so clean.  The Las Vegas rolls were the best!"}
{"text":"Great Food, Drinks, Fun Environment, Great Service! My husband and I drive by Otaku all the time and have said we need to go there sometime.  Well we finally dined at there this past Friday night and had a great experience. The sushi was amazing and we tried their Stuffed Jalapenos ~ delicious. Thank you Antonio for offering us dessert that we were just too stuffed to take you up on.  We will be back for dessert, lunch, happy hour and dinner."}
{"text":"Still my all time favorite sushi joint!!!   Doesn't matter how often I eat the sushi, I will still go home and crave some favorite rolls and dishes! ( TIGER & RED BLOSSOM ) !!!! This team has put ALOT of effort and dedication into making this place enjoyable for everyone. The staff and managers genuinely care if their guests are having a satisfying experience! White boys doing the damn thing behind the sushi bar!!! Friendly bartenders :-) and you cant forget the hard work of the cook Charlie in the back, the man behind the scenes who is a genius!  I consider this place a second home.  There is a huge variety on the menu so venture out and try something new because everything is good in its own way!"}
{"text":"Came here for lunch a while ago; the mongolian beef bento was good, not great - Ive had better. Although the restaurant possessed a nice atmosphere and seemed pretty clean, the fried rice was bland and tasteless and I've never had such horrible water. Drinks took forever, as did the sushi. The two stars are for the nice interior  and friendliness of our server. Overall, a disappointing and subpar dining experience."}
{"text":"Have had trouble finding good sushi in the area, so I was really happy to find this place. I will definitely be going back. It's a little expensive for dinner, but they do have a good happy hour and you get what you pay for."}
{"text":"Great atmosphere, friendly staff, and delicious food.  The happy hour specials are very affordable.  I would highly recommend Otaku!"}
{"text":"Always delicious! Salmon sashimi special is amazing! It's obvious that customer service is their bread and butter. They beat you to the door every time and you will rarely have  to ask for anything, I think they read minds."}
{"text":"I travel all over the state for work and eat sushi frequently. Otaku has Amazing Sushi at very reasonable prices. Incredible staff and customer service! Upscale feel, it is my wife's favorite place for dinner and happy hour."}
{"text":"Where do I start? Our last 2 meals at Otaku were horrendous. The spicy tune handrolls had barely a smidgen of tuna. The fried rice was horrible and had nothing added to it.  The miso soup was flavorless. Plus they forgot the seaweed salads we ordered.   I would suggest that no one ever go there again. I know that I won't."}
{"text":"Sushi was great! Very unique menu choices. Servers and manager were extremely personable. I'll definitely go back!"}
{"text":"Great sushi bar, cool ambient vibe with great service. the chopsticks were very luxurious. sit at the bar to get a cool, fun experience. also, their happy hour menu is super affordable. love!"}
{"text":"They have a great bento box lunch special with soup or salad, spring roll, dumpling, rice, California roll, and choice of entree. The staff is incredibly friendly and accommodating. Tip: Ask for the fresh wasabi!"}
{"text":"Great service with super yummy food! Love the inside decor as well. Definitely more on the pricey side though. Love this place!"}
{"text":"Went here for my birthday dinner, I had the Hot and Messy roll which was $16, this is the most expensive sushi roll I have ever ordered. While it was delicious, including the scallop on top and warm tempura roll, it was not spectacular which is what I was hoping for. My dinner companion ordered the chinese dish of walnut shrimp. The portion was small for the price but it was good, not great for $15. Last week I had a bite of my son's crab roll off the kid's menu, it was pretty good for $2. The adult  prices are  high and you are paying for the ambiance, the decor and layout of the restaurant are gorgeous. Too bad the food is just so-so. Not sure if I will return, I have had better sushi from the Fry's sushi bar for $9 a roll."}
{"text":"Wide variety of sushi, many of them are delicious.  A large selection of Japanese dishes you would not find at a sushi restaurant.  Decent ramen noodles.  If you are going on a Friday evening, expect a wait.  I tried to order takeout on a Friday and was told the order would take over an hour."}
{"text":"Always been good sushi. Good happy hour. Best part you can find dishes for your non-sushi friends."}
{"text":"Wanted to do an update on this place after trying again. I must say the Sushi portions were much bigger than last time and the fried rice was over flowing with meat and shrimp. Not a fan of the loud Techno music they had pumping but maybe Im just old! $7.00 for a Draft Sapporo was WAY too expensive.  Waitress at the bar was fantastic. Blond manager lady was great too...Kinda Angie Dickinson good looking!"}
{"text":"Otaku is OK but there are much better and less expensive places to get Sushi.  Stick to Rock Lobster or RA.  I used to love this place and would recommend it to everyone.  Over the last couple of years it has gone down a little.  I usually go here when I have no options."}
{"text":"We've lived in Chandler 7 years and passed this restaurant a thousand times or more but never ventured in due to the word \"sushi\" in it's name.  Neither of us like sushi.  Well yesterday we went to the Otaku website to check it's menu and were pleasantly surprised to see a lot of Asian fusion items that looked and sounded interesting to both my wife and me.  Fast forward to now, we went to Otaku for dinner tonight and are going back next week for my birthday dinner.  We loved the appetizers (jumbo chicken wings, gyoza, egg rolls and lettuce wraps)...loved our entrees of mongolian beef and Korean BBQ bowl and LOVED the desserts of creme brulee and chocolate lava cake!  Everything we had we would order again.    The food was out of this world delicious and the service from Tyler was super friendly without being over- bearing.  We rank Otaku as one of the top restaurants we've visited since moving here in 2011 and don't plan on passing it up from here on.  5-stars all around!"}
{"text":"Chris was great server. Good lunch special for Chinese ($11.00 box lunch with lits of choices) - not as good for sushi (no full rolls on special - just pieces) and unfortunately we went for sushi. Beef & broccoli was very good - sushi was average. Very nice & clean setting. Not the average wood chop sticks - very nice reusable ones."}
{"text":"Had the cheetah roll and my boyfriend had something else, can't remember the name, they were both delicious and the desert is so great. I loved the service as well and excited to come back to try some new rolls"}
{"text":"First time here.  Really fresh sushi,  huge variety!  I tried one with Salmon, mango, Asian pear, aspargus...amazing!!!!"}
{"text":"I brought some friends here for dinner for their last night out. This is one of our favorite spots so we wanted them to try it for sure. There were a few mishaps along the way, but when I brought them to the managers' attention he went above and beyond to fix the problems and made sure we left extremely happy. Not only will we return for the yummy food,  but we will return for the STELLAR management team and their customer service."}
{"text":"Have been to Otaku a couple times.  Just visited for lunch today.  It was another great meal that myself and my family enjoyed.  The service and the food is fantastic.  Great lunch specials!  Looking forward to going back real soon."}
{"text":"We tried for the first time and were hoping to find a good sushi restaurant close to our new home. This was not it. The sushi was only mediocre, the rice didn't seem soggy and the seaweed had a funny, strong taste. Also the water was terrible and the cups were dirty. I will not be back."}
{"text":"I was really excited to try this place out with my wife.  We both got the Omakase.  Parts of the Omakase meal were good but other parts felt like a lot of sizzle and no steak (i.e. gold flakes left and right).  For the two of us, each with a couple drinks, our bill was in the neighborhood of $200.  Service was fine.    However, my wife and I both developed serious food poisoning that night, which lingered for 24 hours with me.  I eat sushi often and have never had this experience.  Food poisoning happens but what really got my undies in a wad was that I wrote a polite email to the restaurant and never heard a peep back (for the record, I didn't ask for a refund or anything, I just informed them that we developed food poisoning from their food).  In my book, that's just unforgivable."}
{"text":"I went to Otaku on September 7th, 2014 for lunch with my family, and I really enjoyed my experience there. The food there was amazingly exquisit. I ordered the California Roll and it was quickly served, I didn't have to wait at all. The employees there are super kind, they not only made sure everything was to my liking, but they were also very friendly and tried to have a conversation with me. The waiter was extremely attentive, always making sure that I had something to drink throughout my whole meal (which was nice, because lets be honest sometimes wasabi can get really spicy).   The whole restaurant is very clean and welcoming, they have big windows which allows the sun to shine in, without making the restaurant hot. They also have a beautiful fish tank as you walk in allowing you can to see all of the exotic fish swimming around making the experience one to remember. The eatery includes a high ceiling allowing more of an open area feeling rather than claustrophobic and crowded tone. The interior architecture also includes a variety of seating options, diverse plant life and Japanese characters painted on the wall. For an American who hasn't traveled far from home, this wonderful restaurant transported me straight to Japan. I was offered chopsticks and other condiments common with this type of food. The menu had a large majority of food I've never heard of and the waitress was able to describe all the types of fish and textures to provide me with an enjoyable experience. After the meal my family and I were very satisfied with the whole experience and have intentions of visiting Otaku again in the future!"}
{"text":"The interior decorating and food was awesome!  Only drawback was the size of the bathroom - not friendly for families as it holds only 1 person!  The garlic edamame was so unique and flavorfull!  I ordered the box lunch which included meso soup, eggroll, fried rice, sushi, and a meat (chicken, steak, etc.) choice.  This was all customizable as well - lots of food for only $9!  What a steal!  Geat job guys!"}
{"text":"I really like the food at this place. Lunch bentos are great. Service is weird though. I mean there's just always something wrong or slow. Nothing crazy bad, but ALWAYS something. We go here a lot for company lunches and were joking about the service last time and it seemed flawless until the very end when the server never came back with the tab and we ended up having to go to the bar after waiting for a really long time. Again, nothing that would sway me from going there, but weird."}
{"text":"If your a Cheetos lover then the roll is a must try! Very good lunch portion. Boyfriend couldn't even finish his portion. Yummy place!"}
{"text":"Go figure -- worldly sushi in Gilbert?? This place is quickly becoming one of my favorites. Have been here three or four times since it opened.   Susan takes good care of you at the bar, suggesting all kinds of crazy drinks and food and will even arrange to have a staff member give me a foot massage when dining.  Well, haven't asked for the latter.   And I like crazy.  So the escolar, the quail eggs, uni are all up my alley. Same with the exotic \"Susan-concocted drinks\" like cantaloupe martinis or cucumber martinis made with sake and cucumber vodka. Oh, and have Jay make you a sake shot with a Kumomoto oyster, Uni and quail egg. :)"}
{"text":"The lunch Bento Box special can't be beat. My wife took me here for the first time last weekend, and I have already been back this week. The service was fantastic and the food was really good. Finally, a place that has great Mongolian Beef that isn't the price of P.F. Changs. Also, had the orange chicken and it was fantastic. We will be back many more times!!!"}
{"text":"This was my first time here. I loved the ambience. It felt modern & classy. I came with my family. Their menu has many choices. We shared the Otaku platter for an appetizer. Everything we ordered tasted wonderful! I had the Galbi- Korean ribs. The only complaint I have is that you get only two pieces of ribs for $14. I feel that it's too pricey for the size. Our server was very accommodating & the manger came to check on our table to make sure everything was ok. All in all our we had an awesome 1st time experience! I definitely recommend it to everyone!!"}
{"text":"I am not big into sushi and that's all I've had here but it's really good! The restaurant is very clean and spacious. The bar area and sushi bar have a lot of seating. The outside area have misters which are a must in this heat.   We got spicy garlic edamame and regular edamame because when you check in on Yelp the regular edamame is free!   My favorite roll is the Phoenix tempura. The spicy mayo kind of burned my lips but it was really delicious. I also had the cheetah roll, which has hot Cheetos on top!   Service was excellent. Atmosphere is fun. Food was great. We will be back!"}
{"text":"Every time we go we feel like family. Have been going since opened as down the street from us and the food is alway fresh ad good. The sashimi is by far the best freshest every time we go and we have been to others. The edamame are always served hot and taste good as well. The Otaku Fried Rice is one of our favorite must haves when we go as well as the Four Seasons."}
{"text":"I went to Otaku today for lunch with 5 of my girlfriends.  I think the prices were fair for lunch and the food was pretty good, but the service was horrible.  She was slow with very few tables and at times, seemed bothered.  After our food was delivered, she never came back at all, not even for drink or water refills.  I don't want to dis the place as it is a very pretty joint and I would return hoping for a more attentive server."}
{"text":"Great place to grab sushi.  Spicy garlic edamame puts an interesting twist on an old favorite.  I would definitely go this route to start.  Great selection of sushi.  On this trip my wife and I shared the Phoenix tempura, Las Vegas, cheetah, and dynamite roll.  All were good and reasonable priced...especially during happy hour.  Cool trendy decor.  Very clean and consistent good service.  My go to for sushi in the east valley."}
{"text":"Food and service is always fantastic!  Tonight we had an issue with our reservation and the owner Will went above and beyond to make it right!  We will be back to enjoy their food again.  I highly recommend the Tom Yum Hot Pot you will not be disappointed."}
{"text":"I only went here once.  I was going to wait a month or two and try it again before Yelping, but after reading all the reviews I had to speak up. Let me just get this out of the way...soft opening...blah blah blah... OK, now that we've moved past that.  The service is a complete disaster.  It was 20+ minutes, no joke, before we got water and ONE menu to share between the three of us.  After waiting that long for a menu we decided to play it \"smart\" and just order three appetizers and a beer.  My beer came 15 minutes later.  I ordered another one immediately, I never got the second beer. About 45 minutes after ordering the food came. We asked the girl that brought it what each item was, she said she had to go get our bill (to identify your own apps? really?) and disappeared.  She came back and said she couldn't find our bill and had to find our waitress (good luck!) to ID the apps. Really? The food did NOT make up for the service. Far from it.  The deep fried scallops sucked, could have reheated a box or pre-frozen scallops from the supermarket, thanks.  The rest of the food was uninteresting at best. We told two random girls we had somewhere we needed to be (I'm like 2 damn hours in at this point, the waitress never came to ID the food) and wanted our check.  They said \"I can't find it, I have to find your waitress.\"  20 or so more minutes pass, still no check or waitress, we finally get loud so the waitress comes and asks what we need.  We say \"Our check!\"  Five minutes later she comes back and comps our meal.   I may not be able to give it a second chance, but other chefs have told me how awesome the head chef is supposed to be.  So I may go back and try the sushi, but it would have to be amazing.  Let me say something here, Otaku is a STRONG word.  I have a shirt that says Super Otaku I bought in Tokyo.  That word means \"Nerd\".  When applied to food especially, you are making a HUGE commitment.  That only made the experience that much worse.  They should change their name to whatever is Japanese for \"Mildly Interested In.\""}
{"text":"Yummy, orange chicken was good, very clean and professional. Definitely would recommend"}
{"text":"So I stopped here on a whim, was riding by saw there sign. Was very pleased by the ambience, we'll decorated felt like I was in an more upscale restaurant then I'm used to, but it had a casual atmosphere. My wife and I split the cha shu ramen ( a pork Ramen with bold flavor), Tom yum hot pot ( chicken and mushroom soup made with coconut milk. Not sweet as i imagined but Balanced nicely with the spices ) and the matador and moon dragon roll both very delicious."}
{"text":"We ordered spicy tuna rolls and had them give us tuna slices instead of the pieces stuff they usually serve.  It was interesting and falls into the \"ok\" category for me.  Wasn't awesome but wasn't bad, just didn't seem fresh.  I compare pretty much everyone to Smokin Fins so it's a high bar to beat or compete with.  Service initially was slow, but once our waitress arrived she was friendly and helpful.  Probably wouldn't come back, but I wouldn't stay away on purpose like \"Osaka Japanese Steakhouse\" up the road."}
{"text":"For Arizona this place has really good sushi. I love the unique sushi rolls they offer. I have not seen these at other places and I like that."}
{"text":"Soft-opening, many glitches in the systems as to be expected (they did apologize many times for this), but the food made up for it. The menu is good with great selections.  I especially like the specialty rolls, low carb and all vege rolls.  The list shows some creativity from the chef.  Drinks:  Lychee martini - not bad  Otakuini - Hakutsuru Draft Sake and Cucumber vodka (needs a better sake to mix with this)   Sushi:  Sake (salmon) - good but not great Red Blossom - very good Dragon Roll - very good Friday Night Fever (low carb) - nice low carb roll selection  Monster Roll - big roll with yellow tail, salmon, tuna and tempura - best roll from list  Food:  Hamachi Kama - excellent Grilled Chicken Breast  - with teriyaki sauce and vege's  Overall the food was good, decor is simple and chic, service was slow (soft opening) and the bill was high (even with opening discount).  The food is what is the key element here so I will give four stars.  I will go back for their happy hour when fully open."}
{"text":"We had a 1 star experience celebrating our 15 year anniversary here & instead of feeling special we shouldn't have tried some place new. We were ignored the entire night, including to get our check handled just so we could leave! We will never go back.  If you go here for sushi - just don't... see our review on Temari & go there for 5 star dining."}
{"text":"I really love this place! If you can get there during happy hour, it's even better! They have outside seating which I know is not always the best in Arizona, but I do love their patio, they have music playing but it's not loud and obnoxious like other places can be, and if it is too loud they are very happy to turn it down for you! Their sashimi always tastes so fresh and delicious, and I've yet to have a roll I haven't liked. I highly recommend trying the Cheetah roll! I got it just for sh*ts n' giggles one time, and ended up loving it! Also try ordering fresh wasabi one time, it's very yummy!"}
{"text":"Great food. Manager is amazing. Owner was also involved. Good looking staff. This is our new \"sushi spot\"."}
{"text":"One of my favorite sushi restaurants. Consistently good and great service. We are regulars. Highly recommend it."}
{"text":"This is my favorite sushi spot right now. I went in wanting a specific roll that they didn't have but they made it anyways all I had to do was tell them what was in it and they delivered. It's cute inside and the waiters are all nice."}
{"text":"Sushi ok, main courses were extremely salty and luke warm could not eat.  Salad appeared old, lettuce was browning. Waitress was super slow, only 3 customers in place, dirty tables. Too expensive for 3 people, bill was over 115.00. Not again."}
{"text":"Not bad, not great. Hubs and I went for lunch on a Sunday about a month ago. Friendly service, but it took quite awhile to get our food. The sodas were really watered down, which annoyed me. I felt like I should've just ordered water and saved my money. Hubs wasn't too impressed with his food, but I liked mine. I ordered the tootzy roll and the cheetah roll. Both were tasty, although the amount of cream cheese in the cheetah roll was a bit much. Hubs loves to get quail eggs, and this place had them and the presentation was neat. But they're overpriced. Maybe we will go back for dinner sometime, but seeing as we weren't blown away by our first visit, and with it being quite a distance away, it will be awhile before we do."}
{"text":"This place is awkwardly hip and super trendy in a casual part of town. The complex they are in is very new, but with Texas Roadhouse and TGIFs down the road, their location would be more appropriate for Scottsdale and Downtown Tempe or Phoenix.   The prices are what threw my husband, myself, and our two friends array. The rolls don't seem that expensive- but they come in smaller portions, and my husband said the quality was not as high as their prices. Our friends strongly agreed. The price for the Sake Bombs were outrageous, so I didn't get one (I want to say close to $15).   I do not like sushi- I always get non-seafood. Which, their fried rice was delicious, and I enjoyed the potstickers.   I guess I do like the trendy feel, but can't afford it! I loved the cucumber in my water- very refreshing. Our bartender Suzanne was lovely and made us delicious (but pricey!) drinks after our meal.    Overall: good service, but high prices for the quality of sushi.  Would return only if I had a discount or if friends wanted to go."}
{"text":"My husband and is were pleasantly surprised on how great our dinner at Otaku was last night! We have been to this place a couple times before and were not impressed by the service or quality of rolls. However, this time our service was awesome and the sushi were really great! Our server introduced us to fresh wasabi which is SO much better than the green paste! Also try the dynamite roll. Picture attached!  Seems like the place might be under new management. Keep up the good work Otaku!!"}
{"text":"I enjoy my sushi, so I was excited to try out Otaku. I liked how they decorated the place, really sharp, cool atmosphere. However, when it came to the the food I was disappointed. Lunch specials are still kind of pricey for what you got ($13) Small rolls, and I would say below than average tasting sushi. Also, it appears servers are still learning the ropes and so service was ok. So nice looking but won't be going back. There are places nearby that have better prices, bigger rolls and mainly just better tasting sushi."}
{"text":"This place is overpriced for the mediocre sushi. The staff was very friendly but the food was just so-so. We ordered our food to go and didn't expect it to be perfect like ordering at the restaurant and that was taken into consideration for this review.   We ordered an appetizer of shrimp tempura, a dragon roll Super-Man roll, a spider roll and a shrimp tempura roll.  Everything was very salty and a lot of the sweet flavor from the rice was lost to the saltiness. We didn't get wasabi in our order either.  I mean come on ... who forgets wasabi at a sushi place?  I've definitely had better sushi in Chandler at better prices.  -------- Updated 5/2017 --------- So I've figured out that this place is much better eating in person. DO NOT ORDER TO GO.  In person though, the sushi was very good and they always give you the wasabi!  The waitress even mentioned that to go orders don't do that well here. They always forget something.  They have a great happy hour menu and has become a nice lunch place for sushi when I don't want to drive across town."}
{"text":"Love this place for food or happy hour. Great staff too! Ladies night every thurs always fun."}
{"text":"I don't know how many times I have driven by this place and never given it thought to stop and try it. Since I moved further out east my original sushi place is now somewhat distant to just stop by so I figured it was time to find another place.   I stopped by on the Chinese New Years. They had a pig prepared and we were able to try it before we left, for free. That was pretty awesome!   I also tried a few of their new/special occasion rolls, which one of them I was absolutely crazy about. As in, I told my server to ensure that he told his management and chefs that they needed to keep it on their menu. I really wish I remembered what they called it. It was different from any other roll ive ever had to teh point where I actually had the flavor seemingly change in my mouth (I've only had food so good that it changed flavor while eating it once before, and that was at the infamous Delmonico Steakhouse in Las Vegas). Effing delicious.  I think I might have to get here more often, even if I can't get anyone to come with me because it is \"too far\" for them. Crybabies."}
{"text":"This is one of my favorite neighborhood spots but today was definitely a no go for me Sushi rolls tasted less than fresh  Yikes!  There are literally three people here but the service is slow and not very attentive. Better luck next time...i guess. #missmewithtuesdayevening dining experience."}
{"text":"We came here for a late lunch on a Tuesday around 2pm. There were only a couple of tables when we arrived (which sometimes mean you will get poor service) but I was very pleased with the service. The food took a little longer than I would have expected, but not incredibly long. I attributed this to the fact that none of the tables had ordered at the time we arrived so possibly the kitchen had to do some setting up after the lunch rush. But even so, it was not a crazy long wait and still a 5 star review.  The food was good - I had udon noodle soup, an appetizer and tried a couple of the rolls. I really like the variety of unique rolls that are on their menu and would have liked to have tried more but I was craving the soup!   Service was really friendly... Very attentive... The server brought me a new tea before mine was empty each time I needed a refill (I was really thirsty apparently).   Their prices aren't outrageous; I think our total was around $55 for lunch for two people (2 rolls, appetizer, seafood udon soup, 2 beers and a drink). Not bad at all - I would definitely recommend stopping by!"}
{"text":"I felt compelled to write a review because I don't want anyone else who loves sushi to suffer the same disappointment as I did yesterday.  The albacore I ordered was dry, not fresh, and packed with a ridiculous amount of rice...basically ruined Japanese food.  It got worse, but I'll just say that if you know a good sushi spot go there because this is never gonna compare.  Seriously bad."}
{"text":"For this being the first time I have ever had sushi, Otaku was a perfect place to go. The service was impeccable. The staff waited on me like I was the only customer in the restaurant. They always made sure my drink was full and took my order politely. They brought me anything I asked for immediately. Not only was the service impeccable, the environment made my experience even better.  As soon as I walked in someone greeted me and seated me at a table. The restaurant has a glass window where you can watch the sushi being made. The ambiance of the restaurant makes the customer feel like they are in Japan eating at a restaurant. The waiters and waitresses are even dressed up in Japanese clothing. Everything from the menus, to the plates, to the walls gives you a sense of the Japanese culture. The food I ordered came out quickly.  The food was delicious. Every roll was made with care and came out perfectly. The serving sizes they offer are incredible for the prices. The California roll was delicious. It was wrapped in seaweed and rice and it was filled with cucumber, crab meat and avocado. To have the roll taste perfectly, I dipped it in soy sauce which I mixed with wasabi. This added extra flavor to the roll. Another roll that blew my mind was the Spicy Tuna roll. The Spicy Tuna roll contained spicy tuna, Japanese cucumbers, sushi rice, and Nori. This roll should also be dipped in wasabi and soy sauce. I would recommend this restaurant to anyone who is looking to have a nice meal, great service, and an authentic environment."}
{"text":"I came for lunch with my baby and the waitress seemed to remember us. That was sweet! The sushi was so fresh. I've been to many sushi places around the valley and I've had very delicious sushi and quite questionable sushi. The fish at Otaku had no fishy smell or flavor, was firm, cold, and seemed very fresh. I ordered the sushi and sashimi lunch and it came out very quick. I will surely return!"}
{"text":"Good overall sushi place.  Decor is nice and contemporary and their selection for sushi rolls was nice. One standout was the Cheetah roll (cant beat flaming hot cheetos). Presentation of food was nice. I don't remember the rest of the items i ate so that is why its not getting a higher rating. I only tried the Sushi type items not sure about the rest of the menu.  Not a bad place to check out.  Portions are not as big as other places and prices are ok to slightly above average"}
{"text":"Beef Chow Fun is awesome every time! Food is fresh and portions are perfect. Hubby loves the sushi!"}
{"text":"I live right down the street so my family comes once every 6-8 weeks. It is close by and convenient. To be honest the food isn't great but it is decent. We like to sit outside so our 6 year olds can be kids and not bother anyone.  Server Savannah the Irish gal is a doll, very friendly. My kids love the honey chicken. We always order is the cheeto roll. The drinks are ok, I order the lemon drop which is pretty consistent.  I wouldn't drive a distance to visit here but it's nice to come here on a Friday after a long week."}
{"text":"Went here tonight for a birthday. Absolutely awesome food, decent prices and great ambience. Tastefully decorated with a busy  bar, and a sushi bar. We sat at a table. Sushi was great. I ordered the sweet and sour chicken which was enough for 2 people but the rice portion was small so we had to ask for more. Not bad for $10. The hot and sour soup was delicious and came in a huge bowl, enough for 3 or 4 people and that was $6. My only complaint was the establishment was a little warm inside. I am usually cold so it was noticeably warm and several members of my party thought so too. It was 110 out...crank up that A/C! Other than that, we enjoyed ourselves and I will come back."}
{"text":"We just had a mediocre lunch here. What made it bad was mostly the service. Not sure if they were understaffed but it really wasn't that busy. It started out bad when we had to wait about 5 to 10 minutes just to be seated for lunch. There was nobody in front of us, nobody behind us, and nobody to even acknowledge our existence.   When someone finally said that he would be right there to seat us we thought he would finish up what he was doing and come seat us. Wrong, he proceeded to clear more tables and more tables before someone else had to come seat us. To me, that is not a good idea to keep customers waiting when you could do that after we sat down. It wasn't like they were busy or needed the tables. Just bad prioritizing.   The wait for our food was terribly long. The food was mediocre. We also had to wait quite awhile for our check. We hardly saw our waiter during our meal.  I think this place needs to work on customer service more before they continue to lose customers. I'm willing to give the place another try just in case it was a bad day and hope things are different.  The restaurant does look nice and has some potential."}
{"text":"Stopped in for dinner on Saturday, party of 3 hungry adults. We were greeted and seated quickly. Our server (Luke) was very friendly and attentive. We started with the appetizer platter we selected bacon wrapped shrimp, calamari, chicken wings and angel puffs.. everything was delicious.. however, the wings kind of tasted reheated. The sweet chili sauce was awesome as was the sweet n sour sauce.  We had to have some sake with our meal and the strawberry sake came highly recommended...and did not disappoint!  We then added the main events... SUSHI!! The Las Vegas, The Dragon, The Cheetah, The Mardi Gras, The tootzy and the Phoenix rolls were absolutely amazing!! My personal favorite was the Mardi Gras roll.. it was very refreshing and flavorful, though, all of these rolls were delicious and I would order them all again.  Dessert... yep we made room for dessert.  The cheesecake roll, chocolate mousse and creme brûlée arrived and vanished just as soon as they landed on our table.  We walked out very satisfied!  Thumbs up OTAKU!"}
{"text":"The service......amazing! The food...........mediocre. The atmosphere....beautiful! 1-10 scale i would give it a 6 mainly because of the awesome service."}
{"text":"They want to be cool but they just come off as the kid trying too hard. It's crazy overpriced  and the food was not fresh. Oysters was 3 $ each and they were tiny."}
{"text":"We came here for the first time today and had a great time.  Sat outside with the misters on and were not rushed out during our leisurely lunch.  Service was good and friendly and they even welcomed our well behaved puppy on the patio.  The salmon sushi and sashimi were VERY good although portions were small. The quality of fish is above average so I can deal with the smaller portions so long as they keep the fresh fish coming. Loved the spicy tuna roll and Monster roll too. Overall we really enjoyed this place and loved that it was pet friendly.  Next time we are in the area this will be a must go to place."}
{"text":"This is my go to sushi restaurant! Great service, great vibe, great sushi! I've been going there for years and it's always been consistently well! Everything is so delicious and everyone is so nice!! I recommend this place to everyone. Plus, they serve other tasty food besides sushi, which is great for my brother and dad who aren't sushi-eaters."}
{"text":"Fire in the mouth roll was delicious, and I'm not even a big sushi lover... My wife had that plus the miso soup... Both were very good... Contrary to some other idiots post, the rolls are normal size rolls, not small at all. Since I'm not a sushi lover, I got sweet and sour chicken... I asked for it to be spicy, but it didn't come out that way, but the staff apologized and brought out some chilly paste. Food was hot and delicious. My one real complaint is the hot green tea... There's no kind of filter so when you pour the tea you get lots of flotties in your cup... However, you can minimize this by using the lid to cover most of the spout... All in all, very good place. Definitely plan on coming back.  Oh, staff is very prompt and friendly... Give it a try and I think you'll like it"}
{"text":"I have eaten here several times and each time, the staff is pleasant,  Sushi is fresh and comes out very quickly and, the place is CLEAN! They have a decent children's menu as well! I recommend this place if you're looking for your new place  to chow down some Sushi with friends or take a date and enjoy some fun cocktails ;)"}
{"text":"Chris, our wonderful server, took the time to try to get an outdoor heater to work for us. Seeing that our heater initially did not have a propane tank, he worked diligently - the first tank was empty; without a word, he went and grabbed a SECOND propane tank. Instead of just giving up, he worked hard with no complaints - he even apologized for the initial propane tank! It's obviously not his fault, so it just goes to show the top notch customer service all done with a smile. His customer service will definitely be bringing us back.   P.S. try the Vegas roll, it's absolutely delicious!"}
{"text":"Been here several times and the sushi and service has always been good. Came today, and the appetizers were great, the service was great, but the sushi was horrible for some reason. We should have said something as soon as it came, but waited until we were leaving to mention it. Waitress was very nice and apologized, but not sure what happened with the sushi today. Will definitely try them again, but the sushi literally tasted like dirty dish rag. Maybe it was the plates or something else, but just not good today :(."}
{"text":"I love this restaurant!!! We, unfortunately, missed their grand opening but we finally made it there last night and after such a positive experience, we are sure to be regulars!  First of all, this is a gorgeous restaurant! It is obvious that a lot of love and planning went into the design and decor. Everything is warm and inviting; very upscale but not snooty! Most will be very comfortable here.  The food was uniformly excellent! We only tried one non-sushi item, the scallop poppers, but that dish was amazing!!! Very generous portions and very tasty with a terrific sauce! Based on this experience, we will have to try more menu items next time! We tried several of their specialty rolls and they were all outstanding. My favorite was simply called \"The Roll\" but there are many others that I plan on sampling in the coming weeks (like I said, we will be regulars!). I was surprised that we loved some of their low carb rolls as well. These rolls substitute the sushi rice with a rice paper wrap which I found, allowed the other ingredients to delight your taste buds even more! Between the traditional, specialty and low carb rolls, there is a lot of creativity going on here by Chef/Owner Jay Chung!!!  I would say that the service was excellent as well. It was not overly busy but it was busy enough. We were never left wondering where our waiter was and our sushi chef, David (The Hongster), was very attentive! Everyone was very friendly and by the end of our meal, we felt like family! We were treated to several complimentary sample rolls, all of which were delicious and we will probably order those next time. This was such a nice touch and makes for a loyal customer.  All in all, I don't think you can go wrong dinning here. The food was excellent, the staff friendly and attentive and the chef/owner was very creative and friendly! I think Otaku is very unique for Gilbert and a welcomed dinning experience for the east valley! The only bad thing is that it is a 25 minute drive from our house... Maybe we should move?"}
{"text":"I absolutely love this place.  Happy Hour menu is awesome.  I love tuna tartare.  Great martinis!!  Service is excellent.  My son loves the staff here, they always come and say hi to him.  I would recommend to any of my friends, family."}
{"text":"Drinks AWESOME! They have escolar which is the best shashimi and not all Sushi places offer. Love it!"}
{"text":"Best sushi we've had south of 202 in Maricopa county. Flavor in all rolls we had were really delicious. Lots of different sauces and individually unique. Oyster shooters were really good. We like a little more vinegar in ours but this was def. Best we've had in east valley so far. Service quick, nicely decorated, great waitress, we'll be back to try more. :)"}
{"text":"The wifey and I came here on a Saturday Valentine's Day night.  Parking was easy since it's in a plaza.  We had reservations booked online so we were not worried about waiting for a seat.  It was already busy as they have a bar and outdoor patio that was popping.  Everything was very new and in great condition.  Their sushi and teriyaki dish was good.  Lots of chicken in the teriyaki.  At the end of the meal, we were greeted by the owner and she was very elegant.  She gave my wife a complementary single rose for the occasion.  Awesome!  This is a lively Japanese/Chinese fusion restaurant/bar in Chandler that has to be tried."}
{"text":"Great sashimi and sushi. They have other good options for your non-sushi eaters. I like the szechuan scallops and shrimp. They have a fun environment. We like tonsit on the patio. Try their tempura cheesecake, too! Yummy!"}
{"text":"Great food and good service as well. Happy hour daily from 3-6! Definitely put it on your sushi list.  Recently tried additional items and will be sticking with the Sushi only..."}
{"text":"The restaurant was beautiful and the food was delicious,  our waitress was super sweet . Me and my husband went to this restaurant for the first time on Saturday night for date night. Everything appeared great...until late Saturday night my husband got sick and early Sunday morning so did I. I am still sick today ...the kind of sick which is consistent with food poisoning and the only meal we ate together that day was at this restaurant. We will not be returning."}
{"text":"Just recently went to Otaku for mother's day lunch. It was relatively quiet in the restaurant for it being mothers day. It's location is somewhat hard to see from the street, so that could possibly be a reason why. The service was kind, the doors were open so some bugs flew in and out. The food was on time, and good. They had a pretty standard sushi menu, the tuna nigiri sushi was  was one of my favorites. I would return another time after a little break due to the mid-tier sushi prices."}
{"text":"First time here and a wonderful dining experience.  The staff was warm and welcoming. Server was very attentive.  Food was absolutely delicious.  The only downside was that it was a bit too loud, but we will definitely be back!"}
{"text":"This place has really gone down hill. We used to come for bento boxes during lunch, but today's experience was not enjoyable. While the atmosphere is posh and the staff is attentive, my coworkers and I were pretty disappointed in the food and the pricing. A lunch bento box is now $13. And the sushi rolls are tiny. I got a $8 seaweed salad that was really more of a wild greens salad with seaweed sprinkled on top. I will say you get good portion of food with the bento box, but with sushi places littering Gilbert Rd you have so many other options.  With lunch pricing like that, attention to details needs to be taken more seriously. That being said, our table cloth was pretty filthy-- with old sauces slashed (wiped up) and dried up on it. My coworker had a fly in her side sauce and had to send it back. And another coworker's glass was so beat up it looked like it had rolled in the street a few times.  My coworkers wished we'd had gone a half mile north to Osaka after today's experience. That place was a good time! And two miles north of that is Sushiya-- you get a lot of food for your money there. Otaku is a posh place with food that doesn't live up to its image."}
{"text":"Happy Hour Prices and selection are not all that...Food is good, and the sushi is fresh. Actually the food and the service is on point....the happy hour is what brings down the rating.   Get your shit together!!!"}
{"text":"Been here a couple of times.  Nothing bad to say.  Food is great.  Can't give 5 stars, because I am a noobie to the Sushi world and I don't want to speak for those who are experts.  Can say that for someone like myself it was great.  Staff is friendly and very helpful.  Place is kind of in a weird location, but worth the visit."}
{"text":"If you like spicy, ask them to make a Kill Bill roll for you (it's not on the menu)...  Spicy tuna roll, topped with unagi, sweet eel sauce, thinly sliced jalapeños and, last but not least, Thai chilies!  Dip in a little soy sauce and you'll have spiciness, sweetness and saltiness all together in each bite. Yummy!"}
{"text":"we came in and were immediately seated, albeit a bit awkwardly. Maybe it was our clothing and appearance, we looked pretty ruffled but we were ravished. The menus were provided and we ordered immediately. i got the chrirashi and my boyfriend got the crunchy california roll. He said the roll was good and the price wasnt outrageous.   As for me, the fish in the chrirashi was not as fresh as i had hoped and the rice didnt seem to be traditional japanese rice but rather was bland and unappetizing. and i reluctantly ate most of it.   lastly a note on the wasabi, their wasabi was just... not good.   3 stars for excellent service and a beautiful setting and the crunchy california roll. -2 for the chrirashi bowl. i could be wrong, this is just my opinion based on several sushi places we've been to in the area."}
{"text":"Went for the first time and I probably won't be going back. The sushi tasted like store bought sushi from a carton. This does not even compare to Kona grill."}
{"text":"Spicy jumbo chicken wings were very good. Ordered the tri tuna lunch. Nice cuts, fresh and good mix. Received the free edamame with check in. The beans were cooked right- not soft and mushy like some places- with sea salt. The service was great. The other people with me ordered the sashimi and sushi lunch. They enjoyed it too."}
{"text":"Been wanting to try this restaurant for awhile now and was so excited when I saw a livingsocial deal I just had to have it. The food was good but our server was not so great. It took her long periods of times to bring back drinks and such. We asked for a childrens menu when we sat down and it took 34 minutes for her to come back empty handed and we had to ask her again. They only thing I could say about the food was I wish they would bring the dishes out all together instead of staggered apart."}
{"text":"After reading the reviews for Otaku I wasn't sure if I was headed to the best or worst sushi restaurant.  The reviews seemed to be polar opposites.  The interior of the restaurant is beautiful.  High ceilings, stone tile floors, and marble table tops.  The seats were modern Asian, but very comfortable.  There are ceiling to floor windows and outdoor seating.  There is a large saltwater aquarium in the entrance with puffer fish, lion fish, hippo tangs, etc.  The restaurant was not very busy during the lunch hour.  Only a handful if tables were occupied.  I was sat quickly and my server was attentive at firsyt, but after my meal was delivered I didn't see him again until the check came.  I ordered the Fire in the Mouth roll upon his suggestion.  I also order a Bento box with crispy walnut shrimp.  The roll took much longer then I expected.  I ordered the roll first thinking I could start my meal with it.  I'm not sure what took so long, after all they aren't really cooking anything.  The roll and salad from the Bento box came out at the same time.  The salad was good with sesame dressing (although I would have preferred a creamy ginger).  The salad could have been dressed better.  Most of the dressing was on the bottom of the bowl.  The roll was okay.  It was served on a pretty plate, but was not plated well.  The sauce was just half hazzardly spooned over the roll.  The roll was a little spicy, but other then the spiciness of the jalapeno and sauce there wasn't much depth of flavor.  The rice was a hair undercooked (or dried out) in my opinion.  Definitely not my favorite roll.  The Bento box looked nice.  The Walnut shrimp were great.  Large shrimp with a great sweet white sauce  The California roll was okay (once again the rice is either undercooked or dried out).  The gyoza and egg roll were both cooked perfectly and were pretty large.  They both tasted good.  The fried rice was tasteless with an occasional chunk of egg.  Overall I was not overly impressed with my meal.  It is possible that the other things on their menu are great, but since I don't live in the area I will probably no be back.  Side Note:. A few of the tables around were picking up their sushi roll pieces with their hands.  Not just a piece or two.  They ate their whole meal that way.  I have seen people eat nigiri that way, but never maki (except for an occasional end piece).  Is that an Arizona thing?"}
{"text":"The red blossom is the best! And the grapefruit martini superb! The service is amazing! One of my favorite sushi places"}
{"text":"Took my 7 year old here to have her first sushi bar experience. The restaurant was completely empty, but we came right at 1130 on a Saturday.  I couldnt convince her to try the sushi but she did get a bowl of sushi rice($2.50) and she loved the Mochi ice cream sundae ($2). After looking at the menu and coming down from the sticker shock ($23 for a Poke bowl seemed a little steep and I am the person who always orders the chirashi bowl at every sushi bar!), I opted for a salmon hand roll ($7) and masago sushi (2 pcs, $6). The masago had generous portion of eggs, and they were delicious. The salmon in the hand roll was super fresh and delicious, but I was a bit dissapointed the the hand roll as it only had rice and salmon wrapped in nori. Usually hand rolls have cucumber, avocado, raddish sprouts or other fun things to make them exciting. It also wasn't very big, which tends to be why people order hand rolls...  This had none which left me a bit disapointed. We also sat at the bar because I wanted the kiddo to get to watch them making the sushi but the bar was solid and too high for her to see the process. Overall the quality of the food was excellent, and we will definitely be back but will get a seat by the aquarium. And definitely more of a special ocasion vs everyday meal type place."}
{"text":"I went here last Friday and it was one of the best sushi I've had so far in Chandler. Soft opening right now, but after they get their kinks all fixed I'm sure it's going to get even better. Service was ok, but the food was outstanding and the ambiance of restaurant is like no other in the area."}
{"text":"I'm seriously in love with Otaku. I crave this place, frequently. As evidence of my love for this place, in their first 3 months of opening I went there about 10 times, and I live 30 miles away. Perhaps \"obsessed\" is a better term here.  In addition to the above, I actually followed the sushi chef, Jay Chung, from his previous sushi joint. Turns out, this place was basically built for him, and for good reason! Better sushi is hard to come by, especially in the Phoenix metro!  My favorite option here is sitting at the sushi bar and ordering \"omakase,\" or \"chef's choice.\" Essentially, you just sit down and let the chefs get creative. They'll feed you anything and everything. I have yet to be disappointed with this option, and I am constantly wowed with what they create. The rolls are delicious and many are quite unique, with a great balance of rice, fish and filling. My poison, however, is sashimi. I would kill for a nice slice of tasty, fresh, raw fish. And Otaku does not fail here. In fact, they get some of the freshest sashimi I have ever had; it's truly impressive.  So if you go here, don't just have a california roll or something equally dull. Be brave, try something new, ask for recommendations, or just let the chefs feed you -- you will not be disappointed!"}
{"text":"Food is great. Although the location is a little bit off the beaten path it makes for a nice, quiet dinner. The sushi is authentic and they have Chinese food for those not fond of sushi. The cheetah roll is by far my favorite.. Even though it is a little gimmicky with the flaming hot Cheetos in the center, it tastes amazing!"}
{"text":"The staff was friendly, we were seated right away. The atmosphere was perfect for a date night. The drinks were well mixed and the sushi was great. I will definitely be returning."}
{"text":"Not a good experience. The service is very slow. The sushi tastes like it's about to turn bad.  We keep giving this place a chance because it is close to home. Every time we go we are disappointed."}
{"text":"Came for dinner on a Friday night with My family. Great service, good vibe, tasty food...  Would definitely come back again. Our sever, Stephanie was spectacular. She was on point with all of her recommendations of what we preference we had and detailed about all the dished they had to offered. She came to check on us several times even after our dishes was brought out to see how we liked it... Outstanding customer service from my point of view. Overall it's great."}
{"text":"Great lunch options. The orange chicken is amazing. Definitely not you Panda Express quality. It's perfectly crispy with a bit of zing. The chirashi bowl tasted fresh and lovely with chopped cucumber and avocado."}
{"text":"Great friendly staff. Food is pretty good. Only took one star off just because they kept forgetting to get us small items like plates, silverware, sauces. Not a deal breaker of any sort. I'll come back here again."}
{"text":"We came on a livingsocial. The place looks great. Looks hi quality. Looks like the food would be good. However, that's where it stops. We had 4 types of sushi. All were very average. All very small. The rainbow roll was again average, as well as the rest. Basically a nice place with avg service and nice looks, avg food at a very very overpriced bill ! Will not be back."}
{"text":"I can't say I was very impressed with the service at the bar. The table service may be good. Patrons seemed like they were having a GREAT time. So don't get me wrong, this was just at the bar. A dirty martini has brine, hence the dirty... he called it \"dirty juice\" I'm not sure he knew what brine was. We had to repeat our order to him multiple times.   The orders weren't made to description. Food items weren't put in correctly or brought out at all. He tried redeeming himself but his poor attitude didn't help. He got better as the night went on but it was pretty much an overall failure. Paying more attention to his possible regular guests while neglecting and providing service to new guests.   I'm in the process of moving back to the valley on a different side of town. I see no reason to return to this establishment.   Also, I noticed a patron trying to order an old fashion. I cringed when I heard him. If this guy couldn't make a dirty martini how is he going to make an old fashion? Luckily, the man asked him how he made it. When I heard how he made it I knew for sure the man would turn it down ---and he did, rightfully so!"}
{"text":"Had my birthday dinner here and it was perfect. We enjoyed the Hot Cheetos roll for the first time and our normal sushi order. Everything turned out great and service was on point."}
{"text":"This place is really good for a date. Cocktails were very strong which I like! You have to try the cheetah roll. I'm not a sushi purist so in love the experimentation! Actually okay to go on weekends too because it isn't bursting at the seams with people. We sat at the sushi bar the first time and a table the second time and the service was good. Definitely coming back."}
{"text":"This place seems to still be going though some growing pains. Ambience is ok, tables are oddly laid out and it seems they could use some of the space better and fit a few more tables in.  Most of the food I've ordered has been good but it seems some of the recipes have changed. The hot and sour soup used to have more 'kick' to it, it is still very good but I prefer it very hot tasting. The sweet and sour chicken seemed a little dry and next time I will ask for more sauce. Our friend ordered the orange chicken and it was very good. Service is touch and go, seems we had to hunt our server down a couple of times and ask for more napkins and silverware. I honestly have never had much of their sushi, except for the squid salad, which was a huge serving and tasted ok. Drink menu is average, only thing that stood out was the 'pomtini'.. no prices on the drink menu either. For $8 the pomtini was average, didn't even some with a sugared rim or any fruit. There is room for improvement for almost everything here and hopefully it can only get better."}
{"text":"Been here 3 times, so far everything's been good.  I'm not giving it 5 stars because I think it's a little pricey.  Good food though, great atmosphere, great service."}
{"text":"Actually should be 2 1/2 stars . The reason I'm giving it this many stars is because the garlic at a mommy ate was a rocking good the lettuce wraps are probably the worst I've ever had flavorless and greasy the reason  get them is because I want to eat healthier/lighter. It's a big nice place but the benches are ripped up. Staff is really nice."}
{"text":"My coworkers & I frequent this spot for lunch, they have really great lunch specials! Their bento boxes are only $11 & the super generous portions could easily be shared with a friend.   Last week we had a little \"incident\" with something ending up on the plate that shouldn't have been there. The manager's reaction absolutely blew me away. Most restaurants will give you an insincere \"I'm sorry,\" but she went above & beyond to correct the mistake. Customer service at its finest!   The 4 star rating is only because of the slowness of the waitstaff. Lunch for most professionals is on a time schedule, and the waitstaff needs to accommodate that & pick up the pace!"}
{"text":"Let's start with the service, fantastic. They're very nice and attentive, but never invasive or bothersome. They have lunch specials which makes it nice, but I had the spring jalapeno chicken and it was delicious. Just the right amount of fire, and all the flavor you could hope for.   While the ambiance is a bit quiet, they have tv's running, and the look is very clean and modern. It is by no means a boring place. I can only image how epic this place would be like on a Friday night, maybe Happy Hour?"}
{"text":"Finally a decent sushi restaurant near home! I went to their soft opening for dinner and as soon as I walked in I was actually pretty surprised on how nice & big it was, the decor, fine dinnerware, the whole setting. Whoever designed the place did a pretty good job. And I like how the bar is in the middle of the room and there are sections of places you could sit around the place. I noticed how some of the waitresses were wearing their fake Gucci pouches and staff members were using ipads. It seemed like a fancy sushi restaurant. I was just hoping it wasn't another one of those RA/Roka Akor like sushi restaurants. Their sushi is horrible!   Anyways got seated by some waitress and she freaken took forever to get our drinks, then moments later she came back with our appetizer which was the Otaku spicy tostada. This was good!!!! She even suggested to try their kitchen food instead of sushi so we did and I got the seafood tofu hotpot & boyfriend got the curry chicken. The curry was rather watery kinda like curry soup which was eh.The seafood hotpot on the other hand was actually pretty good with lots of flavor. Mine didn't come with rice so I was waiting on our waitress, but she was seriously missing the entire night! Thankfully my friend actually works there and she came to check up on us & I told her I needed rice she was brought it for me. Even one of the manager came over to our table and asked us how our food was. Overall, I had a good time, most of the staff was pretty friendly.  I understand that during that time since it was their soft opening some things were a bit unorganized but still the our waitress sucked. My friend even had to go look for her in the kitchen to let her know we were done and was ready for our check! GRR  I also went here for happy hour just yesterday and it seemed to be a bit more organized & in place. YAYYYY! =P Tried their tootzy roll, spicy tuna, & vege roll. It wasn't GREAT, but it was good. And service was good too. I say their kitchen food is probably a bit better than their sushi. But overall I like this place definitely would go back again."}
{"text":"Always a family favorite!  I have neglected to write a review until today...just lazy on my part.  Hot-n-messy was my first today and worth the $16.   Singapore style rice noodles are great.  Squid salad is a must to start with.  Zack the manager can help you if you need advice...as wi any of the great staff.  We will be back again and again and again..."}
{"text":"Really great place.  Live nearby and never knew they were there until I looked on Yelp.  Finally, good sushi in the east east valley near Power Ranch.  Been here twice, once at the bar and once at a table.  Solid service, clean and very good food.  Have tried cocktails, sake by the bottle and lots of sashimi.  The 24 piece sashimi plate is the best deal on the menu.  Get over you're fear of raw fish.  It's light, tasty and a fun experience.  The real wasabi is an interesting feature and hard to find anywhere.  A little tiny dollop of that on nigiri or sashimi and you're good.  Tried the fried rice, snow crab California roll and miso soup too.  Everything was fresh and fantastic.  Can't wait to go back."}
{"text":"We love this place.  Came here with my wife and little guy.  The waitress we had was super friendly with him and very attentive. They have some cool sushi renditions here for rolls.  The Korean short rib is hands down one of the most amazing things I've ever eaten.  Get it you'll love it.  The decor is pretty interesting and the place was jamming with people when we got there so it has a nice atmosphere.  They messed up our roll immediately came over apologized fixed it and comped us a tempura fried cheesecake.   Let me tell you the cheesecake is unbelievable.  It melts in your mouth when you eat it.   The manager was great and quick to fix and please.  They won us over as return customers."}
{"text":"Nice atmosphere and music.  Definitely more of an adult setting in my opinion.  A very nice place to meet up with friends and talk over beer and wine.  The food is good, it's not mind blowing, but what I've tried so far is pretty good.  The service is good as well, the hostesses and waiters are helpful and considerate of time frames.  I didn't have to wait forever for a drink refill, as in some places can be the case.  The staff is mostly smiling and kind, a definite plus in my eyes.  The place was clean and presentable, though I didn't use the bathroom, so not sure about that.  The minus star is that the food is just good, not great.  But, personally I am the type of person who goes to places for the overall experience, and I would definitely return to this place!  4 stars."}
{"text":"First time here. I managed a sushi restaurant up in north scottsdale, so i know sushi. And this place is my new favorite. Will definitely become a regular here!"}
{"text":"So, I am not easily impressed, but always willing to give a new sushi place a shot, so naturally had to try this place out. We stopped in on a busy Friday night at happy hour and except for a sad looking fish tank at the entrance, the restaurant is beautiful. Someone spent bank on this place and it shows.   We were sat at the sushi bar, at our request and glad we did as we got to see the sushi chefs in action. Although the chefs were busy, you got the impression they were in control and did not rush so much to make sloppy sushi rolls.   We ordered a squid salad, order of goyzas, a shrimp tempura roll and a spicy tuna roll. All were excellent and I was most impressed that the spicy tuna roll had more tuna than rice, all tasted fresh and delicious.   The only glitch of the night was when we were told their credit card system was having a problem and they apologized for the delay. It was not a problem for us as we were still finishing up our drinks. After a few minutes our server came out and advised he was taking $15 off our bill for the delay. I thought it was a nice, but unnecessary gesture until I checked my account and found they charged not only my dinner but apparently some other diners dinner as well. I am guessing the mistake has been corrected but I will not know for sure until all the charges from the weekend clear. I suppose would have been happier if they had have just been honest with me and gave me a heads up what happened, but in the end I suppose its not the end of the world as mistakes do happen.   Despite the billing error I definitely look forward to returning."}
{"text":"Loved it. Great service.   I loved the ambiance of the restaurant as well."}
{"text":"This is our new sushi spot; having moved from Portland, OR we're used to fresh seafood. Otaku did not disappoint! They get fresh shipments in every two days! Our server Tyler was VERY attentive, knowledgeable, and helpful. The food was delicious, with high quality ingredients. My family's favorite was the Cheetah roll, but everything was great! We can't wait to come back!"}
{"text":"Amazing location n food. Order the cheetah roll. It's great!! Enjoyed a great conversation with the manager. Also ask for the fresh wasabi, it's super spicy n yummy"}
{"text":"Great interior design and wonderful sushi. I would rate the service at a 3 stars mainly because I had to get up and get plates for our appetizer, and that was after I asked a hostess who said she would get them right away. Then I watched her talking with other staff as if there were nothing better to do. So I went to the bar where another employee apologized for the miss. When we received our sushi, we again had to ask for plates and then we received wet ones. I don't think this type of service is what the owner/s expect for their customers, so I hope they and or their manager's focus on how they serve customers so we come back. We'll give it another try, though we may just sit at the counter near the chef instead of at a table."}
{"text":"Bang for the Buck: 3.5/5 - Pretty pricy overall, not much on the happy hour menu but there were some nice items there that I normally don't get but will as I go back. - This rating may change as I go back there more, we will see  Decor: 3/5  - would get another star but the salt water fish tank was almost 100% empty. 4 small fish, 100gal+ tank. The rest of the place was nicely done. - a bit hipster/trendy but that was fine. I like the rotunda area and the patios... need more patios IMO.  Ambiance: 3/5 - nothing special, the normal large open room style that I hate when places are busy. They are fine if they are not busy  Service: 2/5 - needs improvement, and the place was ~15% full. - the manager was great, super nice guy. but took him 20 minutes to get some rice we asked for. Took our actual server about 15 minutes. - several of our dishes went to the table next to us... on several different occasions. - food was very slow to come out... VERY slow and very spaced out. Not a good pace to the meal, a bit frustrating  Food Quality: 5/5 - I had no issues here. We tried several items and they were all very good quality  Food Quantity: 3/5 - this was a bit of a mixed bag. - seaweed salad was perfect (and delicious). The baby calamari was a very small portion, the tempura was alsot perfect. The sashimi and sushi rolls were a good portion size - this rating may change as I go back to try other things.  Food Flavor: 4.5/5 - everything was perfect except the baby calamari... which was greasy and overcooked.  Food Uniqueness & Creativity: 3.5/5 - the rolls were fairly creative, nothing I have not seen before but above average... thus the 3.5 rating here. This may change as I try other things too.  Last Experience... 03/17/2011  Seaweed salad - very very good, will be getting this a lot Green tea - loose leaf and brewed in pot, perfect touch. Tea was average green tea but WAY better than pre-bagged! Sushi Rolls - we had several and they were all very tasty, and decent size. Tempura mix was very good - not greasy, good portion, etc. Will have this often."}
{"text":"Really tasty and fresh sushi!  We tried it out and have been there twice already, once for happy hour.  The fish is fresh and the flavors are great!  Would have given it 5 stars except for the price is a little higher than I like to pay for sushi.  The happy hour prices and options could be a little better, but overall it's definitely worth the money if you are looking for a nice bite of sushi!"}
{"text":"Enjoyed our meal.  Very kid friendly. Order the cougar roll, very refreshing. The cheesecake dessert is CLEVER.  I've had better cheesecake but the presentation made us smile. Service was pleasant and not intrusive.  Thanks for that. Turn down the music.  Shrink the table size.  Make your rice more consistent."}
{"text":"Fantastic.  Service can be hit or miss but the food makes up for it."}
{"text":"I came here because I saw pictures of sushi on the Yelp app that made my mouth water.  Unfortunately, I didn't get any of those pieces but what I had was okay.  The quail eggs were delicious.    The bartender here is phenomenal!  Cute little Asian packed with personality. She made me promise to come every Thursday for ladies night.  If you're a female in the area on a Thursday, go there!  She will take care of you!"}
{"text":"First of all I must say that their customer service is excellent! I'm a big fan of the walnut shrimp.Everything about Otaku is on point."}
{"text":"Havent tried the sushi selection yet, but the tom yum hot pot was delicious & the Singapore style rice noodles went great with it. They have a small selection of alcoholic beverages, my all time favorite is the Moscow mule.  Bento box for kids that may not like sushi, but the Asian fusion is a wonderful combination if you cant make up your mind."}
{"text":"Kinda far from civilization, but it's all good.  Gotta eat inside the tree room!  The room is amazing - according to the waiters and one of the owner, everything was imported from oversees.  I didn't order sushi, but I did get the Hong Kong style noodles and Seafood Tofu Soup -- Mmm, yes both times hit the spot.  Aromatic and tasting at the same time -- what's not to like!  Our service was outstanding, small or a large crowd is not a problem.  Will save this place in my pocket for next time :) (Shout-out to Jay, Shane, & Stephanie!) - Enjoy"}
{"text":"I loved this place, have driven by it several times and decided to stop in on a Saturday night, I was surprised it was not more crowded but that was good for us.   Our service was exceptional, greeted by a very friendly host, sat us in a nice booth....the restaurant is beautiful inside. Our server was prompt and friendly, and the other servers were also attentive to us when needed.  The food was great, we shared three rolls and the seaweed salad. We had the Moon dragon, The Lollipop and the Hot n Messy....  this place is a hidden gem.....try it"}
{"text":"Our first experience here was fantastic!  We will absolutely be back.  We tried the Matador roll and the TNT roll.  The rolls were both equally amazing.  I'll probably be dreaming of the Matador roll.  I'll be back for it soon.  And I'll for sure order the TNT roll again.  My husband, craving his version of comfort food ordered the fried rice.  It was packed full of shrimp and meat.  Our waitress, Taryn was friendly, attentive and helpful.  The restaurant was clean and inviting.  The wait was shorter than expected.  Overall the ambience is right up my alley.  Lively yet intimate with outdoor seating.  I can't wait to go back and I'll definitely be recommending this to my friends."}
{"text":"I love this place. Great food, cheap and never too busy. Me and my boyfriends favorite spot!"}
{"text":"I had lunch on a Sunday and the service and food were very good. There is a pleasant outside patio area, that while small and enclosed, is a great idea for an outside fair weather meal. The sushi was very fresh and the specialty items and rolls were imaginative and tasty. They also have fresh wasabi (has kind of a pickle relist consistency) that is good. I'd also recommend the etamame.  The service was attentive, polite and knowledgeable about the offerings. It's a little pricey (on the outside of $$), but you do get what you pay for here."}
{"text":"The BEST meal I've had in a long time!!! Our waitress Liz was knowledgeable, prompt, and very, very kind! We had the Thai mussels, Tuna sushi, Mongolian beef, orange chicken,  and three different rolls. She asked if we left room for dessert (which we hadnt) but we had a birthday at the table so we went all in. It was incredible!! Everyone had a great meal and talked about the next time we would be coming back and who we would bring with us!! So So good!!!!"}
{"text":"In AZ you know going in your sushi options are limited and should be graded on a curve. That being said this is damn good sushi and can stand up to most anywhere. So happy to finally have a go to spot for great sushi in the east valley!"}
{"text":"Ordered takeout from here on Mother's Day and it was FANTASTIC! You never know about takeout sushi, but I was craving it and not they didn't disappoint. Guy who answered the phone was super nice and helpful, order was right on time, everything was right and they gave me plenty of sauce/wasabi/ginger/chopsticks. Also, the presentation of the sushi was beautiful and the fish couldn't have been fresher. My only complaint was I didn't order enough!!! Definitely trying more next time and will try actually eating at the restaurant too!!! Oh, and the fresh wasabi was delish!"}
{"text":"I love, love, love the restaurant, the food and most of the staff at Otaku, but there are times when they make mistakes on the order or the service is slow ... glad they finally redid their menu so it is not so huge (I mean size, not number of items). PS: Whatever that pineapple mojito type drink they have is SO yummy too!"}
{"text":"Best sushi I ever had!  We took the entire family for my birthday.  Since it was a party of 6, we had a lot of different sushi!  We left stuffed.   The decor is really neat as well.  I think the key is not to go at peak time.  We arrived at opening, I think 11 a.m.  Everything was fresh and everyone was well satisfied.  My husband had a bento box.  The gelato was great... we were divided between green tea and mango flavor!"}
{"text":"Management followed up to my restaurant experience and review. They were very nice, kind, listened, and apologized. They offered an invitation to their restaurant again which I declined. I appreciate they took the time to acknowledge my concerns and experience as this will only help them going forward."}
{"text":"Absolutely love this place!  Always great service.  The sushi is always fresh, we love sashimi and have never been disappointed.  I love a restaurant that has specials, and Otaku always has specials.  On the weekend you can try 5 delicious  items from the small plate menu for $20.  Try the fresh wasabi, you won't be disappointed.  They serve a great pineapple mojito as well!"}
{"text":"Arrived at the tail end of Happy Hour on a Friday. Confusion at the hostess stand when we arrived and more confusion as to who was actually serving us.  Scallop Poppers were yummy and sweet but my husband had to pick too much \"bad lettuce\" out of his Seaweed Salad (I would've sent it back).  Pomtini was deelish but the Iced Tea was from the fountain (not fresh-brewed; yuck); ice water was foul as well. Off the dinner menu, went with the Tiger Roll (pretty tasteless), Monster Roll (which was sitting in a heap of Chiptotle Mayo and that's all I tasted) and the Red Blossom Roll (spicy; best of the 3). Sushi was served without soy sauce dipping dishes and we had to wait 'til the server stopped back to get some; then, the soy sauce pots were empty. Ugh. We used a Groupon so the overall tab wasn't too bad but I'd never be tempted to drive out of my way here again. Sorry."}
{"text":"I'm a little late on writing this review but I just had to give this place 5 stars!  It was Valentine's Day and I had forgot to make reservations.  I called at the last minute and the squeezed me in .. we didn't order the 'standard' Valentine's Day menu they offered, we just did our regular thing.  Some sashimi and a couple of sushi rolls.  The services was great, the food was fresh as always and we had a great evening!  This place is fantastic and I highly recommend them!"}
{"text":"So happy we found this place on here! Outstanding sushi in a beautiful contemporary setting. I had both my kids and still felt very much at home even though the place looks like a high end hot spot. We had a mix of sashimi, rolls, and dinner entrees and everything was very fresh and flavorful. This is definitely our go to sushi place in Chandler!"}
{"text":"My go to Sushi spot.  The Deluxe Shashimi platter is always a 10.  Of all the places I ha e tried in Phoenix, Otaku always delivers.   Friendly staff and great atmosphere.   Watching sports while siting at the main Sushi bar area is the best."}
{"text":"The atmosphere is fresh, open and friendly.  The food has a mix of both classic and unique items.   My favorite appetizer is the calamari, it's light with a slight spicy crumb.  It's delicious. Tip, they offer a great lunch menu at a reduced price"}
{"text":"I feel lucky to live so close! Went for a girls night and we all enjoyed our meals and sushi. Excellent service and nice atmosphere."}
{"text":"The food is so so. The decoration is good. The food is very pricey. Don't believe me? Try order two pieces of Tobiko with Quail egg see how much you have to pay. Very thin crowd, about four tables during lunch.0"}
{"text":"Had dinner tonight with my wife and the service and food was outstanding. The Dynomite roll was delicious as well as the Dragon Roll. The fried cheesecake was a great way to cap off our dinner.  Our server Savannah was outstanding!! Looking forward to date night next week."}
{"text":"I used to live overseas in Asia for 2 years, and despite the wonderful sushi there, this place is probably in my top 5 best sushi restaurants. I went with my boyfriend around 2 months ago, it is very casual which is nice, and not too expensive. We got a few rolls, including the Mardi Gras which is really unique and delicious! Very clean inside and outside, and friendly staff. I've only been to this sushi place in the Chandler but can already say this is the best one around! Can't wait to get back!!!!"}
{"text":"Sushi and service were good, but the entrees weren't up to par, even Panda Express is better for Chinese dishes. The specialty cocktails sounded creative but weren't very good either. The staff members were very nice and the ambience of the restaurant was great but unfortunately we won't be returning."}
{"text":"ASK FOR THE FRESH WASABI. I'd never even seen fresh wasabi before, now I can't get enough. I am so super thrilled to have found this place. We've gone for family outings and for date nights, we were massively impressed on both occasions. The staff is amazing. Also...you wouldn't think about sushi restaurants having deserts but they just came out with a special fall season roll...I think there is pumpkin pie in there. I would recommend this place to anyone."}
{"text":"We have been patrons of this place for the last 3 years, had excellent service and meals......... the last 2 visits were just ok, always seem to be out of amaretto,  any who. This last visit was unacceptable! We were seated and at least 10 minutes and NO SERVICE,  not even a visit from our server. Granted it seemed that there was only 1 wait person that we saw, but c'mon! There were only a handful of tables that were there before us,  and a table that wasn't even cleared that we passed by, was occupied and served as we walked out!!! NO THANKS OTAKU....we drove on down the road to Osaka and had a great meal and service."}
{"text":"This sushi is very pricey compared to other nearby better sushi places (sushiya) the spicey tuna had a very dark color to it , and very fishy smell and taste couldn't even eat , I wouldn't recommend this place to anyone ,"}
{"text":"Have been there 2x now for Sushi & it's all been good some rolls better than others but we're exploring the menu.  Not just sushi they have a large menu featuring oriental dishes. Decent service too so we will be back."}
{"text":"For me customer service is 1st and the taste/quality of the food is 2nd.  The bartender Codi (female) was super awesome! She made a custom gin drink for me + she was very familiar with the menu + she looked and sounded like she loved her job + we sat at the bar btw  I ordered a plain salmon roll, miso soup, and a cocktail with gin.  Codi asked me a few questions about the types of drinks I like and she made my cocktail as close to it as possible & she checked in with us regularly. My salmon roll was great, the fish tasted pretty fresh.   Really, I have no complaints.... I went during a regular time but looking forward to visiting this place again!"}
{"text":"Pretty restaurant. Waited 20 minutes for one drink and another 5 minutes to find out my cocktail was not available (from their cocktail list) as they were out of the right ingredients. Our tiny, but tasty calamari appetizer was finished before our drinks arrived. My gin and tonic was $7 and made with just a splash of tonic and no lime- not good, unless you wanted a shot of gin.  We received our neighbor's food and then waited another ten minutes for our entree. All of the food was quite tasty, the prices were a bit high. The service was disjointed and quite frustrating.  We will return, but not for a few months and not without some kind of a discount."}
{"text":"I have eaten at several sushi restaurants in the east valley and in Scottsdale, but I haven't found any that have the quality of fish Otaku does. The entire staff are so friendly and make us feel like we are a part of their family every time we come in. We love that we can order special rolls and make up our own as we go. Jesus, Travis, and Jack are very talented and we love sitting up at the sushi bar to watch the food art they create. Otaku is my happy place and I look forward to going in every week!"}
{"text":"No thank you. Dining area felt dirty, wasn't crowded but looked like they hadn't cleaned after the lunch rush ...?  Waitress smelled like smoke.  Had appetizers and drinks- absolutely nothing special. Will not be back."}
{"text":"Was impressed with the nice and classy interior, and our server was very nice and accommodating. Ordered sashimi which tasted great but was too small of a portion considering the hefty price. We also ordered several rolls, out of which the cheeto roll was the most interesting and satisfactory. However, I was disappointed with the spicy salmon and spicy tuna. They were not very tasty or spicy or fresh. Will definitely come back to try other things."}
{"text":"When we pulled up and I saw the name I simply thought wtf... The decor isn't very Japanese more Chinese and the menu also has tons of Chinese food also... The service was really god and the sushi chefs were cool as hell... So far this is the only place in Arizona I haven't complained about the sushi... It's not the greatest but I thought it was cool... so in my opinion its A-OK"}
{"text":"Arrived at 815p, plenty of time before closing, not busy 4-5 other tables. The place is beautiful and our server ( the bartender) was friendly. Unfortunately, the food was extremely average; the miso soup was very salty, the rolls stomach able. We ordered 2 rolls; one came out in a reasonable time, the other took FOREVER ( 2 tables after us came, ate, and left)!! $80 later (2 rolls, 2 sake bombs, 1 miso, 1 appetizer), definitely not worth. We are sitting at home eating Wendy's, disappointed and still hungry."}
{"text":"My new favorite lunch spot.  Oooooohhhhh soooo good!  I ordered the Panko Bento Box lunch and it was delicious.  Our waitress was super nice."}
{"text":"I wouldn't say my experiences with Otaku have been BAD per se... I'm a returning customer, so obviously I can't say it was terrible.  I think, moreso, it was just average.  The ambiance is nice, definitely a large open space. There's a bar and a sushi bar, and both are always pretty busy.  Our server seemed a little lost. He didn't remember my mom, who thinks she some sort of a Regular, so even though she thought he knew what \"the usual\" meant, he didn't. We ended up getting some random appetizer, which was not \"the usual\". I'm not sure why he wouldn't just say that he didn't remember, and needed to be reminded of what she wanted.  Odd.  We had some shrimp stuffed Tofu, with some sort of tempura. Not good. They have you dip it in this random sugary substance. I dunno, maybe I was doing it wrong, but I didn't get the appeal.  Also had some battered scallops or something? Not good.  Las Vegas Roll is awesome, I can't hate on it. Squid Salad was also very tasty. And, if you've got a sweet tooth, DEFINITELY check out the tempura cheesecake. Ugh, so good!  Management is cool, they came around a couple times to see how we were doing."}
{"text":"This was our third time here and the best so far. I try to give places 2-3 times before making a real assessment unless it's obviously a bad spot. First time was 4 stars, last time was 3 stars and this time was 5 stars for sure.  Orange chicken, beef and broccoli, scallop poppers, and a couple of rolls. All delicious and good service."}
{"text":"I really want Otaku to survive.. the location is great and the service is usually amazing.  Despite our better judgement.. we have this place another try (ok.. more like 20 tries).  Our last order \"to go\" was so messed up that we had to go back to the restaurant not once.. but TWICE to correct the order.   The servers are always accommodating but it's time this restaurant takes care of the kitchen."}
{"text":"Been going here for a couple years with my family.  Otaku has best sushi in the east valley!"}
{"text":"This place opened a couple of years ago. It is close to my house, but early reviews were not promising. My wife and I have been reluctant to try, but last night, decided to go for it. We arrived about 4pm and wanted to take advantage of happy hour. Drafts were a buck off and a few rolls and appetizers, were discounted. The place was empty and I had to wipe off crumbs from my chair before I sat down. We noticed many of the chairs were filthy. Anyway, we found a few things we could agree on and ordered. We started with an assortment of tempura battered shrimp, veg and calamari. Looked pretty and we dove in. We both took a piece of calamari from the pile. My wife took a bite first and waited for me. She thought something wasn't right, but wanted to see if I had same reaction. I dove into that piece of calamari. Oh dear God, what the hell. Major taste and smell of ammonia. I spit out and called over the waitress.  I told her what we were experiencing. She was nice and offered to get us something else. We told her that were were not comfortable eating sushi now that we know the cooked food is not good. The manager came over to us and smelled the calamari on my plate. She was appalled at what she smelled. It was ammonia folks. Not sure if they spilled cleaning solution on the food or if this was just bad calamari?? Needless to say, we walked out. We will not be going back. I don't know how the chef couldn't smell this rancid crap before he battered and fried. Maybe he just doesn't care about killing someone? Nice job Otaku---you win the \"Suck\" award!"}
{"text":"Great place for lunch! Had a great time, could of had a happy hour though or special. Drinks were a little pricey."}
{"text":"Otaku has been my favorite place for sushi in Gilbert since 2015. The fish is always fresh and their rolls are unique combinations that are well thought out for their flavor profiles rather than just throwing a bunch of random ingredients together like other places. If you are not into sushi, they have  an extensive menu that caters to any palette. My personal favorites include the Tom Yum and the Galbi Short Ribs. This time I had two new experiences at Otaku that made my visit even better. The raw Kumamoto oysters were so delicate and delicious my mouth still waters thinking about them. And they have a new Manager Jenny that came over the check in on our experience. She was very friendly and bubbly. It was like having a conversation with a friend, not with just a restaurant manager checking in on us! I look forward to going back again soon!"}
{"text":"We come here often and the service is consistently great!  Front of house staff go out of their way to make us feel special each time we come.  The Pomtini is always masterfully created and delicious without being too sweet.  I also highly recommend the Singapore style noodles.  Our kids have some minor special requests that are handled without issue each time.  They have a lot of great rolls - the hot n messy is delicious!  Always a great experience!"}
{"text":"Very delicious and friendly! They do happy hour every day which is so great! The sushi is always very delicious and the same with their entrees. I love how close this is to my house. We visit this place quite frequently!"}
{"text":"Mediocre sushi at a premium price.  The restaurant is pretty nice and upscale feeling but the sushi just wasn't worth the cost.  If you go only go during happy hour."}
{"text":"Great sushi!! Great food! Great staff! Michael has taken care us twice and is a ROCKSTAR! We have had a perfect experience both times we have visited. This is our new favorite sushi spot. Keep it up guys!"}
{"text":"This is one of our go-to places on a busy Friday night. They always have seating where the wait time is minimal. The food is always amazing! I suggest the Tootsie Roll and the Cheetah Roll - my two faves! I always get soy paper on my rolls and let me tell you it is nice and thin, unlike some other sushi places that serve really thick soy paper.   Their Miso soup is very good too. Drinks are great and the staff is always so kind. We even get take out sometimes and when we get it home, it tastes just like it does when you choose to dine in. We like this place a lot and will continue to spend our Friday nights and money here."}
{"text":"The ambience is good..good selection of sake. I wasn't too crazy on the sushi . wasn't as fresh as I wanted it to be. Since its closeby,I will visit again."}
{"text":"Wow. What an awesome Sushi place.  Happy Hour from 3-6. Great sushi and shashmi.  Wait staff was excellent.  Come and try this place.  You won't be disappointed!!"}
{"text":"Just moved to the area and I think we've found our sushi spot! I can only review the raw stuff as we haven't had any of their cooked food. The fresh scallop sashimi is awesome. The only dish I probably won't order again is the Chirashi. I was looking forward to getting a bowl of warm rice topped with a chef's selection of raw fish, similar to other sushi restaurants I've been to, but I was disappointed to see poke over rice on a plate. Oh well."}
{"text":"Had the best lunch. Chicken, salad, and sushi were all very good. The manager was very nice and helpful and the service was great as well. The restaurant was clean and very nicely decorated. We can't wait to go back."}
{"text":"The are now open on mondays, went in for lunch, i  had the wonton soup, and bacon wraped shrimp.  Great food.  Big bowl of wonton soup,  has shrimp and  pork in it very filling. And the bacon wraped shrimp were very good.  It was my second time here and both the food and service  are great.  I will keep coming back."}
{"text":"Good sushi. Very creative rolls. Very attentive service. Thursdays are ladies night:)"}
{"text":"Pretty decent. Very N Scottsdale feel down in Chandler. If I had something really unique or special I would give it 5 stars. Still good solid sushi place. Friendly. I'll be back."}
{"text":"I want to preface this review by saying that I'm close friends with one of the sushi chef's in training, so we got a seat right at the sushi bar and really had a great opportunity to chat.  That being said, I will review this strictly on the quality of food, since we received some deep discounts due to being VIP guests.  (C'mon now, you know you all get discounts too when you personally know the staff/chefs, so quit your whinin'!)  The quality of the fish was excellent... some of the best sushi I've had in my existence.  The key to getting good sushi is to trust in the chef, and ask them what is fresh, and what they would suggest (omakase style).    We had a sashimi appetizer platter to start which featured blue fin, yellow tail, o-toro (yes, the good stuff!), and a few other pieces.  Served with fresh wasabi root (not the hydrated green powdery stuff), this appetizer really woke our stomachs and senses.  We had a few different rolls per the chef's suggestion, and all were spectacular (including some off the menu rolls).  The kim bap roll was highly recommended, and the quality was definitely memorable, better than most Korean-mom kim bop rolls I've had in my life.  We asked for ama-ebi (sweet shrimp), which was soft, tender, and sweet, with perfectly fried shrimp head to back.  This was the first time I've had such perfectly made ama-ebi, and it's made me want to continue my search in Chicago.  Some tasty mochi desserts, a few bottle of sake, and all in all, it was a very enjoyable night for my compadres and I.    I'm sorry for those that have found a bad experience at Otaku, as it sounds like most of it is waitstaff issues... but as a sushi fanatic, my advice to you is this:  1.  Don't ask for a table if you're party is smaller than 4... ask for a spot at the sushi counter, because that's how sushi is meant to be served.  Getting to know your chef, the chef getting to know you, having drinks together, etc.    2.  Ask the chef what he/she recommends.  Not all fish are equally fresh, and the chef will know what's best for the day.  And if you can provide them with your own past experience of what you liked/didn't like, they'll likely craft a sushi experience for you that you'll love.  Verdict:  If only Otaku were in Chicago... I might go broke.  Delicious sushi, and worth a visit!"}
{"text":"My wife and I love this restaurant. We frequent many sushi places in the Phoenix area and this is our favorite spot! Nice atmosphere."}
{"text":"This was a nice neighborhood find. Good sushi and a cool atmosphere. Friendly waitstaff. We had gyoza and sushi rolls. Both were very good."}
{"text":"I went in on a Sunday, not really busy. I was excited to try this place because of their wonton soup. I went in with high expectations. Soup was good but not out of this world and shrimp weren't clean, at least the ones that came in my soup. Small portions, orange chicken was more of a sweet and spicy. Customer service was not really there. We waited a long time to get our drink order taken, and food was also a bit of a wait for the restaurant's lack of customers. Overall will not be going back."}
{"text":"Went here to check out happy hour with family.  Nothing that really stands out.  Prices were comparable to other happy hour spots but nothing too memorable when it comes to the sushi.  The restaurant has a nice little flow as the bar is in the middle of the action.  Clean all around and the service was very good.  I would go back if invited to meet up but not a choice that I will revisit.  Sorry."}
{"text":"Love this place! The sushi is fresh, and there is a wide variety to choose from. The entrees are great, the house hot sake is the best."}
{"text":"This is my 5th visit  to this spot. Other visits did  not necessarily disappoint....  however, tonight's dinner/ happy hour was lack luster, to the point that I question coming back. Service was slower than usual, and drinks took FOREVER to arrive. Excuse, upon excuse later..... our drinks arrive and orders are taken. 3 sushi rolls, 1 order calamari, and a kid's  lo mein. Lo mein was flavor less, under seasoned(daughter  barely touched it, she normally finishes  her plate). Sushi was not as delicious  as we remember.  Calamari NEVER CAME.  I'm so bummed as this place is literally a minute from my house. To  make matters worse, second round of drinks took easily 12-15 mins to arrive..... didn't even have anything to numb the pain from this sad, sad experience. I don't know if I'll return, this visit  sure let me down. I guess I'll have to find a new sushi spot nearby."}
{"text":"My husband and I love this place. Great atmosphere and super friendly staff ! Zach is a great manager who always greets us by name and makes us feel welcomed. I love their lychee martini and you can't go wrong with their cheetah roll !"}
{"text":"Gluten free menus available. Not a ton of options but they also have gluten-free soy sauce. Great atmosphere and great service. Prices are a little high for the quality. Multiple pieces of my sashimi still had the skin on. Great place for socializing, business meetings, or date nights. Nice bar with tv, full bar options, and several beers on tap."}
{"text":"Always a great option to fulfill our sushi cravings... Service is always on point and the crowd is usually manageable with no long wait times for a table or the arrival of food. I would love to see some new specialty rolls since they seem to keep the sushi menu the same all the time. We've been here a number of times, ordered take out a number of times and we are always really satisfied."}
{"text":"Beautiful Decor but the food is below average. Don't expect too much except a great looking place."}
{"text":"I went here for lunch last week and got my same ol' Bento Box. The chicken was back to being awesome! So at this point... -1 star for inconsistency?"}
{"text":"The food is absolutely to die for! Everything on the menu is amazing! I've never had anything that didn't taste great. The service is always wonderful too, the staff is very friendly and on top of their game! Its some of the best sushi I've ever had. The cheetah roll is AMAZING!  Pretty much everything in the menu is. It's a great place for lunch and dinner!! Highly recommend eating here!!"}
{"text":"This place is nice. Really, really nice. I came here for lunch and ordered up a bunch of sushi, and the service was great. Every single person who was employed here took a minute to at least say hi to me, and the environment was really warm (maybe just because it was slow, but it was impressive nonetheless). I never wanted for anything- the sushi chef was extremely attentive and personable, and my server made sure that my tea was hot, my water was topped-off, and a smile was on my face.   The sushi was fine. Full disclosure- I had JUST brushed my teeth before coming, so I had a little bit of a minty mouth when I sat down to eat and I'm sure that affected the taste a bit. The unagi was perfect- oh-so-slightly crispy at the edges, succulent and warm in the middle with a very nice, unobtrusive sauce. The shiromaguro also had a really nice sauce to it, which I'm not used to on white tuna- but it was really nice. The ikura seemed a little bland, without the pleasing brininess and juicy pop that I usually enjoy. I will say that I was a little disappointed in the snow-crab used in the California rolls- usually when you see specific crab labelled it comes out as a solid stick of scrumptious leg-meat, but this was shredded and possibly from the claw, without much flavor. The rice was fine, but could have been a little more vinegared... but like I said, my tastebuds were a little off-center, so I'll have to come here again before I can really evaluate it.  All that being said, the exceptional friendliness of the staff was more than enough reason to give this place a solid four star. Maybe I just caught them on a good day, but service like that needs to be recognized! Thanks folks!"}
{"text":"The sushi is over priced, must be expensive rent factor kicking in for mediocre sushi.  I'll take my business to the newly opened Osaka!"}
{"text":"Fancy place with nice ambience, but food was not great.We went on a Saturday evening and wait time was about 20mins. We ordered a sushi roll and chicken teriyaki and both were not upto the mark."}
{"text":"This was a great sushi restaurant! Loved their small little tapas. Their rolls were delicious. We got the one with Cheetos in it. Oh my goodness so good. Never would have thought about eating flaming hot Cheetos in my sushi roll. Extremely creative rolls. The atmosphere was great. Service was good. Food was delicious. Looking forward to going back."}
{"text":"Second time at this resturant and was happy after both. Staff was nice and friendly along with the owner who was walking around and talking to each table. My wife had sushi and loved it and it was priced well. I got the Mongolian beef asked for it spicy and it was delicious. They also gave us a free edamame when checking in with yelp. The restaurant is very clean and a great bar if you like beer, wine or a  martini.  Only thing I didn't like was how loud the music was at some points. I will definitely be going back to this place!!!"}
{"text":"We haven't been here is awhile and now I remember why. If you really know and like your sushi/sashimi this is not the place to go, but on the other hand if you like Asian cooked foods then its OK. My party of 3 dined here and a Saturday night around 7:30. The place was filled. Atmosphere very nice. Our server Tracy was excellent.  We ordered mainly Sushi: Uni (sea urchin), Salmon, Smelt Roe with Quail Eggs. We also ordered a Hamachi Sashimi and a Otaku Wrap along with a Tom Yum Hot Pot.   The best part of the meal was the service and the Tom Yum Hot Pot (though we ordered the soup \"thai hot\" and was not at all). The sushi was so over priced and disappointing. Fish slices were so thin almost transparent and was pack with a huge HUGE amount of dry sushi rice. The Otaku Wrap had so much sauce on it you couldn't taste the fish. The Smelt Eggs were good, but again way too much rice. The Uni was excellent in quality but at $14 an order, that is the highest price I have ever have paid in Arizona. In the past I've had their cooked foods, the Crispy Walnut Shrimp and the Orange Chicken, which were not bad.  Atmosphere very nice, service excellent, cooked foods OK, sushi/sashimi, I'll pass!"}
{"text":"We decided to return to give this Otaku another shot and we were not disappointed! The service was on point, the food was phenomenal, and the ambience is like nothing else in Gilbert. This fish tank they have by the entrance is beautiful and you can tell they take great care of all the animals.  We had the Superman roll, the Strawberry roll (my favorite), spicy tuna roll, and the Red Blossom. All of them had great flavor and the fish was very fresh. I also had the pineapple mojito. It was great. Our waiter also informed us that they grow their own mint on the patio! Very cool.  We will definitely return and be sure to bring family and friends next time!"}
{"text":"Came here for lunch and got the Bento box with the Seafood Otaku. Delicious. Colleague of mine got the Chirashi bowl her only complaint was the fish was a little warm due to it being placed over the rice vs. the veggies. Other than that everything was great."}
{"text":"HUGE restaurant... You are greeted at the door by friendly waitstaff and cooks behind the counter. I got the salmon lunch bento box and was very happy. It was delicious. There are several bento boxes to choose from and I'm sure they all taste great.  Manager even walked around ensuring everyone was enjoying their meals, which in my humble opinion is a good sign of caring service.   Don't forget to check in on Yelp for a complimentary now of warm yummy edamame."}
{"text":"Great ambience, amazing service and delicious food.  Can't go wrong for a date night here."}
{"text":"This restaurant is very close to my house and I eat here all the time. The people who work here are very nice.  The food is excellent!  All of the fish here tastes really fresh.  Love this place.  Yummm!"}
{"text":"The service is outstanding and the food is wonderful! My husband and I come here all the time.  The management and the staff is friendly and helpful.  The mardi gras roll is amazing!"}
{"text":"For starters, I love sushi. It's amazing. So when there's a new sushi place that opens up near by I like to give it a go; and seeing as how it was valentines weekend I decided I would take my wife out to dinner for some sushi. We live near by, so I figured we would go to Otaku and see what the fuss was all about. After all, they have pretty decent reviews so far and it looked pretty promising.   I had the foresight to call ahead because apparently the restaurant was full. I got a reservation for 7:45, showed up ten minutes early and we were seated promptly. The place was packed, the hostess wasn't kidding, they sure were full. It wasn't surprising that it was hard to get a table, because for a decent size restaurant, they have hardly any tables. Probably 70% of the seating is at two giant bars, one is more of a sports type bar with a bartender, and the other is a sushi bar where you can watch the chefs attempt to make sushi (more on that later). The atmosphere of the bar is very nice if a tad to loud. It seems like it can't decide if it wants to be a high end sushi joint, or a sports bar. And the problem is that the restaurant isn't big enough to effectively be both. So you get the dinner seating right next to the sports bar with loud music playing. There is high quality workmanship and very contemporary/modern design elements all around. I shudder to think about how much it cost them to build it, it's beautiful inside. It almost seems like they're trying too hard to be modern however, as they even use IPads for their POS system. Which sounds like a cool idea, but after observing the waitress try to use it for a while I noticed they don't have a cash drawer attached to them, which means they have to ring up the checks, print out a receipt, then walk to wherever the cash drawer is hidden and get the change. They also didn't seem to work with credit cards too well because they were manually typing in a lot of numbers when the cards wouldn't swipe properly.  All of this would be OK if I didn't run into a headache in every other aspect of our first and last visit to Otaku. Our server was Yuko and she did a very poor job. She took our order, brought us some water and ran away. She only returned once to give us refills. She returned really quickly with our tempura appetizer... too quickly in fact, as we learned that she actually stole another tables app... oops. The tempura was pretty good, although it was quite oily. Once we were done with it, we began the wait for our food... and we waited... and we waited... and eventually Yuko came by to tell us that the kitchen is running a bit slow tonight (no shit). That's fine I thought, it happens. Then we saw her socializing with a table full of drunks and wondered if it was actually the kitchen or her that we should worry about. We decided it was her, when we noticed that a table that was seated after us, and ordered after us, got their sushi ten minutes before we did! All this time Yuko was nowhere to be found. In the long run we ended up waiting 30 minutes after we finished our appetizer to get our sushi.  We only ordered two rolls: a California and a Vegas roll. The final nail in the coffin is that the Vegas roll was cold when we got it! It had clearly been sitting out for a good 10-15 minutes before it got to our table as it was room temperature and chewy. Beyond the texture, there was absolutely nothing special about it, certainly nothing to justify it's 9 dollar price. The California roll was just as generic as well. I've had better sushi at Teharu in Tempe, and it's a freaking serve yourself conveyor belt.   By this point my wife and I were pissed off, so we told Yuko that we were in a hurry and we needed the check. She then gave us the check and never returned. In the ten minutes between getting the check and us walking out cursing the name Otaku, I saw her busy counting her tips and socializing with her table full of drunk customers, who I'm sure she realized were the only people that would be stupid enough to actually tip her that evening.  This place clearly has a lot of kinks to work out, and the lack of stars in this review is all due to Yuko. I don't know if it would be any better with a different waitress, but I don't think i\"m going to worry about finding out. There are a ton of choices for mediocre sushi in the valley and I'm past the point of giving places multiple chances to win me over. I'm guessing all the other five star reviews for this restaurant were from people to drunk to notice how bad it actually is."}
{"text":"Tonight we had the best service,  we had a table of 7 and our waitress was wonderful.  The food is fantastic.   Sashimi was so fresh it was delicious !  We had lollypop, and shrimp tempura, muscles, rolls, and low main.  Great place,  romantic and very clean! Highly recommend it!"}
{"text":"Soft opening, so still working out the kinks. Food was deelish.  Scallop poppers- crispy and spicy; not at all greasy Honey chicken-a little sticky but so good Teriyaki chicken-subtler than other places' teriyaki, but much better flavor and chicken was tender \"tootzi\" roll- bursting with flavor and rolled perfectly Nice touches with cucumber water, upscale Asian decor, unique glasses, menus, plates, etc. Will definitely be back."}
{"text":"Went here on a date for the first time and Lindsay and the sushi chef made th best drink and food recommendations. We had a great time. I would suggest sitting st the sushi bar! The spicy margarita is VERY spicy watch out it's sooooo good"}
{"text":"Otaku has been my go to sushi bar ever since they open their doors in 2010. My best description to others was a high end Scottsdale sushi restaurant located in the Southeast Valley.  The sushi always top notch, the chefs knowledgeable and creative,  the servers friendly,  and the manager on duty making sure everyone was welcomed and happy. Many regulars like myself. Well, no more. All new staff with no clue what is happening around them. Rolls that are good, for a chain sushi restaurant.  Tuna sushi served with a brown-red appearance and for the first time in my life required me to remove the inedible portions out of my mouth. I tried to get to get my bartender-server's attention and after 15 minutes gave up and called to get the manager. Guess who was manager. Kept trying to politely get his attention to leave and after another 15 minutes made a point of placing my credit card on the lip of my glass. Still no reaction u till a new bartender came on an I had to stand up and in a angry voice state I want my check now so I can get the hell out of here. As my check was ran up other customers asked what that was all about and they heard this complete story. For eight years I was an ambassador for Otaku but I cannot and will not  recommend this restaurant since it would be a great disservice to anyone who enjoys good sushi. Good bye Otaku and I hope after you close your doors a real sushi restaurant will find their way here. Sad."}
{"text":"Typically a favorite our ours but last night we got to-go and it was subpar. Sushi was room temperature."}
{"text":"Went here tonight on a date with my BF.  I was pleasantly surprised with the atmosphere, service, and food.  All the ingredients were fresh and yummy. The Chow Mein was the best I have had in years.  The staff was very friendly and attentive.   I would give the one sushi roll, Golden Cali Roll, we got a 3.. it was just ok. The BF liked it more than me."}
{"text":"Very good Asian restaurant with beautiful stonework inside and a comfy patio. Full Asian menu of Chinese, Japanese and some Thai dishes. I had mostly sushi and it was terrific, especially the white tuna on the sashimi salad. I'd definitely come here again. Order the Mio sparkling sake!"}
{"text":"This is the best place for sushi. I have ordered several items and everything has been delicious."}
{"text":"Great find! Had the bento box and tried some sushi. Service was great and very accommodating with substitutions. Everything tasted amazing and very fresh."}
{"text":"This place would fit right into Scottsdale with its upscale looking decor.  Decent lunch options, although the lack of a broiled mackerel option is a little annoying (it's one of my favorites).  The fish was ok.  Decent for the desert, but nothing I can't find at a better price at a place with a little less ambition."}
{"text":"The first five star I have rated. And with a heavy hand, I can say with clear conscious that it is well deserved. Their delivery and presentation of food, drink, tea and sashami are artisian craft. The slices are perfect every time,  rare cuts of seabass and perfectly cured Saba (makeral). Every time is exciting (four times pre-yelp) and this time no different, the lunch special is perfect upper class bento box. The scenery and ambiance is perfect for a blooming Gilbert and Chandler cross roads. The glass patio is a being of magnificent architecture. The only fishy smell you get is from their gorgeous salt water tank.   Coming back now four times more- eight in all- I am happy to say that every time is money well spent. This place is an Arizona oasis for sushi and chef friendly gentlmen who know how to make anything. They make hand rolls and maki any way as requested.   Today I got a free edamame. Thanks to yelp."}
{"text":"Absolutely phenomenal! We came here this evening for dinner and it is hands down the best sushi I've had in Arizona since moving here. Do yourself a favor and order the Chimichanga rolls- oh my gah.  Owner and manager stopped by our table separately to check how everything was going. Both so kind and genuinely good people. I recommend taking advantage of their all-day happy hour on Sunday! Deals on EVERYTHING. We will absolutely be back. Worth the 25 minute drive!"}
{"text":"Fantastic rolls, some traditional and several interesting new ones. Even if you think you won't like the Cheetah roll (because it has Flaming Hot Cheetos on it), try it anyway. It was awesome.  We also loved the Strawberry Cheesecake roll for dessert. Fantastic!  Great service, beautiful atmosphere and the owners are lovely people. What more could you want??"}
{"text":"I had an overall good dining experience at Otaku. Very clean and upscale. The music was a touch loud. Service was prompt and polite. I ordered one of the dinner entrees, the Four Seasons. It was an interesting dish of steak, chicken, shrimp, and fish all served with rice. It was decent, pretty standard Asian cuisine. Next time I stop in I'll be sure to try from the extensive selection of sushi rolls. They looked phenomenal! Restaurant is equipped with a full bar from which I ordered a lemon martini, very sweet and tasty without the bite of the standard dirty martini. Otaku makes for a lovely night out with drinks, good food, and lively music. You no longer have to go all the way to Tempe for a good time! The manager introduced herself since we were first time customers and offered us a discount on our second visit."}
{"text":"Rolls were very tasty. My favorite was the dynamite, packed with flavor. The lover of salmon one was good, but more plain. The firey one wasn't overly spicy.   We upgraded our salmon nigiri pieces to king salmon for $1 more. It was good, but I don't really see how it was that much better. The piece maybe a couple centimeters longer, but not worth a dollar more.  The staff was nice. Waitress experienced."}
{"text":"This restaurant is around the corner from my office, and I'm so glad I found it.  Every time I go here for lunch, the food is consistently good. The atmosphere of the restaurant is beautiful and clean.   The sushi is delicious, and always tastes fresh. Their spicy tuna roll is my favorite.  I usually get the lunch bento box with miso soup and a dish called Seafood Otaku, which contains shrimp, scallops, and mixed vegetables in a spicy sauce."}
{"text":"This place had a great vibe. The restaurant appears very modern and styled well. The service was excellent. Everyone enjoyed watching football from the variety of tv screens. The food was also good. I ordered a rainbow roll which was ok. We also got a chicken curry, squid salad, and chow mein. The portions are very generous. You will go home stuffed and with left overs."}
{"text":"Just alright for me. The ambiance is nice. You can sit at the sushi bar or go over to the booths. I bought 2 rolls on happy hour and let me tell you I was disappointed. I ordered the Tuna roll and the Las Vegas roll. Tuna roll was on the plain side and the Las Vegas roll was just alright. Lacking in a bit of flavor and not on the savory side. This is a reminder for myself to not order those rolls again. My thoughts were that this was better than getting sushi from Safeway, but I've had better sushi at most places in Az.. It's better than store bought, but the question is... is it something I'll go back to?"}
{"text":"I cant figure the 3 star people. This place is a solid 4.5 to me. I am a recently converted sushi fan and this place is great.   My recommendations would be the Cardinals Roll or the Otaku Tiger Roll. The Baked Mussels and Squid Salad are amazing on the appetizer menu. If you're not into sushi go with the French Style Beef Tenderloin has great flavor as well.  The service does leave something to be desired, but the decor is very nice and I didnt have an issue with the prices."}
{"text":"Otaku is so elegant and fun to dine at. Zach the manager is amazing and really friendly. Their array of food is the best."}
{"text":"Always good food! Make sure to ask about the dinner time bento boxes! The only reason I didn't give 5 stars is because of the noise/music levels. Gotta try it!"}
{"text":"The last two times we have been here the service was so slow. The last time we  were greeted (kind of) and the host walked away without saying if there was a wait, how long the wait was, anything! It was so odd. We waited for some time and a different person finally came up to us (and a second family that was waiting) if we had been helped. We told her we were not really sure..."}
{"text":"Good service.  Loved the cheetah.  Save room and go for the cheesecake roll for dessert, it's definitely worth it."}
{"text":"Great sushi and Asian menu! Chefs are always good abt customizations in the kitchen and at the sushi bar.   Very friendly staff, they tolerate and even entertain our children who hang out and run around the salt water tank!   My best friend and I love to share the Hot Pot, Singapore Noodles, Vegas Roll, and King Salmon Nigiri!"}
{"text":"We've eaten sushi all over the valley since moving here last November.  To say the least we've been disappointed...until now.  Beautiful atmosphere, great service, and great rolls!  Very pleased that we've found our new sushi place!!!  I had the moondragon roll and it was amazing!!!  No picture because I scarfed it down so quickly!!"}
{"text":"This place is fantastic, the service is amazing and the food is just as great. I got the Mardi Gras roll and it was incredibly fresh and filling. I definitely recommend this restaurant for affordable and tasty sushi!"}
{"text":"Good sushi and nice ambiance. The modern decor would make this place a good casual date location. The sushi was good and prompt.  The appetizers were pretty tasty too. We will definitely be back."}
{"text":"Third time having lunch here and decided to finally write a review. I wasn't impressed the first 2 times but this time was frankly disappointing. If I am going to pay for high priced food (and their prices are high), the service needs to be better. Our waiter was nowhere to be found during our meal even though there were maybe 3 patrons in the entire restaurant. Our drinks were empty until I got tired of waiting and flagged someone else down for a refill. My miso soup had 1 piece of seaweed in it and hardly any tofu. The waiter suggested a side of rice with my sashimi but didn't tell me it was going to cost an extra $2 and I was charged extra for wasabi that I didn't ask for. Isn't wasabi supposed to come with sashimi and nigiri? Not a happy customer. I'll give them 2 stars because the restaurant is beautiful and the sashimi fish was good quality."}
{"text":"I have been here twice.  The food was  good and both times the service was good.  The server last visit was very helpful with selections with food and beverages.  Not the best sushi I have ever had but above average.  Decor is nice but looking for cooler weather to sit on the patio"}
{"text":"update: We don't like the small portions high prices  less than average service sure the front door people smile, but  the sushi guys, and waiteress ughhhh... They actually try to make you feel like you haven't a clue Hispanic sushi guy didn't know if their eel was fresh water or  salt water, or if there was a difference , his words not mine. I   drove so far I figured  why not my kid got three over priced rolls which were good and to her liking.  I got  some tiny pieces of over priced sashimi that  lay flat on my taste buds, the ponzu is awful, and  the spicy tuna I had to beg to get in a hand roll because they didn't hear me the first time, I spent 100 with the tip.  sorry  sweet child of mine.  no can do. NEXT! We liked Hiro but it's so far from us and a  long long wait. too bad. We will keep trying, or break down and go back to Sakana which is usually what happens."}
{"text":"I love this place.  A tad off the \"normal\" path because it's between two main intersections, but make sure not to miss it.  The have about 15-20 standard sushi rolls you can find everywhere and then 15 or so rolls they came up with, which are amazing.  Highly recommended.  Closed Mondays so watch out for that.  We always go for the sushi, but all of the other food looks great also."}
{"text":"Otaku has THE best sweet and sour chicken.  My husband, who has traveled the world, says their sweet and sour chicken is the best he's ever had.  I love their sushi and have never had a mediocre dish here."}
{"text":"No fish smell, good food, good people.  The main thing you need to watch out in a raw sea food place is the smell. If you feel smell of fish it's because the fish is out there for a long time."}
{"text":"First reason I love this place is the friendly customer service! Someone always opens the door for you when you arrive or leave, and you are always welcomed in and greeted. Great sushi selection and bar layout. Always super clean. The fish tank up front is mesmerizing!"}
{"text":"Well if you like to eat sushi in a loud annoying environment then this is the place for you.   I stopped for lunch and had my usual smoked salmon nigiri that I get at sushi places. It was ok nothing special.   The blaring music and screaming children made me really want to leave.   Does anyone want to listen Sean Paul's \"Get Busy\" while eating lunch?  It's a restaurant.  It's lunch.  It's not a nightclub.    Do people really think that loud music makes a place cool?  Never going back!"}
{"text":"One of my favorites in the East Valley.  Consistent and absolutely awesome food.  The Thai mussels are wonderful, I have never eaten anything @ Otaku that wasn't awesome!  Talented sushi chefs and great service."}
{"text":"Baked muscles are amazing here! Order extra bread as the broth is to die for! We love the Cheeto roll! Try it you won't be disappointed!"}
{"text":"Food was good, the staff was a little over concerned with another staff member that was eating with her friend. The staff member would go to the bar and make drinks for her friend, she would then come back and gossip. The place was not busy, but done be so obvious and ignore the people that are not staff. I don't think ill be back."}
{"text":"My go to sushi joint. Very friendly staff and great atmosphere but most importantly amazing food. Have never been disappointed and always recommend to friends and family!"}
{"text":"Not for me. I got a curry chicken bento box and my boyfriend got honey chicken entree. Mine was very bland and the chicken wasn't cooked well. One of the worst bento boxes I've ever had. My boyfriend's honey chicken also had the chicken gone wrong taste.  The place looks super nice and fancy but man they need to spend some money on the chef too. Maybe their sushi could be good but we're not wasting our money there again."}
{"text":"I've been here before but something must have changed, the sushi was sub-par and service was slow. The ice in my drink melted before they refilled it. When the manager asked how we felt, we told him it was OK, and he walked away. Without the compassion, this restaurant is doomed. Sorry but I will not be visiting again."}
{"text":"We've been here twice and last time we came was a good experience. But this time we came here it was an amazing experience. We came here during the lunch special which we never had. I have to say it was an amazing deal. I will defiantly come here again during lunch. 11 bucks for sushi, rice, a main entree and others. Amazing deal! The servers kept checking up and they held the door open for us when we left. Customer service was phenomenal."}
{"text":"We dine here a couple times a month, because we love Robyn, the manager!  I don't know what this place would do without her.  We would not come here nearly as often if it weren't for Robyn.  She is always going around the restaurant talking with customers, making sure they are having a good dining experience.  The food and the ambiance is good too, it's just that personal service that makes it better!"}
{"text":"We went for happy hour and had excellent service from friendly staff, and an overall positive dining experience.  Sushi was fresh, ramen was tasty, and the tempura was not bad (batter was a little heavy).    It's between this and Rock Lobster as the two best sushi places in South Chandler/Gilbert area."}
{"text":"The restaurant overall was fantastic! My first time going there was amazing. The food was unbelievable. Also, the raw sushi and the sushi was great. The place was very homey and the waiters/waitresses were very friendly."}
{"text":"Guessing from going there and seeing the menu that this is a Chinese run Japanese restaurant.   The Atmostphere is pleasant with a upscale Scottsdale feel. The staff is very friendly, but not overly friendly that they bug you and try to initiate conversation with you every chance they get.   We started out our order with Miso soup, which at first glance looked liked the package miso soup you would get at a Japanese grocery store, but with is quite tasty. Afterwards our orders for avocado roll, unagi roll, spicey tuna roll and my wifes beef chow fun came.  All the sushi was delicious and well prepped. The unagi roll was covered in a very potent Teriyaki sauce which I wonder how it will taste with chicken..perhaps next time.   My wife is a big fan of Beef Chow fun and enjoyed it.   Overall we were pleased with everything, and will make an effort to come back and try other items on the menu.   HOWEVER!...I like to finish off at sushi places with green tea ice cream and they did not have it:("}
{"text":"We came in mid-day during a slow time. Food was decent and service was excellent, the manager even gave us a 10% coupon for our next visit. Only gripe was the server sitting on the counter and sushi chef talking behind the sushi bar the entire time, including during the time while he was making our rolls. We both worked in the industry and perception is reality for the customers. Not sure if the atmosphere of the restaurant is always this laid back or it was because it was slow but we found it unprofessional."}
{"text":"Really cool spot that we found here. Always open to finding new spots and glad we did. The inside decorations are awesome with a pretty nice looking tree right behind the bar.   The cool thing is on the wall behind the booths is all this writing in Japanese it really pops well. The setup is nice and easy to get around with a sushi bar and regular bar to sit at.   The rolls are creative which always catches my attention. The one I loved was the cheetah roll with flaming hot Cheetos in it and on top of it.  Also got the Mardi Gras roll which almost felt like dim sum with what its wrapped in.    Overall we will back to enjoy this place."}
{"text":"Please note, this is my very first review of any kind.. I visited this sushi bar today with my son because he bought a 1/2 off groupon - off we went!  Very nice place, great ambiance... I was impressed, however wise enough to know that books AND restaurants shouldn't be judged on the surface. I frequent many sushi bars and some of the best sushi I've eaten can be found in much less elegant of establishments - don't be fooled!  We ordered 5 maki rolls to start:  2 from their 'signature' menu (firecracker roll and the madi gras roll) I love spicy food of all kinds - the firecracker roll was just HEAT, no FLAVOR, big upset. The madi gras roll was plain and flavorless. You'd be hard pressed to find a piece of lobster in there and they must have run out of cilantro because no tasty herb anywhere!! Keep in mind, these are signature rolls, $12+ a roll.   The other 3 rolls were from their 'traditional' selection.. We got the following: Las Vegas roll - ok, the sushi to rice ratio was about 20/80, not impressed at all. Eel roll - eel?? Where was the eel?  Spicy scallop roll - Zero spice and quite frankly it tasted like mushy rice.. The consistency was way off... Also take note that these 'traditional rolls' are no bigger than a quarter in diameter, very small for almost $10 per roll, ridiculous!!  Our waiter saw my puzzled look as he brought out these rolls and never once asked if there was a problem or how our food was when he brought the check.. Which brings us to $$ Our total was $55 for the most ridiculous lunch I've ever had.. Thanks, or NO thanks to the Groupon, we then owed $25 for really NOTHING more than an upscale environment!  Save your time and spare your disappointment by passing up this joint! My recommendations for great sushi, Blue Wasabi, Sakana and The Sushi Room.  Happy eating!"}
{"text":"Very beautiful restaurant.  They have a very large menu, which is scary...  They have sort of an all encompassing Asian menu.  We had the salt and pepper pork, that was AWESOME!  Also, a couple common sushi rolls that were good, nothing crazy.  My wife had the tom yum and loved it.  Can't wait to go back.  Pricing is a little high..."}
{"text":"Could not believe this place was so close to us and we never knew.  My wife and I went out for dinner and wanted to find somewhere new and interesting.  This beautiful establishment was exactly what we were looking for.  Crab puffs, cheers roll and four seasons seafood were just amazing.  Alex behind the bar was the perfect amount of friendly and attentive.  Pineapple Movoto's were amazing.  Loved loved loved the best kept sushi secret destination.  Let's not keep it secret any longer!"}
{"text":"My wife and I both got food poisoning from Otaku's dirty, overpriced sushi. When I called to let the manager know I was blown off. Won't be returning here in the future."}
{"text":"Very nice presentation of dishes and helpful waitress. Food is a bit on the expensive side... Not worth the price. Spent 25$ and didn't feel full. The atmosphere is great because it's peaceful with the right amount of lightning."}
{"text":"Great sushi!  Get the new Zealand king salmon whenever it is on special.  Chefs will also wow you with custom creations."}
{"text":"This place came highly recommended so my wife and I were excited to try it.  Cute place with very friendly staff.  My wife had a sashimi plate and I had the lunch special Bento box with chicken kastu, gyoza, eggroll, spicy tuna rolls, miso soup, and salad.  Bottom line is food was incredibly mediocre.  A Tyson chicken nugget had more flavor than the katsu!  Two different sauces were available but they were just too sweet.  Portions were also quite small.  The sashimi wasn't as fresh as it could be and my wife began to feel queasy after eating it.  Again staff was very accommodating and friendly but the food itself was so subpar."}
{"text":"the restaurant itself was absolutely beautiful. i loved the interior. decorations, layout, ambiance, everything. i felt like i was in an upscale scottsdale restaurant. the food though wasn't so great. it was lacking flavor and was not satisfying. we ordered the last 2 rolls on the menu, which was the most expensive so we figured it ought to be good. but no, it wasn't! we also ordered the scallop poppers, which wasn't bad, but it had a distinct taste...we were still hungry so we were gonna order one more roll, but the food was so horrible we just decided to leave the restaurant hungry. we went to mcdonalds down the street and that was a lot more satisfying.   i still can't get over how beautiful this restaurant was! if only the food was better..."}
{"text":"Fish was Really fishy ok sushi,Service very was good  sushi bar people were very helpful and nice. Would not come here again"}
{"text":"Went to this place for dinner because one, it turned up on a chirashi search on Yelp. Two, the reviews seemed fair. Three, fusion could be interesting.  My order: green tea, smelt roe maki with quail egg (two pieces per order), Korean Beef Bowl.  My bill with tip: $29 and change.  Pros: Nice building and interior. Good atmosphere. Warm and prompt service.Modern and upscale feel. Generous serving size. My bowl was big enough for two. Sushi was fine.  Cons: Some of the ink on my menu was smeared. Some of the menu items were harder to read. One page came loose from the corner page holders. There was visible grease mark on a couple of pages. The drink menu had a clear smudge from some sauce on it. Not good. Not upscale. Hope I got the only menu with the problems. Need to pay attention to detail.  Green tea wasn't green tea. It was Chinese tea. I like tea. I am not picky. But, a proper green tea, even if it is an inexpensive one, should be clear. One should not find tea leaves in your cup. Tea leaves are fine and expected for Chinese tea, not green tea. Also, a half decent cup of green tea should not have a slightly bitter after taste. It should leave a sweet and refreshing taste in your mouth. I am no tea expert, but I have had enough cups to know the difference.  Rice in my $13.50 beef bowl was the kind of cheap and dry long grain rice you would usually find served in cheap Chinese carry outs. I understand most American audience might prefer and might be more used to long grain rice. But, if your intention is to charge $13.50 for a donburi-like or rice bowl experience, using Chinese or Japanese short or medium grain would elevate that experience. The more sticky and moist medium or short grains smell sweeter; will absorb the sauce much fully and both have much more interesting texture than long grain; giving your diners a more overall satisfying meal. The right rice is key for any rice bowl. It is the foundation. It is half the magic.  The portion of beef was generous. The taste was fine. The pieces were tender. But, some of the pieces were too big. For fear of choking, I wasn't ready to take entire pieces in one bite. Could consider cutting them down to more bite size pieces for the diners.  The dish was name Korean Beef Bowl but the taste and preparation were decidedly Chinese. I found a piece of ginger in my bowl. No big deal. I l like ginger. But, ginger is not too Korean. The overall taste was not Korean.  The manager told me the chef is from Hong Kong. That is fine but Korean need to look and, ,most certainly, taste Korean. It is too bad.  Bottom-line: Fusion is a cool concept but fusion could be tricky. So, if we are going to say we offer fusion, we need to make sure we know how to perfect each of the very distinctive flavors. Otherwise, diners who know the difference will know. For me, Otaku should maintain their focus by offering the very best Chinese and Japanese selections. These flavors seem to be their strength. In fact, if the chef is from Hong Kong, I, say, let him do his or her magic and create a few great and unique Cantonese dishes."}
{"text":"Very high quality fresh fish. A little bit of a random spot but very pretty decor and good food and service."}
{"text":"This place is decent. Unlike other reviewers I found the decor to be over the top and rather...hodge-podge, they have so many different types of materials: marble, tile, rock, paint, carpet, etc. that the place really lacks cohesion ( I'm an interior designer, so it's entirely possible I'm just pickier than most). Their chairs were super comfy though.   I went here with my husband and my parents, since it's down the street from their new place. We went during happy hour, they have a pretty good happy hour menu, but don't have any of their specialty rolls on it. Their specialty  rolls seemed a bit overpriced and some of their classic rolls they made cheaper by taking out ingredients. I've never had a Las Vegas roll with only 3 ingredients or a Shrimp tempura roll with only 2.   All of their rolls with salmon came with smoked salmon, so I specifically asked if I could order rolls with normal salmon and was told I could absolutely do that. We proceeded to order 2 Las Vegas rolls, 1 with regular salmon. We also ordered a Shrimp tempura roll, a Rainbow roll, Gyoza, Honey Chicken and Sweet and Sour Chicken.   When our waitress delivered the rolls I asked her which Vegas roll had the regular salmon, she gave me a blank look and said I'd never ordered that, that the roll comes with smoked salmon, as if the conversation about it had never happened. She also said something along the lines of \"It's hard to redo deep fried rolls\" implying they wouldn't take the roll back. That just really annoyed me, she made the mistake, she knew it and wouldn't own up to it. I didn't push it, because there wasn't that much salmon in the rolls anyway, they were mostly rice, they tasted ok. The Tempura roll was good as was the Rainbow roll (though most of the toppings were shrimp instead of the 4 types of fish you usually get). The Gyoza, Honey chicken and Sweet and Sour chicken were all delicious.   All in all I just felt like their rolls were very cheaply made. Perhaps they should have spent less on the decor and put more into their fish budget. If we came here again it would probably be for the Chinese food and not for the sushi."}
{"text":"Wednesday, lunch. Haven't been here in over a year, due to mixed feelings about the place. So, nice atmosphere. Our server John, young Asian,  guy was excellent. Very accommodating. Started with a California roll, while waiting for the rest of the group. Poorest excuse I've had for one of these, and I I've eaten thousands. Just poorly made. I ordered a bento box  Tried the miso soup, flavor profile mostly warm water. Sent it back, replaced by salad. Mediocre spring mix, with some sticky sweet watery dressing.  So far, 3 down. Gyoza, actually pretty good. Could have used some peanut sauce. Egg roll, ok, a bit greasy. Fried rice, ok, not much flavor. Walnut shrimp was best item of the day, nice shrimp, but coated with an overly gooey sweet sauce. Two others had Singapore noodles, and enjoyed them.  Another had the orange chicken, generous portion, and liked it. Overall, nice space with good service. GET A NEW CHEF, and give more value, or I predict you will not survive in this restaurant atmosphere!!!!!"}
{"text":"This place is fabulous! Great food, friendly staff, and an awesome interior. My family has basically ordered everything off of the menu and nothing has come close to being disappointing.  You will NOT be let down, it was delicious."}
{"text":"I actually don't like sushi so I can comment on the other menu items:  Vegetable Chow Main - the vegetables were very fresh and tasty. This was served with a smaller egg noodle which wasn't bad.  Teriaki Chicken -  Very much like the teriaki sauce which wasn't too sweet. The sprinkled sesame was a nice touch.  The service was good, the atmosphere was nice and four of us ate for $52 (including tip). (2 chowmein dishes, 2 family style teriaki dishes, no drinks).  The experience was pleasant and the portions were good."}
{"text":"Great service. Great sushi. Andrew was the best waiter ever. Never failed and did his job well. I had the summer wrap and Mardi Gras, the rice wrap was not what I expected but good none the less. I'll be returning."}
{"text":"We've been to Otaku several times and have never been disappointed.  We showed up to a friendly hostess, relaxed atmosphere, and short wait.  While I feel the service  at the table is slightly lacking, the food more than makes up for it.  The edamame appetizer is delicious and a bang for your buck.  The lettuce wraps get a thumbs up from us as well.  We've had the Las Vegas and Philly rolls.  Both good.  But, one of our favorites is their unique Cheetah Roll.  It's covered in crushed hot cheetos. Sounds strange, right?  Wrong.  It's amazing.  Do yourself a favor and check it out."}
{"text":"Good food, great portions, super reasonable pricing, nice outdoor seating, jalapeño margarita was gross."}
{"text":"I used to get lunch here with my boyfriend all the time, amazing food, sophisticated atmosphere, quick paced great service. The sushi is unbelievable I highly recommend this place to anyone who loves sushi. The location isn't the greatest but don't let that fool you it's awesome."}
{"text":"Excellent food, charming atmosphere, and great service. Love the rainbow roll and eel roll. Tempura cheesecake and green tea mochi ice cream are both delicious and unique dessert items. Bathrooms are classy and clean. Overall superb dining experience. Take out is excellent as well. Soy sauce, pickled ginger, and Wasabi are all chemical free. Be sure to ask for the fresh Wasabi!  The best!"}
{"text":"I came back here again with high hope that everything would be as wonderful as the first time I was here.  Service: When I first walked in, the young hostess was paying more attention to people who walked in behind us. She left us waitjng and kept starring out the door. As soon as she noticed that they were still making their way in, then she re-focused back on us. She picked a table against the wall and I told her I preferred to sit by the window. I guess she wasn't happy that I picked another one and started giving me a bit of an attitude. I said \"thank you\" while she was walking away and she completely ignored me (trust me she heard me). I did watch her worked for a bit since I sat closer to the door. It doesn't take me long to notice that she hates her job. She carries the frowy face walking around and her attitude was uncalled her.   Thankfully same server recognized us the first time we were here and ended up taking care of us again. Her service was as good as last time we were here, she even remember my ordered. Love her! She is attentive, friendly, and has a great working attitude. If it wasn't for her, I might downgrade my rating to a 2 stars.   Food: when we got here, it was during happy hour. I ordered a Yellowtail roll off the happy hour menu and it was a bit chewy. I probably will not ordered that again. The spicy tuna roll (happy hour) and eel roll (off the regular price menu) were amazing. I highly recommend it. We also ordered a filet mignon dish with white rice. The meat was very tender and delicious.   Rating: I will probably come back here one more time. If things stays the same, I might start looking for another sushi restaurant to go to."}
{"text":"I went there 3 or 4 times using a Groupon during lunch and each time I got the same experience, disappointed by the food.   The restaurant is nice with a long sushi bar, nice drink bar with a lot of options and a nice patio when the weather allows it.  I usually get rolls as they fills me up most of the time. Got 3 different rolls each time and, nope, couldn't find any flavors in any of them, really plain.  I really wanted to feel what was the hip about this place but couldn't find anything close. If it wasn't for the discount, I would have passed.  You probably have much better options around which are tastier than this one, Google is your friend!"}
