{"text":"It's hard to be happy with Otto Mosers if you're someone like me who used to go to their prior E 3rd St location. Walking through that door was like a time machine trip back to the 1930's. Enough atmosphere for fifteen depression-era \"theme\" restaurants. They moved to Playhouse Square and ruined the restaurant in the process. I hope the owners are making lots and lots of money, because that's the only valid excuse for what is in all other respects a major f*** up.."}
{"text":"Great happy hour prices on draft beers. Under $3 for Bud Light!  Can get crowded on theatre nights.  Food is decent, but not necessarily high end fare.  Better as a lunch time option or to sit at the bar."}
{"text":"VERY disappointed with this restaurant....How do u take reservations and then book a private party AND NOT EVEN Notify me that you scheduled this private party. And when we went to find someone to talk to which we think was the owner/manager he was nothing but RUID as hell. Now i understand why this place has received so many HORRIBLE reviews. I'll be sure to tell others NOT to go there EVER."}
{"text":"Otto Moser's is an excellent deli located in the Theater District. It's actually the oldest restaurant in Cleveland; it used to be in a different location (it's in a relatively new space where it's been for 14 years). The room is pretty spacious. There is a bar as well as tons of tables. The owners were walking around the restaurant and serving while we were eating there, which is always nice. I had a sandwich, of which I can't remember the name, that had roast beef and pastrami on rye. It was superb. The meat was perfect. The only complaint was there was more roast beef than pastrami, but that's no big deal. Overall, if you're in the Downtown area and are looking for a great lunch spot, Otto Moser's is the place to go for a little bit of Cleveland nostalgia (there are a lot of old photos on the wall) and great deli food."}
{"text":"My sister was swimming at CSU, and I was in from out of state. About 20 of us showed up at random on a rainy afternoon. Service was good, food was good, atmosphere was amazing. uh-fukin amazing.  I loved 100+ years of pictures of the actors that have passed through and dined here. Eat here. Old world charm."}
{"text":"My husband and I stopped in for dinner before a show at the Ohio Theatre on a Friday night.  The place was completely full....we had to sit at the bar.  No problem, except there was only one bartender.  Almost everyone at the bar was eating, so she had to serve everyone while making drinks for the entire restaurant.  This, of course, resulted in horrible service.  I did not blame her.  In fact, despite being in over her head, she remained quite friendly.  I know restaurants don't want to be overstaffed and waste money, but when you don't have a bar staffed sufficiently, you're only losing money.  When the service is faster, people will drink more.  Some people stopped in for a drink and left because they couldn't even get served once.  And you lose return business when first-timers come in and have a bad experience.  C'mon guys, for a restaurant that's been around so long, one would think you know the basics.  
The kitchen was very slow and unorganized.  The couple next to us ordered apps, salads and entrees.  The appitizer finally came (it was shrimp cocktail!), and was foillowed up about a minute later with their entrees.  The eventually got their salads, but who wants salad after your entree?  Our food was mediocre.  I ordered the chipotle chicken wrap.  There was no trace of chipotle anything on it.....it was a chicken wrap.  It took forever to close our bill resulting in us barely making the show on time.  I don't think we'll be back."}
{"text":"Mediocre food and HORRIBLE service. As soon as we walked in we felt rushed. When I assume it was the busboy that took our drink order (he was wearing an apron  covered in food holding a bucket of dishes) came over to the table he had no smile whatsoever. The two young ones ordered some cokes, my aunt ordered a glass of wine and my mom a water. We had literally just sat down at our table so i didn't have much time to think. i asked if they had a specific type of beer and got a quick \"no\". He didn't let me know what they did have or explain their selection but proceeded to just point to some dusty bottle above the bar. \"That's what we got\" was the help I was given in deciding. i fealt even more rushed and he looked angry so I said \"I may need a minute to decide\". He proceded to stand there and stare at me until I gave him answer. I spouted out the first thing I saw that I remotely liked and he walked away without another word. When he came back with the drinks the cokes were obviously filled too full and when he put them one the table in front of the two little girls he says \"Dont spill these\". I was in shock. Who does this guy think he is? All this time we still havent met our waitress. Finally a woman comes to the table and without introduction shoots right to \"Are you ready to order\". What are these people in such a hurry for? We order and after way too long she comes back to tell us they were out of what we had ordered. In a restaurant that seems like theyre in a hurry to get us out, youd think they would have told us sooner. Im a vegetarian and there are NO VEGETARIAN OPTIONS besides a couple starters (not an exaggeration) I was forced to eat a hummus appetizer that was clearly store bought, disgusting, and over priced. The waitress never came to check on our table. If she was busy I would have understood but she was standing in a corner chatting it up with another waitress. Our drinks were never refilled and when my aunt realized that they had forgotten to bring her coleslaw with her sandwich that came with it we tried to get attention clearly being ignored to the point where I had to shout out a firm \"EXCUSE ME\" just to get this woman to the table. When my aunt explained that she hadnt gotten the coleslaw that was supposed to come with her meal without the slightest apology proceeded to say \"Oh yeah, they were making more and I forgot\" ....really lady? This is your apology? She brought the coleslaw over, said she'd FINALLY be back with some water and when she was walking away she licked away some coleslaw she had gotten on her hand. SHE LICKED HER HAND. 

At this point were just trying to get as far away from this place as possible. We had tickets to a show at Playhouse Square and came to this restaurant besides its right around the corner. This alone schocked us that there isnt a nicer place in their spot. The decor was horrible and not nearly what we thought it would be when we walked into a restauant near Playhouse Square. This place was just a dirty diner and dont get me wrong, I could care less about how a place looks if they have the food to makeup for it. Anyway, to end this horror story she brought our check. All on one, even though we needec it split but decided to just get out and worry about it later. She puts the check on the table and my mom says let me just give you it now and pulls her card out. Right as shes doing this the waitress says \"Ok...as she turns her back and WALKS OVER TO THE NEXT TABLE WITHOUT IT!\" Yes she comes back shortly after giving them ketchup but c'mon! This was the dinner from hell. 

I'm sorry we've inconvenienced you with our sitting and wanting to eat... Waste of money...waste of time."}
{"text":"Ugh. Food took over 30 minutes. We thought we had been waiting the whole time for a mushroom appetizer, but instead our entrees arrived. (yes, Fried shrimp and a salad took 30+ minutes). Three bites in to our entrees, the appetizer showed up. Regardless of the order, the food was just not good."}
{"text":"Excellent deli sandwiches in the theatre district. Very relaxed atmosphere, with many amazing old photos of actors and acctresses - John Phillip Sousa, The Barrymore Family and many others. This is the oldest if not one of the oldest restaurants in downtown! I definitely recommend the Reuben sandwich.  When you visit ask the people there about the unique history of the restaurant and you'll be pleasantly surprised too! Been back quite a few times and will continue to! Opa!"}
{"text":"Let me provide the setting: 

Saturday evening a couple hours before a play....

Now the cast of characters:

The manager at the door taking names and numbers in party has no business a) talking to patrons b) managing a floor in general. He came across rude to us and to others walking in. He said there was a 15-minute wait for a half-empty restaurant that stayed half empty the entire wait and time we were there. 

The staff, including the manager, we in their Sunday's best....and by \"Sunday's best\" I mean mom jeans and disheveled wrinkled clothing. It's not that jeans offend me, or even a polo or something like that....heck, even a t-shirt. It's just like people were taken to the local GoodWill, given 55 cents, and 2 minutes to not only choose and purchase their uniform for the evening, but also put it on. 

Seriously, I'm not a dick, but the guy even managing had that 80's I'm at the bar wearing my British Knights and have a pink comb in my way-too-tight back pocket thing going on. 


Just weird.

Anyhow, the waitress was friendly enough.....but they are slow....very slow. We weren't the only ones complaining. It wasn't a matter, seemingly, of her not caring but just no one knew what was going on.....very very very bad management and training. Food was just OK and the price should be a little smidge lower for the quality of food....let alone lack of good service."}
{"text":"Honestly, I don't know why this place is always packed when I walk by. The one time I ate there, it was cheap and barely edible. Really terrible food."}
{"text":"As promised I gave them another shot, this time I ordered a grilled chicken salad. It was just so so and so mediocre that I more than likely won't be back. The salad was fine I guess, but I expected them to grill a fresh chicken breast and it wasn't. It was just some cold chopped up chicken....meh....I was also a little grossed out when I saw one of the cooks in back thawing out a huge chunk of ground beef in the microwave. 
Oh well - like I send before this place has great potential with an excellent location, but the effort from the owners just isn't there.....sad."}
{"text":"The food wasn't too bad, and the prices were pretty good for being downtown, but they need to plan ahead for when there's a show.  We went here before a show, and the service was the worst.  I won't blame the waitress though, because she ended up having about 10 tables by the time we left.  For those not familiar with foodservice, that's about twice as many as she should have had.  

The menu is mostly sandwiches and salads, which is ok, because we knew that before going in.  I got a Reuben, fries, and cole slaw for $9.99, which is a pretty good deal.  We were thinking of going somewhere else, but prices at other close restaurants were $15 to $25, so we figured we'd give this place a try.

I'd never make a special trip here, especially since you'd have to pay to park, but if I was going to a show again, I'd definitely come back."}
{"text":"Went there to get a sandwich from Moko, but to my disappointment it had closed down.  This place is no substitute.  

Everything about the to-go packaging is wasteful.  The meal was packed in styrofoam - the condiments were placed in a separate paper bag and stapled. It was all wrapped up in a plastic bag.  Each ketchup package contained about enough ketchup for one full onion ring. The mess of a lunch platter in front of me made me want to cry.  

At least the onion rings were decent - I'd say better than burger king.  To set the expectation for the entire sandwich - it was on white bread.  The lettuce and tomatoes were thick and colorful.  No flavor though.  The bacon was crispy and McDonalds-like.  I don't know where the turkey grew up or what his hobbies were, but the flavor was inexplicably not something I wanted juicing into my mouth.  I tried to jazz it up with my own bread and some avacado, but the rest of the ingredients were just really uninspiring.


If you like fried bar food on white bread for $10, this is your place.  I'll pass."}
{"text":"Went before a play. Waitress was rude. We order the stuff mushrooms and mozzarella sticks. The mushrooms didn't taste good and the mozzarella sticks were over done. Would not go back"}
{"text":"Not bad, but not great. Average sandwich shop. Ordered Turkey Reuben and got what you would expect. Wife ordered  crab cakes that seemed that they were taken out of freezer and deep fried."}
{"text":"Otto Moser's has become a pre-show tradition when I come to performances at the Playhouse Square theaters. Prices are always reasonable, and the food has always been good; I have never had a poor experience."}
{"text":"Excellent, fast service, friendly waitress (Diane), and great food.  It's a must in Cleveland."}
{"text":"First time here. Was attending a 2:00 show at the State theatre so stopped here for lunch before the show. Met by a friendly host who took us to a table. Another hostess came by quickly to take our drink order. Then the waitress came. She clearly didn't want to be there. Mumbled, but took our order. To her credit, she got it right: two Reuben sandwiches. One with fries, the other potato salad.

Bottom line: food was good, price reasonable ($9.95 for the Reuben and one side), and except for the waitress, everyone was friendly and attentive. I would go back."}
{"text":"St Patrick's Day and we needed a place to eat. This was like heaven!!  Great food and great service!  Brandon did an amazing job; young man has a great personality and worked his butt off."}
{"text":"Haven't been to OM since it was on East 3rd in its hole-in-the-wall with tons of atmosphere.. We allowed 1 1/2 hours  before a play next door. Barely enough time! Waitress severely overworked. Flat beer. Food was mediocre. Appetizers/salad dressings forgotten. We were not alone.

Need to step it up!"}
{"text":"The only reason this place is still around is because people are lazy on theatre days and go there because it is in the lobby of the theatre center complex.  I got stuck here for a Sunday matinee after parking and nothing else was open.  How can you screw up a cheeseburger?  Over cook the hell out of it and then put it on a hockey puck of a bun.  Corned beef was no better.  This was a mistake I'll never make again."}
{"text":"If this place is only 2.5 stars I got very lucky.  I ordered the black bean burger and it was excellent.  Great flavor and cooked just right.  Nice bun and stadium mustard!!!!    Nice beer selection too.  If I am on the area I am definitely going back"}
{"text":"I just started working in the area and have already had lunch here several times.  The food has been good every time.  On my first visit they had sloppy joes as the special.  It was awesome!  I've had their daily wrap specials and each one has been very good.  To top it off you get a pickle with every sandwich, and it's a very good pickle too!"}
{"text":"Good bar food.  Good service.  After dinner we went to the bar.  Great bar.  Good place to get a quick bite and drinks before a show at the Playhouse square."}
{"text":"Walked in on a Saturday - it was empty (automatic red flag when restaurants are empty) 

Looked at menu outside and saw decent prices - came in and menu was different so that was lame. They stop lunch at 3pm. 

I went to the bar and bartender/waitress greeted me with \"do you need something\" in a snarky voice. I was already balls deep into the restaurant so I decided to stay. I wanted a turkey club but it wasn't on the menu - but a turkey Ruben and a chicken club were - so I asked to substitute the chicken for some turkey and she said no. And I said why not. She said they don't do that. And then she said she'd check. She talked to 9 people until she got the okay. 

Received my sandwich and it was more soggy bread than anything else. Terrible bacon. Maybe 4 slices of turkey. Fries were pretty good, though. 

Finished up the meal and she said \"do you need anything else sweetheart\" which made me feel good. That's the only reason it got 3 stars. I likely wouldn't come back. 

Go Buckeyes"}
{"text":"This establishment was your ordinary breakfast/lunch restaurant. The waitress was able to sit and serve our group of 8 in decent time. Unfortunately, I can't even remember what I ate :( I'm a fan of mom and pop places, especially those that leave a lasting impression in my mind. This place did not. I'm sure, next time I'm up in Cleveland, I'll look for another place for lunch."}
{"text":"Mediocre at best. I went there two years ago and have not gone back since. My salad was a sad pile of spinach with some bland fruit. Waitstaff was very lack luster, and the atmosphere was pretty boring."}
{"text":"Me and six friends stopped here after a show and the manager was disheveled and totally rude to us!  We asked if we  could sit outside but the chairs were all locked up, he looked  at me and said \"do I look like I have time to unlock chairs for you?\"  We were horrified!  It wasn't even that busy!  We walked out and will never go their again!  Their were 7 of us who wanted to have dinner and drinks!  Sure to have been a hefty bill!  Oh well, we went elsewhere and had a ball!"}
{"text":"After seeing a comedy show at State Theatre, I was dying to eat anything.  After not having eaten since breakfast at around 8:00 am, I'm pretty sure I would've been highly tolerant of even the most mediocre dining establishment.  In other words, it would've taken very little to please me on a night like last night.  But, to my surprise, my undiscerning state of mind didn't stop me from having a mostly disappointing experience at Otto Moser's Restaurant.

My order was relatively simple and not at all extravagant: a stuffed mushroom appetizer, a turkey ruben sandwich, and two cans of root beer.  That's it.  What did I pay for that?  A whopping $24.75, pre-tip.  While I have no major complaints about the food, I also have no major compliments either.  My meal was roughly equivalent to what I would expect from a typical greasy spoon diner just down the street, but at double the cost.  Perhaps the only saving grace was that my food was delivered super fast, which was a relief.  But that still doesn't justify the cost.

The service was similarly mediocre.  My waitress, a middle aged woman, was nice enough, if a bit clumsy.  She had to ask me to repeat my order after leaving to take someone else's order and coming back to my table to clarify.  At the same time, she told me they were out of my desired appetizer, but then was corrected by a fellow co-worker who advised that the appetizer was indeed still available.  While this was a relatively minor setback, it seemed to bespeak an atmosphere of confusion in the kitchen.  Additionally, while I appreciated the waitress' attempts to make conversation by asking about who I saw (she was unfamiliar with Bill Burr), the manner in which she asked was awkward, albeit in an innocent sort of way.  The whole interaction made me feel like I was bringing my grandmother up to speed on current events and pop culture.  She later tripped and nearly fell on the floor, although she was a good distance away from me.  Taken together, this made me wonder if she was just having a bad day.

The minor stumbles in the quality of customer service aside, it was the exorbitant price I paid for what was essentially a turkey sandwich that truly left me feeling robbed of my money.  It seems like this restaurant's business model is built around resting on the laurels of Playhouse Square's success.  Despite a lackluster dining experience, it's proximity to the second largest performing arts center in the United States virtually guarantees that a steady stream of customers will stop in at least once enroute to or departing from a show.  It's unfortunate to see such a good location achieve such a level of mediocrity."}
{"text":"I don't know how this place is still in business.  Perhaps touting their years in business works for them though I hope not.  
I stopped in before the radiolab apocalyptical show and, as others have mentioned, the place was nearly empty but the service was as slow as if the place was packed with a line out the door.  Beyond the slow service which I can get past, the food was an abomination.  How one can screw up a burger is beyond me.  You serve them all day every day. Don't you think you could figure out how to make one taste good?  Also, any place that can't provide a soda, aka pop, that has the appropriate mix of syrup and soda should not be in business.  

DO NOT GO HERE!"}
{"text":"I think the 3 stars is the perfect rating for the restaurant. The sandwiches are what they are just sandwiches. Nothing special. Service was fast which is nice if you go during your lunch break. I liked the history of the place but it would be nice if they would explain the history of it. They have old pictures but idk if it's from the restaurant or if they just like hanging old pictures."}
{"text":"In town to see Matilda the musical! We were so excited, mapped out our destination for dinner, made reservations. We landed here...No problem, we were seated right away. Our server was so overwhelmed when we gave her our order that she said \"tip for you, be careful what you wish for\". She leaves, but not before she asks if she can just bring my appetizer with my food because she's having difficulty keeping everything straight. She leaves and we do not see her again. Bus Person brings our food out, in his bus person apron (gross). Then we still don't have our appetizer. Bless his heart, he walks away, does show back up with it, 20 minutes later after we finished half our meal. We sit waiting for our check, an offer for a refill, anything. Nothing. The food was mediocre at best. I have been so excited for this evening that nothing could spoil my mood. Until she comes back finally and says anything else? I said, sure our check we have to go. She says \"yeah, of course you do\", it was so sassy and sarcastic. She snatches my debit card, comes back and tosses my check down to sign. I have honestly never been so disgusted in my 42 years with service like this. Used restroom on our way out, no toilet paper, so there's that."}
{"text":"Hostess and server were kinda rude. We were over looked many times to see if we were doing ok needed refills. The gentleman that brought our food out did however ask is if we needed anything. The food was ok. Nothing spectacular about it. Good if your looking for a quick bite before a show."}
{"text":"We went to see Wicked last night and popped into here for a quick drink before. It is clean, the decor was nice and the pours on our drinks were more than ample unlike other places in cleveland, plus the price was reasonable. I have to say for a first timer, with the old photos on the wall and how packed the place was it must do well. I really liked it and the vibe inside. We hung at the bar, and it's all very open."}
{"text":"I was hoping for a lot more in quality of food from this place located in the theater district. Presentation and taste was much like a late night diner. 

I ordered the special which was Chicken with wild rice and mixed veggies. The food nearly had no taste or flavor. The chicken was edible, while the rice was hard and over cooked. 

The service was decent; as everyone was pleasant and helpful.


This might not be a place for lunch and I hope this was just one bad encounter."}
{"text":"As out of towners, we ventured up on this place almost by accident and a cold and rainy April Saturday afternoon. The place was packed with theatergoers prior to the show. We were sat quickly for being so crowded and had a great experience. Candy (our server) was sweet, the service was fantastic, the food was great, and the drinks were perfectly made.  My brother raved about how incredible the carrot cake was as well."}
{"text":"Had a great time before a show.  Laura behind the bar makes the perfect dirty Martini   Spinach and artichoke dip was great. The chip to dip ratio amazing. Bar seating is always an experience this one is top notch."}
{"text":"Wonderful atmosphere and food.    Laura, behind the bar is a hoot!   Steve and Danny run a tight ship and everyone has a good time.   Definitely well worth a stop if you're in town for show.  Danny runs the front and Master Chef Steve runs the kitchen like a well oiled machine."}
{"text":"As a visitor to Cleveland, I was relieved to find Otto's near my hotel, The Wyndham.  This old-fashioned diner offers straightforward, reasonably priced food.  Service is prompt and friendly, and the decor is comfortingly aged and unpretentious.  At the start of one visit, I was nearly turned away because the server claimed to have so many impending reservations.  This would be an acceptable were not for the 100+ empty seats in the room.  The interaction left a bad taste in my mouth.  There's nothing particularly good or bad about Otto's, but in the context of the dismal state of the restaurants in it's immediate vicinity, this is something of an accomplishment."}
{"text":"While i don't think Otto' s is strictly a tavern or a deli, i' m not going to make a separate entry for restaurant. It is the storied Theater eatery where many famous people have dined over its 300 years in existence(okay, slightly less than 300). The showbiz ephemera makes for an interesting dining experience, but overall the decor was dated and suited more for a Moose lodge(plenty of taxidermied heads, so heads up sensitive vegetarians). Also, the menu is kind of stuck in the year 1958.

I had the crab cakes. They were excellent. The other appetizers were also tasty. Now, here's the rub. It was 2 in the afternoon, and my friend and i were only there for a light lunch. The waitress completely lost interest in us and got a shitty attitude when she saw we weren't going to go all out for dinner and drop a huge tip. Sorry, we're not steak-wolfing Vaudvillians out painting the town red. I guess when you're used to W. C. Fields leaving you a hundred after his liver and onions, two twenty-somethings wearing fleece warm-ups isn't quite as glamorous."}
{"text":"I was recently in Cleveland on business and stopped by Otto's for a drink after work and I was pleasantly surprised. Although they have full bar the wine selection was limited but the bartender who also happened to be one of the owners found the 'perfect' wine for me. I didn't eat at Otto's during my first visit the ambiance was inviting and the service was excellent which is why I returned the following evening. 

Otto's managed to impress me on day two as well. Not only did he remember my drink of choice they also remembered my name. We ordered appetizers and ate the bar the food was excellent and did not disappoint. 

We ordered hummus and spinach cheese dip both came with chips which were obviously home made warm, fresh and crispy. The hummus was perfect not over powered by garlic like some places often do. The Spinach dip was creamy and contained tons of flavor.

I'll be returning to Otto's during my next visit and would recommend this place to family and friends (if I had any)."}
{"text":"Otto Moser Restaurant is a good casual place to eat near playhouse square. I had a soup and grilled cheese that was very good. It's in a good location and the staff is very friendly. It's a nice place to meet someone for lunch that isn't a chain and without spending too much. It closes at seven thirty, but would be a good place to go get dinner before a show as well."}
