{"text":"I have been a regular at this little place for about a year and its a great change from chain restaurants. I love their food, which is somewhere between polish/german/italian and its fantastic! I would recommend it to any close friend. If you go, don't leave without some cookies that are homemade and delicious. I have brought them to holiday get togethers with my family and they are always a hit. Keep them in mind for holidays and catering. All in all, the only problem I have ever encountered was on the weekend they have gotten very busy, but any normal and considerate person would understand. As for the other review, I think it is unfair and dramatic. If you are that allergic you shouldn't eat out, kitchens use onions in everything. I have never had a problem at this place, only excellent food."}
{"text":"Such a great place.  Definitely a hidden gem in the area.  Small family owned restaurant. Everything is homemade, bountiful and SO delicious.  The prices aren't bad. About $10-15/person but definitely worth it.  Our server was personable and attentive. Never had to wait for a refill, food was hot and she was so outgoing that even if the food wasn't as good as it was, I would go back for the staff. Seriously. When I got there, there were about 6 other people enjoying lunch...by the time we left the place was packed. I hope this place is around for years and can't wait to go back!!"}
{"text":"Delicious!  Go here for amazing home made food. Menu has mostly Italian and Polish American dinners, hoagies, pizza, and burgers. They have a bakery counter stuffed with all sorts of sweets.  Honestly I have a hard time not ordering the Polish Trio - home made pierogis, haluski, and golumpki. There are a lot of different fillings for the pierogis, so far all are good. The mound of food they bring you made me chuckle the first time, thinking I wouldn't make a dent, but it was all so delicious I just didn't want to stop eating even though I was way too stuffed!  I'm not much for desserts, but the fruit pies are addictive. If you like cookies, they sell a million different kinds. Well, maybe 20, but there's plenty to drool over.  As to the experience, just expect that you'll feel like you're sitting in your cousin's dining room while they are running around the kitchen banging pots. It is comfortable and homey, which is good because home made food isn't fast food. It can take some time to get everything together when they are busy. I pretend I'm at family dinner, sitting around the table talking, but none of us actually has to cook or clean dishes. Bonus!  There is a small parking lot across the street. The place is popular enough it can be full, but its not all that hard to find something on the street nearby."}
