{"text":"One of the best pho places I've been!   I had a pho with rare beef and beef flank. The rare beef was really soft and tasty and the beef flank was pretty good too. I really enjoyed the broth the noodles were in, really fantastic. The noodles themselves were really good too.  They roast their own coffee there too. I'm not much of a coffee connoisseur but I really liked it. My wife got a milk tea which I like better than the Chatime down the street. Took a bit to come because they brewed it to order. Very strong tea flavour, pretty nice.  The skewers were great too, we tried a lamb and a chicken one. The cheesecake was also pretty good. I haven't had a cotton cheesecake before so I have nothing to compare it to, but I liked it very much.  The staff were super friendly and the restaurant was very clean. I would definitely recommend this place to anyone and will be coming back for sure."}
{"text":"Pho + homemade Chinese dumplings...a beautiful fusion!  Broth is not overbearing with salt, msg, or other artificial flavours. Taste 100% natural, light, fresh and clean. Everyone at the table finished off their broths.  The idea of picking out your own pho toppings as oppose to reading the 50 different combo of items on your typical pho menu is pretty genius.   The coffee is also a must have - fresh bean from South America.   Chicken skin skewer may sound intimidating - but its absolutely amazing. Its light crisp and sweet. For folks who have peeled the skin off, then sneakily place the chicken back in the pan at home..this item is for you!"}
{"text":"Great iced coffee and skewers! We always drop by when shopping at Vaughan Mills. Service is friendly and prompt."}
{"text":"Amazing best soup I ever had amazing skewers best avocado shake I ever had so creamy amazing warm Japanese cheese cake, I'm not a big fan of pho but this was amazing and I would come back here only for pho so impressed found this place on Yelp and very pleased the reviews were right :) 5/5 best pho broth out there"}
{"text":"Discover by my wife in Yelp, we decide to go and have a try.  Be there 3 times this months.  I really like this restaurant.  For Food:  1st and 2nd time I order the special noodle with raw beef with mixed chicken and beef soup, 3rd time with just beef soup.  Broth is pho noodle's soup and this one I drink almost all of it without msg after taste (especially thirsty afterward). Meat quality are good, especially the raw beef in the middle, it is really soft like melting in your mouth.  Actually the 3rd time the raw beef is a bit chewy.    We order grilled skewers, really taste delicious with taste of charcoal.  Worth to praise is their desert and tea:  Japanese Cheese cake are a hidden treasure.  Strong cheese taste than Uncle tetus but texture wise is a bit better than uncle tetus (uncle tetus is already very good).  (BTW, I am blessed to taste their first experimented matcha Cheese cake, taste strong but able to keep its softness and smooth texture.  But too bad, it is not in market yet).  But be sure order at least an hour to two earlier, because their shop is small and it takes longer time, otherwise you will disappointed.  Tea is smooth but with its steepness.  It has a lovely taste of milk black tea's steepness but without a rough texture of normal black tea (such HK milk tea).  The base of the really smooth that if I rub my teeth afterward, I won't feel the left-over roughness.  Service is friendly.  Ambience, the place is roomer but not that big around 8 tables.  Decoration and Atmosphere is quite nice (look like a cafe) and quiet for a pho place.   It is quite nice for a couple to enjoy and eat there."}
{"text":"Ox Noodle has just knocked out Pho Vaughan as my favorite Pho place in the area! It's located two stores or so down from the Chatime in Vaughan Mills.  The thing that drew me to this place was the photo of the Bun Thang in the window. I don't think I've ever found a place that serves this northern Viet dish before and I can't always make the trek to my mom's house for it sooooo I thought I'd give this place a try.   Monday - I swung by the place but it was closed *waaaah*  Thursday - Place was open, but they sold out of Bun Thang!! What deity did I offend to warrant this bad luck !?! The owner said that they only make enough for ten bowls or so :(  Since my bf and i were already seated, we ended up ordering the beef broth Pho, deep fried spring rolls and chicken liver skewers. The spring rolls are a bit small but hey, it's an appetizer right? Initially, when my bf saw his bowl of Pho, he thought the portion was on the small side but let me tell you, once he tasted the broth, he gobbled it all up and said he was mistaken and he was more than satisfied with his meal. (And he can get pretty grumpy when it comes to food not meeting his expectations)  Speaking for myself, I was happy with the size of my pho-- I couldn't finish it because I was so full. The broth was so good that I didn't even need to add Sriracha like I normally do. Doesn't that just say it all?   The owner brought out complimentary squid skewers and they were so yummy!  Other things of note: the menu order form lets you pick the broth style, type of noodles, and protein etc. Kinda neat. Bowls and chopsticks are a little different from the usual Viet restaurants. The soup spoon style is bigger--like the ones you get at ramen places.   Bathrooms are clean and smell fresh! They even have some hooks for the ladies to hang their purse/jacket on in there.   The coffee bubble tea is freshly roasted and is amazing!   Ox Noodle, you are the Next Top Pho Restaurant"}
{"text":"Great place for a bowl of pho.  Highly recommend, we even got freebie appetizer (spring rolls) yum!"}
{"text":"My husband and I came here with friends because we were at wonderland and I was craving noodles. It's a family owned restaurant, they are fairly friend.  You can do combos; Combo A noodles + drink (hot) $9.95. Combo B noodles + skewer $10.95. Combo C drink(hot) + skewer 11.95. If you want a cold drink, it will be a credit of $1.5 that means you get $1.5 off whatever cold drink you choose.  Food: My husband and I didn't order from the sheet and both just got the house special noodles (R) which was filling. My friends got a Combo A which an avocado smoothie (they said it wasn't too sweet, so if you were looking for sweet, maybe order something else?). The broth was pretty flavourful and we were glad we came here.   Interior: As someone said, it was pretty clean inside for a pho restaurant. The lady that served us kept helping us put back the chili oil, and hoisin sauce (even though we weren't finished with it)."}
{"text":"Food was good and meeting expectation for sure. Nice and clean decor, unlike the typical Vietnamese restaurants. Feels more like a Japanese restaurant actually, especially with the Japanese music/songs playing on the speakers."}
{"text":"It's a non conventional mom and pop shop. Looks new and cozy inside. Service is excellent. Tried their beef broth noodle soup. It's very flavorful. You get to choose your own soup base and toppings. Vietnamese coffee is a must try. Freshly roasted and brewed! I highly recommend this restaurant."}
{"text":"The reviews don't lie. I went to this place because of high reviews. Plus I heard they make awesome japanese cotton cheese cakes here! I ordered the pho and several skewers.  All are very good! The pho stock is just perfect for me. Not over powering and doesn't taste msg.  The grilled baby squid are my favourite! I also had the  japanese cotton cheese cake. It was very light , soft, and not overly sweet - perfect cake for me! Staff and owners are also very friendly - great service! I will definitely come back to try the other foods here. Heads up- call ahead if you want to order the cheese cake!!"}
{"text":"I am not sure how this place get 4 stars credit, to me everything is below average and overpriced compare to other Pho places, this place is not authentic Vietnamese style."}
{"text":"This will likely be my first and only review on yelp (yes, that's how badly the food sucked).   Just had lunch here, and it was, without a doubt, the worse \"food\" that I've ever had the displeasure of consuming. The broth of the pho was extra salty, and the beef was simply disgusting (it looked like expired beef soaked in blood to look fresh, and there were even some weird pink colouring on some of the beef). The squid skewer (note singular skewer - $3.5 for a tiny squid skewer with 2 small tiny squids on there) was undercooked (outside was burnt, inside was soggy) and had bits of plastics stuck to it. Sincerely hope to the gods i don't end up with food poisoning and/or terrible diarrhea.   All in all, you've been warned, don't come here. i have no idea why some reviewers gave this place 5 stars. I wish there was an option to give negative stars."}
{"text":"Saw this place a couple of times driving passed and had to try it out. If you've had your fair share of Ramen then the menu concept at some Ramen spots have inspired this place. The server looked to be the owner and she was very polite and welcoming.  Pho was great, the broth was clear and flavorful. Will definitely be back for more. The skewers were a little over cooked but it was free for checking in on yelp so I'm not gonna complain."}
{"text":"First time visiting this plaza where they have a number of different options for Vietnamese. Picked this place as it was quiet - no other customer was there.  Ordered regular pho and spring rolls. Came out to $13.50 before tips. The noodle was not as firm as I would have liked, the broth was salty, and the toppings (rare beef and tendon) were good. The spring rolls were the typical frozen ones you buy at T and T.  Overpriced and underwhelming. I think I will try the other options in this plaza next time."}
{"text":"Meh. I've experienced better.  Came here today for lunch and very quiet (only 2 tables). Waitress could speak Chinese, Vietnamese, and English.   Ordered the Special Beef Noodle in large size. The broth was too salty for my liking. The portions were small. I don't have a huge appetite, but I wasn't quite full with the large size. I like the texture of the noodles and the quality of the beef was good.   The chopsticks, spoons, and sauce plate were quite dirty. My glass of water had fingerprints all over it.   Not the worst, but definitely not the best."}
{"text":"Everything was wonderful.   Tasty broth. Actually rare beef. Bowl was steaming when it arrived which is a good sign. Crunchy and hot spring rolls.  Mango smoothie exceeded expectation for a pho restaurant."}
{"text":"I came here yesterday around 9pm with 2 friends. There was about 3 seated tables ahead of ours, with only one table still waiting in there food. We made our order and while waiting for our pho to come out 3 more pairs of customers got seated. The skewers came out first after what felt like forever. My pho finally came out after about 40 minutes and my 2 friends got there's about 5-10 minutes later. I have never waited this long for a bowl of pho ever. A pair of customers had even left in disappointment before their food even came out.  I don't know if it was just wrong timing or whatever, but the pho was also horrible. The broth (both beef and chicken) tasted like they dumped a whole bag of MSG into it. It did not taste like pho at all, there wasn't even a slight fragrant of it being pho. I would definitely never return."}
{"text":"I absolutely love how you can customize your noodle soup here!   I've been here a couple of times and have tried a variety of different combinations for my noodle soup and each one has been delicious. The side dishes part of the combo they offer were very tasty as well.  The owner here is extremely friendly and always makes my experience wonderful.  6/5 if I could."}
{"text":"This is one of the best pho places in the 905.  The broth is rich and does not use MSG. The meat is good quality, and all the additions are fresh (I've been here a few times and not once have I seen any wilting or browning.)  The service can be a bit slow, but only because they use a real Korean BBQ for their skewers, use real mango (not canned, syrup or powder) they roast their own beans and all coffee is fresh ground. Their milk tea is top notch.  If you want their cheesecake, you'll have to order it 3 hours ahead as they will make it fresh for you.  The family who runs this noodle hide are friendly and sweet.  Definitely a place for pho fans, and people who like quality food."}
{"text":"This spot is pretty good compared to the pho shops around it. The dumpling tasted good and the Pho tasted okay, however I don't think the dumplings really complimented the pho. Individually it tasted good but together it tasted okay. Overall the service was good and food was above decent."}
{"text":"Very good pho! Had the pho with pork and shrimp dumplings and they were my favourite part of the dish. While I was waiting for my soup I was offered a piece of fresh cheesecake straight out of the oven and it was very soft and fluffy. The way the pho was packaged for takeout was also very well done as most times places will give you two large containers and you need to find your own bowl to put it all in. This dish already came in a large bowl and all I needed to do was pour in the broth. Would definitely go again!"}
{"text":"Checked in and waited for 45 minutes so i jus lefted so pissed wasted my whole lunch hour there they need more staff"}
{"text":"Their cheesecake is way better than uncle tetsu's..a must try.  Beef broth is good too.."}
{"text":"I love this family friendly restaurant. They are super nice and the food is amazing. My favorite pho place"}
{"text":"Haven't eaten in this area much, so figured I'd try something out. My friend wanted some noodles, so we went to the first place we found with 'noodle' in the name!  A cute little shop with nice, clean decor. Wasn't too busy and had good service overall.   They had a combo menu and a regular menu, so we went off of the combo menu. Similar to a noodle bar, you have the option to choose your soup base, noodles, and 2 ingredients. For my combo, I got the noodles and drink combo. For noodles, I got Beef Soup, Rice Noodles, and Beef Balls and Rare Beef. Good light flavours, which is a good indication of little MSG. For the drink, I got the Vietnamese Drip Coffee with Condensed Milk. Amazing flavour without being overly strong.   Unfortunately, almost all drinks were an additional $2.50 on top of the combo, which was the only downside. My friend got a Strawberry Smoothie, which was also an additional $2.50.   Service was amazing though. Run by just the owners, husband and wife, they were super nice and friendly. Explained everything in detail, and even gave us 2 Chicken Skin Skewers on the house!  Definitely a good place to get a nice lunch if you're in the area! If you're into coffee, I would strongly recommend trying that drip coffee too!"}
{"text":"My son and I went here one lunch. We were choosing between Ox Noodle, PickoLime or Lucky Bamboo. I personally like Lucky Bamboo because of their lunch specials. But we decided to give Ox Noodle a try. My son had the rare beef pho and I had the hainanese chicken rice. It was just okay -- the hainanese chicken was tiny, and so was the rice that came with it. My son liked his pho but nothing really memorable. There was one thing that was quite memorable though -- it was the grilled baby squid that came with the pho...very very tiny but delicious!"}
{"text":"5.50$ for vietnamese ice coffee??? Over price ,  Pho  is not even close for the price you paid for.  Don't know how they get all the 5 stars came from."}
{"text":"This place is hands down one of my favourite places to eat! I love the whole \"create your own pho combo\" here.   Unlike most pho places, you can customize your pho with several different toppings (You can choose two, extra toppings are $3.50 each). There's also an option to add side dishes to your pho for an extra cost, but it's definitely worth the money. They serve a variety of drinks as well, including bubble tea/vietnamese iced coffee/sparkling soda.    The service here was phenomenal! Everytime I come here to eat, I received friendly service from the lady. She always remembers me, asking me how I'm doing. Overall, the experience here was amazing and I would definitely come back again!"}
{"text":"Ox noodle is great place to eat with a nice calm atmosphere. The food  tastes great and pho looks nice. However this place is different from other pho places since, this location's pho serves thick rice noodles different from the thin version. While also the food is a little pricey compared to other pho places. Overall it was a good experience and i would recommend going here."}
{"text":"Very good place... Quite and friendly people. We had Pho which tasted great... Not too salty and beef broth is flavorful. We also got shrimp skewers. Presentation was better than most Pho restaurants."}
{"text":"This would be the best place to get pho for me. The pho was amazing and I was satisfied and stuffed afterwards. They have a menu that they give you where you can customize your pho and add appetizers or other dishes. I got a beef broth soup with beef tendon and well done prime beef with regular noodle portion. They give out a lot in one portion enough to make me full and the noodles tasted amazing. Would come here again."}
{"text":"The food was at best solid. The coffee was great. But in a location with several other strong Pho contenders, Ox Noodle unfortunately falls short."}
{"text":"Absolutely love this place and everything about it!   The pho itself is delicious with everything from the meat to the noodles being super fresh. The broth is so flavourful that I don't have to add any hoisin sauce in and I always drink every last drop! The sides are fantastic and a great addition to your noodles (highly recommend the squid rings which come with spicy mustard sauce)! The cheescake is also spectacular and freshly made without you having to line up for hours like at Uncle Tetsu's.  The staff are super nice and check up on you to make sure you're doing alright. The establishment is also very bright, clean and welcoming.  I recommend Ox Noodle to my friends every time we're at Vaughan Mills and I don't plan on stopping anytime soon!"}
{"text":"I will rate this restaurant solely on their pho. I have to say the broth is definitely on the oily side but I liked it. For others it may be a dealbreaker. What my complaint would be is how little meat there was in the soup. But I really did like the idea of mixing and matching, choosing your combo etc. For me, pho con bo is still my #1 spot just because the broth is just almost clear and a nice balance of flavors, plus the amount of meat is pretty decent.  This place is just okay for me, but I wouldn't say it is horrible. I think there could  be improvement in how much protein is in the soup. I would probably go back if I was in the Vaughan area."}
{"text":"My fiancé and I had a great experience eating here today. I have eaten pho at different places but this is hands down the tastiest and most filling I've ever had. My fiancé who was a first timer to pho, was a little sceptical about trying it. He enjoyed chicken dumplings and beef in beef broth and I had the special (rare beef, flank, tendon, beef balls, tripe) in beef broth. Although it was a tad more expensive than any other small pho joint it was certainly worth it. We both had the regular size but it was jam packed with meat and noodles.   The lady serving us was very helpful and sweet and also gave us 2 complimentary pieces of freshly made Japanese cheesecake for us to try. We loved it so much we took home a whole cake which was $8. (Tastes must better than uncle tetsu). We also had the freshly brewed ice coffee which was very good. It's very a strong coffee but was nicely sweetened. We would definitely go back!"}
{"text":"I came here for dinner on a Sunday after a day at the farm. My bf and I were the only ones in the restaurant so service was pretty quick.   As others mentioned, there's a set pho menu but there's a option to build your own pho with two toppings for around 10$ and make it a combo with an appetizer for about 3$ more.   The taste of pho here reminds me more of homestyle pho. It tastes very similar to how my mom and aunt make their pho (the anise is stronger), except more oily and salty. For an appetizer I got a lamb skewer and it tasted decent. I would've preferred cumin on it. My bf ordered the torpedo shrimp and it tasted like the frozen ones.   Our bill came out to under 35$ which is decent. I probably won't come back here. The price is higher than other pho places and tastes like my moms cooking... which I can just eat at home. And tbh most pho places allow for customization. I do it all the time without any problems lol."}
{"text":"I've heard a lot of positive things about Ox Noodle throughout the years, so I decided to finally give it a try! I was really excited since this is probably the only 4 star+ rated pho restaurant in Vaughan on Yelp. Sadly, after my visit today, I have to say it failed to meet my expectations.   No, this place wasn't terrible or anything like that - I just didn't think it was worth it is all. With all of the Vietnamese restaurant competition around here such as Lucky Bamboo and Pho Mi 99 (with more affordable prices), I probably wouldn't come back to Ox Noodle.   The menu is very limited in comparison to other pho restaurants since Ox Noodle mainly focuses on its pho dishes and beef broth. None of your standard Vermicelli, Bun Rieu, Bun Bo Hue, or Rice/Pork/Egg meals will be found here. One thing that's pretty neat is that they serve Hainanese Chicken and Dumplings! They've also got some simple apps and drinks to pair with your pho for a combo deal.  I opted for a regular-sized bowl of pho (no combo), specifically A2 on the menu, which is just beef broth, noodles, rare beef, and beef balls. It was good, but costed me $10.75, which is a lot more than your typical bowl of pho from anywhere else in the area.  I also ordered an iced Vietnamese coffee for over $5, as well as a slice of Japanese cheesecake for over $5... Because I guess I was in the mood to splurge on overpriced items. Again, not worth it. I was hoping I'd get some really high quality tastes with the above average price points, but everything was mediocre to me.  The service however was great. There was one lady by the cashier who was friendly and conversational with us. The food came out quick as well! But then again, my friends and I were the only table in the restaurant."}
{"text":"Great pho! The soup is very tasty. Chicken dumpling is also perfect. Very clean restaurent and excellent customer service."}
{"text":"Alright let me break it down for y'all as to why this place deserves a two star, should have been a one star but I will be more generous today.  Came in on Sunday for lunch , wanting to try out this last place in Vaughan that I haven't ate at yet.  Restaurant: small, tables and chairs are disorganized. If you want to maneuver around to go to washroom or whatever the case may be , good luck with that .   Service: not sure how the other days are like but I saw only one waitress and one cook for the entire restaurant as it was busy. The waitress was the one handling cashier, waiting tables and cleaning them. There were people way before us that ordered and were waiting a long time. I saw a couple who sat across from us finally got one bowl of pho after a long wait and the gf starting eating while the bf waited for his. After a long time, I glance back at the table cause me and my bf were also hungry and waiting for pho and appetizer that came as a combo. The couple who only received one of their orders, the bf fell asleep waiting lmaoooo. Anyway we waited about 45-50mins for two bowl of pho and our mini spring roll and fried shrimp.   Food: hmmm, lets say that the broth is just about average, still eatable but not entirely bad. They definitely need to add more Salt or fish sauce because my broth was bland. We both ordered large bowl of pho but the portion put in the bowl was basically a small size.   Price: Expensive af, $56.42 for two combos of pho. I never went to a place that charge that much for pho. But if you are bougie, this is your place.  Needless to say, the wait and price is not worth the time for me or my bf to come back again."}
{"text":"One of the best beef broth I've had in a long time.  Really springy beef meat balls.  Really fresh coffee.  Freshly ground per cup.  The coffee was Strong but not bitter and quite smooth."}
{"text":"Just tried their cheesecake, fresh out of the oven, WOW!  Best cheesecake I've had in 20 years.  I bet it's even better than Uncle Tetsu's!"}
{"text":"Pros:  1). Cleanest pho restaurant I have ever been 2). Free skewer by checking in on Yelp! 3). Close to Vaughan Mills outlet  4). Nice owner  Cons: 1) Really small portion for a regular and I usually get full easily.. Order large!!"}
{"text":"Definitely the best pho of the area! Appetizers(spring rolls, skewers) are also worth a try. Don't miss their Ox roaster coffee. Great food great service!"}
{"text":"Dropped by during the summer for a meal with a friend. The place was recommended and said to have really good pho and food. But I honestly found the food to be lacking in flavour and quality. Sure, the place was very clean as other yelp reviews have stated. The service was good but not too noticeable. The layout was quite small with only 2-3 larger table and 4-5 smaller ones but it wasn't too busy when we went. However, there was one small family with 2 young and very loud children that kind of ruined the quiet ambiance of a small place like this. Why don't some parents ever control or discipline their screaming and rambunctious children, especially in public?   This place had combo options but my friend and I were just looking for the pho bowls and wanted to get an after meal drink elsewhere. We both ordered the same thing - house special rare beef pho. The noodles were good and beef was a bit too chewy but alright. It was the both that lacked sufficient favour - it was way too lightly seasoned. For a pho bowl to be perfect - all three things (noodles, meat and both) must be cooked and seasoned properly. Maybe on the one day my friend and I went in, they were having an off day and bungled the broth? Who knows why the broth was such a miss...  It was also a bit pricey for one regular pho bowl. It came to about $11 total. For that price, I could go to other pho places and get a large pho and a drink, like a milkshake or coffee. Maybe I just had higher expectations after hearing such good things about the place... the actual experience fell short, by quite a lot."}
{"text":"This is probably my favourite pho house that I've ever been to. The rice noodles are so thin and absorbs the soup base so that every bite is delicious.  I love that you're able to choose exactly what you want in your noodle bowl.  The soup base is extremely tasty  I recommend ordering the half tea half coffee cold drink. the coffee here is amazing. Brewed fresh!  The owner here is also such a sweetheart and always chats with you. You definitely feel like a friend when you come in."}
{"text":"A great little place!  Nicely decorated, good service, and a real 'mom and pop' place (I could tell by the little girl doing her homework at a back table).  I stopped in quite by accident. I was stopping at Chatime a few doors down for my daily addiction and decided I should start with a bit of protein first.   Ordering is by checking off preferences on a sheet, so you can really customize your soup.   I ordered my usual Rare Beef Pho, with a Spring Roll. Then as I was checking in with the Yelp app, I saw a coupon for a free appy!  I redeemed it for a Shrimp Skewer.   The Pho was as good as any I have had anywhere else, with a good portion of fresh beef. The Spring Roll was crisp and flavourful, and not saturated in oil.  And my bonus Shrimp Skewer?  I could have made a meal out of a couple dozen if it made any financial sense at all."}
{"text":"Had 45 minutes to kill so stopped here for lunch. Absolutely outstanding and very friendly service first and foremost. Chicken dumpling pho was excellent, the dumpling was perfect. Coffee was fantastic, just the hit I needed as my moka pot broke recently.   Will stop in again if in the area."}
{"text":"The soup was very flavourful.  A little more expensive then some of the other pho places around the area but worth the money.  There menu is very small so their focus is on the pho."}
{"text":"Review solely based on the pho:  The pho is okay. It is better than pho 99 in the next plaza, but that's not saying much.  Offering only pho and easy-to-prep small snacks, their very basic food menu obviously focuses on efficiency and getting food out asap rather than giving patrons an array of different flavors and dishes to try like other Viet restaurants.  You would think a menu of just one dish with variations of toppings for it would mean that they have perfected the broth... Unfortunately I found it lacking in depth. It kind of tasted like instant/ powder broth. The herbs provided were less than fresh, more than half of the leaves were already bruised/blackening. They really load up the noodles, but the meat is a little bit lacking in quantity when the quality is the same as any other place.  For almost the price of another bowl of noodles, they offer viet coffee and an array of other drinks, as well as a heavily promoted Japanese cheesecake. However, $5 for a plain Iced Viet coffee seems pretty steep, especially since you can get it down the street for $3. I had to pass, especially having already had several cups of coffee throughout the day. The lady seemed very disappointed that I didn't want to get it.  It seems as though they are confused about what kind of shop they are. With 'noodle' in their name, they should probably be focusing on making a better noodle dish, not creating an Asian fusion cafe."}
{"text":"we came here on a whim after being turned away from the other restaurant that was packed. Was such a pleasant surprise. very flavourful pho although a bit more expensive than usual  the japanese cheesecake they made is good as well, has a really good flavour, although tetsu's has a better texture. it tastes more homemade but it's worth the price if youre not in the mood to go all the way downtown for this kind of cheesecake.   very friendly owner too! will come back again :)"}
{"text":"I had pho, spring rolls and skewers.   I like how the pho is highly customizable. You can select which greens to be included (eg. onions, Coriander etc) and which meats. The selection of meat is large.  However the portion is quite small. The chicken skin skewer was grilled for too long that it got too tough to chew."}
{"text":"This place is great as always. My fiancé and I come here pretty much every time we are at Vaughan Mills and are never disappointed by the food.  Best Pho and pho broth in the GTA"}
{"text":"Good food, friendly service, typical pho quality.  Also got the avocado shake and it wasn't bad."}
{"text":"Authentic! I wanted to test this place with my mother in law who is from north Vietnam. The beef bone broth is delicious and does not make you feel so thirsty after you drink it. The noodle is higher quality and very silky. The meat (rare beef) is a good cut and very tender. The fresh roast bubble coffee was great too. I redeemed for a free skewer and asked for s shrimp one. It was very flavourful. Will come back again. Owner is from north Vietnam."}
{"text":"The pho at this place is actually amazing!! The broth is really good and complex and I can really taste the effort. I've gotten their pick your own combos and personally for the price I think your best bet is getting their special combination which has everything in a regular pho. As well they have this half tea half coffee drink which is again OUT of this world, they explained to me they roast the coffee themselves which I can tell! And I can appreciate their skewers (especially their squid tentacle skewer) because they are trying to do something different and they execute it well. Lastly, their Japanese cheesecake is great! In my opinion it is not better than uncle tetsu's but still really good and I'm not downtown all the time to line up for one of those. The one gripe I have about this place is the price, not that I don't think it's amazingly justified. It's just pho is usually one of those things I pay 7 dollars for, be full and have a huge bowl after a hangover or etc., here it's not really like that. I don't think the pick your own where u choose two items in the soup which is worth it compared to the special combo. Therefore, if u come here don't expect the whole eat a huge bowl of pho and coffee for under 10 dollars deal. BUT, if u want an amazing bowl of pho, coffee and etc. Don't hesitate to come here because they really are amazing!"}
{"text":"We came here because we want something to eat quickly as we are hungry.  Since it is our first time coming here we didn't want to take chances ordering something we don't know.  We both ordered the Vietnamese beef and beef brisket noodle.  We find the soup is average and very oily.  The portion can be a little bit more for the regular size.  We were comparing the one we normally go to and I can only give 2 stars.  I don't think we will go back there again."}
{"text":"The last time I came I thought it had shut down but they are definately open for business. They still serve the best quality bowl of pho you will ever eat. I ordered the rare beef and tripe noodle. The rare beef is so soft and tender it just melts in your mouth. The tripe is of the same quality. The soup is so rich in flavour. Just love it."}
{"text":"Loved their pho. They gave us the choice of two toppings and you can choose a appetizer, drink or both. The noodles were thick and it was a good portion. We had a lamb skewer with it which reminded us of authentic night market lamb skewers. We also had their ice coffee with condensed milk which was fantastic. The ice coffee had a strong coffee flavour but was also creamy and smooth."}
{"text":"+.5 for service  Interesting noodle place in Vaughan across from Vaughan Mills, so I decided to give it a try after the positive Yelp reviews. Remember I come from Markham and am a frequent noodle soup connaisseur, so I know which ones are good and not.  First thing I noticed when I stepped in is that this place is family owned. Me likey, supporting local businesses! There was another table dining while I was inside, but it was just after the lunch rush (~2pm) so I didn't expect it to be busy anyway. The menu looks similar to the noodle places popping up in Richmond Hill/Markham (think Deer Garden), but it focuses a lot more on the basics. Don't expect your fish soup broth, laksa broth, tomato broth, etc. It's simple chicken or beef broth here. I went with rice noodles in beef bone broth, toppings including well done beef and beef tripe, and a baby octopus skewer.   I will say this, the prices here are quite steep. It's hard for me to justify a simple noodle soup for more than $10, so this had to be beyond excellent for me to return. For me, it was very good, but not excellent. I've definitely had better noodles in York Region, but if you live in Vaughan and don't wanna venture far for comfort food, by no means would I discredit this place. It does its job very well, and you save on gas.  So will I recommend this place? If you live in the Vaughan area, yes. If you're coming from Toronto/Richmond Hill/Markham? I'd skip."}
{"text":"Had the package D with bun and 3 skewers and it was decent for the price. The meat was good and the bun portion was a tad small. Had the coconut water and it was pretty good! Not too sweet and the coconut slices were on the dot. I recommend coming here especially for the prices!!"}
{"text":"This is by far the best Pho I've had! The broth tastes so fresh and very home made. The owners put a lot of effort into their craft and they always strive to be even better all the time. Most of all, customer service is exceptional. The owners are engaging and they really listen to their customers. This is why they are gaining many loyal customers like myself. I always love supporting local businesses especially one that is ran by a nice family like this. 5 star all day!  :)"}
{"text":"I was around the area and saw the good reviews for this place so decided to give it a try. We ordered to Special Beef  Noodle soup which basically had everything in it (tripe, cooked & uncooked beef, beef balls, tendon). The broth was flavourful and the noodles are the more thickly sliced pho noodles. Honestly, best pho I've had in a while. We also ordered the Hainanese chicken rice but I don't think it was as authentic as I other ones I've had. The rice was essentially \"oil rice\" and came with a delicious broth. Chicken had bones in it so not my favourite and also didn't really meet my \"Hainanese\" chicken style, it was more like a regular Asian style chicken. However, overall, the pho really did it for me! There also seems to be a bunch of side appetizers, cheesecake and coffee drinks that people seem to like so if I'm ever in the area, would def come again to try these other items on the menu!"}
{"text":"I saw that this place had some decent reviews on Yelp and was craving Vietnamese pho after going to Vaughan Mills.  I was apprehensive as I got there because the entire restaurant looked empty - it was just before 6pm on a weekend.  When the menu came out, I was really apprehensive because it seemed quite limited and was just a few variations on a pho combo.  I went for combo #3, which is an appetizer, pho bowl and drink.  I don't think the pricing makes sense actually.  I wanted more toppings, but each topping is $3.95 more!? So for the price of 3 extra toppings, you can get an additional combo which comes with 2 toppings!?  They really need to reconsider this pricing structure, because it doesn't make any sense.  There's no special option here (where all toppings are included).  The fried shrimp wonton appetizer was freshly deep fried.  The waitress / owner did not bring out the drink until prompted - she was working both the front and the back!  I ordered the regular sized pho, and I'm impressed with the size of the pho.  The flavour was good although the noodles were too sticky. They need to learn to rinse their pho noodles in cold water so it doesn't clump up."}
{"text":"Came in during Family Day and there weren't any customers inside. It felt a bit awkward at first, but in the end it gave off a home type of feel. The place is quite small, but I echo the sentiments of the previous reviewers: this is the cleanest pho place I have ever been to!  I actually came here because of the positive yelp reviews (bless). I opted for combo A and upgraded my drink to a mango slush, which tasted like powdered slush, but that's fine! It still tasted okay. I checked in for a free chicken skewer. The pho in beef broth was very flavorful. I've never had a better tasting base and I go to pho places A LOT. The portions aren't as big as other pho places, and it's a bit pricier too, but for a fresh bowl of pho? Worth it. The soup wasn't as oily as other pho places I've been to, indicating it wasn't mass made. I will definitely be back!  An interesting observation: the seats are quite low and the table high, so you are at an optimal seating level to eat your pho (my group of friends and I range from 5'2 to 5'5). The washrooms are single stall."}
{"text":"Best pho broth I've ever tasted! The beef salad was also amazing. I didn't get to try the cheesecake yet, but it looks like the real deal.  Owners are very friendly and nice."}
{"text":"Had the classic pho, way too salty. My mouth was begging for water right after. Service is good though. Oh and if you check in on yelp you get 1 free small skewer."}
{"text":"Visited this restaurant when I was around the area. The waiter is extremely friendly. The service was pretty good. I like the design of their menu, it's environmentally friendly.   Ordered pho every time I come here. The pho is a hit or miss. Sometimes it is really good. Sometimes it is really watered down. The appetizers we got with the meal are good. We got lamb skewers and spring rolls. I love the spring rolls here. The crust is crispy but not too thick. It's one of the most unique and delicious spring rolls I've had. I always order it when i eat here.   The white chocolate dome was good. The exterior is white chocolate, inside is ice cream and inside that is lemon syrup. The ice cream is creamy and smooth.   As for the Japanese cheesecake, it's a no no for me. I do not like the texture of the Japanese cheesecake they had. It does not taste anything like uncle tetsus. It's just really grainy. Did not like it at all. Would not recommend it.   As for drinks, I've tried their match made in heaven. Even though this drink has a unique name. It wasn't that good. Didn't really like the taste of it, it was kinda odd.   I've also tried the taro bubble tea. It was okay. It's a little darker in colour than other bubble tea places and more on the bitter side.   Overall, decent place for pho but wouldn't go out of my way to eat here because it's inconsistent."}
{"text":"The pho had no flavour. It was basically hot water with pho noodles and meat. Not even worth your money. I got the squid skewers and it had no flavour. The only thing I can say was good was the coffee."}
{"text":"We were in the Vaughan area and had a craving for pho noodles and low and behold there were three, maybe four Vietnamese restaurants in the same plaza to choose from all in a row but which one?   Ox Noodle didn't make it easy nor was it the most intuitive choice to find pho but we were glad we picked them.  Very nice decor and spacious atmosphere for our dinner date.  We were greeted by the friendly owner who was very accommodating and inviting.  Ox Noodles offers both the standard pho menu with numbered food items but also has a separate questionnaire style menu for your very own customized bowl of pho!  We ordered the house special in beef broth and some good ol deep fried spring rolls.    The noodles were nice and fresh and the soup was great! The spring rolls were on the small side but were quite tasty.  Probably one of the best pho restaurants in Vaughan and so far better than the neighboring competitors.   We will definitely be back - great job!"}
{"text":"Food was good but expensive for the quality. I could easily walk into another Vietnamese restaurant and order the exact same food items for half the cost and taste. It's nice they give you a free skewer for the check in but that's still not worth the price."}
{"text":"It is a family own restaurant; the menu is simple but they do well in each aspect.  Service: Friendly service. Although only one server is working, the service is attentive.  Food: Vietnamese Soup Noodle with good quality broth and meat. I would drink all the soup.   Grilled Skewers are very delicious; my favorites are grilled baby octopus and baby squid.  Homemade dumpling is delicious with secret sauce.  Fresh roasted coffee is creamy and aromatic.  Japanese Cheese cake is on the secret menu; you will need to order well ahead of time. The freshly baked cake is strong in cheese flavour and fluffy."}
{"text":"Coffee is wired since they make it very sweet and I don't take any sugar for coffee. I had pho with beef balls and raw beef, the portion is little and taste normal. Chicken wings skewer is not well made."}
{"text":"I've been to so many pho places from downtown Toronto to newmarket and this is my favourite pho place of all time. You have to try their broth before putting all your faves in! It is sooooo delicious on it's own! The waitress was super nice and we basically took every suggestion because she was so persuasive! The menu was definitely not like any menu I have seen before, you can choose your own combos and meats! Other places either have all or no substitutions but this place lets you create the perfect pho that you want. The dumplings that she suggested was amazing! So yummy and I believe they are made in house! Next time, will try the cheese cake when we are not full!"}
{"text":"I think I've given up on the whole idea with Vietnamese restaurants opening up in Vaughan... It just never works out, or tastes good. + Overly priced   I wasn't in the area but only 20km from here because the first place I was going to go to was closed when I go there... (not sure why)   So i gave this place a try. After reading great reviews and with 4 stars it should taste great! I was wrong.   The broth was oily, and had little to no flavor at all. We had to add salt in it... Like uhh   The good part is that for $10-12 bucks you get proper portions of noodles, and meat. (very stingy on rare beef)   The combo deal with pho+appetizer.. came out with two thumb sized spring rolls lol   and i checked in and got offered 1 free lam skewer which was super bland.   I don't think i'll ever be back. Not for water tasting broth.   I'm just wondering if all these good reviews are even real hmm..."}
{"text":"This spot changed the way I looked at a Pho Shop. I thought they sold Ramen... the name was different didn't have the word \"Pho\" in the name. The Bowls were different, the spoons were different, the customization of your Pho was different, and they were so different that it makes them unique and amazing!   I had combo #3 the custom Pho Large bowl with rare beef and beef flank, chicken wings, and the freshest Mano smoothie... the food was on point and walked away full... how can I forget the dumplings... amazing.  Honestly everything was amazing from the service, the food, the experience as my first time going. Definitely excited to go back for the cheesecake and the coffee...  Can't find anything wrong about this place. Can't wait to come back!"}
{"text":"Make sure you order the Coffee! They even has their own roast! Fresh ground make and order!  The Pho itself though smaller in size but was delicious. The broth has good depth and flavour.  And even a complimentary spring roll!  Though the menu selection is much smaller the other pho joint in the same plaza but the quality of food make up for it! It works like self select combo with the choice of soup based, noodle and toppings! Upgrading to different drinks will cost you more!  Highly recommended as it is more like a fusion restaurant instead of traditional Vietnamese restaurant."}
{"text":"Ox Noodle is a small Vietnamese restaurant in the outdoor mall areas right outside of Vaughan Mills Mall, where Levant Restaurant used to be. I've been here twice now and really like their noodle soups. The ordering system is super convenient. They provide you with a pen and paper with checkboxes and prices. Once you order, they come by and highlight everything you ordered, which seems like a bit unnecessary but whatever works!  We usually order dumplings as appetizers. I usually order a noodle soup (comes with 2 toppings) and smoothie. What I like about the paper ordering system is that it gives you the option to exclude ingredients, for example you can ask not to include cilantro if you don't like cilantro. I usually order a mango smoothie, which is super tasty. The noodle soup is really good as well, and is one of the better ones in the area."}
{"text":"The food here is Okay, but overpriced for what it is with nicer decors compare to other restaurants. They also charge tea for 6 bucks while other pho restaurants give for free. This is the most expensive pho I have ever been to. The regular size pho is 10 bucks. This already cost more than the largest pho in other  pho places. Would I go back? Definitely not. The other pho places nearby have same food but charge half price."}
{"text":"Very good food.  Pho has a good clear flavourful broth and not too salty.  The beef inside is cook well."}
{"text":"After some shopping at Vaughn Mills I was looking for a quick bite before continuing my shopping. That's when I came a across this little pho place.  The staff was very nice and likes to converse with their customers and make sure everything is going well. The ordering method is similar to some other soup restaurants like Deer Garden, whereby you check off boxes on a pre populated paper. I ordered the combo which includes pho, a side dish, and a drink. This combo was 11.95 and I got a premium drink for +1.50, pretty decent price for what I got.  The pho it's self I found to be simply wonderful. The soup base was delicious and flavourful, the noodles were just right, the toppings were good as well- beef balls and beef slices.  The side dish was nothing special in my opinion, I got the spring roll - they were ok. I didn't expect much from the sides so I was ok with this.  In addition they also roast and brew their own coffee. I tried the ice coffee and it has a pretty strong coffee flavour- which I personally like but I can see how it can be over whelming to some people.  Definitely worthy of a visit if you're in the Vaughn Mills area."}
{"text":"Good broth, tastes home-y, can tell there is less msg than other places and has a deep bone flavour. Noodles are fresh and not bloated. Meat is fresh and from good cuts. My only regret is that the portions smaller than Im used to at the pho places around north york and they dont have spicy pickled peppers.  we had lamb, chicken skin, and chicken 'tail' skewers. would recommend the butts- er tails. Skins are good too. tastes like charcoal honey garlic and its crispy. a bit oily but thats expected.  had green tea cheesecake freshly baked. good texture and strong matcha flavour. good portion of eggs.  the lady that served us was nice and had good small talk.   the end"}
