{"text":"If I could give it no stars I would. The food here is absolutely terrible. When I looked at the guy and told him how awful the food was he just looked at me like what do you want me to do about it. I threw the food in the trash and will never eat here again."}
{"text":"This is the best BBQ I've had in Vegas. Customer service was great and the food was filling for the low cost. Get the pork chops!"}
{"text":"I had the fried chicken with yams and Mac and cheese. The Mac and cheese was watery and tasted like pepper, the yams had no taste and the fried chicken was ok. I went there around the time they opened and the owner was there and the food was great but the woman was there that time and the food was so not good. Not real soul food... KFC is better."}
{"text":"I was going to give them a try until the guy was picking his teeth then took the meat out without washing his hands and the female kept wiping her nose with her hands then went to serve me. I told them that i couldnt order from them because they were touching there faces. They told me who gives a f*** and. I dont have to serve you."}
{"text":"You know what?! Its just too bad that this place got a 2star rating. My personal experience here was great. The picture of the man on the menus and on the store front is the man cookin' & servin' the food. The food was not only delicious but his hospitality made it so much more enjoyable. We had deep fried catfish w/ glazed onions, collard greens and delicious candied sweet potatoes. Everything was cooked perfectly. I would definitely eat here again."}
{"text":"Terrible old food. Terrible customer service. Small old portions. Nasty food that is very old. Different prices every time you go. Its run like a business from the hood. They don't respect the customer. Owner is old and grumpy. Stay away"}
{"text":"This place does not have the ambiance of Lucille's, of course - it's in a food court.  But, I was very happy with my order.  I had a three piece rib combo (which came with four ribs), greens, and mac cheese.  The ribs were tender with a nice smoke ring and plenty of meat.  The owner and his wife were very friendly."}
{"text":"I had the catfish plate with mashed potatoes and cabbage Was yummy. Went back for seconds. Great customer service. They were just opening when I got here, had to warm the food but was still great and tasted fresh. The owner was present, which was great to see"}
{"text":"I don't go to a mall food court demanding a high-class dining experience.  The food here was good.  For $8.50, I got 2 meaty ribs, yams and greens. Really good portion of meat for the price. It was flavorful and satisfying. The sauce was sweet and spicy. Was it competition-level BBQ? Heck no. But I'd eat here again."}
{"text":"My husband and I went today I am sorry to say not impressed this food had been sitting out for a long time the chicken was all dried out and the mashed potatoes had no flavor but the lady was very nice"}
{"text":"2/9/15 6:39pm -Terrible from the moment we arrived! Lady working there had the WORST customer service you could ask for. No how can I help you, are you ready? Nothing, I had to ask to order food. Ordered pulled pork sandwich and 2 pc. chicken for my wife and expected it to be like it appears on the pictures. The bun was replaced with white bread making it impossible to eat.  Are you kidding, we went up for a refund on my credit card for my $5.99 sandwich because it was already a bad experience. Opens up register gives me $5 back. I said well, that sandwich was $5.99 so I know I get at least $6 back and it was on my card. She then argues with me? Not only that, when giving me my food, she opens up the straw dispencer and hands me a stray (unwrapped). Then to put the icing on the cake, she hands me plastic fork with her unwashed hands  (unwrapped) for my wives food. This lady does NOT belong in the food industry. PLENTY OTHER OPTIONS IN FOOD COURT, PLEASE, STAY AWAY as I'm discusted with P'Dubbs BBQ."}
