{"text":"Just tried a pepperoni & mushroom calzone. Great taste & my new #2 comfort food place.  Calling all veterans to help support one of our own."}
{"text":"A great drop-in and dine place. My fiancé and I visited because we couldn't decide what we wanted to eat. This place has everything from burgers to pizza and, of course, kabob. We got a small pizza to go with our kabob plates and it was so worth it. The pizza was simple yet so satisfying. The kabob plates were full of flavor! The beef kabob plate was thoroughly seasoned and comes with a salad, grilled veggies, hummus, pita bread, and of course the kabob itself ($10.99). All the items we looked at were priced just as reasonably. The service here is also great. The server AND the cook both took the time to cater to whatever we needed. They checked up on us often. They were super kind and friendly. The environment is also really clean! I definitely recommend this place for when you've got people who are craving different things. I'm definitely coming again in support of this local business!"}
{"text":"The wife and I love Kabob and the kids pizza both are extremely delicious, will be back for sure. Super friendly staff."}
{"text":"Hardest working guy in Vegas! The food was great, service was amazing and all by himself? That's crazy! Highly recommend and will be going back!"}
{"text":"Great service and food selections, Italian and Mediterranean, Tabula, hummus, salads, Lamb, beef, chicken sandwiches and plates. very helpful staff, chef is great at cooking. will definitely be back very often, large selection of food and Pizzas. Affordable prices."}
{"text":"I have ordered off eat24 about 5 times now.  The food is fresh, not greasy (not even the fried food is greasy) and everything tastes natural and wholesome, not processed.  The pita bread is great but goes stale within hours sometimes. Some of the items I have tried are completely addicting and I could eat them every single day.    I would love to give this place 5 stars but with every single order there has been something wrong or missing, usually minor, but the last order a couple of days ago did not have the extra topping I had ordered (and paid for!) on my pizza, which left the pizza kind of bland and just simply not what I had asked for, so I didn't even want it anymore ($ wasted).  Again, fairly minor but hugely disappointing.    Food is great, but this place would probably be better in person so if there is a problem it could be corrected right away."}
{"text":"Palm pizza & kabob just opened close to my grandparents house. Their employees are friendly, their prices are very reasonable and their menus have a large variety. Their subs are delicious and their chocolate cake was amazing. I recommend this new joint to anyone on the eastside of town."}
{"text":"Eating here for the third time in three days!  My wife had the wings again as she was craving them. I tried the Beef Kabob plate. I know absolutely nothing about kabob's so I really don't have any reference to judge them. That being said, I found them very tasty. A little bit of zip to them, but not overpowering. I'll definitely have them again. I'll be trying the chicken too at some point. The hummus is real good. Not runny, not too pasty, a real good consistency. Still 5 star!!!!"}
{"text":"Excellent service very friendly, Chicken Kabob was very good, portion and good price, spaghetti and sauce was good meatballs ok,  unfortunately the pizza was not good and kafta kabob and rice was extremely salty. Could not eat it. I will give it another shot for chicken kabobs and next time I will try the wings people always deserve another chance. I hope it's better next visit."}
{"text":"8/17/2017  I've stopped in and eaten at the 719 N. Nellis location 3 times.  I ordered Lasagna which was ok.  I've ordered the Gyro with Lamb and it was really good and the ingredients were fresh and I would order it again.  The place is small, clean, and is new to this area.  The food is reasonably priced and was served quickly.  I would recommend this place for a quick bite to eat.  They are located behind Arbys and hard to see from Nellis.  I plan to return and try other items listed on their Menu."}
{"text":"Ordered for the first time. Ranch chicken pizza, Parmesan wings, and Cesar salad. Delivery on time. Food really good! I will definitely order again. I feel confident I will enjoy other items on the menu. Seems this place is known for the kabobs. My second time around I tried the shrimp and breaded cod with potato wedges. So good!!! I love this place and thanks for the cake Palm pizza"}
{"text":"I live and work by this restaurant, super friendly staff and great prices! Food is always fresh and high quality, salads and the humus are delicious! I'd take this place over Napoli's pizza anytime! I'll definitely be back!"}
{"text":"Great food. It's so nice to have a Kabob option on the East side. Gyros, hummus, kabob....all really good. Try it, you will like it!"}
{"text":"The pizza was very good!  The wings were great as well.  We will definitely buy our pizza from Palm Pizza again!!"}
{"text":"Delivery was nice. Fries had a bucket of Salt on them. Me and my brother gagged!!!Hummus wasn't fresh. Your sausage  pizza was rotten. Tasted like Mold...Terrible terrible food!!!!"}
{"text":"Tried this based on Yelp reviews. We had the meat lovers pizza and wings. Pizza was really good. I didn't care for the wings, but probably would have liked a different flavor better, they were a bit bland (mild). Look forward to trying the kabobs. Glad to have another good choice for food  over here on the east side."}
