{"text":"We ate at Paloma for the first time tonight. Previously I had sampled their tostadas at the Crossroads Market. Both meals were very good! The service was fast and friendly and the main dining room was very cheerful. Dinner and dessert for my husband and I I came to $32 before tip. I had the fish tacos on special and they were very tasty. I liked the spicy chipotle mayo on them. The portion was very generous - rice, refried beans and three tacos. There is a wide selection of Mexican sodas and desserts too. There is a lounge next door, but we did not check it out.   It's so good to eat real Mexican food again! We will be back to try something new!"}
{"text":"Paloma is one of those great restaurants that one could drive past over and over without giving it a second look. While it's certainly not in one of the most scenic locations (close to Whitehorn station) that is all forgotten once you step inside. I went on a Saturday night and my first impression was that the atmosphere was very pleasant and comfortable. Then I sat down and grabbed one of their complimentary, home made tortilla chips and dipped it into the neighbouring bowl of what could be the greatest home made salsa I have ever been privelaged to taste! Feeling not too adventerous, I ordered the Beef Fajita and devoured the hell out of the dish. Oh and I also tried the guacamole that my friend had ordered - it was exquisite! In November they are having a tequila and live band night that ought to be a blast, so I'll definately be back for more. If you like Mexican (and they also have a few Chilean dishes) do yourself a favour and go here! This is one of those rare places you can spend 3 hours in with your friends without even realizing how the time flew by. More than just a fantastic restaurant, but also a great experience!"}
{"text":"I went for a birthday and I was glad to have authentic Mexican and it was a good value."}
{"text":"My husband and I had discovered this restaurant at 2012's Fiestaval in Red Deer where we live. We had GREAT tacos there and took a menu home with us since we were back and forth to Calgary so often. We are from San Diego and I'm Mexican so we KNOW what REAL, authentic Mexican food is.   We finally got a chance to go to this restaurant yesterday (5/4/13) and I'm sad to say we were beyond disappointed! We were super happy when we were automatically served homemade chips and salsa. The chips were fantastic and the salsa was spicy and so yummy. But that's where our good experience ended.  We waited 20 minutes for our menus. Then we waited a half an hour for our food. SInce we had such a great experience with the tacos previously, I ordered the 3 taco platter of carne asada that came with rice and beans. All that came on the tacors were white onions and cilantro with the tiniest limes that were dry and had no juice. I wasn`t asked if I wanted a specific salsa or guacamole and was actually charged for a side of guac. The rice had no taste what -so-ever and the refried beans tasted like they came out of a can. I can make better food at home for less $!!  My daughter had the chicken quesadillas and I tried them. They were bland. My husband had a carne asada burrito and 1, it had rice in it and no guacamole. Again, we were charged for a side of it. He said it was okay. Mexicans DO NOT put rice in burritos and if you ever get rice in your burrito, they are using it as a filler so they don`t give you more of the good stuffl like meat!  In this restaurant`s defense, it is a CHILEAN restaurant. If this is chilean food, I`ll take good Mexican anyday! We won`t be going back. A HUGE disappointment. On top of the boring food, the service was horrible, the waitress didn`t know the menu and we weren`t given basic things like menus, napkins, silver ware, etc. For Canadians, I`m sure this palce is great because you don`t know better. For us, it was AWFUL."}
{"text":"This is the closest to a \"real\" Mexican restaurant that I've found in Calgary. I lived in Austin for years before moving to Calgary and I have truly missed the restaurants there.   I knew I would love it when they brought a free basket of chips to the table. Oh and they were REAL chips cut from tortillas and fried....not bagged chips. We had a creamy dip with them instead of a classic salsa. It was very reminiscent of Chuy's creamy jalapeno dip (in Austin) and it was DELICIOUS.  Paloma has an $8.95 lunch special Tues-Saturday. Today it was the Taco platter. I decided to shake things up and try 3 different tacos. All were delicious and served on two corn tortillas with a side of rice and beans. I decided to leave off one of the tortillas on each taco because I was STUFFED.  I will definitely be making the trek to the Northeast frequently to visit Paloma again in the future. Oh and btw....it was empty at lunch. We should throw this place some love so that it sticks around!"}
{"text":"I had no idea there was a Mexican / Chilean restaurant in Whitehorn! The place is nicely decorated with Mexican and Chilean paraphernalia, hats, ponchos, very brightly decorated. They serve you tortilla chips with a mild spicy green sauce. There's two menus, A Chilean and a Mexican one. I sampled from the Chilean Menu, had a Chacarero (steak on a bun with mayo, guacamole, green beans and tomato) served with a tomato and cilantro salad on the side. my girl had the Flautas (chicken taquitos, refried beans with rice) for dessert we had a nice sweet raspberry cheesecake with Cajeta (dulce de leche) and Caneladas (baked sweet chips presented With vanilla ice cream, drizzled in honey and powdered with cinnamon) absolutely to die for. Reasonable prices, quick service, just another little gem in the NE for you to check out. 2 min walk from Whitehorn Station."}
{"text":"Great food great service I would give it a 5 * but the bathroom is nasty just like mexico"}
{"text":"I couldn't possibly love this place more!   We went on a Friday night and it was dead but this restaurant should be PACKED! The service is wonderfully warm and friendly, the food is flavourful, and the prices are great.   I can't remember everything we had but it was my boyfriend's first time enjoying mole sauce and he was blown away! We also had the prawn appetizer and it was to die for! We stuck to the mexican portion of the menu and could not have been more pleased.   Paloma is the kind of place you want to go back to over and over again! We went out for dinner the following weekend and I found myself wishing we'd just gone back to Paloma!  If you like Mexican, try Paloma!"}
{"text":"Great service, we came in at 9pm and didn't realize they were closed, but we were still accommodated. Very prompt service, very good food. The chips with fresh salsa was good."}
{"text":"Is it possible to have real Mexican food in Calgary? It's been hard for me to find some real good tacos for a while now and Paloma does not disappoint. The portions are good and Jarritos are not over priced.   For a good down to Earth family experience, go to Paloma. I've had just about all the popular Mexican eats in town and Paloma is as authentic as it gets."}
{"text":"I found a new favourite place when it comes to Mexican food in Calgary.  There was 8 of us in our party because it was to celebrate my fiance's birthday.  We all were new to the place and we all agreed the food was fantastic.  The service was good and people were friendly.  The atmosphere was nice and casual.  Where they really shine is the great tasting food.  I had the enchiladas.  It came with rice and beans.  I ordered a side of guacamole because I love the stuff.  Quote possibly the best guacamole I've tasted in Calgary.  A couple of things I could suggest.  The chips seemed a bit hard and chewy (possibly because they had been sitting out for awhile) and were a bit oily.  They still tasted great though.  Also the paella seemed a bit too dry and quite expensive $45 (enough for 2 people) for what you got.  There didn't seem to be enough seafood in the dish.  I will be back for more good food though!!  ---Update 2013-11-06 ---  I have down graded this review to 3 stars (previously 5-star).  We arrived at the restaurant on a Wednesday around 6pm.  Upon arrival we saw the lights were all off and the restaurant was closed.  There was no sign indicating why they were closed or even an hours of operation sign on the door.  Bottom line:  No matter how good your food is, if you can't rely on the business to be open at your time of need (suppertime) then it could ruin your whole evening."}
