{"text":"it took approximately 5 minutes to make my pastrami sandwich with fries, coleslaw and a dill today.  it was also the same amount of time it took me to eat it all.  everything tasted very fresh and yummy.  the meat, fries and even the coleslaw was made very well.    i have to say, the sandwich was pretty small.  for a little over $12 for the meal, i was hoping to get a little bigger sandwich and/or a bit more fries.  i could've easily finished 2 plates without any problems.  maybe i eat too much or a bit too fast, but it was a pretty small portion.  the meat from other places will usually overflow the plate or it will stick so much out of the sandwich that it will resemble a very tight t-shirt on a very big person.  this place packed just enough amount of meat into the little slice of rye.  nothing was sticking out and nothing was really overflowing.    i think the size of sandwich is a little smaller than most places and the price is in the high end.  if they reduce the price and/or gave a little more fries, it will make it so much better.  will i come back... if I'm not too hungry and in the area, i might just stop by."}
{"text":"My first few meals from this place were all great, lately my last 2 visits have been disappointing.   1. Last time I was there, I bought the special to go - fries were undercooked.   2. This time, cashier made my sandwich with his barehands without washing them after cashing out the customer before me.   3. This time, my sandwich was TINY. Please see my photo with a fork for scale. This was 1/2 a sandwich, sorry i inhaled the other half in 2 bites before I remembered that this needed to be yelped. This is a finger sandwich, and these sandwiches aren't cheap at $8.50 a pop. So disappointing."}
{"text":"Great little gem that I just recently discovered.  I had a huge craving for a nice meaty smoked meat sandwich,and just happened to find this place on yelp.  Very friendly staff, food was not overly fancy or complicated, but really hit the spot.  Awesome place that I would definitely stop in again if I'm in the area"}
{"text":"Reading the reviews I was anxious to have the pastrami sandwich, so come Monday I hold back on my breakfast with the expectation for a great lunch and drive to Pancer's Deli just to find out they are closed on Mondays  Oh we'll - had to go somewhere else  - I did BBQ - wow that was a mistake - but this is for another review.  So anyway I got up this morning with the anticipation for lunch and was at the deli at 12:30 sharp. Ordered from the \"today special\" pastrami on rye and asked to extra large it with a Kayser bun.  The special came with a pickle, slaw and French fries, only after ordering I found out that you can sub the fries with potato salad.. Ok maybe next time  Started with the pickle - sorry guys but good pickle need to be crispier (much) the one I got was mushi - taste was ok  The slaw was good and tasted bit on the sour side - not my personal preference but I can see customers liking it.  The bun saw a better day - that was a shame - I actually took the pastrami off the bun and left it aside. Sometimes I think it's better not to offer the option if it is not as good as it can be, The pastrami was ok. I would have spice it up a bit, but again I can see adherence to local taste  No doubt that the best on my plate were the fries which were fresh, crispy and the way I like them Service was quick and efficient - place is clean and definitely being taking after.  In all it wasn't as great as I have expected from reading previous reviews but wasn't bad either  I think that it is more matter of personal taste and interpretation of the \" great Jewish pastrami on rye\" it's no Katz from lower Manhattan but a good meal for reasonable price   I will stop by again to check the other specials."}
{"text":"Had the pleasure of having lunch here. Corned beef sandwich was perfection. Retuned last week picked up the \"Family Special\" Great deal for a ton of food!!! Best corned beef sandwiches:)"}
{"text":"The signs are cheeky, the staff are friendly and the venue is surprisingly unique and independent amidst the sea of strip malls and chain restaurants. But how would this GTA transplant by way of Toronto hold up to my exceedingly high pastrami/corned beef expectations built from years of eating only the finest brisket in the burbs?   Well friends, to hold you in suspense allow me to begin by review with some history. Moe Pancer's in North York had been a Toronto institution for years...years! My own father retells tales of visits there in his younger days. Three years ago the owners sold off their interests in the NY local fave in search of greener pastures. Fast forward to just over a year ago, owner Frank Houston re-branded and introduced the western border of Richmond Hill to the magic of his meat. (Pause for the innuendo to sink in ... there we go).  The opportunity for meaty levity is endless and it stems from the Pancers itself. The artwork on the wall, the cocky signage paired with the \"make my mouth happy\" cuisine lends itself to innuendo and other positive experiences.   Located on the south-west corner of Dufferin and Major Mackenzie Dr (LCBO plaza), Pancers challenges you to bring your appetite whether you're ordering Matzo Ball Soup (aka Jewish penicillin), Knish, Pastrami/Corned Beef on Rye or a classic Reuben (oh god the Reuben....the Reuben!!!) you best belly up you best because they aim to please and fill you up.  If you couldn't tell from my mentions above, when arriving with friends today I had a tough time deciding between Jewish deli faves, but after changing my mind from the daily special to the Reuben I was more than excited to chow down. Being on a diet I considered that having a salad would be a good option, no no, that was not even a viable option, our WONDERFUL server plugged the fact that they fresh cut their own fries in house daily and I said so long to my healthy efforts (I did however order extra kosher dill pickles to get my dose of green in) - Oy Vay!  The pickles were fantastic and not overly soft or salty - nice crunch (just how I like them). The sandwich...I'm sorry I need to collect myself for a moment, I'm getting a little emotional thinking about how good that Reuben was... OK OK I'm good (don't let them see you cry Kris... don't let them see you cry). A masterpiece and a must try. That's all I am going to say guys seriously. If you don't try this Reuben well then that is your loss - because its wonderful!  One of the best surprises was finding out that they carried Colt Black Cherry Cola. It is a MUST have anytime you are enjoying Pastrami/smoked meat/corned beef. My lunch came to $16 and change plus tip and I couldn't be happier or more fulfilled.   It's official, Pancers not only competes but they are a top player in my books! Perhaps if this is possible maybe I can even forgive the NHL and start watching hockey again... one thing at a time. Sigh... alas I digress. Pounce on Pancers before I do and eat your share of Pastrami.  Eatcrest out!"}
{"text":"Oh my gaad! I am still reeling from this Pastrami experience, so much so that I can't even use my usual Yelp Review Format.   Let us just make one thing clear before I go on. I was not even hungry before going in to Pancer's Deli Emporium. I was at the LCBO across the parking lot and noticed the Pancer's sign, and I remembered Moe Pancer's from way back in the day because they owned Patsrami & Corned Beef sandwiches. As this location was a hop skip and a leap from my parents house in Richmond Hill I had to give it a go, even though I had lunch shortly prior.  As I waited for my pastrami sandwich, Will filled me in on the location, the brisket and other useful history about Pancer's. It just so happens the same Chef who made the pastrami for 54 years (?!?!?) at the old location made it there now, and they made it slightly spicier. Will was kind enough to shave me off some to sample as he made my sandwich. Let me tell you, I never really knew what pastrami was until I ate this. I never tasted something so tender, seasoned, warm with the perfect thickness ever in my life. It made me so happy, I was truly impressed.  My sandwich with mustard on white rye was to die for. The best pastrami sandwich this side of.....The best pastrami sandwich ever.   I was on my way out and almost forgot to get a pickle. I will certainly be back to try other items on the menu, but for now the pastrami haunts my thoughts."}
{"text":"Dropped in over the holidays for a pastrami and as usual it was great. This is not in my area so I don't get there as often as I would like. I highly recommend this place for good deli."}
{"text":"Really great experience each time I'm here. The food is well prepared, taste and plentiful. The daily lunch special is a great choice for a sandwich, pickle and fries."}
{"text":"This place is a classic, makes me feel like I'm in Montreal. I always order the Reuben sandwich, the meat is hot, tender and perfectly seasoned.  But what always gets me is the pickle.  May be the best I've ever had.  I get an extra order to take home."}
{"text":"Jewish Delicatessen in Maple.  Mangia?!?  I would have never thought I would see the day when I had the option to choose anything else other than an Italian Veal or Meatball Sandwich in this part of the woods.  How times have changed, otherwise known as I'm too old for this.  When life gives you Meat.  Make a sandwich.  The Menu is identical enough to indicate it as a Moe Pancer's Deli branch location, which I've never been before so I don't know how similar/different it would be.  If you're asking, I'm sure you'll eventually go and find out yourself.  I think the only noticeable difference on the Menu is CONEY ISLAND DOG($5.75).  What the schwartz are you thinking about putting that thing at that price on the Menu?  really!?  really really!?  I've never been to Schwartz either, so leave this Deli rookie alone.  You Deli experts can chew out the fine details over some fatty juicy cholesterol goodness.  Actually they didn't ask me how much fat I want, not an option so unfortunate for me I got what I got.  Next time, next time....  Daily Special(Sandwich on Rye w/Coleslaw, Dill, Potato Salad $11.25)  Corned Beef was my choice and it was a nice mount of machine-sliced Meat roughly the size of my fist and since I can't stuff my fist in my mouth, they cut the sandwich in two.    Corned Beef has good subtle flavour and Silverstein's Rye wasn't Mustard'd which helped otherwise masking.  Potato Salad and Coleslaw were really light on seasoning which made me feel like I was on some sort of healthy diet.  Potato Salad I thought was better than Coleslaw.  Overall I felt comfortable with this hearty meal, all the customers were significantly older probably wiser and the Kitchen Crew were just the same.  It made me feel psychologically at ease for some reason.  Maybe I'm ready for retirement home application."}
{"text":"You learn something new everyday. i had a chance to visit Pancer's Deli as i was curious tro have a wonderful Montreal smoked meat sandwich. Well let me tell ya that I was wrong  The moist, flavorful, delicious deli meat sandwiches spun up by Frank Houston at Pancer's is not Montreal Smoke meat but Corned beef or Pastrami  There is a difference  To make pastrami, you start by making corned beef. Corned beef is a beef brisket soaked in brine (with some sugar and spices) and then you add some TLC and love to end up with a really wonderful Deli sandwich  These guys do it right and of course they do because Frank cares and takes pride in what he does.   this is truly the New York deli experience and brings back memories of hitting the deli on spadina ave in the 80s when i had to go to the garment district to get canvas, buttons and fabrics for my tailor and seamstress friends  Pancers takes the time to serve up a moist and delicious corned beef on rye, fresh chunky cut fries and a pickle on the side. Add your yellow mustard and ketchup and you will enjoy your lunch like no other  Service is basically your mom looking after you  They offer a wonderful Friday night walk in special for cottagers where $25 gets you a pound of corned beef heaven, half a rye loaf, and cole slaw (with the right amount of vinegar) and potato salad....feeds 4. Please just say your going to the cottage and Frank will look after you.   On your return visit there is the real deal on Matzo ball soup and Potato Latkes  The only thing I forgot was to see if he made a beef tongue sandwich...i haven't had one of those for years. In fact the last time i had that was at Shopsys on Spadina Avenue and Geddy Lee and Alex Lifeson of Rush were in the booth beside us having knishes and Latkes........I think they were recording Permanent Waves at that time  Skip the pizza slice or Hot veal and enjoy a taste of the Deli Pancer's Style!  The sandwich deal is $12 with fries , slaw and a pickle  I had my fill on a Saturday during lunch and the place was busy with happy eaters  BTW Amy Pataki enjoyed her meal and gave a rave review as did Yelp King Kris U."}
{"text":"This is a cant miss, don't think too hard place for a lot beautiful and delicious meat with bread holding it together.  The combo is a winner for me because the fries are well done and the tart slaw helps setup the palette for that next bite of awesomeness"}
{"text":"I found out about this deli while watching \"Eat Here\" - York Region. Its a great show which recommends local restaurants in the York Region area.   I don't eat deli sandwiches very often because it reminds me of the time when I was in grade school eating deli sandwiches almost everyday for lunch.   However, after seeing how great this place looked on the \"Eat Here\" TV show, I had to give this place a try. I got the reuben special for $14.25 based on Kris U's review. I brought my mom here and she got the smoked meat daily sandwich special $13.25. Both came with fries, coleslaw and a pickle. Both sandwiches were amazing. The meat just fell apart in your mouth. Super tender, soft, juicy meat sliced super thin and piled high. I was blown away at how good the sandwich tasted. Hell, even the fries and coleslaw were good. I also have to agree with Sarah T's review that the sandwiches are a bit on the small side. I could have polished off two reuben specials no problem at all.   Also got a matzoh ball soup $4.99 - This is my first time trying this soup. It tasted like a chicken noodle soup with a huge soft dumpling dough in the center. It tasted good but I don't think I would pay $5 bucks for this soup again.   Service was amazing. Quick and friendly. Spoke with the owner and found out this place has been open 4.5 years. He was also very friendly and very easy to make conversation with. He obviously knows what he is doing and has great passion for the food he makes. The sandwiches are 5 outta 5 stars in my book."}
{"text":"The food here is fresh and delicious.  The service is amazing. I have the Ruben sandwich and am never dissapointed.  The meat is moist and the bread is toasted to perfection.  These guys know how to make a sandwich."}
{"text":"As I walked toward the entrance I noticed a paper in the window, as I got closer I instantly recognized the Yelp crest and thought hey, I recognize that guy. The infamous Kris U. has made the front window with his love of his Reuben.   Wow, yummy and huge all describe the meal set before me at Pancer's. The Reuben special was quite the meal, the giant half pickle, abundant fries and the meat overflowing from the bread of the sandwich. I knew I was hungry, but there was no way I could possibly finish the mound of food on this plate.   The first bite of the Reuben was awesome (Kris had not steered me wrong), the meat was juicy and the bread nicely toasted so it didn't become soggy. The right amount of sauerkraut and cheese were a perfect compliment and made the flavour memorable.   The service came with a smile and was friendly and chatty but not in your face.   The atmosphere is a riot, the pictures and signs are a blend of owner history and other famous deli's as well as some humor.   A must when in the area or even a nice trip to make. I'll definitely be back, I'll have to try other things from the Reuben. Even though it is tempting."}
{"text":"4 stars! Food is great. But why are there hours so limited!!??   We usually get the pastrami or smoked meat sandwich ( not sure which one we get).   The meat is always great and moist. Never dry.   Fries are great too. Can't complain there.   My only gripe with this place is that there hours are so limited. I'd love a sandwich late at night sometimes but they shut down so early. Common guys!!  I'm a repeat customer. as long as they're open lol"}
{"text":"Cool little spot in the neighbourhood, i have never dined in as I always pickup to go orders. My favourite is thin sliced cold turkey breast, and their signature pastrami, highly recommended to get his HOT and not cold. They also have roast beef which is quite popular as well. In terms of dine-in, it's a small place so only takes maybe 20-30ppl..  Recommended"}
{"text":"Came here for lunch with 2 hungry Yelp Friends and their agenda of course is Meat! Pancer's Deli does have enough meat to make them both satisfied!  My Deli Burger ($12.99) is a little on the dry side and bland, but luckily the tasty Pastrami topping saved the day. I know a meat topping on a meat? The freshly cut fries though was tasty and I didn't feel guilty at all eating them!  I tried a bit of the Roast Beef my Yelp friend ordered, it is disappointingly dry and chewy. Tips: stay away...  Reuben Sandwich for sure must be good as I saw my CM chowed that down in record time, maybe he forgot we are not doing a food challenge for this lunch meet?  Service here is excellent! Friendly and attentive. Better than any Deli I been to!!  Pancer's Deli Emporium is a friendly deli for a lunch with your meat loving friends when you are in the area!"}
