{"text":"Great place! Highly recommended for those who love Filipino food or those looking to try something new."}
{"text":"This place is excellent!  Friendly and personable employees.  Great prices.  And the food perfect!  All of the dishes are very well prepared and full of flavor. Lots of dishes to choose from.  A visit to this place is well worth it! Best Filipino food in Vegas!"}
{"text":"I remember coming here the first few days it had opened.  For a place that is called Pancit Adobo, you'd you'd think they'd at least get those two dishes right. Pancit and adobo are two signature Filipino dishes that you cannot mess up.  If you cannot master those two, I'm a bit hesitant on trying anything else.

So thank you, but no thank you..."}
{"text":"Normally, i would have to go all the way to Maryland Pkwy to get half-way decent Filipino food, so I was so excited to see a place like this on the North side of town!  This was a huge disappointment for me.  Most of the dishes I tried had chunks of fat pretending to be chunks of pork and beef.  Yuck.  No thanks, I'd rather drive down to Itoy Sariling Atin on Maryland Pkwy to get my Filipino grub on!"}
{"text":"I thoroughly enjoyed my take-out experience at Pancit Adobo. The ladies working the front of the restaurant were warm and welcoming and aided me in ordering since I was a little confused.

Just so everyone is aware, they have 1 and 2 item combos - a couple of things on the menu are excluded from the combo plates but they will inform you of that as soon as you order it. I brought home a two item plate with milkfish (low bone content), lechon, and I also ordered talong (eggplant omelet w/pork. All very good and closer to Centennial Hills."}
{"text":"The customer service was excellent and the food is really authentic. Since I'm Filipino, I grew up around yummy Filipino food,  So I'm really picky when it comes to places that say they are \"authentic\".  I can honestly say that Pancit-Adobo's food is delicious and it tastes just like my Lola used to make!
My recommendation:
Pancit Bihon, Chicken adobo and bbq chicken skewers"}
{"text":"I successfully ordered the breakfast special today.  This time, for $4.99, I had the filipino spaghetti.  For those who have never eaten filipino spaghetti, the sauce is quite sweet, and has a mix of ground beef and hot dog slices.  

Thanks to my wife, who had not given up on this place even though I did.  She has consistently scouted out Pancit Adobo, and has concluded that it's best to eat there in the morning, when the food is first put out fresh.  

I can say that it was busy this morning.  Heck, I even saw an employee from Panda Express eating there."}
{"text":"this resturant was pretty close to where i live so it was one of the first choices for dinner that night and it was a pretty good choice the location was easy to find and the staff was friendly and the place was pretty clean ....the food was good aswell ....but i fear that i could make most of this food and save me the gas .....so it deserves 3 stars"}
{"text":"This restaurant is near my relatives place in North Las Vegas across the Albertson's on Ann Rd and Simmons.  When you walk into the small and cozy place,  it's got a nice homey feel and smell.  They have a Filipino channel on TV most of the time.  If that popular Filipino game/variety program  Wowowee\" is on, the whole place is watching.  The furniture is far from fancy. There are Filipino newsletters and advertisements on a rack.The people behind the counter are ready to dish their cafeteris stylle Filipino fast food, or  you could order from their menu and eat here or take out.  The prices are decent with a two item combo plate for $5.00. As you order, the customers watch the TV hostess's do her thing,  with botox-ed overly made up face and whiny voice. We get the food to go.  

We had the pancit (stir fried noodles with small pieces of veggies and meat), lumpia (filipino egg roll) and halo halo (milk, candied fruit, ice cram, and crushed ice).  They were all decent. But as another reviewer wrote, all of their cafeteria items had fat and gristle in some of their pork and beef, and I don't like that at all. I would prefer they trim most of that junk out and charge a higher price.  It's quality that makes me come back.  I don't know if I will for their fast food. I will  come back for their halo halo though it's still not as good as the Goldilocks version. So if you are in the area and you need your Filipino food fix, this is an okay substitute before you get the real thing.  Compared to my mom's and friends' cooking, it's just okay,  Also, I am just not a fan of cafeteria style fast food that sits and wilts."}
{"text":"i didnt like this place at first.  but as months passed by and i didnt wanna drive all the way to maryland parkway for some decent filipino food i gave it another shot.  and im glad i did, the food was fresh, especially the lechon kuwali, they cut it fresh right when you order it.

and next time you go, order the pancit palabok.  best i've had. they use thin noodles which i love."}
{"text":"I just exited the freeway and there was their big sign facing the street, Filipino Food! Great timing, I decided to stop by.

Restaurant was roomy and staff were very nice. The place is new, opened a week ago. They did inform me of another location much smaller.

My order:

Lechon Kawali: Flavorful, skin was great, not too fatty

Sinigang na pork: Soup wasn't as sour as they traditionally are, meat not so tender but it did satisfy

Overall, not bad.. I will try their pancit and adobo next time around just cause its the actual name of the store!"}
{"text":"While on vacation visiting my brother and fam, I was craving some homecooking. Back home in SF Bay Area, I'm way too skilled on where to go. Vegas? I need just a teeny bit o' help. I based our selection on Yelp reviews and you guys are right! This place is fabu!

Feeding my bro and his fam bam consists of me, my daughter, bro, his wife, and their 3 boys. I was able to spend $60 on loads of food and have lefties for the next day! Pancit Bihon, Chicken Adobo, Shanghai Lumpia, Mechado, and one mango slushy = YUM YUM EH YUM YUM! I thought the lumpia was overcooked. Bit down and the wrap separates from the filling.

We ordered to go late dinnertime-ish (8pm). There were 2 booths in folks so the place was quiet that I could figure out what to buy on a Vegas budget! The staff was helpful in making my portion decisions and even offered a sample of their Adobo Rice...sadly, they were out. BUT THE OFFER WAS NICE! ^.^

They offer catering 

When I'm back visiting the fam bam, I'll be back to Rock Spring's Pancit Adobo! I can't wait to go in for some breakfast! And if you know what's good for ya', you'll get a mango smoothie. YUMMO!"}
{"text":"My familiarity with Filipino food is limited to what my Filipino friends have either shared or recommended to me-- Pancit and Lumpia.

Given that, I have never been into a foreign-food restaurant in the Las Vegas area that basically only catered to people who are already very familiar with the food and the language. 

The menu didn't have any English descriptions (except for the description of Filipino Spaghetti) and I had no clue what anything was except for what I already knew-- Pancit (although there were two different kinds and I didn't know the difference) and Lumpia.

I glanced at the food on the Panda Express-style serving line and decided to skip it because most of the trays were either scraped empty or the food looked like it had dried out. So I scanned the menu and decided to order both the pancit and the lumpia. The young man at the register was extremely polite and explained some of the foods to me without coming off as condescending, or making me feel like an idiot! 

The Pancit came out piping hot and tasted just as amazing as it smelled! I also got way more than I expecting for the price. They nearly overflowed my to-go box with hot and delicious pancit!

On the other hand, the lumpia smelled and tasted like it had been fried, refrigerated and then fried again. The inside was extremely dry and chewy and the outside looked and tasted burnt. I ended up only eating 2 of the 10+ pieces of lumpia.

Overall, I definitely wouldn't recommend this to my non-Filipino friends because I wouldn't want them to feel as lost and out-of-place as I did. And I wouldn't recommend this place to my Filipino friends because I only tried two things from this place one of which sucked, the other I'm no connoisseur of anyway, I just know what I think tastes good."}
{"text":"Lacking in a lot of ways.  It's called Pancit Adobo, but they only had the 1 kind of pancit.   The pancit decent but they didn't give me a slice of lime.  The adobo was not good."}
{"text":"Cafeteria style, okay selection, but big dining area.

I ordered Mungo and Chicharon Bulaklak and they were both good.  Prices are good too, $4.99 for a single order and $5.99 for two."}
{"text":"I had gotten off work late tonight and I just didn't have it in me to cook dinner on top of my long work day the last 2 days. So I decided to go out and actually \"pay\" for filipino food.  I am filipino and usually when I have cravings I will either go to my mom's house or cook myself some. 

I never been to this place, it was my first time ever walking into this place.  I found it thru yelp \"search nearby\" feature on my phone. The menu was the shortest menu I had ever seen.  It's \"turo-turo\" style setting, which means, you walk in, and you pick your entrees for your combo meal. You get 2 scoops of rice and you get to pick 2 items off their food line up . It reminds me of Panda Express, when you get a 2 item combo; you get your rice/noodles (carbs) and get two entrees to go with it, same exact concept. 

My daughter had:
2 chicken BBQ stix with 2 scoops rice, and although the picture I took of her was not the most flattering or appetizing one, she really liked it. 

I had:
Arroz caldo with tokwa at baboy. It was rice porridge cooked with chicken, fresh ginger and garnished with green onion and toasted garlic. The tokwa (tofu) at baboy (lechon kwali) which is deep fried  roasted pork with skin cooked to crisp perfection, while both sat in vinegar soysauce dip with ground pepper, fresh garlic?


I also ordered:

Pork Mechado to go for lunch the next day. It came with white rice. 
It had carrots, potatoes, red bell peppers in a tomato base, like stew. 
Haven't eaten it yet, but I will let you know as soon as I do.

Overall, it was good authentic filipino food. 

Total bill: $21.00 including 2 tall glasses of iced tea. =)


BTW:

Monday thru Friday they offer 45 min of ballroom/latin dance lessons for $6 a person between 6-9 pm. I'm actually thinking of trying it out, and that too, I will let you know =)"}
{"text":"You have to try their arroz caldo with tokwa't baboy!

I come here for one thing, their chicken and rice porridge! with tofu and deep fried pork with skin soaked in soy sauce/vinegar sugar mixture with green onions and garlic pepper sauce.

I like my chicken rice porridge with a generous side of lemon juice and fish sauce. The only way  I would eat it.  My coworker loves their sago and their turon.

This is like home away from home, except my momma, is about a mile down the road, (this place almost wanna make me slap her silly) (i love you mom , just kidding!!) =)"}
{"text":"I had the garlic rice with lechon and adobo. I was in heaven. This would have been a 5 star rating if they had gisantes."}
{"text":"I'm sorry to the previous reviewers that don't like this place as much as I do. 

Yes, despite the name, I do not get the pancit, or the adobo, so I have no comment on those...

What I do enjoy there is the PINAKBET! It is one of the tastiest, flavor filled, soupy, soft, and delicious dishes that I have had! Almost better than my Aunt's in Hawaii... BUT NO ONE can beat the goodness of a home cooked meal.

I also frequently get the lumpiang shanghai and the barbecue (or skewers) which I happen to think are amazing as well.

The workers are friendly, and I think it's great there's finally some Filipino food in the North side of Vegas."}
{"text":"I was craving for some Filipino food so since this was the closest eatery to my home I decided to give it a try. 

To my big dissapointment I was unsatisfied of the selection on the menu. They didn't have Pinakbet, Pork Guisantes, Sari Sari, Fried Pork & others. 
The food was like cafeteria style and looked like it was out for quite some time. 
Half of the dishes that were out I didn't know what it was. I tried a sample of dinuguan and decided to order that since it tasted decent. I ordered chicken adobo for my husband and he said it tasted okay.  I ordered my dinuguan plate with pancit and let me tell u, it was awful! It was really dry with lots of chopped celery in it. 

The lady that took my order kept getting my order wrong and rang it up wrong at the register. 

Whole experience was terrible and whenever I crave Filipino food again, I'll travel to Elenas or Thelmas in Henderson than waste my time at Pancit Adobo.

Pancit Adobo is making Filipino food look & taste bad."}
{"text":"Ok so I find this place by accident but I love pansit so I decide to check it out. I went to the bathroom first and almost left because it was filthy. There was a paper on the door dated the last cleaning was done 9/9! It's 9/15!!! Explains a lot... Anyway... I order my pansit to eat in the restaurant and its served in a styrofoam container IN A BAG TIED!!!!!...I eat my lunch that really wasn't that bad except for the fact it only had 3 very tiny pieces of chicken in it....will probably go back but only until I find another pansit eating location!"}
{"text":"I just recently discovered Filipino food and since then I have cravings every now and then. One of those cravings took me to Pancit Adobo which is closer to where I live. This is a small place with an OK selection of Filipino food. Most of the stuff they have is already cooked and set in a buffet type of thing  behind the counter. You pick what you want, they put it on a plate and ready set eat :) I had some type of a green soup, which tasted wonderfully vinegary and also a portion of their chicken Adobo, which was very good as well. I can see myself going to this place more often. The staff was very friendly and let me try the soup before I ordered it."}
{"text":"I was so exited to see a filipino place in North Las Vegas.  I have been begging my husband to take me out for filipino food forever.  Finally I just went by myself to get some lumpia after drooling over the online menu for the last couple of days.  Okay so I'm not a flip but the place smelled like my mother-in-laws house, and that got me even more exited for the food.  I only ordered lumpia which flooded my whole car with the delicious smell all the way home.  I know I'm not much of an expert when it comes to filipino food but this stuff was awsome.  Not like mother-in-laws cooking, but still good."}
{"text":"I would have given the quality of food just ONE STAR but added another star due to the next following discoveries. 

I gave it another star since they had a band that night and the TAHO dessert was good. (who can go wrong with TAHO....)
SIZE OF THE PLACE: Quite spacious,  lots of tables, good size dance floor if needed.
ATMOSPHERE:  nothing too exciting,  the floor had a sticky feel.  and the tables felt unclean.   There were I think two flat screens which I'm sure they have TFC (The Filipino Channel) running all the time unless they had entertainment.
BATHROOM:  We got there around 7'ish and not too many people....so to find the bathroom stall with no toilet paper and unkempt...was not a good impression to me.  
*****
Now let's talk about the food- it's what makes or break your establishment:
1- i caught a glimpse of the 'cook' through the little window to the kitchen and saw him hold up the giant spoon (the kind used to cook with) and taste out of it...WHICH IS GIANT NO-NO- known to all real chefs)

Buffet  for $19.99 (includes two drinks) was being offered that night probably due to the band performing.  
I was informed there were other foods out but had been put away since it was getting close to buffet time --7:00pm.  

***NOTE***for the price of the buffet...which is competitive with a lot of different buffets in Las Vegas....they charged way too much for the limited selection they had.  
-PANCIT:  it wasn't too bad
-Adobo:  I'm sorry to say but ....very disappointing, it lacked taste and ....TASTE
Being that the name of the restaurant, I would expect more 
-Lumpia:  it's as if fillers were used to stretch the filling and was weird cuz the wrap separated from the \"meat\".  Tasted as if old oil was used.  
Dinuguan;  the meat or whatever was used was chopped so small so you cannot tell what was actually used.  Sauce was very thin
Turon:  All wrap"}
{"text":"Well, I can't honestly say I know what Filipino food is \"supposed\" to taste like, but I've eaten here a few times and it has been tasty. Today I had tapsilog, which was good except for one piece of grisly meat. Previously I've tried their adobo and skewers which were very good. Overall, I still like the tapsilog from Aloha Kitchen better and the adobo from Elenas, but this is good too."}
{"text":"Although there is table service, Pancit Adobo has a large buffet from which the server scoops out the orders. They look interesting and tempting on the buffet with a large selection of mostly fried foods. 

My family is well versed in many different types of ethnic foods and we are always ready to try new things. We are absolute novices when it comes to Filipino food and I would have appreciated a bit more guidance when ordering at this restaurant. We ordered about five dishes, some of which I am sorry to say I don't remember. The pancit was good as was the Beef Adobo, but some of the other dishes we ordered we found inedible (might have been from an admitted lack of Filipino ordering savvy on our part). We got a squid dish that was soggy, squishy and very fishy. Perhaps it is supposed to be that way? We normally love squid in a variety of recipes, but we found this disgusting. Untouched, save the small taste each of us spit out, the server never asked if she could perhaps replace the order with something else. Although friendly, she didn't bother to ask if we liked our food.

WORST of all was the SMALL ROACH that scampered across my daughter's booth seat which we had to sweep to the floor and stamp on. This was done while the waitress was in front of us, delivering our food.  She scarcely acknowledged it and did not even apologize.

We will not return."}
{"text":"I had high hopes for this little Filipino restaurant, but it just doesn't cut it.  It is like a panda express with filipino food.  
The Good:
It was fairly inexpensive.
the food was authentic.
The sausage was excellent.
The bad:
The food in the warming trays were not freshly cooked.  
The place had carpet on the floor and it was pretty dirty.
They charge $1 for debt cards under $10.
They did not have pork adobo-that is only a special on a certain day?
The chicken adobo was mostly fragments of bones with a little meat on them.  

I would pass on this place.  Not trying to disparriage a family owned restaurant - but they just don't have it together."}
{"text":"this place isn't too bad!! if you're craving some homemade filipino cuisine, this is the place to go!! i found this place about 2 months ago and i've been there at least once a week ordering the pancit bihon, lechon kawali and fried chicken skin... i know fried chicken skin sounds gross, but it is DELICIOUS!!!! the price isn't too bad there, but getting the fried chicken skin at least twice a week for $5.99 + tax isn't cheap!!! it adds up!! LOL - well... what can i say?!?! it's worth it!!!"}
