{"text":"FINALLY! Great Filipino food in Calgary! 

My boyfriend, who is from the Philippines, and I have been trying to find good Filipino food in Calgary. Up to this point we have been sadly disappointed. I can now say that Calgary has an excellent Filipino restaurant. 

First off, the service was amazing. They were so welcoming and kind. The mother who is the owner and chef, came out to say hi to my baby girl and we chatted a bit. She was so nice! 

The food...I'm still drooling. I ordered A LOT of food, they probably thought I was a little crazy. My favourite was the binagoongan. Oh my gosh, it was so good! Their garlic fried rice was delicious as well. The sisig tasted different than any other sisig I've had before, it was still good though. And of course, you can't go wrong with crispy pork. Delicious. 

I will be back!!"}
{"text":"Amazing quality Filipino comfort food
You can taste the love that has gone to making it
Be ready to ask for a take out parcel as the portions are huge!

Server/ Host knowledge: 4.5
Server/host attitude: 4.5
Fast service: 4
Food Menu: 4
Drinks Menu: 3.5
Food quality: 4.5
Food Portion: 5
Ambience: 3.5
Distance to other tables: 4
Cleanliness: 4
Comfort: 3.5
Waiting time to get seated: 5
Price: 4.5"}
{"text":"We've been here for like 5 times already. It's way better than Adobo Experience. My boyfriend and I's favorite is their chicken inasal. We have no problem with the food, but with their service that's why I rated it 5 stars. 3 of those 5 times that we've been there that we have to get their attention to give us the menu. Although the chef and the lady which I think is the chef's mom are always so nice to us.."}
{"text":"In contrast to the Philippines that largely serve the same dishes, the ingredients over here in Canada are generally of much better quality, but the food in my opinion is still far behind that of most other SE Asian countries. After living in the Philippines 11 years and just coming back after 3 months there again, I have come to know that what is commonly called 'filipino food' is not their food at all: they have been subjected to poor quality versions of Chinese, Spanish and American food for centuries! That means that what restaurants sell and people eat is mostly not their natural food at all.
My wife is a filipina. In an attempt to treat her, I took her out to 3 different pinoy restaurants in Calgary, but when I ask her where she wants to eat out, these restaurants are not on her list, nor at all on mine! 

The adobo, mixed gulay (vegetable), baboy (pork) and chicken dishes in various forms are just not that tasty or good looking. Their presentation tends to be unappealing, and the interior of 2 of 3 of the restaurants look like the food, kinda pangit, diba?

Too bad, but this is the result of generations of cultural upheaval, and not the intentions of filipinos at all. I wish I could be more positive, but we won't be returning to Paolo's anytime soon.

Want good food? Do your research on Yelp, Trip Advisor or Google for the best rated restaurants of true ethnic quality and be amazed. Sadly, not here."}
{"text":"If I could give this place 0 star, I would. I came here with my boyfriend (french canadian) and I was so excited to let him taste some filipino food. We asked for the menu and the guy abruptly gave it to us. I asked him if we could do take -out but he ignored us. My boyfriend and I went ahead and looked at the menu and once we fogured out which dish to order we went to the counter and said, \"this is for to go.\" The guy had a very disapproving exression on his face and said, \" It would be hard to cook your order right now because we have a big party coming up.\" My boyfriend and I were flabergasted at his response. We gave the menu back and left. 
You are a restaurant you should anticipate that people will be walking-in to order, it doesnt matter if you have a party or not. If you cannot handle to cook for everyone that comes in then just put the close sign up."}
