{"text":"Great service, great people, very clean facility :) will come back again 
Better ingredients better pizza !!"}
{"text":"Awesome people, service and pizza. My dream come true every time I take a bite. I am always satisfy with the quality of the food and the promotion are so cool!!!! Your loyal customer"}
{"text":"Contrary to other people's reviews,I had no problem with the service.  The person who delivered the pizza was incredibly kind and helpful.  However, the one thing is that the pizza took quite a long time to arrive, much longer than other pizza places such as la felice, adrians, or la bella"}
{"text":"This store is the new old Domino's. We order online so the orders go to this store. I'd say we have a 50% success rate with store 2803. By that there's only two criteria - 1) it arrives in a reasonable amount of time and 2) it arrives hot. So yeah, we're at about 50% of our orders meeting that criteria. We've had some orders take 60-90min. Hot pizza? About the same.
How, if it arrives in say 30min, it manages to still be cold is baffling.

And, quite frankly, most of the time the pizza is crap anyways. I cringe when the family wants to order PJ's for pizza night.

The way Domino's became bland is exactly what's happening with Papa Johns. Same bland crust, sauce, etc.

This store pretty much sucks."}
{"text":"My favorite pizza.  Love the selection and the discounts the day after our teams win and the loyalty plans.  Those make it an obvious choice for some take-out pizza."}
{"text":"Boosting their margin by cutting back on toppings. Not a good value for the price as compared to other shops in the area.

They would do well to try and compete with the local shops who do it right...y'all don't exist in a pizza vaccuum with Dominos as your only competitor.

Go a few miles out of your way and try Mandy's in West View."}
{"text":"Worst experience ever!!!! I placed my order at 7:15pm it said it would take about 45 mins to 60 mins to arrived and hour and half later I called to ask for an update. They said it hadn't left the store. I said it would be almost 2 hours and if I could get some discount and she said no because I was already getting a 15% discount. I told her 2 hours was too much time for a pizza and she asked if I wanted to talk to a supervisor and I said \"no, I just won't order in the future\" and she hang up. 40 mins later I call again and the girl hang up on me AGAIN, then I dialed again and the manager said that the person I spoke to earlier said that I cancelled the order. Those words never came out of my mouth! Terrible experience and customer service! So sad Papa John's! You had a chance to make it right!"}
{"text":"called order in for an order the day before our baby shower at work.  wasn't there so we called when it was 1 hour late. were told it was on its way. one hour later still not there. called again and was told by manager that if we think they are so bad to take our business elsewhere. well, we work in Southpointe and will be HAPPY to give our business to someone else. 2 calls 2 corporate who said they would have the owner call us resulted in NO calls at all. Guess no one there cares."}
{"text":"I always receive friendly service when I call in to place an order at this location. And the pizza is fantastic!"}
{"text":"Had Papa John's deliver pizza on Friday evening very good service great pizza I asked for anchovies and I actually got  them I know I know anchovies but yes it was very very good best pizza I've had in a long time once again great Great service thank you very much again great job thank you very much"}
{"text":"Amazing store, Plenty of Parking and Awesome employees. Mr. Anthony Rodriguez is a wonderful man who helped my family and I get a great deal on a budget! He is very friendly and will make sure you get the most for your money. 

It seems that more and more business owners have hidden behind their franchise name and used that as an excuse to lower their quality of service and product. 

That is not the case at this Papa John's location. 

They will treat you like family and have you feeling confident that your hard earned dollars were well spent. 

Papa John's should be proud of your dedication and commitment to this establishments motto and promise. Well done and God bless you Mr. Anthony Rodriguez; you have done what many others still fail to do. 

Love others and treat them the way you would like to be treated and just wait and see how God blesses you! 

Love you all!"}
{"text":"Awesome. For a veg person, Natosha and Niraj helped a lot to ensure it was good. Really loved the pizza."}
{"text":"really good customer service only got A4 out of 5 stars because the Papa John's sign is blown out"}
{"text":"Ordered lunch for the office today and it tasted fine, food was warm and arrived in a timely manner. Just wish their pricing was a little more competitive."}
{"text":"I love the fresh veggies, the red sauce is sweet and the sides are great.  Thumbs up PAPA!"}
{"text":"So I ordered a pizza from this place a few weeks ago. It was rather late and I wasn't sure if it would let me order since it was about 10 minutes before they closed but it let me place the order online. I was excited because I was starving! I ended up getting a phone call 5 minutes later from the manager saying that I had placed the order too late and that she had to cancel the order. Dominos would have delivered it to me had I placed the original order through them, but that's beside the point. Anyway, because of the inconvenience, she offered to give me 50% off my next order as long as I called to place the order. I just tried placing the exact order but was told they couldn't honor the 50% off because my order was a special and they couldn't combine the offers. Um? That's not what the manager told me when she offered it to me. I literally placed the EXACT same order but couldn't use it. I asked what I could use it for and was told anything that wasn't a special. I told the guy I wanted the same thing as the special and asked how much it would be... It was the same price as the special. Um? What's the point in offering me 50% off if you're just going to charge me the same price as the special that ANYONE else could order. That doesn't really seem to make much sense or seem fair. I was being given 50% off because of an inconvenience you caused me. That's not my fault. You should have honored what the manager originally told me. I haven't tasted the food yet as I just placed the order so my review is based on customer service alone."}
{"text":"This pizza better than good dick. The crust even be good, pizza pizza can go just off a bridge like this where I be now"}
{"text":"By far the WORST Papa John's ever. Was forced to order from here a lot when I lived in Southpointe, it was the only place that delivered late. You can almost guarantee that your pizza will be A. EXTREMELY late every time you order.  B. Your pizza will be ice cold, the delivery drivers must put your pizza in an ice cooler on the way to your house... and C. Most likely wrong, they forget to add toppings all the time. They are rude on the phone and don't you dare ask them to hold a topping or two on one of their 'speciality' pizzas, it will never happen. Save yourself the trouble and stock up on a bunch of frozen Tony's pizzas if you want garbage pizza."}
{"text":"Similar experience to other reviewers. Waited forever for pizza. It finally showed after a few calls ( 2 hour wait). It was cold & the cardboard box probably would have tasted better. Got a coupon for a free large from as part of compensation for wait... it went in the trash with their garbage pizza. Used to like pappas pizza. I ll never order from the chain again."}
{"text":"Ordered a pizza online, never received a conformation email...after an hour and 15 minutes called and was put on hold. I hung up after 9 minutes on hold.....calling another pizza store that WANTS my business...."}
{"text":"We ordered carry out over the phone and the guy was very nice. Got to papa johns and was immediately greeted by Jason( his name is on our receipt) with a smile and good attitude. Our food was ready and he just made it very easy and a good experience. So thanks Jason! Very clean too"}
{"text":"Odered a pizza and was way over charged. Called them to fix it and they offered a free large 1 topping pizza. Called today to get my free pizza and was tild that i had no free pizza and that they never even yalked yo me about a free pizza. Will NEVER ever order from thus Papa Johns ever again! Not to mention the manager is rude as all get out and extremely unprofessional."}
{"text":"We had ordered here two or three times so far and weren't disappointed regarding the pizzas and the delivery was reliable, too. I definitely prefer them over other pizza chains.

We also had tried one of their cookies but it was pretty sweet for my personal taste.

We keep ordering."}
{"text":"At least it's not Vocelli's.  That's about all this place has going for it."}
{"text":"They took my order for delivery and then called me back 15 minutes later to tell me I was outside of their delivery area and that my order would be cancelled!"}
{"text":"No problems with my experience here. Ordered my pizza online and got a pretty sweet deal. It was $7.99 for a large cheese pizza with as many toppings as I wanted. I was told it would take 30-40 for delivery but it only took like 20 and the delivery guy was super friendly and good looking. I'll definitely be ordering pizza from this location again!"}
{"text":"Have ordered here for years- past 6 months the place has sunk to a level not worth supporting. Discussed it with their franchisee and corporate office. Customer service is terrible. Product way below standard. Bad bad bad location. Pathetic."}
{"text":"First time here, on a walk-in.  The staff was nice and the quality of ingredients was good.  However, we paid for toppings that were not on the pizza, did not get the extra sauce that was requested, and were given 3 really sketchy looking garlic sauces instead of the one marinara that we asked for.  The bill included all of the toppings, extra sauce and marinara dipping sauce so the fall-down was in filling the order correctly.  Also, the pizza was cooked well-done, which we don't prefer and did not ask for.  We didn't get the pizza that we ordered and paid for so will not be ordering again.  Had we got what was paid for, it would have been a solid 3 star rating."}
{"text":"I love Papa John's. I'm technically outside of their delivery area but I can manage to get this one to deliver to me. The food usually takes an hour and ten mins and is luke warm at best, but being outside the area I can deal with that. What bothers me is the lack of care to get me the right order. One time they gave me someone else's entirely different order. Like different pizza size, different toppings, different customer's address on the boxes. The next time they screwed up my toppings and gave me beef instead of sausage but I wasn't about to wait another hour to have it fixed. A little work on accuracy could go a long way, but I'm a sucker and will keep going back for that amazing garlic butter oil sauce stuff."}
{"text":"WOW!!!!! REAL GOOD. This is the first time I have had Papa John's and if this is the way it tastes each time. I will buy A LOT!!
  The Garlic Knots are a very tasty and the sauce that comes with it. mmmmmmm
  I like the pepper in the pizza box as well, nice touch"}
{"text":"This branch re-opened under new management. Overall the service we experienced was excellent, staff was enthusiastic and patient as we got acquainted with the menu. The pizza was also excellent. Perfectly crispy crust, with just the right thickness. They also add extra touches to the order, like a free dip and a whole jalapeño pepper on the side - I wonder if the jalapeño helps with the taste. Overall, really fresh & yummy. :)"}
{"text":"Terrible terrible service. Waited on a pizza that said 28min delivery for an hour in a half just to find our that the last guy told us it was on it's way when they hadn't even started making it. Calling corporate in the morning. Poor store needs a new manager."}
{"text":"Waited over 4 hours tonight for delivery. After many phone calls we still didn't receive our order.  They kept saying it's on its way or just 5 more minutes. It's completely unacceptable. Next time I'll be checking out one of their competitors."}
{"text":"Food quality was shit...it was not prepared well. I believe dough used for my pizza was expired, don't know much but it was waste of money. They are less than 2km away and took 44minutes to deliver. I wish if i can give half star. I won't order pizza again everrrrrr"}
{"text":"Good location. Pizza was great. Stopped by after a MS biking event as they were a sponsor. Was not disappointed."}
{"text":"Ordered pizza and wings for five yesterday, specifically requesting 5 extra garlic butters and blue cheese for the wings.  We got 2 garlics and no blue cheese.  What we did get that we didn't order was a blonde hair on the pizza.  The toppings were miserably small -- like a teaspoon of sausage on the pizza!  You couldn't even taste  it.  Will NEVER order from PJs again."}
{"text":"Got a really good pizza here!!!!
Beware when picking up, I was not greeted for several minutes when I arrived and the pizza was 15 minutes later than I was told, so I had to wait.
They were very busy, probably could have used 1 more employee.
Awesome pizza though, just plan on 30 minutes not 15 and you'll be happy as can be."}
{"text":"Called to order two large pizzas. Informative staff who was able to tell me what the specials were.
We did a pick up order and was impressed with how quickly we got the order on a Sunday evening. They told us the order would be ready in 10 to 15 minutes, which was true. They accept credit cards at pick up. There's a plaza where you can park your car. The pizzas were delicious. Soft Dough and crust. Very flavourful. My fave was the Hawaiian. The papa johns fave was good, but I enjoyed the Hawaiian way more. They are generous with toppings. They even add in a hot pepper in each pizza and provide dipping sauce. Sauce isn't as good as pizza pizza's garlic dip though. Price was ok - got two specialty pizzas for $30. Will be back!"}
{"text":"This place is like a hidden gem! The food and service was excellent. We weren't able to order in advanced as we found this place while in the car but as soon as we got there, it didn't take us long to decide what to eat as we were given some really good recommendations. The wait time for our food was also very reasonable. I will definitely come back!"}
{"text":"Good and timely service.  No problems with anything.  I did order extra pizza sauce but didn't get it.  I had the wings and they were fine."}
{"text":"I ordered the pizza from my smartphone. It was very easy to order. I got to papa johns signed my receipt, waited 10mins and got my pizza. The pizza was pretty good, meat lovers and a bacon with pineapple pizza."}
{"text":"Just called and the customer service is spectacular at this location. Very helpful on the phone in helping me with the order I placed via the app."}
{"text":"I haven't had pizza from Papa John's in quite awhile, but...the when I was getting Papa John's, it was very good pizza !!
When I was working, we always had it for lunch.  It was always delivered on time & was always quite hot.  The pizza itself was really good....the outer crust was quite soft & very good dipped in the garlic butter that came with it.  Actually....I think that garlic butter sauce was the best part of the pizza.     I'd happily recommend Papa John's pizza to anyone."}
{"text":"Good service, conveniently located in Pickering. It was definitely a good pan pizza alternative to Pizza Hut. They have a pretty good special that was $12.99 for a 4 topping large. The marinara sauce they use on the pizza is a bit sweet but still food. The garlic dipping sauce they offer isn't creamy at all, it actually had the exact consistency of butter. So I wouldn't reccomended it. 

But overall it was definitely worth trying"}
{"text":"I tried to order here the training or the something that happens here make the employees extremely rude to customers. I first went online and could not order delivery so I went and downloaded the app. The app and online had a special well for some reason the app would allow to order the pizza the way you wanted only the certain pizza but online would. So I called the store figuring they could just do the order. Wow nope I was wrong you can't get online deals in the store. The last time I ordered from here the delivery driver threw my wings in the front yard because it took them 2 hours to get there and I told him I didn't want the wings they where cold. I guess the pizza is ok if you can get through the employees at this location. They must have really bad managers or who ever owns this location doesn't care."}
{"text":"I want to give the food a higher store and the store itself a lower one, but I can't so we'll go with 2 stars. 

I ordered a large lunch order from them today. It was for a business and I placed the order online. I was trying to pay with 2 gift cards and it only took one, so I figured I'd check \"cash\" to pay the store directly with the other card and just start the order. Upon calling the store, the guy on the phone was very rude and just shut down everything I said before I was done with the sentence. He said it was an online order and he couldn't take other payments besides cash for it. All he could do, he said, was cancel the order- so he did. 

I placed a second order. This time, we chose pick-up, and I sent my coworker up with the 2 gift cards. Because online orders can either be paid online or you can choose \"cash,\" we had to choose cash. Because we did, however, the man from the phone got into it with my coworker about even accepting the cards because it was cash. He offered to pay with a credit card and was told \"that's the same thing, you checked cash you pay cash, period. I'll do it but I don't have to. I'm doing you a favor so just stop.\"

... really man? Has Papa Johns on Babcock Blvd not heard of customer service? You're supposed to be friendly, respectful, warm. You're not supposed to make things a massive hassle for customers, treat them like f*cking idiots, and then make it out like you're a nice guy doing them a favor."}
{"text":"Horrible pizza. I think they were using old ingredients or something. It tasted like old pizza which had been reheated in the oven and was now dried out from over baking. Not sure if that was the problem, but that is what it tasted like."}
{"text":"I ordered late last night, because my only options were this place or dominoes, and dominoes might actually be better. I ordered pizza rolls and honey chipotle wings. You get 5 pizza rolls, I got 4 and 1 piece of pizza dough. These pizza rolls are such a sad excuse for pizza rolls. I wish I would have taken a picture. The wings didn't even taste like chicken, they were disgusting and soggy. If you want good wings and pizza rolls, go to Hal's Bar and Grille on Babcock. If you want good pizza, go to center Ave slice or Adrian's. Not here."}
{"text":"Only ordered twice from here and both times my pizza was just kinda warm, not hot n fresh. The dipping sauce was warm n melted and nasty. The pizza does not taste very good. The prices are just okay, but they should try to be more competitive. I do not suggest going here . Better pizza options elsewhere."}
{"text":"Food poisoning from chicken wings ordered on 3/20/13.  Throwing up some nasty chicken.  Avoid this place!"}
{"text":"My pizza was terrible and burnt, multiple complaints and have yet to hear anything but a form letter telling me they want to make it right.  It's been 3 weeks since i first submitted feedback."}
{"text":"I'm not sure where to begin telling the story. When you've bought enough pizza from Papa John's to feed your staff that you have eight free pizzas on their point system, you've bought a lot of pizza. Silly me to think that that much business would earn any level of courtesy or respect from this organization.

This morning around 9 AM I used three of those pizza freebies for my football fantasy draft. I scheduled the delivery for 5:45 PM. 

Just before 6 o'clock I was called by the driver to tell me that there was terrible traffic and that he was running late. At 6:30 I called the driver to make sure that he was safe fearing he had been an accident.
When he told me he was still in traffic I wished him a safe drive and called the store. 

I spoke to the manager I believe her name was Lily who told me that there was traffic and that it was an hour and a half for deliveries. I asked her why I hadn't been contacted before my order time to be advised of this issue she said well everyone knows now it's an hour and a half I said but I ordered at 9 AM. She said oh I thought you were kidding when you suggested that we would call you in advance to allow you to make other arrangements. 

I asked her if I called another local store if I would get the same problem and she assured me that I would. Of course this was my chance to call the neighboring Papa John's who told me that they could have a pizza to me in 35 minutes, so when I had asked Lily why they hadn't transferred the orders to another store, her contention that they would have the same problem apparently was not quite true. 

So now I stand here after 7 PM waiting for pizzas that have been in the drivers bag apparently for the last hour and a half. It's a shame that the store doesn't realize the impact of this choice. I cannot tell you the number of pizzas I had to order to end up with seven free ones. I know that I've used some of the free ones so that's a large chunk of business for them to bet on this issue and quite honestly, based on the way I've been treated, you can well imagine who will and will not be getting my organizations pizza business in the future."}
{"text":"Good pizza. Used the app for iPhone and had no problems with delivery or how long it took. Pizza may have been a tad underdone. I still ate it. I like a pain-free delivery- it's sometimes hard to come by!"}
{"text":"Probably the worst of the conveyor belt pizza chains. This is no different. The store feels filthy, I stopped by to pick up a few pies to bring to my friend's house for the Super Bowl. I ordered two large, one with mushrooms, the other pepperoni & sausage, and three orders of breadsticks. It all looked good but had a sickening sweet sauce that nothing masked. The breadstick were good but the sauce was pretty sweet again. Glad he had other food to offer his guests. Never again! Next time I'll get Pizza Hut."}
{"text":"WE ARE OPEN :) 

Hello Everyone. We are please to annouce that we are officially open for business. Our Grand Re-Opening Promo is  A Medium 1 Topping Pizza for Only $4.99. Try us again for the First Time :) 

Thank You 

- Papa Johns Team Located on 1400 O'Connor Drive Unit 1"}
{"text":"Not sure what the details are w/ the two currently 1-star reviews, but I do know they get busy.  I haven't had any problems here and the food has been good.  The last time I was there was Good Friday and they were slammed.  The girl working the register told me that delivery was 90-120 mins and pick up was 45mins.  Perhaps they need more delivery drivers for busy peak periods.  It was all she could do answer all the calls and non-stop people coming in the store.  We just showed up and walked out the door 20mins later w/ pizza.  Fresh, hot, and tasty.  If delivery seems to be an issue, why not try pick up?  Like I said, we've never had a problem with it in the 6+ years we've been ordering from here, and the staff has always been cordial."}
{"text":"Needed a late night dinner so made a last minute call to papa johns. First I called to verify the hours...had the epitome of GREAT customer service (was not expecting that based on the yelp reviews and the time). She was friendly, accommodating and answer all my questions professionally and detailed. I hung up in shock because it's rare to get great service over the phone.  The service was so great even though they were closing 30 mins from the time of the call I called back ordered and rushed over to make sure I made it time to bring them my late night business! Even the gentleman that answer my call was friendly and diligent in making sure my order was correct.

I would describe this 3 person late night crew as A players!"}
{"text":"Absolutely do not order a pizza from this Papa John's. Waited over an hour for a simple pan pizza and some wings. Called to find out the driver delivered my order to the wrong people. I finally got my order and looked at the pizza which had the wrong toppings. Got to the point where I was so frustrated that I just ate the pizza because I was starving. To those that are thinking pizza don't order from here literally do or go anywhere else."}
{"text":"Normal don't order from this location but it is on my way home from work so I did. Food was as expected but they told me not to order online they would give me a discount for calling in my order. 

The next time I needed a pizza I called it in. I got there and they didn't have my order. The answer was \"sorry I forgot to submit your order.\" I wouldn't trust to call and order in with them again. Interestingly the huge discount they were going to give me when I called was what I could get online anyway but I was already on the phone."}
{"text":"If you must order pizza from here DO NOT PAY ONLINE!! I did an online order, paid online so I could just run in and quickly grab it. Five days later, my card had THOUSANDS of dollars worth of fraudulent online charges. That was the first time I had used that card for awhile. Seriously shady crap going on there. There were three employees there when I arrived. Two were working hard and one was shady AF. He was dirty and rude. He refused to grab my order for me (it was ready and waiting on the heater, literally would take 5 seconds to hand it over). He said only the guy on the phone could help me. Then he walked to back of store and the employee making the pizza kindly helped me. Will not order from this location again."}
{"text":"This is probably the worst pizza I have ever had. The thin crust is like thick sweet tomato paste dabbed on a saltine cracker. I have heard of PJ's pizza for years but if this is typical I would never get it again. It's too bad there's no other good pizza in Penn Hills anymore.  Yuck."}
{"text":"I mean... come on! The food doesn't even look good in the pictures. Its OK.. I really never liked their red sauce, cheese is fine, it's hard to mess up cheese! The only thing they really had going for them, was they had \" fresh \" dough.. Ok.. good for you.. it still not that good. Then they end getting a pan pizza anyway, havnt tried that yet. For a commercial pizza place that tries to act like a little family place, it's fine, but nothing to go crazy over.. But everyone already knows this. i'll update with the pan!"}
