{"text":"I have ordered from Papa Del's at the crossing 3 times. Twice, they screwed up and thought I wanted carry out rather than delivery.  The second time, I was very specific that I wanted delivery . 

After waiting, I finally called and they would not even wave the delivery fee to bring me a pizza that was 90 minutes late and had been sitting around their store for that entire time. They were not apologetic and didn't even offer a discount on a future pizza. I won't be going there again."}
{"text":"Forget about that $10 pizza from that chain restaurant.  Get some Papa Del's.  The deep dish is solid.  It has a great sweet sauce, but i want more cheese.  There is a lot of crust, so next time a side of marinara or garlic sauce is in order.
By the way... I always want more cheese."}
{"text":"This Champaign pizzeria is a local institution for a reason; the consistently satisfying pizzas. The deep-dish stuffed pizza is the torch-bearer, but the thin crust is criminally underrated. The Green St. location put them on the map, but the Village Green location brings those recipes students and locals alike have loved for years to the hinterlands of southwest Champaign."}
{"text":"sooo having some friends in town and only wanting to hang out, drink some beers and have some pizza, we called on papa del's. this was at 640. pizza arrived at 950. and that's after 4 phone calls to the \"manager\" who on all four occasions blamed US for the delay in our delivery. really? really???? it's our fault that your pizza took 3 hours to deliver because we ordered 2 pizzas instead of one?? and yes, that is the actual pathetic excuse we got.  
suck it, papa dels. looks like we'll be mail ordering lou malnati's from now on for our deep dish cravings..."}
{"text":"On our road trip, we wanted to taste Illinois deep dish pizza.  We also found ourselves far away...quite late.  

What stunned us first was the initial info that it would take 45 minutes to complete our order of one large cheese deep dish pie.  The cost of 20.76.

We returned after the allotted time to receive our pizza.  I was surprised how it is made (I'm from NYC/NJ)--they put the sauce over the cheese and top with oregano.  I had never seen pizza done this way.  

Th pizza was hearty.  One slice was quite filling.  It reminds me of a Sicilian slice.  The crust was dry and unappealling.

Btw, the bathrooms and location was bright and appears clean.   
 
In conclusion:  
Besides the crust and the price for one pie:
I would try them again, if they delivered to NJ."}
{"text":"I'll NEVER go to either of the Papa Del establishments again.  After paying $50 for two pizzas that I waited almost 1.5hrs to have delivered, I received subpar products (overcooked and poorly made).  To make things worse, when I called to give feedback and ask for some kind of accommodation, I was talked down to by one shift manager Rob and hung up on by another Mark.  After 20 yrs. of patronage, I expected better.  They have lost my business forever and I'll be sure to let the owner Bob know exactly why!"}
{"text":"the pizza would be a 5 star alone, but there were many issues.  One should never run out of a topping for your pizzas.  We had an original pan and a stuffed.  There were both fantastic chicago style pizzas.  The down side is don't plan on eating at their place.  The service is not in existance.  We ordered the  2 liter sodas and had to pay for cups.  We ended up standing to eat the pizza since they put up chairs and tables at 8:45 sharp, customers or not.  After dropping 60 bucks some curtesy would have bee appreciated."}
{"text":"The three stars are for the several hundred amazing Papa Dels pizzas I've loved and enjoyed. The Phone person just now, the one that said they weren't sure that they delivered to Downtown Champaign?!?!?? Shaved off from the the deserved 5 stars. Really, Yelp is dumb, I'm usually an easily pleased customer type. I'm clearly venting from a disappointing moment. But here's the thing. I had taken a break from Dels, a little time out that was needed after my first ever lame moment with them. That moment was all about a burnt thin crust pizza that arrived two months ago. It was a pizza I'd had a gazillion times, thin sausage and mushroom. This pizza arrived with very little non dark dark brown spots on top, normally there is the yellowish tan vibe of perfectly melted cheese, with maybe a couple little dark dark brown overdone spots. I've never been a call the restaurant kinda guy, but I had to, I mean I was picking off pieces of sausage, and that was about the only yummy pizza edible action I could muster. So yeah, i called. I only called to let them know about the quality issues, I wasn't angling for another pizza, or money back, none of that. The manager who happened to answer the phone replied to me that, she'd \"let them know\" I asked \"let who know?\" She said \"the kitchen\". That was it, then some long silence. I got the same long silence when I let the guy on the phone tonight know that I was at my friends apartment two blocks away last Sunday, when a pizza from dels was delivered there. I didn't have a slice Sunday, because I was still salty about my burnt pie. Tonight I thought, it's time to forgive and forget, it's time to order a fat deep dish Papa Dels pizza. I was fiendishly ready to make up! But no, they might not be delivering to downtown Champaign. I love you Dels, this Yelp is petty I know, it's the gaudy actions of a Yelp review that makes me hope you whip shit back into form soon. This isn't some hateful mean 1 star thing, it's a plea."}
{"text":"Every bit as good as when I was in college.  Deep dish is tremendous.  Thin crust and sandwiches fine also."}
{"text":"Best chicago-style pizza I have ever tasted!  This is a must visit stop when we are in Champaign.  The sausage is our favorite."}
{"text":"Best pizza in town!!! Pricey but definitely worth it! If you are from out of town and need a good recommendation of where to eat... This is the place!!"}
{"text":"I don't understand the hype about this place. I have ordered from here three times, all for takeout. The \"restaurant\" is nothing to brag about and every time I have ordered take out, my pizza hasn't been ready for at least ten minutes past when they said it would be. The deep dish is a loaf of bland bread with sauce on it. Nothing like Chicago deep dish where the crust has flavor. The thin crust tastes good, but they put the toppings under the cheese so everything slides off the crust when you take a bite. And it seems more expensive than it should be..."}
{"text":"Great pizza, satellite location to serve west champaign.  Just added outdoor tables for summer takeout eating.  Great pan and thin crust. If you haven't had papas pizza, you haven't tried the best in champaign.  Up there with rosatis for thin crust and in their own league with their very unique pan pizza."}
{"text":"My girlfriend likes thin crust...I like deep dish...cuz I'm a man, and men should appreciate the awesomeness of a heavy box filled with tons of sauce, bread, toppings, and thick cheese that requires a knife and fork like an actual meal....no crackers with cheese and sauce for this guy.

Anywho...after trying Old Town up by North Prospect where their \"authentic Chicago deep dish\" was really just their version of Pizza Hut's personal pan pizza they used to make, we tried Gumby's...now if we wanted a greasy party pizza and wanted to mostly fill up on beer, we'd choose them, but we wanted an honest to goodness pizza to eat during the Bears game.

After reading tons of reviews for Papa Del's we ordered and 45 minutes later the pizzas (both thin and deep) were SUPER hot and ready to go.

THE THIN: was not as thin as most places, which I enjoyed..it's actually a little bit more bready than the cracker-thin stuff normally received...the sauce tasted fine but the cheese was great...everything together reminded me of a place called Barnaby's that I used to eat growing up...however, where the center of the pizza was fantastic, the outside looked like reheated pizza already and was \"well done\"...uneven pizza is typical for thin crusts but either way their thin was tasty, filling, had maaaaybe a tid bit too much sauce for my liking, but tasted good...its not the best I've had though.

THE DEEP DISH:  Back home there's a tiny place called Napolis...they served bready-sweet-thick deep dish completely different from Uno's/Lou's/etc and I loved it...this was just as good if not better.  The cheese was thick and had numerous flavors, the sauce was a little sweeter than the thin, the pepperoni had a kick to it but didn't distract from the overall taste...the bread was soft and nowhere near the \"overdone\" look of the thin crust....I loved it...there were even extra spices and cheese peppered all over the top of it.

Bottom line...thin crust my girlfriend enjoyed more than I did, but I'm bias...if I want finger food I'd get Burger King's Chicken Fries...when I get pizza I want a meal, and this was a damn fine meal.  A little pricey, especially considering their S,M,L,XtraL were the size smaller than normal (Large was smaller than the Medium I'm used to)...overall we got 2 larges and spent $37....in the future I'd get a small just for myself and she'd get a medium so I could have a piece or two.."}
{"text":"This WAS my favorite pizza place in central Illinois . . . for decades. Something happened. The pizza was bland and so was the Italian salad.   They are in between stores having closed the two they used to have on the UIUC campus. They tried and failed at a Rantoul IL location years ago.  The staff said they should open a new larger location by February 2016 but there is no hard date. This is mainly a delivery and pick up place.  They have 3 small and one normal sized table with cheap plastic patio chairs in a very small eating area that doubles for a line up area for pick up customers. I would not have minded the facility so much if there pizza had not changed."}
{"text":"Great deep dish and they serve it by the slice!!!"}
{"text":"Great pizza just a tad bit on the expensive side. Prepare to wait 40 min's to a hour for  cook time for awesome pizza and the breadstick and chesse are awesome"}
{"text":"This location is pretty much carryout/delivery only. We made the mistake of meeting at this location for a reunion lunch, thinking it was a similar setup as the Green St location. NOPE! There are 3 metal tables with some chairs, but definitely not the same decor as the other one. Nonetheless, still good food. Prepare to wait for it!

Perk: they sell slices during lunch hours."}
{"text":"I hate to have to lower my rating, but sadly I must. The pizza is always good. Still was on this occasion. However, we had quite the long wait on my most recent visit. We were given a range for when our pizza would be ready and we arrived during that window. We waited until the time was up before asking what was going on. We were first told 5 more minutes. Then a bit later we were told that we were the next up.  Then again a bit later we were told 8 more minutes. Seriously? So 20 minutes after the end of their window, we get our pizza. Any compensation for our wait? Nope. Just an I'm sorry. They could have at least offered us a coupon or a soda or something. Ridiculous. Similar situation occurred when my brother had gone with friends recently. 

Oh! Almost forgot. Ordering was a MAJOR pain. I would call and call and no one would pick up. Finally someone picks up and puts me on hold. Then hangs up on me. Call and call again. Then someone picks up and takes my order right away. *sigh* Much improvement is needed. But they are soon combining with the campustown location to serve only on Neil St. So we will see what happens."}
{"text":"A Champaign staple.  This is a must have when you come to town. Famous for their deep dish, but any crust you get is a winner. They have the best sausage in town IMO."}
{"text":"You'll have to wait a while for best pizza you can get around here, and it's not cheap, so budget accordingly. Still, it's good pie!"}
{"text":"Deep dish is soooo good. I was stuffed on one slice."}
{"text":"Good service and good food.  Very limited parking is the only con but that's not their fault."}
{"text":"Gotta love Papa Del's! Be sure to get a container of their parmesan cheese - it totally beats the stuff from the store."}
{"text":"Same good pizza as the old location, best pizza of its kind in C-U, hard to eat just one piece but that could be a meal by itself."}
{"text":"Let me first state that I love their pizza.  I have been getting Papa Dels since I came to U of I in 1988.  Over the years I have probably spent thousands of dollars on their pies both thin, pan and stuffed.  Last night was the final straw.  Papa Dels does not have a good business model.  They have the potential to be a great pizza place, one of the best in the state.  Unfortunately, the service is terrible.  They have always been slow, it takes at least 35 to 40 minutes for a thin crust when they are slow.  The employees they hire have obviously very little training and no customer service skills whatsoever.  When I was told it would be 50 minutes for my pickup order, I was fine with that.  I usually even at 5 to 10 minutes to the time they tell me.  I show close to an hour after placing my order, pay and they tell me it will be a \"couple\" minutes.  So after sitting there for 15 minutes I inquire how long for my pizza to be ready.  After another 5 minutes, it obvious they can't find my order.  I am then told it will be another 10 to 15 minutes.  At this point I am upset, they don't even act like they care.  I finally tell the young kid behind the counter I want a manager so I can get a refund on my credit card.   The so called manager rolled his eyes at me when I asked for the refund and obviously couldn't care less if I was unhappy.  The worst part was this is the second time this year they \"lost\" my order and another time they gave my pizza to someone else then offered me their pizza.  They don't offer you a discount or any compensation for their screw up.  Well you can wait and eventually you can get your food.   Its just not worth it anymore.   The owners are putting a ton of money into their new building, I wonder if they will invest anything in new training and better hiring.  The people they have now are costing them money, and I won't be spending mine their anymore, which really bums me out."}
{"text":"Location, location, location!!! This place has the same great pizza, but is somewhat away from campus. Good for carry out and delivery."}
{"text":"I ordered two pizzas for dine-in, and I specified it over the phone twice that we want to dine-in and not take-away, and the receptionist said OK both of the times. Turns out that there were two Papa Del's in Champaign and we went to the other one. After waiting there for more than an hour, and after multiple investigations they tell us they don't have our order at all. And then only they say that maybe you placed your order on the one at Crossing but they don't offer dine-in. At this moment, I called the manager of Papa Del's at Crossing and asked him about why the order receptionist confirmed for our dine-in twice if they don't offer dine-in. He had nothing to say. Also, they had my number and didn't call me even after 1.5 hours of order. Even after all of this mess, he didn't offer me any discount and said that it's on us if we want to take the pizza or not, which I'm sure must have been cold by now.

Pathetic service!"}
{"text":"Hands down, absolutely the best deep dish pizza!"}
{"text":"Wouldn't really use them for delivery, always assumed this was a take out type of place. Either way you know what you're  getting. Great deep dish pizza. Two slices will fill up just about anyone. It may be a little to \"bready\" for some.. it is a lot of bread but it's delicous."}
