{"text":"Service was good.  Everyone was nice.  However, towards the end of my meal when the store was slowly emptying, the owners start gossiping about other taiwanese restaurants.  I thought quite unprofessional.

Popcorn chicken was crunchy and fresh. Chicken was not dry and full of flavours.

Pork thick noodle soup was okay.  the soup base was sour and kind of bland.  The pork stripes were interesting as it was covered in fish paste therefore extra soft and had different levels of texture.

Satay pork thick soup with rice had a similar base as the noodles, the base again was sour.  not enough satay flavours.  overall, same feeling as the noodles.

Big portions for a good price.  So full after"}
{"text":"Great food, OK prices, horrible seating. Many people order take-out instead, and I can see why after visiting the \"restaurant\". If you decide to dine-in, be ready for some hard selling by the old guy who claims to be an ordinary server there. Still, the food is good."}
{"text":"Overall delicious and good quality for a local mom and pop restaurant.  It's a small joint, so ideal group size is 2~4.  It can be delicious but greasy for some.  I would come back for Taiwanese food craving."}
{"text":"It was jam packed when we went around 7:30pm, restaurant was tiny with limited tables.20 mins wait but the food was good. ordered the minced beef, Taiwanese sausage with rice and a side order of popcorn chicken which was nice and crispy.

Overall service was good, food was delicious and cheap!.. just expect to wait during dinner time."}
{"text":"A hidden gem for (mainly) Taiwanese street food. The store is really, really small, and decors are basically non-existent, but the quality of the food is great!"}
{"text":"Had a horrible experience at this restaurant.  The staff were extremely rude and ruin our night. The place is filthy."}
{"text":"Ordered the pop corn chicken and chicken fillet bento box. It was bland and lots of msg. The oil used was 'dirty' because we could feel it in our throats after eating the food. It's my 5th visit and will be my last.

Is it under new management? The decor and menu has certainly changed for the worse."}
{"text":"After renovations,  new logo cool design with Papa Changs image logo, so cool with his own knife carrying on it!! Amazing! !
Also finally you guys no need to go til back there for toilet, why??? New washroom is located at the front now, much more conveniences right now!! 
Also more waiters served in the dine room, mean less time to wait for your foods now!! Yeah!!! Welcome back all the fans to come taste for all your favorites Taiwanese amazing foods again!! Hope to see your guys around in futures!!   Genesis - Aug 21, 2014; 4:30pm lol"}
{"text":"Awesome food! Absolutely love their fried pork belly and intestines.  Best part is, the fried foods is not overly drenched in batter, you can actually see and taste the meat.  Yes, it was crunchy and mighty tasty!  Pricing is very affordable and not over priced at all.  

Seating isn't enough causing huge line ups but worth the wait.  Be sure to have the whole party ready for the table, else they won't let you in until the whole party is there.  Which is understandable.  Just hard to wait in the cold during winter.  But they do have an option in giving you a call.

Service was awesome. Server came by with hot tea refills often, which made my two seniors very happy.  

I'm super sensitive to MSG, thus refusing visits to most Asian restaurants.  I don't seem to have any reactions at Papa Chang.  I'll know instantly if there's MSG.  I'll be out of commission for the rest of the day if I get that instant spidy tingle. I am definitely a returning customer! No msg rules!!! 

Ps.  Reading the reviews posted on Yelp.  Papa Chang does care about customer feedback.  I really appreciate that.  Because it's business owners like this who strive to improve on better food/experience always makes next visit so much more exciting and worthwhile! Good job Papa Chang!"}
{"text":"Very good Taiwanese restaurant. The place is very small and one of the server is very rude (your group must all present in order to seat you, no exception). Overall service is okay except the old gentleman. 

I like their dish is small and tasty. You could try more items in this size. The price is reasonable and I definitely will come back again!!"}
{"text":"This place is amazing for the price they charge! Everything on the menu is under $10, and the food always come out hot and super fast. Service is pretty good for the kind of place it is, although the place is a little cramped. The portions are kind of medium, not too big not too small, perfect for a girl's appetite. I'll definitely come back again for food/takeout for lunch!"}
{"text":"Visited the place and pretty happy with the food. Price is right and lot of variety. Popcorn children and the signature beef noodle are both nice. The space is quite small but food and drinks are great."}
{"text":"I gotta say, the food here is really good. 
Ordered 
Meat floss pancake!
Popcorn chicken
Green onion pancake
Beef noodle soup
Pork rice soup

I would definitely recommend the Meat floss pancake, which is like a green onion crepe with a fried egg layer, lettuce, sauce, and pork MEAT FLOSS. Rolled into a yummy package. the flavour is reminiscent of duck lettuce wraps. 

Popcorn chicken is also highly recommended. 

all that food was $32 tax in. 

The only thing i'd worry about is the limited seating. there's room for 24 people. So you might want to consider take out.

enjoy!"}
{"text":"Despite having noted from fellow reviewers that Pa Pa Chang's is tiny, I was still surprised by just how little space there is. We were a party of 5, but I would not recommend going with a group larger than 4. Even 4 is pushing it if you're going at a busy time. 

While the seating was not the most comfortable for a party of 5, I was able to sample a large variety of dishes. The food ranged from nothing special to tasty. The popcorn chicken was very well executed - the meat was tender, juicy and not dredged in too much flour, though I did find it a bit too salty. The skewer fish, Japanese-style tofu and rice with Taiwanese sausage and minced meat were also yummy. If pork belly is your thing, then the deep fried version they offer here is worth trying.

On the other hand, the takoyaki, pork thick soup, shrimp wonton noodles and pork floss pancake were unimpressive. 

Service was friendly, but I'm not sure I enjoy the food enough to be returning."}
{"text":"Food is good, they just did renovations so is a little nicer. I always get take out from this place. Price seems to gone up a little bit as well but I guess that's to be expected with the popularity. Mince Pork w/ rice. Yum!"}
{"text":"My husband and I came here before and the food was pretty good. Today is the first time we came after they renovated. We walked in to order take out. The owner took our order and asked us to wait for the food outside. The restaurant is not that full when we were there. There are still couple tables available and no line up. I was very shocked. Keep in mind that the plaza is pretty empty. There isn't anything to shop around while waiting. I was very dissappointed with that. It's starting to get cold and he made us wait outside. This was very rude of them. As we waited outside for our food, there was no one single person that walked into the restaurant."}
{"text":"Great local spot for taiwanese fast food. 

I was introduced to this place through a friend. It's a tiny restaurant tucked away in the corner of markham and 16th. This place has the relaxing comfort of a family owned business, no rush or pressure. 

The highlight of this restaurant to me is the popcorn chicken. It's got a very interesting flavour and texture which reminded me of wasabi squid balls at other places. This is not a complaint because the combination gives you a different take on the classic popcorn chicken. I also ordered their flat bread sandwiches on different occasions, the bread is always crispy, chewy and light. The benzo boxes leave a little to be desired but considering the price, still a great deal.

This is a great ethnic fast food alternative to the usual large chain fare. One word I can describe this restaurant as is consistent."}
{"text":"Didn't let my wife and I with our baby's stroller. I could understand if the place was busy but there were 2 ppl is there. Lol"}
{"text":"Having been told about this place by a number of people and talked about it with a buddy, we decided to check it out last night for dinner.

The main store is located in a seemingly tiny plaza just west of Markham Rd (aka Main St.) on 16th Ave. You'd never know it was there unless you were told by someone or found it by pure chance. Parking would be considered limited since it's shared between all the businesses there. But we showed up around 7pm on a Sunday evening, so I figured it was probably a slow night. I was wrong. The dining area inside was small but crowded. We got lucky and were seated immediately in the last remaining table right before 3 other families came in after us.

The first thing that surprised me was the many different options on their menu. Usually, places with limited seating limit their menu choices to a few dishes they are really known for. However, Papa Chang's had many good options and the prices were amazing.

My buddy and I both ordered the signature beef noodle soup, taiwanese sausage, and deep fried salted squid balls. The service was excellent and everything came out within ten minutes. That was when we were both pleasantly surprised by how loaded the noodle soups were. Though the bowls seemed like a small size in a Vietnamese pho restaurant, it was packed with meat and the soup was really flavorful. The sausage and squid balls were equally tasty and filling.

When busy, it looks like to the good folks who work there won't let you tarry too long. If you've finished your meal and don't plan on ordering anything else, they will politely check on you before the dishes are promptly cleaned and the bill's ready to go. All perfectly understandable since there were no shortages of people ordering take out and a bit of a crowd had formed at the door waiting to get in.

All in all this is absolutely a place that my buddy and I would not hesitate to come back to or share with friends and family."}
{"text":"Really great place! If you are looking for some home cooked meal. Juicy chicken schnitzel and pork belly marinated to perfection. I will come back!"}
{"text":"Finally, Me and my friend came to this place for lunch today. We heard about it from one of our friends a while ago. Fortunately, we didn't have to wait and got our seats very fast. All servers were so friendly and offered good service in the restaurant. We ordered one of our favorite Taiwanese dishes - Signature Beef Noodle Soup as well as the Taiwanese sausage & minced pork rice and skewer fish. They all came out fast and hot. They were so tasty and delicious. This apparently will become one of our must-go restaurants when we want to eat Taiwanese food. Will recommend this place..."}
{"text":"Came here with a friend because there isn't too much choice for Chinese cuisine in eastbound Markham. It's a really tight seating place and there is no space between the entrance and the dining area, so it's cold when every time ppl come in,awful experience.service are slow and rude."}
{"text":"Yeah the food is cheap  and great food got to eat hear , the place is kind a small but I tell you all the food is good and cheap ."}
{"text":"Fairly speaking, it is good and better than several other beef noodle. But compared to Taiwan local beef noodles, this is just fine. The noodle is a little sweet and should be better if not so sweet."}
{"text":"It is a great restaurant to hang out with friends. Very delicious Tawniness food!"}
{"text":"Came here again and ordered:

-Popcorn chicken
-chicken skewer
-japanese tofu
-fish skewer (loved this)
-pork chop bento
-beef noodle soup
-bbq chicken on sesame flat bread
-sausage and minced pork on rice (this is okay, probably won't order this again) 


Overall, I was satisfied with most of the items. However the rice bowl didn't have much meat on it. The majority of the bowl was rice, with a sausage on top, and a bit of minced pork in the centre. 

I wanted to get the pineapple cakes, however the owner said I must place an order in advance."}
{"text":"I've been to Papa Chang many times before and I have noticed the quality of food deteriorating over the years. I usually order the minced pork rice with sausage. I like how they minced the pork into small strips instead of using standard ground pork -- it makes a LOT of difference in taste. 

Papa Chang recently opened in Pacific Mall and my boyfriend and I decided to give it a try at this location. I ordered the minced pork bowl again. To my surprise, I see who I persume to be Papa Chang himself inside (same as picture). Anyways, I was watching the server scope and minced pork and chop the sausage -- I just casually asked if she could put more sauerkraut. Papa Chang told her  \"Put the normal amount, sauerdraut is extra cost.\" RIGHT IN MY FACE.

Awkward moment for me and my boyfriend standing there. I can't believe they can be so stingy. I told my boyfriend -- if they don't want to add a few pieces of sauerkraut, they could have not said anything and gave me the normal amount. If they let me hear PUT THE NORMAL AMOUNT...before I even eat my rice, I've lost all my appetite.

Now the critique of the minced pork with sausage:
- mushy/watery rice, very hot
- the egg tastes bad (I just ate the egg white and threw away the yolk)
-the pork tastes normal (thankfully, not a total waste of my $6 ) 
-overall I give 2 out of 5 points, but I must deduct 2 points for the bad service, so in the end it will be 0 points... 

Never coming back."}
{"text":"Went with a friend around 12 PM on a Friday. Wasn't busy, we were seated right away. The restaurant is very small with only around 10 two-person tables. Not a good idea to come with a group bigger than 4, especially during busy hours. There was only one waitress for the whole place, but service was still fast and friendly. The menu had a good number of selections with lots of photos and were all very affordable.

We ordered a popcorn chicken bento box and a curry fried chicken filet w/rice (both $6.99). Bento box came with sides of tofu, green beans, and fish cakes. Popcorn chicken was crispy, but a bit lacking in flavour. Plenty of rice. Curry chicken bowl was a good size. Curry and chicken were both very good but the rice was a little clumpy.

Two dishes came to a total of $17.38 including tax and tip.

Overall, Papa Chang's is a nice casual spot and we would definitely come again! :)"}
{"text":"Papa Chang reminds me of some of the delicious treats you get off a food truck. They serve food in take-out style containers and each bite of anything you order is full of flavour! 

Its always busy at lunch time as the place only has around 3/4 larger tables and 2/3 smaller tables. It seems like there isn't a washroom, but you have to go through the kitchen to use the washroom. 

Some of my favourites are: 
Popcorn chicken
Curry pork rice bowl
Beef noodles 
Pork belly
Intestines
Pork on rice 
Taiwanese Sausage"}
{"text":"Feels slightly like going to someone's house for dinner with the service and walking into through the kitchen to the washroom. The wait was 15 minutes for a table of three, they took down my phone number and gave us a call when a table was available. The food was great, everything we ordered was flavorful and very similar to authentic Taiwanese night market vendors. Will definitely visit again but maybe on a weekend night when it might be less busy."}
{"text":"Pros: 
-popcorn chicken is much tastier and cheaper than other restaurants
-minced beef rice is cheap and filling
-skewers and meat floss pancake are good!
-newly renovated
-bubble tea is reasonably priced
-good service

Cons: 
-there's always a lineup but they will call you when a table is available
-very cramped...you can basically hear the conversations of your neighbours 
-each dish is cheap, but the bill can add up since each dish is snack-portion

Overall, best taiwanese food in the area!"}
{"text":"Went north to Markham this weekend. The weather is cold and I was looking for some comfort for my stomach. 
The place was small and warm. The service was ok. I ordered the sausage rice, rice cake and the egg roll.
The rice cake was fantastic. I like the sauce. It was special. Not too sweet nor sour. A good complement of the greasy sticky rice( greasy doesn't mean it is not good).
The sausage rice and the egg roll is ok. The sausage which should be the focus was actually mediocre. 
Over all, a good place. Fair price, proper portion."}
{"text":"Cost: very reasonable 85%
Quality: very good 85%
Decor: poor to average with only 24 seats shared (4 tables) - 65%
Staff: Mr. Ho is very friendly - 90%
Value: very good 90%"}
{"text":"Went to this cute little shop in Markham with my family and was pleasantly surprised. Ordered the popcorn chicken and beef noodles and satisfied with the portion size and fast service. The updated look and reno that they did liven up the place. Definitely will go back."}
{"text":"Took my daughter here for dinner a month ago or so and had a really great meal. Seating is limited and we got the last two spots in the restaurant. We shared the popcorn chicken to start and then I had a really good pork chop with curry sauce on rice. Even though the food came quickly they apologized for making us wait and brought us some free winter melon juice. We will definitely be back."}
{"text":"It's really hard to find an authentic taiwanese place, except when you go to bubble tea places and pay for overly priced food.  The taste of the food definitely exceeds the price I pay for.  

Although the place is small,  the restaurant is very clean and the staff are great.  

I would recommend the oyster pan cake.   I don't know any place else that sells this except at night market (which was horrible that I couldn't even put it in my mouth). The oyster pancake here actually had taste in it and wasnt filled with the starch that they make it with.  The tako pan cake was also very good in my opinion.  It was crispy and the sauce they pour over it was delicious.

I would definitely come back here again.  There are so many snacks that i still want to try."}
{"text":"Love the food but not the customer service 

I asked for less wasabi sauce on the food but the lady said either you want it or not. You cant be less."}
{"text":"Been to this tiny joint twice now and left satisfied on both dine in.  So far I have only tried their beef noodle soup, sausage, and popcorn chicken; everything quite solid.  Have to compliment their tea, I believe it's green tea that they serve, for FREE!  Their drink selection is quite long for a small food shop.

Will be back again soon, real soon!"}
{"text":"Nice and convenient for those living in the north east gta that like asian food.  Much better than your average bubble tea shop food."}
{"text":"Came here for takeout. It's cheap, fast and filling. I got the minced pork rice and the popcorn chicken bento. Total came out to be about $12. Really good bang for your buck since you get a pretty decent amount of food. Considering that I got takeout, the popcorn chicken was still fairly crispy when I got home 10 minutes later, so I imagine it would have been even better if I ate there. The bento came with sides: Tofu, green beans and fish cake. It's pretty oily food, but that's kind of expected. The minced pork rice was flavourful, filling and bigger than I expected, considering it cost about $4. Only down side is, if you want an egg with it, that has to be ordered separately as an add-on. I didn't realize that until after I left. All this food lasted me 2 meals. Overall, not bad for 12 bucks total."}
{"text":"It reminds me when it was in Taiwan!!  Beef noodle is amazing!"}
{"text":"Eating and writing at the same time. This is definitely an awesome addition to the Taiwanese cuisine landscape. Really hard to find good Taiwanese food in GTA (don't consider food at bubble tea places good). The prices are reasonable. Bubble tea is decent and cheap. The people are friendly. Would definitely come back (often too)."}
{"text":"GREAT Taiwanese spot! 

Went to Pa Pa Chang's at 3PM on a Wednesday afternoon, and the restaurant had stead flow of people dining in and getting take-out. The restaurant itself is quite small, but adequate for a quick lunch spot. The service was great. The menu is quite big! It has traditional Taiwanese snacks, as well as larger rice, noodles, and bento meals. 

Try the signature beef noodle soup. It's delicious! The noodles are a great texture, thin, and flat. The beef and broth is flavorful. It also has some some bok choy, and pickled vegetables. I'll definitely go back and try their popcorn chicken, and other Taiwanese snacks."}
{"text":"We stopped here to pick up some popcorn chicken that they were famous for. We ordered 5 minutes before we arrived and it was ready waiting for us.

I've had a lot of popcorn chicken over the years.This was fresh, delicious and hot. Like many of my reviews, it did not blow me away but it was among the best versus its peers.

I'd definitely come back and see what else this place has to offer.

4 stars"}
{"text":"The food there is amazing, but the service is HORRIBLE. I've been there twice, and I only got yelled at by this fat old asian lady three times. She is so rude to me and my friends, and gives us attitudes.
 
For example, the second time I went it was very crowded so she told us to wait outside. When we saw a group of people leave, my friend went into the store thinking it's our table. But then that rude waitress literally yelled us and said \"WHY ARE YOU IN HERE, ITS NOT YOUR TURN YET GO OUTSIDE\" and gave us a glare and did the asian sigh LOL. She could have just politely told us it's not our turn yet. SHE HAS PROBLEMS. 

I probably won't visit this restaurant again unless they fire that lady. Other than her, everybody else is very nice."}
{"text":"Fantastic spot for Taiwanese style food in the older area of Markham. It's definitely a small space, so seating is limited, but they have a great menu with lots of Taiwanese/Japanese style dishes and snacks (similar to what you would find at a bubble tea place, but more items)

As others have already noted, the popcorn chicken is indeed delicious. Their takoyaki is good as well. Lots of toppings, but the filling was kind of runny. There are some big chunks of octopus in them, so at least you know it's not all just filler. 

The Taiwanese style pork/sausage and rice dish was great as well - not too saucy, and the pickled/sour veggies on the side go really well. 

I would rate the food about 3.5/5 but I will give them the extra 0.5 because they don't use styrofoam for their take out boxes. Not very common in the GTA area!"}
{"text":"Awesome food for a great price.  
The wasabi sauce they use on the takoyaki and chicken skewers is easily my favorite thing in the place.  The beef brisket noodle soup is jam packed with flavor and tastes so good it must be bad for you.  The only other places in the area that offer similar kinds of foods are bubble tea places, but quite frankly, their food sucks in comparison.  Definitely check it out!"}
{"text":"Great Taiwanese place tucked into a small strip mall. Been here 3 or 4 times since I found it on Yelp 2 weeks ago, and have not been dissapointed. Have tried the popcorn chicken, stewed streaky pork, taiwanese sausage+minced pork rice, chicken skewers, and beef noodle soup.

Personally, the popcorn chicken is the best item here. Maybe it's because I'm not taiwanese, but the other items seem a little sweet for my palate. I realize this is how it's supposed to taste but I find it a bit muddled in flavor. Also, streaky pork was too fatty, it was 80% fat and they didn't render it enough, so the fat was a little chewy too.

Ambiance is okay for a small place, it's clean and bright. Service is a little cold, especially towards non-cantonese speaking people like me."}
{"text":"I adore this place. It is true authentic Taiwanese food. All of the dishes are consistently delicious. My favorites are the bento meals with chicken or pork teriyaki they use a wasabi mayo drizzle to give a slight kick. The sandwiches are so tasty with sesame bread baked in house and are perfect for lunch. Also try their noodle soups. And of course the popcorn chicken is a must!"}
{"text":"This place is comfortable n cozy.  The owner is friendly and accommodating. The food is tasty yet healthy. Not salty or greasy. The portions are huge for the price.  Cant beat this bargain.  Since the price is so low, we found ourselves ordering what seems like everything. We were a party of 9 n our bill was only $87.  We walked out stuffed. A real bargain."}
{"text":"I grabbed take-out and ordered rice with minced pork $4.50, bento box with popcorn chicken and a bento with pork cutlet for less than $7 a box. 

Looks are deceiving...there is a lot of food in those take-out containers! I enjoyed the variety with the braised cabbage, bok choy and tofu.

I found the quality comparable to food court food so the price was appropriate for what I got. It makes for great take-out or a casual dining experience. 

My only complaint was that the popcorn chicken could have been more crispy and I was super thirsty afterwards. I will order from them again when I'm lazy to cook. Happy eating!"}
{"text":"All in all,  this is a great restaurant. 
I've only been here once, but I'm planning to come again. The food is marvellous. 
The restaurant is fairly small, and you have to wait an average of 20 minutes for a table at regular times, and up to an hour at peak :O. But in the end it's worth it for the food. 
Sure, it may be cramped and it may be fairly rowdy, but boy oh boy, the food is heaven. While I'm taking off one point for the wait to get into the restaurant and the cramped environment, otherwise I wouldn't take off a single corner, and I rate the food 5 stars. 
The popcorn chicken is heaven. Nicely fried, not soggy, and matching perfectly with the dipping sauce. Perfectly seasoned and not overly breaded. This is a staple. 
The fish skewer (unfortunately my mind is forgetting whether it was chicken or fish, I think fish) is above average, with a good wasabi topping that adds a little tang to the dish which leaves you wanting more. again, perfectly seasoned and not overly cooked.
The noodles are also worth a try, with a great soup base and lovable noodles. 
Everything comes out super quickly, sure to leave you astounded after the long wait. All this is topped by the cost of everything, much less than you'll expect. 
To be complete honest, once I get a job and some good money, I'm either going to buy this business and move to a larger location, or personally pay for the move, as I feel this restaurant could do so so much more in a better location, which is something to say (hard to get past almost perfect) 
If I ever feel the urge for some popcorn chicken, they better get a seat ready for me, I'm coming :D."}
{"text":"I ordered the noodles in soup. It is slightly Taiwanese but there is definitely room to improve for a closer representation of Taiwanese flavor. (Yah seriously, even tho the interior decor displays many memorabilia to tap into old Taiwan reminiscence, don't be fooled). Perhaps my expectation was set at a wrong angle. Next time if I ever go again, I will put on a different pair of goggles and possibly from a Northern Chinese food perspective."}
{"text":"Skewer chicken really good. Strawberry smoothie just ok. Satay meat soup pretty good."}
{"text":"Love this place!! Everything is so affordable and soooo goood. Popcorn chicken is so tasty and their noodles are amazing."}
{"text":"If you're looking for a quick dinner, this is the place to call. The minced pork rice is so filling and cheap! Also the bubble tea is different they have mini tapioca."}
{"text":"Papa Chang's serves up quick Taiwanese eats. They give large portions at a reasonable price. I usually get the popcorn chicken bento or the taiwanese sausage on rice. The place is quite small and usually somewhat busy. I prefer to call ahead to pick up takeout."}
{"text":"Pa Pa Change is conveniently located in a Plaza with plenty of parking, perfect for people picking up their take-out order. There are around five tables to seat their dine-in customers, and the interior has a homely feel. 

Maybe I didn't order the right items (ie. Bento box) but I was disappointed with my beef noodle. The beef was tender, and the soup base was not overly salted, but the noodles were so over-cooked that it had no texture at all. 

The oyster pancake sauce also lacked flavor, and was overall really dry not to mention unauthentic. The egg roll pancake skin was so soggy that there was water dripping out one end. The Taiwanese style meat ball was pretty good - the skin was nice and glutinous and the filling was seasoned perfectly. 

I also liked their Winter Melon Juice - it's quite a large cup for the $1.50 price tag! 

They were sold out on the pineapple cake when I visited. I'll still come back, but next I'll be ordering the bento boxes."}
{"text":"Okay, I'm addicted.  I think about popcorn chicken from Pa Pa Chang all the time!

It's crispy and just the right amount of greasy and served with delicious dipping sauce.  

The deep fried pork belly ($5.99) was also so freaking good.  
Sure, you can feel your arteries clogging with each bite... but it's worth it. 
You might want to share this dish.

We split the Taiwanese sausage and mince pork on rice ($4.50)
It was filling and a nice change from the fried snack food.

The Beef Pan Cake ($4.25) was huge but surprisingly less heavy than expected.

I want to be here having fried snack food right now! O_o"}
{"text":"Been here a couple times.. always good.. cheap prices.. meal under 10 bucks. We called ahead to order food for 5 people and they told us it would be ready for pick up in 15min, mind you it was a freezing cold -26 degree night and the restaurant was empty, our experience tonight super fast, tasty and delicious. Me and my fiance both ordered the popcorn chicken bento (7 bucks)..also ordered some fried tofu and the others had the sausage rice bowl and teriyaki chicken bento.. everyone was satisfied! What more can you ask for?!"}
{"text":"You cannot be upset by the food or service. It's cheap food homemade style food! I recommend the popcorn Chicken bento and the onion pancake!"}
{"text":"Found this place through Yelp and just had to try it out after the great reviews! Ordered the popcorn chicken and takoyaki, and it was all amazing! 

Popcorn chicken was crispy, tasty and not at all greasy! The side food in the bento came with a vegetable spring roll, soft cabbage (really great) and two pieces of Tofu and fish cakes. 

I wasn't disappointed! Will go here again!"}
{"text":"Very small dining room and far from downtown, but worth the trip.  
Cheap and cheerful is the best way to describe it.  Food is very good for the price, and you'll leave feeling full, but not stuffed.
NOT a place to linger and chat.  Eat and move on."}
{"text":"I've been to this location multiple times and the new location. I like both! But I feel like this one's more authentic because of the atmosphere.

I always get the curry, beef noodle or pop corn chicken. I want to try other things but can't resist the classics.

This time I went, they gave us a sample of their home made kimchi with no added preservatives. It was really good. Perfect amount of spicy and sour for me.

Im so excited that they cater. I'll be moving into the area in the future and I can't wait to be closer and cater for house parties!!!!"}
{"text":"Love this place!!!  Great selection, good prices and yummy food!!  I like the popcorn chicken, the sticky rice and their noodles!!  Service is also very attentive and quick!  Only downside is the small size of the restaurant - it gets very squished and uncomfortable sometimes when the customer next to you is 2 inches away from your table.  Otherwise great little place for lunch or dinner - I highly recommend!  Must also go early for a spot - gets quite busy!!"}
{"text":"Ive been here twice for dinner in the past couple months and really enjoyed the food.  Each time I ordered the main popular rice bowl. I forget the actual name but it comes with rice, minced meat, some pickled cabbage and a Taiwanese sausage. I always order the marinated tea egg because I love the way they taste. I've been to Taiwan and these eggs taste just like the marinated eggs in Taiwan. I also ordered a side order of the snack size popcorn chicken and the first time I went I ordered the fried intestine. Everything is delicious.

The portion sizes are small but filling. Its great for sharing and each time my dinner partners enjoyed their food.  The prices are very inexpensive so you can gorge yourself for under $20 here. Everything is basically $10 and under.

The staff move quickly and likely expect you to order quickly as well. They are \"friendly\" in so much that they aren't rude. But like any Asian restaurant dont expect them to roll out the red carpet for you.  They want to serve you what you order and then they want you to leave so the next group can come in and get fed.

The restaurant is VERY small. The tables are very close together so you'll end up hearing your neighbours conversation and they'll hear yours so this isnt the place you want to go if its supposed to be an intimate private event. And because the restaurant is so small its best to come either right before dinner time or right after dinner time otherwise if you come during the dinner rush you'll be waiting outside for a bit. Thats right, the restaurant is so small there is nowhere to wait.  They have a system set up where you give them your phone number and they'll call you when they have a table ready for you but it could be a while. Theres a nice little sitting area outside of the restaurant that you could wait if the weather is nice. Like most Asian restaurants though its all about turn over so people move in and out pretty quickly.

I give Papa Chang's 5 stars because its just good old fashioned Taiwanese food.  It tastes great and its inexpensive. Just what you'd expect from a place like this."}
{"text":"Wacky little place. It was different (in a good way), and yes is order from here again. I ordered about 8 different dishes to share, sorry I forget the names"}
{"text":"Was here for lunch the other day. When we first walked in, the place was busy; had to wait about 15 minutes for a table (mind you, it was a dainty place). As we waited, we noticed that take-out was a popular option. 

The servers were attentive and polite. We liked how they thoroughly cleaned every table before seating someone down. 

It didn't take long for us to receive our food. It literally came a minute after we placed our order. It's a great place to grab a quick bite. We enjoyed all our dishes and left satisfied."}
{"text":"Food comes in small portions but it's all generally pretty good. Only con is there is limited seating, and there's nothing to do nearby when waiting for a spot. Wait staff will request that you wait outside in the parking lot."}
{"text":"My second time here but nothing really stand out to me,  I ordered the braised mince pork on rice, it didn't come with soya egg, pork taste was ok but rice was mooshy, it's like baby food. There are not too many foods I hate but mooshy rice is one of them. The popcorn chicken was good but my husband didn't touch the rice at all. The pork wonton soup was very bland and it had only two wontons in it."}
{"text":"Cheap prices cheap food, that's all I will say. 
You get what you pay for 

If you are a normal person, take your business elsewhere, if you are Asian like the other reviewers here or you are just cheap. This place is for you.

Update: 2 hours after I got a very bad stomachache. Stay away!"}
{"text":"Been here a few times and have ordered takeout a few times - really enjoy quality Taiwanese food in Markham.

The restaurant is off to the side in the plaza and is pretty small - probably seats roughly 20 people at max capacity.   The chicken skewers are pretty good, as are the noodles and taiwanese sausage rice.  I'd recommend the regular order over the combo as the combo gives you extra marinated veggies/spring rolls which isn't worth the few extra bucks in my opinion.  I also am not a fan of their bubble tea but overall the food was great."}
{"text":"Came here for dinner in eager anticipation due to the raving reviews! We each ordered a signature beef noodle soup (four in total), with a side of fried intestines and popcorn chicken. 

The popcorn chicken came first, and, true to the reviews, it was absolutely delicious!! The batter, though thick in some parts, was not heavy at all. I purposely grabbed it with my fingers to test its greasiness, but my fingers came away virtually free of any oil blemishes. 

The beef noodle soup, on the other hand, was a different story. My three family members ordered the spicy version (read my tip on that after), while I got the original. The soup was not at all good. Even I can make a better version of it at home. The broth was overly sweet, with too much sesame oil, and lacked any meat flavour whatsoever. Adding the spicy sauce made it slightly more bearable, but there was still far too much oil and the sweetness of the pickled cabbage was still very much present. We were not fans of it at all, and realized belatedly that we could have ordered three to share. With that being said, I was pleased that m bowl had so much tendon (basically all tendon, not much beef).

The pork intestines were okay. There were some crispy bits, but on the whole, the intestines were overly fatty and oily. The best intestines I've had thus far were definitely those at Swatow on downtown Toronto, Chinatown. 

Overall, I didn't find this place to be as good as others have stated. Maybe we ordered the wrong things, but really, only the popcorn chicken stood out to me. Will likely visit other places in Markham instead of returning, since there are so many choices in this region!"}
{"text":"Great place for value, Taiwanese taste and speed!!

Inside the plaza at 16th ave and Markham Rd beside the convenient store. This small restaurant seats only about 24 people (no joke!). I usually expect to have to wait for a seat. That's when you know the food is good! I've been here a million times but somehow didn't write a review. 

They have a wide selection of small dishes, snacks and bento boxes (kind of like a combo tray with a main and some side dishes all in one). They're prices are mainly all under $10 and portions are just perfect.

They have good things like SKEWER CHICKEN/FISH (deep fried on a skewer and drizzled with sauces), INTESTINE ON VERMICELLI, TAIWANESE SAUSAGES AND MINCED PORK WITH RICE (an awesome deal), POPCORN CHICKEN, TAIWANESE SAUSAGES, APPLE SIDER (an apple flavoured soda, yes not cider), etc.

They also offer TAKE OUT if you're in a rush.

TIP: their TAKE OUT CONTAINER lids do not fit perfectly .. that's why they give you an elastic band but still be careful.

OR they also opened an express version at the upstairs food court at PACIFIC MALL down the middle row.

They now do CATERING and in case they don't state it in English, it says TAX FREE if you're paying by cash. They range from $30-$38 per tray at the moment. (Photo uploaded)"}
{"text":"This place is one of my favourite places for Taiwanese food. I normally order the Popcorn Chicken Bento and Beef Noodle. The price is very affordable and the food comes quickly. Service is what is expected for this type of restaurant, nothing spectacular but gets the job done. The restaurant is quite busy during dinner time and there is a line sometimes. You can leave your phone number and they will call you when a table is ready."}
{"text":"This tiny restaurant is very authentic Taiwanese food. 
It is small and hidden in a plaza on 16th and Markham Rd. The tables inside are quite small and usually group of 2-4 is a good size. May often need to wait for table if it's 2+ people. 

I like this location better than pacific mall location (located on 2nd floor of pacific mall). Simply because I think this location tastes better. 

Price 4/5* depending what you order. Their sausage minced pork rice is good and filling. 

Taste 4/5* I usually get rice/noodle with veggies on the side. Their side dishes are tasty too. I usually get sausage cause taiwanese sausages are sweet and chewy. It is something I crave for and would go back for. They also have bento boxes available for a decent price. I ordered for lunch take out and it was a good portion (but I had better one from scarbrough)"}
{"text":"My Wife and I were interested in trying something different from our usually chinese/japanese eating spots.  So we Googled cheap eats in our area and Pa Pa Chang's on 16th Ave was on the list so we decided to give it a shot.

Place was a little small for seating arrangement however.  On our arrival the place was near packed, we were lucky to get a seat upon our arrival.

My wife decided on a Bento box with braised pork and I opted for a rice bowl with Minced pork and Taiwanese sausage.  Def worth return visit for the Taiwanese Sausage (at least for me, wife was so-so on the sausage)  For Filipino readers, the sauce in the rice dish I ordered might remind you of an Asado flavored sauce. 

To say the least we were skeptical on the portions.  The price was right for our budget.  However upon finishing the meal, we realized we were really full and we were more than satisfied with the meal.  So don't let the visual perception of the portioning fool you.  Oddly enough 2 nights previous we went to a Korean BBQ resto for dinner and we were actually more full with eating less food after dining at Pa Pa Chang's.  Which is interesting to note. 

we learned there is a branch at Pacific Mall, so we shall take a visit to that spot on our next outing for Taiwan/Japan munchies.  We are looking forward to trying their popcorn chicken!

We like drinking water with our meals usually, and it was really appreciated that at least the Highway 16 location of Pa Pa Chang's offers filtered water and not from tap.  So kudos to Pa Pa Chang's on their offering of good tasting water.

Worth the trip, 45--50 min with weekend traffic.  we are crossing our fingers that the Pacific Mall Pa Pa Chang's is just as enjoyable."}
{"text":"If I could give this place a 0 star, I would - but unfortunately Yelp won't let me. On second thought, I wish I could actually give it a -10. The customer service here is disgusting - one waitress with the horribly dyed red hair needs to work on her attitude and needs a total attitude revamp. Our entire party didn't arrive all at the same time - we left our phone number and had no problem waiting as we understood that they would want to seat other customers first.

Long story short, the customer service here is atrocious. The waitress with the short boyish cut hair actually allowed us to sit and look through the menu - but her coworker with the attitude issue had reprimanded her for doing so. The waitress with the disgusting attitude kept barking at us saying we weren't allowed to sit and that we weren't allowed to order as the entire party hadn't arrive. She was slamming plates and cutlery on the table - the entire time giving us a death stare and was clearly upset that the other waitress had let us sit. I had about enough and left with my friends.

Why would I give a place like this any business that they shouldn't deserve - it wouldn't sit well with me that I would give them even a cent. If your customer service sucks, it doesn't matter how good the food is. Should consider training that woman to crack a smile - and to make patrons feel more welcomed instead of acting like she's miserable the entire time. Makes for a really hostile and uncomfortable environment.

Would NOT recommend Papa Chang's to anyone."}
{"text":"Small little place. Newly renovated so it actually looks different from the previous pictures posted in the album! Definitely not as.. Cramped as before. Be sure to come in smaller groups. Groups of five or more will have a harder time getting a table. This place is busy!!

Food is authentic! The popcorn chicken could have been a bit Kore crispy but still, no complaints. Their takoyaki had a decent amount of octopus inside. Looks like it was deep fried, but still pretty good. Their bento boxes are pretty worth it! It comes with a generous portion of meat and three side dishes. The three cup chicken is also very delicious. The meat was almost fall off the bone and even the insides were infused with flavour. Very delicious. Would definitely recommend this dish (bento)

Prices are very good too!! Pretty cheap in my opinion for a full meal! I will be back very soon! :)"}
{"text":"Simple foods are often the best but many restaurants don't do them properly. I went to Papa Chang's and ordered a very simple dish, rice with Taiwanese minced meat sauce, a sausage, and an egg. It was delicious. Since I was by myself, I couldn't order any more food but from what I saw at other tables, everything looked delicious. I have to return with more people to try all the other foods as well. 

The wait time on a Sunday afternoon was fairly long (wait for food), not sure if this is usual or not. I originally wanted take out but was told that it would be more than 30 minutes, so I took a seat instead. Still waited over 15 minutes for my food, but it was worth it. The service was also very friendly, which isn't always the case with Chinese restaurants. I highly recommend coming here."}
{"text":"Enjoyed my experience here so much that I came two days in a row. First was to explore with my bf and second time was to show my parents how awesome this place is. I did notice that although they are fairly quiet with seats readily available in the afternoon, they do get busy towards the weekend where they'd take your number and call your number when the food is ready. The food does take a bit of time to arrive though, which isn't necessarily a bad thing since I presume that they are making the food to order. Between the 2 visits I've tried the:
-skewered fish
-fried pork belly
-takoyaki (only thing that is meh. the place in t&t @ middlefield is hands down better)
-beef noodles
-popcorn chicken bento (prefer PC from Lohas Cafe, but still good)
-beef flank sesame flat bread 

Except for the takoyaki I thought that everything was fantastic especially with the price range where most items were 3-6 dollars. They also have really affordable bubble tea at around 2-3 dollars. Cheaper than most bbt so it's ok if it ain't no Chatime. Will come back for sure to explore more of the menu! As a tip though, just don't come when you're short on time OR call ahead for take out! They seem to get a lot of take out orders as well.

More of a 4.5 but I can imagine it growing to a 5 when I develop an emotional attachment ;)

**Also the Papa Chang logo? He's real. In the kitchen. EXACTLY LIKE THE LOGO!!"}
{"text":"Came here on a Saturday around 1pm for lunch with the GF as I love Taiwanese food.  Place was packed but we were seated very quickly.  

It was nice that the servers spoke Cantonese, Mandarin and English.  The menu was not too big nor small.  It showcased simple meals and snacks.  The best food is simple food, done properly.

I ordered the popcorn chicken bento which came with rice, some veg and tofu and the Taiwanese sausage with rice and an egg.  Prices were very decent, for those 2 dishes, it was under 15$ with tip.  I'd definitely come back here again.  I would have given it 5 stars but I was slightly annoyed by the table next to us, which was occupied by two middle aged Chinese men who chewed very loudly, smacked their lips with every chew and burped at least a dozen times (yes I counted).  Other than that, I love this place!"}
{"text":"Small cozy spot - quite tight if you have a big group. I had to share tables with another family, but that was not really a big problem for me.

My partner and I ordered the Popcorn Chicken, Takoyaki, Taro Pancake.The popcorn chicken here is the bomb! The seasoning was on point. Honestly, of all the places we have gotten popcorn chicken - my partner swears by this place as being #1 as well. I loved the Takoyaki as well and the Pancake. For the price that you pay - it's good value. The food also arrived really quick! 

I know they also have a little booth in Pacific Mall, but I feel like they have less options - but perhaps this has changed. But, I'd definitely go here for the full menu. I can't really say how much wait time there might be if the place was packed though."}
{"text":"This is a pretty unique experience for the area. It's in a very \"old towne\" plaza just north of Main Street Markham, but it's a very small take out/cafeteria-style restaurant that reminds me more of something you'd find in First Markham Place. Very tight seating and very busy with people dining in and picking up take out. It's very well run though, and its surprisingly comfortable for such a small space. Given the area, it's a bit strange that we were the only non-Chinese to pass through on a busy Friday night, but that's usually a good sign, no?

In terms of the food, Pa Pa Chang's totally lives up to the Yelp hype! For an app, we had the green onion fried cake with egg. Egg and green onions are such a great combination and there was just enough egg on top that it wasn't sloppy or soggy. It also came with a hot sauce that was pretty interesting.

For the main, I had what the waitress recommended, which was the popcorn chicken bento box. The chicken is dark meat, which I'm usually not a huge fan of, but it was well suited to the spices, so I was impressed. It was definitely different from what I was expecting.

There's a decent selection of tea and bubble tea here as well. I had the green apple green tea, and it was pretty good. These are the prepackaged teas though -- don't expect any actual fruit to have touched any drink you order here. 

The service was very friendly and helpful, and the bill was tiny. This restaurant offers great value for money! I can see why it has such a loyal following and would definitely return."}
{"text":"Great popcorn chicken and pork rice.

Seating is very limited though so probably better off ordering takeout instead.  No double door so winter is annoying even when you get a seat.  

Stupid customers who come in from the cold and hold the door open...happens all the time..."}
{"text":"Went tonight with wife and daughter we all thought it was ok, nothing special.  The popcorn chicken that I was looking forward to was the least liked dish. Fried tofu had no flavour, bland.  My daughter had the bento box and at any Japanese restaurant would be finished not this one."}
{"text":"Good taiwanese food!

Good popcorn chicken!
Good intestines! 
Good takoyaki!
Good pork belly!
OK~ with the Taiwanese beef noodles

OVERALL GOOD (thumbsup) 
they did some renovations so it looks a bit better than before. Walls are red now I believe."}
{"text":"WOW for the value, minced pork with preserved egg rice combo for under $5. Great selection of taiwanese/Japanese style cafe food and snacks. 
We also ordered the fried bbq pork, tasted amaaazing but portion slightly small. Most items on the menu are relatively inexpensive so go try some items. 
It's small restaurant so it might be full during lunch times. 
Overall good food for good price."}
{"text":"Excellent Taiwanese dishes that were reasonably priced. Ordered oyster noodle soup, deep fried pork belly, popcorn chicken and deep fried tofu with pickle. Was hoping it was stinky tofu, but it was the Japanese style which was still good
Definitely coming back to Papa Chang's."}
{"text":"Not bad.  Popcorn chicken is good.  Minced pork rice is good.  Mostly Taiwanese street food items.  I have yet to find a good Taiwanese place in the Toronto area.  Also, this is a very tiny restaurant.  There may be a wait."}
{"text":"The food must be good because it's packed at 1:30. Don't bother trying to get a seat during lunch time. Do yourself a favor and call ahead for pickup. We were just turned away because there's no room especially since we brought our baby in a baby stroller(currently waiting in the parking lot looking for somewhere to kill some time while they work on our takeout order)"}
{"text":"This place is my go to place for Taiwanese food (particularly snacks) and its relatively cheap! I usually get the minced pork rice with sausage and some snacks (popcorn chicken is a must everytime - the best Taiwanese style popcorn chicken I've tried in the GTA). The tofu with Taiwanese pickle and fried squid balls are also super good. Just beware the food is always piping hot (especially the fried snacks) so let it cool a minute before eating. The only thing that I've tried and didn't really like was the Taiwanese beef noodle, that's something I won't be trying again but otherwise everything else I've tried is amazing and portions are generous. Be advised that this place is really small (seating is squished and seats around 20 people) and tends to get busy at dinner time so its not really an ideal place to come with a group of larger than 4-5 (although the table turnover is quite quick since everyone just eats then leaves and service is super efficient) - a lot of people come for takeout so maybe that's a better option. Looking forward to trying everything on the menu!"}
{"text":"This is my go-to place for Taiwanese food in Markham.

FOOD: Great food and value. I love their popcorn chicken the most. They are crispy and flavourful, love the dipping sauce to go with them. I almost always order them when I visit. Other decent dishes are \"Pang Pang\" skewer chicken (fried chicken topped with mayo and seaweed) and their beef pancakes. I also enjoy their signature beef noodles. It's a tad bit on the sweeter side but the broth is rich in flavour and beef is tender. The hand cut minced pork rice is great and saucy. I usually get it with sausage and egg. The picture on the menu could be a little deceiving because it shows with a marinated egg in the rice but in reality, the egg costs extra. Also, their oyster omelette is only available on Tuesday, Wednesday and Thursday which is a bit unfortunate.

ENVIRONMENT: The restaurant is usually very packed and the space is quite small. it's hard to sit farther away from the entrance so it's not the most enjoyable experience to eat when the weather is cold. You'd feel the wind as customers come in and out the restaurant. 

SERVICE: Attentive and friendly for a busy Asian restaurant."}
{"text":"This is my new favorite place for snacks 
It's like going to night market, but cleaner and no huge line ups. 
Food's good and the prices are good. The chicken and fish skewers are a must try."}
{"text":"Great mom and pop shop in Markham for some Taiwanese delicacies. Popcorn chicken and their egg rolls are great. Restaurant is very small, only seats about 15-20 people. Food comes quickly so tables free up with short wait."}
{"text":"It was alright. Not worth venturing up north for imo. I was recommended Papa Changs when my friend raved about their to die for chicken skewers so I made sure I got me some chicken skewers! In addition, I got fish skewers, okonomiyaki, popcorn chicken and wonton soup. The prices were decent, quite affordable, which was why I was tempted to try everything. I was impressed with the lightly battered fish skewers because there was a higher ratio of filet than batter and it was juicy, not dry. The chicken skewer and popcorn chicken were good and the okonomiyaki was not definitely not okonomiyaki. It was edible, mediocre at most but it was bascially potato and cabbage. As for the wonton soup...... 3 tiny shrimp wonton balls in a big bowl of broth and chopped cabbage. Overall, the food was mediocre. I might go back, we'll see. Maybe the Papa Chang Express in Pmall is better so there's a possibility I'll give it a second go."}
{"text":"I had lunch here with my parents recently and I loved it.  The food was so inexpensive and portions were large.  Service was friendly.  My only complaint was that the restaurant is a bit on the small side.

We started off with the Taiwanese sausage ($4.99) and the Takoyaki Balls ($5.49).  The Taiwanese sausage was nice and lean (not fatty) and had that slightly sweet taste to it.  I loved it.  The Takoyaki was not as good as I've had at Japanese restaurants, but hey, Papa Chang's is not a Japanese restaurant, so I can't fault it for that.  They were still pretty good though.  The dough was nice and soft and the octopus at the centre was slightly chewy, but not overly so.  I loved the ever so slight wasabi taste of the drizzled sauce.  The seaweed and bonito flakes on top were also tasty.  

Both my mom and I had the Popcorn Chicken Bento Box ($6.99) and my dad had the Satay Beef Bento Box ($7.49).  

For the popcorn chicken, you can get spicy or regular.  We both chose spicy, which was basically just regular popcorn chicken with a dry chili powder sprinkled on top.  Some spots were definitely more spicy than others and because the powder was so dry, it made me cough a few times during my meal.  Nonetheless, it was delicious.  It didn't have any fried basil leaves though, but the batter was crispy and the chicken was well seasoned.  The chicken was served on top of a bed of white rice that had some ground pork and sauce poured on it.  This gave the rice some extra flavour.  The bento came with a few slices of fish cakes, which were good, but they weren't as hot (temperature-wise) as I would have liked.  I liked that it also came with some green beans (I feel better when there are some vegetables in my meal).  The green beans too were lukewarm.  I would have preferred them hotter.  The bento box also came with some huge chunks of tofu.  I gave mine to my dad, so I can't comment on those.

I had a few slices of my dad's beef satay and they were tender and lean.  The beef wasn't very spicy though.  I would have expected much spicier with a name like \"satay beef.\"  

Service was excellent.  Staff were very friendly and accommodating.  All tables are for 2 and they just put tables together when you are more than 2.  Tables are very close together since the restaurant is so small.  When a single diner against the wall next to us left, we asked if we could put one of our tables against that table (and give up our other table to a single diner or party of 2) so our party of 3 could be against the wall instead of in between 2 tables and they gladly agreed to our request.

The place is in a small strip mall.  There's free parking, but not that much of it.  

Overall, Papa Chang's is a great place to grab some inexpensive yet tasty Taiwanese food.  I don't think they serve that \"stinky tofu\" that is so common at many Taiwanese restaurants here.  So if you are leery of Taiwanese restaurants because of that distinct fermented tofu smell, you need not worry about that here."}
{"text":"I came here with my cousin for an after work dinner. First note: the place fills up quickly and if your whole party isn't there, they WILL kick you out of your seat if they need it. I was warned (in a nice way... sort of) a few times. 

I can see why. Everything we had was super tasty. We had the signature beef noodle soup, the popcorn chicken and deep fried intestines. The portions were quite good (if this is a \"snack\", what the hell is a meal!?!) and everything was crispy when it should be and full of flavour. 

This is NOT the place to go to if you're on a diet! 

We'll definitely return."}
{"text":"S'okay. Decent food for a decent price. Living near Scarborough, I wouldn't drive all the way up just for this place because I could get more delicious food in larger portions in food courts at a cheaper price.

This restaurant is family run so it's pretty small, housing only about 40 people maximum and lacking a waiting area. So when the weather is bad, I wouldn't recommend you come here because you'll have to wait outside for seats."}
{"text":"Terrible experience here. I got the pork curry bowl, and ended up with terrible food poisoning all night. Even beyond that really dramatically negative aspect of the meal, I was completely underwhelmed by the other food that we had. The popcorn chicken was alright but nothing special, the beef noodle soup was average at best, and whatever else we got was so unremarkable that I've forgotten it entirely. 

In short, I wouldn't have understood the hype at all even if I never ate the apparently raw pork in my curry bowl. Definitely not worth the trip."}
{"text":"After reading a number of lauding comments regarding the food at Pa Pa Chang's and reading their menu on line, my husband and I decided to drop by at lunch time today.   Since the menu is rather extensive, it was difficult to choose, but settled on two bento boxes, one Satay Beef and the other Teriyaki Chicken for take-out.

The presentation on both was attractive and that's pretty much where the positive elements ended.  With the exception of the pickled cucumber, which was excellent, the food was flavourless - it tasted as though the lot had been boiled then covered with a thin layer of sauce.  Several of the beef pieces were impossible to chew - this is when we were grateful to be home.  

Even the addition of Sriracha sauce didn't come close to making up for the blandness of the meats - both chicken and beef.  

Having experienced only two of their numerous offerings, I hesitate to make a blanket comment on Pa Pa Chang's food, but today's sampling does not encourage us to return."}
{"text":"After reading so many great reviews, I thought I'd give this place a try.  Unfortunately I was disappointed.

This restaurant is very small but at 5pm on a Sunday, there was plenty of room.

The service was fine.  Attentive and quick to bring out the food but seemed to disappear by the time I wanted the bill.

At a glance, I was very excited by the menu.  Lots of reasonably priced dishes, so we tried several different things.  I'll list what my sister and I tried.

1) I had the wonton noodle soup and my sister had the original noodle soup.  While both were very aromatic, the soup base was very bland.  My wontons were wonderfully flavorful but the rest of the noodle soup was too bland to finish.  And I couldn't find any soy sauce around to add some kind of flavor.  Noodle soup: 1/5, wontons: 5/5

2) Squid rings and breaded shrimp.  I'll lump these together because they provided similar experiences.  Both were lightly battered and tasted great even though plum sauce was drizzled on top.  I was a little disappointed that the sauce wasn't on the side but it was still enjoyable.  4/5

3) Takoyaki and breaded chicken skewers - both were ruined because wasabi sauce was drizzled on top.  My sister and I cannot stand wasabi, so these were inedible to us.  The chicken was actually pretty good from the little I had.  Very disappointed that they didn't put the wasabi sauce on the side.  1/5

4) Popcorn chicken: fantastic!  The chicken is diced a little bigger than I'd expect but this kept the chicken from drying out.  The inside was juicy and delicious. 5/5

I was pretty disappointed in the meal as a whole but perhaps I just didn't order the right things.  I appreciate some of what they offer but I think I'm just not a fan of some of their flavor profiles.  I think if I were to have just ordered the popcorn chicken bento I would have had a much better experience."}
{"text":"Nice taiwanese restaurant fast food style. Popcorn chicken is really soft and moist but seating is very limited"}
{"text":"Great Taiwanese Food quality with affordable price
Fast takeout service
Friendly staffs
Food options are sufficient 
However one star lost because the dining space needs expansion for bigger group. It is a limitation for bigger size of the group if more than 8.  Go early is my tip during dinner hours"}
{"text":"The one female server (short hair) I always encounter is super friendly. The food is decent, but I personally don't think it's anything special. I recommend trying out their Signature Beef Noodle Soup and their famous popcorn chicken. After their renovations this past summer, I noticed their prices increased by up to $2 per dish when comparing their new and old takeout menus. Doesn't sound like a lot, but let's say you dined with one other person and you ordered two drinks, two entrees, and one appetizer - that's a possible (up to) $10 increase per bill!

One major complaint I have about this place is the lack of tables, so for lunch or dinner, you could be waiting up to 45 minutes for a seat. And once you do get a seat, you have to fight for elbow space with the strangers sitting beside you. You can always call or go in to order takeout, but even that will take a while. One time, they forgot to call us back to tell us to pick up our order and we ended up getting it 40 minutes later. The boxes looked like they had been sitting there for a while and the food was cold by the time we took it out."}
{"text":"Papa Chang's is a restaurant that my family regularly goes to. The food is unique to Markham, and the friendly service provided is always appreciated. We enjoy the bento boxes, and signature beef noodle soup among many other items like their popcorn chicken. The only negative, is that the restaurant is very small. I don't feel as if it should attribute to their rating though, because I still enjoy going there so much! On the weekends, there is always a long wait for a table. We often order takeout to void the wait, and still enjoy the food greatly whether eating in or taking out. We recommend Papa Changs to friends and family for a new food experience. They are also very well priced!"}
{"text":"Best Taiwanese food in the city. 

The menu is so deep, the food so affordable, and there is something there for everyone. 

I wish I lived closer to this place."}
{"text":"I've first come across this restaurant at the Asian night market.  They were serving delicious stinky tofu at the time.   However, when Me and my friend went today, We were told that they don't serve it at the actual restaurant *sigh*.   3 out of the 7 dishes we wanted to order were not available, so we only had 4 small dishes and left. The food were just okay, I went with a Taiwanese friend and she wasn't too hype about the food there.   The staff/owner seem pretty friendly, but the unit is a little small for their busy dinner crowd ( take out may be a better idea).   I would probably go back again if I happen to be in the area, but I wouldn't intentionally drive out there again for the food."}
{"text":"Love this place! When you are lazy and don't want to cook this place is perfect. The food is FAST and cheap!!! Oh and ofcourse good! 

It's quite small in there so you might have trouble finding a table, so arrive early if you can. This place does get quite packed starting around 7pm. 

The curry is huge, love the popcorn chicken, love the minced meat rice bowls! I would def. come back for more!"}
{"text":"Probably one of the best Taiwanese restaurants around markham (and this is coming from a Taiwanese person)! The place is very small, so it's harder to get seating on weekends. Their food is great, and inexpensive for the portions that you get. They make great pork chop! I also really like their fish cake (tian bu la)."}
{"text":"In my opinion Taiwanese food is the soul food of Asian cuisine. Street fare is the theme at heart and Papa Chang's does not disappoint! This place is small, but the staff is accommodating so you don't feel awkward going into a packed house. We ordered many items to share including the minced pork rice bowl, pop corn chicken bento box, fried tofu, beef floss pancake and Taiwanese sausage. Everything came within 5 minutes of ordering and all the flavors brings back nostalgic memories of romancing the night markers in Taipei. 
Papa Chang's is awesome!"}
{"text":"One of the best smaller Asian restaurant in Markham. Discovered it during their grand opening and it was fantastic. The service was what really made me say \"wow\". Employees were very courteous, kind and very well mannered. Coming to a small restaurant, good food wasn't something I had in mind, but PaPa Chang really changed my mind. The food was superb and in very generous portions. I'd say I eat a lot, but it was big enough even for me."}
{"text":"Not sure why the hight reviews!!!! This place is okay if you come drunk. When all your taste bids are out of wack. The food is eatable but nowhere close to traditional. The fact that its not own by Taiwanese people explains it. So if you want okay eatable food you can try it out. But if you want traditional, unfortunately this probably not a good spot. Sorry to be so harsh but when I left this place i was actually pretty upset."}
{"text":"This place is an absolute gem! 
Fresh ingredients. Great selection of delicious food. Generous portion. 
I have been there every week since it opened. Can't get enough of it.
It's a reward to me after a long day of work.

They make really authentic Japanese & Taiwanese food. 
Popcorn chicken bento box is my favourite. Only 6.99!
I also recommend Panko Chicken/Fish, or Braised Pork. DELISH!
Of course you got to have yummy bubble tea to go with it!
Owners are very friendly too. You can tell them really put heart into their food. :)
I'd definitely give two thumbs up to this place. Just go and try something new!"}
{"text":"Authentic taiwanese food minus the Cantonese speaking servers lol. I had the beef noodles which definitely tasted like what you can get there except much cheaper. And the popcorn chicken is a must get too. This location is really far and out of our way but I'll definitely come back!"}
{"text":"Food here is quite mediocre. Although it's relatively inexpensive, the food also comes in small portions, so don't be fooled by the prices !

Popcorn chicken - lacked flavour 
Beef wrap - not very traditional. It is wrapped with lettuce mayo egg  and beef slices  :S
Minced pork rice - recommended and only get the spicy if you can handle spice, it has quite of a kick to it"}
{"text":"Tried their signature beef noodle soup which, as first timer of this Taiwanese staple, my wife and I found to be an acquired taste.  The beef is plentiful and the noodles are not mushy.  The heaping large, steaming bowl was definitely fresh, but I guess the sweet taste is not for us to enjoy.  This is probably not a fair review because to each his own.  We also tried that much talked about crispy popcorn chicken. It was crispy all right, but let's say that the bar is a bit low that KFC or Popeye's versions are in the lead of the race if one is called.  In short, you will most likely not order for it again."}
{"text":"I don't know why so many people rave about this place. Sure, the food is ok but for basically small snacks, the prices are ridiculous. Everything is so small that you end up ordering around 3 items per person. You end up paying around $15+ per person for basically snack foods. I came just after the lunch rush at 2pm and all the food we ordered was lukewarm at best. Which makes me think that stuff isn't prepared freshly and is just made in batches and kept warm or reheated. 
Ok place for a quick snack or small lunch but for dinner, it's not worth paying that much for pre prepared, cold snack foods."}
{"text":"My fianc and I came here for a quick bite today. We got a table instantly and got our order in shortly after we sat.

We ordered the minced meat and sausage with rice, popcorn chicken bento box, and curry chicken filet with rice. The minced meat and sausage with rice was good. Meat and sausage were tasty, but I felt there wasn't enough to go with all the rice that came with the dish. The popcorn chicken bento box came with a generous portion of chicken, along with some tofu, fish cakes, pickled vegetables, and rice. Popcorn chicken was very good. Crispy on the outside and juicy on the inside. This dish would have been perfect if they put more sauce on the rice. There was a bit of soy sauce on it, but not enough for the amount of rice that comes with the dish. Curry chicken filet was good. The skin is left on and the dish comes with some carrots and potatoes. Curry is flavourful and plentiful. There was enough to coat all the rice that comes with the dish. Of all the dishes we ordered, only the curry chicken filet with rice was finished. The other two dishes had too much rice and not enough sauce to make it worth eating. 

Water and tea was consistently refilled, which was nice. We enjoy going to Papa Chang's for a quick and ridiculously cheap meal. Most, if not all dishes are under $10."}
{"text":"Decided to try this place out & it was an excellent choice. 

Ordered the meat floss pancake, fish skewers, popcorn chicken, Taiwanese Beef noodle & the rice with minced meat and taiwanese sausage. The food was amazing! 
and the food was also served very quickly. 

Definately recommend this place"}
{"text":"Pretty good Taiwanese food! Much better than I expected, since most Taiwanese food experiences in the U.S. have been disappointing.

The rice with mushrooms and hai san sauce on it was good. The oyster pancake while a little thicker than I liked and with only a little oyster was pretty good. And the popcorn chicken was enjoyable even though I took it home and it got cold.

I would go back to try more dishes. Good place for Taiwanese food!"}
{"text":"Finally tried their menu at the end of the work day! 

Food was fast and tasty. I was a hungry hippo that I did not take foods. Lucky other fellow Yelpers provided the proof of their food. So, hubby ate the popcorn chicken of course and I ate the wonton soup noodle. 

Please be warn that the bowl was HUGE! I thought it was the smaller sized dish. There were smaller noodle bowls, as opted by the other customers. 

We also had the crunchy pork belly, hmmm. Good addition to the soup and the bento meal. There are sauces for the meat. You know...it reminds me of when I was in Asian grade school and we would pack lunches: rice, veggie side, and meat when we're lucky. The hanging metal lunch container was exactly what I used as a kid. 

Not much of a menu .....if you don't like pork belly, popcorn chicken, braised pork, tofu, fish cake, breaded chicken skewers snack, noodle soup- won't, fish, pork, and steamed leafy veggie. Lucky that I do! 

I was satisfied. I love seeing a place gets packed right after I sit down. Yup, cons be packed at times."}
{"text":"To PaPa Chang Owner,

I just saw your reply and I don't know how long ago did you post it. 
But anyways, I was writing my reviews while I was still eating at the restaurent. and it was on Mar22,2015 around 2pm-2:30pm. that's all I could remember."}
{"text":"This place should never be a restaurant! Once I open there door there was only 4 table that has 6 seats each table inside. The first table is so close to the main door. I can't imagine in the winter how cold the customer seating there. 
Then I was ask for my phone number because there was a waiting list. But where do I wait? Outside in my car? I left immediately because there was 3 phone number in front of mine. Within 10 min they called me but I left and the 3 number in front of me probably feel the same way. Sorry to say but I would never go back to this atmosphere. It wouldn't matter how good the food is."}
{"text":"Pa Pa Chang's is a wonderful Taiwanese restaurant that's a bit of a trek to get to for those not living in York region.  But because of how great it is, I often make the trip when I get a chance.

They've expanded since I first tried this place out.  You no longer have to walk awkwardly through the kitchen to use the washroom (hurray!).

We've tried almost everything on the menu.  Here are some of the highlights:
1) Popcorn chicken - really good, wasn't soggy 
2) Sesame flat bread w/ beef shank
3) Taiwanese spicy beef noodle soup - really good broth and has more depth to it than Mei Nung's beef noodle soup.  However, the noodles are inferior.
4) Pork thick soup
5) Crispy intenstine - slightly sweet and savoury
6) Deep fried pork belly

Some so-so dishes:
1) Taiwanese style rice cake (sticky rice with sauce on top)
2) Taiwanese sausage - it's not bad, but didn't really stand out either.

We have run into a few issues though.
1) They've messed up our orders a couple of times and given it to the wrong tables
2) They always run out of the sesame flat breads (they've been out the past 4 out of 5 or so times I've been there)

Overall, despite the cons and the distance, I love this place and will probably go back many times.  The prices are also very reasonable."}
{"text":"Best popcorn chicken ever!

I've tried many dishes at Pa pa Chang and have never been disappointed. The owner is very serious about the food he makes. One time he used the wrong sauce for the side dish in a bento. He took it back and remade the entire thing!! Some of my favourites are the egg pancakes, popcorn chicken, preserved veggies with tofu, beef noodles, etc."}
{"text":"Food was decent but wasn't as great as what I would have expected from the reviews. Appreciate that it was a very family owned style but one of the waitress was not that nice. Also don't appreciate that they don't allow people to sit down unless all parties are present even when there were several tables open. They also sat a party of 3 at a table for 2 when there was a 4 seat table open. The fact that they give off the we get a lot of business vso we don't accommodate vibe wasn't so great. Would recommend this place for take out only."}
{"text":"This place is good for take-out and not bad if you stay as well, the waiter (an older guy) is really friendly and gave us some great suggestions on what to order.

I came here in a group of 6, so we can try more dishes, there was about 2 other tables and some people picking up take out orders.

The food came fairly quick, I like the portions, not too large, great for sharing. There is MANY selection, will come back to try more food! The food was mainly a hit with a couple of misses. But because there is so many different flavours in each dish, I don't expect every single dish to fit everyone's taste buds. so of course some will be his/miss with this huge menu. Stick to the items you like and you will enjoy the food they have to offer here. 

The downside for me is the location, it's a bit far for me as this is at the very north end of markham, and in a tiny plaza, but because there isn't really any other good businesses around here, it's easy parking."}
{"text":"I have no idea why people giving this restaurant 4 . It's taste awful compare 10 years ago of the Taiwanese restaurant in GTA.

If anyone one of you went to Taiwan or you're Taiwanese. You already knew how good Taiwanese food is."}
{"text":"We went for dinner with a group of 5 people. Service was prompt. Since it is a smaller place, groups bigger than 4-5 is not ideal. The place is always busy but it is usually not that long of a wait. This is a very good place to share dishes. I'd recommend bringing cash. 

We ordered the popcorn chicken (spicy) and non-spicy, meat floss pancakes, green onion pancake which are absolutely amazing. The chicken and fish skewer are really good as well (chicken was better than the fish). They have a wasabi sauce on there that really adds that needed kick. I thought the shredded pork was okay. The Taiwanese sausage and the Taiwanese sausage rice were pretty good.  I've gone at least 5 times and will definitely return. It is hands down one of the best restaurants in Markham."}
{"text":"I love, Love, LOVE, LOVEEEEE  Pa Pa Chang's. I had no idea it existed, and even though Yelp has highly ranked this place, for some reason, I still never had a super strong urge to try it. I'm SUPER happy I did, because it's a delicious, more affordable izakaya styled dishes, place for lunch.

Papa Chang's has no Fancy Schmancy design, it's looks like a small, family owned business when you walk in - waiters tend to speak to you in Cantonese. Photographs are spread in some areas of the walls, with newspaper articles of Pa Pa Chang's in Taiwan - pretty impressive. The most impressive/disappointing piece of decoration of all time was the three pottery glazed LAO FU ZI'S on the ledge. I mean, come-on, they were all the same height?!?!?! 

Food reviews: I really enjoyed every single dish they offered here. One of my favourites was the chopped meat with rice with an egg (egg is for an extra $1) - though a very small portion, it was delicious! The rice was cooked to a chewy texture, but not overly moist, but OH MAN, the meat was pretty close to perfection. I think their snacks are really delicious. Another item we tried was the Panko Fish Stick (3 pieces) for $4.49. It was drizzled slightly with wasabi, but those with wasabi phobias - don't you worry, the wasabi was really light, that even someone like myself did not cough and turn red immediately.   

Don't ever come on a Monday, because if you do, you will be as dissapointed as I was today. Yes, you guessed it, Pa Pa Chang's is CLOSED on Monday! NNNNNNOOOOOOOOOO, (but hey, restaurant employees need a break too, to be able to produce such delicious food for customers)!"}
{"text":"food is tasty. Haven't tried the soupy foods but my gf has and she didn't like it as much. The snacks and rice dishes is where I would start. 

Can get busy and tight in here. Favorite dishes are : deep fried pork belly, crispy intestine, sausage and minced pork on rice, skewer chicken/popcorn chicken."}
{"text":"Came here on a Friday night, around 6:30 PM and was surprised the place wasn't packed.. YET. First off, try to come before 7PM as the place gets packed really fast.

Servers greeted us with smiles and you are offered either water or tea as soon as you get seated, which is a nice touch.

They got our orders pretty quickly, and we got the food in 5 mins. Very impressive! 

First impressions with the food: Very small serving for what you pay, but I have to admit the food is good. But the rice to meat ratio is not good, as there is way so much rice in the small bowl, especially on the minced pork and rice item on their menu.

I think I would come back to try their other dishes, but for the price, I am sure there are better choices out there. Papa Chang's is still worth a try though.

Remember to try and beat the dinner rush, as since the place has very limited seating, the place gets really packed really fast."}
{"text":"Came here on a Sunday at 2:30 in the afternoon and it was packed. The restaurant is small not good for big groups. I decided to get my meal to go. The waitress was very friendly and it only took 10 minutes to get my order. I got the spicy beef bento. It was good, the beef was well seasoned and soft.  Lots of people were eating the beef noodle soup something I hope to try next time."}
{"text":"Got some take out at Papa's recently

Got the popcorn chicken

That was mighty tasty

The winner for me though was the deep fried pork belly

What an amazing dish

Loved the sauce that came with it

Was quite tender and very tasty

Also got an order of the soya beef shank
That was the only thing that wasn't good but not bad

Overall this is a good place to get a small meal especially with their bento boxes

Would definitely come again"}
{"text":"Summary: efficient service and sense of \"old-school-classic-but-clean\" makes this a great place to grab a *small* bite for a reasonable price... dishes are fresh and flavourful, but it's not going to fill you if you're a big eater.

Top Must-Get: minced pork/braised pork
Top Regret: trying to get full here

I consider this my go-to Taiwanese-fusion restaurant in this part of town! Parking can be a pain, since it's in a little plaza (and the restaurant itself is small and fills up quickly during peak hours), but they get the food quality right.

SERVICE
Has been hit or miss.among me and my friends here. I find that they're on point, friendly and efficient - but I know that hasn't always been the experience (my friends have gotten glares, impatient sighs, and borderline cut-eye when ordering at times, and I'm not entirely sure why). 

They open promptly at 11 though, and the general vibe is very homely and welcoming. The store just looks inviting - they did a great job renovating it.


FOOD
I usually go with the minced pork or braised pork, and really should start trying something new, because while I LIKE the dishes, I feel like they aren't reaching their FULL potential.

Braised Pork: So the rice is slightly soggy, but besides that, you get about 5 - 6 slices of tender, juicy pork, each with a fair amount of flavourful fat on the meat (okay, so don't get this if you're watching your saturated fats), and there's just the right kick of spice.

The \"ham suen choi\" or 'salty sour veggie' is not something I usually enjoy, but it was really good here, and they also sprinkle on crunchy little somethings that just complete the dish. Besides the soggy rice and the fact that it takes me about 8 bites to finish the dish, I was really happy with it.

Minced Pork and Sausage: To be honest, I didn't LOVE the sausage - it lacked flavour. But this dish comes out super fast and I imagine it's because it's one of their more popular ones. The minced pork is nicely seasoned though, and mixes in really well with the rice. Again, 7 spoonfuls top for me to finish, but those are 7 glorious spoonfuls.


In the ultimate nod to quality over quantity, I give this 3.5 rounded to 4 stars. More consistency with the service and a more generous portion size would make me more comfortable with the rating, but those bites of pork do make it worth it. 

(Put another way, it's 4.5 stars if you're just looking to satisfy a pork flavour itching, 2.5 stars if you're hungry with a big appetite.)"}
{"text":"Very busy restaurant with a hole in the wall feel. Small restaurant but was able to get a seat soon after getting there. This was our first time at a Taiwanese restaurant so the pictures in the menu helped us pick out what we wanted to eat. 

Would definitely recommend this place. Food was really good and some were spicy (just the way we like it). Service was great as well. To top it off, it was also inexpensive."}
{"text":"Quick and efficient!. Popped by for a quick lunch take out. Ordered the classic Popcorn chicken bento and the Braised pork bento. Both were delish..but we hoped for more of the braised pork! Our go to place for taiwanese food when the craving hits!"}
{"text":"This is our go to place for affordable and goood Taiwanese food. Our usual is the minced meat rice and signature soup noodle (they are very generous with meat portions). If we're super hungry, we also order the fried tofu - so so good!! This is a must try!!"}
{"text":"Which was once a secret Taiwanese spot is now a super busy well known spot.

All selections are super good and way better quality than the typical fare you get at BBT.

I would recommend the pork rice, tofu and beef noodles.

I'm not sure if Markham main st is still under construction but you can take small streets to get there or ride 16th."}
{"text":"Tear dropper!!! N1 S14 is a must have. All bento is good. Totally worth driving 30 mins to come just to have a bite. You won't regret!!!!"}
{"text":"Restaurant is small but clean. Awesome Taiwanese popcorn chicken and bento box sets. Cheap eats."}
{"text":"Finally, somewhere that is worth the hype. If you read my reviews, you can tell I'm hard to please. Papa chang's was a last min decision and we definitely didn't know it was SO small (hence why 1 star knocked off), so we didn't realize we needed reservations! Lucky for us, this one person that left their phone # on the waitlist didn't pick up their phone or something, so we got seated immediately. 

My boyfriend got the most standard taiwanese dish: the minced pork, tea egg, taiwanese sausage rice and OMGGG WHAT?? IT WAS SOOOOO GOOD. The flavour was amazing and I've NEVER tasted that dish THAT good before.. it made me sad I didn't get it for myself. The popcorn chicken was ok, pretty standard in taiwanese fusion restaurants in the GTA. Dipping sauce was neat. I would've enjoyed it more if it was a bit less breaded though. I got the satay noodles and it was yummy. Great noodles but could use a lot more thick satay sauce. I really loved this place and would definitely come back to try more food on a less busy day! I'm not too much of a fan of touching elbows with the person eating beside me.."}
{"text":"Many year ago I found Pa Pa Chang. It is so close to my home.  I had it soooo often. I knew many staffs there lol and they know me as well.  Once I even owed them money bc I forgot to bring cashes for take-out.  LOL if there is any VIP card, pls give it to me."}
{"text":"Really good authentic Taiwanese food! We buy takeout here whenever we don't feel like cooking!"}
{"text":"I've finally had the chance to try Papa Chang's out and if you're looking for really simple Taiwanese food then this is the place. There's a real home cooked vibe with their food. It's simple. It's tasty. It's cheap. What is not to like? The only thing is that you won't be blown away by it. 

We came here on a Saturday night just before closing and fortunately, they still accommodated us despite somewhat of a mini-rush to get the last call in. 

It really is fusion in the sense that they do things a bit differently here. There's kimchi with your popcorn chicken, there's a sweet creamy sauce in the meat floss pancake, there's Japanese items on the menu. But all of this is for the better, because everything oddly works. 

The meat floss pancake was surprisingly melt in your mouth. The popcorn chicken was flavorful with the five spices. There aromatics with sweetness, and it was breaded with a crunch. You'd expect this to be dry with the rice but there's some meat and sauce over the rice to keep things flavorful and moist. I actually loved the kimchi here, it's on the sweeter spectrum too and the fishcakes and fried tofu were nice sides to the bento. It's a great bento meal.

The dry chili noodles were a myriad of things. I liked the spiciness of it; it surprisingly packed a lot of heat. The pickled vegetables added a nice sweetness and saltiness to it. The only thing I'd say it was very 'wet' and it made for some weird textures but otherwise it was still very tasty."}
{"text":"If you're in the mood for cheap taiwanese comfort food, definitely try Pa Pa Chang's out! The restaurant is a tad small but the food is served extremely quickly. Everything tastes phenomenal (which is saying quite a bit since their menu is expansive) but my personal favourite will always be the Taiwanese Sausage and Mince Pork dish with a tea egg! I'm always impressed by how the sauce mixes with the rice throughout the entire dish, and their homemade crispy spices are really yummy (but extremely spicy!) Another plus side? It's only $5.49 without the egg and an extra dollar for the addition. I always end up going home with an extremely full stomach just by eating one dish - and there'll still be leftovers! 

However, be wary that the service may be lacking sometimes - the servers are efficient and patient but can often be busy. Just to be clear though, they have always treated me with respect and I am happy to frequent the business :)"}
{"text":"Efficient and authentic.

In an effort to maximize efficiency, they only allow you to reserve a table if your entire party is present. This was a bit bothersome at first because the restaurant was extremely busy and we just wanted to get our name on the waitlist. However, during the wait, we realized that the restaurant was a revolving door, and that customer sitdown times were not too long. When the 3rd member of our party finally arrived, we only had to wait a couple minutes before being seated.

We just came here for some snacks while waiting for our reservation at Inspire down the street. We ordered the popcorn chicken, skewer chicken and Taiwanese sausage. All 3 items were out within 5 minutes. 

The Taiwanese chicken came out first - this dish was just okay. It was just one sausage, thinly sliced and presented on a bed of lettuce. Tasted good but not a must-order.

Next came the popcorn chicken - a dish I believe to be one of their staple items. By far, this was the best popcorn chicken I've ever tasted. Batter was fantastic and the chicken was nice and moist.

The skewer chicken came last. It was fried with some seaweed, mayo, and wasabi sauce. This was also very good.

Each item was $5. For some quick, authentic Taiwanese snacks, Pa Pa Chang's definitely gets the job done."}
{"text":"Finally made it here for dinner on a Friday night around 7.30pm. The place itself is very small and the front entrance was a bit confusing, when the door opens there will also be a big draft. There was a short 10 minute wait for a table for 2. The decor is very simple, had a bit of a sad cafeteria feeling to it. 

I got the minced beef rice with a soy egg and an order of popcorn chicken. The rice itself was very filling, almost didn't need the egg because it was just too much food. The rice itself was just luke warm. The chicken itself is great, crispy, piping hot and juicy on the inside the only thing i wish was that it was a little saltier (the popcorn chicken I usually get at bubble tea places are covered in this magical salt that im missing here), even with the thousand island sauce it felt a bit plain.

Service was quick and the servers were friendly (which is pretty great for an asian place!) The meal was also very affordable for the large portion size which is why i will probably come back."}
{"text":"I used to live around that area. Papachang made me fall in love with taiwanese food. My favorite was the skewer chicken, crispy intestine and their vegetables! This is a really small store, but its cheap and tasty with good services."}
{"text":"Outstanding taste for the price. Small place and can sit only 24 folks so be there early. Had Taiwanese rice cake, pork thick soup, shrimp wonton noodle soup, pop corn chicken bento and chicken basil bento. All of them were good. Service was fast too."}
{"text":"Small cozy little place. Seats are very limited. Their food is quite flavourful. The hype is better than the food. I've experienced it once, and that's enough for me."}
{"text":"I would give five star to the place .But the place is tiny . Only site around 30 people maximum. The wait time around 10 to 15 min. But the food and service  is great . The portion is good size the taste perfect."}
{"text":"Attentive service, though it almost felt that the staff was rushing us to order right after we sat down. Portions were smaller than expected for the price but food was delicious. Would try other items if on the area but probably not trek out on purpose for Taiwanese popcorn chicken that's the same quality as any Tenren."}
{"text":"Just up the street from Markham and Scarborough and an ideal location for some good homely Taiwanese food. The rice with minced meat and Taiwanese sauce is good, as is the popcorn chicken. The Taiwanese meat ball was enjoyable albeit on the small side. I couldn't find Stinky Tofu on the menu though the breakfast pancake rolls were a pleasant surprise. This is a relatively small restaurant tucked away beside an uptown hobby shop. The service is friendly and the decor is welcoming. Definitely worth a visit."}
{"text":"I am so glad my friend introduced me to this restaurant!  Authentic Taiwanese food!  From what I heard, they were very popular at night market before deciding to open it's own store here!

The only negative comment I have for this place is the seating area is SUPER small.  They do not take reservations and they don't have room for people to stand and wait for a seat.  Thus, my recommendation is to either come at very odd time or order take out which is just as good!

The foods are overall very good.  I love the Signature Beef Noodle Soup, Popcorn chicken, Taiwanese sausages and minced pork rice and a cheap but decent bubble tea to wrap up a meal!  I still haven't tried their other signature dishes like the skewer fish, tofu and more!  I forgot to also mention their price is relatively cheap, so it's worth every penny!!

If this is your first time at this place, the one thing you MUST order is their popcorn chicken!!"}
{"text":"I've been here many times and their food has been very consistent, and I have never had bad customer service here, but I guess some customers expect waiters to suck up to them. I like their skewer fish, skewer chicken, fried pork belly, and popcorn chicken."}
{"text":"I don't know why it took me this long to finally post up a review..

This place is the BOMB!!!!!!!!   

The #1 Best Taiwanese food in town!!!!  There is no comparison between other places that offer Taiwanese food

I found out about this place because my favourite Taiwanese-style spicy beef noodles was closed @ Silver Star :( and someone on RFD recommended to check out this place.  However, upon going there for the first time,  I completely forgot about the beef Noodles and ordered the popcorn chicken bento box instead and got mesmerized by their other food items.

It was only my third visit that I finally tried the beef noodles haha  :)

I loved it so much.. I am willing to drive the extra 20 minutes even though I know so many people complained about how far it is and how small the place it.. 

How much do I love this place?? well I once waited 35+ for a table for two and once we placed the order, we waited another 45 minutes for the food..  I WAS SO STARVING AT THAT TIME... This is how much I loved that place

Since then, they increased their staff and the food turnaround time comes out fast. like in a few minutes!! and therefore the wait for a table is faster too.. 

When it first opened, the menu had many items but now since the renovations, the restaurant decided to cut down and focus on the most common items.. I really do miss the variety and the older dishes that is not offered anymore   

Did the place get bigger after the renovations? no.. The renovations was needed to move the washroom up front of the restaurant as people had to pass through the kitchen to go to the washroom. but the place and size did not get bigger unfortunately which is sad.. because I think the restaurant would benefit from a bigger seating to accommodate their large clientele

Spoke with the old guy about that and he said that if they were to increase the seating, they might have to increase the prizes of their food items.  Half of the business seem to be a lot of takeout.   

Since the restaurant is so tiny, it doesn't take reservations and it is first come first served though you can leave your name and phone number and the restaurant will call u when the table is ready.   

There was apparently an incident recently by one of a customer who complained that some people were sitting at some tables already but it wasn't fully occupied since those people were still waiting for others to come to join them but they arrived first.. That so called customer apparently made a big scene and quarrel and complained to papa chang and the big staff about how this restaurant was not doing so called business since there were people sitting there but not ordering but there were customers at the door that wanted to eat but there were no spaces for them

Since that stupid quarrel, the restaurant now has a policy where it would only sit people at the table if only the full party is here.. I really don't know who was the customer that yelled and made a big deal about that but was it really that necessary??  the turnaround time is so fast now at PAPA chang.and the wait time  for a seat is not long or not as long..  also, if  you want to make sure to get a seat, it is recommended to go early or go during non busy times.. 

The restaurant now takes credit card, debit or cash. 

I highly recommend this restaurant and to anyone visiting Toronto!!! :D  A MUST TRY!!!"}
{"text":"Quick service on a Thursday night - but the restaurant fills up quickly since its such a tiny place! Came here around 6pm and about 15 minutes later there was already a lineup! Super cheap and quick taiwanese food. I got the satay beef noodle bowl and for how large and filling the bowl is, it was worth the $6! Nothing is too too special about it; it just tastes good. 

I DO NOT recommend the japanese tako pan cake (okonamayaki thing) - that was just not good at all. I don't even know why i bothered getting that at a taiwanese restaurant. However, I do recommend trying the meat floss pancake. Now that was 10000x better and super good!"}
{"text":"I'm really disappointed at their food today. This is not the first time I go to their place, and I remember they have decent food. So I ordered popcorn chicken and skewer chicken for takeout today. These two dishes are their popular and recommended dishes. But the taste was so disappointing this time.

First of all, it's not fresh at all!! It's hot when I pick it up. But once you taste the meat, it feels like the meat almost went bad. I'm not sure if they used almost bad chicken, but the chicken meat is definitely not fresh when it was cooked. So I can taste the weird taste of the chicken meat for both these dishes. And after I ate a portion of the popcorn chicken I felt sick the whole afternoon. I didn't eat the skewer chicken at all.

Also they increased their price. The actual price is higher than their official website. Food quality decreased dramatically and price went up!"}
{"text":"Popular Japanese/ Taiwanese restaurant that's supposedly the original Pa Pa Changs location. 
In terms of set up, the venue is quite small with limited seating.
The layout of the restaurant is a bit weird with the entrance door being so close to the tables,
I pity for those sitting by the door especially on a cold day you can a blast of cold hit you while you're eating.
Nonetheless the food and service was to my standards exceptional. 

**For starters Jen and I were feeling adventurous and tried their popular Fried intestines; you either like it or you don't.  This dish has a particular taste that may not agree with the general crowed. 
**Meat floss pancake, wrapped pancake with breaded chicken bits, great shareable appetizer. 
**Fried chicken bento box, melody of fried chicken on a bed of rice and sashimi salmon.

The service was fast and efficient, our server was extremely sweet which added a positive touch to our experience at PAPA Chang's.

I would definitely come back again as they have a great selection of food!"}
{"text":"Two of us came here on a late Saturday night, around 8pm and we were pleasantly surprised to find it still packed.  We had to wait a few minutes for a table as quite a few parties were leaving then, so we were pretty lucky!

First impressions - We were definitely taken aback by how small the entire place, only about 24 seats in total, some makeshift ones could be/were added here and there. There's barely enough room for people to be waiting at the door, so it can definitely be an issue for larger groups. 

The menu was fairly small, but there was a great variety in it.  We ordered popcorn chicken, a \"pancake\", a wonton noodle soup, a fried work noodle soup, and a \"kum kquat\" hot drink. That was definitely way more food than the two of us could eat.  We ended up leaving with most of the pancake and the port cutlet. 

Even with only 2 waitresses, service was great - plates were cleared very quickly and they came by often for tea refills.  The food came rather quickly, and it was amusing to see which dishes many people had ordered, because, for example, 3 plates of popcorn chicken would come out at the same time!

Generally, the food was decent.  Nothing extraordinary or special, but just of decent quality - what you'd expect.  The portion sizes were on the small side. The bowls of noodle soup look deceivingly large, but trust me, it's mostly just the soup. Looking at the tables beside though, the rice bowls may have been a better option based on portion size.

Specifically didn't find the popcorn chicken that worth it.  It was around $6 for the small plate. The batter was fairly interesting, but not something worth having again, but the price.  And comparatively, when their other menu items are around $4 or $5, the popcorn chicken was definitely not worth it.

The bill came out to be a little more than $30! Definitely more than we'd expected for such a place.  Yes, the food was on par and we did bring some of it away, but the quality of food and experience was not worth that price. The tiny, cramped restaurant really takes away points from the atmosphere and experience.

I'd come back here on if there were no other options nearby and out of pure convenience, but not worth returning to solely for the food/price again."}
{"text":"I went to Pa Pa Chang's because I love Taiwanese food.      The prices were okay, and the dishes were pretty yummy.   

We ordered Intestines vermicelli soup noodle as well as fried intestines and the taiwanese oyster pancake.    

Intestine Vermicelli soup was pretty good, but my least favourite.   It was good to share, but don't order this yourself, it will get slightly too salty.

The Taiwanese oyster pancake had a great texture, the potato starch chewiness was great, it just didn't have much oysters at all.  For 9.99, I expected a tad more, the ones I get at the Nighmarket (either in Taiwan or in Toronto) was much better.  They only serve this from Tuesday to Thursday though, I suspect since it takes a little while to cook.   

My favourite was the fried Intestines!  They were juicy, and delicious, it worked well with the chilli sauce and the pickled sweet veggies.   Some pieces were a bit too fatty for my liking, but overall, one of the better places to get fried pork intestines.  At 7.99 that's pretty good...I would definitely get this again.   

All in all, it was pretty good....but I still prefer Mama Bears Taiwanese Cuisine.   Great place to try if you need some variety."}
{"text":"I love Papa Chang's popcorn chicken. One of the best in Toronto I'd say. Love their deepfried fish skewers also. Tried their beef brisket noodle but that tasted just okay. I will be back in a heartbeat for the popcorn chicken though!"}
{"text":"Was having a craving for Taiwanese minced pork rice and this was the closest and best place to go in the area.  The location is a bit hard to spot if you don't Google ahead of time.  We were quite lucky to arrive right when a table or two left, and was seated immediately and served with hot tea.

Ordered the chili sausage and minced pork rice with egg... The appearance didn't seem too big but it was definitely a very big portion with a lot of rice (which I love).  The sausage wasn't very spicy and had a hint of sweetness, less sweet than what you would find at a Cantonese style BBQ pork restaurant/takeout food court.  The minced beef was quite tasty but I felt was not as strong of a taste as what I have had in my precious experiences elsewhere.  I was slightly disappointed about the vegetable that came with it as I thought it would be pickled (or maybe it was?).  But anyway, I finished every grain of rice on the bowl and frankly, felt quite proud of myself for finishing my meal without needing to ask for a takeout box.

I'd like to come back again to try other dishes. Taiwanese food is delicious!"}
{"text":"Did not enjoy this restaurant at all. The food and seating were poor. The only good thing was how cheap the prices were. 

We tried the chilli Taiwanese sausage minced pork with rice and the chilli beef noodle soup. These are the most popular and famous dishes according to other yelp reviews. The food came out fast which was nice if you're in a hurry. Problem was the quality of the food. The minced pork was very fatty and the texture reminded me of regurgitated food. The sausage was also quite fatty and soft. The dish simply made me feel a little ill, like I just ate a bowl of fat. The chilli beef noodle soup was equally as disappointing. The noodles should have been chewy but they were soft and overcooked. The beef should have been soft but they were chewy. If they had stewed the beef longer or had better quality meat, maybe it would have been more tasty. Seating was also uncomfortable, because they have cafeteria style seats where patrons are forced to sit together. Don't expect any personal space. Overall I wouldn't return or recommend. They get 2 stars were quick service and cheap prices."}
{"text":"Pa Pa Chang offers a great mixture of taiwanese and japanese food. The well-known dish that everyone will always order when visiting Papa Chang's is the infamous popcorn chicken. I personally ordered the popcorn chicken bento instead of a side of just only popcorn chicken because I've never seen any other place offer this cultural mixture food. The popcorn chicken tastes like no other place I've had; it's a perfect combination of a crunchy taste on the outside while the inside is soft. And with everything else provided with the bento, the rice was enjoyable along with the tofu and cabbage offered. THIS IS ALL ONLY $6.99!

One complaint I could say is that the restaurant is extremely small and could only hold under 30 people. Luckily, Pa Pa Chang has an express restaurant that is located within Markham to provide more services. Would definitely return again to try more taiwanese dishes!"}
{"text":"5 star reviews and ppl raving about this place. I gotta try it out when its rated so high...and plus it ain't far away from my place... so might as well.. 

Newly opened in the area, only 3 months old, as i asked the owner.. like the fact that I could see right thru into the kitchen which looks quite clean.. 

There are only under 15 seats i think.. so not for a big crowd of ppl.. prices are decent in this day and age,  can't complain... food quality is good.. I would come back for takeout or a quick lunch... 

I tried the famous Taiwanese pop corn chicken... does it taste exactly like the ones in Taiwan? Not 100%...but its still quite tasty... and definitely worth the try...

There's only 2 people working there so need to be patient, I'm sure they try to get food out asap... they also have homemade pineapple cookies (a Taiwanese must buy when visiting )...haven't tried but 5 pieces for $9...im sure they must be very confident about it or else how can it be marked at that price...?

All in all, 4 stars for quality, service,  price"}
{"text":"I clearly hadn't checked this til now but needless to say, our family still loves papa chang's (both the 16th Ave location and papa chang express in Pacific mall) and I've returned at least once a week and have brought/recommended papa chang to multiple friends and family in the last year.  The go-to order for our family of four EVERY WEEK would be the minced pork on rice with egg, minced pork & sausage on rice with egg, curry chicken on rice, braised pork on rice, popcorn chicken, stir fried lettuce, fried squid balls and spring rolls. We sometimes throw in the pork bao but this place is definitely one of our comfort food spots!"}
{"text":"Came here for dinner. We were seated in a timely manner. Restaurant was small and cozy and looked family-owned. Taiwanese food is not really my cup of tea but I thought I would try another restaurant hoping you would change my mind.

I order the takoyaki, chicken skewers, pancake and beef noodles. Prices of the foods were kind of expensive for the amount that you got. Sadly the takoyaki, chicken skewers and pancake all had the same topping on it. Mayonnaise and wasabi. The takoyaki and pancake were on the oily side.

Beef noodles were sweet and salty because of the preserved vegetables on it but the noodles were okay. This restaurant usually caters to the younger crowd as it mostly has street food and bento boxes.  I personally would not come back for personal food tastes. But a good concept overall."}
{"text":"Maybe this place was overhyped for me.... so I was expecting a lot more than what I received. I remember the Taiwanese style noodle restaurants in Vancouver - the crepes / wraps were crispy and piping hot, lots of flavour and loaded with meat. The beef brisket bowls of soup were flavourful and the meat was tender to the touch. Pa pa Chang's, in my opinion is moving in the right direction... I blame myself for seeting such high expectations.

People weren't kidding when they said this place was small.... a mere 8 tables tops, with a few that allows for communal seating. Luckily, I was surprised that on a Thursday night at 6, the place was empty except for another mother with her daughter.

I looked at the pretty pictures as my bff was excited about order tako yaki and all the other fried goodness that I was sure would be tasty. I was eying the crepe, and reminiscing about my Vancouver adventures. We felt like the beef noodle soup was a must order and went with that as well, along with a plate of fried tofu.

Food came out quick and I'm not sure if that's a a good sign. The crepe was first to come - we chose to have the meat floss filling. At first look, maybe I ordered the wrong thing... the crepe was not crispy at all, but I was open to new things. At first bite... the taste seemed off as the texture was soft and soggy like, and I was not expecting to be having mayonnaise in this... totally off pudding. There were shreds of lettuce and as often as this sounds... it felt like an Asian style Big Mac... and I'm not saying this in a good way..... I think what I was thinking of was the flatbread all along.

The other items came out and they were much better. I'm never sure about takoyaki because I feel like there is too much batter, but this was very tasty and well proportioned. The fried tofu was not over battered and lighted crisped with a good portion of tofu on the inside. Meanwhile, the beef noodle soup was okay... but could have been better. The beef was not super tender like I would have hoped which I believe is the main seller of the dish.

Overall the entire meal was okay. I have other noodle places I need to try before coming back,"}
{"text":"This is my go to place for taiwanese food. Its a great place for casual taiwanese dining. It is a small cafe style restaurant. There aren't many seats available but I never had to wait very long since their service is fast. 

My favorite items are the popcorn chicken, beef noodle soup, and the minced pork& sausage on rice. These are some classic taiwanese items and I love them. The popcorn chicken always comes up hot and crunchy. It isn't too overly battered. You can order this on its own as a dish to share, or you can get it with rice. The beef noodle soup is another favorite here, I love the broth. The beef is tender and flavorful. Another item I like is the minced pork on rice. This is a popular taiwanese dish and it is great for those who loves rice. 

This is a solid taiwanese restaurant and I highly recommend giving it a try."}
{"text":"Update: Lots of their items have wasabi. If you dont enjoy wasabi you can ask them to not add it."}
{"text":"Went for popcorn chicken last night and it was delicious and cheap. Also tried the deep fried pork belly and beef noodle soup. Food was good, service was quick, but the seating in the front is a little cold because there's no double doors and people kept coming in and out as other people mentioned. Ill definitely come back though."}
{"text":"Small little family owned Taiwanese restaurant that is located in a small plaza. There is only a small section for tables so if you want a seat, either go early or make a reservation.

The menu isn't huge but enough selection for decent Taiwanese choices. You can choose from bento boxes, noodles, rice bowls, snacks, side dishes. The bento box are the easy to go to choices, it comes with rice, a few different veggies and which ever dish you choose. I would recommend the pork intestines (fried), popcorn chicken, thinly sliced marinated beef. Those are the ones which I usually order. The food is very flavorful and delicious!! 

Prices are well worth the food you get, average of $10 per person, depending on what you order and how many people you come with. Of course the more the merrier and the more different dishes and snacks you could all try!

I always come here to eat if I'm close to this area and will continue to be coming back!"}
{"text":"I heard so many good things about this place, so decided to check it out. The place is quite small, seating a about 10 tables top, everything on the menu looks delicious, especially the apps. Tried the calamari rings, chicken skewers, the taro jap cake, and popcorn chicken bento. Food wise everything was on good, but this place is a definitely more of an \"in and out\" spot. I didn't give it a higher rating mostly because of the environment, and how the food was served on disposable plates and trays.

 The calamari was lightly battered, drizzled with a special sauce. There was about 6 pieces. 4/5
The taro jap cake is quite similar to an okonomiyaki. 3.5/5 
Chicken skewers battered and fried, then drizzled with special sauce. 4/5
Popcorn chicken bento served with side radishes. Delicious, better than other chinese places that serve this. 4/5"}
{"text":"One of the first restaurants I visited when I moved to the area. I was pleasantly surprised to say the least. The menu is ridiculously huge! Lots of your typical Taiwanese favorites with a heavy dose of Japanese influence. I would say these guys do an adequate job recreating a Taiwanese staple(Popcorn Chicken) but there's definitely room for improvement. Must eats include the skewers of chicken and fish, taiwanese pork on rice and basically anything deep fried. Avoid any dish that has soup and the bubble tea is atrocious. Great service and almost impossible to get a table during prime lunch/dinner time."}
{"text":"If you're craving cheap, yummy Taiwanese food in the east Markham area, Pa Pa Chang's is the place to go to satisfy your craving. For $5-10 for one entree, you can enjoy classics like minced meat & egg rice, braised beef noodle soup, Taiwanese snacks, and bubble tea. One entree is enough to leave you full, though the popcorn chicken is great to share.

Don't expect spectacular service or outstanding food, though this is the best food-for-value in the area. Plus it is open until 10pm - last call at 9:30."}
{"text":"This is a restaurant for real Taiwanese street food.  When I am in the area and craving for Taiwanese street food, I will come back again for sure.  The deep fried/popcorn chicken is my favorite!

You can eat a full table of food without breaking your wallet at this place.  However, this is definitely not a place you will enjoy sitting there for too long.  The restaurant is small with very limited seating.  The place is pretty full most of the time.  People are sitting very close to each other.  It is not fun at all when you are wearing big jackets during winter time.  Take-out might be a better option.  However, for the food and price, this place is unbeatable."}
{"text":"There really aren't as many restaurants like this anymore. No frills, delicious, authentic and cheap. Like every who comes here, we got the Popcorn chicken rice along with the spicy beef noodle and sticky rice.
The popcorn chicken was tasty and came in a box ready for takeaway. The beef noodles were very spicy compared to other restaurants (so beware), the soup was full of flavour and the beef was plentiful. I have to say the soup felt like a lot of msg and I was very thirsty afterwards. The sticky rice was...very sticky. Not bad but I won't crave for t again.
This is our go to for fast and delicious in the area. If you haven't tried it out, you have to."}
{"text":"Yummy Taiwanese food! :) 
Although the place is small, their food makes up for it. The tables are close together so it's probably best if you go to this restaurant in small groups. 
I'd recommend the dried pork meat pancake, the popcorn chicken & the fried shrimps. I really wanted to try the oyster pancake but every time I go, they're out of stock :((
I'll come back to try other things on the menu for sure! 

I find it so funny how the cartoon version of Papa Chang is actually kind of similar to how he looks like in person... LOL.. He's a buff chef hahaha!! Take a peek! They have a big window to view the kitchen LOLL"}
{"text":"Was really looking forward to taiwanese food and recreating the night market experience from taiwan. This place was decent but nothing special. The popcorn chicken was nice, tasted similar to chicken karaage. The soup noodles was underwhelming. Roast pork belly was good. The dried pork meat pancake could be toastier. The oyster pancake was not available when we went. Line ups start around 6pm and the place is pretty small."}
{"text":"Finally got to try this place out :) my friend picked up take out dinner. I got the beef brisket noodles which were pretty good. I liked the broth but it was a touch salty. I wasn't a fan of the noodles though. They were really mushy :(

The reason I'm giving this place a great rating is because of the apps and snacks. Taiwanese know how to snack! :) My favorite are the takoyaki which are octopus balls with sauces and fish flakes. They add wasabi to their version which brings another level of flavor and brightens the snack up. I could sit there and eat two orders of these 

Great value for good food"}
{"text":"This is a great little restaurant. So glad we yelped it. Great service. Big portions for a cheap price. Only came to $35 including tax and tip for the below:

Pop corn chicken: really yummy, generous amount. Filling.

Taiwanese beef pancake: this actually tasted pretty fresh, kinda cold though

Intestine noodles: wasn't my favourite but not typically my type of soup

Taiwanese sausage: I liked this sausage, kinda sweet

Boiled lettuce with minced pork: these veggies were really good, I would order this again definitely.

Verdict: Would double dip."}
{"text":"This is my favourite restaurant in Markham! The food is amazing and really cheap. I usually get the taiwanese bbq pork and beef pan cake. Food usually costs around $5 per dish.

The restaurant is extremely small, so if you plan to dine in, you may have to wait a long time during busy hours. You may also have to share tables with others. On the plus side, the food comes quickly and I'm usually done within 30 mins."}
{"text":"I don't really understand the hype. Food is good and fairly priced. Nothing special and out of this world though. Would recommend getting takeout for lazy nights staying in."}
{"text":"Didn't know this place existed right around the corner, but I was able to find it through Yelp. Thanks Yelp, this place is awesome. There isn't too much Taiwanese shops around, but this one has some really good flavors going on. Not to mention that the price cannot be beat. I tried the house popcorn chicken bento and the signature beef noodles. Both were great. Popcorn chicken that I have had in other spots like this wasn't very good, but this place has pulled it off. 

We went very early, around 4pm, and it was already pretty busy. I couldn't imagine the place on an evening or weekend. There is only about 25 seats in the whole place, so I am sure it is packed. The food is fresh and made to order. It is fast too. From the time you order, you can get your food within 10 minutes. I have to head back to see what else they have to offer at this shop!"}
{"text":"I heard good things about the food and cheap price but it wasn't as good as I'd expected. (well, rice and chicken were okay but noodles were definitely disappointing)

Beef Noodles - as soon as I had my first bite, I looked at my friend and immedietly I knew we were thinking the same thing - Overcooked! I strongly dislike soggy noodles so this was the first disappointment. I felt the soup was a bit oily but the beef was ok. (Especially just after trying Mei Nung beef noodle recently, i think that place is better) 

Pork Rice - pork is cubed (hand-cut?) rather than minced. Quite flavorful and tasty, home-y feel, and cheap for only $3.50! but I wish it would include an egg! 

Fried dumplings - quite soupy inside.  friend liked the sauce

Fried chicken skewer - I like the wasabi mayo and seaweed combination. Chicken inside was tender, but I don't like the batter."}
{"text":"5 stars because the portion is excellent , the place is clean and looks authentic and the food is delicious. 100% would recommend.  I ordered the fried pork chop with noodles, the serving was great, two people could share it. would probably come back to try the bento meals."}
{"text":"Came here with family. They have good varieties of Taiwanese food.  Some of them are good and some of them just not that authentic.  

The salty fried chicken should cooked with basil which they didn't. 

The beef noodle soup is favorable.  The noodle is good. And beef is soft and tasteful. 

The oyster pancake is not that good. Could use a little more seasoning on the sauce. 

Overall, it is friendly service and some delicious food."}
{"text":"ORGASMAGICAL  tasting food at a dirt cheap price that comes with the ability to get my Taiwanese partners approval means that Papa Changs well deserves its reputation for providing authentic Taiwanese foods. 

The shop is pretty small that lacks a modern style, however it still provides a cozy and warm inviting type of feel to it. Be warned it could get crowded fast.

I'm a broke ass Uni student with 20 bucks left in the bank. But Papa Changs prices are damn good . that 20 bucks would probably last me 3 meals. So instead of being a hungry broke student, I'll just be broke. 

We ordered 2 items, the popcorn chicken box and the noodle soup with pork cutlet. The Popcorn chicken was blessed. Fried perfectly with a combination of spices my girlfriend swears is just like the stuff found at the stalls in Keelung, the popcorn chicken does not disappoint. The noodle soup has a home made type of feel to it. The noodles have a good chew to them. The broth is super light and not so oily that the Americans would decide it's worth invading . The cutlet was fire. Super crispy and super juicy.

Goddamn it's 3 in the morning and I'm pretty sure I haven't done Papa Changs justice. Honestly all I can say is this is one of the best places to get Taiwanese style food uptown."}
{"text":"Ordered Beef Curry Rice , Beef noodle soup, takoyaki, and squid tempura. Had to wait for 10 mins but I'm glad we did. Got lucky with the line up too since it got busy shortly after.

Verdict: having been to Japan a few times and love the Japanese curry, I found the flavour very close to that of Japanese curry so I really enjoyed it. Beef was well seasoned and tender. 

Squid tempura is also very good. Tasted fresh, and the seasoning was just right. Will have to re-order next time. 

I didn't really care for the noodle (although the beef is of high quality) and the takoyaki has a little bit too much starch (or whatever they use to make it). 

Overall very satisfying experience, the food was good and cheap!! The $7 curry worth every penny. Will have to come back sometime, hopefully with a short wait again! :)"}
{"text":"You get bang for buck here, as portions & taste are big. 

I got the popcorn chicken bento for $6.99 and could only eat half! We also got the Taiwanese Sausage appetizer to share. 

This place is really small, but we didn't see people having to wait for more than 5-10 minutes for a table. But that being said, there is no waiting area really so they were jusst kinda standing around. 

I'd come back to try their noodle soups."}
{"text":"This place is always a solid choice for delicious Taiwanese food.

Popcorn Chicken Bento ($6.99)
This is possibly the best popcorn chicken in Toronto. It's always juicy and seasoned very well. The sides in this bento is usually tofu, fish cakes, stewed radish and random veggies. The sides are sometimes lukewarm and don't always taste that good. The rice in the bento has some stewed pork sauce mixed in to make it extra yummy.

Black Milk Tea ($3.25)
The milk tea actually has real tea flavour and tapioca pearls are really small. The bubble were over cooked as they didn't have any chew to them and just disintegrated in your mouth.

Beef Pancake ($5.99)
This used to be really good. It's a thin crepe topped with egg, shredded lettuce and either beef or pork floss. It's a typical dish found in Taiwan that's budget friendly. The problem here is that they don't make it fresh anymore and the beef was cold and probably came straight from the fridge. This needs to be fresh and crispy in order for it to be tasty."}
{"text":"Awesome Taiwan food, actually the best I ever had, even I haven't been to Taiwan yet. Small portion, so you can have a variety of food, it's an hour away from where I live, but will visit again for sure!"}
{"text":"Had dinner with friends at Papa Chang and I was surprised with how small the restaurant was. We were asked to provide a phone number so that they can contact us when a table became available. I spoke to my friend who has visited the restaurant before and she mentioned that this was what they usually did. Our wait wasn't long and we were seated quickly. 

The service was prompt and staff were attentive. Their popcorn chicken is delicious and their noodle dishes looked great as well ( I wasn't able to order this but the table beside us did). The curry chicken was also flavourful and not overpowering with spice. The food is very affordable and portions were filling however their atmosphere is more geared toward a quick bite instead of a sit down meal."}
{"text":"Really small establishment and can get really busy. Their wait system is pretty good though as they ask for your phone number and they call you...and it works because there is no room in the place to wait. Probably seats 20 people. 

I like the popcorn chicken and their fatty pork with rice. Their takoyaki is mediocre and so is the beef noodle soup. Price is decent. I'd go back but not my wife's cup of tea."}
{"text":"The few times we order take out. This is a good Taiwanese place. We order the popcorn chicken, beef noodle soup, sausage minced pork on rice, tofu and meat floss pan cake."}
{"text":"My husband really wanted Taiwanese food so we decided to check this place out. It's a teeny tiny restaurant so come in small groups or do take out! 

We decided to get:
Minced Pork over Rice (meh, my version is tastier)
Boiled Cabbage with Minced Pork Sauce 
Popcorn Chicken (anything fried is always good!)
Fish Skewers 

Overall I thought the food was ok but there are definitely better Taiwanese spots out there!"}
{"text":"I've heard good things from friends about the food at Pa Pa Chang's so it's been on my list for a while. Walking in, it was a lot smaller and more casual than I anticipated. The tiny tables were so close together, we might as well have been sharing tables.

We started with Green Onion Pancakes that were a bit greasy but tasty. We shared an order of Taiwanese Sausage with Ground Pork, Preserved Vegetables, and Soya Egg over rice and a Bento Box with Braised Pork Belly and Preserved Vegetables.

The flavours were good, kinda like a good home cooked meal. The presentation lacked finesse though, not quite what I expect from a restaurant. It reinforced that home-cooked feel. Come for the food."}
{"text":"This is the second time that we've been and it took a lot and a long time to convince my husband to go back.  Now, he'll never go back and I'm with him on that.

The rice was so moist and glue-y.  The sauces were so thick and jellyish/gummy and sweet and flour-y.  The chicken used in the curry chicken bento was weird - strange texture, fatty, looked like multiple smaller pieces somehow bound together.

The taste of everything was just blah."}
{"text":"Visiting Toronto and heard about this place and went on a rainy weeknight. Thinking it wouldn't be too crowded, we were wrong. Place was packed and we had to wait about 30 minutes. Figured place had to be good if it was packed! And, we were right. The food was delicious!

THE EAT LIST:
Taiwanese Sausage and Minced Pork with Rice ($4.50):
Nearly every table had this dish. Really well balanced and flavorful. Better than a lot of places in Taipei, Taiwan! It was that good!

Signature Beef Noodle Soup  ($5.99):
Really hit the spot on a cold winter night! Beef melted in your mouth and that signature Taiwanese Beef Noodle Soup  flavor was abundant. When it gets cold, I think about this dish.

Pop Corn Chicken ($4.49):
My wife and I just ate this up!. Just the right balance of seasoning.

Skewer Fish ($4.49):
Moist , flavorful and very \"photogenic\"!

SERVICE:
The ladies that night were very nice. They helped us first timers pick out what to eat and chatted us up for bit even though they were super busy.

Waitress that night were multilingual heard them speaking English, Mandarin and Cantonese.

TIPS:
Try to get there early before the busy hours. They're in a strip mall with parking, but parking spots go quickly so get there early. If you can't get there , wait , it's worth it!!!

While we were eating, a Jamaican couple opened the door and the man said out loud, \"Wow it's busy ! It must be good ! But, I don't know if it's worth it to wait around 30 minutes for a table.\" So, I shouted out, \"Hey, the food is awesome it's worth the wait!\"  He gave me a smile, a thumbs up and stuck around!

CONCLUSION:
Awesome Bang for your Buck! (Did you see how cheap the items were? Closer to downtown Toronto and it would be like 3 times more!) Asian Taiwanese Japanese Comfort Fusion Food at it's very best!!!!  Get there early and bring your appetite !"}
{"text":"I think I'm in bad luck that I met the worst waitress here!! We had 6 people, and the waitress realise that not everyone were here.  She said she can't give us the table, as we have to wait for everyone are here.  At the same time, my friend was about to sit down, and she ordered her, \"Do Not Sit!\"  I was so mad with her attitude.  I don't think it's difficult to add \"please wait\"... However, the story continues...

Since my friends were arrived, so I told them what we've experienced earlier... the same waitress came to us, wanted to ask us what we want to drink.  She also heard what I was telling my friend, then said, \"Miss, what's wrong with you?\"  OMG!  I don't know if this is her personality or what?!  I'm sure that this is not what a waitress should say!!!  I was very mad with her attitude, and at the same time, I tired not argue with her, and I said, \"You just need to give me iced water, that's it!\"  Then she turned away, and murmur to herself loudly, \"so bad!!\"  This makes me more angry!! Thanks her!!!

All the waiters were trying to separate us, I can see that!  Even the owner came out and trying to settle the issue.  When I was talking to the owner, that waitress just couldn't shut her mouth up!!!  She interrupts us, and trying to twist the story to the other side and cover all her bad wordings!! 

I really don't care how the foods were!!  All I know that the waitress has a very bad attitude!  Even the owner and other waiters were trying to help her... but... they just can't!!"}
{"text":"I ate at this restaurant on the weekend with my family.  I didn't think that the food was that tasty. We ordered 3 dishes. Two rice and a soup beef noodle. I was surprised that it came out so fast. I would say that all three dishes came out within 10 minutes. But they were not hot.  They were warm only.  The service was good though. But this is what I thought.  But the place was packed and people were coming in none stop. I guess some people like it.  But I wasn't impressed this time.  Hopefully next time will be better."}
{"text":"Love this place : )   I come here often for either take-out or eat-in.  Food is made with passion.  Everything in the menu is good and there won't be any disappointment.  My favorites are the fish skewer and fried intestines. 
**Pan fried rice cake with oyster is not available on weekends**"}
{"text":"Probably one of the most interesting spot for Taiwanese food in GTA!  Food is traditional Taiwanese street food style, the salty fried chicken aka popcorn chicken I called it-is a must try!  Juicy and tender inside while the outside is crispy.  Marinated pork rice, sticky rice etc-all tasty and authentic. The omelette was slightly disappointing. On the down side, the place is small-makes it unique as well, and they serve with plastic utensils(spoon and fork) that I didn't like.  If you're craving for Taiwanese food, this is the place to go!  Take out would be an excellent option!"}
{"text":"Came here becuase a friend suggested this place and i haven't tried much Taiwanese foods in Toronto since I went to Taiwan last year. The restaurant is quite small, only fits about 20 people or so. When I came in it was buzzing with people for Sunday lunch. Sat down and I think i was asked whether I was ready to order a few times (this is within the span of me sitting down for like 5 mins), so I was a bit annoyed by that, but i can understand it's because they are busy and need tables. 

We ordered the signature beef noodles, popcorn chicken, taiwanese sausage and the fish sticks. All the food in general was very delicious and tasty. I asked for the hot sauce on the side for my beef noodles, and in the end I didn't even use much of it because the beef noodles had a lot of heavy flavour in the broth and also in the beef. I also really enjoyed the texture of the beef, it was soft, flaky, moist and the fatty parts melt in your mouth :) the popcorn chicken is amazing, very similar to what I had in Taiwan. The only downside is that they don't have the oyster pancake - we asked the staff and they only serve it Tues-Thurs... which means I\"ll never get to taste it because I have work during the week and i'm not in that area. So that was a bit of disappointment. But overall the food was quite good. The three of us each had a bowl of noodles and shared the snacks and we were super full by the time we finished. And at 15 bucks per person for lunch, price is not too bad, but for asian food it is a bit on the higher end.

would like to come back again but I  want to try the oyster pancake sometime!!!"}
{"text":"I can't believe I never reviewed here even though I come quite often since is so close to my house lol.....

I pretty much tried a huge varieties of food from here and I will update pictures once I find them or go again next time. You can't go wrong snacking from here, excellent price, excellent snack and great place for hang out for lunch time or even dinner, the portion isn't too big but quite filling. A must try is the popcorn chicken. They got tons of yummy food, takoyaki, meat floss pancakes, shrimp tempura, pork cutlet noodles, etc.... 

They additionally have variety of bubble teas drinks as well. Quite sweet but u can ask for less sweet so it's all good. 

For sure they accept credit/debit payment so that's a plus since I rarely carry cash with me. Canto, Mandarin and english(they will understand u) so yeah! I definitely recommend this place for lunch or dinner!!

Recently they added few new food items in their new menu, I can only remember the ham and cheese in flat bread like or pancake wrap(will update when I find out the name, sorry!) check them out :)"}
{"text":"So we happened to be out in the sticks and hungry (after checking out the first day of Bruce's Mill Maple Syrup Festival - which was all kinds of awesome), so I pulled out my phone to see what my fellow Yelpers had to say. I yelled \"STOP! Turn in here!\" We pulled up to a little plaza and parked near Papa Chang's. There was a line up of a few people (a good sign) and we were the only caucasians (also a good sign)! The staff were super helpful and friendly - great communication - we only had to wait maybe 3 minutes and the constant communication by the staff made it feel like 30 seconds. This place is tiny - so don't bring a big group. It's clean, bright and bustling. Every single dish coming out of the kitchen looks and smells delish. They advertise as \"Asian Fusion\" but what I liked about it was the the dishes (to my knowledge) didn't seem fusion - just that the restaurant makes Taiwanese and Japanese dishes. We had the Pork Thick Soup, Popcorn Chicken Bento,Takoyaki, Green Onion Fried Cake and I think an order of meat skewers. Everything was great! The portions aren't huge but the prices are good and this way you can order lots for cheap! I wish we'd ordered the Taiwanese Sausage and Minced Pork with Rice - it seemed that a LOT of people were ordering it. Also the kind of bubble teas looked great, but I was told by the staff that unfortunately they didn't have any soy/rice milks so I had to pass on them. They were popular too. The only thing that this place would need to do to make it 5 star would be to expand into a larger space. Great food! Great Service! Great Price! Love this place. Will definitely go back!"}
{"text":"I visited again last Sunday for lunch.  The business was non stop busy.  I was impressed with the variety of offering.  I started to find the prices a bit high.  For example, a small vegetable dish costs $6.49."}
{"text":"My favourite place for Taiwanese food. My go tos are the popcorn chicken, beef noodle soup, minced meat with sauasge with rice, and their vegetable dish. Some great sharing options are the pancake rolls, intestines, and skewers. Everything is really good and pretty cheap for the portions. Be prepared for a wait during peak hours, but worth the wait!"}
{"text":"I LOVE THIS PLACE! My parents live in the area so my boyfriend and I checked this place out Saturday afternoon around 1pm while visiting. We were greeted and seated right away. The restaurant itself is quite small and seats maybe 30 people? I noticed in the 1-1.5hr I was there, there were 10+ patrons coming in to pick up their take out orders, which is a testament to how great the food is. By the time we left, the place was fully seated also. 

The menu has quite a number of selections... All very reasonably priced and affordable. We ordered the chicken skewer, a beef crepe dish (forgot the name), popcorn chicken bento, chicken curry, and a litchi green tea. The food was delicious and portion size generous. My favourite was the popcorn chicken! Perfectly seasoned and just like right level of \"crisp\".  I could not stop raving about the food to my boyfriend while we were eating. Our bill came to just under $29 for two for a delicious meal.

In terms of the ambience, it's simply decorated but I appreciate how clean the facilities are! The service was quick and friendly.

All in all, I happily give this place 5 stars. I only wish they would open a location near home, but am looking forward to many more visits!"}
{"text":"My Orders: Satay pork thick noodle soup, deep fried pork belly, skewer chicken, signature beef noodle soup.

Pros
+ Food: rich, huge variety offerings 
+ Service: quick 
+ Parking 

Cons
- Ambiance: crowded, loud, a bit like a dirty \"food court style\" 
- Location 

I think I'll go to their pacific mall location next time."}
{"text":"Went here for dinner (March 19, 2016).
Waited for 30 minutes to be seated (on the waiting list).
Ordered:
Popcorn chicken;
Fried pork belly;
Takoyaki;
Fried tofu;
Minced pork/sausage rice bowl.

All fried dishes had their crispy exterior goodness.

Prices were reasonable.

Their food was not worth the wait!
The long queue was (probably) due to their reasonable prices and small place.

I would not go back; I have seen the wait staff use the same yellow cloth for wiping tables without it being re-washed & rinsed  for hygenic reasons.

The turn-over frquency of customers was high (on this particular night) hence, the quality given to clean tables/utensils/free tea/chairs/cups etc., was given a low priority.

Some customers had leftovers (noodles/drinks) and did not bother bagging them.

Softdrinks, $2.00.
Bubble teas, $2.85."}
{"text":"Love the menu. There's a picture for almost everything on the menu so you know what your ordering. There are many appetizers and side dishes that can be ordered like at Bubble Tea Restaurants. Got the Tempura shrimp, deep fried squid balls, fish skewer and popcorn chicken as sides; beef noodle soup and a honey dew smoothie to top it off. Yeah I know, I'm a glutton. Everything was very tasty but what stood out the most to me was the fish skewer....so yummy. Seating is limited and tightly compressed so you can hear the conversation at the table next to you. Good snacky food for an affordable price."}
{"text":"Extremely small place. Heard good things about the place and decided to give it a try.
Prices were good but food was meh. 
The small size of the venue made it kind of uncomfortable. They won't give you a table unless everyone of your party is there. i also witnessed that while there was a nice empty 4 seater table, they stuffed a 3 ppl group on to a 2 person table, probably because they were expecting more customers and didn't want to spare the table for the comfort of the smaller group.
Given the hype i heard from friends and such, it was a bit disappointing."}
{"text":"BEEF NOODLE SOUP the best in Town and Highly recommended, I am sure you will return. 5 stars for foods!!"}
{"text":"Price and food is both good.  Reminds me of street food in Taiwan and love it.  Place is quite small, but tasty food with a lot of flavours.  Great for take out as well."}
{"text":"The good: the price is probably the best part of this restaurant. I was highly recommended to come here after trying mama bear for the first time (it's hard finding a good Taiwanese restaurant). However...

The bad: I didn't enjoy it as much as I did with mama bear. First let's start with the popcorn chicken. It wasn't as crunchy, as flavourful, or as authentic as the ones I tried in mama bear - mind you it's good but not great. The rest of the dishes were forgettable. One unique thing though is that they did have a traditional Taiwanese glutinous meat dish - this isn't something you would find normally even in Taiwanese restaurants. I am glad that they had it, but it wasn't as good as the one I tried in bubble republic (which unfortunately they have taken out in their menu).

The ugly: ugh I hated their service. They didn't offer a table because we were missing one person. Luckily we got a table before the huge dinner rush came in. Portions are smaller than expected.

Neutral: as mentioned above, there is usually a dinner rush so be sure to be early and grab a table. Good for smaller groups as there isn't much space. Great for takeout."}
{"text":"Taiwanese food! I always find it so comforting. Maybe cause it reminds me of home. This restaurant does a pretty good job at TW homey food. The menu is pretty varied, with the usual Taiwanese snacks.. but disappointed there's a lot of things not available such as stinky tofu, oyster omelette, and oyster noodles! Instead, this time we ordered: pork thick soup, fried tofu with pickled vegetables, meat dumpling (ba wan), tempura with sweet sauce, minced pork noodles in soup, and wintermelon tea. 

The best flavours were the minced pork noodles in soup which tasted so flavourful and such a big serving, and the meat dumplings, which although the skin was not so Q, the filling was super tasty. The fried tofu was also pretty good, with a very thin layer of crispy and lots of soft pillowy tofu inside. The pork thick soup was okay. I found it had too much vinegar and too sour. The tempura was okay too but the sauce wasn't flavourful enough. It was very watery. I really miss the tempura in the street food stalls in Taiwan!!! And the wintermelon tea was too diluted I tasted no wintermelon at all. 

Overall it was pretty good, I don't expect too much in Toronto for Taiwanese food. I think it's a hit and miss depending what you order."}
{"text":"Awesome Taiwanese dishes and some pretty decent Japanese dishes too.  Here are the reviews of the things I had: 

a) Milk Black Tea w/ Tapioca - This bubble tea is a little on the sweet side and they have the small tapioca as opposed to the traditional tapioca.  Luckily, I requested that the drink be less sweet (siu teem) and they were able to do that.  The tea itself is okay but I tend to like my bubble tea with a stronger taste of the tannins and I felt it was more milky than tea.  

b) Popcorn chicken - DELICIOUS!  A must-have at this place.  It was just the right amount of crispiness.  It is definitely one of my favourite dishes there. 

c) Taiwanese sausage - Another great dish!  I really wish they had garlic slices to accompany it because garlic and that sausage is a great complement of each other to off-set the saltiness of the sausage.  However, it was still very good without the garlic :)

d) Takoyaki - This was a very typical takoyaki dish.  It wasn't particularly special nor was it particularly bad.  I think that when I go there next time, I may stick to their Taiwanese dishes only. 

e) Fried Tofu - Also a pretty ordinary dish.  

Overall, the place is extremely busy and it's not a place for you to go and sit down and chat & catch up.  There are lots of people waiting and they need to be able to flip those tables fast so that they can give everyone a chance to enjoy their yummy food ^-^.  I highly recommend coming here if you want to get great Taiwanese snacks for way cheaper prices than Ten Ren's or other places like that!"}
{"text":"I'm gonna update this review to acknowledge the fact this place doesn't use disposable materials ever since the renovations, and they use actual dishes and utensils now when serving.

I have also tried the signature beef noodle soup, and I find the noodles a bit on the overcooked side. I definitely prefer Mei Nung's noodle soups more.

Therefore, despite my previous review on upping this place to 5 stars if they improve the environmental side of this place, I'm keeping it at 4 stars."}
{"text":"Great place for Taiwanese food, I live really close to it and randomly encountered it a year or two ago when it opened. The restaurant is pretty small, although they renovated it a bit, the amount of seating appears to be the same. 

Definitely more suited for takeout, but sometimes it can take awhile because they are a very small operation."}
{"text":"Heard about Papa for just about 2 years right when it opened; was always fended off by the perpetual 1-hour waits.  Finally, friend moves to 3min away from Papa and we were able to get takeout and not have to eat in the discomfort of the little box that is the restaurant's space

It's really just Taiwanese comfort food.  Really, really good comfort food.  I had the preserved egg with sausage & rice; sweet & spicy fried fish cake and a cabbage dish I can't remember the exact name of.

I'm not sure if it's because I was particularly famished that day, but that was definitely the best and most flavourful Taiwanese food I had in Toronto.  All I can say is this deserves a visit if you're ever around Markham.  I would definitely go back and try all the other items on their menu; each dish is dirt cheap and quantity is there.  However, service is not great because they got our order mixed up (not surprising due to volume of customers all the time) and also.. there's just no space to sit or even wait if you want take-out.

Go for the food and eat at the comfort of your car/home, this is a winner"}
{"text":"This is definitely new favorite place for me and my fiance. This tiny place has great food with very affordable price. We've been there twice in the last two weeks. The food is better than the bubble tea place's food and cheaper.  

We tried the popular rice dish,  Taiwanese sausage and minced pork on rice.  It was delicious for $4.99 food.  You can add egg too for $1.00 each.  We also tried the pork cutlets curry. It was pretty good.  Huge portion for $5.99. We ordered a side as well, deep fried pork belly for $6.99. It surely can be categorized as a guilty pleasure food.  It was really good and addictive. Will buy again next time for sure.  

The second time we went we tried satay pork in thick soup with rice.  I think it was about $5.99 too.  It was quite unique and it tasted pretty good. We also ordered the popcorn chicken side dish, which was delicious too, and deep fried intestines side dish, which was pretty hard to chew but tasted pretty good.  

Besides the food,  I found the service was great too,  they were friendly for the two times of our visits.  Definitely will go back to this place often to try out different food they have."}
{"text":"I came here two days ago and I don't believe that this occurs.  We asked the waitress since I don't eat pork do they cook pork and other meats in the same pan the waitress said yes so if you don't eat pork don't go to this place."}
{"text":"The reason I started writing reviews on Yelp is because of this restaurant, I just don't understand why people are giving this restaurant such good reviews.

I am Taiwanese, so I know how Taiwanese food taste like, and this does NOT taste like Taiwanese food.  It might have the same name, they tried to cook it the same way, but it taste nothing like what it's supposed to be.  The flavor is completely off, not Taiwanese at all.  

The Taiwanese BBQ pork I had did LOOK like the ones in Taiwan, but the flavor is wrong, even the sause is not right, and this dish is all about the sause you dip in.  The Tempura was rubbery, and I tasted more of the deep fried oil than the flavor of the fish cake.  The fried instines was crispy, but the ones I eat in Taiwan will never have a smell to it, I left 2/3 of the dish untouched.  The popcorn chicken is one of the worst flavor I've had in GTA, you can go to Cha Me Cha or Ma Ma Bear and have better popcorn chichen than this.  The only thing that was some what palatable was the beef noodle soup, but this does not mean it's good, even Ma Ma Bear has better beef noodle soup than this place, and Ma Ma Bear isn't really good for their beef noodle soup.  

If you want to go to a place that offers you a lot of variety of food with Taiwanese names on it, then this is the place, but don't expect to enjoy your meal if you are a real Taiwanese.

I give it a 4 out of 10."}
{"text":"Searched for best take out places in Markham and came across this place, and I must say it was a great choice! The waitress said the most popular dishes are the signature beef noodle soup, minced pork w/ rice, and the pop corn chicken. So we ordered exactly that and added the deep fried fish cake. The beef noodle was loaded with a lot of beef and beef tendons that were really soft, the soup was flavourful and the noodles were the right level of chewiness. Great value for the money and tasted great too! They separate the soup and the noodle to it won't get soggy. The deep fried fish cakes were really good (my favourite), and tasted great with the sauce, although it could use more sauce. I would definitely order these two items again. The mince pork rice and pop corn chicken were average. Overall great Taiwanese food if you are looking for something quick and reasonably priced!"}
{"text":"Papa Chang's is your go-to for a great selection of Taiwanese eats. Prices are reasonable for the food you are getting. The restaurant is quite small but turnover is quick since food comes out fast. From noodles to pancakes and the classic minced pork with rice, this is the place for those craving some Taiwanese eats. Keep in mind that the place is quite small so the biggest struggle is going when it isn't busy!"}
{"text":"Beat Taiwanese food in town.  I come here weekly.  Popcorn Chicken is a must eat and Bento box is excellent with a low price point.   The BEST"}
{"text":"Cheapest and fulfilling Taiwanese food. Their minced pork and braised pork rice taste very authentic. Actually all of their food are very close to what I had in Taiwan."}
{"text":"If you're looking for some relatively inexpensive or reasonably priced small snack meals then this place is for you. I got the signature beef noodle soup. Everything tastes fine but nothing wowed me. Also, you have to pay extra for hot sauce."}
{"text":"Small Taiwanese cuisine place. Cheap, big serving and fast service. Lots of choices from noodle soup, rice toppings, snacks and bubble tea. Love the chicken popcorn and fried intestine. 

Debit or cash only."}
{"text":"Not a bad place for the price.  The food wasn't super memorable.  Yes, it's traditional to a certain degree, but definitely not up to the standards of what you get in Taiwan.

First order up, sausage & pork with fermented cabbage rice.  Sausage was good, but not the best.  The minced pork wasn't marinated really well and just not done the way they do it in Taiwan.  I could taste the freezer taste of the meat.  But for $4.50, you can't expect too much, I guess. 

Second order, special house beef noodle.  Too sweet for my taste.  Beef was not tender, and it was also a bit dry.  But again, for $5.99, you get what you paid for.  

Third order, shrimp wonton in soup.  The shrimps was not fresh.  They didn't bother taking the \"long-black-intestine-looking-thing\" out of the shrimp, and that is my pet peeve!!!   But hey, for $3.50, you can't complain much.

I can see why people would like this place.  It's cheap, fast, and you get sizable portions.   But definitely not \"good\" or \"fresh\" quality food.  I guess I'm picky.  Where cheap Asia street eats taste already pretty amazing.   

I came thinking there was a hidden traditional Taiwanese jewel gem hidden outside of Toronto, but sadly, disappointed.   I don't think I will ever make that 35 min drive out here again for the food ever and settle for Tai Ping Hsiang instead, at  MetroSquare."}
{"text":"This is a small restaurant and it was quite busy on a late Wednesday night. I've been to many restaurants. Surprisingly, I have not been to one that sells this type of food so I was excited to try this restaurant. We were promptly greeted and we got seated (luckily, we got seats!).

My boyfriend and I ordered popcorn chicken bento ($6.99), Japanese style tako pancake ($4.49), Takoyaki - squid balls ($4.49) and deep fried pork belly ($5.99).

My boyfriend thought that the popcorn chicken tasted like popcorn chicken from Destiny. I thought that the popcorn chicken tasted like friend chicken that my mom has made in the past for me at home. With that being said, we both enjoyed the popcorn chicken but we just don't see the hype.

The Japanese style tako pancake and the squid balls were both disappointment to me. I think I'm just not into this type of fried, doughy dishes. It was a bit too much to share two fried, doughy dishes between two people and I wish we ordered something else.

The deep fried pork belly was a major hit for us. Who can resist pork belly?! It's fried on the outside and cut into thin slices. I would highly recommend anybody to get this dish.

The service was great. The food came quite quickly and they made sure our cups were never empty. One thing to keep in mind is that they accept cash only."}
{"text":"AMAZING 

but so god damn busy .. But well worth the wait : YOU'LL line up and say it's worth the wait too :) real talk ! 

I was papa Changs first customer .. VIP status now :) forever engraved in stone :)

I'm so happy for them & after seeing a progressive roller coaster of ups and downs : I told em they would be successful as long as they don't sell our culture out by serving chicken balls and crappy fake Chinese food ! Real talk ! They stuck to their roots ! and now they have no competition that serves their type of cuisine, the rest is history !! Now looking forward to pa pa Changs expanding in the near future ?? 

Newly renovated , fully up to code : male and female washrooms ! no more walking thru the kitchen ! LOL 

New menu is in effect ! 

highly recommend the pop corn chicken , don't be thinking KFC .. you noobs ! Just order it ! You'll be happy ! Ask for extra wasabi sauce on top :)

pricing is great : decent portion size 

The best thing & main reason why they are so good : even if you happened to wait in line for a little longer then expected , sit down & the place is rammed busy with tons of ppl , your food may take a few extra minutes 

BUT ...

I can absolutely say without a doubt .. 

They will make your dish with some pa pa Chang love ! 

It will be well made ! well prepared & it'll taste great : stamp of approval without a doubt !"}
{"text":"I love this place, seems to be one of the only decent taiwanese snack places in Markham/Richmond Hill (that isn't overpriced a bubbletea store)!

I usually find myself getting the same things over and over, including popcorn chicken, sesame flatbread with beef, minced pork noodle soup and original black milk tea with mini tapioca pearls.

The prices are very reasonable but can add up quickly as they are mainly snack size portions!

If you come here during lunch/dinner times, you can be waiting for up to an hour.. as the seating is very limited in this tiny restaurant; there isn't even any space to stand and wait inside..but good thing is that you can leave your number and they will give you a call..so you can sit in your car."}
{"text":"Always wanted to go here.

I got the Chili Stewed Pork Belly on rice. It was on the front page. 
It comes with some pickled veggies, minced pork, lots of pork belly, and a big scoop of dried chilis. Before mixing, I tried each component on its own. Everything was delicious. The chili was unique and extemely flavourful. Upon eating, I found it to become more and more spicy. It was actually quite a decent amount of spicy too. 
The pork belly was so juicy and flavourful. I was also extremely pleasantly surprised to find minced pork underneath since that seems to be the speciality of this place. I got to try that, and it really made the rice underneath tastier to eat. Not just plain rice and pork belly slices, ya kno. 
Upon reading reviews and looking at the low price, I was expecting very small portions. However, even though my friend and I came in straving, we both were unable to finish our rice bowls... the bowls look small, but they are deep. That being said, there is not a huge amount of rice compared to the meat. There is quite a good balance that doesnt leave you with plain rice at the end. 

I also got the tako pancake, since I like japanese pancake. They looked similar topping wise, but this had wasabi drizzled all over it!!! The wasabi was a nice touch. Unlike the japanese okonomiyaki, this was a bit thicker with more batter. I liked it but my friend did not. It was also hard to finish since we were so full. We were also given a side of very fresh kimchi! I wish it had came earlier since we got it when we were both full. The server handed out everyones kimchi at the same time so maybe they had run out earlier. 

Overall, I would definitely come back to this place to try more of their snack items such as popcorn chicken, skewers, takoyaki. I'd also like to try the taiwanese sausage, since I've never had that before.

 Apparently this place makes fresh noodles (according to my friend). I am not a huge fan of soup noodles, but I love noodles!! Upon looking at the menu, I only saw 1 dry noodle option... in the future, I would like tto seem them expand their dry noodle options, perhaps adding some kind of fried noodles too."}
{"text":"friendly place 
legit taiwanese food, and very very well price food comes out very fast
its a smaller place 

5/5 stars i leave very happy every time"}
{"text":"Would not need to come back for their noodle soups. Their takoyaki and beef pan cake side dishes gave them a 5star. I would come back and only order sides."}
{"text":"I'm probably one of the last person in Markham  to eat at Pa Pa Chang's.  Seems like everyone I know has been there except me.  There's almost always a line up during lunch or dinner as the place is really tiny but hugely popular Taiwanese joint in an area of Markham not known for Asian cuisine.  Finally decided to have a quick dinner with the family here and the wait wasn't too bad as we got here around 6pm.  Any later the wait grows considerably.  

More of a Taiwanese fusion joint they serve classic Taiwanese fare such as popcorn chicken, beef noodle soup but also some Japanese fare such as Teriyaki and Takoyaki.

Really enjoyed the food here especially the popcorn chicken and braised beef noodles.  The only thing I couldn't eat was the crispy intestine as I have a serious gag reflex when it comes to pure fat.  I love tendon, organ meats etc...but when it comes to pure fat, I serious gag as the inside of the intestine is pure fatty chew....ugh!!!

Service is quick and polite as such a tiny place relies on high turnover.  They don't accept reservations and the entire party needs to be there before they will let you sit down.  A lot of people call ahead for take out which is a great option too.  

Great Taiwanese fusion joint with great food, just don't make me eat any intestines!"}
{"text":"There can be a line up so I always go within an hour after it opens. The service is okay-ish, but they food came very quickly. The one dish I always come back for is their popcorn chicken!! The most tender and soft popcorn chicken I have ever had!! Also, papa chang's is very decently priced!"}
{"text":"Come strictly for the popcorn chicken. This place is more of a take-out joint than dining in. That being said, if you're craving some Taiwanese food, it's not a bad place to satisfy that craving. The food was pretty decent. Although seating and parking is limited and service isn't great. 3.5 stars for me"}
{"text":"Amazing food, amazing prices! They had a coupon on a website so i purchased and decided to try. It was so good and the prices were so reasonable, I'll definitely be coming back again, coupon or none!"}
{"text":"Excellent taiwanese food
Its not become my go to taiwanese resturant as i enjoy something called a guan dong ju, or team buck lat. note those are from cantonese pronuciation and probably called something different in mandarin. 
Though for taiwanese noodles, i would suggest somewhere else as their rice is much better than their noodles."}
{"text":"This is our go-to place for amazing Taiwanese food. Albeit far from where we're located, we usually make the drive west just for Pa-pa cheng. Popcorn Chicken is a must if you do visit. My only complaint would be the premises; the dining area is tight with only a few tables."}
{"text":"Yes this place is cheap but I wouldn't say it's great food. Cheap, yes, but poor quality. I wouldn't really go back. There are tons of better places with food so much better. It's really packed so I guess people love going for the cheap food. I prefer paying a little bit more for better quality. You get what you pay for. Any place where there are bones and cartilage in boneless chicken makes me wonder what's really going on in the kitchen..."}
{"text":"Papa Chang's is a really small restaurant with delicious food! The service is extremely fast and the prices are very reasonably cheap. 

We visited on a Saturday around peak dinner time and it was packed. The restaurant can only hold about 15-20 people in there at a time so be prepared to wait. It is worth the wait though!

After waiting about 5 minutes we were quickly seated and provided menus. We ordered their specialty/popular dishes that were posted on the wall.

The Minced Pork Rice with Sausage was delicious. They used Japanese rice and the flavours were blended very nicely. Option of having an egg added too at no charge.

The House Special Beef Noodles were also great. Noodles had a great texture and the soup base was not too salty. Beef was tender.

Popcorn chicken is OK, nothing special. Worth a try and good to have as a starter but it's not a must have.

My only complaint is that the restaurant is very small and space is tight. You can't really have a conversation as tables are seated very closely together so you start to overhear each other. Otherwise service is fast and food is great. Will definitely go back again."}
{"text":"I've never been to a place with such tasty and delicious taiwanese food as here. Everything we got just beat my expectations in terms of the quality and taste of the food. The best thing also was the food was super cheap!

We had popcorn chicken, deep fried shrimp, satay beef with noodle and the chilli minced beef with taiwanese sausage and rice. Each one of those dishes was the best version of that dish I've ever had, except the deep fried shrimp, but everything else was awesome. Even though I haven't tried authentic taiwanese food, I feel like this is the closest to the real deal as it gets.

I recommend this to anybody because the food is actually really good and is super affordable."}
{"text":"This is my favourite Taiwanese place! Everything from here is relatively good but the braised beef noodle soup is the best I've had in Toronto. I'd definitely recommend this place, just be prepared to wait a little if you plan on going around lunch or dinner."}
{"text":"Visited Papa Chang's a couple of times, and fell in love with their delicious food and service! Great portions, consistent quality and fair prices #worthyourmoney. I'm so jealous for those who lives RIGHT NEXT TO this restaurant T_T lol.

I gotta say, every dish at Papa Chang's is REALLY TASTY! But I can only eat so much at each visit XD My goal is to try every single dishes on the menu :D Chef Chang (the owner) used to be the Head Chef at Ten Ren's Tea. He quit and opened this small restaurant, hidden in the NW corner of 16th Avenue & Markham Road. Please also note - the restaurant will only remain open if Chef Chang is on duty D: But never fear, he is a workaholic lol.

The restaurant probably seats less than 30 people, and they do not take any reservations! The best time to go is for lunch and late brunch, there is little to no wait. The worst time to go is probably 5pm and on... BE READY TO WAIT! and surprisingly people are willing to wait outside the restaurant XD They also do take outs too, so call early to place your order!

So far, these are my fave dishes at Papa Chang's!
- Popcorn Chicken (MUST order... BEST in the city!)
- Japanese Style Tako (Squid) Pan Cake
- Japanese Style Tofu
- Skewer Fish (melts in your mouth!)
- Marinated Beef Shank in Sesame Flat Bread
- Satay Pork Thick Soup Noodles

Mr. Ho at the front of the house is HILAROUS! He is an older man and the one-and-only server at Papa Chang's. Absolutely love his stories. He is a very pleasant person to talk to! Both times I went, we received free egg pudding on the house from Mr. Ho! He told us to guess the main ingredient in this special homemade egg pudding. I can't believe one of my friend actually got the right answer AND I had NO IDEA or ever heard of that ingredient *applause* :D

The restaurant gives you this vibe where you feel right at home. You can easily make conversations with people sitting at tables next to you :) Everyone there is so friendly and just want to enjoy some good food... all foodies out there hahaha ;) Definitely my kind of place! Can't wait to visit again!

P.S. Just a random note... Chef Chang is quite buff in person LMAOOOOOO"}
{"text":"Went to Pa Pa Chang's on a Friday night based on rave reviews.

Upon arrival, it was empty, just one table with a family eating.

Friend and I ordered the Braised Pork Belly and the Popcorn Chicken.
For drinks I had a Strawberry Milk Tea with Tapioca.
We paid and sat down, 20 minutes later, the chef comes out to let us know that it will be another 20 minutes for our food.  I think they had a large takeout/delivery order or something? It would have been nice to know before we had ordered.

The drink was artificial strawberry flavour, but I liked it cause I guess I like candy, lol.  When our food arrived, I thought it was just okay.  It wasn't as amazing as everyone had hyped it up to be.  


I felt bad for the chef as he was a one man show, literally.
He was the only person behind there, and trying his best to keep up with the orders.
I hope they hire some more staff, or figure out a better system to operate, cause a 40 minute wait for food isn't cool, especially at a takeout/cafeteria style place like this."}
{"text":"Can never go wrong with papa chang they have come along way i remember when they opened and had minimal stuff now they have a second location! More power to you guys!"}
{"text":"There's almost nothing in the neighbourhood that competes with Papa Chang's for fast and filling cheap eats. It's a small place that fills up quickly during lunch and dinner hours, but it's never a long wait to get a table. Of course, this isn't the place to go if you want to take time and savour your meal, unless you visit at off peak times. 

The portion sizes are reasonable for the price, and tastes fine. That's really it... Papa Chang's has neither the worst nor the best Taiwanese food I've tried, and neither the best nor the worst service. The speed and prices are what keeps me coming back, especially comparing against other restaurant choices close by."}
{"text":"For $5.99 you get a solid box of popcorn chicken! All their food was delicious. I've had their popcorn chicken bento, popcorn chicken snack box, and also their signature beef noodle soup. They are all super good and very very affordable. If you want to be satisfied, you are looking at under $10. If you are looking to get full and stuffed, you are looking at $15. Seriously nothing can be better than good food at bargain prices. I highly recommend the popcorn chicken here over all the other places around. Thus the mention of popcorn chicken so many times in this review!!"}
{"text":"First Time here tonight!
Decent crowd for a Sunday night and i was already hoping for some late night eats and I wasn't wrong. Overall the decor was changed from the photos that was on yelp, very good portion sizes and very yummy. I ordered the satay bento box and the takoyaki balls and it was very delish, next time I will order the popcorn chicken which is probably the famous food. My friend ordered the soup and some other pork bento box and he also enjoyed it as well. Overall it is a nice hidden jem in Markham, I hope Papa Changs open more restaurants soon!"}
{"text":"OH EM GEE ! can't believe I have not made my review to this place yet after having been visiting this place for at least a year. This is one of the places that gave me the reason to give back to Yelp by writing reviews.

This place to me is the BOMB.COM of comfort food. Whatever you order off the menu you can bet your tongue would taste so good you'd be wishing you had a spare stomach brought along. My favourite is the 5 spice chicken popcorn , Taiwanese Sausage with Minced pork on rice with pickled vegetables. The flavours are great, the portions Huge , the prices allows you to order a full course and still have spare for an after meal.  If your still standing after that meal of course :D.

The place is small though so best call ahead to make reservations. if travelling by group, get ready to break up into 3s and 4s if you want to be seated right away."}
{"text":"Must try: Popcorn Chicken 

I have heard of this place a while ago but never got to try it because it's quite far away from my (food) hunting ground. So having finally tried it, I say overall it's worth the trek. 

It's just a general good feeling to have a table full of snack foods to sink your paws into, so we ordered various dishes to share. Highlights were 1) Popcorn Chicken: perfectly crispy and juicy and perfectly seasoned, can eat this forever. Got a takeout to go at the end.  2) Fish Skewer: the wasabi sauce makes this dish and gives it that pop, very enjoyable. 3) Taiwanese Sausage with Minced Pork on Rice: very nostalgic taste for Asian toddlers everywhere, good to pair with other meat dishes. 

We also ordered 4) Crispy Intestine, 5) Deep Fried Pork Belly, 6) Meat Floss Pancake and 7) Green Onion Pancake with Eggs. All very enjoyable as well. 

I had to took away one star because I think some more work could still be done regarding the sanitation of the dish preparations. I won't go into details as I don't want to distract from the quality of the food, but if more care is put into this, then everything would be perfect. 

Lastly, I really think Pa Pa Chang's should expand. May I suggest Finch and Yonge area? The opportunity is limitless, I guarantee it. :D

WYWH"}
{"text":"7pm on a saturday night. Full occupancy in this tiny cozy place. But turn over was fast. Wasnt too long of a wait but you have to wait outside in the cold (hence, knocked off a star). You leave your number and they will call you when there are seats available. 

Love the food. Cant get anymore authentic than this! What I ordered:
Minced pork and taiwanese sausage rice. Added egg
Spicy version of the above 
Spicy popcorn chicken
Apple soda

Food was here 2mins after we ordered! Amazing cuz i was starving and waiting in the cold. Cheap good eats. Will definitely come back again!"}
{"text":"The food was quick and didn't have to wait long for a table. The server, she was nice and friendly. The food taste alright and the drink taste ok."}
{"text":"Authentic Taiwanese food that is so good and so cheap!  This is my second time coming here for lunch and it was just as good as I remembered.  It's a tiny place that seats about 24 people and most of the tables are together which means you'll likely be sharing a table.  It's not a fancy sit down place so people come here really just for the food. The place will get packed by noon so both time we came at around 11:30am and was able to get a table for 3, or more like a table for 2 with a stool on the side.  We were okay with that since we weren't planning on sitting very long.

There's lots of small dishes like their famous popcorn chicken that you would find at night markets.  We didn't want to have any deep fried food so we went with basic comfort food, the beef noodle soup, Taiwanese minced pork and braised pork on rice.  All 3 dishes including tax was less $20.  Now, that's a hard price to beat."}
{"text":"[LOCATION] - 4/5
Wonderful place for both dine-in and take-out Taiwanese food. If I craved Pa Pa Chang on a weekend night, I would just order food to-go because the restaurant is often packed with customers (that's how you know a place is good!). 

[FOOD QUALITY] - 5/5
Excellent. Consistently delicious and comforting. 

[ORDER]
- Satay Beef Soup Noodle - $6.99: beef was well-seasoned and noodles were perfectly al dente.

- Popcorn Chicken Bento - $6.99: comes with fish cakes, vegetables, and a spring roll. The popcorn chicken was still crispy when I got home (thank goodness, I don't live that far from this place). 

- Taiwanese Sausage & Mince Pork with Rice - $5.49: classic, and probably my favourite Taiwanese dish. The minced pork is always juicy, sausage is cooked just-right. 

[OVERALL] - 5/5
I would highly recommend the dishes because they are affordable, and remind me of home-made Taiwanese food."}
{"text":"Fun and causal place for dinner or lunch. A lot of people seem to come here for take outs, maybe because the place itself is not that big and there's a lot of houses in the area. This place is also always full so prepare to wait or just call in to get take out.

Portions are not huge, but a 'good enough' size (maybe because I'm a big eater...). Reminds me of street food in Taiwan, but that is what they're going for anyway so sizes will more or less resemble that. As a rice fan, I thought their Taiwanese Sausage and Minced Pork Rice was sooo good... period.

Be sure to try their drinks before you leave; it's in a take out cup anyway. Personal fave is the pudding milk tea - not overly sweet like a lot of bubble tea chains but still creamy, and you can taste the 'tea' in it. Also has huge chunks of yellow pudding in it, yum. Another must try is their popcorn chicken that pretty much everyone is raving about. It's bite sized, nicely seasoned and crispy on the outside, while the inside is tender and still nice and hot when they serve it.

I also found their tea to be very flavourful. Not the tea you'd order from their menu, but just the tea they give out. One of the staff mentioned they use 'special' tea leaves or whatever, which I'm not complaining about because they were pretty good, almost like jasmine and very fragrant. 

They've done menu revamps after the owner went somewhere to bring back new dishes so prepare to see some new additions if you haven't been already. The only thing that wasn't balanced imo here were the portion sizes and prices. It's not expensive to say the least, affordable actually, but for the portions they give it's not as well balanced. For the times I've been here I can never be completely 'full' unless I order a huge amount of food on the table, which isn't that big to begin with since the place is small.

All in all though, definitely a fan of Pa Pa Chang's."}
{"text":"Always fast service and great food. Only downside would be wait times if you go at peak hours, not a lot of seating available.

Take out is always a solid option though."}
{"text":"Went on a Tuesday afternoon with my brother. Glad I found this gem right by my home! (:

Food: Gotten popcorn chicken bento, teriyaki chicken bento, and fried shrimp. All are really yummy! Especially popcorn chicken! Food came quickly and the price is fair for the amount served. 

Service: The place is run by an old man. Seems nice. Don't really expect to have your table set up like in other restaurants or cafes. Dining in here is okay; though this place is better for takeout in my opinion. 

Decor: This little unit is hiding within a plaza by 16 and Markham rd. Again, wasn't really expecting much judging from its outer appearance. The inside is very home-y and family oriented with cute signs  hanging in the walls. 

Will come back again with friends and I want to try delivery too! (:"}
{"text":"It has been awhile since my first review but the place is still consistent and really good. Great place for a snack, meal or chat... or well just great tasting and decently priced food.

So far everything has been great quality and very tasty. If I had to pick a dish to not get it would be the curry rice. Its not bad but there are just so many other better options on the menu in my opinion. 

Great quiet location as well but be warned, it does get busy!"}
{"text":"The food was okay okay average, i liked it but my boyfriend didn't fancy that much. 

Portions are small, food was very salty, the space was very small and uncomfortable, cramped. And the price is slightly higher than we expected. 

I didn't mind becuz i am kinda used to Taiwanese food, but wudnt eat it everyday or every week. 

But the service was great, very friendly people."}
{"text":"My third time there, tried the beef noodle and skewered fish. The fish is on the oily side, but its so tender it melts in your mouth. The beef noodle is okay but I like the one in Mei Nung (in first markham place ) better."}
{"text":"Popcorn chicken was delicious!  Good pieces of chicken too - not those fatty gross parts.  Will definitely eat here again!"}
{"text":"I came back after a full year of avoiding this place.  But there always comes a time when I have to return to the scene of the crime and determine if it was as bad as I remembered.

Thank God I am not a stubborn person and came back :)
I really, really, really enjoyed the food. 

The popcorn chicken was soo delicious although a little small.  The pork intestines were really oily so we left it alone for the most part.
The beef brisket soup my boyfriend enjoyed; it was huge and very, very, very spicy - so beware!
I think you just have to know what you're ordering as the store doesn't provide a lot of descriptions/pictures.
The price here is A-OK; especially for being one of the only decent Asian restaurants in the area (yeah, I'm looking at you Canteen -_-)

Surprisingly, I really liked the bubbletea here (mango flavoured) the tapioca was so soft and chewy.

The service here is on point - there's 2 servers running around and you just need to wave to get their attention.

Definitely be back (like today)."}
{"text":"i think they may have changed owners? Came here for lunch on the weekend and the food doesn't taste as great as I remembered it to be (which was probably a year ago). Quite disappointing.

Ordered the minced pork with sausages on rice - this was alright. $4.50
the 'pang pang fish' ($4.99), which was fried fish skewers was disappointing though. I remember it being a lot more tasty the last time I had.
the porkchop pancake sandwich was disappointing as well. when we ordered we asked to add an egg inside but it was missed. there was so little porkchop in the pancake sandwich. the pancake sandwich texture was flaky but lacked flavor, it was all dependent on the porkchop and a little bit of coleslaw.
the popcorn chicken was good, probably the best dish of the 4 I tried

pricing is decent, we ordered 4 things and the bill was less than $20 - what more can you ask for?"}
{"text":"Good place for some taiwanese snacks.  Would recommend takeout instead of dine in.  Place is pretty cozy"}
{"text":"Came here around 8pm this past Tuesday when there was a snow storm warning. Weather was bad but the silver lining is that we got a table right away. I came here 1-2 years back because my sister was raving about the amazing food and more than reasonable pricing. Only stopped coming because my boyfriend insisted that he found a dead bug in one of the dishes we got. I came back Tuesday since I was nearby with a friend and bug or no bug, this place serves some kicka$$ food! 

Food: 4 stars
For the price you're paying, you can't find anything better elsewhere! My friend and I ordered the popcorn chicken, takoyaki, signature beef noodle soup, minced  pork and sausage with rice, a tako pancake, and pudding milk tea as dessert. Everything tasted so delicious!!! If you get the takoyaki, there's no need to get the tako pancake because they're basically the same thing but just in different forms. A bit of a bummer that the pudding milk tea doesn't have any pudding. You have to pay extra to get the physical pudding, otherwise it's just powder for flavor. For the signature beef noodle soup, you have an option to have it spicy and that's what we got. It was only mildly spicy. I think popcorn chicken and the minced pork with sausage rice dishes are their most popular items, and for a good reason, they're really good! 

Ambiance: 2.5 stars
This restaurant is very small and it's a bit rundown. It can also get quite loud when it's busy too. I don't find it much of an issue since I'm sure that helps keep the prices low. It's more if a grab and go place. 

Service: 4 stars
The lady serving our table was friendly and refilled our tea immediately after we requested it. She was very nice, have recommendations, and let us know of available options with certain dishes we ordered. Service was better than most Chinese restaurants."}
{"text":"Taiwanese food close to my new home? Had to come try it out.
At my old job, I had Taiwanese lunch boxes almost every weekend. It was great and having a place so close to home would be awesome if it was good.
I came for lunch and got the popcorn chicken lunch box. It definitely met my expectations but did not exceed it. There are so many options and Taiwanese favourites here that I can't base my experience off just this one lunch box.
I do plan to come back and try out more of my other favourite dishes. So the positive to take away from this is that this place is not bad."}
{"text":"Oh Papa!!! Finally a decent restaurant serving decent Taiwanese food. If only they weren't so far, I would totally be there all the time! This little joint on the corner of 16th and Markham Road is staffed with an experienced chef who has worked at Destiny for years. As you may have already heard, Destiny is owned by Taiwanese people and they've trained this chef well...to the point where they definitely serve extremely better food than destiny. How? To be honest I have no idea...

At any rate, I have had to fortune of trying many things in this restaurant:
- beef noodle soup: awesome.
- taiwanese bbq pork (deep fried pork belly): amazing
- boiled veggie A in bbq pork sauce: as taiwanese as you can get!
- braised intestine: mmmmmmmmmm, MMmMmmmM, MMMMMMMMMMM!!
- popcorn chicken: great
- minced pork rice: good
- fish and chicken on a skewer with wasabi: meh


Okay, I think I'm done here. Looking for taiwanese street food? stop by. it's about as good as you can get in Toronto."}
{"text":"After seeing all the reviews, my wife and I decided to stop by and try this place out. It was a bit tricky to see from the road as it is a small restaurant inside a strip plaza - I would look out for the Markham Heritage Clinic as it is in the same unit.

Decor: As others mentioned, it is quite small but very new. There are 2 large 6 person group tables and 2 med 4 person tables and 2 small 2 person tables. Nothing wrong with it but inside is quite plain. For us, this didn't matter as we wanted to try the food.

Food: So we decided to order 2 bento boxes and 1 flatbread sandwich to share.

Spicy basil chicken - flavour was good but it was not spicy. The sauce mixed with the rice worked quite well. I found the small fried fish cake to be great!  I would order just 1 dish of the fish cake by itself! The mixed greens and spring rounded out. In general, I liked it out.

Stewed streaky pork - flavour was strong and better than the chicken one. I liked this more but be aware that is your fatty pork so not for the calorie conscious! The stewed meat and juice blended with the rice which was a softer sticky one. Rest of the box had greens, fish cake and spring roll. In general, definitely good if you don't mind the fatty bits!

Seasame flat board with crispy chicken - This was our favourite one! The bread was crispy on outside and chewy inside. The chicken was more like BBQ chicken not your deep friend one. But it tasted great - I will definitely order the other ones to try.

Price: Very reasonable - our order came out to $20 with taxes included

So we will definitely return and check out the soup noodles dishes as that seemed to be the other popular choice."}
{"text":"A cholesterol party that you don't want to miss.

We ordered fried fish skewers, popcorn chicken, takoyaki, Taiwanese sausage + minced meat rice bowl, and 2 milk teas. 

Sodium-rrific, and totally gym-worthy, but I wouldn't go out of my way to drive here for food since it's not my type of comfort food and there have been better tasting Taiwanese places I've ate at in Toronto these past 25 years. If you dare to challenge the status quo of tastebud hype and current trends, try  Tai Ping Hsiang (????????) at Metrosquare for equally good if not better, popcorn chicken. Izakaya Ju in J-Town on Steeles has more authentic takoyaki too. 

Yeah yeah, I hear all of you shouting that this is a street food vendor so I'm giving unfair comparisons. But this is a street food vendor that has chosen to try and spar with small sit-downs and takeaway establishments. It's only fair to expect them to step-up their game. In the near future, I hope Pa Pa Chang saves up money and moves to a roomier space with air conditioning next summer. 

And I hope they deal with that random ghetto wash sink I sat near---strangers getting up and lining up to wash their hands behind me as I ate popcorn chicken and said \"Yummy\" is a very unique experience...what they really need to do now is add a bucket to go with that sink since this shop lacks a washroom. 

Good times had by all.

**Update** I've been informed that there -is- a restroom in the shop, and that it has to cut through their kitchen door.  And they are renovating for the month of July. :)"}
{"text":"Went here for the first time today. Ordered around 5 dished and I enjoyed everyone of them - no complaints!  It's a very small place though, so expect some waiting."}
{"text":"This place is awesome to get a quick yummy dinner. It's basically a Taiwanese / Asian fusion take out restaurant that is well priced for good food. 

As another reviewer also mentioned, they take a lot of care in making good food. 

Popcorn chicken is awesome, I get this a lot. Sesame flat bread is my favorite. I always get one when I feel like a quick bite. 

It is a bit hidden so keep your eye out for it."}
{"text":"Great place for Asian eats! The venue is quite small, but the service is quick and friendly, and the food is consistently good for snacking on! I always order their fried food, since it's so crispy and light. Definitely get the tempura shrimp. The popcorn chicken and takoyaki are quite good as well. Whenever I get a craving for some fast and fried Asian fusion food, Papa Chang's is always at the top of my list!"}
{"text":"Best Taiwanese food in Toronto and at cheap prices too! Everything I have tried is very good, but my favourite is their spicy beef noodle! The beef is tender, noodles are chewy, and the broth is flavourful and just the right amount of spice for me. I also recommend the popcorn chicken bento and the braised pork and sausage with egg and rice. Their drinks are actually pretty good too for a restaurant that doesn't specialize in bubble tea. It doors feel like you are eating in a food court, but if you pay attention to the decor they actually have a lot of cute retro items spread throughout. The only bad thing about this restaurant is that it's so small and seats very little so there is always a wait and you feel rushed eating there. A lot of customers order take-out from here instead. I'm excited to try their new location in Richmond Hill."}
{"text":"Taiwanese food is rare to find in Markham and Richmond Hill area (other than bubble tea places). Which is surprising since there's so many of them here. Attracted by the raving reviews, I decided to try what ''authentic taiwanese food is like'' 

One of the item of the menu that can be agreed by all fellow Yelpers is the infamous Taiwanese popcorn chicken. I've had popcorn chicken in bubble tea places but it seems like a mediocre food to me until I discovered Papa Changs! Generous portions of perfectly seasoned, freshly battered thick chicken pieces with some rice. You'd think they would use white meat that usually comes out dry but they fried it jsut enough for the meat to perfectly break up... for a hefty steal for under 10$ !!!"}
{"text":"Pa Pa Chang is definitely an excellent addition to the neighbourhood! 

More of a takeout place but with a few tables for eating in, you can get some decent Taiwanese food and snacks at an awesome price!

Popcorn Chicken Bento ($6.99) made to order has a generous portion of deep fried chicken, rice, veggie and salad. Love the veggie on the side which was cooked perfectly and just love the sauces that comes with it!

There are also some Japanese bento selection like teriyaki chicken, curry with rice. But I will definitely be back for some other Taiwanese snacks and noodles!

2/15"}
{"text":"Great value! I definitely recommend the highly original Taiwanese meatball (it's a giant mochi-like skin wrapped around mushrooms and ground meat) and fish skewers. Will be back to try more for sure!"}
{"text":"Perhaps I didn't order the dishes their known for, but based on what I ordered I was not impressed. The menu looked interesting enough.

The two mains that were ordered included the curry chicken on rice and their highly recommended beef noodle soup. Side dishes included chicken skewers and fried pot stickers.

The curry chicken on rice tasted as if it was packaged curry. Certainly nothing home made about it. It was mushy and got boring real quick.

The highly regarded beef noodle soup I found to not have any unique flavours to it. I'm not so sure what all the hype has been about tbh.

As for the two sides we ordered I wasn't too fond of the chicken skewers which were mostly mushy and comprised of mystery meat and the pot stickers were average at best.

For a restaurant to be so highly reviewed and yet barely make my expectations I'm not sure what to think. Perhaps I was there on an off day? By no means am I a professional food critique, but seriously, you had to be there that meal!

Would I try this place again? Ironically I would. I find it hard to believe that this place comes with such high regard, yet barely makes mediocre expectation.

BTW, they DO take resos. (sorta) Call ahead!"}
{"text":"This place is CHEAP! You can get a full meal with tea for way less than a big mac combo. It's nuts. The food came out pretty fast too. I'd say in less than 5 minutes.This is a pretty good alternative to your typical fast food restaurant. The food is pretty good too. I got the rice with sausage and pork dish, and it was very filling and pretty delicious too. I wasn't so into the Taiwanese sausage but everything else was good. I have a feeling it's an acquired taste though. The restaurant is very small though so don't expect to meet up with a group of friends here."}
{"text":"I came here with a friend after seeing Pa Pa Chang's on Yelp. I thought it would be a nice way to try new food since I was planning on treating my friend for her birthday.

People have certainly mentioned this and I probably should have taken this tip more seriously, the venue this restaurant is in is very small. I'd say a maximum of 30-35 people at most could be seated in this restaurant. Luckily, my friend and I arrived fairly early during the evening at around 5PM on a Saturday. Despite the fact that they didn't have a table yet, we were seated roughly 5 minutes later. If they can't seat you right away, they'll ask for your phone number and call you when a table is available! 

According to past reviews, the price is supposed to be really good for the quality of food you get. I wouldn't say I'd necessarily disagree but I do feel as though the service could have been better. It took us quite a few tries to successfully have someone come over and take our order. I wouldn't say it was their fault as it was pretty busy in the restaurant. Several waiters and waitresses however, acknowledged that they saw us, gestured that they were coming and ended up going off somewhere else. Eventually, someone did come over and we placed our order. 

After a lot of thinking, we agreed upon ordering some sort of beef wrap that would have been really good had it not been for the egg that was inside of it. Don't get me wrong, I loved it but I did have to pick the egg out of it. I wish the menu or the waiters could have briefly explained what else was inside the wrap. I ordered the popcorn chicken bento box and my friend ordered some type of noodles in soup. She said she remembered previously liking it and I wish I could remember the name of the dish because she gave it the highest of praise. I'd say that the bento box was relatively worth the amount I paid for. I did end up taking half of it home which was easy seeing as the bento box was originally a takeout container anyways. 

I probably won't come back mostly because of how out of the way it is for me to drive all the way there. I'd recommend this if you're already in the area and looking for somewhere with quick service and cheap food though! 

Visited on November 7th!"}
{"text":"A few pointers: 

Staff are friendly and quick if you want take out
Lines can be very long
No dishes as of yet have displeased me
Definitely one of the better Taiwanese restaurants in the GTA"}
{"text":"I heard decent reviews about Papa Chang's so we went there for the first time with my fianc, but left almost immediately because of the horrible customer service. I would never give them another shot ever again."}
{"text":"Deliciously cheap Taiwanese food.
The down side is that the restaurant is very small and gets very crowded during dinner rush.
They have amazing apps.
Our favs are Popcorn chicken, signature beef noodles, octopus balls, fish skewer, and curry porkchop on rice.
Price is very affordable"}
{"text":"I haven't venture so far east for a while but heard so many good things about this place and I was in search of a good bowl of Taiwanese Beef Noodle for a while.... Papa Chang's do indeed deliver and is now my fave spot for a yummy bowl without the stinky tofu smell that I get at my previous fave 

Taiwanese Style Meatballs $3.49
~ This bring back so many memories, used to eat that back in high-school at bubble tea places.
~ It's just minced meat wrapped in a sticky glutenous layer which has a chewy texture... just love it.

Bon Bon Chicken $4.49
~ DF chicken skewers

Signature Beef Noodle Soup $5.99
~ Not sure if they make their own noodle but love the soup, the beef and even the house made Chinese Pickled Veggies. 
~ Love the homey feel of it, the soup wasn't as salty as most places but still packed with flavors.

Taiwanese Pancake
~ This was just a sticky globe and neither of us like the texture or the taste

Deep Fried Pork Belly $5.99
~ This was so crispy on the outside and still very moist inside but not oily at all while still having the yummy texture of the pork belly fat. And what a deal :)
 
Meat Floss Pancake $4.26
~ It was some sort of egg pancake, very soft and moist but rather bland after the stronger flavors of the previous dishes. 

Taiwanese Pineapple Cake 
~ This are made in house which I have never seen in Toronto

Verdict :
~ Will def go back soon for the Beef Noodle and the DF Pork Belly
~ Cheap and satisfying
~ A bit far but well worth it (^_^)
~ Says fusion but think it's pretty traditional Tawainese"}
{"text":"My party of 6 showed up around 7:30 pm on a Saturday, and the small seating area was packed! A lady took down my number and then called us about 20 minutes later when they had our table ready. She called multiple times, but she just wanted to make sure that we were actually coming back for our table and not ditching the restaurant.

We sat down and were promptly given menus and water. Due to the nature of the restaurant, I didn't expect service to be so attentive, but it was! The lady who served us was very set on getting our bill details right, and went over whose items were on which bills with us without acting frustrated at all (which has happened before, especially when there's a bit of a language barrier). She got everything perfect and continued to check on us as the night went on.

And of course, the food. I got the chicken cutlet/noodle soup combo, my friends got the spicy beef brisket noodle soup (never fails! The one here was SUPER amazing), teriyaki chicken bento, shrimp wonton soup, chicken cutlet bento, and the pork cutlet/noodle soup combo. With the 6 of us, I think the bill came out to about $50! Amazing prices for great food. The chicken cutlet was super super good! I would come back just for the chicken cutlet and the spicy beef brisket soup. These two items are definite must-trys here.

tl;dr: If you're anywhere within 20 minutes of Papa Chang's, definitely drop by! It'll be well worth your gas money :)"}
{"text":"Had dinner at Papa Chang's the other night because seems to have some pretty good yelp reviews. The place is fairly small though and being a party of 7, we were lucky that there was a table available when we arrived. I arrived first and the employee who greeted me asked me when the rest of my party would arrive. I told her that everyone should arrive within five minutes and she told me to sit at the side until my entire party was there. I guess it's understandable though, given the limited seating, it would suck to have someone occupy a table when other customers could be eating.

Once seated, we service was quick and efficient. I ordered the Taiwanese Sausage and Minced Pork on rice ($5.49) and added on a braised soy sauce egg ($1). The picture on the menu includes the egg but apparently it does cost extra. The food was delivered within five minutes. The sausage  was nice and lean and slightly sweet and the minced pork mixed well with the rice. The pickled mustard greens (???) helped to lighten up the dish. There was also a generous amount of rice in the bowl and I was fairly full afterwards. This is a great place to eat if you're in the mood for some Taiwanese fare and the prices make it a no brainer."}
{"text":"Had the pop corn chicken, it was soggy and oily.
the  pork belly was also kinda dry,  long wait for it."}
{"text":"Came here for a late lunch and the place was packed! it seemed like there were always more people coming in as well! 

the food was very authentic and the service was friendly. popcorn chicken & braised pork rice are must haves! 
really great price for the quality and portions! I would recommend to friends and definitely come back!"}
{"text":"If you want to dine in this place, you better come as early as 5:30 pm even during weekday! I came here for take out at around 630pm, and I was told they would call me to pick it up, so I waited outside because the restaurant was packed and also there were people waiting for tables, well I waited for 20 minutes and finally got my takeout but the waitress did not call me, I had to go in to pick it up, which I thought I should have come earlier to get my order. Anyways, other than the waiting, I would say the foods were great, popcorn chicken was juicy and crispy (if only it wasn't a take out, because it get soften once it sit inside the box for a while) :(, and I have also ordered the fried squid ball that comes in 12 pieces, smart idea of cutting each balls in half to make it look like there's a lot with only 4.99! lol...but I would definitely come back but next time I would consider coming earlier and try get a table. I rated a 4 stars."}
