{"text":"Papa Luigi est une belle place tranquille ou le service est impeccable. J'ai mangé des pennés au saucisses et sauce piquante. C'était délicieux. Offre une belle carte de vins et de bon dessert. Ma fondu au chocolat était délicieuse les fruits très frais. Je recommande la table d'hôte pour un meilleure prix :)"}
{"text":"Papa Luigi est un excellent restaurant italien. Le service est impeccable. Leur lasagne est probablement mon plat préféré."}
{"text":"Papa Luigi is a great restaurant l. We loved the steak and the lemon veal. The pesto pasta is fresh! Let's not forget about the filet mignon which was equally impressive. Finally, we loved the friendly service and the lovely ambiance. Romantic and delightful."}
{"text":"We had done a reservation and no one ever told us that the main street to get to the restaurant was closed for a parade. Drove 45 minutes just to be told by a police officer at a barricade that the road was inaccessible and we needed to park our vehicle 2 kilometers away if we wanted to get to our destination. Tried calling the restaurant but no one ever picked up the call. Some 30 minutes later, on our way back home, some lady called to ask if we were still planing on showing up. I explained what had happened and she didn't bother doing or proposing anything because of their mistake. Bad customer service. Shame on you people. No sense of business relationships.   NEVER AGAIN!!!"}
{"text":"Cosy atmosphere, friendly relaxed service, food is nicely presented. However, food was ok, and for me, dried pasta (as opposed to fresh pasta) doesn't get more than 3 stars."}
{"text":"Just finished a great meal. Soup was delicious, I had cheese tortellini and she had     Linguini primavera. Both really good. For dessert we shared \" cream brûlée \" and it was out of this world. Had red house wine and it was excellent. The decor is rustic and very clean. Yes, my wife says restroom was spotless as well.  Staff very courteous and pleasant.  Regular coffee was excellent but my cappuccino was delicious.  Cost is about $24 each person + Wine + tax + tip.  Real fair price for this resort area.  Highly recommend it and located in the heart of the town.  Enjoy!!"}
