{"text":"Love the breakfast burritos! Gone twice now and they are consistent. Very affordable too! Great customer service and very clean. Definitely recommend!"}
{"text":"Great grilled chicken burrito which believe it or not coming to California, too hard to find here in Arizona. Very nice service, clean place only thing I was looking for chips but 5 stars"}
{"text":"Wow. I love this place the best from the others...like FillyB's.... Thank you for finally opening one close by me...."}
{"text":"Great place with awesome service. We love the breakfast burritos and they also have call ahead ordering."}
{"text":"This is just another mediocre at best Mexican hole in the wall attempting to make good food with cheap ingredients.  According to the picture menu on the wall I had a chile relleno & enchilada with refried beans and rice & a side of chips and guacamole.   The rice served at my elementary school cafeteria had more taste.  Refried beans tasted like it came from a can out of a discount dollar store.  Before today, I didn't know it was possible to mess up guacamole... reminded me of watered down Nicolodeon slime.  I have to stop writing about the food because even thinking about it is tying my stomach into knots.   Customer service... if you call a kid giving you a blank empty stare that has the character of a piece of broken off pencil lead customer service, then yeah it was great.  Person in front of me asked for some lemon for his soda, after the 45 second blankness lifted from his face the cashier managed to compute what was being requested of him... he disappeared for a couple minutes and came back and handed the customer a small paper bag.  The customer sat back down at his table and opens the bag to find one whole uncut lime.  WTF?! Haha... nope, I absolutely have nooooooo reason to come back.  I can't imagine this place staying open very long."}
{"text":"Delicious!!!! My kids are picky eaters but they love the breakfast burritos and carne asada burritos from Papa Chevo's. I often place an order for pickup and drive it to my high schooler for lunch. (I just did that again today!) The food is GREAT, the lady at the register is always very sweet. My family loves it here..!"}
{"text":"Poor packaging. We got menudo by the time we got back home which is just around the corner. It was so hot it melted the Styrofoam cup it was in and spilled every where. Burn on the top of my foot and ruined my Jordan slippers. Mind you this was our first time eating here. Going back is questionable"}
{"text":"This place is ridiculous. I've spent thousands, literally on breakfast food with these people over the last year. As of late the quality of food was poor (Cold food, wrong orders, etc.) and the customer service is horrible. Never offered to make things right. They must be too rich to want my business or they just don't care. Either way it's unacceptable. Take your business elsewhere...."}
{"text":"People that rated them low don't know what mexican food is all about. They should go to mcdonalds or burger king. This place is the bomb! 10 times vetter than Filibertos!"}
{"text":"The food here is bomb just don't go around lunch time during weekdays, not only is it crowded but they rush and end up ruining your food. Also today the lady tried to charge me 15$ for 3 beef tacos and a side of rice which is usually 8.50$ or something. Really good at anytime but not from 11-3 on weekdays."}
{"text":"Disgusting is the only word I can describe this un edible food.  The Guacamole looks like snot.  It was a waste of 25 dollars.  Never again will I step foot into Papa Chevo's."}
{"text":"I've been coming here every week for the past couple months and this place has some of the best mexican food in the area. I was a fan of Filibertos, this place is better in every way. Aleays great food and service."}
{"text":"Hope this place stays in Ahwatukee. It has been open a long time and finally went in to give it a try. We were really happy with our food. So much better than Filabertos."}
{"text":"Cheap prices and good food.  I was able to run in and run out both times I have been to this location.  Only thing lacking is small portion sizes."}
{"text":"The price is fair. Food is good. Service is quick which my tummy appreciates. Had nachos, more than what 2 people could finish...but hit the spot. Had some rice, a little salty,but still pretty good. I'd recommend this place with no hesitation. They have a ton to choose from, so come one come all"}
{"text":"Being born and raised in San Antonio... This is about as good as it gets to being hometown cooking for me. Good prices, great food, excellent service.  Juevos Rancheros for the win!!!  If you're going for Baja Fresh, this ain't it. This is more Tex-Mex style cooking, not Baja style."}
{"text":"DELICIOUS!  The food is delicious, the restaurant is clean and the service is amazing! They get your food made quickly and offer free refills on drinks!"}
{"text":"Had the beef tacos. Nothing fancy but good for the price.  Was busy during lunch but service was quick. Popular place for Perry High students for lunch it seems."}
{"text":"I've always liked their food. It's right by home and easy to grab after a long day. But when you have signage online and on the store that says you are open till 10. Don't put a closed signed on the door to turn away business and make it a hassle to order. Management/owners need to address this because after reading this isn't the first person to write about it. Also it's going to drive away business which is money and that's basically your employees stealing for you. Best of luck."}
{"text":"Loved the hand made tortilla on my burrito, they crisped it very nicely and the salsa was good! I am now going to add this as a frequent place to order  food with nice tables inside and out, and great prices! I had the breakfast burrito and 2 beef tacos and bean and cheese burrito ( with lots of extras) and the bill did not even cap $13.00! Nice staff, and good service..I am happy to find this place and would reccomend it. They only have been open 2 weeks at this location,  and I hope to see them prosper here! Bienvenidos!"}
{"text":"Bacon breakfast burrito is phenomenal!! Staff are friendly, great place!"}
{"text":"Had to wait almost an hour for a burrito and a taco. Food was good but not worth an hour wait."}
{"text":"For the most part, this restaurant serves very tasty food. While some of the food tastes a bit underseasoned, I can definitely say that the food that has been adequately seasoned is rather good. The breakfast burritos, especially the Chorizo Burritos, are to die for, especially if you had a long night and need a good pick-me-up in the morning. Additionally, the Carne Asada Fries are a guilty pleasure of mine and are great for a day of indulgence. When asked if you want extra hot sauce, always say yes and ask for the green salsa. It will add a wonderful flavor to your food."}
{"text":"We went here last Friday night because of the reviews here on Yelp. We received really good food but we should have checked the order before we left the restaurant because we were missing 2 tacos. We didn't go back because we were all too tired to bother. So I recommend the place just check your to go order before you leave. They were very busy when we got there but no one in line behind us so the order should of been right. Service was good so I expect that had we gone back they would have made it right but we didn't go. We will visit again and just check the order before leaving."}
{"text":"Papa Chevo's is the real deal. I went there early in the morning to get some breakfast burritos. Not a lot of places are open early in the morning but Papa Chevo gets out of bed early, and you better believe it. I got two burritos - one with sausage and another with chorizo!  The lady behind the counter asked me if I wanted any sauce, and I said \"I dunno. Ok\" and she gave me two different sauces to try, each one was like a spicy salsa but different flavors - they were pretty good.  The real question is how were the burritos though, not the sauces.  They were pretty good. Not dry, not too messy - pretty freakin' good.  I don't know what Papa Chevo looks like, but I assume he made them by hand - it didn't look like they had the kind of machinery around that they'd need to do it automatically.  So here's the deal: just go and try it out - what are you sitting around for?!"}
{"text":"This is the best Mexican food in Ahwatukee! It is consistently delicious every time. The staff is extremely friendly. We have never felt disappointed after eating here. You get more bang for your buck here. Best breakfast burritos and carne asada!"}
{"text":"These guys are the best. Could eat here everyday almost. Friendly fair prices superb food"}
{"text":"We always go to the chevo's in chandler which is delicious, the one in ahwatukee is different for some reason.  Ordered the chicken rolled tacos today there was a tiny lil piece of chicken in each one, so basically I had 3 rolled deep fried tortillas yuck! :( No flavor what so ever.  Also ordered carne asada taco the meat tasted old like it was cooked earlier and just thrown on the grill to get warm.  Very dissapointed!!"}
{"text":"The carnitas tacos were really tasty!  Open late for that craving you get on the way home.  Hits the spot."}
{"text":"Found this diamond in the rough while working in the area.  I will definitely be returning often.  I recommend the number 7 but swap out the beef burrito and replace it with a \"chevos\" burrito.  Very tasty!  The restaurant is clean and the food is fresh and served hot (temp).  The soda machine dispenses good soda (not flat or too syrupy)  Brush up on your Spanish if you want bonus points with the staff."}
{"text":"I got the nachos with carne asada and they were amazing. Only thing I could change is instead of sprinkling cheese on top it should come melted   Great food!!"}
{"text":"Went there for a bean and cheese burrito... the price was so cheap I thought I would have to order two to get the same as one where I usually go... WRONG!!! I couldn't finish both.. also I pulled a Gordon Ramsey and opened my burrito... beans looked right... and.. course grated cheese!!!!! And lots of it!!!! HUGE AND GOOD!!!!! that was a couple days ago... going back now!!!.. just went there again... Carne asada burrito this time... really good, no bean or rice filler, just meat with some veggies... gotta say.. YUM!!!!! Papa Chevy where have you been all my life!!!!!! I love my Papa!!!!!!!!!"}
{"text":"I have ordered just about everything on the menu at least once and for the most part it is good quality and tastes great. My favorite is the #5 that's 2 shredded beef tacos with rice and beans. Can't go wrong with that! Plus their green hot sauce is the best!!"}
{"text":"Brenda's 1st day on the morning shift at Papa Chevo's was un pocito rough given my rant regarding a cup of ice and some absent sour creme... she took it like a true professional.    Dear Universe sometimes the customer rages emotions in excess that has nothing to do with the girl at the register.  Please forgive me."}
{"text":"By far, the best authentic Mexican food !! The cu customer service beyond amazing lady at the front always the nicest when I go. On top of that the burritos and enchiladas are always consistent not like other places you go to were sometimes has less or more meat. Also I think we've all noticed all Mexican places have change their sauces these guys by far have the best red sauce and green sauce in the valley"}
{"text":"Very good food. Reasonable prices. The place is clean but a sewer smell doesn't help the appearance. Still I would recommend."}
{"text":"Let me start by saying the service is great but the food, not so much. It's very plain and I think filibertos is way better."}
{"text":"Excellent breakfast burritos and not super greasy. My wife found this place and decided to share her \"secret\" with us. Love it"}
{"text":"Just stopped there and had a quick lunch. We ate inside, it's a small place in a strip mall. Really good food, made to order fresh! There was a constant line and people in and out. We had a value meal. 2 tacos, and churros and a drink for $18. It was great!  I would recommend it. The beef tacos were shredded beef. Very fresh."}
{"text":"My favorite Mexican food in Ahwatukee.   The Machaca burritos are the best I've had - and everyone that I've ever shared them with have love them as well!   We've always been happy with their other items too.   Fast (order at the counter) and reasonably priced."}
{"text":"Tried this place the other day and while the food was great, the customer service provided was not great. The girl at the counter gave me and my friend attitude and was not very pleasant to other customers as well. Hopefully this changes, as their food is good."}
{"text":"I'm glad I've found a place in Ahwatukee for breakfast burritos!   Stopped by Papa Chevo's on a Sunday morning to get a potato, egg and cheese breakfast burrito to go. My husband got the same with chorizo added.  These are dense, big, serious burritos. (I mean it. I didn't eat again until dinner.) They were fresh, the potatoes had a nice brown on them and most importantly (in my opinion), there were plenty of containers of smokey, hot red sauce to pour on every bite."}
{"text":"Great breakfast burritos..... Fast service. ....All you want in a Mexican fast food place..."}
{"text":"While the people are very friendly, I believe the quality just keeps going down.  I had a truly awful chicken taco here last week.  And this week, I tried the nachos-well, that was a mistake.  I can't believe they don't even bother melting the cheese for the nachos- they just dump shredded cheese on top.  This place is off my list."}
{"text":"Love the location on Queen Creek Rd & Val Vista thanks for delish chicken tacos and awesome breakfast burritos!!!"}
{"text":"Months later, still awesome. I really need to be coming here more. Never a bad item. A simple quesadilla is AMAZING!"}
{"text":"My boyfriend absolutely loves this place. He gets a breakfast burrito all the time so I figured I'd try it out for \"Taco Tuesday\". I got two chicken tacos with a side of rice and beans. It was just EH for me. Maybe my expectations were too high but I didn't think it was all that."}
{"text":"I tried a burrito here for the first time because I heard from a few co workers they were amazing.  This was hands down the best burrito I have ever consumed.  Good flavor and everything was fresh and hot. I'm hooked thank you."}
{"text":"Fantastic! The carne asada California is hands down the best burrito I've ever had in my entire life. If you like Los Favoritos, it's even better! Everything is fresh and the meat is tender and moist. I love everything I've tried, and intend to try more! Best meal for the price in the area for Mexican food"}
{"text":"I've driven past this shop always curious, so I was excited when I finally remembered to try it. Saturday night at 5:30pm, and no one is here. I walk in and there is no music, and employees come out from hiding. I order a chimi and when I try to be friendly and say \"I've never been here before so I am excited to try this place!\", girl sounded very unamused and said \"you'll PROBABLY like it\". I sat down to wait for my food and listen to the machines running while noticing the decor made no sense.  Disappointed before even trying the food and I can't even bring myself to eat the third bite of the chimi because it tastes flavorless and I rather just wait in line at Los Taquitos and have something I will actually enjoy this Saturday night."}
{"text":"Not bad food.  They make it fresh to order which I like.  I usually order the Mexican nachos, deluxe quesadilla and Chile plate.  But I have tried thier deluxe nachos.  They are good and the toppings are piled on but the cheese isn't melted so the texture is different.   We also order burritos which my husband and son love.  If you are looking for traditional Mexican food...this is NOT the place but again, still a decadent restaurant."}
{"text":"I am a recent transplant from LA and still looking for good authentic Mexican food here in Gilbert. Tried the food here today, and the search continues. One of the best indicators, in my opinion, are the refried beans - here they taste canned and boring. Everything was really just blah. And my Carnitas burrito was loaded with chunks of fat (see photo).  This place is not worth visiting."}
{"text":"Steak tacos had plenty of (what appeared to be cheap quality) meat, but absolutely NO flavor at all. I shouldn't have to dump a bunch of sauce on my food to make it edible! Same thing for the rice. $8.50 for 2 tacos and a small container of rice was overpriced. No thanks, I will not be back. Only reason I'm giving 2 stars is the gal working the counter was nice and helpful."}
{"text":"So yummy! Their breakfast burritos are amazing! I recommend the chorizo or bacon! And they are so quick about it. I always call my order in and by the time I get there it is all ready and LABELED so there is no confusion."}
{"text":"I love this place for quick Mexican food that is a big step up from Taco Bell! I love the breakfast burritos, quesadillas, and tacos! The staff is always friendly and the service is fast! It's great to have this place close to home."}
{"text":"Blech. Hubs and I did not care for this place at all. I would rate Filiberto's higher, and that's sayin a lot. We'll stick to Ramiro's, even though it's farther."}
{"text":"Food quality was pretty good! Love the hours they are open. Clean lobby, and you can see the cooks prepping the food. Our only complaint would be that the food was quite cold."}
{"text":"The burritos were TERRIBLE.  We ordered to-go and had I not already been 5 miles up the road, I would have returned them.  We ordered two \"Californian's\".  It was an extra large tortilla with half a handful (33%) minced up meat, (33%) onion, and (33%) chopped up tomato (not picco, just plain tomato) = 100% nasty.  No flavor, no sauce, no cheese, no guac. Charged $12.01, cash only. Will not be back."}
{"text":"I love this place, I come here all the time. Good prices, and great food. The only downside to this place is the amount of high school kids that will either be in there, being loud and annoying or the groups of kids who will be outside sitting on the outside eating area there. I'm assuming this is because of Mountain Point High School is nearby but that's the only bad thing i've experienced there."}
{"text":"Tried calling in an order 15 mins before closing, the lady hung up on me. I showed up since I was next door at CogBurns and she sees me walking up so she shuts off the lights and locks the door. Then the cooks in the back start laughing and she hid behind the counter and sat on the floor. If you guys close at 2:00 then stay open, or just change your hours:-)"}
{"text":"The best chorizo breakfast burrito I've had in my life. This spot, aka \"Los Favs\", will always be my go-to for affordable quality Mexican food."}
{"text":"This is my late night neighborhood go to for fast food... if you go be sure and get the red or green sauce for you meal and I would recommend the Chorizo and Egg Burrito or the Carne Asada California Burrito... this is the equivalent of street food in other countries. Leave your high expectations at the door and just enjoy the food... !"}
{"text":"The first time I came here these guys were a mess. I'll chalk it up to being new but you could tell the other customers wern't having it.   My order (#2) came out fine. I scarfed it down in store and people watched all the other angry and impatient people in the lobby. It was quite fun.  I went back 3-4 days later and they were much improved!"}
{"text":"Generally better food than you will get at a fast food Mexican place  The carnitas burrito has lately been pretty greasy. I called the last time we had take out but it seems my complaints have fallen on deaf ears  I'll either go somewhere else or just not order this anymore"}
{"text":"Decent food, but poor customer service.  Lady behind the counter is usually quite rude.  Today, they gave us the wrong order and refused to issue a refund.  We used to order a ton of food for our staff four to five times a week, but no longer.  Don't count on their management to do the right thing for even their most frequent customers."}
{"text":"Pretty good food. I would give 5 stars but the salsa is very mild (both red and green).  Great service on our visit.  Large portions and the food tastes very fresh.  Will come back, for sure.  I wish they had some really hot salsa!"}
{"text":"We eat here at least once a week! Quick, delicious, clean, and affordable! The sopes are traditional and my favorite"}
{"text":"I've had the breakfast burrito, taco plate and nachos. I love this place. Nothing bad to say!! Yummy"}
{"text":"Huge burritos. Great price. Open late on weekends. I hope people in tukee take advantage of the late hours! We need places open late here."}
{"text":"First time yesterday, both of us have had severe stomach cramps. Tacos had liquid from the chicken service was slow. Never again"}
{"text":"Went last Monday night, ordered the super nachos. They came out kinda cold I didn't think too much about it, bad idea.  I started feeling sick two hours later and by the next morning I was in bad shape. I got sick several times during the next day.  Obviously this food was not served at a safe temperature.  Needless to say I won't be returning."}
{"text":"Good Mexican fast food with $5.00 for meal like burritos can fill up your stomach, I liked the beef burritos with some green salsa and it taste so good! I highly recommend, if you around this area and liked burritos!"}
{"text":"We live right behind the shopping center...the smells of this restaurant are amazing! We finally stopped in a few days ago and got it to go. Fast service. Good prices. Great food. We will be back!"}
{"text":"Advertised closing time is 10pm, hard to find food this late on a Sunday night. I've no issues ppl closing up shop early, but don't advertise closing time at 10pm if your workers start closing at 9:30. Got turned away and we just moved to the neighborhood. Disappointed,but I understand"}
{"text":"So after a pre-cinco de Mayo celeb last night I needed to tune myself up quickly. At first glance I thought this was like any Filiberto's which are about as super saturated as Subway franchises here in the valley. But I was wrong. Nice mom n pop operators that make a delicious breakfast burrito. I got the chorizo, egg, cheese and potatoes. The flour tortilla tasted fresh and went perfectly with the right ratio of filling inside. The burrito was wrapped tight and right! I also tried the medium shrimp cocktail which I thought was a great value for $7.75 with lots of shrimp. The cocktail water was fresh with cilantro, onion an tomato with little slices of avocado. Make yourself a red beer with a Dos XX and some spicy Bloody Mary mix and you're in business to cure \"la cruda\" which translates into \"the hangover\". Lol. Or H.O. For short . Next time you are craving something good bring it on in here!   Service was friendly and fast!"}
{"text":"I previously gave this place more stars, however lately the tortillas are not cooked at all for the Carne Asada Tacos.  I dont care what time of day I place an order or drop in.  I dont get it.  Maybe I will stay away."}
{"text":"Best chorizo burrito and menudo in town.  I Go There often.  Make sure the soda isn't flat though.  Could use a red chili item on menu."}
{"text":"This was not bad but not that good either. Brad is in constant search for a good taco. This place was not it. I don't know if the menu made me afraid, but it reminded me too much of filaberto's which I do not like.   I have not tried the breakfast burrito, but that's ok because I am pickier on those items anyway.   Service is fast and friendly. Just not what I like."}
{"text":"Good food and the service is very friendly.  The only thing that keeps this from five stars is that I've been to Rito's, Carolina's and Elmers."}
{"text":"I had high hopes going in, but this place was in just about every way awful. The carnitas burrito was bad, and may have poisoned me. The rolled tacos were greasy and flavorless and the guacamole was bland (and may have poisoned me). The tamales were deep fried. What? Yes, deep fried. And yet icy cold inside. It took easily 20 minutes for them to be redone. They must have just thrown the order back to the end of the line. And, again, redone means deep fried. Gross. The salsa bottles leaked all over the place. People at the table behind us asked if the fish on the tacos was grilled, were told, \"Yes,\" but yet it was fried. VERY fried. The woman tried, sadly, to harvest some fish from the batter, but it seemed a lost cause. Another guy wanted his cheese melted, since it was cheap, pre-shredded cheese just thrown on top of everything, but was told, as far as I could tell, that they w/couldn't do it for him. The bathroom was gross, my son reported. They were out of napkins. And, oh, yeah, for going on three days now, my stomach has been in very bad shape. Started that night, so again, if anyone else is suffering for the carnitas or rolled tacos, you are not alone. So, in sum, the service was slow, even if sort of friendly, the place poorly run otherwise, and the food was just terrible. Even writing this, I'm nauseous."}
{"text":"Nice place to stop for a quick bite to eat and it's good Mexican food, not the typical fast food type. I recommend their tacos and burritos, you can never go wrong with those! Now the burritos are serious, they are huge! I can never just eat one at once. They are reasonably priced and worth it!"}
{"text":"Papa Chevo's is definitely the place to go for a tasty breakfast burrito. For about $4, you can choose from chorizo, sausage, bacon, ham, machaca, bean, or steak and egg. My personal favorite is bacon (you get a good chunk of bacon in there, along with potato, egg, and cheese). The quality is great, and definitely feels like a step up from your typical fast food Mexican joint.  The staff usually isn't very friendly, but I usually get my food to go. The restaurant itself has always been clean and spacious while I'm waiting. If you come in with realistic expectations, this is a great spot for quick and cheap Mexican food."}
{"text":"Really great food. We've tried the burritos, rolled tacos, shrimp tacos, and carne asada fries. Every time we go the food tastes great. The prices are really fair and inexpensive. Recommend this place anyone looking for their Mexican food or burrito fix!"}
{"text":"I have lived in Ahwatukee my whole life & finally a good authentic restaurant.  I just discovered it about a month a ago & go at least once on the weekend.  The food is amazing & the people are genuine. Not to mention the prices are unbelievable,  my family of 3 eat there for under $20. So far I've had; a chicken taco, a chicken tostada & a breakfast burrito, they were all full of flavor & the chicken is all white meat.  I definitely recommend Papa Chevos to everyone!"}
{"text":"Bomb.com  Was craving some good Mexican food and I just found a go to spot. I would drive by this place and never made the attempt to try it. Sooooo glad I did! Food was bomb! Bursting with flavor, the rice and beans alone were delicious. If you wanna know how good a Mexican joint is try their rice and beans, that alone will tell you all you need to know about their food. I had the rolled tacos. Can't wait to go back to try out the rest of the menu."}
{"text":"My kids love this place. They're pretty consistent service and quality wise. I think for a semi-fast food joint they are above avg. in service, and overall dining experience.    We've tried most of the menu items and the burritos are a favorite.  The place is clean and well kept, service is polite and pretty fast.  The Gilbert Rd. location rarely has a long line or wait, except maybe weekday lunch hour."}
{"text":"This is a good taco shop and the folks are always friendly!   Delicioso!"}
{"text":"I ordered a ham eggs cheese and Bean breakfast burrito (not sure if it is on the menu or not it's just what I ordered) and it was yummy. If you like breakfast burritos you should try it. I will be back for more."}
{"text":"#18 super yummy! Great place, great food and cashier was super friendly. Beans and rice tasted super authentic! I'm excited I found this taco place, I certainly will be back to try more food from the menu!"}
{"text":"By far the best taco shop in Ahwatukee! The food is great, the staff is awesome. The tacos are big and full of meat, unlike other places! I highly recommend this place to anyone!"}
{"text":"This business has not closed.  A few months ago the name changed to Papa Chevo's, but everything else is exactly the same.  I tried to update it with Yelp HQ a month or so ago, and they said No mas.  Then I uploaded some pics so hopefully it will get corrected.  It is not closed as Kirk R. mentioned in his review update.  I got some tasty enchiladas there this afternoon."}
{"text":"My wife and I stopped in here for lunch with a couple of our children. The establishment was clean. Service was fairly quick. It is just a grade above fast food however. We ate the grilled beef or Carne Asada burritos. They were good but still lacked a WOW factor.  I did not care to much for the shredded chicken tacos. The shrimp taco was good. I would go back again sometime for lunch if I was in the area, but I'm not loading up my car full of kids to go to Papa Chevo's.  I read that the breakfast burritos are good. But in the meantime I give the place 3.5 stars."}
{"text":"This place has some good tacos and they're pretty big. You only need two of them. I like the Carne Asada and the grilled chicken."}
{"text":"Hate to do this, but this place has had issues with the lady cook. The last 3 out of 3 visits our order was wrong. When it happened the 3rd time I told the girl cashier. She apologized.  We haven't been back since. Just got tired of the mistakes."}
{"text":"Well, came back to give this place a chance since their signage boasted delicious breakfast burritos...I ordered the huevos rancheros but after paying for my order I was informed by the cashier that in fact there were no whole eggs in the restaurant. She claimed that they had all been scrambled the night before in preparation for the morning breakfast shift, but they must have forgotten to leave a few whole for that one dish. She offered to have the eggs served scrambled or as an omelet instead. I'm not convinced that the eggs here are not reconstituted egg powder. This is a glorified taco bell, just with a little more extensive menu. Everything was served on Styrofoam plates with plastic utensils, even for dine-in service. I gave 2 stars because the dish was served with a warm salsa verde, which was spicy with fresh onion and cilantro...a great condiment.   My other qualm is that the heavy front door slams, shaking the entire glass wall each time someone walks in. The walls in this place may come crashing down someday in more ways than one."}
{"text":"Great food and service. Steak and egg burritos are awesome! Menudo OK. #4 chile relleno and enchilada plate is my favorite."}
{"text":"Third time here in 3 days, it's that good! Reminds me of the classic taco shots back in San Diego. Great food, clean place and nice workers. Fantastic view into the kitchen. I love Mexican food and this is my new spot for it!"}
{"text":"Great breakfast burritos! Love the chorizo breakfast burrito and their fresh salsa bar if great. Quick friendly service as well!"}
{"text":"Just had the rolled tacos with guacamole, cheese and salsa. Crunchy tacos. The guacamole was very good. For a small shop I was impressed. Thanks for reading. The Bike Chaplain"}
{"text":"This is the worst place ever! I ordered a chile relleno burrito, and what did I get? A rice and onion burrito! It was completely gross! Never coming back!!!!"}
{"text":"Breakfast burrito with ham. Best in state!! Btw the hours listed are wrong. They are open after 12:00"}
{"text":"Good hours and great service. This is honestly the best taco shop I've been to. I had the carne esada burrito and it was amazing. The prices aren't bad either."}
{"text":"I am scratching my head as to why this place got 3 1/2 stars...  Decided to stop for lunch on my way home from riding.  Love love love their fish tacos!  First time here and won't be my last!"}
{"text":"Awesome burros. They have great daily specials and you have to try the green sauce.  Amazing breakfast burritos. Try it tonight."}
{"text":"Need a quick bite without sacrificing the quality of the food? This Is your place. Good service and great food! What else can you possibly want?   Oh, and the hours here are perfect for when you're wanting that late night snack."}
{"text":"I love this place I only get one thing , I am sure everything else is as good but I just come for the potatoes egg bean and cheese burrito. My 6 year old loves them.. every Saturday morning this is the place for us"}
{"text":"Not as good as they used to be. Taco shell was stale, rolled tacos cold, not cooked thru! Used to be great! Not sure what's up with this location. Will go back to Los Favoritos for my taco fix"}
{"text":"Sort of middle-of-the-road taqueria food, but with better than average ambiance. Polite staff. I was neither let down nor overly impressed. I could see myself returning, although maybe not in a hurry."}
{"text":"A nothing special taco shop... The rice and beans have no flavor...the tortillas are thick and not the best! I always stay with the breakfast burritos! Just ok.."}
{"text":"Finally ahwatukee needed a place like this! The food is excellent  and  the prices are super"}
{"text":"It's better than any of the \"berto's\" around town.  They have a good mix of food and some tasty hot sauce."}
{"text":"When I arrived there was nobody at the counter. I heard noises coming from the back but couldn't see anybody. It took about 8 minutes of waiting until somebody came out. The girl didn't even apologize for the wait. She seemed very unhappy to be inconvenienced to have a customer. Food was good but service was terrible."}
{"text":"Good food. Fast service. More like a fast food type of place. We got to eat Mexican food at Cinco de Mayo w/o too much trouble :)"}
{"text":"This place is my guilty pleasure! #5 combo with deep fried crunchy beef tacos and sides for $6.75. I love it!! You can go healthy with a grilled chicken torta if you need to.   Good burritos & salsa as well.   This family owned and operated business is worth the trip if your looking for authentic Mexican food."}
{"text":"Today was obviously not a good day to order for pick up from here. We go here frequently because it's close and my son loves their carne asada fries, but Catalina was extremely rude on the phone today. Had to call back to get when the order will be ready and an order number because after the last order, she asked \"anything else\" and I said \"nope that'll be it\" and was hung up on. She was super annoyed when I called back and you could tell. Probably going to the other location from now on."}
{"text":"Incredible tacos and burritos, we love the carne asada tacos. Quick service, too!"}
{"text":"Food here is very good customer service is great and fast i recommend eating here.if you don't feel like cooking just stop by this place.prices are great I recommend the carniasada its very tasty."}
{"text":"Place used to be absolute money, but they've mad some changes which have negatively impacted the place. My sacred California carne asada isn't too sacred anymore. Used to be the late night hangout for me and my buddies, but the burritos are a lot smaller than they used to be, the prices have gone up, and the owners are pricks. Would go out of my way to eat at the Los favoritos, same restaurant with a different name, on Gilbert or the one on power 10/10 times"}
{"text":"I eat take-out a few times a month here. Always dependable! I wouldn't say it's the best but it's a quick fix for fast Mexican food. Everything is always loaded with flavor"}
{"text":"Terrible.  Unfriendly, dirty, taco salad was all taco chips.  We sat outside and the tables hadn't been washed in days.  A girl brought the trash outside and dropped it on the patio beside us, went to go back in for another bag, which had a hole in it and was dripping I don't know what all over the place.  She then took them to the dumpster.  We will NEVER go back here.  Yuck."}
{"text":"I've given this place a try a handful of times and I can honestly say I am not a fan of their breakfast burritos unfortunately. The most recent time I've tried their food, I ordered the sausage and egg burrito with potatoes and cheese and did not enjoy it it all. The sausage looked like grey crumbles and lacked any real flavor, and the potatoes that were added where not even hot and seemed like they were precooked and sat for a while. Overall there food has been a disappointment to me. Wish there were more Mexican restaurants in Ahwatukee :/"}
{"text":"I liked the food (had a carne asada burrito). Good menu selection. Staff was fairly friendly. Restaurant was clean. Not a ton of seating. Overall, good experience and I'd go back."}
{"text":"I've been eating here for over 5-6 years now. I would compare this place to like filibertos or amados in terms of menu offering only difference is these guys do it much better in terms of quality of the food. Fresh tortilla the meats are seasoned perfectly and the HOT sauce is actually HOT not like the other places I mention where you can tell those sauces are watered down and taste like nothing.   Only reason why I gave it a 4 star is the size of the burrito is about half the size of the other place I mention. So if your looking to get full off of one burrito this isn't the place but if your looking for great quality taste and freshness then come here! Just order an extra burrito totally worth it!   If I was given the ultimatum to pick one of the other fast food Mexican I would definitely choose Papa Chevos aka Los Favoritos!"}
{"text":"Last time I went in if you paid by card it was a square and set up if anything less then a 20% tip it made you jump through a ton of hoops. This time I got 1 burrito and had cash so I tipped 75 cents for him to hand me the burrito. The guy behind the counter literally pointed at the napkins behind him and said if you want some they are there. I think the square has made them spoiled. The burro was fine, comparable to most fast food Mexican. The service not so pleasant is the main reason for 2 stars."}
{"text":"Irritating. I called in an order for my brother. The women on the phone could barely speak English and just tried to get me off the phone as fast as possible. Didn't take my name down. As soon as I said \"carne asada burrito\" she hung up the phone. We arrive 15 minutes later and the lady at the register says the only call they had was for a bacon breakfast burrito... what's the point of having the option of calling in a to go order if you're not even going to do it properly? There are plenty of other burrito places in the area that don't have unpleasant service like this. Won't be returning. I'll go to the actual Los Favoritos, Burrito Shack or Diamond Dot."}
{"text":"Food is way better than filibertos. Only reason why I'm giving three stars. They're carne asada fries and their breakfast burritos are excellent! However, the service is always poor. They have a tip jar out and if you pay with card it asks if you want to leave a tip.. which is fine, but almost comical since the cashiers are never friendly. I don't have a problem tipping but I absolutely will not tip if I'm not as least acknowledged or greeted with a smile."}
{"text":"Love Los Favoritos? Then you will love Papa Chevos. I usually get the Pollo Asado Burrito or Bean & Cheese Burrito which are my two favorites. My husband likes the Chorizo Breakfast Burrito. We probably eat here about once a week because it's right across the street and so tasty. If you get it to-go they usually skimp on the hot sauce, but now I just ask for the number of hot sauce containers we want and it's no problem."}
{"text":"Quick, easy, and extremely friendly staff. The portion size for the price is great. I would recommend to many for a fast casual or take out restaurant."}
{"text":"Otherwise known as Los Favoritos! They are still owned by the same people and the menu hasn't changed. We go here pretty often because they have yummy food at a good price. My personal favorite are the tacos with green sauce. The cashier is always friendly and happy to help. The interior is clean with traditional Mexican decorations. It is located in the Albertson's parking lot. I would definitely recommend this place if you're looking for quick, cheap Mexican food!"}
{"text":"By the looks of the counter person, she'd rather spit in your food than serve it!  Ugh, dirty, unfriendly and no smells of good food!  I will never return, not even to a Cali location!  I messaged restaurant about our miserable treatment, apparently they don't respond!  Fillbertos all day, every day over this place!!!"}
{"text":"Everything I've had so far has been great. Not sure about the other reviews, but I was pleased with the food and the price as well.   Maybe people had too high of hopes or expected Abuelo's or something. But I have been consistently going back here to eat.   Way better than Filbertos and less greasy. It doesn't leave that gross feeling in your stomach like other places do"}
{"text":"Just another boring not so cheap Mexican style food joint. Average food at best, slow service and higher priced then it should be. Won't be going back."}
{"text":"Papa Chevo's was a quick stop from an outing night for me.  Though I was still coherent so no excuses on my part.  Place was dead, but being the night was still young I'm sure this place can get overwhelmed.  I ordered the beef Sopes with rice and beans.  Overall, nothing to special in my Mexican food repertoire.  I thought it was pretty simplistic and what I would expect; Fried corn tortilla, topped with refried beans, lettuce, tomatoes, sour cream, and cheddar cheese.    In the end, I thought it was nothing out of the box, but something I can ingest if I was really hungry. - Enjoy!"}
{"text":"Solid... A little expensive but a great taco shop.  Carne asada tacos rock!  My kids get the quesadillas and they are huge and filled with a good amount of shredded chicken."}
{"text":"This is basically a Los Fav's which means you can get those amazing breakfast burritos! Tastes exactly the same - great service!"}
{"text":"Any place that has LEGIT carne asada fries and a California burrito on their menu gets a 5 from me."}
{"text":"I've been coming to this place since back in high school and have rarely had a bad experience up until now of course. I called in 20 minutes before close in an attempt to order my food while I waited at the bar not even 50 feet away from this joint. I asked for a carne asada burrito and tried explaining my situation half way through I was hung up on. So I then decided to walk my happy butt 50 feet to their front door on my walk over there they shut off the lights and switched their sign to closed keep in mind this was over 10 minutes to their actual closing time. The cook in the back threw his arms up in an attempt to turn me away... I can say with confidence I will never be returning to this joint ever again. I have respect and tried to work with them sincerely but clearly they didn't want my service and therefore they will never have it again."}
{"text":"Tried today for the first time. The dining area was really clean, and spacious. The staff was friendly. Amazing view, great food. If you go, try the California Carne Asada"}
{"text":"Who in their right mind would ever give this place more than 1 or 2 stars?  I've lived in AZ for 30+ years and have experienced all types of Mexican food, but this was hands down the worst.  I needed a quick bite for dinner and happened to be driving by when I saw Papa Chevo's.    The chicken taquitos where flavorless, cold in the middle, and slobbered with runny guacamole.  The shredded beef tacos smelled like piss and tasted even worse.  The chips were stale and the salsa was bad. The only thing worth eating was the rice.  My wife and I both ended up sick to our stomachs, but lucky for her I was the only one who actually vomited.  Because of this, I will be filing a complaint with the county Environmental Health division.  But seriously, what is wrong with some of the people reviewing this place claiming \"Papa chevos is my favorite Mexican\"?  Are you kidding me?  Are these reviews real?  I know this is fast food, but it's the bottom of the bottom tier in my opinion.  Please, go try some real Mexican food instead of this deep fried garbage."}
{"text":"This place is just some good ole home style comfort food. The chile relleno is solid and so are the enchiladas, burritos and quesadillas. Haven't tried the tacos or taquitos yet but I can't imagine they'd be anything less than \"hit the spot\" delicious. I also really love their horchata. Most places are either too over poweringly (not sure if that's a word) sweet or are too grainy. Always satisfied with their food."}
{"text":"More expensive Filibertos. Was not happy with their lunch. Then its served on styro plates. Awful!!!!"}
{"text":"I am eating this food simply because I need to eat before I take my medication. It's awful and I'm stuffing it down because I have to not because I want to period I should have just went to Papa John's next door. Very disappointed"}
{"text":"Papa Chevo's Taco Shop is my go to Mexican food joint anytime I'm in this area of Chandler. If you haven't been here before you should try their burritos! The bacon breakfast burrito and the enchilada style bean and cheese burrito are my personal favorites."}
{"text":"I actually enjoy the food from Papa Chevos in Ahwatukee a few times a month. The restaurant is clean and the staff is great!   Their hot salsa is pretty good and their breakfast burros never disappoint.  My standard dish is the Shrimp Diablo.  It isn't really that spicy, but the flavor is good.  I usually add the hot salsa to it to improve the heat.  The sopes with carne asada are another favorite that I would recommend.  The reason for the missing star is their shredded beef.  I am a huge fan of shredded beef tacos, but find these a bit bland. I know it isn't difficult to \"just add salt\", but these are fried, making it a bit harder."}
{"text":"So good! I've been looking for a great burrito place since I just moved to Chandler. This place is so good. I highly recommend the Chevo Burrito and the Chili Relleno."}
{"text":"Their food is pretty good! The Chile Rellenos are my fav. Hubby likes the enchiladas. Tacos and taquitos are just ok in my opinion but great re-fried beans and decent rice. Overall we're happy... we keep going back!"}
{"text":"A bean burrito can be the true measure of a Mexican restaurant. A simple concoction, yes - but an establishment that takes the time to make really great tasting beans and wrap them in a great tortilla - is my kind of place. Los Favoritos makes a stellar bean burrito, as well as an outstanding Carne Asada burrito. Others I've gone with have liked their food very much as well, but I haven't been able to get past those burritos. Great green and red salsa in squeeze bottles. Definitely a go-to place for fast (but good) food."}
{"text":"Menu was basic, service was something to be desired, temperature for an eating establishment was too hot, women's bathroom door did not close due to an improper fit. Food had no layers of flavors what so ever. No kids menu available. Will never return -"}
{"text":"I love breakfast burritos and Papa Chevos knows how to make them. The chorizo breakfast burrito with no cheese and extra potatoes has been my go to for the last couple of months and I can not get enough! Don't forget to try their green salsa, it is the perfect sauce to go with any of their breakfast burritos. Haven't had a lot of other things from here but their Chimichangas are good as well. Only thing is they need to either increase the amount of guacamole they give as a side or decrease the price. Will obviously be back very soon!"}
{"text":"I'm Mexican therefore I know when food is good because of my Mexican taste buds, duh!!?  This place is decent not Bomb just ok good decent. I get the breakfast burritos but always get a tummy ache after maybe because of the salsa which is not that good... is hit up chipotle instead... unless you want to have a breakfast giant burrito for $6"}
{"text":"They can change the name no matter what, but it will always be Los Favoritos in my heart. To me, Los is a sanctuary--a place where I can go no matter how crappy my day is and just lament over how terrible Chandler, Arizona is. The food is comforting in the same way being embraced by a grizzly bear is--sure, you might end up with a few scratches and near fatal injuries, but a hug is a hug and im lonely.   The carne asada fries are a standout--Ive travelled the world far and wide looking for CAF with the perfect balance of guac, sour cream, pico, and meat--and los is the only one that meets that requirement. The best I've ever had."}
{"text":"Wife and I stopped in for a quick pick me up. The food was pretty good! The carne asada had really good flavor the guac was tasty and its a good place on a budget. Enjoyable atmosphere over all a good place to visit."}
{"text":"The employees/personalities leave much to be desired, but this food is great.   Reminds me a little of El Norteno in Downtown Phoenix...  A good, quick hole in the wall in a random dead shopping center. Been here a few times and always good!"}
{"text":"Always so good and nice and friendly staff... i recommend the carne asada fries and quedadilla!"}
{"text":"Food = horrible.  Staff = clueless.  Won't be back, ever.  Wanted 2 machaca chimis and 3 machaca hard tacos with cheese and lettuce only.  My wife and daughter went in to grab dinner for us.  Gal up front says carne asada is their shredded beef and also tells my wife that adding meat to a chimi is am additional 2.50 charge.  So what would you put in a chimi if I didn't want to pay 2.50 extra? 40 dollars later I have 2 carne asada chimis with beans and 3 carne asada street tacos covered in pico only.  The food was terrible, salty, beans tasted old and meat tasted off.  No value for my money, and obviously staff that has no idea what they are actually selling."}
{"text":"The quest for mind-blowing Mexican Food in Tukee continues. The NPC (new place choice) for this next adventure? Papa Chevo's Taco Shop. With my health and mana low from a previous night out slaying bosses Jim Bean and Sam Adams, I decided this place and its chorizo and egg burrito would suffice to replenish my resources. The consumable and Horchata potion helped revive me, but honestly it was just average. Unfortunately the burrito did not have enough chorizo and was filled with nasty dwarf bag cheese. The princess in crime decided to have the Carne Asada fries which were tasty but once again, average. What is the saving grace of this place? One does not have to spend all their rupees and credits trying to get full here."}
{"text":"A review's probably due for this place. I like Papa Chevo's. Granted, it's one item I usually get, and it's consistent. Plain old potato, egg, & cheese breakfast burrito. But it's consistent--that's the key. I've gotten to the point now, when I walk in, if the right cashier is there--all I have to do is hand her my card for my to-go order on the way into work. 5 mins. later I'm out the door, burrito in hand. She's plenty friendly, so not sure what all the other folks are talking about. Also, it's a small Mexican food restaurant, if you're expecting full silverware and plates, please go elsewhere. Oh, and the red salsa is fantastic!  These guys are #2 on my list for breakfast burritos here in the East Valley. Love em'!"}
{"text":"I checked this place out specifically for the breakfast burritos and I must say I was not disappointed.  I went with one sausage and one bacon and I AM FULL!  The price was right, the food was good, the service was quick and efficient.  I will definitely check this place out again when I am craving a quick Mexican breakfast."}
{"text":"Better then most cheap Mexican food in the area , wayyyyyy better then burrito express , that place sucks"}
{"text":"Todsy I decided to eat at this place it was late and not many places were open. I knew Papa Chevo stayed open til midnight. Sok I thought because their sign said open til midnight! When I got there about 11:40 or 11:45 they say they're  Open till midnight and they closed early.  Thinking I was wrong about the time I knocked on the door and waved the people in there a very tall Hispanic girl and 2 other shorter Hispanic people 1 male 1 female  They looked in my direction and turned around and went to the back I knocked again harder and they ignored me and did not come out. I decided to give them a phone call and she said they decide to closed early because business was slow and they were ready to leave and we're not going to open. That is not customer service and that's laziness. I understand it's slow but clean up and still be able to serve your customers until the time that you say you're going to stay open otherwise say your close at 1130pm!!! It's just respect for your customers. What shitty service."}
{"text":"The meat for the tacos was seasoned well. We ordered carne asada and adobada tacos. It was also a plus that they offer a flour tortilla option. They have fresh salsa and aguas frescas as well. The portions were also good."}
{"text":"Best Mexican place in the east valley! Open almost all day and the staff is friendly and helpful not to mention they got an A for their inspection report always a plus."}
{"text":"1st time here but definitely not the last.   We had the rolled tacos and a hard shell taco.   Fresh, reasonably priced food that both my 8YO and I enjoyed.  I hope the location doesn't keep this joint from thriving.    Next visit: breakfast burritos!!!!"}
{"text":"These are really some excellent tamales I definitely will be back. I have a definite flavor Rush going on right now."}
{"text":"I usually come here on Fridays. They have a good Veggie Burrito. Rice and Guacamole are just right. I want to try their breakfast burritos one day. Will let my Yelp family know how it is when I try it.  Prices are good for the portions.  Under $5 for the Veggie Burrito."}
{"text":"The food is great and quick BUT I asked for extra lettuce on my tacos and they tried to charge me extra! Seriously?! I can see if it's an add on but it's lettuce for crying out loud."}
{"text":"I use to really like this place. But lately they need to step it up a little in there customer service. The window states they are opened until 10pm. I came in at 8:45pm and all their chairs have been put up and it smelled like Clorox. I walked in and the guy rolled his eyes.  He walked over and slammed his towel down and said what do you want. I told him I didn't want to inconvenience him and walked out.  Bummer!!"}
{"text":"This place was really lousy and I'm frankly shocked at the high reviews it receives here on Yelp.  The only reason I tried it was the solid average rating it has.  That was a mistake.  As this was my first time eating here I decided to order numerous items and sample as many items as my stomach would allow for one meal.  I started with the rolled tacos and they weren't too bad.  Not overly crispy and a good amount of cheese and guac accompanied them.  Not great but not bad.    Next I tried the fish taco.  This was awful.  The sauce was slimy, the fish has no crispiness, and the tortilla was lousy.  Other than that, it was good.  I then moved on to the carnitas taco.  Again, the tortilla was lousy.  Think cheapest store bought corn tortilla you can find and nuke it for 10 seconds.  At this point my wife and I started the following conversation:  Her: \"I'd rather have Los Taquitos.\" Me: \"Or Espo's.\" Her: \"Or Filiberto's.\" Me: \"Or even Rubio's....\"  This went on for about 3-4 minutes.   Lastly we tried the Chili Verde burrito.  It was no better than anything prior.  The meat wasn't good and the sauce was funky.  This is not good food.  I don't care how you slice it.   Maybe the breakfast burritos are good but I'll never know.  There are too many other good Mexican restaurants in town where I know I'll be enjoying my meal."}
{"text":"Great customer service, food was made fast & was delicious. It's like a nicer filibertos. Try the bacon breakfast burrito it's delicious!"}
{"text":"Great service, great prices, and awesome food. I had their breakfast sausage burrito and it was delicious! Will definitely be coming back."}
{"text":"The quality of the food has gone way down. Today was my last time for Los favoritos or papa chevos.  I ordered a pollo asado quesadilla and received it with cheese on half and barely any cheese at that and a soggy mess on the parchment paper. Needless to say even after bringing it to there attention I just got a shoulder shrug. Well I ate it till I started eating paper and just left very unhappy.  Customer since 2001......done and gone, sorry guys but I won't be back."}
{"text":"Awesome food, great customer service, and a nice clean restaurant. They remember my order as I'm a regular there.. I think that's awesome and reminiscent of an old ma n pa shop."}
{"text":"Can't describe how bad this place is...was hoping for some good Mexican to replace Baja Fresh location and all we got were cheap ingredients in bland tasting Mexican slop. The guac is from frozen, cheese is cheapest shredded stuff you can get, oily food, hardly any spices. Taco Bell is better than this place and much cheaper...won't be returning."}
{"text":"I got simple chicken tacos with guac... uh delcious.. pretty cheap also.. 3 tacos for 7 bucks or something? ehh i coulda been more full after but no biggie. Ill be back since they are right around the corner. yummm"}
{"text":"Disgusting. The carne Assad's is like tiny chunks of super greasy dripping mystery meat. You cannot even pick up the tacos because they are so greasy. Sorry, but these are the worst tacos in Chandler."}
{"text":"Since moving from San Diego I'm always on the look out for a good family owned Mexican restaurant. This place fits the bill. I had the breakfast chorizo burrito. Nice size and delicious. Since I live and work close by so I'll definitely be back to try the combination platters."}
{"text":"The food was decent and so was the service. I ordered a breakfast burrito - some bacon but mostly potatoes.  Of course you can't expect too much. It's fast food!!  Cheap Quick Bite = thumbs up"}
{"text":"Got my order to go and when I got home and opened my bag it smelled like cleaning spray or soap. Not sure what happened, but my tacos tasted like chemical cleaner and I couldn't eat them. I'm done with this place."}
{"text":"Have only been there once but it was yummy! Carne asada was great. Big portions too! Will definitely be going back!"}
{"text":"Love it here, food is great and the people are awesome. I've never gotten bad food from here, so glad I work close by so I can visit often!"}
{"text":"Same staff and food as when it was Los Favs.    This place is ok when your craving a quick fix or after a night drinking.  My biggest complaint is the food seems to always have to much salt.  Lately I'll only order a sausage breakfast burrito as the bacon burrito is like eating salt rocks.   Staff is always super friendly and the place is clean. Although if you come during cleaning I suggest take out as the bleach smell can be overwhelming."}
{"text":"Worst food ever. Cheese in enchiladas wasn't even melted. Took back. Given again barely warm. The enchilada sauce was like water. My sons cheeseburger and fries were nasty. I have tried this place 2x because it's walking distance never again. It is horrible  food and the service isn't good either."}
{"text":"The best breakfast burrito I've ever had. Ever. Place is clean, almost to a fault as it tends to smell like good Mexican food and cleaners... The food is a passion for the owner I'm sure. Always hot, fresh and uniformly prepared."}
{"text":"I LOVE Mexican food, and am a true Mexican food snob.  Chevos only gets 4/5, due to inconsistency.  I have tried the carne asada fries.  Dayuum.  That's a LOT of food. Very tasty.  Bean and Cheese burritos are awesome, too. You would be surprised. You would think places like Filibertos would know how to make one. But the beans in their burritos have no flavor. Chevos are seasoned nicely.  I am all about chips and salsa. First trip, I ate in. The chips were very light, super crispy, and tasted like they just came out of the oil.  PERFECT!.  Every trip since then, the chips have been a HUGE let down. taste like typical imitation \"in house\" chips.  Overall, a very very good substitute for Filibertos ( which is over rated...and the one in awahtukee is horrible)  Edit- Had the carne asada fries again.  Holy smokes. Also tried the carnitas burrito. EXCELLENT!!  It was actual carnitas..not just a dry pork chop cut up into cubes ( Filibertos down the street)  Edit #2 - I have updated to 5 stars! So yesterday, I ordered the Carne Asada fries..AGAIN..except this time I asked to have Carnitas on it instead.  YUMMM!!!!! Papa's Carnitas are soooo good~!!!  I have also since tried the ground beef burrito. Also DELISH!!!!"}
{"text":"First time. .would come back for sure! I'm very picky about my Mexican food..it was delicious! !"}
{"text":"Portion size is pretty big! I can only eat half of the breakfast burrito I order, their bacon and steak & cheese is great. Staff are always nice. Continue to go back."}
{"text":"Papa Chevo's is my favorite quick take out Mexican food. Always friendly & food is fresh & great!"}
{"text":"The best bacon breakfast burritos ever! This was my favorite place back in high school:)"}
{"text":"Will not be eating here! They have a D rating from the Maricopa County health inspector, yikes!   https://envapp.maricopa.gov/EnvironmentalHealth/FoodSearchInspection?p=FD-36529&i=0"}
{"text":"Perfect lil spot for some yummy burritos! So far I have tried the bean and cheese burrito, sausage breakfast burrito, and carne asada California burrito. All were delicious! The restaurant is clean and pretty big compared to most burrito shops. The employees are nice and friendly. Salsa is good and spicy. Prices are affordable. Plus they are open pretty late which is hard to find in ahwatukee! I'm so happy to have this place close to home."}
{"text":"We had the sausage breakfast burrito and chips and salsa. It was just ok. Not bad but not outstanding like some of the yelp reviews I read. Tortillas definitely didn't taste homemade to me neither did the chips. Pico de gallo was good and I liked the taco sauces they had to put on the burritos."}
{"text":"PAPA - PLEASE WORK ON THE FOOD PREPARATION  AND PORTIONS FOR TO GO ORDERS.    It's 8:30 at night and I haven't eaten.  I was excited to try out a new place.  It's open and bright with windows around.  You can see the food being prepared.  I usually order rolled tacos when I visit an eatery like this for the first time.  I figure it would be very hard to mess such a simple thing up.  After all its just meat, rolled in corn tortilla and deep fried until crisp.  Well, it was a bit of a disappointment as only the ends of my tacos were crisp, the insides soft and soggy.  This made me worry that it wasn't cooked thoroughly.    My receipt was pushing close to 8 dollars for 6 rolled tacos, rice, and beans and guac.  I rate the portions of the side dishes - STINGY - not enough for the price tag.   I rate the Rolled Tacos D -   Soggy middles - yuck.  I rate the guacamole A+  - It's the real deal, not the watered down stuff.  Very good.   I rate the beans A+ - flavorful and wonderful. I rate the rice   C-  as mine was on the undercooked side, slightly crunchy, yuck though it seemed to have a good flavor.  I rate the Salsa - B - it was average, expected salsa for this type of venue  I rate the restaurant ambiance A+ I rate the service A+  I rate the cooks - well, they leave more to be expected.  Please work on it Papa Chevos, you have time because I won't be back anytime soon.  Maybe I will try again after some more weeks pass."}
{"text":"Very clean and fast service. Food is good for something quick. Music was really loud the day we were in. Everyone was having a hard time hearing their order number when it was ready."}
{"text":"I really love the breakfast burritos here. The bacon and the chorizo are my favorites. They use a thick cut bacon that has lots of flavor so that's a big plus for me! Service is pretty good but The burritos are great! Big, well staffed and lots of flavor!  Very good red sauce too."}
{"text":"Tried this due to its reviews. Located in an unassuming strip mall. Not much effort went into the interior yet the food is not bad. I had fish tacos. The breeding was crisp and the tacos not saturated in sauce. Not a bad place if you want to avoid the chains."}
{"text":"This is the best food ever.  I love the three rolled tacos with the best refried beans you ever had and rice is delish!  My husband loves the bean burrito and fish tacos.  We can't stay away."}
{"text":"My go-to spot when I'm drunk and/or it's late. The chicken tacos never miss a beat and the carne asada burritos are to die for. Did I mention their breakfast burritos are huge too! The lady who works the cab register might come off as rude by she a sweetie at heart. If only it were open 24/7 like Filiberto's"}
{"text":"Please do not listen to @angela C. If you think the food or menu or anything has changed, you may not be very advanced mentally. This place is the spot if you want a good burrito!"}
{"text":"Papa Chevo's (aka Los Favs) is probably as consistent as it can get with delicious Mexican, taco shop-style, food. Everything is tasty and prepared with quality ingredients. This has been my go-to spot (multiple locations) for years."}
{"text":"Decent but not great. They could improve their enchilada sauce as it taste more generic than authentic. The breakfast burritos are great. Try the chorizo breakfast burrito and add beans and cheese if you haven't had it. Good stuff."}
{"text":"This is my go-to breakfast burrito place.   Started going here since I live walking distance to it, but love their burritos? so keep going back.   Its nothing fancy, and a small little taco? shop, but the burritos have always been large and good.    They have other food too, but never tried it, just come for my chorizo burrito.   One Tip, if you are ordering more then one or two may want to call ahead.  It can get busy in the AM, especially? on a Saturday morning if the local football team beats you there.   They also take Appl Pay, so that's? awesome."}
{"text":"I love \"mom and pop\" businesses.  I love authentic Mexican food.  I don't love Papa Chevo's....I don't even like it.  From the lethargic person who took my order but did not know what some of the menu items were to the cook who kept yelling at an older employee while I waited for my order to the non-existent decor.....well, you get the picture.  And, I haven't even gotten to the food yet which was basically tasteless.  Maybe I hit it on a bad night?"}
{"text":"Great Carne, yummy chicken burritos. Great local place instead of Taco bell.. I miss Los Taquitos's carnitas in Ahwatukee, here it's too crispy."}
{"text":"Pretty sure we got food poisoning from here two days ago! Definitely not going again. It was the only thing both my husband and I are similar that day and we were both very sick the following day."}
{"text":"The carne asada fries and tacos are very good. It's a bit pricey but the food is good."}
{"text":"I love Los, but I can't bring myself to come to this location anymore. Their soda machine has been broken/half working for well over a month now. It just sprays out syrup or comes out like a water fountain completely flat. When I tell them about the issue someone goes and \"fixes it\" only to find nothing has changed. How they charge me for a drink when their machine is clearly broken... I do not know."}
{"text":"Papa Chevo's is a \"fast food\" style Mexican food restaurant. They have an extensive menu.  I like their bean and cheese burritos. They also have some really good nachos.  The cheese enchiladas are tasty, but never seem to be hot (temperature) enough.  They are open late. If you're looking for a quick Mexican food other than the usual, give them a try."}
{"text":"This is our go-to place for breakfast when no one wants to prepare anything. I've never had any complaints except for the one time they poured cheese sauce on my nachos instead of shredded cheese; and today because my burrito was smaller than usual and there were pieces of dried beans in it. I should have stuck to my weekend fave--menudo, it is delicious! I took a star away for the dry beans."}
{"text":"Not good. I don't get the hype of this place. Small and dry burritos.  Try Senor Taco or Elmers all within a short distance and much much better"}
{"text":"Food is comparable to filibertos, just decent. Why I stopped frequenting here is the girl behind the counter. Always rude. This place is literally across the street but I won't deal with consistent poor service, especially if the product is only mediocre.   So I made the mistake of going back because it is very close to my house. Was out with some friends having a few beers and skipped dinner. Dropped in for some $9 super nachos. I've been hitting the diet really well and was looking forward to my cheat meal. The nachos were super small, had like 10 chips, very little meat, and smelled funny. For $9 I expect to be full, not even close. This truly was my last time here."}
{"text":"Do not waste your hard earned money here, we even called ahead to make sure they made their own taco shells and they lied to us. So disappointed. Not coming back again."}
{"text":"I have gone here quiet a few times now. The employees are great. Super nice and fast! The food is A M A Z I N G! I love this taco shop. What a wonderful addition to Ahwatukee."}
{"text":"Pretty much the same as when it was Los Favs.  The night I went in though they had been cleaning, and the whole place smelled like bleach.  Really not very appetizing.  The beef taco was just how I like it, and the bean burrito was good as well.  I was getting take out, so I'm glad I didn't have to stay and smell the crazy amount of bleach in the air!"}
{"text":"Okay for fast tacos.  Pretty greasy shells and they seemed a bit stale.  Not as much cheese or meat as I would have liked.  I think I will skip it in the future."}
{"text":"The very nice lady that is always working is the reason I come back to this place. We always come in super late but she always has a smile on her face from when we walk in that door to when we walk out. Plus the food helps"}
{"text":"This place is bomb!  I love their bean and rice burrito (I get rice and sour cream put in mine).  Their chili relleno is so good!  the beef tacos!  I look forward to trying their breakfast burrito soon!  The girl that takes your order is always smiling and very welcoming!  Good spot for sure!"}
{"text":"This place used to be Los Favoritos and at that time it was awesome. The customer service was also fantastic, they were fast and accurate.  I came in last weekend to order about 20 entres and it was ridiculous how much I had to argue to get sauce.  Even after we determined that they typically give 3 per entree the front lady and guy in the back refused to give me that amount. She was being so slow too... our food came out and got cold by the time the older guy agreed to be reasonable.  They even shorted us on the sides of Pico de Gallo I ordered and paid extra money for.  Seriously displeased. To add extra fuel to our displeasure that night, one of our bean & cheese burritos had chunks of meat in the middle; for the vegetarian family member who was eating that, it was a barf-worthy experience.  We have had numerous issues with them getting our order wrong but we kept going back.. thinking it will get better. The food has been fun to eat on a weekend night when we have the family over. But the customer service needs a serious upgrade."}
{"text":"I really like that a restaurant like this is finally in the Ahwatukee area.  I ordered the carne asada torta and the #15 chimichanga meal.  Both were a great choice.  The side of rice and beans were mediocre for Mexican food.  But overall, I would definitely recommend this place if you are looking for good flavor and is easy on your budget.  The kitchen and dining areas also looked very clean."}
{"text":"Ordered nachos. Pretty good. Good place to go to if you live near by. Still prefer another place over this one for nachos. The salsas there aren't spicy at all."}
{"text":"Service was mediocre and the food was nothing to be excited about. Would not recommend the fish or shrimp tacos. Rice and beans were the best part of the meal.   Don't waste your time or money on this joint."}
{"text":"If you like authentic Mexican Food, give this place a try.  Nestled in Ahwatukee, this place is casual, quick, reasonably priced and has excellent food.  My favorite is the carme asado burrito plate.  Retried beans are the real deal..no canned beans here.  Everything I have eaten here has been good."}
{"text":"My boyfriend and I come here a lot and it's freaking delicious! Never had a complaint, honestly. It's fast, tasty, open pretty much 24/7, and the cashiers are cool. The carne asada fries are the best thing on the menu but you have to pay for pico separately :/ it's extra. Other than that it's great."}
{"text":"I've been told that I am too picky about Mexican food. With that said, this place was mediocre at best. They gave us the wrong food at first and when we got our food, my order was still wrong. The beans were good, but the chili relleno was not very flavorful. The chicken enchilada was missing the chicken because she decided to give me a cheese one instead. Pass."}
{"text":"So delicious and all the staff is very friendly! 10x better then any other Mexican fast food! Sooo bomb? Menudo is really good!"}
{"text":"Ok, ok, ok! This is the local taco joint.  They are open late and the food is great.  I've tried all of the regulars but I gotta tell you their Tortas are amazing.  This place is a great place to people watch because their audience is so diverse.  Be careful ordering the Carne Asada Fries, they are extremely addictive!"}
{"text":"We stopped in for dinner on a Thursday and the food was delicious. The rice was excellent and the guacamole was delish! They were so friendly and generous with the water. We will go back for sure!"}
{"text":"Perfect place for a late night taco craving. They also have a decent salsa selection."}
{"text":"First of all, this place will always be Los Favs in my heart. I don't care what the name has changed to.  Secondly, if you grew up in Chandler, it is one of your duties as a member of the human race to bring as many of you're friends and family here as possible.   The value and the taste are out of this world. Yeah it definitely isn't grass fed beef but it taste so good that you don't really care what kind of meat it actually is.  I would highly highly recommend the carne asada California burrito or the carne asada fries!  You can also get a burrito that is a foot and a half long for less than $10. And if that doesn't float your boat I don't know what does.   BB's Rating: THANK YA JESUS"}
{"text":"Chevos Burrito + Red Sauce = A little bit of mexican food heaven."}
{"text":"Came at 9:40 and the closed sign was already up, and chairs were up, things looked completely put completely away!  you're suppose to be open until 10pm...clearly this is not the case. This is terribly customer service! I will never be coming back."}
{"text":"This my favorite neighborhood restaurants!! The food is excellent, the place is always nice and clean. The staff always has a smile and good attitude.   The different salsa are fantastic!!"}
{"text":"This is my Mexican food go-to spot.  I've been here 4 times and will keep coming back for their taco combinations.  I think this place is waaaay better that Filiberto's."}
