{"text":"It's not fancy, but we've always loved this place! Student on a budget? You can get pizza, wings, and garlic bread (and drinks too) for way cheaper than anywhere else, and we always love the food. It's delicious, cheesy, and hot. The leftovers are great too. The service is always friendly and happy when we go in, and delivery is pretty quick as well. We will continue to go here as long as we live in the area."}
{"text":"The are good for the price, you get what you pay for. I'm giving them 4 stars because they always deliver in a timely fashion and the breadsticks are good, same with the garlic dip, 6.00 medium walk in special, 1.00 delivery? Can't go wrong on a budget"}
{"text":"Always come here for the wings. They have great deals on anything u need but I always get the wings. Definitely 5 stars!"}
{"text":"This place is amazing the food taste great the prices are affordable the staff is friendly and nice and they always deliver on time extra fast I can't recommend this place enough they have the best wings I've ever tasted in my entire life I highly recommend a barbeque wings with a poutine very cheap combo very delicious"}
{"text":"I just purchased a great deal for pizza and wings. The lady at the counter Is super sweet, waited exactly 15 mins for my order as she said. The wings were small but they are good; the pizza however, looked smelled and tasted amazing. They are very generous with toppings especially the cheese. The dough actually tastes good unlike other pizza shops. Would definately recommend the food. Not for a quick slice though, didn't look too good."}
{"text":"Great Wing Spot!   This little joint is run by a small lovely family. They have great deals that has me coming back. No idea why people are complaining, the price is so cheap. You try finding a place near by which gives this amount of food for that price. Friend and I always come here for their wings, fries and pop deal. Their honey garlic is to DIE for. Great place to grab a quick bite. Will probably be there tomorrow...."}
{"text":"Went there cause it was the closest to the baseball diamond we were playing at. Nothing special. Average pizza  seating isn't great either. All in all your local mom and pop pizza joint in the middle of rexdale."}
{"text":"I tried to eat here and get a slice of pizza for lunch. There was a special advertised in the window for 2 slices and a pop. Unfortunately when I went in and ordered I was informed they do not serve slices when it's cold out. Disappointing. Perhaps if you aren't serving slices, don't advertise them in your window."}
{"text":"I order from here all the time. 60 wings combo with double pizza with whatever I want as topping. I'm a hot sauce person so I love to get their suicide dipping sauce for the wings and mine you that shit is hella hot but soo good at the same time. Obviously I have 20 honey garlic and 40 bbq sauce. Garlic bread and fries are on point. Anyways I just made myself hungry, going to be ordering these tonight. ENJOY!!!"}
{"text":"Where to get a quick slice of pizza along this god-forsaken stretch of Steeles? Paradise Pizza & Wings, while not heavenly, is a measure of salvation. The slice selection operates under the old Ford motto \"Any color car you want as long as it's black.\" Slice choice is pepperoni, pepperoni, or the ever popular pepperoni. Price is, however, the deciding factor here. $1.50 for a nice sized slice. Three slices came to $4.50 cash. Beat that Pizza Pizza. A lot of their carry out pies (which you can get in other variations besides pepperoni) look equally value priced.  I like their slices are ready to go. No Pizza Pizza style reheating in the oven. I find that wait simply interminable.  The crust, sauce, cheese, and \"grease\" factor all hit the spots.   Interac, Visa, and Mastercard accepted in-store."}
{"text":"Amazing service. Superb quality of pizza and wings. Bang for your buck if you want good pizza and wings"}
{"text":"This is my go-to spot for pizza and wings. Can't go wrong with these prices. Wings are amazinggggg. Not a dine-in spot, just a GREAT place to get good pizza and wings and go."}
{"text":"I've ate here only twice and they were both from delivery. They both came right on time and for the first order, we got a large poutine and surprisingly, it was a very LARGE portion, bigger than my hand. It was totally worth it. Good price for a good amount, I do recommend it.   For the second order, we got honey garlic chicken wings but my friends said that it was too sweet for them. I personally liked it and ate a lot of it. Wedges are also very good!"}
{"text":"Working near by this is a frequented place when it's too cold to walk anywhere else. This is a dirt cheap pizza joint.. And you definitely get what you pay for. If you're looking for a great meal.. Steer away. However if you're on a budget their Poutine is defiantly edible."}
{"text":"someone had the arguement that this location is better then \"insert toronto franchised pizza joint here\" and i am on the fence over that comment.  this one off location does pizza and does them with pretty decent pricing, the service is great and quick, my only issue is the flavor, its very bland, like extremely bland.  the wings are pretty stellar.  bonus points is that they have specials from time to time and i believe discounts on orders above a certain amount in dollar value.  not 100% sure if they deliver.  personally i've been spoiled with better, but from a price point perspective, its a meal at a good price.  a huge parking lot is a plus as well to this location, although steeles is a nightmare to get in and out of. just my two penny's"}
