{"text":"So I am very conflicted with this place. I have reviewed this place before and gave 5 stars but now I have a problem. The food quality its great! Everything is clean and the décor is not better than a lot of other Dim Sum restaurants. Taste wise, Paradise has to be my favourite. BUT at the end of my meal, when they hand me the receipt I paid attention this time. I know that Paradise costs a little more but they charge $6.50 for tea!! We did NOT drink tea, I told them, \"We did NOT order tea. Only tap water\". She said it is policy to charge for the tea even if you don't drink tea. She said the charge was for the tablecloth too!! I mean, WHAAAT??!!?! The table cloth is their responsibility (note: the tablecloth was NOT dirtied or damaged in anyway); isn't that all included in the price of the food not the tea we didn't drink??? I told them that they can not charge us for tap water and eventually she took the charge off.  I am wary of going to this place again. Even though I love their food, I hate the feeling of being duped."}
{"text":"Very bad service! When I called them, they said they have table available. But still let me waiting at least half an hour, when I arrived there."}
{"text":"Our group meets monthly for dim sum. This restaurant met all our expectations and more. What makes Paradise stand out from other restos is the unique combinations in their offerings. The dishes were fresh, flavourful and gave a great taste experience. You order off the card; this is great b/c we could see the full array of interesting choices. It is easy to order the pricier (L, XL, XXL, SP) items and come away paying $25/person. We all felt it was well worth it.   Service was prompt and polite.   It was very, very busy so make reservations if you don't want to wait 30+ min. (Very common wait time  in most dim sum restos).  Update: For our return visit the following month we focused on the Medium and Small priced items (with a few L) and came away stuffed and satisfied. Of particular note: the honey-garlic wings, the steamed vegetable and mushroom dumplings, sweet red bean pancake, a steamed rice crepe. Last time the steamed bok choy was terrific; this time the sauteed bok choy was just ok. Last time the steamed rice in lotus leaf was disappointing, this time it was flavourful and delicious.   The desserts were delicious with unusual entries such as sesame balls with soft custard centre. The chilled mango pudding had small chunks of mango, the egg tarts were flaky and flavorful. The sweet tofu with ginger syrup was underwhelming.  With 11 people we came away paying $23/person."}
{"text":"Comfortable, good service and great dim sum.  Friendlier than most asian places.  A bit pricier than the usual dim sum restaurant but you pay for what you get. 7 dishes and it was around $40 for two people.   Washrooms were extremely dirty, they should check it every hour. Not completely their fault- people need to wipe the toilet seat!"}
{"text":"Mediocre food, terrible service  Came here for early bird dim sum ($3.10 S,M,L before 11:00am) on a Wednesday morning. Ordered 8 items. Particularly bad were the har gow and beef cheung fun. The wrapping on both were thick and rubbery. The red bean paste pancake looked like it was cooked in really old oil. None of the other items stood out. Definitely no better than other dim sum places. Service was terrible even for a Chinese restaurant. All the waiters looked like zombies. We asked one of them for a takeout box (in Cantonese) and he just looked at us without any acknowledgment whatsoever. Worst part was at the end when the cashier lady brought back my change (a $5 bill and several coins). She hovered over me as I first took the $5 bill and put it in my wallet. As soon as I did that she lunged in and tried to grab the tray with all the coins still on it. I stopped her and took back some of the coins but still probably left more tips than I should have.   One star is for the decor."}
{"text":"Ambience is better than average. Quality of dimsum is less than impressive for North York.  When it comes to grading dimsum I always base it on the steamed shrimp dumplings (har gow); steamed pork and shrimp dumplings (sui mai) and the soup filled pork dumplings (sho long bao). All three I had at this location and the only one I would give a pass would be the Har Gow.  The other two were a definite disappointment. Both sui mai and sho long bao lacked flavour, and the soup filled dumplings, had no soup inside.  The service was fast and professional."}
{"text":"EXCELLENT DIM SUM OPTION IN WILLOWDALE.   Ordering menu has a lot of variety, and dim sum options you don't see at other establishments. The decor is nice - try and get a comfy seat near the window if you have a party less then 5.   Typical busy but wait times can be just 5-10 minutes on a weekend. Parking is annoying as the plaza can get pretty busy, but just park at the school next door as it has been closed for a long time.   HIGHLY RECOMMENDED. WOULD COME AGAIN!!!!"}
{"text":"First time trying out Sunday dim sum here.  Husband and I were crazy enough to decide spur of the moment to get dim sum in this crazy Chinese plaza on a Sunday at 12:40pm, just at the peak of lunch rush and all the church goers are getting out and wanting their dim sum too. I pulled into the parking lot expecting to fight a war for a spot.  Given it's a Chinese plaza filled with bad drivers, first impression is \"avoid coming here at all cost on the weekends\".  Luckily we got a spot right in front of the doors to Paradise.  Good thing too, since we had our 5-month old baby to bring in too.  We figure being a Chinese restaurant, there would be no room for a stroller, so we only took the car seat in.  We were greeted with a friendly hostess who assured us the wait will be very short because a lot of tables just left.  And it was true.  Why else would I get such a kickass parking spot?  The cleaning up of these sudden free tables was slow though, and we still had to wait about 20 minutes for our number to be called.  We got one of the coveted \"cah ways\" (booth seats) by the window.  It was wide enough to slide in the car seat.  The dim sum was ordered via order sheet.  The selection was good.  We ordered the usual suspects. Har gow, siu mys, shrimp rice roll, ham soy gok, sticky rice in lotus leaf, and 2 sweet dishes for dessert.  In general, the food was very good.  Arrived nice and hot.  We both found the food to be a little on the bland side though.  The filling of the ham soy gok for example could have used a bit more seasoning and flavour.  On the plus side, there was no evidence of MSG or over salting, both of which are abundant in Chinese restaurants.   The decor was nice and contemporary.  The service was tentative considering the weekend lunch rush.  However we did have to wave down a waiter to refill our tea pot, which had been sitting with the lid up for more than 10 minutes.  Overall Paradise was found in this chaotic plaza filled with bad drivers who all insist on reverse parking and blocking traffic while doing so.  Would I return to Paradise?  Yes, but only on the weekends when I don't have to fight a war to find a spot."}
{"text":"I'm not a frequent customer at Paradise. I find that for that price I can enjoy better dim sum else where. But occasionally I would go there with my parents for a change in venue and also because the restaurant is located very close to where my parents live. I never had any issue with the restaurant until today. We went there for lunch and today was an unusually busy day for them. First off, the girl at the reception called Latoya messed up the wait queue - what was supposed to be our table was given to a group of four who came later than us (but I chose not to argue with the reception after I saw a feeble old lady was with that group). Finally we were given a table close to the entrance. Soon after, we realized the AC duct which is directly above my Dad's seat started to drip and we saw quite a bit of condensation build up. We grabbed the attention of a manager called Raymond Wan. He took a quick glance and left without a word. Two minutes later, he did the same thing. Finally I asked him if he could do something about it and he replied, \"you have to give me time to figure out what to do! I need time to grab a stick and some time to figure out a solution!\" And this totally set me off and I said \"well that's fine but at least you have to tell us you're working on it. You just simply passed by twice without a word and I wasn't sure if you're gonna do anything with it!\" He finally came back with a tissue-wrapped hockey stick and still this loser wouldn't stop muttering: \"Well wiping off the condensation is not a simple task..you have to think how to do it right without causing a mess. And of course there will be condensation build up because it's so muggy outside and the place is so packed with people. We can't do much with it!\" At this point, I almost LOL - there's really no point saying anything to this Raymond dude. In the end, I didn't pay any tips - not even a dime. So here's my verdict - nice decor but sub-par service for a \"Chinese fine-dining\" restaurant. If you want good dim sum and good service, try Ambassador."}
{"text":"Have been here with family a number of times and food is good but during our last experience the service was terrible, particularly when it came time to pay our bill. We were a larger party (10) and the hostess wearing an \"Anna\" name tag was incredibly rude to us, gave us a scowling look when it came time to ask for the bill. She told us that we needed to pay cash for the special and then grabbed for the cash as we were counting it. I'm not expecting the service to be overly gracious at these places but this particular hostess is in the wrong career."}
{"text":"Came to Toronto for a visit, Great taste! We all liked it. Every dish is a surprisingly new and good taste. Very authentic! Nice service too"}
{"text":"We come out with 6 people.  The table setting at dinner is very nice and looks posh.  The cutlery combination looks like we are in a banquet.  We order the dinner for 6 because it has lobster and Peking Duck.  The taro chips taste very good and open up the appetite for the real dinner coming.  The Peking duck skin is cut evenly and presentation is very good.  It is not too fat and not too lean.  The grouper is juicy and it's a bit oily.  But I think it is the way to cook the grouper in the Chinese restaurant with the grouper dipped in the oil for its taste.  The lobster when it comes we are almost full.  It tastes hot, juicy, tender and smells so good.  The dessert purple rice soup is tasty.  Our guests definitely like the restaurant and the food.    When I tried to foot the bill, the waiter comes over and smiles to me saying someone has already paid it.  I did not pay it so are my guests.  So I have to ask the description of the person who did it.  The waiter said that it is a 30 year old man paying in cash particularly for this corner table ordering the dinner for 6.  We all scratch our heads.  I have to talk to the cashier a few times.  Since it is during the New Year, I would rather identify the person who so generously pay for our dinner and would like to say thank you later when we meet.  But after all descriptions don't seem like I know him. After asking the cashier to triple check the bill, the cashier confirmed that it is her mistake.  So I pay for the dinner.  I would rather pay than having this kind of mistake for other table"}
{"text":"Looks can be deceiving.. as you step into this restaurant it's adorned with rich chesnut wood surfaces and gold walls. The ceiling is a very cool xylephone like wave. Fancy :)  The food though ( dimsum ) was average in quality.  We ordered siu mai, chicken and rice on a crispy cracker, shrimp rolls, crispy taro scallop, and soup filled pork dumplings.   The food wait time here was terribly slow, it wasn't peak time Sunday after 1:30pm, each dish took at least 10 minutes to come out,  Imagine waiting 10 mintues for each individual dish. Order 5 dishes which we did, you're waiting 50 minutes in between.   The place has a nice interior but the food is average, and the kitchen service is slow."}
{"text":"Taste: Okay. Service: way too slow, way too slow, way too slow. 1 dish at a time. Crazy."}
{"text":"Had a Dim sum Lunch here with friends for Chinese New Year.  tastes are different and in most cases better than some of the D S joints that I have been to downtown.  I would definitely go back & bring friends.  Best Char Siu bao, I have tasted in a long while"}
{"text":"There is plenty of parking outside the restaurant. The restaurant offers a discount to their VIP customers when paying cash. Our group of 5 chose the 4 course banquet menu as it appeared to be the best bang for the bucks spent. The price was discounted from $238/- to $188/- before tax and tips. We were told that if paid by credit card, then there would not be the $50/- discount. Fancy that a $50/- surcharge for Credit Cards even though the most unpopular  card among vendors, the AMEX only charge 3% surcharge. Not really sure how they justify it. The food was good and the portions good sized. We had Sharks Fin soup, shredded chicken stir fried with Jelly Fish, Goose feet and wings, steamed fish, lobster and noodles. I had the impression that the food was much more expensive than Seaview restaurant."}
{"text":"Went for early bird dim sum, only because it was closed by my relatives place.    Early bird based on ordering time until 11am.  Service is good if you are a regular.  Lots of options for dim sum.  Taste is decent.  We also ordered shredded pork noodles (?????.  Less than $100 for 4 person at early bird price, so not too bad (not cheap either).  Restaurant is conveniently located at Leslie and Finch.  Bathroom is OK, just don't expect too much for Chinese restaurant."}
{"text":"Parking on this corner of the plaza is especially hard to come by, what's the fuzz?  Okay, so this is supposed to be a fine dining experience..sure. Staff are properly uniformed and easily identifiable. The tea good and the place is neat. Should be a good experience...except my parents ambushed me with another arranged marriage proposal.   Fish, pork, beef, lamb, grass..we ordered it all..it was good. Yum..the service was not attentive. The waitresses kept forgetting out orders, and getting things wrong. The ambiance feel likes we were at someone's basement. The space is smaller than you'd expect, but not uncomfortable. The end.  This girl was a BOSSY DUCKY! The family was rich, but the girl was spoiled. The immaturity of this female was unbelievable.  I take out my cellphone, she takes out her cellphone. I go to the restroom, she goes to the restroom. The entire family actually turned me off, and I think she sensed that. I barely said anything, and I think she sensed my disinterest. I hated my time here, and nothing about the restaurant was interesting enough to keep my attention. I don't understand the existence of this place..what's so special about it? Yet it's outlasted most restaurants in the area...something I don't?   Not my Paradise."}
{"text":"Come here for dinner and dim sum, both are great, i think they've recently revamped the chef. Pam is doing the right things to improve the food quality. Its expensive but you wont be disappointed."}
{"text":"Came here with fellow yelper Lili for dim sum. The aim was to get there before 11am while it was 1/2 price but damn this place was busy. Most of Markham must have had the same idea.  The wait was around 30 minutes which took us past the 11am mark.  The dim sum was top notch though, no complaints."}
{"text":"There are a whole bunch of dim sum restaurants in the Tdot that simply steam packaged dim sum that one can find in the frozen section of chinese supermarkets. This place isn't one of them.   The dim sum is hand crafted. They serve baked tapioca pudding. No other dim sum restaurant in toronto serves this dish.  Proof that this restaurant has creativity.   I would give this place 5 stars but it is always busy. I've had to turn away due to long line ups before. Parking is available but sometimes the lot is full. Plan ahead to wait if you try this place on the weekends.   I grew up eating dim sum. As restaurants move to pre fab heated food to pad profits it's nice to go to a place like paradise and remind myself of times when all dim sum was made at the restaurant level."}
{"text":"food is not bad, one of the better places. atmosphere is nicer than the places in Chinatown   weekend dim sum is 50% before 11. you have to be seated and order by 11 which is debatable. I've had the waitress seat us before 11 and wrote the time on the order sheet and have the waiter take our order after 11 and wouldn't honor the discount and have come same time and seated before 11 and ordered after 11, honoured discount. the time they didn't honor it, they just completely ignored us when we asked about it  I must say though, the fresh mango rolls were delicious"}
{"text":"The is the default dim sum place when I come home for a visit. It's close by, the service is fast, it's never crazy busy when you go early in the morning, and the food is yum.   Pay your bill by 11:30, and all SML dishes are $2.75! Some of the better dishes include the deep fried shrimp dumplings with soup, and the beef short ribs (my two staples when I go).   Plus, the place is pretty nice inside. The spot has changed hands so many times over the years so I'm happy there's a staple now in that mall for dim sum. Parking is definitely a pain though, since space is limited and the lots are poorly laid out. :\"}
{"text":"When ever I go for dim sum or take out,All the staff are truly friendly and accommodating,and The food is delicious."}
{"text":"This place is really okay. The service is okay if you are some sort of regular. The food is okay. But the tables are really crowded and there's no room to walk in between. In terms of the variety of dim sum there is a bit of variety and specially item compared to other places. We tried their steamed rice roll with fried tofu in the middle and fried glutinous rice. Both seems to be okay pretty tasty. The portions of their dim sum is on the small side, if you are not full can always order fried rice or noodles. We tried their fried meat dumpling this time and the colour is a bit off. It's either over fried or the oil is old. Their spring rolls and fried sesame ball dessert is pretty good too. This place is a bit crowded for me and their quality is a bit inconsistent, not to mention parking in the parking lot is horrendous, there are some pretty bad drivers that frequent this lot, once in a while is okay."}
{"text":"Not bad.  Service is pretty good and MAN...did they try to sell us moon cakes.  Stopped to grab some Dim Sum.  Not bad, but doesn't compare to my favorite Dim Sum spots from Vancouver, BC.  But hey, beggers can't be choosers.  The restaurant is nicely decorated and has ample space to host a Chinese event, such as baby's first month birthday, elder's birthday, and weddings...You all know what I'm talking about!  Service is excellent, Dim Sum is good.  What else can you ask for?"}
{"text":"Ventured out of my way for a better dim sum experience. Food was nothing exceptional, leaning towards sub par. Service & tidiness were average or comparable to usual chinese restaurants. (staff speak english & residual food from last customer on chair, table & cutlery). Only learned about the cash only for early birds on the bill so had to step out.   Not worth returning, not even for the early bird discount. Short of fine dining experience, unless newish decor is your metric."}
{"text":"just been here dont know what happened to their chief. last time we had a great experience food was great! This time??most brunch ever! congee was blend on top and super salty at bottom (fine blame us for not stirring before eating???) fried duck chin and fried chicken joints one is undercooked the other is overcooked plus the size of those dish shrunk by half since last time we were here. the pineapple and cheese baked mussels are overcooked once again??and black pepper pig stomack is gross (it suppose to tast good they didnt clean it properly so it smells like pig shit)gave up on it after first taste (WTF they made it sweet?someone swaped salt for sugar? ) the papaya and milk fried dumplin lookin thingy (meh it's okay??taste blend barely any papaya in it just milk paste-ish thing I find it gross but some ppl might like it.) we also ordered fried squid \"fingers\"(according to them yes squid has fingers??? ) nvr showed up on our table. dumb me, order this seafood dumpling that claims to have abalone (none was found or tasted in that dumplin or the soup so it's a fraud? ) anyways that one single dunpling ?no larger than size of my palm n i hav small hands?cost us 27 bucks! that's the food tasting part, now the service part.   after we find out duck chin was undercooked we ask the manager politely cuz its different from what we had last time he pretends that he doesnt understand mandarine so i repated myself in english. he didnt apologize or anything just took our dish away. we thought he would cancel that/refound us??when we saw our bill once agian he pretended he didnt know after we asked him he canceled n didnt charge us for that (what if we didn't ask? so no refound? lol ) the waitress who brought us our bill demaned us to give at least 15% tips (after that crappy food and crappy service?! why would we reward u? like a big thank you for ur crappy food n service which made our day?) and her too pretended that she didnt understand mandarine (yeah u didn't quiet understand english too??)   all in all if u wanna go its more of a \"try ur luck \" thing but im not going bac there. I'm here to enjoy food and a good time not being looked downat by someone who thinks they are superior cuz they speak cantoness. (sorry, mandarine is the official language of china not cantoness. no offense to anyone who speak or like cantoness. I like it too just not those who think they r superior CUZ of that.) Very diappointed!"}
{"text":"I've been here many times, both for dim sum and dinner. It used to be very good. On our most recent visit though (Saturday early afternoon), our experience wasn't so great.  The beef tendons that we ordered last time and were wowed about - weren't as tender or tasty this time. The rice crepe with beef inside was meh. The congee came with only a few spring onions, and when we asked for more, we only got a tiny bit more. Bbq pork puff pastry was good, shredded chicken in tofu crepe was good, and turnip cake in xo was awesome (crispy outside).   Also, when we got there, there were many empty tables. Yet the hostess had us follow her around the whole restaurant without giving us a table. We ended up back at the front wondering what in the world was going on. We finally got seated, but it wasn't a good start to our dim sum experience."}
{"text":"Upon arrival, I was impressed by the fancy decor. The meal went downhill from there.  In summary: very expensive for small portions. Little to no service. Flies everywhere.  Succulent pig with jellyfish: a small portion. Pig was pretty okay, but I've had better.  Half chicken: some pieces were hot, some were warm, some were cold, as if they microwaved it. Pretty standard tasting otherwise  Tofu dish: don't know the name for it in English. Quite salty, but still good. Again, small portions. The 4 of us had 1-2 small servings and the dish was done.  Yee mein: smaller portion than what I would expect. The noodles were made quite wet, not what I'm used to, but tasted pretty good.  Beef with puff pastry: horrible!!! And what a weird dish. The puff pastry was not cooked and tasted bad. Underneath were entire pieces of very low quality steak. How do they expect us to eat giant pieces of chewy steak? It tasted either old, low quality, or poorly cooked. We didn't even take the leftovers for this dish home. This dish was over $20... for this price, I might as well have something at a cha cha tang! Even their steaks taste better.  Tom cleared the dishes for us. When my aunt mentioned the flies, he ignored her and walked away. He had quite a poor attitude, I think.  Anna brought us the check. I had read on reviews that they sometimes add a few dollars on the check (to trick people into paying more) so I told my aunt to double check the price. Anna did not look pleased. What's the big deal? If there is nothing wrong with the check, she has nothing to worry about. After paying, she just took the receipt and leaves. No thank you, nothing, same bad mood expression on her face.  Service: slow. They basically only come to you when they're serving food. So if you needed tea refilled or dishes cleared, you would need to grab someone yourself. No smiles, nothing.  All in all, not very good. Food was acceptable (other than the puff pastry steak thing), but paired with the bad service, we would not go back. I highly do not recommend this place, unless you want to be ignored or treated poorly."}
{"text":"Visited Sun Nov 26 for dim sum. The $3.30 for all small, medium and large dishes before 11am is a scam! We arrived at 9:30am and ordered 11 dishes, all of them were small, medium or large and the total came out to $67!!! I paid around 1030am, well before the 11am cut off time.  I wasn't able to get an itemized bill to challenge them, but there is no way that it would add up to $67. I have been here at least 5 times before, and today was the last time I will ever come here. As you can see I rarely give 1 star reviews, so I am definitely upset. I would not go here again! One of these days this place is going to get caught, and shut down for good. Next reviewers, please escalate this issue to the police."}
{"text":"The food here is amazing. We come here all the time with my family.  But I was really disappointed in the service we got last night.  We booked off a room/section of the restaurant for this special occasion (which was min charge for food) and so I assume this is why they decided to serve us this way.   Instead of the food being in the centre of the table like usual, they put individual serving sizes on plates. This was perfect for Peking Duck, but as the meal went on, it was more cumbersome than a privilege.    At some point in the meal, they just were bringing out food, giving it us in plates, without us finishing the one we were currently working on. Each person had 4 plates spread out beside them. It was awkward and the food got cold.   In addition, we had specifically requested the fried rice come out prior to all the veggies/fish/chicken so that we can eat it together. This never happened and it came last.  What should have happened:  - informed us that the meal will be served this way, and ask our preference  - only bring out the next dish when majority of people are finished  - clear dirty plates first before bringing out the next one (and not have a pile of dishes waiting)  - have one busboy be attending the entire time to manage this  - OR just simply put everything in the middle with some pretty serving chopsticks and only separate out the fried rice, soup and noodles !!  I understand they were trying to provide better service, but they should know better and since it was a quiet weekday, be more attentive. They should know better.   BUT - this being said - COME HERE FOR DIM SUM, it's amazing."}
{"text":"I visited this place a few weeks ago with my mother and aunt. Immediately, when I walked inside, I was quite impressed with the decor around the whole place. It was clean, prestige, and elegant.   The dim sum is selection is very standard of what you would normally find in any dim sum restaurant. The choices are quite delicious , with a few specialty creations, like the Fried Papaya and Milk Dumplings. The food was freshly prepared with fresh ingredients. The prices are reasonable considering the quality of the food.   The service was good as the waiters were very attentive at our table. Overall, I had a great experience at this place and I cannot wait to come back for more."}
{"text":"I love this place,, my favourite sticky rice, har gow just done right, best chili oil...octopus fingers mmmmmn"}
{"text":"Tasty for dim sum. I liked their chicken feet and fish fillet and zo yo ping. Lots of fried foods. I want to fast their ramen noodles in the future."}
{"text":"The food is of a higher quality than most dimsum places so it's more expensive here - you get what you pay for. When we came in we were seated immediately, & our food came to us hot & freshly made.   I did not give higher stars because I think the servers need to be friendlier & build a better rapport with their clientele.  Overall the place is clean & bright, & we will come back in the future."}
{"text":"Awful experience at Paradise today for dim sum with the family. We have been long time customers at this restaurant for dim sum and dinner and we have always had a good experience and are VIP members. However today when we went we asked for a table of 3 and were given a number (this has never happened before but there was only a few parties waiting) and a minute into waiting another small party entered and were given a table right away. As I was right there I said that we were there first and the Maitre D proceeded to ignore me and give the table away to the party that just entered and they did not have any reservations or anything. That was the worst customer experience that I ever had at a so called fine dining Chinese restaurant. They have lost a customer forever as this is inappropriate to treat customers this way. Needless to say we left the restaurant immediately.  I would give this zeros stars but was forced to select a rating."}
{"text":"Waited an hour for this, and then we were also told that two of the dim sums we ordered one hour ago are not available. ?  Came here for dim sum several times, and this is definitely the worst experience ever. EXTREMELY poor customer service...  NEVER COMING BACK!!!!"}
{"text":"Don't be trick by its special price, 2.80$ before 11:30!  Rating  Taste - 2 Service - 4  I take taste on the upper hand , therefore I give 3, realistically I want to give a 2.5. Maybe it's just me. ^^ eat well ^^"}
{"text":"A private dinner party for my relative's great milestone 90th birthday was held at Paradise.  It was indeed paradise with a traditional Chinese style twelve course formal banquet dinner.  Quality of food is very fresh and cooked with care in Chinese Canadian fashion.  Waiter staff are courteous and friendly to welcome patrons.  Paradise comes with their own private parking lot.  Business cards are printed on clear vellum, cover stock of 48 lbs.  I highly recommend reservations for large private parties.  Paradise Fine Chinese Dining's phone number:  (416) 490-8828."}
{"text":"The food is OK?but expensive. My friend and i just place 6 orders? and it costs us about 50 dollar. The bill is so weired?which did not specifically indicates what is the price of each order. Never choose this place ever."}
{"text":"Coming here for a wedding reception I must say we were quite amazed of how this many people were able to fit into this venue. Paradise Fine Chinese Dining is a great place, well laid out and in this case they've got a cute dance floor available for those who are having a private event. Known for their food, including dim sum items, we were served up a 12 course meal which was traditional in the Chinese culture. Notable dishes that were served; Braised Lobster with ginger, abalone with mushrooms and ham, prawn with scallops, suckling pig, crab seafood soup, sticky fried rice in lotus leaf. The service was great and their staff are extremely friendly and polite."}
{"text":"I really enjoy eating here....the comfort level, the food, service is all a 4*  Yes this place is a little pricey but come on.. its already stated in the name. Fine chinese dining... its not like some restaurant where you don't get service while being upset..   The food is a little more detailed oriented, reason being when I eat their fried food, its not heavily battered... which is a big plus for me...I dislike places that batter their fried food heavily... just me...   Dim sum specials are available, $2.95 M-F, I believe...which is decent pricing for this day and age with the quality you get...  Elegant and comfortable seating area. I come here for dinner but have not yet tried the dim sum..  Parking gets a little crazy becuz of the way the plaza is designed...."}
{"text":"We stopped there again today for Dim Sum.  The place is very elegant and the tables are large with comfortable chairs.    I've only been here for lunch so I can't speak for the dinner menu but lunch is always a hit for our family here.  Calamari, dumplings, ribs and su-mai are always part of the core order with added items depending on the mood.  The service is great, the staff is friendly and efficient.  A well rounded restaurant.  I really like this place."}
{"text":"Solid 3.5  I came here for dinner on Mother's Day because it was the only place that had enough room to make reservations for 16. I was surprised to see the place wasn't packed. We had to split up our group into two tables so we opted for a 12 course set meal. The food was quite good but I found the portions to be rather small for the price we were paying. The service was good; they constantly checked up on us and explained each dish when they arrived. They even placed it nicely for me to take pictures of each food before serving."}
{"text":"Nice decor inside and food us ok. Service was good. Food is pricey compared to other dim sum places. We only ordered 8 items and it costs us $50 for 2 people. I have had more food and paid less at other places. No discounts or happy hour before 11am here. Tried it once to see how it's like. Don't think we will go here again. I heard food here used to be better and we rather eat at other dim sum places in Markham with happy hour/discounts before 11am."}
{"text":"Service is sub par even for Chinese restaurant standards.  Dish we ordered wasn't available but they never bothered to tell us until 30 minutes later. Bill took 15 minutes to arrive after asking and the manager was pretty rude about it too.  Food was alright so no complaints there, but a place that looks like this the service is pretty sub par."}
{"text":"I like this place for a more upscale dim sum dining.  The environment is pretty elegant...nice utensils, mederate noise level, tentitive servers who would actually come over to check on how you're doing (not usual for Chinese dining). Food was delicious and the presentation was far better than some other cheaper places. Obviously it was more expensive, but we ordered before 11am to take advantage of the discount, which s/m/l dishes are all for 2.80 each. I tried their regular dining menu before as well and those are really good too, but definitely pricier compared to other Chinese restaurants"}
{"text":"Dim Sum at its finest!! Not only was this the best dim sum I have tasted outside of Hong Kong, the restaurant was the cleanest and most beautiful Chinese place I've seen in North America. The service was fast, polite (yes I said polite) and mostly all of the servers tried hard to accommodate. Do not miss this on Sunday!"}
{"text":"After over 2 years I've revisited this place for dinner. We had shark fin soup, soy chicken, seafood with bird's nest, and beef with bitter pickle.  The shark fin soup was really good! On par with Dragon Boat and Crown Prince/Princess in terms of the best in the GTA. The soy chicken was decent, however the price we paid ($20.50 for a half) was quite steep...meanwhile, the seafood in birds nest was also decent, however portions were somewhat low, and the birds nest is separated from the seafood itself. Finally, the beef with bitter pickle had a lot of beef and very little pickle, even though we requested the opposite.  Service remains very good, and we were attended to relatively well despite the fact half the restaurant was cut off due to a bar. The only small issue we had was that nobody came to refill our tea until near the end.  Total meal cost was $170, which is quite steep, but it IS an upscale place...I'll come back every so often if there's an event or such going on."}
{"text":"One of the more elegant Chinese dim sum /fine dining places I've gone too. My grandparents and I love coming here. The decro is great and spacious. Although the price may be considered to be on the pricier side, the food was great. We come here a lot for dim sum. We usually order the typical stuff but some fun items to try would be the deep fried sticky rice (aka joong), mushroom and veggie dumpling (It was green!) and fresh mango coconut rolls!"}
{"text":"Great chinese dim sum. Clean restaurant, fast service, good choice of menu items. Go early (before 11:00 am) to get the special discount."}
{"text":"My family and I went here last summer for dim sum. The décor was nice and modern and the restaurant was clean. We ordered  * pork & shrimp siu mai * kabocha squash and scallop dumplings * chiu chow dumplings * steamed barbecued pork buns * baked almond & almond milk puffs * fried sesame balls w/custard filling * pan fried beef buns with black pepper sauce * steamed rice crepe w/dried shrimp and vegetables * baked lychee chicken salad rolls  Everything was really good. If you order by 11am, all small, medium and large dim sum plates are only $3.30 Canadian(normally large dishes are $5.50). I definitely recommend this place!"}
{"text":"Service very good.  Beef stomach too blant and stiff.  Paper wired chicken is really  breaded Chicken with mayo.  Flaky pastry covered double boiled milk is great.  Flaky pastry Papaya with milk custard has almond fragrance.  Excellent decor,  quiet and  cozy.  Very clean.  Nice  crockery. On the pricey side."}
{"text":"Took my GF here for a dinner.  Paradise is a nice restaurant, but for the price point you can do better.  Pros: Very nice decor Service is on point  Cons: Value for the price point could be better  I've always noticed this place while driving by.  Most people usually come for dim sum based on the reviews.  I wanted to bring my GF to a nice place for dinner and decided on this one because it was close by.  The place has great decor and tries to set itself apart from the rest of the restaurants in the same plaza.  It's definitely the most professional of the bunch.  We ordered a steamed fish, diced beef tenderloin and a braised tofu with vegetables.  The food comes out with two servers, one to hold the dish, the other to actually serve it.  It's a little over the top for a HK Style Cafe veteran like me, but it's nice to have.  The servers here are all on point.  Service is a very important ideal for them here.  The food itself was OK.  It's just for the price point I feel the portions could be a lot better. The three dishes and 3 bowls of rice came to over $130.  You can tell from my pictures that it's safe to say portions could be a lot better.  My favourite dish was actually the braised tofu which is surprising.  The food was presented well though.  I guess when I left, I just felt the meal lacked something for the price point.  I'm on the fence about this place.  There were things I liked but for the price, I felt you should come out with more."}
{"text":"3.5 Stars. Large restaurant suitable for banquet celebrations. Early bird dim sum discount as stated in previous reviews (s/m/l same price). DIm sum quality about average for TO area. Some specialty dishes like beef tendon and special dumplings."}
{"text":"I came here for my mom's early birthday celebration, but I didn't know about the special price before 11 am..There was a small wait around 12 pm, but that was no big deal. Other dim sum places require you to wait for a lot longer on the weekends.  The food came pretty quickly after we placed our orders (probably in about 10-15 minutes). My family ordered some typical dim sum dishes including the shrimp dumplings, beef rice rolls (funny how they call them rice crepes on their menus), spare ribs, sticky rice, beef balls, and chive pork blood. The food tasted delicious and definitely high quality, but I was not particularly blown away. However, the sticky rice we got was fried, and I was quite intrigued by the texture; it looked sort of like a mountain. I'm not a big fan of sticky rice with a fried exterior, but I felt that this tasted great, and the frying did not diminish the quality of the food at all. The other dishes tasted great as well, and probably comparable to a lot of high quality Chinese restaurants. However, the beef rolls were a bit smaller than usual.   Overall, Paradise is a bit pricey, but it's worth the price for a fine dining experience. It's nice to have a place in North York, especially since I don't live in Markham. I recommend to come again but probably when the special prices apply."}
{"text":"My fiance's family default dim sum place (practically go there every weekend or whatever we visit)!  Super crowded and long wait time we visited.  Instead of the standard pushing cart, you place all your order from a sheet (you write down the quantity and check the box next to the dish you want).   My fav - steamed gingered egg white with baked pie crust! Sweet papaya fried dumplings!   Everything else is pretty standard dim sum dishes. Nothing too innovative.. but still really yummy!  Will continue to return.. since my fiance's family will be my family too :)!"}
{"text":"So here's the deal. Good food, attentive and clean but beware- Read on. Prices are on the high end for a Chinese restaurant in Toronto. Again good venue, and clean. Peking duck is done well and most dishes prepped at a level fitting of the cost. Music is a tad loud.   Here's the rub. It angers me when the staff lies and deceives you.  I had to take away stars. I believe a meal should leave you happy if not at least satisfied. A great meal is equally about the food, as it is about the service and the bill.   A common practice in Chinese restaurants is that if you pay them cash (ahem! CRA), they discount the 13% tax. It was clearly written on their menu that day (in Chinese- another interesting practice that I'll won't comment on for now).  For the bill we opted to pay cash to get the discount.  Surprisingly, the manager said that it didn't apply and brought us a menu to show us that it only applied to the 10 course meal.  What we didn't realize until later is that he pulled a switch-a--roo and showed us a different menu vs the menu we read when ordering. \"Well played Paradise manager! Oh, but wait you have more!\"  We then opted for credit card and tried to explain the break down of payments since we were splitting the bill, but the manager left as we were mid sentence to check if our payments added up to cover the total. Firstly, this is pretty damn rude. I and my friends are not dine and dash artists trying to short change the restaurant, which is what the manager then accused us of trying. Secondly, if the manager just took 30 seconds to listen he would get the details from us to explain how payments total with a healthy tip.( I wish we hadn't now)  I or the seven others dining will never go back. I hope others reading this follow suit. It annoys me that a restaurant with good food totally fumbles it at the 1 yard line. You simply can't reward this type of foolish behavior."}
{"text":"CROOKS! BEWARE! We are never stepping foot here again. But if you try this place, check your bill and make sure you're not being cheated.   Went for dim sum with visiting relatives. It was also the first time we took our baby out to dim sum. Service was horrible. The waiter wasn't very friendly and he took a while getting our utensils after the food had arrived. There weren't much patrons as it was already after 11am on a weekday.   The most important thing was.. we were cheated when the bill came. My husband had put down two brand new bills ($50 & $20). As we got up to leave & halfway out, the waiter claimed we didn't put down enough. The $20 was switched with a cruddy looking $10 bill! We couldn't believe it! That waiter must've thought we were distracted with a baby but my husband knew exactly what he had put down. Hubby ended up paying the difference. WTF  In a separate incident, my mother's friend was here having dim sum at Paradise and they overcharged her. Always check your bill and be careful paying in cash!"}
{"text":"I'm going to skip this place the next time i crave dim sum. I thought the selection was smaller and it was rather over priced. I don't ever recall spending $100 on dim sum for 2 ppl before.... and it's not like it's got the Lei Wah Heen quality or anything."}
{"text":"wow I'll never come here in lunch hour again just no frigggin way this place is louder than a slaughter house it's virtually impossible to enjoy the dimsum and chinese tea with a million people talking and laughing obnoxiously in the background  ??????? ??????????"}
{"text":"This is the dim sum place that is nearest to my home, so always go there with MIL (she must has dim sum during weekend) Overall food is ok, but I think it's a bit expensive to me.  I think their pork dumpling is the best among all the dim sum restaurants I had so far.  Their pumpkin garlic dumpling is quite good too."}
{"text":"Went there for lunch with friends last friday.  It was nearby and we were hungry. The atmosphere was nice, very busy but we were seated with 15 mins, which wasn't so bad considering the line up.  For some reason  I expected the food to be great (maybe growling stomach) and the place seemed popular.  The food was average, nothing special.  The service felt rushed at times and then non existent.  They messed up our order for noodles and did not make up for it. We ordered pan fried seafood noodles, they gave us broth noodles with hardly any seafood.  Needless to say it was disappointing especially when you factor in the price. Too expensive for average chinese food."}
{"text":"I've been to this place so many times that everytime we go it's the same routine.  1. Walk in and be greeted by everyone with a genuine smile   2. Sit down and order our tea then immediately have our dim sum sheet marked to get a discount  3. Order the usual dishes like BBQ puff pastry, Stir-fry rice cake w/mushroom, chicken feet, bean curd roll, beef tendon and octopus fingers.. ALL of which are great.   (Highly reccommend: BBQ puff pastry; light and flaky with a rich bbq flavour, rice cake is always chewy with plentiful and fresh ingredients and great to share and beef tendon which has a spicy kick and a good portion to share with others as well)  It is a very spacious place with comfortable chairs and they even have booths! The service is always fast and you can always find a seat. But, since it is located in a plaza with an ASIAN supermarket... well, let me break it down.  ASIAN supermarket + small plaza + parking = ... GOOD LUCK! Hint: go to the upper level  Overall:   The dinner dishes are pretty good as well from what I remember, but we usually come here for dim sum. This place is definately a keeper!"}
{"text":"Seems like a hit or miss with this restaurant.  The food quality was pretty decent when I came here in the summer, but at my last visit this long weekend, the food was terrible. Not sure if it went downhill or it was just my one off experience since it was a holiday and the master chefs were off. Majority of the dim sum dishes were served at room temperature, not steaming hot like it should be which made it very unenjoyable. It's not like it's been sitting there for a while before they took it out either because it did take quite a long time for us to be served. Not sure if their steamer is broken or something. The rice noodles came cold, didn't feel or look fresh either. It felt as if the rice noodle skin wasn't fully cooked. Same goes with the Ha Gow and other dumplings - the outer skin didn't seem to be fully cooked. The chicken feet dim sum only came with 4 pieces - seriously? Usually it comes with 6 at least. The steamed milk souffle was probably the only decent thing I had that day.  It was an expensive meal, and totally not worth the price we paid for based off our last experience. Cold and lack of quality dim sum - not sure if I'd want to come back after that one off experience....."}
{"text":"My family loves this place for dim sum. My parents this time booked a reservation for dinner so it got me all excited!  Finding parking spots was harder than getting a table. The staff and the owner are so friendly and welcoming, and the decor is beautiful. The food was amazing. Every dish we ordered was excellent, delicately made and mouth-watery good. This style of cuisine is by far one of my favourite.  This restaurant is family-friendly environment which means that there might be shouting going on if your table is next to a large group. That wasn't a big issue for us as we were able to communicate amongst ourselves.  Pro tip:  If you're new to this place and you find the menu is a bit overwhelming, be nice to waiter/owner. The waiter who wears suits are the owners of this restaurant. Ask them for suggestions and you won't be disappointed."}
{"text":"I wish I had done a bit of research prior to coming here - if I had known about this place's shady reputation, I would have avoided. I recommend you to do so.  The food we had in general was ok, with us having dim sum on a weekday afternoon. The restaurant was quite bare, which is perhaps the reason why the staff/manager (?) felt the need to try to cheat us?  Upon paying for our meal, I put down two bills - I knew exactly how much I put down because I only had a certain number of crisp bills in my wallet that I had just received from the bank that day. My cousin who dined with us, also saw exactly how much money I put down. This didn't stop the server or manager (not sure which one) from quickly switching out my bills (which I saw from the corner of my eye) to make it look as if I had not paid enough money.  If this was a matter of a bill going missing, perhaps it may have fell on the floor or something like that...but somebody placed another crinkly bill of smaller denomination instead (which I definitely did NOT have in my wallet), which clearly demonstrated intent to deceive. I had to pay MORE money because I could not prove what had happened.   This has never happened before, and I'm still quite blown away at how bold this restaurant could be to try something like this...and just to make a few extra bucks? Ridiculous. It wasn't until I asked around until I found out that this place apparently has a reputation for being \"crooks.\" I wouldn't trust my cash OR my credit card bill around this place."}
{"text":"Woke up early on a Sunday morning and felt like eating some dim sum so my wife and I decided to hit up this restaurant.    We arrived around 10am which was perfect to take advantage of their early bird special which was $3.30 for all their S, M and L dishes. We ordered about 7 dishes or so and gave the order slip to the waiter and we waited.....and waited...........and waited.................AND WAITED.  My wife and I started reminincing about our recent trip to  China and Japan sharing funny stories etc.  When we ran out of things to reminisce about, I took a look at my watch and 40 minutes have passed and not a single dish we ordered came to our table.  We asked the waiter to check up on the order and he told us that \"it's coming\".  Please keep in mind that the restaurant was not full at this time, there were still many empty seats.   Our patience was running thin at this point.   Normally it doesn't take THIS long at other dim sum places.  We were ready to tell the manager that if our food doesn't come within the next 5 min or so, we were gonna walk.  But thank goodness almighty?, our first dish arrived about 8 minutes after and the rest followed shortly after.  I'm not gonna go into details about each dish but what I can say is that the food wasn't bad but it wasn't super good either.  I guess the long wait left a bit of a bad taste in our mouths. I get it if the restaurant was packed but it wasn't!   What's funny was that they never  completed our order.  1 dish was still outstanding after everything. Instead of waiting it out, we just told them to scratch it and give us the bill. We paid and left.  Will not recommend nor will we return."}
{"text":"Worst service I have ever had. Right when we got seated down, I knew it was going to be bad when the lady gave us the sheet to pick our food and then carelessly threw the pencil onto our table. Where's the respect? It took awhile for us to flag someone down to get the food sheet we filled out. When we paid for our bill, we didn't want to give a lot of tips because they didn't deserve it but then they kept talking to us in Cantonese but we didn't speak it. We kept asking if they can speak in English but they ignored us and continued to speak in their language. The only things I had were \"10% tips minimum\" so we just paid and left. Never coming back here again"}
{"text":"Pictures of the ?? are on my Instagram.   First, the deep fried squid tentacles. Nothing in particular stood out, but the taste and texture were good. I always appreciate a well-rounded dish.   Secondly, the beef tripe. Interestingly, there was an intense crunch to each bite despite the softness of each piece. Only complaint is that it only came with three pieces of \"whatever-vegetable.\" Otherwise, the heart-shaped plate it came in was cute!   Thirdly, the durian mochi. Everyone balks away from durian because of the stench, but there was none of that horrendous smell. I enjoyed the contrasting textures of the crisp exterior and the soft interior. Moreover, it wasn't overly sweet.   Lastly, the tea and service. Frankly, the ??? was disgusting. It tasted off. The waiter was unnecessarily aggressive when asked to bring another pot of ??? because of the strange taste. I suggested that he try the tea, but he refused to and incessantly insisted that it was ???. When asked if he could bring ?? instead, the waiter complied without further argument.   Following that abysmal start, we asked a different waiter to take our order. We then realized that we had two desserts and asked the waiter to take one off our order. The waiter snidely said that we barely ordered anything and that we should order more if we go out.   The food wasn't good enough that I'd return here because service was too shoddy for a supposedly upscale restaurant."}
{"text":"2.5 star  I have never been to Paradise Fine Chinese Dining until Now and this place seems to be here for as long as I remembered!  Dim Sum Special: Weekday before 11:30 am or Weekend before 11:00 am S/M/L for $2.85 sure is quite a good deal.  We tried a few items, the usual ones we ordered when we have dim sum. Most of the items we ordered were so-so to meh, nothing really amazing enough for us to come back.  The deco though is quite nice and elegance. The only issue though was I felt a little rush  and there was a sense of the staff trying to get out out before the lunch rush. For me having dim sum means leisurely sipping my tea and chit chat a little while enjoying some food.  I might be back. But definitely not in a rush!"}
{"text":"The food here is pretty good but pricey. You get what you pay for I guess. Service was good and fast. The atmosphere was nice. A bit upscale though they have some tacky dish holders or whatever they're called. The peking duck was pretty good as was the fish and veggie dish we got (forgot the name)."}
{"text":"Went for dim sum at Paradise as I'd heard it was good, but found it disappointing. Usually I think of dim sum as something to indulge in, where I can order a variety of dishes & enjoy each morsel of food as a little burst of flavour. Here, the dim sum was generally lacking in flavour and not well prepared.   Details on some individual dishes & the size they're priced at (Small, Medium, Large, etc.):  1. Steamed Supreme Har Gows (Shrimp dumpling) (Large): Dry and bland. You get a generous amount of shrimp, but it doesn't particularly taste good. The dumpling skin was thick and coarse rather than delicate.   2. Steamed Chicken Feet with Supreme Sauce (Small): Usually this dish should be bursting in flavour from various spices stewed in the sauce & then absorbed into the chicken feet, but Paradise's Chicken Feet was undercooked and bland.  3. Sticky Rice with Chicken & Conpoy Wrapped in Lotus Leaf (Medium): There was little non-rice filling in this, which made the whole thing rather bland. The texture of the sticky rice was fine.  4. Crusty Taro with Scallop (Large): This is a deep-fried taro dumpling with \"crusty\" crispy edges on it, filled with a piece of scallop.  Scallop was thin, bland, and not fresh. I've had better versions of this taro dumpling (at other restaurants) filled with ground pork instead.  5. Deep Fried Assorted Meat Dumplings (Small): These were not good, not appetizing at all.  6. Grilled Turnip Pate with Preserved Meat (Radish Cake) (Medium): The \"turnip\" here refers to white radish. This radish cake was bland, flavourless and not seared well. They used so little radish (or \"turnip\") that I couldn't really taste it.  Seems like it's mostly filler (flour).  Service is so-so. Expect it to be busy at lunchtime. There may be a substantial waiting list before you get seated. You need to get a number from the hostess. They may not call out numbers very clearly or loudly. Apparently, the hostess passed over our number several times without bothering to call it out to the entire crowd waiting in the front lobby area.  Decor is pretty good. Restaurant is pleasant to sit in.  2+ stars"}
{"text":"I wanted a nice place to enjoy a family-style Chinese meal and I knew I wanted Peking Duck. I searched the newspaper for some deals and ended up choosing Paradise for a $98 package featuring both Peking Duck and lobster, two of my favourites in Chinese fine dining.  Complimentary taro chips were tasty treats to start off the meal! These were nice and crispy.  The first course was the glorious homemade roasted Peking Duck. I would eat Peking Duck all the time if it wasn't so fatty! But of course, that decadent layer of fat is what makes the meat so good, in combination with the crispy, roasted skin.   Next up, stir fried fillet of garoupa with Kabocha squash was nicely executed. The sauce was pretty good and complemented the tender pieces of fish.   The leftover duck meat from the Peking Duck was used for the braised eggplant with duck pieces. I adored the eggplant sauce and I think it worked very well with the duck.  Then, we have baby bok choy in broth and garlic, which was also pretty good, but I would prefer my bok choy a little more tender. I particularly enjoyed the sautéed garlic chunks.  Finally, the pan fried lobsters with soya sauce did not disappoint. The meat was sweet and juicy and exterior had a nice crunch from the pan frying.   The meal also included the typical red bean soup as dessert, but by then I was way too full. It was an excellent meal that satisfied my Peking Duck craving!"}
{"text":"In general the food is decent, but overpriced compared to other similar or better options. Parking can be challenging for weekend dim sum.  PLEASE VERIFY YOUR BILL CAREFULLY HERE. They don't like to give you an itemized bill for dinner, which makes it difficult to verify the accuracy of the total. After visiting several times we caught on and noticed that they were consistently overcharging by a few dollars. Not just once, but every time we visited."}
