{"text":"Food is good, fresh, cheap! Great pho and grilled meat. Service is fast and friendly! Go there at least twice a week!"}
{"text":"Even though the service isnt the best, the food is amazing,never disappointed. Personally i find there meal ma chang or something like that (c9)on the menu the best, you can that there food is tradition. Also there soups are yummy"}
{"text":"Do you know, how to recognize a good asian restaurant ?  When you have plenty of asians people eating there... And that's actually THE place to have a great Pho in Montréal ! I ordered a XXL for only 6.95 $.  I will come back for sure even if the place is far from downtown..."}
{"text":"I truly enjoy the food at this place.  I've been there many times in the last 5 years and it's been consistent.  I am addicted to their fried won tons.  Their tonkinese soups have a flavorful broth obviously not made from powder concentrate and they are very generous with the meat and veggies. Which is most often not the case in other pho restaurants.  They also have a good assortment of other typical Vietnamese fair like ginger chicken and the bean curd desserts.  The prices are very reasonable. The decor is simple, reminds one of a local diner a bit.  The service is fast and friendly.  The place is usually very busy during weekday lunches (Bombardier crowd) and bit less busy at dinner time.  They can accommodate about 50 or 60 people at once. They don't take reservations."}
{"text":"The service was the worst I've experienced in a long time! First they got my appetizer wrong, then our food came after the whole restaurant had turned over and a new batch of customers had been got their food - even after we asked them twice where our food was. Then they got the main course wrong. It could've been worse- they could have spilled it on me."}
{"text":"Recently renovated, so it's much nicer than the old green benches.  I usually like to get the rice with meat dishes here. The meat just seems to be fresher than some other Pho places. #29 is my favorite which is rice with chicken and beef.  Chicken was tender, not over cooked and the beef was amazing.  There is nothing wrong with the Pho soup here, it's just I don't like the grilled meat at other places so I go for it here.  Prices have gone up as tax is no longer \"included\" in the prices.  Parking is a bit tough, there are only a few spots in front of the restaurant, public transit is a 10 minute bus ride  from Cote Vertu metro station.  Good sized restaurants, even for larger groups.  Service is decent, food came in a reasonable amount of time.  The Friend bananas took an eon though, so order it earlier...but they sure were yummy."}
{"text":"I love this restaurant, I use to live 300 ft( 100 metres ) from this fantastic restaurant, I give it five stars, I have eaten there over 100 times, I tried the whole menu, it beats all other vietnamese restantants ( except the other one owned by one of the sisters of the manager ), you will never be dissapointed @t this restaurant.    Jadore ce restaurant, jhabitais @ 300 pieds ( 100 metres ) de ce fantastique restaurant, je lui accorde 5 etoiles bien meritees, jais mange des centaines de fois @ cet etablisement, jai essaye tout le menu au complet, il est de meilleure qualitee que tous les autres restaurants que j ais pu essayer( excepte que je n ais pas essaye 1 des restaurant dirige par une des soeurs du proprietaire ), vous ne serez jamais desappointe de ce restaurant."}
{"text":"I ate pho multiple times on my trip and this place was the best. They have awesome lunch specials that come with spring rolls and a tea.   The pho broth is flavourful and it comes with the authentic side plate of veggies and herbs.   It gets busy during lunchtime so beware. Street parking is limited but you can park for 1hr free at the plaza across the street. The grilled chicken is tastier than the beef which I found to be too thin."}
{"text":"I used to work at a manufacturing company right on Trans-Canada (beside the IKEA). There was nothing around for food if you had no car. And when you did have a car, you had just enough time to go to Place Vertu's food court -- Miam, the options!  Anytime we had a good day, my boss Nana would yell dirty soup. I was new there and had no idea what dirty soup was but it didn't sound appetizing by any means.  Well, dirty soup was Pho. And dirty, not because of the colour of the broth nor the cleanliness of the place, but the fact that the soup would often stain my boss's designer dresses from all the splashes.  It's good. The name is hilarious and their logo has the Eifel tour. Such an ironic image for the Vietnamese to pay homage to their colonisers. Regardless, it's a great spot for your dirty soup cravings.  Bonus: They serve iced tea when you come in which is nice."}
{"text":"I'm only rating 1 star so that it'll show up on the ratings, if I could rate in the negatives, I would.   I've been to this restaurant before, and while the first couple times it was okay, it was never impressive. I always get Pho Ga (chicken noodle soup), which is okay but not out of this world, still it's a quick fix for Pho when you don't want to make it yourself.  My bf and I usually go to Asie Moderne which is right across the street from Paris Pho, but he'd never been to Paris Pho and we were in the mood for something different, so we decided to head there instead. Worst.mistake.ever!  I hadn't gone to Paris Pho since they changed their sign, I remember the food being fresh in my previous visits. This was not the case this past Friday (May 2nd 2014).  I ordered the Pho Ga as per usual and my bf ordered Som Tam (green papaya salad), so we could share, as well as the chicken shrimp pad thai and I ordered the strawberry smoothie.  The strawberry smoothie was thick, yet quite tasty, the Pho Ga was lacking flavour but at least the ingredients were fresh. This did not seem to be the case for our other orders. Both the som tam and pad thai were disgusting! They both reeked of rotten fish and tasted no better. The chicken and shrimp in the pad thai both tasted spoiled and even the noodles seems to be infiltrated with the smell of rotten fish. What was supposed to be green papaya tasted more like shredded fennel and the spoiled fish taste was over-powering. It was our worst experience ever!  We've both had Som Tam/Som Tum before, (never as good as the Tam Som his mom makes - which is the Laotian version of green papaya salad), but we've eaten tasty ones in restaurants before, this was not the case at Paris Pho.   We both ended up getting food poisoning. Awesome! -_-"}
{"text":"Great place for affordable food. If you take the pork chop with rice, the plate is huge and extremely delicious. I prefer their grilled meat in pho , vermicelli / rice. I often order their P14 which is grilled chicken and vegetables with pho (replace the chicken broth for beef broth)! I love to come here for inexpensive lunches and dinners."}
{"text":"I come to this restaurant on a weekly basis and have never had anything bad from here. Vietnamese food is like my dirty little secret.  This place is always packed to the brim at dinner time. The service is fast but not friendly, the waitresses aren't the nicest but they get the job done.  My favorite meals are the beef and ginger noodles as well as any pho. This place is so authentic at such a reasonable price point. Most dishes (which are huge) are between 9-11$.  P.s. it should put you at ease to know that 90% of their clientele is Vietnamese....always a good sign!"}
{"text":"This is by far the best asian/tonkinese soup place I've been to!!! MANY TIMES. No matter what I try its ALWAYS DELICIOUS! The duck soup is crazy, bbq pork soup crazy, spicy beef soup crazy. Even things like general tao are amazing. I try a different dish every time I go and it never lets me down. ALSO the fried bread (#7) is just the best piece of fried bread Ive had. No matter what you get here it will be good. The service is pretty bad but the food gets done quick and honestly the taste makes all the bad service and ugly decore seem like nothing."}
{"text":"Looks like nothing much from the outside ,but as a pho lover the best pho in Saint Laurent"}
{"text":"Prices were reasonable.. they have lunch specials.. and a huge variety of plate choices.. I didn't like the service much.. honestly the food was average..  My friend took a bite of her plate and thought the sauce tasted funny.. and the waitress literally told her but u took a bite already I can't do anything about it anymore.. how else would u know your food tastes a little off if u don't take a single bite??!!"}
{"text":"My family used to eat there all the time and order from there but we've finally stopped. Just so that everyone is aware: the servers do not get any tip; it all gets pocketed by the owners.  The last time we were there, we took our family from the states there and the service was substandard so we left a modest tip. The owner's wife came out after us to demand more money because \"tip is usually 15%\".   Please think about it before you return to this ordinary at best restaurant."}
{"text":"Over the past year, my goal has been to discover new and exciting Vietnamese locations to eat and this endeavor has led me to create many Yelp bookmarks. Finally, I'm happy I've had the chance to go eat at Paris Pho.  From the exterior it doesn't look like much, nor does it impress when any when you walk in. The staff doesn't necessary try to cater to your needs other than the hush rush type of efficient service to get you to your grub quickly. We walked in and got immediately seated without a word. Warm tea was served to us within the minute.   Looking around, I could tell that this place was pretty popular and a lot of action was going on during lunch. I assume the Bombardier employees love coming here as their building is 2 minutes walking distance. We got our menus along with pen and paper where the practice of \"write your own order\" is expected.  We went with the lunch special #46, which consisted of some chicken and beef along with a serving of a salad, spring roll and rice. We got our plates within 10 minutes. Talk about fast.  The chicken was tasty, the beef was better. The egg roll and sauce was just right. The rice and salad were in generous portions and all in all, this meal fit the bill. The warm tea washed it all down nicely.  The price tag is very reasonable, with the lunch costing me a mere $11.  I would have given Paris Pho 5 stars but the service could have been a little better and the tea pot's snout was broken which caused tea to leak on the table whenever we tried poring it. No deal-breakers but worth mentioning.  Would come again."}
{"text":"Go to this place often. Tasty meals for a good price, prepared very quickly, plus the staff is very friendly. I once arrived early to pick up some take-out, and they offered me a newspaper and a pot of tea.  My favorites are the Pad Thai, (although I replace the chicken with tofu as I didn't like the cuts of chicken) and the beef, salad, rice plate."}
{"text":"Découvert cette place via Instagram et comme mes enfants adorent le viet nous l'avons essayé. Quelle découverte! Premièrement, j'avais peur quand j'ai vu qu'il n'y avait pas de stationnement privé, mais il y avait amplement de place dans la rue.  Ne pas se fier au look. It's all in the food. Si les enfants aiment c'est que c'est WINNER. La nourriture est goûteuse, les rouleaux sont très bons.   Le smoothie au guyave, yum. JA'dore quand on trouve des choses différentes car on a pas le choix d'y retourner.   BEAUCOUP de pick-up, ca veut tout dire."}
{"text":"I was always looking for a good vermicelli bowl in this area of Montreal. I am always happy to order the P28. The Pho is also delicious. Good prices and good quality! Service is fast and simple."}
{"text":"I will definitely go back to the restaurant again. Reasonable prices and pretty standard Pho. I ordered a fried spring roll but they came out sort of cold, which is definitely a no no for me. Imagine a cold fried chicken. However, consider the price and food I think I will go back soon."}
{"text":"For me Vietnamese is one of the essential restaurants I have in my rotation as the food for me is nourishing, not too heavy and inexpensive. Finding amazing Vietnamese outside of the downtown core however is increasingly difficult. As many Viet places here in Montreal and Quebec advertise as Vietnamese but when their main dishes is General Tao Chicken, Nid au poulet or Boeuf Basilic they are light years away from Vietnamese for me!   So on this evening my number one choice was closed for a winter break, my number two choice was closed down for good so I was close to striking out until I came here.   Entering the restaurant I noticed it was fairly busy for a Wednesday night. Good sign number 1. People seemed to be enjoying big hot bowls of what appeared to be pho (or as Quebeckers call it soupe tonkonise) good sign #2. They fact that they had a diverse menu with some Chinese options was good sign # 3 for me.   I ended up ordering an order of fried spring rolls and a vermicelli (bun dish) with grilled chicken and spring roll. Then I ordered a Cantonese chow mein and a fresh spring roll (chicken and shrimp) to go. The vermicelli was really hearty, filling and good 4/5.  Especially for the price.  The spring rolls were good but had a bit of a chalky texture to the filling.  Not sure why.  It wasn't horrible but on a scale of 1-5 I'd give them a 2.75/5.  The chow mein the next day was spot on with some seafood, vegetables and great chow mein gravy sauce.  The fresh spring rolls were surprisingly crispy 2 days after I bought them and tasted fresh and amazing.  Peanut sauce was perfect in flavour and sweet and saltiness.  Decor of the restaurant isn't your fine dining but I'm okay with it here. Service was friendly but I'm certain if it's busy here service could be a bit neglected.   One word of caution  it's across the street from the big Bombardier plant so lunchtime I'm told is very busy!    Price is your very reasonable Vietnamese inexpensive. I love it! So for me all wrapped up it's a solid 3.5 stars that I'll bump up to 4 stars because they we cordialy friendly on my first visit."}
{"text":"3.5/5  A quick search on Vietnamese restaurants brought me to this little joint in Saint-Laurent. Parking is on the street, though not sure if they have any parking at the rear.  Their menu is quite diverse and has options outside of Pho, including noodle soup that has a coconut milk broth which I found interesting. I had the beef stew noodle soup, while my dad tried one of the coconut milk broth noodles.  The beef stew noodle soup was actually quite good, with a lot of unique spices added. However, my dad wasn't too impressed with his coconut milk noodle soup, as he felt it was lacking in flavour. My dad also ordered an iced coffee which he felt had a really strong taste (he liked it though).  Service was poor, and we definitely felt rushed even though the place was only about 3/4 full during our time there. The server also got my order wrong when I asked for an iced tea, as she gave me a can of coke and insisted I ordered that (...no I didn't, confirmed it with the number too).  There's lots of pho/Vietnamese places in Montreal so I'll likely try some other places in the future before deciding on which one to come back."}
{"text":"You know it's good as a in food when you see tons of Asians eating there!  There is a huge variety of different salads, soups, vermicelli and small dishes.  Price is very reasonable and portions are big. Food taste good ...that's the mist important!"}
{"text":"Très GYU(excellent) ! Très bon service, belle ambiance, la bouffe est succulente ! Le waiter ayant la peau bronzée plus que les autres et des crazy pipes est gyu aussi"}
{"text":"Best Viet place I've ever been to. Their selection is broader than most other Viet places in Montreal and the quality is irreproachable. Their bo kho and bun Bo hue are especially good. My favourite is a Thai influence dish they have with shrimp and lemongrass soup."}
{"text":"Terrible cheating people. They have a card machine that doesn't work. Made me pay in USD because I didn't have Canadian dollars. I used Credit and Debit BOTH but their machine didn't work still. These people should be reported to police. Cheaters!"}
{"text":"I tried their soupe tonkinoise boeuf saignant pretty good !! Recommend it to everyone if you want a delicious warm comforting soupe and I saw their plates looked delicious too."}
