{"text":"This pub is in my neighbourhood so we stopped in for supper. The place was full but not overcrowded. It took awhile to get drinks and menus, we eventually both ordered the specials - the burger special and the daily steak sandwich special. I ordered the steak med and it came out very well done. The burger was ok. First I was impressed that the waitress brought out pop refills before we were even done our glass, without asking, then found out when we got the bill they charged for each refill. That seemed a bit sleazy. They don't have wireless debit machines so my server sent me to wait at the bar. There were six people ahead of me so it was a long wait.   Overall - the food and service is much better at other local spots so skip Partners unless you are just going for a beer and to watch the game."}
{"text":"Consistently great lunch menu! Service is friendly and efficient. Steak sandwich is a winner. Other menu items are good too. Busy place on Fridays at lunch! The makeover this place has gone through makes it inviting! Definitely recommend this place for business lunch!"}
{"text":"This place always looked a little shanty from the outside, but there was a recent renovation and we thought we'd check it out. Great experience. Food is very good , friendly staff and the owners came by for a chat. For sure we're coming back ."}
{"text":"Unfriendly and rough looking staff who has no control over the crowd.  Ordered some appetizers on Sunday afternoon - servers friends were absolutely disgusting and we're openly farting without her doing anything about it.....sums up the joint - complete mess of what has potential of being a nice neighbourhood pub."}
{"text":"The bar is low-brow and don't even think of dining there, but they have the best pizza for delivery in East Calgary"}
{"text":"I'm SO done with Partners Pub. $33.00 for a 4 topping XL pizza with NO CHEESE when your menu shows a vegetarian XL pizza WITH CHEESE for $28.10? So much for my old watering hole and being able to support local businesses.  I won't be back."}
{"text":"Well the renos are done and it's a whole different bar.  Still a few Shady McGrady's hangin around but the 20 huge flatscreens,  the new music system and pool tables are the new stars of the show.  The waitresses have cleaned up a bit, and the place now has a modern sport-pub feel to it.  I havent checked to see if the Menu has changed but considering it was the only shining star of the old Partners, then I'm hoping they were smart enough to keep most of the treasures on there.  Im giving it a 5 star rating only because I already gave it a 4 in my previous review when it was still a shithole.  Definately happy to have a decent pub within stumbling distance."}
{"text":"If you want great pizza that is not from a crappy chain then this is the place to go. The crust and cheese is amazing! Now some tips. Do not eat in! It is a dungy depressing neighborhood bar in a lower income blue collar part of Calgary.  The kitchen is clean and i suggest you only order pizza because that is what they are good at. Have it delivered and enjoy one of the best pies you will eat in this town."}
{"text":"Hey you can't beat 3 dollar beer all day! Plus free pool as well.   I come here for the great pizza."}
{"text":"Reno's nice but still frequented by rowdy's and bikers. Went there last Sat. and the soccer idiots were out in full force and no staff control whatsoever. Went to leave around 10 and 7 or 8 bikers decided to leave and block the entire driveway out of the mall revving there \"hogs\" for about 5 minutes til we could leave. Pizza very, very mediocre but ribs were O.K, fairly poor service and watch your bill for errors."}
{"text":"Total crap hole dive bar in the suburb of Ogden that just happens to have absolutely epic pizza. I wouldn't drive out here but if I'm around I know where I'm stopping for some pie."}
{"text":"We tried to eat here and the waitress told us we couldn't sit in here section because it was reserved. She didn't make sure we had some where else to sit so we left. Not good service"}
{"text":"Fancy a 5000 calorie dish full of baked cheese, meat sauce and spaghetti goodness? Then this place is for you. Add on some extra buttery garlic bread, and you will leave so full and in desperate need of a nap. Poutine is also excellent. Service was friendly and attentive."}
