{"text":"Great food and friendly service. The tatziki was superb, and my chicken well seasoned. This restaurant needs a serious makeover though."}
{"text":"We frequent the Parthenon often and I am sorry I haven't reviewed it sooner. Having recently travelled to Greece, I now feel ready to draw a few comparisons. In a nutshell, it exceeds the taste and quality of the food we experienced in Greece.

Our \"go to\" meal at the Parthenon is the platter for two. It begins with a super fresh Greek salad where  tomatoes are the feature. Their dressing is perfect and delicious. We would appreciate just a few more Kalamatas as they are doled out sparingly.
Next come the calamari topped with purple onions and lemon wedges and served with an excellent tatziki. The serving is generous and so tasty.

The main event follows with more food on the platter than the two of us can ever finish. There are doubles of each item including lamb chops, moussaka,  kebobs, Greek potatoes, dolmadas,  seasoned rice and warm pitas. My mouth waters as I write this because the food is so full of flavour.

Service here can be a bit cool. Sometimes it is genuinely friendly and at other times it is perfunctory and rapid much like we experienced in Greece.
We will, however, return  for reliably fine Greek food."}
{"text":"November Challenge - 1/30

What happened to this place? The whole time I was here, I felt like I was on an episode of Kitchen Nightmares. You know, that part in the show where Chef Ramsey asks them \"WTF is wrong with you?\" And the owner folds her arms, clucks her tongue and says nothing is wrong with the food, yet wonders why no one is there. Meanwhile, the \"chef\" in the back is opening up can after can after bag of Uncle Ben's, and boiling the life out of everything and liberally salting it to face sucking perplexity. Shrugging his shoulders and saying, \"yeah! I've been here for 10 years. They'll never fire me.\"

We went here because we had memories of pleasant experiences and delicious noms. But those memories quickly evaporated, after taking bites of what felt like the Senior Citizen Special. The only flavor was lemony salt; you could probably use my dinner as a flotation device. It was incredibly mushy and unappetizing. My sister commented that she had had better Greek food at Opa's. There were comments that the Calamari was salty and looked like it came out of a giant freezer bag. I had a plate of Dolmades that tasted like someone had wrapped Congee in old grape leaves. The waitress, kept irritatingly correcting my pronunciations of the dishes with the Anglicized pronunciations. Guuuuuuuuuuuuuuuuuuurl.

Dessert, which can sometimes be the saving grace for a restaurant, was straight up ROTTEN. The owner came out and apologized, and gave us a plateful of her \"personal specialty\" that she baked up herself. Her \"personal specialty\" looked like the Künefe from Istanbul Restaurant, but tasted more like head-scratchingly bitter, Microwaved Evil. To add insult to injury, the food was just as expensive as it was awful. The bill with tip, came to about $350 for 9 people. 

Eating here haunted me and my belly for two days."}
{"text":"The food was great, but this opinion wasn't universal in our group. My friend was obsessed with pointing out that the rice was \"uncle ben-esque\". I was satisfied with thier food and thought thier 3-dip pita appetizer is one of the best I have tried so far. The price wasn't cheap, but it wasn't ridiculously expensive either.

And heres the part where parthenon looses 2 Olympus sized thunderbolts out of five. I ordered a chef's tasting menu which consisted of 4 items- apetizers, main course, and dessert. I recieved a salad and sausage apetizer, along with a lamb main course. But, no dessert...

Why didn't I get a chance to remind the waiter about the dessert? Because I didnt' get a chance to. This place closes at 10 and we arived at 9. By 9:45, the guy was hovering over our shoulders, grab-assing any plate he thinks is empty. By 9:50, he gleefully plops our bill into our table with a big greek smile on his face. 

We took the hint to get out and pay. I took a look at our bill and my chef's tasting menu was specifcally keyed as \"4 course menu\". Remembering that I only had 3 courses factored into my descision to skimp on my tip. But our buddy of a waiter was too lazy to break down our bill even when we requested individual that when it came for my friend to pay his part, he asked for more tip. Im sure he would've have demanded more if he wasn't so eager to close the place down and the F*#$ out of there.

Honestly Im a stickler for service and would easily drag this down to a one, but the DIPS were amazing I had to give it a star for each dip. Lesson in this story for would be restauranters....expected to work half to one hour later than your closing time and don't cattle prod your customers out the door before closing time!!"}
{"text":"I've been to quite a few Greek restaurants and this is a favourite of mine now.  We went for lunch and I had the calamari plate.  It was huge!  The Greek salad was terrifice, with good dressing, bite size chunks and lots of fresh Feta.   Our Waitress, probably a veteran of the restaurant was excellent with attentive but not hovering efficiency.
Its not a huge restaurant and the decor is early 1970s Greek, but again, the food is what you go for, not the decor.   If I were to go there with a large group, I'd let them know in advance and see if we could pre-order.  
  I love the after dinner 'ouzo' candies our waitress gave us sevearl extras to take to our friends back at the office.  We will go back again for a satisfying lunch.
The only issue I have is the parking.  It's a small lot and fills up quickly.  I don't mind walking from another parking lot but on Fairmont at that corner there just isn't that much parking!"}
{"text":"This is a realy good famiy run place.  The prices are fair and the portions are big.  The decor is authentic and the service matches.

Check this place out!"}
{"text":"Gyros Pita with Village Salad and extra tzatziki!

Parthenon has been a staple at our office for YEARS.  We are never disappointed walking in the door at lunch time.  The potatoes are delicious, the gyros pitas never disappoint us, and who doesn't love that lemony-greek-style-rice!

Service is always fast and with a SMILE (surprisingly, that's a big deal in Calgary these days).

It has a small, homey feel to it that makes you feel comfortable, without going overboard.

I wouldn't come here on a fancy date or for a formal evening affair, but for a tasty lunch that never fails to deliver, it has more than done its job.

Fantastic food, fantastic service, and smiles....what more do you want?"}
