{"text":"La Passione is a dimly lit and intimately decorated restaurant on Yonge, just south of St. Clair, where you can get your fill of any and all your Italian favourites and a (huge) glass of wine. Their extensive menu holds everything from Calamari Fritti, Insalata Arugula, Papparedelle al Salmone and Penna alla Vodka to Gnocchi with a choice of four sauces, Pollo alla Jolly (chicken in rose sauce) and Margherita pizza (a simple delight of mozzarella, olive oil and oregano).  La Passione balances the traditional with some modern comforts; you can peruse the thorough and interactive website and check out their Facebook page, then go and grab a classic white-clothed, candle-lit table and dip your focaccia in olive oil and balsamic before ordering gluten-free or whole wheat pasta.  The atmosphere is warm and inviting and, as I found out while waiting for my dinner guests who were running late, it is a very comfortable space to sit and relax with a glass of red.  From start to finish, it was delightful. For such a moderately-priced Italian restaurant, they surely hold their own.  I was ecstatic to find that my penne side dish with the Pollo alla Fiorentina - chicken sautéed with spinach and sun-dried tomatoes in smooth and rich cream sauce - could be replaced with tender gnocchi. I truly could eat pasta every day, but gnocchi is my new favourite indulgence. I'm on the hunt for the best in the city and will devour any potato pasta nugget that comes my way in the process.  The veal Marsala entree is adorned with tons of sautéed mushrooms, the vegetables were cut large and almost put the roasted potatoes to shame; it was true Italian comfort food. And as for the Papparedelle al Salmone, the wide threads of pasta are covered all over with a pink Salmon-infused cream sauce. Rich and smooth, this was definitely the star of our table.  Personally, I can't go to an Italian restaurant that has Tartufo on the menu and not order it - no matter how full dinner has left me. A few flavours are offered, but I finally landed on Tartufo Royale, a tart and sweet pairing of raspberry and chocolate ice creams covered in cocoa and drizzled with chocolate sauce. I also happened to snag a scoop of pistachio gelato, but it didn't hold a candle to the aforementioned chocolate indulgence.  La Passione was a nice surprise, with entrees coming in around $15-$20 and a wide-range of choices on the menu, it is sure to satisfy. They also occasionally post deals on Groupon - it makes for the perfect opportunity to get out and try something new."}
{"text":"I didn't have a good experience here.  The food was mediocre at best... and the service was horrible - in fact this was probably the worst service I have ever experienced at a restaurant.  Everything was average up until the time we wanted to leave.  I wouldn't describe us as being overly impatient but this stands out as absolutely horrible.  We asked 3 different people at least 5 times for our bill after waiting 30-45 minutes after finishing eating.  Each time they ensured us it was on the way.... but nothing.  When we -finally- received the bill there was no apology for the delay.  I wouldn't go back or recommend to anyone."}
{"text":"I've been to Passione about 3 or 4 times.  The first time we were here I had the fettuccine alfredo and it was amazing.  We went back a few months later and it was really bland.  The last time we went was because we had a coupon from Groupon (or one of those group buying sites) and decided to give it one more chance even though we said we wouldn't go back.  I had the pizza and my girlfriend has something with shrimp in it.  We were both disappointed again and probably won't be going back.    The staff are excellent and the decor is really nice it's just that the food is kinda bland and with so many italian options in this area i think i'll spend my money elsewhere."}
{"text":"Fantastic food and really good service.  We love ordering from them.  The food is amazing for the price and the people who work here will do their best to make you happy.  Would recommend any day of the week."}
{"text":"I have only ever eaten Passione's food because we use orderit .ca at work and they are frequently one of the options (there are usually about 3 options), an option that I try to avoid like the plague because of all of my terrible experiences. Unfortunately last night the options were Passione and Peartree, which in orderit land is like choosing between syphilis and gonorrhea; last night I went with syphilis.   I ordered the item (a sandwich and can of pop) that seemed the least complex because I know that the only things Passione excels at are screwing up your order and making bad food. Well they didn't deliver the pop, nice work, and the sandwich was wilted and uninspired, but was at least edible.   I am giving them the benefit of the doubt (i.e., two stars rather than one) only because I figure it has to be better to eat in the restaurant and some of the blame falls to the delivery process."}
{"text":"My husband and I came here for breakfast. At first we thought it would be a good experience, since our server came to take our order quite quickly. Then, the following things happened:  - I asked for a half order of the eggs benedict. The server stared at me wordlessly for a while, then said, \"It will be the same price.\" (Well, obviously.) - When our food was brought to us, the woman who brought it insisted my husband's breakfast didn't come with toast, and was still in disbelief even after my husband pointed to it on the menu. - I didn't get any extra hash browns to compensate for my missing eggs benedict half (in every other restaurant I've been to, they always add something extra). - Our coffee was never refilled. - Nobody ever came to ask us how we were doing. - We waited 20 minutes for our bill, after our plates had been cleared. After we finally asked our server for it, we waited another 10.  One of these things, on its own, would not a bad experience make. However, cumulatively - thumbs down."}
{"text":"We were first introduced to this place via Groupon and loved it, so when the next set of Groupons came out we bought a bunch. However, the other few experiences we've had there have been less than ideal, so once we've used up the rest of our Groupons we're calling it quits with this place.  My partner has a wheat intolerance but loves Italian food, so when we saw La Passione offered gluten-free pasta, we were ecstatic - it's notoriously difficult to find places that will cater to gluten-free dietary restrictions. Unfortunately, staff seem to be unaware that 'gluten free' is on the menu, and when they do, get hung up on the name of the pasta and make things confusing:  (e.g. \"I'll have the penne alla vodka, but can I get the gluten free pasta?\" \"OK\" [ten minutes later] \"We don't have gluten free.\" \"Your menu says you have gluten free pasta!\" \"Yes, but only fusilli. You can have the penne in whole wheat.\" \"I can't eat wheat. I'll have the fusilli then.\" \"OK; you want the gluten free or whole wheat fusilli?\" etc.) People with this dietary restriction would also be well-advised to call in advance to ensure they have a gluten-free pasta that day. Last time we went, there was no gluten-free pasta (but the waitstaff took our orders and didn't return to tell us that until the other entrees were arriving). The kitchen staff were willing to substiture the pasta side in an entree for a measly amount of roasted potatoes instead.  Dietary restrictions aside, the pizza and pasta here are tasty; entrees a little less so (the side of vegetables and potatoes is a little bland. Waitstaff, at least the waitresses we've had every time we've been there, are unfriendly, disinterested and even come across as snobby (e.g. correcting pronunciation of Italian words; answering a question about the dish with \"you should have read the menu\").  The restaurant itself isn't a 'bad' place; for someone without dietary restrictions it's tolerable. The main problem is La Passione touts itself as offering gluten-free options, but the waitstaff are so unfamiliar with what this means (\"we don't have gluten-free; would you like whole wheat?\"), and the actual availability of gluten-free options is so spotty (you can only get fusilli, and that's if they have it at all) that it really makes it difficult to enjoy the place."}
{"text":"I have only had takeout here so this is a review of the takeout.  Timely, well packed, generous portions.  The jumbo ravioli was very large. Only 4 of them to my order. The tomato sauce was basic but tasty. The gorgonzola gnocchi was tasty though maybe contained a little too much cream. Less cream would ahve allowed the gorgonzola flavor to emerge more.  Overall solid Italian food without fanfare."}
{"text":"I love this place! The food is excellent and the service is great. I go there semi-regularly and they recognize me and ask me if I want my 'usual' (what can I say? I LOVE their pollo a limone).  It is my fave place to take people from out of town and the only complaint I ever heard was from someone who wanted ham instead of Canadian bacon on their Eggs Benedict (though the menu clearly stated it was bacon).   One night when I was feeling crappy I ordered delivery from them. Not only did it arrive in less than 40 minutes it was as excellent as it is in the restaurant. Heck, I even heated up the pasta a day later and it was still wonderful. Lovely!  This is the epitome of fantastic local neighbourhood restaurant. Excellent food, friendly folk who remember you and a lot of customers having fun chatting with their dinner companions and the staff.  Bellissimo!"}
{"text":"I came here a few months back with two dining companions and a groupon.  As you might imagine, pasta was the main event.  And it was good - but it didn't blow me away.    The service was not great.  We gave them the coupon at the beginning of the meal, so part of me wonders if that was the reason.  We waited quite a while between sitting down and being asked what we'd like to order - oh, and I'm referring to being asked what we'd like to drink.  We made sure to have him take our food order at the same time.    The food came out in a reasonable time luckily, since we were hungry.  Everything was well sized, and smelled yummy.  I had a seafood pasta, and every piece was cooked properly (no rubbery mussels), and they were generous with the seafood.  It was very tasty, but I've had better.  It wasn't anything special.  The service continued to be very slow while we tried to get our bill.  When we finally did, we realized that the coupon hadn't been deducted.  Which meant we had to try to get the attention of the waiters yet again.  It was fixed without issue (although he really did seem to forget that we'd already given him the coupon), and we got out of there eventually.  I should note that this was a weekday evening, and the restaurant was only half full.  There was no excuse for how slow the service was.  So, although the food was good, it wasn't amazing, and the service definitely didn't make up for it.  With so many Italian places in the city, it's hard to think of a reason to give it another chance."}
{"text":"Move over, Jewish Penicillin (aka Matzoh Ball Soup) -- there's a new cure!  It was dinnertime. I'd been fighting the flu for a few days, and was tired of warming up canned chicken soup. I needed sustenance. So, using Orderit.ca, I ordered a feast befitting a convalescing king: the soup of the day (lentil vegetable), the Pollo Alla Passione, and some tiramisu (I was hoping all the food would last me a couple of meals so I wouldn't have to call out for delivery for at least another day or two!).   Everything I ordered was excellent, and it arrived just as hot and delicious as if it had been served to me in the restaurant. In particular, the Pollo alla Passione was freaking awesome -- the chicken was moist and tender, and the accompanying veggies were freshly steamed.   Speaking of veggies, the lentil-vegetable soup was also garden-fresh and perfectly cooked -- obviously homemade, and no mushy overcooked veggies at all.   Finally, delivery was super-quick, less than 40 minutes after I'd placed the order.   I can't say that I'm looking forward to getting sick again, but I am looking forward to my next meal from La Passione!"}
{"text":"We went here last night as a result of a Groupon coupon.  Atmosphere is darkish and rather nondescript.  Incongruous gender signs on the washroom doors with pictures of Henry VIII and Anne Boleyne suggest a possible former incarnation as an English pub.  The food was generally first rate.  Bruschetta with cheese was indeed very cheese-ey and delicious.  An order of fried calamari was tender and tasty, though not amazing.  The main dishes were terrific.  Agnolotti con funghi was a mushroom lovers dream, with a pungent mushroom filling and a mushroom sauce as well.  The chicken with gorgonzola, mushrooms (guess we were is a rather fungal mood last night) and penne was also excellent.  The penne were in a sort of alfredo, while the chicken breast, which had been nicely pounded and tenderized, basked in a very rich gorgonzola sauce with a proper amount of cheese.  We were too full for dessert, but they offer a good selection at reasonable prices.  Cappuccino was first rate and a large order was really large.  Portions here are very generous.  Service was pleasant and friendly, despite a minor mixup.  This restaurant could stand a good design makeover but I'd highly recommend it for moderately priced Italian food with a nice selection."}
{"text":"They really know how to cook their Steak!  FOOD I had the Bissecta alla Griglia and wow, it was delicious! Let me start from the beginning. They first start you off with some great warm bread that you dip in oil and vinegar. The bread was so delicious I could have had the whole basket. It was so nice and warm.  My steak came with the choice of vegetables/pasta and then a salad. I ordered the steak medium rare and it came out perfectly. The steak was such a good piece it just melted in my mouth. There was just enough marble that you could taste that fatty goodness yet not too much that you would want to spit it out.  All I can say was that the cook during lunch was excellent.  PRICE I think mine was $25 before tax and gratuity  ENVIRONMENT During lunch, they have this cafeteria style area. It kind of took me by surprised. Since we were having a sit down type meal, they put us in the back in a more secluded area.  I didn't even notice the cafeteria area once I sat down.  I really like this place and would definitely go here again."}
{"text":"Came here this afternoon (Saturday) for lunch with a friend.   Located just south of St. Clair on Yonge, it was easy to find.  Looking around it doesn't seem to have too much seating, but I suppose during the week most people take-out.   I ordered the grilled chicken salad and minestrone whilst friend ordered penne pasta. The former... I can't really comment because anyone can make it. The latter, however, was deeeeelicious. Pasta was not too soft and not too hard; it was just right. What I enjoyed the most was about the pasta was the sauce!! The minestrone was also great. It was full of veggies and very filling.   On the other hand, I wasn't too impressed with the service as our server hardly came to our table.   I'll be back... I'm a fan (of the food only)."}
{"text":"This place attracts some interesting characters!  Once we were seated close to the front window (the rest of the place is quite dark), a woman reading nearby asked us if more people would be arriving at our table, and informed us that she wanted \"to avoid noise\" and promptly relocated to a \"quiet\" area. Another woman promoting herself as a public health nurse confronted my friend in the washroom, accusing her of not washing her hands properly (apparently my friend's paper-towel-ready prep was completely unacceptable).  Nutters aside, this place is quite laid back and the service is friendly. The seafood was all good, which is a main priority for me, and my friend kindly indulged me. We ordered a variety of apps instead of entrees to get a better sense of what this place has to offer.  We used a Groupon discount voucher but I didn't feel that compromised the service or quality in any way. If I came here again I'd try the pasta, but it seems like this place has a lot to offer all around."}
{"text":"I had lunch today at La Passione Italiana, which is in the 'hood where I work.  It's a cute place.  It's cafeteria-style. You go to the counter and tell them what you want. There's lots to choose from ... like veggies, salads, lasagna, linguini carbonara, fish, chicken parm, veal parm, stuffed peppers, pizza, etc. You are charged according to what combo you buy.  I had chicken parm and linguini carbonara along with a Diet Pepsi.  It was pretty good. It was just over $11 and a good portion.  I'd go back the next time I have a craving for something Italian."}
{"text":"Refreshing to find people can be friendly even if they probably wanted to be with their significant other on this V'day weekend.My friends,and I ordered take out sunday night: linguine tutto mare,steak sandwich,lasagna,caesar salads,garlic bread,fresh bread.I had the linguine tutto mare,and other than the weird little shrimp amongst the regular sized ones,it was good.Caesar was off,but everyone liked their entrees too,so people will be returning."}
{"text":"I actually work close by to La Passione and so i have become somewhat of a regular at this establishment during their lunch hours.    In my opinion, this restaurant is one of the best lunch places i have found in Toronto.  Having said that, i have not tried anything other than their lunch menu but the lunch menu is still good enough to keep you coming back every chance you get.    They have a lunch hot table which allows you to customize your lunch meal to your preference.  Usually, they have 3 pastas to choose from, 2-3 meat dishes, chicken/veal parmesean cutlets and sandwhiches, salads, pizza and lasagne.  The quality of the food is good and the quantity is great for the price you pay which can range from $7 to $10 pending on what exactly you mix and match together.  I usually try a pasta and meat dish, or maybe chicken parm on my pasta and i have rarely ever been dissappointed in my meal.    This place is not the best italian restaurant in Toronto, but if you're looking for good value, then i would definitely recommend this restaurant."}
{"text":"Used one of those groupon things here a few weeks back.    The restaurant is very cute, nice atmosphere.  Service was great and friendly.  Menu was large and had a ton of variety.  Prices were decent as well.  I ordered the lemon chicken and it sucked, very tangy and drenched with lemon.  The wine/parsley sauce didnt seem to be there, just lemon!!  The chicken was also chewy and was definitely re-heated.  My bf ordered the mushroom chicken pasta and it was decent.  Enjoyable but nothing to remember.  The bread was really good though and the desserts were wonderful."}
{"text":"La Passione Italiana's gnocchi pomodoro with pink sauce ranks as my #1 favourite gnocchi in Toronto. It is absolutely UNMATCHED in quality and taste. Super creamy tomato sauce and very tender gnocchi that's always cooked to perfection.   I have never actually been to La Passione for a sit-in meal as we always order via www.orderit.ca (they are merchants there). Highly recommended for authentic Italian food!"}
