{"text":"I do not always wrote a review but today my husband and i came across this little restaurant and we were completely impressed!! We both ordered flatbreads, the margherita and the spicy italian and both were so Fresh and flavorful as well as crispy. The owners were so caring and even freshly brewed my husbAnd and I coffee. The coffee is great, good is amazing. Definitely coming back and I recommend."}
{"text":"We went here for lunch today. Everything thing looked great. Ordered cheese ravioli, prosciutto flatbread and meatball sandwich. Everything was yummy.  Bread on the sandwich was crispy on the outside and soft inside, did not get soggy.  Food tasted homemade. Fresh ingredients. Service was excellent."}
{"text":"I ordered the prosciutto and mozzarella panini with a Caesar salad. I am originally a New Yorker and I'm very picky about good food. My panini was delicious. The salad and dressing was just the right amount and it seems the croutons are home made!   Very tasty. I will be back with my boyfriend. I am curious to try a soup next time."}
{"text":"I have eaten at this restaurant many times with many different friends, and everytime I'm amazed by how good the food is.  The cook typically comes out to make sure that you are enjoying your meal, and the woman who takes your order is very attentive as well.  I'm one who doesn't mind traveling for good food, so I can say with certainty...  This is by far the best Italian sandwich place on town!!"}
{"text":"I've come here twice and got two different sandwiches and both were two of the best sandwiches I've ever eaten. The breadbowl for the soup is mindblowingly good"}
{"text":"I love little unassuming eateries tucked away that pleasantly surprise me.  My husband and I moved out here from Chicago a little over 2 years ago, and we miss the little Italian deli's and restaurants we were used to back home.  We were running errands and found this restaurant on Yelp and decided to give it a try for lunch.    Simple little place, mostly carryout, but room for dining in.  Small, family run business.  The chef, (the owner's father) has been cooking Italian favorites for years.  The food was delicious and the hosts are a sweet and gracious family that made us feel as if we were guests in their own home."}
{"text":"Pasto di Forno is the most unsurpassed Italian sandwich. They are excellent with helping the costumer, the food is breathtaking and worth to dying for. Personally I'll recommend this place to anyone. I want to say thank you for bringing a phenomenal experience."}
{"text":"Hidden gem.  Can't believe I hadn't tried this place sooner.  Had a veggie panini and linguine with vodka sauce. Prepared fresh. Definitely recommend."}
{"text":"I usually look for good food late at night since I work really late and I was lucky enough to have found this great Italian little restaurant. I have to say this is the best fast service restaurant in Scottsdale! My buddy and I both got the prosciutto panini and were just amazed at the quality of the food and the service. The panini came with homemade potato chips and a house tomato pesto that is to die for. After we discussed our late work night to the owners they informed us of their BYOB and our food was ready when we got back! This is definitely our new favorite place"}
{"text":"The food was great and filling! I shared the Italian, brisket & Havarti, and the Caprese Bruschetta. The potato chips were excellent."}
{"text":"Tried it for the first time here today. I was blown away by their marinara spaghetti with meatball. Best Italian restaurant in town. I'll be coming back soon."}
{"text":"We came in on a lovely Saturday afternoon for lunch and we were more than delighted! The chicken parmigiana panini is ahhhhmazing. I wish I had room for a chocolate cannoli - the wait staff and (owner/chef) came out and checked in with us and offered parmigiana, sides anything we needed he said to ask. This is a great little local spot I highly recommend, don't come if you're in a hurry they do high quality at a lower volume but it's worth the wait. We came in on a Saturday afternoon and had the place to ourselves.   Thanks guys - we will be back!"}
{"text":"This little restaurant has great food.  The Panninis are very tast.   We also tried the Baked Ziti.   The sauce on the Ziti was excellent and it came with garlic bread which was also wonderful.   The panninis are reasonably priced and are quite large.     The serving of Baked Ziti was also quite generous. Would highly recommend this place."}
{"text":"Took my family here during a weekend home to visit. I saw great reviews on yelp and wanted to try a new restaurant with them. We showed up on a Saturday afternoon and were told they were out of soups, flatbreads, meatballs, and several other items (essentially half the menu). Very disappointed , we ended up leaving without ordering."}
{"text":"We went for lunch looking at their Yelp reviews. It is a cute little place in Scottsdale. We ordered Penne with Vodka Sauce, Margherita Pizza, and Kale & Quinoa Salad. I would rate Penne Pasta as my favorite following the kale & quinoa salad. The sauce was good but it had really big chunks of tomatoes on the flatbread. So it took over the taste. Overall the service is good. I would go back for their pasta."}
{"text":"Found this local gem via Groupon. The inside is small but cute...and the food is very good! We will definitely be back - and often!"}
{"text":"Stopped in for a quick sandwich.  OMG chicken prosciutto panini is amazing.   Found a new regular place to visit!   They pay attention to detail."}
{"text":"Good Panini. Very friendly stuff with great service. My only complaint is no diet drink in the refrigerator. But lemon water server is on the counter and it was good and refreshing."}
{"text":"Found this place on yelp. Very pleased. Spoke with the owner, and she explained that they make everything on site. They bake the bread, make the sauce from scratch, etc. We had a prosciutto mozzarella panini, that comes with choice of sides. I chose a house salad. My husband had the lasagne, which came with garlic bread. Both were good size portions. Reasonable prices. Both were excellent.  It's a long drive for us, (45 minutes) but worth it. We will be back"}
{"text":"If you are very hungry and looking for an authentic European style food then look for no other place than Pasto di Forno in Scottsdale.  While widely travelling we have had Italian foods everywhere.  We must honestly say that the food at this little Mom n Pop cafe is far superior in quality and taste.  If you do visit you will never regret.  Please do say hi to very youthful and down to earth chef, Ally Roman."}
{"text":"AMAZING!!! Our group had the brisket & havarti panini and pesto chicken flatbread. Fresh, fast, and fabulous!!! This family has perfected food!"}
{"text":"Great panini's! They make them in a wood fire oven and serve with a side of home made potato chips. Definitely worth a try."}
{"text":"This is a small but a great place with the most wonderful food. My husband and I went there for lunch yesterday. I had Kale & Quinoa salad (beautiful presentation) and my husband had Grilled Chicken panini. The food was outstanding. I'm a retired chef and majority of places don't meet my standards of good food. This place exceeded my expectations. It's one of the best lunch places we visited in the last few years. I'm just so excited and telling all my friends about it!"}
{"text":"My advice to others that want a quick lunch is to go elsewhere. Their menu changes often, specifically their pasta choices, which makes it difficult if you want to order ahead of time and pick up your food. I ended up ordering in the restaurant since I did not see an up to date menu online. Upon entering you'll notice a chalkboard menu. This is basically a small sandwich/panini shop. Therefore after waiting an hour (64 minutes to be exact, I'm not even kidding) for 2 paninis I was extremely displeased, Subtract One Star. You really have to ask yourself, how long are you going to wait for someone to make you a sandwich of all things? Maybe 5 minutes at subway, 10 minutes if you were to make it yourself, or 25 minutes at a restaurant; but over an hour? Ya right.   When I brought the food home and ate it, it was good, but not exceptional. I would rate the food a generous 4/5. The Salad that came with the sandwich was good, the tomato soup that came with the other sandwich was too thick and pretty much was a sauce that would have been better suited on pasta then to be served as is.   I would also just like to say that I went to this restaurant around 1:15pm on a weekday so I cannot imagine how long people wait on weekends or when it is actually crowded (there were only 2 other small groups of people there)."}
{"text":"Worth the effort to seek out this little hidden gem in  an old Scottsdale strip mall.  Order was taken at a counter from a very pleasant and helpful young lady.  My husband and I decided to share an Italian sausage panini with a side salad.  The sandwich contained a flavorful sausage, grilled peppers, marinara and melted mozzarella.  The Italian bread was fresh and perfectly toasted.  The salad was fresh with arugula, Romaine, sun dried tomatoes, black olives and a light Italian dressing.  This all sounds fairly standard of a sausage sandwich lunch, but this was exceptional! We look forward to coming back for take-out pasta soon."}
{"text":"This is a little hidden gem neighborhood restaurant. We love  everything we try here. Great service, family owned and operated restaurant. If you live or work in the area, make this a regular restaurant to patron. You will love it"}
{"text":"My fiancé and I came here last night for dinner and we are so glad we did! I've driven past this place so many times because I get my lashes done around the corner and finally remembered to come here. I skipped the gym yesterday and just wanted to enjoy a nice meal so this place popped up in my bookmarks and I convinced my fiance to come.   This place is tucked away in all the shops around the NW corner of Scottsdale and Shea and it's located next door to Aunt Abby's (my favorite place for French macarons). It's a small spot and very easy to miss so drive slow.   Upon arrival, there were a few other patrons inside. There are three small tables and 2 community tables. This is a family owned business and we met Ally and Carlos (daughter and father). Ally gave us an introduction to the menu and suggestions as well. We decided on the prosciutto and mozzarella panini and the pesto chicken flatbread. Such great choices! I felt like I made it to panini heaven! I wish I didn't share my panini with my fiance because I wanted it later last night but I ended up snacking on leftover flatbread.   Tiramisu is my favorite dessert. Unfortunately, they ran out of tiramisu so Ally was so kind to provide us with 2 cannolis on the house. Brian doesn't like sweets all that much so I was able to indulge in both by myself :)   We can't wait to come back to try more items! Especially the tiramisu and ravioli with vodka sauce! Thank you for a wonderful meal!"}
{"text":"the Caprese is the best,  also try any of their daily specials.  the soup is delicious, give them a try you wont be dissapointed."}
{"text":"This is my 2nd visit in the past two weeks and the food is so good, authentic, hand made. The chicken panini is wonderful, on a good quality ciabatta bread and it came with a side salad with an Italian lemon dressing for under $10. Nice, clean, inviting place and very nice staff with great service!  I'll be back!"}
{"text":"Very delicious and satisfying! The service was fast and friendly. Highly recommend the brisket panini as well as the prosciutto panini."}
{"text":"This little place popped up today as \"hot and new\" on my yelp feed in my area.  My husband and I decided to check it out.  Wow. Delicious.  Friendly owners were there to greet us! The place is super cute.  Great decor. Hip and trendy furnishings.  The food was wonderful.  My husband order the red bean soup, and to our surprise it came in a freshly made bread bowl.  It was soo good we devoured it.  My panini was great.  I had the spicy and it was perfect.  The bread was fresh and homemade, the quality ingredients were certainly appreciated.  We will be back for sure.  Spread the word, this place was great!! Hope they stick around FOREVER!"}
{"text":"My family and I were visiting the Phoenix area and were craving a good panini and maybe some pasta. We wanted something local and after yelping a few places decided on Pasto di Forno. Boy, were we glad we did!  The paninis were the best we have ever had and the baked ziti with homemade meat sauce was incredible. Served piping hot with garlic toast, it was maybe the best I've ever had. The flavors were perfect. It was so good that we decided we wanted it for dinner too!  So we ordered 2 more portions to take home along with a crunchy Caesar salad.   Ally (the co-owner) came to our table to see how everything was and she was so personable and nice and one could tell she was genuinely concerned that everything was to our liking.   I would highly recommend Pasto di Forno!  I am definitely going back next time I am in Scottsdale."}
{"text":"I stopped in Friday to order sandwiches to go after reading the glowing Yelp reviews and luckily this place did not disappoint.  I ordered the Italian and prosciutto cold sandwiches with side salads...wow, were these sandwiches good or what?!?  They freshly baked the bread for me and put on such fresh and flavorful ingredients.  I think this was seriously one of the best sandwiches I have ever eaten!  I will definitely be back!"}
{"text":"Cute little gem and the eggplant parmigiana special was perfect!  Tomato soup was the best I've had.  Tasty Calabrese sandwich too. Very casual !"}
{"text":"This is a really cute Italian eatery. It's teeny tiny and only has just a few tables. The food is excellent. Everything made-to-order and has a zing. I will definitely go back again."}
{"text":"I just happened to stumble upon this terrific gem!  When we walked into the restaurant we were greeted by the amazing smell of them cooking their marinara sauce.  I knew right then that the food would be amazing and it was!  I ordered the Pear & Gorgonzola salad and it was the best salad I ever had.  It was so fresh and the basamic dressing and glazed walnuts were delicious.  We also had the tomato and basil soup in the bread bowl and again the BEST!. The owner, Ally and the entire staff were so friendly and truly care about about their customers.  I'll be back very soon!!!!"}
{"text":"If you're looking for an AMAZING meal, you've got to try this place. I had the prosciutto sandwich, and it was hands down one of the best sandwiches I've EVER had. Everything is fresh and the ingredients are high quality. This spot is definitely the new hidden gem of Scottsdale. Their menu is a perfect size for salads, flat breads, and sandwiches. They even make their own strawberry sorbet. Get down here and try it!!!!  This is our new go to place to eat."}
{"text":"Had a delicious veggie panini with side salad. The sandwhich was perfectly toasted and veggies were sauteed and seasoned with great flavor. The owner is young and friendly. I will for sure return!!"}
{"text":"I initially chanced into this little gem shortly after they opened.  It's located in one of the oldest strip malls in Scottsdale (NW corner of Scottsdale & Shea).  They didn't even have a sign up yet.  I was having something done at another business in the same mall and had an hour to waste.  Their food, presentation, service and very clean newly redecorated restaurant were all excellent.  Sandwiches were warmed in a wood fired oven.   I had their Brisket & Havarti Panini and it was the best Panini I've ever had, which is saying something because I love Panini.  As I was ordering I mentioned my disappointment they didn't offer a \"side\" salad because I wanted one but not as a main course.  I was told they just opened and their menu was at this point a \"work-in-progress,\" but she felt a side salad was a good idea.  They immediately added a wonderful tasting little side salad for me (for a very reasonable price).  Their Panini came with what they call Chips and a Sauce (both homemade).  The chips are made from red skin potatoes, deep fried (I think) and are thick.  The sauce was outstanding; I wish I could purchase this in quantity to take home.  The photos I'm attaching include this sandwich with its included sides and the added salad.  I had their free \"Lemon & Cucumber Water\" that was available in a dispenser on the counter.  I was really impressed.  A couple weeks later I took a friend with me for my second visit.  I was about to reorder exactly what I previously had but knew I needed to try something different.  I ordered their Calabrese & Provolone Panini and it was just as good as my first selection.  My friend had their Grilled Chicken Panini and raved about it (another Panini lover who happens to be from the Mediterranean region).  This time we had our included side as a salad instead of the chips.  I didn't take any photos, but should have.  I will return soon and take more food pictures.  I overheard the owner tell another customer they were a BYOB but you may want to double check that.  They are a bit pricey but not for the high quality ingredients they serve.  BTW, I knew nothing about this place when I initially walked in.  I am not a friend or family member.  I don't always give such a complementary review, as you'll see if you check out some of my other reviews."}
{"text":"Have been here a few times, their paninis are very delicious and the ingredients are great. Only setback to this place is that it is a little on the expensive side. The paninis will average at about $11-$12 before tax and comes with home made chips, a salad (i think), or a side of soup and drinks are around $4 non alcoholic so you'll be looking to spend up to $20 for your meal. Definitely fine with going to this place once in a while, they could really use more customers! They are located next to Abby's so you can get some nice pastries afterwards!"}
{"text":"Yelp directed us here, and we are so glad it did. Amazing! They are such friendly people and their food is to die for! Meats melt in your mouth and the fresh Caeser salad is so refreshing. Minestrone soup is out of this world. Don't pass up the opportunity to eat here! Would have given 10 stars. Make sure to get the tiramisu, you will love it. Best we have ever had!!"}
{"text":"I can't even explain how tasty their sandwiches are! The Italian and the chicken panini were amazing as well as their potato leak soup! Will definitely be returning for the food as well as the excellent and friendly service!"}
{"text":"This is a POSTAGE STAMP sized Italian Sandwich Shop. It's so small there isn't a public restroom. They only have three two top tables and two smaller community tables. Everything they serve is made in house. The specialty of the house are their Paninis on their unusually GREAT HOUSE MADE BREAD. The most popular Panini is the Grilled Chicken but the GEM Panini might be the Calabrese and Provolone Panini. This is a casual order at the counter type of restaurant. The interior is clean and modern. I DO WARN YOU everything is fresh made to order so it takes a while for your order.  I tried the POPULAR Grilled Chicken Panini and picked the house salad for my side. The chicken was good. The filling was sautéed peppers, onions, sun-dried tomatoes and they put this pesto kind of oil on the bread that added great flavor.....The sandwich it's self was very good but the star of the Chicken Panini was THE INCREDIBLY GREAT BREAD. You just don't find this bread in Arizona...It's like the Italian Breads most places back east use. The bread was excellent. My salad was so pristine fresh. It was obviously fresh cut to order.  My husband had the Calabrese and Provolone Panini with Caesar Salad. He said the meat was  really really great! One of the best spicy salami he's had anywhere! He also said the temperature on how it was served was just perfect....not hot but warmed perfect for the best taste and textures. He couldn't stop talking about how great his sandwich was and he also enjoyed the really great bread! If he was writing a review on Yelp he said he would give this place FIVE STARS! He said he could eat here every week!  The food certainly is above average and or OUTSTANDING and very reasonably priced for the portion and quality......but you will wait for it.  4.5 stars"}
{"text":"The food is outstanding. We had broccoli cheese soup, my 7 yr non-broccoli eater loved it. The brisket and havarti sandwich on great bread is a sure fire winner.   Pasta and red sauces with a meatball is a little Person crowd pleaser for certain.   Keep this little gem open. Stop reading this and go there. Seriously go now!!"}
{"text":"Pricey but pretty good. All fresh and authentic Italian fare in a small space tucked away in mid town Scottsdale. I enjoyed my sandwich but not likely to return due to high prices."}
{"text":"Great new restaurant. Sandwiches are super tasty. Such fresh ingredients and great crusty bread. This is my new favorite place in Scottsdale. The owners are caring and hands on. Give them a try you won't be disappointed!"}
{"text":"This restaurant is going places. Food is amazing. The staff is really nice. Puts you in a good mood. The design of the restaurant is beautiful Definitely worth going."}
{"text":"What a joke! Every single reviewmust be from friends and relatives I had lunch there one day last week.i had the salami and Provolone.it It was just fair. Nothing special yet it was $11. It is a horrible location.they unfortunately will not be open for long. I. Wish them luck. But.........   I went back on Saturday and gave this nice little place another try. His time I ordered the italian sub. Wow it was really delicious. I'm glad I gave it a 2nd chance.you will do great. Keep it up.        Dear Carlos- please read the re review. I said it was Delicious!! What's the problem?? It was like an Italian sub. I'm trying to be nice. I was a bit harsh on  my 1st review."}
{"text":"Thank you Groupon. This place is fabulous. I had the Italian and wifey had Havarti Prosciutto Panini. Both delicioso!  Had Pear Gorgonzola salad, pears were ripe and the dressing was the perfect combo of sweet and tangy. Potato side soup was hot and excellent also, very comforting. We will be back."}
{"text":"Wife and I came here today for lunch randomly after seeing it on yelp. Small place but well decorated with friendly helping staff. Ordered a brisket and havarti panini, Italian and caprese bruschetta. Total came out to be about 35 bucks which at first seemed a bit pricey. The food however was amazing with fresh flavorful ingredients. Meals come with choice of soup salad or home baked potato chips (amazing). Highly recommend for your next lunch."}
{"text":"Looking for a quick local lunch after we drove down from Sedona. Saw the good reviews on YELP so decided to check it out. Don't give up on finding this place! It's tucked away in the corner. I tried the prosciutto/ mozzarella panini. Watched it being prepared with love. Delicious crusty bread, meat, cheese, roasted tomato and red onion. I don't even like red onion but it was perfect in this sandwich! One of the owners offered us complimentary cucumber/lemon infused water. Keep the business coming for these folks- I don't think they'll disappoint!"}
{"text":"I came here for lunch today and I'm so glad I did! The girl who greeted me and took my order was a delight and helped me decide on a sandwich, the spicy panini, which was AMAZING. So flavorful & perfect amount of each ingredient. When they brought me my order she apologized for the wait and included two mini cannoli for free which I thought was so sweet. The food wasn't fast but i definitely didn't have a problem waiting(which wasn't long at all imo) and wasn't upset at all as I could tell from looking around it was going to be worth the wait. Great food and great customer service, no reason to not go back!"}
{"text":"Ok, their bruschetta is absolutely delicious, it's not so thick that you can't bite through the bread. Fresh and tasty, more of a lunch place really. My daughter loved the cranberry chicken panini. I wish they had wine but, alas it was not to be."}
{"text":"Fantastic food. Great local family owned restaurant. All fresh made. Favorite are brisket sandwich"}
{"text":"PANINI GOLD!! Yelp you did me good on this one!!  Came here on a whim after searching places to grab some food in the area.  So glad I found this place!  I will say it is a little hidden, in the corner spot off mercer.  The place is small so I would recommend calling it in or using the order ahead feature on yelp.  I ordered the prosciutto and mozzarella panini with added arugula with the side salad.  The side salad is a great simple light salad. The panini it self was so flavorful and the bread perfectly crispy yet soft.   Easily one of the best paninis I have ever had.  10/10 would recommend!"}
{"text":"Best place and best Italian food ever. Menu is really thought about and service is on point. Food was very tasty and the little water jar dispenser on the counter was a very nice touch. They are open till late which is a great plus. Definitely to tell your friends and keep coming back to this place."}
{"text":"Just had lunch at Padilla di Forno and I am hooked!  The prosciutto panini is the best I have ever had.  The side salad is fresh and well-balanced.  Will definitely come back."}
{"text":"If you're in the Scottsdale area this is the place to go for Italian. Was looking for a new place to eat near my work and happen to see this on one of the food delivery apps and the main photo looked too good to pass up.  I got their Chicken Parm Panini and my boss got the Grilled Chicken Panini. These come with a side and we both got salads. Both the panini and salad was good and I'm not to fond of salads.  The restaurant is tucked in this little shopping center that never even knew existed and is a small diner itself. It's family owned and the owner is a very sweet lady.  I'm looking forward to trying more of their menu next time."}
{"text":"Seem to be still working out a few kinks (I.e it took about 25 minutes to get our and sandwich cup of soup and they had run out of the chips) but the food was really good and the owner was so friendly! Cute decor and a great little find! Would come back again for sure!"}
{"text":"Fabulous little place.  I've eaten here 4 times in the past few weeks.  Panini is outstanding, try the prosciutto/mozzarella or the brisket/havarti.  Get the soup for a side as I've had two and both were great.  Charming owner has me pulling for this local family place to make it.  Try it, you will be glad you did."}
{"text":"This is a great little Italian cafe with lots of homemade items.  Now open for dinner as well as lunch. We had the lentil and soup with prosciutto.  Yummy on a cold night!"}
{"text":"My 10yr old son and I happened to be in the area for a Legofest and we found this restaurant on YELP.   Let me first begin by saying the owner and staff were the best.   This is a family owned restaurant with high touch experience.  They can adjust the meal for your taste as they did for my son.   He can be picky but he absolutely loved Pasto di Forno.  I had a panini and my sone had some Penni pasta.  Both were excellent, made with fresh ingredients.   You can tell,  everything we had was made in their kitchen.   That's the best way to describe it,  fresh ingredient Italian food.   They offered us a sample of their ministronni soup and it was the best I've tasted.  I eat soup often, but rarely have ministronni.  However,  this was the best tasting I've had.   To finish the meal we shared a tiramisu and it was excellent.    Give this family owned restaurant a try and let them impress you."}
{"text":"Just ate here for the first time and have to say I'm obsessed. Ally (the owner) is an amazing young chef with a passion for people. If you're looking for a local spot with a lot if potential.m, this is your place!"}
{"text":"Best panini I've had since moving to AZ from the Bay Area. Prosciutto, mozzarella, tomato yum!"}
{"text":"Very friendly cashier, no rushing me. Great homemade corn chowder and a meatball sub , so so good."}
{"text":"Pasto di Forno is an largely-successful American imitation of an Italian sandwich shop.  In an informal surrounding you are offered a menu board of about a dozen cold or grilled sandwiches, as well as a few pastas and salads.  A small standup cooler has a few sodas and bottled water.  Unlike its Italian counterparts, Pasto has free lemon water as well.  You order at the counter and they bring the food to your table - if you can find one open.  The key to authentic Italian sandwiches is the bread, which should be crisp on the outside, flavorful, and not too heavy.  Pasto's is.  The filling should be fresh and of high quality.  Pasto's is, but in this respect Pasto differs in that they use much more meat then you usually find in Rome.  Pasto also gives you a side dish (salad, soup, or chips - the minestrone is special here).  In summary, the sandwiches are terrific.  The only drawback to Pasto is the price.  A typical sandwich is $10 or even a bit more.  Whereas sandwich shops in Italy tend to be inexpensive, Pasto goes in the other direction.  You can sometimes get a discount deal, such as at Local Flavor, otherwise you may resent the bill just a bit.  It won't stop me from coming back, however."}
{"text":"Was out running errands with my boyfriend and our little one and looking for a place to pick up sandwiches from. Boy am I glad Yelp pointed us here! This place is easy to miss - it's at the end of the strip mall on Mercer Lane, just off Scottsdale & Shea. We only stopped to pick up but the ambiance was clean, re-done and a perfect spot to grab lunch. We used the \"Order Pickup\" button through Yelp and placed an order to grab on the way home. The convenience alone was reason enough for me to consider writing a review, but as soon as we got home and took a bite I knew I owed this place a rave write up! We got the grilled chicken panini and the prosciutto mozzarella panini and we're in total agreement: these were hands down the BEST paninis we've ever had. They each came with a side salad and the dressing that came with it was delicious! I'm not a salad person and I ate my entire salad because the dressing was that good. Our meals were the perfect portions for lunch and I can't wait to try this place again!"}
{"text":"Best panini in Scottsdale!! Great prices. Great people. Great atmosphere. And it's BYOB what else can you ask for! Amazing food 5 out of 5 highly recommended place and it's open late!"}
{"text":"We have always enjoyed this neighborhood gem. The food and service is always consistent. I haven't had food I didn't like yet. Try the cannolis. You must try it!"}
{"text":"Absolutely fantastic!  My wife and son shared the proscuitto flatbread, which was excellent!  My son also enjoyed a cup of the minestrone soup.  I had the grilled chicken panini.  That sandwich was hands down one of the best things I have ever eaten!  I highly recommend this place.  A total hidden gem.  We will definitely be back."}
{"text":"This is a neighborhood gem!  It offers tasty paninis and fresh salads, and the pizzas are great too.  Everything we tried was great!"}
{"text":"This tiny little spot on Mercer Lane does not disappoint. First the staff is super welcoming and friendly. The menu is quite varied with a combination of cold and hot sandwiches, salads and flatbreads. I was the only one there at mid afternoon which is understandable.  I tried the prosciutto panini which came hot off the press with house made tomato pesto and potato chips. The bread was warm and crispy and was quite filling so I ended up taking the rest home. I also had a taste of a flatbread which was kindly offered on the house and I thought that was a very nice touch.   The prices are in line with the high quality of the products and service offered. I wish Pasto di Forno much continued success! Ci Vediamo!"}
{"text":"Wow! Talk about incompetent and mismanaged! I don't know what everyone else experienced, but here's my trip here:  I called at 12:06 pm today to place an order, the first item I found on their website, the chicken parmesan Panini, I was informed they no longer have. I told her I was going to call back and order food once I looked at the menu again. I called back a few minutes later to order a grilled chicken sandwich, (no tomatoes, onions or peppers) with a side of marinara and chips. It should be mentioned that the girl on the phone chuckled at my order. Really?!? I was also ordering my coworker a margarita flatbread. I confirmed that the Groupon I had would be no problem and told it would be 20 minutes.   I arrived at the restaurant 30 minutes after placing the order to be told by the girl at the register \"Oh, yeah your order's not ready. It will be another 20 minutes.\" Are you serious?!? I just left work, took my lunch to come pick up this food and you're telling me that you've not even made it even after an additional 10 minutes? She offered no real apology, only excuses that flatbread takes a while and the chicken can be done in 5 minutes. Well then where's the chicken and since when does flatbread take a while? That's an appetizer on a lot of restaurants menus. Just unprofessional. She offered nothing for the time and money it took for me to drive there, lose my lunch, use gas. Just told me to come back in 20 minutes. When I said something about this being my lunch, she asked if I worked nearby, I told her yes and she just shrugged. I will take my hard-earned money elsewhere as it's clear this place does not care about their customers or making right when their employees royally mess up. Steer clear!"}
{"text":"Excellent casual lunch in a small sandwich-shop style restaurant.  The owner puts great emphasis on quality by using only the best, fresh homemade ingredients.  The panini sandwiches are delicious and filling.  The  homemade minestrone soup is very tasty.  The flatbread pizzas look great to try.  We will be back again!"}
{"text":"Unlike the other reviewers, I'd say this place is slightly above average. I had mushroom soup (tasty), turkey panini (average) and an americano (average). The inside is cute and clearly brand new, staff was young but friendly enough, and turnaround was pretty quick. I will say that it's clear the girls working there were putting forth an effort to deliver quality, I even saw the girl behind the counter working to make sure the presentation was nice. A for effort, but B- overall in comparison to some of the other cafes out there."}
{"text":"Just had a wonderfully fresh and refreshing strawberry sorbet while waiting for my itallian sandwich to go order.  Just awesome. The Italian sandwich equally awesome and fresh. Top notch ingrdients. The side sauce and pickled vegetables i enjoyed too. Oh, and it came with fresh potato chips.  Great friendly service too.  Place is small but it's bright, clean friendly place. Don't miss out..check it out."}
{"text":"So glad we tried Pasto Dr Forno- amazing brisket and cheddar brushetta.  Cute décor. We'll be back!"}
{"text":"We had a variety of foods from the prosciutto flatbread to their lunch special today of cheese ravioli and meatball sandwich. OMG sooo good! Crusty bread, great flavors. We'll definitely be back again for lunch...with more people."}
{"text":"Stopped by here a couple weeks ago with a buddy and was very impressed. Wonderful panini's and pizzas. Look forward to stopping by again soon."}
{"text":"We just had a delicious lunch here. I had the three cheese ravioli with alfredo sauce and a little marinara. Prepared fresh  - highly recommended."}
{"text":"Best italian sandwich Ive had in Arizona, (formerly from NJ/NY). Small family run shop. Food was delicious, the bread was cooked to perfection, the meat quality was very high, and salad fresh. Small select menu, for a small restaurant. They'll probably outgrow this location soon, so get it while you can."}
