{"text":"The staff was awesome, the atmosphere is superb and the dancehall/reggae playing all night was fantastic. The place can get loud, so if you're looking for a quite/quaint restaurant, this definitely is not the spot. Parking was hard to find too but luckily we found a spot on a side street. I really wanted to like the food here but we were severely underwhelmed. Majority of the dishes were over powered by ginger and oyster sauce. If you know what great Jamaican or Chinese food tastes like, you will be disappointed here. I appreciate the concept of fusion food but they definitely missed the mark.  There was a lack of seasoning and a lot of garlic, ginger and oyster sauce in every, single, dish. The scallop/shrimp ball was good... The fried chicken was OK. OG fried rice was disappointing because who doesn't love chicken fried rice! The water cress in the Jerk Chicken chow mein through off the taste severely...there was also barely any chicken in it and a lot of mushrooms in the chow mein. Drinks were small but good. Definitely a place to try, but if you're looking for great Chinese or Jamaican food... there are hundreds of other places in Toronto that would satisfy that craving to be honest."}
{"text":"This place is tres AWESOME!   It's a new restaurant that is a Chinese + Jamaican fusion with a new fun twist that is delicious!    The staff are so nice, they all work as a team vs set tables so everyone checks up on you and it is more 4.5 star rating.   The food was ALL so yummy! I got the Yardbird special $32 (set for two can dine with 4 dishes) and Jamaican Patty Double Down (a little excessive for 2 people but I just HAD to try it )   First came the OG fried chicken .. Finger lickin' GOOD. The watermelon mint was divine. I was less of a fan for the pickled side, was too much for me. Then I stopped at half my chicken cuz I needed to try the Jamaican patties first. It a little hard to share. My mouth was kinda building a fire with the heat but can't stop now, so hungie!!!   The jerk chicken was done so nicely. Chicken wasn't dry! The fried rice was a little too greasy for me but once on a while it's okay right?! It had red Chinese dried sausages in it, yum! The slaw was a nice mix for all that oily goodness.  I went on a Saturday early evening and sat at the bar. I called beforehand on my way there to make resos but they weren't taking any at that time. They didn't have a wait and had one more table open. It's a little weird because I got there and ballpark only 20 people were there with like half the restaurant filled. Other half are table reservations that never even showed up during my time there lol!   Overall, I hope everyone tries this if the menu appeals to them!   I can't wait to go back and try to kimchi potstickers!   Hope this helps, -jT"}
{"text":"Love this place! They have an option to order the entire menu for $99. Great option for a group. They say it's enough for 4 but we had plenty of leftovers. Great food and awesome service. Love the seaweed salad:)"}
{"text":"Not a bad ASIAN fusion Jamaican themed with Chinese plates and funky interior They have done some interesting twist to Chinese food. And have done it well, I would recommend the Pineapple Bun burger as it is my favourite in the Whole Shebang menu Chinese salad and fried chicken are both great While the oxtail, jerky pork belly and dirty fried rice are too salty for my taste, but then again it is jerk taste Overall a great experience we had a good time trying different food Probably will be back again but not too soon"}
{"text":"I've been hearing rave reviews about Patiois. The food wasn't a let down but the portions were for the price. As soon as the waitress said the idea was about sharing I knew I was going to be hungry after leaving. We ordered the pork belly and ox tail \"dinners\". I think for Jamaican food I'll stick to Albert's on St.Clair. We ended up going to Poutini's for an extra meal just because the portions were so small. The server was very attentive but before we finished our drinks she gave us our bill without checking to see if we wanted anything else, plus the place wasn't that busy yet. Might go again but wasn't left with an overall great impression."}
{"text":"Food was generally good. A bit on the salt side on most of the dishes. The service was pretty poor. We weren't seen until 15 minutes after being seated. Not even water offered. No apologies after either  I recommend the food for sure."}
{"text":"Very impressed with this place! Went on a night that they were offering a special spicy stout beer from spearhead that was to die for. 4 of us shared the whole shebang with the extra chicken and it was definitely enough food. Kimchi potstickers are a must have and it was hands down the best fried and best jerk chicken I have ever tasted. Will definitely go back here! Only thing that I was a bit iffy of is that we were a party of 6 and they included the 18% autograt on the bill but that wasn't really a big deal."}
{"text":"I really wanted to love this place.   My experience was just awful. I found it incredibly overpriced. I got takeaway there on Friday night, ordered a few different items. Bill came to $85, however, the amount of food received was tiny. Everything came in one of the egg roll containers that you get when you order Chinese food. However, the containers were half full. Not only were the portions tiny, but the food was not tasty at all...the perogies were tasteless, Ackee and saltfish was a deep fried ball of bland nothing. The fried rice was medicore at best and the jerk chicken was unexciting. The only thing that I did like was the green bean special that they had, but that was deep fried and how can you really go wrong with deep fried green beans?   It was so bad that we didn't bother finishing the food, just ended up throwing it away. My boyfriend went out to Pat HomeStyle and bought a massive container of amazing Jerk Chicken to fulfill his jerk chicken craving. (that place is amazing and so cheap)   Fast forward to 4 am when I woke up with the worst food poisoning EVER. I was up until 6 am in pain.   Needless to say, my experience was horrible and that we will not be returning.   Looking forward to Patois closing down and hopefully a new and good restaurant opening up in the future."}
{"text":"I think it was alright and good to try but didn't get up to the top of my list.   Partially because the Chinese elements they used like pineapple bun, dumplings, deep fried dough, sriracha sauce are familiar items to me. So I didn't get the wow factor.   The paring and taste of Chinese/Jamaican food was okay but not outstanding. Also the dishes are mostly fried and fatty food, after the dinner my whole body felt heavy. Not a good feeling to encourage me to try the food again.   We had the Friday/weekend special prix fixe menu. My personal faves are the OG fried Chincken and the special salted coconut cocktail."}
{"text":"Never in my life have I ever been a lover of fried chicken.  Until now.  Somehow Patois has elevated the simple and unassuming fried chicken dish to cult-like and revered status (cue the doves, open the heavens above, let the sun shine down on Patois Toronto).  The fried chicken at this restaurant was crispy, and succulent with just the right amount of juiciness.  It came with some tasty sides that really compliments the crispiness of the chicken too.  Our party of four also ordered: the kimchi potstickers, the patty doubledown, Waldorf salad, green beans (to DIE FOR!) and a couple others that were just as amazing but escapes my sleepy mind.  For dessert we had pineapple bun bread pudding and fried jackfruit.  Awesome, awesome, awesome!  All in all it was a meal to remember.  The next morning the fried chicken was still crispy, cold and out of the fridge!  Like, how do they do that?!  Awesome..."}
{"text":"Make a reservation otherwise the wait can be long.  It's a busy place and small so it's a very loud.  The host and wait staff are nothing short of friendly awesome.  Ordered the patties, pork belly, chicken, and burger that my wife and I shared. The food was to die for. Can't wait until my next trip to Toronto and visit my new favorite spot. Hats off to the chef."}
{"text":"We went on a Saturday night and had reservations for 7pm.  The food was amazing and the general atmosphere was great!  I don't know if this is really worth complaining about, but the staff was a bit too attentive.   It was winter and we had not even unzipped out coats and our waited was asking us if we wanted to order a drink.  We sat down, promptly decided on a drink and then a few minutes later ordered our food.   The food came out super duper quick, I only managed one sip of my cocktail before taking a bite of food.  The rest of our food (we order 4 items between two of us) came out quickly.  I would have ordered another drink but I was nearly done my meal, so I figured I wouldn't.    The only food that missed the mark slightly was the dessert.  We had pecan pie, and I've had better.  I guess we just need to stick to the classics like the pineapple bun burger and the OG fried cauliflower! Drool!"}
{"text":"Loved this place! The jerk chicken is the best in the city. We ordered the whole Shebang ($99) which feeds 4 or completely stuffs 3 people. You can upgrade the jerk chicken ($12 I think) and stuff the 4th person.  Everything was on point, including Chef Craig who came out a few times to chat and get to know us :)  Don't leave any of the side dishes behind. I've never tasted watermelon like this; It's quick pickled with just the right amount of spice. If you need gluten free, don't worry! All of the breading on the fried chicken and onion rings are!  They play a great selection of music. The downside to all of this? They play it way too loud. My ears are still ringing..."}
{"text":"Yes it's good quality and tasty food.  It's a nice place inside with an energetic, casual vibe.   However, I'm by no means a glutton but I thought the portions were extremely small for the prices, and $8 pre tax pints is ridiculous and so typical (not just here) for  trendy Toronto spots.   This city's famous for it though so it's not just Patois.  Beers in decent London or NYC spots are more reasonable."}
{"text":"This is one of those times fusion food means a cool ambiance and interesting concepts, but not much good food. Nothing we ordered really stuck out as being particularly good...  OK: Chow mein was nice and crispy, but the jerk chicken didn't stand out.  Fried chicken was good, but not amazing by any means.   Not good: Jerk lemonade was awful - sounds interesting but I wouldn't suggest it.  Jamaican patty double down is basically what you would make if you ran out of real food at home - two jamaican beef patties with cheese whiz in the middle. Calling it like I see it, sorry.  Wish I enjoyed it more!"}
{"text":"The food is great, the atmosphere is even greater. My favourite part of their menu is their salad, simply to die for."}
{"text":"The jerk chicken is very good but besides that this place was a real disappointment. Highly overpriced, nothing exciting on the menu, and just another new 'hip' restaurant blasting 90s hip-hop creating an atmosphere more a kin to a club than an eatery. Perhaps the volume is a way to distract the patrons from the product or used to lure the 20-something credit card class in off the Dundas West strip.   Overall, just more of the same and too pricey for what you actually get. I was very excited to try this place but was very disappointed and will not be returning."}
{"text":"After months of following Patois on instagram.. I was dying to try this place. I've popped in twice when I was in the area, and the wait list has always been over and hour. Finally, I decided to make a reservation to check this off my \"Must Try\" list.  I must say the staff here is amazing. Super friendly, personable.. not the fake type of nice. Our waiter was very knowledgeable and was always close by when needed. The vibe is right, lively music and just the right amount of lighting. The only thing I didn't like was how crowded the seating was. But the place itself is pretty small, so it was understandable.  Now the food, was very tasty. Jerk chicken was fall off the bone juicy. The scotch bonnet mayo-ish sauce complimented it well.. especially since I love my jerk with creamy slaw. The OG fried chicken was my favourite. The skin was crisp but the meat inside was still juicy. It came with a sweet sriracha sauce which was my absolute favourite. If they sold it in bottles, I would be first in line to buy it. The dutty fried rice was okay.. nothing special. The Jamaican coleslaw was very bland. It was more watery than creamy.. and not worth the 6$. The portion sizes for everything were very small. Expect to spend 100$ between two people to be full.. not including drinks. For drinks, we ordered the gimlet and the rum punch and both were 5/5 outstanding.  Overall i give them 4.5/5. I will be definitely coming back here. But dont come here starving and avoid coming without a reservation."}
{"text":"Great atmosphere, great service, great jerk chicken, a little pricey for the ultimate experience, but very enjoyable overall."}
{"text":"First time at Patois this past weekend and I'll definitely be returning.  I was there with 3 friends and ordered the whole shbang (which means you get one of everything on the menu).  We had plenty of food and it was all so tasty.  We also ordered some of the green beans from the features board, and those wound up being my favorite item of the night.  We will definitely return!"}
{"text":"Sooo this place was on my wish list for quite some time.  When I got there, I would have to say from the outside, you would almost ever notice it. Its quite small and unassuming. Inside the decor was minimal and somewhat rustic.  Lets talk about the food. Every.single.bite was DELICIOUS, Seriously, from our first dish to the last everything was explosive in flavour and it felt an an honest food experience.  The kimchi pot stickers were soooo delicious, 6 pieces was not enough for two people. I could have easily eaten a dozen.  Next up the asian crunchy salad. It was also quite good, very refreshing with  a sweet and sour flavour profile.  Now the Oxtail Ramen and the Jerk Pork Belly. drooooool Both dishes were insanely good. I mean I simply can not pick a favourite. We definitely devoured both dishes.  I had the mango cheesecake french toast for dessert and I was worried it would be too greasy or overwhelming but I can honestly say it was the best dessert I have had in years.  What can I say this place was everything I could ever want when I dine out. I want every dish t be not just goof but something to rave about. Patois has this IT factor.  Easily one of the best, if not the best restaurant I have ever eaten in, not just in Toronto but anywhere."}
{"text":"Patois is a great restaurant. Food is delicious, staff is attentive, friendly and comedic.  I organized a birthday dinner for 23 people and the event planner Stan, was very helpful and was attentive to our group throughout the night. Craig, the main cook came out to greet us.  His love for food showed in the dishes we ordered.  We had the dirty fried rice, jerk chicken, fried chicken, ackee and saltfish, and double down patty. All dishes were tasty and I couldn't get enough fried chicken!  The jerk was a hit too.  We had a great night overall and they even accommodated me bringing a birthday cake and were great in cutting it up and making sure everyone got a slice.  It has a fun atmosphere with tasty food and friendly staff.  I have already gone back."}
{"text":"I LOVE this place. We ordered the \"Whole Shebag\" (entire menu for $99). There was 4 of us, two were vegetarian. Our great waitress and Chef Wong accommodated everyone. Every dish that was brought out was incredible. We all left full and satisfied! The cocktail menu is also delicious. There was a jerk infused caeser as a special...fantastic! The music and vibe was great...loved hearing Beastie Boys playing. I have returned to this place 4 times now, bringing different people with me to try this great spot. It is one of my favourites! Well done Chef Wong...well done!"}
{"text":"3/5! we went with the full menu, which is $100 (not including specials), and we were not overly impressed. If you are craving fried & greasy food this is the place to be. I recommend the Jamaican Patty Double Down and Kimchi Potstickers. Again, I am not into fried chicken but for those that are this place is known for it!"}
{"text":"Very disappointing. I was eager to try Patois after reading about it.  I had heard mixed reviews but still wanted to give it a shot.  Do not bother.   The drinks are okay, the food- blah and greasy.  We ordered almost the entire menu and several specials. Not one dish was \"delicious\".    I would neverrrr return or recommend this place. It's not awful, it's just so mediocre."}
{"text":"I went to this place with my husband and 2 friends. We had heard good things about it but tried it for the first time and were not disappointed. We ordered the whole shebang which is a taste of everything on the menu. It was really a treat to try all of the menu items. My favourites were the fried chicken, jerk chicken, spicy friend cauliflower, the napa cabbage salad(so so tasty) and the desserts were really something special. We had the mango stuffed cheesecake bun and the jackfruit beignets. These were awesome. Great place to go to for a laid back evening or for drinks. We will be coming back to this place."}
{"text":"Pineapple bun burger and Fried Chicken with watermelon pickle were a hit. Crunchy chinese salad was alright. Jerk chicken chow mein was pretty bad - too much sauce and not enough flavour.  Plus the tip option is set at 20% for the default on the machines, a little pushy if you ask me."}
{"text":"Spencer Spencer Spencer! I've been to many restaurants in Toronto or the GTA Spencer was the absolute best waiter I've ever had in my entire life!!! Very comical, hospitable and kept checking out table to make sure my family and I were okay. Absolutely amazing!. We ordered soo much food since it was my brothers  birthday. Everything was timely and accurate. 10/10! And the food was 10/10! one of the best places to eat in Toronto!"}
{"text":"Had a wonderful night at Patois! Second day in from L.A. and had a blast. Saw a review in the newspaper about the restaurant, came across it while exploring Little Portugal on Dundas Street and spent 4 hours enjoying our night.  Amy was an amazing bartender and bar manager!  She made us feel like royalty...and she's cute, much like the rest of her staff. Jessie and Evan were world class and Nicki with the cactus tattoo is the sweetest prick you'll ever meet. And finally make sure to ask for Vanetta, she works magic with her eyebrows!   The drinks are dope, strong  and unique. They had my favorite comfort food on the menu, oxtails, and they were grub worthy! The broccoli and shrimp balls were killer! If you're in the area, check it out. You won't be disappointed...and this was on a Tuesday!"}
{"text":"What An exquisite dinner!!! These is for food lovers willing to try an unexpected fusion of Chinese and Jamaican flavors. We order the \"whole shebang\" which is all the menu samples, enough for 4. It was impossible for the four of us to reach a consensus on whAt was best:  the patties are a really nice twist to the conventional ones, I loved the dumplings and the rice, my husband love the jerk chicken.   Eating here was one of a kind experience!!!"}
{"text":"Our bad experience started by waiting an hour outside for our table (despite having a reservation). The staff were apologetic for the wait and insisted that they would \"take good care of us\". The food, however, was mediocre and the service was bad. Our food and drinks were cleared three times before we had finished with them, and we had to have the server bring them back to the table. There was a long black hair in one of our dishes, and the bacon in our double-down was under-cooked. Service was also disjointed. We ordered the whole shebang and doubled up on certain dishes because of the size of our group. Dishes came out sporadically in portions too small to share with our group of five. No attempts were made to improve our experience in any way. The restaurant sounded great based on other reviews and all of the hype, but the experience was very disappointing (and the food and drinks were over-priced). There are many other better restaurants in the area. We will not be return customers."}
{"text":"The fresh coconut drink was delicious (served In a real coconut!) The lobster was fabulous but pricy. Chicken was juicy and moist."}
{"text":"WARNING: This is a ridiculously long review.  Chef Wong, you had me at \"O.G. Fried Chicken\"!    Have been dying to give Patois a go since it opened and it exceeded my expectations by 10 folds.  It's eclectic, energetic, a perfect blend of the Jamaican-Chinese cultures and above all, insanely good food.      Went with a party of 7 (reservations highly recommended as it's a smaller resto with about 50ish seats) and were seated at a round table beside the bar that had a cool lazy susan powered by skateboard wheels (my engineer husband quickly got distracted by how it worked).  We settled on 2x the \"Whole Shebang\" with an upgrade to a full serving of jerk & fried chicken.   Our drink orders arrived pretty quickly and everyone ordered something different.  I had the Jerk Lemonade which had a bit of a bite but was nicely balanced against the tartness of the lemonade.    The first item to arrive was the Ackee & Saltfish which was served alongside plantain chips and a yummy salsa.  It was a bit on the saltier side but went well with our drinks.    If you're familiar with Chinese steamed fish with ginger & scallions, you'd recognize the kitschy blue & white plate that the Jamaican Patty Double Down, Kimchi Potstickers, Jamaican Coleslaw, and the Pineapple Bun Burgers came on.  We fought over who got the last potsticker and everything else on that gigantic plate.  The potstickers and double down were my personal favourite.    Next, came the Seaweed Waldorf salad and the dirty fried rice.  The salad was slightly bitter but balanced by the sweetness of grapes and the crunch of walnut.  I'm not a salad fan but even I went back for seconds.  The carb-a-holic in me did a back flip for the fried rice: it's a smallish portion of fried rice with both Chinese (lap-cheung) and Jamaican flare (spice + Cajun trinity) to round it out.       And finally, what all 7 of us were waiting for: O.G. fried chicken, O.G. fried cauliflower, and the jerk chicken.  Despite having gone through a culinary marathon, I selfishly scarfed down my share AND my husband's share of the most deliciously juicy and crunchy fried chicken.  It was just that good (possibly better than Bar Isabel IMHO).  I'm a huge fan of spice and the habernero sauce was just perfect for me but others at my table weren't necessarily up for the challenge so beware.  The jerk chicken was super tender and juicy and lived up to its moniker as \"Best Overall Jerk Chicken\" at the Jerk Jam Down Competition this summer.  The sweet sriracha & thai basil sauce elevated the already yummy fried cauliflower to a whole new level.      It was at this time that Chef Craig Wong paid a visit and modestly accepted all forms of flattery from the 7 of us.  He gave us the low down on some of the noteworthy decor including: the inflatable rings on the ceiling and a quick story about the Jamaican Tourist Board girl.    To make a long story short, you have to eat here.  No ifs, ands, or buts."}
{"text":"Horrible service.  I made a reservation on a Wednesday night for 5 people at 7:30pm. I booked online and returned the call from the host in the afternoon to confirm the reservation. The whole party arrived on time and were told that the table that had been designated for our group was still eating, and they had been taking a long time. The host assured us he was going to figure something out. We patiently waited outside, and the server continued to provide us updates about the status inside the restaurant, although was unable to find a seat for us by 7:45. My brother had really wanted to try the food so we stuck around. Finally, just before 8, the host announced he had found a table for us.   I wish it stopped there, but unfortunately the service was quite poor once we were seated as well. When our waitress finally came by with waters (about 10 minutes after sitting down) we told her we were ready to order our food (as we had been studying the menu for the past 40 minutes). She seemed a bit taken aback but went with the flow. We didn't order anything special - the whole shebang with an upgrade and 4 beers. Unfortunately, the process of getting our food took an extremely long amount of time. The wait between our two courses felt like forever and overall the whole process took us until 9:45.   Once we finally got our bill, there were no discounts, no drinks or appetizer on the house, no sign that we waited half an hour for our table and another 1.5 hours for our food. I live down the street and have frequented the restaurant before and was excited to bring my family. Because of this experience I will not be back.  I reached out to the restaurant to share my experience and give them an opportunity to respond. Unfortunately all I received was a lame email response that ended with \"If you would still like to come to Patois in the future, please email me directly and I will let our management know that you will be joining us.\" Not sure exactly what that means as there is no offer for compensation in terms of discounted food or drinks but either way I won't be taking them up on that strange offer."}
{"text":"PATOIS FAILED! They made us wait 45 minutes for our table and then, we had to wait 15 minutes more for our drinks. We order the burgers, but they did not have burger buns We order water, but they did not have enough glasses to serve us all We order the rum with coconut water, but they did not have enough funnels to pour the drinks No one ever apologized nor gave us a complimentary drinkS/dessert to compensate for the lousy experience. TERRIBLE EXPERIENCE"}
{"text":"Would hands down award the best jerk chicken in Toronto. Has a smoked taste with a jerk rub that reminds me of roadside chicken stop in Jamaica.  This chef knows his market, he calls it asian fusion, but it is more Oriental Caribbean food."}
{"text":"Amazing experience overall. The owner was super nice. You can tell he's passionate about his food because it shows. Loved it!"}
{"text":"I've been here 4 times now, the first time was amazing this was before the fire, but the last 3 times just got worse and worse. I feel they use way too much salt. We got the whole sheabang, the burger tasted as if someone accidentally spilt a jar of salt on it. The fried chicken was good, jerk again too salty. The fried rice was okay, the dessert was amazing."}
{"text":"This place is beyond exceptional - one of the best restaurants in Toronto. I'm pescatarian and there were a ton of options for both me and my carnivore husband. Food is out of the world and cocktails are the things dreams are made of. Go here...now."}
{"text":"Bummed giving a two star review because I really wanted to like this place.. Went for brunch on Sunday and while the food was decent, the service was just painful especially given that is wasn't even a full house.   Got there about 15-20 minutes after my friend and apparently he had to reorder his beer three times before it finally came. Not a great start.  He ordered the patois eggs benny and while he said it was good, the portion was laughable for $13.   My other friend and I ordered the fried chicken and hong kong waffle. Better portion, really tasty. Juicy chicken, fluffy waffle and a blonde butter syrup that made me not miss maple syrup at all.   The problem is that the chicken and waffles came out about 15 minutes after the eggs benny so we had the pleasure of watching our friend finish his meal and he got to wait and watch us.  Also ordered the scallion potato hash and sausage as sides to share and they finally came out when we were basically already finished the rest of our food.   As for the drinks, they were just alright. Had the Trade Winds which was a Dark and Stormy with Chinese 5 spice.. Didn't detect any 5 spice though. Also had the coconut and rum which was basically a coconut cracked open that you pour a shot of rum into. Really cute presentation but a little overpriced for some coconut water and 1oz of booze.   My bill (chicken and waffles, two cocktails and one side) came to about $60 with tax and tip. Unfortunate since we left still hungry and ended up at Bellwoods Brewery for more food."}
{"text":"Went there for a friend's birthday dinner because are lobster fiends and saw their jerk lobster on Instagram and knew we had to check it out! Service was great, and we started with the deep fried chicken and jerk chicken,  it was amazing! We were already in heaven! And then got the deep fried cauliflower,  it was out of control, tasted like Sweet and sour pork! So how was the lobster you ask... Obviously from the rating of 3 out of 5,  something must of gone awry,  correct. The lobster was a disappointment, and it was a big one. It was very greasy and obviously I can accept and appreciate a certain level of grease ie. Deep fried chicken AND cauliflower but this was excessive for lobster. And the lobster meat itself was spongy/mushy,  usually the result of frozen or dead lobster, not the usual chew and sweetness one comes to expect from true lobster houses like Lobster Fishing Clubhouse. It was also done Hong Kong style which is fried with a light batter. But the batter was heavy and bland. We accompanied this with the chicken chow mein which was good but not great, almost every strand was crunchy to the point of excess, normally the outside noodles are crispy while the middle is soft and saucy but not here.  By this point, the disappointment of the lobster had settled and we left without dessert. So, my advice, order everything else, except the lobster!"}
{"text":"Came here Saturday night and had an amazing waitress and meal!  My sister is vegan and our waitress said they would be able to make the slaw, dumplings and cauliflower all vegan for her. We ordered the whole menu and everything was delicious, I loved the fried chicken with hot sauce. The restaurant has a great atmosphere, friendly staff, good food and cocktails. They also have amazing hot sauce! I would definitely come back here and recommend it to others."}
{"text":"Had high hopes for this place but it didn't quite deliver. Firstly the \"Whole Shebang\", which is $100 for the whole menu (not including specials) isn't really worth it, you don't save much (we added it up and you save like $5) and potentially end up with dishes you don't really care to try. We decided to choose on our own.   We had: - Jamaican Patty Double Down  - Kimchi Potstickers  - Juicy Jerk Chicken  - OG fried chicken - yummy, reminded me of the crispy chicken KFC used to have  - OG fried Cauliflower  - Juicy jerk chicken - good, but I've had better  - dirty fried rice - least favourite, bland and not much flavour  - jerk chicken chow mein - yummy, I liked the texture of the crispy noodles, but it wasn't really jerk chicken  - shrimp wonton nachos  - mango cheesecake stuffed French toast - favourite but not sure it's either Jamaican or Chinese?   Vibe was pretty hipster and mellow. No complaints about the service. Glad I tried it but probably wouldn't go back."}
{"text":"We went here with a few friends after a marlie's game one night. Since we are big eaters and there was four of us, we decided it was in our best interest to order the whole shebang. Everything was amazing, I have no bad words to say about any of the dishes. The pineapple burger and jerk chicken I think were my favourites. We even decided to order all three desserts they had that evening, again, amazing. We all ordered drinks, mine in particular was rum punch, which was awesome. The pricing is a wee bit high but I don't mind paying a little extra for delicious food. Our server was very informative and answered all the questions we had about the menu. She was attentive all night. The owner even came out to clear our plates and talk to us about how our food was, this is what really won me over. We will be back!!"}
{"text":"Was really excited to try this place! I give Patois for 2 great ambiance, but unimpressive food.  First of all, if you're coming for dinner, make sure to get a reservation! Place was packed on a Friday night. Me and my boyfriend had no problem waiting though, so we hung out at the Tim Hortons down the road. They gave us a call and we headed over. The servers were all really nice! And the crowd their that night was hilarious, hence the great ambiance.  The food was the really disappointig bit. We ordered the Oxtail Ramen Lo Mein, the half Jerk Chicken, and the Dirty Fried rice. The first dish that we got oxtail. It was really gross, almost inedible. Both the oxtail and the ramen were extremely salty, the oxtail was not tender, and whatever the sauce on the noodles was did not mix well with the oxtail. Quite a dissapointment as I'm a huge oxtail fan. After the dissapointing start, the jerk chicken and the dirty fried rice. These were both alright, nothing too amazing, but a welcome food to eat after the oxtail. Jerk chicken came with a really spicy scotch bonnet sauce which was a fun addition to the meal, but the chicken itself was not as spiced as we would have liked. Dirty fried rice seemed to be mix between fried rice and rice and peas.  I think might come here again to try breakfast. Again, the service was awesome, people dining there were great and I would come back just for that."}
{"text":"Best jerk chicken in town! Love their dirty fried rice!"}
{"text":"Came here for dinner with a few friends. Food was nothing great, pretty bland..and service was even worse. I read a previous review about miscommunication over the phone and we had experienced the same thing regarding food allergies. Inexperienced staff and management.. As soon as we paid our bill and took the last sip of our drinks, we were ASKED to leave cuz because they needed the table. .. Lololol I would recommend any other restaurant.."}
{"text":"Patois is over rated, I am not a foodie or food critic just an average Joe who enjoys good food. So people can argue that I don't know what the hell i'm talking about and they are entitled to that opinion.  I guess I wasn't eating at the same restaurant as some of the other yelp reviewers who gave them more than 3 stars  When I found out that there was a restaurant that combined 2 of my most favorite foods I squealed like a little school girl at a Backstreet boys concert.  So for my sisters birthday I made a reservation for 3.  When we arrived we where promptly sat at the 'chefs table' there was a open window right above our heads and you can hear everything going on in the kitchen.  We just accepted it as part of the ambiance.  A nice bubbly server came over and told us the drink specials and answered some questions I had about the menu.  We finally ordered an appetizer and three mains.  Note: restaurant only allows you 1hr and 45min to dine because it is a small restaurant.  It took them 45 minutes to get all the food out at once.  I could be wrong but I thought appetizers came out first so that you can nibble on something while waiting 45 minutes for your food.  Food: KIMCHI Pot stickers: it was a joke.  There was a couple strands of KIMCHI on the dish.  It was as if they just ran out of kimchi and scrapped the jar the best they could to get whatever they could out of the bottom.  if i ordered KIMCHI pot stickers I expected there to be some KIMCHI on the dish.  Pork belly: it came with a couple pieces (and I am being generous when I say pieces) of pork grinds and I would say 5-7 ounces of pork belly.  For $15+ item I expected a little more food.  It was over charred and as a result very salty.    Pineapple Bun burger:  it was ok.  Interesting concept but wouldn't drive more than 10 minutes to get this burger.  Came with some shrimp chips.  HK style Lobster:  $45 for 1.5lbs (note: $88 for 2 lobsters) you save a whole $2 wow THANKS GUYS you reaily know how to strike a bargain, can't say No to that deal!  when it came the server said the kitchen staff tried to crack the shells a little to make it easier for us to get to the meat (it was a lie).  The shells where fully intact.  The server gave us walnut crackers to get through the shell.  They do not have wet naps and gave us a tower of paper towels to clean our hands which is stupid because all the paper towel does Is spread the sauce to other parts of your hands.  The aftermath of our hand cleaning was not pretty.  the tower of paper towels turned into a mountain of snotty paper towels.  WE LOOKED LIKE SAVAGES!  Service: Sub par!  Although  the server was 'friendly' didn't seem like she care much about our table since there was a party of 25 who could potentially give her more tips. Server filled our glasses with water the one time, for the next two hours no one bothered to come refill our glasses even though we saw the server go around other tables to refill their glasses without asking.  When I asked about the pork belly dish she had failed to mention how small the dish was.  I'm 6'2 240lbs 5-7 ounces of pork belly with no sides isn't enough (if you look at the other mains in my pic below there is a huge difference, pork belly looked more like an appetizer).  She could have possibly suggest another dish or even up sell other items since the pork belly was small.  After our lobster we had requested for a small bowl of water with a slice of lemon to wash our hands since they did not have wet naps.  The host who came by to clear some of the stuff on our table said 'he will see what he can do' that fucker just started to converse with a table full of girls, then about 20 minutes later the bowl of water came.  We finally asked for the Bill and it took them 20 minutes to get us our bill.  By this time we were already annoyed.  As a person who used to work in this industry I am a generous tipper even if the service was 'ok'.  But we just tipped her 10% and I think that was to much. When we left the host and hostess didn't bother to say bye and just talked to customers at the bar.   Finally, Although the concept of this fusion restaurant was interesting, it failed on so many levels.  Service was sub par, food was ok and the portion size relative to the price was ridiculous.  I expect high prices and small portion sizes from a fancy fine dinning restaurant.  Patois is nothing more than a 'hole in the wall'.  The food was very salty, even the specialty drink I had was salty you couldn't taste the rum or the ginger beer (reason drink was salty was it had to much Chinese 5 spice in it)If you are going to charge high prices at least make the food to that level and increase the portion size just a bit.  I doubt this restaurant will be around long.   I will not be returning, but they wouldn't care because there are plenty of wanna be hipsters that will pay for mediocre  food and sub par service just because the restaurant is on dundas west and its the hip thing to do."}
{"text":"We had an amazing meal and time here. We ordered the burger, the meat patties, the perigies, the chow mien and the fried chicken. I still don't know which was my favorite because they were all so good. The kicked up favorites just danced all night in my mouth. Mmm good!!!! The server was super friendly and helpful with the menu and the hostess from us a spot at the bar since we did not make reservations which are highly recommended for this busy small hip restaurant."}
{"text":"After trying to come here for a while i  came here tonight with my friend and we had the jerk lobster, coconut rice with oxtail and the jerk cantonese chow mein.  The coconut rice with oxtail was my favourite. This dish reminds me of west indian cookup rice with pepperpot and some chinese bbq pork skin on top. However the rice portion was really small! The rice had to be like 1/4 cup and the grains were small and broken. The oxtail was soft and sweet and pretty good.  The jerk lobster was second fav. Coated with loootss of breading it was kind of cantonese maggi sauce because it was quite tasty but really salty after a while even of sharing. A bit too greasy .. best to share this out!  Least fav  was cantonese jerk chicken. It was like reg canto chow mein but the sauce was not spicy at all and there wasnt much chicken to speak of. Didnt really like the sauce. My friend said it tasted bland.  Auto grat of 20% to a two person bill was kind of awkward. My friend asked if she could enter the tip amt and the 2nd option was still 18??? Thats a new one never seen that.. service was good but place did get reallly loud.  As someone who is chinese hakka also caribbean roots  restaurant had some hi and low points. Hakka chinese places abd jamaican places  are both generally way spicier it was a bit of a hipster cop out on some dishes."}
{"text":"What a fun place.  Great atmosphere, music that is not too loud (I noticed a previous review complained about noise levels, so perhaps they turned it down?) and the food is tasty and FUN.  I LOVE fun food, and I love FUSION.  Anything Asian fusion is up my alley.  The fried chicken is to die for (clearly these chickens were massaged daily and played harp music) and the tempura fried green beans with miso sauce was my favourite.  I hope it becomes a menu staple, and not only a special.  The beef and broccoli special is impressive and theatrical and the chicken chow mein with mushroom was spicy and awesome!  I can't wait to go back and try the Jamaican patties and kimchi pierogis!!!!!"}
{"text":"Great place to go for brunch or dinner. Staff is amazing. Craig Wong is a wonderful host and chef. Have never been disappointed. Tried the eggs Benedict on Jamaican patties. So good. The fried chicken and waffles are amazing. Try the grilled cheese with oxtail, like French onion soup in a sandwich. Can't say enough good things about the place, ya gotta try it for sure!"}
{"text":"Firstly,  I really love the location (Dundas West) and the actual restaurant is a cozy-perfect size.  The service is 'okay', not great, but not bad.  As for the food... it was good.  We had the crunchy salad, the broccoli, and the jerk chicken chow mein.  To finish, I had the grapefruit sorbet.  I want to be able to give this restaurant a better rating because they have such a good vibe going on inside and I really appreciate the intention of marrying Jamaican and Asian cuisine.  However, nothing really stood out in taste.  The salad and broccoli were just 'good'.  The chow mein was also good, but not outstanding... and actually, I couldn't taste the 'jerk' in the chicken.  The grapefruit sorbet was great, but it's hard to miss on that one.  With all of that said, we will definitely be back because I believe that I might be judging this restaurant way too soon as I need to try more of the dishes.  I found myself eyeing some of our neighbours' food and I can't wait to try those dishes the next time we make it here."}
{"text":"Don't believe the hype  Not worth it. Went for valentines. Started  with the patties which tasted like frozen ones from sobeys with some pizza sauce on them. Pretty much just a hot pocket. Next ordered jerk chicken and dirty fried rice. Rice tasted no different from standard Chinese takeout. Took 40 min for us to get the 2 pieces of chicken we ordered. Came out luke warm and unimpressive. Left half of the food on the plate. Drinks were nothing special either. Service was bad too. Note to patois. When a person makes a reservation that means they want a table not a shitty spot in the middle of the bar Would not go back. If you want patties go to rhum corner down the street. All of the other food you are better off going to spring rolls"}
{"text":"Chinese Jamaican Fusion, you say?  I was a bit skeptical about the fusion part but Chef Craig Wong proved me wrong.   My favourite dish of the night was Ackee N' Saltfish.  The panko-crusted salted cod croquettes were delicious.  Crunchy on the outside.  Moist with the right amount of saltiness inside.  Juicy Jerk Chicken lived up to its name.  It was very moist.  The skin, crusted with great jerk seasoning was crispy and bursting with flavour.    Original Gangster (O.G.) Fried Chicken and Watermelon Pickle was a fantastic dish. According to Chef Wong, it took him three years to perfect this recipe. Loved how crispy the chicken was.  Dirty Fried Rice with Chinese sausage was a great side dish for the Jerk Chicken and Fried Chicken.  The best part of the entire meal was the Jackfruit Beignets, dusted with sugar and lightly drizzled with condensed milk.  Heavenly!  Each dish is small and more of tapas-style.    Service was excellent!"}
{"text":"The food is amazing! Love it so much!! The drink with the coconut water with tequila is such a good time!! AND YOU CAN EAT THE COCONUT!"}
{"text":"FINALLY A CASUAL RESTAURANT IN TORONTO THAT ACCEPTS RESERVATIONS! Very rare!  I'll be back for sure.  Food was amazing. Atmosphere great.  The OG fried chicken was tasty and so crispy crunchy!  Jackfruit beignets for dessert was delicious! Had to order another because we were fighting over it."}
{"text":"I first tried Patois at their pop up at Union station after the fire.  Apparently, they got the hook up (cheaper pricing or free space) after the fire because the food community is kind and wanted to support them which I think is pretty wonderful if it's true.  The guy that served us then was so lovely and the cauliflower fritter dish I had was so so delicious.  I've wanted to go to the restaurant since.  Fast forward a year or so and me and my friend get a seat right away.  The server was great, the service was quick and it was nice and toasty inside.  It got darker and louder inside as the night progressed but I won't get too old lady about it.  The cocktail menu is interesting but I wasn't super keen on the aromatic flavours, I had the Patois g&t which had a nice cucumber on the side, I tried my friends bourbon lemonade which she loved but I wasn't so down with. They were 3 - 4/5 level cocktails.  Pricing is pretty standard.  On to the food.  The glorious food. We shared: Potstickers - just perfect. so nice I wanted another dish.  Didn't make me feel gross like a lot of dumplings can.  Cooked perfectly and nicely layered with 'stuff'. 5/5  Crispy salad - It was crispy and fresh.  The pineapple dressing and crispy tacos were really nice and helped to balance out the heaviness of other dished. 4/5  Curry goat doubles - SWEET LORD. These were so delicious and special.  The bread is soft and fluffy.  A little blanket for the rich goat that just falls apart in your mouth. 10/5  OG Cauliflower - sweet sweet heat. So nice and the pickled watermelon in the perfect accompaniment 4.5/5  Jerk chicken chow mien - the absolute worst.  a real let down for an otherwise great meal.  It was presented as a slab and tasted like gross Chinese food.  Super slimy and tasted like bad MSG.  The chicken was so soft, like almost fluffy - a bit of a strange texture for poultry.  The jerk was non-existent, it didn't really have a flavour. We left 80% of that dish on the table, I couldn't even bear to take it home cause I want to bring my husband and this dish is not how I want him to experience Patois  Overall this place is delicious and great but there are for sure some inconsistencies. If Yelp let me score more accurately it would be a 3.7"}
{"text":"Lots of comments already about the fabulous food but wanted to thank the service team for such a wonderful evening. Very attentive, very welcoming."}
{"text":"This is my second time being here. I went with 4 people in total and we did the whole bang menu and it was so worth it. Every item tasted different and stimulated taste buds you never knew you had. The service is simply some of the best I've had. Nothing negative to say about this place. One of my favourites."}
{"text":"The food is probably 4 star but the price and portions makes it 3 stars.  We spent almost $90 and I left feeling a bit hungry. Island food is cheap, tasty and filling... Chinese food is the same.  Why would the fusion of these two cuisines be any different?  The 2 of us ordered the following: O.G. Fried Chicken & Watermelon Pickle (half order) Chinese \"Pineapple\" Bun Burger  Jerk Pork Belly Jamaican Coleslaw Jamaican Dumpling Pumpkin Soup  And for dessert we got: French Toast Stuffed W/ Cheesecake, Topped With Mango  Fried chicken was really good but the sides were awful.  The pickled watermelon was just weird and I love watermelon.  Should have just served with regular watermelon.  I think they were trying too hard to be \"fancy\".  Also, $13 for 2 wings?  Pineapple bun burger.  Would return just for this.  Beef patties were tasty and juicy.  The pineapple bun just works.  Portion was a bit small but still reasonable compared to the wings.  Jerk pork belly was a bit over cooked.  Was dried out.  Flavor was OK.  Again, small portions.  For $15 I could buy 3 lbs of BBQ pork but we only got about 10 small slices.  Jamaican coleslaw was subpar.  Not as creamy as Pat's on Queen St. And a little bland.  This was one item I thought was a respectable portion size.  Jamaican dumpling pumpkin soup was a bit salty for my liking but that may be a personal preference.  This was mostly soup and almost no dumpling.  What dumplings that were there were tiny.  Last, the dessert was a good effort.  It is worth a try but not worth repeating.  Hong Kong french toast is quite unique and I can see the attempt to make it like HK french toast but it fell short.  The crust was too hard and it was all crust besides the cheesecake part.  TLDR.  Expensive, small portions.  Worth going only for the pineapple bun burger.  That's it."}
{"text":"I came on Fri Sept 25th for a group dinner - we took the \"before 6\" seating...  As a short note - dinner food...A+, but the service was some of the worst I have ever had in Toronto. The restaurant is not large, all tables are pre-booked, and the menu is prix fixed so I have no idea where the problem lies. Bottom line is from beginning to end - $14 drinks took over 30 min to arrive (after reminding them several times), plates are so small & we could not get the servers attention, dishes were all left uncleared and not once did we get asked how everything was. In addition to all of this, our group was sat at the small, dark table right near the kitchen. At first it looks great but once the kitchen gets going it's about 100 degrees at the table. Not enjoyable.  For a place that has so many rules in place - it was incredibly disappointing that there were so many hiccups along the way. The server seemed generally unaware that there were any problems and we received no apologies for the mistakes that were made. All in all we ended up with a $650 bill and none of us are too interested in coming back."}
{"text":"The food was good...we ordered the whole shebang (the whole menu) between 4 of us, and it was plenty.  What pissed me off was the service. We had reservations at 7pm and we arrived on time.  The second we came in, the host said we needed to be out of there by 8:30. When we finished our meal, the server just gave us the cheque, presumably to get us out ASAP.  Just 2 minutes earlier, he clearly offered dessert to the table next to us. Why would you schedule settings so close together?"}
{"text":"Overall experience: 8/10 Food: 7.5/10 Atmosphere: 7.5/10 Service: 8.5/10  I was pleasantly surprised that I was able to enjoy Patois as I find any type of \"Asian fusion\" restaurant is really code for watered-down Asian dishes in hipster settings.   The food at Patois is good - some are definitely better than others. I'd skip the dirty fried rice (it's drenched in soya sauce) and opt for another order of the Jamaican patty double down.   The dessert on the menu that day was cookie butter french toast...need I say more?! It was like a slice of heaven: gooey, sweet, carb.   Service is great. I can see why it would be fun to come with a larger group of friends to grab a quick bite and some drinks.  THE BOTTOM LINE: some food is better than others, and Patois does manage to stay afloat in this Asian fusion trend that's going around Toronto."}
{"text":"My boyfriend and I decided  to check out this place last night as we were looking for something very flavourful to eat. Right when we entered the door we were welcomed with a warm hello! LOVED both the food and service at this Patois. We ordered the following :   1. Mista Chin's fancy Gin (as seen in picture) - Fairly strong drink with a nice peachy taste - Presented in a cute flamingo floaty drink holder - Can't really go wrong with anything gin-based  2. Jamaican Patty Double down (vegetarian)  - Suitable for those who enjoy patties with a bit of kick - The patty pastry itself had a nice amount of flakiness to it  3. Chinese \"Pineapple\" Bun Burger (maaaast try!!!) *Emily's Choice* - this burger was the perfect blend of both the Jamaican and Chinese cuisines  - the burger had both sweet and savory components which hit all the taste bud g spots  - it came with a side of shrimp chips (one of my favs)  4. Dirty Fried rice - no shortage of Chinese sausages in this dish  - Maintaining the theme of sweet and savory flavors  - Not too greasy   Service Rating: 5/5 Food Rating: 4.5/5 Perfect amount of food for 2 people"}
{"text":"After work, I ate here with my friends. Dim and hip, the restaurant looked fun. The menu looked interesting since they were doing a fusion idea. Was the food mindblowing? Nope. It was meh. It didn't taste terrible but I don't find myself craving anything from them.   I do appreciate the service. They were understanding when I returned a side order of rice since it has bacon. I had the fried cauliflower. It was spicy. I wish they put the hot sauce on the side much like how they served my friend's fried chicken."}
{"text":"If the rating was on food and atmosphere alone I would have given Patois 5 stars. This was my second visit and the food once again did not dissapoint. However,  the overall service was such a dissapointment it completely ruined my night (and that of my out of town visitors as well). I made reservations for 8pm and on arrival was told it would be a few minutes late. No problem.... I completely understand these things happen.  BUT.. 50 minutes later when we were finally seated at the literally the worst table in the place with no futher apology is unacceptable. I have worked in service. A sincere apology and perhaps a complimentary appetizer or dessert would have gone a long way. Instead, after being seated when I said that it was little uncool I was met with a \"why, what did we do\"? I get Patois doesn't care. Why would they? They are really busy and have no shortage of customers on any given day. It would have just been nice if they had at least pretended."}
{"text":"Upon first impression the atmosphere felt forced and some what pretentious. The decor reeks of Toronto trendiness and the desperation to appear eclectic. Everything was poorly muddled together in a painfully \"casual\" way. Everyone in the room - including the staff - appeared uncomfortable. We were served promptly, however we were seated next to the bussing station and therefore always had a staff member within a foot behind us which didn't make the experience very intimate.  The food itself was decent. The fried chicken was pretty great, with the nice watermelon pickle. The dirty rice was dry and unimaginative. All in all the experience was mediocre. It was not bad, it just wasn't great. We left feeling as if we spent too much money on a pretty boring experience."}
{"text":"Service, food and atmosphere were great. Must have is the pineapple bun burger and the fried chicken. Will definitely go back."}
{"text":"Came here with two girlfriends on a weekend. They'd both been wanting to try it out after seeing great photos on Instagram, and one friend had been before and liked it.  First off: the service here is amazing. That was probably the best part of the experience. They were thorough in their explanation of the menu, in making sure we had a place to wait comfortably with a drink while our table was getting ready and so on. Midway through our meal, the owner/chef came out, introduced himself, cracked a few jokes, and made us feel welcome. I definitely do not discount these human touches. The decor is cute and quirky, with lots of colour. And that pineapple logo is probably one of the loveliest little things I've seen.  The food...well. Hmmm. It left a little something to be desired.  I ordered the jerk chicken and an order of the dirty rice (without any pork, though). I was excited to see how the 'fusion' aspect turned out in these dishes. My friends ordered the Jamaican patty double down, and the jerk chicken chow mein. We also had the O.G. Fried Cauliflower & Watermelon Pickle to share -- which tasted pretty awesome (the cauliflower, anyway; the watermelon pickle just tasted like slightly warm watermelon to me.)  My friend couldn't even finish her entire chow mein because by the time you got about a third of the way down (basically, after you'd eaten the chicken), the chow mein noodles were drenched in an overly-salty bath of sauce. Unfortunately, my order of dirty rice was very, very salty too. It was also kind of ... boring. It was basically fried rice with some peas. I mean, I get it: that's what Chinese fried rice is. But I thought there would be some sort of Caribbean element too. Maybe because I got it without the sausage? I'm not sure. I just don't know if the sausage would have ultimately made it THAT much better, but who knows.  The jerk chicken was a bit on the salty side too, but still had a solid flavour to it. I probably enjoyed that the best and could've skipped the rice and gotten a different side to accompany it.  My friend who got the double down said it was pretty good, and she seemed also very happy with the drink she ordered, which came in a giant coconut cup with a little umbrella (so cute!)  I'm hoping our experience with the extreme over-seasoning of our dishes was more or less a mistake and not truly representative of the style of cooking here. I would like to come back and try this place again, but I could go without. It's also not the cheapest for what you get (quantity and quality, from this experience, anyway) so I'm interested in finding other Asian fusion places that maybe do this a little better.   Overall, the service is really what makes this place, so this is still a fun spot to come with friends, share some appetizers and have a drink."}
{"text":"Great spot. Asian Caribbean turns out to be a valid niche. Cool vibe. The chicken is fantastic with creative accoutrements, the 'dirty rice' awesome. We took the kids and the staff were super welcoming and friendly.  A great addition to the Toronto food scene and reinforcing Bathurst/Dundas as an emerging hotspot"}
{"text":"A++, would go again! In fact, I'm going in a few weeks!   The food is delicious and unique and the service was super-friendly. I went with a group of friends who love trying new restaurants and everyone was really happy with everything! Also, I loved the vibe and decor of the place - energetic and fun!   Table favorites included: *O.G. Fried Chicken & Watermelon Pickle (Omgggg - Fried chicken was sooo good!! Juicy, juicy perfection.) *Seaweed Waldorf Salad (Hot damn! We weren't originally going to order this, but I'm so. glad. we. did. Flavourful and crave-worthy! Who says that about salad? Me, that's who.) *Kimchi Potstickers \"Pierogi Style\" (Om nom nom nom)  *Ackee n' Saltfish (Jamaican-Chinese friend said this was a cool twist on a traditional dish. All I know is that it tasted goood.)  Cool? Cool."}
{"text":"Group of 8, took the 40$ group menu. Was worth every penny of it. Appitizers: the perrogies are so tasty. Main course: I strongly suggest the burger and the jerk chicken. The pickled watermelon is amesome. The carrebean spike tea is delicious on the drink menu. Waiter: Spencer was totally on top of his game and gave us amazing service. The manager was a total dick to us, never smiled, was picking up drinks that were not done, and basically looked ennoyed with our table the entire night. It just sucks because our experience went from a 10 to a 2 because of him. Its not the first time that we go there but that was the first encounter with the D head."}
{"text":"We made reservations on Dinr. Showed up and were seated promptly. We ordered the Jerk Chicken Chow Mein, Veggie Kimchi Perogi (Potstickers), and the Chinese Pineapple Bun Burger. They were all really impressive. The Jerk Chicken Chow Mein can be a little too much salt if you're not expecting it but it's fantastic, especially if you mix it and really let the soy soak in. The Chinese Pineapple Bun Burger was out of this world... the kind of thing you remember and want to go back and eat 10 more times. The Veggie Kimchi Perogi were also great! The overall vibe is nice, the service was great (water always refilled which was great given the chow mein), and food came out reasonably quickly. The cocktails also look great (I think we tried one of them and it was good!). The dessert looked really good (saw it on another table) but we were too stuffed :-)."}
{"text":"Me and my friends came here for a friends birthday and ordered the whole shebang (109.99) it was a very good selection of food. I'm glad there was that choice or it would be a headache for me to choose what to order.    The pineapple burger was the best! It's such a good surprise. The sweet pineapple bun combined with the burger was a great mix.  The Edamame beans came first and it was a good shareable portion.  The Jamaican patties was not anything exceptional. Fried rice was a bit bland.   Their chicken (watermelon and OJ ) was good.  Their salads (coleslaw and Chinese) both were good as well.   The potstickers was nothing special either.    For $109.99 it was a bit pricey but good to be able to try a variety of things. Next time I come I will probably just get the pineapple bun burger with a side.   As well we got a French toast dessert for the birthday girl $8 which came with a sparker. However it had so much caramel which I did not enjoy.  Also we made reservTions in advance and was seated in the front high table. It was very unpleasant sitting in that area because there are not back rests and no where to put your jackets or purses. It was also very chilly because it was right beside the front door. As well we had to share the table and was very close to the couple beside us and the guy had an unpleasant odour.   Near the end of the meal when our dessert was arriving, the waitresses cleared the table but even cleared dishes where we did not finish. It was left for one of my friends who was clearly still eating. But since the dessert came with he sparkler no one noticed she took the salads and the rice and chicken away already!"}
{"text":"Delicious drinks - hybrid of classic cocktails with exotic fruit - and every dish we tried was yummy. I'm vegetarian and there was a lot of selection, not just an after thought like at many Toronto restaurants. I had the potstickers (which were probably my fave), the Chinese cabbage salad, and the OG cauliflower and pickled watermelon - so delicious and a good portion.   The service was friendly and warm. My only issue was that the food took a long time to come out. We ordered appetizers soon after being seated and they only arrived with our mains about 30 min later. The restaurant wasn't that busy, so it seemed like they must have forgotten.   That said, I enjoyed my experience and would definitely go back."}
{"text":"This is my 2nd time here for brunch this summer. It's rare I circle back but this is Dave's fave place for fried chicken and waffles and I'm pretty crazy about the eggs Benny.   My first time there was phenomenal. The hostess was super nice and because we got a seat by the bar, we chatted with her most of the time. The patrons and bartenders were also pretty friendly, and it was honestly the best time I've had at a restaurant in a long time.  I tried the eggs Benny with beef patties. It was delicious. Hollandaise was creamy. The eggs were poached perfectly and the parties were hands down, the best I've ever had.  Why? The filling was all beef. Super delicious!  Dave got the chicken and waffles. He loves the white sauce that comes with it. The chicken is lightly breaded and cooked crisp on the outside, moist on the inside. Packed with flavor. The waffles are broken into bite sized peices, ideal for dunking, ideal for eating the entire meal with your hands, as he did.  I tried the Cesar made with jerk seasoning. Dave got the coconut jelly with a shot of Appleton.  Everything was yummy.  The second time around was on the anniversary brunch event. They had steel drums and a few complimentary items like a toasted corn with coconut creme and a rum soaked watermelon.  Both were good. I will probably try to replicate at home. We had the same entrees as before but for dessert we tried the cookie butter french toast. Not too sweet and not dense like some places. Even Dave enjoyed it and he never goes for french toast.  Drinks I tried the mimosa made guava juice- yum! Dave had the trade wine which tasted like liquid candy.  I definitely will be trying the dinner menu soon. Great location, quiet on a Sunday morning... Plenty of places to walk to after especially after such a delicious meal!"}
{"text":"Not as good as I remembered it to be a before the reopen.  Jerk was undercooked (literally), bland and the skin slid right off with more of a salty flavor than anything.  Asian salad nice with the plum dressing.  OG cauliflower underwhelming and not crispy.  Drinks were good.  There's a lot of far better Jamaican food out there and they need to step their game back up as the cool scene at the resto only goes so far."}
{"text":"I made reservations for here to have dinner with a friend before a concert. I've been wanting to go here for some time so was excited. It wasn't too busy when we went in for 10pm and were seated right away. It's very small & super loud. A good place to go may be with a group, but my friend and I had to lean across the table and yell in order to hear everyone. It didn't help that there was a super loud talker across from us who literally screamed every word the entire time we were there.   We ordered what we thought would be shareable food. So went with the cheesy jerk potatoes, jerk chicken chow mein & the trini green prawns. The prawns were the best part of the meal! I wish there were more on the plate. It had some wicked salad type stuff with it too. No clue what it was, but the combo of it with the prawns was dope. The jerk potatoes were good too, but too salty. Despite it being a pretty dark atmosphere, you could see all the sea salt on these & taste it even more. The cheese part to it is a bowl of fondue. It wasn't smooth and melty like fondue so it ended up being dropped in lumps on to the potatoes. It would be nice if there was a way to keep it warmer, as they leave it at the table but it's kinda useless after a few seconds. The jerk chicken chow mein came out & looked amazing. But the taste just wasn't for me, or my friend. To us it had a bitter burnt taste to it. Which is ok cause not everyone is going to love everything. So at no point am I saying it's not good. It just wasn't for us. The server noticed how much was left and asked, so we told her it just wasn't our thing. We ordered the French toast, which they comped us since we didn't care for the chow mein. That was cool, cause they really didn't have too. The server also said that the chef tried our  chow mein & said it was fine. We found it weird that he ate food we ate from, but ok lol whatever works.   I'd go again, Maybe with more people. There's way more on the menu I'd like to try. Price was decent so no complaints about that. Overall, a cute place & would recommend it to anyone that enjoys good food."}
{"text":"Came here after work for dinner and drinks on a Friday night. Make sure you make a reservation well in advance because this place seems to book up fast. The restaurant has a cozy and chill vibe, but let's just dive straight into the food because that's what you're interested to know more about, right?  We ordered the Jamaican Patty Double Down, Chinese \"Pineapple\" Bun Burger and the Jerk Chicken Chow Mein. The Jamacian Patty Double Down and the Jerk Chicken Chow Mein weren't that memorable to be honest, but the true star of the show was the Pineapple Bun Burger. Think of it as the Asian counterpart of the McGriddle at McDonald's, and I mean that in a good way. The pineapple bun adds a hint of sweetness as you sink your teeth into two super juicy patties. They even threw in some hickory sticks for some smoky flavour I'd assume, but I could've cared less if they were there or not because that pineapple bun and meat combo had my full attention... Onion rings on the side were great too.  Verdict? Get the burger. Also, got a tip from a friend that the fried cauliflower dish is really noteworthy. Will have to try that next time!"}
{"text":"Cute fusion restaurant, good but greasy food; wish they served drip coffee.   Food - I had their quinoa fried rice $12. Portion was equivalent to a typical Chinese restaurant (big for a western restaurant). Crispy, tasty, could have gone a bit easy on the salt and oil.   My friends had: Half. Portion chicken and waffle, if it had any more chicken she wouldn't have been able to consume it all. Light fluffy waffles. Another friend had their crepes topped with rum raisins and toasted marshmallows (no Nutella d/t nut allergy). Portion definitely could have been more sizeable but it was a pretty tasty mix.   Service - Average, friendly and courteous. Wait time to receive our food was average but they didn't bring all our meals out together."}
{"text":"I would give this place a 3.5 if I could.  I really wanted to love this place because well, Jamaican-Asian fusion sounded totally amazing.  I had high expectation before coming here since I've seen many recommendations of this place on Instagram. The food is indeed creative and the presentation is excellent, but the food  didn't impress me at all. The jerk chicken's not even as tasty as Ritz'( the carribean fast food restaurant, not ritz-carlton).  I'm still glad that I tried this place, but the food is not good enough for me to come back (partly because of the location too)."}
{"text":"been here twice, once for dinner and once for brunch. I definitely thought the dinner items were better than brunch. we had the fried rice, fried chicken and kimchi perogies...all yummy and great flavours. for brunch, we had fried chicken and bubble waffles and the eggs benny on Jamaican patties, personally it was only ok. I'd definitely return for dinner and try some other menu items"}
{"text":"Ate at Patois this weekend and was really impressed by the food but seriously disappointed by the service, and in particular the manager.  After being asked to change our reservation to 30minutes earlier we arrived on time and were seated at a large communal table positioned near one of the speakers.  The music was loud for us, so we asked our server if we could be moved to a nearby table which was empty.   This seemed to turn into some kind of big deal and our server needed to consult with the host and the manager before telling us that the table was reserved...which seemed to make no sense as we were also a reservation of the same number of people?!  The manager ended up coming over and explaining that the table we hoped to move to was actually going to be split up to accommodate two smaller parties.  Instead, they kindly offered to turn down the music and did.    Not more than 10minutes later the reservation we had been told about arrived and sat at the table we had inquired about moving to. Unlike the two smaller parties the manager said would be seated there, instead they seated a party of the exact same size as ours. We were annoyed and asked to speak to the manager again, not to insist we be moved but to express our frustration that we had been told one thing and then observed something else.    To our dismay, the manager couldn't have been less interested in our frustration and made no attempts to apologize for not moving us to a table which was clearly available.  Rather, he made some lame excuses about how the seating situation \"was very complicated\" as some people cancel reservations at the last minute and the restaurant must adjust. He also tried to explain that he had \"nothing against us\" (which we didn't actually care about).  He was dismissive and patronizing; and we were in disbelief that he had been so unaccommodating and disinterested in trying to improve the experience for customers.   That being said, the food was great (if not a bit slow to come out) and the server very kind (if not a bit clueless)."}
{"text":"Hands down the best dish was the brussel sprouts and their hot sauce was actually hot. Definitely order food to share as the meals come out of the kitchen as their done, not all at once. This also meant that we had to wait very long for some dishes (like the curry goat).  The jerk chow mein was huge, with an interesting taste. It came out on the crispy noodles, and then the sauce cooked and softened them. The juicy jerk chicken was really good and very spicy. Their hot sauce game is on point.  I'm taking a star off though because one of the staff members behind the bar was very unprofessional. She had blond hair and seemed to be in management (because she was talking about her coconut suppliers). She had seated a couple of drunk guys up at the bar and was very flirty and loud to them the entire time. She got them a drink in a coconut and was complaining about their suppliers. She was making fun of their local Asian supplier from china town and was complaining about them. I'm not one to get easily offended but she was being very rude and racist toward them while being overly flirty and unprofessional.   I would say I wouldn't really recommend this place ever though the decor was nice and the food was good. It's very busy and their staff is overworked for the most part. There's honestly better places for Chinese and jerk food, and they don't have a rude bar rail."}
{"text":"Yardbird special:  Jerk chicken was pretty good.    The fried chicken was really good. The accompaniments were a nice touch.    The fried rice was WAY too salty.    We were told it wouldn't be enough food for two people, but it was just right.    Good service.  Great music."}
{"text":"Still thinking about my yummy food. Only could grab a late reservation for 10 pm with my girls. We got there but had to wait to be seated. It was pretty crazy in there and super loud. I couldn't come to a Jamaican restaurant without getting a red stripe. Finally after about ten to fifteen minutes we were seated at a table that was right by the open door which made it worth it for such a beautiful night. We got the double patty without the bacon and it was so tasty. It probably could gave used more beef inside but it was complimented so well with the Swiss cheese. I wish i had it right now. For the main we had the jerk chicken chow mein. My goodness was this spicy. For someone who is west indian this was a bit intense but I still enjoyed it. The sauce softened the crispy noodles which i do love. It definitely encompassed the whole Asian fusion of this Jamaican spot. I would definitely come back but I think I'll avoid coming on a Friday night as the service was slow which i can imagine was due to how busy it was."}
{"text":"I've never eaten anything like this before now and Im amazed. The most amazing oxtail with rice , fried chicken was nice and crisp yet not oily, cabbage salad was so nice and crunchy . The only drawback was the jerk chicken chow mein had more mushroom then chicken in it. I will definitely be back for more drinks and more eats"}
{"text":"I heard the buzz about this place, follow them on instagram, and loved the whole concept (Jamaican/Chinese food). When I had a chance to visit Toronto and forced my friend (who's been a couple of times) to reluctantly take me.  The place is somewhere you'd want to go with a group of friends to chill out. It has a nice vibe though it's trying a bit too hard. The food is very interesting and very chinese / jamaican inspired. You have dishes like fried chicken with hong kong waffles, or jerk shortrib sandwiches. I had the shortrib sandwich. It was pretty bland and I tried the other dishes and no one at our table seemed impressed.   I think this place is great if you're in the area, and I think it's great if you're going to start off your night. Avoid brunch."}
{"text":"The ambiance, music, service and general vibe of Patois is great, and that's why it gets 3 stars.  Unfortunately, I had higher expectations coming here based on the hype and was a little disappointed.  The food was very average.  It's a \"family style\" restaurant where they encourage sharing. The jerk and fried chicken plates stuck out to me because well, who doesn't like either.  Fried chicken was excellent, but not enough for me to say \"wow, this is so much better than popeyes/kfc\".  The jerk had a great spice to it - definitely the highlight along with the patty appetizer.  We tried their spin on chinese-jamaican fusion in the jerk chicken chow mein.  It's essentially guang-dong chow mein with jerk chicken substituted for the meat.  This was insanely salty and I do not recommend it however appetizing it may sound unless you adore salt.  I've eaten my fare share of chinese-jamaican meals and it's typically either chinese food or jamaican food.  I can't say they go well together mixed."}
{"text":"I would not recommend this place for brunch. They are EXTREMELY busy and therefore do not guarantee that your food will be served along the rest of the dishes at your table. Also, beverage and food orders, along with beverage delivery were not timely at all.  The attitude of the staff here was also that pleasant or accommodating. Understandably it's because they were busy but the service and hospitable part of their role was lacking.  As for food, the menu is interesting but small. Be prepared for a hefty bill as well as everything is on the higher priced end.  I don't believe any of us will be returning."}
{"text":"Food: 8/10 -- Value: 7/10 -- Service: 9/10 -- Ambiance/Dcor: 8/10  Standouts were definitely the Jamaican Patty Double Down ($7) and Cookie Butter French Toast ($11). The Jamaican patty is small, so you could share it if you only wanted a taste, but if you want all that deliciousness to yourself, ordering your own is not a bad idea.  Dirty Fried Rice ($12) was a straight forward Asian fried rice dish (that you'd get twice as much of at an actual Asian restaurant for this price) and the Crunchy Chinese Salad ($10) was a salad with sesame seeds and crunchy flakes; pretty uninspired. The half order of Juicy Jerk Chicken ($13) was not really my cup of tea, but at least it wasn't dry. I would probably have enjoyed the fried chicken more. A half order is a quarter of a chicken, which is too little.  As the dishes came out individually, they didn't really feel like they were worth it, but when the bill came to about $35/person, I was pleased that I got to try five different dishes. There were a few other things on the menu that sounded enticing too, so I wouldn't mind coming back."}
{"text":"Interesting flavours. Mad fusion. Bit $$$.  Swanky place that requires reservations. It's one of the boom spots west of Bathurst right now.  Flavour profiles are ingenious and mix many different styles together. We tried the \"whole shebang\" for 4 of us and needed to order dessert to get full. The pineapple bun burgers and spicy deep friend cauliflower were the stars and you should definitely order those dishes. Fried  chicken and fried rice was good but pedestrian. I would probably not order the whole shebang again. Lots of other more interesting dishes to try on the menu.  The vibe and clientele are just about as bohemian as you would expect in a joint that mixes Chinese Hakka, Jamaican, and modern trends to uptempo beats and cocktail swagger. This place offers an experience unlike any we've been to in this burgeoning west end food scene, but at the higher price point it's not one we can frequent too often.   Definitely worth a try, but plan for $60 a head with drinks and dessert."}
{"text":"My friends and I wanted to fall in love with this new restaurant, but I'm not sure we left even In Like :(  We feel like we paid a premium for little better than cafeteria-grade food.  All fillers, no killers.    We were 4 Chinese-y Jamaican-y people and ordered almost everything off the menu to try except for the pasta and fried cauliflower.  First things first, the most egregious oversight was the watery rum cocktail (!)  How can a Jamaica-related place get something that important that wrong?  When we asked the server what kind of rum was available, she only knew to say, \"Bacardi?\" When we let the staff know, there was talk of \"concern\", but our next cocktail was also watery.  For $9 -$10 a drink, if anyone has ever had the Who-Shot-Ya elsewhere, you will leave El Sober.  The fusion names of the food were often more interesting than the food itself.  Didn't live up to its swag.  It was more dry than it was tasty (the little patties that looked like  sliders); fried chicken with watermelon pickles sounded exotic until it was conventional and watery.  Things were too small to be satisfied with for one person let alone to be shared (even with multiple orders). Tiny portion of ackee and the skimpiest salad, ever.  The charcoal grilled burger on the pineapple bun with Taro root home fries, albeit small, was the one yummy thang.    At one point the chef (owner?) came out to deliver the food and asked what stood out --after finding out that we had ordered everything.  Not one of us, could think of what to say :/ (gulp!)  We wish we could have.  Toronto has some amazing restaurants that have cropped up in these last years.  If Patois hopes to get our night-out dollabills, they really need to step it up.  Did they even do market research on how amazing the food is around Toronto??  Groovin' music, tho.  Needs more knowledgeable staff and stiffer drinks.  Things could have / should have been stellar.  We might be back under a different food and drink menu.  But probably not."}
{"text":"Decent but nothing AMAZING - teapots full of coktails are fun idea."}
{"text":"Called on a Thursday evening around 8:45pm and took 9 minutes to reserve a table for three people!! I was put on hold three times during these 9 minutes! What does a girl have to do to get a reservation around here??"}
{"text":"I was looking forward to this place for quite some time, Ended up going and realized during lunch hours they have a brunch menu. You cannot order from their dinner menu.  After ordering full rack of fried chicken (5 pieces ), I find this place might be a little over-rated. It was good fried chicken, but trust me there are lots better. I would pick stockyard's or even Korean Fried chicken over this item any day.  Had a scallion burger, which was an open concept . My baked potato's were hard, as the shell could have actually broken my teeth. It was a small portion as well. Very Very tasty tho.  Eggs benedict was by far the least impressive, a costco patty with 2 boiled eggs and process cheese melted on top was not even close to the $13.50 pricing taht it was charged.   I must say it is a cool little place with a pretty young and trendy crowd. It was worth the experience, I might go back just to try the dinner menu. Looks delish! however if you want fusion brunch with a Caribbean influence. I would much rather prefer 3030. I find they have more options and better bang for your buck."}
{"text":"Awesome. Oldies with a chopstick licking good twist, great drinks and vibe.  During a quick trip back to TO, a friend mentioned I should try this new joint that serves up Chinese Jamaican food. Not having had Chinese food nor Jamaican food in a while I wandered up to Bathurst and Dundas to find a small joint with a fun, modern deco Caribbean vibe - not exactly what I expected in the area.   Starting with some TGIF drinks, they had a decent beer menu, but the cocktails were awesome. You can even get them in a \"teapot\" which is not only cute, but great value - I think there were like 6 or 7 drinks in there. Try the one with 5 spice and ginger beer, and thank me later. (seriously, Yelp Thank You's are appreciated :) )  Between a few of us we tried a lot, but the real winners here are the Dirty Fried Rice, the Jerk Chicken, Double Down Patty and burger.    You know when you expecting something to be a certain way, but then it's not? Like when you're sure your parents bought you another sweater for Christmas, the box is the right size and shape, but you open it up and you find out it was a camouflaged box and inside is the most awesomest Ninja Turtles toy ever (true story). That's my impression of Patios. Everything has a familiarity to it - but with a twist that makes you think, \"wow, that's different\".   Case in point, the fried rice: looking at it you think, \"this is going to taste like every other fried rice I've had in my life\", but when you take that first bite: BAM. It's got this nice sweet twist that I can't put my finger on. But it that makes you think, why isn't fried rice always made like this?   Now the burger... man... the burger is done with a pineapple bun (in Chinese, it's called a bo lo bao), this awesome Chinese bread with a slightly sweet/crunchy/bready topping that just about every Chinese kid loved growing up. Throw a double patty in the middle of that thing? Brilliant.   If you're like me and have a thing for rotisserie chicken, you'll love the jerk. It's not your typical jerk chicken that's slathered in sauce, but it's well spiced, a good flavor without being overwhelming, and juicy as heck from the rotisserie. Pair it with a spicy (as heck) sauce, and you got a winner.   The double-down patty is twist on Colonel Sander's invention, throwing a thick slab of good-ol bacon and melted cheese between two Jamaican patties. Seriously, throwing those ingredients together is like using a cheat code.   Being away from Toronto for a few months and coming back, it quickly reminded me of the awesome food we have here and the familiarity of the food gave me a sense of deja vu, combining oldies I loved with a new twist."}
{"text":"Nearly a 5-star experience for me (if only Yelp would allow 4.5 star ratings, cuz that's what I'd give it).   I didn't bother looking at reviews for this place before setting foot in it. I let a cousin of mine pick the meet up location and this is what she chose (of course I should've trust her judgment as she's an even bigger foodie than me...check her out on YouTube \"mtlfoodsnob\"). So glad we went. Loved it!  Lobster (from Features menu): Got the lobster cuz that was the one thing my cousin wanted. We really enjoyed it. Reminded me of Hua Sang's style of lobster where it's a dry deep fry batter and then seasoned. This one had jerk spices and ritz crackers which gave it a unique flavour profile. I really enjoyed it. You need to be prepared to get your hands dirty and spend more time at the table working on it as it's literally a whole lobster chopped into manageable pieces but still requires diligence and work to get all the meat out. They provide a wet nap and lobster eating utensils. The only thing is, it's quite salty/strong savoury flavour so I think it would've been better if it was served with a bowl of white rice as eating it by itself just didn't feel right.   Juicy Jerk Chicken: -get the half size if it's just two people and you want to order several dishes to sample the menu as it's a good sample size (about a quarter chicken) -I really enjoyed the seasoning and it was BBQ'd to perfection   Double Beef Patty (I don't remember the exact name of this dish, it was the first item on their menu): -though the name suggests two parties, it was more like one regular size patty cut in half and stacked one half over the other layered with cheese and bacon so portion size is small  -an interesting way to dress up a beef patty (also available in vegetarian patty) - simple but enjoyable  Coconut juice from a whole, fresh coconut: -LOVED IT -I was expecting a very bland and meh coconut but was blown away at how flavourful and sweet the juice was! We questioned whether sugar was added but I'm pretty sure it was just naturally that way  Side note: Not sure if it was the garlic dip from the juicy jerk chicken or something in the lobster but I left with very bad breath! I've brushed my teeth and gurgled mouth wash and it's now the morning after that I'm writing this review and I can still taste whatever I had in my mouth (and I know my breath was bad because I came home and my husband told me right away).   For future visit: Next time I come back I want to order everything on their menu for $115 (good for 3-4 people). Although it's not really everything on their menu, more like just half their menu because they have two pages in their menu for food, the first being the Features and the second being the traditional selections. Not sure if Features get changed every now and then? Anyhow, I'd want to try a few other things on their featured menu too like the chow mein which I passed up thinking it wouldn't be good but after seeing another table order it, it definitely looks good (noodles look super crispy the way I like my chow mein)."}
{"text":"Love this spot! Every dish was a hit. We had the Jamaican double down, O.G. friend chicken, jerk chicken chow mien, prosperity jerk lobster, and stuffed French toast for dessert. The jerk chicken chow mien could have had a bit more chicken, but otherwise still great. Also drank some rum punch that came in a tea kettle that was delicious. I can't wait to go back and try some more items!"}
{"text":"Yes and no.  There are some things I like about Patois and others that sort of turned me off.    The place is rather busy, kind of noisy and crowded.  Normally that's a good thing because people won't necessarily congregate in places where the food, ambiance, service and overall vibe doesn't do it for them.  It's understandable why Patois is busy and I think it's because for most it's an enjoyable place and I have to agree with that.  I've seen line ups for this place on some evenings.  It seems pretty popular for a place that's only been open about a year and a half.  The things that put me off were still there though and as I do, I will honestly say what they were.  My first issue is how the chicken was served.  I had ordered a \"full order\" of OG fried chicken while my friend ordered a full order of Juicy Jerk.  Now while I see the words full and half in the same line I'm thinking well, full chicken?  Half chicken?  There is no real description of how much chicken you are in fact getting when you choose to order.  As opposed to say Kanpai Snack Bar, the chicken is explained in 3, 8 or 12 pieces.  For the most part you know generally how much 3 or 8 pieces of chicken will be, size wise because you want to order accordingly for yourself and others right?  My full order of fried chicken was in fact 5 pieces.  I had held off starting because I wanted to ask the server if this was in fact the full order or half.  She replied it was the full.  I had asked what exactly is a half order then and she said it's a quarter chicken.  So why the ambiguity?  Why not on the menu call a full order a half chicken and a half order a quarter?  That or be clearer on how many of pieces there are per order?    This is where it becomes convoluted.  What I received from Patois for full order was 2 drums, 2 thighs and ONE unsplit wing (5 pieces).  Now if a half order is supposed to be a \"quarter chicken\" how to you cut 5 pieces of a \"full order\" in half for the half order?  Also is a quarter chicken actually an actual quartered chicken?  Quartered being a quarter of dark or white meat?  This full order I received had no breast... you know the largest piece with the most meat on it...???  My friend's full order of Juicy Jerk that we shared (we shared each of our chicken orders)... we were wondering where the breast was and we found it here instead.  It was one drum, thigh and basically the rest was breast and the amount of meat overall was visually double in mass to the fried chicken.  The Juicy Jerk IMO was much better overall, taste, quantity, all around goodness.  While the fried chicken was OK it IMO it wasn't worth it.  5 pieces for 19 is the same price as the Jerk.  8 pieces at Kanpai is 25 dollars.  That's about 4 dollars vs 3 dollars per piece.  I can't finish 8 pieces at Kanpai but full orders split (half jerk/half fried shared between 2 people) I was still hungry.    I arrived earlier than the rest of the table and I had a Mad Tom's IPA and it was served in a sifter.  It clearly stated 16oz on the menu.  The drink I received was visually almost HALF head (see photo).  That pour was poor to say the least.  I didn't say anything but I should have.  I ended up ordering another when we moved to the table and the next one was fine or better as it seemed to be about 80% full and 20% head.  Obviously there is a consistency issue there.    Overall the food was good.  The Juicy Jerk alone is probably their feature item.  I could see this being the star of the menu, that or that pineapple bun burger which looks great.  The fried chicken while good didn't overwhelm and seemed pricey for what we were served compared to many other places in the city Kanpai being just one.  The serving size of the chickens (both) I find misleading and out of 5 pieces of chicken for something called a full order the count was 4 dark pieces to 1 white piece (the smallest white piece) for the fried chicken.    The service seemed friendly and the place is crowded so it can get loud.  I was in good company at this establishment and the table basically ordered many different things so I was able to see much of the menu.  The burger looked really good and the Jerk was very good.  The OG fried chicken again, better value elsewhere and nothing that special about it.  That being said I would come back but only for the Jerk and I'd like to try their burger.  If I order beer I'll be sure to keep an eye on the pour and say something if I have to.    To me there's little things that shouldn't be forgotten.  Expectations for amount of food (worded ambiguously or deceivingly) or pouring half a beer and serving it to me will make me not so happy.  Not so happy me turns into a 2* \"I've had better\" review."}
{"text":"Fusion - the dirty F word in the food world.  Susur Lee was the first one who did it right in Toronto some years ago.  Well ladies and gentleman, in the year 2014 it is chef Craig Wong, chef and proprietor at the newly opened Patois who is doing it right!  Patois is serving up Chinese-Jamaican drawing from his family's roots; they go back three generations in Jamaica.  Wong is genius to skew his cuisine more in the direction of Jamaican than Chinese, because let's face it - the best Chinese food is often cheap, quick and dirty and there really isn't a heck of a lot of differentiation from one joint to the next.  But while Wong is cooking Chinese-Jamaican food; he wants to clear the air that he isn't a Chinese chef; he's French trained.  While the dinnerware will look familiar to any person of Chinese background (read, we all got it at Tap Phong or somewhere in Chinatown at some point); Bob Marley is not part of the soundtrack.  I don't really know how to describe the vibe, other than familiar.  The inflatable buoys are reminiscent of the random knick knacks you can find in Chinatown and I love the large table with the Lazy Susan on it though admittedly it's not the same tacky stuff you'd find at your usual Chinese joint.  The cocktails are pretty good here and you can even get them in a tea pot (the way Chinese restaurants who don't have proper liquor licenses serve up beer) for $40.  I really loved the Trade Winds cocktail, their take on a dark and stormy, enhanced with Chinese five-spice and garnished with a cherry.  I'm a sucker for drinks with cherries in them!  On another night I opt for a \"showy\" drink - I literally say this because I was served an entire coconut with a shot glass serving as a funnel for your choice of booze to be poured into it.  It would've been more awesome if half of my rum didn't end up seeping out of the coconut and all over the table.  In the end I was mostly just drinking coconut juice.  The winning dish for me is none other than the juicy jerk chicken, done churrasco-style and it lives up to its name.  You can go for a half order at $11 or a full for $17.  There's also the O.G. fried chicken.  It's not bad but if you ask me I'd say go for the full jerk and if you're still craving fried chicken - get your fix at KFC after.  Oh and in case you were wondering, the O.G. fried cauliflower is simply a vegetarian iteration of the former.  Specials don't rotate often and currently consist of a piranha steak, done on a sizzling plate like you'd find at a cha chan tang (???), or HK-style cafe, a clam bake, jerk chicken chow mein and crispy nori green beans.  I loved the razor clam bake with the season's sweetest corn, shrimp though regrettably I am not a fan of breadfruit, which I associate with cardboard (albeit, a flavor-absorbing one).  Unlike the chow mein which looked like it was seriously lacking in the sauce department, the piranha steak was brimming of it.  A bowl of rice to soak up all the sauce is definitely recommended.  While the flavor is most definitely there, I can't say I was a fan of the cut - it was just too lean.  The usual flank would've done just fine.  Definitely save some room for dessert because the jackfruit fritters are not to be missed.  Rolled in sugar and lightly drizzled with condensed milk, it is a dessert that is so light and airy that you almost don't feel guilty eating it.  Hey - there's fruit in it right?  Other dishes I tried were the kimchi potstickers - pierogi-style which were yummy dumplings though lacking in kimchi flavor and the dirty fried rice which again was tasty though a little \"wet\" for a fried rice.  I don't know what the word for delicious is in Patois, but as they like to say in Cantonese it's \"ho ho mei (???).\"  Like the food that I grew up eating in my grandmother and mother's kitchen, it was unapologetic when it came to flavor.  The vibe is fun and you'd be hard-pressed to find a seat from Thursday-Saturday without a reservation.   So make a reservation, grab 3 friends and do the Whole Shebang (the entire menu) for $99.99."}
{"text":"TL;DR Food: SO AWESOME!!! Service: Really good, quirky in a cute way.  Tuesday night, the place is packed. Many of the tables are long communal ones, we were seated at one such table. We had been sitting for about 10 minutes next to a family whose matriarch was surprisingly loud. I didn't know this but the person who made our reservations asked for a quieter table, if possible. The hostess actually realised that she had mixed our reso up with another, came back to us and seated our party at a detached 4-top without being prompted. Though the experience would still have undoubtedly been excellent, this was a big bonus. Overall the service was very relaxed but also surprisingly attentive without being overbearing in the least. The servers all seem to run each other's food and each one was knowledgeable and delightful to interact with.  The food was incredible. I approach fusion cuisine with caution but Patois nailed it. My favourites were the shrimp/scallop balls which were delectable, juicy and SO FULL OF SEAFOOD!! and the jerk cauliflower which was basically the best vegan popcorn chicken you'll ever have. I could have eaten an order of the cauliflower to myself, but we were sharing.... Otherwise the corn with miso butter and coconut emulsion was tasty and surprising; the crunchy salad had a really nice contrast in textures and was dressed perfectly and subtlilty to accent the flavours of the vegetables without overshadowing them. And finally the jerk chicken was tender and juicy and delicious... Aptly executed.  For the 3 of us, it was a perfect amount of food, brought gradually in a timely manner, good pacing. We let the waitress explain the desserts nonetheless. What an adorable moment it was... I think she really, really likes the desserts. She went from sporting a huge grin to laughing outright, having to pause before she could continue explaining. Needless to say I'll definitely be coming back, but will leave room for dessert, next time."}
{"text":"This review is for the food alone because the service was a little lacking. So, while looking for a nice brunch spot while visiting Toronto, this place was chosen. And the food was pretty amazing. I ordered the cookie butter french toast. I was a little puzzles when I got my plate. It looked like two pieces of bread that might have the butter inside and fries golden brown. Once I cut into it, I found a few more layers of bread and butter. It was served with what they called golden syrup (it taste like Aunt Jemima brand, seeing as this is Canada, I was hoping for a more natural maple taste and texture).  But aside from the questionable syrup choice, that french toast was very good. I had a side of sticky, spicy bacon that did not disappoint. If I'm ever back in Toronto I'll definitely be back for more cookie butter stuffed French toast!"}
{"text":"Came here to try out something new in the west end of the city. Great experience, very lively and super friend staff. Our server was great at recommending things on the menu and we were not disappointed. The drinks here are also pretty cool. Great place to hangout! Would definitely be back to try out their other drinks n foods. They also have an option to order everything on the menu for $114 (feeds 3 to 4 people), not bad for the quality of food."}
{"text":"We've eaten a LOT of things during our time in Toronto and I have to say, the jerk spam from Patois is one of the best things we've had. It's an explosion of flavor, but it all works together perfectly. This sandwich has singlehandedly brought my wife around when it comes to spam. Thank you Patois!  We also tried the jerk chicken, with was flavorful and juicy. It had a great kick to it. Especially the well-sesaoned skin. The skin also had a great texture, and avoided the fatty trap that roasted chicken skin sometimes falls into.   At my insistence we also tried the Jamaican doubledown, which was truly indulgent thanks to the bacon and oozing cheese sauce.   Finally, as good as the food was, it was the service that blew us away. We waltzed in without a reservation on a Friday night. We figured we'd have to wait, and perhaps for a while. But they were super accommodating! Yes we had to wait for a few minutes, but we received regular updates on how things were going and we were checked on frequently as we hung out.   All in all, it was a top notch experience that I'd heartily recommend to anyone!"}
{"text":"I found a sharp shard of glass in my salad and they still tried to charge me for it.  Aside from glass in my mouth, the food was just ok. Ordered jerk chicken chow mein and could hardly taste jerk seasoning, the ox tail was also disappointing. Overall this spot did not live up to expectations."}
{"text":"Decor was funky and music vibes were great. The server was friendly throughout the night and would joke around effortlessly.   We ordered the Whole Shebang with a group and needed to make reservations beforehand. It would be hard to grab a table for a larger group if reservations aren't made since it gets rather busy on a weeknight.   The food was A-OK and I was surprised to see $10 Wok Fried Gailan on the menu frankly. A must order would definitely be the OG Fried Chicken and Fried Cauliflower - those would be the two things I would come back to try."}
{"text":"Ok I'm giving Patois a 4.5 stars here.  Why? You may ask and I might tell you.  There are a lot of positives and a couple of negatives which I will explain the latter in a bit.   Positives?  If the legendary Dinah Koo recommended this place then who am I to say no? Dinah just happens to be one individual that I have learned my crafts and desire for food.  A positive influence that created my base for cooking and the art and science behind food.  She is after all, the original Asian Fusion Queen of Toronto.  Google her history from the early days in the 60's from Playboy bar bunny to the creator of the original Dinah's Cupboard to Tiger Lily and catering maven who made Peking duck appetizers a chic must haves at lavish parties amongst Toronto's elites.   So with that I bring you Patois.  No slouch at creating Fusion Asianized food in the form of Jamaican comfort goodness.  The food served here blends Jamaican spice with Cantonese elements and the result is fun fun fun!  Pair it up with some cocktails or a coconut and rum drink with paper umbrella and you've got conversational stimulus to go strong into the night.   Sure you might see some reviews about negative noodles or bony oxtail but hey! It's their opinion and their experience.  When I tried some of those dishes I could say yeah, sure mmmkay. I chose a higher path as I tried to imagine how and why the chef created the dishes this way and the resulting execution.    So I do have one nitpick.  It's with many restaurants in the flavouring of the food they cook and with the usage of salt.  Salt is not the same from one variety to another. I think restaurants forget this. Which can result in some dishes in being overly salty for some.  This is a temperament and craft that needs to be honed better as a tasting skill. If they can fine tune that, this place is worthy of a 5 star beating.  Don't forget they have a great Cantonese place in Chinatown worthy of equal aplomb.  Typos free of charge because I'm jet lagged and suffering from foodie coma."}
{"text":"The food here is absolutely delicious, I don't know how anyone could give it a bad rating. The jerk chicken is consistently tasty, tender and juicy. The pineapple burger is unique and bursts with flavour. Those were the two stand-outs for me but honestly everything here is yummy. I like the low-key ambience as well. Thumbs up!"}
{"text":"Great experience and atmosphere. We tried a variety of menu items, but the standouts were: jerk chicken chow mien, Jerk Pork Belly, pineapple bun burger, and the fried rice. Overall all the dishes were excellent, great flavour, awesome textures on things like the noodles in the chow mien, and the crispy cauliflower.   Overall it was a great experience and I would recommend this restaurant to friends."}
{"text":"The food here is soooooo good. If you can't eat bacon you can't enjoy a bunch of there food so that sucks for you lol . This place is so good we got the whole shabang which has like everything on the menu ... The jerk chicken the fried chicken, the edemame the patties .... Man this place is so good"}
{"text":"Love this spot. Never disappoints. The staff are always friendly and the vibe is great. Lots of great selection on the menu so I've been back several times to sample something different every time. But my go-to is definitely the pineapple bun burger. Nice juicy burger with the sweetness of the Chinese pineapple buns. Definitely a must try."}
{"text":"Great experience at Patois! Excellent food. Awesome service. Solid value for similar style restaurants. Loved the ambiance of the space.   The lobster is one of the best things I've had in awhile!  The food and space is unpretentious with delicious and fun dishes to try.    I find the idea of value on Yelp interesting - why restaurants of particular food backgrounds are deemed suitable to charge what they charge but a Jamaican-Chinese inspired chef is supposed to produce 5 dollar dishes only?"}
{"text":"Patois is one of my favourite places to go in Toronto. The vibe is laid back and unpretentious, I've always had fun and attentive servers and let's not forgot THE FOOD. I've been so many times I think I've tried most things on the menu. The eggs Benny breakfast on Jamaican beef patties is insane, as is the fried rice, the jerk chicken, the double down, I could go on and on. It's not a place for a light, calorie conscious meal, it's the place to come when you need your cravings satisfied and you walk out with a huge smile. If you happen to go later in the evening, it's a great place to hang out at the bar for some delicious drinks with good friends. Make a reservation as it gets busy."}
{"text":"We had dinner at Patois (before the fire) and really enjoyed it.  Last Saturday, we decided to have dinner there - ordered the double down, prawns, oxtail, scallop and shrimp balls, dirty rice, O.G. Chicken. The oxtail stew was a little sweet, but everything was delicious, especially the O.G. Chicken, really tasty and not greasy.  Service was very good but music a little loud.  We will definitely return for more delicious food!"}
{"text":"Patty double down, dirty fried rice, and OG cauliflower are must haves. Great, casual spot for food that is truly unique!  Fun and quirky atmosphere with cute decor. If you're looking for something different, Patois is the place to go!  Another reason why Toronto has the best food in the world :p"}
{"text":"I tried their food for the very first time tonight. My sister, her boyfriend and I decided to try this place through UberEats. We ordered takeout from here. We ordered three items, the shrimp ball, half of a jerk chicken, and the dirty fried rice. I have to say, I am very disappointed. The experience was not good at all. The wait time was longer than normal and the portions to the price was definitely not reflective of the prices that they charge. For example, we ordered the shrimp ball. The shrimp ball was $7.50 on the menu and when we got it, there was only one shrimp ball in the order. The dirty fried rice was the smallest portion I have ever gotten and it cost $12. The taste of the food was only mediocre. The part that I was really put off was the jerk chicken, the chicken was not cooked through. I had a piece of raw chicken. Overall, I am very disappointed. I don't think I would even consider going to the restaurant after this experience."}
{"text":"Dinner for five on Saturday night. Our first time back since it reopened. Everything was amazing!!!! We ordered the \"Try Everything on the Menu\" and added a couple of extra items. We left it to the server to select the extras. She didn't let us down.  The server and chef did a terrific job of modifying dishes where the could to accommodate one of our gluten intolerant guests.  The atmosphere is fun, casual and loud. The food is as good as any restaurant in Toronto, NYC, Chicago... It is definitely one of our favorites. Must haves: burger, scallop ball, jerk and crispy chicken, perogies and the patties! Go with a group of four or more to try different dishes. So glad you're back Patois!"}
{"text":"This is the perfect place for some delicious comfort food! We got the whole menu option and were so happy we got to try the breadth of the menu. Everything from the kimchi potstickers and the fried chicken, to the pineapple bun burger and fried cauliflower is a favour to your tastebuds. The cocktails are yummy and the desserts are mouthwatering. This place is reasonably priced and a great place to go with friends. Even the pickiest of eaters will love this  place. Have been here twice now and can't wait to eat here again."}
{"text":"Very good food and interesting combination. Pineapple bun burger is a must try! Butter milk chicken is great. Everything else is not bad. If you like to try all their signature dishes, order the whole she-bang, which has a good portion of each of their popular dishes. The service is good except the restaurant is a bit crowded with poor air ventilation. Will go again."}
{"text":"Delicious!!!! Ordered The Whole Shebang with the extra chicken. More than enough food for 4.   Amazing flavours in everything we ate. Service was casual but great. Fun cocktail list. Overall a Super lively place with lots of communal seating. The rest of the night after we ate I couldn't help put jealously watch the people beside us order even more tasty food.   Far too often lately I've been to restaurants with bad service, overpriced food, boring cocktail lists. This is most definitely not one of them! Go Now!"}
{"text":"I'm so glad unique restaurants like Patois are opening up in my area.  I had a great dinner for two their last night.  It's a restarant to share and taste a little of everything.  The cocktails were great... The Jerk Chicekn is amazing! (A+) Jucy and full of flavour.  I also had the pattie appetizer &  a rice dish...also very good.  I do not recommend the crab dish, which was a special. Not enought meat/messy/greasy."}
{"text":"I came here for my birthday earlier this month and it was a really good thing I had made a reservation. The space is quite tiny and even with my reservation we still felt a bit squished at our table for two. It was quite a feat for us to travel down there from our part of the city and the cold weather and fact that we walked by the place twice did not help haha.  I was really excited to dine at this place because the fusion of Caribbean and Asian cuisine intrigues me. If I had been with a bigger group I probably would have splurged on their \"taste the whole menu\" meal deal just so I could try everything they had to offer. Servings were on the 'okay' side for what you were paying. I feel like your money goes more to the experience and the sheer unique-ness of the place/food. I do recommend ordering the jerk chicken chow mein (quite spicy) and the sriracha sweet & sour sauce that comes with the O.G. Fried Chicken was awesome. The dessert I ended up having was an interesting mix of pineapple and jalapeno sorbet with a coconut panna cota - the sorbet alone was an interesting taste, but paired with the cocount it was an amazing blend of flavours.  I'm glad I got to go and I would go again just for a chance to try the other things on the menu I didn't get around to. I only wish their servings were bigger because it was all quite delicious!"}
{"text":"I made a reservation earlier in the week for 3 of us to celebrate my husband's birthday. When we arrived we were shown to a table intended for 2, with a small metal chair added to the side of the table, very close to the opening of the staircase leading downstairs to the washrooms. The restaurant was half empty, and two other groups of three people were seated comfortably at tables that seated four people. There were empty tables of four available. We told the staff it was not acceptable, that had they told us when we made the reservation that they did not have a table to accommodate us we never would have come and did not want to spend our evening wit three people crammed at a table clearly intended for two people. The staff refused to accommodate us, and were completely indifferent. We left and went across the street to BENT, where we had a fabulous meal, and were treated like kings. When you go out for an evening, its not just about the food, its also about service, and in this instance, Patois failed miserably."}
{"text":"Loved it! Relaxed vibe. Tasty food. Creative menu! The staff were friendly and attentive.  The food was yummy - perfectly paired with cocktails. Had the fried chicken, the jerk chicken on fried noodles and coleslaw. The coleslaw on its own lacked seasoning but paired nicely with the jerk. Definitely will return!"}
{"text":"The food is amazing and decor is creative. The culinary technique is quite intriguing. Fried chicken is one of the best ! It's a great casual environment to have a get together with your friends, not to mention drinks are good too."}
{"text":"Had a chance to check out Patois last week.  The chef/owner noticed a moment between when we were ready to order and a server was ready so he stepped in and explained the menu, took the time to listen to our questions and took our order. The food is exceptional here.  A perfect chinese/Jamaican blend.  For a quiet area,  sit at the back bar!"}
{"text":"everything was way too saucy for me :(  nothing to offset the balance... too fusion for my taste. imagine going to szechuan szechuan takeout, and getting JUST the meat only. JUST the fried stuff.  meh  for the value of the meal, i'd rather go to a four star restaurant.  Fried Snapbeans --too oily  Patty Dbledown --good, also spicy  Kimchi Potstickers ---boring and regular  Juicy Jerk Chicken --- salty  Fried Cauliflower ---not bad, taste like fastfood schezwan schezwan with crispy, saucy outside  Jerk Pork Belly ---not bad  Oxtail ---coconut rice that came with it was good, oxtail nope  Marley Jerk Chicken with Taro Basket  ---incredibly saucy, and came LAST. unfortunate, b/c it was so saucy and sweet, the taro basket wasn't enough and could not even mix with the other entrees. (imagine just having sweet and sour sauce ONLY).. --basket was good"}
{"text":"Such a cute spot on Dundas for brunch. Didn't know Jamaican Chinese cuisine was a thing but I like it!   We arrived here right when it opened at 11 and already it was buzzing with people. I have seen some of their food pics on yelp and was so looking forward to trying the pineapple bun burger which looks pretty darn good. So unfortunate that they don't have a version of this for brunch..  The chicken with HK waffles seemed like the next most promising option so our whole table ordered the same thing in a half portion for $13. Looking back I think a full portion may have been a better idea because I was left wishing there was more..   They know how to do their fried chicken right! Perfectly crispy on the outside and moist on the inside with just the right amount of seasoning. No one likes soggy cutlets drenched in oil and you won't find any here. The HK waffle was also really light and crispy and came with a condensed milk sauce which was a tasty addition. The small portion of salad they had on the side was fresh and refreshing.  Will probably visit again sometime to try their dinner service and get my hands on those pineapple bun burgers!"}
{"text":"Came here on a weekday night Was able to get a table without making reservation just a walk-in.   The interior is SO CUTE! Floaties hanging from the ceiling and a total tropical vibe! Even the glass of water comes in the cutest bright pink flamingo inflatable cup holder!  Started with the Jamaican patty double down, delish! Nothing fancy but it came out really hot and hit the greasiness satisfaction factor plus its covered in melted cheese inside so yum! The O.G cauliflower was good but not great, it was slightly soggy and served lukewarm on the colder side. The sauce was a bit spicy and the flavors were good though.   The jerk chicken was moist and not dry but again felt a bit lukewarm. The garlic sauce was also great with it and really bold. I liked it but a part of me thinks that the jerk chicken at regular Caribbean restaurants are much better for a lot less.   Lastly the oxtail was great, served warm and the flavors were rich and deep, so savory and meaty. I would definitely get this again. The rice was also great because it had plantains and was slightly sweet and salty. The bak-choy it came with was just plain boiled kinda plain.   Overall the place is trendy and the food is good but it comes with the price of being more than regular Caribbean restaurants. But the cute decor makes it very instal-worthy."}
{"text":"Cool Ambience. The servers were pleasant. Food was delicious! great Sunday brunch! Had the fried chicken and Hong Kong waffles num num num.   The place was tight in seating. I could clearly hear the conversion of the table beside me and also see and smell their food. It was so stuffy that servers were wiggling through tables and sometimes would drop or spill stuff.  This did not bother me, but I know it might for some people, so I thought I'd mention it. Maybe not a good place to get a baby in a stroller... :( might be a big hassle."}
{"text":"One of the only few restaurants that allow for reservations on the weekends! When our party of 8 arrived we were promptly seated. Cool, Hipster atmosphere. Our waitress was extremely helpfully and explained all the different dishes to everyone. The food came in a timely manner. Jerk Chicken is very tasty, fried chicken is sinful, dirty rice has great flavour.  My favourite? The Chinese \"pineapple\" bun burger!!!  It has two homemade patties, oyster sauce mayo served with yuca chips and a sweet and spicy red sauce on the side. Been dreaming about it since."}
{"text":"Went here for my bachelor party, and the food was INCREDIBLE!!!  The chef came out to see that everything was ok. He brought us a few items that weren't on the menu yet.   Super friendly staff. Great vibe."}
{"text":"We loved this place! The only reservation we could get was on the early side on a Saturday night- 6:30. We weren't sure what a combo of jamaican and asian meant. In this case it means absolutely everything is delicious. Very nice waitress, tasty cocktails. We got a few small dishes, the potstickers and a cabbage dish, and some mains a pumpkin soup and an oxtail dish with coconut rice. many wonderful flavors! Even the dessert, which was a drunken apple bundt cake, was marvelous. Would happily come back here anytime we return to Toronto."}
{"text":"Just wanted to let everyone know about this good restaurant. The food is great especially the Deep fried Lobster, my favorite! But please don't count on the restaurant to honour your reservation. They will simply give your table away to someone else and tell you that you should have written to them separately or that you should have known that they could give your table away. I made a reservation for  my party of friends and relatives  around 48-72 hours prior for a table for 5. This was done through Bookenda. No problem! We showed up at the restaurant about 5-10 mins ahead of our booked time and after a bit of confused looks by the girl ( ?Manager) at the front we were shown to the bar to sit on high bar stools. One of us in the party (71 years old) has difficulty climbing the bar stool which is really one of the main reasons for the reservation. When we pointed this out, the manager's attitude got somewhat rude and we were told in no uncertain terms that the Bar is the only place avilable and that if we didn't like it we could leave. I pointed to another empty table that was available, but I was told that this table was reserved for somebody else arriving in half an hour! There was no explanation as to why they would ignore our reservation, there was no attempt to make us feel better by saying please wait a few mins, have a drink or an appetizer on us etc. that a responsible good establishment would do when they make a mistake. There was not even an apology. Apparently this was all our fault. We were eventually given a table about 45 mins later. Food was good as usual, but the arrogance and business practices of this restaurant are very disappointing. Abe and Nimmi Abraham Toronto"}
{"text":"Food tasted great! - like I'd go back for sure. It's a bit pricier than I'd like to pay for any of these kind of items - it's kind of like how you pay more for tacos at La Carnita kinda thing- but I don't feel too jipped bc everything was cooked really well, tasted awesome, service was on point and they were timely with our reservation. It's a casual place despite the price point and didn't feel pretentious to me.  O.g fried chicken with the sweet and sour sriracha tasting dip (yum!), jerk chicken chow mein & the pinepple-jalapeno sorbet with coconut panna cotta & shavings were all delicious and noteworthy to me, and I'd eat again. Definitely try all of those if you are dining there!!  Overall, I'd give it a 7/10. I think they played it a bit on the safe side with the menu and tastes (nothing is overly spicy, a bit mild for my taste)...not as \"jamaican-y\" as I was hoping for?...like i didnt see any ackee anywhere...i didnt see any collard greens lol..but I get that it us a fusion resto so perhaps that is why.   I think they should have more items on the menu definitely and I think they really could be more affordable. ($20 for chicken jerk chow mein? Forreal?!)  So yeah...overall cool place to check out once or twice...save it for something eventful or when ur in the mood to break the norm."}
{"text":"My friend and I walked in on a Sunday night; had the pineapple bun burger and the dirty fried rice. Amazing! The waitress told us that the restaurant was tapas style and we should order about 4-5 plates to share, but we thought this was enough for us. I would have liked to try other dishes though, so definitely coming back here with a group.   Loved the vibe and the decor!"}
{"text":"Patois serves West Indian fusion and does a good job of upping the ante for West Indian cuisine in the city. All shared plates, we started with Scallop & Shrimp Balls w/ CPlus + Red Vinegar Gastrique and Crunchy Chinese Salad. The salad had a great texture and was crunchy throughout. We also had a full order of the juicy jerk chicken and some dirty fried rice.  This was enough food for two, especially since we indulged in dessert - fried waffle with cheesecake inside and mango on top. It was the biggest disappointment of the night, keeping in mind  everything was really good. I guess I just don't like my cheesecake fried.   Staff were accommodating and knowledgeable. The place itself is cosy and packed. Be warned: communal tables abound. If you are looking for a romantic spot this isn't it, but if you chat with your neighbours they might share a tip or two for what's tasty on the menu."}
{"text":"After visiting Eat Jackpot - I came to Patois with fairly high expectations. The concept is a mashup of Caribbean and Asian flavors that you would find at few other places. Similar to it's sister restaurant, Patois has a hip, eccentric aesthetic with a bar at the front.  They serve a number of different cocktails, including drinks served in a pineapple and in a coconut. I ordered a jelly coconut & rum and Mista Chin's Fancy Gin but ended up feeling disappointed with the drinks, particularly the coconut drink.   Patois has a wide range of unique carribean dishes with Asian influences. I ended up getting the jerk chicken chow mein, korean dumplings and goat double. The chow mein was okay - lacked flavor and was underwhelming as a dish. The dumplings were good but tasted like a basic korean dumpling - it was simply presented in a perogi style topped with a kimchi sour cream. Finally the curry goat was tasty but was similar to what I would expect to have at your typical Carribean restaurant in Toronto.  That being said, I didn't order a number of the other signature dishes- I've heard the Fried Chicken and pineapple burger are highly recommended to order.  Overall, left Patois feeling underwhelmed - good atmosphere and interesting concept, but not enough to make me come back."}
{"text":"Patois pronounced Paetwa.  I would've never known how to pronounce it. I'd normally say no to Asian Fusion but some recent establishments have made me change my mind. I was rather surprised to discover this little gem of a place that has Jamaican Chinese food.  It's a foreign combination to me, so I was open to trying it and glad I did.    The Pineapple bun burger was delicious, a mildly sweet crisp bun with a soft center and seasoned beef.  I probably could've scarfed this down myself but our table decided to share everything family style so we could try the entire menu.  The ackee and salt fish was a classic twist on some Jamaican truck food I've had in NYC.  I really can't say anything was my favorite on the menu, because all the dishes were equally delicious but what really stuck out was the chicken dishes.  Everyone at our table loved the fried chicken which was flavorful and the acoutrements of pickled watermelon and celery were the perfect meld of sweet, spicy, tangy, all rolled into one.  The jerk chicken was tender and moist with a zest of jerk spices.  Even the sides were well rounded, the OG fried cauliflower was so good.   We also had spaghetti alla vongole with black bean clams, chinese sausage and  it was pretty much gone by the time it hit the table.  What a combo, who knew!  I loved the decor, eclectic with the animal floaties and the coolest lazy susan at our table (think glass on skateboard wheels) with their logo underneath.  I also enjoyed looking through the old family photos of old Chinese generations in Jamaica.  I can't wait to come back and try all the new dishes they bring on and I've heard they have brunch now!  Watch out for their drinks, especially the Jamaican Shandy - it's strong!"}
{"text":"Patois is a place we've been meaning to try for some time.  We've walked by several time over the summer and the place has always been busy.  The night of our visit was no exception.  All tables were full during our stay and walk-ins were disappointed even as late as 10:30 PM when we finished our night.  The atmosphere is reminiscent of a surfer beach shack/snack bar.  Very fun, whimsical yet comfortable and inviting.  The staff were all friendly, pleasant and helpful throughout the busy dinner service.  Our waitress (who reminded me of Karen - Natascha McElhone of Californication) gave us some great recommendations.  The menu consist of a bunch of snacks/appetizers and sides that you pair up with a main.    We started with the double down beef patties, kimchi potstickers and both were great.  Add bacon to anything and it makes it even better if you ask me.    For our entrees we had the 1/2 jerk chicken a porkbell.  I was surprised how juciy and tender both were.  The jerk seasoning had just enough heat for just about anyone to enjoy.  I did find it to be a little salty for my taste but my partner thought it was fine for her taste.  All our sides (dirty rice, fried cauliflower and coleslaw) were good.  The cauliflower was exceptional but it you had to choose to eliminate one let it be the coleslaw.  We expected more from the coleslaw I guess.  Do not finish off your evening without dessert.  We were so full and even had leftovers to take home but could not pass up on the drunk apple bundt cake.  It was the perfect little bit of warm sweetness to end the evening and the rum was not overpowering.  We'll definitely be back and we will bring friends so we can try the \"whole shebang\" tasting/sharing menu."}
{"text":"Super friendly service but the experience was degraded by the $6 glass of pineapple juice. And the $12 mimosa.   Portion size was adequate but a bit pricey.  If I go back, I won't be having anything but water.   Brunch for 4 came out to $125."}
{"text":"Ackee fusion attempt:  I'm Chinese and love Jamaican cuisine. I visit family in Jamaica often and love the food culture there. Ackee and salt fish with bread or bread fruit is one of my favourites and Patois's attempt to change the classic dish explains why you shouldn't change something that's already perfect. The main reason why I think this dish fell short was because the ackee is lost in the background. Maybe because the ackee we get in Toronto is canned and not fresh is why the flavour wasn't there. Either way, I wouldn't serve this to someone trying ackee for the first time.   Chicken and waffle attempt: I'm a novice when it comes to this dish but I wasn't wow'd by Patois's but it was good. A few days after trying Patois's my friend introduced me to real chicken and waffles and it over shadowed Patois's. It feels as though you're eating them as 2 separate items rather than chicken and waffles smothered with sweet and hot sauce. My mouth watered typing that out.   The ambiance and dining experience was great though. The server was nice and patient and recommended some of his favourites. All the servers seemed genuine. I'd definitely go back for a beer and snacks."}
{"text":"Really freakin' good fried chicken.   We made a reso here for Saturday at 8pm. When we arrived, the place was already full up. They have seating for say 30 people in the back, as well as 8-10 bar stools and one table at the front. We were seated at the front, away from the other patrons but able to people watch on Dundas Street.  We ordered one order of the OG Fried chicken and watermelon ($18, shared between two girls) and two sides - the nori green beans ($12) and the waldorf salad ($8).  Fried chicken was delicious, not greasy and caused a lot of people walking by to stare and salivate. The chicken was served with a bunch of \"trinkets\" which were mostly not useful - except for a delicious sweet hot sauce.   The nori green beans were actually tempura green beans with some nori topping and a nice sesame tasting dip. These were really good. Waldorf salad was okay but for the $8 price point they should have made it just slightly larger - it was hard to share given tiny portion.  We tried a few cocktails which I cannot remember the name of - one with Red Stripe been and grapefruit juice, which was light and refreshing.  The service was good and the food came out quickly. Server was knowledgeable. Music and decor were decent - overall, a cool spot and I would go back for more chicken.  Overall good value too - we paid $85 for two people including tip and we had two drinks each.  (Completely off topic, but I'm really tired of reading \"I really wanted to love this place\". Let's get more creative people. 3 out of 8 reviews for Patois have dropped this atrocious line)."}
{"text":"Jamaican-Asian fusion? Yeah mon. Absolutely loved it.  First impressions: very cool vibe (but I'd expect nothing less from a trendy resto in this neck of the woods) and a nice selection of drinks. On a Sat at 10pm it was packed.  We had to get the jerk chicken after seeing it featured on a 'great food in Toronto' type show hosted by Michael Bonacini. And it didn't disappoint at all. Such great flavour and so moist. We paired it with the dirty fried rice (with sausage, egg, peas, etc). Delicious.  But the real star of the show (for me) was the Prosperity Crab. Usually it's Prosperity Lobster but that night they were subbing with fresh crab. It's described as \"Hong Kong style--crispy stir-fried with jerk butter\". Um, yes please? True, it was a messy affair (extracting little crab legs from the shells and what not) but addictively good! Major wow factor.  Overall, very fun place. Next time I definitely need to try the pineapple bun burger."}
{"text":"Came here tonight with my partner for a date, and we were totally unsure what to expect ... but we were pleasantly surprised with our experience!  First, the service was phenomenal. The staff here take something of a \"team\" approach to their service - multiple people will come and check on you, if you're water is empty whoever is nearby will fill it ... etc. It felt like a well oiled machine, and good thing too ...  after we arrived the guests came flooding in (most with reservations, which is highly recommended if you decide to check this place out).  Before arriving we were decided on the fried chicken, but the knowledgeable server informed us that since everything was served family style, we were better off trying a few different things and sharing between us. We ended up getting the full order of the OG fried chicken, the dirty  fried rice, and the pan-fried gai lan.  The gai lan came first and was delicious. Essentially Asian broccoli, it was coated with breadcrumbs and parmesan and was drizzled with a spicy sauce. Next came the fried chicken which has a beautiful crispy coating AND, we were informed, it was gluten free to boot (so my stomach was very happy). The chicken was serviced with three condiments - pickled watermelon with thai basil, sliced daikon with jalapeno and a honey sriracha which I wanted to smuggle home in my purse. Finally the fried rice .... some of the best fried rice I've ever had. Incredibly flavorful, and the lap cheong inside of it makes it virtually addictive.  Topped off with good conversation, and a delectable rum punch, it was certainly a 5 star evening"}
{"text":"Loved the food and loved the customer service. Waffles and Chicken were amazing and the oxtail sandwich was on point. I would have given 5 stars but the place is a little too small. I would still go back though. Oh....and great coffee was definitely a plus."}
{"text":"Great, small, focused brunch menu with some really solid choices. The fried rice eggs are a great staple, and while the French toast is dynamite, it's best enjoyed shared thanks to its sheer decadence. An only decent vibe and a lacklustre amount of seating reduce it to almost a typical Toronto brunch place. Thankfully, the food keeps it putting above par."}
{"text":"Why did I wait so long to return to this place?! This place is a fun spot for some Caribbean-Asian fare with a twist. We ordered \"the Whole Shebang\" and it was two platters of deliciousness! Both the fried chicken and jerk chicken were juicy. If you like spice, ask for their hot sauce, it's so good! The staff were super friendly despite how crazy busy they were. So order one of their festive drinks and get your party on!"}
{"text":"Recently had dinner here with friends and had a wonderful time. Be warned that this is a very popular spot and a relatively small space. We had reservations for 8pm but had to wait until 8:25 for our table, which was (fortunately) the only hiccup of the night. We used the time productively to pick all the dishes that looked interesting from both the the regular menu and the feature menu.  The Jerk Chicken Chow Mein started the dinner with what Patois is about: Caribbean-Asian fusion. Spicy jerk chicken with mushrooms and baby boy choy is poured over a crispy crunchy block of chow mein. The spice from the chicken keeps the dish in the Caribbean, while the familiar sauce and noodles brings the dish back to Asia. A smart fusion dish.  The Chinese Pineapple Bun Burger was a surprisingly well-executed also. The two smashed patties were delicious, well seared and fell apart tender. The addition sweetness of the Pinapple Bun was a perfect match.   The OG Fried Chicken was amazing. Wonderfully crunchy on the outside but moist and flavourful inside. We left a large peice of the chicken breast until after we tasted the other dishes, but it was still steaming hot when we finally cracked into it.   We also had the Curry Goat Doubles, Jamaican Oxtail, and the Saltfish Fritters. Each was well made in their own way but more subtle in flavor. Friendly service and a great place to try some new fusion dishes!!"}
{"text":"Okay. I've been here TWICE now. I haven't been back to Toronto for quite some time, but my friend brought me here for dinner and it was SO delicious.  We ordered the following at DINNER: 1) KIMCHI POTSTICKERS: They're good -- I mean, I'm a sucker for pierogis. However, for $12? Not really THAT worth it. 2) O.G. FRIED CAULIFLOWER AND WATERMELON PICKLE: I was debating between this and the fried chicken. Friend said that this would taste like meat. Believe it or not, it did. It was hella good. I would DEFINITELY recommend this. 3) SMOKED BRIKSET COCO BAOS: It was good, but I think I'm getting more and more picky with baos. I just want the original baos from Taiwan. 4) JERK CHICKEN CHOW MEIN: This was good, but not $17 good. 5) JAMAICAN PATTY DOUBLE DOWN: This was surprisingly really good. It was kind of hard to eat, but I really enjoyed it.  BRUNCH, however, was pretty damn good. 1) FRIED CHICKEN AND CHINESE WAFFLE: The Chinese waffle is a nice touch. It was a little bit TOO cooked (the waffle), but you can't go wrong with the condensed milk. 2) PATOIS EGG BENNY: There was something about this that was super duper good. I guess I'm a sucker for poached eggs, and on top of that -- Jamaican patties.   Atmosphere is great. Service was awesome. Hoping to come back again into this area to eat more food."}
{"text":"Caribbean Asian fusion -- when I saw that I knew that I HAD to come here. Went for dinner with a friend, and the ambiance was awesome. Bustling with a bar in the front and seating in the back. The walls and ceilings were covered in writing. The menu was absolutely out there, and I loved it. Ordered the pineapple bun burger (a must), the jerk chicken, and kimchi dumplings. The pineapple bun was beautiful and sweet, but the actual burger was just okay. The jerk chicken was delicious but a little sparse and laid on a bed of crunchy rice noodles that I didn't love."}
{"text":"We made reservation for this place about two weeks in advance, requesting a birthday occasion for a party of 20-25 people. When we got there, they only gave us a table of 15, saying we did not confirm out reservation. Management tried to argue with us while we had e-mail proof which stated we did confirm. They also stated saying they did not prepare enough food for our large party, in the end we ended up having to share. Horrible customer service from the start.  The food was good, I mean, adventurous for me since I like to stick with food I know and is familiar with. The pineapple buns is to die for. Unfortunately the people, minus our server didn't live up to it.  I find the restaurant is a little small, washroom was not up to my liking in cleanliness.  Our server tried her best to give us the best experience but due to management incompetent and disorganization, it was ruined from the start. As for the birthday girl, her night was ruined.  Our bill came up close to under two grand, you'd think they'd be a better host."}
{"text":"Just okay. Service was fine. The jerk chicken was pretty good. Everything else wasn't worth ordering again, but there also wasn't anything wrong with the dishes (i.e. no complaints; just underwhelmed)   I was surprised to see it on Toronto Life's best new restaurants list a few weeks later."}
{"text":"Was excited to try this new restaurant and it didn't disappoint... for the most part. Described as \"Caribbean meets Asian soul\", the food itself was pretty amazing. Though we were told the $32 yardbird special (1/2 order each of jerk and fried chicken with slaw and dirty rice), was suitable for one hungry person, my friend and i decided to share - and we were glad we did. It was definitely enough for two even without the Jamaican Patty Double Down, which we ordered at the recommendation of our server - just \"to ensure we had enough to eat\". This is even after we had the Kimchi Potstickers \"Pierogi Style\" as an app. All this to say, we had plenty of food, with a couple of pieces of chicken left to take home. I would recommend everything we had because it was all really quite delicious. I also loved the little sides of spicy celery and watermelon pickle.  A couple of minor cons: for a $9 glass of red wine at an establishment of this price range, I would expect more than the splash that showed up in the glass. I don't think it was any more than 5 ounces. You're better off sticking to beer or the cost of your dinner will add up fast. Lastly, we sat at the table in the window and I was slightly turned off by the state of the floor. it wasn't just dust from the street - it was downright dirty. The rest of the restaurant seemed clean though. Overall I definitely recommend Patois and will be back!"}
{"text":"Let's be real now, if you have to order two pineapple bun (\"bo lo bao\") burgers in one sitting in addition to \"The Whole Shebang\", you know this place will not disappoint.   Everything served in The Whole Shebang was delicious except for the crunchy Chinese salad and the fried gai lan. These two dishes were nothing special, almost unnecessary. They were more on the oily and saucy side, and they did not add to the overall experience. On the other hand, the Jamaican patty double down, fried cauliflower, jerk chicken, fried chicken, dirty fried rice, and the Pineapple bun burgers were hands down winners of the night.   Not sure if everyone can relate to this, but the Jamaican patty reminded me of my childhood. It's one of those very unhealthy foods that as a child you would crave for. It almost gives you that bragging right when you bring one to school for lunch in elementary school! So much nostalgia eating one of these!  Next were the fried and jerked chicken. The spicy rub on the jerk chicken was done well. However, the fried chicken did it for me. The batter was light and crispy on the outside, and the meat was so tender and juicy on the inside. It was definitely one of the highlights of the evening. The fried cauliflower was very good, and so was the dirty fried rice. It's definitely not the healthiest mix in the fried rice, but it's called 'dirty' for a reason. It was really darn tasty.   The Chinese Pineapple bun burger is obviously the show stopper of the night, and hence a paragraph dedicated for just this burger. It is the perfect love child of a Hong Kong/Chinese bakery and a Caribbean burger joint. You can also come to appreciate the thoughts the chef have put into this dish with the hickory sticks on the side instead of the usual boring fries. It was like a trip down the memory lane, when vending machine was still a thing back then!   All in all, not only was the food delicious, but the ambiance of the place was great. Restaurants like these help build that diversity of our city!"}
{"text":"Such an interesting fusion that works well together. The Jamaican down patties were delicious. Their wings are highly recommended. Come by with a few friends so you can get different plates and share because that's what this restaurant is all about."}
{"text":"YUM this place reopened yesterday after experiencing a fire next door - and it's spot on!   We had the dirty fried rice, juicy jerk chicken w Jamaican coleslaw, and the Kim chi dumplings to eat - everything was absolutely delicious, just the right amount of spice and flavour, outstanding!! Also I had a drink w egg whites and scotch bonnet infused tequila - smooth and spicy, highly recommend.   Also, the side plates were super cute, had beautiful blue fish painted on them, decor in the restaurant is stylish and laid back.   Reggae and Caribbean vibes made us feel like we were on a beach vacation!   Most importantly, our server Spencer was very informative and gave us EXCELLENT service. He really got us excited about the menu while we were choosing our items, and he was friendly and attentive throughout the meal.  We will be back for the pineapple bun burger!"}
{"text":"This has been bookmarked for me to try for a long time. And I can finally write a review! My fiance and I dropped in Saturday night without a reservation around 7:30pm and got a bar table in problem! We actually sat in front of a mirror instead of the actual bar but it worked out since we wouldn't be close to the door and the cold draft. Things looking up!  I forgot the name of our server but he was very friendly, helpful and attentive! I was really impressed with his attentiveness despite him husslin' all the tables around us.   We ordered the patois shandy and Hawaiian Pale Ale. Highly recommend the shandy. To eat, we ordered the jerk chicken chow mein and half portion of the OG fried chicken. Drinks came quickly and food followed soon after I could get a second sip of shandy down.   The chow mein is really good. A bit too crispy to what I'm used to (or maybe I get thing way too saucy) but it was delicious. As for the chicken, it wasn't as \"jerky\" as I would have liked it to be, but it was a nice change to an old noodle favourite.   The chicken was okay. It was a simple breaded thing with flour or cornstarch and fried like the chicken wings at Mandarin or something. Not horrible, but I still think Kanpai or Stockyards has the baddest fried chicken out there. The pickled watermelon was a nice, refreshing palette cleanser.   Good music and really good service here. Nice place for a double date night since everything is family style. I may come back to try their large party menu."}
{"text":"I absolutely loved eating here. The ambiance was very chill, service was good, and the food was really cool- a wonderful mix of Jamaican and Chinese influence into each dish really made it a very fun and exciting dining experience. Reservations are probably recommended, since I went on a Wednesday evening and they were fully booked. The hostess however was kind enough to accommodate us really quickly which was great.   We ordered the Jamaican beef patties (double down), two beef patties with bacon, cheese and Sriracha- so good. Also got the dumplings, just okay in my opinion. The burger was delicious ( two burger patties on top of each other, and the top bun was encrusted with basically the dough of a beef patty.t\" that came with onion rings battered in what tasted like festival dough---Really, really out of this world. The star of the show was the oxtail Lo mein. Tender, and amazing flavor. Another real star was the jerk chicken, crazy good flavor and incredibly tender. So well cooked and so well seasoned. Spicy but delicious.  The only thing we ordered but didn't love was the jerk chicken chow mein. I just didn't like the flavor of the chicken in this dish, since it seemed like jerk mixed with oyster sauce, and with the crunchy noodles beneath it, just wasn't my favorite flavor."}
{"text":"I will start this review by saying the food was excellent.  I had to remove a star because it took 40 minutes to get my reserved table.  Back to the food, and drinks.  The highlight of the night was the great tasting cocktails.  You have to love fresh tropical drinks.  The food was great as well.  The one think I have to say, is the jerk lobster was good, but I feel jerk somewhat overpowers the delicate taste of lobster.  All in all, a great meal.  Just was not happy I had to wait so long."}
{"text":"I was impressed of the quality of service! A reservation is recommended.  We chose to sit at the bar to dine, as a table would have been available after a long wait.   This trendy restaurant that offers Jamaican and Asian infused dishes. We ordered the fried chicken with delicious hot sauces to chose from, and the chicken was fried to perfection. Such great flavored chicken justified (I guess) the extravagant price for this dish.  I was disappointed that it did not come with a complimentary side dish. The pickled 4 micro pieces of pickled watermelon was not impressive. The shrimp with amazing great flavors of mango and hint of spices was delicious , to say the least.  The waiter was extremely personable and was one to the greatest individuals I met while visiting Toronto. In fact, he is the epitome of a graceful individual and processes all the intricate qualities to be an amazing human being.  I will hold dear my interaction with him and the wisdom he was able to share with me.  His beautiful dreads fit wonderfully with the establishment. He is Canadian and I can't recall his name!  The entire staff was great.  I will spread the word..."}
{"text":"I kinda wanted to hate Patois. It's very noisy, crowded, obviously hipster-attracting. The menu shouts attitude. Our waitress was useless when it came to explaining the menu, and unable to give any guidance on how many dishes to order, etc. But the food was good. The standouts were the Brussels sprouts - charred and sweet and give me more...  Also, the flavour of the jerk chicken was very good, except the skin was almost unchewably rubbery and tough. The habanero mayo that came with it was exceptional. The 1/2 order fried chicken was adequate; it was huge, nicely cooked, and the batter was almost tempura like - very light and crispy - but there was no particular seasoning, certainly nothing Chinese or Jamaican about it. They can call it O.G. all they like, it needed to be more assertive.  A couple of reviews have suggested that Patois is too expensive. I thought it was on par with other places I've eaten at recently of equal quality, however I could see how you could easily order 'wrong' and get not as much food for a lot more money."}
{"text":"There were so many things that tasted wonderfully! I'm very happy that they had the option for us to share and eat half the menu and it's totally worth it!  Staff: They were great and brought over plates for our bones and cleared it when we needed it. At times, I felt like they could've been a little quicker with taking our orders but the food came quickly and made up for it.  Ambience: I was very comfortable even in metal chairs. It was a little cramped because some of the tables were close together but nothing that made me uncomfortable. The walls are adorned with graffiti and it's cool to read some of the Jamaican phrases.  Food: I wanted more because it was so good! We had The Whole Shebang and everything was great. This place serves small plate food and The Whole Shebang contains half the menu to share between a small group (3 to 4) for only $110. Although there were many components, I'll list a few of my personal highlights. The Chinese \"Pineapple\" Bun Burger was sweet and savoury and just fireworks on my palate; I just wish they didn't give just one to share. The Juicy Jerk Chicken was so succulent and had the right amount of kick. The Kimchi Potstickers \"Pierogi\" Style were a bitesized burst of flavours. Everything was so great I ordered one more dish afterwards: Likkle Soulja Sandwiches from the dinner menu and was equally enjoying them. They had this amazing five spiced SPAM and chunks of pineapple that provided this great balance of heat and acidity. Overall some of the best food!  Great food, great atmosphere, and dying to go back already. Try anything with Pineapple Buns!!"}
{"text":"2.5 stars! A trendy Jamaican-Asian fusion restaurant in Dundas West.  My friend and I came here for dinner on a Friday evening at 5:30pm.  The place slowly got busier and busier as the evening progressed.  The atmosphere is casual, dim lighting, and very loud. Quite loud that you have to pretty much yell due to the music.  The proximity to other customers is close if you are seated along the wall. Since it gets quite busy, it's a good idea to make reservations. The service overall was good and very attentive to pouring our water without needing to ask.  I want to give this place more stars but the price for what you get just makes me not want to return. We ordered three dishes: Half order of jerk chicken (wing, and thigh I think?), fried cauliflower (since everyone on Yelp was raving about it; ~12 florets), and the dirty rice.  The jerk chicken was spicy, but not overwhelming, and the skin was tasty.  The meat itself was surprisingly lacking some flavour, considering the skin was salty and tasty, and it definitely needed that scotch bonnet sauce that came with it on the side.   The fried cauliflower was quite good--similar to a general tao's chicken but a vegetarian version.  Although the dirty rice had good flavours, such as cumin, lap cheong (Chinese sausage), the rice was slightly undercooked.  All in all, I wish I could say I'd go back--but the price is keeping me away for dishes that just aren't that special. $80 (including tax & tip) for two glasses of wine and the above three dishes."}
{"text":"A friend brought us here for dinner on a week night. The restaurant is set up hipster style. Service was fine but our group of 4 found the food fairly disappointing. We ordered the \"whole shebang\" which they suggested fed 4 people. We all left feeling hungry but the prices didn't really justify ordering any more food. We found all the food relatively tasty but nothing out of the ordinary, in fact I found some of the dishes just rip off cheap chinese food (considering the prices we were paying).   I personally wouldn't visit again but would recommend trying if you're interested in seeing what a Chinese Jamaican fusion looks like."}
{"text":"Very hip (and popular) place near Dundas and Bathurst. The vibe is modern, hipster, and loud, so perfect for a night out with friends. I always find the Chinese Jamaican cuisine to be an interesting fusion, and it's awesome! The kimchi pierogi was good, but hard to taste the kimchi with the strong bacon flavor. Fried chicken was standard and tasty with the sriracha dip. Fried rice was good and had a nice toasty flavor. Overall cool vibe and would come back to try the jerk chicken!"}
{"text":"I've been to Patois a few times and I really love the food here. My favourites are the OG fried chicken and the Chinese pineapple bun burger. I get these two dishes every time I come here and would definitely recommend it. The atmosphere is relaxed and it's a great place to hang out with friends. Looking forward to my next visit to Patois!"}
{"text":"Patois is definitely something different - a very fun/ hip restaurant. The food was good and the fusion of Chinese and Jamaican dishes were interesting. As other reviews have indicated though, it is definitely very loud!! Took off a star for the price point of the food for the quality/ amount you get.  We started off with Mista Chin's fancy gin, which is a cocktail served in a mini flamingo floatie. Super cute but realized later it was $15 each! Our server recommended ordering two food items per person, and gave us recommendations so we get a balanced taste of different elements in our meal which was nice. We ordered the Juicy Jerk Chicken, Chinese Pineapple Bun Burger, Jumbo Prawn Mango Salad and Salt Fish Fritters. The juicy jerk chicken is pretty juicy, and nicely spiced (pretty spicy), the burger was interesting because the pineapple bun is a slightly sweet bread, so it's savoury and slightly sweet at the same time. The Salt fish fritters were a bit salty, but were really tasty with the two sauces it was served with. My least favourite was the prawns salad...probably because I don't like ginger in my salad. Overall an interesting food experience, so if you are always looking to try new things, this would be for you!!"}
{"text":"This is a great place. We did the whole menu between 4. It was good. Loved the corkage fee, more restaurants should do that! Portions were good and service was awesome. The cauliflower is a must!"}
{"text":"I am not sure what the point in having a reservation is when you still have to wait almost an hour before having a seat. We received a \"thank you for your patience\" like we had a choice...when finally sat at the very worst table in the house. My view was of the server station and right behind that was the smokey kitchen. Service started off slow but our waitress was pleasant. Food was good, music was fun however someone picked up my drink when I still had about 1/4th left without asking. Between the wait time and having sat at the worst table with no apologies I will not be venturing off to this place again."}
{"text":"The jerk chicken was something to behold. A little messier than regular shawarma but makes up for it in taste. Mmm..."}
{"text":"I bookmarked Patois when it first opened after seeing a picture of their pineapple bun burger. Since my husband's family tend to take us out to eat in the GTA, Patois stayed on my forever growing and forgotten to-eat list! We finally paid a visit after completing my first day of board exam which happened to be Toronto's downtown!   The five of us came and were seated immediately for our 6pm reservation (the only one available when we made our reservation a week in advance). Honestly though, might as well had not made a reservation - The worst part of the dinner was our seating/table situation.  They put together a few high chairs at the bar table by the entrance. There was barely any space for us to move in and out or put our coats or bags. We were forced to keep our coats on (we were freezing by the opening of door with incoming and outgoing guests). Worst of all - we had to share half the table with two other patrons. It was the most awkward and uncomfortable seating situation.   But the foods and services really made up for the whole experience! The five of us shared the 3 pineapple buns, jerk pork belly, Jamaican oxtail, patties double down, full order of jerk chicken, full and a half order of fried chicken. Both jerk and fried chicken were extremely juicy and flavourful. We liked them so much that we added another order! The Jamaican oxtails were tender and fell right off the bone. Served with coconut rice and steamed Bok Choy - perfect one person entree / get two if you are planning to share! The highlight of the night was definitely the pineapple bun burger. I must had had pineapple bun as breakfast at least a handful of times per week growing up. Why didn't I think of the genius idea of eating it with burger patties? Not just one but two JUICY patties stuffed between the my fav bun - savory and sweet all in one - beyond amazing.   We wrapped up our meal by sharing all three of their desserts - stuffed cheesecake French toast, pecan pie, and habanero citrus sorbet with coconut panna cotta.  All worthy of trying! I particularly enjoyed the refreshingly spicy sorbet with the lightly sweetened, silky smooth, coconuty panna cotta. My in laws raved about the bursting cheesy French toasts while my husband particularly enjoyed the gooey, warm pecan pie.   Overall - very satisfied with dinner! I would love to return to try out their brunch especially after seeing Hong Kong styled egg waffle on their menu! Service was attentive and warm - which we didn't expect since we were shoved into the front bar corner! Our waters were instantly and continuously refilled. Our tables were cleared and checked on throughout the meal. Hopefully we will get a better table/seats on our next visit."}
{"text":"4.5/5  *I came to Patois around 11AM and the restaurant wasn't too busy, well at least no 1 hour line up.   *The vibe was laid back and unpretentious. The decor is quite odd with colorful chairs, inflatable buoys, old photographs and a bright red Juicy Jerk sign - but somehow everything just went together!  *The service was amazing and our server was really attentive.   -Patois Egg Benny (Cocktail beef patties, poached eggs, jerk mortadella, hollandaise, watercress green salad) - $13 The egg was poached perfectly with a creamy Hollandaise sauce, and the patties were hands down one of the best I have had in a long time. The pastry was super light, tender and flaky with multiple layers. The beef filling was aromatic with a hint of spicy and still moist inside, and who doesn't love that the beef was filled to the max!  -Quinoa breakfast fried rice (bacon, sausage, egg, crispy homefries) - $12 Surprisingly the quinoa tasted just like... regular rice LOL. The fried rice was a bit too salty for my taste which I think came from the Chinese sausage and the fries were too crispy, otherwise the dish was incredibly delicious and flavorful!"}
{"text":"Great brunch hangin out w my daughter in the hood I grew up in. Awesome to witness the gentrification of dundas and great eclectic mix of new eateries .  The food was awesome;  patois eggs Benny and quinoa breakfast. Amazing added bonus when waiter messed up and brought us the French toast by mistake and threw it Into mix no charge . Hailey inhaled it .. Lol    Great spot great service  Will def come Back"}
{"text":"I went here with a friend got the chinese burger, the dumplings, the double down patty, the jerk chicken chow mein and the cheesecake stuffed french toast for dessert!! Everything is delicious and there's great service! The purple jamaican pop was delicious, the burger was my favourite dish of the night!  I was very excited to try the jerk chicken chow mein but unfortunately the noodles were slightly burnt. The dessert was delicious and overall i'll definitely come back!"}
{"text":"A little disappointed: neat ambiance, interesting dishes, good flavour combinations but just too greasy/oily. The oil took over the flavour of many of the dishes (nori green beans - the nightly feature, salt fish, and perogies). Of course, the chicken (fried and jerk) and cauliflower were delicious. Be careful with the rest."}
{"text":"Yay! My first post and many more to come - I'm a foodie, believe me, my stomach growls each time I look at food pictures on my phone. Enough about me, let's provide you with the 411 on Patois:  Chinese & Caribbean cuisine all under 1 roof? Hells yeah! We were a group of 5 and we sat at the bar because no reservations were available until 9:15pm (suggest you make reservations - we were there on Friday at approx 6:15pm). Once we sat down, we looked around and the restaurant looked clean, organized, great music (can talk to your friends without yelling), neatly displayed bottles of liquor, and attentive staff!   FOOD FOOD FOOD: 1) Jamaican Patty Double Down: $7 10/10  - heard that this was a must-try, so we ordered it. Picture this: 2 strips of bacon combined with sriracha & cheese fondue sandwiched between 2 jamaican patties. Sound gross? Maybe, as I'm not a fan of Sriracha or bacon, BUT IT WAS DELICIOUS. Before you order anything, please do yourself a favour after a hard day at work, school, appointment etc and order this first. Our server practically told us we will regret just ordering one because she loves it and this appetizer is the size of a men's wallet - small (we ordered another one and our server was like \"I told you so!)   2) Chinese \"Pineapple\" Bun Burger $15.50 9/10  - Pineapple buns, burgers put together? Heaven! This was a good mix of sweet and savoury and I was really surprised it blended in so well. Imagine this: 2 beef patties, with oyster sauce and Mayo inside a cut-opened pineapple bun. Side? Hickory sticks & pickled cucumbers.   3) Juicy Jerk Chicken  $19 Full order 10/10 - I don't have jerk chicken often, but this to me was the best dish served with habanero sauce. My friends said they have had better, but this was still pretty good to them. This is sharable by the way - good portion size  4) Jamaican Oxtail $18 8.5/10 - Meat was pretty tender that it fell off the bone! This was served with 3 bok choy, Coconut Rice (YAY Carbs), and chicharron, Bacon. I enjoyed this dish too, but I thought the portion size was small - you might have to order something else.   Summary? Based on my ratings, you can guess I enjoyed the food right? This is a place I would definitely go back to for all the dishes I have tried. I won't be stupid next time and I will book ahead of time (don't make my mistake :) ). Aside from the food, the staff were attentive in filling our glasses with water, checking on us several times for food and drinks, and our plates were cleared in a good amount of time. Would I recommend you try it? Y-E-S!"}
{"text":"Had dinner at Patois tonight after wanting to try it for a while now. Let me just say, it was amazing! I didn't think about making a reservation even though it's Saturday, but the person who greeted my boyfriend and I at the door was able to accommodate us at the bar - great start. We ordered a beer and a Trade Wind cocktail for drinks; he got the jamaican double down and a half order of og fried chicken; I got the pineapple bun burger.  The double down was a nice treat, spicy and a little decadent. The fried chicken was a real pleasure - crispy, not too greasy, good portion size, and paired with a lovely honey sriracha sauce. Finally, the burger was a saucy, messy delight. The bun is slightly sweet and thin enough to avoid overpowering the rest of the burger. It didn't hold up well, but it didn't matter - I enjoyed scooping up bits of beef patty with the chips that came as a side.  I also want to point out the decor, which I found really impressive. The vibe was cozy and a bit exotic, and you get the sense that whoever designed the restaurant paid a lot of attention to detail.   All in all a good experience - we're looking forward to going back for \"The Whole Shebang\" special :-D"}
{"text":"This restaurant was on my summer to-do list, so I made an early Saturday evening reservation - something I've discovered is best to do if you want to eat at a highly sought-after resto.   I love how small and intimate the restaurant is. They also have tables to accommodate most party sizes if you're not more than 8 people which is a plus for a small place. The service was great and the food was brought out very quickly.  Since everything is made for sharing, we ordered 4 dishes and a dessert between two people and we were satisfied.  We started with the Crunchy Chinese Salad with plum dressing. I have to say it was probably the best salad I've ever had. It was really refreshing and light - a great way to start off the meal.   We then ordered the Kimchi Pot stickers, a 1/2 order of the O.G. Fried Chicken, and the Jerk Pork belly. I was most looking forward to the pot stickers but I have to say I was sadly underwhelmed. They were good - that's all. I didn't find them to have enough kimchi flavour and the sriracha sour cream on top was nothing extraordinary.  The fried chicken on the other hand was awesome. The sauce they serve it with is a bit like the red sauce you get with Chinese take-out, but 1000x better because it finishes with a good kick of heat. The chicken is fresh and crunchy and not greasy at all.  Now for the pork belly. My boyfriend typically loves the stuff and I felt obligated to try something jerk-seasoned. I would give this a 5-star rating and best overall based on the flavour alone. It was just the right amount of spicy and their jerk seasoning was awesome! It felt very authentic to me. The only problem - and I'm no expert in pork belly so forgive me - was that I found it really heavy and the portion is almost too much for two people when you've ordered a few other things.   For dessert, we ordered the coconut lime sorbet and it was the perfect way to end our meal. It was very refreshing and cleansed our palette of the rich pork belly that lead up to it.  As a side note - I ordered the bourbon lemonade as my cocktail. This felt a bit like they were trying to cheat their way out of making a true whisky sour, avoiding the whisked egg white and simple syrup and such. Just my thoughts"}
{"text":"Now that I've gone a brunch binge of late (when did it become my favourite meal?), I can say with certainty that Patois is pretty solid.  They open at 11 on Sunday and we got there about 1120 and there were only 2 tables left, that was fast! The three of us got a table at the back. The place itself is pretty dark and I would describe the atmosphere as a dark party bar. The staff was friendly and helpful bringing my little one a special glass to drink water without asking. I ordered the butter french toast and I gotta say SO AWESOME!!!! It's a french toast sandwich with butter in the middle and deep fried. I asked for the syrup on the side as I've seen picture of this drenched in syrup. When we got to the final bits of the french toast I thought I should try some with syrup and MIND BLOWING. They must mix the syrup with something as it tasted awesome. Definitely better than the standard pure maple syrup. Also had a americano which was pretty standard. Definitely go back, but don't eat any carbs for the rest of the day after!"}
{"text":"I have been to Patois on two occasions and on both the food has not failed my high expectations! Patois' menu is delicious and so flavorful - everything I have tried is absolutely excellent.  A few favorites:   - SLIDERS: these things are to DIE FOR. The buns are kind of sugary sweet and they are so amazing. Paired with a juicy burger, can't go wrong! - FRIED CHICKEN: it's what they're known for, and for a reason. SO GOOD - 4/20 BROCCOLI BUDS: YUM! The hummus at the bottom is perfection, and the broccoli so crispy and good!   The cocktail list is extensive, and there are a few hits and misses. The main \"miss\" for me is their sangria (Dirty Wine) which was pretty much undrinkable.   So with such delicious food, why the three stars?   Well, Patois advertises their ability to do large-party dinners. I recently booked them for my birthday for 15 guests. I arrived slightly late (about 15 minutes late for my 9:00 p.m. reservations) but there were about 7 people holding the table... when the rest of the group arrived there weren't enough seats, and we didn't get our food until after 10:30 p.m. It kind of put a damper on the evening, because even though I was a bite late (we had called to let them know), I wouldn't expect it to take over an hour for food, when you advertise your ability to do large groups.  While the food is great, it was kind of a MEH experience!"}
{"text":"Underwhelmed.  The only redeeming dish were the SPAM burgers..delicious. Everything else was over priced and small quantities. We ordered whole shebang for 4 adults and definitely not enough without ordering 3 other dishes. Everything just tasted ok, but wouldn't drive across town for. Chow mein for $30?! Also the plates they give you to eat your meal on are sooo tiny! What I really didn't like was 20% tip the only option when paying. Wouldn't return."}
{"text":"A very fun fusion combination.  The Jerk Pork Belly, Kimchi Perogie pot-stickers and the Jamaican Ox-tail were really well conceived flavorful dishes.  My highlight though, was the Pineapple Habanero Sorbet with Coconut Panacotta was just awesome."}
{"text":"Be sure to eat something before coming here. In fact, bring a movie and some card games along as well because it might take a while for your food to come.   Now, the food alone was a 4.5/5 - as per fusion restaurants, the options are different from your standard places. Like some other reviewers, my personal favourite is the pineapple bun burger. I got a rendition of it through the Guud Mawnin' Burger from the brunch lineup (and I got a quirky version because they ran out of buns) and the sweet after tones make it a delight to eat.   The service was also passable. They were polite and did their job well. Despite the other reviews, I think we got rather fair service.   The problem was the wait. I don't know if this is the standard, but it literally took over an hour to get our food. I am sure of this because I paid for an hour of parking and had to get more time. When I got back, we had to wait another 10-15  minutes before food arrived.   So yeah, I'm a little upset and it honestly ruined the experience. My rating on food alone - 4.5/5. My rating on the dining experience as a whole? 2.5-3. I'll take another shot at it because there are other items on the menu that people seemed to be enjoying, but if it's anything like this time, I won't be coming again."}
{"text":"Even the Toronto Star acknowledges how horrendous the service was at Patois Restaurant:   Jamaican-Chinese restaurant Patois on Dundas West falls short on good vibrations.  http://www.thestar.com/life/food_wine/restaurants/2014/09/26/jamaicanchinese_patois_short_on_good_vibrations.html   You think if you order the entire menu (twice), you'd get at least a smile? (Now that I think about it, why offer family-style feasts on the menu if you can't accommodate to large groups??)  - Our server, (didn't even get her name - she was blonde, Cacausian, bad eyebrows) didn't speak or smile or give constructive opinions on the menu to any of guests (but implement 18% tip anyway)  - Make us wait an hour for our bills DESPITE having asked for split bills at the b e g i n n i n g  of our reservation, and of course she didn't.  - We had to flag down our server saying we can help and already split the bills ourselves because she was obviously having problems.  - But instead, she was being passive aggressive, not communicating to us so we can collectively reach a compromise/talk out a solution. But instead she chose to be mad at our table for not seating being able to seat her next big party. Who's fault is that when you give our bill and ignore us for an hour?  - After refusing to acknowledge or service your table she asked another server to cash us out. Someone who told us she was new to be country. If you're reading this, you were wonderful and shouldn't have been in the middle of this at all.  - She finally gave us or bills and GUESS WHAT? She had the audacity to not only auto-gratuity 18% to our table and not even face us to do it. The new server had to deal with our complaints. When one person in my group refuses to pay the $1 off their $8 auto-tip, she refused and said \"It's the restaurant policy to have the 18% gratuity.\"  - We speak to Manager and he says \"Just pay your bill and get out\"   FOH with your shitty service and auto-grat. Don't be a shitty server and implement 18% tip for doing absolutely nothing on top of being ludicrously rude. The table was full of people who had years of customer service experience and this place had none of that.   After confronting the situation, Manager Richard [edit: removed last name for privacy reasons] said there was a computer glitch (which we were never informed about, maybe we could've troubleshooted because we already split the bills ourselves, and maybe you could have seated your next big table and you can auto-grat them too.   He also kept insisting on putting blame on us saying we were 45 mins late for our reservation - FALSE, because I was there promptly at 6pm - We were drinking and deciding what to get on the menu with little to no help or feedback from our shitty server.   He invited us back to give them another try after finding out the table is a bunch of Yelp reviewers, asked for my name and to reach out to him. But I highly doubt the impression they left on us could be remedied. I'm not going back there with you knowing my name so you can spit in my food and serve it to me. With the way you were talking to your table, I wouldn't be surprised. The food was good but the service left a bad taste in my mouth."}
{"text":"Patois has this atmosphere of kind of hipster-y, kind of old school-y, kind of new age-y all at the same time. For lack of a better description, the atmosphere reminded me of the restaurant Khao San Road even though they're completely different cuisines.   There is an emphasis on making good food, while at the same time charging not so cheap prices, and serving not so big portions.   The portions are where they lost a star for me. My partner and I ordered half of the Jerk Chicken ($12), Dirty Fried Rice ($11), and one of the specials of that night the Typhoon Shelter Pork Belly ($18). For drinks, we ordered a pitcher of the Jamaican Gimlet ($40). The food was pretty amazing; chicken was moist and accompanied with a addictive and mouth burning hot sauce, dirty fried rice was appropriately greasy, pork belly brought me back to the times I ate typhoon shelter crabs in Hong Kong in dai pai dongs. HOWEVER, for the price, the portions were pretty small. Chicken came with 4 pieces, pork belly came with about 10 small pieces, and for $11 I really was expecting a bigger plate of fried rice. Same with the drinks, tasty, tangy and refreshing, the pitcher came in a cutesy trad chinese tea-pot, it just wasn't quuiite enough.   We walked away satisfied but not completely full. Next time we come here, we're definitely bringing others with us so we can order the whole shebang!"}
{"text":"Anyone who goes here saying that the Jerk Chicken wasn't good is an absolute moron. I feel like anytime its fusion anything people judge so quickly.   The Jerk Chicken was tender, not dry at all, and full of flavour. I've eaten at almost every damn Caribbean place in Toronto and I'm telling you, their Jerk is amazing.  The double down is probably something you can make at home but OMG is it a must when you go there. The fondue on there with the bacon and sauce is honestly something I could eat it everyday.  The OG Fried Chicken is juicy and the skin is lightly battered with a nice crisp. Its also a must.  The Chinese Pineapple Bun burger was great, a little on the heavy side.  Their menu got better since I've been, so I'm probably going back soon. The atmosphere is really laid back, the waitress was incredibly nice and informative. I have no damn complaints about Patois. So....GO THERE NOW."}
{"text":"I cannot believe i finally got here. When Patois first opened i was trying to find anyone who would go with me, but a trek downtown seemed almost impossible for my surbanite friends and my downtown friends were not that interested. Well you know what? All of them have missed out for not coming here because the food is absolutely fantastic and surprisingly inexpensive!  We had: - saltfish and akee crema - yum yum - jamaican patty double-down - holy crap i was not expecting a burger with patties as buns! - juicy jerk pork belly - smoky in flavour and tasted like delicious boar i get in taiwan - jamaican oxtail - melts in your mouth  i also had a rum punch and my girlfriend a coconut.  Everything i expected, which is rare cuz my expectations were pretty high. Next time i need to bring a whole posse and order the whole menu for $115!"}
{"text":"Space is tight and people kept bumping into us. Food was great and I am not even big on Jamaican food. Ordered the option where you can try everything on the menu for $109. We were 4 and it was worth it. Left satisfied. Would definitely go back."}
{"text":"I've read many great reviews about this establishment and so, I finally decided to check it out. What really intrigued me was their pineapple bun burger. I thought that was a neat twist. So, I ended up ordering the pineapple bun burger with a side of onion rings. I was not impressed... I felt that the burger lacked flavour. It was nothing really special in taste...it tasted like a normal burger; something you could easily make at home and the onion rings... it didn't taste like onion rings at all! The batter was a bit sweet and quite heavy for my liking. Considering the quality of this meal, it was definitely not worth my $13...  It'll be a mediocre 3 stars for now... one thing that I was really impressed with was their level of customer service. It was superb! Our waiter was very attentive and friendly! Even though it was super packed in the restaurant we were being attended every now and then.   Oh, one more thing... this is not the place to chit chat over a meal. The music overpowers your voice and on top of that, there are people beside you trying to have a convo by screaming at each other. Trying to have a convo in this kind of environment will only guarantee you a sore throat and a lost of voice at the end of your meal..."}
{"text":"Heard great things about this place so I went with a friend one night. The restaurant had a dark, hipster feel and was pretty bust when we got there. Service was good, our waiter was nice and attentive and explained the menu to us. My friend and I really wanted to try everything so we had the kimchi pot stickers, chow mein, fried chicken with watermelon pickle, jerk chicken, and a couple sides that were not memorable. They are apparently famous for the chicken and it was just not good. The only good thing about the place was I liked our waiter and I ordered a coconut with rum and that got me through the meal."}
{"text":"Holy SALTY!! Its like the chef went wild with the salt shaker and dumped a whole load of salt on every dish tonight. Literally could not finish the Pineapple bun burger because the patties were that salty. Being someone who eats out quite a bit and understanding what a usual amount of salt is, this was super unusual. Should have probably mentioned it at the time to our server but didn't want to ruin the fun we were having. Could not finish the Napa cabbage salad either - the dressing was once again overly salty. This is odd considering I've been to Patois before (a few years ago) and remember the food being really good! Gotta say I was pretty disappointed by my visit today, and will be hesitant to come back. I did really enjoy the Filet O shrimp bao they had on their feature menu- delicious!!!!"}
{"text":"Super cute restaurant with wonderful cocktails and food. I had some sort of earl grey cocktail and another with a freshly cracked coconut and a shot of rum - so fun! Their fried chicken, fried rice and pot stickers are so good. Would come back."}
{"text":"I recommend coming here with a group since you'll be able to order a bunch of different dishes and try them all (The whole shebang)! The fried and jerk chicken were good and juicy but what really made the meal was the O.G fried cauliflower. Yes, cauliflower. The picked watermelon wasn't as memorable though."}
{"text":"Food was a mixed bag. Doubles and kimchi potstickers were highlights while the jerk chicken was dry (saved somewhat by the fantastic sauce and rub) and coleslaw was bland.  Service was friendly but bad. Place was rammed and we had to wait ~15 minutes past our reservation to be seated. We sat at the bar and only after finishing our entire meal did the bartender ask if I wanted another beer. (Then it took a while to get his attention for the cheque.) I also wasn't a big fan of constantly being called \"bro\" and the congratulations on \"killing it\" every time we finished a dish.  Beer selection sucks and the wine is meh. Cocktails looked fun but I wasn't in the mood.  It's super crammed and loud, but not in a good energetic way. We ate in less than an hour and I was happy to not linger any longer than that.  3.5 stars for food, 2 stars for service."}
{"text":"Fun vibe and really loud music.  Lots of fun cocktails but a little pricey for the bevies.  The homemade beef patties do not disappoint, but the scallop shrimp balls forn7.50 each seem just. Step up from the classic stuffed crab claws you get at Chinese weddings.  The oxtail was tender but. Little heavy on the salt.  The jerk chicken was delicious and fried chicken was yum as well."}
{"text":"Food was me and our server was a dick.  A lot of the dishes were good, but overall I found the food too rich/heavy. And I like heavy, gluttoness food! In quantity!  We got the dinner for 4 (\"the whole shbang\"). Some things were delicious (juicy jerk chicken, dirty fried rice, cauliflower), but it was all heavy and rich. A guy just needed some acid or a vegetable or something.  Worth going, but not all that I hoped for. Maybe the asshole server dampened my experience to be fair."}
{"text":"We were looking forward to a meal at Patois but were nothing but disappointed. We waited an hour to only receive drinks and one appetizer, only to find out the vast majority of our order wasn't even punched in. There didn't seem to be a clear server assigned to us, and the one we thought was our server, was spending most of her time socializing with friends that were also dining at the restaurant. When we inquired into the status of our meal, we were met with confused and frazzled staff who clearly lacked customer service skills. Wish I could at least say the food was good, but we left after more than an hour without our meal."}
{"text":"Patois brings about a niche of Jamaican-Chinese food to Toronto - and it does it quite well.   When we were walking in on a Friday without reservations at 7pm, we were greeted by the host who said it will be a 30 minute wait. Thankfully our party of 3 were not too hungry - and Dundas West was vibrant enough to let us stroll around to kill some time. After just over 30 minutes, we were called and told the table was ready.   We were sat down on the island in the middle. The atmosphere was of a typical hip Dundas West eatery. Loud music was played so this is not for people who would like to have a peaceful meal. The service was quite attentive and they were keen to offer drinks/food recommendations to our party. We ended up deciding on:  1) Jamaican Patty Double Down: this was a essentially two small Jamaican patties with some pork belly in the middle topped with a creamy sauce, mixed with sriracha. A little small for what I expected and it was pretty good - tasty and mildly spicy. Not my favourite dish at the restaurant though. 3/5  2) Pork Belly Bao (special with their BBQ fest): this is essentially a deep fried Chinese bun (man tou) with pork belly in the middle with some coleslaw inside and on the side.  Small portion (just one - and it was $15 for beer and this Bao). However the pork belly is very well BBQed and very flavourful - I enjoyed this more than the double down.  4/5 (for food - lower score for value)  3) Jerk Chicken: My favourite dish - well seasoned tender. Good portion size - a half size chicken. This was a standout for me and the sauce on the side (almost like a chipotle mayo mixed with a garlic aioli) was incredible. 5/5  4) Fried Chicken: This one had a flavourful but not-too-heavy batter that was topped  with sweet sriracha sauce on the side (tasted almost like a sweet chilli sauce). Their chicken dishes are definitely my favourite. 4.5/5  5) Pineapple Bun Burger: This is their most popular dish according to Yelp reviews but I was underwhelmed by the hype. Perhaps we waited a little too long to dig in but the bottom of my bun become a little soggier than I'd like. The taste is pretty good - a nice mix of savoury and sweet. I wished the pineapple bun flavours were stronger to compliment the strong flavours of the beef better. This might be unfair but I've had the Krispy Kreme donut burger at CNE and I expected the flavours to be as complimentary. The pineapple bun is  too mild compared to that experience. 3.5/5  Overall, I think Patois deserves their 4/5. Good food - a little expensive for sure. Good atmosphere to come to with friends and catch up. Great attentive service checking up on how the food is."}
{"text":"Went to Patois on a Tuesday night. Super cute space: Bar made out of old bowling alley flooring, lazy-Suzan on skateboard wheels and trucks.   The food was very inventive. We had \"the whole shebang\" which is everything on the first side of the menu for $109 (feeds 3 to 4 people. We upgraded on the O.G. Fried chicken and the jerk chicken for $12.  The quantity was plenty for 4 people.   The good: the aforementioned O.G. Chicken and jerk chicken - amazing. Delicious and tender. Dipping sauces were also very good. The pickled daikon is a flavour I will dream about, so earthy, salty, sour.   The salads: coleslaw with the fried chicken, the crunchy Chinese salad. crisp and slightly creamy. Tangy and light. Perfection.   The kimchee potstickers.  So tasty.   The owner: Craig introduced himself and seemed very interested in knowing if we liked the food. He talked to is a bit about the decor choices.   The bad: off the top the service was kind of bad but improved over the course of the meal. I didn't want to sit next to the window, which they weren't thrilled with, but accommodated me. After I was seated I was offered a drink 4 times by 4 different servers. Each time, I accepted. After 15 minutes, I still had no drink (my suspicion is that the bar is overseen by a single bar tender who is making lots of cocktails). By the time the food was coming out the service was prompt and our server was very nice.   The dirty fried rice: way undercooked (kind of crunchy). Advertised as coming with a farm egg but there was no egg in sight (I loves me some eggs. You can't promise and not deliver on that).   The edamame: I thought I liked these. Then I didn't. They are very fishy and buttery. For a few bites it's nice. Then it's way too much.   I will definitely return for OG chicken and salad with some kimchee potstickers to start."}
{"text":"Breakfast fried rice was just fried rice. Fried chicken was $17 for 3 pieces of dull tasteless fried chicken you could get for $3 literally anywhere else."}
{"text":"Patois (@patoistoronto) is serving what they describe as \"Caribbean meets Asian Soul Food\" which is definitely better than the very scary word \"fusion\".  The dcor is hard to describe with colorful chairs, the fun inflatable buoys, the big Mom sign at the back and black & white old photographs hanging on one wall... somehow everything just goes together and it's fun. Love the idea of their version of the round Chinese restaurant \"lazy-Susan\" table with skateboards wheels. Daily special on the board and love the bright red Juicy Jerk sign.  Not only do they have daily cocktail specials, they also served them in Chinese  teapots that can serve 3-4ppl at $40. Will have to get that next time.   Jamaican Patty Double Down $7 ~ Two cocktail patties, bacon, Swiss cheese fondu, sriracha ~ The patties were nice and flaky and filled with yummy beef. ~ Never would have imagine Jamaican patty would be so much better with cheese, bacon and sriracha.     Juicy Jerk Chicken $17 Full Order (or $11 Half Order) ~ Churrasco, rotisserie roasted ~ Heard so many good thing about this that we came here mainly to try this and as the name suggest, it was indeed very juicy. ~ Done Portuguese style, it was very moist and love all the spices here although wished there was a bit of heat to it like most Jerk. ~ And caution to the orange habanero sauce on the side, it's extremely spicy. ~ At first I was thinking that they gave us too little of the sauce but it was plenty since a tiny dot already gives you quite a bit of heat.    O.G.Fried Chicken & Watermelon Pickle $12 Half Order (or $18 Full Order) ~ Thai Basil and sweet sriracha ~ This was amazing, I wouldn't say there's much Caribbean or Chinese flavors/influence to it but it's a solid lightly batter crispy moist Deep Fried Chicken. ~ And did I mention how delicious the watermelon and radish pickled on the side was, just wish there was more of that     Dirty Fried Rice $11 ~ Red Sausage, sweet soya sauce, Cajun trinity, peas and farm egg ~ Heard so many great things about this dish, so I was expecting quite a mind blowing experience but I was disappointed. ~ I thought it was just a overly greasy fried rice with nothing special to it and at $11 for that tiny plate, but Ben seems to really liked it.    Pineapple Cheesecake stuffed French Toast ~ This item was so popular from their Brunch menu that they now also features it on their dessert menu. ~ This was probably my favorite dish of the night and I am definitely switching to Pineapple bun for my French toast at home form now on  ~  For those of you who have never had a Pineapple bun from a Chinese Bakery before, it's originated from Hong Kong and actually do not contain any pineapple but only because the sweet topping/crust resemble a pineapple. ~ But here they added pieces of pineapple, just love the texture and combination of all the flavors here especially the cream cheese. ~ And nothing to beat a warm dessert during winter. Will definitely have to come back to try their Chinese Pineapple Bun Burger!   Verdict: - Definitely a fun place and something that will please any crowd. - Hopefully will be back for the \"Whole Shebang\" at $99 where you get to try the whole menu and feeds 3-4ppl. - The Pineapple Cheesecake French Toast was so amazing that I'll come back in a heart beat just for that. - Will have to come back to try the rest of the menu."}
{"text":"Returned for the dinner menu as promised!  If you're going with a party of 4 or more just order the Shebang.  For around $100 you get to taste their entire menu.  The pineapple bun burger is a must have. difficult to split between 4 people but that shouldn't stop you or just order more.  Bun is sweet, lots of sauce and decked out in 2 beef patties, lettuce and tomatoes.  Get the fresh coconut drink that comes with a shot of rum on the side.  Refreshing stuff. I tried too many dishes tonight to describe it all.  You just need to go try it and you won't be disappointed!"}
{"text":"that oxtail with the plantain coconut rice was AMAZING, i was actually a bit sad when i took the last bite. also got the kimchi potstickers, the OG fried cauliflower (sweet and sour cauliflower essentially), and wok fried gailan. tried to order the jamaican patty double down but they sold out of the vegetarian patties...guess we will have to go back another time."}
{"text":"Man, this place is doing it right! Great food, wicked cocktails. Staff is a blast and ambience puts you in a good mood as soon as you cross the threshold. The Jamaican Patty Double Down may be one of the best things I have ever tasted, no, wait... the Chinese Pineapple Bun Burger is, nope...the Prosperity Lobster. Ahhh jeez, I don't know?!? Just do yourself a favour and get 'The Whole Shebang' and you tell me!"}
{"text":"I probably won't visit second time. I thought the number one rule to open a restaurant is not to serve raw chicken to your customers. Even though the manager was kind enough to send a fresh order which make me moved from one star to two, it's still lightly undercooked in the centre. And the juicy jerk chicken was their most famous one. God knows what else is raw too. The kimchi potsticker, the dough was raw as well at the thick side. I think if you prefer raw food, probably this is a good place. If not, don't come here."}
{"text":"Good food; bad service to non-locals (I hope that was the only reason *shrugs*)  [started this review months ago and forgot to finish it]  The food is really really good.  It has nice fusion dining options of things we Americans wouldn't typically think to put together but pair well. I recall the sticky bacon really sticking out as delicious to me and the dish that I had was perfect. Definitely come in and try the food options.  My only [big] problem with this restaurant is the service. Our server from the outset of us sitting down (myself and two AA women) seemed to single us out as the type of customers he would not like. He literally seemed disgusted that we were seated in his section and he had to serve us.  Maybe we didn't fit their local hipster scene profile, idk??  I don't want to base the entire restaurant on him because most everyone else there seemed ok. He was a black Canadian, probably with some Caribbean heritage.  If the owners are reading this, I loved the food at your restaurant but your server is the kind of person to make me skip coming back here on my next visit to the city."}
