{"text":"Patriot has had its ups and downs.   Tonight's food was great!   Pepper burger and onion rings were spot on... amazing.   Wife had the jerk chicken.. cleaned her plate.  Kids had grilled cheese... ate it all.    Food has gotten better.  We were there last month on a friday and food was so/so.. too busy I think for them to keep up.  Tonight did not seem busy and it came out just right.

One thing the owner better fix ASAP as in tonight or tomorrow he/she gets up is the green lids that secure their septic tanks.  A small child just about fell into the tank tonight and was holding on by a few fingers before someone grabbed them.   That kid would have fell in, a life would have lost and business closed for good.   The staff was advised but unsure what to do as the owner was not around.   

Dont get me wrong, I love the place.. but i will change my rating when the owner(s) fix the huge liability they have in the lawn in the back.. jeez.   (6) screws hold that lid on and two safety latches and none of it was secure.  The lid tip sideways and poor kid fell in just hanging on by fingers."}
{"text":"Pretty good food. Service is mediocre at best. Chock-full of rednecks and locals aka rednecks. Could be a great place if it wasn't for the whole Tega Cay, South Carolina vibe."}
{"text":"Very disappointing ordered shrimp in basket 
Shrimp must have been boiled before coated for frying very tough and coating very mushy.   Also served in tiny basket  very overpriced !  Southwest Egg Rolls over done!"}
{"text":"Would never go back- for ANY reason-terrible food and service. Too bad this place is not good- could be a fantastic location if the owner or manager would fix the problems, but I will never give them another shot- too many bad bad bad experiences- if I could give zero stars, I would."}
{"text":"This place is an awesome bar. Huge patio area for concerts. Great beer on tap. Cheap prices. Ton of games for kids. I would totally come back. It is a bar so don't expect amazing food but pretty standard bar food. Highly recommend this place for a Saturday or Sunday afternoon game watch with the family."}
{"text":"Who puts a red cabbage slaw on a Carolina burger???
The game room was noisy with uncontrolled kids throwing pool table balls and screaming the whole time we were there which was very annoying.
We liked what they did with the decor besides the game room... If they would get someone to put forth some effort into that menu and put some less noisy games in we may give it another try since it's so close to our house
."}
{"text":"We love this place. Nice bar inside and out. Chicken fingers are awesome as well as seared tuna and steak bites are out of this world. Thomas the Manager is great and we love our bartender April."}
{"text":"The only reason this place has 2 stars is because of the patio and cheap drinks.  The menu changes daily and the quality of food has diminished greatly since opening.  Who goes from serving a huge portion of awesome mac and cheese to kraft macaroni? On a 10.00 dish? Smh.. Also a chicken wrap should have chicken in it and be tossed in the sauce.  Also unlock your jukebox for all types of music.  I'd hit up this spot for a drink and enjoy the patio skip the food and eat at home. What happened to Ziggy's?  Katie our server was great."}
{"text":"My husband and I stopped in for a quick bite as our home is only about a half mile down the road.  I ordered a house salad with chicken and my husband ordered a chefs salad.  It took just shy of 30 minutes for our salads to appear - there were only 4 other (2-4 top) tables so we were a bit surprised that it took so long.  What was absolutely amazing was that my husbands salad had at least 50% more lettuce in his than mine did LOL. During our wait we were however entertained by several very intoxicated people at the bar.  We were shocked to see that the young bartender continued to pour them drinks AND shots - believe me they were banging them down.  She was even kind enough to pour a white wine in a to go cup (with a straw no less) for one of the drunk patrons!!  Isn't that against the law as well as serving people that are clearly over the limit?  WOW.  This was our second time (very bad the first time) and unfortunately will be our last time especially since both my husband and I became suspiciously ill after eating at this establishment.  My husband was more ill than I was - hmmm maybe because he had more salad than I did?  Once again we will wait until this business closes and someone else gives it a shot.  BTW prior to getting sick I would have given the food and service a 3 rating."}
{"text":"This is a nice place to meet friends for a good meal since the atmosphere is casual and just loud enough to encourage laughter and fun. I ordered the Reagan, a ribeye with mashed potatoes and a side. I subbed a salad for the potatoes and chose seasoned vegetables. The steak was cooked perfectly to my spec of med rare, and I highly recommend the vegetables as they were excellent. My husband ordered the sirloin and was very complimentary of the juicy, tender quality of the meat. Our dining partners both ordered the hand-battered fish and chips which looked scrumptious. Our waitress was on top of everything we asked for, refilling drinks continually and promptly getting sauces that we requested. Of course she didn't have many tables to wait on because the restaurant crowd was slim; I'm hoping it's because diners just don't know about this gem yet. Great food, great service, fun atmosphere!"}
{"text":"We just moved here from NJ and our friends who live here told us to try this place out, well we were not disappointed we went last night 5/3/16 and it was not crowded but we were ok with that! We started chatting with the bartender Courtney who couldn't be any more nicer and she gave us such a nice welcome made us feel very comfortable. Since the kitchen was about to close we were able to get some wings and coming from NJ and always going to the best wing place I had high hopes lol I got the Caribbean Jerk which is a dry rub and my husband got Chuck Norris which was a wet and spicy rub and they were delicious and the blue cheese is the best I ever had and to find out they make their own wow definitely found a place that we will continue to go to definitely worth trying folks!!"}
{"text":"Ok,  we have been here several times, enjoyed many of their brews and delicious eats. I like this place! It has great food, nostalgic tunes (courtesy of touch tunes), and fantastic service.

Being the lover of beer that I am, this placed as a decent share of variety from low to high gravity beers. Dan greeted us as we sat at the bar and provided menus. Asking him a few questions, I discovered that he knew a lot about the beer. I appreciate it when I am able to chat beer. He left us for a little for us to scan the menu. Upon his return, he brought over the other bartender and introduced Courtney to us. We ordered and proceeded to put in classic tunes on the jukebox. 

This place has several deals depending on the day of the week - half price burger Mondays, taco Tuesdays and so on along with happy hour Monday thru Fridays 4pm to 7pm. Great prices for the beers including the high gravity ones and if you are not able to decide on one, they have flights too!

Service, beer and food are all great. Call ahead about live music as well. Nothing truly stood out to put this up to a 5 star but they are certainly headed in the right direction."}
{"text":"We had their burger, fries and onion rings for carry out. Burgers were huge and tasty. 
The place looked very busy and had a great atmosphere for a sports bar. We will be back to try it out inside/outside patio."}
{"text":"I had low expectations and was pleasantly surprised. I hadn't read any reviews and had never been there when it was another restaurant so I based my impression on the location and exterior only. the place is bigger than I thought it would be. The interior is unimpressive. I went on a Friday night at 6:30. There was no wait. The staff was friendly and provided excellent service and the food was surprisingly good! I am a recent TC resident and I will definitely go back. The only negative I want to call out is the noise level. It was perfectly fine when you come with your family and kids but if a quiet evening is important I would keep it moving."}
{"text":"Won't visit again.
Sat at the bar as with most places.
Taphoiuse and bartender doesn't know how to pour Guiness from draft.
Very small liquor selection...no Seagrams 7 huh?!
Bar menu...meaning limited selection of food.
Fish tacos got 3 but no side like fries elsewhere.
Fish and chips TONS of fries.
Both meals were interesting...flavor was lacking. Tasted like eating moldy bread ugh.
Customer beside was beyond buzzed and other bartender gave another wine."}
{"text":"We had a terrible experience at the patriot tonight. I have been there before and loved it. Our service was terrible, food cold and tasted reheated, took forever to come out, and the kids food was burnt. We eat there quite often and will not be going back any time in the near future. I saw a sign up recently about new management and I guess that could be the issue but we were very disappointed."}
{"text":"My wife, a buddy, and I tried this place out for a \"Sunday Fun Day\" of football and food for lunch today and we all really enjoyed it.  My wife had the lemon pepper wings and sweet potato fries, my friend had a burger, and I had the bratwurst special with waffle fries/chips.  The service was really good and our waitress came by frequently to check on us.  I didn't taste the burger, but my friend said it was really delicious and I could see they cooked it to his preference (mid-well).  I tasted one of my wife's lemon pepper wings, and it was a little drier than I prefer, but it was very flavorful and my wife really liked them.  I also had one of her sweet potato fries and it was pretty good, not dried-out/overcooked like at a lot of places.  My bratwurst was very good and juicy, and was served in a roll, not a hot dog bun (nice touch).  The restaurant it pretty large, with a separate bar area and a nice sized patio.  We'll definitely be back."}
{"text":"We got an advertisement this weekend and thought we'd check it out. They have a great facility. There is a really nice outside bar, a spacious patio, with a stage for music. The inside is spacious, with 2 billiards tables and is very warm  and designed well. We ordered several apps which were quite tasty and the service was friendly.   This bar also needs work. 1st have servers say welcome to Patriot Taphouse my name is....   Sounds basic but is amazing servers would rather have someone say Hey you!  The design of the bar has a unique whiskey barrel table. They should have a whiskey cocktail menu to tie in. Worse they have no cocktail menu. How do your servers suggestively sell? There is a generous beer menu but once again no presentation around it. That's a training issue. 
The outside bar is a smokers paradise. For non smokers and families .....not so much. We had to move because the smoke was so bad . saw some regulars \"hitting on\" a bartender relentlessly until they switched to a male bartender. Invite those \"patrons\" to drink eleswhere. You will have the customers you deserve. 
This place has so much potential. I hope management sees what they can be. Could be successful just can't let the obnoxious clientele run off your profit.  They have to get their arms around the smoke outside as well."}
{"text":"We just moved in Tega  Cay.We visited the Patriot last night, good service, good burger, good beer.
We are lucky to have a place like that close.
Be happy"}
{"text":"The Patriot is a great casual place to enjoy with a group of friends! The patio is large with plenty of seating and room to play life size jenga, cornhole, etc! When I was there this past weekend they had a fun live music act and the patio was packed. Everyone I was with had enjoyed themselves. The food was yummy, especially the wings! The Flying Pig flavor (the house special) was the best. I'm very impressed with the beer selection and am a fan of the local options that are available. Oh and the staff gave wonderful service! I work down the street and will definitely be back to enjoy happy hour and dinner with coworkers and friends."}
{"text":"I went to the Patriot this last weekend for a fundraising event put on by my friends company. The bar has a great selection of beers and good food while still maintaining a small-town neighborhood feel. The management and staff were very accommodating and the music and games were fun for people of all ages. I will certainly be returning soon."}
{"text":"Service was bad. Waitress didn't know anything on the menu. Tried to tell us a salad  didn't come with the dressing the menu said it did. The Chorizo burger didn't have chorizo or the pepper jack. Took 40+ minutes to get salad and burger and the place was rather empty at the time. Bad server. Bad cook staff."}
{"text":"Food is decent, very kid friendly . Appears owners are stepping on to turn around the place. Both were there last night and seemed very cool. Hope this place makes it, perfect spot... Give it a whirl, lots of beers..."}
{"text":"They put up a sign Under New Management several weeks ago so stopped in this Saturday afternoon to see if there were any changes. No changes to the interior that I could tell, the outdoor bar was not open and that area still looks unkept like normal. Inside music that was playing was horrible and way to loud so conversation was impossible, on an afternoon music should be for background not up in your face. Employees and managers talking back and forth from across the room rather than face to face, they were yelling because music was so loud. Bartenders very inexperienced. I really hope things improve but my guess is they are about out of gas."}
{"text":"Was really excited to see something with a good concept moving in to this location, they have an awesome outside bar with tons of tables both covered and outside. The food seems to have changed quite a few times since they opened, it almost feels like they change the menu based on what was on sale or what they can make easily that day, if they make a menu they need to stick to it a little longer than a week or two. 
The draft beer is not very cold and they seem to always be out of most of what is on their list, I would assume if you run out of something fast it must be popular, stock up and keep the patrons happy. 
The outdoor seating area is odd, you have to go inside and request seating and a server, it doesn't seem like there are sections as the waitresses are waiting on tables all over inside and out and you could be sitting waiting for a while even though every table around you is being served by different servers. 
Outside \"could be\" great but they seem to be approaching it as more of a problem, when there are 4 people inside and 30 outside it should tell you something. 
To sum it up; make a menu and stick to it, make the outside a priority, create dedicated serving areas and most important figure out why the beer isn't as cold as it should be."}
{"text":"If I could give this place zero stars, I would. Awful food, awful service, and ridiculous wait times. We complained to the manager about the terrible service and she blamed the kitchen staff and said we weren't being patient enough, although we waited 20 minutes for drinks and an hour for food. She said they were so very busy that they were having a hard time keeping up. There were many empty tables and plenty of staff.

I would never recommend this place to anyone ever. Not to mention the karaoke they had. Letting 9 and 10 year olds sing lewd rap songs..it was terrible.  The manager should be fired."}
{"text":"The Patriot is pretty unassuming from first look, but the inside is big and it has a game room. Their outside has a bar and a huge patio- a really nice space to hang out alone or in a group of any size.  

The waitresses were sweet and attentive, but I hope they have more staff during a busy weekend! They have a good selection of draft and bottle/can beers (including local NC and SC brews). Their menu offers an average amount of variety, we tried a couple appetizers, wings, a sandwich, a burger, and a wrap. The wings came out really burnt but the waitress replaced them promptly. Everything else was pretty good- definitely bar food. 

I noticed on their sign that they offer Trivia on Wednesday and Music Trivia on Thursday... I think if I were to return it would be to hang out, drink beer on the patio on a warm night, and test my random knowledge!"}
{"text":"Very poor, slow service. You will wait 20 minutes for a drink refill. Manager is running around bossing people and making rude comments to the customers instead of refilling drinks or helping her overwhelmed wait staff. Food is mediocre. I live 1.4 miles from this establishment be don't ever plan on returning!"}
{"text":"Coming for a gourmet experience? Get real. As a local watering hole? I couldn't ask for more. Nice bar; friendly, professional staff; pool table; bar snacks."}
{"text":"New management and apparently name change to Mavericks ( at least that's what's on the new menu )

I had the fish and chips.  The fish was awesome... Amazing... Excellent and basically the reason the score averaged up to a 4 star because the chips were nasty... Just French fries that tasted like they were reheated leftovers from lunch... Dry and rubbery... So how did they get a 4 star???  Did I mention the fish??"}
{"text":"Like others, we live in Tega Cay and are greatly appreciative that a new \"watering hole\"/restaurant has opened up in what really is a great location and facility. It's obvious that a lot of time and money was put into updating the interior from Ziggy's to Patriot. They took out a partition wall that separated the restaurant from the bar, elevated the booths around the inside walls, added the \"barrel booth\", etc. 

We have only visited Patriot once since it opened, and I have rated it four stars based on the potential that is there. Given that it's a new establishment, to grade it with the same criteria I would as a well-established restaurant/bar would be unfair in my opinion. It seems to me that they have the right structure and business model in place, just need to work out a few kinks which are commonly found with new restaurants.

Pros:
-Menu resembles that of a \"gastropub\" in many ways, with both unique offerings (pork belly sliders, salt-and-pepper calamari) and standards (burgers, wings).
-Beer selection: 30 on tap, including many craft and local selections.
-Atmosphere fosters both those looking for a \"restaurant\", and those looking for a place to drink beer and watch football.

Cons (from our visit):
-Server was initially inattentive, but came around more frequently and with a better attitude when he could tell I was frustrated.
-\"Patriot nachos\" offered a good recipe, but lacked sufficient amount of toppings and came out room temperature.

I have given Patriot the benefit of the doubt on the \"cons\", being as it was a Sunday afternoon and they had only been open for two weeks. Patriot shows a lot of potential, and I have faith that they will work out some of the new restaurant kinks. I'm looking forward to warmer weather, as the outdoor bar and huge patio are great for enjoying good weather and cold drinks!"}
{"text":"We tried this place on Sunday night and we were really pleased with the service and food, the kids liked sitting at the barrel table,
We had the fish and chips and jerk chicken and it was excellent,"}
{"text":"The fella and I ventured in on a Saturday evening around 6:00 and got right in. The place is HUGE with a massive outdoor patio, huge dining room with pool tables and a basketball game, and a bar area. It looked like most of the seats at the bar were full, but it was so far away from our booth in the dining room that we felt like the only ones there.

Their beer list is pretty decent with local options, a few craft selections, and the usual Bud/Bud Light. They even had a cider on tap and a pretty extensive bottle/can list. I got a the jerk chicken with a grilled pineapple on top over rice and a side of veggies, and the fella got a burger. In between getting our drinks and waiting for our food, our waitress asked us twice if we were doing okay - she was attentive to say the least.

The parking was easy, the service was good, the food was fine... but we both agreed there was nothing particularly memorable about it. I wouldn't be in a hurry to go back, but I'd be fine if I had to."}
{"text":"I'll give them the benefit of the doubt in that it's a new establishment, working out some kinks. My husband and I have been a few times. Their beer selection was impressive for such a small neighborhood place. One beer I ordered came out flat. I told the waitress who apologized profusely, brought me a different beer free of charge while they replaced the keg on my original order. She brought one out from the new keg and it was great. Problem solved, and I got a free drink. The menu is typical of a bar joint. Sandwiches, wings and burgers. The food isn't bad. I've enjoyed their wings and burgers... however the service has been painfully slow during times that there were only a few people in the place. Not sure what the problem in the kitchen is. 

I'm hopefully that they will get things flowing more smoothly sooner than later. It would be sad to see a place with great potential fail again in Tega Cay!"}
{"text":"Came by for a beer after work. Used to be 30 beers on tap from all over the U.S. and beyond.  Seems the beers are mostly mainstream now with few local craft beers.  Only have 20 beers on tap and most of those are Bud, Bud light, PBR, Stella, Miller Lights, etc. 

Still some local Charlotte and Ft. Mill / Rock Hill varieties, but the choices under the new management are fewer and far between.

A shame. Love this joint, but I could go to any dive bar for the selection they offer now.  

Food still seems decent, but much changed.  No more Taco Tuesday, so that's disappointing.  

They do have deep fried oreos, so there's a bit of love I have to give them for that.

We'll keep coming by to see how things evolve."}
{"text":"Don't let the outside appearance of this place tucked behind a hair salon fool you, they are serving a very good menu, service is always excellent and attentive, and the draft menu is a great combination of local draft beers.  This place is an example of a restaurant keeping it simple but executing very well.  Took my family here, kids loved their meals, my daughter got the house-made Mac and Cheese which was made fresh and was amazing, maybe the best Mac and Cheese I have had in the area.  The prices are reasonable so do yourself a favor and get here whether it is for an afternoon beer during your favorite game or dinner with family and friends."}
{"text":"I'm giving 4 stars as a resident who remembers the previous establishments that occupied this building, going back to 2006.  Given that metric, PATRIOT adequately fills the needs of a neighborhood family restaurant/taphouse.

On a recent outing, the food was well prepared (standard bar fare with a few interesting twists, like the pimento cheeseburger) and the microbrew menu was quite impressive.

Thumbs up to the improved decor, as well.

Here's hoping they can handle the weekend crowds with ease."}
{"text":"I'm super disappointed. Given that this is so close to home I want to give them my business but I've given them their last chance today. Went in around 5 and saw quite a few people at the bar watching the game but no one in the actual seating area except my husband, our toddler and I. Our waitress was friendly but we sat for close to an hour waiting for our food (which is NOT ideal with a toddler). I had my eye on the kitchen to see if they were backed up but only one plate sat on the waiting area for twenty minutes. When we received our food I took two bites of my Cajun chicken fettuccini and was beyond disappointed and did not finish it. I will not be returning and am sad to say that, I wished it would be better bc it's such a convenient location."}
{"text":"Really like this spot.  Found it by looking on Yelp for places near our home.  Friendly atmosphere and very family friendly.  

We probably go here 3 times a month.  Having a beer menu with details like origin, alcohol content, and price are a nice touch.  

Enjoyable place to eat with reasonable prices."}
{"text":"This place has a lot of potential and hopefully will meet it. I love that we have it in Tega Cay. They have live music on the weekends which is great. Trivia night on Thursday and other specials. We went for trivia and peel and eat shrimp night. It was music trivia which was fun for the whole family. The peel and eat shrimp stunk though. They were hot and bland. NEED SOME OLD BAY, or something! The wings, salads and sandwiches are all pretty good. The wait staff is hit or miss. Some are forgetful and slow. Others were warm and attentive. I think the more people that go here, the better it will get."}
{"text":"I wanted to update this review. My wife and I have tried the Patriot 2 more times and both times we have noticed a huge positive change in both the wait staff and the food and drink. The menu is much improved. All of our selections have been good to great. We both recommend the wings with the house Flying Pig sauce."}
{"text":"I've been here 2 or 3 times in the past few weeks. It is a great concept, I want to love it. Lots of things I do love about this place. One night we came with our whole family, (grown children & middle school girls). We played pool together & after we ate they started a music bingo. We all had a great time & made good memories. My husband & I have sat out on the deck and listened to the music. Great deck/bar area!  They have a band every weekend. My only drawback to this place was the food. We've found as long as you get a burger or wings it's fine. I've tried a steak & a wrap neither were good.  Service was good, drinks are good. Lots of craft beers, a few wine choices. I will be back because I just like the place, but I hope they improve the kitchen."}
{"text":"Been here a couple of times recently and had 2 completely different experiences. The 1st time was nice.  We sat outside on the patio and listened to live music.  The service and food were both pretty decent.  They have a great outdoor bar, outdoor stage, and heaters on the patio for the nights it gets a lil chilly.

2nd time we went, we were very disappointed. We got to the restaurant shortly after 8pm and we're promptly seated.  The waitress took our drink orders and we ordered an appetizer.  The appetizer shows ups and we go to place our order.  This all happens within 15 minutes of arriving. It's then that we are told that we will only be able to order fried foods because the kitchen has closed the grill.  None of us were wanting fried food and I ask her to please check with the kitchen because we were not told this until now.  She returns and says they can't turn the grill back on.  We tell her we are leaving for another restaurant and this is ridiculous. She actually tells us that its really too late to be eating dinner.  Haha, seriously??  She then expects us to pay our bill. I pay for the appetizer just to be done with it but refuse to pay for the drinks (non-alcohol) when we weren't even eating.  We asked for a to go box for the appetizer that was worthless once getting home.  

Because of this visit, The Patriot has probably lost our business permanently."}
{"text":"I have been living in Tega Cay for 6 years, and this place has changed owners and names four times. It's closed right now, so I guess it's changing hands again. Cool place in the summer time. Prob best to get a burger or grilled cheese there. Feels too \"bar food\" like to order a complex entree."}
{"text":"Came to check out the changes now that it's Patriots. Very busy for a Friday night, could have used music for atmosphere. Found 2 seats at the bar, typical bar food but menu is small in choices. Ordered the buffalo grilled chicken sandwich, with fries and a side salad. We asked for the salads to come out first 3 times and everything can out together. Very disappointing, food was average. Employees were pleasant, bartenders were attentive bartender offered a free drink for the sale mistake which was appreciated."}
{"text":"This is a really good place for Tega Cay/Fort Mill area. I went on a Friday night. There was a relatively small crowd. Almost everyone was sitting outside in the patio area. We chose to sit inside, and were almost alone in the dining area. I saw the picture on Yelp of the Barrel Table, and figured I needed to sit in that. Check it out if available. Its unique. The first thing you notice here is a great craft beer selection. They probably have 20 different beers on tap and a large selection of bottles. First, I ordered the Unknown Over the Edge IPA. This was pretty good. However, on my second I ordered the COAST Boy King double IPA. If you haven't had this, then I just gave you a reason to stop what you are doing right now, and drive immediately to Patriot and order it. It was fantastic. I tried to visit Coast brewery in Charleston earlier in the year, but they close relatively early on Friday's. This is the first time I've seen Coast available in our area.

For those who don't want beer, they had 8 wines by the glass. My wife had very good red blend. Sorry, I forget what it was. But I think it was the only red blend on the menu. Paso or something. 

They had a good selection of appetizers. We went for Fried Pickles which were very good. Sometimes friend pickles can be a little greasy, but these were very good, not greasy. 

For food, my wife and daughter ordered the 8 oz sirloin steak, mashed potatoes, and mac and cheese. I never like ordering a steak at a non-steak place, because you usually don't get a good steak. This steak was just ok. Disappointing, it was over cooked. My wife ordered medium, but this steak was probably past well done. That pretty much kills a steak. My daughter ordered medium well, and her's wasn't quite well done, but close. Anyway, I don't recommend the steak here and that's one star deduction. It was really the only thing poor about our experience.

My daughter's boy friend got a burger and he said it was very good. I got fish and chips, which was recommended by the waitress and it was excellent.
Several on Yelp complained about the slow, inattentive service here, so I was mindful of that, actually expecting it. However, our waitress was very friendly, attentive, helpful. The kitchen service was a little slow, but not terrible. We were not in a hurry, so it was fine. In fact, after we ordered our food, we went over and played a game of pool. They have a cool area with 2 pool tables, a basketball ball shooting game, a skee ball game, and a couple of other small games. This would be a good place to give your kids a few dollars and let them hang out, while the adults talk. Or you Dad's can go show off your skills and beat their pants off in a game of pool.

After dinner we went out to the patio area where Chris Holder, chrisholdermusic.com, was setting up to play guitar. We had another drink outside and spent a couple of hours hanging out there, listening to good music. The waitress said they have live music every Friday and Saturday night. And they were having an Unknown Brewery event in the outdoor area the next evening.
Overall, this was a great addition to Tega Cay and a great place to go hang out, and its kid friendly, with great craft beer selection and decent food."}
