{"text":"Good, solid diner breakfasts. They also have great specials that are unexpected and interesting (breakfast Reuben!) Lots of locals in a small cozy place, and it's awesome to support local businesses. 
In the evenings, they have FANTASTIC pizza!"}
{"text":"Great, delicious food. Welcoming, sincere staff with excellent service. The fish sandwich had really tasty fish that was perfectly cooked in a really good batter. Twistollis were excellent with pecan butter! Will definitely return."}
{"text":"Ordered a pizza and Italian hoagie for takeout. It was ready promptly, tasted fantastic, and friendly service. 
The tomato sauce was fresh and great, the hand tossed crust was crispy. I loved this hoagie and reminded me of any great Pittsburgh Italian hoagie."}
{"text":"Delicious breakfast with VERY plentiful servings!  I had their mixed grill with hot sausage and it was just tremendous.  Server was friendly and kept the coffee coming while my friends and I talked and ate.

If you want a delicious, fresh breakfast in a friendly atmosphere, I highly recommend it!"}
{"text":"A local Gem of Bethel Park, Don't judge this book by its cover. The breakfast is the best and is inexpensive and very filling. Lunch and Dinner are good times to go because they aren't as busy. Weekly Specials add a great taste to menu."}
{"text":"Had a philly steak omelette, it was really good. Nice, cute, little place."}
{"text":"fabulous little down home eatery out in the South hills. took a chance on the great reviews and found it to live up to the standard. it was a slow Saturday evening around 5pm and we were there only patrons in the establishment so the attention was 100% on us which may be a bit unfair but Debbie and crew were very welcoming and helpful. had the kids with us and they were accommodated with crayons and apple sauce without a hesitation.
we enjoyed a 6oz burger which was top notch because there was flavor. finally found a restaurant that knows how to season the beef! small pizza and calzone with homemade dough were both great. left with a full belly and smile on our faces. great service! can't wait to try breakfast in the future."}
{"text":"Great breakfast! Owned and operated by even better people! Patsy's breakfast specials are always interesting and delicious. I end up always going with one of Patsy's specials, they never disappoint! Reasonable prices, big portions, and good people."}
{"text":"Great breakfast place on the weekends! The regular menu items are good and the specials are creative. They also do a nice job on customer service and are always pleasant when we stop in to grab a bite."}
{"text":"What a great place for breakfast, lunch or a very casual dinner. Food is of good quality and pizza is freash and tasty. Breakfast specials are creative using spinach..peppers..feta..artichokes. ..and so forth. Portians are considerable. I eat there sometimes twice a week because of great food..good value..and prompt friendly service. 

I would recommend this place to anyone looking for a great breakfast or quick friendly bite."}
{"text":"Every time I'm in the burgh, I make it a point to stop in here. Some of the best pizza in the burgh, the pepperoni curls in the oven and you can't beat it!  Awesome hoagies, and I've even been there for breakfast which was phenomenal. All reasonably priced. 5/5"}
{"text":"Finally remembered to try this place this past Saturday at the last min ...GLAD I did ....Let me start by saying I have lived in bethel park my entire life pretty much I had been to the old place that was once here for breakfast many times and it was just a \"greasy Spoon\" to me. Now the food I had was AMAZING ....

My wife and I shared an extra large pizza and an order of fries ....The fries were nice and golden and cruncy with just the rite amount of salt and Mm mm tasty 

the pizza which I honestly was on the fence about was DELICIOUS ....We got a simple extra large pizza with pepperoni and let me say there was NO lack of pepperoni, the crust was nice and crispy it has just the rite amount of sauce and was just delicious I will definitely be getting this again in the near future."}
{"text":"Owner and everyone working there are wonderful! I called at closing time and they turned the oven back on for me to make my hoagies, which were delicious! And they also mistakenly made some extra fries and gave them to me for free anyway! Definitely go check this place out sometime when in bethel park."}
{"text":"This is a small diner with a very homey feel to it. It's a little small and tight, with maybe 10 or 12 tables. It was about half full around noon on a Saturday. It looked like most people were still getting breakfast, which they serve until 2:00 pm.   There are some regular sized tables seating about four and a few high tables seating two. 

I ordered a chicken Parmesan sandwich. The sandwiches don't come with anything--you can get fries for an extra price, $2.89, I believe. The sandwich was god, with tasty marinara sauce and provolone cheese. The price seemed slightly high. 

Service was reasonably quick and friendly. This is a good place to get a meal if you're in the area, and i suspect it might be better for breakfast than lunch."}
{"text":"Great food, great service, get the mixed grill with hot sausage huge portion & delicious. Server Margret always keeps your drink full with a smile"}
{"text":"Not a bad little place hidden off  of the road. We had lunch and I wanted a meatball sandwich which they were out of so I picked the Italian hoagie. I'm not to sure my taste buds were happy about the switch but my belly was. I'll have to try their breakfast next time as that's what seems to be their best offering."}
{"text":"Had breakfast here with my wife and 4 year old son. Thought the service was very friendly and quick. My son enjoyed his pancakes and my wife and I enjoyed our eggs, bacon and home fries. Thought it was a little pricey but otherwise happy with my experience."}
{"text":"Patsy's Place is relatively new.  Great place to go for breakfast -- I love that you can order anything off the menu for breakfast, lunch or dinner.  We've been there several times.  The grilled chicken salad is one of the best I've had -- just the right amount of everything -- and I love the mild pepper rings they add to it.  All very fresh ingredients.  Hoagies, burgers, and tuna melt are also excellent.  

Traditional breakfast menu is good as well -- nothing fancy, but everything is fresh and made to order.

Haven't tried their pizza yet - but it looks excellent -- the homemade kind!

Staff is very friendly and makes you feel welcome -- nice addition to the neighborhood.

Prices are very reasonable.  Highly recommend!"}
{"text":"Have only eaten breakfast here but it's very good and Patsy was the waitress!  She's very funny.  The cinnamon swirl pancakes are awesome and I love the hot sausage for breakfast."}
{"text":"Patsy's Place is you would call a \"staple\" in my \"need to visit\" places when I return to Pittsburgh. The food is always fantastic, the atmosphere is delightful, and the best part is how \"home-y\" it feels inside (I think this has a lot to do with the people they have working there)! It's a great place to grab breakfast (my favorite is the Hungry Man), lunch, or dinner (the pizza is the BOMB, and their constantly rotating dinner specials will satisfy even the pickiest of eaters). If you're looking for a delicious, made-to-order meal without the crazy cost of eating out that we're so accustomed to nowadays, this is the place to go! Can't recommend it enough, would give them 10 stars if I could!

Thank you Patsy's Place for satisfying my cravings for the food I grew up eating, in the place that is notorious for its good eats! 

Why are you still reading this when you could be ordering take-out?! 

Cheers!"}
{"text":"This was 4 1/2 star good. 
We were nearly the first customers there on a weekday morning and were warmly greeted by, I assume, Patsy herself. As the place quickly filled with regulars, we were still treated to great service and good food. One of the specials, garlic and parm French toast with eggs and hollandaise sauce, was DELICIOUS. I don't know if the regulars would warm up to it, but the the younger set should try the specials for sure. The cook, or whomever is making the decisions on the menu, knows what they're doing. The omelettes are good and substantially sized, but basically they take on the flavor of whatever you've put in it. The provolone was a nice addition.  I've never had to decide between \"sweet\" or \"hot\" sausage at breakfast, but I went with the sweet and it was a classically tasting breakfast sausage--but better. They were big and yummy, and I would get them again for sure. The decor is dineresque, and it looked like they were doing some repair work on a wall, but we didn't care, since we weren't there for the ambience. 
We will go back again when we're in the area and will defer to the specials."}
{"text":"With some pretty big shoes to fill, Patsy's Place is well on its way to a great start. In fact, I may go as far as to say, it will exceed expectations.

Located in a little homey building, across from Foodland on the main road of Route 88, Patsy's is not hard to miss. It screams, \"Come in, we are that home-style diner you are looking for!\"

Previously, two owners before it was Patsy's, it was a local favorite, Freddy's, where breakfast was king, and then out of the blue, this busy little place closed down, leaving the breakfast dwellers to find another place.

Ug!

Imagine my delight when a new business started remodeling the place. I waited impatiently for it to open. The 'second' place opened nicely, but quickly, just turned 'meh'. After my third visit, I didn't  return. Then on the turn of a time, I saw the sign change to  'Coming Soon! Patsy's Place.'

Patsy's Place? Now, see that rang a good bell. I mean, to me, my gut instinct told me that this was the 'one'. After all, there is just something about eating establishments named after a favorite Aunt or Uncle. You just know they're gonna be good.

Patsy's Place did not let me down. The exterior was cleaned up nicely with a newly added flower bed to help organize parking. Interior, bright and clean. Gina was my waitress and she was extremely pleasant and efficient.

The menu was a welcome relief of breakfast served all day and a lunch menu that was so diner like I wanted to jump for joy. Tuna melt? Oh, yeah.

I ordered the two egg breakfast. The eggs were cooked perfectly, home fries were tasty and crisp, the sausage .... Big ol' sausages that reminded me of Irish Bangers. Tender and cooked wonderfully, not to mention tasty.

By the way, a diner next to me ordered an Italian Hoagie. Those things were man size, so much so this man had to cut it in half to eat it.

The coffee was fresh which was a pleasant surprise because I came a half an hour before diner closing. When I added my cream it was a warm caramel color and I had a carafe placed on the table.

And apparently, the cook, Bob (There's that favorite uncle name again) knew his stuff, because from placing my order to getting my food was five minutes.

Food was great ... check ... atmosphere ... awesome .... Price ... oh, wow, you can't beat it. Patsy's does not overcharge you for a cup of coffee or soda.

I had the pleasure of meeting Patsy. I knew it was her before introduction because she treated every guests there like a family member. A wonderfully, upbeat and enjoyable woman who is gonna kick butt in her new business.

I will be back on a regular basis. The true test will be bringing my mom there and I have no doubt, my mother will love it."}
{"text":"Stopped in for brunch with my wife, food and service were ok. Nothing was bad by any means, but there are better options in the area in my opinion.  Give it a shot and judge for yourself though."}
