{"text":"amazing everything!!!  great atomsphere, friendly staff, unbelievable home made food!!!  and holly cheap beer!!!! what a great place to relax, visit with friends and watch the game... mmmmmmm steak is to die for and the portions are hugmongous!!!!  if your a partier its the best place to get deliocous food and pre drink for cheap!!! as they close at 10, and the owner makes a point to come out and make sure eveything is good. we will be back!!"}
{"text":"Yelp actually got me to try this place out! The reviews on here are outstanding, I wouldn't have even given this place a second look from the outside.  With that being said, I was quite disappointed in what I received; versus what had been said on here.   My frustration first started with the Menu. Set Pizzas and I didn't see an option to really create your own. I went with a Pepperoni and Ham option. Not a huge fan of Ham on Pizza myself; but I gave it a shot. I was looking for something with Bacon on it - without having to go with an all out 'Meat' Pizza. I got an order of Wings and picked it up within 20 minutes.  From the inside; Looked quite cozy, I made a note to actually come sit down and eat one night with some Friends. Nice Bar, Nice Atmosphere, and everyone seemed friendly!  Took it home.. and wasn't blown away. The pizza itself was quite good.. The sauce isn't a Traditional Pizza Sauce, I found it quite Acidic.. Not bad by any means.. just not really what I was expecting. The toppings were not good, at all, Cheap Pepperoni and the Ham was forgettable.  The Cheese was the savior however, Lots of it - and primarily Mozzarella - Which I loved!  The Wings? Quite horrible. I'd pass on them going forward.   Will I eat there again? Being the closest Pizza Place - Yes. Absolutely. But I don't see myself ordering anything outside a Cheese Pizza.   I am wanting to try their Sandwich Options however."}
{"text":"Good service. Actually no, great service. Old school style with manners too! (gasp!)  Great pizza and a decent selection of other menu items like chicken, steak and sandwiches. This is a no fuss, no muss kind of place with reasonable prices, simple (and a bit dated) decor. Kind of place where everyone fits in office worker or contruction worker to student.  It is popular during the week for lunch so make a reservation or get there early."}
{"text":"I can honestly say that I have walked by Paul's Pizza about a million times and for some reason unbeknownst to me, I've never actually stepped foot inside.   I guess it's because from the outside, it's sort of hidden. It's right below the City Place condos in downtown Calgary and it never really seemed super appealing. It's sandwiched between a dry cleaner and some other random store, so I just always walked on by.   Well allow me to tell you personally that looks can be deceiving.   A friend of mine suggested we meet here one day last week.   It's actually a lot bigger than I thought and the service is EXCEPTIONAL. Plus their menu is very impressive. They've got seafood, pasta, pizza, sandwiches, dessert, salads and appetizers.   Their zucchini sticks are to die for and their veggie pizza was some of the best I've ever had!   The prices are reasonable and a lot of regulars frequent this place - me now included :)   Paul's Pizza is mouth-watering good and if you haven't tried it yet, the only one missing out is you."}
{"text":"This is quite possibly the best pizza in Calgary. Deep dish with all fresh ingredients, lots of cheese, lots of toppings and a crisp crust. The service is always very friendly and so is the owner. No wonder this place seems to have a lot of regulars (something I'm becoming). Very reasonable pricing considering the size of the pizzas and the quality you're getting.  A relaxed, casual diner atmosphere, too."}
{"text":"This is my second of four reviews of spaghetti and meatballs that I've tried in the last month or so.  I have walked by this place a lot over the years and have never tried it, until one of my friends suggested we go there.    I tried their French Onion soup for starters, and it was very salty.  Had about two spoonfuls and just left it.  There were three of us that went, so I ordered the spaghetti and they ordered the lasagna.  The meatballs come as an extra order of three meatballs / order.  We split the meatballs one each.  I was surprised that the spaghetti was baked, but it was still OK.  The meatball was a big dry, not a lot of flavor to speak of, but still on the 7/10 side.    We went again and had pizza this time, and this was way better than the previous experience.  The pizza crust was really nice and the pepperoni and meat sauce was very tasty.  If I return, it will definitely be for the pizza, and not the pasta items.  Atmosphere - it's a pizza and bear joint, that's how it's set up, so it's loud, but comfortable.  Funny thing is that everyone reserves or tries for the window booths, and if you go in and try for one, look for the older waitress who has been there the longest, looks like she is the decision maker."}
{"text":"Tried this place out based on Yelp reviews and thought it was great. Ordered a pizza. I remembered a review from someone saying they couldn't order the pizza they wanted but I didn't have issues. I thought the sauce was great. My wife ordered a pasta (spaghetti). She noted that she didn't expect the pasta to be baked and it had rigatoni versus pasta noodles but it tasted great. The service was friendly and attentive. The interior will make you second guess your choice but don't think you'll be disappointed."}
{"text":"I keep hoping... but they'll never return to the days of Denis & Tom"}
{"text":"On occasion, Rob's dad will take us to Paul's Pizza, as it's a friendly, casual & relaxed atmosphere...it actually reminds me of that old TV Show, \"Cheers\".  The service is average speed, but the waitresses aren't too bubbly or chirpy, and they have a great sense of humor. It's like the kind of place where, when you're a regular, they literally know you by name.  They specialize in masculine dishes such as pizza & steak, but my absolute favorite of theirs is the Tortellini. It's magnifico :)"}
{"text":"I first decided to check out Paul's pizza due to it's close proximity to my apartment. But after eating there once I would definitely go out of my way to go back.  It doesn't appear to be much from the outside but once you go in there is just something really comfortable and relaxed about it. There seems to be a lot of regulars who frequent it for a drink or 2 at the bar after work and they all seem very friendly. The waitresses seem to know them all very well.  The service there was EXCEPTIONAL. The waitresses were all very nice without being phoney. I had ordered pizza for takeout but they still brought me water and offered me a seat and a drink while I waited.   Now the pizza itself is amazing!! I am a huge pizza lover and this is definitely the best I have tried in Calgary and several other cities for that mater. The ingredients are all great quality and very fresh. The dough is delicious as well. When my mom came to visit from New Brunswick I took her to Paul's Pizza and she enjoyed it immensely as well.  Might just have to order some tonight! Yummmm"}
