{"text":"Meat is ok. If it's busy and you don't step up you will be over looked. Shinning star is the cashier with braces.  She is very nice and tries to help those of us that dont know the way the regulars navigate ordering lol"}
{"text":"Ah, the \"Disco Butcher\" ... you can not miss the ridiculous flashing lights that beckon you into this place.

This place can be a little overwhelming, especially if you don't speak Portuguese, but they have good selection and incredible prices.  This is not the butcher to go to if you want advice on the best way to cook your meat or to have something cut to your specifications (although I imagine if I spoke Portuguese I might have a different experience here, many of the staff don't seem to speak great english) but it has everything you could need at great prices.  Seems a bit pricier than Il Nosso Talho up the street, but better selection of meats (Il Nosso Talho has much more in the way of grocery though.)"}
{"text":"Great Portuguese butcher the best in the GTA. Clean and great staff. They also have a deli counter  with cold cuts and cheese    .
The prices are great. 
They have great steak cutlet ."}
{"text":"Living in a part of the city where one is tempted to buy one's meats at big chain grocery store out of sheer convenience and all the new niche butcher businesses are terribly up-scale, it is nice to find a regular old neighborhood place to shop for your chops.

I particularly like their mild Italian sausages but everything looks good here. I usually end up here at odd hours during the day weekdays, so I have never experienced a mob scene at the counter. The staff have always been friendly in a old European way (so not too friendly)."}
{"text":"In response to Steven J.... You have to take a number... Like most butcher shops."}
{"text":"Decent butcher shop and a few grocery items to choose from. Oddly enough I actually prefer their in-store location butcher counter at the No Frills in Dufferin Mall. Had some decent pork back ribs for a good price from here last time I stopped in, but also have had some previously uninspiring cuts of meat including one of the toughest pork chops I've ever eaten. 
Prices are average, food is average, and staff isn't very personable. I've come here a few times purely because they have parking (and the neighbouring butcher does not).
3 stars across the board."}
{"text":"You have to take a number? I just flagged someone down, well technically the lady behind counter saw my confused look and desire to order something, made a small head gesture that indicated \"did you need help\" and I gestured back \"hi, can I get some italian sausages\".

This meat shop is pretty cool, they got a lot going on. You can tell the people who come here swear by it cause they aren't just buying some sausages/steak for the grill and leave, they are here to buy plenty of meat for the long haul.

I can't tell whether these prices are better/worse than anywhere else. I can say I doubt they are cheaper than a Chinese grocery store, but they got a really great selection if you know what you want.

They got tons of prepackaged stuff and I like how they put when it was packaged on it, as I found they were packaged a while back and opted for the fresher looking not yet packaged products.

They basically take your meat orders and then put it in a basket for you and leave it by the check-out for you.

I'd come back here for more meat.

Tip: Those sweet italian sausages aren't that sweet,  but they sure are spicy!"}
{"text":"I'm writing this review based on customer service as I never had the chance to actually place an order. Although I have an awesome butcher already I like to support my local businesses. I walked into this place one day looking for some steaks for dinner. I saddled up to the meat counter and patiently waited to be acknowledged, and waited, and waited. Then one after the other people were just walking up and shouting (in Portuguese) orders at the 2 guys behind the counter. After this happening about 4 times I raised my arms in astonishment and said \"is anyone going to serve me, I was here first?\" Even after this no one even noticed me. So I walked out and have never returned. It's too bad because there are times when I can't make it to my regular butcher and hate to buy meat at No Frills."}
