{"text":"Drained and hungry after 12 hours of poker, I came up to the 5th floor for this buffet. I saw the 4.5 star rating in a city like Montreal (the French really do know their food) and I knew I was in for a treat.

This buffet is spectacular. The plates are huge, so you don't have to keep going back for more every few minutes. Everything is delicious - I filled up on smoked salmon, osso buco, and pan-fried calf's liver. I try to get maximum value at buffets, but even I couldn't resist their delectable mashed potatoes (a \"low value\" item). I must have eaten a kilo or two of those potatoes.

Everything else was stellar, as well. The chicken, the mussels, the beef, the shrimp, the desserts - all were at least 4/5 stars.

I would have appreciated a comp after playing all day (apparently, they don't comp for poker), but Pavillon 67's prices are dirt cheap, so whatever. This was a $50-$60 buffet for only $30.

Next time I'm in Montreal I plan to eat at this buffet every day. It's the only buffet I've been to with quality that rivals high-end restaurants."}
{"text":"Food: I don't like buffets, but this one is definitely worth checking out if you are in the area. Definitely a Quality over Quantity brunch buffet but still has great selection of food choices, salty and sweet. Everything was fresh and hot/cold as the way they are supposed to be, there is even a chocolate fountain and crepe station where ur crepe is made to order!

Service: Classy, fast and welcoming

Price: Definitely worth the price!

Ambiance: Upscale, chic but unpretentious. Big windows, chandeliers and neutral colors, way more high-class and trendy than your avg buffet."}
{"text":"I've experienced better at Japanese (Kanda, Sushi Saint-Denis, etc.) and Chinese (Sushi Palace, in Chinatown) buffets, and they're cheaper. Some items at the Pavillon 67 were just horrible (like really dry smoke meat and duck), some were really good (mashed potato). The cooked veggie dishes were bland and lots of repeats (broccoli and peppers). Desserts are the best part. Smoked salmon not really fresh. Good courteous service."}
{"text":"Excellent, buffet is not about quality but this one is.  Service was superb and the ambiance was good too.
I can't wait to go back for a good occasion because with that price you don't go there often.
Check the price before you go but it is worth it 
Bon appétit especially for the dessert"}
{"text":"Excellent buffet.

je m'attendais absolument à rien...mais ce fut une expérience gastronomique hallucinante ! Les desserts valent le déplacement amplement : de la petite verrine à la fondue au chocolat en passant par le succulent mille-feuille.


Surveillez le facebook du Casino de Montréal, ils font souvent des promos :)"}
{"text":"I finally took the time and drove from Laval to the Pavillon 67. No regrets at all. Well let me rephrase that, my boyfriend is allergic to seafood so choosing this place for dinner was not the best idea.  On the bright side we had the option of buffet and a la carte. The food was very good, the seafood options were delish!  I would definitely recommend this place simply because you can choose what you want, and they are actually using quality products. Don't get me wrong I would be definitely make this buffet on top of my list, but i have to be honest and say there are not many endless choices. Normally went I think about going to buffet I think about many choices, and options. Living in America spoiled me !!!  This one however is quite small. Also you must reserve if i recall. I have yet to try the brunch option. We were 4 people and the bill came up to about 130$.  Go try it !v"}
{"text":"Big selection and not only, delicious food. So many choices for deserts, and they're to die for. Love the atmosphere too, casual yet elegant. Loved it"}
{"text":"One of my fave all you can eat places of all times. Located inside the Casino, the atmosphere is great! As for the food, they have the meat bar, salad bar, other food and my fave of them all: the dessert bar. My fave time to come is on sunday for their brunch. Not only do they have the usual food but they also open the counter for brunch stuff such as omelettes, crepes, etc. Make sure you go there with an empty stomach!"}
{"text":"Oui, je sais un autre avis 5 étoiles!
J'ai roulé en sortant de ce buffet, parce que je voulais absolument tout mangé, un vrai délice. On est vraiment loin du buffet FuLam ou de la Casa Corfou.
Des pattes de crâbes, de homard, des crevettes, du boeuf, du magrès de canard, une fontaine de chocolat et j'en passe. Les gens à notre table qui n'avaient pas pris le buffet étaient jaloux de nos assiettes!
Nous étions la pour un fête d'ami, le staff est très courtois et c'est toujous plein de monde!
Tout ce que j'ai mangé était cuit à la perfection et débordait de saveur. C'est 35$ la fin de semaine, mais que de qualité! 
Une excellente solution après avoir perdu 40$ au Blackjack!"}
{"text":"Depuis le temps que je souhaitais aller dans un bon buffet!!! Souhait exaucé!! J'y ait été un mardi soir! 30$ par personne en début de semaine. Bouteille de vin blanc du Québec à 28$. Les entrées offertes et le bar à salade etait excellent!! Des crevettes, une bonne salade cesar, salade de fruit de mer, légumes, salades variées. Je n'ai malheureusement pas vu de homard ou du crabe. Peut être qu'il y en a pas en début de semaine et c'est pour cela que c'est moins cher?? Bref, les plats chaud j'ai été déçu. Il manquait un peu de variété. Au menu: Roti de boeuf , poulet, purée de pommes de terres,  Pommes de terres. Saumon Crevettes.riz. saumon crevettes pâtes et c'est environs ca que je me souviensm  Pâtes (une sorte) à éviter pas de goût et trop cuites. J'ai adoré le saumon et le sauté au crevettes. 

Les déserts aussi étaient bien!! Je vous conseille d'y aller une fois dans votre vie. Ca reste quand même le meilleur buffet à Montréal!!"}
{"text":"J'ai adoré la nourriture franchement excellent, homard, crabe, crevette, pizza, pâte en plus d'une ambiance chic."}
{"text":"I heard great things about this place and have been meaning to try it out for a while. Friends have been raving about the lobster and duck, but unfortunately when I went, they've informed me that they discontinued the lobster! They have yet to update that on their website too.

Overall, the food was mediocre but definitely not to die for. The sauces that we can pour onto our foods have more quality to them than the dish itself.

I would not recommend it unless you want to pay $30-40 on desserts. 

The desserts are fantastic! Probably the highlight of the night. All beautifully presented and so many options! I loved the creme brulee and the sugar pie the most.

The servers were attentive and very professional. However I can't help but notice favoritism in the hostess. If you don't look like the targeted crowd (rich, old, and white), you're going to get hidden tables and away from the entrance. It's quite sad, really. All customers should be treated the same regardless of their appearance."}
{"text":"I went there with my girlfriend while traveling montreal. Restaurant was clean and nice. Price was really cheap in my opinion as we also got special discount by making casino card (which is free). Special promotion price with casino card was 25 CAD for two people. List of menu was a bit dissapointing though as it lacked varieties."}
{"text":"Who likes buffets?
Well this one is in a class by itself!
Well worth the $25.
First off, what a beautiful restaurant!  
Get seated near the windows with an amazing view and more plush seating!
The weekend brunch is absolutely spectacular in size and choice.
I've tried most of the buffets around Montreal and this is the only one that stands out.
The service is old school (polite and classy)
The food is delicious and there is so much to choose from.
You should reserve in advance but it's worth the wait.
It's still a buffet though, so you need to get up to choose your food or order \"a la carte\"

I have been coming here for many years now and have never been disappointed. 
Unlike Fu Lam, Corfu, LaStanza, Vichy, etc..."}
{"text":"Went there once for Sunday brunch and the second time for Saturday brunch. I must say that for a buffet, the food is very good for the price and variety. The Sunday brunch costs more but there's more variety with the breakfast/pastries option. The breakfast station isn't available Mon-Sat. What I really liked was the crêpe station and there's a ton of options to what you prefer for the filling - sweet or savory. I made some sweet ones with berry coulis layered with fresh fruits and cream, the savory was smoked salmon complete with capers, red onions and cream cheese. The view is great and staff are courteous, however the service is much slower on Sundays. It's a trade-off between lower priced, faster service, fewer options on weekdays/Sat or higher priced, slower service, more food options and live music! Mimosas are NOT free for Sunday brunch but all other drinks are (coffee, tea, orange juice, etc). The desserts station is very good with the concept bite sized treats, just enough to taste and enjoy but not too much that you're overloaded or need to waste it. It's a place I'd go with friends or even a more intimate dining experience (it's a bit much for family dinners with kids unless everyone is a bit older). Crowd is definitely older but it's a treat to dress up a bit better for Sunday brunch!"}
{"text":"Meilleur buffet de Montreal, Vendredi et Samedi le homard à volonté à lui seul vaut le détour et l'attente. Grand choix de viandes et d'excellents plats. La sélection de desserts est incroyable s'il vous reste de la place. Nous étions un groupe de 5 personnes et parlions déjà d'y retourner en plein milieu du repas. Excellent service et ambiance. Un 35$ que vous ne regretterez pas si vous avez de l'appetit. Si vous prévoyez prendre des frites des ailes de poulet et de la pizza je recommande fortement un autre choix de restaurant..."}
{"text":"This place has very nice decor, modern and fancy. Some people dressed up and some are business casual. Noise level was average, not too crazy. Service was nice, and considerate. There wasn't much of a food selection. The best was the shrimp for the shrimp cocktail sauce, roast beef, the grilled salmon (only of they are pulled right off the grill hot), creamy seafood soup and definitely the desserts. Some things were too fresh looking from the salad bar. The desserts are the spot light for me. A good quantity of cakes and there's a chocolate fountain. My favorite ones are the coffee custard, amaretti cookies, and raspberry cheesecake. Overall, not really worth the price for the selection and quality of the food. You can really get desserts some place else that is less for the same or better quality."}
{"text":"Bienvenue au casino de Montréal où vous êtes assuré d'être prit en charge par la crème de la crème du service à la clientele.
On se sent tellement bien traité qu'on a envie de dépenser. Tout est mis en place pour vous rendre heureux sans soucis.
Nous avons mangé au buffet ce soir!
Excellente nourriture et service. Il y avait une méga file d'attente et nous avons patienté 20 minutes. La file d'attente est aussi la même que le resto à la crate situé à côté. Ne vous inquiétez pas, ça roule!!!
Et en plus dans un buffet vous vous servez immédiatement donc un 20 minutes de file d'attente n'est pas plus long que l'attente d'être servi. Homard, pince de crabe, saumon fumé, fromages québécois, rôti de boeuf, agneau... Chaudré de fruits  de mer etc etc... Tout était bon. Les desserts correct. Fontaine à chocolat que sincerement, je ne voudrais pas avoir à nettoyer loll... Chocolat partout partout:)
36$ par pers tx et pourb non inclus.
Ça fait une belle sortie. En plus parking gratuit... Rare à Montréal :p"}
{"text":"From my experience Quebec has the best casino in Canada, so I'm writing this based on my experience from two years ago when i went to Montreal with my friends, i thought we might as well go visit casino. We gambled till we felt hungry, most of the restaurants are quite expensive and the buffet has the shortest line. I'm not a big fan of buffet because my expectation in food is higher than average, I would choose quality over quantity.

One of the best buffet I've been in Canada. We got in and then walked around, the selection is amazingly good with lobsters, smoked salmon and other seafood.. So far nothing had disappointed us. 

One thing that blew my mind out, it was the Bûche de Noël / Yule log that they served.
The best dessert in the house, I believed they only serve this seasonal during Christmas! I cannot recall what the top part was but the middle was icecream and the bottom was crispy, the combination creates an interesting texture as well as a taste of heaven for dessert lover! The decoration of the cream with a blueberry gives an extra taste of Christmas."}
{"text":"we went for lunch buffet at pavillion 67 after seeing several good reviews ... and were sorely disappointed.  The salad component of the buffet was very pedestrian with little to recommend it ..lettuce, unripened tomatoes, beans, onions ... very ordinary stuff

the hot selection had pizza, pasta, steamed pork sausages .. none of them tasty.  They did have some nice fish balls .. the mussels were not well cooked .... so in all only one notable hot dish

the carvery had ham (which was good) and chicken (ordinary)

best part was dessert.

Overall a mediocre buffet at a fairly high cost for what little it delivers"}
{"text":"Make sure you've made a reservation before you go. If it shows not available on the website, try to contact the restaurant and they might still have few table left. Otherwise there's gonna be a long queue during meal time. Personally, I feel the price for the weekends is a bit to high.
The seafood was fresh and the sauce was awesome. But the crabs were too soft to break by the tools. 
Most of the desserts were too sweet and don't try the pudding if you don't like the taste of rare eggs.
Highly recommend the seafood chowder!"}
{"text":"This restaurant is really well set up. I opt out of the menu and went for the buffet. The whole place is very class and clean. We were assisted and seated immediately. I've been to numerous buffet throughout the US and currently living in Las Vegas to where buffet restaurants are in casinos as well so my expectations coming in to  pavilion was low. We first checked out the food at the buffet before settling down to sit and we noticed that there are few selections compared to other buffets. When we tried out the food we were stunned because it was very tasteful and the salads were unique and delicious. I loved the salad bar and ate mostly salads and desert. This restaurant value quality over quantity."}
{"text":"J'ai  été là    pour     bruncher  avec  un  groupe  d'amis    Verdict  !!! C'était  super  bon  !!  Il  y a beaucoup de variété  dans le  menus   :   J'y  retourne  c'est  mes  amis   qui  ont  aussi  adorés !!!"}
{"text":"I remember this buffet used to be a lot better before. I use to come here on the weekend for the all you can eat lobster tail but now seems like they took it off the menu. For the past four or five times that I went I never saw lobster there anymore. Instead on the menu it says you can order half a lobster for a certain price. They don't have many choices but the quality of the food is pretty good for a buffet in my opinion. They also used to have really good regular sliced smoke salmon and now they have replaced it with little chopped/cubed salmon mixed with dill instead. The roast beef is always dry every time I eat it and sometimes the grilled salmon is over cooked. The salad bar and dessert selection is not bad."}
{"text":"Nice buffet. Great ambiance, definitely a quality over quantity type of buffet.

I tried everything and it was all great. 

\"I tried everything,\" that's something people rarely ever say at a buffet.

I guess that's a good way to sum up the amount of food offered. Dessert area, random station of egg rolls, meat pies, meat balls, pasta, mussels, salmon (THE BEST). Prime rib/chicken section with a selection of gravy, mashed potatoes and veggies. Shrimp cocktail, smoked salmon, salad bar, soup bar.

That's it and yes I named it all.

Very small, but all high quality. Went for several servings of the salmon and mussels. Shrimp cocktail and smoked salmon had me coming back for more too.

Creme brulee, chocolate fountain and small cakes are a must get!

For $25 for dinner, I guess it's not bad. But I learned fountain drinks weren't included in that price. Bummer.

I really didn't check any other options in the casino because casino=buffet in my head instantly."}
{"text":"It was my first time in a casino restaurant.  I went there for my boyfriend's birthday.  We went there on a Saturday, and we had to wait an hour before we get à seat.  

The food is AMAZING and the waiters were very nice. I have never seen so many quality food. My favorite will be the seafood soup. 

I highly recommend anyone looking to have quality food to go there at least once. Dont forget to book a seat in avance especially during the week-end."}
{"text":"Nice place to bring a date to for a decent priced dinner. Small food area but the decor is quite impressive. This modern upscale casino buffet features half lobsters, carved meats, oven pizza, a salad bar with assortments of cheese, soups and a dessert bar featuring a chocolate fountain. The seafood was so-so and the selections of food were limited. Surprisingly the seafood was not as fresh as I expected. Lobsters were definitely overcooked and rubbery. I do have to admit the dessert bar was the highlight of the night. At the end, our server offered us tea with cream. Only thing is, I was kind of disappointed with the quality especially for such a fancy looking restaurant. Other than that the restaurant was free of children and the wait time was exactly as it was listed on our slip. Clean place with polite and classy service."}
{"text":"Went there for lunch Saturday and disappointed with the tiny selection offered!

$19/person for lunch which I thought was reasonable before going there. Once arrived, noticed that the selection of food for lunch is extremely small. You have a crappy salad bar, choice of only 2 meats (ham and chicken), some mussels, fried fish bites, 1 pasta dish, pizza, and some fries and vegetables.

The taste of the food is edible that's all I can say. I frankly never went to a buffet to eat so little food. I barely ate at all. The only thing that made more sense was the selection of desserts...I can because they can use the leftover for dinner service.

For that price, you are better off going to any other buffet in town for lunch.

Service and decor are decent."}
{"text":"Ate at the casino every day during the Grand Prix and this buffet didn't disappoint. For lunch $25, carved veal/ham, and mussels; for dinner $30, carved prime rib and shrimp. And that chocolate fountain for dessert was awesome!"}
{"text":"What a disappointment. My boyfriend and I came here during our short trip in Montreal. The reviews made us believe that this was some high end buffet. The aroma was nice but their food was horrible. We went during lunch and the choices were more than limited. There literally 3 entrees to choose from and fries or onion rings. Totally not worth the price we paid. My cousin who lives in Montreal did warn us that it wasn't good. It was a terrible way to leave Montreal with not the best tasting food."}
{"text":"Hands down one of the best buffet I have ever been to. The decor is classy and modern. But who cares about that lets talk about the food. They have a salad section with all the fixings, soups, different cheeses like Gouda,brie and Oka. They have crab legs, shrimps. That's just the cold section.

The hot section is where it shines. They have roast beef where u decide the thickness you want cut, half lobster and claws on Fridays and Saturdays. They also have duck and my personal favourite grilled salmon on a bed of Asian noodles, wow! They also have Italian dishes like sausage, pizza, pasta's

Now the deserts! They have panacotta , chocolate mousse, pies, cakes, pastries. Honestly i was blown away! Oh and a chocolate fountain! The price is 30+ for each person, and on Sunday's they have brunch! Check this out you won't be disappointed!"}
{"text":"Great selection, four of us from Oklahoma had a feast. Four bowls of seafood bisque left me with little appetite to enjoy the other selections but I pushed forward and did my best. I highly recommend."}
{"text":"Came here for my dads birthday. When we got there it wasn't very packed. The decor was really nice as well. My dad had been there maybe a year and a half prior and told me what to expect. I was expecting lobster and creme brûlée! When we got there he said the food options were fewer than be remembered. Unfortunately there was no lobster, and no creme brûlée! But the food was still delicious. The roast beef and gravy was AMAZING as well as the potatoes :) only thing is, if you like your crab legs sweet (as they naturally are) you won't be a fan of these. They seemed to of been brined too long and were pretty salty. Could only eat a few. Their dessert choices could be a little better (I'm a self proclaimed dessert aficionado)Overall it was good! Ultimately it is a 3.5 start buffet. With some minor changes could be a 4 star."}
{"text":"I came here on Friday, after searching for a good buffet in the Montreal area. Surprisingly, I would describe Pavillion 67 as quality over quantity. The food and atmosphere is comparable to fine establishements. As with most new things, this modern and glitzy restaurant looks great. There are some big windows, fancy decorations, chandeliers, candles and the overall layout lends to an an appealing and unique look.

For 36$ on the weekend, you will have a gourmet feast of duck, lamb, steak, salmon, lobster claws, crab legs and shrimp which are worth the price. If you come on Wed, Thursday and Sunday, it's 26$ a person, but there are less choices.
The selection of food isn't huge, that's the main reason I'm not rating it five stars. On busy nights, the food stations also get cramped, it's not a very wide space. Plus, beverages are not included, which is is kind of silly since you can get free juice, coffee and soda throughout the casino. I recommend carrying your own drink to the restaurant.

My highlights were the lobster, the salad bar with assortement of cheese, and for dessert - the chocolate fountain, perfect for dipping fresh strawberries. They also have a station for flambeed bananas made to order.

This is a great buffet if you're looking for an upscale style restaurant, free of children and unruly crowds- I would come to the casino just for the food!

Note- They have a rotating menu, so call them on the day of to find out what's available."}
{"text":"This place has a decent buffet. If you are used to the American casino (Vegas) buffets this one falls in  at the upper middle. Mainly on size and selection. The quality is there. 

I wound up asking for a menu... Prices are expensive but the food is good."}
{"text":"OK, I don't do casinos or buffets. It's just not my scene and one of the reasons why I have zero interest in going to Las Vegas. But a friend of mine told me that there was an all-you-can-eat lobster buffet here on Fridays and Saturdays. After reading the reviews here, I decided to go along.
Sitting on the 5th floor of the casino, it's actually a classier looking place than I expected for a buffet restaurant.
The buffet isn't one of those with 2000 items but there is an emphasis on higher quality meats and seafood, salads and cheeses. There's roast beef, roast lamb (with mint jelly!) all carved in front of you. There's shrimp galore, mussels, snow crab legs  and half lobsters, claws, tails, tamale and roe included. Great and fresh salad bar, cheeses, baked potatoes, and all the fixings. Desserts are great too, a chocolate fountain, fresh strawberries, pineapple, profiteroles, Paris-Brest, chocolate mousse, cakes, there's more than enough options here for anyone.
Food-wise, I found the lobster a bit dry but the roast beef au jus here is fantastic. Everything else was fine, nothing memorable but alright.
Service is pretty good too. They clear your tables regularly and they're pretty friendly.
I don't see myself coming here regularly since it's a bit out of the way, but once in a while, it's a good place to know of."}
