{"text":"The sushi is great and on Wednesday he has some rolls that are bogo. They also have a happy hour every day from 4-6 with great drink and food specials."}
{"text":"Where can you go and get expertly prepared spider roll and braised steak tips with attentive service by people who care about your experience and know you by name plus outstanding desserts? PAWS at the Bertram Inn. . Ask for Kelly, Tiffany and Elizabeth."}
{"text":"I recently ate dinner here and a family member had called ahead to find out if they can accommodate gluten free requests.  we were told that was no problem and they have a gluten free menu.  i asked our server at dinner and she told me that they did not have one and there wasn't anything gluten free.  a few minutes later she comes back with one and says she didn't know about it. some items on the supposedly gluten free menu gave me pause, as they did not sound gluten free (asian black beans, couscous).  I asked her and she didn't know, so I asked to speak to someone else.  He assured me they were gluten free.  I asked to speak to the chef because I still had doubts.  He went back and asked for me, and my intuition was correct, the items listed on a gluten free menu were in fact not gluten free.  the chef had no understanding that soy sauce contains gluten or that couscous is made from semolina wheat.  this is really unsafe for people with a gluten sensitivity or celiac disease.  they should not have printed a gluten free menu if they do not even know what gluten is.  to try to remedy the situation, the server didn't charge us for my and my husband's meals.  it was a nice gesture considering the situation, but it doesn't really make up for their ignorance and i would never feel safe to eat there again."}
{"text":"Unbelievable! Valentines Day....No special menu....1 waitress for about 10 tables. I ordered the Roast Beef Aujus sandwich. The sandwich alone was salty enough,but when you dipped it, the sodium levels skyrocketed. Uneatable....I left 3/4 of it along with the weathered shoestring fries. The server took it away and never questioned the remaining food. The salad tasted and looked like it was out of a bag...tasteless dressing. Wife's sliders were bland....   All said,we were very disappointed. Money could've been spent wiser at Wendy's."}
{"text":"We stayed at the Bertram for 4 days. We only ate at Paws twice. The dinner was really good. Fast service and a tasty meal with decent prices.  Breakfast on Saturday morning was entirely different. There was one server for the whole place. It took an hour to get our food. The bacon was burned to a crisp but I didn't dare send it back as I need to have a simple breakfast bit last another hour. The management at Paws needs to get it together during breakfast."}
{"text":"We just had a few items from their smoke house BBQ MENU available Thursday's thru Sunday delivered.  First of all, food was here in 30 minutes!!  That was lovely.   The smoked turkey breast was delicious.   Moist and seasoned to perfection.   The applewood smoked brisket was pretty good.  Not the best I've had but still tasty and worth a try- Bbq sauce was great and improved flavor of brisket.  As far as sides, skip the Mac and cheese and get the loaded mashed potatoes instead.  Five stars for super fast, convenient and tasty dinner that the entire family enjoyed."}
{"text":"The service was great, the bread and salad were fine.  The pizza my wife and I shared was terrible, work pizza was as good."}
{"text":"Dropped in for their happy hour yesterday.  The decor was little bit dark for my taste.  Our assigned waitress disappeared shortly after we were seated, leaving us seated in no man's land.  However, Kristen stepped in, took our orders and provided excellent service.  The food was excellent.  We ordered the Pepperoni Bread - which was delicious and very filling.  I loved the greens, cheeses and sun dried tomatoes on top.  We also had the mini Reuben made with potato pancakes, which was big enough to cut in half and share.  For drinks, we had a stout draft beer and glass of pinot noir.  Three drinks and two appetizers for under $20 (without tax and tip).  All in all, a very nice experience.   We would recommend the Happy Hour and definitely will come back."}
{"text":"I never knew that non local college football teams took precedence over local professional basketball teams.  REALLY???!!! Paws has always been accommodating to our needs including food selection. VERY DISAPPOINTING this time around when we were sitting at the bar since 5:00 and the only patrons there, when 7:30 came around and the Cleveland Cavs came on. Three out of four couples at the bar wanted the Cleveland Cavs on the big screen and other tv's. Paws would NOT accommodate. I ALWAYS thought local professional games took precedence. We will go to Village Martini Bar in Chagrin Falls who not only will put on local professional teams, but ALWAYS appreciates our business!!!!"}
{"text":"Last night there were 4 for dinner.at 630pm the place was empty.one server one bartender.i ordered fish dinner.came with fries arrived cold along with the three potatoes .my fish was tasty but extremely small portion Three peices less then 2inches.cole slaw tasted old and dry  My wife and friend ordered baby back ribs Both found them very nice and tasty Our server never asked if we cared for coffee or desert Basically we assumed we were annoying her."}
{"text":"Very disappointing. We used to eat here often when we lived in the area. We returned tonight after two years. Ordered side salad that never came until after meal was served. Then my turkey sandwich had mold on it. Server took sandwich but never offered an alternative. Then one of the bartenders stopped by table commenting to another guest at table, \"I am not going to stick my finger in your mashed potatoes.\" After paying the bill (minus the sandwich and 20% discount), I had to seek out a manager to express my dismay. This used to be a good eating establishment, but no more."}
{"text":"Came for th Sushi special one night and then for dinner two nights later.  The Sushi special is priced right (buy one roll get one free) and while the choices are limited they provide enough options to choose from.  The wait to get food and drinks was quite long and when the Sushi arrived the rolls were warm. Not exactly how I like my rolls served. The Miso soup, while good, was $5 (!), kinda pricey if you ask me considering this is the middle of nowhere.  Second night the wait was just as long and when the Sashimi arrived the pieces were not entirely cut though on some and rather ragged in appearance on others. Additionally it was $30 and came with nothing, no soup, no salad, nada. Again, kinda pricey for Sushi with nothing considering the area.  On the positive side the drinks were reasonably priced."}
{"text":"I really, really wanted to love this place in a five star kind of way. We went in for breakfast for my birthday and right off, something seemed off. We were the third table in the restaurant, and the other two seemed annoyed and didn't have food.  We kept a positive spirit, and after a few minutes the server showed up with menus, and we ordered. Nothing complicated; omelette with spinach and feta, rye, home fries, then two eggs over medium, bacon, home fries, rye toast.  No big deal right? Wrong.   Omelette came out with extras, mushrooms, onion, green pepper, and bacon. I liked it actually, but my wife wife wasn't so happy about the additions.  Eggs were beyond well done, to the point that you could make deviled eggs from the yolks. You know how an egg smells sulfurous when it get that overdone... yuck. The second try was a little better, but they were still overdone imho.  I don't like negative reviews, and this restaurant in our neighborhood, so I really want them to be successful. Please, management, get on the ball with breakfast. It's not that hard to do well, but so few seem to be able to pull it off.   Nice location and atmosphere, and I'll bet they have a good Bloody Mary, but we weren't asked if we wanted anything but water. Missed opportunity."}
{"text":"The food is below average, very bland. I was at Bertram for a conference for a week so I had opportunity to try their entire lunch menu. Not one thing would I consider \"very good\". I have come once before for Buy-One Get-One sushi and that was decent. However my boyfriend and I came and got a bento box, and again, it was very boring.   The main reason for giving them a below-average rating is because of the service. They are so so very slow! Not just the speed to which things come out, but even getting a glass of water! We also noticed after we got our food during our most recent visit that all the other tables got free bread, except for us. Jipped!!! She took too long to come back for us to complain about it so we just went without."}
{"text":"Dirty!! Tables were sticky, dirty napkins and food all over the chair. Service was terrible would not recommend"}
{"text":"Good local choice for sushi.  Great bar, nice atmosphere, superior sushi chef.  Some interesting menu items like barbequed deep fried crawfish.  (Tell them to go light on the sauce).  You can order the paws roll and nothing else if you like saucy sushi.  Interesting and flavorful.  Overall a great place that we go back to again and again."}
{"text":"Worst service in the area. We went for the happy hour which is published in their website 4-7pm, we got there around 6pm and we're told the happy hour was over at 6pm, so they didn't honor their own online advertisement.   Food was terrible, so loaded in salt it was inedible. I returned the meal and wasn't offered another item or even the menu. The plate was taken away without an apology or any other sign of embarrassment for the client's dissatisfaction.  The wine was oxidized too. Typical oxidation notes of a bottle that has been sitting open for too long.  On top of that, the bill included full price for the meal I couldn't eat and had returned with 3/4 of the contents still seating on the plate.   WORST SERVICE IN THE AREA! There are several other places around where you can better spend your time and money."}
{"text":"We stopped here for lunch.  Sushi and Miso soup are great.  Salads are large, overstuffing the bowls they are served.  Pricey as well.  Desserts are amazing, freshly made pastries.  Service is a bit spotty.  If you go for sushi, you will be happy.  Otherwise, not too special."}
{"text":"Food okay, happy prices good but be forewarned they changed hours and regardless of what website says they won't honor the 7 pm hours.  4 to 6 only."}
{"text":"Very very good French toast with plenty of fresh strawberries and a huge side of finely shredded hash browns.  Service was great and the seating/ambiance was relaxing. If you're staying at theBertram, this is a nice breakfast option, especially if you get a complimentary breakfast buffet with your stay."}
{"text":"Decidedly average food and ambiance. Server was the only saving grace. Seems more like a lobby at a hotel or a mall food court. Food was slightly better than bar food."}
{"text":"The Paws  I give the Paws a 3 stars, the atmosphere is nice and warm.  The service is professional but the food is just OK, put it that way, we have better around town. First of all, there is strange thing happen in the reception area.  A fairy busy night, there is a couple waiting in line to be seated.  I mention we have a reservation; we jump ahead the couples and got seated first.  The couple gives me a funny look. We order the French Onion Soup and BBQ crawfish for opener.  For $7.50, we expect the French Onion soup to be better.  The BBQ crawfish was deep fry with a very thick breading, not much crawfish taste.  There is too much sauce on the dish but the sauce is good and spicy.  We order the Veal Marsala and the Rainbow Trout for dinner.  The veal is overcook and not much sauce come with the dish.  On the other hand, the angle hair is very tasty.  The rainbow trout portion is big and very well balance stuffing with crab and cornbread."}
{"text":"I'm giving Paws 4 stars specifically for my favorite time to go there...when Wednesday BOGO sushi night and Happy Hour collide!  Every Wednesday after 5 Paws has buy one get one free sushi rolls fresh made by their sushi chef.  I think it's about $8 for 2 orders of 6 rolls.  In addition they have happy hour every night from 4-6 with drink specials and half off appetizers.  If you can hit it at the right time, you can get a great deal on a bunch of great food!  The perfect spot for grabbing dinner with friends!"}
{"text":"I was not very impressed with the place.  One local beer on tap.  I had the pulled pork po boy.  The meat was good but the bun was very chewy.  I'm going to guess that it was warmed up in the microwave.  Not sure.  My wife had a Manhatten.  It kicked her butt. Very strong."}
{"text":"My relationship with Paws could easily be compared to that of someone who is just getting back into the dating scene & comes to the realization that being alone with their thoughts is ten times more entertaining than their date. You know that awful feeling of guilt when you meet someone really nice but they're just...uninteresting . Yet you continue to tell yourself \"Maybe they just haven't come out of their shell yet\" & one date turns into 5 boring dates- yep, that sums up Paws.   The menu has been the same for years so my husband was excited to force me to eat here on Thurs since they finally added some new items... maybe instead of changing up the menu they need a new chef. The food & service was terrible!!! I wanted to trip our waitress, she was abrupt, rude, rushed, unavailable and disorganized. Our waitress forgot the drink menu, wine lists, never asked if we needed condiments, never took my drink order, forgot my brother -in- laws drink and never asked if we wanted desert. I realize she was busy training another server but seriously- she made everyone at the table angry.     I've had their truffle fries & pumpkin cheesecake in the past...the fries are mediocre at best & the cheesecake was flavorless. This time I ordered their Roast Broccoli and Cauliflower but they were out of this so I had to settle for the Garlicky Loaded House Cut Fries (without the egg); there was no garlic flavoring at all, my fries were luke warm if even that and I didn't taste the smoked gouda at all. The only delicious part of this meal was my one role I got to eat. I really hate this place!!!    The only good service we received was from the men, one whom refilled our water & the other who brought out our food. Wish the tip money would've gone to them instead of our waitress. I've also eaten at Leapord for my anniversary and there was not one thing on their menu I'd eat so they were kind enough to make me Alfredo but again, it was flavorless. I probably would've been more satisfied had they thrown a bag of frozen fries in the dryer to cook - just say'in."}
{"text":"First timers on Valentine's Day. We were doing Happy Hour so we sat at the bar, from 4-6. On Wednesdays sushi is B1G1F beginning at 5. The dining room with bar is very nice, and very relaxed.  Mostly an older crowd, tho all ages were represented.  The beers on tap were $2. Other beverages were discounted, too.  The menu was extensive. We had two large size sushi rolls and the braised ribs app. Plenty of food for two. Good decision. I gave minus one star for the barmaids that seemed unorganized. They ran around trying to keep up with patrons between stocking, doing carry outs, taking orders, making drinks....not relaxed at all.  No small talk or suggestions.  I still recommend."}
{"text":"Went for Sushi on a Saturday Night.  Sat at the Sushi Bar.  Food & atmosphere were great!"}
{"text":"Always sit at the bar and Michelle is a phenomenal bartender.  Sweet and personal, perfect experience for a low or high key night.  Liquor pours are more than generous with an extensive martini & wine list.  Usually get sushi, but have ordered some appetizers during their happy hour.  Tonight, ordered the Poki (very tender ahi tuna in soy sauce with onions and scallions).  Delious!  Crabmeat with asparagus salad.  Very good with generous portion of crabmeat. Went to sandwhich for dinner.  Gourmet Grilled Cheese With Broccoli, sounds weird, but great sandwhich if you love broccoli with cheese.  Sashimi sushi is always fresh and great cuts of fish.  Highly recommend for locals.  Overall, always a great experience between bar and sushi bar.  Check out Wednesdays buy 1 get one sushi roll and happy hour 7 Days a week. Cheers"}
