{"text":"Not very much here. I only come for the food. 

Venders: 2/5 A miss match of shops. Not much.
Busyness: 4/5 Quite empty.
Environment: 3/5 Old and getting run down. Dusty.
Parking: 2/5 Hard to find parking at dinner time.
Washroom: 2/5 Not good."}
{"text":"It's an interesting mall as the plaza is part ghetto and with some hipsterique stores such as Woofles.   The stores are all mom and pop stores.   It's a small plaza but the outside is primarily restaurants with plenty of good eats and options.   

The parking is horrendous.   It is usually full........ Of bad Asian drivers.   I can say that as I am also Asian and sometimes fall into that category.   


I love checking out the large array of gardening  and flowers outside and getting some woofles when I'm craving some matcha ice cream!   Just be careful of bad drivers, especially at all the entrance and exit points."}
{"text":"And on a good day, you'll see hardworking waitresses on their well-deserved break haha"}
{"text":"I had NO IDEA this was called Peachtree Center even though I've been coming here for a decade and a half. THANK GOD FOR YELPERS AND YELP. Yea, we always called in mong gok because that's what it's called in Chinese. I actually just went not too long ago, and they changed the sign to \"New Kennedy Square\", although I still see Peachtree Mall on one of the signs.

A couple stores have changed since this plaza has opened, but there have been shops that have been here for decades, like the store that sells popcorn and cotton candy. Or the store that sells sugar cane drinks. More food court booths have opened here, though the one that is directly in the middle of the food court always seems to close, probably because feng shui isnt as great in the spot, no idea tbh. 

The not so dollar, dollar store is here selling any item you can think of. There are fewer bootleg dvd shops as before. I remember bootleg dvds were like $20 for 3 or $10 for 3 when they were popular in the day. 

Parking can be difficult during peak times such as Saturday for dinner, but you shouldn't need to wait long for a spot."}
