{"text":"Each time I get takeout here it is slightly different, even though I might be getting the same thing. Consistency isn't their strong suit, so I wouldn't give up on this place if you happen to catch them on an off day. This place is a hole-in-the-wall takeout joint brought to you by the same people who ran Cuisine of India. One good thing is they give you your food in paper bags and paper based trays which is much better than styrofoam.Their menu is somewhat limited,so that loses them one star,but otherwise I have to say \"yay! Butter chicken!\""}
{"text":"After eating here several times, actually several days in a row, Peacock Express has become my new fav Indian takeout/resto.. They are not that big in size but they do have comfy seating and enough area if you want to dine in. I have to say that everything I tried there is really good, I mean the kind of good that makes you want to come back again the next day, which is exactly what I did.  One of my favourite dishes is the Butter Chicken that you can get with naan or rice (the naan is amazing btw, you can eat that stuff by itself). The Butter Chicken is tender and moist, the sauce is just the right amount of creamy and spices, hence my 4 day in a row visit. Another dish that is worth mentioning is their paneer, which is a combination of rich sauce with peas and some kind of cheese, much like a thicker ricotta. When you order it freshly made, the peas just go pop in your mouth. They sometimes use spinach instead of peas. I definitely will keep this place on my list of regular restos to frequent."}
{"text":"The price and portion size at Peacock Express are okay, but I found the curry sooo greasy. I ordered lamb vindaloo and channa curry, and they both came with piles of oil floating on top. The lamb cuts were also really small fatty chunks filled with tendon or gristle or something.  The curries were flavoured nicely, but I felt gross for days after eating it.  For a small take-out hole in the wall, the decor of the place is actually quite nice. It's simple and clean, so you could actually perch yourself on a stool and eat in the restaurant."}
{"text":"I've been doing a co-op at Yonge & Finch, and my lunch desires have been sated by the Select Sandwich downstairs or the Korean cart outside the Shoppers'.    Yesterday, though, the weather was nice so I decided to stroll up the street and see what I could find.  And Peacock Express was there with arms wide open.  I had the chicken vindaloo thali plate, which was very, very tasty.  Three veggie curries, some chicken vindaloo, raita, and rice served with a piece of piping hot naan and a papadum.  Each of the curries were delicious in their own way, and the vindaloo was flavourful but not hot.    The owner/hostess is a delightfully friendly woman, taking time to help customers with placing their orders and recognizing regulars as they come in. There are seats around the front area, but it's very cozy and you can definitely get your food to go."}
{"text":"This is a one lady operation. Its a little slow but the food is good. There are a few seats at the sit down bench but in all practical purposes it is a takeout place. They often run out for the night on certain dishes. Otherwise, the service is nice, the food is good, and the prices are normal. Best indian place in the immediate neighbourhood."}
{"text":"The woman behind the counter is super nice and the smell in there is amazing. She gave me a takeout menu and said I can call ahead then come to pick up the food."}
{"text":"The Butter Chicken and Naan combo costs $7, but the portion is quite small. The lady herself told me that it's a \"snack size\". So from a price stand point, it's quite pricey. With $7, you'll get a small soup styrofoam cup of Butter Chicken and 1 piece of Naan. If you have a big appetite, that won't satisfy your hunger.  Now on to the actual dish. It's actually pretty good. I'm not a fan of Indian cuisine because I can't stand the curry smell (sorry!), but the sour-ish creamy taste of this Butter Chicken agreed with my palate. The chicken was not as juicy as I would like it to be, but the Naan was yummy. The dish was made freshly after I placed my order. A thumbs up in my book. The lady was very friendly as well. This place would get a 4-star rating if it wasn't for the price-to-portion ratio."}
