{"text":"Really creative and interesting food. If you have a sweet tooth this place probably has something you haven't had before. The candied apple sushi is unique and really good (rolled up white bread with caramel, apple butter and apple pieces )! 

Service was lightning quick and owners who run the place and are very friendly. They made sure everybody who came through enjoyed their meals and even helped me get some water for my dog waiting patiently outside."}
{"text":"Love the idea! You feel like a kid again, with the boxed juices and milks. Love it!! I got the strawnana \"sushi\" roll. Yum!"}
{"text":"Great little place. Simple but cheap meal out. Yes you can make a pb and j at home but here they will do all sorts of cool things with it. It's about 4 dollars a meal so if you want a cheap treat it's fun.  Excellent for parent child dates. 

Only complaints -
It was hot in there. Warmer than outside.  I also prefer a higher quality jelly/jam.  But it was still good"}
{"text":"Visiting friends in Pittsburgh we tried Peanut Butter Jelly Time for the first time! The store is adorable from the outside and inside you are warming greeted by the ladies behind the counter. The menu contains everything from a \"classic\" sammich to more elaborate ones mixing all types of flavors and sauces. 

I got the Strawnana sushi roll (PB and strawberry jelly with banana slices on top) which was served with a strawberry and vanilla flavored sauce drizzled over it. My son got a Belgian waffle with PBJ and chocolate sauce.

Delicious! The portions of sushi aren't enough to have one and be full for an adult but its a great snack to tide you over between meals! I'd highly recommend this little place if you want to try something new or want to take the kids out somewhere fun!"}
{"text":"First visit...AMAZING! so fun and so friendly. Got pretzel roll and cheesecake factor. Delicious and great prices! Great advice when helping to decide what to get, staff even took our garbage away! We'll definitely be going back!"}
{"text":"Meh. I was less than impressed by my meal here. It's a cute concept but I'm not sure it's going to make it. I got a bagel, my friend got a BLT, we both got drinks. Somehow it was $17. My bagel was clearly the kind of cheap bagel you could buy in the frozen section of the grocery store, it was less than special. Everything felt sticky (presumably from jelly), however it left a not so great feeling on my hands and seat. Not thrilled by that. I think it's worth checking out but I don't think I'll go back, there are too many good restaurants in the area to eat like a 4 year old."}
{"text":"What a great concept! Loved everything we ordered (Stranana, Cookie Dough Delight, and the Buttercup Buttercup, and Parent Trap). Love that you can also build your own. The owners were awesome, both of them were super friendly and personable. Cheap and a new experience, will definitely return."}
{"text":"Ordered from here with some coworkers for lunch.  We split the \"Brown Bag Lunch\" where you get to pick 6 sandwiches from the \"classic PB&J\" menu for $11.99.  This was a really great, affordable way to try a lot of different sandwiches.  Some we loved (Apple Jack, Grahama's Fav), others were just okay (elvis, black & gold), but we collectively didn't care for the cookie dough delight.  Overall, fun experience.  A few people ordered the BLT, and it was a really small, wimpy sandwich for the price.  For $6.99, you would get a huge BLT at other sandwich shops. So, I'd stick to the PB&J if you order from here."}
{"text":"I went here right after it opened and thought it was adorable.  It's very inexpensive for basic things, or you can ramp it up and get fancier \"sushi\" rolls, wraps, flatbreads, etc.  You may want to get two things if you're there for lunch, because the portions are more snack-size (or maybe my appetite was just bigger than usual).  I recommend the pretzel roll.  It comes with chopsticks and is very fun to eat.  It's just a quirky little place that's fun to visit with friends or family, and the food is cute and good."}
{"text":"I thought how can a place be centered around PB&Js? So I tried it tonight and I was pleasantly amused and satisfied by everything! The feel of the shop gets you ready to be adventurous and try something fun off the creative menu they have. The large window to the street, colorful awning framing the window and 50s music playing is an added bonus. My table had a classic PB&J, a peaches n cream sushi roll, ants on a raft snack, The Apple Jack sandwich and dessert, the Waffle Sundae. Everything was so delicious! The Apple Jack was a nice combination of cinnamon bread, thin slices of Apple, and Apple butter. Yum! Sides include choices of animal crackers, nilla wafers or chips. The sushi roll is soft white bread rolled up and served with chopsticks and a fortune cookie, so fun and delicious. Each table is also supplied with three kinds of dish decorating jam, very fun! Very affordable! 9 items at our table and our bill was $21. We were all full and had a few leftovers. If you're in the mood for a kitschy but well done kitschy place with actual good tasting food, and that you would return too, then you should definitely try this place out!"}
{"text":"Has adulthood ever gotten you down and left you wishing you could return to your carefree youth?  Well, they still haven't figured out time travel to make this a reality.  But the people at Peanut Butter Jelly Time have turned two childhood classics., PB&J and grilled cheese, into a restaurant which is the next best thing.

I went there for an early-ish lunch on a Tuesday around 11:30.  The menu before held a wonderful bounty of options to choose from.  I was tempted by both the Elvis (PB&J with bananas) or the cheesecake PB&J, but I had to stick close to the original - a PB&J with a waffle instead of the bread.  I also got the vanilla wafers as my side and a milk box to drink in order to complete my childhood nostalgia.  Totally worth it and the best lunch I had that week. 

They still seem to get a decent amount of traffic that comes in just to look at the menu, which is odd for a restaurant.  The person who took my order first asked if I wanted to order something or was just checking the place out.  They did that for everybody who walked in and took a look at menu, so it wasn't just me.  Hopefully, this will go away as they realize that people probably want to get food from them when they walk in.  If they were just curious about the menu, they would have simply read the menu posted in the window.

Despite this one very minor annoyance that left me scratching my head in curiosity at what one might term \"window-shopping eaters.\"  This place is great.  Next time pretending like I'm a fully-functioning adult has me down I know where I'll be escaping for a break."}
{"text":"This place knows exactly what it is and sells it which is why they get 5 stars. We went on a Saturday evening (they close at 8) and I would recommend this place more for lunch. They have a very big menu with almost every kind of peanut butter and jelly sandwich you could think of. Also they gave grilled cheese so other menu items if you are. It into PB & J. The sandwiches range in price from 2-6$ which really is not bad for all the items you can get on the sandwich plus they all come with a choice of a size including bag of chips, animal crackers or vanilla wafers. I went with the peanut butter and Nutella sandwich pretty basic and very tasty. I also got the funky monkey which came with crunchy peanut butter, crushed up pretzels and chips with sliced bananas. It was amazing! We had a $25 gift card to spend which was actually hard so I also got a yogurt parfait which had granola and lots of fresh fruit. For dessert we got dirt- have not had that since I was a kid with gummy worms and all. I would love to go back for lunch as the are so many other sandwiches I want to try. The staff were helpful and friendly and the place is very cute inside. It would be a great place to take kids."}
{"text":"We were drawn by the theme and the name linked to a song we both really like. Not exactly the most stellar experience, though. Yes, plenty of over-priced options. Staff was bored and showed it. The food was tasty, but I have made better in my own kitchen. I'll keep doing that."}
{"text":"My family and I happened upon PB,JT while killing time and what a treat it was! We enjoyed our entire experience!

First, we were able to find parking easily on a Saturday afternoon, right near the spot. Second, we were greeted by a staff member with a big genuine smile, and helpful suggestions. Third and finally, the treats we ordered were all delicious and presented beautifully!

Here's a run down of what we had:

Chunky Monkey: This particular sandwich is a hodge podge of ingredients that include potato chips, it all went together to create a delicious creation. 

Princess Delight: PB&J on one side and marshmallow fluff and sprinkles on the other...yum!

Pretzel Roll: This was my personal fav. PB and apple butter rolled up and served like sushi with caramel and crushed pretzels on top. 

Grilled Cheese: We chose the original for my picky eater, just in case he didn't like any of the fancy creations. It wasn't bad, but it definitely want as yummy and exciting as the other sandwiches we chose.

All in all this is a great spot for a treat, but I wouldn't pick it for a full lunch. Can't wait to go back again soon."}
{"text":"This place was so cute!! i'm never in the area but i was doing some shopping with a friend and wanted a snack. there's tons of choices, and it was delicious!! the staff was very friendly and the restaurant was clean. definitely will be stopping back soon!!!"}
{"text":"Super cute little spot. I always get fast and friendly service. The PB&J sushi is just too cute and also delicious. They even give you chopsticks! I haven't had anything from here that I didn't like, but it's also hard to jack up such a classic!"}
{"text":"This place is so cute and the workers were very friendly and helpful since it was my first time!  The pbjs are made to look like a school lunch.  I got a side of nilla wafers and a chocolate milk (in a small carton!).  I love the wide variety of pb sandwich options, or you can build your own.  Can't wait to try another flavor!"}
{"text":"My friend and I went to check it out and I was very disappointed. The restaurant is very small space. They were running behind and we waited for our food for 20 mins. Obviously short on staff there were 2 girls making the food and the man that was a cashier and also talking to customers a lot. It was annoying waiting for so long mean while there were 2 couples Infront of us waiting for their food too. It felt unprofessional. But I will give a 3rd star for the food. It was good. But I expected more of the portion. The prices do speak for the portion. I won't go back to sit down and wait for my food but if I would go back I would recommend take out."}
{"text":"How can one go wrong with multiple takes on the classic pb and j??!? The atmosphere was friendly and always happy to support a family business.  Especially liked the milk cartons in addition to the specialty pb and j.  My husband got the sushi style roll, unfortunately it wasn't bad but neither of us were a fan because we enjoyed my toasted sammy much better.  Some ppl may enjoy the whimsical style of serving the \"sushi\".  YUmm, just thinking of the sandwich makes me want to go back!"}
{"text":"This is the perfect place to have an old fashioned bag lunch or one with a twist. The toddler ordered a Fluffler Nutter and chose animal crackers as his side with a box of chocolate milk. I had the peaches and cream roll, AMAZING, with a fortune cookie and a white milk. Seating is the right amount since it's a quick lunch or dinner spot. Loved it!"}
{"text":"The concept is good but I think I was hoping for something a little more interesting to match the great new Pittsburgh restaurant scene.  For example the dippin sticks are just a bad bagel toasted with travel size packages of cream cheese, jelly and peanut butter.  Would be cool if they worked with local bakeries, had really unique sandwiches, fun drinks etc.  As-is it's borderline airplane food."}
{"text":"Remember the days when you ate your soggy pb&j and enviously watched your bestie eat a lunchable?

It's time to adopt fresh memories. You are now 6 years old- you live for power rangers and ninja turtles and pb&j. Your \"mom\" is pb&jelly time, and she says you can have anything on your sandwich. Nutella? Yes. Biscoff? Uh huh. MARSHMALLOW FLUFF? Hell yeah! 

Now wash it down. Get a milk carton or gov'ment juice or splurge on a milkshake or a float. 

Your childhood wasn't good enough the first time- make new memories at Pb&jelly time, ya big kid."}
{"text":"Peanut Butter Jelly Time was an interesting place. How can you go wrong with peanut butter and jelly??!! So many different choices to choose from and some very creative options. 
My husband and I split 4 different sandwiches, wanted to try a variety. My favorite was the peanut butter and jelly waffle. Very good! 
Overall their sandwiches are good but not sure how often I'd eat there. It's a pretty basic concept and not exactly the most healthiest of options. But I do recommend at least trying Peanut Butter Jelly Time at least once."}
{"text":"15 stars. I've wanted this concept to become a reality my entire life, and now it has -- right next door to me. Makes me think I've done some really right things in life to be so lucky.

I've been a PB freak since birth and have messed around with it in more ways than I can appropriately disclose.

The owners, bro and sis, are the sweetest, and super-driven entrepreneurs. They have serious care and soul into the place.

I went twice in 24 hours. Ready to restart that streak now that I am back in town. I hope everyone that comes across this place or this page will go, minimally for my selfish reason of: I need them to stay open forever for *me*.

Oh, and I've eaten a bunch of \"sushi rolls\" and a modified Elvis so far. They're killin' it.

Yum!"}
{"text":"If you're feeling nostalgic and hankering for a packed grade school lunch cranked up to a more grown up palette, this is your place.

I was already in the neighborhood when I saw the storefront and decided to give this place a go. Who doesn't love a PBJ restaurant concept?

The patient, friendly lady at the counter said they've been open for about nine months.

I ordered the Elvis sandwich, complete with peanut butter, banana, honey and bacon, of course. I added on a side of iced animal crackers and a carton (yes, a cafeteria kiddo paper carton!) of chocolate milk. Takeout was appropriately placed in a brown paper bag.

For roughly $6, it's a decent, tasty lunch. The sandwich was good, although I would've preferred the bread to be grilled vs. toasted.

My biggest caveat? Mostly I was annoyed with the awkward menu placement. Perhaps because it's a small space, but the menu in its entirety is on a side wall. Not only that, but the menu is huge and goes into extraneous detail with the sandwich options. It was an odd interaction to come through the door and stare at the wall on the side and get kind of overwhelmed, since there were easily 30 sandwiches to choose from. I think it could be an easy fix by just shortening the descriptions down to the ingredients.

I'll definitely be back. I think some of the sweeter sandwich options on the menu would be great for drunken munchies or a late night snack."}
{"text":"When Peanut Butter Jelly Time went in, I was totally stoked.  I love peanut butter and jelly. There is a place just like this in New York City, but the prices are triple so I have never gone. This place is serving some awesome options for your PB&J cravings.

Upon entering I was greeted by the owner. She and her brother run the business together.  Hooray!  They have a family friend who makes the peanut butter and homemade dog treats.  There are tons of flavors of jelly and a variety of toppings. You can get PB&J sushi, Build-Your-Own, Gourmet sandwiches, Grilled cheese, and Cereal.  Nothing here is terribly complicated, which is nice when life is stressful. 

I tested out the Apple Jack Sandwich ($3.25) and Blueberry Yum Yum Roll ($3.75).  My favorite was the roll, which was crunchy peanut butter and blueberry jelly, topped with blueberries and vanilla drizzle. The blueberry jelly was awesome.  This combination was delicious and just the right amount of sweet. The Apple Jack was good too. It was smooth peanut butter, Apple butter, and apple slices on Cinnabon bread. I couldn't really taste the Apple butter, but I liked this sandwich too. It tastes like fall.

I will definitely stop back in on my next trip through Bloomfield. To be honest, I do not know how sustainable the store is since the prices are so low, and rent must be fairly high.  I hope they manage to hang in there!!  I also would love it if they sold their jelly as well.

Credit accepted."}
{"text":"I stopped by PB&J Time last Sat. at noon with a friend.  Given that my friend is a Chinese international student, it struck me as a great way to introduce her to the American cultural phenomenon of PB&J while simultaneously satisfying my curiosity about this shop's take on it.  We originally planned to stop by a couple of weeks ago but ended up rescheduling our outing for MLK day when the shop was closed due to it being Monday.

Given that we stopped by for lunch, we each decided to order a sandwich and split an order of PB&J \"sushi.\"  I ordered the PB&J calzone ($5.75), which I customized with crunchy peanut butter, four berry jam, and blueberries, strawberries, and raspberries.  My friend ordered the PB Waffle Time ($5.25), which substitutes waffles for the bread of a normal PB&J.  Both of us opted for animal crackers as our side that comes with the sandwich.  We both enjoyed our sandwiches, though we found them a bit sticky due to the jam.  For our \"sushi\" roll, we decided on the monster choco roll ($4.99), which consists of chocolate spread and creamy peanut butter topped with chocolate syrup and chocolate chips.  My friend found it a bit sweet for her liking, but I enjoyed it very much--as expected, it tasted similar to a peanut butter cup.

The atmosphere of this shop is definitely nostalgic in terms of the decor and music, though the high top tables seem like a bit of an odd choice.  The clientele consisted of a somewhat eclectic mixture of families with young children and other childless millennials.  The owner and employees were super friendly from the time that they welcomed us to the shop to the time that they cleared our dishes.  We enjoyed our experience, and I will for sure be back soon.  If you're looking for something a bit different, it's worth checking out, for sure!  4.5 stars."}
{"text":"This place takes a simple PBJ and comes up with so many variations of it that it becomes a legitimate dessert. I would probably hesitate to call this a sandwich place; yes PBJs are sandwiches and you get tons of bread options to choose from, but almost all items (except for the grilled cheeses) on their menu are sweet, accompanied by various jams, fruits, or ice creams. As a kid a PBJ may have been a good enough \"meal,\" but I pretty much had to make do with the BLT meal to actually get something substantial in. That said, the sandwich was pretty good, and I did like being able to get my sandwich with cinnabon bread. The overall concept is great and falls somewhere in the honey toast / Belgian waffle category. I see how being able to customize your own sandwich can be pretty fun, and the \"sushi roll\" presentation of these sandwiches is cute (though really you're just paying more for the same food, sans crust). But I do think that this is a nice alternative to just ice cream or fro-yo for desserts."}
{"text":"Great atmosphere. We went here more for the kids than my wife and I. We got a bunch of different items. They were all good but nothing over the top. 
I got the peanut butter jelly rolls, they were awesome! Service was great too. The manager or owner really cared about the business and checked up on us. It's nice to see. I would recommend it. It was fun!"}
{"text":"So many options! I tried the strawnanna and red raz roll both were delicious not sure which I liked more. Prices are good and atmosphere is friendly, it's worth a try for a unique experience."}
{"text":"This little joint might be small on the inside, but ENORMOUS on fun, smiles, and nostalgia!!!  Oh my god, every amazing memory you have growing up with mom making you sandwiches or eating at the school cafeteria is here and more. They have milkshakes, grilled cheeses and other items besides just pb&j's.  Do yourself a favor, order some sushi it's spectacular.  Don't worry, it's not fish... Just bread peanut butter and assorted garnishments.  Prices are super cheap, feed the whole fam for practically nothing!!  After you leave, all you'll be thinking about is when to go back... And why the hell didn't mom make me pb&j sushi?"}
{"text":"Let's take it back a little ways...its 1990, and we're having lunch in my grandmothers kitchen. What's on the menu? Fluffernutter. Grandmas specialty. Or, so young me thought. So, needless to say, peanut butter and marshmallow sandwiches were my childhood. It's been quite some time since I've had one; until the gang and I stopped at Peanut Butter Jelly Time on the first cold Sunday in December. 

We were immediately greeted with giant smiles and hellos from the staff. I mean, who wouldn't smile all the time if you got to play with peanut butter and jelly all day long? 

Josh got almost everything on the menu. Sushi, sandwiches, animal crackers...the kids wound up with Mom's Classic, just your (not so) standard PB&J, and I ordered the Fluff-a-Nut. Oh, mylanta. It took me right back to my bad perm, grandmas shoulder pads, and all the goodness that comes with the 90's. 

This concept is awesome. I love the ideas and creativity that went into the menu. It's witty and they literally have anything you'd want on a pb&j. 

The only drawback I had was the seating. The gang runs four deep, and they really only have low tables for two. But hey! It's all good when you push the tables together!! 

I look forward to coming back here again. And again. And maybe getting two sandwiches next time. 

Happy Eating!"}
{"text":"Thank God I live a block away from this place. They have .99 cent sandwiches in addition to all of their other items. You can also order to-go. This is going to be a great place to grab an inexpensive bagged lunch in a hurry. I can also see this as being  place to purchase food in bulk for meetings, events, or to feed volunteers. Move over box of donuts, I'm bringing PBJs to the office. 

I went in for the first time today and was served by the owner who was very nice. She told me that the peanut butter and jelly were both home made at a local space. That's awesome! I feel like this place will be around for a while. I only tried the PBJ so I can't comment on the other items but there were, indeed, a ton of other items."}
{"text":"Food was wonderful.  Counter service very friendly!  Highly recommend the Belgian waffle PB & J and the Give me Smore!"}
{"text":"Disappointed at the fact that they didn't have chips or ice cream for milkshakes. It's a hot day you would think you wouldn't run out of ice cream. Also didn't understand why there was a $8 minimum on credit cards when that's never happened before to me"}
{"text":"\"So cute!\" That was my first impression of PB & J Time, and I'm not even really a big peanut butter fan! It has this vibe...some people have said 50's or whatever, but I really think it's just authenticity. They people there, the products they use, the way they greet everyone who comes through the door...it's just genuine. 
We got the brown bag special (5 classic sandwiches for $11.99), a great deal and a really neat way to get and tray a bunch of different PB&Js. Of the 4 of us, we all pretty much had a favorite; mine was a tie for the Apple Jack- PB with think apple slices and honey I believe- or the Cookie delight. I think the BF's was the Elvis- PB and banana of course. We also tired one of the sushi, but I can't remember which one. It was good too, and there are a bunch of others I can't wait to try. They also have grilled cheese and a cereal bar. You really can't beat the prices either. most of the classic sandwiches are $3.50 or below and they are really neat combinations. A regular PB&J is like a buck! They also have white, chocolate and strawberry milk which I thought was a nice touch. Ice cream and floats kind of round out the menu. Of the group, we had both and both were great. 
Some people complain in the other reviews about store bought white bread or bagels, but I liked it. I hate when restaurants throw weird, fancy ingredients into a dish for 'wow' factor. It's a peanut butter and jelly joint, not a five star hotel restaurant. And honestly, if they tried using some fancy artisan bread, not only would it ruin the whole vibe, but a PB&J would cost like 7 bucks and then people would complain about that, so...go figure."}
{"text":"I had a lot of expectations for this place, but I have made more gourmet pb&j in my own kitchen. There is really nothing apecial about this place. I had a sandwich and then went to get some real food else where"}
{"text":"Fun times with super creative sandwiches. Something for everybody on this most creative and fun-delicious idea!"}
{"text":"I love that this place exists! It's such a simple concept and perfect for an outing with kids. Or when you just want a simple sandwich!

I took my 9-year old niece and my 2-year old. They loved it. My son basically only eats peanut butter and bread so it was nice to have someone else make it for a change. My niece ordered a simple pbj with a side of the dippers. It was toasted bagel in strips that she could dip in peanut butter, jelly, and cream cheese packets. She thought it was the coolest thing! I had the Elvis, which was peanut butter, bananas and drizzled honey (I chose not to add the bacon and kind of regret it). It was delicious! The menu was actually so large that I had a hard time choosing! Who would have thought you could be so creative with peanut butter and jelly! There were also some grilled cheese options and desserts! We will definitely be back to try something else!

The decor was so cute and clean! There were a few tables inside and out. And parking was easy to find on the street when we went. 

The only thing I didn't like is actually really small and seemingly insignificant but my son had a really hard time with the straws. They're made of paper, cut, but it kept melting as he drank his milk. He kept saying that the whole meal and it really distracted him from eating his lunch. Next time I'll bring his sippy cup and pour the milk in."}
{"text":"Tasty sandwiches, nice selection, good value, good service, liked the Elvis and the Red Raz Roll."}
{"text":"It's cute for an after school snack! The only thing was the tables are very small & this resulted in all 3 of the children I took there spilled their food... At different times:(  Its tight for 2 plates let alone 3... Live and learn."}
{"text":"Not your average PB & J...
Another fun little restaurant within walking distance from my house.
I adore a Biscof with Fluff and berries. Super yummy and filling. There are so many choices and they are very accommodating with making sandwiches to the liking of customers."}
{"text":"I'm so obsessed! Such a simple concept, but so wonderful! I fully realize I could make these sandwiches at home, but seriously, who wants to fuss when you can get a warm toasted PB&J. 

But this isn't just PB&J. The menu is massive with every combo imaginable. You can get chocolate, nutella, fluff, banana's, cookie butter (YAS) and more. Plus, they have a cute \"sushi roll\" section where they roll the bread and cut it like sushi. Cute for kids (and adults of course).

I've had a couple of the sandwiches and of course I like all the dessert type ones. Just add fluff and I'm all set. The cookie butter sandwich with raison toast is beyond incredible. They also give you animal cookies or chips with your meal. You can't beat a $5 or below lunch either. 

I highly recommend a stop in here soon, you'll be smacking your lips with PB&J goodness, I promise!"}
{"text":"I was looking for a quick snack and Peanut Butter Jelly Time definitely fit the bill.  Sure, peanut butter and jelly isn't the fanciest meal, but the 'sushi rolls' elevated the common sandwich (it's even served with chop sticks!).  The staff was friendly and the hot chocolate was delicious, too.  A nice treat for a good price.  It's fun to try different combinations without having to buy all the ingredients to experiment at home."}
{"text":"I love PBnJ... When I say love, I mean have an unhealthy obsession with it. If I was only allowed to eat one food for the rest of my life, it would be PBnJ. The fact that they opened up a restaurant dedicated to this delicious sammich gives hope to the future of the human race. Order with Postmates app for a $4 delivery charge if you're at work and want to impress your colleagues. All of the sandwich concepts are great and taste perfect. Grahama's Fav are also my favorite sandwiches there. The Elvis with bacon, Fluff a Nut, Buttercup Buttercup, they're all going to change your lives for the better. Get the brown bag special and try out 5 of the classics for only 12 bucks. Don't forget the milk!"}
{"text":"The food is tasty for what it is- a PB&J shop that makes the sandwiches your mom used to pack in school lunches. The breads and bagels they use are the inexpensive, store bought brands; at least this is reflected in the price of each sandwich. The food is tasty and service was fast enough (probably could use one more person behind the counter, since when I was there the cashier was also the one making the food) but I was expecting something a bit more upscale, for the neighborhood it's in."}
