{"text":"I'm posting this updated review about Pearl of the Orient in Rocky River, Ohio, as my previous review somehow got dumped down to the \"Not recommended\" area.  I \"HIGHLY RECOMMEND\" this restaurant more than ever.  I've been dining here since 1997.  The food, extensive menu and service are excellent.  Please give Pearl a try.  You won't be disappointed to say the least."}
{"text":"I have been eating at this restaurant for at least 25 years now.  I have always had consistently good, friendly service and fresh, well seasoned food.    Some note-ables:  Love the Tom Yum Goong soup, actually all of the soups are good.  They will make the sushi with brown rice when requested, which is always a good option.  The Young Chow fried rice is a favorite as is the Beef and Broccoli.  You also can't go wrong with the Pad Thai, Szechuan Chicken, Spicy Pork or Crunchy Beef. The only recent complaint I had was with the Yuen Baos.  This was always my favorite place to get them.  They were large and filled with soft creamy cheese and plenty of crab flavor.  However, the last order seemed like a freeze and thaw version and were very small and dried out in the middle.  The server was apologetic and did remove them from our bill.    The atmosphere is warm and welcoming and I highly recommend this restaurant.    Oh....I also wish they would bring back the \"tasting dinners\" they used to host 20-some years ago, which featured an array of offerings not on the regular menu and served family style at large round tables.  We always met nice people and shared great food at these events."}
{"text":"Fantastic!  $12.95 chicken includes a glass of wine and eggroll.  Generous portions.  One of my better breakfasts!  Excellent service."}
{"text":"Stay away!  ordered 6 pieces of salmon for carry out, returned home and they smelled rotten and were beginning to brown around the edges.    Called back to the restaurant to complain and he would not give my money back unless I drove back there with the rotten fish. (After thinking about it a bit, I bet they wanted to serve it again)  Terrible food and terrible customer service.  This place has the feel of one of the restaurants you see on \"Restaurant Impossible\" or one of Gordon Ramsey's shows."}
{"text":"We were not impressed and will never go to Pearl of the Orient again. My dinner arrived lukewarm and under cooked. The worst thing about dining there was Food Poisoning. I felt sick to my stomach while I was eating. It hit me fast and I needed to leave right away. I mentioned to the waiter I wasn't feeling well and he just ignored that fact. It was a rough night. However I am glad that I didn't finish my food because I would have been in worse shape. I called the next day and spoke to the owner who just blew me off which is surprising. Food poisoning is serious bottom line."}
{"text":"Absolutely foul. The sushi was something I'd expect from a grocery store that's a couple days old. Both my husband and I had entrees that were swimming in sodium and msg ridden sauce overflowing off the plate. Not even remotely close to what was described on the menu. Felt sick for at least a day."}
{"text":"The location is fantastic. The ambiance is beautiful. The menu looks inspired and creative. The food tastes like crap. 2 appetizers , 2 entrees, 1 dessert and everything was just gross. No flavor or life to any of the food. How do you make pineapple bland? You almost have to be TRYING to accomplish something like that. Neither my date or I came close to finishing any of our dishes."}
{"text":"This is by far one of my favorite restaurants to get Asian food in the Cleveland area. I have never gone in here and had a bad experience. The service and the food is always outstanding and top notch. The servers are always extremely polite and vigilant. If you are looking for a great dinning experience I would recommend you go here!"}
{"text":"I am repeating for this audience what I told the management when we were there. They need to educate their wait staff on how to properly serve simple dishes like moo shu. This dish, in my nearly 40 years of eating it, is always served on Mandarin pancakes and neatly folded and presented by the wait staff to the customer at the table side. I was offered a choice of pancakes or rice. I declined the rice. The filling and pancakes arrived without a bowl of hoisin sauce. I had to wait about 5 minutes for this to arrive before I could fold my own. Furthermore, my bowl of hot and sour soup was neither hot or sour. I mentioned this to our waiter and he brought me lemons and some pepper oil to season it to my taste. They did \"comp\" us for this bowl on nothing soup. Believe me, bland hot and sour soup just doesn't cut it. To their credit, the menu has many adventurous sounding dishes ranging from various Chinese regions to Thai and Vietnamese. Being from another corner of Cuyahoga county, we don't eat in Rocky River very often. We ate at Pearl of the Orient more than any other such place in that community and recall it to have been much better both in terms of the food and certainly the service. My wife is rather adamant that we won't be going there any time soon."}
{"text":"My wife and I come here pretty often as we both think that the Pearl has the best Sushi on the west side.  We have never said anyting before, but after our last visit a little bit ago something has to be said about the service and atmosphere.  We were coming in for sushi and dinner but the service was so horrible we left after sushi and just skipped dinner.  The atmosphere in this place is like a funeral home and then add on bad service and we have to leave.  You have speakers in the place, friggen use them already.  It is not fun hearing other peoples silverware hit the plates and then dead silence in between.  Create an experience already!  Have you ever wondered why no one stays after they eat for a drink on a friday or saturday night?  Its because its so silent and still.  You cant afford to do this with places like the burntwood so close.   On to the service.  I have no clue how Josh the bartender still has a job.  He must be related to someone.  We ordered 2 hot sakes and when he delivered two large tea cups for us to drink it with I asked him to go get sake cups.  He insisted that they had no more left as it was to busy.  When I asked him to show me one other person in the restaurant using one, he couldnt find one either.  Thank heavens for Sarah, we aksed her 2 seconds later and we had 2 sake cups in 3 minutes.  Josh just didnt feel like getting them.  The horrible service went on for the rest of the evening, and this is the norm as he has been our server more than 3 times, no checking in, asking if we re ok, refilling the water, etc..  The last draw is when we kept trying to get his attention for more water and he was actually sitting on the cooler behind the bar with the tv remote in his hand.  He was changing the channels on the tv behind the bar watching and  laughing at the tv for about 15 minutes.  His side was to the customers and he never looked out once.  Instead of staying and spending more money we left, yet again.  George, wake up, you have a great product but purely miss the details!  People like my wife and I want to come back but you make it hard.  We are young rocky river home owners who want to see you succeed, but times are changing, you must too!  We MAY give it one more chance and if that goes bad we are just going to take the hike out to Pacific East."}
{"text":"Really enjoyable experience here. Had a couple cocktails (Fog Cutter, Dirty Sapphire Martini) and they were prepared beautifully. The warm sake was excellent (a little smoother than I was accustomed to). My group enjoyed a succulent plate of sushi, featuring at least 6 different rolls. All were excellent. Servers were gracious and accommodating. I would definitely recommend and I am looking forward to my return visit."}
{"text":"Worst sushi I've ever had. You know that nasty burnt egg smell, that's what MY VEGGIE sushi smelt like. Food was ok. If this place wants to stay in business it needs a major change. When I walked in I just felt like it was a dirty place, everything felt dirty and sticky, plates, cups, table. Sushi chef touching the fish with his hands like literally just playing with it while he's on the phone. Maybe that's part of the reason people were reporting food poisoning."}
{"text":"I used to go here with my family as a child but have begun to go again more recently. I usually order the chicken fried rice. It is delicious. There service here is very good. The waitresses are always very friendly.  Hopefully I will try some new dishes soon. This is a really solid Chinese restaurant."}
{"text":"Love this place! Very upscale for an Asian restaurant and I love that they have Moscow Mules."}
{"text":"This place has great food, Chinese food. The noodles are great. The food is great. Not only that when you walk in you see a beautiful fish tank of colorful fish. This place is good especially for  Chinese."}
{"text":"I really like this restaurant, it's kinda a hidden treasure in Cleveland.  I try to visit whenever I'm in town. The food and service are always excellent, and the prices are always pretty good as well. Definitely recommended.  Pro tip:  I would highly recommend the sushi if you stop by, it's well priced and fresh."}
{"text":"I want to start by saying My husband and I love their sushi. However the other night we were hoping for tasty Chinese takeout and we were incredibly disappointed. We had orange chicken and an egg roll, not the most exotic dish. The egg roll was filled with grease so much so that I got sick right afterward. The chicken's breading was soggy (I'm sure partly due to the fact that it was takeout) more so than usual. I'm sure we'll eventually go back for sushi, but I'll pass on the Chinese for now."}
{"text":"I read several reviews that were less than stellar before we went, and was cautious. We had a group of 4 and did the Tasters menu for 4.   Our service was great, food was amazing and drinks were perfect. The owner shook our hands and thanked us as we left.  Ample parking, we got there early on a Saturday night and the place was full when we left but we had no wait.  Couldn't ask for a better experience."}
{"text":"Soooo good!  Although the sign outside says \"POO\" and thus always make me laugh, the food is awesome and the menu is rather eclectic and unconventional. I have had two superb dishes here. Although they sound very similar (honey almond chicken and honey walnut chicken), they were prepared differently and tasted GREAT! Fattening and rich ... But great.  Wonton soup was ah-mah-zing. While the wontons weren't the best (a little flimsy), the broth was perfect!!  Also, I love that they have Chinese, Thai, Vietnamese, and Japanese dishes here. Very unique and flavorful food. I've only gotten takeout; would love to dine in sometime."}
{"text":"Sashimi is amazing here.   Wait staff are fun to chat with.   We recommend this place for a good time!"}
{"text":"Good eye appeal, hot right out of the kitchen.  We had a pork dish, a scallop plate & tofu/eggplant item.   Almost 4 star so opted to round up.   Entrance is not user friendly for the handicapped."}
{"text":"Review for sushi only.  Apparently, Pearl of the Orient has been serving sushi for several years. I don't eat much Chinese food (none, really) so I had no knowledge of this until my hair stylist mentioned it one day.  I went in on a Friday evening at 6pm-ish and sat at the bar. I ordered 2 sushi rolls (rainbow roll and spicy tuna roll) and they were prepared and in front of me immediately as the sushi chef wasn't busy. I devoured it like it was my last meal. I ordered a third roll (a Philly roll, I think) and it was in front of me in less than 2 minutes. The bartender, who was very attentive, suggested that it's hit or miss as to whether the sushi chef is really busy or not and whether you get your sushi quickly.   I had zero complaints about the sushi. It wasn't gigantic, which is neither here nor there for me. I don't think giant pieces of sushi equals quality or deliciousness. My only comment was that the sushi seemed kind of warm and soft and fell apart somewhat easily (as opposed to cool and tightly packed, I guess).   Now that I'm writing about sushi, I want it, so I'm sure I'll be returning soon. There aren't many (any?) options for sushi in Lakewood/Rocky River so I'll certainly check it out again soon."}
{"text":"First time here & it was our last. The food was bland, & the wait staff was inattentive/had to ask for our drink order 4 times. The best part of our experience was how great the busser was."}
{"text":"Passable Asian fare. Very attentive staff. I had vegetarian potstickers and green beans with garlic sauce. They serve brown rice on request which I always appreciate. My friend had a pho, which he thought was very bland. The worst part of the meal which the restaurant really can't be responsible for was a very large and noisy table seated next to us. Middle aged group of women lingering way past happy hour but sounded more like a bunch of frat boys loudly hooting and hollering. I guess it might have been nice if the staff had tried to quiet them down some . . ."}
{"text":"Not good food. Sushi very low quality. I ordered a roll and the fish just didn't taste good. Not fresh and bad texture.  The other items were average."}
{"text":"Delicious dinner on a Friday night at Pearl of The Orient, in business at Beachcliff market Shops since 1984. We  were seated and immediately the owner George came to our table and welcomed us to the restaurant.  We ordered Szechuan Chicken with Brown Rice and Orange Chicken with Brown Rice, both meals were delivered to our table in a reasonable amount of time  Steaming hot full of flavor, large portions, we loved the food and can't wait to return."}
{"text":"So my Asian-persuasion boyfriend and I are on a quest to find decent Chinese food on the West side. I dragged him away from his favorite, Hunan of Solon, this summer because I just couldn't stand living on the East side anymore! So now that I am the Wicked Witch of the West (pun intended) I vowed to find him a place that would do his beloved Mongolian Beef dish justice. Up until this week I was failing miserably. Then one night on the way home from work I suggested we stop at the Pearl of the Orient. I hadn't been there in ages, but I remember my parents always saying good things about the food there. The restaurant is very small, I would guess no more than 15 tables in the joint, but decorated nicely. We were there late on a Tuesday night so the place was pretty empty, but I'm not sure I would risk going on a weekend night and having to wait a while for a table to open up. We started off with an order of the braised potstickers and soup. The potstickers themselves were good, but the sauce served with them was very tart and vinegary. I thought it was a little overwhelming and didn't compliment the dish very well. The wonton soup was just OK. Not the best I have ever had and it was only luke warm when served to me. I was a little nervous going into the main course. I was so sure that the Mongolian Beef would once again not meet the expectations of the BF. It was served and he noticed the bean sprouts and carrots right away. \"Not traditional\", he said and I just rolled my eyes and groaned. Here we go again. He took a bite, chewed thoughtfully and said \"but still the best I've had on the West side\". WOO HOO!!!! +1 for me!!!! I ordered the Honey Walnut Chicken and was happy with the large pieces of quality chicken breast, however the sauce was a little too thick and sweet for my liking. But I didn't care because I think we found our new West side \"regular\" Chinese joint!   A few things to mention:  -On Monday nights they have a special of buy one chicken dish, get one for $1. What a steal!  -They offer you the choice of white or brown rice - nice to have options  -The soy sauce they serve is not your normal Kikomans. It has a thicker consistency and is WAY stronger. Seriously people, a drop of this stuff goes a long way."}
{"text":"Happened by this place just by chance today! I was so excited as this was my favorite lunch spot while they were in Van Aken in Shaker Heights!"}
{"text":"There is something for everyone. I don't necessarily like traditional Chinese food, but I like Japanese and Thai food. I like Pearl of the Orient because of the breadth of selections on their menu."}
{"text":"I don't entirely know what to make of the earlier review... I have no idea if the young lad was serious or ... completely off the rocker...!  I managed to make it over to this venue today, ostensibly to watch a lion dance during the run-up to Chinese New Year (Lunar New Year, for those given to political correctness!).  The dance, performed by caucasian members of a local kung-fu school was well choreographed and surprisingly entertaining.  (Just returned from a jaunt to Singapore/HK and had seen a number while in 'spore...)  The antics of the lion played well with the playful, and at times coy, glances given by children.  Rapt gazes of children are strangely infectious-- as if giving us windows back into our own childhood...  The venue itself is converted from an older theatre.  One can recognize the ticket counter in the kitchen-bar.  The theatre/stage itself has been converted to a dining area fixed betwixt the windowed dining area next to the kitchen-bar and a smaller private dining room.  The decor draws elements from HK-chic and a sort of generic asian-hip.  Black figures prominently in the design motifs as well as matte-brushed metals.  A couple japanese figurines line the walls.  The owners are HKers and very cool.  George and his wife own this venue and greet guests with dignity.  More than that would invade their privacy, so I will spare any further details.  Suffice it to say, that they're good people.  The food itself will require a second visit -- I enjoyed the ee-meen, Roast duck, roast chicken, spring rolls and sweet and sour fish.  The style of the meal was banquet style; so I can't really speak to their day to day work.  Today's meal would net a 3.5 to 4 in my book, with the caveat that it was likely cooked in mass quantities; the entire place was packed!  An update will be in order when next I visit.  At least I can talk to George!"}
{"text":"Simply the best westside sushi around. Amazing food, amazing service, amazing location and amazing atmosphere. They're on delivermefood.com which is hugely convenient!"}
{"text":"One of the best times out to dinner we ever had as a family. My wife, daughter, son-in-law and myself. Entrees are great. Desert was to die for. Chocolate Lava Cake is a must try.But it was the server team of George and Rachel that made it so great. George has been there for 33 years and the chef for 28. If you like Asian food and having a good time this is the place. BTW - White Rajah from The Brew Kettle on tap and other craft selections was first for me at an Asian restaurant. Bravo!! Will return."}
{"text":"My Shrimp Rolls were not the best and everything else we had was mediocre. I love Asian food but not coming back here"}
{"text":"Meh. I got three rolls to go (the rainbow, cucumber, and spicy crab). Honestly the rolls were warm rather than cold and they didn't taste that good. The fish was sort of goopy and not that fresh looking. The miso salad was dull and the ginger dressing was sweet and clear looking. The miso soup was good and the only thing I finished. Not really impressed."}
{"text":"Amazing Asian fusion restaurant with a variety of options (Japanese, Vietnamese, Chinese, etc.). Love coming here especially for their sushi! They have promotional offers on certain days, which is great! They have table seatings, bar seatings along with outdoor patio seatings. The location of the business is in a plaza which means parking is available (yay). Service depends on who you get, there may be new staff and so they are still learning, which I don't mind since I am quite patient. Otherwise, they have great service as soon as you walk in. Quality of food is good and they provide you with a filling amount.   I cannot wait to visit again soon!"}
{"text":"Very good presentation and the food was amazing!!!! Sushi is to die for!!!! Manger was very friendly."}
{"text":"I'm shocked by anyone rating Pearl lower than a 4. It has such a diverse Asian menu from sushi to phu as well as all the traditional dishes you would expect to see, but all done with great, fresh ingredients. Our service was very attentive from the moment we walked through the door to the moment we left. I always like when owners of bars and restaurants greet their guests, it always makes me want to go to a business more when I like the owners and feel like they care about my experience.  We all got different types of meals and everything was great. We got a sushi roll as an appetizer and I look forward to going back for a full sushi meal, which is saying a lot because I'm a total CA sushi snob. The bowl of phu was enormous, literally enough for 4.   It's a great little date place or for a small group and I look forward to going back again and again!"}
{"text":"We ordered red curry, it looked like there was no sauce at all---very thin, watery, tasteless. Veggies didn't seem to be cooked at all. I did takeaway or I would've sent it back for something else. The potstickers were ok. Not sure about the rest of the menu, but the curry was gross."}
{"text":"Love the sushi... Little pricey but oh so worth it..There shrimp fried rice has plenty of large shrimp, my wife had chicken fried rice and loved it... The best thing that I would have to recommend is the desert... The Apple Ginger Eggroll is heavenly!!!   Especially the ice cream that comes with it.. will definitely eat here again.."}
{"text":"My go-to when I want Asian cuisine.  I frequently order the Pad Thai (vegetarian) and I am very thoroughly impressed with it!  The location is convenient and it gently reminds me I need to go to the gym, since my fitness center is located right across the plaza. :)  Value for the money -- 5 stars, at least for the Pad Thai.  It is easily 2-3 meals, so I pack it up for lunch at work the next day.  Service - 3.5 stars.  They stop by to make sure everything is okay at a good pace, but I once ordered while dining alone and then went to the restroom and they had served the food to my empty chair.  I think that's pretty inappropriate. Other considerations -- They lose points for not offering a gluten-free soy sauce and for packaging leftovers in polystyrene containers, gross!"}
{"text":"Been here twice for lunch. I've had Orange chicken and Emperors chicken. Both were very good!  Service was kind and professional."}
{"text":"I've been going to the Pearl for 20+ years and have always been impressed with how George operates his restaurant.  I have never left disappointed."}
{"text":"Second trip here for Saturday lunch, this time I also brought my wife.  The first time I had the rainbow sushi roll which was good but very overpriced.  This time the both of us had chicken lunch specials, two of which cost less together than one roll and were excellent.  Good service but it was only for water and a single plate each.  The only odd thing is that they insist on cash if you order from the first page of the lunch menu."}
{"text":"Extremely great food. The service is ALWAYS welcoming and the workers there literally will call you by name after the first visit. Super friendly workers and excellent food. I have never been disappointed here."}
{"text":"We've been coming to The Pearl for more than a quarter century, so I figured it's time to post a review.  This is a favorite of our family. Food is always very good, portions are more than fair, and service is always friendly. Their pot stickers are the best we've had anywhere. Sushi is good too, but can be a bit slow to get to the table.  The owner is a great man who always visits tables to check on his customers."}
{"text":"Always a classic, eggplant with black bean sauce was delicious tonight. Really like them for fast convenient takeout."}
{"text":"Stopped on by because I wanted to try their express lunch I'd seen advertised.   When I came in I did tell the gentleman that's what I wanted,  I ended up finding out he directed me to a different menu (did not notice it was more than twice as expensive as the express lunch).  My food arrives and here I realize the bait and switch.  After some civil back and forth about it the man agrees to discount a little,  but not to the express lunch price.   Onto the food,  salad was light and tangy. The tempura had a nice crisp, but the shrimp inside had yet to be de-turd ferguson'd. So that was kinda off putting. The teriyaki chicken pieces were tasty but lacked much sauce or zing.  Onto the sushi, it was pretty well done.  They rolled them with a good amount of tobiko. All the ingredients tasted fresh,  good helping of ginger pieces.  Overall I felt I had a neutral experience,  just ok. The bait and switch was honestly off putting and some shortcuts on the food, but I'll chuck it up to miscommunication. I'd try the place again."}
{"text":"My wife and I ate there. Clean, good and I was full. Had sushi. Was in and out for about 50 duckets for two people..good overall"}
{"text":"Pearl of the Orient... More like Puke of the Orient.   Both myself and my gf got food poisoning after eating sushi.   Not one to complain but getting sick from obvious negligence is unacceptable.   When i contacted the restaurant to explain my experience the owner accused me of trying to scam him after i asked for my money back.   He said there's no way he was at fault - laughable.   That was enough motivation for me to inform others of such poor food and customer service.   He ended the conversation by offering me a gift certificate.   Free meals for life wouldn't win me back to that fish flea market."}
{"text":"I've tried several things from different sushi rolls to the Singapore noodles, Pearl Platter (very greasy), fried calamari, and the curried chicken skewers (nice sweet peanut sauce). The food is definitely A-Okay, but nothing really to write home about (like I know I liked the sushi rolls that I have gotten, but I can't remember anything specific about them). Also, I've ordered everything through UberEats so I cannot comment what it's like to dine-in, but I will say that it's very thoughtful of them to include utensils, sauces, and even cookies with your take-out order.   I will probably give them another try, they do have a huge menu and I have only sampled a small portion of it.   That is all."}
{"text":"My issue is not with the food, but with the staff. I ordered off UberEATS and when it was delivered was missing half my order (oh well mistakes happen). I called the restaurant and explained what happened and the individual that answered the phone said he'd call me right back. 25 minutes pass and I had not received a call back. At this point my family had finished eating and I decided to refund that part of the order. I called back to inform them not to make the food and the man was very rude and did not seem to care. I am not angry that I never received the food because mistakes happen, what upsets me is the way in which it was handled by the employees of the restaurant. I will not order from here again."}
{"text":"We loved this place but there has been a steady decline in the past months.  The level of service and inability to get orders correct has become an issue and tonight the quality of food that was attempted to be passed was downright dangerous.  The sushi that was tried to be served via takeout was badly butchered and clearly rotten. We will not be back."}
{"text":"We have been going here for years and it is not as good as it used to be. The yuen baos are still the bomb and the sushi is good. The fried rice didn't even seem fried, no flavor at all. My husband requested our chicken dish spicy and it was bland. Overall, we have been consistently underwhelmed over the past few years. It makes me a bit sad. it is not a bad place, but it isn't fabulous and I am likely to order takeout from the cheapo Chinese place as I am no longer seeing the value in paying more. I do still love the yuen boas, they are like crack, but the rest is not cracklike."}
{"text":"Finally tried Pearl of the Orient this evening and I was thoroughly impressed.  I ordered via Uber Eats and I received my order within 15 minutes of placing it.  I ordered the Beef with Tangerine Peel and it was excellent.  Huge portion served with rice and also a cookie.  Can't wait to try some of their other dishes. Also can't wait to eat my leftovers tomorrow"}
{"text":"This was the closest Chinese restaurant I could find after my peaceful spa massage. The moment I got to Pearl of the Orient though, I could tell by the designs that this wasn't a super authentic Chinese restaurant.. it had a bit of an American fusion into it.  But the restaurant is really big and clean and even has an outdoor patio!  My waitress wasn't the best. First, she seemed like she was soooo busy but she only had me and another table to serve (and i was by myself). It took her awhile before she asked me what I wanted to order. And, sometimes she'll ask me a question (do you want more water? do you want something else to drink) as she's walking to her other table, instead of actually stopping to ask what i want. Either way, I was okay with it because I wanted it to be a short dinner anyhow.  I ordered the Seafood Trio and it came out in like 2 minutes which I felt kind of suspicious. The sauce was good but it was really salty and there were way too much of the sauce on my dish. Then, some of my seafood were a bit cold, almost like it was frozen seafood that didn't fully heat up in the saucepan when they served it to me.   This place is a tad disappointing because the owner seemed like a really nice guy but it isn't an authentic restaurant to go to. I would come back for a quick bit to eat or for a quick drink, but not to expect an authentic restaurant though. The price was always a bit expensive for the quality and quantity compared to other local Chinese restaurants"}
{"text":"Ordered takout on a Saturday night for a change. First off, 2 entrees and 2 orders of Fresh bring rolls came in at almost $50 bucks after delivery charge through a third party and mandatory tip. We had the Thai Red Chicken Curry and the Veinamese Pho soup. Now, if you are going to claim that you can prepare dishes in a variety of asian styles when your menu is primarily American-Chinese you have a tall order to fill. In this instance Pearl of the Orient failed. The \"Red Chicken Curry\" was literally Chicken with broccoli in some kind of watered down Chinese standard issue broth/sauce. No RED chili, no Coconut Milk, not a curry at all. The Pho was some of the worst my wife and I have ever had. Weak broth, questionable beef balls and absolutely no sides, (limes, jalapeños, basil, etc) like you would normally receive with this dish. The Fresh spring rolls were descent, the only portion of the meal that we finished. If you like below average cuisine that is over priced, this place is for you. We ended up throwing most of this meal away which is a shame based on how much we spent. I recommend hitting up an authentic restaurant if you are interested in any cuisine style outside of Chinese from this restaurant."}
{"text":"Only been here once for lunch but it was delicious. I had a $4.99 lunch special, and it was amazing. A very large portion and the veggies weren't overcooked at all. It was perfectly spiced and the brown rice was perfectly cooked. I also had a veggie spring roll, which was delicious too. For the price, I don't think it could have been beat. The atmosphere was lovely as well and the food came out very quickly. The service was very good too. A great lunch spot!"}
{"text":"Somehow the sushi chef is never there right after lunch? Which means no sushi, no seaweed salad??? .  Owner is super sweet, staff leaves you alone but still attentive.  Food is ok."}
{"text":"We haven't been to the Pearl in years. It hasn't changed much. I'm not sure that's a good thing. The food is good - but uninspired. After the delightful greeting, the service is attentive but not up to the standards you'd expect in 2016.  We got tempura veg and shrimp. Average.  Sushi and rolls were good - but pedestrian."}
{"text":"Pearl of the Orient was kind of a disappointment.   We ordered the potstickers, sweet and sour chicken and orange chicken. There was a great Monday special of but one chicken dish get the second one for $1. That was a great deal!   The pot stickers were pretty good. Grilled up so they had a nice crunch on the outside.  The sweet and sour chicken was slices, which was not expected. The sauce was not really sweet or sour. Not like I ever tasted before.  Te orange chicken was nice and crunchy. The sauce was so salty. It tasted like a lot of soy sauce... And I couldn't taste orange anywhere in the sauce on the plate other than the two slices that they added for decoration.   The music was quite... Eclectic? They had anything from N'Sync to Celine Dion to Les Mis. Really anything except the normal Chinese restaurant music.   Overall. The location is nice. The restaurant has great outdoor seating in the summer.  The waitress was nice and friendly."}
{"text":"I frequent this shopping plaza and have always had my eye on Pearl of the Orient - After a trip to several stores I decided to dine alone and try it...  When I entered the establishment I took a seat at the bar, it was moderately busy with a interesting barrage of patrons. There was an old western movie playing on the flat screen behind the bar - interesting choice... The bar had four people, two couples...all of which knew the bartender by name, Scott. He was very attentive to all of us and kind - but he never introduced himself to me, which I thought was odd as everyone was calling him by name. I first asked if I could order something from the lunch menu (and would pay a difference in price) And was told no - Bummer. So I ordered spicy tuna, pretty typical and one of my faves. I ate one; it was messy and tasted old. I pushed my plate away and when he asked if he could box it up for me I said \"No, it wasn't very good.\" He then removed it and carried on... No further questions, no recommendations, no asking if he could get me a fresh order, nothing - Oh, and it still showed up on my bill. The remainder of my food options were a mute point - They didn't knock my socks off (I had the ginger-dressing salad and lettuce wraps.)    The best part about this experience was people watching. I may give this place another shot - but I think there are MUCH better Asian Restaurants"}
{"text":"My wife and I have come here quite a few times for the great sushi.  Because we have always like the service and the staff, we decided to hold an event here for about 50 people.  They have a private back room that was perfect.  The prices were very reasonable and the staff lived up to its reputation of providing great service.  Thanks to George and his team for making our event so wonderful!"}
{"text":"I absolutely love this restaurant! There is a variety of types of food: Chinese, Japanese, Thai, Vietnamese. Everything tastes amazing, the staff is very friendly, the managers greet you at the door and owners are often on site. The prices are fair and the portions are huge!  Don't forget to try one of their creative alcoholic beverages too!"}
{"text":"American Chinese food. The schezuan style is not authentic here just as a heads up.  It's cooked in a tangy Americanized type suace instead of hot oil and red peppers. I've never had a curry taste so sticky/syrupy even with a coconut milk base. $16 for two small soft shell crab was kind of pricey in my opinion.  My waiter was clueless...wasn't very helpful or attentive. I was served a sushi roll of white tuna when I had asked for a sashimi dish as an appetizer.   He took it back, but I ended up waiting until after our dinner was done (30 minutes later) for me to tell him to cancel it altogether. Really disappointing."}
{"text":"FOOD POISONING PROBABLE  The service was great, but TWICE now the spicy tuna roll was not edible. When I told the server AGAIN the tuna was bad, she asked if I could come in on a Friday because that's when the fish is delivered...apparently they know it's inedible by Monday but still serve it. The owner never came out to address the issue and I was charged for the roll. Very disappointing and I fear for others. The last time I let the server know she still served a gentleman down the bar from me the same roll. Maybe the board of health needs to check into this . To George: the server said your delivery day is Friday. She's very sweet and I appreciate her honesty. I wanted what I ordered, not a substitute due to the tuna being spoiled."}
{"text":"I really enjoyed this place. Went there on a Sunday afternoon, so it certainly wasn't packed. I gotta say, I'm one of those Americans who doesn't go all-out when getting Asian food -- usually stick to beef & broccoli, sushi, fried rice, probably the sort of stuff that makes mainlanders wonder, \"Why do Americans eat that crap?\" A few friends and I shared pretty much those dishes, and enjoyed the chill ambiance and the more-than-friendly servers. Customer service really goes a long way, and they seem to realize it here."}
{"text":"DO NOT COME HERE. Please don't be fooled by the pictures I've posted, Yes the sushi looks and tasted good. However, 2 words: FOOD POSIONING! I woke up in the middle of the night sick as a dog thanks to their sushi. Which I also have to mention is extremely over priced considering it was not fresh or properly kept. What an awful experience. I didn't get any sleep because I was so sick. So much for a romantic night out with my boyfriend. I haven't gotten sick from eating sushi EVER in my life so that tells you something.   Be wary of coming here. The service was also lacking and we waited for at least 5-10 minutes for our waitress to come back so we could get soy sauce for the sushi they had already brought out. I'm very disappointed overall. Be careful of what you order if you come here. I had the spicy tuna and shrimp tempura roll and you see how that turned out. :(  On top of everything, my boyfriend called to complain and explain what happened and the owner accused him of being a \"scam artist\" (his exact words). He told him we were making it up. That is total BS. It really pisses me off because I had to miss work the next day and was up all night. Horrible owner and restaurant!!!!!!!!!!!!!!!!!"}
{"text":"So we have been coming here about once a year for the past two decades and the quality seems to have deteriorated.  We ate there on Monday night December 27th. My girlfriend and I ordered the Tom Yum Goong Soup that was served to us without Coconut Milk (the main ingredient). It was ok, but it was missing the main ingredient, the ingredient that makes me order the dish.     Then, 4 main courses are served to a table of 5. My girlfriend had to wait 10 minutes to receive here Pad Thai which only takes 5 minutes to cook, i am a professional Chef so i know how long things take to cook and put out. So obviously they didn't even start to cook the Pad Thai until the other 4 meals were being eaten.  Then, my Green Curry was served to me without Cocunut Milk, the main ingredient in a Green Curry. It was more like Chicken with Salsa Verde. It was only edible if you haven't eaten in 3 days and were going to starve to death.   The Pad Thai was equally unedible and tasted like it had sweet & sour sauce. I've had Pad thai out of a box that tasted better.   The only upside is that one of the chicken dishes cost $1 and they knocked another $10 off the check.  Oh, and the best part was the gastrointestinal distress that is still rearing it's ugly head 4 days later for several of us.  Sad to say but never going back here again. Definately not Authentic and not sure if they have new owners or what is going on but if i was a Chef or Manager at a restaurant and two entrees came  back barely eaten i would go to the table and ask what was wrong or what i could do to make it right, especially after the waitress was told that both dishes were missing a main ingredient."}
{"text":"I came to Pearl of the Orient with high expectations, I left disappointed.  The reviews seemed mostly positive, the location was very nice, and I enjoyed the setting as there are windows surrounding 50% of the wall space with a nice outdoor patio area.  The food is not authentic, more American Chinese and below average American Chinese at best in my opinion.  Sauces were very heavy, fried rice and lo mein dishes were very bland.  Sushi was fine.  Considering the cost I was expecting much better."}
{"text":"I went for the first time tonight with my boyfriend. We walked in and were promptly seated and  provided glasses of water. The hostess was very friendly. The atmosphere was nice, comfortable, and not too loud but not uncomfortably quiet, either. I had a hard time choosing what I wanted to order, because I really wanted sushi but I also wanted something I had never had before. After a lot of jumping back and forth, I ended up settling on the Mongolian Duck with brown rice, and also a Shanghai spring roll. We didn't wait very long at all for our food, and our server was very nice and attentive. The spring roll was good. The Mongolian Duck, however, was... I don't want to say it was bad, because it wasn't. But it wasn't great either. It was honestly just bland. I was also a bit disappointed by the amount of actual duck in the dish. It was mostly a heaping pile of sprouts with not very much duck at all, and lots of salty, kind of sweet sauce. This wasn't a terribly disappointing thing as I do very much enjoy sprouts, but the sprouts weren't what I had paid for this evening. I had also asked for mine to be spicy and it had barely any heat to it whatsoever. I do realize that spiciness can be different for everyone, and therefore the next time I go I shall ask for it to be \"extra spicy\" to see if that makes a difference.   My boyfriend however, was VERY satisfied with his dish (he ordered szechuan beef). And there was quite a bit of beef on his plate.   Otherwise, though, the food was hot, we didn't wait very long for it, and the servers and hostesses were very nice. I'm going to go again and get something different next time."}
{"text":"This place is highly overrated. The chicken pad Thai could almost be called pad Thai but low and behold, I found 2 pieces of chicken buried deep within all the noodles.  The potstickers were a little well done and sauce was below average compared to other Chinese places I've tried.  Szechwan chicken is impressive to spell but not so impressive to taste, also below average flavor.........definitely nothing special about It is all I can say."}
{"text":"We have come in to Pearl of the Orient multiple times. The reason I give it three stars is because it is always a bit different because of who ever is cooking in the back. Some of the cooks are better then the others.   The food is delicious, the sushi is great (takes a little long to make so be ready to wait) and the main dishes are large enough to share.   The service is very nice and everyone is helpful explaining things on the menu. It is a quitter atmosphere and I rarely see the bar completely filled but if you want some good Chinese, then this is definitely better then any takeout you have had."}
{"text":"I've always been very happy with this place.  Me and my girlfriend go almost weekly and sit at the bar.  She gets sushi and I have never heard her complain, she's also been going there for years (before we even started dating).  I have to be in a certain mood for sushi and I usually just order something off the regular menu.  I tend to enjoy their noodles and I recently had the bad Thai with chicken and it was spot on.  Very good and a generous portion (good for lunch the next day).  This is a little more than your Americanized Chinese takeout I feel it has a fresh aspect and quality ingredients.  It's slow paced and you're never in a rush which we love.  I'm convinced some of the mixed reviews are from people who think your typical grease ball Chinese food is good."}
{"text":"Pearl of the Orient in Rocky River is, to me, the best Chinese in Cleveland. I have been eating here since 1992 and I continue to love it! The Yuen Baos (wonton wrappers stuffed with cream cheese, crab and shrimp, then deep fried) are heavenly!! This visit we had the mu shu medley, house noodles, string beans in garlic sauce and orange chicken. All delicious!! The owners, George and Lily, are top notch as well. I love the Pearl. It is often voted one of Cleveland's best Chinese restaurants and I can definitely see why. I can't wait to return."}
{"text":"I went to this restaurant with friends and loved it! The decor is classy and pretty, and service was great. Best of all, however, was the food! Yummy wonton soup, pot stickers, and sweet and sour chicken. The menu is huge so you can always find something new and delicious!"}
{"text":"Not feeling like cooking, and hankering for some Americanized-Chinese food, I searched yelp for anything Chinese related. I came across the Pearl of the Orient, and since it was only a few blocks away, placed an order online for szechuan chicken. The online ordering process is actually fantastic and the website itself is very well made. I had no issues navigating around or trouble with any of the wording. You see the whole menu in front of you and you just click on the meal and quantity that you want. It asks how spicy/hot you want your meal and what kind of rice you prefer, white or brown. I didn't experiment much, but I imagine there are more choices than that. The checkout is simple. Input your card, address, and leave a phone number. It gives you the estimate for the time, and tells you they will hold the order for an hour after it is ready.  The place itself is impeccable. Although I only went in the lobby area, I could see that the restaurant was very well kept. It could have been that it was during a weekday, but I have a feeling that the owner keeps a tight reign on the cleanliness and organization of the establishment. The man at the front desk asked my name and gave me the to-go order.   It's a decent amount of food, but I felt a little put off by paying $11.50+ for it. The szechuan chicken left something to be desired. It tasted okay. I chose \"hot\" for the \"spicy range\" (Mild to Hot to Extra Hot), but I didn't really taste any sort of pepper to make the meal spicy. There was one dried red chili. The szechuan was also a bit too soupy. Maybe I'm doing it wrong, but I had to drain the dish a bit because there was so much liquid in the bottom. The brown rice was cooked perfectly, and the fortune cookie is always appreciated.   I will probably be going back. I don't like judging a place based on takeout."}
{"text":"We enjoyed a sold dinner here this week. Tried some sushi and a chicken dinner. Enjoyed wonton soup and split a non- noteworthy egg roll.  Spicy tuna roll was delicious- lots of tuna and not overly mixed with spicy mayo or over-rocked. Will definitely go back for it since there is NO sushi in this area unless you count Heinens!!!  The eel and cucumber was also delish. My hubs loves eel and he totally enjoyed this one.  We split the bourbon chicken- it was nice but not really something notable.  Overall I think this is a solid spot for sushi and I would give it another spin for sure. Service was great and the place was pretty busy on a weeknight.  I also took into account the fact that they do specials! Love that and makes it a nice option for a weeknight dinner."}
{"text":"Now that I've had a few menu items under my belt I can share some deets.  The place is located in beachcliff market square in the heart of rocky river, super cute area. Sometimes parking can be a challenge, but it's worth it.   The best experience I've had has been lunch with friends and ordering the Bento box ( I uploaded a picture of it). It's the perfect combination if you like to try a little of everything.   I've ordered take out a few times and here's a few pointers. What you expect from the atypical Chinese sweet and sour chicken is not what you'll get here. It's more of a dish for a refined palette... Just in case you're looking for greasy friend Chinese food! It was good nonetheless. I did enjoy the honey walnut chicken. My friend ordered the orange chicken spicy and it lacked in spice and flavor. Overall, the food is okay and I'll come back. But, I think it is pricy as far as takeout goes and needs some oomph in flavor."}
{"text":"A very relaxed and welcoming atmosphere and a bit of an island of civility amongst the raucous environments found in many nearby restaurants in Rocky River and across the river in Lakewood. The menu offers many opportunities to explore various dishes and could keep repeat customers coming back many times trying various dishes. Most will return to enjoy their favorite dish. Either way-a great place to share an enjoyable meal with friends, family or special someone.  A wonderful staff makes the experience all the better and the food is fresh, flavorful and an adventure unto itself."}
{"text":"Food was fantastic and service was great! The pot stickers are so delicious and flavorful and the sushi is very fresh and tasty. Perfect for a night out with friends or a quick bite on a cold afternoon."}
{"text":"The location and ambiance are great. The food is stuck in the 90s. People aren't afraid of strong flavors and spices anymore.   Everything was pretty bland. The host was very accommodating and kept asking us how everything was. It was ok. We started with the pot stickers. They were bland and so was the dipping sauce. Friday's has better pot stickers. My entrée was the saucy shrimp and chicken. It had a little pepper image next to it on the menu. It wasn't spicy at all. I had the waiter bring some hot chili sauce, which he did, so that helped. These guys should go to Cuisine du Cambodge to find out where spice levels should be, or maybe they should just switch locations. I wish Cuisine du Cambodge was in this location and had a full bar."}
{"text":"Pearl of the orient serves great food. You must try the sushi boxes! I really enjoyed my time, atmosphere made it feel very warm and inviting.  Ps the owners are super sweet"}
