{"text":"There have been a number of negative reviews on the restaurant, however our experiences have been surprisingly good.  The food is quite fresh and is usually not as oily as some establishments.  The traditional favorites such as crispy skin chicken (which is often an indication of the chef's skill) is quite good and the peking pork chops are quite lean and tasty.  Overall good value for the money and a good go-to place which hasn't disappointed."}
{"text":"This is my favorite chinese restarant in town. Consistantly good. Try the salt n pepper squid or chow meins. 5 stars all the way!"}
{"text":"Food: 4/5 Service: 3.5/5 Cleanliness: 3/5 Price: 3.5/5  Like I've said in one of my previous post, we love Chinese food. More specifically, we love enjoying Peking Duck once in awhile. The amount of food is enormous for the two of us to go through, so we have lots of food to take home. Nevertheless, the food and the experience is delicious and it will forever be one of our favourites!  When you order Peking duck, you're prepared with thinly sliced onions, green onions and cucumbers. These vegetables accompany the peking duck that comes out later throughout the evening. We didn't order any appetizers such as soup because we knew that we had a huge feast coming.  As our Peking duck was being prepared, we were also brought out crepes to eat with our meal. The crepes are for making your own wraps: add Peking duck, your choice of vegetables, some sauce if you prefer, and voila! Enjoy.  What I liked about the restaurant was that they served the Peking duck on two separate plates. There's nothing wrong with having it on one plate, but I appreciated having the Peking duck prepared individually for us. Is this common in Chinese culture? I'd love to know as I'm curious! :) I'm not sure if it's plated per number of guests at the table, but when unsure, I think it's fine to ask your server to have it prepared so. Won't have to reach across the table!   I absolutely love the Peking duck here. The meats are so tender and juicy and its crispy skin is so delicious! With shredded cabbage, cucumbers and onions, it tastes so good. I have nothing bad to say about it! The amount of Peking duck you get is definitely for more than two people - it should accommodate up to 4 (maybe more if you have kids?), and as it comes with stir-fry/soup as well, it's definitely a huge meal whoever you're with.  We also ordered fried rice to enjoy with our meal because I was craving some. Whenever I go to a Chinese restaurant, I always need to have rice, preferably fried rice :P. The dish was light and a good side dish with our Peking duck. We ended up having lots of it wrapped up to go as we couldn't finish it in one sitting, but it was well worth ordering!  After our Peking duck was prepared for us, stir-fry came out a little later. Though there is the option of soup, we prefer the stir-fry. It's hubby's favourite and I personally don't like the soup very much either. This Peking duck stir-fry is one of the best I've seen. We enjoyed most of it the day after at home and it was just as delicious as it was at the restaurant!  Overall, Peking Garden is our go-to spot for Peking Duck. I mean, the restaurant's name says it all, no?  The restaurant is usually fully packed with customers so if you're there at a bad time, prepare yourself for waiting. I think the service at the restaurant can be improved, as I saw a shortage of servers compared to the number of customers as we enjoyed our meal. This restaurant is a popular choice for families, groups, visitors and much more. I think that says a lot about the restaurant already! Many are return customers like us and some are new...some just drop by to pick their dinners up as well. The restaurant is a little far out from downtown Montreal, but if you can get there, I highly recommend that you try the restaurant. The Peking duck is also available in two sizes (half and full) so you can definitely try their popular dish at smaller portions!"}
{"text":"Best Chinese food restaurant in Calgary! Heard about it but never tried it until I moved to the area. Love their duck with pineapple sauce and lemon chicken. Food always tastes very fresh and never greasy. Service is quite quick as well. Delivery on weekends could sometimes take up to an hour and a half so be sure to call early. Would definitely recommend this place!"}
{"text":"The food is a 10 but the service for carry out is a 0. The food is excellent if you can keep from strangling the lady. Regularly tells you a time for carry out and you can add 15-30 minutes. They take the phone off the hook when busy."}
{"text":"This business has been open since before I was born.  Really good Chinese food served in plastic forks and Styrofoam cups.  Real intimate little place as well, i'd go on a date there for sure."}
{"text":"While the building looks pretty bad, the food is always fresh, hot, and outstanding.  I wouldn't eat in the dining room, but we take out food probably twice per month, and the have never been disappointed.  Highly recommended!"}
{"text":"Yum yum! Every time I go home we end up here. The food is really fresh and delicious.   Try the salt and pepper squid!"}
{"text":"I miss the old places that served Cantonese style similar to the Yangtze on Van Horne, Bill Wongs, etc., and I've been trying to find a reasonable facsimile, any time I visit Montreal. The new location of The Peking Garden is a very nice comfortable place. One glance at the reasonably-priced menu surprised me with a Cantonese-style dinner combo just like the old days. Won Ton soup, egg rolls, chicken chow mien, garlic spare ribs, pineapple chicken. OMG, I thought I was going back in time. When the food arrived, I found it was similar tasting, but not close enough to the old restaurants I loved.  WonTon soup-Excellent, Egg rolls-Outer shell was too thin and the stuffing was just OK, Garlic spare ribs-Not as dark a brown or as tasty, Pineapple Chicken-Tasty, but not as red or as as good as the old days, Chicken Chow Mein, very good but no green vegetables, Fried Rice-Excellent and just like the old. All food, including soup was served nice and hot, which I appreciated. In all, a worthwhile experience and good food. I will still have to search for something just like the sold Yangzte, Bill Wongs, The Nanking, etc...Yeah, I know, Im dating myself."}
{"text":"i wait one hour for dinner, and food too bad. I remind them three times for my dinner."}
{"text":"Great Lunch specials, the waiters are nice and always take time refill your tea and water without asking 5times like other places. The duck is so good, a must try, the general Tao is a classic and so is the beef black been. The prices are awesome for 10$ tax in lunch with soup, spring roll and side."}
{"text":"This is the worst Chinese food not in Calgary but in the World. Bad food ,not fresh and very bad service .They did not ask  how is the food ,they just put the dish and go.i did not eat my dish its very disgusting , Alberta health must close this restaurant before something happen to the customers."}
{"text":"If I were allowed to give no stars, I would. To make a long story short, beware of ordering food from here. My fiancee and I ordered some food and we were not given our full order. We called to complain, and the manager REFUSED to send the rest of our order unless we ordered more for at least $20 worth!!!! Needless to say, we won't be ordering from there anytime soon. Terrible service!"}
{"text":"I've been going to Peking Garden for...well, as long as I can remember. Here's why:  1. Dimsum.  You'd think that Chinatown would be the place to go for your weekend dim sum, and in some aspects, you're right.  But Peking Garden serves a Northern Chinese (Peking) style dim sum, and it's definitely not the same as your regular Cantonese style.  The flavours are different, and you'll find a few dishes on there that, frankly, aren't served in many other restaurants.  A few of my favourites include the Green Onion Pancakes, the Peking Chicken meal (both the wraps and the congee!) and their sweet \"pockets\" - pork + veggies cooked in a sweet brown sauce, which you then stuff in pliable sesame pockets. Delicious.    2. Service. Okay, maybe I'm spoiled because I've practically grown up with these waiters, but they're friendly.  Once you get to know them, it's like you don't even have to order because they know you and know what you want. They always bring me a nice glass of soy milk as soon as I walk in :)  3. All other food.  My family usually goes for their dim sum, but their dinner menu is delicious as well. They've been around for a long time, and really know what they're doing. My favourite includes the Tofu in Brown Sauce (I know, vague) and their stir fried string beans with minced meat.  They're consistent in their food quality.  And if that didn't quite convince you, just go check it out yourself.  Be a little adventurous and order something that's not your \"usual\" fried rice or spring rolls. Although, those are good too..."}
{"text":"16 Failed health inspections, 7 severely ill people, $25,000 fine from the government.  Why would you want to eat here?  Shut this place down before they kill someone.  http://www.calgaryherald.com/news/alberta/Restaurant+fined+unsanitary+conditions/9552017/story.html  http://www12.albertahealthservices.ca/health-inspections/SearchServlet?direct=showReport&ID=67C040B5-32E4-4051-9D66-58A1A2B32796"}
{"text":"Terrible and a little scary...  I went with my daughter before dinner rush and it was empty. I ordered our food. I asked about the lemon chicken, he told me about it. I decided against it and ordered the orange chicken. He brought out both dishes. I told the waiter that I only only ordered the orange chicken. He lost his temper, yelled and told me that if I didn't want the lemon chicken I had to say \"I don't want the lemon chicken\" when I made my order. Apparently, saying \"I'll have just the orange chicken\" wasn't enough for him...  I bagged up my food, told the man who presented me with the bill what had happened. (Not the waiter)  He couldn't have cared less...  The food was tasty. I enjoyed it better at home where there isn't a sad, angry man yelling at me."}
{"text":"Make that eight people who have gotten sick from this place. I got violently ill on December 2, 2013 after eating takeout from this place. I didn't report my illness because I've eaten there so many times with no problems. I didn't want to assume the worse. I wasn't aware of any health violations. I guess I've been rolling the dice this whole time, and didn't know it. It's too bad. It was one of the few places in town that served gluten-free Chinese food. After my incident, lets just say I'm off Chinese food for a while."}
{"text":"A rarity in Montreal,  a BYOB Chinese restaurant that has been around forever.   Good solid food at reasonable prices."}
{"text":"This is the best Chinese restaurant ever. I won't eat Chinese at any other place. I eat here at least once a week. There egg roles and her home made sauce is to die for. Highly recommend stopping in !"}
{"text":"Too bad there are no stars ... Let's start off by saying that we have frequented this place regularly for the past year, and for good reason. That is until the other evening.  For starters our waiter was rude from the get go. For example, he was very unhappy to explain a dish we had never tried before, almost like \"shut up, eat, pay and go!'. When the food arrived, one of the dishes we had questioned him on was nothing that we would ever order - it was inedible right along with the extremely oily vegetable fried rice. At this point we started to get upset and a little nauseous too, so we called the waiter over to our table, telling him this is NOT what we wanted and cannot eat it. He arrogantly answered \"eat it and you will like it, its better than what you originally wanted\". This was clearly an admission that they brought us the wrong dish! So we told him there was no way we were going to eat this and he didn't care.    At this point our dinner turned into a complete disaster as the waiter walked away, not giving a s**t. So I had to get up, go to the front cash and speak to the \"supposed\" manager. This turned out to be a complete waste of time. When I explained the situation to him, he looked at me like he wanted me to just get lost. He said that he would get the story from the waiter and then let me know. I can guarantee you that he never got back to me. Talk about arrogance and zero appreciation for a paying customer, let alone one he has frequented this place countless times.  Being aggravated, we left all the food on the table and went to pay the bill. The \"so called\" manager was not at the cash, so our \"humble\" waiter took our money and we left. As we exited this \"fine establishment\", right outside the door was the \"so called\" manager having a cigarette break. Since we were already pissed, our dinner ruined and stomachs gurgling from what ever little we did eat, we confronted him saying that \"you didn't even have the courtesy to come over to our table an offer an explanation or a substitute dish to satisfy the customer\". His reply: \"Oh well, it is all good\" with a nasty smirk on his face. Clearly, he couldn't care less.  We will happily tell anyone and everyone never to frequent this dive again, unless they come with Pepto-Bismol and \"shut your mouth attitude because the waiter knows better what you like\".  Sometimes a restaurant can have an off night w.r.t the food, but to add severely arrogant service to the equation is totally unacceptable."}
{"text":"Another awesome meal with spicy squid, nice and tender but crispy coating, extra spicy.  The black bean long beans was the flavour of the night.  An unfortunate boon with the recent health issues made it easy to get a table.  In discussion with staff the problems have been cleared up and the kitchen and dining room were cleaned and freshly painted.  Admittedly, I am a long time customer who has never had issues with this establishment and will continue to patronize them."}
{"text":"This place is sweet, sweet like the general tao's chicken which is awesome.  I've been there 3 times recently and its awesome value. You can BYO and eat a lot of food and its always under $15 including tip.  Highly recommend it."}
{"text":"Pretty good Chinese food. Reasonably priced. Excellent General Tao chicken. Spring rolls mediocre."}
{"text":"Went in on a Saturday for lunch. The place we almost full and we got sat right away. Water and tea was brought to our table once we sat down. We ordered two lunch specials. Spring roll was premade and your typical spring roll you  get at any Asian restaurant, it was cut in half. I ordered wor won ton. That was a $1 upgrade. Had to ask for my soup twice before it was bright to my table 3/4 the way thru my main course. Fortune cookie at the end of the meal was moldy.  The food was ok. Nothing special. Not sure why the restaurant was so full.  Service was terrible.  Don't think I'll be back for while. If ever."}
{"text":"I can see why people love this place - for its service. The waiters are very friendly and talk to you like you're his family. BUT they are only like this to people who come here a lot, which I find very unprofessional and makes a dining experience unpleasant. I am not a frequent customer (however I have been to this place more than 6 times over the past few years) so I feel I receive the cold shoulder when I come here. I feel secluded from their \"family\". You might think I say because I'm jealous of the better service other people receive, but what I want to say is that a restaurant should provide the same level of service to each and every customer, regardless of how frequent they visit. Afterall a great restaurant experience is due to its service. Who wants to compete for being the apple of the eye of the waiter!? Or even a popularity contest? Give me a break. I'm here to have lunch/dinner. Our bill and the oranges were brought to our table before all our dishes came out. They were just a bit too efficient I'd say...  Food - quality and taste are average to above average. Although a lot of the dishes are very local (ginger beef and sweet and sour meats) and may not appeal to people who want authentic Chinese food.  So I wouldn't recommend this place to people who want authentic and tasty Chinese food. And I probably will not eat here again."}
{"text":"Service in food used to be good going downhill come in to get a takeout order she let 3 people in front of me don't care about customers o ya forgot the frid rice"}
{"text":"Nice Chinese restaurant with a lot of Guangdong cuisines. The best in West Island, strongly recommend!"}
{"text":"We had take-out and while the hot and sour soup was great, the rest was decidedly NOT. The ginger chicken was overcooked, dry and tasteless. The Mongolian beef was also badly over-cooked and virtually tasteless. The General Tao chicken was crisp and tasty, but dry.  We decided  that Peking Garden is not for us. We like our food edible."}
{"text":"Love the dimsum for brunch, do try the peking duck and other specialties. This is a family favourite for Chinese food in the NW area. This place is always busy and that makes a statement for the food. A personal favourite is the peking duck which can be made into two or three different dishes(ex: peking duck, fried rice with duck, or duck soup) and the cold dish combo. The service is friendly and speedy."}
{"text":"i had my lunch here this afternoon, absolutely the most worst food in Calgary. the meat is not fresh and tasted sour and raw. also i found some pink and black spots on the noodle. it was so disgusting and i did not eat my food after first bit. NEVER GO THERE."}
{"text":"Im impressed by the quickness of them making an order to go. I loved the 10 percent discount off if you pick it up. They were very friendly and prompt when I entered to grab my order. I highly recommend the Egg Rolls, Chicken Fried Rice and Wonton Soup. I tried the Cantonese Chicken Special for 2. I didn't love the Chicken Chow Mein, Honey Garlic Spareribs nd Beef and Broccoli. I'm sure there are great items on the menu and I was highly happy with much of my order. There is parking all over with the location as well. The place was full with families eating their supper in the restaurant in the evening. It's very reasonable priced with menu items from $1.75 to $14. It's convenient to get to as it's just off Decarie- the main highway. I did like how they added extra sauces without asking for them ! Check it out !"}
{"text":"We tried this after reading great reviews elsewhere.  Now, don't let the scary exterior and tables-in-a-living-room feel inside turn you off.  Sit back, enjoy the silence (you'll more than likely be alone), pretend the lighting is dim and make it romantic, because you're in for some excellent Chinese food.    My husband enjoyed the orange chicken and I had general tso's...  They are very accommodating on how spicy you want it.  The hot and sour soup was also delish, I think it had small chunks of beef or pork in it.  It was one of my favorite versions by far.  The egg roll was also tasty with their homemade sweet and sour [apple]sauce.  Be prepared for the food to burn blisters on your tongue!  For this reason...    ... We got take out after work one night.  This time I had kung pao chicken.  Take out was good, with generous portions and definitely was a great value for the money, but I wasn't quite as impressed with this dish.   I was surprised that the owner remembered us - I guess we are easy to remember.  She was very nice.    This is some of the best Chinese we've had around here!"}
{"text":"Not a bad place for Chinese food, but very, very, very slow.  I was there with only 2 other parties and it still took over 30 minutes to get the food."}
{"text":"Waste of money. Ordinary to bad, leaning toward bad. Ordered Eggs rolls , Chicken Lo Mein, Cashew Chicken, Beef w/ Broccoli. Egg rolls were ok. The food was not very good. Edible is the best I can say and, quite honestly, we threw out the left overs as no one wanted to eat them."}
{"text":"One of my favorite Chinese places! The Empress chicken is delicious, and they give you generous portions. Service was fast, and the food came out within minutes."}
{"text":"Friends of 5 came for dinner. It's Cantonese style . A lot of dishes is sweet n chilly.We ordered sweet n sour fish . Fried shrimp, beef , eggplant, chicken n a few more . It's inside a plaza. Not hard to find parking space. Portion is not huge, but reasonable."}
{"text":"The food is a bit pricey and honestly tasted like they used goose or cat. Not good at all. Neither my boyfriend nor I could eat it. The staff seemed friendly enough but the food was gross"}
{"text":"I really wasn't sure about coming here to begin with, but my grandpa swears by it. So I figured why not? Well, I'll tell you why not.   To start, the price isn't that awful, it's pretty average. The food was off as far as taste. I don't know what palette the chef is using but maybe they're getting on up in age and have to have pungent flavors to taste anything. I ordered the house lo mein with no vegetables and an order of steamed pork dumplings, my mom ordered garlic chicken.   The dumplings weren't thick, y'know like real Chinese dumplings. They were made with thin wonton wrappers. Inside the thin \"dumplings\" the real problem awaited, however. The pork of the pork \"dumplings\" was 98% cabbage, 2% spice. I've never had dumplings that tasted like an unfried spring roll before. The dipping sauce tasted like a nail salon and again, had cabbage in it. Did they have some cabbage about to expire, or something?   Anyway, onto the main courses. I suppose my moms garlic chicken was supposed to be very hot and spicy. My lo mein, wasn't. I can only assume they cooked my chicken with hers, as my chicken tasted like Lucifer himself cooked it! I picked the chicken out and ate a Popsicle to cool my mouth down, and decided to give it another try. Nope. The whole. Freaking. Plate. Was spicy. It really depressed me that I paid $29 for food that I couldn't eat without having a Popsicle between every bite.   If you're just thinking I'm really sensitive to hot and spicy food, well, I am. But! I had another person try my food to verify. Someone who likes spicy food. They verified that it was pretty friggin spicy.   I'm on the lookout for good, genuine Chinese food in this area. Sadly, Peking Garden doesn't make the cut."}
{"text":"All I can say is this place was pretty awful, I ordered a few things from there and it was for to go, we had to wait 30 mins for our food because they made the food for the lady that came in after us her order to go before we even got ours, the service was just bad and u can tell the food was frozen, our chicken wings was fry with old grease and burnt. I will not be going back to that place again."}
{"text":"This is just a bunch of excellent goodness.   The food here is so tasty, the Ginger Beef is always crunchy, the Schezuan Chicken is always perfectly spicy. Chicken fried rice is always moist and slightly sticky, Won Ton soup is always  warming and soothing, Lemon chicken is juicy with excellent flavour....spring rolls are crisp....sorry sort of started dreaming of my last several meals there.   I hope I got the point across that you should try this place, I go out of my way to eat at the Peking Garden. I don't, scratch that, I can't eat at any other Chinese Restaurants.  I think I am going to call and get take out now."}
{"text":"Wow, even tho Ive stayed in this area with friends for some times, i never thought of coming here. What a mistake on my part, this is probably the best in the area. My only problem was there fountain drink selection (sweet tea and powder lemonade mix)."}
{"text":"This has been my family's favourite Chinese restaurant for close to 20 years.  Venue for so many of our special occasions.  The staff treat guests like family."}
{"text":"Best Chinese food. I'm very picky about Chinese food and my wife is as well. We have driven all over Gastonia the find Chinese food. This by far is the best and even my wife loves it.  It doesn't matter what dish the food is excellent.  We travel a ways to get it but the only Chinese food we will have when we want Chinese."}
{"text":"Good food.  Combo with fried rice and eggroll is great.  Low prices for this kind of food."}
{"text":"This food if you can call it that, is the worst..we live 5 minutes from the restaurant, and the food was lukewarm when we got home. The dumplings taste like the frozen ones from Costco that got reheated.  Fried rice was more like steamed rice with some soy sauce. The chicken and brocolli was a few pieces of chicken, no brocolli..and the worst of all, food was bland..We ended up throwing most of the food out..Just couldn't do it....They are in need of serious help in cooking."}
{"text":"I'm torn in giving 3.5 - 4.0 stars for this place.  It does offer a good selection of North American Chinese food, but, very limited in offering Authentic Chinese.    This resto is my go-to place when my parents are visiting...My parents are happy with the dishes, so they must pass the Asian taste test!  The place is very big with lots of round-table seating but is overdue on updating their decor... but I think that's just part of their charm...It wouldn't be a Chinese resto without the fish tank, soiled carpet, 1970's chairs and a Bell public payphone that doesn't even have the LED display yet and the yellowpages.  One good news is that they actually use tablecloths rather than that white plastic.  If looking for wonton soup, they serve the porc ones, and not the one with the shrimp.  Still just as tasty tho' (light flavour).  I'm a big fan of their dry garlic spareribs - such sticky goodness!  My typical order that I get for pick-up is the dinner for two - Special Catonese Dinner: 2 wonton soups, 4 egg rolls with plum sauce, chop suey with porc (and some yellow crunchy Cheeto-like? things), dry garlic spareribs, pineapple chicken (chicken pieces in batter covered with orange plum-like sauce), chicken fried rice and fortune cookies.  You can add additional portions per person, but, it's enough for 2 people and  leftovers for lunch the next day.  [I have a love/hate relationship with their pineapple chicken....The taste of it has been consistent and the chicken is never drowning in the corn-syrupy sauce... but because of the (sweet) batter, I feel like I'm eating a doughnut!]  There is a hint of MSG used in their food btw.  There's no real reason to drive all the way to the West to come eat here....It's good Chinese food dining for families living near by."}
{"text":"BAD!! I have been a long time fan of this restaurant for decades. Unfortunately, tonight is the first night in their new location east of Decarie and with new owners who have taken something good and screwed it up! Food is terrible, customer service is terrible. No joke, I threw it in the garbage. Prices have gone up, allergies not considered, and whatever there was tasted like pure salt. Too make things worse, much less meat than usual in the same dish size. Do yourself a favour, save your money, save your disappointment and choose another restaurant. So sad but the unfortunate truth!!"}
{"text":"Lets try some Chinese food.  This place was great. The food isn't greasy, the portions are great and the service is splendid.  Great family run place. Would recommend it to friends."}
{"text":"3 words...gluten free chinese!!! I was at a friends place for lazy Sunday with a side of NFL and not wanting to cook, there was the suggestion of chinese. Which at first I was worried, as I'm a celiac and I know how much crap is in most chinese.   We checked out the site and it said able to accomodate GF. So we ordered the meal for four and they were able to do everything gluten free, except won ton soup, but their hot and sour is.   So we had soup, ginger beef, fried rice, sweet & sour chicken and one more dish. It was delicious, not greasy and didn't feel like death after. I was very pleased and now that I know I will definitely get from here more often."}
{"text":"In Vancouver we have more than a few very fine, authentic Chinese restaurants to choose from due to the demographics of the lower mainland so I was a little dubious about finding an authentic experience in NW Calgary.   I am always encouraged when I see people of the same ethnic persuasion dining in an establishment of their native cuisine because I always figure that to them it is like eating good home cooking. In the case of Peking Garden, the Chinese people dining there were either in for a major disappointment or must have lousy food at home.  There were a dozen of us and we tried 10 different dishes plus some noodles, rice and vegetables. Without getting into details about all of the individual dishes the adjectives that come to mind are oily, goopy and doughy. I still felt a lingering heaviness in my stomach about 6 hours after we dined.    The hint that the food was less than steller was that the leftovers sat unclaimed in the refrigerator for many days when someone usually lays claim to them for breakfast the next morning! I should have heeded my skepticism and steered our dining decision maker in a different direction."}
{"text":"We had take out tonight, my husband waited there for it so it wasn't sitting long. It was okay. Nothing unbelievable. It wasn't hot, it was warm . Spent $60 and didn't even get fortune cookies. The sauce on everything was very light, even the sweet and sour pork. The chow mien had about 4 pieces of chicken, 4 shrimp and a tiny little piece of pork the size of a smartie. The dumplings were only okay too, cool and had what tasted like shredded bbq like you get at a Thai restaurant in it? The ginger chicken again was okay but the breading on this as well as the sweet and sour pork wasn't crispy, it was soggy and falling off. My husband said that the place was packed and looked really nice but that doesn't matter nearly as much as the TASTE of the food. Ohhh and what few veggies I got we so overcooked they were mush. I may try the dine in if I'm in the neighbourhood but I will NOT order takeout again."}
{"text":"If I could give this place zero stars I would. I ordered skip the dishes and didn't get what I ordered, or if it was what I ordered it was wildly different than what the website read. The won ton soup was slimy rather than a broth and the dumplings came separate on top of the chicken dish that I thought I ordered. The whole meal was a mess and we didn't even end up eating due to the terrible taste and texture of everything. I would never order from here again, waste of $45!!! yuk!!"}
{"text":"The food was great last time I visited, but just paid a check on the Alberta Health website for the recent (past year) of Environmental Health Inspection Reports... the cleaning/sanitation and food care practices/violations and revisits are definitely concerning.  :-("}
{"text":"I know how to cook \"authentic\" home style Chinese food but I also love take-out Chinese style food. I'm a huge fan of this restaurant. Everything tastes fresh and of good quality - tender pieces of salt and pepper squid, perfectly cooked chow fun that isn't greasy and has tons of flavour, Chinese vegetables with right amount of crunch, and with tender pieces of satay beef, and the usual chicken chow mein. The only disappointment was the almond chicken, but with so many other great options, this is my to go place. If you pick up and pay cash, you get an awesome discount. There was one time I ordered and the food wasn't as good. the batter on the squid was soggy and not cooked long enough. The chow fun was also not as flavourful as it usually is...However, the next two times were great. We ordered 9 dishes. We really enjoyed the eggplant and pork dish. The shanghai noodles were so-so. The squid was perfectly cooked. Chow fun was flavourful and not oily."}
{"text":"This place was fined $25,000 for unsanitary conditions confirming my suspicions!! People have been falling sick after eating here."}
{"text":"Let me start by saying I have 6 people in my not so little family and trying to find a place that everyone will eat at that doesn't have a Golden Arch in its name is trying!! But low and behold Peking Garden is it!! All 4 kids loved it and so did the Hubs!! We have been eating here now for almost a year and it may not be the healthiest food ever it sure does fill everyone up and we have had leftovers every time we have gone!! We've eaten inside and taken out and both have been very good experiences."}
{"text":"Unfortunately, this place was fined $25,000 for ongoing long-term health code violations. I used to go there, the food is OK and cheap, but, alas, never again.  People were getting sick."}
{"text":"We went there tonight for the 4th and last time. The waiter was rude and almost hit my dining companion in the face with the dishes he plunked down on the table - zero regard or respect.  The food was completely tasteless and on top of all the grease and msg, salt still needed to be added and I'm not one for salt. The service was awful, we had to continuously flag down wait staff to take our order, order more drinks, bring side plates etc etc. So, we left 70 dollars lighter with a greasy film in our mouths only to throw away the leftovers when we got home. Awful service, awful food - we will never be back. Especially after reading the prev comments about how many ppl were sick from eating there."}
{"text":"$25,000 fine for unsanitary conditions, 2 families down with food poisoning  Stay away or risk your health if you dare, traditional foods should not involve \"traditional\" food handling practices"}
{"text":"This place is one of my parent's favs but it often leaves me feeling quite unwell.  Although western Chinese tends to have the effect on me as a genre,  there has always been something about this place in particular.     I can't say the staff is overly nice or the food is overly good - I don't get the \"draw\" but maybe it's the meat dishes as anything veggie isn't wonderful.  The best I've had here was a spicy tofu dish and I loved the heat - it just gave me stomach rubbles.  The recent food inspection issues doesn't help my impression of this place.  I now really wonder if it's the MSG and seasoning or the food handling.  I was by here at lunch today and the place was packed which means they've obviously corrected the terrible conditions that resulted in $25,000 in fines and they have earned back business.  I hope they have turned things around -  I'm just remaining a bit skeptical of the place for a while yet."}
{"text":"This place is probably the best Chinese food on my side of town. The food is always cooked all the way and is very tasty.  The bad thing is they are slow. When you call in an order and they say 20 minutes, add another 20 minutes. At least the food is done."}
{"text":"A - List. Fabulous Food from rice to noodles to chicken and beef to the fanciest plates of crab and the largest bowl (cauldron) of soup I have ever laid eyes on. These folks have been in business since it was on 14 street many years ago. Still going strong. Dropped in on a Monday night and this place was humming. Decor is banal, tight table arrangements, parking can be interesting. All in all, well worth the visit. You will likely be smiling after dining here."}
{"text":"First time there, special was a tofu meal. It was delicious. Service was good, too. They were really busy and kept the crowd moving. Will definitely be back."}
{"text":"My biggest issue with Peking Garden is Inconsistent Quality. For example, while SOME entrées are nicely executed and well balanced, others are over-drenched in sticky, hot-mess sauces where you can't even taste the meat you're eating. Or, while their hot-and-sour soup is perfectly on point, their egg rolls sometimes reek/taste of damp stinkiness. I'd be mean to say \"Try them out!\" when there are 3 entirely solid Asian eateries within the vicinity you'd be better off spending money at: THAI HOUSE also on E Franklin right down the road, SAKURA JAPANESE also on E Franklin by Books-A-Million & Regal Cinemas, and DYNASTY BUFFET also on E Franklin nearest the Walmart. These 3 alternatives are more of sit-down restaurants, however. As for a place that is most similar to Peking Garden in atmosphere/feel (i.e. simple order-and-leave or call-and-pick-up), CHINA CAFE off Union Rd is the answer... and their food is absolute gold!  Rating specifics (i.e. 1-5, low-high)... - Overall recommendation = 3.25 - Food taste and quality = 1.75 - Portion size = 4.5 - Price = 3.75 - Atmosphere = 2.75 - General service = 3.25 - Waitstaff = 3 - Location = 4.5"}
{"text":"The waiters ignored us for a good 25 minutes. We kept ourselves occupied by drinking the wine we brought. We ordered the full duck for 3 girls and it was perfect. Food 100% but service needs a lot of improvement!!"}
{"text":"I had been going here for quite some time for take out.  Not my type of place for a sit down meal.  Clean for the most part,, food looks and tastes acceptable, but you have been to one Chinese Buffet you have been to them all.  Noisy, crowded, and the patrons are .. ...well....you will have to see for yourself.    Stopped going b/c I found out I was being cheated. Takeout is weighed for pricing per pound. I am trained in using and repairing scales.  Weighed an empty container. Scale registered $0.15.  Not a lot right?  But it adds up if you buy multiple containers of food by the lbs. per cost, for multiple people over the duration of a 1 yr.  When I confronted manager, he said you are paying for the container. When I pressed further as to why the cost was not in the price per lbs. of a takeout tray a patron would already pay, he stated that I am paying additional to cover the cost of each tray?!! .15 cent for a styrofoam tray? Who knows how many pickup/walkout orders they have, but they have one less...."}
{"text":"This place is awesome for lunch. I always get the lunch special and grilled pork dumplings.    Great place and good food.  Fast service and locals favourite.   Best Chinese in the market mall area.  Give it a shot."}
{"text":"Good food at reasonable price! Hot n Sour soup is pretty good,  lo mein is excellent, and not to forget the fortune cookie :p"}
{"text":"There's not much I can add to the other reviews, other than that this is probably the best mainstream Chinese restaurant in the NW for friendly service and quality food. Many places have surly staff who treat you like a barely-tolerated annoyance, but not here, where they actually SMILE at you and answer questions about the menu."}
{"text":"I got takeout from here tonight.  The food was borderline inedible.  The food was pricey and the rice had no flavor.  The cream cheese in the crab Rangoon was clumpy and tasted gross.  The governors chicken was okay and the beef with broccoli was good.  Nothing special about the food here.  Tasted like they rushed making it and lacked overall flavor. Will not be ordering from here again."}
{"text":"Coming from Vancouver I have had a lot of good Chinese food, but never managed to find a place that can do things gluten free. I was beyond thrilled when I found that they could not only make my favorite dishes gluten free, but that it was really good - no mean feat with gluten free cooking. Now every time I come to Calgary, I make a special trip to come here with all my friends.  My personal favorites are the ginger beef, the sweet and sour pork, and the salt and pepper squid. The peking duck is divine! Very dismayed to see all the negative reviews, I have never had a problem!"}
{"text":"Tasty Chinese food in Calgary? Check. We went during a busy weekend lunch but still managed to get seated right away. Steady flow of customers throughout the time we were there. Service was still fast which was impressive.   Memorable dishes:   * Peking style chicken - skin was roasted perfectly and it came with the standard wrap, sauce, cucumber and scallions. Meat was very lean, not as fatty as duck but still moist * Green onion pancake - the dish was tiny... pancake was cut into 4 pieces but it was tasty * Shanghai beef noodles - a good pick if you love thick noodles and beef. Can't go wrong with this dish * Fried zuchini - soooo good. Tastes like tempura almost. And it has a nice spicy kick to it.   Ready to try more dishes next time!"}
{"text":"I'm surprised with the low rating for this restaurant. I've ordered from skip the dishes before and I didn't like it that much. Going in person the food taste wayy better. We got the dinner special for two but we modified it because I'm vegetarian. The food was good and fresh. They were so accommodating, fast, and understanding. The service I received was great. I'm not sure why there are so many low ratings. I really enjoyed my meal and my service. Thank you"}
{"text":"It used to be better. I suppose the lack of lineup out the door is indication that the place doesn't make the best congee and xiao long bao. We still like coming here but are willing to try the new Ginger Beef in Coventry Hills for their dim dum instead."}
{"text":"Moved to the area and wanted chinese. This place had great reviews so thought we couldn't go wrong here. WRONG! SO WRONG!!! Obviously the reviews were by the owner/friends. Ordered 5 meals, after a very difficult language barrier. One came completely wrong and they completely left one order out. Went back for correction and they still didn't correct it. On top of that, the food we did get, made everyone in the family VERY SICK. Will NEVER go here again, and are turned completely against Chinese food for a while. So sad. Don't go here!!!!!"}
{"text":"Worst Chinese I have had. Fried sticky and heavy. No frills no service no be back  its in a strip mall there doesn't seem to be any desire to please the customer not many veggie choices. Skip this place"}
{"text":"I love this place. I've been going to Peking Garden for over 8 years. Probably more. They've been an integral part of my growing up.  Order in, take out, you name it, I've done it. Multiple times. When my mom found out she had celiac, we asked if they could whip up some gluten free dishes for us. No problem. They use corn starch wherever they can and you can bring your own gluten free soya sauce - they'll use it. Any business willing to do that for you deserves your loyalty. Service is always impeccable.  I'm about to break this place down for you like an MC Hammer jam, so strap yourself in. If you're not salivating by the end of this review, I've failed you.  First of all, the decor is simple. The place is small. Parking is awful. And yet this is still the best damn Chinese food place in the city. You should make a reservation because everyone who is anyone in the Northwest knows what's up - this place is more legit than making out with a supermodel and having her call you back.  Now if you know what's good for you, you're going to order a lot of food. Follow this simple guide.  0. Deep fried wantons. We always begin with these. They come with a sweet and sour sauce so good that you'll have to restrain yourself from plunging your entire face into the tiny bowl it comes in. I'm more serious than cancer.   1. Sizzling Rice (Tomato, Shrimp, Veggies). When they deliver this to your table, it's piping hot. They pour on the sauce. It fizzes and crackles and the delicious aroma floats into your nostrils. The shrimp taunt you with their pink little bodies - but don't worry, you'll be eating them soon. The water chestnuts are crisp. The peas are amazing. It's like eating rice krispies with sauce poured out of God's private vat.   2. Ginger Chicken/Beef. We get the chicken - it tends to be more crispy. Ginger beef was actually invented in Calgary - fun fact. I'm betting the chef here invented it, in between writing sonatas, curing diseases and writing a best seller - because their Ginger Chicken/Beef is genius.   3. Salt & Pepper Chicken. If I was on death row and someone asked me what I wanted my last meal to be, I'd probably just make it an entire bucket of salt and pepper chicken from Peking garden. It's a bit spicy. It's hot. It's crisp. It'll arouse you in ways unnatural.  4. Garlic Snowpeas & Broccoli. As soon as you pop one of those heads of broccoli into your mouth, you're going to swear to high heaven that someone in the back made a pact with the devil in exchange for the world's greatest garlic vegetable dish recipe. Even kids who hate broccoli will have to be physically restrained from pounding the entire dish back.  5. Sweet and Sour Pork. Big pineapple slices. Boneless pork. I would rather eat this dish than spend a night with Scarlett Johansson. If Scarlett Johannson invited me to eat Sweet and Sour Pork with her, she'd leave bearing my triplets.   6. Palace Style Chicken/Prawns. These go off like a nuclear bomb in your mouth, but instead of being devastated and facilitating the end of the second world war, it's going to send your eyes rolling into the back of your head and facilitate the end of your hunger.  7. At this point your waiter will have refilled your water roughly 75 times, or every single time you take the slightest sip. Just let them do it. They love it.  8. Beef, Chow Mein & Veggies. I once took the most beautiful woman I knew out for dinner and ordered this dish. As she slurped the noodles into her mouth, getting sauce all over her perfectly symmetrical face and the pearl white table cloths, I had never been more attracted to her in my entire life. I relive that moment every time I hit the right REM sleep pattern.   9. Honey Shrimp. You know why I love the Chinese? Because somewhere one of them thought \"Let's take honey. Let's take shrimp. Let's combine them.\" - and it WORKED. If I was a bear, I'd traverse the entire Kananaskis country to crash through the front window of this place and eat all the honey shrimp they had. I'd only maul people who didn't finish their plates. I'd leave the staff entirely alone - and I'd take a complimentary breath mint on the way out.  10. Beef in black bean sauce. Do you remember the first time you fell in love? Now you will.  11. Cashew Chicken. This is my least favorite dish here, and I'd still eat an entire pick up truck full of it before I'd eat at any other Chinese restaurant in the entire city. There's cashews. There's chicken. And you're going to eat it, and you're going to love it.  I could go on, and on, and on. I've eaten all of the \"white-people friendly\" dishes here. Haven't had the Peking Duck - working up to it. Haven't had the shark fin soup - I find that unethical.  They used to have a poster of Jackie Chan on the wall. My only complaint is that it's gone.   Go here and eat their food. Tell them I sent you."}
{"text":"This place seems to have different ownership.  They spruced up the inside and improved the service, but the food has taken a drastic hit. It seems they changed the ingredients and recipes. It always stinks to try and find a new Chinese restaurant:("}
{"text":"Been going to Peking Garden for years growing up in Aurora. Got it recently when I was back for a work trip and in the area. Won ton soup is tasty and fresh and dinner platter gives you plenty of food. Would recommend for anyone in the area looking for carry out."}
{"text":"Absolutely amazing food with GENEROUS portions.  Their General Tao chicken is absolutely phenomenal.  Their sauce is the perfect mix of sweet and spicy.  The chicken is all white meat and the batter isn't a thick gooey mess like most places that serve General Tao chicken.  The batter is thick enough to know it's there, and thin enough not to impede on the chicken taste, and doesn't leave you with a mouth full of dough and a small piece of chicken.  Instead it's the opposite..  And their Hot and Sour soup is TO DIE FOR!  I can eat them all day.   Their black bean and beef is also amazing.  Their shrimp fried rice believe it or not, is their chicken fried rice with shrimp added to it.  Talk about bonus.  You get chicken AND shrimp in it!  They also mix challottes with the rice too giving it a really nice flavor.    The dishes at this restaurant are top notch, the prices are very nice, and I like the ambiance (their fish tank is nice)  I would DEFINITELY recommend this place."}
{"text":"Food is consistently good. Has gluten free  menu which staff & kitchen understands as this is so important for me.  The Palace style shrimp and chicken with cashews are real favorites. Also has good ginger fried beef and chicken. Oysters in black bean sauce on a hot plate is outstanding when they are in season"}
{"text":"You know this was by far one of the scariest restaurants I had ever tried. Less then a month and three visits later Im a fan. This place is scary because outside it looks like a condemned building and inside looks like they went next door and got used furniture. The place really has no decor, no theme, no nothing... just tables, owners running hand and foot and food. I was skeptical of the fact that the restaurant looked like this as well as the face that though the outside of the menu was a leathery type menu the inside pages were laminated copy paper.  I decided what I wanted to order and was told that if I would order a combination it would be a lot cheaper. So I did The combinations come with the main dish, rice and an egg roll. My first outing I got my old favorite sweet and sour chicken.  Lately when I order that in a chinese restaurant it is a disappointment. The chicken usually is tough and rubbery because it sat in a warmer all day. This was the first time in a long time I got fried (sweet and Sour) chicken that I knew was fresh. How  you might ask? Because instead of needing a chainsaw to cut it I probably could have cut it with my fork. It was very good. The rice is addicting. The soup reminds me of one of my old favorites in Wok with Wing. The lady that serves I am guessing is the owner. As she often sits at a booth doing the books when she gets a chance. She is very attentive and nice.  Here is the kicker for me and this almost blew my mind. I got my check after the first visit and I swore something was wrong.  A drink Wonton soup rice the main dish and an egg roll  cost me 12 dollars after tip and tax. I have never paid anywhere near 15 dollars for my meal. I am just in total shock at how good this place is.   I actually am starting to like the tables in a home kitchen feeling the other reviewer mentioned. It was pretty busy tonight... almost every booth... about 16...14 they actually could seat at..... was filled. I wanted about a half an hour for my food ... maybe 35 minutes- 40minutes.. But honestly if you were at home how long would it take you to cook a fresh meal? Probably about that time. over all a very good place I recommend it to anyone in the area... except people who insist that good decor and new decor means new food and good food... you i recommend lock yourself in your house because you have no concept of good food."}
{"text":"This is probably my favorite Chinese restaurant in the NW. Food is always fresh and super tasty. They have a huge menu, so lots of options and new things to try  every time I visit! The service isn't great, it's a little scattered, you'll often have several different servers throughout your meal. But the staff are friendly and helpful.   Their delivery option doesn't always seem to be available, so be prepared to pick up or dine in.   *One important note: their menu items ARE made with MSG. Make sure to advise your server of any MSG allergies when you order and they are more than happy to make your food without. *"}
{"text":"Went for Dim Sum. They only had Cantonese style Dim Sum, so no Shumai, the sticky rice was unpalatable.  The rest was just regular Cantonese fare that you can get anywhere. The owner was not very helpful and shouldn't be waiting tables. I am assuming the other server was his wife and she was very helpful and attentive. Discouraged us from getting a second sticky rice dish until we tried it. Nobody cared for it. Nice enough place but I doubt that I would go back."}
{"text":"TL;DR - Food is okay; balding, black-haired manager w/ combover is prejudiced/racist.  Possibly one of the worst restaurant experiences I've had.  My family stopped here for a quick lunch. We came in around 11:30a, and the place was filthy; they were still in the process of cleaning even though it was way past opening time. There were literal piles of dust and garbage on the floor. I normally would excuse people for this (things happen, humans are humans, etc.); but shouldn't restaurants clean up the night before anyway?   Atmosphere-wise, the place was pretty dark. It wasn't very well lit and the grey-haired host at the counter did not seem welcoming at all. He didn't greet us as we came in and just stared at us even when we said hello and asked for a table. You would think he'd be more excited to see a table of six in his empty restaurant.   At least the waiter assigned to us was okay. He took our orders and tried his best to answer our questions about the food. However, he did ignore us after we ordered and didn't bother checking up on us at all. We ended up ordering a whole roasted duck w/ 18 pancakes; Chinese broccoli cooked w/ garlic; salt and pepper poker spareribs; the fish, tofu, and veggie hot pot; the Satay-cook beef, and the pork chow mein.   The food was actually pretty decent. The duck was probably one of the better ducks I've had -- the skin was perfectly crispy and they sliced it table-side for you. Then they take the bones and either sauté it up for you with chili or make a broth out of it. The Chinese broccoli was actually a little old (it was slightly bitter and harder to bite), but it wasn't too noticeable. The salt and pepper spareribs were ok, but we didn't understand why they were battered and fried when they aren't traditionally. Both the hot pot and chow mein tasted pretty average -- not awesome, but not bad. Also, we asked for hot chili oil and this was the first ever Chinese restaurant I've been to that doesn't have it. It's not a major complaint, but when a place says they specialize in Szechuan cuisine, the heat factor needs to be stronger than Sriracha.   All of this so far would have warranted a three-star rating -- but what happened at the end of our visit turned our experience from average to terrible. During our time there, the restaurant began to fill up with other customers and the difference in treatment and service between our group and anyone else was palpable. They were welcomed with happy greetings and polite banter, as well as follow-ups on service. I didn't really want to jump to conclusions, but it became pretty obvious when I went up to pay that they didn't value us as customers (at least as much as they valued their white patrons).   The two business men ahead of me paid and were treated with smiles and questions about service; but when it came to me, the man behind the counter changed his entire demeanor. His tone even changed -- that's how jarring this entire experience was. (Note: This wasn't the man who seated us initially; that man had grey hair and this man had black hair and was balding in the back, which he attempted to cover up with a comb-over.) When I said hello, he responded with the bill total. Then he went on to be extremely disrespectful to my grandfather when we were leaving. Grandpa went up to get toothpicks and attempted to strike up a passing conversation, but the man basically grunted and didn't even look up. When I attempted to ask to speak to the grey-haired manager that was there before, he actually raised his voice and told me that he was too busy to speak to me and actually waved his hand to shoo me away. He wasn't even busy doing anything that entire time; just sitting there waiting for people to come up and pay/ come into the restaurant.   I can't begin to explain how frustrating my entire experience with this restaurant was. Normally, I try to be a fair person; I give credit where credit is due and I always try to be aware of any personal biases that I may be projecting. I tried to look back objectively on what we could have done to warrant such poor treatment, but I honestly am coming up blank. We were a friendly group of three seniors, two twenty year-olds, and an eleven year-old; we were not loud, we didn't have complicated orders, and we ordered from their menu with no special requests or changes. We also ordered all at once and didn't flag them down for any other requests besides asking for napkins and hot sauce (which we wouldn't have needed to do if they had checked up on us at least once during out hour and a half-long service there).   Ugh. Just writing this makes me feel bothered again. I guess this place would be okay for take-out or if you don't mind dealing with a manager/host that's prejudiced, but I personally do NOT recommend this place to anyone and am glad that I won't be able to support this business ever again."}
{"text":"First time in and everything was great. The service was excellent and the food was too. We will definintely be back soon. So much better than the local buffet, everything was hot and fresh."}
{"text":"I give this restaurant 2.5 stars. The food is okay. The service is great over the phone, but they consistently forget sauces, side orders and even fortune cookies.  If other Chinese restaurants weren't so inconvenient to my location I probably would not order from them."}
{"text":"I had heard good things about Peking Garden, especially their weeknd lunch fare.  Xiao Long Bau, Century egg and pork congee, chinese dounghnut and Beef and Chinese Broccoli Rice Noodle were what we ordrered for our Sunday lunch.  All 5 stars!    Best part is the soya bean jello at the end for free!"}
{"text":"From the exterior you might not even think about giving this place a try... I, myself, was a little surprised when I moved back here about a year ago and Mom placed an order for us and said, hey, would you mind stopping and picking it up?  Sure thing, I thought.  As I arrived, I became quite suspicious.  How can this place be Mom's favorite Chinese Take Out?  Well - suspicions lingered temporarily as I paid up and packed it up.  As we opened it, the smells of garlic and hints of spice were so robust it got my mouth watering.  I ordered the general tso's as well as chicken and broccoli - the broccoli was perfection.  Crunchy yet cooked, just the way I like it.  The glaze on the general was simply sweet yet also a hint of bite.  Yum!  The lo mein noodles were fantastic and so was the rice.  And let's not even get started on the PRICE!  So affordable!!!  So, fear not, my friends... across from the Old Geauga Lake hides this gem, and it's definitely one worth tasting."}
{"text":"the outside..you would drive by ..the inside is run down..but the food is wonderful and they are so kind and helpful. We could not believe the portions and the price. plenty of food to share. The owner is a fabulous Cook and sadly last year his wife passed away and so he is one man show and shut down the dining in. He answers the phone and cooks the food fresh. Love the won ton soup and everything we had. now that dad is at RN home in Aurora we will stop in more often."}
{"text":"I came here with my brother and a friend of mine. We took the special number 2 for 3 people . We started off with the sweet corn carb soup and it was really good even if it's not real crab it still tasted great. Then they brought us the home made spring roll, also good but it would of been better if it was not for the Massive ammounts of oil that would leak out after you bite into it. The general tao was great, the best I had in awhile. The salt and pepper pork we ordered on the side was also great. Pekin beef and Pekin fried rice was the other 2 plates we took . Really not much bad to say if you looking for Chinese food and had a stream of bad luck looking for some good chinese dishes. Come here and you won't be disappointed."}
{"text":"Second salt and pepper shrimp tasted weird rotten almost & beef and broccoli was taste less. No flavour what so ever also there overpriced. The food not even worth it maybe you'd enjoy it if you have no taste buds, being 100% hones. Your order doesn't come with cutlery  and the delivery guy asked for a tip. NEVER ASK FOR A TIP I'll give you what I think you deserve plain and simple."}
