{"text":"Best pizza ever brings me back to childhood \"cornet pizzeria\"!!!!!!!"}
{"text":"You have to like that type of thick greasy pizza  It is awesome pizza although they can be inconsistent sometimes"}
{"text":"I absolutely love the pizza here! If I can offer any advice, ask for extra sauce, sometimes they don't put enough. They've been making pizza the same way for at least 30 years. I'm starting to feel old!!! Like most great pizza places... This one is also a bit of a dive. But it's good."}
{"text":"I really like Greek styled pizzas and Pendeli's pizza has been doing it right for the last 30+ years!  Came here with some co-workers and we opted for a pair of pizzas (meat-lover & pepperoni/cheese).  They were tasty, slightly greasy as you'd normally expect from a Greek styled pizza and the dough was just right. We didn't opt for the extra sauce and I felt that we should have, more sauce would have been a good thing!  ASK FOR EXTRA SAUCE!!!  Contrary to another review, this place isn't \"a bit of a dive\", it's awesome! It's your typical pizza joint with 'diner tables' and sections reserved for their stacked 10 foot high carton pizza boxes. What is most noticeable is the affection for Superman and Greece....  IT'S LITERALLY EVERYWHERE!!!!  Heck, there's even a Superman doll drinking coffee in a table booth!  This is a family run business, proud in what they are and what they do and that's a great thing. Service was very friendly, food was prepared quickly and we really enjoyed the service.  Price-tag is quite reasonable. Great value here folks.  All in all, a place I'd come back to for sure!"}
{"text":"I've been coming to this location all my life. Although, I don't live in Laval, Quebec anymore, I always make a point to stop here. Great pizza, my order is the All Dressed pizza, small gives you 4 large slices and it's fresh. Best part, it's like a layer of cheese and a layer of pepperoni, with a dash of green pepper and mushrooms. Love this pizza!"}
{"text":"This was a place which had a great pizza but the last 3 times has been a great disappointment. Maybe they changed the pepperoni or something else but its just not the same.  I used to go here every time I came from my long trips in china with the kids for dinner but now I go to Vimont Pizza. What a shame as the pizza used to be so good."}
