{"text":"I used to go here a lot and the coffee is pretty amazing.  They have, like manic coffee, the \"clover\" espresso maker that is apparently an $11,000.  dollar machine... their latte's better be good!    The two guys that work there, I believe their names are Rene and Chris, are really sweet but try a bit too hard to be super friendly all the time... maybe that's just something I would appreciate more AFTER I've consumed my morning coffee.   Looking forward to trying there gellato again this summer... YUM!"}
{"text":"As actual food was required before indulging in the pie crawl, Dale \"fellow meatatarian\" M and I found ourselves looking for a sandwich or something prior to digging in at Wanda's.   Pennlylicks is great. Very clean (big bonus points from me here), friendly staff and quick service. Wanting to leave as much room as possible for pie and caffeine, we opted to share the Faux Cubano panini. The perfect choice. A perfectly seared little sandwich (not your traditional lined pattern on your panini - but more of a check mark branding) with smoked meat, havarti and gourmet mustard. Paninis are served with thick potato chips.   The latte I had was one of the best ones I have had in a long time. The creamy milk to coffee ratio was perfect. Plus, it was uber hot, which I appreciate as hot beverages should take a layer of skin off the roof of your mouth when you take the first few sips.   Looking forward to going back and trying one of the cookies that Jimi S describes."}
{"text":"Great coffee! The staff were the nicest people I have found in Kensington and the coffee was actually good. I was very impressed, really want to go back and try some of their cookies."}
{"text":"I have only ever had the coffee here, I was intrigued by their coffee press, (Clover) the guy behind the counter was super nice and explained how it worked.  Loved the coffee I had, would definitely return.   Being that they are right in the middle of Kensington made it too hard for me to be interested in their food, there are way too many options nearby.  Only reason I don't give them 5 stars is that the place is very small, not much room to sit and enjoy your coffee."}
{"text":"Five stars for a vegan-friendly frappuccino that tasted as if it had been delivered to me from heaven.  Anybody who knows me well knows that I hold an insatiable and unsatisfiable lust for blended drinks, specifically, coffee-induced ones. Since converting to veganism, it has been proven quite difficult to find either a) an establishment that will use the soy milk in the blenders or b) a place that even has vegan-friendly drink mixes to BLEND the soy milk WITH.   I entered Pennylicks and was met by two friendly employees willing to help me. As far as I know, the drink that was made for me was vegan. (Sometimes I cannot be 100% sure, despite badgering the employees). I think they may have been a little befuddled by my excessive requests for soy milk.. but you can never be too sure. In some coffee shops, I've had the soy milk part of my sentence/order disappear into thin air and oblivion, as the ears of employees do not hear my request for soy milk as opposed to any other kind of real milk, which becomes apparent as I watch them make my drink with 2% milk.  Now, what is most important about this specific drink I devoured in a manner of seconds today is not even that it was vegan, but that it was the most delicious, blended, cup of divine tastiness I have had in months. Yum!"}
{"text":"I enjoyed Pennylicks the most when it was summertime and I was able to sit out front enjoying a latte.  They offer a couple of seats out front.  Inside it was very clean and felt open with the large window letting light pour inside.  The espresso drinks were tasty, and they offer a nice selection of panini, but I haven't had a chance to try those yet, so I don't know.  I did try the cookies they make - I had a gluten-free rice flour shortbread and a spelt flour cookie both with a little jam on top.  Both were tasty, not too sweet and obviously better for you than those made with bleached flour.  I preferred the rice flour one.  I kind of feel like this is a half review, in that I'd like the opportunity to go back and try one of their panini (like the Faux Cubano with smoked ham and havarti cheese).  But know that it is a very friendly place, with a nice healthy selection and ample seating in the back for a casual lunch."}
{"text":"Staff were friendly, the place was immaculately clean and tidy, and our $3 cups of coffee made on the Clover machine were huge and incredibly tasty.  I had an Ethiopian blend, and my friend a Guatemalan.    Although we did not sample, a small assortment of Dufflet pastries are available."}
