{"text":"* Erroneously  posted under ChickN'Deli (the previous name).*

Holy CRAP. This was the most memorable cougar bar I've ever been to. 

Thought it would be funny to drop in with some friends after reading the reviews here, but instead of just funny- we got astounding. Shocking, even. 

This is what happens when you go out everynight for 50 years. You look terrible. There was a 70year old man on the dance floor trying to pick up. So many busted out old ladies. When you say to me \"THIS is THE cougar bar\" - I'm thinking it is full of women like the moms on the OC. Well this is more like the moms of Trailer Park Boys. At one point this lady started dancing in front of three of us (who were at the edge of the dancefloor) for about 30 seconds. Real goofy dance. We're trying not to laugh (since we are gentlemen) and all of a sudden she stops - and quickly walks away. All of a sudden WHAM! The foulest odour we would smell all week. That's right, it was a classic Dance, Fart, and Dart (DFD). We had to leave after that. 

Bottles of Blue were 6$, not great - but so worth it when you're trying to clean the taste that should not be tasted out of your mouth.

Wow."}
{"text":"We chose this place because it was the only shaded patio within walking distance on a hot Saturday afternoon.  A great dixieland band seems to draw in every able bodied senior within a 5km radius, but they prefer the dance floor to the patio.  My draught was a bit on the warm side.  Onion rings were tasty, but seemed to manufactured without any actual onion.  Weird.  But weirder still were the Jerk Wings.  You pay a premium for Steve's secret jerk recipe, which tastes like nothing but beef stock to me.  A spinach salad was fresh.  They seemed a bit understaffed, judging by the service."}
{"text":"Went back the second time to have dinner with friends. We ordered their taco salad and their appetizer platter to start. The platting for the salad can use some work, looks a bit messy. The platter came with an assortment of deep fried goodies. The platter was good except the wings that came with it, which was different from the wings you order off the menu I believe (platter wings was very dry)

I personally like their entrees better. Their world famous wings in their thai source was juicy and flavorful, but not spicy enough. Pizza was pretty generic. Their pasta was bad actually, very generous on the amount of chicken in their dish. 

Overall, my second time experience was excellent. Definitely some improvements can be made in terms of presentation, however, this place can definitely satisfy your hunger any day of week."}
