{"text":"My Arizona Burger was cooked perfectly, and my wife was impressed at the quality of food for what is essentially a small sports bar. The waitstaff was friendly and responsive. 10/10 Would come again. Four stars because the menu is not too extensive but seems to be cooked well. My wife made a joke about a \"hidden gem\" so that comment goes in here too."}
{"text":"Great golf course! The staff is awesome, friendly and very helpful. The restaurant has good food and drinks. The most important part, the course is always up to par. They really take the time and put in the effort to make the course enjoyable. My wife and I play here regularly and have always enjoyed it very much. Keep up the good work guys!"}
{"text":"Once my 93 yr old buddy could no longer play 18 holes on a regular course, we started playing Peoria Pines every week.  We love it.  He always shoots under his age!  The course is always in good shape, and 18 holes can be played in about 3 hours."}
{"text":"If you get on their email list, you can get some GREAT deals on golf (20 bucks with cart, 30 bucks with free drink/lunch, etc).

I always start out the Spring by playing several rounds at Country Meadows. It's inexpensive, very well maintained and allows you to use all of your clubs, while really making you focus on your irons. It's not usually packed but I typically get tee times that avoid the elderly mob that is present at most golf courses until about mid-May.

The bar used to have great wings but they stopped serving them. Beer specials are still good, though."}
{"text":"Have your wedding here!  Nadine is awesome, the food is awesome, and the venue is beautiful. You get a lot of bang for your buck too. We just had our wedding there and would do it again in a heartbeat."}
{"text":"this is the worst place for service. from waitresses to bartenders.  If you are not a local and frequent this place good luck getting service.  Dont waste your time or money.   Will go back to deli nicer people."}
{"text":"Our favorite place! Staff is fantastic- Chuck, Nadine, Andrea, Lacey, Michelle all ROCK! Love the golf, love the food and cold beer and now we enjoy the ponies. Friday night karaoke is pretty interesting. Check out their website for deals and dinner specials. Then come on down, sit on the patio, enjoy a tasty beverage and lunch!"}
{"text":"This is a good golf course. I'll drop bullet points of highs and lows:
The Good:
Lot of par threes-help you focus on the drive, chip, and putt.
Greens were decently maintained in most areas.
Affordable. 

The Meh:
Tightly booked had the front 9 to a standstill. If you're not picky with order, jump to the back 9 and play smooth and well paced, then return to the front. We did. It was great.
Golf cart path was in great disrepair throughout.

What may piss you off:
Around 9:30 a staff member began driving onto each hole and setting up soccer golf holes...he wasn't rude and just interrupting play-but once everything was set up and I arrived at the next hole I found competing flags: the actual green and the soccer golf hole. This cost me a stroke on the 5th hole as I mistook it from a distance."}
{"text":"I get it. It is a par 63 course layout is fine conditions are fine. However, calling those greens \"greens\" is a stretch. Greens should not look and putt like shag carpet. They are so slow it is ridiculous. Greens that slow hurt your game for other courses."}
{"text":"This place was a hoot on Friday night!!food was good, Karaoke, and a pretty good staff!!! Very friendly place, staff and patrons alike, you will not feel out of place here!!! Anybody can go and have a good time! Food was good, Happy hour specials are great!!"}
{"text":"Great course with awesome deals! Went in for lunch after golf and had a GOOD burger. Definitely recommend for value and fun."}
{"text":"We played golf here the day after Xmas.  We had three generations, and they let us play as a six-some!!  We teed off at about 2:30, and since it was a cold day, there was nobody behind us, so we could play with no pressure.  

The fareways are in pretty good condition.  The tee boxes were a bit rough, and the greens could use some work.  But, for kids, it was great!  

The funniest thing was the stray pug that we came across on the 8th hole.  He was really cute and jumped in our cart!  We had to push him out though, as we didn't need to take a dog home with us."}
{"text":"Worst golf experience ever! Mixed with foot golfers. Group of 18 appeared after an hour and a half of golfing. Golf course unwilling to offer a refund. I have never golfed at a place where we have been an hour and a half behind. Don't visit this place if you want a good golf experience."}
{"text":"Staff is accommodating & friendly.  Chuck the owner is a Packer fan so this IS a Packer bar.....but don't get in the way of the off track betters.....as there is a significant number of horse betters and they can really take away from a good football experience. Food is decent bar food - no drink specials on game day but Chuck hosts a friendly raffle. We'll be back to use our golf Groupon but not for any football."}
{"text":"Had such a good time. Played 18 with a friend and if you go after 2pm the prices drop. Course is fairly easy and nice an open. Bar is cool and the staff are friendly. Oh and the food was excellent."}
{"text":"This review will not be useful to many of you but for diabetics, it just might. I went to golf and being diabetic, I brought my own cooler with some diabetics supplies, including insulin which needs to be kept cold. As soon as they saw my small cooler I was told it wasn't allowed. I tried explaining to them the reason for the cooler but no one in the pro shop cared. I showed them my insulin pump and an ID proving I was diabetic but no one cared. I was told that I'd need to get a cooler from them and any items I might require, ie gatorade, I'd have to purchase from there. Like I said, it will not affect most of the readers, but personally, I will never golf there again. You don't know what it's like unless you walk in that person's shoes and the staff at Peoria Pines couldn't care any less."}
{"text":"My wife and I played Peoria Pines today. There was some good things but there were definitely more of the not so good things....

The Good
The guys in the pro shop were friendly. The range and putting greens were in very good shape. The cart girl came around 3x during the round. She was super friendly/personable and deserves a raise. The back 9 was in good condition.

The Not So Good
The starter was a jerk. After paying for our round in the pro shop I was told to go out to see the starter to get a cart assigned. I walked up and greeted him, and rather than a hello back - I got a \"here's the keys to cart xx, sign here\".  From a first impression standpoint, I wouldn't want him representing my golf course. After hitting some balls on the range we can back to hole 1 and were partnered up with another pair. The starter approaches me and says for $5 if I hit my shot on the green I win a sleeve of balls. I told him I didn't have cash on me; he rolls his eyes and proceeds to walk away. So yes, jerk is the perfect description. 
With the exception of hole 1, the front 9 was in atrocious condition. Tee boxes were not flat, but in most cases mounds of dirt (very little grass) where you'd have to play the ball a few inches above or below your feet. I've never seen anything like it. The greens were in really rough shape as well, I believe hole 6 (par 3 w/water), half the green was mud. My wife actually commented that she had never seen a ball hop to a hole before by being putted. Furthermore, the cart paths - drive at your own risk. They needed a major overhaul 5 years ago, so imagine what they look, and feel, like now. 

I'm rating Peoria Pines 2 stars, only because some of the staff were good people. I feel that because holes 1 and 10 are off main entrance of the clubhouse and the putting green/driving range are in the same area, it's deceptive advertising as far as course conditions are concerned, since no other hole is on par with how nicely maintained those areas are. 
I don't really see myself coming back to play. Hopefully someone from Peoria Pines sees this and addresses the issues."}
{"text":"Had a great time playing foot golf with my four tweens.  Rented a cart so Momma could drive.  We didn't run into any golfers.  Very nice course!  Must golf here soon!  Bar food GREAT FOOD!  The AZ Burger is the BOMB!. Philly Cheese Steak is Really Good and I'm from back east and it's a Philly! I love it! Caesar chicken salad is also The Best!"}
