{"text":"Thank you Janelle W. for pointing me to a portugese chicken oasis in a desert of Indo-Chinese and Indo-Indian.  If there was such a thing as fall-off-the-bone chicken, this would be it.   The chicken is perfectly grilled, it just melts in your mouth. I like my chicken smothered in sauce (and this one isnt at all) so ask for extra homemade peri-peri sauce on the side. Its the key ingredient to having a good peri-peri (can you tell i'm in love with these words)experience.   A $50 bill gets you enough food for 5 people and that includes rice, parisien potatoes (awfully good), chicken kabobs and one full peri-peri chicken. I think I just died and went to frugal portugese heaven."}
{"text":"I ate here for lunch and had a quarter chicken with rice and cole slaw.  I love piri piri chicken and wanted to like the place but was quite dissapointed with how clueless the server was and how slow the kitchen was given that there were very few customers.  The chicken was ok but on the dry side.  The best part was that they provide their sauce on the side so you could use as much as you want.  I must have used about half a bottle to lather up the otherwise dry chicken."}
{"text":"Nando's...prepare to meet your maker cause this little diner is almost too good to be halal!   I've been running back to this place over n over after having discovered it not too long ago. They're chicken is as juicy, tender and flavourful as you'll find in any good Portuguese chicken churrasqueira in the GTA!    If Nando's set a bar, then this place lept 7 feet over it and kept running!   What makes this place really stand up strong with 'the best of' in this category is their peri peri sauce. Behind the scenes is a trainned chef who is actually from Portugal (who woulda thunk it?!?!).  The chef makes the peri peri sauce in-house and coming from a hot sauce connoiseur, i'd put that sh!t on everything!  It's not too strong n its got just the right flavourful kick to be finger-licking good!  I've tried the chicken kebobs, the chicken (spicy), the chicken sandwhich and each and every side. All of the sides were great, particularly the roasted round potatoes. As for main dishes, the chicken was tender and ever so good but that was no surpise...what shocked me the most was how tasetful and juicy the chicken kebabs were. I've never tried these from a portuguese restaurant before (marinated cubes of chicken breast grilled on a skewer) but they were really good as well.  While I even enjoyed the chicken sandwhich, i'd stick with the plate of chicken, rice and potatoes but that's just me.  For Mr. or Mrs. Sauga, this place is damn good and it's at an unbeatable price...the rest is up to you!  PERI PERI!"}
