{"text":"I stopped in to grab some lunch on my break and not all Asian cuisine restaurants make ginger beef the same or as good as the next. I was debating on getting lunch from this establishment but before I made my decision, I asked if i could have a small sample of ginger beef in which the counter attendant replied \"we dont give samples!\"  You lost my business and my word of mouth recommendation, I will make sure to let everyone know how poor your customer service is and how rude your staff are. I have been to several other food courts and didnt even have to ask for a sample they offered it to me!"}
{"text":"Ah Chinook Centre. How can it be so ridiculously packed on a weekday?   Don't you people ever work? Found myself in the food court at Chinook, and in between looking for likely escape routes in the event of a sudden zombie apocalypse (an involuntary reaction in crowded places) I searched for the shortest food court line.  I don't expect haute cuisine in a food court, in fact if the sludgy meniscus of congealed  sauce looks like it's less than a week old, I'm checking for Michelin stars.  There was no line for Petite Cuisine, which is worrying considering it's situated next to a Manchu Wok.   (.)  As it turns out for food court Chinese, it was actually pretty good. I had some kind of spicy chicken, that featured a little bonfire of red chilis on top, (that you don't actually get to eat, they're display chilis which are disappointingly recycled onto successive refill trays.) I also had a peppery beef and green bean creation in what appeared to be a black bean sauce, along with some perfectly cooked mixed vegetables.  I can't wax euphorically over the dish, the predominant flavour is, well, \"salty\", but the chicken dish had a little heat, and the beef was filled with MSG goodness. What I can say is that the food - and particularly the vegetables - was very fresh.  Seemed to be a pretty good food court alternative."}
{"text":"I totally did not expect to find good Chinese food in a mall, but I did at Petite Cuisine. I had won ton noodle soup, and it was savory, yummy, and as good as my mom used to make. The won tons were very tasty, the broth was a beef broth, and the noodles were satisfying. What more could I ask?"}
{"text":"The food was pretty blah. Tried the ginger beef and there was almost no flavor, the rice was bland as well. And the sweet and sour pork wasn't sweet or sour. This is not a place I would recommend or return to."}
{"text":"It's harsh for me to give a place one star after the first visit, but my chicken noodle soup bowl was so bad, I think I'm justified.  At first glance I thought it was someone else's order as it looked like tripe on a bed of fettuccine.  The protein material (playing the role of chicken) was some sort of stringy off-white substance that smelled a bit like boiled codfish.  The carbohydrate was provided by a mooshy flat noodle that didn't provide any of that wonderful mouth feel sensation that could have helped save the day.  The serving looked generous, but that image was propped up by a large pile of romaine lettuce at the bottom of the bowl. A few sprouts finished off the ensemble.  So, after just one visit, I struggle to believe that an establishment that would try to pass this off as chicken noodle soup couldn't possibly do other dishes well.  Maybe they have two chefs because some of my fellow yelpers seem to be impressed. I'll leave it to others to test that theory."}
{"text":"For a mall chinese food place this place is pretty fantastic. I've been coming here consistently for years and was my go-to lunch stop when I worked at Old Navy in the mall.  The best time to come is before te lunch rush when everything is fresh!"}
