{"text":"It's a decent vietnamese restaurant the quality and the quantity of the food is good although sometimes there is an unpleasant smell on the table which is not from the food nor the cooking smeell... that made my lunch experience alot less enjoyable... good restaurant but could be more clean ..."}
{"text":"A okay Vietnamese restaurant with quick service and okay food.  A bit pricy with the size of foods.  Average experience."}
{"text":"Service was horrible. Once we were seated and given our tea and menus we were completely forgotten about. After 20 min i got up and went to the cashier to have her actually acknowledge our existence. Food was ok very typical."}
{"text":"Phõ Saté is excellent! As good as any Chinatown joint! Service is fast and while English is not the wait staff's first language, it's easy to get your order in. The place is cavernous by noodle house standards and a little austere but it provides a welcome refuge of winter comfort food in the NW. Highly recommended."}
{"text":"My wife and I typically get take out from Pho Hoan Pastuer. They always get the order correct and have it ready in reasonable time.  The vermicelli is great but I absolutely love the satay beef soup. Probably the best I have had."}
{"text":"That should be zero stars, really.  Had eaten at this restaurant before, tonight had take-out for the first time -- filling in the salad rolls was so old they actually smelled bad upon taking the plastic wrap off, bean sprouts already black.  Would never risk the food here again."}
{"text":"Had the beef sate pho and they added way too much chilli oil - it was greasy and that's all I could taste. I prefer clean pho."}
{"text":"Food is always consistent, eat here for lunch often. Better overall flavor compared to many other Vietnamese places."}
{"text":"Fast, delicious food! I've been going here since it opened and have never had an issue with dining in or take out. Pretty standard fare, but well priced and good value"}
{"text":"Nice open layout inside which does not crowd diners together. Fast friendly service for take out but servers for sit down are mostly without personality, so minus one star. Good quality and consistently tasty food. I love the satay beef and the lemongrass chicken vermicelli. Our go to place for Vietnamese food."}
{"text":"We went there over a year ago and weren't impressed, but I can't remember why.  We gave it another chance. We went there about a month ago and the food was pretty good, no complaints.  The best part about the restaurant is that they're very quick. The food was ready in about 5 minutes and the service was friendly. The spring rolls were good- familiar tasty greasy goodness.  However this time when I got my takeout home there were a couple problems. I should've checked the order there because I'd ordered 3 vermicelli dishes and only got 2 - a misunderstanding. The salad rolls came with fish sauce, not peanut sauce ( I guess you have to ask for that extra).  I drove back to get a 3rd vermicelli dish and was disappointed with the taste. Most of the pork was burnt around the edges.  I'm not sure we'll go back. There are plenty of other better Vietnamese places pretty close by."}
{"text":"Don't get the vermicelli noodles we're over cooked and the chicken looked like the beef and vice versa. It also had and funky after taste. The spring rolls looked alright but lacked crunch. Basically if your old and lost your taste and need your food to be processed it's great. The satè beef was amazing on the other hand."}
{"text":"Good pho BUT: -long wait times. (30 min @ 1 pm Friday) -incorrect order (#1 instead of #3) -bathroom service slack (out of paper)"}
{"text":"Good pho, lots of seats, ordering is prompt and usually served fast. Best spring rolls I've had in a while. We come here weekly. Very reasonably priced also. Service is very poor though but if I ignore that I love this place."}
{"text":"It's our go-to place for Vietnamese in Royal Oak. Head and shoulders above the Saigon place. Reliable quality and good quantity. Never had a problem with the service."}
{"text":"This is my favourite Vietnamese restaurant in Calgary. The meat on the vermicelli dishes are very flavourful and juicy (tried prawn, pork, beef, chicken). The ingredients always seem fresh, as compared to other Vietnamese places. The tea also has a neat rice-tinged to it. Somehow, they are able to make pork good in the vermicelli dishes, whereas they are often quite dry in other places. One caution: you only need about one-half of the fish sauce they give you for your vermicelli; if you pour the entire bowl in, you will drown your vermicelli, and it will become a wet soup in the end."}
{"text":"Came here yesterday cz I was really craving pho. Got the number 45 small. Size were decent. The broth was pretty good. So glad they had the chilli oil too! Honestly makes pho that much better when u put chilli oil. Service was pretty good as well. Will be coming back here."}
{"text":"I'm always on the lookout for good Pho, so I decided to go out of my way to try this place. I started with the shrimp summer rolls ... there was not a lot of taste to them, but they were prepared nicely and the peanut sauce was spicy enough to at least give me something to taste.  This was followed by the steak and meatball pho and ... there was not a lot of taste to it, either. The plate of sprouts and leaves that came with the dish was a bit old and wilted, too. Now, they provide a variety of sauces on the table, so I was able to inject some heat and flavour into the bowl, but even at that I really didn't get a sense of good appeal. Also, the vermicelli had congealed into a blobby ball in the broth, and I had to pull and stretch it to get the right amount onto my chopsticks.  The service was ... well, about what you'd expect from a pho restaurant, actually. Nobody will ever win Miss Congeniality; but that comes with the territory. The food arrived quickly, which was a big plus for me, since I was on a limited lunch break.  Overall, I'd only go back if I was hungry, already there, and didn't have a lot of time."}
{"text":"Lunch was great and made quick. Under 10 minute wait. Service was ok but to be expected since it was take out. I find with take out at most places, especially Vietnamese restaurants isn't always the best service. The food was great and the portion big enough for lunch."}
{"text":"I had been to this Vietnamese restaurant a few times before and came this time for an early lunch before heading back home.  I always love a nice bowl of noodles!  Atmosphere: 3.5/5  Large and spacious, with plenty of seating in a comfortable, clean, and bright environment.  The location is also convenient with plenty of parking in the royal oak mall.  Food: 4/5  I had the grilled pork and shrimp vermicelli bowl, which was delicious!  Lots of bean sprouts and vegetables, and the grilled pork was marinaded well.  Fish sauce was light but tasty.  Overall a satisfying and filling vermicelli bowl!  Service: 3.5/5  Overall friendly and efficient service  Price: 3.5/5  Good  Overall: 4/5  Overall a convenient and comfortable environment to enjoy a nice standard bowl of pho or vermicelli.  I would definitely come back to try some of their other items!"}
{"text":"What is better than a bowl of pho when it is minus 30 out!? Nothing! We thought we would get to know this place a bit better rather than just driving by all the time wondering how it was. Glad we did! The building is large and newer. Typical Vietnamese decor, nothing fancy, tacky-chic. I was a bit surprised that a large bowl of pho was only $9! We will come back often for that price. Both of us ate, drank (water and tea) for under $20! (plus tip) LOVE free tea as not all places serve it. (Jasmine) Very casual and informal, you pay at the cash when done eating (they accept credit cards). Staff was very pleasant. We ordered the beef satay pho which to my surprise hubby loved as it was spicy and normally he is not into that. Plus he normally only ever orders chicken. The beef WAS delicious. The satay had a sweeter peanut quality to it (peanut based for anyone with allergies out there) but it was addictive. Just when you think you cannot eat one more bite of even liquid, you dive right on back in the bowl. The meat was perfectly medium rare and was very tender. I got my typical seafood pho with just shrimp. It was a very simple broth, very well done and came with all the trimmings of course, bean sprouts, greenery and if you want fresh chilies like I did, just ask and they will bring you some! Chili sauce and oil could be found on the table. We are anxious to come back on a warmer day to try the vermicelli bowls. The menu was your typical Vietnamese fare, lots to choose from. A must try when in the NW!"}
{"text":"The pho here is awful. I am Vietnamese and know what the soup is supposed to taste like, and even if I wasn't I'd still know that the soup here is disgusting. The beef pho soup is ALWAYS sour every single time I've come here - and I've come on multiple occasions just to try it out. It's so bad that I don't even eat when my friends want to meet here because I know the food will be terrible. I've ordered the avocado shake and that was horrible too. They can't even get the water right as every time I've ordered just a glass of water it smelled disgusting - whether it was from the cup or the water itself I don't know. Would not recommend this place to anybody."}
{"text":"Asked for their spiciest pho noodle dish, and got average watery soup instead. So many Vietnamese noodle houses in the city, but a fair number are so average as to warn a discerning customer away for good. So it is with this place. There are too many good Vietnamese restaurants in Calgary but better to do your research on Yelp, TA and google before having to check too many out to get to the good ones. But perhaps many of these proprietors have a secret. They know the Canadian palate that is satisfied with less, and, after all, 'we are still better than McDos and KFC, right?' Well, this average fare should get 1.5 stars for not being faithful to the famously delicious street food in their own country.  Ah well, stay away if you want more...?"}
{"text":"This place is well above average as far as Pho places go. The satay beef noodle has one of those peanut broths with a flavour explosion that stands out above the other places in town. The presentation is always on point; excellent vermicelli too. The spring rolls are as crispy as it gets (seems fresh too), and always delightful!  A couple drawbacks: not enough fish sauce with the spring rolls! You have to ask for an extra (I hate having to do that; makes me look picky). And you feel sooooo full after a regular-sized bowl; that, plus the unbelievable flavour leads me to believe their is a good dose of MSG. They confirmed they add it, but then again, so do all the other places I've been to (do they do that is Vietnam too?)  Very clean place; very clean bathroom; fast; tasty; good; been there many times; I'll be back again; enough said."}
{"text":"This is my favorite Vietnamese restaurant because it's  big, spacious and clean unlike other small cramped Vietnamese restaurants. The service is quick and they are very accommodating. If you want salad rolls instead of spring rolls OR if you want half the noodles and extra veggies they will do whatever you ask. Food has lots of flavor and portions are decent!!!"}
{"text":"We came here based on our friends' recommendation. As we're from Toronto, we didn't know that there are lots of pho places in Calgary. Alberta beef is so much better than what we get in Toronto.   Anyway, this is a pretty big, clean Vietnamese restaurant. I especially enjoyed their satay beef pho with peanut sauce. I think the average eater can handle the spiciness of this pho. The rare beef pho was not bad either - the broth was not oily at all.   Overall it's a nice pho place that's quite close to the airport."}
{"text":"Typical Vietnamese place. If you are in a rush and need to be in and out, go here. But even when I am in a rush, there are so many other places around that I prefer over this place.   Not that this place is terrible, but also nothing amazing either. Service is ok, nothing super friendly but nothing bad either. Food comes out pretty fast. I tried the salad rolls here but it didn't taste like there was much inside. The pho is okay, nothing special though. The only thing I really like about this place is that since it is on the newer side, the place is clean and very spacious.   If you just need a quick fix for Viet food and can't bother to drive to Crowfoot, I guess this is the place for you."}
{"text":"Unfortunately this fairly new restaurant has already gone downhill. The complimentary tea they serve now is disgusting- they still have Jasmine green tea but you have to order it. Our food the last 2 times has been less than great- in fact not even good. My meal came out with only one spring roll in the vermicelli dish and 5 minutes later they came out with the second freshly made spring roll which should have been served originally. Our search for a better Vietnamese restaurant is back on."}
{"text":"This place was my go-to at least once a week. I never had the best service there, but it was close to work and the food was always decent. One visit to Pho Hoan and the waitress spilt a whole pitcher of water on my lap and didn't even apologize. And most recent I was drinking my coke(that they bring you in a glass with ice and a straw) and what seemed like a worm came through my straw...I was already 3/4 done my soup when I pulled it out of my straw. I was absolutely appalled and disgusted. When I approached the waitress about it, she said it was a \"jelly\", but abruptly took the napkin I had placed it on away, never to return or apologize. When I didn't leave a tip, the cashier scoffed at me. Needless to say, I will not be back, which is unfortunate because it is so close to my work! In short, I will never be back!"}
{"text":"Horrible. Took one bite of my food, paid and left. Tastes like the grill has never been cleaned."}
{"text":"I wasn't a huge fan of this place. The service wasn't great, but I find that to be pretty common at Vietnamese restaurants so I didn't think twice. However, our salad rolls were NOT fresh. In fact, they were hard and included three, very small (previously frozen?) shrimp. My beef pho was good but my fiance ordered the beef satay and it was WAY too spicy - I've actually never had satay that hurt my mouth before. It was really cheap though so that's a plus. I wont be back."}
{"text":"I have eaten here many times and tried the vermicelli bowls, satay beef pho, grilled chicken and rice dish, tripe/tendon/rare beef pho, spring rolls, grilled pork chops, and more. I enjoy the satay beef pho on a cold night wth the fresh bean sprouts, hot pepper and lime wedges. Satay is peanutty, savoury goodness in every bite and spicy to boot. Too many restos serve satay soup that's watery and not flavourful. I judge the broth by it's voluminous, rich density and how it sticks to the rice noodles.   The usual condiments are set out on each table, hoisin, chili oil, sriracha, soy, napkins, chopsticks and spoons. Service is very fast as I've never waited more than 12 minutes from time of order to my food arriving. A few times, my order was ready in under 5 minutes. They have a wide assortment of drinks to choose from and several bubble tea flavours.   I much prefer this place vs the competition that is visible across the parking lot."}
{"text":"The broth for the beef sate I always order is to die for! They add curry and peanuts which is not only addictive, but a little different which I like. Highly recommended!!!  The appetizers I have tried have been average, except the fried onion which is delish! Friendly & fast service, clean inside."}
{"text":"Seated immediately.  Tea came promptly without having to ask and was tasty w light rice taste.  Fast and friendly service.  Onion cake was nicely done.  My beef and flank pho had a great broth, beef was nicely medium rare, flank was perfect.  Iced coffee was nice and strong!"}
{"text":"Used to come here often since I live around the area.  My friends and I were treated so rudely the last time that we never returned. There seemed to be some argument in the kitchen with a lot of yelling. The female owner took it out on us by rolling her eyes when I asked for a water refill. She ignored us whenever she walked by and when we went to pay, she put it all on one bill. I asked politely for her to separate the bills and she glared at me with no reply?... After repeating myself four times she ripped the machine out of my hand to cancel the transaction and then split the bills incorrectly. We just paid because it was such a hassle to get her to reply. After we paid, she walked away without saying anything.   There are so many vietnamese restaurants out there, I don't know why you would want to try this horrible place."}
{"text":"this was my first meal in calgary and had no idea that pho can be a big deal in cal-town!  coming from philly, we experience pretty solid pho.  i held no expectations coming to pho hoan.  though, after a whole morning of travel, my appetite wasn't exactly robust.  i still wanted to try this calgarian pho.  under chef's specialties on the menu, something unheard of caught my eyes.  \"Satay pho\"! without hesitation, i just ordered that and waited to be surprised.  the soup was dark covering everything the bowl was holding.  tbh i wouldn't say it was an appealing bowl of pho lol BUT i could definitely smell the strong aroma of pho AND satay! lol if you're a fan of this asian concoction, i would suggest giving it a try.  and of course, it did not disappoint!   my favorite part was the meat in the pho though.  it was super fresh! and unlike any pho tai i've had.  pho hoan didn't use \"tai\", it wasn't the thinly sliced ribeye i was accustomed to.  rather, it was like small pieces of beef, still relatively thinly cut and just melts into the broth.  the temperature of the soup cooked the red meat to an adequate middle rare.  if you prefer something else, you might have to request for pre cook meat.  i really enjoyed it!  service was so-so, language barrier problem seems pretty common.  best to be decisive and point to what the menu says.  overall, it seems to be a solid pho spot! i would return!"}
{"text":"Stumbled upon this restaurant.  It's located kitty corner from Walmart in Royal Oaks.    Appy:   Onion Cake - looks like 2 really big onion rings, quartered.  Delicious with a faint taste of green onions.    Entrees:   Beef Flank with Tendon Pho - the beef soup is so light and not at all oily and comes with a plate of fresh bean sprouts, green mint leaves, a lil' red Thai pepper.  Very tasty.  Great, tender peieces of tendon with the beef slices.     Grilled Beef with Spring Roll Bun - Good size of vermicelli with grilled beef, spring rolls and lots of finely shredded vege.  The fish sauce condiment added lots of flavour to the bun but I like to add more hot sauce in to spice mine up!    Grilled Chicken and Prawns on Rice - Good sized plate of rice with pieces of Grilled Chicken and Prawns (no shells) and a side of some fresh veges - delicious.  Comes with the fish sauce condiment.    Dessert: 3 Beans with Coconut Cream Drink - Love it!    The restaurant is fairly large, very clean, with a bright & airy atmosphere.  Service is pretty good.  Prices are very reasonable."}
