{"text":"The pho soups that we ordered lacked flavour and left us unsatisfied.  The shrimp wrap was mostly filled with noodles.  Been to many other pho places..this was probably the worst.
The host and wait staff however were fantastic"}
{"text":"Have been eating at this restaurant many times. Cheap and cheerful beef noodle soup on a cold day and something quick. The only dish I did not enjoy was the Pad Thai, rather have it at a thai restaurant. Everything else on the menu are worth a try. During busy meal times, customer service can be slow."}
{"text":"I love this place!
The restaurant is clean and well taken care of, the food is flavourful and well priced and they are always willing to accommodate their customers. Being from East of Oakville I would say this is by far one of my favourite pho places and I often go out of my way to pick it up on my to Mississauga. Great spot!"}
{"text":"There aren't many pho places to choose from in Oakville, but this Pho Mi 89 is pretty good. I've been here a handful of times now for dinner with friends and haven't gone wrong. Prices are reasonable, service isn't too bad and portions are decent."}
{"text":"Food is fresh and authentic.  It feels \"home made\".

The menu is extensive with over 100 items to choose from.

Prices are very reasonable so trying new items from the menu is an option as risk is low.

I usually order the grilled chicken and pork rice plate and substitute the rice with salad. This plate is around $7. Less than the price of a fast food item at a hamburger joint and far superior in nutritional value and taste. 

Mango milkshake around $3 is made from scratch and real fruit.   I always order it with no sugar added and they've always made sure to accommodate my request!

I've also tried the deep fried whole fish.  It was great and the wonton soup - delicious,  served at the right temperature and generous portion considering it's listed under the \"snacks\" section of the menu.  Lots of meet wontons in the soup.   Price around $6

Service is quick and courteous.   For such  affordable prices this place is a great bang for your buck.   Clean and fresh.   No fear of getting food poison or disgusting experiences -- as it had being the case at another comparable price range  Asian restaurant downtown. 

All in all I've become a regular of this place and keep on coming back every time I'm in town for the past 2 years."}
{"text":"Average pho. Terrible service especially the skinny server who has the worst attitude. From the time we were seated, he was rude and unprofessional. We asked for extra condiments and he kept on complaining loudly to his co-workers in front of us. Only visited this restaurant because of its location. Probably will not go back- their pho is not good enough for me to endure this kind of behaviour"}
{"text":"My favorite Pho place in town. Great pho and a great variety of other options as well. 
Fast service and great for large groups of people as well."}
{"text":"Had the won ton soup and vermicelli chicken with spring roll. I was pleasantly surprised for an Oakville restaurant! Broth was great. They used the right vermicelli noodles and the fish sauce was aromatic. A good amount of grilled chicken for the dish, though a bit too fatty for my taste. But for 7,50 definitely will return. Service was quick and will become my go to Vietnamese when in oakville."}
{"text":"Quick service and food delivery.  The pho is great here.  Reasonably priced as well.  Great for eat in or take out."}
{"text":"I usually dont take the time to write reviews but for this place I had to go through the trouble. My family and I were openly discriminated against by the staff. We waited to get tea, then the menu was never given to us. Other people walked in and were immediately tended to...while we sat there looking at each other in disbelief. We called for his attention and left after we continued to be ignored. Its 2016 and I cant believe we were ignored because we're dressed in our traditional clothing."}
{"text":"Went here yesterday. Decent food, cheap prices. But that's not why I'm giving it a one star rating. The staff is rude and horrible! Boyfriend ended up ordering fresh spring rolls to wrap yourself, while the staff is laughing and staring at us the whole time making us feel sooo uncomfortable! Reality check: don't stare at customers while they eat! Also don't proceed to laugh at them, point at them and speak in your language like we don't know your making fun of us! And if you see a customer struggling, maybe you should offer some help!!!! Very disappointed because the food was good, but the staff was bad!!!"}
{"text":"2.5/5 (rounded up for service)

Good, but not great pho. Stock broth was a bit bland and the beef was way too fatty. Unfortunate as there's no other real pho options in Oakville."}
{"text":"Ok, gave this place another try.
Sadly the cilantro was missing AGAIN!
Goodbye forever Pho Mi 89  :'("}
{"text":"Hit and miss. When they hit, the broth is sweet and flavorful with lots of ingredients in the pho  dac biet cooked just right, and supple noodles.

When things go wrong, the broth is over salty and loaded with you know what, meat is overcooked and tough, noodles come in one giant clumpy ball, and the garnish is brown and wilty. 

Service is typical of a busy Asian resto. Floors are sticky and bathrooms are grungy as you would expect, nothing exceptionally good or bad, but probably below standard for any inspections. Would think the food would be tastier based on the bathroom cleanliness, am I right?

Overall, I eat here because there are lots of meal options from staple Viet to the Chinese and Thai street foods. But, mostly I come here because I live nearby. 

The Oakville crowd seems to love it tho since they clearly don't know better."}
{"text":"Great pho, we went there a couple of times, medium size portion is generous with lots of noodles and meat, served alongside with sprouts and basil. It is a busy spot and we truly understand why."}
{"text":"Cleanliness and Friendliness are KEY!

This is my go-to Pho place.  Main reason is that it's probably the cleanest pho place I've been to!  Yes, that's right, it doesn't have the typical oily filmy greasy walls and floors that most pho places do.  Even the washrooms are nice to use!

As previously mentioned, the portions are huge for a low price.  Unfortunately the taste isn't always consistent.

While you're there, you HAVE to try their mango shakes.  If possible, try to get Henry or the lady to make it for you - they make it best.

As for the service, unfortunately it isn't always that great.  I try to go there only when Henry is working.  He is THE BEST!!!  He's very quick and efficient and he's sooooo incredibly friendly!

I like this place so much that I even had my wedding rehearsal dinner here!  We spoke to the owner and he allowed us to reserve half the restaurant in order to fit our party of 75+ people.  Our only condition was that Henry would definitely be there to help serve. By the end of the night, everyone was well fed and satisfied.  Everyone enjoyed themselves the food, and the staff.

I give the restaurant 4 out of 5 stars.
And I give Henry a 5 out of 5 stars!"}
{"text":"This place offers your standard Vietnamese menu options (springrolls, fresh rolls, soup noodles, rice dishes, vermicelli dishes) and also has a large Thai selection.  I've tried several Vietnamese dishes and Thai dishes,  Favourites include the extra large soup noodles to share (excellent value) and the pad thai (large portion, one of the better pad thais in the world).  Some of the other Thai dishes were only so-so, but I like that I can order non-pho dishes.

Tonight I was feeling adventurous and discoved another section on the menu: eel and frog.  When I asked the secretary of our party (you write your own order) to scrawl down the \"frog's legs with onions\", she thought I was joking.  When it comes to amphibians, I don't joke around.

If you've never had frog before, do not be afraid.  It's delicious!  \"Tastes like chicken!\"  Seriously, it does.  Only the meat is much more tender.  I think I've only ever had it deep-fried, which automatically makes anything taste good.  The batter was a little heavy and the bones were a little tricky to deal with, but it was fun to try something different for a change.  

We shared pretty much everything on the table, including fresh rolls, crispy spring rolls, soup noodles, and a rice dish.  The soup noodle dishes here are full of contents (not just broth) and definitely fill you up.  The pork and chicken that was served with the rice were very tender and tasty.  The highlight of my meal?  The mango shakes!  4 out of 5 of us ordered our own tall shake and we almost ordered a second round because they are just that good!  I believe they are under $4 too, which is excellent value for so much deliciousness.

Great service, great prices.  Some people were celebrating a birthday with food long birthday candles (not exaggerating).  It's that kind of place.  Lots of regulars, which tells you they are well-loved."}
{"text":"Pho was nothing special, I've had better. Sauteed Vegetable plate that the BF ordered took 25 mins to make and was over priced for the small portion. Overall, It was ok."}
{"text":"Yum! Staff was friendly and the food was amazing. This place is so busy! Can't wait to come back and have the 89 special again."}
{"text":"Nice food, cooked quick.
Ordered spring roll, meatballs and shrimp on vermicelli. Under $10 makes it well worth it. 
Place was quite full but no service issues. Vermicelli has little flavor as expected, and the sauce provided sinks to the bottom; not an even flavoring. The meatballs also didn't taste great but the spring roll and sugarcane shrimp were great."}
{"text":"Fast and delicious food, very quick and efficient service. Solid menu and overall one of my favorite spots in Oakville. And super affordable. This place is stellar and I highly recommend the 533 and 207 if you want a traditional pho dish."}
{"text":"Been coming here very frequently since it's close to my work. Service is mediocre, obviously family run. Took awhile for them to have a small conversation with me. However, I always get my food within 5 minutes or less.
Food is not spectacular, but is basic viet food. 
Overall, it's not memorable. Good as a casual backup lunch option."}
{"text":"This is my go-to pho restaurant in Oakville. (I should also mention that this is the only pho restaurant I know of in Oakville as well.) Jokes aside, the food is delicious - particularly the broken rice with pork chops and fried egg dish and the Hu Tieu My Tho noodles. Fair prices for good portion sizes. The best is the mango milkshake! My only complaint is that when it is busy and if I stop by to order a mango milkshake to go, they usually tell me it's sold out (which I doubt). Can't say this stops me from coming back though. Food is too good to stay away."}
{"text":"We live in Oakville and this is a good place to go for pho!  I usually order 201 which is the house special pho. I like the mix of rare beef, tendon, tripe, and beef balls yum!  My hubby has the rare beef noodle soup simple and plain.  The pho is consistently good.  The jack fruit shake is also refreshing.  

The fresh shrimp rolls are 50/50.  Sometimes they are fresh but sometimes they have been made in advance and have sat there for awhile.  The rice wrapper texture gives it away each time.  

Bottom line where else can 2 done for $20?  Excellent value for money and the food is as good as pho in Toronto  chinatown or Mississauga viet places."}
{"text":"We sat for ten minutes ready with our order and with the five people working and the restaurant half empty no one would come by to take our order. Eventually, we just took our order form up to someone and handed it to them. The table next to us told us they had the same order issue. 
At least the food came out fast. Food is just alright. They didnt have cilantro or fresh chili peppers. 
Bottom line, I'd probably never come back."}
{"text":"Nice and spacious restaurant with a large selection on its menu and good prices. Not the best pho I've ever had but it was satisfactory. Their quick service and good prices make them a place worth returning to."}
{"text":"Headline: Good pho for Oakville, bad pho for anywhere east of Oakville (i.e. Mississauga, Toronto, Richmond Hill, etc.)

Likes: It's clean and the only decent pho place in Oakville. The vermicelli/spring rolls/meat combos are okay.

Dislikes: For your standard pho, it's about $1 more expensive than most places and the pho is full of MSG. Also, their beef stew pho is so fatty that it's barely edible, yet my mom likes it.  I can't stand fatty meat.  Also ordered pad thai once and it was so bad. There was no taste to it, didn't taste fresh, and felt like a little kid experimenting on how to cook.

Verdict:  Your 2nd last alternative to Mcdonald's or if you really crave a pho fix.  Nothing special."}
{"text":"Standard pho fare.   Don't expect to be full when you leave.  Rice dish with beef was ok, beef very thing cut and spread out which makes it look like more.   Standard pho offering.    Was clean and busy, lots of seating but it's constant stream of customers in and out.  I would return for simple pho."}
{"text":"So disappointed, especially since I was looking forward to trying this local restaurant. The food was not at all impressive.  We tried the seafood udon, shrimp and squid stir-fry and duck congee.  The sauce on both seafood dishes was very coagulated and bland.  Whatever they used to thicken the sauce gave me an upset stomach.  The congee was OKish - but seriously, it's rice, broth and a few pieces of green onion and duck - so, pretty hard to screw that up. Then there's the service - it was practically non-existent.  There were only 2 people covering the entire dining room - taking orders, serving, bussing tables, and cashier duties.  Forget about water refills.  And halfway through our meal, one of these guys wheeled out the mop and pail and left it in the corner of the dining room!!!  I won't be returning."}
{"text":"This Vietnamese restaurant is absolutely splendid. I order takeout from them at least once a week, I always go for the 402 (vermacelli with grilled pork and spring rolls). It is consistently flavourful and satisfying. Highly recommend."}
{"text":"Excellent pho, large menu, affordable prices, and good service whenever I've come. Couldn't ask for anything more. 

Make sure to try the deep fried spring rolls."}
{"text":"Pretty straight forward. The service is fast. Good portion size . Price is fair.  Good selection on their menu. I'm pretty sure everyone can find what they like on it from noodle, rice, vermicelli, pho soup and more."}
{"text":"These are just some of the few things i hate about this place:
Food is meh 
The servers are not friendly they just throw ur plate in front of u and disappear till u have to pay them 
They are very cheap with the ingredients 
The server is mopping the floor and dusting up while ur eating next to ur face 
I mean come on for gods sake ppl are still eating do ur mopping later!! 
The only thing they good at is when its time to pay the bill! All smiles and sh*t"}
{"text":"They make it fast and serve in large portions. Big bowls, lots of noodles. 

Skip the small & med if you are hungry and get the large instead. Prices have gone up since opening. Ive been to this location about 9 times this past year. Doesn't matter how you want the pho, they price they meals mainly on the size of bowl. Prices of the small went from 5.50, 6, now is 6.50. Larges are 8. 

Plenty of seating, lots of parking spaces. 
Service is great. Theres lots of staffing, meals arrive usually less than 7 minutes. 

Gave this a 4 star because they raised the prices without changing anything since day 1.

Recommended."}
{"text":"Ratings:
Food: 9/10
Drink: 9/10
Service: 7/10
Value: 9/10
Hygiene: 8/10
Aesthetics: 7/10

If you're looking for Vietnamese food near or around Oakville, this is  one of the best places to go. The food here is good and it always hits the spot.

My go-to dishes are the grilled pork salad rolls: item #1, the house special pho: item #201 (unless you know what you like you may want to avoid this and go for something a little less 'adventurous'), and a drink; either the iced coffee #962 or an Avocado shake #979.

Like most Vietnamese restaurants, the cost is pretty low, around $7-8/entree. They don't skimp on the meat and the quality is generally good.

The decor is simple, so don't expect anything fast. It's pretty clean inside. It's pretty easy to get a seat except on Sundays so if you go during the lunchtime rush, try to go a little earlier if you want a seat. That being said, the turnaround time is pretty quick so you won't be waiting long.

The service here is a hit or miss, most of the time it's alright, but there have been a few occasions where I've had to remind the staff about something that I asked for 15 minutes earlier. So just be warned in advance.

Overall, a good place, and they know how to make the food right. Would definitely recommend."}
{"text":"Your typical Pho restaurant and surprisingly in Oakville. They serve huge portions for a low prices and are generally fairly priced which is a nice change if you compare the prices from Spoon and Fork just up on Trafalgar. The food comes to you within 5 - 10 mins of ordering so you're in and out extremely fast!"}
{"text":"Well we came here tonight cause I read the reviews from my fellow Yelpers and it's pretty close to home !
So .....we're do I start !?!?....
Well let me say I don't know why everyone reviewed this place so high lol....maybe in Oakville there isn't very many Pho places , hence my oakvillians  don't know a good Pho place from a hole in the wall , 
Cause I can sure tell you this place is no more then a 
3 Star at best ! And I gave it a 2 star cause of our order .
So i got a tendon and tripe Pho ..decent ..good flavor and a order of fried tofu 
But .....
My other half got the Chicken Pad Thai and it took them 25 mins to bring it out to her ....ok it's busy I get it but 25 mins after I get my pho . .fine ..BUT wait ..the worst part is she gets her Pad thai ....and something that has never happend to us at any other Pho restaurant in the city ....the Chicken in her pad Thai was pink yes ..raw ..undercooked .....totally unbelievable and unacceptable....so trying to get our waiters attention 5 mins later we do...and again there busy ....so she takes it back to the kitchen and again we wait ..15 mins ..finally get it back and then notice there's only 6 pieces of chicken lol ....oh well at least it's cooked ......
Oh our deep fried tofu tasted burnt ...
So anyways ........I wanna say to all you Oakvillians if you want good PHO take a lesson from us mississaugans! Come ...cross the border and try some real Viet  thai cuisine were you can get better quality .
Rating this place for me as follows ....

Ambiance & Decor 7 out 10 
Service.                     7 out 10
Food.                         5 out 10 
Price.                         8 out 10 
Over all........ there's way better places !!!! 3 out 10 !!!"}
{"text":"I would have given this place 4 stars last year, but there's something different this year that has downgraded it to 2.5 stars; -1 for service, -.5 for the slight drop in food quality.

If you're coming here for the first time you can rest easy as the food is still good, but try not to be too surprised by the service. I believe they aren't consistent in their training, or assumed some common sense. 

Example: if you're carrying around a tray of tea cups, and one of the cups spills half their contents onto the tray, don't serve the half empty teacup to me. I had to ask at the end of my meal for a refill as you never seemed to care, and I had to clean my table with napkins as the bottoms of our cups were dripping everywhere.

Example 2: my partner and his parents got their food served quite fast, but mine took 20 minutes to arrive. I was so sure I was forgotten, but when we waved down a server he said my food was coming. It's very awkward sitting there while everyone else eats.

Example 3: when we asked for the bill and you say OK, but then leave us sitting there for 20 minutes waiting, you should have just told us that you'd prefer we walk to the cashier to pay.

Not a big deal, but this place has terrible customer service. It didn't feel like this the other times I've visited, I'm suspecting new management but I'm not sure about that. Food is still good, but my crispy beef vermicelli had way too much batter on it and therefore became too salty.

If I came here for the first time I would just chalk it up to it being the personality of this restaurant, but I know better and I'm disappointed. I'll definitely come back, but I hope they work on encouraging their staff to do better. I'll also probably be ordering something else, and speak up for myself a little more."}
{"text":"This place was pretty good. Pretty basic, simple pho place with a lot of menu items. If you're looking for a huge menu, this is a good place to go. Came here with some family while on a trip in Ontario. I personally, got the shrimp pad Thai. It was pretty good but be warned, it comes in a big plate. My mother ordered some pho and I tried it. It tasted like a basic regular pho. Nothing too special (but it was still really good). I ordered some boba tea but it didn't come out until I was about halfway through my meal. I'd recommend this place for anybody that likes pho in general and a large menu."}
{"text":"Good Pho but out of boba tea bummer :("}
{"text":"Food was great. Place was clean. But jeez do they need work on their service. No one introduced themselves as our waiter so we were confused as to who we were supposed to order from. We flagged someone down who took away our order, no introductions when we ordered neither. Food came pretty fast, and the waiter was never heard from again. No one came to check on us regarding whether if we thought the food was OK or if we needed anything else. Oh I had to go to the counter to ask for water, requested 2 cups of ice water and received 1 cup of steaming hot plain water. I asked for a second cup, emphasizing iced, and again came a cup of plain steaming hot water. What was I supposed to do with that? Overall poor dining experience, but at least it tasted good and was cheap."}
{"text":"The serving staff were super nice, and the Pho was so tasty and super affordable too. Will be going back!"}
{"text":"We just had to walk out of there.  After 20 mins of sitting and others who entered after us getting served and getting food I walked up to hand in our order.  The paper sat on the counter until I asked again if our order had been place.  The man behind the counter proceeded the tell the waiter to F@&$^n get to work! The whole restaurant turned in shock.

Been here numerous times in the past, but they're obviously having staffing issues.  We left, were no longer comfortable."}
{"text":"Horrified of their service.

We were surprised with this bug in the soup as we were halfway through our meal. We stopped eating immediately and brought it up to the server. She said she doesn't speak english and we asked for the manager, who was also working in the dining hall. After waiting twenty minutes and asking multiple other servers for the bill (we wanted to leave immediately as we were feeling sick), we were just told to wait as the servers attended to other customers in the dining hall. After standing at our table for twenty minutes, disgusted, I finally walked up to the manager and asked for her attention. She brushed me off and walked right past me, multiple times. Other customers were advising me just to leave at this point. I confronted the manager and showed her the bug, at which point she told me to \"just leave.\"

I understand people can make mistakes but the service we received after finding a bug in our food was beyond reason. I strongly advise against eating at this restaurant."}
{"text":"A most excellent Pho Restaurant. I usually get the 405 (grilled pork with vermicelli, spring rolls, and shrimp on a sugar cane.) Totally scrumptious. The pho is also yummy, especially during winter. It really warms you up. My favorite pho is the chicken pho with beefballs. Try asking for sate (sa - tay) sauce from the waiter. Its this  dark blend of hot sauce that they don't serve unless you specifically ask for it.  Stays Real tasty. It tastes good with everything i have tried there, including their chicken and pork on rice dishes. MHMHMHMHHMHMMM! 

The service is prompt, and the younger dude (don't know his name) recognizes me cause i'm a regular. So i get good service, which is awesome! Also...UNLIMITED NAPKINS AT YOUR T ABLE FROM A DISPENSER! AMAZING!. GO HERE ASAP!"}
{"text":"Terrible service!
We ordered a total of 6 dishes and only 3 came back to us after 1 hour of waiting. The staff were very disorganized, lack courtesy and no one bothered to check on us for the entire duration.  I got fed up and walked up to the counter requesting to pay for only the meals received, but the man replied and said that fish usually take awhile to cook. WHAT ABOUT THE Pork and Chao Mien dishes? don't tell me those take hours to cook too! Such a big disappointment, never going back here again."}
{"text":"Found thread worms in-bedded in cooked pork meat over vermicelli- staff said it was lemon grass however I Cook with lemon grass and the threadlike hair worms were too fine and imbedded within the meat to be lemongrass. Very disappointing experience."}
{"text":"Tasty and affordable food. Slow service though. Whenever I come here to get food, I always have to wait like half an hour or fifteen minutes. The longest that I have had to wait was 1 hour. If the service would be a bit faster, I would come here more often."}
{"text":"This is my go to Vietnamese restaurant whenever the craving strikes. I thoroughly enjoy the fresh shrimp rolls, pho soup and the vermicelli dishes. 

Prices are very reasonable with the average dish being about $8 and the service is very quick. Similar restaurants charge double for the same dish and most of the time don't taste as good. It's the perfect lunch place if you don't have alot of time. Their take out is also speedy and always accurate based on my experience. 

A nice touch is the cup of tea they bring you as soon as you sit and the assortment of condiments they have at each table which allow you to spice and flavor your meal to your own taste."}
{"text":"You need to try this when you are sick.I had been very sick with chills n fever my friend took me their n ordered Chicken soup small which is way more quantity than u can take.U knw what it helped in relieving fever in couple days after that.Great vietnamese food."}
{"text":"This restaurant is part of the Pho Mi 99 chain despite the '89' in the name. The menu is exactly the same as the others. 

We've been coming to this location since they opened several years ago. 

The food is consistent with the other Pho Mi 99 restaurants. Service is quick and efficient and staff are friendly. 

Our one beef about this location is that they serve the hot tea in plastic cups rather than china. 

Our favourite menu items are the rice dishes with grilled meats and steamed egg and the vermicelli dishes. The pho broth is also quite good."}
{"text":"My Boyfriend and I have been here a handful of times. The service is always terrible, but the food is good and the price is right. 

We decided to bring my two sisters tonight, we pre warned them of the terrible service. 

Well lucky us, the service was an all time low. After almost an hour of waiting we asked the waitress where our food was. She said she would check. She returned with our order and said \" we didn't do, can you wait 15-20 minutes\". We agreed, when the food finally arrived.. They had run out of some ingredients for the pho. Brutal."}
{"text":"Good but most of the waiters do not speak english so it is hard to ask for stuff but they are kind and make the effort to understand. The food is overall good. They are quick."}
{"text":"We ordered a meal and the portion looked smaller than the picture. They \"forgot\" the fried egg on the bed rice, and we asked them to take it back, but they came back with a broken egg on the side of the rice.  

Deep fried spring rolls were fine, just didn't like the feeling that they were trying to rip us off for the other order."}
{"text":"This is the place with amazing service and tasty food!  Their pho broth is super flavourful and grilled pork with vermicelli is sooooo good!  Definitely recommend this gem!"}
{"text":"I've been going here for the past 5 or so years and the food as been just as great in that time.

The staff are friendly and efficient, though you always receive your drink near the end of the meal, but that's Vietnamese restaurants for you.

This location (among other Pho Mi XX's) is my favourite for the Iced Vietnamese Coffee, only downside is the fact that you can't order it 'light ice', still the coffee quality is great and well condensed milk is always great, no matter the brand.

Though if you're not used to Vietnamese Iced Coffees, it's something akin to an intense brew with condensed milk (sweet thick cream), but beware that it's the same as 4-5 redbulls.

I'm less of a fan of the fried rice here, but the BBQ Pork Chop/Chicken on fried rice is one of the best out there, second to Golden Turtle.

My go to and favourite is the Chicken Pad Thai, it's a great pad thai. Probably my 3rd favourite in Mississauga. It's got slices of peppers and onions, decent amount of chicken and great flavour. A bit plain, but still great. It's something I could eat almost every day and be happy with. I also think there's no MSG in it. Which works out well for me.

Overall the quality is always great time and time again!"}
{"text":"Had a bun bo hue. Not, very authentic. Salty and a little watered down. 
Mediocre service. Also tried Vietnamese rice rolls. 2 out of 5. Meat inside wasn't great. Rice noodle.wasn't smooth. Would consider going back."}
{"text":"This is probably the best pho place in the Oakville and Burlington area. Clean, and good food. The food is always consistent and they give good portions. Only reason I didn't give them 5 stars is because they tend to get busy and have messed up my order a few times."}
