{"text":"Generous portions. Fast service. The food is standard fare - not spectacular but not bad either. When you factor in the reasonably low prices for dishes, the quality seems more than adequate.

The real surprise is how big the place is. Seeing it from the street you might mistakenly think it seats six and is a bit run down. But when you get inside, it is roomy and clean with a nice family atmosphere. The clientele were definitely more affluent than I expected for that strip of King West."}
{"text":"Honestly, this is the best restaurant west of Dufferin. Or, at least the only one I will eat in. 

I typically grab the good ole 403 (Grilled Chicken with vermicelli), which is shockingly cheap and very tasty. The 404 (insert web geek joke here) is also a great choice, same goes for their phô.

The decor is very Retro-Parkdale... in a funny way it adds to the atmosphere and complements the coin laden golden Buddha resting on the jade green cash-out island in the back. 

King west / liberty village folk: Don't be afraid of this side of Dufferin - this one is a gem."}
{"text":"I frequent here for lunch with my colleagues. Nothing warms you up like a bowl of pho. This place is nothing spectacular but it delivers what you expect. It's not as good compared to the other two on ossington but it's between this and Saigon in the area."}
{"text":"This place is a must avoid. I stopped going here a few years ago when we started seeing cockroaches in the dining area. After a good 12-month wait, we went back and on our first visit, literally a cockroach on the wall beside us. You gotta wonder how clean the rest of the place is if they can't maintain the dining area.

Really do not recommend for this reason alone."}
{"text":"I've lived in this area for 4 years now and typically eat here at least once a week. Many of the dishes are very tasty and I really like the fried egg noodles for some reason, either with tofu or beef. Friendly service and great prices keep me coming back."}
{"text":"Best Pho in town! It's cliche and it's true. I'm from Vietnam and my mom makes the best pho, but since you guys can't try hers, Pho Asia will do. Lots of meat, and the broth is hearty and sweet, not watered down or too oily. Eat there or do take out, it's just as good. Don't be fooled by the decor, it's the pho that matters. I've tried their other dishes too, they are decent."}
{"text":"This tiny place has nothing special, however hit the spot if your in a rush. The spring rolls were really tasty, the soup was very simple. Lots of noodles, with chunks of chicken pretty plain. Every table had at least 30 chopsticks, to choose from?!"}
{"text":"I love this place!!!!!!!!!!!! good food , great portions well priced  parking makes you become creative. Staff great never a problem , the spring rolls the only bad carb food I eat with no guilt worth every extra 200 crunches at the gym . I love a place that serves a single parton a full pot of tea, at one time that all I ever drank. Let`s be zen about this, this:  food is good the service is good, so just go ; what are you waiting for!!!!!"}
{"text":"I always come back for the fried rice, Pho, pork, chicken, and Vietnamese coffee. Cash-only is a bit annoying, but there's a CIBC a couple of doors away."}
{"text":"I'm sticking with four on this one until I find something on the menu that floors me. 

I took my room mate and a close friend out to this place last night and I finally had something other than pho. It's not because I'm not willing to try almost anything I can't pronounce, I was just methodically working my way through the menu. 

The spring rolls were a little doughy but were easily as good if not better than any other restaurant I've been to. My friend was blown away by the amount of hoisin sauce on the table (her favourite) and my room mate's jaw dropped when he saw the portion sizes. 

The curry chicken was my choice and what a good choice. The potatoes were tender and soaked up the broth while the carrots were fresh and just soft enough that they weren't messy or crunchy. The curry itself could have been a little more spicy but maybe they're worried about customers with weak spice tolerance?"}
{"text":"Asia 21 is hit-and-miss, depending on some unknown combination factors including the time of day, number of people at your table, what you order, the weather, and/or the average height of all restaurant patrons last Tuesday. 

Quite a few tasty items that make a hefty lunch at around $10. Vermicelli bowls are my favourite, with strong Vietnamese coffee. Servers seem to speak very little English, so the menu is conveniently numbered. 

Unfortunately food rarely comes out together, making for awkward group lunches. Servers seem constantly rushed, but unable to do anything in a timely manner. If the restaurant is more than half-full, they resort to bringing random dishes from the kitchen to random tables until someone claims it. 

Cash-only."}
{"text":"Even though i have been recently informed that i, along with almost every other white person, pronounces pho incorrectly... i still LOVE it, and pho seems like a pretty laid back kind of food... so i don't think it minds much.

Pho Asia 21 isn't my favorite pho place... but it's close to work, and is damn cheap.  which is excellent for those days when money is tight.  I've never been a big fan of the beef that comes with most pho.  I always find it rather tough, and lacking in flavor.  So it's nice that pho asia 21 offers a pho with just the rice noodles and beef broth.

The servers are friendly enough.. and the food comes out fast and hot.

If you are in the king and dufferin area and want a little Vietnamese i would recommend checking this place out."}
{"text":"Awful food, I got the lemongrass chili chicken and there was hardly any chicken. The bits that did exist were not breast and very chewy. Service was also woeful, left us alone for ages until we started putting on our coats to leave and had to go to the counter to get my change. They don't accept credit cards either but don't bother to put up a sign."}
{"text":"We've been here once in a while. Servers are not that friendly, however food is great! Their spring rolls and blueberry strawberry smoothie blew my mind! So tasty, must try if you are here. Only one thing that is inconvenience, they only take CASH, so make sure you have cash ready!"}
{"text":"i think i've dodged the bullet with this place for i've eaten here maybe 3 times in my life. i always have ordered the same thing so maybe that's why i never have gotten sick. i usually get the chicken pho and spring rolls. the spring rolls themselves are pretty good though the dipping sauce is not very appetizing (much too fishy for my liking)

the pho itself is not the best i've ever had. it's watered down and not as favorable as it should be. i opt for white, cooked chicken in my pho because i do not trust any other meats from this location. the tables are often sticky and the washroom is pretty filthy. since there isnt much upkeep in the interior i doubt the kitchen has any as well. it's hidden so you will never know what's going on, oh wait- unless you see that they fail health inspection.

will not return here."}
{"text":"Oh the pork Vermicelli, it's the best. I tried different Phos, the only one worth eating was the veggie one. It's a good place to try out."}
{"text":"I work in the area and I really love this place. I come here pretty often. Service is fast and the food comes quickly, which is important if you're a) hungry and/or b) on a lunch break.

When I first started coming here I would order the classic rare beef Pho in the Small size, which is still pretty generous. I moved on to the rare beef and brisket Pho, which is equally as yummy. 

Just a tip with the Pho: I find the next size up from the Small to be mainly more broth-y. I find it not worth the extra money because there isn't much more meat or noodles- but it is still delicious.

My favourite item on the menu BY FAR is the Beef Stew with Rice Noodles. It is so, so, so delicious. I crave it constantly. It's got a slightly ginger-y, sweet, spicy and dark broth. The carrots in it are cooked to sweet perfection- I cannot even describe how much I love those carrots! The chunks of beef in it are heavenly and tender. It's absolutely delicious and I love the sprouts, mint leaves and rice noodles that come with it.

Cheap, tasty and fast service."}
{"text":"What a shame! What a shame! They had the menu, the location, the taste, and even the decor, but what a shame the staff had to be so inattentive/impersonal, and worst of all, why did there have to be a bug in my freaking pho!!! That ruined everything, plus I had taken it to go so I wasn't gonna bother calling them, and I'm not gonna bother going back! So 16 bucks on pho down the drain (literally), and everything else in the trash, and I was still hungry and went for cheap fried chicken! What a pity, the pho tasted fine, their drink was special and exotic, but I can't allow myself to go back there again for that. Plus I didn't like their take out method. The broth, noodles, veggies and meat were all separate in their own containers! When I came home I had to find some bowl big enough to contain all that myself! I didn't ask for my lunch to be produced by Ikea! I would have preferred their own take-out bowl with the soy sprouts separate only like I have seen in any other apt Vietnamese place, that way the noodles and meat would have well soaked the taste of the broth! Anyway. Great pity!"}
{"text":"me and my coworker waited for over an hour for just 2 bowl of phos. and wheb we asking waitress about our orders the waitress just walked away"}
{"text":"Overall experience: 7/10
Food: 6.5/10
Atmosphere: 7/10
Service: 7/10

As the only Vietnamese restaurant near Liberty Village, I sometimes become desperate and go if I just can't get pho or vermicelli out of my head! 

At the end of the day however, the food quality is mediocre, but will tie you over until you can either get to Markham or Golden Turtle for actually good Viet fixings. 

Atmosphere feels old, but is fine, and the service is standard.

THE BOTTOM LINE: if you're in the area and desperate for pho, it will tie you over, but that's about it."}
{"text":"As a local for quick lunch, I would risk the occasional case of the runs in favour of one of the only asian spots in the area.  The staff are generally pretty uninterested in you (with the exception of the one gentleman who is friendly).  However - and I know this is kind of petty - the last time I visited a few weeks ago, the lady offered me a table in the front area crammed into a corner.  I'm a tall guy and said I couldn't fit in that spot, could I perhaps have a table in the rear area (which was 95% completely unoccupied).  She insisted she had no space.

I was a regular (twice a week) but I don't necessarily expect special treatment.  But to be told she doesn't want to put me anywhere other than a single table that I can't fit in was the last straw.  I won't tolerate the runs any longer and I can't endorse this place anymore."}
{"text":"Pho is good here, and the bun thit nuong is delicious! Delicious grilled pork and spring roll. The che ba mau is too sweet! A bit on the pricy side cuz of the neighborhood. But i would say it's justified for the food quality and the decor and area! Would come back!"}
{"text":"Nothing special, just average. I come to grab take out here and it's pretty decent. I ordered the chicken and pork with rice and enjoyed it. They do give a lot of rice so that it's filling. Meat portions are okay too. It comes with a mini salad and fish sauce. I usually come on a Sunday so it's not busy. Service is alright. I recently tried their avocado shake and I feel like I've had better. Price is higher than most Chinatown locations. Good enough to keep me full. Not bad but not great either"}
{"text":"One of the pho places near Liberty Village. Good amount of food, but a bit pricey. 

I bought a rare beef pho. The beef was of good quality, not fatty, not much tendon or obviously tenderized. Spring rolls are very good but definitely overpriced.

The staff speak Vietnamese.

Decor is quaint. Atmosphere is good for conversation."}
{"text":"Wow a lot of hater reviews on here? Yes, at first glance this place is west of Dufferin on King Street, possible immediate red flag but c'mon now...

Most people go to a Vietnamese restaurant for the Pho and this place can deliver a quality meal based on it. It might be priced more than a place like golden turtle but the rare beef or even rare beef with chicken is quality. The broth is tasty, you get your basil, you get your sprouts and you get a collection of hot sauces + soya to knock yourself out.

Anyone talking about past health reviews etc etc -- get real, they've passed everything since 2011 without issue.

As for the service, stop being a NOOB. Get ready to answer \"How Many?\", sit down and fill out your order on paper. BAM, It'll be on your table in 5 minutes.

Stop complaining!"}
{"text":"Good spot for some cheap pho. It's not written on the menu, but if you like spicy food then you can ask for your pho to be made spicy by writing it next to the item. The bun is reasonably good as well!

Service is about what you'd expect for a place like this. Place is cash only."}
{"text":"FOOD: tasty and filling, got the spicy tofu vermicelli and seafood egg noodle soup. Squid was a little bit chewy but otherwise, no complaints. Nice heat from the spicy. 

AMBIENCE: alright, nothing special. Spacious though, with around maybe 15 tables

SERVICE: food came fast, nothing stellar in terms of waiting

PRICE: pretty steep for 2 people. I believe we spent around $40 which is insane. 

TIPS: don't expect great service."}
{"text":"LOVE THIS PLACE. Delicious pho. We came here for lunch like 3 times during our two week stay just because this task food is so addicting. This is a very authentic place. To order you write your number of choice in a card and the waitress takes it away and shortly after they deliver a truly quality bowl of noodles.  This is a great lunch spot. It's tasty and it is quick. Pho is around $14"}
{"text":"Pretty decent Vietnamese restaurant. 

Clean and a cosy ambience is the first feeling you got when you walk in. Servers are coming to help you right away but are not very communicative/friendly. Not that they are arrogant or with bad manners... They are just quiet, which is probably the only one real down side of this establishment. 

Ordered a mango salad that was prepared fairly quick and tasted pretty fresh and the portion was generous. 

As per the pho I've chosen, tripe, tendon beef with rice noodles, the pho overall was tasty and of a good portion too. The broth was flavour but for my taste was just a bit blend. 
I wish I could have a bit more green to use but if compared to other competitors I certainly cannot complain about it. 

Overall food is done well, portions are good and all priced well. 

I would certainly consider to return to dine here."}
{"text":"Five stars for the food. Everything that we had was delicious. Definitely recommend the seafood noodle soup or the vegetable egg noodle. Service was a little odd because you have to write your order down on the paper yourself (probably to avoid communication errors) but altogether a clean restaurant with polite servers."}
{"text":"Very cozy inside. I liked the chairs too. Pho ya was good and loved the deep fried spring rolls!"}
{"text":"Asia 21 is close to work and a frequent haunt for many people from the office and surrounding offices.  Their Pho is good, they have a pretty wide selection and have several vegetarian selections on the menu.

For a quick, inexpensive meal, Asia21 is a good parkdale choice."}
{"text":"Based on a previous Yelp review, I had #404, grilled pork and chicken on vermicelli. It was average. The meat was pretty good. The vermicelli was bland and the sauce didn't help. The overall flavours were nothing special, especially for $10.50 (after tax). I'm pretty full, although based on the average-ish taste and the price tag, I don't feel like I got my monies worth. Most of what I am full on is bland plain vermicelli.

I've had their pho before and it was quite good, but I don't like pho that much because I'm not a big \"soup\" person. You're filling up on mostly water. If you like pho, you'll probably like theirs although I have had better.

The second time I had their Beef Pad Thai. It was actually pretty good, but not worth the $$. The third (and probably final) time I had the stir fried tofu in satay sauce on steamed rice. It was average and you don't get enough of the dish to justify the price tag.

Why won't I go again? The food isn't that good.... the prices aren't worth it... and as of Jan 1st 2017? Every price went way up. I can't justify the price of anything on their menu. It was already overpriced as of December 2016 when I first went.... their new pricing for 2017 just cements this place as more overpriced food for what you get.

Also, their customer service is crap. The people over the phone don't even seem to care. Here's an example:

\"Hello\" (c'mon you need to at least mention the restaurant name when you answer)
\"Hi there, I'd like to place an order for pickup\"
\"k\" (she said this very quietly... I barely heard it)
I'd like to have the (I tell her what I want)
\"yes ok bye\"
\"Ummm, how long will it be?\"
\"10 minutes\" *click*

Wow. It's not like they could use an excuse that they were too busy to pay attention to me (which isn't even a good excuse). When I went to pick it up, there were only two tables of 2 occupied. As if you barely matter.

Anyway, I took some pictures of the new menu for you all, so you have the pricing."}
{"text":"Haven't experienced much vietnamese food yet but found this place to have good food and a good price. In a pretty shady neighborhood but don't worry the restaurant is clean and welcoming."}
{"text":"Worst service you could possibly get. The food was ok but will never visit again. Had my food taken away when I wasn't finished."}
{"text":"The vibe: Compared to a lot of the Pho places in the city, the vibe in here is actually quite nice! It almost looks like you're eating inside of a boat. Has a quaint, old-timey and authentic feel.

The food: I got the Vermicelli for $7.50. It was a great big bowl and came with all kinds of fresh toppings. The spring rolls weren't my favourite in the city, but overall great food. The mango milkshake owns.

My go-to meal: Vermicelli

Secret: Cash only! And it's one of the few places to eat at King & Dufferin."}
{"text":"After having a 1.5-year streak of green passes from DineSafe, I decided to give Pho Asia 21 another chance. (I had previously written them off for getting red carded.) Working at the corner of King and Dufferin, you get bored pretty quickly of the fast-food joints in the area. There's also sushi and roti, but sometimes you need something else. 

I've dined in the place and have ordered take out; I've gotten quick service with both. The staff is not really attentive, so sometimes you need to holler at them when you need something. The food is delicious though and that's where they get the stars. My favourite dish thus far is the Spicy Beef Vermicelli Noodle Soup, it's the best version I've had at a restaurant (the best being my mom's version.)

It's good to have a variety of selection for food in the area, and I'm glad Pho Asia 21 changed their ways to meet the city's heath and safety regulations."}
{"text":"I'm going to have to start calling this place the Boston Red Sox of pho, because every second time I go it's amazing, but every other time, it's been fairly average. I can't explain it. Maybe it's getting to know how to order from a particular menu, as I find with Chinese, Japanese and Vietnamese restaurants it helps to know the menu as what you want may go by different descriptions.

It's located in Parkdale so the clientele can be varied, but the restaurant itself is clean, simple and cozy. I will say this as well, fancy pho restaurants I don't trust. I like them to be a bit basic because it usually means the pho is better. 

The broth is pretty good. Not too salty and pretty clear, it's flavor every time I went was good. The soup had just the right amount of onions and the noodles were nicely cooked as well.  Here's where we get to the beef, and what made me choose 3 stars instead of 4. The beef the first time I had it was amazing, nice and perfectly fatty and tender. The next time I ordered what I thought was the same thing and it wasn't as good, the beef was tougher and was of the rare variety and much chewier, which is not a term I think you want to apply to beef noodle soup.

The rolls are tasty. Since I tried the salad rolls, I can't order the spring rolls. I typically find them too greasy, and the salad rolls have fresh going for them which makes hem the winner in this competition.

Prices here are fair. For XL soup with extra noodles, and rolls, I think it came to $14-15. Tip on top of that, it's still a reasonable meal.

I'd say it's worth the trip, and it's not usually too busy like some of the places on Spadina or Ossington."}
{"text":"This is a pretty basic Vietnamese/Chinese/Fusion restaurant.  The best thing on the menu are their PHO soups, which come up to X-LARGE bowls for only $10.50 for the most expensive ones.  One of the regular places to go for lunch if you work in Liberty Village and want to avoid the LV overpriced fare.

Their Pad Thai is not bad, and the rice/vermicelli are also good, but the Pho is the best. 

Unlike some 'fancy' Vietnamese places, they DO offer Tendon and  Tripe Pho which is delicious and is how Pho is supposed to taste!"}
{"text":"The chicken and beef pho is as good as it gets and the curry chicken stew is TO DIE FOR! This is my new favourite dish and I cannot wait to go back.
I called ahead for takeout and it was ready in under 10 minutes. Unfortunately they do not have a website or online menu but I was lucky enough to find their menu on Yelp, previously uploaded by another happy customer)."}
{"text":"Complimentary hot tea once you are seated. Which I love. The food came out fast and their prices are very reasonable and low compared to the other Mom and pop restaurants near by. Cash only. They've got an ATM inside. Pho is standard and they have all the main basic ones anyone can be in the mood for. Would come back and try the entrees next. Close to work so I'm glad they're here."}
{"text":"That's the kind of food you want to eat when your tired of fast-food. It feels like grandma house with the old TV, the fake plants and the big mirror. 
Everythings is fresh and good!"}
{"text":"I normally take my order to go however it does get busy but not chaotic. Every time I order the food has been very tasty! If you are feeling under the weather I suggest their soups. I love in the summer time ordering their vermicelli. Everything is tasty just note that they accept cash and credit only no debit."}
{"text":"I've lived in the Parkdale area for a while now, and I have to say that I was a little skeptical of the King Dufferin intersection for a while. I mean, Subway, QuizNOs, Burger Thing, and McYucks are all around there. 

I did find a gem tucked away. I did look at reviews before going down to check it out, and I have to say that I didn't find very many good ones. 

So after checking out their recent Toronto Health Dine Safe program statuses (passing all of them in the last year), I decided to go for it. 

I now visit this place twice a week. The servers (only one speaks English) must be so tired of me by now. I mean, yesterday, I went in TWICE. Both times for food and beverages. It really sucks that they only take cash, but with there being TWO banks on the corners of King Dufferin and a TD in Liberty Village, it's not really a problem. 

I know there are cleanliness issues being posted about this place, but I have never had a problem. Being a chef, I tend to look for hot spots, and I haven't seen any yet. As for the gentleman posting about the cockroaches, you have to realize that this isn't the most clean area in the city. They very well could have come in from outside or dragged in on your shoes. There are apartment buildings that are CRAWLING with them just down the street. 

I usually get 113 (Beef broth with rare beef and chicken), but they've recently changed the broth and chicken. It used to be boiled chicken pieces that gets put in, now it's a whole chicken that gets boiled and sliced and those slices (that also have fat and grit on them) get put in. I don't enjoy it as much. Large bowl $6.99

Their viet coffee with condensed milk over ice is always something to look forward to. I do believe that it's 906 on the menu at around $3.25. The roommate (A) and I call it, \"JESUS COFFEE\"...so strong (and amazing) that you will see Jesus! 

The Bubble tea is also great. Tapioca is $0.50 extra, but isn't always cooked through. 

This place gets crazy for the lunch rush with tables to accommodate anywhere from one person to fifteen. You will manually have to split the bill however, with the one bill ordering system. Also, make sure to put everything that you want on that bill...including if you want a glass of water. 


The cubic beef lunch special is especially tasty!

The Vegetarian rice option is their downfall. With A being a vegetarian, she usually orders a plate of Veggies with Veggie fried rice. The last three times, it has tasted burnt. So instead it's Veggie Burnt Rice. ;)


So, load up your wallet with a $20 bill and visit Pho Asia 21! This place is quite awesome and worth every penny."}
{"text":"Honestly, just don't bother with this place.  I've been to this place 3 times over the course of working in Liberty Village and in my honest opinion this place doesn't hold up.

1st off, I have to get this off my plate.  While I acknowledge that they are places that only accept cash, it's typically in areas where a bunch of vendors will come together and not accept cash.  Pho Asia 21, on the other hand still ONLY accept cash, where everywhere else accepts at the bare minimum debit card (and also credit card).  But I digress...

Let me get through the positives before I go into the negatives because there are so highlights.  

The dish, I ordered (#104L (medium) - Pho Tai (beef tendon / rare beef), the noodles were cooked to my liking, a small bite but not undercooked.  The tendon itself was cooked very well and a massive improvement from the 1st time I went where the tendon was hard, unclean and an unpleasant aftertaste.  This time, it was cooked all the way through and melt in your mouth (really good).  The beef was ok, but considering it's rare beef it came cooked all the way through but I didn't mind...tasty beef.

And....that's about all I have to say with the positives.

So, service wise.  As attentive as he was (there wasn't a whole lot of customers), I wasn't provided any tea at all (a slight irritation but since I wasn't in the mood for tea, I kind of let it slide and asked for water instead, during my meal).  Overall, he did his job well and brought the food in a timely manner.  Heck, even knew when I needed the check, he had it ready (not sure if that's just him wanting me to leave or just good intuition, I'll leave that for you to decide).

The dish I had as mentioned while there were good points, the broth...ugh...it's definitely laced in MSG.  Hence probably why I asked for that glass of water because while it tasted great at first, I could feel it on my tongue the desire to drink water like ASAP...that rather uncomfortable numb feeling that I get from my tongue. 

3rd off, call me picky or whatever but I just can't stand when there are flies flying around in the restaurant.  It makes me wonder whether the dish I'm eating is clean and the fact that I have to be constantly air-swatting my food to keep the fly away just gives me another unpleasant feeling about this place.

My last point, and this isn't necessarily a negative (well kind-of) but pricing wise, it's $0.50 - $1.00+ more expensive than the regular pho places I go to and offer up better quality than this place produces.  Their largest bowl is $10.50 which is absolutely massive and ridiculous when it's like $1.50 cheaper elsewhere.  

I was hoping for this place to improve, espeically over the number of years that it's been business but honestly, I give up...find somewhere else."}
{"text":"I work up the street from this place and apart from Roti and a few fast food places there is not much selection at King & Dufferin. 

I had the green curry rice dish and some spring rolls that were better than average... so why the garbage rating?

In addition to the annoying fact that they only take cash, when I returned the following week they were closed pending revision for a failed review by the Toronto Health Dine Safe program (in December 2009)

When I went on the Dine safe website: http://app.toronto.ca/food2/index.jsp
I found out exactly why they were closed:     
Food handler fail to wear headgear                  
Operator fail to provide adequate pest control 
Operator fail to prevent an insect infestation  
Operator fail to protect food from contamination or adulteration 
Operator fail to maintain hazardous foods at 60C (140F) or hotter
The list goes on...

I get it... the idea of the program is to maintain public health by notify businesses and patrons when practices are not up to code and provide them an opportunity to rectify the situation. But come on... these are some pretty disgusting citations!

I also found out that this was their second offence is 6 months for the exact same violations! It's nice to see they passed their last inspection in Feb 2010, but my co-workers have warned me that these guys have the dreaded yellow conditional pass is up all the time.

Do yourselves a favour and skip this place... there are plenty of yummy places that take better care of their establishment."}
{"text":"Hmn,,,I wanted to give 2.5 Stars but there is no such option, so I will give 2 stars.

I never liked pho till maybe a year ago, and I had since been a fan of such delicious comforting food. I have been going all over the places downtown Toronto to try pho at different restaurant. This place is okay, I get the idea they are kinda cheap.  They don't serve huge potion and, and the basil and meat everything is smaller size than most places that serve pho downtown Toronto. So I dont think I will go back. The taste is okay, nothing special."}
{"text":"-=WARNING=- -=COCKROACHES=-
Do not eat in this place! They do have the anti sanitary conditions of this place. During the lunch hour previous Friday, 12 of Nov. I witness cockroach at the dining area on the tables and chairs. Pictures can be provided!
-=WARNING=- -=COCKROACHES=-"}
{"text":"At an intersection dominated by two of the world's beastliest burger factories and one of Parkdale's most nefarious looking pub crowds, Asia 21 stands out as the best sit down establishment King and Dufferin has to offer. 

While local standards such as wood grain laminate table tops and wall mounted TVs persist, the mid-sized dining room is well maintained and there's always a quick round of welcoming smiles from the staff. 

Unofficial counts put the number of items on Asia 21's menu somewhere near forty thousand with an offering that'll make seasoned Pho Hung'ers forget they aren't on Spadina anymore. That said, my happiest experiences here have been when I've stuck to the Pho (rare beef; no tripe special for me, please). The broth is definitely what keeps me coming back - delicate and delicious and entirely capable of standing on its own. If you're a habitual hoisin user, I recommend you take a few sips before getting down to routine. 

A quick heads up on the deep fried spring rolls. First, they're big and come in twos. If three people are sharing, one order will probably suffice. Second, these roll have a meaty centre which isn't called out on the menu. My guess is that the meat is pork, but I'm so unsure that the surprise could just as easily be the neighbourhood children. Kid meat or not, also delicious."}
{"text":"I used to come here a lot  - it's your basic hole in the wall pho restaurant, nothing special and the bathrooms are gross, as is to be expected. In the last few weeks, or so the waitress rudely told me, they have raised their prices as well as started charging for take out containers.  Also, they stopped taking any sort of plastic (credit or debit) and only take cash.  The food isn't any better or worse than any other basic viet food and there's a far tastier pho restaurant just up the street at dundas and queen, with much nicer decor and service so even though I live next door, I will make that trek just to avoid this place."}
