{"text":"I got the vegetable pho and it was delicious!  My son ordered the shrimp pho which was also delicious. We got a pollo asado dish to try as well.  We liked it and will definitely be coming back soon!  I'm glad we found it.  The decor is nicer than I expected so that was a nice plus. (It is kind of hidden in its location, but towards the East end of that shopping center at 35 ave and Bethany Home N/E corner.)"}
{"text":"Have been wanting to try this place for awhile now as a couple friends have been telling me it was great! When I arrived I was not really sure what to expect, I didn't not realize it was more of a restaurant style place. They have such a wide variety of food that it was so hard to choose just one thing to get. I ended up ordering the tofu/vegetable pho. Our server was very slow and was rude when we were asking questions about the menu and this is why I can't bring myself to give them five stars. When my food came out it looked delicious and there was such a good portion of it. It didn't lack flavor and tasted amazing. I would highly recommend this place if you are looking for pho. I will be coming back to try more things!"}
{"text":"Phoenix lacks a good pho spot. The food here is very subpar. I've given this place a few tries and most of the time I end up leaving with a half eaten bowl. I'm Vietnamese and I know when a bowl of pho is decent I grew up in California where pho is the best in my opinion. I would pass and find something different."}
{"text":"Went with my mom and love the space.   Every one was very friendly  and the food was delicious!"}
{"text":"Just okay.  The pho broth is good, but not spectacular. Meat in pho very skimpy. Not much flavor to overall dish.   Shaken beef somewhat tough. Flavors just not...there.  Macaroon ice cream sandwich looks pretty. The ice cream is good and plentiful, but the macaroons taste like they are mass produced, came out of a box, or just plain old. Once you've have a perfect macaroon, you won't be able to enjoy these here. I did not enjoy mine. Macaroons should blow your mind. These don't.   Spring rolls fresh and expertly rolled. Accompanying sauce lacks...you guessed it..flavor. Nice addition of crushed peanuts and chili sauce is available, buf it had a thin consistency.  The portion sizes are decent. Overall, though, it seems as if Pho 602 is sacrificing effort and ingredients for profit, which is a shame because any time you have a nice, big, clean space in a good location it has the potential to be something great...and this just isn't great.  I'm picky about my Vina-food. There are better places to have it than here."}
{"text":"Decent. Super clean.  Service was great. Always came by.   Pho noodles were too soft. And broth a little different but acceptable.     Spring rolls and peanut sauce great tho.     A shame they were out of macarons when we were there"}
{"text":"The food was delicious I ordered the number 12 and it was pretty good. My boyfriend ordered the beef and broccoli and the server brought him chicken and broccoli. He said that it was pretty good but just disappointed cuz that's not what he ordered. The food took 25 minutes to come out and we did not even order an appetizer. There was one other couple in the restaurant with us. I don't get why you took so long to get our food.  The service was terrible. He came to take our order and brought us our food. Then he never came back. Our server SAT behind us eating Papa John's Pizza. then he brought us our tickets never refilled our drinks.  I was so excited to try this restaurant because it was brand new and its right behind our house. But I will never be back again."}
{"text":"Very good! Chicken pho was great! Loved the new guy that is there. Customer service has definitely gone up!"}
{"text":"This place isn't worth coming to. Food is poor enough not to try for yourself and the service is terrible. Very simple...this place is bad"}
{"text":"My fave Vietnamese place! The fish sauce wings won me over. They are to die for. I find myself craving them often. I also love the grilled chicken bahn Mi with an egg on it. I've never had something I was disappointed in. My husband and I come here often. We always receive amazing customer service."}
{"text":"2nd visit, Luke warm hot jasmine tea, grilled chicken spring rolls were on the mark. Stir fried Rick noodles with shrimp, veggies and light oil was cold....a farmers market portuon of cabbage blanketed my dish...cold and soggy...not good...server suggested a redo...took the advice...2nd attempt was on point and good. Overall service was almost non-existant...I may give this spot another try......50% success should be better than what I experienced...you decide for yourself..."}
{"text":"This place is horrible. I couldn't even eat the food so un appealing. My waiter was rude I asked if I could have my noodles and broth separate (other pho places do it, no problem)  and he brought it together then I said \"excuse me I asked for the noodles and broth separate\" he gave me such a dirty look. The layout is nice but I think they should invest more time in the flavor of the food than the look of the place. Everything was so bland and had a weird taste to it. The service was horrible, I noticed most of the workers just pacing back and forth. Oh yeah, the rice was dripping in oil (gross!) and the pho was not tasty at all.   Sorry but I will never go their again i'll stick to Pho Thanh or Da Vang thank you very much."}
{"text":"Good noodles, service was pretty good I liked the food a lot especially the calamari... The parking was decent"}
{"text":"My husband and I have been here a couple times and everything always been great service and the food."}
{"text":"Just ate there 4/1/15. Looks to be a work in progress. Had the pho tai, which was great. Broth was both meaty and fatty, very flavorful. I don't put anything hot in the broth itself so I can taste it pure. I put sambal paste in the spoon when I want heat. Also had the cha gio, crispy egg rolls. Also very good, but they only brought me one lettuce leaf for wrapping. Other restaurants will bring two for two. And an order of coke. They gave me a 12 oz can. So no refills. Bummer that. So for the lettuce and can of coke I'm giving them 4 stars. Will see how they are in a month or so. As an addendum, I saw that they had cans of coffee stacked on a shelf. Cafe du Monde was the majority. So the coffee should be good. Also wish to mention that the menu is in viet, english and spanish."}
{"text":"Their boba is AMAZING. Their Pho is DELICIOUS! The place itself is super clean and nice! I'll definitely be coming back!"}
{"text":"I really like the food but twice in one week (when calling in) which I always do, they have messed up my order and I'm not sure what's going on if it's new staff or what but  service is starting to slack but this will make me go elsewhere. Please get it together pho 602"}
{"text":"Really love the Bun Bo Hue here its the best! Its full of flavor and lots of meat cuts! The Thai Tea Boba is delish and now they offer Macaron Ice Cream sandwiches and its the best!! Will definetly come back here! The staff is kind and attentive!! Love!!"}
{"text":"Been here twice so far. We've gone in the early evening so service was not a problem. The beef pho I had (both times) was absolutely delicious. The authenticity is in the fat content of the broth. So tasty and it's a huge bowl of meat and noodles. My partner had two seafood dishes which he said were excellent as well. I would like to try other dishes but the Pho is so damned good, it would break my heart to not get it every time."}
{"text":"I'm always in search of good bowl of pho, especially when I'm fighting a cold. It was a Sunday night and luckily this place was only one open without having to go far so we figured to give it a shot. So glad we did! Service was great, food was amazing.  And they have macaroons! What?!!! With ice cream if you want too! Double what?!?!? And please, whatever you do, order the fried chicken wings as an app.  That dish alone I would drive far and wide for.  Mmmmm:"}
{"text":"Such yummy pho! And the spring rolls are huge and so tasty. Price is right and the location is convenient enough. I think this is a fairly new place still but they seem to be doing quite well and I absolutely love it. My other half got a pork chop dish with rice and veggies last night, and it was just okay. I always stick to pho -- the chicken and meatballs are both faves -- and am never disappointed!"}
{"text":"Great place to get pho and I find the place much more friendlier than other Vietnamese restaurants."}
{"text":"Tried this for the first time and it was excellent! The restaurant is beautiful, the service was great, and the food was even better. I ordered the pho with meatballs and a taro boba. Both were great! The price is not bad at all, very fair. I will definitely come back here."}
{"text":"We were in town for a festival and had cravings for Vietnamese food.    Pho 602 is located in a busy business mall, but there is plenty of parking for all.  Actually, it's quite convenient if you're running around for errands because the major stores are all around the plaza.  We arrived at a lunch hour, and it was pretty busy for a Saturday afternoon.  The servers greeted us and quickly walked us over to the table.  They were all pleasant and very efficient in greeting guests as they entered the doors.  The menu is pretty extensive and has an array of options to choose from.  I ordered Banh Canh Cua which is Vietnamese crab soup with udon noodles.  The broth was light and the noodles were cooked perfectly.  The fiancé ordered a rice plate with pork chops which he complimented in flavoring.  The rice plate is accompanied with a side of fresh vegetables, a fried egg, shredded pork, and personal size of soup.  Stop by and try one of their menu items.  They just added a special called \"short rib pho\" -- we will have to try that at our next visit.  Pho 602:  we'll be back for sure!"}
{"text":"Always delicious food, great service and I love that I can call in an order for pick up."}
{"text":"Good quality pho and the deluxe fried rice is boss. The only issue I have with this place is that it can take quite a while and they are inconsistent on refilling your glass (better recently, though). They are nice and the food is consistently good..just isn't ideal for lunch if you are on a strict timeline."}
{"text":"Go here!! The pho ga and vermicelli (idk how to spell it lol) were amazing as well as the thai tea. Our server T was so nice and made it a great first experience, will definitely be coming back! One of my nee favorite pho places"}
{"text":"Very good! Nice and clean restaurant. Beef pho is on point and the #16 was amazing! We had a great experience and will definitely be coming back again. Also, the Thai tea was one of the best around town!"}
{"text":"This is my go to place for pho. I get the brisket pho, it has always been very tasty and the portions are large. I have also had the pork egg rolls a couple of times, these are very delicious too though I wish you got more than just 2 per order. Boba is very good as well! Service has always been quick, even when busy."}
{"text":"This place is my ultimate favorite for Pho!!!  The place is always clean, super welcoming, and of course the Pho, the Pho is the best I have had in Arizona, as second best is Viet Kitchen and thirdly Angelina's!!!  Must try if you are looking for the best Pho that Phoenix has to offer! :) Enjoy!!"}
{"text":"Best pho I've tasted! I loved it, it was quiet , there was classical music playing and the staff was prompt and were quick to get me a glass of water when I was seated. The shrimp pho was perfect and they have a variety of boba that is delicious. I can see myself coming back here for sure"}
{"text":"Most beautiful Vietnamese restaurant I've ever been to! My group of friends and I were attended with genuine hospitality and super customer service even though it was close to closing! The inside of the restaurant is beautifully decorated with vibrant flowers and sparkling lanterns/lights! The menu is very clear and what I found most appealing was the fact that the menu was in Vietnamese, English, and Spanish! It looks like a very high end place but the prices are very fair. The food costs about the same as any Vietnamese restaurant. They have boba here & a massive variety of flavors to choose from! Hands down one of the coolest restaurants I've ever been too & I hope people notice this hidden gem!"}
{"text":"I had such a pleasant experience at Pho 602 today! I went in with my boyfriend around lunchtime, and surprisingly it was a steady environment with not too much customers dining inside. The restaurant itself is extremely neat, which I am immensely fond of! As we entered we were immediately greeted and escorted to our table. He ordered from the 'Create Your Own Pho' section that included a variety of options--but he chose chicken and meatballs; whereas I selected their chicken wings. We both enjoyed our dishes and I know that I am a solidified customer as of today. I would definitely recommend this Vietnamese restaurant to all my friends and also to anyone who wants delicious Vietnamese food!"}
{"text":"Ordered some for my wife to try since we love Viet, and it's closer than any other place to us. I'm on a diet, so just got food for her.  Had the exact same experience about the person taking the order having no idea what was on the menu, and only able to order via number. I asked for something, and they just said \"What number?\". I guess the other Vietnamese places are just humoring me when I think I'm saying the words close enough.   Wife loved it, said the food tasted much fresher than the other viet places we go. Perhaps I can have some Pho without noodles, and extra bean sprouts. Except there's no number for that, so probably not."}
{"text":"Great pho! I also ordered some vermicelli chicken to go and looks amazing! They staff was very friendly with fast service. I'll be back for sure!"}
{"text":"I had the #10 it's a very hearty beef dish and it was amazing. It's a cute and inviting restaurant. The service was excellent. I highly recommend this place."}
{"text":"So interesting experience:  I was seated right away, and told the waiter I needed a few minutes to look over the menu. The menu font is hard to read, I would suggest changing it. Some time went by and as others have posted no one came back until one of the ladies asked if my order had been taken to which I replied \"no\" and she promptly took my order.  Fairly fast service, but when she came back my order was boxed up to go, I never said I wanted it to go I was planning on eating it there, but I figured since a woman came in with a really annoying kid it might be for the best. So I took my order and left.  Now, I will premise this with that I have never ordered Pho to go, so I get home and unpack the box and find a bag of raw meat in one of the boxes, Is that normal? I don't know. Why not put it in the broth? So I flash fried it and made my own pho.  Strange experience to say the least, probably won't be back."}
{"text":"Love this place their customer service is amazing they care about what you want . Me and my family loves this place and been completely satisfied every time we come we have recommend Pho 602 to other family members and friends ."}
{"text":"Just waited an hour for our food to be brought out to us after 2 tables who were seated after us and were served their food. There was no customer service effort for us whatsoever. We asked for a straw for our table when we were served water and it was never given to us. The server told us to wait 15 minutes before we could get our boba and proceeded to avoid us for the rest of the time. No one checked on us the whole time we were waiting. The customer service has lost our business forever and we will not be going back to Pho 602. Great food though."}
{"text":"I went here for the first time today. Food was good, but nothing about the experience impressed. The pho was good and you can \"build-your-own.\" I also had their wings which were different, but good. I had water but had some of my wife's orange juice, which was freshly squeezed  As far as service, it was forgettable. I didn't get a friendly/engaging vibe from any of the staff members. Our waitress never came around to check on us. She also forgot an item that we asked for even though it didn't really seem busy. Overall, OK experience. I'd come back if it was convenient but wouldn't go out of my way."}
{"text":"This is a great place to get some good food at an affordable price! I enjoy their vermicelli plates and the staff is great! Super friendly people."}
{"text":"Place is still nice and new, clean. I usually get pho # 1 and bbq rice plate, there all good, customer service is good, some of the young waiter boys are still new, i asked for Vietnamese sandwich he says yes but then comes back and says sorry we don't have anymore, this happen like 5x since I come here but I guess it's bc it's a Sunday and there out of bread it I wished he knew before he said yes, overall great place, good food, please keep the pho taste original and do not Americanize it."}
{"text":"Decent but nothing to write home about. Table was clean, restaurant was clean.  In this part of town I would have expected something very authentic and making me want to come back....o'well.   The pho was decent so if you're in the area it's a good place to stop for lunch if you don't want the usual Mexican or bar food lunch."}
{"text":"The atmosphere is amazing with traditional decor, it's very nice and clean ! You are immediately greeted and you have the choice to sit where you want. It's a great place to a point where I recommend it to friends and family and they love is just as I do! Pho 602 is highly recommended to eat there! I remember seeing when this place was being built, and now I'm really happy I went!"}
{"text":"This place was BOMB I got #36 the combo fried rice and it was super delicious definitely coming back here its not to bad on the wallet (college kid friendly) and the waiters here are really nice and go the extra mile to make sure your experience here is great"}
{"text":"This place is super good and they have great prices. I got phó with brisket & 2 egg rolls for only $10!  I honestly feel like a lot of phó tastes the same lol but this one definitely didn't disappoint! Their service was fast and everything tasted delicious. I've been back 3 times since then and it's been amazing every time :)"}
{"text":"The restaurant is clean and modern. The wait staff are courteous and speak good English. I like eating here because the food reminds me of \"Little Saigon\" in Orange County. The dishes itself are good for two people. Sometimes, I can't finish my meal; however more for me later :). I leave the restaurant with full of satisfaction. I would definitely give Pho 602 Vietnamese Restaurant four stars!"}
{"text":"Absolutely terrible. I ordered a banh mi sandwich which consisted mostly of dry bread and doused in pepper. I also ordered an iced coffee and was given a small flimsy plastic cup filled with ice and not even 3/4 full of coffee. Da Vang is still my favorite place and never fails."}
{"text":"It is such a delight to discover yet another really good Vietnamese restaurant in the city, and I wish I had known about this one earlier. The food is excellent and inexpensive, the service is friendly, the dining space is huge, and the restaurant offers a great variety of dishes. It is conveniently located within the large commercial area on the northeast corner of 35th Av. and Bethany Home Rd., so parking is never a problem. And they have WiFi connection for their customers - that's always a plus."}
{"text":"Best pho I have eaten. The food is so good and the staff will go over it with you so you know exactly what you are getting.    My husband has never wanted to try Vietnamese food, but I got him to try some and now he eats it all the time,  This restaurant is in a small strip mall has plenty of parking and seating inside. Staff has always been pleasant and the price is reasonable for what you get."}
{"text":"My boyfriend and I were craving Pho today and decided to try this place. We got grilled chicken spring rolls, salty fried tofu, seafood combo pho and beef combination pho... Everything tasted great! The waiter was very polite and the service efficient. We also tried their Thai tea Boba and were very happy with it. Will definitely come back!!!"}
{"text":"Wasn't a big fan of the pho but the wings, rice and the ice cream sandwiches were on point!"}
{"text":"So this was my 2nd time trying Pho in my life. Honestly the first time was a let down at Little Saigon in Glendale. But Pho 602 made me a believer and a future consumer. It was just delicious plain and simple. The broth itself was packed with flavor, an explosion of flavor and im not exaggerating. Then throw the noodles and makes it a better dish. The noodles were soft and chewy and gave a good taste to the broth. Put the veggies and it adds the fresh factor. Throw in the meats and man do you have way more flavor. its just crazy how much flavor these guys can pack on their Pho.   I got the #1 which is a combination of most meats. Round eye, flank steak, brisket, tendon, tripe and meat balls. I was disappointed it only had a tiny piece of tendon. Other than that it was a good amount of meat.   Note - I've been sick with an infection and I don't know it was just coincidence and antibiotics just kicked in or the Pho helped out and jumpstarted me because i felt GREAT after eating these(not 100% but still with more energy)."}
{"text":"First, there was a long wait, but there were a lot of tables open. The problem was none of the tables had been cleaned. When we finally were seated (only two of us) it took a while to get water, which came in plastic cups. I'm guessing that is because all there dishes were dirty because they hadn't cleaned any tables. When they came to take are order we wanted to verify that the vegetable and tofu pho was made on vegetable broth. They said no. How do you offer an all vegetable and tofu pho but don't make t in vegetable broth? How does that make sense? They only use beef broth. It was a big waste of time and they are not vegetarian or vegan friendly. It was not a good experience will not be back. I would recommend going to Pho Thanh or Pho 43 instead, especially if you are vegetarian or vegan or have meat allergies."}
{"text":"I enjoyed this place but not enough to give it more than 3 stars.. the service was good it was very clean and huge inside but it was dark inside..  I don't expect it to be bright like outside but I mean it is really really dark inside..  now the food.. I ordered spring rolls and shrimp pho.. the spring rolls were good the pho however was just okay it lacked flavor like other pho restaurants I been to..  That's why I say it's just a 3 Star spot..."}
{"text":"I am super picky with Vietnamese food. I love this. My mother ordered a beef brisket Pho and it was huge. The price was adequate too. The portion of Bun Thit nuong is right to make you full and not have left over    Update:   THE FOOD IS DELICIOUS. But this review is about the service. Second time I came in the morning, we asked tor a table for 6. They said they only had a table for 5 and told us to sit separately . And guess what, there is the same table of 6 round table so we just moved ourselves over there. I don't care if you want us to sit separately when the round table can hold 6. (It had 5 chairs originally). Behind us was a table of 20 and they could make it works. These young people don't know? They have options that they could always fit two square table to make 6 as well. Additionally, there is an offer for 1 free soft drink if customer checks in. Please don't touch your dirty finger on my phone without my permission trying to press the \"use it now\". Just tell me and I'd do it. Btw, that was the waiter. The waitress was nice."}
{"text":"Very tasty and at a great price.  Spring rolls, fried rice, pho, and boba were awesome!"}
{"text":"Still one of my wife's favorite places.  She really enjoys the Pho while I really enjoy the less soupy items on the menu.  Everything seems to be really good."}
{"text":"I love coming here. I call ahead to place my lunch order and when I walk through the door I am greeted with the warmest \"hellos\" and my lunch ready to go. The service is wonderful, associates are friendly, and the food is awesome!!!!"}
{"text":"Looked like a very popular place as when we went, people were still coming in even 20 minutes after they have already closed. Our server was really friendly and checked up on us and told us to take our time and enjoy our food as he saw me trying to hurry because it was past their closing time. It's a clean place. I wish I would have been able to taste their boba taro but they ran of boba :/ will definitely go back though!"}
{"text":"Solid and plentiful Pho, as good as you'll find in Arizona. The fried egg rolls were crispy and delicious, served with just the right amount of lettuce and picked veggies. The restaurant itself is quite spacious, the fixtures are very neat and clean,, over all the setting is much more respectable than your average Vietnamese place."}
{"text":"The service is a 5 star restaurant, I could not believe that my drink would be free for only checking in. My personal favorite dish is their beef pho, with an exquisite flavor that really delivers a unique and enjoyable experience. I been a customer for a year now and will continue to be one. Thank you to the servers this morning of 05/11/17"}
{"text":"Good Pho! Good selection. Not my usual place, but I discovered this place and it is closer to my house. Would visit again!"}
{"text":"Womp womp womp. Not as good the second time. Pho was subpar. Asked for a drip coffee and we were literally given a plastic cup with ice and and a drop of coffee. We won't be back."}
{"text":"First time here and everything was delicious!! We will definitely be back! Nice set up and open floor. Staff are very friendly and attentive. Cool music is played in the background. Place is clean and prices are reasonable!"}
{"text":"I just returned from Vietnam and was really missing the food, so I decided to try out Pho 62. There are quite a few restaurants in AZ and I have tried nearly all of them. So far, I am the most impressed by Pho 62, in all honesty. With regards to the pho, there is a generous amount of noodles and meat. At most pho places in AZ, there is not enough noodles or not enough meat most of the time. Overall, the food here made me miss Vietnam tremendously and that is when you know food has done its job. This is coming from someone who grew up in Little Saigon in California, where a lot of the best Vietnamese food is. :) If you are coming to Pho 62, I would earnestly recommend sampling any of the pho or bun dishes. ;) The one thing I do wish they served here that I had a lot of when I was in Vietnam is chrysanthemum tea and lemon ginger green tea. :)"}
{"text":"I think I may have a new favorite Vietnamese restaurant with Pho 602. The place is pretty new. It's clean and there's plenty of seating. Probably the best looking Vietnamese restaurant in town. There's also a stage in the restaurant, perhaps for Iive entertainment eventually. I'll have to ask them about the next time I come in.  On to the food. I ordered their rice plate special that came with grilled pork, fried beancurd, and a fried egg. It was plentiful and very good! What to rave about so far is really their fried chicken wing appetizer that my friend introduced us too. They were a light and crispy, not at all oily. They had a touch of sweetness, with a garlic seasoning."}
{"text":"Great location Very clean restaurant Fooð is always prompt  Lots of different options   Needs to expand the drink menu instead of cans of soda   Next visit I would like to try the desserts and the ice cream   Nothing really stood out but again cleanliness is excellent"}
{"text":"My husband and I found this place on Yelp a few months back. We have been trying to nail down the exact month, however with an 8 month old, life is sometimes a blur. I remember going Valentine's day but I feel confident that wasn't our first time. Anyways, I digress. The food is great. The food is cheap. And the service is friendly. Go and enjoy!"}
{"text":"Good food although I wish there were more options on the menu as it was pretty small. Prices are fair for what you order as well :) they even give you the option to build your meal depending on what it is. The egg rolls are really good and are made fresh."}
{"text":"Food is good, my husband orders the deluxe pho which was supposed to include shrimp but didn't. He enjoyed it none the less. The spring rolls and egg rolls were both fresh and savory. I ordered the vermicelli chicken plate, the chicken had great flavor but was rather over cooked or burned. I orders the Thai iced coffee which was pretty small for the price and came premixed. Overall, the service lacked a bit mostly due to our unfamiliarity with the menu. Staff should perhaps inquire if customers have any questions or if they would like recommendations."}
{"text":"Just came here for the first time and ordered the Pho Dac Biet and the refreshing Soda Chanh and it was delish!!! The atmosohere is amazing and decor is relaxing! The staff is wonderful and very kind! Will be coming back!!"}
{"text":"I had never been here before and did not expect much.  I was quite wrong.  Upon first walking in, I found the atmosphere comfortable, clean, and very welcoming.  The music served as a nice classical piano backdrop, appropriately volume.  There were no TV screens blaring in the background, which was great.  All in all, the atmosphere was a welcome surprise.  The service was excellent.  We were waited upon by three people, all very polite and friendly.  And three people that were there just to do a job and do it well.  No joking around or wasting time or anything like that.  These are people very serious - and polite - about their business.  The food.  Have not had much experience with Vietnamese food, so I am not a great judge.  Except.. I like what was presented and liked how it was presented.  And the tastes are very nice and interesting.  So overall, my visit on 2-7-18, I give this place very high marks on all levels and will not only be back, but will tell other people about it."}
{"text":"Best pho place ive been to so far. Huge portions, good prices, and the service is great.   I ordered the pho with tendon and eye round steak and shrimp fried rice  The restaurant has a large variety of food in their menus including desserts such as macaroons and ice cream, they have sandwiches, and great appetizers  Will come back again when im in the area"}
{"text":"A few friends of mine took me to this place earlier this week. OMG! So so yummy! I got the seafood pho and spring rolls very tasty! Service was stellar! And the bathrooms were extremely clean. Love the atmosphere too!"}
{"text":"This is my best pho place yet so good, and it very clean there the food is also clean and fresh. They have so many fkavors of Boba Tea 35 flavors also different flavors of macarons love this place"}
{"text":"Love this place. Service and food is always great. Go here regularly and have never had a bad experience."}
{"text":"It's pretty good! The sandwiches are real good and pretty cheap. I ordered the bbq pork sandwich with spring rolls and taro boba. The whole order came out to $12 which is not so bad. Sandwich- $4.00 Spring rolls $3.35( I think ) Boba - $4.00  Overall, it was pretty good and I enjoyed the food. I would rate their food 7/10."}
{"text":"If I could give a 0 star I would! Not only did i get a third degree burn, I called the manager and he said it wasnt their fault ! You are suppose to make sure your hot contents are seales correctly, this could have been a major problem if it fell on my daughter ! I am so upset of how my hand got burned and for the manager to not even feel compassion for their error!"}
{"text":"I'm fairly new to Pho and Vietnamese food, it wasn't bad but it wasn't the best I've had either. It almost felt like every meal we tried was \"missing something\". It had a great atmosphere and decent service and prices!"}
{"text":"Best pho in town...every single time we come. Very friendly service, wide variety on the menu, reasonable prices! We visit here at least once a month and will continue to do so. Thank you for always being outstanding!"}
{"text":"The food is pretty good. My personal favorite is their banh mi. However, I'm giving them a 3 star because every time I want boba or the icecream macaroon, they're always out of it. The customer service is also not that great. The server would constantly look at me weird or just overall looks like he's piss with me and my family. I feel a bit uncomfortable and it's not a very pleasing experience, especially when I'm about to eat."}
{"text":"Pho 602 was amazing first time coming here very clean and staff seemed friendly. Had the beef stew, Pho 602, n matcha green tea Boba, spring rolls, n egg rolls kids got the kid pho disappointed on how small that was they were still hungry. Other than that everything turned out great."}
{"text":"So far the best pho place I tried in AZ. Their menu is a bit big though, I thought there was too many choices to choose from. I like how spacious and modern it was. Service was very good and everyone seemed to enjoy their food too. I ordered the pho deluxe. It sounds so fancy lol but I like how the meat were bite size. Broth was good and the veggie side was proportionate to soup size. Highly reccomend   Service: 5/5 Food: 5/5 Price: $$  Appearance: 5/5"}
{"text":"This place is still new and clean. I love the atmosphere and the food is great! Definitely traded DaVang for this place. The prices are maybe a dollar more than DaVang, but I don't mind because this place is clean, the service and decor are better. They even sell Boba smoothies!"}
{"text":"Didn't know what to expect at first when I first tried this place given the fact this place has been several different restaurants the last being a pizza spot. Had a great experience the first time and came again for a second time. Chicken pho is verrry delicious !! Service is great and friendly. Location very clean! If you're looking for some good pho in the area this is a great spot to try! At least for the pho ga! (Chicken pho)"}
{"text":"Pho 602 is a very good spot to hit while you're in Phoenix! Their appetizers were fantastic. I highly recommend you try their chicken wings! They're in fish oil which throws some people off because of the smell but they're absolutely fantastic! They're spring rolls were good as well. As for the entree I got theirs deluxe pho #9 which was the combination meat and was also really good! They're broth is pretty bland but good overall.   As for the service they were very polite, but were not too attentive we were not checked on for a water refill. It was nothing too serious they were busy, but that's usually what I spot out right away at a restaurant. Also, they were all out of macaroons which we really wanted to try/: so I guess we will have to swing by again.   Overall, great experience."}
{"text":"Good food we go once a week close to the best in the valley! Really good beef pho also the lemon grass chicken is awesome!!"}
{"text":"The food is ok. My favorite is the fried rice, chicken, shrimp, and beef. I tried the other foods, the soup they're famous for and a few other things. Spring rolls are ok. But talk about the coffee~ Iced coffee, dark as tar and just as thick, toned down with a bit of cream... and yoy have liquid crack, that's perfectly legal and delicious  The portion sizes are huge~ i wish they offered a lunch menu with smaller price tags smaller portions so you can eventually try everything."}
{"text":"Back at 602 after a long absence.  Greeted and seated immediately.  We both ordered #25 chicken and shrimp vermicelli bun with egg roll.  A handful of patrons here on a Sunday.  Food came quickly and was  beautifully presented.  The egg roll was crispy and fresh.  The shrimp and chicken were grilled nicely.  Very tasty with the fish sauce.  Glad we made it a return trip. Excellent prices and parking available."}
{"text":"I've visited this restaurant a few times before during their first opening and haven't gone back for a while.   I visited again last night for a craving of pho and I was not disappointed.   Our server made sure to tell us that the food and boba we ordered might take a little longer than usual because he is the only one working tonight.   We didn't mind and appreciated him telling us. My friend and I ordered a boba drink, chicken wings for appetizers and a bowl of pho each.   Their chicken wings were amazing! So full of flavor! Something I did not expect to taste when I took my first bite! Also for having boba, this restaurant is at the top of my list!   The pho was also good. I wouldn't mind coming in again for more!"}
{"text":"\"we cook everything in meat... Even the oil has meat\" when asked if they can make anything without meat: \"the tofu is fried in the oil with the meat\". Literally no vegetarian options. Have never encountered this at a restaurant in this day and age, let alone at a Vietnamese restaurant which has a culinary history of being accessible to vegetarians. Staff was perfectly courteous, otherwise kitchen entirely unaccommodating."}
{"text":"The food was great. Price very decent. Restaurant is very big and nice. Staff looks like they can use a little training still. But I think in time they will get it. Over all if I am in the area again I will certainly come back if I want Vietnamese."}
{"text":"Sadly I have to downgrade my rating to only 2 stars.  I've been to Pho 602 a couple more times since my first visit in April 2015, most recently over Christmas and the service, or lack thereof, hasn't improved at all.  This is unfortunate because the food is good and the staff is generally very nice.  They still struggle mightily on actual service - the thing is, it's really basic stuff and in a rather non-busy environment.  This last dining experience, the restaurant was about half full.  However, there were two large parties, ours (11 people) and another (12 people or so).  The other party arrived just before us, which of course isn't the problem.  The problem was that the staff is incapable of serving multiple tables at once.  In addition to three other smaller tables (less than 4 guests), we had to wait until the other large group got their drink and food orders served before they could serve us.  To be clear, they did take all of our orders as any restaurant would normally, that is largely one after another.  However, the food and drinks only could come out one table at a time.  One table was served from beginning to end before they moved on to the next table.  This obviously results in a very long wait.  More frustrating is that they brought out entrees first, appetizers second and drinks last.  This was after an hour wait.  Their inexperience was also highlighted by the fact the server brought out three bowls of piping hot pho and placed it on a table far away from ours.  As he lifted the first bowl, which again, was filled to the brim with piping hot soup, you could tell he knew something bad was going to happen - that look of \"oh crap, this is hot!!\"  He sped up, but by the time he got to our table, it was clearly too hot for his hands, he let go of the bowl and spilled nearly all the pho (and hot soup) on the table. My brother-in-law amazingly escaped with little more than some soup on his jeans.  However, it nearly spilled all over my nephew and with the temperature as it was, would have been bad news for the little guy had the soup spilled on him. What was surprising to me was that he tried to repeat this with the other two bowls - thankfully my wife stopped him and told him to put the bowl on a plate to help stabilize the bowl and relieve him of the heat.  To the servers credit, he did come back to ask my brother-in-law if he was ok.  However, nary a word from the manager - no sorry's, no \"hey, we'll comp that for you\" - nothing.  Another 20 minutes go by and we're about halfway through our meals when they finally start bringing out the drinks.  It should be noted that we asked about our drinks and food several times during our hour long wait with nothing more than an \"ok\" as a response.  Our bill comes and we noticed they didn't charge us one of the iced coffees.  Candidly, given the wait and the spillage, I was going to ignore it.  I thought a free drink was the least they could do.  Nope - the waiter comes back and says, \"Oh, I forgot to add the iced coffee.\"  Suffice it to say that I will not be coming back to Pho 602.  As noted earlier, this is unfortunate given their good food.  However, the horrible service, long (unnecessary) wait and clear disregard to make any attempt for a decent dining experience cannot be overlooked.  I noted in my last review that if Pho 602 could get over their service issues, they'd do really well.  However, it seems they've regressed in that area substantially."}
{"text":"This place definitely has the best Pho in town!! On top of that, they're service is awesome. Totally recommend."}
{"text":"My boyfriend and I love this place. We have been fans since day 1, since it opened we would come here to eat religiously. We always get the Pho, I usually do the Shrimp Pho and my boyfriend likes to bounce back and forth between the Chicken Breast and Shrimp Pho too. The shrimp spring rolls are delicious and the peanut dressing that goes with them is a1. Nowadays we don't go as often as we used to but every time we do go its a delight. The service is always great and they are quick too. It's a great place to go, so yummy."}
{"text":"For a Vietnamese restaurant's in the Valley this location is decent and better than a few others. The price is a bit pricey for the amount of foods given. Saying that best stick with the main foods and their specialty not the appetizers (not worth the money and most are so-so). One last thing, for the tips always give the tips personally to the waiters because like many other Vietnamese restaurants including this one in Arizona the owners always get to keep the tips leaving none for their waiters.... I know it's mess up so best give it to them and put it into the hands personally saying it's for them."}
{"text":"Restaurant was clearly brand new \ newly renovated, and was spotless inside.  Service was slower than most, but on par with most Viet restaurants.  Broth wasn't great but not as bad as other Valley spots. Lots of meat and noodle for the money--solid in that regard.  Tried egg rolls and spring rolls, neither were impressive."}
{"text":"Great great food! Large portions, super helpful, friendly, attentive staff (they are all related and all work well together). Definitely have some of the macaroons!"}
{"text":"The pho at Pho 602 is really good for the prices! The times I've gone I've gotten the 'Create your own' pho (which is a fun idea) with the beef meat ball and the eye round steak. The menu is pretty extensive with a wide selection of appetizers, noodle soups, vermicelli salads, and rice dishes, so there's plenty to choose from! They also have a fun dessert section with macarons and ice cream that I'm looking forward to trying in the future.  The restaurant is clean and big in size. The service has been off and on the few times I've gone, but it has never been 'bad enough' to keep me from wanting to go back when I'm in the area."}
{"text":"Came here for their ice cream macaron. I got the taro macaron with strawberry ice cream with fruity pebbles. It was pretty good. I live in the west valley and it was worth the drive. Workers were nice and friendly. The dining area was huge! Very clean and welcoming. I would make the 35 min drive just for their macaroons again. Gave a 4 star just because I have y tried their food. But I will be back =)"}
{"text":"Judging how good of it's taste is somewhat subjective.  Everybody has different taste and it is a personal experience.  However, Pho is different.  Pho is increasingly popular for dine-out in America for every occasions regardless if that is for breakfast, lunch, or dinner.  You can have Pho anytime! (My best time for Pho is for a cold winter day.)  So, judging Pho can be objective if you're like me, an American with Vietnamese's experience.  Pho needs to have the following basis: 1. The broth needs to be tasty with the balance of salty and sweetness from the slow cooked of beef bones and beef meats. 2. The beef, and tendon, need to be soft, juicy, and easily chewable; the right doneness. 3. The veggies that go alongside with the soup must be fresh, crunchy, and clean. 4. The temperature for the broth soup must be hot, I mean hot, not warm.  One little note here: Sriracha hot sauce, and hoisin sauce are optional; if you have to mix them with your pho to make the soup tastier, then your pho is not that good.   Pho 602 has all the basis and more. It's presentation of the bowl of pho when it is brought to your table giving out the aroma that's really make you to swallow your saliva! Wow! that's I say the true authentic of Vietnamese pho, not the imitation from the Chinese, Korea, Thai or any other countries that try to copy it.  Well done Pho 602."}
{"text":"Pho is fresh and delicious. Chicken wings and tofu spring roll are perfection!! Service was awesome and prices are great!!  We will be back!!!"}
{"text":"They had a great broken rice with bbq pork. It is better than any restaurant in phoenix"}
{"text":"The Pho was good can't complain about that , but the service just made it a completely experience. Waiter only cane to the table to take our order , and to deliver our food. Other than that M.I.A . Never came back to check if everything was okay at all even once . I never got a water refill . I had to personally get up and ask, they weren't even busy. I personally don't recommend this place . Horrible customer service. I as a customer will never come to this location again."}
{"text":"Average Vietnamese food. Service was slow. Loud hip hop music. We asked them if they could change it and they said no :( took them forever to come to our table. Price is ok but I've had better pho at other places in the valley"}
{"text":"Amazing service... And amazing food! Absolutely love!!! Prices are so affordable and the employees are welcoming and friendly."}
{"text":"Funny how most of the good reviews are from people with ZERO friends? Hmmm, me smell something fishy!"}
{"text":"It's definitely a nice place - clean and modernized decoration. Food was good - first time visited. I will come back...and bring a few friends. I was craving for Bò Kho, it tasted okayed - missing a couple of authentic ingredients (for the Vietnamese taste-buds). The service was definitely good. My company had Ducks with noodles soup - which was tasty, accordingly."}
{"text":"The bbq pork on my bun was charred which gave it tremendous flavor the only place I've ever seen that was in Las Vegas. The spring rolls and egg rolls I had were also fresh and very good. The service was prompt and courteous and the decor very nice. I will definitely be back."}
{"text":"This was my first Pho.  I really enjoyed it.  There was lots of variety on the menu.  Service was a tad slow, but it was ok.  I'd go back to try a different flavor!"}
{"text":"I have been here twice to this new Restaurant and I love it the food is great!  The wait staff and all the employees are very nice and helpful when you have questions about the cuisine.  It is very nice place love the interior and that they also have an outside area to.  My new favorite Vietnamese Restaurant!"}
{"text":"The noodles in the pho were cooked too long and were mushy/stuck together in clumps. The flavor just wasnt great. We also ordered the chicken stir fry w/ rice noodles. It was so greasy we couldn't eat it. Maybe this was an isolated incident but we won't be back."}
{"text":"Was excited to try this place for the first time but was very disappointed. My friend and I walked in and sat down and stared at the menu. We waited about ten mins and still no service, not even a hello from the waiter. The restaurant wasn't even busy. We got so bored that we got up and left."}
{"text":"Beef Pho ...the special one with tripe, tendon, and all the other delicious beef things!   Started with the crispy pork egg rolls ...very tasty. There is some pickled white vegetable on the plate with them that was delicious.   Lunch provided great service on the front side....but sitting here waiting for my bill for quite some time....  Good broth.  Fresh vegetables.    Large portion for 7.95 Pho. (Imo)"}
{"text":"I hate leaving bad reviews but I know that I would want to know if this was good or bad before I went. My husband and I like to eat Pho every couple weeks, we love a couple places in Central Phoenix.  We saw this had good reviews so we tried it... The food is very mediocre we tried the fried rice and the stir fry noodles and it was very mushy and bland. We also tried two types of pho and it was overwhelmingly flavored like cloves. Very odd!  Nice people but definitley did not taste like the more authentic pho places we usually go to."}
{"text":"I first tried this place when it first opened. The food was good, but the service was slow. Although, they just opened and they were new to it. I couldn't be mad. Now, about two months later, I tried the place again. The service was better and the food even got better. The waiter was super nice and helpful. The food portions were large. It was soooo much food, I honestly couldn't believe it. Also, they now have boba and their boba was really good :)   They are new still, so I know they have a lot of potential and have room to grow. I am excited to see where this restaurant is going."}
{"text":"I did not actually eat in. I ordered the food to go and had it at home. I received everything I needed for the classic steak pho and it was absolutely amazing. I was worried because I never ordered from here. And I figured I'd give it a try since it's down the road from my house. I will definitely be coming here more often for my pho. I see they also have macaroons but I was not able to taste those. So next time for sure. I say give it a try. I'm sure the other items they have are great. Can't wait to go back again!"}
{"text":"The pho is delicious! They give you a lot of food and it's very inexpensive. You have to get the coconut juice! It's a real coconut and it is simply delicious. Very clean and nice inside! They also have boba"}
{"text":"We normally stick to Da Vang when it comes to Vietnamese food. I figured change it up and give Pho 602 a try after reading many good reviews. We needed a place that can accommodate a large group. The restaurant is so spacious, clean, and even have a stage for special event.   The service started slow but once we have everyone ordered, our waiter was great and friendly with our demanding group.   As for food, I don't know if it was just an off day, but the grilled pork chop and shaken beef were so tough, it was unchewable. My dad had the grilled pork chop over rice. He couldn't even finish the meal. Those dishes looked mighty tasty, but the look can really deceive you here! They probably never tenderized them or just purchased cheap meat. We got a few chefs in our group. You can never trick these food tasting experts.   We orders a few apps included chicken wings and fried egg rolls. I didn't try them but must be good since they disappeared quickly. I ordered the seafood pho. A good amount of crab meats, shrimp, calamari, noodle, and soup. The soup broth was hearty, flavorful, and not too oily. I had ordered the Viet condensed milk hot coffee. It was pre-made, a little disappointed. It didn't taste the same without the coffee dripper - less bold, I think.   I will still return to try other menu items and maybe an ice cream macaron too. Don't forget to check-in for a free soda!"}
{"text":"Came here for dinner with my parents. huge restaurant, very spacious. Nice layout. I like the back splash. :) Anyways.. The service was horrible. My mom would order something and he kept saying that they don't have it in yet. 4 times.. haha. Oh geez. Anddd they had ONE server. 35 minutes for our entrée to come out. Andddd I never got my hot water after I asked twice! My moms ordered mi Bo kho. Her noodles was hard she said. And the meat was super soft and wasn't tasteful.. my tufo vegetarian rice was soggy and cold. :(   This place isn't for me..."}
{"text":"BY FAR THE BEST PHO PLACE IVE BEEN TOO !!!   This restaurant is extremely CLEAN !!! And very pretty !  The staff is super friendly and understanding !   Too the chef behind all this madness \"Great Job!\" Hands down the best pho I've EVER HAD!!  Not only is the food great, the attention to detail in their food (Knife skills) is a plus for me !!   And if your not looking to get anything savory ?? They have BOBBA AND THESE YUMMY MACAROON ICE CREAM SANDWICHES!! Yummmm!!"}
{"text":"They have very good service which is unlike other viet restaurants I have been too. The pho is spectacular, extremely delicious. My son gets chicken with broccoli and he beyond loved it. The owner was very nice and even came to check on us to make sure everything was good. I am so glad this place is so close to my house. This is my family's new go to pho place. You must try it!"}
{"text":"The service was a little on the slower side, I had the Spicy broth pho which was pretty tasty. But mom order the seafood combination noodle stir fry and it wasn't really flavorful. Don't think we'll be coming back since Little Saigon in Glendale is closer and much better."}
{"text":"Decided to go here because my usual Pho place is closed for the week. Walked in and had a great first impression of the place. We ordered to go and went straight to the counter where we were greeted rudely and had to wait awhile before someone could even take our order. Like any Pho place, i just order chicken pho and was asked by the girl what number it was on the menu which i clearly did not know. So I had to search for it myself. We were told it would be about a 10 minute wait, which was fine.  While waiting at the front counter i observed each worker running around in chaos not knowing what was going on (typical for a new restaurant). Ended up waiting about 20 minutes for our Pho.  As for taste, it's like any other pho bowl I've had, except they use different chicken than I've had at other places. This place seems to use something like a rotisserie chicken which was unusual for me, but it still tasted great!  Three stars because of service. They are a new restaurant and could use some improvement."}
{"text":"Their food taste plane and I came all the way from surprise to  give this place a try after I seen the reviews....let me down survives is slow and rude .. but I'll stick to pt Noddles or Saigon kitchen in surprise if ya want to try real Vietnamese food"}
{"text":"Saw this place with good reviews so my friend and I decided to try it out. We ordered the spring rolls and egg rolls for appetizer and they were suprisingly pretty good. The eggroll tasted different but in a good way. I got the pho tai and had the meat on the side. Broth was decent and all together it was a good experience. Will be returning to try the sandwich and the rice dish!"}
{"text":"Tried Pho 602 yesterday and had a great lunch. Service was good, the staff was really nice.  I got the chicken breast pho soup and it was really good. My husband got the number 15, he said the pork was delicious. The eggrolls were possibly one of the best I've ever had.  The milk tea bolba was amazing. The milk tea is a blend of green, black and red tea and is beyond tasty. Their fresh squeezed sparkling lemonade was refreshing and the perfect amount of sweet and tart. I will definitely be back!"}
{"text":"Best Vietnamese food. I tried shrimp spring rolls, fresh tasty and peanut sauce delicious. The vermicelli chicken and shrimp salad bid portion, super tasty. The taro and bublegum macaroons super sweet. So good I came back the next day but found out there closed on Mondays... I will be back soon. So, so good!"}
{"text":"My family and I are regulars here, we LOVE trying their new specials but we have a few go-tos. Their bahn mi, salt/pepper tofu, shaken beef, beef pho, beef rib pho, and vermicelli salads are all soooo good. On top of their great food they have AMAZING customer service. T is the best server and he always knows just what to recommend."}
{"text":"By far the best Pho place for miles! Amazing Thai tea (which we got for free by checking in), I got the meat pho which is awesome and my boyfriend got the fried chicken wings which were BOMB.com! Service so so friendly and very clean restaurant. Super cute (or if your a guy reading this: super awesome) environment. Definitely recommend- definitely will be back- and definitely satisfied!"}
{"text":"Hands down the best. Pho was amazing, atmosphere is awesome. Will definitely be making this a regular spot. Thank you"}
{"text":"If you're considering takin your girl out on a date and she cravin Pho like my girlfriend was cravin Pho, you gonna get some major brownie points for takin her to Pho 602! She couldn't stop talking about how cute the place was and how friendly service was! They gave us each a free thai tea drink with our entree even though I wasn't able to check in on yelp because of poor signal strength (freaking sprint). Anyway the food was great, the atmosphere was \"cute\" the service was fantastic and we are definitely coming back here again when the Pho cravings come back into town! 10/10"}
{"text":"Fast service the food was nothing out of the ordinary and it is a small location so everything was really really crowded. The food was cheap and service was fine."}
{"text":"I have been to other pho places and this one would be one of my favorites, it's less crowded more space and the food was so good and prices were great. I will definitely be coming to this place more often. I wanted to try a little of everything but it was so much food we couldn't eat more."}
