{"text":"This place is average. Your normal pho place, no twists or anything unique. Though consistency is a blessing. The food is delicious and the service is quick and easy. I didn't see my server after she handed my food but I understand because I was in and out. The spring rolls were small to me and sort of a bummer but it's still worth it as it tastes great. The bubble tea didn't seem fresh as they indicated but it was very very good. I would definitely come here if I was in the area."}
{"text":"I love this place! For less than $8 or $9 you can get a great bowl of pho, or for around $10 many of the other dishes on the menu.  The service can be quite fast, especially if you get the soup.  Like a previous reviewer had said, the service isn't very personable (i.e. give order, get food, pay at till), but I don't mind efficient service, especially when they have no qualms about you taking your time in enjoying your meal.  The jasmine tea is free as well, which is nice as many places in town will charge for that.  There are two TVs in the venue which is a nice touch.  Bathrooms are clean.  I normally have the Pho Ga here (chicken noodle soup) and the chicken is always tender and moist.  In some places, it's tough or stringy; not here.  The broth is dark, but it has a sweetness to it.  My favourite part about this establishment is that for around $10 (and many times less), you can walk away satiated.  Highly recommended if you're in the area and are looking for a place to fill up for cheap.  21/30"}
{"text":"One of my favorite PHO restaurants in town located in the Pacific Palace in the north east of Calgary very tasty sate dish which Is my fav to try when having pho! The service is always great! And the dish never disappoints! Plus the Pacific palace offers of experience with all of its variety shops! I recommend trying the sate dish #20"}
{"text":"This is the second time my girlfriend and I been here and they never disappoint! When comparing their normal and large size orders, it does show a great big difference. To make it short, Pho Que Huong is a must try and they for sure got my vote for coming back.  By the way did you know they own a food truck too?"}
{"text":"No matter how often I go, I seem to experience irresistible cravings for Vietnamese food. In particular, I've recently been on a kick for a good pho satay.  Pho Que Huong makes a good pho satay.  I came by for a quick lunch on Friday before starting my weekend. It's a non-descript location, tucked away in the food court of Pacific Place mall on the opposite end from T&T Supermarket. Yet it was still constantly busy with customers during the busy lunch hour.  The decor was sparse, the windows opened onto a parking lot, and it was poorly lit. Marking my order on paper, efficient service with few words spoken. All appropriate for a good, cheap ethnic restaurant.  And the food: My pho satay came out in a couple of minutes and was surprisingly generous even for a large order. Nicely sliced rare beef and a good-sized portion of satay sauce, making for a very tasty broth.  A quick, tasty, cheap, satisfying meal. I craving has been sated... for now. A convenient stop when I find myself in NE Calgary.  $9.00 including tip for a large pho satay."}
{"text":"If you're in the area, then give this place a try.  Their Pho Satay is quiet good although not my favorite.  Service is pretty much - write what you want, here's your food, see you at the till.  Food = 2 stars Would I come back?  = sure if I'm around the area 1 star"}
{"text":"I ate there last week and the people there were so friendly. I had the satay soup and it was very good. I have had better but did enjoy it very much. I would go there again."}
{"text":"Besides heading to my folks for my mom's homemade food, there's very few places I'll hit up when I'm craving Vietnamese food. I mean, why mess with the best? ;)  I'm always met with the same reaction every time the discussion of pho comes up: Everyone under the sun: OMG, I loooooooooooooove pho. You must get to eat it all the time! Me: Actually, I don't really like pho  This is followed by a bug eyed look of bewilderment and then \"WHAT?! How can you not?!\" Yes, I'm sure my ancestors are stirring in their graves in disappointment, but I'm not a soup person!  HOWEVER, whenever I'm here at Pho Que I actually get the pho because I really like the flavoring in their broth (not loaded with MSG) and their noodles are kinda chewy - which is the way I like them (I know some people like their noodles soft - at that point I think they're mushy)  Their other dishes are quite tasty too - I've had the charbroiled pork with rice and spicy beef with noodles - YUM!  True to most Asian restaurants, you come here for the food - not the service. I honestly don't mind ordering my food and being left alone till I'm done. Everything you need is brought out to you with your food and utensils/condiments are already on the table."}
{"text":"Let me just say that I have never had such fast service at a sit down restaurant - ever. Once we walked in we were greeted and brought menus and a hot pot of water (Not sure what that was about) we thought it was tea... but it wasn't.   Anyways, within minutes we had our order in and seriously not even 10 minutes later we got everything we ordered.   I have to say it made me question freshness a bit but I wasn't about to complain because everything was super good.  We ordered salad rolls, spring rolls and a chicken lemon grass vermicelli bowl plus two iced coffees.  The only compliant that I would have about this place is that I kind of felt rushed but let me tell you, next time I am in the area I will know where to go if I want some fast tasty Vietnamese!"}
{"text":"I come here regularly, and I'd say that the pho here (#18) is arguably the best in the city.  The portion sizes are the right size, and they actually put some meat in the bowl of decent quality; where as the other places I've been going have been cutting back and reducing the quality.  The ladies are super nice, quick and efficient.  Best of all - they actually put napkins on the counter.  It DRIVES ME NUTS when Viet places hide the napkins to save a few bucks!!  If you haven't been here, your missing out.  It's a staple."}
{"text":"Very Clean & modern dinning area. Family owned business (2nd generation). Good service, food was fast. Large Pho for under $10 with good portion, very good deal. Soup is hot and tasty, soak the rare beef into the soup to cook to medium rare... Perfect!!!!  Bun Bo Hue soup was hot & pretty good, but just lacking a bit of spicy kick to it. The bean desert was good portion & up to the standard. Recommended it!"}
{"text":"My roommate and I were in T&T and decided to give it a whirl.   I'm glad we did because it was amazing.  I will probably neverb try another pho in my life for fear of being disappointed.  The staff it's friendly and ordering was simple."}
{"text":"I think this place gets a lot of it's customers from the hungry patrons in the Forbidden City line up - just can't wait any longer!  It's clean, the food is fine, service is fine, prices are fine.  It's fine!  I had the beef satay soup, as always.  No match for Bagolac's but some nice heat and flavour. My family were all happy with their meals, standard stuff, vermicelli with spring rolls along with some salad rolls.    I wouldn't hesitate to return, but I wouldn't drive too far."}
{"text":"I grew up eating a lot of Vietnamese cuisine and I've tried a few Vietnamese joints in Calgary already and I really do like this one. They have a wide selection of items on their menu, from salad rolls to pho bowls to vermicelli to rice dishes. Everything a Vietnamese restaurant should have. I also enjoy their drink menu, lots to choose from. Their service is quick, food in my face in 5 minutes. Also, their prices are under $10, because truthfully pho bowls should not be anymore than that which I find happens a lot in the more \"mainstream\" Vietnamese restaurants. This place would get 5 stars if their soup had just a tad bit more flavour to it, I like a strong kick in my soup, has to be like my mom's.   All in all, great Vietnamese joint, I come here almost every week."}
