{"text":"pretty decent thai food. very clean restaurant and good service. totally worth lunch or a quick dinner."}
{"text":"Amazing pho. Whenever I visit my parents, we drop by this restaurant. Very friendly atmosphere, clean and the food tastes fresh. I recommend their bun bo hue (a spicy noodle bowl), if you want to try something different. Delicious!"}
{"text":"This place is down to earth and friendly. The staff are incredibly friendly and the food is authentic. Pho is one of my favourite meals and I'm really glad I've found a place so close to home and that isn't super packed!"}
{"text":"Food was hot and fresh. Broth was tasty and meat cuts were lean. Restaurant was clean. Service was quick and courteous. Prices were a little high but not outrageous."}
{"text":"Quite tasty. Been here a few times and I've always been pleased with the food and the reasonable prices. The decor is clean and not overly loud or distracting. 

They have a very decent menu and I'd definitely recommend the basic phö. Not many places get the flavor right, but they have it spot on."}
{"text":"I ordered the rice, pork chop, chicken, and egg. I would not recommend it, the portion was fairly decent but the meat was charred. Usually I am good with charred meats to have the bbq taste and texture but this was just over the top and it tasted like smoke. Overcooked.. I would give it another try, perhaps they were busy with orders and had to rush to get mine through? Hopefully their pho is better!"}
{"text":"Pho was good. It was flavourful. However the restaurant was filthy. My husband had to use the washroom and advised me not to use it because it wasn't nice. From the looks on the floor and meat that was on the floor that i kicked i agreed to just wait to go home. I wasn't enjoying the colour and decor of the place too. So we just quickly ate and left. Don't think we're ever coming back."}
{"text":"3.5* Tried pho at Ao Sen for the first time last night and was not wowed as expected. I'm Vietnamese though so my expectations are high. Still love their bun bo hue, best I've had in town and service is always on point."}
{"text":"I like this place. It is run by a hard working family. I'm not familiar with this type of cusine but from what i had it tasted fresh. I get the pho with noodles, yum! Its local for me, and the family is nice and hard working i respect that.

Edit: When I get the pho for takeout, I can tell that the noodles were pre packaged and ready for takeout. Obviously they sell alot of them. The problem is they stick together and spreading them apart is a task for the special forces. 

Otherwise tasty though."}
{"text":"I have been eating (and doing takeouts) from this place since they opened, and just realised I had not posted a review. My bad. The pho here is awesome (we always order the House special). Freshly made, and wholesome. Fresh Shrimp rolls are fantastic, as is the Grilled Pork Chop and Chicken with Rice. One of their best dishes is the beef cubes with rice. and we love their wonton soup and chicken congee. These are our go to foods when we are sick and not feeling like eating, these dishes nourish us. The staff  treats us like family. Wonderful home cooked food, excellent service, extremely reasonable prices, what more could you wish for :-) ."}
{"text":"Terrible food, very bland. Pho is definitely not authentic. They ran out of some items on the menu. Waiter also forgot about my drink order. Restaurant quite busy during weekend because of the limited options for Vietnamese food nearby."}
{"text":"It's not my favorite place for pho, but other dishes are pretty good here. Their broken rice dishes specifically, large portions of meat, shredded pork skin, egg and veggies. 

Their pho is okay, just not as packed and as much beef flavor as other places. 

Their bun bo hue is pretty good, as is their egg noodle soups. 

They are famous for their chicken wings, and for good reasons. Perfectly salt and peppered, crispy and good sized! They are on special right now actually :) 

The service is always good, friendly and community based!"}
{"text":"Food and service was excellent."}
{"text":"I am so happy to find an authentic restaurant.  I LOVE Viet food.
I have lived in Hanoi and Ho Chi Minh Vietnam 4 years when I used to work for the embassy. Stationed there for 2 years so I got to experience the street vendors and best fine cuisine Vietnam has to offer.  So coming back to Toronto, I have been searching for the best Pho and Viet food.  I have found one today!
I ordered Bun Rieu (Crab meat soup) and my sister ordered the Bun Bo Hue (spicy beef noodle soup).  Broth is sooo good.
It's not your typical franchise restaurant  where their broth is so salty and lack the key essential to make it unique.
I love this place!!!!"}
{"text":"Am I just cheap or is this place sorta pricey for Pho?  (If you think I'm cheap, don't answer that question.  ;)  A small bowl of pho is $7.25 and small = small.  I saw other orders of broken rice and they seemed to be a bit on the smaller side as well.  

They defo scrimp on the meat portion, that's pho shizzle!

I've had this place bookmarked for a while and only got the opportunity to visit on the way back from Premium Outlets.  Otherwise, this place is waaay out there for peeps who live in City Centre (or even more South).

Good:
-  pho broth
-  the noodles in the Crispy Fried Noodles dish

N/I:
-  sauce in the Crispy Fried Noodles ($11) dish was clumpy, but tasty, but still clumpy.  Also wasn't too much variety in the ingredients.  Seafood (i.e. shrimp, calamari) was from frozen - fine - but it had no flavour
-  Viet iced coffee - Not the best that I've had, definitely need MORE condensed milk.  I should've asked for me 'cause it was too concentrated
-  portions (again very small considering $$)

SERVICE was a bit sloppy, slightly unprofesh, and on the sassy side.  First of all, waitress tipped the hot, Viet coffee carafe all over the table.  Fine, accidents happen.  Then another waitress, while bringing a new carafe, said, \"Don't hit me now\".  Excuse me??  I didn't make a big deal about it, but it's slightly rude to accuse a customer of purposely doing something to cause a spill.  I just corrected her and said that the waitress tipped the tray and that's what caused the spill.  I found this comment a bit unnecessary and offensive.

I also observed another table sitting around waiting, and sassy waitress said, \"Oh, you never got a menu?\"  They were sitting for at least a few minutes.

I have no problem with young, 20-somethings waitressing in their sweats, but keep potentially offensive comments to yourself...or in private, amongst your colleagues."}
{"text":"This place wasn't bad. It was an impromptu stop after shopping. The satay pho was good. I found the curry chicken with French bread a bit diluted and the bread was stale. I would come back but only for the pho."}
{"text":"Decent food but nothing out of the ordinary. Pho was hot and very hearty. Lots of good meat even in the small. Pork chop and chicken on rice tasted ok but I didn't like that it came out cold. Service was great (for pho) and the server was very attentive and polite. Looks like a family run place. Not a big place but plenty of tables."}
{"text":"I like this place better than most pho places. There food is fresh and the service is friendly.
And guess what, they deliver! I just found out they delivered recently and I am quite pleased. 
The beef soup and grilled chicken on rice are my two favorite dishes. I really enjoy that they remove the skin from their grilled chicken dish. I really don't have anything negative to say about this place. If you like pho this is one of the best in the city in my opinion."}
{"text":"Stumbled upon this after heading to Fo gong Shan temple, as their tea shop was closed due to a special Buddhist gathering! 
Their rolls were yummy! The pho were pretty decent! Place seems pretty clean! They weren't very busy on a late Sunday afternoon, a large party occupied most of the restaurant hence they had forgotten our condiments with our Pho! Their Vietnamese Espresso was delicious!"}
{"text":"horrible horrible customer service and mediocre food!  do NOT eat here!"}
{"text":"I was pleasantly surprised to find a good pho restaurant in the Meadowvale area. While the reviews on Yelp were not great, the reviews on Google were amazing, so my husband and I decided to give it a try. The restaurant has a small store front and located next to a Chinese take out joint. There are only a handful of tables and appear to be a family-run business. We went on a Saturday night at 7:30 and only half the tables were occupied. The restaurant was clean and had a small fish pond right by the entrance. The utensils were individually wrapped with napkins - I don't really like how most pho restaurants leave the chopsticks and spoons out in the open, it's not very sanitary - so this was a bonus for me.

I ordered the tom yum pho noodles with beef and my husband (who doesn't like pho) opted for the seafood crunchy noodles. I ordered the medium bowl and for $8.50, the portion was ok. The soup was quite spicy, which I liked and really did taste like tom yum soup (I've had tom yum soup that tasted more like sweet and sour soup). I would've liked more ingredients in there other than just beef slices. The noodles were cooked just right, chewy but not mushy. My husband's noodles came in a bird's nest shape, with the seafood and sauce seeping through. The flavours were there and they could've put in more than 2 shrimps and some pieces of calamari. There were plenty of veggies and fishballs.

They also have a $6.99 lunch menu that includes some sort of protein (chicken, pork or beef) with fried rice and a drink. I will have to try that some time and will update my review then."}
