{"text":"Sadly we arrived at 7:23 on a Monday and they were closed. Sorely dissapointed, I was looking forward to Pho."}
{"text":"The food was delicious. This was the first time I got freshly brewed Vietnamese iced coffee and it was great. The service was very friendly."}
{"text":"Welcome to the East Valley Pho Viet Nam #2 

I have dined here many times since they have opened...always delicious and wonderful service. It is nice to have a variety of cuisines in the area without driving across town."}
{"text":"First off, I couldn't tell the difference between a dry cleaners and a restaurant. The atmosphere is, for me, just as important as the food and they sh** the bed on that one. But the food was exquisite and if you need a Pho place to try, this is it."}
{"text":"Been to many Pho joints, this one is great. Close to my work good selection and super nice service!!"}
{"text":"Finally a good Pho place in Mesa. This is our third time here. Friendly, good prices and great pho. Had the #16 Deluxe Pho and it was delicious!"}
{"text":"Great portions for very cheap authentic Vietnamese. Try the #15: It is PHO-nominal!

A little hard to find...go south from the intersection of Higley & Brown"}
{"text":"I am so happy that there is pho nearby!!! Yay! The food is excellent. The broth of the soup is very tasty and I almost slurped up the whole bowl! I got the chicken pho and it was delicious. The staff was very courteous and welcoming. People are flocking over here which is a good sign!"}
{"text":"4.5 stars. I had homemade pho once. Since then, I''ve been to many a pho restaurant in Arizona searching for a bowl that tasted like the homemade one. This restaurant has excellent pho. The broth is warm and fragrant, all the toppings (lime, bean sprouts, jalapeños, basil) are there, and there is plenty of meat. The filet mignon pho (pho tai mem) is worth the extra buck.

The only thing preventing five stars on this review is the service. The food was slow to come out and came out separately for each of the three people at our table, but that was a small matter. The servers are friendly and accommodating; if you asked them to do something, they will do their best to make it happen. However, I place much more weight on the flavor of the food than on the ambience, and Pho Vietnam certainly does its job."}
{"text":"Everyone should try this delicious restaurant. It is so fun to explore the menu. We haven't gotten the same thing twice yet and we have loved it all. So happy about this restaurant being open in the east valley!"}
{"text":"A little over priced, quality of meat was ok, egg rolls was cool, I understand that some places raise the price on the food if serving quality dishes, but the seem a little over priced because the place seems pretty empty and their just trying to take care of the overhead."}
{"text":"I've been here twice and will come back. I enjoyed both my meals; steak with rice and egg noodles and chicken. My wife enjoyed her bun more than the lemongrass chicken, which had a gamey taste. The chicken in her bun seemed almost like tandoori chicken.  We haven't tried the pho."}
{"text":"Our first time here I ordered the #15 and the pho broth-my favorite part-was out of this world. Only giving 4 stars because the noodles were stuck together in a bowl shape at the bottom. Crispy egg rolls and the #16 my husband got were delicious as well. Waiter was super friendly and took care of the tables well.  

Hard to find at night it's at the tip of south end of the shops by Bashas. 

Next time we're in Mesa we'll be eating at Pho #2!"}
{"text":"We thought we would try this place 
Went in and felt like we we in a 80s themed restaurant
The waiter was not very well versed in the menu
We order the Pho
It was awful the egg rolls smell like spoiled food
I've been over Southeast Asia this food was really bad substitute 
I do not recommend"}
{"text":"Me and my wife where excited when we saw the coming soon sign for Pho. We live around the corner and drive too Dobson and University for Pho. I have 4 young kids and always bring them with. We have been there 4-5 times and have never got any attitude for the messes they create, the love dumping soy sauce. We always have the same guy server, some times he gets backed up, they only have 1 server I believe. Wait has never been too long. We always get the same thing, filet soup and fried egg rolls. It is deliciousness. I'm no pho expert or can't speak for other things on the menu but the filet is great. Always been a clean place too with my wife is anal about."}
{"text":"I hate to write anything negative about any business, but a fly in the pho, you all need to know!  yuk!
Zero Stars if it would allow."}
{"text":"Excellent pho, and very friendly and inexpensive. Spacious and relaxed. My favorite is #13 with extra sliced filet mignon. Great to have a good spot for pho in the far East Valley."}
{"text":"Just had my first meal at Pho Viet Nam #2, and am so glad that they're in Mesa.  (Watch out valley, we're getting some culture over here!)  It's a cute, clean place with lots of booths and comfy seating and a couple flat screen TVs.  It was around 3pm on a Friday when I got there, and I was the only customer after a normally very busy lunchtime.  The food came out reasonably quickly.  I've been looking everywhere for good vegetarian Banh Xeo, and was extremely pleased with it here.  Light and crunchy (like you want it!), yet containing lots of veggies, and very thin pieces of tofu inside that were crispy on one side so as not to moisten the pancake.  If you want it vegetarian, tell them no fish sauce.  They'll give you a very nicely sweetened soy sauce which was great.  Chili sauce, Sriracha, Hoisin, and other sauces are at every table.

I also had the tofu/veggie spring rolls, which come with a peanut sauce with shredded carrots and maybe other veggies in it.  Really delicious.

As good as the food was, I was maybe most impressed with Tony, who was busy filling sauces at the tables and prepping for the dinner crowd.  He chatted pleasantly as he worked around me, enthusiastically answering all my questions about the menu.  Though very young, I really thought he might be the manager or the owner's son because he has the perfect attitude and demeanor.  He never wasted a moment the whole time I was there.  Mindful, professional, and friendly.

I really want to give this place five stars, but am holding one back due to the somewhat limited vegetarian menu options.  A five-spice noodle soup or something would be a great addition.  Those of us that fell in love with pho but don't eat meat anymore have this hole in our hearts now.  Please fill it with something as close to pho as you can muster.  Until you do, I'll be trying out your four other veggie noodle dishes and being grateful you have them.  Welcome to Mesa!!"}
{"text":"If I was to just rate the food, I had the beef Pho and fried egg roll, I would give this place 5 stars. The broth was insane! I usually load my Pho up with sriracha, but this was way too good for that! If you love Pho, try this place.Reason for 4 stars is the decor is... meh. Also, the place is hard to find at night. No lit sign on either side of the restaurant. We drove around for a bit trying to find it."}
{"text":"My wife and I come here as our date night at least once a month.  We absolutely love the pho (I usually order #13 which is beef, and she gets #10 which is chicken).  Both are excellent.  I also order #38 with the BBQ pork.  It is such good meat and a great dish for when I'm not in the mood for soup.  

The server is always friendly and remembers us each time we come and the service is quick as well.  We take out of town guests/family here the first time they visit and every time they come back they want to eat here again!"}
{"text":"I got the Number 13 pho. The service was quick and friendly, the prices were good, but the food was a little meh. There Just was not much flavor. The restaurant also didn't serve beer. 

Overall I'd probably go back to try something else, but it's not at the top of my list."}
{"text":"I had takeout from here last night and it was excellent. I'm no pho expert, but it was so delicious! I had pho tai and shrimp spring rolls. Would for sure order both again. Craving my leftovers as I type."}
{"text":"First time eating Vietnamese. OMG, this stuff is DELICIOUS!

We got a 44 and 21. Both were delicious.

The server was very friendly and knowledgeable.

We'll be back, many more times."}
{"text":"Awesome food, not greasy great to eat here instead of fast food. Quick service very polite staff. The bun and pork egg rolls are fantastic."}
{"text":"Best Vietnamese in East Mesa bar none. No competition. Pho, rice dishes, even Ban Xiao! (Egg 'crepe' served with lettuce to make Vietnamese 'tacos' - they call it pizza for some reason). Took the whole family; they had something for everyone."}
{"text":"We decided to try this place since it was close to home and we were craving some pho. We got seated immediately and we got served waters quickly. It wasn't overly busy, so we anticipated getting our food in a timely fashion. We ordered our beverages, 2 different appetizers (spring rolls), 3 bowls of pho, each one slightly different and an order of fried rice. The appetizers arrived before our beverages, which were Thai tea, lemonades and a sweet tea. The spring rolls were really good and it's a shame you only get 2 per order. Next came our son's fried rice. He was still missing his sweet tea, which he never did get. My husband's soup came after that, however our daughter's and my soup took another 15-20 minutes to arrive. The boys were done eating and we were pretty much indifferent by the time our soup arrived. The food was good but I have made pho at home and have had it at other places where it tasted a lot better. I think the length of time it took to arrive was the biggest let down. Their time management needs some help and we watched them serve tables who arrived after us a lot faster. However there were tables before plus who all received their food sporadically as well.
I'd like to say I'd go back but most likely not."}
{"text":"Based on three different times, ordering the same thing. You know, because maybe they might have an off day.
 
First, the stench that this place has is almost disturbing. I would sit away from the middle area where the fountain is supposed to be; due to the fact that the smell is emminating from there. 

Pho Tai Bo Vien - generous slices of meat and meatball cuts for its size; however the broth is lacking in flavor and almost seems almost bland, if it were kept at too high of a temperature for too long. 

Cha Gio - crispy; but again, seems like it was left in too long to cook."}
{"text":"OMG we had the worst food and experience here on day 2 of their opening.  We were literally the only 2 people in the place, took an eternity to get our drinks, then another eternity to order! Ordered pho (now mind you I lived in SF for 14 years and have had millions of bowls of authentic pho). It came with a huge oil slick in the broth to the point when a drop of the broth got on the table it solidified into a hard drop of oil when it cooled. Was so gross and disgusted by this pathetic pass for good pho. The basil was not even fresh ! On day two of opening!!! The music was BLARING and it was some weird techno pop crap. Why not have some nice Asian zen music? Just a thought! The owner took our order and he was beyond creepy weird, to the point of standing there while he gave me my change after we paid , he stood there next to the table for what was like an eternity to see how much I was going to tip him. Major awkward and creepy. Even my son was majorly creeped out. I always order chicken pho and was super disappointed to see that they only have beef broth with chicken added. No chicken broth?! WTF is that all about. I SO wanted to like this place bc it's close to my house, but sadly I will still be driving 10 miles out of my way to Gilbert for good pho."}
{"text":"Don't let the appearance fool you. Food was delicious. Server was very attentive and super nice. We got there at 1:30 so it was after lunch but there were at least six more tables that cam in after us. Would definitely go back if we are down that way."}
{"text":"I've been a little under the weather and I thought a huge steaming bowl of pho sounded like the perfect thing for my congestion.  

The dining room is larger and much more comfortable than I see at most pho restaurants but it's still a little run down.

The pho is good and the menu is large.  While the service isn't particularly speedy or attentive it's not excessively slow and everyone Is pretty friendly.

I could come here again, especially since this establishment is the closest pho place to my house.   That being said, when I'm looking for all around great pho I'll likely drive a little out of my way to go to a nicer place."}
{"text":"Very happy with our Pho experience. Super friendly and efficient service, clean & newly decorated, great value and tasty food! We had fresh spring rolls with tofu (not on the menu but we asked and were pleasantly accommodated without hesitation). I had the #15 & my husband had the #13. Good portion sizes, brought all of the right trimmings out, chili paste on the table  The server, Jess, was extra rad and helped entertain our toddler when he got bored. We'll definitely be back"}
{"text":"I love this place,
It's pretty clean. They are very attentive  have excellent service and the food is delicious!
I highly recommend."}
{"text":"This is a tough rating for me. If this place where 12 miles west, I would give it a 4 star. The food is really pretty good, above average for sure. I am going 5 stars, because I think it's the best you'll get in the Far East Mesa area. There are a couple thai joints that can hang, but Pho is limited out here, this place is rock solid! I did a #15 Pho with steak and meatballs. Very yummy! Also did crispy spring rolls and they were terrific!  If Republic Ramen and UnPhoGettable are to far, you'll be just fine going here!"}
{"text":"Outstanding! We were super stoked that we finally have a Vietnamese restaurant in NE Mesa and man, do they deliver. I had the Pho Tai and a Shrimp and Sliced Pork Spring Roll. Delish! The broth was full flavored, they provided plenty of bean sprouts, basil and jalapeno to doctor it up with. Hosin and rooster sauce on the table. 

Really friendly service and very affordable prices too. We'll become regulars!"}
{"text":"Friends had told me this place is pretty good, but I was sadly disappointed. I ordered pho, and my noodles were too hard, and there were only 4 pieces of beef. The broth was fine, but nothing impressive. The price was definitely not worth the mediocre bowl of soup."}
{"text":"Three stars +++, and could be a four if rounded up. Pros: prices are most affordable, food is excellent (I had the Pho Do Bien), the premises are pristine, and the wait persons/cooks are friendly and helpful.  Cons: if any, is the location is in a dying mall on Higley in Mesa. It seems like every other storefront is vacant and looking forlorn.  Not a comforting look. Also, this used to be a Greek restaurant called Pita Island so the size is so inappropriate as Vietnamese restaurants should be small and lively. I hope this restaurant succeeds and builds clientele."}
{"text":"I'm so happy there's finally a Vietnamese restaurant over here! We got really tired of driving all the way to Dobson to get our fix. Plus, this place is dang good! The pho was impressive...and our pho standards are pretty high. We also LOVE the spring rolls. We have gotten everything to go so far but are looking forward to dining in...the restaurant is pretty impressive inside for Vietnamese. And the guy who helped me was super nice."}
{"text":"Pho broth was so fragrant and tasty. Egg rolls were delicious. Will definitely be back!"}
{"text":"If you are a Pho lover you will be disappointed in the broth.  It had a bland up fresh flavor like it came out of a can. The atmosphere was depressing and there was a bad aroma in the place.  It smelled like the deli at Spouts after they wash the floors at night.  I felt very thirsty after eating which for me is a sign of MSG ingestion."}
{"text":"My wife loves pho and this is her new favorite place!! Great prices and excellent food. Fabulous service. Don't be afraid of the pork cake--it's really good!"}
{"text":"Mesa finally has an authentic Vietnam (Viet Nam) restaurant. Clean, whole family run business. Everyone really cares about you and your experience. Super duper fresh, ranks with best of Vietnamese restaurants in the valley. Excellent ambiance away from crowded shopping centers. Beautiful NE view looking out toward Las Sendas. You'll come back for more, I promise."}
{"text":"Popped in at 8pm in a Sunday night (they close at 8:30) and was jonesin' for some pho. I was alone, with the comfort of my smart phone and a list of current events to catch up on. I ordered the VIP pho and within minutes was enjoying some yummy pho. 

The Hosein (sp) sauce, chili sauce, and soy was already at the table. So once my pho hit the table - it was ON!

I was in and out in 20 min, and I was happier than a pig in mud. I will definitely be back, no doubt!"}
{"text":"I love this place!  Great authentic Vietnamese food.  I have tried other Vietnamese restaurant all around Greater Phoenix and most places over charge.  However, this place is da BOMB!  GREAT FOOD!  GREAT SERVICE! And especially GREAT PRICES!

I base true authentic Vietnamese food on whether they have this beverage:  Salty Plum Soda.  YES!!  I was shocked when they said had the drink.  This completed my meal to a perfection of authentic Vietnamese food.

I recommend this restaurant for those truly seeking a fresh new experience for your taste buds.  Take them on a wild ride!  Your taste buds will thank you!"}
{"text":"Love our waiter. He was definitely entertaining and funny. Food is fairly priced and tastes decent. I had the pho vip & gui con. My brother wanted the same thing but couldn't decide between that and the soup with emon grass broth on another page. Our waiter was nice enough to accommodate him and stated that he could do the pho VIP and have them put the lemon broth instead. That was nice. 

The only thing i could complain about is the restrooms. It definitely needs a good cleaning and they need to maintain the cleanliness"}
{"text":"I love pho but this was the weirdest tasting pho I've ever had.... the broth tasted like lime, not beef..."}
{"text":"Wow! So happy to see this place open on the East side of Mesa, we have had to travel so far across town to get Vietnamese. Now we have it within 5 minutes, but it's so much better than the places on Dobson Rd. We had the Pho and the Bun, both were extremely fresh and delicious, best we've had! Service is very fast and friendly. Great find! Thank you again for opening and you'll be seeing us once a week, at least!"}
{"text":"Really solid work lunch choice on Higley and Brown.  Had #15 pho - beef strips and meatballs in beef broth.  Added peppers and Thai basil at the table. Appreciated the side of sprouts so I could skip the bean sprouts. Not my favorite.  A squeeze of fresh lime brightened the bowl. This was yummy!  Also ordered pan seared pot stickers. Those came out nice and hot. They were a good size, and super tasty.  Will go back again."}
{"text":"Friendly like most Vietnamese restaurants. Nice atmosphere. Just new and still developing. Very authentic menu and taste."}
{"text":"Finally....a good Vietnamese restaurant in East Mesa. I had my standard Pho Tai and Vietnamese Iced Coffee. Both exceeded my expectations. Will definitely come back. Good service and atmosphere too."}
{"text":"Really great food and a very friendly group that owns and runs the restaurant. Had #38 on the recommendation of our server and completely enjoyed it. I'll gladly return for their delicious food and hospitality. And they make a great Thai Tea as well!"}
{"text":"I've eaten here a few times. Today's meal was sub-par. The pho bo vien is a pretty simple dish. The meatballs tasted peculiar, broth was not terribly hot.
In the past, I've come here with friends. They've complained about meat not being cut up, the lack of utensils. 
Essentially, it's fine for a local pho place, but there are plenty of better places that will make sure that you meal is the best that you can get for the price paid."}
{"text":"My husband and and I ate here for the first time today and loved the pho and the spring roll appetizer that we split. We have eaten at several other Vietnamese restaurants and found this to be comparable. The broth was excellent and the condiments very fresh and favorable. Very happy to finally have a Vietnamese restaurant that is close to home, great food and service, and reasonably priced. Will definitely be back!"}
{"text":"This was our first Vietnamese food Sind moving from East Hampton, NY. It was very, very good, and at a reasonable price. Our waitress, Jess, was very sweet and could describe to us what was in the dishes and tea. She seated us promptly & took our drink orders immediately. Having spent a week in Saigon, Ho Chi Minh City and a beach town, we got to have pho in many places for every meal from breakfast through dinner (if we chose to).
Jess said she hoped we would return soon, and we certainly will! Five stars from us:)"}
{"text":"Only 5 vegetarian options but 2 contain fish sauce. The other three diners with me had plenty of options. Two ordered #15 beef & meatball pho & loved it. The shrimp fried was was ok. I ordered #50. It was good but I had my heart set on pho...but no vegetarian pho option."}
{"text":"This little hidden gem is tucked away in the corner with minimal signage. I ordered the vegetable pho and was pleasantly surprised with the depth of flavor in the broth. My date had the brisket pho. 
We were pleased and will return with friends ."}
{"text":"This awesome place is conveniently located near my work and it's a fine an eastside alternative to Mekong. The staff is very friendly and helpful.

The Pho is excellent and you have everything at your table to tailor it just the way you like it. I get #15. I like #38 as well... BBQ pork and egg rolls. The fried rice tasty too. 

Whacha waitin for?"}
{"text":"Our first visit to this restaurant wasn't nearly as horrible as our second so I'll start there. Their pho tastes average -not amazing, but does the trick and they have a lemongrass soup that packs a punch and has really good flavors. But the service...dear god. I'm pretty sure they completely forgot about us. It took us an hour and a half to eat what was supposed to be a quick weeknight dinner. We waited for our food for at least 45 minutes, and our waiter did not check on us and didn't bring us water.  We chocked it up to an off night and gave it another whirl tonight. My man and I are both sick, didn't want to cook and a warm bowl of pho sounded like the perfect choice. I ordered to go, and they told me 15 minutes. I arrived after about 20, and had to wait an additional 10-15 minutes in the awkward waiting area. We get home and the first thing I notice? The sauce for the spring rolls was congealed and was pretty much just straight peanut butter, there were raw slices of frozen meat in a plastic bag, my meatballs were ice cold and the noodles were in a heap all stuck together and cold as well, and the broth was lukewarm at best. I literally had to COOK my to go order on the damn stove. How a restaurant even legally sends people home with raw and frozen meat is beyond me. So my last question is this: why did I wait 30 minutes for frozen food I then had to cook at home? We won't be back."}
{"text":"This place is awesome! Pho is a lil different taste compared to other Vietnamese food. Their bun chon is super good!! Super chewy and the ground pork inside was seasoned really well. Price wise is good as well."}
{"text":"Came here with a large group and we were served so quickly!! Back at home in SD, I have my go to pho spots. Moving to Arizona, I've been on the hunt for a cheap, tasty, and quick place and this might be it! 

While I veered from my usual order of pho with as many beef parts as possible, my friends all seemed to really enjoy theirs. I opted for the pork vermicelli w/ eggroll and ugh - delicious! The tofu spring roll was also pretty good and I was a big fan of their peanut sauce! The crispy noodles were also quite good!

Not only is this place quick and delicious, the service here is outstanding. The servers were so friendly and funny, and SO accommodating for our large group of 10+ people. Will definitely be back when I need a good pho fix!"}
{"text":"In comparison to other Vietnamese restaurants that I've eaten in, the flavor is good. One thing that would make me give 4 stars is if they would offer fresh (not fried) tofu in their dishes, as well as, a vegetable broth option for us vegan and vegetarians."}
{"text":"Really very good Bun. The #38 which is BBQ pork and egg rolls was pretty amazing. The pork was tender and the taste of the egg rolls were spot on. The only let down was the nuc mam (sp) which is the fish sauce was overly sweet and had no spice to it. But nevertheless do try it! Service was great and the owner was very friendly and attended to us. If you are in the Mesa area and hungry for Pho or Bun, this is the place to try."}
{"text":"My most favoritest place to have PHO. I'm addicted to the vegetable Pho with tofu! Yum delish!"}
{"text":"Finally, Mesa has a Vietnamese Pho restaurant worth going to.  Place is nice inside, rather big and spacious feeling.

We were there for lunch and not busy at all so service was great and food came out fast.  My noodle bowl with bbq pork and egg roll were exactly what I expected, very filling and delicious.  Veggies were all nice and fresh.  I usually order this with shrimp but it wasn't on the menu....not to many noodle bowls to select from.

Hubby's Pho bowl had 2 kinds of meat and meatballs.  He didn't care for the meatballs, otherwise a very standard bowl of pho with a well seasoned broth.

Very reasonably priced.  We will return.
Welcome to the neighborhood."}
{"text":"It's so nice to have a pho place close to home! Usually we will head to Mekong, but it's nice to have a closer option. The pho is tasty and the servers are very nice! I definitely suggest checking this place out. If you haven't had pho before, think of it like really fancy ramen with real meat... trust me, just try it out!"}
{"text":"Had a craving for some pho so I had my husband stop here. We ordered to go. I was a bit nervous because not all pho places live up to the hype. I had a custom bowl with the meatballs rare steak and brisket. The broth was so delicious and rich! I ate it all! It was almost as good as my moms! We also ordered fried eggrolls and spring rolls and both were good. My son loved his stir fried noodles. Sorry if I don't have the exact names, I sent my husband to order it. I'm used to eating authentic home cooked meals like this so it was good to get a quick fix that hit the spot."}
{"text":"After looking for a great pho place in AZ I came across this little place! This place is absolutely amazing from service to the food! The pho itself is absolutely amazing in flavor and in size! Can't forget the Thai tea to top it off! Can't wait to return here for another bowl and tea!!"}
{"text":"This place is the best pho place in East Mesa/all of Mesa. 

The restaurant is super super clean and very modern which is always appreciated and not always found in Asian restaurants. The service is pretty good. Standard, but better than most Asian restaurants. The server was great about answering questions. I give it a 4 because they have been understaffed. When I first went and there were two tables the service was great. When the restaurant was full the two servers were clearly overwhelmed. We ordered the pho and #36 (I don't remember what it was called but it was the rice noodle bowl with pork and fish sauce) 

The food was stellar. The 36 was so fresh and flavorful it cannot be beat. The pho was also really good. It tasted like there was no msg in it. The vegetables that came with it were also super fresh. 

The price is higher than other pho places but with the ambience and the fact that there are no other pho places around, it is so worth the price. In one week we've been here three times with no intention of stopping. If they get some more staff this place will be unbeatable"}
{"text":"Good stuff. 

Quick efficient and answers needed questions. 

My husband and I both got the pho tai , flavorful broth, good meat and fresh veggies . 

In and out in 45 minutes . 

They may need another in the future because it may get packed up since it's the only pho place in the area."}
{"text":"Great place... Great people... Great service..
 If you love Vietnamese food you have to try this restaurant... Highly recommend the Pho VIP bowl (XL bowl.) They also offer small, medium, and large Pho also... Compliment your meal with Thai ice tea, and/or salty plum soda....

They do not offer Banh mi sandwich's at this time... Hopefully soon!!!"}
{"text":"The broth is very good here.  I went with several purple and we all tried something different.  My son enjoyed the meatballs.  I had chicken and made mine spicy.  They are not open on Mondays so be aware.  
Surely a place to come back for Pho."}
{"text":"I heard there was a knew phó place in mesa. Of course being the phó nut I am, I had to come and see for myself. I can now say that yes there is, and a food place. First, the place is clean and welcoming. Good place for families and friends, but also a place you could take a date to and not feel bad. Now I know you ain't reading this for the decor. You want to know about the food....

Ok, I got the #15 (rare steak, brisket and meatballs) plus the shrimp spring rolls. Start with the rolls. Perfectly crunchy and soft  and tasty  The sauce was sweet and savoury. The phó is the star of the show. Great broth and all the normal add-ins. Only thing missing was cilantro. I haven't found a place in Arizona that serves it with the mint. Small ding on a great meal. 

The staff was attentive and quick. Didn't see them a lot. I think I scared them with all the slurping and grunting while I ate. 

Should you come out and try it? I can't belive you're not on the car driving here."}
{"text":"Really nice to have Pho in this location, decent fresh food, prepared quickly and efficiently by real Pho cooks.  Dine in or takeout either way is a winning option.  Prices are decent you get a lot of food for your money.    Owner is a nice guy, he definitely cares about the quality of the food."}
{"text":"Thus place is my boyfriend and I favorite place. Small holes in the walls are the best. Best spring rolls I have had in a long time."}
{"text":"This would be a 5 star if it wasn't for the Pho being only slightly less delicious than my normal places. However, it's still above average and their other dishes, like the vegetable stir fry, is pretty outstanding. Glad to have a go to Vietnamese place in East Mesa."}
{"text":"I'm so incredibly happy this place opened up near me. I honestly had low expectations because I'm from Los Angeles. The minute we walked in a friendly waiter was there to greet us with a smiling face and a cheerful attitude. He said we could sit wherever we want. We sat down and I already knew what I wanted to order because we'll, I always order the rare beef steak pho when I go to a pho restaurant. It came out so quickly! The first thing that I do when I try any kind of fun is to take a spoonful of the broth to taste it. To my surprise it was really good! I mean, not just Arizona good but all around good and even better than some of my go to places in Westminster! I always say that good pho is when you don't need to do anything to the broth to make it taste good and that is definitely the case here! I've made it a point to make a weekly rotation at this restaurant and I really hope they do well and stick around because I will be a customer for life! 
Ps. They usually only have one guy waiting on patrons so be patient when getting your check. :)"}
{"text":"This is the best pho  in Phoenix. I have tried pho in places all over the country and this is by far my favorite."}
{"text":"Pretty Darn tasty food, great service and open rather early. Every time I come here I ask for a to-go menu, still don't have one so unless I have Yelp handy (which is almost always) I have to order when I get there. Or know what I want. 

Service is super friendly and the place is clean, like they mop them white tile floors three times a day plus clean. They have one of the better BBQ meat pork spring rolls around and they are always fresh, made to order and super cheap. In fact, a lot of their menu items are cheap! Their Bánh xèo is super cheap here compared to a lot of other Viet places in the area  it runs like 2-4 dollars less than most others around. and it's the same size, probably better quality than a lot of other places too. I wish they had Bahn Mi's here, or maybe they do but I don't have a menu so no clue, lol. 

I will most likely still be coming here for a good part of my future in life since the food is on point and the service is awesome. 

Thanks guys, can I get a to-go menu?? :)"}
{"text":"#41 was excellent! Staff was very friendly! Place was clean. Hoisin sauce and chili paste was on the table to add to your dish."}
{"text":"Good food but lacking on service.  Food was very delicious, but one person working was tough.  While the place was not full, there was about 10 tables and one server, that's rough.  I ordered rice noodle dish that came with pork and beef.  Spring rolls were a little lacking in flavor and had been pre-made giving the wraps a gummy texture.  I would go back but would hope they have additional help serving."}
{"text":"As much as I appreciate local business trying to make it, why does it taste like this food is targeted to a certain clientele. My meat has an orange tint to it, when it should just be brown, and too salted, too tough. My fish sauce lacked spice. Overall I probably won't come back unless desperate for Vietnamese food."}
{"text":"So yummy!! great convenient location of higley and brown. I had number 11 it was exactly what my tummy was craving! The prices are perfect too! The staff is very friendly. All good here, Highly recommend!"}
{"text":"Excellent food and prices. New place starting up so please try. I got it to go but would be happy to eat there anytime. Great menu and food was very tasty. You can choose hot spicy as you want it. Not easy to find Vietnamese food in mesa so this is a great addition to the city!"}
{"text":"A-OK. 

Okay pho and def will satisfy your cravings! But the broth is oily and the noodles are usually very stiff and cold, so you really gotta break it up in the broth before diving in. The meat is also a little bit tough and the portion are a little small as well. The spring rolls were meh, the lettuce tasted old and there didn't seem to be a lot of shrimp either. 

Overall, I've eaten there a handful of times and its a okay pho spot, I'm sure there are better but this isn't too far from where I live so its decent for the price and location."}
{"text":"Great Pho.  Prices are fair. Huge servings.  Service was good also.  Inside was very spacious and inviting"}
{"text":"We had the vege Pho, spring rolls, and a pork sampler platter for dinner (don't remember the names). Three of us ate and were stuffed. The food was tasty. They have hoisin sauce and chili paste at the table for you to make it as fiery/flavorful as you desire. Our waiter was friendly and attentive. Their restaurant is spacious. We will definitely be back."}
{"text":"Pho is great, atmosphere is a little different. Choices of whatever you like in your piping hot pho is there, but you'll be enjoying your deliciousness in an outdated environment."}
{"text":"I am a phonatic.  I have been everywhere in the valley and this place is right behind unphogettable.  Great broth, the right amount of noodles and plenty of veggies.  My spouse had a viet pizza which was like a pizza omelet filled with veggies.  She thought it was great.  I knocked them down for there spring rolls which fell apart.  This place also had a diverse menu.  If I did not like pho so much I would love to try some of their rice dishes.  I hope this place makes it as no one was there.  I will be back."}
{"text":"Ok having given pho Vietnam 5 stars I was expecting an awesome bowl of pho and got the worst bowl I have had in a long long time, the noodles were still in the shape of a bowl, I almost got up and walked out, the portions were super scarce, I would say 1/4 of the meat pho Vietnam puts in their #19, just very very  disappointing I will not return to the pho 2 fake representatives of the awesomeness found at the original"}
{"text":"We have eaten here three times since it opened. Delicious!! 
I am so glad a good restaurant has finally filled this spot."}
{"text":"I've been to their other location on Warner and it's always busy and service was always good. Food was good so I was excited to see a location closer to my house. 
Walking in, the decor is interesting. I'm guessing previous owners. But it was all decorated like a beachy tropical island place. Maybe former Caribbean restaurant? 
Anyway, right away I noticed only one guy working. And he was the same guy I've seen at the other location. Once we were there, maybe five tables of other people showed up. Still one guy working.  
We ordered spring rolls and eggs rolls to start. Spring rolls were clearly premade so they were chilled and chewy. Eggrolls were hot and tasted good. 
I ordered pho tai with extra beef on the side. I do this because I like to add the raw beef to the hot soup and it cooks the meat and keeps it tender. Versus when they boil it in the soup and by the time I eat it, it's tough. 
Anyways. It wasn't until after I had a couple bites I realized my soup wasn't hot. It was barely hot enough to cook the beef. 
I wanted to ask the guy for a cup of hot broth to help warm it up but he never once came back to our table after we got our food. It was annoying because I kept making eye contact with him and he would just walk the other way. 
Finally I just gave up. Got a to go order and heated it up once I got home. 
I'll stick to the other location from now on. Yes it's further but it's just better."}
{"text":"The Pho was really good!  The thin sliced steak was very lean and not fatty at all. We also tried the fresh spring rolls and they were also very good.  I am so happy to have Pho on this side of town. It's really a great value."}
{"text":"Very nice restaurant, service is always great! Plus you can have your choice of Asian cuisines! Went two days in a row. Vietnamese the first night and  Chinese the next."}
{"text":"Visiting my Mother who lives very close by, we discovered this recently-opened wonderful Vietnamese restaurant.  This place is clean, inviting, and spacious (probably can accommodate large parties too).  Near the intersection of Brown Road and Higley Road, its in the Basha's Shopping Center.  I ordered the #38 - it was delicious, tastes just like a Pho place we used to frequent back in Sunnyvale, CA.  Ingredients were fresh - barbeque pork, egg roll, vermicelli noodles, bean sprouts, carrot, mint, lettuce, chopped peanuts.  And with complimenting sauce and nearby hoison sauce, a delicious package.  Portion was generous, and the server was friendly too.  If you lived in California and know what good Vietnamese food should taste like, you will be satisfied here. Try it, you'll like it!"}
{"text":"Ordered the 3 type meat (brisket meatball and rare)Pho. All the meat were old and rank. The Pho broth was terrible."}
{"text":"Was so excited to try this place out but was sadly disappointed. The staff seemed super irritated we were there, and it was just us, our waiter struck up a conversation with everyone else and was very short with us. I asked what vegetarian options he felt were the best or his favorite, and he just said \"whatever you want\". I chose a vegetable plate and asked if it was a good choice and he just shrugged. He asked if I wanted rice or noodles and I asked him what was the best from the restaurant and he replied again with \"whatever you want.\"  I explained it was our first time and would be happy with anything that came recommended. He just shrugged again and said \"whatever you want. You can have rice or you can have noodles.\" I chose rice then he took my husbands order and walked off. Our food came in a decent amount of time but it was not as good as the reviews had said. It was just kind of bland. My husband said his pho was not the best either. No one came back. After a while after finishing our plates I thought I remembered the menu saying something about paying up front. We got up, paid, our waiter said nothing and we left. We came because the reviews on yelp, the drive was further than we would have liked so no, never going back."}
{"text":"I'm a pho-natic and the pho here is ah-may-zing!!! The broth (which is arguably the most important part of any kind of soup) is so rich and delicious. I usually get the seafood pho with extra veggies, and I'm never disappointed!! So that being said, the only reason I'm giving Pho Viet Nam #2 only four stars instead of five is because the service was very slow. My friend and I went during lunch this week and there were only 5 people (including us) there eating. The waiter wasn't very attentive to us - it actually took a over 10 minutes to get our check after we had finished our meals."}
{"text":"Very good Pho and pork spring rolls. The tai tea excellent! I enjoyed the meal. Be sure to ask for the peanut sauce as a condiment. It enhances the flavor of the spring rolls."}
{"text":"We did return as promised, and unfortunately, the service sucked.  I mean, really sucked.  Unfortunately for them, other Vietnamese good options have opened further east that Dobson Rd., and that means I have options.  If they don't step up their service, they'll have trouble competing."}
{"text":"Four of us just had lunch at Pho Viet Nam #2. We couldn't have been happier with this new restaurant. Our waiter was attentive and helpful in explaining the menu to us. He checked back several times to ensure we were satisfied with our food. The prices are very reasonable when you consider the size of the portions, which were huge. The dining room was very clean and the lady's room was also clean and orderly. Although we aren't particularly knowledgeable of Vietnamese food, we know what good food tastes like, and this place has it in abundance! Luckily, Pho Viet Nam is close to our homes so we four old gals can come back again and again."}
{"text":"I was so excited that there was a pho place opening up in my Area, I'm a foodie so I couldn't wait for the Grand opening. But little did i know ...My neice works nearby in the same Plaza so I decided to have her meet me there for lunch. Upon arrival  there was one waiter/server, we walked in and it looked really nice different from alot of pho places I've been to, even hole in the wall places, our waiter sat us gave us menus and went around helping other tables, he was the only one there he looked a little overwhelmed with everyone there while we were looking over the menu I had time to look around the restaurant is looked at the tables and checked out the condiments and for me being obsessed with pho I wasn't pleased everyone has different taste and everytime I go to a pho place there's always Sriracha, hosien sauce,
 fish sauce , soy sauce, chill paste ,salt pepper , and sugar when I see these items on the table I'm happy. We placed our order and we asked for fish sauce and he looked confused as to why we wanted it. I wasnt really pleased. Needs a little more work in my opinion,  more staff or help. More condiments to offer guest and I think I would mostly be able to return. Or I will just drive all the way to dobson for pho. Okay place just needs to be worked on a little."}
{"text":"Trying to find a new Vietnamese restaurant is very hard especially in the east valley. So when my mother in law showed my husband and I this place, it is to die for! Pho is amazing and flavorful.  Great price and great quality.  We come in regularly now. The younger waiter waits on us and is soooo friendly and cracks jokes and I personally love it!"}
{"text":"Fresh food and tasty, the service is good but they need badly help, the tables are with the left overs for several minutes after the clients leave.
I will have it cleaner, the floors and bathrooms.
Good and fresh food though."}
