{"text":"YUM!!  I've been searching for a Pho spot for awhile now.  Nothing compares to this place. I had the #2-Rare Beef Pho and hubby had A-Sate Chicken.  Broth was excellent and flavourful. Hubby said it's the best Sate he's ever had and the shredded chicken just melted in his mouth.  He loved it so much, it brought tears to his eyes.  Service was wonderful as well.  If you love Pho, you need to come here!  Do it!"}
{"text":"We had rice and chicken dishes. The food was tasty but nothing too special. Portions were moderate but filling. The service was fast and the servers were friendly. The menu is quite large and they have a lot of options aside from Pho. The prices were reasonable and two could dine for $20."}
{"text":"Okay, not the best. I would prefer to have a bigger menu. I would like to say that their durian milk shake is pretty good, tasted like real durian."}
{"text":"Man, their sate is spicy! There's a reason their bowls and places are red!  It's really really addicting though. I stopped and realized, I'm just drinking spoons of chilli, peanut sauce and  water... Maybe there a bit more secret stuff in there too.  Definitely worth trying out. With a cup of well made Vietnamese ice-coffee, or lemonade, you'll fall in love with this place in no time. Cozy, familyplace comparing to the modern looking Basil Ultimate Pho from the other day. (What's wrong with Calgary's restaurants and music?)  I'll definitely come back after their renovation to try out some of their non-spicy dishes."}
{"text":"I can't eat pho sate anywhere else since discovering this place!! It is unrivaled! Also they make me GF rice wrapped spring rolls and will pan fry them for me."}
{"text":"ordered dry yellow noodles w/ BBQ pork and it turned out to be pretty good, just that the sauce was a bit on the salty side otherwise it would be perfect (came with a side of soup which was nice). noodles were perfectly cooked with a good amount of crunchiness and they also gave a handful of it so it really was worth the money! also decided to try the sour sop (some tropical fruit) milkshake and it was sooo good! the flavour of the fruit was a sweet/sour taste soo it was pretty interesting. they just needed to put less ice in it next time because i couldn't drink it through a straw and instead had to use a pho spoon to scoop it out of the cup haha."}
{"text":"I've given this place more than enough chances. I've been going here at least monthly for the past 3 years. IT IS DIRTY.  Sure, it is one of the nicer, more spacious, airy pho restaurants but it is just gross. I can only compare it to a swimsuit model... with a bad case of gonorrhea.  Here was my experience today:  Walked in, observed 3 occupied tables. Waitress (middle aged lady with glasses who's been working there for quite awhile) looks up at me from behind the counter and proceeds to look back down and continue whatever she was doing. FINE. I seat myself and fill out my meal order paper thingy. I wait patiently for about 10 minutes for her to come over and retrieve my order. By this time, there is only an elderly couple, myself, and a lady with a baby stroller left in the dining room.  **I ordered a medium bowl of Pho and veg spring rolls.  The pho comes in under 5 minutes.  It is the most oily bowl of Pho I've ever had. For the record, I've had ALOT of Pho in my life thus far. I try my best to eat it but every bite leaves a film of oil in my mouth that I need to wash down with tea.   My spring rolls come. As another reviewer said, they are most definitely made in old oil. HERE'S THE FUN PART... The waitress puts down a small bowl of sauce to dip the spring rolls in... THERE'S A SMALL, DEAD COCKROACK FLOATING IN IT. I call the waitress over to alert her. She comes over and I point at the bowl beginning to tell her about the roach. She says \"OKAY, OKAY, OKAY\" snatches up the bowl and brings me a new one, sans cockroach. She walks away quickly and I'm sitting there seriously stunned.  Now, the lady with the baby calls the waitress over and says she needs somewhere to change her child. The same IDIOT waitress brings her to the very front of the restaurant and tells her to change her baby on the set of waiting chairs. No COVER on the chairs, in the dining room, while customers are eating. I sit and wait for the lady with the baby to finish up poop duty in the waiting area and go up to pay my bill. I WANT OUT... IMMEDIATELY.   When I reach the counter a younger male server sees me and continues to use his smartphone. Fine, I reach over the counter, retrieve my bill, pay it, and leave.  I hope they enjoy the $0.24 tip or whatever it was because I'm NEVER eating there again."}
{"text":"The good: - received food in a reasonable amount of time (small chicken pho and a large house special and Vietnamese spring rolls)  The bad: -  the Vietnamese spring roll sauce had a hair in it...so we asked one of the servers for a new one, and she gave us a new one.  Immediately after, the \"boss\" of the restaurant begins yelling at the server that gave us a new bowl of sauce stating how she needs to go through him before doing anything, and some other things in Vietnamese  - overall restaurant seemed very dirty (menus are old and crusty, floors are dirty, tables were not that clean either) - the pho made us feel extremely thirsty, assuming that there must be lots of MSG   Aside from the overall poor cleanliness of the restaurant, I don't understand why the manager yelled at the server who did the right thing and gave us great service...that pretty much turned me off from ever going to this place ever again"}
{"text":"First glance walking in there was nothing special about the design. Simple, interesting floor material, but very smart from a functional perspective.  The no ceiling ceiling to maximize space and a big fish tank next to the register.  The settings and bowls were really interesting, a bright green colour that I've never seen anywhere else.  I guess that's a trademark of theirs.    The service, our server was super attentive and kind.  Quick to follow up, but not in a pushy way.  Thumbs up to her.  We ordered a satay soup, the standard pho special (Dac Biet), spring rolls and salad rolls.  Nothing to comment on about the salad rolls, they were ok, that's it. The spring rolls were good, but there was little meat filling which you couldn't taste. But the soups were really good!  The special was really flavourful and not oily or heavy.  I always made sure I had a big spoon of soup to follow a slurp of noodles.  I also sampled my friend's satay and my goodness was it good!  Just the right balance of spicy and flavourful.  It wasn't the burn your tongue spicy, but there was a nice heat to it.  Currently this sits as my favourite satay in the city."}
{"text":"By far the best saute I've had in Calgary. I had the oxtail pho and it was unbelievable. All of the proper accoutrements (some I've never been given before) provided. My new go to for  Vietnamese."}
{"text":"If you want a great bowl of beef sate soup, this is the place to go!  Just the right amount of spice, the broth is the right consistency for sate, and packed full of flavor.  Probably one of the best sate's I have had in town.    The restaurant itself is in the heart of Forest Lawn on 17th Ave in a strip mall, with a simple, clean interior.  The service was good, we were in and out within 40 minutes over lunch."}
{"text":"Great food, great prices, cash only. The staff are the nicest, friendliest folks! We agree with comments that it could use a spruce up but it's hardly \"disgusting\", far from it. And we've yet to spot a cockroach on our almost monthly visits. Springs rolls are crispy and I find the beef in their pho particularly tasty. Their large pho bowl is massive, I can easily share it. Extra large can pretty much feed my family of three with an order of spring rolls."}
{"text":"I can't say enough about how much I love this place. I go about once a month as I believe they have the best Pho in the city. I usually stick with sate chicken but my hubby has tried most of their pho dishes and is always satisfied.  The staff are friendly. It's always clean.   Love, love, love this place."}
{"text":"Love it here! Great food, Great service!  I usually get the house special and it always comes out hot and yummy. Spring rolls are amazing here. Probably the best I've had.   Best Pho place in Brampton."}
{"text":"This place is our office's friday lunch place. Sometimes we also go there for dinner if we have to work late.   All the pho are very good.  The vermicelli with shredded pork is also delish!!  their avocado drink is to die for.   The only downside to this place is that it's not all that sanitary. We actually saw a cockroach one time on the floor and also once in our coworker's pho....we demanded for refund, which we got after our long and arduous effort to argue with the  waitress.   But i have to say, I have had many pho and vermicelli at many other places and this place is really unbeatable. I'd give it a 3.5 if the rating system allowed me."}
{"text":"Good food! Fast service and all for a decent price. This wasn't my first time and it won't be my last!"}
{"text":"This is the original pho restaurant in mississauga, and this location definitely remains the best pho restaurant in all of GTA. The pho broth is so rich in beef favour it reminds me of the authentic pho I had in vietnam. Also the avocado shakes is always on point with the perfect avocado to ice ratio so it's not too thick. I recently tried the rice with grilled pork, and let me tell you that meat was so succulent it makes my mouth water everytime I think about it.  My go to place, I highly recommend."}
{"text":"Based on all the positive ratings, I decided to try the beef sate pho here. I asked for the mild version, that way I could add additional heat to my liking. I was very impressed the broth was delicious, and I only needed to add about a teaspoon of hot sauce to get the heat I like. I will absolutely come here again. Also, the staff are pleasant and very helpful."}
{"text":"Of all the Vietnamese pho places across the GTA, Pho Dau Bo is my absolute favorite and probably one of the best. For those who are not familiar: pho, noodles, and ramen are NOT the same. If you disagree, prepare to throw down with hardcore pho lovers.  The reason I hold Pho Dau Bo in such high regard is because they have multiple locations across the GTA, stretching from the Hamilton area to Scarborough. It never makes a difference which location I go to. The menu is identical and the quality is always consistent. Not only that but even if you order a small pho, it's bigger than most other places.  Of course, Pho Dau Bo doesn't just limit themselves to pho but also a number of really good Vietnamese dishes. Though my favourite thing to order is a number 344 large beef and chicken pho, I also enjoy their rice and vermicelli dishes. It's definitely a good choice if you want quick services and affordable food that's filling and satisfying."}
{"text":"The best pho place. I love it here and have been going for years.  The service is always quick, pho is great, prices are good, basically anything you need in a great pho place.  I have eaten at so many pho places over the years and no one beats this place."}
{"text":"Hands down the best beef saté Pho we've ever had. Rich flavourful broth with all the classic Pho spices melded perfectly, plus tasty peanut meal and hot peppers. No need to supplement with the sauces on the table. Perfect noodle texture, and sliced beef that actually had its own distinct flavour from the broth. The spring rolls were good, with a particularly nice fish sauce. Definitely coming back when in the mood for Pho again!"}
{"text":"Have to say Best Pho in town! Soup is unique. Not overly salty or heavy as in most other places. Very generous portion of shredded beef. Friendly staff. I broughy my 2 kids along and they immediately brought me kid size bowl and scissors for them. I will definitely go back again."}
{"text":"Impeccable service. It's hard to fault anything about this restaurant because of the quality of their service.   From the outside, it looks like just another little place in a strip mall but the inside is quite large, well-lit and airy. We went on a Wednesday night, were promptly seated and our order came out in less than 10 minutes.   I ordered the #15 which was pork chops, shredded pork, quiche and fried egg on rice. (Tryna channel my inner cave person). It tasted much better than it looked. The kids shared taro bubble tea with lychee which they thoroughly enjoyed.   Speaking of kids, bonus points for being kid-friendly. There was no kids menu but the servers were nice to my kids, brought them kiddie bowls and accommodated our special requests. I counted at least 5 high chairs and 4 booster chairs.   All in all, it's worth the drive."}
{"text":"Excellent beef Saté soup! As many said before, the amount and quality of spiciness is spot on. I like my broth more on the red/peanuty side, but truly this place makes one of the best Phos you can have in Calgary. Will come back for more and spread the word."}
{"text":"If you want vermicelli then go to any restaurant that has it.  They all taste the same to me.  But pho...you can't mess that up because it makes or breaks you.  There's only a handful of pho restaurants in Calgary that impresses me and this is one of them.  First off, yeah this place is in the ghetto but the best Pho in town are in the ghetto.  This isn't your typical ghetto pho restaurant though.  The place is clean and modern which is a bonus but I'm here for food and I could care less if they have nice lighting fixtures.  Still though, it's nice to go to a clean and modern place.  1 star for that.  I recommend their Pho Satay but you can't go wrong with any pho.  The soup is hot (I hate warm soup where it doesn't cook the raw beef) and the vegetables are fresh.  The spring rolls here are great too so don't pass that up. 2 stars for good food.  The service is your typical - here's your food, see you when you're done type of service.  That's fine by me.  I'm at a pho restaurant.  Bring me my food without your finger in my soup and I'm fine.  1 star.  Would I come back?  hell yeah!!!..1 star...  Total 5 stars!"}
{"text":"Slow service but awesome food! If you are very hungry go medium with the pho... I order small and I cannot finish it."}
{"text":"My boyfriend and I went to have dinner at this location and we ordered viatnemese spring rolls as an appetizer. The waitress brought us the wrong appetizer but we didnt know this was the case and as this was my boyfriends first time at the restaurant he thought it was the spring rolls we ordered and took a bite. He quickly realized it wasn't what was ordered at the same time that the waitress came to our table to say it was the wrong order. The waitress quickly became really rude as my boyfriend asked her what it was and started fighting with him saying he had to pay for the roll because he bit into it. My boyfriend told her it wasn't his fault the wrong dish came to our table and instead of her being understanding her attitude became really upsetting.  I intervened and asked for the manager and another waitress at the same time brought us our main dishes. As she sat our dishes down I told my boyfriend we should leave because I had lost my appetite. He looked at my plate and there was a hair in my food!. I quickly told the waitress that we didn't want our food and asked for a manager. They were unable to produce one and were not very accommodating. I paid for our drinks and left but was really disappointed with the service received. They lack customer service and etiquette. Will not be going back here."}
{"text":"They suck.... Watered down. Small portions. Too msg in soup makes my whole mouth dry afterward. Never coming back again since i found a awsome pho place downtown."}
{"text":"The service here was great - our teapot was never empty, I love that! The food was really good though I did miss having Sriracha on the table. They have a different kind of hot sauce which was good but not as good. The pho broth was super tasty. I would definitely return!"}
{"text":"YUM! Vietnamese is all about the Pho, really the broth.  This is where the Pho Sate is at! The service is fast and courteous what more can you ask for?  The only Sate that I think rivals it is the Sate at Saigon Passion in the NE, but it's a different kind of sate.   Pho Dau Bo's sate is sweet, spicy and hearty, if you finish the bowl and don't feel like rollin out, you win.  Delicious."}
{"text":"Probably the best Pho in all of Mississauga! The flavor is truly amazing! I also love the rice here as it tastes homemade and fresh.  I think the bubble tea here is also pretty good.  The only complaint is probably the nasty washrooms but other than that the service and food is very good."}
{"text":"I don't venture into this area often. Well because i never had a reason to until i visited Pho Dau Bo.   I have eaten a lot of pho in my life and i find their Pho Sate to be the best in the city. Basil's is the second best.   However i have to warn you that most of the friends i bring there have their lips turning red once they start digging into their Pho Sate so be forewarned that it may be too spicy for the ones who cannot take too much spice.   I've tried their Vermicelli, Spring rolls and salad rolls and those are decent as well however I would say their most popular dish is the Pho Sate.   Service is decent, you get your water and tea and pay when you're done eating. Not bad!   Definitely worth venturing into Forest Lawn to check out! Enjoy!"}
{"text":"I had my first pho here and now I'm seriously let down anywhere else I've tried it. Although I'd love to write more, I'm just about to jump in the car to go get some pho."}
{"text":"The Pho Sate Chicken was pretty yummy (esp for $9), as was the S3 special (pork, shrimp, sausage and spring rolls). Portions are very large and the service is very fast (if not a touch surly).  The one disappointment was the the pork and shrimp roll - it was pretty bland and missing any fresh herbs, probably best to skip.   Maybe the cold roll with mint might be a bit better."}
{"text":"Was in Calgary for the weekend and wanted to try the pho fare there.  This place is highly rated in Yelp.    The commute from downtown was long but I  figured it would be worth it.  I was wrong.  The decor is typical of a Vietnamese restaurant.  Service was quick.  I ordered a large #1 pho and quickly realized that it was off:  - the large size was the same size as regular in most other pho places I've been to. - the broth lacked richness and a spice profile - the noodles were stiff and undercooked - the tendon was underhydrated, gristly, and chewy  To add to that, the lemonade soda was too small and mostly ice.  If you want consistently good pho, I would go somewhere else.  If you've had Pho Tau Bay in Edmonton, you would know what I mean."}
{"text":"We arrived 25 mins before it closed, she said we have to take out, after 5 mins vietnamse couple came in, sit down and order with no problem, and they also get food before us, such a terrible way to treat customer. Btw the food we have to eat in parking lot are great."}
{"text":"A lot of people look for customer service when they eat.  This place definitely does not have that, but this maybe your thing.  When we first entered we were just pointed to go sit at a table. We were served tea and i asked for ice water (not a big deal).  The order check is on the table and you write down what you like and they come and take it.  The food was served fast.  Like a lot of pho, it all almost taste the same.  This pho was a bit saltier but not in a bad way. Overall the meat and soup tasted good.  After we were served our food we never saw the waiter again until i had to ask for a refill on water and after that we went up to pay.  If you're looking for good pho and dont care about customer service this is a good place to go.  I did notice one of the gentlemen pouring bowls of soup into a bucket and cleaning a few counter tops and right after serve food.  Not sure if waiters wash their hands after touching money but again they are only touching the outside of our bowls hopefully."}
{"text":"The pho is delicious! I've tried the regular pho and the pho sate. I moved here from Houston and I think pho sate is maybe a Calgary or Canadian thing? Anyhow, it's amazing if you like a spicy kick. The broth has perfect consistency. I've only had pho sate and two other places around Chinatown area and I like this place the best.  The service is okay like most Asian restaurants. They take your order, food comes out fast, and if you need anything, just wave someone down otherwise they're not too tentative on you."}
{"text":"Impressive!  The spring rolls here had the most delicious Vietnamese dipping sauce (Nuoc Cham) we've tasted in a long time.  How can such a tiny dip have such big flavor?  The server picked out the pho beef sate  for us which was one of the most delicious ones I've ever had! Other than the generous usual accoutrements, we didn't need to squeeze any extra condiments in this wonderful broth because it was perfectly salty, sweet, spicy, and nutty. The beef actually had lots of flavor and the noodles were perfectly cooked.  Delicious!!"}
{"text":"I love the food here. It's a hole in the wall, cash only type of place but the food is consistent. The beef they use in their noodle soup is lean unlike other pho places.   As for the roach sightings, why is it that many of you report it on yelp but no one takes photos of it? Please add the pics!"}
{"text":"The best pho in town! Great fresh soups. Though the service is a hit and miss."}
{"text":"GENERAL INFO Pho Dau Bo is Mississauga's best pho - fo sho. Certainly features Missisauga's best Vietnamese spring rolls. The spring rolls are nice and crunchy and are packed with Asian goodness - just like me. The best thing about this place (and all pho places in general) is how cheap everything is! Huge bowls of noodle soup with thin slices of meat and sprouts. Add fresh mint and more sprouts to really get the party going and then listen to the huge bowl of soup in your stomach move around.  MENU RECOMMENDATIONS You can't go wrong with pho and a spring roll. The fresh rolls are also very good.   LOCATION NOTES Located on the North side of Dundas, just West of Dixie.  SERVICE NOTES If you've never done pho before the service may surprize you. You're given a menu and what appears to be a warehouse order form. That's actually how you place your order. Write down the menu number, size and quantity and hand it back to the server.   HUMOUROUS STORY Pho may not be the greatest option for a first date. I was out the other day with a friend (luckily only a friend) and I kept splashing her with my broth as I tried to slurp up my noodles. At least I got her wet. Ehyo! Also, another reason it's bad for a date - no one wants to get busy when they've got a belly full of soup swishing around."}
{"text":"Best pho restaurant in GTA so far!  I always get medium size rare beef pho with deep fried spring rolls. The rare beef is super tender and the soup is consistently delicious! I only concerned of the bean sprout which plated on the side because it does not look appetizing.   I have been visiting here so many times; the soup, and great cost performance.  I also love their mango or avocado milk shakes for the dessert!  Must try!"}
{"text":"We go to Toronto a lot to try and experience a lot of Asian and other ethnic foods. On this trip we had to make a stop in Mississauga so we decided to stop here for our pho fix instead of fighting traffic through downtown TO.  Alright the first thing I notice... and I notice this RIGHT AWAY...   THEY TOTALLY RIPPED OFF THEIR \"TRADEMARKED\" LOGO FROM THE LAUGHING COW CHEESE COMPANY!!! HAHAHAHAHAHAHAHAHAAAAA  I the first page of the menu, they brag their \"trademark certificate\". Wow, who does something like that?? Well apparently there are other pho joints around that copy this logo as well, or come close to it. How can they be taken seriously? SMH  Anyhow, about the food. This is FACTORY PHO at best. Reminded me of the Peach Garden (another pho chain in TO) but even not as good as that. Total factory pho. Factory food in general. But that's what happens when you eat chain food. And this IS a chain. But we took a gamble on it.   The pho broth was very salty and non-descript. My husband had the bo hue, which looked and tasted pretty authentic, but was also very overly salty. Our fresh rolls were very loosely packed and fell apart easily, again with pretty non-descript tastes in them. Bubble teas were very fake tasting. Must have been cheap mixes.  This place was definitely not your unique little family run restaurant with original recipes. Even looking around at other peoples' orders I'd say its pretty generic stuff and I don't think I'd be making a stop here again. I'd rather fight my way through Toronto city traffic and have a decent bowl of pho and other Vietnamese goodies at one of the gems on Gerrard Street."}
{"text":"Simply the best pho in town.  The broth is tasty without the MSG.  Toppings and meat are of high quality, with little fat and gristle.  It is my go to place for visitors who want great Viet food, esp the pho."}
{"text":"This place makes true Vietnamese pho noodle soups. Don't let the haters here expecting a completely different, inauthentic experience ruin your perception of this restaurant."}
{"text":"I am not big into soups, but love lemon grass chicken dish, and this is the best I've found in the city.  Service is always fast, they're very friendly and remember what you like when you come back... :)"}
{"text":"My fiancé brought me here and while I thoroughly enjoyed the food and the quick service.. I have always had a view of where I'm eating, based on their toilets.. And so I finished eating, went to the bathroom and the toilet cubicle I went in was disgustingly dirty, dusty, and just unclean.. I felt sick leaving.. The way I see it is, if the bathrooms filthy, God only knows how my food was cooked! So overall wasn't happy with this place :( the food was lovely but attention to detail on the cleaning wasn't!! Was really unfortunate"}
{"text":"We call this place (a)phodable haha. One of our favorite viet restaurants in the area.   No fancy decor, but the food here is good and affordable;) service is quick, lots of choices on the menu, perfect portion. I am a pho dat biet fan, that's the only dish I order, my bf is a vermicelli kinda guy, he loves the ones they make here too. I always steal from bf's bowl and swear I would get vermicelli the next time, but always end up getting pho dat biet again and again! Pho dat biet man, it is just so good. The avocado milk shake is also very creamy. I was craving for some spring rolls but we didn't want to be over full, much sadness, next time man, next time, I am gonna come get you!   Good authentic Vietnamese food, not stunning, but highly recommended if you are in the area and craving a quick Vietnamese meal!  Don't be fooled by the look of the restaurant. A hidden gem.  4/5 food- delicious 4/5 service - decent & quick, could use some smile 3.5/5 atmosphere, lack of decor, no big deal, pretty tidy, no sticky tables. simple chair and table set up, would be nice if there are some booths.   Funny logo btw (I see what you guys did there haha)"}
{"text":"Hands down my favourite Viet restaurant in Mississauga.  After eating at so many other places, there is something that keeps me a devoted regular to this place. I love their pho... something about the broth keeps me addicted (other than the MSG lol). You can actually taste... the beef essence, not just watered-down grease.  Bang for buck.... best I've seen. Very good portion sizes for reasonable prices. They opened up another place in Creditview & Bristol. Just as good if not better.   What to order: spring rolls, pho, vermicellis, pork chop with rice, avocado shakes.  Technically that summarizes half their menu... but for me, it's just THAT good. Worth a try at least if you haven't tried this place!"}
{"text":"They don't take credit or debit here! Needed to say that up front cause my stomach was too hangry to recognize the signage going into the resto and in the bathroom!  That being said I had the rare pho with beef balls and shared a side of fried spring rolls with the hubby. Would've taken a picture of it but my mouth was faster than my clicking finger lol  The spring rolls was tasty but smaller than I'm use to. The broth was soooooo delicious! Hubby and I bought 2 smalls. Should've bought a large and shared it  The small didn't have enough meat for my taste.   I'm really curious how their vermicelli bowls will taste! I shall return! To be continued :)"}
{"text":"Whenever I'm in town and craving pho, I come here. I've been to the other locations (including the ones in Hamilton and St. Catharines) and I would say that this is the best one. It's cheap, the quality of the food is consistent, and the food comes quickly. It's a pretty no-frills sort of restaurant so don't expect anything flashy."}
{"text":"I love Vietnamese food!  I've been to Pho Dau Bo twice.  They are the fastest Viet restaurant I've ever been to!  The bun with pork and spring rolls is very tasty and fresh.  I also like their satay soup with chicken (I get it without noodles & with extra veggies).  It's very hot and spicy.  It's great but not what I'm used to for satay soup.  It's not peanuty at all.  Regardless, this is a great stop for a fast and delicious lunch."}
{"text":"** This 1 star review is based on their service, and is not applicable to their food **  I've always preferred Pho Dau Bo over the 99 chains; this time however, they've left quite an impression. Being a first visit at location, we definitely won't ever come back.  My family and I walked in just under 9:20 pm.  One of the older ladies, working at cash, greeted us with a sweet smile & directed us to a table.  We noticed there were no other patrons in the restaurant.  Uncertain, I double checked to see if they planned to open until 10pm as advertised, or closing up early. (Many pho restos tend to close early if they aren't busy - pho 99 grand park, alike)  The cashier assured us it was okay, and proceeded to seat us. At that point, two younger ladies who were cleaning up, began scoffing at us, cussing in vietnamese, and tossed the menus onto the table. ...really?  Needless to say, we left."}
{"text":"I am not sure what all the hype is about this place...We rolled into town later in the evening on a Tuesday and were hungry for some Vietnamese. Since we were on this side of town and the reviews were really high we said \"why not!\"  I found the interior, washrooms, service and food to be very low maintenance and quality. The spring rolls were just horrid and the bowls were not impressive. I found it to be super greasy and salty... I am a hot sauce fiend and found that the hot sauce was very watered down and tasted like a fake sriracha. Also, asked for the real fruit mango bubble tea and it arrived when we were almost finished and defiantly tasted like a powder (sad face)  We won't be returning...ever."}
{"text":"As others indicated, the food is very tasty and economical. The pho is fantastic!  The food preparation is quick.  My only complaint is the place is dirty. All the table condiments have layer of grime on them."}
{"text":"Hu Tieu My Tho may be my new favorite thing to eat next to Pho bo vien. Give it a try if you like seafood. Delicious broth without smelling like the ocean or tasting like it.  The restaurant isn't all that big so it tends to get crowded during lunch on the weekends. Plenty of parking though and decent service. Great food for a great price!"}
{"text":"Best sate beef soup I have had in Calgary. Pho Dau Bo knows how to get spicy correct!"}
{"text":"The food is excellent, but the service (especially when getting take out) is sub par."}
{"text":"A seat yourself joint. Write down what you want on the ticket and hand it to the server.  Pricing is super reasonable compared to the quantity of food you get. My only complaint is the brisket was a bit on the fatty side. I definitely would eat here again and again."}
{"text":"I've been here so many times.  The pho is good. I like it, you will too. I want to go back, I have been back.. here's the but... I'm traumatized after watching a member of the kitchen staff come out of the bathroom without washing his hands. We made eye contact,  you know what you did. I don't think his hands are in my soup but any time I'm dining at a restaurant and I see stuff like that it makes me question why I'm spending my hard earned money there. It really makes me wonder what type of sanitation and food handling practices an establishment has. I've brought many people here. Now I'm hesitant to do that..buttt mannn that coconut shake is tasty!"}
{"text":"Just finished eating here. We had: Rare beef pho Chicken pho Veggie spring rolls  Pho was good. I have had tastier pho, but this was good. Skip the veggie spring rolls, couldn't tell what was inside.   The Atmosphere was not great. Big bright open space. You can hear everyone talking around you. Unforgiving lighting. Service was fast. If I come back it will for take out."}
{"text":"Great place to eat I arrive 25 min before close they were very nice to us. Did not rush us. Food is great and very reasonable priced."}
{"text":"Went in for take out and when I got home I must have gotten someone else's order. So I'm not sure how to review. I'm not quite certain what the dish was that I took home but it was tasty. There was meat that I believe was beef but it was a little sweet for my liking. Some salad and rice noodles also. The small container of sauce was very sweet and glad I tried it before dumping it on everything and wrecking it.  I will try again but perhaps try eating there."}
{"text":"I don't know how anyone could give this less than full marks (other than the obvious answer of just clicking on another value) because this place truly is as good as it gets.  The Pho Sate soup is great, a nice big bowl of spicy soup can easily be ruined in several ways, as I've experienced at other \"Pho\" restaurants trying to change things up by adding things to it... These guys add one simple secret ingredient that makes it stand out from all the others, without bringing everything crashing down.  The Pho isn't the only reason to come, as they also have the usual Viet fare, some of which I've tried, and quite enjoyed, but honestly, I go every week, and get the exact same order every time... Large beef Pho Sate, salad rolls with shrimp, and Iced Viet coffee with milk... Sometimes I'll add extra beef to the soup, but other than that, it's always the same, and they know me for it."}
{"text":"Our local Pho joint. For those not in the know, Pho is Vietnamese noodles, so this is a noodle house. They have a large menu that includes stir fried and other items, so there is plenty to  choose from. Pho Dau Bo is a chain, there must be at least a dozen locations now. This one is cash only, so be prepared before walking in. There's plenty to choose from the menu, whether you just want the Pho (soup), steamed or stir fried items. For the less adventurous, there are items like deep fried chicken wings also on the menu. Try the beef tendon brisket soup (my favourite) or the stir fried beef with vegetables (also my favourite, depending on my mood). There are plenty of versions and variations on the soups and hot pots, so you can find one that suits your tastes and moods. Staff are pretty friendly, the bathrooms are okay, there's always parking, but most importantly the food is good, cheap and comes pretty quickly. Comfort food in a bowl."}
{"text":"Good service and good food. Authentic vietnamese food, not chinese as other reviewer said."}
{"text":"This is probably more like a three and a half star restaurant. This is a no frills pho with heaping portions and small prices.   All the standard noodle soups are available, and I wouldn't recommend getting more than a medium to yourself as they are HUGE.  Brisket was way too fatty. The rare beef was pretty good, albeit a little sketchy, but I lived to tell the tale.   While I do prefer Pho Hung and other pho places downtown, this place is pretty satisfying, quick, and easy on the wallet. Definitely a place that the locals already know about, since it is usually busy despite being located in a run down strip mall. This is a perfect weeknight meal, preferably on a cold day when the soup can warm you up."}
{"text":"Yummy pho spot. Absolutely no ambiance, mediocre service at best - you go here for unpretentious food. It's always got a lot of people and I usually end up eating at least 80% of my food. If you are looking for a place to fill a craving go here, but if you're going for the restaurant experience - not the best choice. In my books this might have been a 'four' but in efforts to be objective and take the whole experience into account it ends up w a three."}
{"text":"I go to this pho restarant about once every month. It's the most decent pho in the area.  Service is quick and efficient. I feel they can probably change up the ambiance of the restaurant, and they can do a bit better with the quality of their food."}
{"text":"I like pho and I especially love this place.  It's always busy no matter when we come.  Their fresh rolls are always fresh and the pho is just pho-licious.  The food comes quickly and the garnishes for the pho are fresh."}
{"text":"This is my go to pho spot whenever I'm in the area visiting. Normally I have a hard time deciding between their house special pho and broken rice with porkchop since both are delicious. The staff here are very friendly which is a huge plus to me.  Excellent prices, food and service!   Don't forget to try their durian smoothie!  Soooo good"}
{"text":"Sate beef was sate right.   Clean place too. Love the unique bowls they have. Great attention to detail"}
{"text":"Hands down the best pho place in Mississauga. Reasonable price: $7-9 for a bowl of pho."}
{"text":"The beef sate soup is perfect. Just the right amount of spice and a hint of lemongrass."}
{"text":"Used to be my go to place for Viet when I'm stuck in Brampton. However, in recent years, the quality and portions have definitively declined steeply and yet the prices increased. I still go back from time to time, but only when desperate. I would recommend the pho and other broth based dishes....Those are their fortes."}
{"text":"I love this place - it's my #1 pick for Vietnamese in the city. The food is good, the service is fast, the decor is nice & modern, which seems to be a rarity for small asian restaurants. I always bring people to eat here. They are always surprised at how nice it is (decor-wise) and how good the food is. It's a gem in Forest Lawn."}
{"text":"Sorry, but this place was a total letdown.  Maybe a place just east of here on Dundas has caused my pho expectations go up, but this was pho-gettable.   Food/Menu: *Ordered 342 (special) small size and it costs $5.52.  There was a decent amount of meat and the broth was tasty, however I found it pretty salty.  Also, I found there was more meat than noodles, which is good, but sometimes I really want to slurp on noodles.    *I also ordered a crab claw and it was $3.  Yes, I know, it's weird ordering this from a pho place but I pho-ught I would try it out.  Unlike your dim sum crab claws, this tasted more like shrimp paste as opposed to stuff shrimp. It wasn't great,but it was edible and okay.  *They also have every single combination/permutation of meat and pho possible and come in four different sizes as opposed to just three sizes.  So I'd give the food/menu 3/5   Service: Okay, so I know this is a pho place, but the service here really irked me.  Sure, my toque, hat hair, dirty pants from walking in the snow make me look a bit like a hobo, but I was wearing a dress shirt, so they had to figure I'm not that poor (note to self: maybe I should take my mom and sister's advice and dress better and not wear clothes that are older than 5 years).  Anywho, I went in and they just pointed me towards a table.  Fine, but they could have said a few more words, like how many. I was ignored until I starred at them.    Also, when they serve you, they just kind of dump the food on table without saying a word.  Most places still say something or fake a smile or fake a non-angry face.  It just set a bad tone for the entire meal.  Then when I tried to pay, I felt like I was being spoken to in a loud manner to insert my card into the machine.  I was waiting for a prompt on the machine to say \"insert card\" but apparently this was one of those where you had to insert the card first without a prompt.  When I didn't do it, she goes to me \"put your card in\" in a somewhat angry tone.   Anyways, I paid, and after I said \"thank you and have a great day\", there was no response back.  THIS ANNOYS ME EVEN MORE!!! If they had respectable service, I wouldn't mind this, but when I'm trying to be nice to you and you ignore me, it makes me angry.    I felt like I was treated so poorly and I honestly do think that I was homeless or something or a teenager trying to get a free meal.  Terrible service, even for a pho place.      So 1/5   Verdict:  Decent food, non-existent service if you go solo and have somewhat of a \"messy\" look.  I'm never going back here as there are plenty of decent pho places in this area unless forced to. Sorry."}
{"text":"It's a great local spot for Pho in Brampton. They offer a menu with a variety of items, maintain a consistent taste, with quick service. If you're looking for that authentic Pho broth flavour, maybe not the best place, but they do offer good food for the area."}
{"text":"I called the number above and ask them if they take Amex and they said yes. When we got there they all of sudden did not. They were rude when confronted about it. Needless to say....that was horrible service."}
{"text":"Hate their service honestly, It kinda hard to eat when people aren't happy serving you your food. But the soup there is absolutely amazing pho is great! The bubble teas are delicious and have so many to choose from!!!   The place has nice spacing table arrangements lots of nice lighting too."}
{"text":"Best pho I had in Toronto. Place is spacious, clean and a bit dimly lit. Their soup is not overly salty yet flavourful. Both noodles and beef are very tasty, and tender. Service is friendly and attentive.   Definitely recommend it if you live in the area."}
{"text":"My favourite Pho place in town. I go as often as I can, which is not that often since I live in Okotoks. I wish I could go more."}
{"text":"So delicious. My husband and I each had the pho satay, and got a beef ball soup for my girls to split. Also had an order of spring rolls and a couple of mango bubble teas.  We are all leaving wonderfully satisfied.  Best pho we've had."}
{"text":"Our favorite place in Calgary for pho, pho sate, oxtail pho, subs and spring rolls. Everything we've had here has been awesome and tastes home made and fresh. Helps that the service is good too"}
{"text":"We eat here quite often, at least once a week! Their food is always consistent which we appreciate as we eat just about everything on the menu. Service is fast and it's great value for the cost."}
{"text":"This place is great for late night. I had the special pho-broth is good very light and clear with a little bit of fatty broth. As for the beef brisket and rare beef it's very chewy, beef balls are homemade which I can appreciate but a bit different in a pho, feels like it would be better in a rice or vermicelli dish. Service is friendly and quick not rude like your typical pho restaurant. I would come back again but not my go to pho place."}
{"text":"This is now my #1 place to go. I literally go out of my way to hit this place up!!!! ..... Now I want pho... :("}
{"text":"I had my first taste of pho here about 4 years ago and it was tasty but I have to agree with the other reviewers about the cleanliness issue (perhaps its gone even further downhill since then) and doubt i'll be going back after reading about the roach in the dipping sauce from the review below."}
{"text":"So I came in today and ordered a noodle soup. When it arrives I put in the herb and bean sprout then I stirred the soup and to my surprise a long curly black hair popped up. I called back the server and told him I was disgusted by the hair. He told me and even made hand gestures to scoop the hair out and it should be ok. I was like hell no and asked for a new soup. He didn't take the soup away and left to talk to the kitchen. 8 minutes later when I was about to leave, he came back to take the soup away and a new guy brought a new soup out without an apology. I ate only half of the new soup, paid my bill and left without a tip. I would never come back here again."}
{"text":"Do you know how hard it is to do pho takeout well? Well these guys do. Ordered the Satay Beef pho to go. I love the broth, it's Rich and savoury with a good kick. They packed up the beef raw (wrapped separately) which meant it was still nice and tender when it came time to eat it.  The beef was a lovely pink, fresh colour.   Standard sprouts, basil, chilli and lime. There was also another herb I am unfamiliar with but tasty.   The restaurant was very clean and the service was fast and friendly.   I loved it, I would recommend it, and I will definitely be back to try more."}
{"text":"I go there with a coworker and it holds good memories for me. We usually sit by the window of the restaurant.  The broth is delish, it isn't too salty like what most soups are. The contents are okay, not too much, not too little.  I think Noodle World's menu have more variety. And it makes sense to make the comparison because they're right next to each other. But this restaurant can stand on its own based on its soup stock.  The service is better than the Noodle world, they smile more and are more courteous.  Overall it's a good restaurant."}
{"text":"Food: A- Service: D  Overall: B-  If you can put up with poor service but fairly good food, this place is a good option.  This place is probably one of the best Pho place in Brampton.   This is probably a good place also for couples dinning but the service staff are unfriendly towards group accommodation.  When a group of 15 of us walked in, the waitresses were immediately frowning and were very uncooperative."}
{"text":"Tried the 455 vermicelli with spring roll and meatballs. Was told the sausage was the \"meatballs \"."}
{"text":"I really like this place. Whenever we have a cold winter day, I often dream of a nice warm bowl of pho to warm me up. I usually end up going for the spicy beef or chicken.  If I'm in a laid back mood I also order the blood pudding because that is definitely one of my favorite things. The amazing thing sbout this place is the fact that the food is made to order.  The bowls come out steaming hot and all the condiments you need such as soy sauce, sriracha and so on are readily available. The restaurant is hard to find if you don't keep your eyes open but it's a very nice place nonetheless."}
{"text":"Nothing fancy here, just good solid pho and Vietnamese food. Best pho and Viet food in Brampton that I've had."}
{"text":"Got takeout from here. Tried the salad rolls again (AMAZE), chicken pad thai (standard, good), singapore stir fried noodles (good, more curry flavour), and crispy noodles with pork and veggie. What I loved was that the pork and veggie crispy noodle wasn't actually on the menu - but the guy on the phone suggested it because I was already getting chicken. All this came to 40$ish, and was enough to feed 3 WITH leftovers for another 3-4 servings.   I wish they would deliver!"}
{"text":"Amazing, fresh food and everything was full of flavour! Staff was very friendly and welcoming. Love the shrimp springs rolls, sate beef pho, sate chicken and spring roll rice vermicelli and fresh fruit bubble teas! We will definitely be back!"}
{"text":"I was just here recently, and I must say the service was very good. The staff here is very friendly and it gave me a chance to practice my broken Vietnamese, plus the people here are very understanding and help me pronounce the language.   The food is actually very good; I got the beef and noodle soup with the vegetable spring rolls and the Vietnamese coffee- which was gooood! The coconut juice was very refreshing.   I will definitely be back even if it is only to practice my broken Vietnamese."}
{"text":"The best tasting Pho Noodle Soup in Cow Town! Me and my family always have Pho here for many years and we love it, they are always consistent with the taste.  it's locate in the Little Saigon Square and parking is not hard to find compare to downtown.   Its a must try!"}
{"text":"Beware if you get there near closing time .. they lower the temp on the soup so what happens when the raw meat it cools down too fast to cook the meat .. the owner tells me he does not know why the meat does not cook sometimes .. no refund or discount .. could not eat finish meal"}
{"text":"We came here at around 2pm for lunch. Their items are decently priced, with decently good food. We got spring rolls, a bowl of pho, and a rice platter.   The rice platter was pretty good, there wasn't anything that stood out to me in taste. The meat portions were kind of small compared to some other places.   Pho was exactly what you'd expect pho to taste like. Again, nothing that really stood out.   All in all, I will definitely be coming back here. I see it as a very typical Pho joint."}
{"text":"I went there yesterday with my husband and two other friends for dinner at 18:00.  The service was excellent, and the food was great.  The bill for four people came to $33.00.  A great price for the quality they serve.  One of the servers was quite pleasant, joking about one of our friends that arrived late.  All in good taste may I add."}
{"text":"The beef sate was just beef and noodles.  I've had pho before, usually theres some veggies."}
{"text":"Hands down the best Vietnamese food I've ever eaten! The sate soup is amazing!!"}
{"text":"We stopped here before a camping trip in Banff, really great and steaming hot pho. The ONLY thing I would ask for is a meatball + beef combo. But you can always modify the set menu options for a small price."}
{"text":"Use to my old favourite pho place so I have been visiting on and off for at least 7+ years. However, today's recent visit was a total let down. They use to be so good but I tried the Bún bò Viên in size Medium for $8 and my mom tried the Bún bò Hu $8.25 or $8.75. Both of us were not impressed.   My dish was a bit salty, not enough noodles and meat balls were pretty small. My dish was suppose to have rare/medium rare beef but it was totally well done.   My mom said the Bún bò Hu was too salty and the meat not fresh too. She wasn't into it.   I think the owners or chefs changed according to my mom. Sadly, we will start looking for other pho places now."}
{"text":"The reviews were mixed below and I wanted to give this place a try. I must admit it wasn't the cleanest place to walk into. The table i sat at wasn't cleaned properly from the person before and i had to ask the server to do a better job.  I ordered me some pho special with all the fixings. I also have to admit that i am not Vietnamese, but I've traveled my ways around the globe and have had the pleasure of seeing experiencing pho at many places. I think this dish wish its flavors can stick with some of the best of them. I did find the broth a little on the Salty side, but overall, I was satisfied and will go back there for more."}
{"text":"One of the better Pho places I've been to, always consistent! Great value for the price too.."}
{"text":"Always great food ,never been disappointed. Fairly quick service even during dinner rush . Place seems clean to the eye !"}
{"text":"Best Vietnamese food in Calgary! Don't let the location fool you. I went there because a friend had told me how good it was and he definitely did not lie. The vermicelli bowls are so flavourful and they are the perfect portion size. A little on the pricey side compared to other Vietnamese places but the taste is worth it. Mango bubble tea is amazing too!"}
{"text":"Food was very tasty and inexpensive, I tried the beef rice noodle soup medium and the portion was for 2 people for just $7.50, also a was expecting a dirty place because of the outside looking but no, everything was clean and shiny. The music was nice, peaceful songs very appropriate for dinner. The spring rolls were good as well.  Servers were very friendly, I will definitely come back to try more of that delicious food."}
{"text":"this is my favourite Pho restaurant in Ontario (for Pho). I've been going to this particular locaton for over a decade, so maybe I've just used to the taste, but my g/f is Vetnamese and her family loves this place as well, so I take that as confirmation.  There are 2 dishes that I generally get here. Pho Dac Biet, or Vermicelli (sometimes both). Pho Broth is rich and delicious. The veggies (rau) they provide is fresh and plentiful. They don't stinge out on the mint leaves and even provide culantro which some places do not. The limes provided are usually pretty fresh and full of juice. It might seem like really small things. fresh juicy limes, culantro, lots of mint leaves....but it's those things that I attribute to having a good bowl of pho, and what sets one place out from another (after of course the taste of the broth).  The vermicelli, though not as stellar as the pho in my opinion, is also good. The spring rolls aren't too greasy. the veggies they provide are in good balance with everything in the bowl, and the grilled meats, are tasty and also well balanced out. Definitely a solid option if you're not in the mood for a noodle soup.  I've been to the Pho Dau Bo in Mississauga, Waterloo, and Hamilton, and have always like the Pho at each one. If they had the best com tam, mi kho, and bun bo hue too, then it'd be a hands down 5 star review."}
{"text":"Sate beef pho is to die for! The broth is amazing with such depth of flavour. I love this restaurant!"}
{"text":"This is my favorite pho place in Brampton. The price is decent but the food is comparatively better than any other pho in the area. I recommend the beef pho, curry chicken fried rice, and, especially, the grilled chicken (which you can order extra with anything). The wait staff is nice and accommodating as well."}
{"text":"Way better than Pho Mi 89/99 in my opinion..  Clearer broth, better flavor, not too expensive.  They've got a fantastic Cha Gio pork & shrimp spring roll, WAY better than most other chains in my honest opinion.  They've also got a very solid grilled pork chop on rice, nice and caramelized although small.  Had to take a point away for the poor service although it's typical of Pho restaurants, and definitely is not very clean.  Tables are always unwiped and sticky, and the bottles for condiments are always greasy and uncleaned as well.  But it is what it is, a solid bowl of pho!"}
{"text":"Best Pho I have had in Calgary. Period. Just go."}
{"text":"Had the sate beef noodle soup...really good spicy too! Good service, open bright spot. Sign is hard to see at night."}
{"text":"I thought the food was great here. The staff were extremely friendly. The manager (I'm guessing) even came by and ask how the food was, which I've never experienced at a cheap Asian restaurant. I've also gotten take out from this place and they are fast."}
{"text":"Always a favourite. Very delicious flavours and quick service. Perfect lunch time spot."}
{"text":"Sweet Zombie Moses  The first time I ate here, I had a food epiphany. Being a seasoned edmonton Pho veteran,  I was not expecting much but holy moses. Such flavour in a single bowl of goodness.  Beef Satay & Weekend special BBH are absolutely insane. Add a couple chilis to make for a painful yet still flavourful experience. Well worth the trek to Forest Lawn.  Can a restaurant be one of the primary reasons for me to move down to Calgary?  Yes it can."}
{"text":"After an emotional week of exams and poetry, my stomach needed food to refuel my body. My usual comfort food is instant noodles. But today, my friend and me drove towards Pho Dau Bo for a delicious lunch.  Arriving at the restaurant, we sat at the nearest table. The décor was simple, utilizing a dark green and white color design. The room was spacious enough to move around.  Perusing the menu, I decided upon Pho with well-done beef. My friend ordered the Pad Thai. Both dishes arrived quickly, steaming hot and fresh.  The pho tasted average, as the broth was too salty. However, the texture of the noodles were soft. The beef was tender, complimenting well with the noodles.    My friend said the Pad Thai delicious. The noodles were perfect texture. The sauce was sweet, spicy, and salty, balancing each flavor perfectly.   Pho Dau Bo is great for a quick bite or eating out with friends. The food is average, as the Pho did not impress me. If you are nearby, venture towards here. I will return for the Pad Thai."}
{"text":"This pho restaurant has great variety and is always a good idea for a cheap eat. The broth is okay, a bit saltier than other places that I have tried but clear. I usually order a bowl of pho or a rice dish. Dishes come out extremely quickly which makes me assume that they have a few things already pre-made as I have received chicken that was a tad dry. Their fresh rolls are made to order with fresh ingredients and include a fish sauce for dipping. The service is not attentive and a bit rushed but I wasn't expecting anything different. This restaurant has other chains in the west end and is pretty consistent."}
{"text":"Service was quick and easy food was served fast and hot. Just like all pho dau bo locations, you can't go wrong. Although this location seemed cheaper than other location and serving the exact same items on the menu. Overall experience is a go"}
{"text":"Went here after reading Yelp reviews. We are always on the lookout for a good sate soup. My expectations were high since almost all the reviews raved about the Sate soup here. I was a bit disappointed, as I found the meat had a lot of fat in it. The sate broth was good but I find it on the thinner side. I like the consistency of the Sate soup in Pho Hoan and prefer my sate with egg than rice noodles. Service is another story. They lack the warmth and friendliness here, as if they don't care whether you give them your business or not. This was an ok place, I'd keep going back to Pho Hoan for hearty soup."}
{"text":"Like the other Pho Dau Bo restaurants in all of Ontario.  The pho is delicious.  You can't go wrong."}
{"text":"My friend has highly recommended this place, and here I am. He said their spring roll is the best, and how would I leave this place without trying?   We had spring roll to share, and we each had the special pho.  It came with a bit of everything;  flank steak, tendon, tripe and meat ball.  The dish of basil and bean sprouts was pretty fresh.  I like the broth.  It's clear and intensely beefy.   The spring roll is different from those I used to have. It's the wrapping that made the difference.  The wrapping is crispy but not crunchy. I'd prefer those I used to have over this.  But it's no harm to try something different.  The service is fast and friendly.  Unfortunately, the place is a bit run down."}
{"text":"Quite a good pho here for a reasonable price. The durian shake is tasty here as well."}
{"text":"I come here so often that I think I deserve the staff to acknowledge my presence and say at least Hi and Thank You. But NO! Not only they ignore you every single time, you have to call them over to place your order. When the food comes, they just drop it quickly and leave without saying a word. I sometime wonder it they are all mute and deaf. We have to repetitively ask for water that we can't never seem to get. The only reason I come here is because I like their Hu Tieu dish, but they have reduced the portion so much that I don't think I should ever come back. Adios!"}
{"text":"Great fast service! Authentic Vietnamese style food in a Vietnamese dining setting. Pho Dau Bo is a mom and pop shop with multiple locations. I always order their mango milkshake."}
{"text":"I've been here often enough because I used to live right behind it when I first moved here and didn't go as frequent after I left the area. It's pho, you get what you expect but the service is horrendous every time I walk in. They don't ask you if you want drinks before they take your sheet, utensils always have to be asked for and they're not as attentive as other pho restaurants I've been to. They also prepare some of their raw food outside of the kitchen in the eating area which is so weird to me. I've now found another pho restaurant in brampton that I go to because this place just doesn't cut it for me."}
{"text":"Nom nom nommy.   Pros: - Inexpensive Vietnamese food - A wide variety of options (Vietnamese, Chinese, Thai)  - If you need recommendations for things to get: pho (duh), bun bo hue (spicy vermicelli- I usually get it without the pork blood), pork chops, their mango milkshake..mMm  Cons: - Ambiance; then again, you get what you pay for  - Can't pay with credit    I am a big fan of Vietnamese cuisine so by nature, I love this place. I've been here on multiple occasions and you really can't go wrong with it. Granted, it's not where you'd bring a first date... but people go here for the food."}
{"text":"It's been a while since I've been to a new Vietnamese restaurant.  I was in the area and had to try it out with all the good ratings.  Tonight we only had :  344. Beef & Chicken Rice Noodle Soup (rare beef, well-done flank, soft tendon, beef tripe, beef balls & chicken) XL size for $7.50  The noodles were only so-so (tasted old and not fresh), soup is ok (not as tasty as Pho 88), and the meat was tough, not much flavour, and maybe left overs.  Maybe it was just a bad night.  We were there on a weekday evening (about 8:30pm).  The selection of pho (rice noodle soup) on the menu was actually quite decent, spanning 3 pages.  I also found one of the waiters quite rude.  When I tried to ask for the bill, after looking at me but ignoring me for a while, she rudely notioned that there is another customer at the counter paying his bill .. which seemed to take forever.  In any other restaurant, they would have at least acknowledged you, then came to you with the bill after serving the current customer.  The other waiter on staff seemed more polite.  Maybe it was just my bad luck.  Sometimes places are like a hit and miss.  From my experience tonight, I wouldn't recommend the pho or the service."}
{"text":"That was a severe blow to the Pho name. The service isn't a D grade as mentioned earlier. It's an E to an F.   Sat down, took them 10 min in a not busy time to give us tea. When I called back to order, i was told rudely that we needed to write down our order then give. I didn't want noodles in the beef / chicken soup just some extra veggies. The server flat out refused. Rudely. Still placed the order, plus for a shrimp mango salad, Vietnamese style spring roll with shrimp. Last order was shrimp stir fry on bamboo something. v62?  Ambiance: Backyard restaurant. Nothing to write home about. Not unexpected.   Food: my soup which was basically beef / Chx broth with protein and veggies was nice. Then again not much to cook there. The shrimp mango salad was 4 fried shrimps placed strategically at the angles of the pyramid mountain of sour mango. Pointless. The shrimp rolls were again terrible, not rolled tight and just lumps. The last order for the shrimp we got the wrong order. (Twice). They gave us Pork instead of shrimp and instead of remaking it just removed that part from the plate and added a tiny bit of shrimp to it. We could tell. The shrimp skewers on bamboo were even worse. We had a hard time figuring out what the order was. Most of the stuff was left on the table uneaten. Also did I mention the servers didn't even bother coming to the table until we waved for a while.   All in all one of the worst meals I've had in quite a long time and by far the worst pho places. Absolutely not recommended."}
{"text":"As being Vietnamese, finding good pho from a restaurant has always been a struggle for me. However, I still haven't given up on finding a good one! I think pho dau bo just isn't the one! I remember going here when I was a little kid with my family since it was really close to home. But, I think it's changed over time. Since, the beef brisket in my pho was 80% fat! There wasn't any meat at all. The broth was also overly salty before I even added the hoisin and sriracha to it. The only highlight was the service, the waitress was patient and attentive to our orders and requests as we had a vegetarian with us. Overall, I don't think I would come back again."}
{"text":"The pho was really good but lacked in meat when compared to other places like Pho 88. The The shrimp paste spring rolls were okay but what made it amazing was the sweet plum sauce that came with it. You can drizzle that sauce on anything and it would taste good. To wash all the food down I got a durian milkshake which was also good but didn't have  a very strong durian taste. Overall happy with the outcome of this place when I wasn't expecting much."}
{"text":"Worst experience  I had in a restaurant ever since I moved to Toronto. Went with a group of friends and ordered noodles and drinks and after half an hour only drinks came, waited longer and still sign of food. Then after asking one of the waitress, she realized that they forgot to place the order to the kitchen. Wasted an hour in the restaurant and treated like trash, employees didn't even apologize for causing the trouble. My friends and I left after paying for the drinks and cancelled the food. Worst customer service"}
{"text":"OK, so ive eaten at this location plenty of times. Ive only ever stuck with the Pho bowl with well done beef, and vietnamese spring rolls. Both are satisfying, and cheap. The mango or coconut smoothies are delicious as well. Service is fair, ive only caught attitude from one younger employer. Sit on the left side of the place from when you walk in, he does not serve that side.  The last time i came here and never went back. I was eating a delicious bowl of soup when i looked down on the floor and saw a cockroach on its back with his legs in the air. it was clearly trying to flip over on his legs and run away. This was a BIG ROACH by the way. I was so disgusted i couldnt eat nomore.   That was the last time i went there."}
{"text":"Food was excellent.  Service was good but we came closer to closing time. Overall  I give it 4 stars."}
{"text":"I've only been to a couple Vietnamese restaurants in Calgary but am slowly working my way through a few of them. I stumbled upon an Insta picture of one of Pho Dau Bo's pho bowls and I was instantly intrigued. They're located in the same plaza as Noodle World and Bun Bo Hue Deli.  I went on a late Saturday afternoon for lunch and the place was busy. The servers here are all very friendly and bring you hot tea when you sit down.  The menu is standard but I had eyes only for their pho. Note: you can only use credit card if your meal is over $20.00 (otherwise it's cash/debit).  - Pho sate ga hoac bo (A) ($12.00) - the broth was unbelievably flavourful; creamy, rich, sweet, spicy, aromatic, complex and full of depth. I could have swam in this bowl. The beef was perfectly sliced and stayed tender till the very last bite.  I'd come back in a heartbeat. Those green bowls are legit."}
{"text":"Probably the best sate I've ever had. Ordered it with oxtail that was so good. A little difficult to get the meat off the bones, but shamed myself and asked for a fork to help in that task. Simple restaurant with great food."}
{"text":"Really enjoyed the food. One of the best we have had in the west. However when it comes to service this was by far one of the worst we had experienced. First it was a cold night and when we asked to air at a table other than the one suggested by the server we were immediately refused and we're pointed to the same table. We had the meal with our jackets on. Next, a friend had joined us who was having Vietnamese for the first time accidentally wrote down the wrong item number. When we informed the server that we made a mistake and would like to change it, without uttering a word she went to the back and brought back our receipt and started pointing to the item we wrote down. That I found to be incredibly rude. We ended up having to pay for the mistake. We asked for glasses of water as soon as the food was delivered. 10 mins into eating I noticed the same server in the bar and I caught her attention to request the water and to my surprise she got mad at me and somewhat yelled across that she is getting it and I need to wait. She said she was busy. I immediately yelled back that she doesn't need to yell and by that time she was by the table dropping off the water. She defended herself and when I said you have not given us any respect she freakin' rolled her eyes at me and went back to the Window and started chatting it up with the cook at the window obviously making remarks about us.  Bar none it was the worst service we had ever encountered. I hope that the owner or manager is able to read this as I would like an explanation for their behavior towards customers. This seems like a chain and it's sad to see why people would support its success with outright horrendous service."}
{"text":"Just ordered a small ph with some friends. Rare beef and brisket. Not a huge amount of meat, but just enough. Noodles had a softer consistency but weren't over cooked. A really solid broth that's only a tad on the saltier side. Fast and easy, like a bowl of ph on a late weeknight should be. :)"}
{"text":"I've always been a fan of their pho satay.  The broth is always hot and very flavourful.  If you enjoy pho satay; I think you should definitely give this place a try.  The only downside is they have very limited vegetarian food options."}
{"text":"I eat here A LOT and I adore this place! The staff is great, the food is hot, fresh and delivered within ten minutes of ordering, now that's service! This is easily the best pho I have ever had. I usually get the deep-fried crab and a taro bubble tea for sure, my dinner and lunch orders vary but I can say that I have tried almost everything on the menu! So really ordering anything would not be a bad decision!  This place is becoming more popular now so almost daily the place is pretty busy but the food quality and service have not changed since I first started coming here seven years ago!  They offer take out as well!"}
{"text":"I really like this pho restaurant even when comparing it to the few from downtown toronto. I've been here twice and the well done beef with tendon noodle soup is still on point. There's a lot of flavourful beef though a bit more tendon would be nice. Tendon to me brings back childhood memories when my mother used to tell me that I had to eat the tendon if I wanted muscles. Of course I believed her!  I digress. When I look at the broth I don't see my noddles sinking into an ocean of oil. In fact, I don't see any oil floating on the surface of the soup."}
{"text":"Come here and take the saté pho into your arms! This place like only a few others make a saté broth for your spicy pleasures! The service is great, quick and welcoming. 5/5!"}
{"text":"I only come here for one thing only and it's the beef sate pho. The best I've ever have anywhere. I could taste the coconut milk so I think that's what makes it so much different and better here than other restaurant's sate pho. The only problem I have is they don't put enough meat in it lol I've tried some other dishes on the menu like the normal version without sate and the rice, they were just okay."}
{"text":"Not going to be on my reg pho rotation, that's pho-shizzle!  Small pho is at least $7.  I got the one with rare meat, tripe & tendon, and the broth was either heavily salted &/or doused in MSG.  I was very thirsty during/after consumption, and didn't feel the best afterwards.  Ugh.  Menu is also limited in terms of not having grilled chicken on either their Vermicelli/Rice section.  They only had Curried Chicken (no grilled), pork, or beef.  Service was very basic, no smiles or any niceties.  Just taking orders & bringing food."}
{"text":"Had the chicken and beef pho. It is definitely an acquired taste and it was quite horrible in my opinion. It is basically undercooked meat bathed in cilantro and water, disgusting."}
{"text":"I came here giving them a benefit of a doubt having visited approximately 4 years ago and leaving disappointed due to their subpar pho. This time around, I arrived at noon and about 70% of the tables were empty. You'd think we'd get good service being one of the few tables then right? Wrong. With 3 servers/cashiers, that's more than enough to service 7 tables of 2-4 people. I arrived with my mom. A table of 2 arrived after and sat beside us. After writing our orders down, we tried to flag someone down and they nodded, but never came over. We left our menus and order sheet on the edge of the table so it was obvious we were ready to order. At this time, the table beside us was still browsing the menu. The server finally arrives but takes their order first despite us having our sheet out first??? I was slightly peeved at that point and my expectations were already down. I ordered #110, a banh cuon dish, and an Avocado milkshake. My food arrived pretty quick, but they completely forgot about my moms dish. The 2 tables that arrived after us had their food before my mom got hers. We attempted to flag a server down to inform them of the issue. One of them was checking her phone when I looked up, and maybe 5 seconds after that, she looked at us and yelled something to the kitchen in vietnamese (which my mom speaks. Translation: there's one more dish!). My mom got her food about 2 minutes later. Wow. To get our food, all we had to do was remind them of the order that we had already written down on a sheet of paper that they can check off after they have given it to us. My food was alright. Filling, but nothing amazing. When it was payment time, they charged us two dishes we didn't even order! That was an extra $17+tax if we didn't catch it! Horrible. Just horrible."}
{"text":"Great Vietnamese food.  Fast and great price. The place is clean and smells great. I eat here all the time."}
{"text":"Pho Dau Bo has not failed us when ever we are in town. We've tried other places  and this is One of the more authentic places to eat pho. Their Bun Bo Hue is not too shabby either. I have not tried other dishes here but I'm more of a noodle person. You can't go wrong coming here."}
{"text":"I pity the 'pho who hasn't yet eaten at Pho Dau Bo. Don't let the fact that it's in Forest Lawn keep you away. Mr. T wouldn't. Just keep it to daylight hours.  Fast and friendly service and quality food, this spot is a palate pleaser for sure. With a simple and modern interior and plenty of seating, you can be assured of a lovely lunch and still be back at your desk well within your lunch hour."}
{"text":"I agree that this place needs a renovation but the food is amazing and the staff is always really kind to my wife and I when ever we go there. I have to give it 2 thumbs up for excellent service and great food"}
{"text":"Chicken had lots of fat on it!!!!  Disgusting, clearly only scraps of chicken used to cut cost. First and last time I ever order here again."}
{"text":"The food is good. Not the best in town but great to have in an area that doesn't have lot of Vietnamese options. They seem to run out of items often, so that's a little disappointing. Their prices have gone up every few months but quality and quantity isn't improving. Sometimes the same meals I order get come in smaller portions or doesn't taste as good as other times. But for the most part the food is ok.  Cash only!"}
{"text":"Place an order for pickup. Got two meals am appetizer and two shakes. The avocado and mango milk shakes were delicious. We upgraded our steam rice to fried rice. Everything was eaten. Very yummy."}
{"text":"Best pho I've ever had! Order letter A. in the menu. Don't ask. It comes before 1. It has a subtle coconut taste and the broth is PERFECT. We live downtown and would not drive all the way to Forest Lawn for nothing. This stuff is where it's at!"}
{"text":"This place is amazing with great food at reasonable prices. A healthy choice when you don't want to eat fast food but don't want to pay high prices. I love PHO!  Its the best thing my Asian boyfriend ever introduced me to."}
{"text":"Great food and service. Really one of the best Vietnamese food. We will definitely go back to this place. Fairly priced too."}
{"text":"Authentic Taste of a well made broth starting from basic  good bones, roasted onions and at least 5 chunks of 5 different spices. Quite an Art of making Vietnamese Pho. I'd like this new ownership who hires friendly and polite waitresses who are yes vietnamese who serve traditional vietnamese pho. I am sure the new owner,  a young Friendly Vietnamese Lady with a new baby whom she introduces to us will make the place even more inviting. Good Pho and lots of varieties. I highly recommend this place."}
{"text":"I have been to three different locations in total but I found that this location was the worst. I was excited to find out there was a pho dau bo closer to me so I decided to come and check it out. I ordered the rare beef pho and 4 pc spring rolls. The broth for the pho was part decent but I didn't like the noodles. The spring rolls weren't crispy enough and tasted kind of old. The waiter who took our order wasn't very attentive so some of the orders were placed wrong. The environment of this place is casual. If you're looking for authentic Vietnamese food this wouldn't be the place for you to get you're satisfying bowl of pho.   They only accept cash."}
{"text":"ok so, aside from the smell, everything was as the 3 stars state A-OK.  this review is going to be short and sweet just like my time spent here.  this place is a quick fix to a hungry/craving situation. The food is great and filled with flavour, no need to add salt or pepper. I had a the Pho soup- medium rare beef, which was quite delightful and filling. I also ordered the fresh spring rolls with shrimp and pork, fresh greens and vermicelli noodles, with a peanut sauce, as well as the deep friend pork spring rolls, which are always mouth watering.   the place is not fancy at all, so dress casual for sure. overall great for your Pho craving satisfaction."}
{"text":"If it's the only pho place around, then yea. Might as well go. It's nothing to write home to mom about...Unless you want to tell her their broth lacks flavor and all their smoothies are made from powder and other flavoring and not the real thing. And it's overpriced, $5 for a small cup. And tell mom that their beef balls are cooked unevenly. One pho bowl would have soft balls while the other pho bowl would have balls harder than a baseball.   Huh, there is actually a lot to write to mom. If she cared enough to read. Actually, just have her cook a pot of pho at home instead."}
{"text":"One of the best Vietnamese restaurant that I have ever been to. I ordered bun Bo hue spicy and it was very flavorful. I will have to go there again before leaving Canada.  Waitresses were friendly but can hardly speak any English."}
{"text":"Great place for pho and apps.  Tried the deep fried crab claw, fried spring rolls and fresh rolls for apps. Rare beef pho, Clear noodle seafood, rice with grilled chicken or pork chop with fried egg.  Portions are good and service is fast.  Also their mango shakes are to die for.  NOTE: If you do not spicy in sauces, make sure you say this when ordering for take-out.  If you like certain toppings only in your pho that is not listed... just write Pho and the toppings you want."}
{"text":"Absolutely delicious. Got a Vietnamese Pork Sup and a bowl of Pho. The satay broth is the most flavourful pho broth I've ever eaten. Do not pass on the chance to dine here."}
{"text":"No MSG!!!  Loved the broth here. Most important - they don't use MSG. I am very sensitive to MSG & feel the side effects 20-30 mins after I consume it. I had the pho here around 7 pm tonight & I am fine so far. I got the medium size rare beef pho with no noodles. The broth was very good. The beef pieces were more cooked than rare but I don't mind. I may go back a few more times to see if they use MSG. If they don't, I may make them my regular pho place since my old regular, Pho Hung, uses MSG. I highly recommend it!"}
{"text":"My favourite Vietnamnese chain in Ontario, I can always expect cheap pho and good smoothies. This location in particular is one my family goes to a lot, since it's near where we live. The staff is very friendly and you can always get a seat no matter what time of day.  I do agree the place needs to be cleaned up a bit, but it does look like the same as the other Pho Dau Bo's I been to.   I also like to call this place the Laughing Cow place...for people that can't remember the name of the restaurant, heh."}
{"text":"When I was in university I used to go to the pho dau Bo a Finch and Weston road. Whenever I was hungry and wanted a student friendly priced menu I would hit this place up for a pho and a durian shake. Now that I live in Brampton I Found my old favourite a five min drive from my house. One large beef with beef balls please !"}
{"text":"Good pho place to go to for a quick bite. The pho and vermicelli dishes were tasty. Cons: The place was pretty chilly though- almost all the other customers (including myself) kept our coats on to eat. It was pretty funny."}
{"text":"Went here tonight and I was pretty satisfied with my bowl of pho.  I think Golden Turtle is a little bit better.  But, overall, it felt very homey (did I spell that correctly) and yummy.  I couldn't ask for anything more.  I also ordered the shrimp/pork spring roll.  That didn't do too much for me.  It tasted slightly stale.  The peanut sauce was a little watery for me.  I usually like it a bit thicker."}
{"text":"Not the best pho restaurant around.  Definitely been to cleaner, better tasting pho restaurants in Mississauga.  The only reason why I check in here several times is because I live nearby, and too lazy to travel to the other restaurants.  This place is not as clean as I would like it to be.  Tables and chairs seem sticky, like they've been using the same dirty rag to clean and wipe down all the tables and chairs.  Doesn't smell that great in there either.    The food is alright.  I find the broth for the pho to be a little oily.  The fried spring rolls are not the best here.  Definitely had better at other pho restaurants.  Service is whatever.  I don't expect great service from this place anyways.  They basically just take your orders and bring it out.    Price range is around $7-$10.  It is very cheap and affordable.  So if you're ever craving pho and just want something quick and easy then I would recommend you come here.  But if you want better tasting pho and a cleaner atmosphere, go somewhere else."}
{"text":"Pho is always amazing! The broth is full of flavor and the service is fast. Worth the drive for me everytime."}
{"text":"I really enjoyed dining here.   The food was tasty and the service was quick and friendly.  The price is also quite decent.  I especially enjoyed their filtered iced coffee with condensed milk.   It was quite delicious.  Nothing to complain about here.   I would definitely eat here again."}
{"text":"I think the food itself is 3.5. I'm a frequent customer and always get the small soup + noodles. The noodle thing is basically a small cup of noodles, that you just dump into your soup.  I tend to find there is always too much broth, or maybe it's because I'm a noodle eater. You know, kinda like cereal where there's milk left and no cereal? Anyways, they solve the problem with this menu item.  They also sell bubble tea, which I would rate as 3.5 to 4.0. It's not overtly sweet like most places.  Their service is better than most pho places, and the place looks clean and nice. The bathrooms could use some remodelling.  They only accept cash and either credit/debit. I can't remember which one they don't accept."}
{"text":"Delicious pho here. The noodle and beef were cooked well and tasty. The broth was delicious, wasn't too salty. The tendon was different though, I prefer the thicker soft tendon that other viet places usually serve. But for ~$9 for a bowl, it's a good deal. The service was average. The food takes about 15 minutes to serve (which seems a lot longer than other typical viet pho places). I would come here again~!"}
{"text":"Simply Best Pho in town. broth is good and portion is generous. if you like the authentic vietnamese pho this is the place."}
{"text":"Pho Dau Bo self proclaimed \"The Most Famous Vietnamese Noodle Soup\" does sounded a little cheesy... But being \"Famous\" not necessary being \"Best'?   There are apparently 7 others location most of them in the west Hamilton, Kitchener, Brampton, Mississauga and North York. This location is the only one that in the East end of Toronto...   The decoration is simple and a little run down.. But the place is spacious and you will not have to wait for a table ever.. I really doubt that!   Raw Beef with Tripes Medium ($5.95)  - Quite a good size for medium  - Broth is hot and steamy.. perfect for the cold weather. taste wise it is A-OK  - Noodles is the dried package type... not too badly cook.. does not have that funny taste  - Raw Beef is really not raw... like really cook and tough, chewy and dry   Spring Rolls ($3.75)  - I almost want to laugh when they said their spring rolls are \"The Most Famous Spring Rolls!\"  - The oil they were deep fried in were stale that's why they turns out to be brownish instead of golden in colour  - The wrapping they use for the spring rolls are the Vietnamese type but the Chinese type... hmmmm   Most of the waitstaffs here are Mandarin speaking Chinese... Efficient, Fast and Get the Job Done... Standard in most of the Chinese restaurant.   The menu here is not totally Vietnamese food, there are quite a bit of Cantonese fare too...   I probably won't be back as there are a lot others Pho joint that serve up much better Pho and spring rolls!   Cash Only!"}
{"text":"This is the closest reasonably priced pho joint around us. Cash only. My wife is really into the bun (vermicelli) the grilled pork is killer.  I'm usually a rare beef noodle soup guy. Prices are reasonable. Cash ONLY.  4 stars only because the vermicelli options are limited. Would be nice to have shrimp on sugar cane and spring roll without paying $3 for an extra."}
{"text":"Excellent pho sate. It's in a pretty shitty neighborhood though, so they should immediately relocate to the south ;)."}
{"text":"Very dependable bowl of phone..happy service staff..we're weekly regulars and have our standard but even the Bang Mi is good too"}
{"text":"Excellent Pho, so fresh and so flavorful. Don't let the cheap prices fool you, the portions are huge! I also appreciate the variety of condiments at each table (hot sauce, chili oil, fish sauce, hoisin sauce, etc.)-- most Vietnamese restaurants just have a bottle of Siracha and soy and that's it. Service was extremely fast.  I went on a hot summer day and it was a pleasant surprise to be served complementary teapot of iced asian tea instead of the usual hot tea. It was very refreshing and I especially like it because it was not sweetened (I don't know why it's so hard to find unsweetened iced tea in Canada). I ordered a mango shake for the road and it also very tasty.  Too bad Pho restaurants like this don't exist in downtown TO."}
{"text":"Super Tasty!!!   I wanted to find the best pho restaurant in Calgary and Pho Dau Bo kept coming up. Well today was the day we ventured to the SE to see if it lived up to its hype....it was fantastic!!  I'll definitely be coming back!!"}
{"text":"I honestly thought this place was amazing before.  A couple months ago they got a health food \"conditional pass\" citing no proper hand washing station and inadequate pest control.  I haven't been back since I saw that notice.    In their defence I'm sure they got a pass now.  But it's just kinda scary to eat at a place where this was an issue before."}
{"text":"I ordered pho duc biet, it was okay... the broth is very light."}
{"text":"Just finished playing volleyball for three hours.  I has the Pho, of course!  The broth is good and that is what is important.  The hours of the place opened long enough, 12pm even for a weekday.    It's good!"}
{"text":"I've been eating here for a couple years now, and I just realized today that I haven't talk about it yet!  All I gotta say, is there is a reason I have been going here for years; it's just awesome.  They are always consistent with taste, and their staff is always quick.  I've never had a bad experience here, and I would encourage anyone to try this place.  There's nothing better than a huge warm bowl of pho on a cold winter's day!... or any day for that matter!  I also strongly recommend ordering their fresh spring rolls, as they are one of my favourite things to eat, and I get them every time I go.  LOVE IT!"}
{"text":"Ordered their beef pho for take out. Im a massive pho aficionado and used to get have a few faves in my old hood near College and Dufferin where which i compare all other pho to.   Pretty impressive, i must say. Great portions with fresh slices of rare beef and an above average (although overly salted) broth. Not a bad showing to say the least.   The biggest downfall would be their service. Pure crap. Passive and dismissive. But if you don't care about that sort of thing, certainly not a bad option.  UPDATE: went back and owner was delightful and helpful. It's just the rest of the wait staff that are meh."}
{"text":"Best Pho in the city! Love that they have gluten-free spring rolls. Always quick and friendly."}
{"text":"The exterior of the building is quite inviting, and stands apart from the run down strip at Markham and Lawrence N.E. That exterior is deceptive...  I had a quick lunch of pho with beef. The service was a bit slow although the place was quiet at 2 PM, and the ambience was gloomy, dull, and somewhat clubby (servers and cooks chatting at one table, saying hello to regulars etc.)   The rare beef ordered in pho was quickly cooked by the broth and somewhat tough. Not the best quality beef, nor was the broth very good; probably too much water, or short on pork bones.    Service was a bit slow, but staff was taking an extended break when I was there. Considering the large empty room, and laid back atmosphere, I didn't expect fast service here. Even the attitude was expected and accepted.   In short, it was OK for a shopper's lunch, but they could do a lot more with what they have here."}
{"text":"This is beside noodle world where I always eat. I decided to try it out coz my sis ask me to try and so did my friend. So I went on Thursday.  I like that they have shaw WiFi.    The decor is way better very clean and it's big inside.  Their green utensils are all matching..I would guess it's the colour of Buddhism, or its the owners fav colour. I like that everything is matching. Their spoon for the soup even have a little hook so that it doesn't slip down to your soup.  As for the food. I ordered the same thing, beef ball and tendon soup. The beef ball are cut in very tiny pieces so that it seems like they put alot.. not impress.  There were barely any tendons served.  I ordered soy milk thinking it's real soy milk...it was out of a can...not impressed.  I ordered shrimp roll as soon as it eat it, everything falls apart. I don't know if it's loosely wrap or something is missing.  My overall experience of the food is not as expected. I would rather have great food and not as great decor.  It's ok to eat in. But I think I still prefer noodle world"}
{"text":"This place has a look when you walk in that may have you skeptical of what the experience might be like, but have no fear...the food hear is quite well priced, service is quick, and most importantly..the food is great! This is a great stop for Pho in Brampton. My recommendations: Well-done beef rice noodle soup, tempura shrimp, and crispy fried egg noodles with vegetables and chicken!"}
{"text":"Was working in the rain and decided a pho would make me feel better. Sloppy service, really small portions, especially stingy with meat. I hate it when the noodle/meat quantity is so disproportional to the broth and bowl that it looks like it was already  half eaten.. Broth flavour was just mild and tasteless..  If I weren't all wet from the rain and starving it would have been a 1/5 :P"}
