{"text":"Hands down the best pho restaurant in Toronto. They have the best iced coffee and rice dishes in the area."}
{"text":"I can't say enough about how good this place is.  I have been coming here for over 5+ years and never have been disappointed with anything.  I have gone through all the major Vietnamese dishes and each and every one is very well prepared.  This is a very well deserving 5 star rating.   Not only is everything good but, the prices and quantity you get, just can't be beat.  This is the perfect trifecta... Price-Quality-Quantity!  The location is probably the only setback.  It is not located at the greatest plaza in North York.  But if it is located anywhere else, most likely the price will be effected.   Will i come back... does the sunrise everyday?  If you are looking for an authentic Vietnamese restaurant with great taste, good prices and good portions, look no further."}
{"text":"Living near this place is so convenient! As the previous review, their portions are very hearty and for such a steal (like every other pho stores) but usually it's either quality or quantity but this place seems to hit both!  Their pho broth is very delicious and the depending on the bowl itself could usually have a lot of meat in it than it should which could either be good or bad, depending on how you roll. The rice dishes are yummy and filling and for around $7.50, you can get all three meats~  I haven't tried any other dishes so far, but either way; it's worth going here and not just because it's close.  Also, nice service and people! Especially the owner!"}
{"text":"I was looking forward to some good Viet food based on the reviews listed here.   The place was busy on a Sunday afternoon and so that was a good sign.  I read online in the Yelp reviews that it was cash only so I came prepared.  The prices were quite low, which also was something I had read online.  The menus were quite greasy, which was a bit of a turn off, but however.  Tea was complimentary which was nice, however they brought us a cold tea and so we requested a hot one.  Our meals came quite quickly and I did enjoy it.  The thing that will make me not return is the lack of cleanliness.   While we were dining someone brought a large bucket filled with utensils and sat it beside us.  Then they came with boiling hot water and just poured it over all the utensils several time.  A group of staff then sat around drying all the utensils with dish towels.  There was no soap used, and no way to verify that the temperature is hot enough to kill anything.  I feel as though they would have never passed a health inspection.  I lost my appetite after that.  Food was good.  Prices were excellent.  Cleanliness was severely lacking."}
{"text":"5 stars pho.  There are nicer pho restaurants around the GTA but this restaurant has the best pho in town.  The staff are friendly and the food comes out quick and hot like most other pho restaurants.  My only complaint is that the seats are really tight and I always find my chair bumping into other chairs and I'm forced to squeeze in.  This place is cash only!"}
{"text":"Finally!  A good bowl of pho in the Toronto area!  This restaurant just opened up during the past year, and I have been eating here quite frequently.  It is a cash only restaurant, so be prepared for that.  It's been a while, but I have finally found a restaurant in the GTA that has good pho.  The portions are truly generous, there is a lot of meat, and the broth is very flavorful.  A small bowl of pho here has more meat than a large bowl in other locations.  The pho here is actually comparable to something you would get in Southern California.  No other place here that I or any of my friends have tried around here even compares.  On top of that, the rice dishes are quite good as well.  The portions are large, and the taste is good.  It is as if the owner of this restaurant saw what was good in California and brought it over to here.  The grilled pork and eggs are always good.  The shrimp spring rolls are also well made here.  However, not all dishes here are great, so you should try to stick to their specialties.  I have tried so many other Vietnamese places highly rated by Yelp with no success.  I was introduced to this place by locals, and they are right.  This is authentic and good food."}
{"text":"NORMALLY, this place serves really good pho at a decent price. Every once in a while I do notice that they cheap out in the amount of noodles you received, but is still really good. However, one time I wanted to see if they had vegetarian noodles, they said they did, so I ordered it. Worst mistake I have ever made. There were little to noodles which were SATURATED with oil where the plate would have the oil moving around, the mushrooms had no flavour and the tofu was sour. Eating it made my stomach feel horrible. You may argue that they don't specialize in vegetarian food exactly, but regardless they served it and if it's on your menu or if you say you serve it, it should be made properly without SOUR tofu and oil moving around the plate."}
{"text":"This pho is LOCAL! So good and so cheap! U get to put things you've never put in the noodle before! Definitely a great place to go! Thanks to YELP!"}
{"text":"Best pho ever!!! Cheap and portions are huge and you get soooo much meat. Not like other pho places where you get mostly noodles -.-"}
{"text":"My all time favourite pho place.   It's simple. They have great food, great staff, and quick service. What else do you really want or need from a pho place? I come here almost every Sunday and never disappointed. The pho is as authentic as it gets.   TIP: They have really good bubble tea. TRUST ME. Really good bubble tea.   Happy Belly :)"}
{"text":"absolutely the best pho place ever!  only place i'll go to eat pho.  the portions are huge and the staff are always so friendly"}
{"text":"I'm sad that I have to give this place this rating as my experience was not great.  First off, keeping in mind that this place is located on the ghetto west end, you can't expect much in terms of experience but you would at least expect the food to be great.   Going in it was very busy which is a good sign. I got seated at a dirty table which they came and 'cleaned' with a napkin from the dispenser on the table. Then all they did was sweep everything from the table to the floor.   Then they gave us the menu with a small order sheet to write our order but forgot the pen.  I ordered a large Pho Dac Biet but when the lady was bringing it she spilled half it on the floor and herself. Instead of refilling the bowl and cleaning it she brought the bowl with beef and soup hanging off the edges to our table and served it this way. Not only was it super messy but very uncomfortable to eat this way. If you look at the photos you will see that the lady is on the floor cleaning the mess... with her bare hands.  The coffee was not drip coffee. It was done through their espresso machine and took them 2 mins to make and serve.  Then when the bill came, i placed my card on the tray and said they only take cash. No signs were displayed of this. Good thing I understood a bit of vietnamese because i over heard them telling to the rest of the staff loudly that \"this guy did not bring cash\"... and \"Chuh oy he should be more prepared\"... how the F*!# was i supposed to know they took cash only if they didn't even display a sign about it. Luckily for me the convenience store had an ATM machine next door.  Other then the service and experience, the food phone was pretty good. Hot, big portion and tasty.   Overall i would give 2 out of 5 and will never come back again."}
{"text":"Great for rice dishes -  meat portions are generous. Pho is pretty good... A great local go-to that I frequent. Love the fresh lemon and soda drink here!"}
{"text":"A small little place with tight seating, but that's not the important thing you'll notice. What's more important is that it's full of local Vietnamese diners! The pho here is quite delicious, super flavourful broth that is jam packed with all kinds of ingredients and cooked slow for a long, long time. I also ordered a grilled chicken on rice to-go so I can't comment on it now. The service is swift and to-the-point. A couple pieces of advice: 1) bring cash, this is a cash-only joint. 2) use the restroom before you come, the washrooms (like many Asian restaurants) are not the greatest (old and grimey). Prices are reasonable for the current going rate. $8 for a large bowl. The Pho comes in 4 sizes of S, M, L, and XL. They also have congee and other Chinese type dishes, but this is through and through a Vietnamese place, the staff speak Vietnamese. Last word about this place, it really could use some Vietnamese music to liven things up a bit.  Update: yeah the grilled chicken was delicious, but the rice tasted like it was made the day before. The fish sauce here is potent! Overall a decent dish, but I've enjoyed better."}
{"text":"The best authentic Vietnamese restaurant in Toronto!! Their pho bo (beef pho) and bun mang vit (duck and bamboo shoot noodle soup) is a must try!! Their broths are so good, I always make sure I have room to drink it all...oh and their iced coffee is the best I've ever tasted in Toronto!"}
{"text":"They never gave me knife for bbq pork and chicken, which bothers me a little. Everything else is perfect"}
{"text":"This is one of the best authentic Vietnamese restaurants in the Toronto area. The staff are friendly and the prices are pretty good for the portions they give you.  You can get decent pho at many restaurants, but it's the other Viet dishes that are amazing at this place. My favourite order here is the Hu Tieu My Tho with the avocado milkshake. YUM! Everything from their drinks to their rice and noodle dishes are amazing. I highly recommend this place if you're looking for a good Vietnamese restaurant."}
{"text":"Stopped by here for a quick dinner, en route to pearson to catch a late flight.  Food is good, price is right and service was   courteous. The fact that the place was clean was an added bonus!  Totally recommend if you're in the area!!"}
{"text":"Good food, good portions  It is cash only, be prepared , cause it doesnt say it anywhere"}
{"text":"I was looking for a pho place for lunch when doing a bank branch visit nearby. Undecided between Pho Com Vietnam and this one for a while, I walked into this one eventually.   It was pretty much the same as other good pho places in Toronto - after you are seated, write your order on a note and hand it to the staff. Walk to the counter when you finish etc.   The order came pretty quick and they actually put a large amount of beef in my bowl. The broth tasted flavourful as well. When I was eating, there was yells/swearing outside, which gave me a bit of an uneasy feeling. I have no idea whether it is a daily scene but I felt bad for the children in the restaurants :( Also I found the joint a bit tiny. It is nice that they accommodate large groups but I personally would not bring too many friends here myself, like other Yelpers do.   Overall I would recommend this place to people who live or work nearby. Food is delicious and authentic but I think you can find pho of the same quality in other parts of GTA.   Note they take cash only."}
{"text":"Best pho in town! Also, the staff were friendly, the service was great and once ordered the food came out really quickly!   A tip: It's a cash only restaurant... so bring cash!   Looking forward to going back and trying other things on the menu :)"}
{"text":"The flavour of the pho noodle soup was a bit off, but in terms of the portions it was suitable for its price. The rice and pork chop was okay, considering that the rice was a bit dry, which kinda ruined the dish but the pork chop wasn't so bad with its flavouring. The service on the other hand is really good and fast, didn't have to wait very long for my food. The coconut milkshake is really good because they don't use artifical coconut milk to make it. Would come back with my partner."}
{"text":"Dined at Viet Hoa plenty of times as a student at YorkU. My group of friends all agreed it was the go-to Pho spot in the area. They have accommodated party sizes ranging from 2 to 12, so this is a good spot for groups.   Over the years, I've had quite a few items from their menu, ranging from their pho to their rice/meat combos, and I can vouch for all of them. Portion sizes are about what you'd expect from most Vietnamese restaurants.  The restaurant itself isn't too visually appealing, but if you put decor to the side and focus on the food, then it's great value.  Note: Cash Only"}
{"text":"One of the best places to order any rice dishes. They pack up in rice and protein. More bang for your buck. I love pre ordering and picking up, takes less than 10mins to be ready. Only downfall is that it is CASH only"}
{"text":"This pho restaurant is my go to place when I am craving some Vietnamese food. I live about less than 5 minutes walk so I have easy access to this place.   It's nice and quiet most of the times which I like. It gets pretty busy on the weekends especially early to mid afternoon. I always get the pho tai bo vien and the pho is just so delicious! The spring rolls are also really good as well.   My mom actually knows the owner of the restaurant so service is ALWAYS outstanding. This is the best pho place in the area, so go get you some! Btw, they take cash only."}
{"text":"My favorite pho restaurant! Been going here for years and it is one of the best and most authentic pho restaurants in the city.  Prices are probably the best in the city and portions are big.  The only place you can still order a medium bowl for less than $7, and they've got 4 sizes (small, medium, large and XL!). The vermicelli dishes are also excellent and they don't skimp on the meat either.  For less than $10 you get 2 meats where as other places make you pay extra for additional meat. Their viet meatballs (nam neung) for the vermicelli is excellent.  Same for the rice dishes, excellent portions and for less than $10 you will be full.   Tip - ask for beef on the side for the pho and you'll get a little more than if they were to already put it in for you, and the beef won't be over cooked and chewy."}
{"text":"Warning: Do not tip when you go to eat here. I know someone who used to work here and she quit after 2 months of abuse by the owner. She gave really good service and some customers were really happy. They even gave her $20 in tips at one time but the owners take all the tips and do not share any amount with any employees at all. The owners at this place keeps all tips and don't give employees anything. So if you eat here, don't tip as you are wasting your $$. The servers do not get to keep any tips at all. Not even a penny! They did this with all employees, so customers beware!"}
{"text":"One of the best pho places I have ever been to. I'm a pho lover and have tried various restaurants. So far, this was the best pho I have ever tasted. Every time I enter the restaurant, it does not feel ghetto or dirty at all. I am also greeted very warmly at the door with a \" weelcooome \"! Ever since I tried this place, I have never ate pho anywhere else.  Also, the prices are pretty fair in my opinion."}
{"text":"Updated review: I would like to point out the last time I was here, I saw the worker in the kitchen sneeze twice without covering the food, cough without covering his mouth, and pick his nose with his pinky. There was only one other table there so I assumed he thought no one saw. The workers probably don't even wash their hands. Avoid this place unless you want contaminated food."}
{"text":"My go-to pho place around York university. The rice dishes and the pho dishes are both very good. The portions are about average and are cheaply priced. The rolls always taste fresh. Try the Vietnamese coffee or the avocado milkshake! The service is always speedy. Definitely up on my list of favourite pho places in the GTA. Bring cash because they don't take debit or credit!"}
{"text":"portions here are really generous. the workers and waitresses are also really nice. for the people who are complaining about how the workers are (ie rolliing the dirty dishes around etc)... thats typically a normal vietnamese resturant for you. if u think this is dirty then u should not go to vietnam lol. but anywho, food here is really good. my parents go here every other day or so cos its close to their work and i also know a friend who eats here everyday too just cause he loves it. the pho, rice, and bun mam is really yummy. also my aunt is obssessed with their viet coffee as she says its authentic since there is so much flavour! also really cheap too :)  oh yeah its cash only... i think by now its safe to say if u go anywhere asian, just have cash with u cos chances are they are not going to take debit or credit!"}
{"text":"The chicken broth soup with 2 egg yolk appetizer was amazing! The rest of the food here was also really good. One of the better Pho restaurants."}
{"text":"This is the best Vietnamese restaurant in the entire Greater Toronto, we tried Vietnamese Coffee, Special Beef noodle in soup, and I few others, staffs are super friendly, price is unbelievable reasonable, their XL beef soup noodle is only $8.75, I used to pay $12+ in other Canadian cities."}
{"text":"I remember coming here when I was in high school, different owners tho. My review is on one of their menu items from the specials board, mi quang. I know different regions of Vietnam make certain dishes differently. But this dish was not that good due to the strong flavor of turmeric in the dish. Turmeric is used to color the rice noodles yellow. The noodles in my bowl was not yellow. They might as well have skipped the turmeric all together. There was plenty of noodles, and meat however, so it was filling, just not tasty. I also ordered a Vietnamese iced coffee which they give it to you in a togo cup instead of giving you the drip coffee filter in a glass cup. Stay away from this dish and stick to their pho and com tam instead."}
{"text":"This restaurant was close to our hotel so we decided to check it out.   It was a Monday evening around 6 p.m. and the restaurant was not packed so we got a table right away. We were given a complimentary pot of tea and given time to look at the menu, no pressure to order right away.  The menu had a good selection of dishes, with the hot dishes clearly identified for people (like myself) that are not overly familiar with Vietnamese cuisine.  When the food arrived the portion sizes were very generous considering the price that they charge.  I don't know how authentic the food is, but I found it to be delicious and filling, and that is all that matters to me.  One word of caution, the restaurant only takes cash, no credit cards or debit. Not a knock against it just something you have to consider beforehand."}
{"text":"Average pho. Not amazing. Noodles seemed soggy when I ate there. I tried the rice too it was a little dry. I have been to their other locations and it seems better than this location"}
{"text":"This place used to be good but its customer service is severely declining.  I haven't gone back ever since.  Also, some of the portions don't correspond with the pricing. Huge ripoff, wouldn't go back or recommend"}
{"text":"No-frills good value pho place. Hard to find a place serving pho at $6-$7 in the GTA with above average food quality. The service was fast and efficient and it's a good place to go if you're looking for something quick. We were probably in and out within half an hour!"}
{"text":"Great service and good food. It's rare to see waitresses smile and greet you warmly when you enter a Vietnamese restaurant."}
{"text":"Foods are good enough with generous portions. This place only lacks of service and cleanliness, but these are typical problems in Viet restaurant.   I visited this restaurant a lot of times. I tried different dishes here but honestly I think only Pho and Com Tam are good here. The rest are just average. I once ordered the Mi Quang and it was not tasty at all, so most of the time I went for Com Tam.   I hope they pay more attention in the cleanliness of the restaurant, sometime it distracts me from eating when I happened to see how they clean tables and wipe utensils with a cloth that is used by all-purpose.   The restaurant is quite loud because of all the talkings between waitresses. They're very loud when talking to each other, like yelling...   For the price, I should not complain much but I hope they can make some better improvements so they can get more regular customers than they should have.   I will recomend this place for lunch as it is affordable and portion is generous. Be prepared to have cash because no card is accepted here."}
{"text":"Horrible customer service - I ordered vegetable and tofu vermicelli, and they gave me vegetable rice noodle soup. When I told them that this wasn't what I ordered, they refused to acknowledge their mistake and tried to convince me that what was in front of me was vermicelli. Super uncool. I wouldn't have made them remake the dish, but at least acknowledge that it wasn't what I ordered instead of making the customer feel stupid.   Besides that, the food was decent and the prices were reasonable."}
