{"text":"I can't believe why the reviews about this place is so high.  First off, it's over priced for what u get.  A large is exactly the same as a small, except it comes in a larger bowl and it isn't even close to filling.  \"Where's the meat\" is what this place's motto should be.  I ordered a large bowl and can count the number of slice meat on one hand. Just look at the photos others have posted - Absent of any meat.  Even they skimp on the noodles.  Come on, how dumb do u think customers are? My friend who ordered a small had the same amount of noodles and meat as my large.  RIP OFF.  Flavour is mediocre at best.  Tried once and no more.  Avoid this place unless u like over paying."}
{"text":"I've only had soup here, its good!
Broth is on the fresh side, not very seasoned
But I don't mind that personally in a pho soup
Tasted good, fresh vegetables and washed
Clean place n tables
Extra serving of lean beef for $2 maybe 4 slices
Decent an will return 
Good service"}
{"text":"Worst Pho I ever had....broth was not flavored and didnt tast like pho...just salty...never coming back.."}
{"text":"Good food at a reasonable price and great service, but there is much better Vietnamese cuisine out there."}
{"text":"The Pho is always great here. It is a family owned business for such a long time and they make sure you are looked after nicely. Always full of smiles when you show up. Food is excellent. Their rice rolls are very yummy with the sauce; herbal tea is served as well."}
{"text":"Pho Viet is not a place I'll be quickly returning to. The pho was basic and bland. You can choose from small, medium and large, my boyfriend and I both got large rare beef and meatball pho. I think we both got 4 meat balls each and 3 slices of rare beef..... And 2 pounds of noodles... The large was a good size bowl but not enough meat at all. The broth was watered down and we had to add a lot of sauces to give it some taste. The service was pretty good, the waitress was attentive. If you like bland and really simple pho(in all fairness the prices were really really cheap, but that reflects the meat portions) with a ton of noodles and little meat then come here, if not this isn't the place for you."}
{"text":"had the bun bo hue after reading the reviews here. 

okay serving size. good flavor. nothing special though. service was fast and smooth. and they were informative when i asked them for suggestions.

appetizer: spring rolls - not as big as what i'm used to at other pho places.

I can't say anything about this place put me off but I would rather go down the road to pho 88. I just came here because I wanted to try the bun bo hue."}
{"text":"Undoubtedly my favourite pho place in Markham - great quality of food, excellent customer service, clean restaurant and modest prices. The ONLY downside is that the portions are slightly smaller than desirable (specifically the amount of vermicelli and pad thai they give you). 

With this said, Pho Viet is THE place to be at, especially when it's cold outside. You won't be disappointed with their house special pho or their sweet fish sauce!"}
{"text":"Best viet place in Markham.  Well, that's what my viet buddy told me but after going almost weekly I agree.  Amazing spring rolls and pho."}
{"text":"To start with the service was good. I was seated right when I walked in. The food was fresh and came quickly so I didn't have to wait. I ordered the beef soup which was not bad but decent at best but there was more noodles than beef.They gave complimentary green tea which was cold when we got there so i was pretty disappointed . I don't think I'll be going back anytime soon."}
{"text":"better quality noodles and beef than VIP (at fmp), star king, etc. it's my favourite pho place in markham!

noodles taste fresh, soup and noodles aren't greasy/oily like noodle star and star king. authentic pho noodles here!

only problem i see js that portion sizes are a bit on the small side."}
{"text":"Try the Bun Bo Hue, great for when the weather is cold and wet outside. 

Vietnamese Ice Coffee is dark, rich, and syrupy, true to the ones on the streets of Saigon!"}
{"text":"I went here on Friday night around 9:00pm.  There was no one in there, so I thought it was closed, but one of the staff said they were still open.

The servers were really nice. We ordered the Raw Beef Pho and Vermicelli with tofu and spring roll.

The pho was really nice and the medium was huge! Couldn't finish it all. I haven't had pho much in the past, so I don't have anything to compare it to, but this was good.

The vermicelli with tofu and spring roll was also good. I love the way the tofu was prepared -- nice and crispy. 

I recommend this place!"}
{"text":"I've been to this restaurant for years. I've chatted with them each time for countless hours. I've tried their food and seen how they are with others. I can safely say that whatever Sandra M went through was likely triggered by her... you can tell by the context of her review.

Nevertheless, the restaurant is closed and I'm sad to see it go. I wish them all the best in their retirement."}
{"text":"My mom and I used to come here for lunch, so I decided to bring my bf here since we were in the area. The place is getting older, but the service is very quick and friendly. As always, I order the Fresh Spring Rolls which had a weird taste this time. The wrapper was also a bit hard as well.

I decided to order the Lemongrass Chicken with rice and was mildly disappointed that it was a saucy dish. I really couldn't taste the Lemongrass, but the chicken was tender and I was hungry. My bf had the dish I was envisioning which was meat with rice, soup, and salad. The pork chop was quite thin and I was wondering if it would fill him up.

I have to say that I had a very 'meh' experience here and probably won't be back soon, as there is another Vietnamese restaurant close by (in Pacific Mall) that my mom and I like much better."}
{"text":"The service here is excellent - super friendly and fast. It's our go-to place for when my fiance and I are craving pho. The place is very clean and the food is always yummy.

No complaints whatsoever!"}
{"text":"It's a very standard pho restaurant.  Quick, efficient, clean and delicious.  We came here when we couldn't find parking at Pho 88 down the street because that plaza is just always rammed.

The small pho is small.  The large pho is well priced at a price that isn't often seen anymore for that size - $6 something.  I would come here again for a quiet, not-hectic and clean experience."}
{"text":"Decided to stop here for a quick dinner after work and chose this place because of its Yelp rating; definitely wasn't disappointed! The restaurant's tucked away in the chaotic plaza at Steeles/Warden, for someone unfamiliar to the area it cab be difficult to find. I arrived shortly after 5PM, a bit early for the dinner crowd, but there were three tables there aside from me and the boyfriend. The decor is colourful, modern, clean, and cozy with the tables a good distance from each other so diners have some privacy (which can't be said for most restaurants in the area). The place is also very The waitress was friendly and attentive, she was in charge of the entire place while one chef busied away in the kitchen which we could glimpse through the handoff area behind the cash. We ordered the spring roll appetizer combo (a variety of fresh and fried spring rolls), the chicken and shrimp vermicelli plate for the boyfriend and the lemon grass chicken pad thai for me. The food took some time to arrive, which is understandable with only one cook in the kitchen. The rolls arrived first, beautiful plating and you can tell how fresh they were before you even bite into it. You're privded with the choice of fish sauce or peanut sauce for dipping which is nice since most Vietnamese restaurants only offer the fish sauce. The entrees arrived in good time as we finished our appetizers and again I was impressed with the simple yet aesthetic appeal of the plating. The pad thai (not mushy, just the right amount of elasticity) and lemon grass chicken (generous, tender pieces) had difference sauces which was a pleasant surprise and I appreciated the opportunity to customize each bite to my liking. The boyfriend's vermicelli was a sizeable portion, but because of the lightness of the ingredients, left him full, but not stuffed. The total including tax, tip, and a can of Nestea was $35 which is the right price point in my opinion. I will definitely be back to try the pho and tom yum soup another day!"}
{"text":"I go to this restaurant often mostly because it's really close to where I work. The service is good and food comes out quickly - which is great when you have a limited lunch hour. I would say that this place is pretty basic when it comes to their food options, for example, their rolls did not have cilantro/mango in them - but was used as a garnish instead..? I would say the pho is good, nothing notable. I will return for cravings/convenience purposes when i'm at work, but I wouldn't go out of my way to come here."}
{"text":"Finally, I have been taking in yelp recommendations to try out new places and have been striking out miserably. This time however, I went with a work group and it was recommended by someone in the group. For once I was thoroughly satisfied. 

I would suggest that you beat the lunch rush and arrive a little before noon. As place was packed- We did however have a reservation and the table's were set based on our needs at point of arrival (group of 10). 

I can honestly say the service was unusual- maybe not the most customer service based. However, very honest and straight to the point. I ordered the fried rice with chicken and shrimp and requested to have the chicken and shrimp in the lemongrass flavouring. The lady helping us said very convincingly, 'It's no good, flavour don't match\". I took her word for it and just kept it the way it was served on menu. Was great!

Beautiful presentation, thin slicked chicken strips forming a circle above my fried rice with the shrimp in the middle. Everything was really tasty, and the portion was very nice. I was eyeing other items that people had ordered in my group; and they all looked of high quality; The PHO bowls were mammoth. 

Really enjoyed my experience; and spent less then $15. I finally found a good place as the last week has been very disappointing in my culinary hunt adventures.

Might become a regular PHO viet!"}
{"text":"A really nice pho place. The broth is cleaner and fresher tasting than most. The ingredients are really nice. It is a cosy and smaller place, but the service is really good and they are very nice people. A bit pricier than most pho places but it tastes like the cost is justified."}
{"text":"Tried a large house special pho, at this family run resturant. It had a nice clean broth, made with a thinner type of rice noodle (usually a thicker variety at other pho places in the GTA). Just the right length for each strand of noodle and cooked to al-dente; something so simple that many Vietnamese resturant screw up on. However, they were a bit stingy on the meat, but I forgive them because it was just delicious. Will come back to try other offerings for sure!"}
{"text":"Honestly, this is not a bad place for some Vietnamese and Thai cuisine. The decor of the restaurant perhaps can use a remodel, but overall, the place is still warm and welcoming. The service was very nice, the owner was very nice since my friends were frequent customers to the restaurant. The owner attended to our every need and that was amazing.
In terms of the food, I would say it's pretty standard.The broth for the pho was very warm and comforting. The broth has a lot depth in rich flavour.  The spring rolls were decent, the filling was very good, although I wish that they were a bit bigger. 
This place is a great place for Vietnamese and Thai cuisine for the local crowd around the Warden and Steeles area."}
{"text":"It's a genuine pho place it's a cool atmosphere and good food. I usually order the house pho because it's the same price add the other ones but with everything in it"}
{"text":"Came to Pho Viet on a weekday evening once! Parking is usually difficult in this plaza because of the cars, but this night, it was difficult because of the Pokemon Trainers - easy to find parking spots though!

My friends ordered their pho, large and small had a noticeable difference in terms of bowl size - I didn't get to eat it to know if the portion size is much different too. The price of their dishes are very similar to the costs of regular pho places (about $7 - $8 for a bowl of pho). One of the things that impressed me was when my friend ordered their large pho with beef balls and no greens. There were no greens, but the bowls was FILLED with beef balls. Usually stores max put 5 beef balls in the pho, but this time, it was filled with beef balls.

I ordered their lemongrass chicken pad thai (about $10 including tax and tips). This was served a little different compared to other pad thai that I have tried in other places. There wasn't that much pad thai on this dish. However, they split up the plate into three sections - pad thai, veggies and lemon grass chicken. There were about 6 pieces of lemon grass chicken in here and I didn't eat the veggies. This portion looked nice, but it had less pad thai overall than other places. 

I do, however like their website menu. Although the prices do not show, once you hover over the name of the dish, a picture o the dish pops up, letting you know EXACTLY what you expect! Find their website here: 
http://www.gophoit.com/index.htm"}
{"text":"Great Pho, broth is delicious. Fast and friendly service"}
{"text":"I love this place! I've been coming to this place for 6 years!

The owners and servers are friendly. The place is very clean. It doesn't get too busy, except obviously during dinner time (from 7-8PM).

Food is always consistent. I always get Pho in a small size bowl. I find it is a pretty good serving size for what you pay. The soup is not salty at all.

One more item on the menu that I absolutely love is the Deep Fried Pork and Shrimp rolls ($4.00), again always consistent and very tasty. The fish sauce that comes with it is very good too.

All the other items on the menu are all flavorful. I don't have any complaints. The price is cheap, servers are friendly, food is ready pretty quickly, and they always play the same music over and over again. Lol!

This is my go-to place for Pho since it is only 1 min drive away from my home. I don't think I will go anywhere else!"}
{"text":"My review isn't based on the food but the management. I went there tonight with a friend of mine who's a regular at this place. I've gone a few times with him and the female manager has always looked at me with a linger for whatever reason. Tonight, when my friend went to pay the bill, she asked if I was his girlfriend and he said no and her response was \"Oh ok, because you're very handsome\". Oh really? Am i here for pho or Markham's next top model? 

I don't care how much of a regular anyone is and how tight you think you are with a customer, your job is to serve food, not to pass judgement on my appearance or to let someone know whether or not you think I'm good enough to be dating them. I've been there enough times for her to know that I'm in her customer's life, so regardless of whether or not we're dating, you're insulting someone he cares about to whatever extent.

So that's that. A big fat middle finger to this place. The food is vietnamese. Hope that helps."}
{"text":"Maybe I came in on an off-night.  After reading the reviews, I was excited to come here. My family and I need a new pho place in Markham.  However, after that night, I don't think I'd ever go back. 

We came in on a Tuesday night - it was empty except for two other tables. The atmosphere is nice and well-lit. Casual but very neat. Service was nice and attentive. 

 We ordered:

Well done beef and flank pho ($8.75 for a large vs S - $6.50; M - $7.50):
The soup was all right.  It was more soup than noodles and beef though. Decent noodles but the flavour wasn't strong - it was a bit bland like the soup was diluted. I liked the beef though - flavourful enough that it sort of made up for the soup base - I just wish they put more beef and noodles. 

Deep fried beef and pork rolls with lemon fish sauce (2 rolls for  $4.00):
These unfortunately didn't taste good. I was expecting something similar to other rolls that we've tried at other Viet restaurants - crispy, juicy, flavourful, and sweet. But these rolls didn't hit the right flavours. They tasted a bit old, a bit burnt, and the sauce (that's usually found at every Viet restaurant) was off too - too much lemon. These rolls are our usual go-to app at a Viet restaurant but I can't recommend the ones here. 

Grilled chicken and shrimp with fried rice ($10.25):
It all tasted burnt - especially the rice. There was no bite that didn't have a burnt tinge to it. The rice and chicken also lacked flavour. Although the shrimp was all right, it was a dish that we had a hard time finishing - we kept picking at it until we ate most of it. 

I can't recommend this place because, to be honest, there are better restaurants for delicious Viet food. I walked in expecting an experience similar to other reviews but I walked out disappointed. A good restaurant needs to be consistent - sadly, I guess they weren't the night we dropped in."}
{"text":"I actually enjoy coming here , i tend to always order #21 which is a classic rare beef phö (SMALL) about 6$. 
I came across this place one time when another restaurant beside it was too crowded and ever since then it's one of my fav places for phö. 
The food is always fresh and delicious!! I tend to come here at least 3 times a month! I also recommend the mango shake!!"}
{"text":"This is my favourite spot for authentic pho. I've been there so often for work lunch that they know my order. 

I typically get a medium special with spicy broth and a side order of spring rolls.

The fruit shakes are good. Usually get the mango one."}
{"text":"Thought the pho noodle soup was quite good, not too fatty. This was about a year ago. However portion sizes were on smaller side."}
{"text":"Pho Viet is probably my favourite pho place in Toronto/GTA (because technically this is Markham). The quality is always consistent and the food is very authentic Vietnamese. The broth of the pho is never too oily or overwhelmingly salty like most - it's lighter and has great flavour. The fresh rolls with chicken (wrapped in rice paper) are the best here. Definitely order that as an appetizer, it's great with the peanut sauce."}
{"text":"Consider a 4 star since the service is good and the pho is pretty good. Still a little too much msg in the soup. In Scarborough this it a very good Vietnamese noodle place."}
{"text":"I loved this viet resto. Its not anything that unique but its solid and consistent. That's all that matters really. Its not the busiest resto unless I came on an off night. That's ok with me. I got the kitchen staff all for myself. The food was good. Ordered the grilled beef and rice. My fav. The women at the front is viet and was very friendly. I would go back just to support her. 4 stars ****"}
{"text":"This place is alot better than Pho 88 just down the street. The food is not bad but warning, there is a lot of MSG, i had the drink tons of water after I finished my meal and leaving the place. Their shrimp and pork fried spring roll is every good. We've ordered their mixed skewered sticks which contains 2 shrimp, 1 pork, 1 beef and 1 chicken, not worth it as its a very small portion and the taste is soso. 

I would recommend this place for other to come and visit but just remember H2O is your friend here. Well even any other pho place i find have high MSG. 

At least this place doesn't have oily menus, chop sticks and cups, like others (pho 88) LOL

This service is OK as they took our pot of tea for refill but forgot to return it back. This is common i guess as got a bit busy during lunch time"}
{"text":"Really nice . Simple and home style Vietnamese food. 
Highly recommended 
Will come back again"}
{"text":"I wouldn't recommend this place.its below average for Viet food. The meats (had chicken, beef and pork between 2 meals) and they were bland. The meat portions are smaller than you avg Viet place too. Only good thing was the fish sauce. 

If they were authentic Viet, they would have buon cuong. But they don't."}
{"text":"I have visited this mall millions of times and have never even noticed this restaurant, because it is out of sight from the main parking lot.  It was my loss.  

I came for lunch a Friday upon recommendation of a co-worker who loves Vietnamese food.  The place was full with both Asians and non-Asians customers.  I figured that 1) this place was popular and 2) the portion was big.  I ordered a Bún bò Hue ($8), which is described in the menu as a rice noodle that contains beef, pork and Vietnamese sausages in a hot and spicy Hue style soup.  The soup base was sweetened spicy with a herbal flavour, but it was not that hot.  Compared to a spicy noodle I got at Pho Mi 99 in Mississauga, this one was less spicy (the other one \"almost\" blew me away).  I guessed this level of hotness was more acceptable by most anyway.  The meat was plenty and good.  I noted that it had more noodle than a small sized pho.  The texture of the noodle was okay but on the soft side.

Considering it was a packed lunch hour, the food came out quickly.  I would not go as far as describing the service as friendly, but it was definitely efficient.  This place operated like a well-oiled machine.

This is an authentic Vietnamese pho place.  The storefront is clean.  I will consider coming again for a quick lunch."}
{"text":"Spring rolls $4 - nice and crispy with good flavours.

Grilled pork vermicelli $8.50 - decent amount of pork but sliced really thin. Too much fat left on the pork.

Grilled shrimp vermicelli $9 - shrimps were small and did not taste fresh.

Service was fast and friendly"}
{"text":"Staff are always friendly and remember you even though I've been away for a while.  The broth tastes great even without adding any extra sauces."}
{"text":"Pho Viet is a great little pho restaurant tucked in a Chinese plaza.

Pros:
Great tasting pho

Cons:
Portions are smaller than other places

We came here because one of my fav HK style cafes Fortune Stone was going to be a 20+ min wait.  We were in a hurry so we decided to try this place.  

We were greeted by a very nice lady as soon as we walked in and were seated promptly.  This place is a simple no frills type of place that concentrates on the food and service which is completely fine by me.  

We ordered two bowls of pho and a spring roll appetizer.  The food comes out quick and hot.  The noodles they use here are thinner than other places and I think I like them more honestly.  They had great bite and the broth was pretty good too.  The spring rolls weren't as crunchy as other places but the filling was very good and that's where it counts.

The portion size is my only gripe about this place.  The small size is the smallest bowl I've ever seen at a pho restaurant.  I would always at least order the medium unless you know you're a very small eater. Their medium and large sizes are small and mediums at other places relatively.  All in all, it's $1 extra which is a not a crazy big deal.

Service here was very good and we had a great experience here.  I would totally come back here but I know I will never get the small."}
{"text":"Whenever I want Pho, I usually just go to Pho Dau Bo. Cause previous experiences, when I went to a random pho restaurants the flavour of the broth just wasn't the same.

However, the pho here was delicious. In my opinion, the broth was spot on. I typically get the Pho Dac Biet (Special Pho), but just cause this place is that good. I might need to go back more often to try their other dishes. Also, they use the thin pho noodles not the thick flat ones (the ones that they use in Beef Ho Fun), which in my opinion is the best type of noodles to have in pho.

Warning: When you order a large pho, it's ridiculously large."}
{"text":"The pho taste alright n as other people said, its towards to the smaller portions, i ordered a large size,   other then the bowl itself, i didn't see anything close to large, other than the size i have no complaint.

One think want to mention is do we allow child labor in Canada? The server seems the chief/owner son, only two of them running the restaurant during dinner time, it maybe a family business, but asking a child to work? I donno if its appropriate...."}
{"text":"Hmm, maybe I'm an anomaly here because Pho Viet's actually one of my preferred pho restaurants in Toronto -- and I live near quite a few pho restaurants! I guess it depends what you're looking for in your pho; soup is really important for me and their soup is really tasty. Can't really comment on their other dishes since I always have pho, but it seems to be pretty standard quality."}
{"text":"I didn't get a chance to eat breakfast, so was starving when I arrived.
I don't remember what I ordered, but it was a few things and I think they were surprised by all that I did order!

It was tasty and worth it.
They don't take credit cards, only debit - i think - or cash.
Good thing I had a few American dollars on me that they accepted otherwise I would have been washing dishes!"}
{"text":"Great place. Spacious restaurant with contemporary decor that is friendly and not very abstract. Friendly owners and staff delivered prompt service. My noodles came within minutes of ordering, and the kitchen was generous with tender beef tendons.

The broth had several layers of flavors on the palate that is so much better than the nondescript, salty broths elsewhere.

The tendons were just right, with taste infused through slow cooking in broth, and appropriately tender.

For an improvement, the servings could be larger. Aside from giving more tendons, the serving is smaller than other places in general.  

This place is worth returning to."}
{"text":"I've been to this pho place before. At least the food is always consistent. I ordered a spring rolls and and a small pho. People are right about the smaller than average portions, but for me it was just right with the appy. 

The spring rolls were super crispy and always awesome. 

I love this place because I'm guaranteed my food without much of a wait. Love it."}
{"text":"Good clean viet pho restaurant.  The food feels clean and the service is excellent compared to typical pho places.  We tried the rare beef and tendon pho, sole of filet rice dish and the chicken pad thai - all of them were great tasting.  They did run out of basil that day which was unfortunate.  

Will go back again."}
{"text":"Hands down the best and most authentic Pho joint in Markham. I mean it's actually \"Pho\". The broth is flavorful and authentic and they always get my order right. The server there does an amazing job every time."}
{"text":"Never get a large pho. It's the same as small except in a bigger bowl and more soup, that's it. Same portion of noodles and meat (a few slices). Otherwise, the taste is decent."}
{"text":"I have to say Pho Viet has an awesome website! The menu has pictures how each single item looks like!! And I can tell you, the real things looks exactly the same! :)

I was there for lunch on a Friday afternoon around 12 pm. The restaurant is not busy at all when I walked in and by the time I leave there is a wait for tables!

Pho Viet seems to be frequented by people working in the area. The owners knows what their usual orders and that made them feel really welcome and special.

I have the pho noodle with raw beef.. I ordered a LARGE... 

The soup is quite tasty, the main disappointment is the noodles not being fresh ones. The noodles they use in the pho are the dried varieties. There are tons of  noodles in the bowel though, for sure you won't be hungry after eating that. However, I just don't like that taste of dried noodles at all...

There are not much ingredients in the noodles though... I guess when you order a bigger size, that's is just more noodles....not more meat.

There are no lunch specials.

They accepts Interac and Cash only."}
{"text":"Yikes. I hate to post this mediocre review in light of everyone else's glowing 4* review, but... Oh well.

Taste and quality? Not bad! Taste of pho broth, spring rolls are normal - not bad, and I've got the bun bo hue here once and it was... Not bad!

Not bad!
Not bad!
Not bad!
(I feel like a parrot.)

But uhhhh... Maybe I'm mini-Godzilla, but portion sizes?? Who said they were HUGE? 'Cus when you mean HUGE, you mean... tiny, right? ;) Joking aside, I'm actually not joking and found their portion sizes for their cost quite mismatched. We're not in small-town nowhereland, so I don't get how my large pho costs $2-$3+ than the average franchised pho joint down the street. And is actually the size of a medium! Hello! You're in an Asian plaza and your clientele is generally Asian. Bang for buck!

Ok. Taste is good, but in my opinion, meh. You know to be honest, the pho broth can be HOTTER (temp wise... I want to be sweating into my bowl haha)."}
{"text":"Excellent pho broth and even better portion sizes. You definitely won't be disappointed with a medium size - I eat alot, and I can't even finish a medium. 

In addition, you must try their shrimp paste on toast. Absolutely delicious with lots of shrimp included!"}
