{"text":"Amazing! Never disappointed. Always go to pho all around calgary and this is one of my favourites especially the beef satay soup !!!!"}
{"text":"This is our local fav for vietnamese. We always call in our order to go, and it's ready in 10 minutes. The rare beef soup is awesome. A must have when you're sick or pregnant, or just needing some comfort food. Bubble tea with jelly is great, made with real ingredients.  Service is always very friendly, even on the phone. Vermicelli bowls unfortunately are just ok."}
{"text":"I've been coming here a lot lately especially when I have nothing to eat after work.    I recognize one of the guy that works there.  I think he used to work at Pho Thanh.   Everything about this place reminds me of Pho Thanh.  The menu, setting, soup etc.  Did they copy them?  Probably...I don't really care, I just want good food and if they copied from Pho Thanh then I won't have to drive all the way to Pho Thanh anymore.    The first bowl of Pho really hit the spot.  Maybe I came at the right time because I personally thought everything about it was good.  The sate was weak though but the soup was flavourful.  You will definitely taste that msg.   I tried the vermicelli another time.  I know I know.  I often said that vermicelli tast the same everywhere but I guess these guys proved me wrong.  The pork has a slight kick in it.  And if you try their beef vermicelli, you'll definitely taste that kick.  I've became a fan here simply because Saigon Perl down the street is a bit bland now that I came here.  It's like getting Pho Thanh food but in a newer and cleaner setting.  But a few tips though...it's a small restaurant so avoid peak hours.  They are new and ironing out the kinks so don't expect excellent service.  The first time I had take out, they forgot my sauce.  If it weren't for their food, that mishap would of the been their last.    So come here for the food.  Forget everything else.  Order the vermicelli...yes the vermicelli.  It's that good."}
{"text":"I've pretty much stopped coming here. I say pretty much because I still do like their ph. I'm just really disappointed that the meat portion keeps getting smaller and smaller. The amount of meat you get is so little now that it's just not satisfying enough for me. Also, their ph tai (rare beef) comes out well done every frickin time!!!!!  That's called ph chin. If I want that, I would have ordered that."}
{"text":"Terrible services from the owners. I was ordered the black coffee on ice from the server, but I got the black coffee on ice with sugar in it. I made the complaints to the server, but they wouldn't make a new one for me, instead the owner was trash talking behind my back while I was eating. I couldn't believe this place has such bad service and manner."}
{"text":"They're fairly new, so I thought I would give this place a shot. Tables were packed when I got there, so service suffered a bit.  Ordered the house special bowl of pho.  Food 2/5 - Average as far as pho goes, with the broth on the sweet side. The noodles were mushy, meaning that they were overcooked and likely kept out too long. The beef was okay, but again, the texture was rough like the beef had been in the water a bit long.  Ambience 3/5 - It was clean, tidy, and uninspiring. Nothing tacky, nothing attractive either. McDonalds has a better ambience.  Service 3/5 - As good as typical Asian restaurants get. Service was slowed due to how busy it was, so that was understandable. Food came out fast, but that was largely due to how much prep work had been done.  Value 2/5 - For a large bowl, it was small by pho restaurant standards. The pricing is on par with others in the area, but overall, the portions were on the small side.  Likely won't be back - Pho Thanh is considerably better and only 5 minutes away."}
{"text":"My husband and I went in for Lunch and it was quite busy. We had Pho noodle soup (tip: you can order sate on the side), chicken vermicelli and spring rolls. The server was pretty helpful and the orders came in timely. Everything was great- wished the guy on the till was more friendly tho!"}
{"text":"I live close. Good enough when I don't want to go far for soup. Bun Bo hue is decent. Takes them 10 15 minutes to make it though. Otherwise pho comes out.fast and piping hot. Very mediocre Pho but they get extra points from me place is so close to my house"}
{"text":"Delicious, authentic and fast service.  Hit noodles on a cold day. What is better than that?  Even got an order of vermicelli to go. Come here if you can"}
{"text":"The place was really busy when I stopped in this past Saturday. I think I was the only white person in here. So I figured it must have good food. WRONG! All I ordered was some shrimp salad rolls. Pretty easy and I thought it would be quick. WRONG! I waited and waited. Saw an order that was placed after mine being brought out to a table. Finally, my order was ready.   I opened the styrofoam box and unwrapped the salad rolls. At first glance, they looked ok, but upon closer examination, I noticed that they had sliced the shrimp in half down the middle, flat. Interesting. They were filled mostly with vermicelli. There were a couple pieces of wilted lettuce. Nothing else. Ok, so I go to dip a roll in the sauce I was given only to find out it's NOT peanut sauce but something resembling hoisin sauce with some shredded carrots and chili flakes. YUCK! Who in their right mind doesn't serve shrimp salad rolls without peanut sauce? These goons, that's who!! I was so disappointed. This totally ruined the whole thing. If they can ruin salad rolls, I don't trust them with the rest of the menu."}
{"text":"I went here for the first time in the last few days and I can honestly say the pho soup there was amazing!!! They had a clear delicious broth with the perfect amount of meat. I heard their bun bo hue was great too. The restaurant was clean but not really roomy, i went on a Saturday and it was packed. Totally recommend it though."}
{"text":"This place is still open,  It's packed at Lunch time here again today. Been here twice in week. Business as usual"}
{"text":"Overpriced Vietnamese food. Unsatisfying taste. Flavour is gross and is not authentic Vietnamese. Utensils are dirty and table is sticky. Stay away from here. Don't say I didn't warn you."}
{"text":"Best Bun Bo Hue ever, good level of spicy and the broth is very tasty! Service is friendly and helpful!"}
{"text":"This is a good place for Vietnamese food.  I've been all over Vietnamese restaurants in Calgary.  The service is ALWAYS fast even when busy (not sure what Lisa P. is complaining about).  The salad rolls are fine.  The comment made by Lisa P. about being the only white person there makes me laugh.  What also makes me laugh is she's complaining about a few pieces of wilted lettuce.  What do you expect when you pay under $10 for a full meal?  Be realistic."}
{"text":"Its always nice coming in here. Family run business with some of the best bun bo hue in the NW. Every time I come in the owner always comes over and has a quick chat to make sure everything is tasting great.  The bun bo hue always has enough meat to satisfy any carnivore with ample spiciness to go along, or you can always order a little more sate if not enough.   It does get a little busy especially during peak times but turnover is pretty quick ."}
{"text":"Went there last night and was pleasantly surprised. I has a vermicelli bowl with shredded pork and spring roll and I will say it was pretty good but not the best by no means. The place we wanted to go to was closed but we really really wanted to try the other place out. I am not too sure if I would go back. It was worth trying this place out."}
{"text":"Positives tasty soup and that's it. This spot charged 10.50 for a regular bowl while others charge 8.95-10 but the differences you actually get what you pay for. Yeah I know 10.50 for a large  doesn't seem much but the quantity you get is like a small to a regular in other places. I ordered the beef and beef ball pho and got two slices of a half beef ball, and 3 pieces of meat yes I counted. The waitress is rude and this place is also stingy with the bean sprouts. My buddy also ordered a sate beef pho and it was unbelievable spicy and he orders that all the time. The waitress herself she doesn't even eat it so what does that tell you? Ordered viet drinks and got half of the cup filled the rest was empty and they put the drinks in a covered cup so you can't tell how much is actually in it unless you open it like we did.  Not worth it would be a 1 star but they have good tasting soup, save your money and go to other places in yyc"}
{"text":"Definitely love this place! It's nice to have a great quality pho place by my house for once!  The owners are always there and they've got to be the sweetest people!  It's usually pretty busy here but I understand why! They're also very quick with getting everything out considering how busy it always is.   Overall, I've been here a bunch of times and never had anything but an amazing experience. :)"}
{"text":"I have been here a few times since my break up with Nha Trang (see latest review).    Its just average, nothing to rave about.  The owners are super nice, the pho and salad rolls were good and as far as the vermicelli bowls were concerned, they were just meh.  I agree with another review on here that their salad roll dipping sauce is not peanut based so if you are into that, you won't find it here.  I didn't have an issue with the absence of the peanut butter as it was still a decent palatable sauce, peanut butter would have made it much better though.  We went in today and ordered 2 salad roll servings (3 rolls per order, other places usually have 4 for the same price of $5.50) 3 vermicelli type offerings for me and the kids ($9.50 each for the kids, $10.50 for me) and hubs had a \"special stir fry\" on soft egg noodles ($10.95)...his dish was pretty awful.  The \"chicken\" resembled and tasted like pork and was rubbery and just tasted off (we don't eat piggies), the entire dish was bland and the dishes consistency resembled a thick gravy like goo - it was totally repugnant.  In fact, most of the dish was a cauliflower and broccoli stir fry.  We mentioned to the staff that it was underwhelming and the chicken was off and were basically told next time try the seafood stir fry.  Um hows about NO?!  I would think that since like 4 bites were taken they would remove the nasty goo stir fry from the bill, nope!!  And to make matters worse she overcharged us about $5.  Not that its a big deal but for a $60 meal that was probably one of the worst I've had at a pho place, I wasn't impressed.  One star for the pho, one star for the nice staff...I think that's generous.  No kids menu, and their smoothies are priced higher than other pho places.    If you are coming here, stick with the pho or better yet drive up further into the plaza and go to Jerusalem Shawarma, excellent bang for your buck and its delicious for about the same price!"}
