{"text":"Found out this place almost two months ago and now become a regular customer. It's very clean and tidy. Vegetables are always fresh. The soup is delicious and the service is good"}
{"text":"The pho and the dishes are very good and fresh. The service is friendlier and more efficient than average, which makes a big difference if you're pressed for time because you don't need to make a Herculean effort to catch a server's attention."}
{"text":"Love this restaurant! Have been a loyal customer ever since it opened. Very reasonable prices. Delicious dishes with excellent portion sizes. Quick service too. Highly recommend it!"}
{"text":"This is definitely my friends and I's go-to place! The prices are amazing, the portions are huge and the food here is delicious! Unlike other Vietnamese restaurants that I've been to, you can really feel that it's clean place! The staff is super friendly and the service is also really quick. If you're also not into pho, there are many other things to choose from, like the rice vermicelli plates (kind of like a salad), thai fried rice and a curry and chicken dish (if I remember correctly... but ask the staff about it!!). They also have this really cool dessert that's a combination between red bean, coconut milk and some kind of jelly..."}
{"text":"Imitation Vietnamese food. Pho was pretty average. It did not even match any of the review on Yelp. The noodle was precooked. Part of my pho was still cold when served. If you are really looking for a good place in VSL, Paris pho is number one choice. Real Vietnamese restaurant owned by Vietnamese people. Or Pho Lien across from Jewish hospital."}
{"text":"Friendly service, great atmosphere and generous portions. All in all this is a great place to eat."}
{"text":"I ordered a general tao chiken and two orders of spring rolls for delivery and I was 10min awa for the restaurant and it took the 2h to bring me my food. The food was crap it was not seasoned at all it was cold. All in all worst Vietnamese restaurant in mtl."}
{"text":"Terrible service but good food, so make your pick. I would walk across the street to Ave Seoul. The waitress flat out asked why we needed chopsticks and told my friend how she should eat her food. Literally dropped the forks when being served, gave us attitude. Prices are reasonable for the portion, which is pretty good just terrible customer service."}
{"text":"Recently opened, this authentic Vietnamese restaurant offers simple non pretentious Pho. The soup was  rich in flavour with tender slices of meat complemented by thai basil and  other asian herbs in a bowl of rice noodles. Yummy! We also ordered noodles with lemongrass pork drizzled with fish sauce. Delicious! The lemongrass beef with jasmine rice scored a smile at our table. Very good Vietnamese coffee. Finish off with fried banana. Scrumptious! Modern decor. Clean and inviting. Courteous service. Pho Moderne is a gem ready to be discovered. Can't wait until our next visit."}
{"text":"Not the best pho place, but one of the best in Ville Saint Laurent. The Chinese food is actually pretty good too."}
{"text":"My husband and I just love this place. The owner and the staff are very friendly. The food is always good. I love their Singapore noodles. There is a bubble tea counter in the restaurant."}
{"text":"This is the office go to pho spot great portion you can get the xl chicken soup for 11$ and I swear the soup never ends. Should you not be in the mood for soup they have amazing dishes like the grilled chicken and beef combo ! Also try their Vietnamese iced coffee your sure to find something you'll love !"}
{"text":"The food here is just great! I've tried many, many different Asian restaurants and this one is in my top five for sure!!  Clean, Nice staff, delivery service The bubble teas are great too!"}
{"text":", this restaurant is situated in ville saint laurent, and I have to say its very rare a restaurant completely took me by surprise. I walked past this restaurant my whole life and finally decided to go inside, and I have to say, it was like I walked out of montreal and into a whole other world.  The minute you sit down, you are presented with a big tin of tea, and two tall tea cups to serve yourself with. The tea, perfectly brewed, right away transforms your taste buds, flushing out anything you've eaten prior. When presented with the menu, the prices are incredibly affordable, I chose the traditional vermicelli with shredded pork and an imperial roll.   The wait was not even more than 10  minutes when the food arrived. The aroma so powerful, I couldn't wait to dig in. Finally after taking my first bite, I was absolutely transformed. What most restaurants try to do, they actually accomplish. The flavours changing with every bite, I had that moment, that moment of unexpected enjoyment of what I was eating, a truly guilt free meal. Did I even mention how healthy everything they serve is?   I can say I will be going back, a lot, and I strongly recommend this restaurant"}
{"text":"The pho here is absolutely fantastic.   The restaurant is nicely decorated. The service is attentive.   The value ($6.50 to $8.50) per bowl is exceptional.   I'm glad I tried this establishment based upon past Yelp reviews. The only thing I noticed that changed is that they now accept credit cards."}
{"text":"My girlfriend and I really wanted pho and we have eaten at quite a many Pho locations and we weren't disappointed it was our first time at Pho Moderne so I'll get straight to the point for you first timers!  - The atmosphere was nice and the staff was friendly  - The spring rolls were very good and fresh  - I ordered the Dac Biet XL and I wasn't expecting the portions to be so big!! So for you big guys and heavy eaters you'll be satisfied with the XL!!   - They also have bubble tea for 3$ which is a must have!!  So all in all if you're looking for a good Pho restaurant in Montreal this definitely makes the top 5 list for me!! Enjoy and happy Pho'ing"}
{"text":"Pretty decent pho in Ville Saint Laurent. I really recommend the grilled chicken dish too, they really know how to make chicken right. Also! There's bun bo hue , but only weekends. Not sure why it's not offered everyday, but ohwell. Makes it worth the wait!   I've eaten here countless times and I can really vouch for most of their dishes.  The one dish I really would not order is the \"rice pancake\" dish, it's called banh uot I believe. But they don't really specialize in \"rice pancakes\" so it doesn't matter too much. And another criticism I have is the Vietnamese coffee. Don't get me wrong, it's quite good. But they don't serve it the traditional way by giving you the filter and so on. Rather, they just give you the coffee already made.   Anyways, so stop by for a bowl of pho, you won't be disappointed!"}
{"text":"This place was very good. 8.55 for the lunch menu is more then reasonable and the soup was one of the best i've had."}
{"text":"The food is amazing here. All their soups are good and the heir main dishes are all good except for the pad Thai. I've had better. I've been three times already and it's great quality/price. The owner is also very sweet. Try their specialty soup on the weekend !"}
{"text":"La lecture se résume à des commentaires qui appuient l'affirmation des mets servis auquelles je m'inclus. Le fond qui n'a pas été exprimé relève du personnel.  J'exercerai une gêne de bien manger et d'être servi par un service soucieux et mesuré que d'un steak tranché par Jésus lui-même, apporté à ma table sans sourire et blasé!!!!!!!   Bravo mesdames, vous nous avez charmées par votre complaisance à ravir le sous-entendu que le client est déjà acqui. Nous y retournerons."}
{"text":"I've passed by this Vietnamese restaurant a couple of times.  Finally decided to try it with my friend last night.  Surprisingly it was pretty good.  The decor was nice, simple and cozy.  I tried the special beef Pho.  I ordered a small but the portion was more than enough for me.  And it was less than $6!  What a deal!  I'm giving it an extra star for the very reasonable price.  Other Vietnamese restaurants, their smallest portion is a medium and cost more than $9.  I could never finish it.  Waste of money.   This restaurant has the perfect portion for a gal like me.  Not to mention the soup was hot and tasty.  They didn't skimp on the meat and the veggie/herbs were fresh.  Since I wasn't that hungry at the time, I didn't try the appetizer and dessert on the menu.  But I will definitley come back and try them next time!"}
{"text":"I did write a previous review about this place and I did claim that this place was sort of disappointing. I did give it another try yesterday.. Yelpers, I don't regret my decision at all!.  The interior decoration of this place classy and clean (That hasn't changed from my older review). As soon as I walked into the restaurant, I received a warm welcoming and I was served hot jasmine tea which is always appreciated during the winter :)  I received the menu and I did pick two things: chicken/shrimp spring rolls and XL Pho dac biet. The portions for the rolls are huge, I just wish it was sliced before presenting it to me because I have no knife on table. It tasted fresh and the sauce that came with it was delightful.  Previously, I mentioned that the broth for the pho was too salty.This time, it was perfect. Very generous meat portion, very fresh ingredients and I did appreciate having on table the real chilli sauce instead of Sriracha. XL is probably the largest serving of pho that I ever had in Montreal.  I would definitely recommend people to go back again"}
{"text":"Let's start with the positives, the lunch menu is affordable with regular menu items not being very expensive as well. The service was friendly and efficient and the wait to get our food was surprisingly mere minutes (less than 5). Cheap and fast.  Now the negatives. I ordered the orange beef and what I received did not taste anything like orange beef. The beef looked weird and there was way too much tasteless sauce. While eating I felt that this meal may have been pre-cooked or simply reheated. The tiny roll I got was absolutely tasteless and wasn't given some sauce to accompany it, a first for me.  The rice ball and veggies were decent, pre-heated or not. So I ate that and left half my beef in my plate.  I didn't feel Pho Moderne's lunch menu was anywhere close to authentic Vietnamese cuisine and while I didn't order a Pho or more traditional Vietnamese meal, this didn't meet my expectations. With the handful of Vietnamese places around the area, this could have been better.   Should have been better."}
{"text":"Prix super decent, pho qui merite un 7,5/10...bouillon gouteux et bonne portion. Mon amie a essayé le General Tao qui est gigantesque. Un bon 8,5/10. On reviendra!!"}
{"text":"Ok Pho-sters! Look no further, as this is the first time since Pho Bang have I been so enamoured with a Pho restaurant... so seriously this place is gooooood. So much that I would drive out to Ville St-Laurent and drag some of my friends from the Plateau with me.   The soup ever so fragrant, the spring rolls fresh and crispy, the grilled chicken aromatic and succulent, I am lucky to now have another Pho-bulous place to go to!"}
{"text":"Been there a couple of times for lunch. Terrible! 1. Do not order any item containing meat, it tasted funny the 2 times I had any dish containing meat (I get goosebumps just remembering the taste, yeah, yuck). 2. Not real pho, the owners are Chinese, not Vietnamese. 3. Bad service and bad taste for decoration."}
{"text":"I must say I was pleasantly surprised by how good the pho broth was. I was skeptical when I first entered the restaurant because all I heard was Chinese;  from the karaoke music video they had to the staff members' conversations amongst one another. I was thinking this cannot be authentic. Did they change owners?   I'm glad to have tried their pho anyway. The small was the perfect size for me. The servers were really nice and one of them even checked on how my food was after my first couple of bites.  I told her it was good. I love my pho to be piping hot, which it was.  Where they lost the star was the fact I only received 1/2 a beef ball, there wasn't much tendon and there was absolutely no tripe (which I did not find out till I had finished my pho). I thought it was because they may have been lost in the amount of noodles so didn't want to bring it up and once I had finished the soup, I thought it would be silly to bring it up then. As for thw beef ball thing...I know I ordered a small bowl, but judging by the 1/2 beed ball I received, the whole thing couldn't have been that big.    I will definitely be back to eat here again since it's so much closer to home for good pho."}
{"text":"On my quest to experience more Vietnamese restaurants I had searched places in the Decarie N area near Cote Vertu and this place came up. For me Vietnamese is comfort food. It represents a fresh filling meal of a mix of meat, noodles and vegetables. All flavours dynamic, complimenting one another but mixing in your bowl to give your taste buds a tantalizing wake up.   Entering Pho Moderne I'd say the restaurant is appropriately as the name suggests. It's modern, clean and tastefully decorated on the inside. The menu offered an array of your typical Vietnamese offerings: appetizers, pho, rice dishes, bun noodle dishes, drinks and desserts. All with a good selection and pricing is your typical very inexpensive for Vietnamese restos.   I ordered the chicken bun noodles with a spring roll. It was served very hearty in a bowl with peanut, salad, nuoc mam and a generous serving of grilled chicken. On a scale of 1-10 it was a solid 8. With this I ordered some spring rolls as well to share with my dinner mate. They were crispy fresh and a slight bit of oil on the wrappers. Not greasy but not dry. All in all a solid meal and definitely worth a return based on experience, price and quality.   There are a good amount of Asian restaurants in this Neighbourhood of Decarie N but I'd contend Pho Moderne is a good choice if you want authentic Viet food."}
{"text":"the pho here isnt the best. it is very sweet. i also thought their bun thit bo was ok, it wasnt the best either. my boyfriend had the com bo luc lac and i think that was the best thing we ordered, but the fried rice that came with it was ok. overall, i have experienced better vietnamese food in the area. there is another place in the area that isnt on yelp called \"pho cote-vertu\" which is connected to a cha time, beside a metro station and across from a tim hortons. i probably wont be returning to pho moderne. i also got their spring rolls and imperial rolls and those also just tasted ok."}
{"text":"I'm stuck near the airport for about two month and this place saved my life by keeping me well fed. Im so thankful that they deliver...in the harsh cold Montreal winter, a nice bowl of steaming hot pho really helps. The grilled chicken with rice is delicious as well. Overall good food, large portions, fair price, and free delivery over 10 dollars earned this place a five star."}
{"text":"We started with imperial rolls and salt & pepper tofu. To my surprise the tofu was good and the imperial rolls was little cold from inside. Should have tried the classic pho dishes but instead ordered the sea food nest. It was very average. The veges were little fresh which we liked. The ambience is not bad. The service was little slow. Overall it's not a fancy restaurant but a pretty decent pho restaurant for a nominal price."}
{"text":"Update to previous review: I ate there a few more times, and their food is very consistent in terms of quality. Both takeout and in-restaurant are good choices."}
{"text":"Amazing pho experience at Pho Moderne. The service was super friendly and the pho one of the best I've had in Montreal. I've tried at least 6 other pho places in the city, this one is on top of the list. I tried both the grilled chicken and the rare beef pho, both were equally delicious. Portion is huge, broth is super tasty and their green tea is terrific. This will be my new go-to pho place in ville st laurent"}
{"text":"Stopped here for some pho while visiting Montreal. ordered the rare beef noodle soup, grilled pork bun, and pad Thai. The bun and soup were stellar.  Skip the pad Thai it was lacking flavour.  if you've got a hankering for Vietnamese I would recommend. Service was quick and food was great."}
