{"text":"This use to be my go to place. The prices were great and the food was spectacular. It was taken over by new owners who revamped the menu and raised the prices. Today my vermicelli noodles were cold and the shrimp spring rolls were very bland. Disappointed in what use to be a great restaurant."}
{"text":"Came here towards the end of vacation with just a night left, me and my girlfriend was tired of eating Canadian food so we looked for some Asian restaurants close by. Lucky us that we found this great Vietnamese place. Very friendly staff and they know how to serve their beer here (with a chilled glass). Already a plus. 

I think the ingredient they used here are different from what I'm used to in the states but that doesn't matter when they got a solid foundation. The BROTH was so flavorful in the beef pho that I got. It didn't matter that I wasn't used to having onions and did not have a lemon/lime and was given a pepper instead. Huge portions and was one of the least expensive meals we had while in Alberta. Would definitely come back here if I do stop back for vacation again."}
{"text":"Ever been to Saigon Y2K?  The food tastes very similar so if you're a fan of Saigon Y2K, then you'll like  this place.   The owner used to be part owner of the Saigon Y2K and I guess he must of took the recipes with him.

I came here a couple times.  I had the Satay as well as the normal pho.  It was very tasty.  The first time I came here, the noodles was kinda hard so I told them to cook the noodles a bit longer for me every time I ordered.  Now the pho is perfect!  

Atmosphere = 1 star
Food = 2 stars
Would I come back = hells yea 1 star

Yes...it's hard to get 5 stars out of me.  The pho has to be so perfect that I would order another bowl on the spot to get that final star."}
{"text":"Recently spotted this place on my way to Sunridge Mall and decided to give it a try today with my colleagues.

The broth is what makes a good pho and the broth served at Pho Tai was so so.  I can taste quite a bit of MSG in the soup and it wasn't particularly flavourful.  Portion size was a little small, I was still hungry by the end of the meal.

My colleagues who had the bun liked their meals very much.  They thought it held its own when compared to some of our other regular Vietnamese joints.  

Service was slow for lunchtime.  We were seated immediately but it took awhile for our orders to be taken.  Decor of the place is standard with a TV on one of the walls to keep you entertained while waiting for your meal.

I am more of a pho than bun person, so I will have to go back to try the bun but this will not be my first choice of Vietnamese place to go for pho."}
{"text":"Tired & hungry from Christmas shopping I just wanted to grab something to go & I'm not all about the fast food, deep fried same old, same old.  I swung into Pho Tai for the first time. I was seated right away & the hostess asked if I would like any recommendations from the menu.  She then pointed out a couple of options but my hungry eye kept going to a picture of the Tom Yum Ramen.  So I let my eyes decide.   It was ready quickly & they offered me a glass of water while I waited.  The décor is modern & clean with fresh flowers on each table & the colors are relaxing & soft. My soup was ready quite quickly considering I just walked in & placed an order & this was clearly an eat in kind of place (however they are on Skip the Dishes).  On the drive home the smell was so wonderful I could barely wait to park my truck to get into the house to eat.  Well readers...the flavors were as great as it smelled.  The ramen noodles & shrimp were not over cooked, the egg was cooked enough that it didn't look like salmonella waiting to be consumed.  Lets now talk about the best part...the FLAVOR!  Subtle & spicy it was heavenly.  I can't wait to go back & enjoy something different from the menu with my family."}
{"text":"Used to go here every once in awhile and then the last time I went, noodle soup and grilled meats was pretty bland. After asking around, found out the kitchen staff moved on to open their own restaurant in Huntington called Pho Mai Thy."}
{"text":"Solid little pho place. In and out in under 30 minutes. Ordered the #59 and has nice hints of lemongrass and was very light, not heavy like other vermicelli dishes and feel. If you need a quick spot of lunch, this is the place."}
{"text":"If I want a good noodle bowl, like need it ba-a-ad, this is where I'm going. Recommended by an out of town friend for awesome noodle bowls, we hit this place up and haven't looked back.

Van. B.'s review pretty much nailed down everything about this place, so not much to add. I always get my standard spring roll noodle bowl and I ask for basil to be added. This place is on the cheap, the staff are friendly, and the eats are fresh and delish. I also always order a Vietnamese iced coffee to go when I order my meal and it always seems to come out just when I'm finishing up, right on time."}
{"text":"I go there atleast once a week for the vermicelli dish. I dont care much for their meat so i get extra spring rolls. The people that work there are really friendly and I no longer have to tell them my order, they just ask \"the regular?\". The service is so fast within minutes you have your food. Iv tried alot of other place and this is by far the best one, with the best spring rolls. Well worth the drive across the city."}
{"text":"If you're in the NE and you're going to watch a movie at the Sunridge Spectrum movie theater but wanted to grab a bite to eat before the show and don't want to chow down on greasy fast food definitely run across the street to Pho Tai. You walk in to a clean, simple restaurant that is modern enough to be comfortable to eat knowing that what you're going to be getting food wise will match it's decor.

Staff here are super friendly and you will always be greeted with smiles. I expect when I come into a Vietnamese restaurant that you're seated and given tea and Pho Tai does just that. There are a lot of Vietnamese restaurants out there that don't give you any tea and I think that's cheap and just a no-no it's like having friends over but nothing for them to drink, you know? ;) (Other Vietnamese restaurants please take note).

The portions for food are an excellent size for what you pay, I definitely am totally full with a slight case of itis when I am done eating. Pho Tai's menu despite its name is not just Pho there are a variety of items on the menu to try so if you're going there multiple times and new to Vietnamese food give everything a try that way it keeps you with variety and you self-educate yourself in Vietnamese cuisine.

Like I said when I am in the area just before a movie this is the place I usually will hit up!"}
{"text":"This place just renovated as it was kind of shabby before. It's new, new menu and new dishes. Really good, prices are reasonable. Service is good. I usually get the vermicelli, soup or curry. Highly recommend!"}
{"text":"Me and my wife's favorite Vietnamese restaurant in the NE. We tried plenty, but keep returning here. Good prices, friendly staff, and fast fast FAST service."}
{"text":"This has been my go to pho place for a while. I always get the vegetarian sate soup. They have  veggie broth now so yay! The service is usually* pretty good. Sometimes the server forgets to bring you your complimentary green tea but after a reminder they are pretty quick to oblige. 
The soup is delicious, as are there veggie spring rolls. Its a good clean atmosphere with nice comfortable booths to sit in. Usually pretty quiet with nice background music. Nice place to have a relaxing lunch/dinner with friends/family. Also, the price is pretty reasonable. About 9/10 dollars for my soup which is a pretty big portion  (I can hardly finish it)
This place has my business for life! I will probably never go anywhere else for pho."}
{"text":"I have had 3 awesome visits here so far for vermicelli and I really enjoy it. For lunch or dinner, it is clean, quick with decent, respectful service and free jasmine tea! The owner is a real humble gem who will go that extra mile for you. Parking is a breeze and you can sit wherever you want when you enter.
2 adults can eat here for under $20!
Ordered tonight - Pho - satay chicken - good! Good temp, good kick. 
I always get BBQ pork and spring roll vermicelli - in all seriousness, some of the best Vietnamese I have had in Calgary. The noodles are done perfectly, fresh lettuce, crispy rolls, yummy pork with the grill markings! Nice portion sizes.
I live nowhere near this area but I would drive the distance to eat here any day! Now that I think about it, I COULD eat this food everyday. I better check the calorie chart but I never feel full after I eat this food! Just soooo satisfied!"}
{"text":"Very nice, it's good to see a place with more than Pho. Grilled meats, great fish sauce, fresh veggies, & good tea."}
{"text":"They must have fairly recently renovated cause its no longer a dive!
Granted the last time I went here, until last week, was several years ago...
Anyway its a nice place on the inside now and they are pretty darned scrumptious"}
{"text":"We went to this place after walking the mall, because we didn't feel like eating mall food and I haven't had Vietnamese noodles in a couple of weeks.  I had a sate beef noodle soup.  It was alright.... better than a lot of restaurant that offers satay, but not the best I have tasted in Calgary.  This restaurant is on the pricely side... I think the satay noodle was $8.50 and I thought it was on the small side considering the price.  A little more noodles would have been perfect.  The staff was friendly and took care of us.  It was my first time here, but I will come back for their other menu items the next time I am in the neighbourhood."}
{"text":"Love their fried rice.. always the best . Satay pho is good too with lot of flavors.

Food always served fast and friendly service.

Have been going there for years"}
{"text":"Wow. I did not expect to have delicious Vietnamese food in Calgary. I ordered their crab noodle soup because it looked interesting and I love noodles. My mom ordered their prawns pad Thai. I don't know if it's because I had no expectations but their food was very clean and flavorful. Portions are pretty generous. Service was awesome even though there was a language barrier, got everything we needed and the waiter was friendly. I'm craving this now.."}
{"text":"I know my Pho like Bo Jackson knew baseball. 

This place gives smaller but sufficient amounts of pho.  If you want something huge try the noodle dishes.   
My sister's was busting over the top. 
Cheap large bubble tea after 2pm with purchase of main dish. 
Pho -tastic 
I recommend the Pho satay ga #21.
Yum yum"}
{"text":"Great food with very fast service. Had the #14 with brisket and was very happy with it. Great on a cold Calgary day especially with a few drops of srirachi"}
{"text":"I came here for late lunch since I was in the area. They have a promotion where if you order one entrée after 3 pm, you get a free spring roll. 

Their prices are higher than most Vietnamese restaurants, inching close to $10 for pho and $7 for three salad rolls. 

I ordered my standard rare beef pho and my hubby ordered the sate beef. The spring rolls came out quick and fresh. I noticed our server, who couldn't have been older than 19 years old, didn't bring out the fish sauce for the spring rolls. When I asked him where the fish sauce was, he told me to use the hoisin and hot sauces on the table. Little Boy, you work in a Vietnamese restaurant. How dumb are you?! Spring rolls come with fish sauce! It's pretty standard!! 

Our pho came out quick in deceivingly huge bowls. The  bowl itself is large but the portions weren't generous. I also felt the broth had a sour hint to it. Otherwise, the ingredients were fresh. 

Ultimately, my vote still goes to Quynh for the best pho in the Sunridge area. Service was quick here but I was put off by our server's idiocy. I won't be back here if I had the choice."}
{"text":"Nice place and good food.  Was looking for a pho place on the way to the mall.  

Can't say anything bad about this place.  Pho was good and so were the spring rolls.  Ordered a large bowl with 2 spring rolls.  I think every bowl comes with a spring roll and i ended up with 3.   

Would come back again."}
{"text":"Friendly and fast service. Vermicelli is very good and the pho is average. About what you'd hope for if you're not spoiled."}
{"text":"Came here with the kids during our stay in Calgary for stampede. It was close to our hotel.  Spring rolls were OK but rare beef pho was very good. Excellent broth. Iced viet coffee was fantastic.  Good service good price I would highly recommend for a quick inexpensive meal."}
{"text":"Finally got the chance to sit down, eat and take a peek in the restaurant. Brought the kids in for a pre-Christmas lunch. Upon sitting down I was a little surprised at how under kept the place is (does that makes sense?). But that can sometimes be the case when you find good, cheap eats.

The kids shared a noodle bowl and I ordered my own with spring rolls to share. The chicken pieces are larger than what I've had at other places (winning) and the service was spot on.

Food is good, I will definitely be back. Most likely for take out again."}
{"text":"I had their beef satay pho and it was delicious. The broth was fishy in taste, which I'm not a fan of but it was still tasty, unlike broths out there that taste watery. The pho is also full of noodles and beef. I hate it when there's a lot of broth and not enough content in it but this one was really hearty. Their service was really quick too, but I went at 5pm on a Friday.

Their pork salad roll was disgusting. It had this weird, dry, grainy stuff around the pork and it was really gross."}
{"text":"They have subs here now! Be warned that the free pop offer only applies if only if you get the sub to go; I think there was some misunderstanding with our waitress and we were charged for it even though she offered it as being free. My veggie sub was pretty good (it did include fried tofu in addition to veggies). Super large but a bit sparse with the fillings, although I can't tell if I actually feel this way because the baguette was so huge. Neither of my friends have gotten pho whenever we're here so I can't comment on that but the vermicelli, rice, and cripsy noodle dishes are tasty according to them! I think of the three nearby Vietnamese places (Quynh and Tre Viet being the others), this one is my favourite!"}
{"text":"This restaurant is in the shopping complex with the Rona and Wendy's. It is across from the Cineplex Odeon Sunridge theaters.

Pros:

1. Very fast! I came in a couple min before noon on a Tuesday, ordered and got a piping hot bowl of soup in less than ten minutes! 

2. Good soup. Great noodles, broth and beef. The soup came with fresh Thai basil and bean sprouts. 

3. Value. My soup, huge and delicious, came to just under ten backs with tax. 

Cons: 

1. Staff inattentive. I tried catching someone's eye a few times to get some hot chili oil or special hot stuff. Nope. She said it was on the table when I finally got her attention. Or a bigger spoon since mine was teenie tiny! 

2. Parking lot is skimpy. Be careful when you back up. So many businesses in this parking lot. 

The ambiance was nice, comfortable. Booths. I liked the soup. Flavourful broth. Good overall experience :))"}
{"text":"The appetizers are great and the vermicelli delicious. Also, the service is very friendly, and the prices are not bad. In addition, the portions are huge!!..  If you are around, this is a great option for lunch."}
{"text":"I have a rule of thumb about any restaurant that I visit.  If it gives me diarrhea it is usually a sure sign that I will not come back.

The food itself was good, fresh and service was quick, no complaints on that end, but once I got home I knew something scary was brewing...that said, my hubby liked it so he probably would come back, he has an iron gut mind you.

I ordered the vermicelli with  shrimp and hubby had the pho.  They were both alright, I guess....with all things considered, I give this place  2 stars for the quick service but after my toilet escapades that night I have to dock some points, sorry."}
