{"text":"Food is decent, but way too much MSG. I just had their dry Mi La Cat. The sauce was very salty and just eating that and maybe two spoonfuls of the broth was enough to give me cramps."}
{"text":"I love Vietnamese food and am Vietnamese so I can safely say I am very selective and an expert on the matter. The broth of the Tonki soup is ordinary not the greatest but certainly not the worst either, it contains a lot of meat, the vegetable is fresh. There are a few variations of soup from beef to grilled chicken to shrimp.

The Banh Xeo (Vietnamese pancake) is amazing. 
 Cooked just right and served with lots of vegetable. 

I will go back again."}
{"text":"Wow.  This was real close to the best service and best food I've EVER had.  The execution here screams quality and attention to detail from the spotless dining room to the large, laminated, bilingual menus.  The boba tea (honeydew and coconut) was the best I've had.  #45 Banh khot and 48 bo ba mon rank among the finest entrees I've ever enjoyed.  The waiter was unusually gracious and efficient, showing us how to best enjoy the wonderful food.  I don't think I've ever met a nicer man.  The bill was pleasantly small for such a superb meal.  I love the Montreal area and will return here to eat anytime I'm within 100 miles of their door."}
{"text":"I really like their tastes and flavors. The overall environment is clean and the atmosphere is nice too. If you like their Facebook page, you can get a free Coke:) my favorites are the fried chicken wings and the classic pho."}
{"text":"Not as good as when this place first opened. I would have given them 4 stars a year ago but at the most 3-3.5 now. It brought the bar up in Brossard certainly but not as good as Tay Ho in MTL or Ben's in Chinatown,  both for quality and price. Over time, less attention is put on cleanliness, I'm always finding sticky surfaces there. Service is always friendly."}
{"text":"Tried this place when it first opened just to see if it was any better than all the other pho places in the same area. The decor was really nice and modern. The menu was a little pricier than the average Vietnamese place and the flavor was pretty good. However, 10 minutes after we left, my husband and I both felt weird. Lightheaded, dizzy like we were on drugs or something. I'm guessing we were having a reaction to the abundance of MSG they must have put in their soup to give it more flavor. It's too bad because I liked their soup but there is no way I want to feel like that again."}
{"text":"Bonne découverte sur la rive sud. mon barème est toujours le même. quand j ' arrive et qu il y a 80 % des clients sont vietnamiens je sais que se sera authentique les bi cun excellent les cha gio super pas gras et bien remplie les pho ga et pho tay excellent bon bouillon clair et savoureuses on est contant"}
{"text":"I've been there twice and had the medium Tonki PHO special soup.  Consistently delicious each time and nothing to complain about. For less than 10 bucks I'm full and happy. I will be going back again!"}
{"text":"Good local Vietnamese spot to grab a quick bite. We tried a lot of dishes. Food is served quick"}
{"text":"Soup is very flavorful! The place is quite clean and not crowded so there is no problem bringing little kids and having babies with their high chairs at the table! I took the XL and the portion is well fulfilling!"}
{"text":"Friendly staff and great Vietnamese food! If you're looking for a great Pho restaurant on the South Shore, look no further!

If you like beef Pho and feel adventurous enough to try something other than your Pho Dac Biet, try their Beef Stew Soup (#8). Really, really good if you love well cooked beef and tendons. 

Coming back for sure!"}
{"text":"Everything is great! Food was great staff is great and location is great for me!

It's my go to after gym location ! I'm in love with the food it makes my mouth water just setting this review.. I'm actually going to get some now; I can't help myself. 

Anyway they have a variety of dishes that are enjoyable for every mood, and it's always full of flavour"}
{"text":"Can't say this place is the best but it's very decent. They have many different soups such as bun bo hue or bun rieu and they're pretty good. Their grilled chicken vermicelli and their spring rolls are very tasty, but the portion is a bit small. For the dessert, I took their 3 colored desserts. I wouldn't recommend it. It doesn't have that sweet coconut and beans taste I was expecting. 

As for the service, it's very quick and they also serve tea instead of water which is a plus."}
{"text":"Became one of my instant favourites in the south shore. The fish sauce chicken wings and beef pho (#10) will fill you up quite well. Very affordable - good for family get togethers"}
{"text":"The best Vietnamese restaurant in Southshore.  Service very great and food fresh.  You should go there. Not too salty broth and plenty of tasty stuff for around 10 $. Very good vietnamese Pho noodle. Rice dishes are also awsome. Great new pho place. More authentic than others"}
{"text":"J'Ai essayé leur pho qui, sans être la meilleure, est très correcte. Les autres plats autour que j'ai vu défilé étaient appétissant ce qui me donnait le goût d'y retourner mais je dois dire que je n'ai vraiment pas apprécié cette façon de faire qui veut qu'ils gardent leur thé au Jasmin ( qui est plutôt bon ) dans des pichets en plastique qui sont faits pour servir de l'eau froide et non pas des thés bouillants, d'autant plus qu'ils servent le  tout dans des verres qui, également en plastique, ne sont certes pas fait pour recevoir, encore une fois des boissons chaudes. Évidemment je doute que ces contenants ''cheaps'' soient sans bpa et je n'aime pas l'idée que le thé, que l'on est sensé boire,  puisse avoir été de la sorte contaminé... ce n'est pas hygiénique, c'est toxique et c'est irresponsable que de servir cela de la sorte puisque cela favorise les perturbateurs endocriniens."}
{"text":"One of the good place to go to in Brossard if you're looking to have a quick meal. The service is pretty fast there! Could literally sit in, eat and leave in less than an hour (of course not if you're a slow eater).  They have many choices of soup and vermicelli dishes and also have lunch specials. They offer bun bo hue on a daily basis which most of the vietnamese restaurant dont. Not the best place to try bun bo hue though.... It is not the best vietnamese food I ate, but for a restaurant in the south shore, it is a pretty good place to go."}
{"text":"Went there many times. Each time the quality's of the food is good. The phó dac biet is the best choice for all dressed soup lots of MEAT and noodle. I suggest get the extra large worth the money. End of the meal gotta have the 3 colour drink or bubble tea (durian) or ice coffee, but you gotta try is the deep fried ice cream to end the meal."}
{"text":"Very delicious Vietnamese food. The fish sauce chicken wings appetizer had a good crunch and the right sweetness. The spicy pork knuckle soup was yummy. No wonder there's always a line up!"}
{"text":"Probably one of the best Vietnamese restaurants in Brossard. The spicy beef soup is excellent, don't be fooled by the \"spicy\" as it's really not spicy at all. Quick service and friendly waiters, perfect for a cold winter day!"}
{"text":"Average food and service. Kind of dirty and some flies going around. Was ignored by two staff members when I walked up to ask a question. Plastic cups, bowls, and chopsticks."}
{"text":"This is not the best pho in the town....but this place is popular cause they have many choice of Vietnamese food....i like the porkchop rice,and my favourite durian smoothie.....the sugarcane juice is not fresh.....the price is a bite expensive..."}
{"text":"We ended up here on the coldest day of winter following an unfortunate assumption from our part! See, we planned to have some Dim Sum to mark the lunar New Year and since we had business on the south shore we figured; Why not in Brossard? After all, there is a significant Chinese community and we knew two Dim Sum Places. The first one was way overcrowded with 50 groups ahead of us and the other... well, it had closed! There something to be said about planning ahead.

Anyway, being now a bit pressed for time, we ended up here. Nothing really fantastic but the food is good. My son had a Pho which was tasty and the size was quite generous. The same was true for my beef noodle plate. The imperial rolls were passable.

Ambiance is convivial and so was the service. It is a clean and comfortable place and we were happy with experience even though we would not make a detour to come here."}
{"text":"This place is named after the eponymous Vietnamese soup, however, I didn't see anyone eat it when I was in the restaurant. The menu is a lot more eclectic than what's usually offered in Vietnamese restaurant, with a multitude of dishes. The decor was on point, it looked like a modern casual restaurant, and the staff were friendly enough.

I ordered a Hu Tieu Nam Vang, which is a Vietnamesation of a Cambodian dish: Phnom Penh noodles. Cross-over like this happens all the time in South East Asia, due to the geographical situation. Comes with a side broth, and I added a bit of hot Habaneros to spice it up. It was ok but the meat was on the dryer scale of things. 

The iced coffee was ok.

Would return if I don't have to wait in a line, and if I'm around. I won't travel all the way from Montreal for it again tho."}
{"text":"The restaurant gave me the feeling of being in California! I had a Mì La Cay and it was pretty good. The atmosphere was great!"}
{"text":"Un des meilleure restaurant vietnamien à Brossard. Il offre une variété de plats, mais je vous recommande le pho."}
{"text":"Situated in Brossard on Taschereau, this Pho place was a random discovery for me. I saw this Pho MC place when I went grocery shopping with my mom. 
There's nothing better than a hot savoury bowl of Pho in this winter snowy weather.

I ordered the small bowl Pho with rare beef and it was delicious. The noodle had a good chewiness to them. The broth had a very good meaty taste to it; you can't get enough of the broth. The mint leaf and bean sprout were fresh. You also have a good amount of beef. The waiters were very nice. You get a nice green tea instead of water; of course you can ask for water if you don't like green tea.

I had the pleasure to go on the lunch hour and saw the employees hand rolling their spring rolls so I can tell you that their spring rolls are daily made."}
{"text":"T Today is rather disappointing. First of all, the waiters cannot follow the order. The soup is the most uncomfortable food I have ever eaten. I do not believe in their soup and they are tired of eating, like the taste of the flavoring seasoning with many additives. So even after I finished eating I was thirsty and I felt uncomfortable. It wasn't really a soup I had made. Will not go. 
out d'abord, les serveurs ne peuvent pas suivre la commande, la soupe est la nourriture la plus inconfortable que j'ai jamais mangée, je ne crois pas à leur soupe et ils sont fatigués de manger, comme le goût de l'umami avec de nombreux additifs. Donc, même après avoir fini de manger, j'avais soif et je me sentais mal à l'aise, ce n'était pas vraiment une soupe que j'avais faite. Je n'y vais pas."}
{"text":"The food was flavorful, and portions are big.  When you ask for an XL bowl you can really expect extra large and it was definitely very filling.  

We ordered a few noodle dishes, 2 which we asked our meats to be fully cooked, however, when it was brought out to us the raw meats were still raw.  I specifically said it a few times to make sure the staff member understood me, the staff member repeated after me several times and thought she got the message.  

The wait wasn't long and we were seated within 5 to 10 minutes with a small line out the door. 

I would come back here if I were in the area.  The soup base was definitely one of the best I have had but the raw meats being raw when I specifically asked for cooked meat.  The water wasn't refilled unless asked.  Minor things that they could definitely improve on."}
{"text":"Fast, friendly and efficient staff. Location is noticeably cleaner than two other competitors in the area but could use a little less incense during busy hours. Seating good for 75 patrons.

Good phõ options to choose from starting under $10. Walking distance from C&T so you know they won't run out of condiments... Ever!

Bubble tea served with underboiled pearls and fried bannanas garnished with frozen fruits is nothing to write home about... Did I mention C&T is next door??

Can't say it's the best phõ in town but will definitely come back for the other stuff on their menu."}
{"text":"Pho Mc sert desormais la meilleur soupe tonkinoise sur la rive sud."}
{"text":"Bon, je vais faire ma difficile un peu, mais gardons en tête que 3 étoiles signifie \" A-OK! \". Dimanche dernier nous sommes partis de LaSalle jusqu'à Brossard, comme cet endroit nous avait été recommandé. Nous sommes arrivés vers 12:30 et l'endroit été bondé de gens, mais nous n'avons attendons que quelques minutes pour être assis. Pour vivre la pleine expérience, nous avons goûté à un tas de choses sur le menu et avons presque tout partagé à quatre. Allons'y en ordre:

- Le verre de thé chaud: bien contente que celui-ci était offert dans un grand verre, je trouve jamais qu'il y a assez de thé dans le mini shooter habituel. Chaud et délicieux.
- Les rouleaux impériaux. D'une bonne grosseur et bien farci, mais je les ai trouvé un peu huileux. Je sais qu'ils sont frits dans l'huile mais bon.
- Les rouleaux de printemps crevettes et porc. Beaucoup de viande et pas trop de nouille. Parfaits!
- Les rouleaux de printemps omelette et saucisse. WoW, une belle découverte à redécouvrir encore et encore.
- les petites crêpes au lait de coco et fruits de mer. Franchement c'était bon, mais pas assez intéressant pour que je les recommande. Ça manquait un peu de goût.
- La tonkinoise au buf saignant. Le bouillon, assez clair comparé à certaines autres places, vraiment vraiment délicieux et savoureux. J'ai par contre pas trippé sur les nouilles et le buf, c'était carrément de la viande à fondue un peu sèche. 
- La  Bún bò Hu, absolument fabuleuse. Ils sont très généreux sur la viande (dans toutes les soupes d'ailleurs) et le bouillon était pas trop piquant. Comme je l'aime.
- Le café froid vietnamien. Très bon et très puissant. Ça remet sur le piton mettons!

Overall, contente de mon expérience A-OK, et je saurai quoi prendre à l'avenir!

Faites-vous plaisir et aller faire un petit tour au marché C&T à côté après, il y a un tas de produits asiatiques à découvrir!"}
{"text":"This restaurent I believe is the best Vietnamese restaurent in Montreal. The staffs are very friendly. Everything is so tasty. Even the ice coffee and 3 colour are very awesome! Highly recommend."}
{"text":"I had my first meal there which consist of spring roll and a bowl of pho. The quality of the food is amazing. it was probably the best Vietnamese food I had in Brossard and I am extremely picky on Vietnamese food. I will recommend it to anyone to eat there at least once because the food is worth your money. I will come back soon!"}
{"text":"Vietnamese in the South shore? Yes please. 

The place could be the name for a good Hip Hop artist or inverted as MC Pho. 

My visit I wanted to sample a fiery hot bun bo hue. Although it wasn't spicy the flavour was rich w beef and had your typical meat and noodle offerings. It was not the best BBH however it was not subpar. It's a generous bowl and there is a large menu offering of all things rice and noodles. Looking around at other patrons meals it looked pretty legit. The lunch hour is quite busy and it's good to see local restaurant bustling with action. If I'm back in Brossard I'll be back for some noodles and rice."}
{"text":"Used to love them. Recently their quality seems to become low. In addition, the noodles bowl is cheap plastic which should not be used for hot soup. Did not really enjoy their food in our last two visits, and so don't want to go there anymore."}
{"text":"Finally a decent banh mi place in Brossard! The Pho MC just expanded with a Banh Mi MC counter. I tried the classic cold cut and the grilled beef banh mi! Good bread and nice slices of meet, the brisket is the sandwich is very good. The beef banh mi, the sauce is savory just like my favorite place in montreal. 
If you are done with your grocery and want a quick snack, banh mi is the way to go! 
They have a combo with a mini chicken pho, the broth is good and bright, if you want a full size you can go next door to the pho place. They also served bubbletea and vietnamese ice coffee.

Keep the good guy MC team!
Ill be back!"}
{"text":"Not bad for a quick stop on our way back to Montreal, on Father's day.
We waited less than 10 minutes to be seated and the service was quite fast. 
There are not that many vietnameses restaurants southshore, so I could say I will go back and eat here for the food. Staff was vietnamese, which was another good sign.

We tried the Hu-Tieu, a rice meal and their Bo-ba-mon (3 beef plate that you roll with rice papers).
We were all hungry so the meals were tasty and satisfying.
I cannot say we were as please with the drinks. We asked for two fresh fruit shakes, one with jackfruit and one with durian with less sugar. They messed up the order giving us two shakes that almost tasted the same and were as sweet as hell.

As the the vietnamese café-sua-da which usually has condensed milk to make it a bit sweeter, they forgot about it.. 

The \"nuoc mia\" was fresh!
Did not try their pho yet, maybe next time!"}
{"text":"I'm picky, but really this is a great place to eat. Esp after you do your groceries at C&T, spent a whole bunch of money, yet is still to lazy to cook!

Only minus for me is that they do have MSG in the soup.....now Mtl and surrounding area, when are you going to give me non-MSG Asian food places ran by Asians?!?!  Cos MSG makes my mouth dry after eating it....then I have to drink a ton of water and then I will look bloated....so.... cut out the MSG someone?

P.S. They have baby high chairs. Always useful to know for young parents. Strap them in yes!"}
{"text":"Decent environment as a pho place. I ordered a large pho soup. The soup tastes just right but I think the portion of noodle was less than what I expected."}
{"text":"Great Vietnamese restaurant in the south shore. Lots of different foods to choose from at reasonable prices. Pho I had (#21) was great. Restaurant was clean and service was great and fast as expected at a Vietnamese restaurant.

Great location with plenty of parking. Also accepts credit cards as well."}
{"text":"The food was fresh and fire (just like my mixtape). I'm not a vietnamese food expert, but I have tried quite a few and this one definitely stands out in the greater Montreal area. The soups are great and the rice vermicelli is on point. Its a local restaurant so thats a plus. Overall, It filled me up at a reasonable price and added joy to my stomach."}
{"text":"By far the best Vietnamese place I've been. I'm in love with their Pho and the perfect broth. My favorite place to go when I'm in town."}
{"text":"Nondescript from the outside, the food here is some of the best Vietnamese in a metropolitan area boasting a multitude of such restaurants. The pho broth is robust, savoury, and rich. The noodles are always perfectly cooked. Spring rolls are crisp and not greasy. Try the beef stew noodle soup; not many restaurants offer it and MC offers the best I have tasted anywhere. Too bad the cute cashier won't even make eye contact with me."}
{"text":"Do you know the Pho My Canh in ChinaTown? Well this is the same!!!!! But in Brossard!!!! And it's a 100 times better! The decor is spot on, very modern and spacious! A lot more room than the one in ChinaTown. They also have TVs now for hockey (GO HABS GO)!!! The food is very good as well, very complete and generous and hot. The wait is not long. The staff is friendly. Brand new, this place is a must when you pass by the South shore of Montreal!!!! I will come back here for sure! 5 stars well earned."}
{"text":"I love this place!  Finally a really good Vietnamese restaurant in Brossard!  Everytime my family wanted to go for pho we had to go to Montreal. They have a wide selection of dishes that are difficult to find in most Vietnamese restaurants as well.  Their bun bo hue very flavourful and traditional."}
{"text":"I am a regular at the original MC in China town. This is my first time here since the opening! Coming here made my day! I am all happy inside Not only they have great pho but they also serve some authentic vietnamese dishes such as banh khot, fried chicken wings with sweet fish sauce, beef three way... Huge parking and next to C&T market. Great service! Great delicious food! I don't mind taking the bridge to come here that's for sure!"}
{"text":"Best pho I ever had! The soup tasted so good that I almost drank it all. The quantity of meat was also unbelievable."}
