{"text":"J'ai trouvé le bouillon ok, mais manquait de saveur, et j'ai été déçue des morceaux de boeuf qui étaient tout sauf saignants ce qui est un must pr un bon Pho non?"}
{"text":"Lol, the food is microwaved. As I was waiting to pay for my meal, I literally saw them microwaving someone's food. Not impressed.

I also feel like this restaurant is overrated. I had vermicelles noodles with beef and shrimps and I wasn't impressed. The beef was somewhat flavourful, although you could tell it wasn't freshly made, and the shrimps were plain."}
{"text":"We come here for pho at least once a month and it's never a disappointing experience. The broth is always very rich and flavourful, the noodles are well cooked and they are generous with their toppings. The Bun Bo Hue is also excellent. 

Great food and service. This is our favorite restaurant for pho (we've tried many, many places in Montreal) and would definitely recommend it."}
{"text":"Looking for delicious pho in Chinatown? Pho Saigon is it. The broth was tasty, not oily in the least, the meat was tender, and everything was super fresh. Do not omit the spring rolls- YUM. They were so delicious, by far some of the best I've ever had- make sure to get a double order! The staff is friendly and accommodating, the decor simple, slightly neon-ised and in a basement but hey, you can't ask for everything. I will be returning. Pho sho."}
{"text":"Perfectly fine vietnamese place in Chinatown. Clean looking, if pretty simple decor. 

Spring rolls fresh and flavorful. Soups were large and tasty, if not strikingly unusual. Service was fast and pleasant. Atmosphere tended towards florescent lights with a tv on the wall showing some version of Candid Camera. Still a fine choice with young kids and the prices are reasonable. 

Certainly no worse than anything else on the street and better than some, no doubt."}
{"text":"Best Pho! Yes, my friends; the broth master is clearly in residence here! Enjoy!"}
{"text":"Consistently Delish!
Super friendly and speedy staff!
Definitely a hidden Montreal Gem!
Great Job!!!"}
{"text":"Another great bowl of soup on a cold evening.  We also had the fried cha giao and the curried vegetables.  All the food was really delicious and well prepared.

As other reviewers have said, the owners/staff are friendly and always game for a good bit of conversation.

This will continue to be a regular haunt for us on our incessant trips to Montreal."}
{"text":"This is my favorite Vietnamese restaurant! The food there is so great. I've been to many other Vietnamese restaurants but I guess it's the best. My favourite dish there is the 5-colour-rice. And soups are ALL good!"}
{"text":"1. Food: the best pho we've had, hands down, even including what's available in NY. The broth is dark with herbs and flavor, and the meat pieces are thinly sliced. No need for hoisin or sriracha. The grilled chicken over vermicelli was also one of the best I've had. Tender dark meat slices, cucumber and carrot slices. Summer rolls came with a delicious sweet peanut sauce. Main dishes priced from $8 - $12. 

2. Atmosphere: downstairs, very informal and casual. TV in the back. Families and couples.

3. Service: good, no complaints."}
{"text":"Love the Pho! I travel all over the world and try to get Pho wherever I go. This is one of the best I've had. It's on the sweet side, not overly salty like you can get in other places. A plus is this place is a clean, friendly family place. VN iced coffee pretty good too."}
{"text":"I've tried all the pho places in Chinatown because we live nearby and this place is definitely the best! We eat here almost every week! They make their pho broth from scratch so the flavours are really rich and authentic. It's really inexpensive too- probably why we go so often. Most of the meals are under ten bucks. I really like the Beef Satay Pho and the grilled pork chop meal."}
{"text":"I had the beef pho and it was absolutely delicious! The taste of the broth was epic and I will be back for more!!! Super friendly service as well! I definitely recommend!"}
{"text":"First impressions: went there for Pho, and tried duck and beef one. Mildly spicey and quite interesting. Good stuff"}
{"text":"Sehr gemütlicher kleiner laden. Tee gab es gratis zum Essen dazu. Ich hatte eine Asiatische Chicken Suppe. Dazu gab es einen Teller mit frischen Soja Sprossen, Thai Basilika und Limetten. Alles in allem sehr lecker und das für gerade mal 8 CAD. Bedienung war freundlich und das Essen kam in unter 5 Minuten. 

Meine Begleitung hatte Hähnchen mit Reis und Salat. Man sollte wissen, dass es hierzu keine Sauce gibt. Geschmeckt hat es dennoch."}
{"text":"Our family is vegetarian and the server firstly assured us that he does have vegetarian options and recommended them. We ordered and all the dishes he suggested and they were excellent!! The order came quickly as well. Very efficient service. Food 5 stars!! Service 5 stars!!"}
{"text":"Was in Montreal for my friends birthday and chose to have diner here based on the reviews. Service was okay nothing special, that could also be because we got there 45 minutes to closing time. I ordered the Basil stir fry with shrimps and rice because I wanted to try something different. Bad idea. I got 4 small pieces of Stale shrimps  that  had already gone bad and a whole bunch of vegetables. I was so disappointed! The only good thing about dinner were the emperor rolls which I loved! 1 star."}
{"text":"J'adore ce petit restaurent famillial, toujours accueillant , courtois et polie. Voit au besoin de chaque client et sont très accommodant pour faire des changements au menu. À ne pas hésiter et c'est super bon les soupes repas. Bonne appétit !!"}
{"text":"Made a last-minute pho trip because I was already in Chinatown.

Pho Saigon is situated downstairs so it is a bit hard to find. I ordered the green papaya salad and a bowl of pho and unfortunately I would have to say that the pho was not very memorable, although not bad. I thought that the papaya salad on the other hand was beautifully presented and tasted great! Would give 4 stars for that but one star off for the environment and the pho."}
{"text":"This is the best Pho in Chinatown (and I've tried them all!).  Not nearly as rushed as the other Pho places on Saint-Laurent, nor as crowded and loud.  Prices are similar and food is better!  They're the only one with seafood soup and I think the only ones that sell egg noodles (they call them yellow noodles) along with the standard rice ones.

Great spot for Pho in Montreal!"}
{"text":"My girlfriend and I were looking for a bite after some thrift shopping at Eva B, and we stumbled upon Pho Saigon Viet-Nam. We arrived around 3pm on a Saturday. The restaurant is pretty clean, although it's a little dim (it's underground). The restaurant looks like it's family run, and the service was decent. We shared a medium pho with all the toppings, and it was delicious, but there was a lot of msg. I'm sensitive to msg, so on the bus ride home, my mouth was bone dry and my tongue was numb. Not a fun experience!  

We also ordered a Che Ba Mau (3 coloured dessert made with coconut milk, grass jelly and red bean). It was a little sweeter than I'm used to, and made my throat a little itchy. 

They're pho is decent, but beware if you are sensitive to msg!"}
{"text":"I had dinner here with my mom.  My mom loves pho and she was really looking forward to having some pho in Montreal.  Unfortunately, this place did not live up to her expectations.  I had a non-pho dish, and it was just ok, in my opinion.

My mom had the Special Pho (size small) $7.50.  It had tripe, beef meatballs, rare beef and cooked beef.  She said the beef was sliced really thin and there wasn't much of it, and the broth was too sweet.  They were also stingy with the beef balls.  They cut them up and she got 2 pieces that didn't even add up to one meatball.  She said she felt that it wasn't even as good as pho in Orleans, ON (the sleepy suburb of Ottawa where she now lives).  Ouch!

I got the chicken in peanut butter sauce with crispy spinach, which comes with rice ($10.50).  I liked that this dish came with vegetables.  It had cauliflower, broccoli, zucchini, green beans, bell peppers, carrots, onions and bok choy.  The peanut sauce was thick and rich.  The chicken was tender and flavourful.  The veggies were fresh and tasty.  Unfortunately, the fried spinach was so oily/greasy and tasted of old oil.  I had one leaf and left the rest.  The rice was good.

Service was friendly and attentive.  The restaurant is in the basement and decor is minimal.

The people running the place seem nice.  Maybe other dishes are better."}
{"text":"We came in here based on the stellar Yelp reviews and high star rating. 

The Pho was amazing. Spring rolls, too. It's been a long time since I've tasted a bowl so good. 

Service is a bit... spotty, but in a weird way, the order mixup we experienced seemed to add to the charm of the place. 

The bottom line: I'll be back here the second I return to Montreal."}
{"text":"Good flavorful noodles. The salad was very flavorful too with a sweet dressing on the slaw. I got the #43. Very crispy imperial rolls too. I told the male server I was mildly allergic to shrimp and the moment I tasted the dipping sauce, I could taste shrimp and was concerned because I didn't have my epipens on me but that's my fault. I was the only one in there and the male server would not come over to me despite having an empty dish and drinking a whole pot of tea by myself. He told me that I did not leave a big enough tip of $2 on an $9.75 bill, flustered and enraged, I gave him a handful of change of around $3"}
{"text":"Came here for authentic Phô and authentic it was. One of the best phô ever tasted. Don't pay attention to the decor, or lack of. It's your typical outdated phô joint but the authentic phô makes up for it."}
{"text":"Tasty food, one of the best spring rolls In Montreal.
The phos are a bit salty to my taste. Price on the menu include taxes."}
{"text":"Really really good pho. We were craving pho while visiting Montreal and came here. It's right on the main strip, one flight below street level. The place is spacious and clean. The sauce bottles weren't dripping from usage. I had #11 rare beef and brisket; the small size was good for me. The beef was fresh and sliced thin. The noodles were perfectly done and the accoutrements were so fresh. Now the broth - flavorful and clean, really outstanding. I highly recommend this restaurant."}
{"text":"Hit the spot on a rainy day. Got the duck noodle which tasted fresh.  The kids enjoyed the pho while the hubby got the sweet and sour soup. It's a bit too sweet for my taste."}
{"text":"Great spot good soup and beef dishes. Extremely fast service. The veggies in the soup very fresh and tasty. Standard decor but great eats. The don't serve alcoholic beverages here.  Tea, soda. Still worth the grub for sure. Big food portions too!"}
{"text":"Really yummy pho -- small is really small so get the medium. The soup was so umami I almost finished but was too full. Fried spring roll wasn't impressive -- tasted more like a Chinese fast food spring roll. Vietnamese coffee was good but disappointed they don't let the coffee drip in front of you. Will definitely go back!"}
{"text":"I would say the special Pho was ok, the broth was  well seasoned, the meat was tender, not bad but not that impressive either. 
The Bun Bo Hue was not as delicious, I personally find 'Mam ruoc' overpowered the broth so you couldn't taste the flavor released from the bones of the beef (if they do make the stock using this method). 
Overall, it was enough to satisfy my tummy, considered this is the first Vietnamese Pho restaurant I've been to and I ordered the small size too!"}
{"text":"Best pho I've ever had, and I eat a lot of pho. It's all about the quality of the broth, and this place has it. Don't let the semi-hidden basement location put you off, those are usually the best places anyway."}
{"text":"It's not bad, but it's not exactly great. I would come back if I was in the area though. 

I tried the grilled chicken pho, I feel like the broth could have more taste to it."}
{"text":"Being from Vancouver I always found the pho in Montreal expensive and not filling. This place is fair for the quantity (biggest pho dat biet) compared to other places and the broth is unique and full of flavor.  

I'd pass on the Imperial roll and try something else.  Too greasy and uninteresting inside.

Very friendly family place!"}
{"text":"When my wife and I came to Montreal for Osheaga 2013, she took an afternoon shopping and I went to Chinatown for Pho.  I did not come here, but instead crowded into another Pho place where you had squeeze between lines of other customers at family-style tables.  This time, (September 2014) the wife joined me and we had little gremlins in tow so the prospect of waiting to find a seat for all of us sent us here.  We arrived for an early lunch and were seated quickly.

Know that Pho Saigon is located below strew level, and the steps to reach it are narrow and steep.  Take them slow and easy, especially in the winter.

The restaurant is clean and neatly appointed.  It features very simple and tasteful decor, and at the time it was not too cluttered. There's a flatscreen TV on the wall, which we could pretty much care less about. Since we were there before the lunch crowd, the service was very quick.  One of my gremlins loves Pho Ga, the other is more into noodles, so that's what they ordered.  My wife and I had Pho Bo Vien (if I remember correctly).

Here's the thing, the food was good, no doubt.  Hot, fresh, and tasty.  However (and you knew this was coming), on this particular day, and with our Pho, it was not transcendent. If you're a Pho-lover, then you know it's all about transcendence -- the full umami mouth feel, the savoriness of the broth, the distinctive clash of meat, noodle, and vegetable textures, all punctuated by the sting of the lime, peppers, and sriracha. Sadly, we did not feel that the Pho we had (on this day) possessed that transcendence.  It was tasty.  We enjoyed it, but did not feel compelled to drain the bowls as we have at other places.

But please, you must try it for yourself.  Palates vary, and it's quite possible we arrived too early and the broth just hadn't \"hit it\" yet.  Also know, that as the lunch service gets busier, service slows down, as can be expected.

Great prices -- a family of four for $35 is on of the best values you'll get in Montreal.

Oh and before I forget, there's no booze.

We'll be sure to try it again and edit the review if necessary."}
{"text":"Honestly I prefer PHO BAC 97 down the street.  This is also very good pho, the interior/downstairs not as nice as 97.  Plus there is a whole area for their kids/family; looks like a recreation room (messy, ugly).  Not uncommon to see this in a Vietnamese restaurant, might be nice to have your family around but it looks terrible as a decor, plus most little kids are really annoying, unless they are your own and you have to love them!  I like the grilled chicken soup, nice variation on the chicken theme.  Fast, friendly staff.  Would return."}
{"text":"I was never a big fan of pho, but I really like this place. $10 gets you a big bowl of pho topped with beef. Unlike other phos, the soup in this place actually has a flavor. Also, the hot sauce they provided on the table does not taste sour at all."}
{"text":"Maybe it was our mistake for not getting the Pho or maybe it was because the B-Team was in the kitchen that night - but about the only good thing at our visit was the service.

The food was remarkably flavorless, which for a fresh cuisine like Vietnamese was a first for me. The shrimp that appeared in a number of our dishes was soggy and flavorless, reminiscent of the too-cheap frozen variety. The shredded pork was dry, gritty and tasted off. Our food was only occasionally punctuated by the fresh taste of basil or mint - but otherwise was just not good.

The service, however, was excellent. Our waiter was cheerful, efficient, and welcoming. He switched right to English when he heard my girlfriend and I trying to work our dubious French. 

I have to wonder if something was off that night in the kitchen, especially given the other reviews and an experience like this in a city known for its excellent Vietnamese cuisine."}
{"text":"Great place. Easy to find. The pho isn't the best I've had,but it's not bad especially at the price. The papaya salad was great. Service was great. Only complaint is there wasn't as much meat as I was accustomed to. Number 9 and 11 were the best options."}
{"text":"Humble, friendly, fresh-faced Pho on lower St Laurent, totally willing to switch up spicy soup options to make them vegetarian for me, careful to warn me that the broth would still be chicken. The resulting soup was light, spicy, not oily, or too spicy, and amazingly aromatic. For $8!

The decor is simple. The ceiling and the storage area are both a tiny bit unfortunate and on a rainy day so is the basement smell, but the soup! the soup! Curative for sure."}
{"text":"Not much to say:

-The place is hard to find, in the basement, with a sketchy decor and front door
-The service was quick and nice
-The prices are low, the amounts are big
-The food is so, SO yum

Get the Egg Rolls
Get the chicken soup with vegetable"}
{"text":"Pho...kin savory. 

Stick pork tendon, tripe, and beef in pho....stick grilled porkchop, egg, rice and pulled pork on my plate....dayum good.

all the servers are so affable.

All vietnamese fams be eatin up in hea.

Clean and organized resto.

Zero negatives.....zeeeerrrroooooo"}
{"text":"3.5/5, +.5 for service

To lay it all open, this place is definitely worth a try. There are several Vietnamese places to try in Montreal's Chinatown, but this place stood off due to the reviews and the fact that the menu is quite diverse.

You have to walk down a set of stairs to reach the restaurant entrance, and there is no elevator so if you need accessibility assistance...you may be out of luck. I took away half a star for that, though I do understand the constraints of opening restaurants in the downtown core.

When my family and I arrived at around 11:30am on a Sunday, the restaurant was quite empty, though by the time we left it was about 3/4 full. Either way, there's definitely business here and I can see why considering the food quality.

I didn't know what to order at first, but after looking at the diverse options here, I went with the banh canh cua (thick noodles in crab soup), as not many Vietnamese places have that (or let alone, do it properly). To share with my family, I added a beef rice paper roll, since I wanted to try something a little different from spring rolls.

The banh canh cua came first, and I was glad with the fact they use real Vietnamese transparent noodles, instead of cheap udon that I've had in other Vietnamese restaurants. The noodles were a little soggy for my liking, as I'm used to the thick noodles being a bit chewy, however it still tasted very good. The broth was also quite flavourful, but also not very MSGy as I didn't have the thirsty feel after.

The rice paper roll was actually a do it yourself project, and was quite a unique experience. The server will teach you how to dip the rice paper into the warm water, then put the meat, vermicelli, veggies, and finally wrap it into a roll. We messed up a few times and ended up making tacos and burritos, but eventually we got the hang of it. Either way, the beef paper rolls tasted very good, and definitely something I would order again.

My parents were all satisfied with their noodle soups, although the satay beef noodle soup is actually very spicy...thought I'd give you a heads up.

Service was excellent, and the employees I found were very hardworking, as there were only two people running the shop during the time I was there. I'm sure they have more people, but they were very efficient."}
{"text":"Been here twice and both times I was content and satisfied. I had Pho Bo the first time and Bun with Grilled Pork the second time. Authentic Vietnamese classic is what u get, not modified or westernised. 
Broth of the Pho soup was great, light, aromatic and flavourful. Comes in 3 different sizes which is great for small or big eater. The bun salad was fantastic too, paid an additional $1 for adding spring rolls in the bun salad. 
Service was humble and pleasant since the place is run by a family. I saw a little girl and her brother prepping the skin for the spring rolls at a table near the cashier/kitchen doors, reminds me of food vendors in most Southeast Asian hawkers. 
Ambience is very homey, nothing fancy, feels like an Asian family's home. It's clean and basic. Location of the restaurant is downstairs, it doesn't look attractive from the outside and sometimes it looks a bit deserted but once u r inside, u will see tables hidden in the corner row of tables and u will see all the Asians regulars eating their noodles. 
Price is very affordable for the quality you get. 
Will definitely be back if I visit Montreal again."}
{"text":"My friends and I call this restaurant \"the basement\". We always go eat pho there or to another one down the street. It's basically our chilling spot since we all love pho so much! The only thing they put on TV is the Just for Laughs pranks, which gets a bit repetitive. It takes some time until the food comes, but that doesn't make the food less good."}
{"text":"A small underground pho place in Chinatown montreal. 
The place was pretty clean, the service was good. The waiter was very friendly. 


Very good pho. Love the satay pho, the broth is very flavourful. It's not the regular pho you get at other places it has unique taste to it. Definitely recommended.

The banh xeo is really good. One of the best I've tasted. It is crispy on the outside yet soft. Pairs perfectly with the fish sauce. Comes with some vegetables that you use to wrap the view crepe with"}
{"text":"Clean, tidy and spacious place. 
They have a large menu. So many to choose from. I had a bowl of satay beef. I like the spicy taste which comes from special chopped chili sauce. This keeps the broth clear and flavorful. You can choose rice noodle or egg noodle in your soup. I think egg noodle is more Chinese style to me. If you want to try a new combination, egg noodle is more chewy."}
{"text":"A solid four stars for us on a cold, windy and snowy evening.  The pho with beef was good and the broth was nice although a bit heavier than we are used to.  The spring roll was really really good.. almost ordered some to go on the way out!   Rice meal #50 had all the meats except chicken, which interestingly they don't offer with any other meats as a combo, and I finished it all."}
{"text":"It's downstairs. Yes, decor is spartan, but staff is so friendly. My wife and I had beef and chicken pho, respectively, and shrimp+veggie rolls (not fried). Pho was not overly salty :-) There is a secret spicy sauce you have to ask for. C'est en bas. Il n'y a pas de décorations, mais les serveurs sont amicaux. Il y a une sauce piquant secrète (no le Siracha, a table: un autre; demandez-le.)"}
{"text":"Probably the best phö spot in Montreal, but don't tell anyone. Okay, maybe tell one or two people, and then start a super secret phö gang with them. And then, as your gang grows stronger, invite a few more people to join. Eventually, your gang will be so powerful and this restaurant will be so popular that they'll need to open a second location... but don't tell anyone about that one."}
{"text":"The only place that serve spicy vietnamese soup all week. The decor is so so but the food and service are quite good."}
{"text":"I have had many a pho bowls before, but this one was the real deal.  Located in Chinatown in somewhat of a seedy looking storefront is this amazing restaurant with spectacular food and even better service. I loved it and everything was very authentic. And even better, my bowl was only $10. And it was more than enough food too.  Montreal cannot be the most affordable place to eat, but this place helps a lot."}
{"text":"Yuppp totally recommending their DIY Vietnamese springrolls dish! Comes in different flavors and always make you feel full: physically and psychologically! So yeah, you need some culinary skills (haha not really) to wrap the spring rolls that you want. I experimented quite a while before getting a hold of the technique. I am not amazed by their pho though, but price is really good for the portion."}
{"text":"3 star is the max I can give.... Maybe because I'm here at before 5pm.  Low time for most restaurant.... I'm the only one in there
1st off, it is hard to find.   Just a small Street level front door to a basement restaurant.  I passed it right by the first time and have to walk back.  The basement door is closed, with only a French Open sign indicating it is in fact open.  I've to ask the waiter to confirm, since he is the only one in the restaurant behind the closed door.
Food:
Order a shrimp wrap (or roll however you call them), beef and brisket pho, with a cold Vietnamese coffee.  Shrimp roll is ok.  Pho.... Noodle is the cheaper dry noodle, prefer the fresh ones.  Soup is not very hot, and taste nothing spectacular.  Coffee.... Cheap on the coffee Bean.  Although I know it isn't instant coffee, but it almost taste like it.
And yes the large screen tv helps with the wait for food.
Overall considering the rating, I'm disappointed.  If I can, I would rate it 2.5.  too bad I don't have time this visit, I'm told that the ones uptown are better."}
{"text":"Highly recommend! My first time to try Pho is here, and before eating I haven't expected too much, but who knows, i love it right away! So amazing! The broth is light but flavorful, all is good, I drink it up every time... the grilled chicken, beef, pork are also quite great. I come here regularly now. Pho is one my favorite food here!"}
{"text":"Walked into the place very hungry so everything should taste great. Not so fast. First it was a display of poor hygiene by waiter who had to rub his inner nose with his fingers. Next up the bathroom, the dirtiest, nastiest bathroom in north america. Food itself was nothing spectacular. Quite the ordinary fare. In short it fits well within the china town establishments, not necessarily targeted toward western customers."}
{"text":"Want to give this 4.5
This little restaurant is kind of easy to miss. As I walked past here twice looking for the restaurant from across the street. 
Their sign is blocked by either a tree or lamp post- I don't remember. 

When we spotted it we quickly crossed and went right in. Watch out for the steep short steps down. And make your way into this small single front door that once perhaps pristine white. When we walked in, we began to question what made this place rated so highly. This little restaurant that sat at the bottom of the stairs. It's not anything fancy inside - it's like any over used and rarely updated Asian restaurant. Although they do have a tv there to keep you visually entertained while you wait for your order to arrive.

Then you eat the food. 
You MUST try the Pho!
Wow! Hello broth! Perhaps the best I've had in a while! Or ever ?! Yeah that good. i ordered number 13 small. Although I didn't feel completely full upon finishing I did after finishing half the three bean with coconut milk dessert drink. 

Everything was so good and I left very happy. 

I'm unsure if this restaurant is wheelchair accessible."}
{"text":"One of the best Satay Pho i've had ! 

Came here multiple times during my visit in Montreal. I absolutely love their Satay Pho. Their pho broth is rich and flavourful. Doesn't seem to be lacking taste. Really filling. Extremely recommended. 

Service is good, servers are extremely friendly."}
{"text":"Everything we ordered here are good!  We ordered Pho, summer rolls, spring rolls and banh, so good!  Pho noodles in 3 sizes, small, medium and large.  The price is very reasonable as well!!!  Highly recommended!"}
{"text":"Came here around 3pm on a weekend with my boyfriend. 

We both got a medium bowl of pho with everything in it (I think it's item number 9). It was my first time eating pho and I found it quite good. I thought the portion was very large, but my boyfriend, a pho connoisseur, said that they're on the smaller side. 

The noodles were very good and flavourful, but the flip side is that the broth was way too intense for me. There was a lot of MSG. The price was very good (10$ after tax). 

The service was also prompt and respectful. 

We also got a 3 coloured drink as a dessert. It has coconut milk, a green thing and red beans. Sorry, I can't remember what the green thing was. It was very good! I would recommend that! 

I don't think I'll go back, but it's definitely worth a try if you're craving pho!"}
{"text":"Great spring rolls and pho! We had the shrimp and chicken roll plus the pork roll.  We had the special pho and the beef balls and rare beef pho. Everything was quite tasty. Good place to stop by if your in the hood."}
{"text":"This hidden gem in the Chinatown strip is not to be overlooked. Amazing homemade meals with friendly staff. A lot of authentic style viet dishes you dont see everyday."}
{"text":"I would like to relocate this place to a few minutes near my house, please??

First-the Chinatown area in Montreal is awesome. Lots of restaurants, dumpling spots and shops to purchase Chinese herbs. But there are also authentic Vietnamese restaurants in the neighborhood and I couldn't wait to give one of them a visit. There is one Vietnamese place fairly close to Saratoga....which is awesome.....but the owners are actually from Thailand. I've been craving really good Vietnamese for a long time, and I had some yesterday.

We kept it simple with shrimp rolls, Pho and wonton noodle soup. Everything was so fresh, served piping hot and the flavors really popped. The soups are offered in different sizes: small, medium and extra large. The medium size is rather gigantic and more than generous portion-wise. 

The pot of tea was also perfect. The staff was awesome. When we arrived, it was just before 11:30am. It started to get quite busy after noon..so we timed it just right."}
{"text":"Excellent authentic food that also comes along with excellent service. I don't know for a fact but it seems like it's a family run place. The service was amazing. Portions were large and price was very reasonable. I will recommend this place to all my friends and come again in the future! I don't know how people had a hard time finding this place?? I found it with any problem and it was my first time to Chinatown in Montreal. Big sign outside... It's kinda hard to miss."}
{"text":"We are on a sampling spree! We came here for the summer rolls and the spring rolls. They were both amazing and full of flavor. Others around had Pho so I'm sure the other food is equally amazing:)"}
