{"text":"great pho. I always go with my boyfriend who is Laotian. He says after his grandma, its the best pho he has had. Only drawback is the location. Its in a dilapidated strip mall."}
{"text":"Had the lao larb. Good as it should be. Nothing crazy good or bad, just right. The peanut sauce for the fresh rolls was warm and very smooth, very good. This place gets a low 2 stars due to the pathetic service.  My server took my order, delivered my drink, then went outside to smoke. He brought me my fresh rolls, then left and drove off. Okay....a woman brought my main meal (larb). I waited, and waited, and waited for a water refill, to no avail. (I was the only person in the place the entire time I was there.)  Anyway...it's okay food, I think Truc next door is MUCH better and MUCH better service (and prices).  Go there where they appreciate your business."}
{"text":"This is some good stuff, if you're in the mood for something different this is the place to come.  They offer traditional Vietnamese along with other Asian fare to mix it up a bit.  The waiter was really nice and patient with us when we asked what everything was and how it was prepared.    The crab rolls were really good, as was the duck soup with noodles.  Those were some of the safer items on the menu.  There were a few things on there that even had me a little concerned.  If you are braver that I am then be my guest, but other than that it was a very nice experience."}
{"text":"Great traditional lao beef lap.  I requested it to not be cooked in the traditional style.   Was just like my mom's home made.   Lao sausages was good could use more herbs and Lemon grass. Really authentic lao food."}
{"text":"Great Lao food! We got the Lao sausage, papaya salad Lao style, pho, and Lao lap! All were great! I especially liked the Lao lap. Definitely recommend it if you want to try Lao food. They also had standard vietnamese fare."}
{"text":"Worst pho I've ever had. Service is below average. Bubble tea also terrible, the worst I've had. And like the previous yelper wrote, this is not a Vietnamese restaurant.   Go get pho or bubble tea somewhere else."}
{"text":"Great noodle soup.  Dont really have a lot of selections to choose from but great for lunch. Don't really like the fact that they chopped meatballs in to pieces. A lot of side vedge and massive amount of noodles. Mid size is $8 large is $9.50 I never finish the large side."}
{"text":"Get the nam sot lao, it's super solid. Chicken wings too!  I was also pretty impressed with their curry."}
{"text":"Assuming you have made it past the potholed parking lot outside in order to figure out that there are operating businesses in this mall that is surprisingly not derelict, there are actually multiple dining choices (four, I think).  We had originally intended to pick up a banh mi at Le's, but as they were on a month-long holiday, we decided to go elsewhere.  Since my wife is almost always on the lookout for a banh mi, and it seems that no one carries them, we gave it a try here.  Interestingly enough, we were able to get one.  I stress the \"one\", because that was the exact number they had in stock.  Even though it was not anything spectacular, it was quite decent (and amazingly affordable, even more so than Le's), but they apparently only keep enough ingredients for a single sandwich at a time.  So we also had some pho.  Again not spectacular, but quite ample - and we did not even have the large.  I would advise against using the peppers, however (or at least being careful with them), since I about took out not only my taste buds, but my fingers and my eyes when I rubbed them a few hours later.  Definitely some spice here.  Perhaps the most interesting thing in this place is the plant that seemingly grows from one pot, all around the room.  It may not be the most sanitary thing, but it almost gives you the feel of being in the jungles of Asia (I would imagine).  Except you are in a storefront restaurant, and it is a single plant."}
{"text":"So, I'm giving this place 3 stars because of the sucky service and also the place looks very unkept BUT the food, was delicious! I placed a to go order because they were about to close, the lady answers the phone with an attitude I asked if I could place a to go order and she said with an attitude \"Yeah\". The whole time while I'm placing an order she has an attitude.. I get there to pick up my food and she still has an attitude. I walk in and she is still sitting there watching TV. I know she knows I was there because she looked at me. Overall, I would go again for the food."}
{"text":"This is not really a Vietnamese restaurant.  Do not get fooled by the name.  This is a Laos restaurant.   I have eaten here several times and I have not eaten a Vietnamese dish ever.   The Vietnamese food maybe good but I can not comment on that.   Laos is very close to Thailand so the food has a more Thai flavor.   The Laos salad is very flavorful but too light.  You still feel hungry afterwards.  The egg rolls are great.  The best dish here in my opinion is the Pad Thai.  This is really the only good Pad  Thai in Charlotte.  It has the perfect combination of sour, salt and sweet just right.  Most Thai restaurants mess up this combination with too much sweet or salt.  Some other recommended dishes are seafood, chicken, or beef in chilles.  They put fresh jalapenos and stir fry this dish.  A friend of mine ordered a beef  with vegetable dish which was also very flavorful.    Most dishes can be ordered vegetarian as well."}
{"text":"Inside a Asian Corner Mall. The area look sketchy but don't be afraid to walk in. Good food!"}
{"text":"Food tasted great! My favorite was the broth was made from real beef bone stock. The prices were great! Unlike other places in Charlotte, the prices here actually resembled rates of larger more cosmopolitan cities. This place actually gave you real food in large portions for less money than other places in town.   I'm greatly saddened it closed...."}
