{"text":"In a Vietnamese pho restaurant, the key things are to get quantity and quality at a good price. At Pho An, you get one of those - quality.  Undeniably, the food is better than the average pho restaurant. It looks fresher and it tastes better. The egg quiche looks like it was recently made and not from three days ago. The beef briskets in pho soup are nice cuts, and so on.  The quantity disappoints and the price is heftier than the average pho restaurant.   A rice dish with pork chop is close to $12, and leaves one hungry. Specialty drinks start at $5.  Based on food alone, this place rates 4 or 5 stars, but value wise it gets knocked down for quantity and price.  Overall, if you like pho, and money isn't a consideration, this is the place you want to eat at."}
{"text":"Good pho soup. My only and most major problem is they mixed hot sauce in the oyster sauce or whatever that thick brown sauce is they always give with it. And that's my fav part and since I can't eat spicy I was rather annoyed when we brought our take out home."}
{"text":"I have never given such a low rating to any restaurant but this is all they deserved. The food was far below average and the service was mediocre. in fact, I wonder, what service? We were like ghosts in the restaurant. The servers couldn't see us and we almost had to trip them to capture some attention."}
{"text":"I was so excited when I saw this place open up..not a lot of ethnic food in Aurora...or I should say not a lot of GOOD ethnic places in Aurora. As someone who frequents pho places often, I am not impressed with this place. Service is very slow, prices are a little bit on the high side, the quality of food is just ok and the portions are small. I would come back but only because there no other choices if I want Vietnamese food. Having said that, I would drive 30 min to Scarborough if I really wanted good Vietnamese pho."}
{"text":"I have been here at least 10 times, always ordering the same thing and hoping I get better quality.  I always order rare beef but it comes out well done 50% of the time.  Why is this so hard when the restaurant has PHO in its name? Next, why do I have to count the pieces of meat that I get?  Today I got 6, another day I got 4 in a LARGE.  The meatballs are tiny and even those I get maybe 8 small meat balls.  If this was in Markham, they would be out of business.   The broth tastes very watered down and is lacking a lot of the flavour you would come to expect.  When I complain about the lack of meat, sometimes I get more meat on a side dish.  I mean that's all fine and dandy, but it should come like that to start with.  I'm not asking for a pound of meat, just what normal Pho meat would have. I was so happy when this place first opened because its so close.  But me and my girlfriend would rather drive up to Pho Saigon in Newmarket.  The cost is roughly the same, but the broth is better, more meat never any issues. I hope Pho An re-evaluates their Pho.  Too many people complain of lack of meat, that's gotta be somewhat true."}
{"text":"This is hands down the best pho store i've been to and i have gone to many as a child up until now. The interior of the place is well designed and warm I love it. My favourite dish would have to be the chicken fried rice, the chicken is well cooked and seasoned. The portions are just right for one person too. The broth used for the pho is also perfect, the noodles aren't too soft and not too hard, the beef is delicious. The service is great and environment is always kept clean so i highly recommend this place to anyone who is craving high quality pho in Aurora."}
{"text":"Had the rare beef and beef ball pho and the shrimp paste on sugar cane. Pho broth was clear and had flavour and depth, meat was high quality with no chewy gristle, noodles were plentiful and had bounce, and the herbs and bean sprouts were fresh. Shrimp appetizer came out freshly made and piping hot, shrimp was fresh and didn't have the stink common with old seafood and it wasn't too greasy.  Price reflects quality of food. All in all, the meal was excellent and the best part was I didn't die of thirst from msg overload. Let's hope they continue to keep up the same standard and quality in their food. I'll be back."}
{"text":"Never ever want to come back again! I went there few times and it was good.  Food are good service is good.  But today when I go with my friend I found the service is really bad! Both waitress just like don't want to work at all! When I ask for small bowl for sharing food she just like don't get what I said. She act like she's not listening, she's dreaming or she's not understanding!  The worse part is when we ask for bill they ask us to go to the counter to pay!  How lazy they are that they don't even want to walk over with the bill!?!?  If they are that tired or lazy why don't they just not open?! So disappointed!!! My friend even said she will not go back again which this is the first time she's going!"}
{"text":"Best Pho ever.  I mean the food is unbeatable.  Plus, the decor is super nice, what's not to like!  Everything is tasty, fresh and delicious !"}
{"text":"Soup is yummy, vermicelli bowl yummy, fairly priced. The spring rolls were wrapped messy but good flavour. Would definitely go back!"}
{"text":"This is the third pho restaurant to open up around the area. I enjoyed my stay here. The renovations were done nicely and gave me the Thai villa type of feeling. The restaurant was clean and just the way I like. It was cozy and very small.  Service was polite and friendly, but quite slow. Had to ask for the bill 3 times before the little girl remembered what we asked for. I don't blame her because she looked young, but at least train her more so she can keep up with the pace. For the record, that night the restaurant wasn't full, so there shouldn't have been any problems.   The pho is not bad here bc they serve the thin noodles. The soup is pretty good and is very similar to the other ones around the area. The pricing, however, was a little bit much. Coming from Markham/Scarborough, a small pho bowl cost about $5.75-6.00. A small bowl here is nearly $7 and a large is almost $8. XL is around $10 I believe. Price to quantity, I wasn't impressed. But the quality was there..  I will be visiting more to get a better sense of pricing vs quality/quantity. 3 stars for now! :)"}
{"text":"Yaaaay Aurora has a great Pho place now! I've been to eat in and take out.  The usual was ordered a large bowl of rare beef pho. The broth is balanced with just enough salt/mild seasoning and rich beef flavour. They don't skimp on the noodles or beef either. The spring rolls are delicious. I haven't tried anything else but those items are good.  The prices are in keeping with local pho places in New Market. Around the $10 mark for a small bowl.   The decor is simple and what I expect from a casual pho place. The owners and staff are very nice and service is quick.   I'm giving 4/5 stars based on a good food experience overall. I'll have to try other items in the future."}
{"text":"Alas, my husband and I have found our go-to Pho spot in the Newmarket/ Aurora area! After trying ALL seven pho restaurants near our new house, my husband happened to be passing by this plaza and say Pho An. Not only is the decor very clean and welcoming (very modern than the typical Pho restaurant), the food and service is great! The high chairs are clean and they always bring one to the table for our little guy.   If you've read any of my other reviews, you will know that we always order the basic dishes first. You'll also know that when we go to pho restaurants we look at three different food items: the pho, the rolls and the fruit shakes.   As usual, my husband ordered the rare beef Pho. He has made it a habit to order half noodles because they tend to put a lot (for our preference) in the Large and X-Large. I get the beef ball and rare beef pho in a small size with the regular amount of noodles. That's usually perfect for me to share with my toddler, especially when I get a small side of rice in a bowl. Their broth is delicious. Not too sweet and you can't taste the MSG (if there is any), unlike other pho places in Newmarket/ Aurora where the smell and taste of sugar and MSG is very strong. I'm not sure what kind of rare beef they are using but it is so soft and tender. It melts in your mouth and isn't stringy or chewy. I haven't been to many pho places with beef like this. They always put in 3-4 beef balls cut in half, which is decent. The bean sprouts/ Basil  are always fresh and they have the small red chilli peppers that my husband loves. I love their shrimp rolls- they're super juicy and there's no pork in it, which is my preference. I'm not a huge fan of their deep fried rolls because the stuffing is soft and mostly carrots but it's still tasty- just not what I'm used to from other places.   Service-wise, they've been good and then other days they've been excellent. When I say \"good\" I mean they greet us, seat us and bring us waters with menus right away. This place is also always packed but there is always enough seating during the busy lunch or dinner rush - I chalk this up to their service being so fast! When I say \"excellent\" I mean that they bring a high chair, a water with a straw for my little one, scissors to cut the noodles and a small bowl with a small spoon. Whichever waiter brought all that stuff was ON TOP OF IT  I didn't even have to ask and was super impressed. This has happened one out of the four times we have eaten here but it definitely made a lasting impression on me.   This is our go-to spot so we will definitely be back again.. and again and again!"}
{"text":"Food was good, service was friendly and attentive.  Nice clean interior.  I would recommend and will be coming back."}
{"text":"This place becomes my regular eatery when I am in Aurora now. Delicious broth though price on higher side. Friendly service. They made their portions bigger than before so worth it."}
{"text":"Decided to give this place a try again since our original lunch plan fell through.  The decor is still pleasantly enjoyable and the room never gets overly loud or noisy. However, my major gripe is that the consistency is unpredictable here. Not only was the staff distracted or absent minded but we also had very little meat this time in both the large pho and the Bun Bo Hue, one of which arrived much later than the other.  My friend's hot Vietnamese  coffee with condensed milk arrived in a mug, which is rather surprising as this is the only pho establishment I know of that would charge almost $5 for coffee served in a mug. I could swear that I heard a microwave ding just before the server brought out the instant-flavoured drink. Overall was sorely disappointed this time."}
{"text":"This restaurant is great, not only for the flavourful food, but also for the great service, great parking and timely takeout. Whether you're eating in or out, the food is always delicious. The soups are flavourful and fresh and I've had the rolls which also are tasty but my favourite is their chicken pho is outstanding. The restaurant is clean and the decor is minimal but effective. It's definitely worth a try and the owner's are friendly and welcoming."}
{"text":"The nice thing about Aurora/Newmarket is the great coverage of Pho restaurants. However, the southeast corner of Aurora was a little thin.  But with Pho An in the 'hood, all is good.  My usual test case is a nice bowl of Rare Beef Pho.  Good quality beef, good noodles, and a nicely balanced broth made for a nice warm meal on a cold night.  The place also had the local \"Asian Seal of Approval\" by the good showing of Asian diners.  Unlike some other Vietnamese restaurants around, Pho An is more stylish inside.  The walls are fabricated out of stacked 2x4 and 2x6 planks right up to the ceiling, giving a very cool texture.  No plain walls here.  As a result, I would consider this one of the more \"upscale\" Pho restaurants.    I'm at Home Depot enough to make Pho An a regular stop since they are right next to each other.  Sure, it's an excuse,..."}
{"text":"We really like Pho An for both take-out and eat-in. The restaurant is cozy and modern.   Pros:  The food is extremely reasonable priced. Anyone who says the portions are small for the price is being a cheapo. Seriously.  Location is great for locals; ample parking in large plaza. Staff are nice and try very hard. This is a family run business which is awesome.  Lots of variety on the menu. The beef broth in the pho is YUMMY. Also love their pad thai when feeling like a super-greasy, naughty unhealthy treat! Note that most pad thai that I've tried as Vietnamese restaurants has been quite different than Thai. These are not sweet and mild like the pad thai in fast food or take-away Thai (e.g. Thai Villa) so if that's your preference, don't order it here. Their pad thai is spicy (NOT hot) and not sweet. I prefer it to Thai style noodles.  Cons:  They are not open very late, so if you have a Pho craving, satisfy it before 9pm!  Their take-out menu indicates that they are not open on Mondays. If they are now, yay! When they are busy the space feels a bit tight unless you get a booth. They keep the spoons and chopsticks in containers on the tables. This is done in a lot of Asian restaurants, but I don't like that the cutlery can be handled by anyone who sat at the table previously. To get around this, I ask for disposable chopsticks and a spoon (the ones they provide with takeout orders) and they are happy to provide them.  We'll keep going for our Pho fix here."}
{"text":"After our morning booster juice we noticed a pho place next door and decided to go in for a quick lunch. We ordered an extra large pho. We were disappointed that they didn't have fresh noodles as our usual pho place typically does, so we ended up having the regular dried stick noodles. The good news is that there was A LOT of meat on the pho.   The spring rolls were the biggest disappointment. I would avoid ordering these. They were filled with 90% carrot and no meat. Typically authentic Vietnamese spring rolls include meat, taro, clear noodles and a bit of carrots.   Lastly we ordered a pork and sausage vermicelli salad. The pork was well marinated but unfortunately not cut up make it a little difficult to eat.  Probably will not return as there are better options within 10 minutes"}
{"text":"Seems like Pho An is a new Pho restaurant that was recently opened in Aurora, which is great because we no longer have to drive all the way up to New Market for good Pho.   Environment: Honestly I was quite surprised when I first walked into the restaurant because the interior is beautiful! The renovation truly reminds me of a fancy, upscale restaurant. It was bright and modern, really clean, and really well decorated.  The restaurant isn't very big, so I suggest coming in a group of 4 or fewer. They could move the tables around to piece them together to accommodate a larger group however. There are comfy sofa seats on both sides of the wall.   Food: Between the 2 of us, we ordered an side XL House Special Pho and Make Your Own Rice Roll to share. It turned out to be wayyyyy too much food.  The size XL was served in a gigantic bowl and it came with some bean sprouts. They brought us 2 small bowls for us to grab the noodles. The size of the XL bowl is comparable to similar Pho restaurants that I've been to, but I find that they were lacking in amount of meats in the bowl. There were still variety (raw beef, beef ball, beef tendon, beef tripe) but there were a lot of each of them. The flavour of the soup   For the Make Your Own Rice Roll we actually weren't expecting it to be actually DIY, so we were totally surprised when they served us the food. Even though the food tasted awesome (love the extra deep fried spring roll on the side), I didn't quite enjoy the dish because I absolutely sucked at making the rolls. I'm just not good at arts and crafts and since the rice paper gets sticky after it's wet, it was painful to make my food. It would be a fun dish to order if you have kids over though. Overall, the food was pretty worth it as the bill only came up to around $30 (after tax, tips) and we got to take some home.  Services: Service was quite slow when I was there for Saturday lunch. It seems like this is a family-run restaurant and at times it feels like they are short staffed. They came to take our orders and brought out our food in a timely manner, but when it came to adding tea and asking for the bill, it was very difficult to get their attention. But yeah, don't expect them to come check up on how you're doing once they finished serving you the food."}
{"text":"Wanted pho after work one day and decided to give this place a try since it's the closest vietnamese restaurant near me. The decor in the restaurant is fairly nice and clean.  I ordered the house special noodles, which has some beef slices, beef balls, and beef tripes.  The broth was good, flavourful and not too salty.  The size was a bit on the small side, but still enough for me.  I would come back in the future, if I didn't want to drive a bit further."}
{"text":"Came here before and soup was meh but today the pho soup was so tasty.  Owner said that they changed recipe.  The portion size was generous.  Will be coming here more often now!"}
{"text":"I like having Pho available nearby.  This is a new restaurant that caught my eye and I was anticipating.  It is a little pricier than if you're South of Elgin Mills but at the same time the 'Small' bowl of Pho was huge.  The fresh rolls were pretty big and fresh as well.    For the middle of week - lunchtime - Pho An was pretty packed with people.  The staff are a bit short handed, there's an Ad looking for servers on the entrance and that is actually enough to forgive any slowness in service. The food is flavorful, their menu includes the usual noodle soups as well as non-noodle Vietnamese cuisine.    They have a decent tea selection.  I need to go back to taste but I was impressed by the number of items on the menu alone.  I will be back."}
{"text":"I'd rather drive the extra time to Richmond hill. I've had it 3 times now  1st time was pretty decent  2 time was ok  3 time was disgusting had no flavour and was lacking any spices  Have ordered well done beef soup and the beef with crispy egg noodle ... even if I'm craving I won't be back. I'll drive the extra time to RHill or Vaughan."}
{"text":"We came here as it was the closest Pho/Asian food in our area.  Upon entering, I was very impressed at how modern and clean this restaurant is! It appears to be family run?  I ordered the bun bo hue (only comes in one size -- medium -- $9.75). The broth was very delicious. My only complaint is that there isn't much in each order...asides from the soup.. very little meat and very little noodles.   Overall, food was delicious and flavourful.. just needs a little bit more of everything in each bowl of pho!! Wouldn't mind coming back here every once in a while to fulfill my pho cravings."}
{"text":"The bun is amazing! Food is fresh and delicious. Finally we have a decent place for Vietnamese food in our area. It's been open for a month or so but we have already gone there many times."}
{"text":"The kids and I stopped here for lunch.  It was a very pleasant experience.  Busy place. They were very kind to my small kids.  The staff were very friendly and the pho was fresh and super yummy.  Plus I love the clean decor A medium pho fed the 3 of us. Very generous portions"}
{"text":"3.5 stars.   First off, I love the decor. It felt like I've enter a nice little villa in Asia. We were quickly greeted by a gentleman who led us to our booth. Service was courteous and attentive throughout our visit. Menu was very extensive with lots of delicious choices!  I know I should have ordered pho or vermicelli at a Vietnamese restaurant but I have decided on a beef pad thai. TBH, it was way too spicy for my liking, and I don't eat spicy food. The menu did not indicate that it was spicy, so I was a bit disappointed. If I knew, I would've asked for a non-spicy version. I didn't want to send it back so I gave it to my friend who seemingly enjoyed it and said it was not that spicy. Hmm. My tolerance must be extremely low.  I thoroughly enjoyed the fresh shrimp rolls, it was very fresh and tasty, the rice paper was thin (just the way I like it) and I love the ingredients that they used. The dish was paired with a hoisin sauce... maybe next time I shall ask for peanut sauce instead. l would definitely want to come back to try more items.  P.S. They are now open on Mondays :) Just throwing it out there."}
{"text":"If you're in the area and craving Vietnamese food, then this is a good place to go for a quick bite. Service is courteous and fairly quick. There's nothing special and out-of-this-world about the food but it'll do the job of satisfying those sudden urges for pho. The portions are pretty small so it's a good thing they have XL size options. I wish they would put a little more meat in though, as the small sized Pho with rare beef and beef balls only came with a few small pieces of beef and 3 marble-sized beef balls. The vermicelli was a bit disappointing and lacked flavour. On another note, the place is surprisingly clean and the interior decor is very chic! We'll definitely come back to this spot as the location is very convenient and it's a tad cheaper than other Vietnamese places in the neighbourhood. Just stick to the Pho though!"}
{"text":"Looks like a family run place, ok, but nothing spectacular. My pho had barely any meat in it, the broth had almost no taste and the fly sleepily buzzing around didn't help my appetite. The decor is good, but this place needs a little bit more of attention, dedication and good food."}
{"text":"We didn't realize how many pho restos are in Aurora/ Newmarket so we are on a mission to try all the pho restaurants in the area to find our favourite.   Pho An is a family run resto, we came here on labour day weekend and the kids are serving while the parents are cooking. Love seeing families work hard together.  Another thing I noticed is the decor. It's unlike any viet resto I've ever been to. It's modern and tasteful, definitely on point.  As for the food, it's decent. We had the bun bo hue and chicken bun. I thought the flavour of the broth was decent but not the best I've had. There were some authentic ingredients missing like the pork feet and blood jelly but I'm ok without it.  The grilled chicken was yummy.   We will have to come back here for the pho next time."}
{"text":"Went here for a quick lunch as this was the closest pho restaurant. I'm pretty sure they served me a used plate of bean sprouts toppings. The bean sprouts were brown and yellow, the mint leaves were shrivelled and the lime wedge was already used and squeezed out! That's just plain disgusting and unhygienic. When I questioned the waitress, she barely spoke English and just said the bean sprouts comes with my meal. Portions are still way too small."}
{"text":"New pho restaurant next at the Longo's plaza in Aurora.  No complaints, am happy to have a decent pho restaurant (CLEAN) in the area that I can visit once a week.  Have had the house special pho numerous times as well as their spicy bun bo hue.  Hope place stays open, clean, and continues to offer good service to customers!  Edit: updated my review. Something definitely happened to the quality after the initial grand opening.... would rather drive down to highway7 for pho now.  Everything went downhill here.... super salty, puny portions (the medium pho tai came with 2 tiny pieces of sliced raw beef!)  2/5 now."}
