{"text":"Food was delicious and came out quickly! The prices were reasonable.  The waitress was super helpful and very friendly. It's nice that you can get small, regular or large Pho.  I've only ever seen regular and large and the regular is usually more than I need! Either way, we will DEFINITELY be returning!"}
{"text":"Wishy washy, this pho place isn't consistent. Service is okay but food isn't good."}
{"text":"I am disappointed that the resturant ran out of chicken broth. Then the waitress told me when there is no chicken broth, beef broth is used instead. If I did not ask her she probably would not have told me because she took my order without informing me. This is scary for me because I do not consume beef and a lot of Pho resturants that make seafood soup will use a veggie base or chicken to accomodate individuals that do not eat beef for health or other reasons.  I have decided to take this restaurant off of my list."}
{"text":"Good pho with summer rolls. Tried the seafood bowl and it had a ton of noodles! There wasn't a lot of seafood in mine but broth is nice. I love noodles so no complaints here. Service is alright. Conveniently a grocery store, with an Asian/Hispanic bakery inside, is nearby so that's a plus"}
{"text":"Really good pho for a decent price. Had the rare beef and meatball. Also had the summer rolls with shrimp and pork. Hot tea was jasmine and it was delicious. They give you a pot for $1
Service is good and it smells so yummy in there."}
{"text":"My favorite place to get vietnamese food. Best customer service and the  never disappointed love this place."}
{"text":"I had the seafood Pho and fresh shrimp roll. I appreciated that all the seafood items on the plate were fresh, even the imitation crab. It tasted great ! I knocked off a star because I have been looking for a Pho restaurant that uses seafood broth for seafood Pho or uses yellow pepper in their broth. So far, I am still searching..."}
{"text":"It's a decent Viet restaurant. I wouldn't say it's good or bad. I had a seafood pho, but the amount of seafood that was in it was barely satisfying. I'm a seafood guy, but it came as a disappointment. I would guess that it's because I'm a New Yorker. This place isn't bad for the people who never tried pho, but for people who have had pho in NYC or in LA, it'll be a short coming."}
{"text":"I loveeeee this Vietnamese restaurant! The food and service are both great! They offer a variety of food including Pho, Bun, and Mi xao. They also have weekend specials which are my two favorite dishes. When I paid my food, the owner asked me how the food was, and he wanted to hear questions and comments to improve the restaurant since it's just opened. They were all very friendly. I would recommend this restaurant to my friends, and customers should try different food each time they visit to know which one tastes the best for them! :) 
5 stars! Woohoo! As good as it gets!!!"}
{"text":"My husband and I love this place.  Their pho is great and their chicken salad is spicy but so flavorful.  It is our go to Vietnamese restaurant"}
{"text":"The vermicelli bowl was excellent!
Very good service, the only down side is the waiting time to get your food. Besides that everything is very authentic and fresh!"}
{"text":"Pleasant fast service. Got small seafood. $8 which to me seems overpriced. Broth was yummy. Clean tables n utensils but the trays for condiments could use some work. Immediate seating during workweek lunchtime"}
{"text":"My husband & I have been looking for a good authentic Vietnamese restaurant....we found it here at Pho Huang Que!!  The food is excellent, the atmosphere is friendly, & the service is good and courteous. The portions are sizable! The ingredients are fresh and there are several build you own plates. We love the spring rolls and the vermicelli bowls."}
{"text":"Best pho by far in Charlotte and my go to spot to satisfy my Pho fix!  Always friendly and fast service."}
{"text":"Nothing fancy, basic, good food, large portions, inexpensive, owner waited on us and service was good."}
{"text":"The depth of flavors these guys impart into their Pho is as authentic as dinner at a local Pho restaurant in Ho Chi Minh. They cook the broth overnight creating a broth that is bold yet subtle, seasoned and aromatic but isn't tainted with the overabundance of star anise. 
Be sure to order the summer rolls! The peanut sauce is out of this world. I believe it'd make an old sock edible.
Family owned using VERY old family recipes and the finest meats and produce. The entire family works here from the kitchen to the wait staff. You can taste the love in every dish they serve. 
I'm on my way now for one of my many monthly visits."}
{"text":"I like Vietnamese food very much, and have tried many all around Charlotte. This restaurant opened up only recently, and I decided to take my mom out for lunch. 

We ordered the fresh spring rolls. And what was surprising was that it came with 4 pieces!! All the other Vietnamese restaurants give you two pieces per order. So that was a pleasant surprise to start with. 

Pho was good. I ordered Beef combo pho large, and my mom ordered seafood pho regular size. I would recommend against ordering the large size at this restaurant because there's really no significant difference in size. The broth was good. The service was good. The price point is lower than other Vietnamese restaurants I've been to. I would definitely come back again and bring my friends with me."}
{"text":"By far the best Pho in town! Great portions and you can build your own bowl. Their other dishes are excellent too.. The staff is very friendly and they remember us by name."}
{"text":"I ordered a bubble Thai tea and got no boba, and when I asked them to fix it they refused even after I spoke to the manager and they refused to even give me boba on the side. On top of that I added shrimp to my pho and only got 3 pieces of shrimp, which costs $3.50. Not generous at all. Horrible customer service, my first and last time eating here."}
{"text":"Food was excellent, but service was horrible. Young adults working the dining room, busboys and hosting. Expect at least a 30-45 minutes wait for food. Are they hand-making the noodles and broth to order?!?! We saw several (10-20) patrons turned around because seating is limited to none. About 10 tables max and 7 of those are 4 person settings. Because of the slow service and limited seating, it's a wonder they make any profit. With wll that the FOOD IS AMAZING!!"}
{"text":"I cannot say enough good things about this place! My hubby and I eat here regularly and I've turned my mom on to it too! The owner and her daughter are the sweetest and the food, oh the food, it's so good. We've been to every Vietnamese restaurant in Charlotte and this is by far our favorite. The ingredients are always fresh and the portions are plentiful. The flavors are just right and of course they have plenty of condiments on the table if you like. The coconut bubble tea is the best in town and the #25 is my favorite dish to order out anywhere. Please give it a try, it's a great family owned place that I crave almost every day!"}
{"text":"This place is clean fast and consistently good. Pho broth is is light but has the aroma smells and the herbs that I should have. I tried the hu teiu Seafood combo and it was sweet and refreshing. It's a very different taste from the pho. The pho is more herbal, with basil and star anise. . Both were solid dishes and will try it again. I Also had the fresh spring rolls, it was very neat tightly wrapped it had shrimp and pork the typical summer rolls.  Their spring rolls were big hot and also neatly and tightly wrapped up. Some places have it premade and the rolls look pretty messy when they refry them but you could tell this place is pretty fresh."}
{"text":"The appetizers could use some work, but I got some crazy good pho here. I would recommend it to go, but the price and the quality (and side options, including fresh mint) are pretty awesome. All in all, this is the best pho I have had in Charlotte."}
{"text":"We randomly walked in before shopping next door at Super G Mart, so I was pleasantly surprised that the pho here was good. My kids liked their egg rolls. Win win all around. My only complaint is that their portions were small... and I ordered a large. Curious what their regular size looks like."}
{"text":"I have had Pho all over Charlotte and I always feel cheated after having Pho at Pho Huong Que. by far the best in town and the staff is great. Extremely friendly and you feel like family. 

The broth of the Pho is this magical thing that cures and warms your core. 

Thank you Pho Huong Que for always providing a bowl full of delicious happy!"}
{"text":"Love, love, love this spot!! I am originally from Los Angeles and this is by far the best pho I've eaten. The broth is full of flavor and not extremely salty like some others I've tried here. The staff are also very friendly and personable. Order the #12, the wings, egg rolls and avocado smoothie and you will not be disappointed."}
{"text":"This place is family owned, and most of the folks you encounter are young, the food is outstanding and it's our go to for Vietnamese in Charlotte."}
{"text":"Went in for dinner for a party of 7. This place is a Vietnamese restaurant and I'm Vietnamese as well, I grew up eating the motherland's foods and so I have high expectations for this place.

My experience: We went in and no one greeted us nor seated us. It was busy but not over-crowded, but at least welcome us and tell us to wait or something instead of having us walk in with people staring. No one approached us until my aunt called out to one of them. After seated they passed out the menus and walked away for a few minutes without asking us \"what we would like to drink.\" After they came back to ask us for drinks, they went back to the kitchen and didn't came back with our drinks until 8-10 minutes later.

Now let's skip to the quality of the foods. Me and my sister had ordered 'Bun Thit Nuong with Cha Gio (Vermicelli noodles with grilled porks and egg rolls).' It was DELICIOUS, the only downside is that there was too much lettuce, bean sprouts, and cucumbers. A piece of grilled pork cut up into a few smaller bite-size pieces with lots of vermicelli. It felt like I was eating a vermicelli-salad with a few toppings. My dad said that his 'Bun Bo Hue' was good but only 2-3 slices of thin meats.

Decent price though! I'm still debating whether or not I should come back. Maybe order something different next time?"}
{"text":"The best pho I've had since visiting Vietnam! The ingredients taste so fresh and the broth is the best part! The pho has green onions, onion, noodles, I had mine with well done flank steak since it's lean. The portions are large and comes with sides of sprouts, jalapeno, thai basil, lime, chili oil, fish sauce. I was worried that just the pho wouldn't be an entire meal but it's more than enough. If you don't like this pho then you don't like authentic pho. A must try!"}
{"text":"Went from a great place to the worst!! If you go there with a large party or god forbid your in a rush DEFINITELY DONT GO HERE. The service is horrible. They never have most items in the menu. They nickel and dime you by up charging everything you ask for. It's like a la carte for everything!! There's many more places to eat that have much better service and don't try to rob you blind."}
{"text":"I went to Pho Huong Que looking for a good Pho soup and they certainly delivered. 

The restaurant itself is not much more than you would expect from a strip mall style place and while everything inside the restaurant looked aged nothing appeared dirty. All of the utensils and serving dishes were clean the tables were wiped down.

I pretty much pigeon holed myself as I went there looking for a good Pho so that is what I went right after. I was impressed with their selection of different Pho soups you could choose from. There are about 20 on the menu with the base model being your usual ingredients of broth, rice noodle and beef slices. They apparently build off of the \"base model\" and you can order different variations which I look forward to trying out in due time. I also had the spring roll as a appetizer which was very delicious in and of itself. The spring roll app was served with 4 spring rolls each consisting of a couple shrimp, a strip of beef, rice, rice noodles, lettuce all wrapped in a rice paper. A added bonus I enjoyed was that the spring roll wasn't friend in any way so it was a lot more of a \"light\" appetizer. 

With the Pho, spring roll app and tip my total tab came to around 16$. Some may consider it a little more on the pricey side but it definitely topped me off. 

I would recommend anyone in the area who is looking for some good Vietnamese food to at least give this place a try."}
{"text":"This place is where I had pho for the first time in my life, and I absolutely love it! All components were very fresh, and the amounts of food are huge for the 8 or so dollars you pay for a portion. Spring rolls and noodle stir fry from here were also excellent. The place is located near Super G grocery, so in a super central and convenient location, and all the staff I've seen there speak absolutely perfect English, which I appreciate when calling in orders over the phone. It seems to be closed on Thursdays!"}
{"text":"I'll start out by saying they JUST opened in the last week or 2 and the food was decent.  I plan to go back and I probably will end up raising my rating.

I walked in on a Friday afternoon around 1pm.  It looked kind of like a fast food place so I wasn't sure if I was to wait to be seated or not.  I stood there for a second and then a guy walked up and said \"1\"?  I said yeah, then a Vietnamese guy came in behind me and they sat him instead.  No biggie, but not very nice.  Anyhow, I was seated right after.

I looked through the menu and this is much more than just a Pho restaurant, but that was in the name, so I figured I'd give it a try.  I also looked for a lunch special, but there was no getting out of hear for under $8.  I ordered the Pho Dat Biet XE LUA.  Pretty much a Big OLE bowl of pho with everything in it.  I asked him what stripe was and the waiter pointed to his stomach, I said oh, tripe?  He didn't understand.  I guess misspelling on the entire menu.  So, I said no stripe please.

The pho came quickly with the normal frills of sprouts, basil, and peppers.  The soup was rather bland, but there was a lot of meat(including tripe) and rice noodles.  I added some of the very fresh basil, a little hot pepper sauce, some fish sauce, and now it had some flavor but still not that great.  I tried harder to get some flavor by adding more heat, and before i knew it, my water was empty.  I waited and waited and ended up walking up to the counter for it.  Never saw my waiter again.

Once I finished, I waited and waited for the check, went back up to the counter for that.  I paid and left.  Maybe this place was a self-service/fast food kinda joint and I didn't know how to work it right.  Hopefully these guys will see this and get there act straight.  They have a great source of food with the Super G mart right there.

All in all, it wasn't that bad, it just wasn't that good.  The service was horrible.  I will be more adventurous in my meal choice next time."}
{"text":"Bubble tea! Love that stuff. 

Pho Huong Que does not look like much from the outside, or even the inside for that matter, but the food speaks for itself. I have had a few things from their menu now and never been disappointed. The pho is super flavorful and all of their meals seem to be fresh. The few times I have been there it did take some time to get my food but it is totally worth it."}
{"text":"The food is great and the service is friendly but the servers will never come back to your table after they've given you your food. My partner is a BIG tipper and always leaves them 20%. When I go without him I leave either $1 or nothing. At first I made excuses for them like \"maybe that's how servers are in their country,\" but I'm sure they've been in the US long enough to know that servers are supposed to refill your drinks. If their food wasn't so good or they weren't friendly I would not go back."}
{"text":"This place is so unassuming and blends into a random strip mall. You would never think to stop here. I am very glad that I did. The place itself is a little hole in the wall family place. I got carry out. The service was very very helpful and they were great in helping me decide what to get. i got Vietnamese egg rolls and then the meat pho. Both were very good and the prices can't be beat! The broth was tasty. I highly recommend to anyone that likes Vietnamese food."}
{"text":"You know Yelpers, when you eat somewhere and can't wait to spread the word!  One of my friends told me to meet him here, in the shopping center where Super G is. You had me at Super G.
I arrive early and ask the waiter should I get the rolls with beef or the pork and shrimp ones.. He was all about the beef and he was correct.  I had never had the fresh rolls with beef. They were stuffed with noodles & lettuce and I would get tiny fresh ginger or lemongrass bites.  It really turned me on. That alone was worth the trip and if I were close by, I think I would just pop in for a little snack.

I also ordered vermicelli with pork, shrimp and spring roll and a vietnamese coffee.  Our tab was $33 for two.  So it isn't exactly cheap for lunch, but worth it and worth the drive to go try it.

Don't expect any frills, expect great food!"}
{"text":"I actually really like this place!  The food here is great.  I do recommend the Pho (combination) because it's quite flavorful and filled with spices.  The place probably needs a bit more flare, but who cares if the food is good!

RECOMMEND!"}
{"text":"My new go to place for pho! Before I discovered this gem, I used to go to Lang Van in East Charlotte, but since I'm Korean and visit G-Mart right next door at least once every two weeks for groceries, I don't have go to out of my way for pho anymore! Not to mention, the price is cheaper and the portion size is larger! Perfect meal for a rainy day. I also love their vermicelli noodles w/ beef or pork...so filling yet light on the stomach (must be the shredded lettuce mixed in with the noodles)! And their green tea bubble tea rocks!

As for the ambience of this place, nothing fancy. No need to dress up for a dinner date here. Just feels like you're walking into a Vietnamese family's house for a casual dinner.  After all, I've seen the same people work here since my very first visit months ago...wouldn't be surprised if it were a family business!"}
{"text":"I would give 0 stars if I could because I am a repeat customer who has continued to eat here despite it being overpriced but I thought it was good and close to hime. I ordered 2 orders of crispy fried spring rolls by phine and after li mi g it up while heading home I decided to eat one when i saw that they gave me fresh spring rolls. I brought it back and patiently waited for my order to be made correctly. On my way home i started to eat them and tasted no meat. I called to ask if the rolls they gave me should have meat. It is supposed to have pork and carrots. They said I could bring it back for refund or something else. When i got there i showed the owner the roll and she pointed to the little pebble of meat and said see there's the meat. I told her I was vietnamese and ate there lots of times and never complained about the food before and I have eaten the rolls before. She proceeded to take me to the kitchen to show me how they're made. I told her I understood they may not have done it purposely but I was hungry and expected some meat. She said she was not going to give me a refund or offer any other food. The you g female cashier said it was probably because I already returned one order. But I told her I returned the order because it was not what I ordered and it was their mistake not mine. See the one piece of meat below in the pic. I will never eat here again because i can't believe how the owner handled this situation. She should be ashamed of herself, so much"}
{"text":"Passed this restaurant dozens of times and finally stopped today. 
Got combination Pho and it was great.
Lemongrass beef rolls were on point.
Crispy spring rolls were crispy not greasy so I ordered another round.
My wife got the combo rice plate and very nicely presented and was also good.
Lots of folks in here on a Sunday. Lots of young folks working. Friendly staff. I like my noodle bowls piping hot and they delivered without asking, pho bowls available in s/m/l.
Will definitely be back"}
{"text":"Since I happened to be in the area and had a taste for Vietnamese, my search landed me here since the reviews were pretty decent.  I wasn't in the mood for pho so I opted for the vermicelli bowl, and spring rolls for an app.  The person at the register wasn't very friendly, but ok.  The food didn't take long to prepare and came out pretty quickly.  The spring rolls were small compared to what I've had before, but they tasted ok.  The vermicelli bowl was very skimpy on toppings but was full of noodles.  Overall, this place was just ok, but I'm use to much better and more quality meals at Vietnamese restaurants."}
{"text":"Trying this place because it's so much closer to my house compare to other Vietnamese restaurants. 
I placed a to go order, Ahhh !!! they got my order wrong !!!!! I didn't have the time to go back and exchange it ,so I just go with it. 
I had asked for pho with well done brisket and with EGG noodles ! But I got regular pho rice noodles instead and why is there meatballs in my soup ?! I didn't want any meatballs !!! 
Whatever, so I took out the meatballs and placed the meat slices and noodles in the soup cup and took a sip.
Ahh!! The soup burnt my tongue !!! Should've have known, the soup is always extremely hot, but I couldn't wait, even though it burnt my tongue, the broth is actually pretty good! 
Ok I forgive you for messed up my to go order, because your broth and meat are pretty legit! The broth is rich and flavorful and not overpowering with the spice.
Meat is tender and good portion for $8 ! 
I will definitely come back , but next time I will make sure my order is right before leaving the place !!!"}
{"text":"I was nervous about coming here since there were several reviews that complained about the poor service. We did not have that experience. We went at dinnertime on a Wednesday night. The place was nearly empty, just a couple other two tops. Our waitress was extremely helpful and understanding that we were somewhat pho newbs and needed some guidance. I had the three meat beef pho and my husband had the fried rice and we also ordered some fried spring rolls. My hubs is not a huge fan of other Asian food such as vietnamese, thai, or indian. He enjoyed what he got and I enjoyed mine. I loved that the pho came with all the greens, bean sprouts, lime, and sauces for you to adjust it to your tastes (believe it or not, I've been to places where you have to ask for it or don't get it at all). While it was not as good as some homemade pho that I've had before, it was very good and we would def return here."}
{"text":"This is my go-to lunch spot when I drive down to Super G to do the groceries, it fills me up so I don't go crazy buying absolutely everything at Super G.

This place is your basic Pho spot, simple cafeteria style tables and nothing more, but what else do you really need when you have a bowl of delicious Pho in front of you. I don't remember the number, but I always get my Pho with rare beef, tendon, tripe, and meatballs. As always, they bring you a plate with limes, jalapeño slices, bean sprouts and basil. One of the things I love most about Pho is the fact that everyone gets the same stock but it is completely customizable with all the garnishes, Sriracha, Hoisin, and garlic chili sauce. My husband loves his stock just as it is, but I like to customize mine with a little of all of the above and a lot of Sriracha and jalapeños, the more my nose runs, the better!

The iced Vietnamese coffe is also very good here, and I never leave without having a cup! The owner's kids that are normally waiting tables are super friendly and if you ever want to venture out of your comfort zone they will be happy to recommend something from the menu. One very important thing I forgot to mention is that unlike many pho places, they actually offer different sizes. After about 5 times of eating there and taking more than half of my Pho home, the waitress suggested I try the \"kids\" bowl and that is what I always get now. I am definitely a good eater, but I can barely finish the kids portion. Another good tip we got from them is how to overcome the never ending pho bowl illusion: you must eat the noodles first and then the broth, the longer the noodles sit in the broth the more they expand and that is what creates the never ending bowl!"}
{"text":"Great Pho...if you have an hour and a half to kill while waiting for them to get to you. My wife and I have been there probably 20 times and there is never more than 3 or 4 tables filled, yet it takes 10 to 15 minutes for them to take our order, regardless if we seat ourselves or not. THEN it takes another 15 to 20 minutes to actually get the food. I have seen many people served before us although they arrived after, but they were Asian, so maybe they are just racist. I hate it, because the pho is so good, but we have had enough and will never be going back. If you like waiting an hour for food, and never getting your drink refilled, this is the place for you."}
{"text":"This place has the best pho soup! I've tried a few places around Charlotte but this place is my number 1! Also the service here is also amazing! Every time me and my husband come in they already know what we want.."}
{"text":"I LOVE THIS PLACE! Awesome PHO on a cold or sick day. I enjoy their milk tea w/ boba, also....... Fried rice is pretty good, too! The waitress with the cool, big hair and funky glasses always make my day when she serves my family."}
{"text":"Our fav place Pho Hong closed recently. This place is close to our office. We are looking for a place that has crunchy yellow fat. We always order spring rolls. The staff is very friendly.  I would give 5 stars BUT they raised the prices a significant amount. We come here A LOT!!! Today was the best day that we've had it in the 7 months or so we've been coming here. On average 1-2 a week!!!"}
{"text":"I had a vague relocation of Vietnamese place in this shopping center, so after a long night indoor rock climbing at Inner Peaks I took the leap of faith into their parking lot.

Not only are they open to ten pm on weeknights their service rocked and the food was made fast.

I made my own pho and the medium was only $7.50. This not the place to come to impress a first date but if you are in the area and want some fresh and delicious- stop in for a satisfying meal."}
{"text":"Wow, I'm a Californian looking for some good Pho in North Carolina and boy was I disappointed. I came in today feeling under the weather and wanted some pho to soak up the bit of cold I had and was treated with the worst service probably ever. I asked for a couple extra condiments and offered to pay extra for them and the staff was just completely incompetent at serving the customer. The woman cooking in the kitchen was awful so rude. She came to my box and ripped it open taking sauces out and only giving me one of each. I offered to pay for more or pay extra so I could take some sauces to go but after being so appalled by the horrible treatment I actually just cancelled my order. Worst experience ever and I'm still hungry and sick! If you like being treated like crap go ahead and try this place and you better eat there because they will only let you take 2 small sauces togo. Very disappointed."}
{"text":"I've come here several times, and I'm not sure why I continue to come back. The pho is not bad and the vermicelli is pretty good, but they do nickel and dime you for every little thing most Asian restaurants happily give for free. Most importantly, they have the worst service of any restaurant I've ever been. This last visit finally made me write a review. If you are in a crunch for time please don't come here. My food always takes an hour to come out, and half the time they get it wrong. The waitresses try to remember orders when they should be writing it down. Only come here if you have more than 2 hours to waste."}
{"text":"I come to eat here often. I like their bun bo hue, but the crab paste flavor is strong. Their chicken wings and summer rolls are really good"}
{"text":"Tonight was my 8th dine here.  In the beginning their service was good - Now it is fantastic!  Another Saturday Night and...  Rolled or wrapped - Both!  My Photo is One serving!!!  This is #29 on the menu: Spring Rolls - \"B.B.Q Steak wrapped in Rice Paper\" says the menu description...  Here is the scoop:  Picture This: Mint, Thai Basil and Vermicelli wrapped in Lettuce, then wrapped in Barbecued Steak then wrapped in Rice Paper served with Fish Sauce (my preference over the so called \"peanut sauce\" that looks and tastes like Hoison sauce with some ground peanuts on top)."}
{"text":"I was very underwhelmed by there fried rice and vegetables but the juries still out as I have not given there soups a try. 

Either way, the bubble tea easily makes this the perfect place for a quick stop off. There's no where else for it in Charlotte!"}
{"text":"Worst pho I've ever had. Broth was flavorless and the only meat that was in it was filled with fat no premium slices at all. I was so disappointed, I also had the Vietnamese egg rolls which was just carrots rolled up and fried. We also had the Bun Bo Que it was the first time I ever tried it and it was hard to take down pate smelled and tasted horrible like an old sponge. I lastly asked for a boba tea and I was told they didn't have mango or the boba for the tea and they could replace it with jelly. I would not recommend coming here at all business was slow and so was the service even though our waitress was nice and knowledge. Bus boy had some sneakers on that smelled so bad like if they had been out in the rain grown mildew and then worn continuesly. I had a bad experience but I could deal with bad service but the bad food I couldn't take."}
{"text":"3.5 stars
This place has become our neighborhood takeout Viet. They've installed window treatments since, it's soften the ambiance a bit which was well needed. Also there's a new takeout menu, which is shorter but no less confusing.

Last night we brought home and shared: 
#13 Pho Do Bien ($9) shrimp, squid, fish ball and fish pate. The shrimp was dry but aside from that an excellent, strong flavored Pho, we loved it. 
and
#7 Goi Ngo Sen Tom Thit ($13) Lotus Stem salad w/shrimp and pork.
Very tasty \"salad\", could have used a bit more of the chili/fish sauce in my taste but I'd definitely order it again. I wouldn't want to make a whole meal of it but it's great for sharing as a side - albeit a bit pricey

Not the type of restaurant to take a date to, but it is what is: an oasis in this foodie hell neighborhood."}
{"text":"We tried this little place about 3 weeks ago and we've already been back 4 times.  The food is incredibly fresh and plentiful.  My favorite is the #26 with soft egg noodles.  The shrimp is fantastic and the brown sauce is light and savory.  They will bring it with a little bowl of brown sauce with fresh sliced peppers for dipping.  It has a kick but also a smokey flavor that is fantastic.  The egg noodle dish is certainly plentiful enough for two persons if you want to share. This is a pho restaurant but we've not tried any yet because of all of the other entrée choices!  The spring rolls and egg rolls are awesome as well. Can't wait to go back."}
{"text":"I never in my life have enjoyed Vietnamese food the way I have been enjoying it in Charlotte.  Who knew?!  And this place is pretty close to my home.... Dangerous!  The atmosphere is nothing super special, basic cafeteria style or pizza shop seating and decor and the location is right on E independence in Matthews which is convenient for me.  The food: so the bar for me has been set pretty high since having some fantastic vietcuisine in Charlotte thus far, but it's pretty good here!  The summer rolls are tasty and fresh, although I add a bit more spice to the peanut sauce.  The vermicelli dishes are flavorful and delicious and probably my fave.  I love the salad noodle combination with that stinky fish sauce... It's heaven! The crispy spring rolls were a little disappointing to me as they were more like skinny egg rolls than the light crispy wrapped in rice paper bars of goodness to which I have become accustomed.  I will probably just not order those again but I will be back.  I have not yet tried the pho here (mainly because of how much I have been lovin the vermicelli!) but I have high hopes based on my fellow yelpers' reviews (you guys never steer me wrong!) and I think on my next visit I will try one of those egg pancake things.  They look delicious too. I am anxious to add another star(but don't mess with my crispy spring rolls). I have high expectations!"}
{"text":"Their pho is amazing! The broth is more clear than other restaurants, but boy it is flavorful!! We were greeted as soon as we walked through the door (we were able to pick our own table at the time - it was about 11:30). We looked at the menu for only a couple of minutes, because we came for the pho, duh. Once we ordered it was only a little bit till our food hit the table! My fiancé just adds lime, jalapeños, and bean sprouts to his pho because he loves the broth as is. I add the usually to mine, but it is delicious! We also ordered a lemonade (fresh squeezed) and it was yummy!! Overall we will definitely be coming here again, even though there are several closer to our home! They are closed on Thursday though, just a heads up."}
{"text":"When I moved to Charlotte from Southern CA I was disappointed with how less popular Boba (bubble tea) was here than back home. I had a hankering for some Pho and found this place with good reviews, strolled in and saw a poster that had TARO bubble tea! I was ecstatic. The pho is delicious and so is the boba. HOWEVER they can't accept a card on a purchase less than $8, so if you're only going in for the boba be sure to bring cash."}
{"text":"My first impression of this humble vietnamese restaurant was that I wasn't in for anything special. A plain design helps cultivate negative feelings, but in my experience the smaller the place, the better the food. 

I walked in out of the rain and greeted by a warm, polite staff. We moved awkwardly, like a missed high five, to my seat. I sat there with the short menu for a moment, skeptically eyeing the make your own pho with 6! options maybe a 7th who knows.
After only a brief moment my waitress asked if I were ready to order and I quickly decided on the make-your-own with 3 different meats for 7.99 which is a price im used to seeing. I chose the well brisket, well beef, and rare beef accompanied by a pot of jasmine tea. Only 5mins went by until I was brought my pho and condiments including a moderate amount of bean sprouts, a sprig of mint, four jalapeños, and one lime. I squeezed the lime over the bowl and laid the side pieces into the soup with care, the a dash of salt and pepper, followed by a light zigzag line of hoisin over the bowl and finally another pattern this time of sriracha sauce. Eventually I finished the soup and drank every bit of the delicious broth, with occasional sips from my tea cup. Overall I recommend trying this little spot. They have bubble tea and other menu items worth trying. My visit was exceptional. I plan on trying this place again someday"}
{"text":"Really great food and HUGE portions. Both the fresh and fried spring rolls come 4 to an order. Went with 2 other people and we all had the vermicilli noodle salad bowl  with chicken. One order would have been more than enough for 2 people. Everything was super fresh and the service from the two young people working there was excellent!!!"}
{"text":"I came out from Los Angeles to Charlotte to visit my family over the holidays coming up. My mom, sister, and I had Pho. It was their first time having it, and they loved it! I will say the flavor of this location is a little different than others, but in a positive way. Unique flavor and delicious! 

Only bad thing was they were out of Thai Tea, and they gave some answer as if it takes 4 hours to make. I make it at home within 30 minutes, so I don't know of they have a special recipe. 

Anyway, great food, great time, great service. Vietnamese Pho is the best"}
{"text":"This is the 3rd time I've been here and I have to say the service is so slow and indifferent. They used to be the only pho place south of Charlotte but thank goodness for the new Viet/Thai restaurant just past Matthews in Indiantrail on hwy 74 food is fresh and the service is much better. Never coming back here again!"}
{"text":"I. LOVE. THIS. PLACE.

This is a family business, everyone is super friendly. If you are unsure of what to make of the menu-have no fear! Anna or another employee (her brother, most likely!) will kindly explain the dishes to you OR based on a few questions, she will recommend/order a dish for you. AND you will learn how to pronounce what you're ordering.

Don't be afraid to try new things! Everything is delicious! But you must try the BBQ Beef spring rolls with the peanut sauce. You won't be disappointed!

Note: They are closed on Thursdays."}
{"text":"Best Pho broth in town I have found so far, try and go early or not at peak hours as sometimes the service is slow, but well worth it and at an amazing price"}
{"text":"Whoa!! Nice!! And right next to the ever popular Super G!
The decor is Spartan to non existent, but who cares because this place is all about the food. And it's really good! The staff was friendly, attentive and knowledgeable. The Pho with tenderloin and shrimp (aka Michael N combo pho) was delicious and the Vietnamese Beef Stew with carrots was \"get in a space ship and orbit the earth\" out of this world - so much flavor!! The usual toppings, sprouts, limes, jalapenos and cilantro - but wait -  what's this super spicy green thing?! Culantro!!
We now interrupt this review for a station break brought to you by Wikipedia - culantro (aka spiny coriander - aka Eryngrum foetidum, which the Latin translates to \"foul smelling thistle\") is a member of the cilantro family and used in some Vietnamese cooking.
Let's just say culantro blew my mind and kicked my Pho in it's great big noodle butt. 
Great place to have lunch if you're out at Super G, car shopping or if you just want to eat their awesome stew!!"}
{"text":"We stopped in while on Independence and found this restaurant based on the high ratings. Located in a shopping complex, this was a great find. The restaurant is casual, the staff was friendly and you pay up front. They have pho and we easing had the rare beef pho. They do not serve banh mi here so soups and vermicelli dishes are more traditional. The prices are moderate. My pho was fresh, the broth was tasty and the basil and bean sprouts on the side were all colorful and great accompaniment."}
{"text":"Pho Huong Que is at the opposite end of the Super G plaza off Independence Boulevard, and it's worth a visit.

My first stop here was in the spring when I had come down with a nasty cold and wanted the relief only pho could bring. My favorite spots are in Uptown, but feeling sluggish, I found the closest Vietnamese spot near my house and made the journey.

The menu is organized a bit oddly, but you can order by number, if you don't feel confident in your Vietnamese pronunciation.

The pho is divine. The broth is full of flavor and warms you from the inside out. They're not skimpy on meat or noodles. 

I've also had the bun/vermicelli bowl, and I can say that the pork is excellent. The dish is richly seasoned and filling.

The summer rolls are a must-order. Even my father, who is a bit wary of authentic Vietnamese food, was raving about the summer rolls. Be heavy-handed when you add the peanut sauce; it's top-notch.

The only thing that keeps me from giving five stars is the ambiance, which is to say -- there is none. It's brightly lit with cheap tables and chairs and no real personality. There's a big television in the rear playing arbitrary stations -- last time I was treated to the end of Hook with Robin Williams. Could be worse, but I'd love to see the place spruced up a bit.

Overall, this is a solid place to get your noodles on. Prices are reasonable, service is quick, and the food is great. I'm thankful to have a nice pho spot in my neighborhood."}
{"text":"Absolutely the best pho. My mother got the combination pho and the broth was very favorable. I got the shrimp crispy egg noodles and it was soooo good?. Portion is very generously. The staff is very friendly and the price is good. Mom and I absolutely love this place. I definitely would go back. If you love pho please try this place. My only regret is I shouldn't wait this long to try this place."}
{"text":"Never disappointed with their pho broth or boba tea or bun bo hue.  Always quick and polite.  Love this place!

This is our go to place for pho on this side of town.  They trump all of the pho restaurants on Central Ave."}
{"text":"Stopped by here a few weeks ago after shopping at Super G Market.  Drove by many times and decided to give it a try.  We were seated once we got into the place and our drink orders were taken.  Wife and I wanted to try their Pho so we both got two orders of Pho Combination.  Also ordered some spring rolls but somehow were given some other rolls.  It was okay.

When they brought out our bowls of Pho, I usually have a habit of trying the broth before adding the ingredients.  It had a strong smell of overly done beef.  That pretty much ruined it.  Even after adding the sauces and garnish, I could still smell the beef.  

I will most likely not go back to this place.  On a scale of 1-10, 1 being BAD and 10 being GOOD......i gave it a 3.  Sorry, this restaurant makes NASTY PHO NOODLE."}
{"text":"I come here often with my sister, we love Vietnamese cuisine. This place is close enough and authentic enough to deserve a visit we think. I love the flat noodles and has a decent seafood selection. It's family owned and the staff is always friendly!"}
{"text":"This place has gotten super slow in service.  Definately need more people. Recent visits were just wait and wait without getting the food"}
{"text":"The taste of the Pho is fine but not the best I've ever had. The reason for 2 stars is the cheapness of this establishment. No public bathrooms, 5 pieces of steak with a small order of Pho Tai, and you no option for extra meat without ordering a larger bowl. Just disappointed and there's way too many better places."}
{"text":"I've been coming to this pho joint for a few years now. You could consider us \"the usual\". It is a family owned restaurant. Mom and dad in the kitchen, siblings running the front. Every member is just as friendly and courteous as the next. 

Although it can take a bit longer to place an order and to even receive it which is the downside but hey, the kindness of everyone makes up for it. 

I'm a usual pho dac biet kind of girl BUT when we are dining here, I lean towards their spicy bun bo hue. You can request it to be not spicy. It will consist a variety of pork items. 

My husband is the pho ga type of guy and will only accept it if it has beef broth which has more flavor. (In our opinion) 

Their bubble tea is good. They offer a wide variety of flavors that other pho places doesn't. The Thai tea, coconut and green tea are our favorites. They can combine flavors as well. Such as pina colada. :) 

If you're in the area and are hungry, be sure to stop by."}
{"text":"I loved how fresh everything was! Everything had so much flavor and the waiter was very helpful on decisions. My family goes here once to twice a week. They give you so much food for a great place,  I would say if are not starving you will have food to take home"}
{"text":"Best Vietnamese Restaurant in Charlotte NC - Best Pho in The Queen City. 
Me and my family dine in here frequently about 2-4 times a month and never disappointed.
They use fresh vegetables daily and the quality of meats."}
{"text":"easily one of my favorite viet places in Charlotte, it's just sort of out of the way. I think their banh xeo is the best in town and everything else is fairly solid as well. 

I'd always wanted to try the korean restaurants in Super G Mart but kept going here instead."}
{"text":"I wasn't blown away by Pho Huong Que. At first the service seemed great; she made a few recommendations and was very friendly. I order the vermicelli with chicken and egg rolls. They forgot the egg rolls which happens, but  then I had a lot of trouble tracking down my server (she wasn't the person who brought it out), and never came to ask if anything was okay. 

After 15 minutes I was finally able to ask someone if they could ask my server to come to the table when she had a chance. She apologized but by that time I was really hungry and had to get back to work so I needed to eat the dish. Basically it was TONS of noodles and lettuce/cilantro but very little of anything else. I found the dish underwhelming.  I waited another 10 minutes to get the second half of my meal,  by then I just ate alone and not on top of the dish. 

My server never came back so  eventually I just went up to the front to ask if I could pay. There wasn't any language barriers or issues like that, and the place was not very busy. Unfortunately i just think it was poor service...

Also not sure what the fuss about it being so much for the price...mine was $12 with tip (I had water) which isn't exactly cheap but fairly on par ? 

I would return and try the Pho because I did see potential food-wise. I would not get a noodle dish again and I would not return on my lunch-hour when time is limited."}
{"text":"Excellent and Authentic Vietnamese.

While the location is not the greatest, it's convenient to me due to my work location and it's quick and extremely reliable.  It's a great healthy option vs many others in the area.  The staff is extremely friendly and helpful. 

We have tried so many different dishes, all of which were wonderful.  For the price, it's a great option!"}
{"text":"More often than not if we are in this shopping center, we will grab a bite at the Super G, because those steamed buns are so amazing. But every once in a while we'll venture over for a nice bowl of noodles or pho, and it's worth the trip (I mean it's only a minute or two walking after all!).

Sure, the place isn't fancy, but that's often the appeal. When you're talking the winter chill and need a nice pick-me-up, then a warm bowl of pho can really help out, and this is a great spot to find one - it's just too bad that, like many such places, you have to deal with a completely whacked out parking lot. To help with that, you can approach from Margaret Wallace, and that will improve things somewhat."}
{"text":"Pho hit the spot on a cold night before we went shopping at Super G Mart. We shared fried spring rolls and each ordered a bowl of pho to make our noses run. I ordered the beef with steak and he ordered the chicken. A small size is plenty for one person if you don't want any leftovers. We shared an avocado shake afterwards and it was the perfect ending to a simple, warm meal. I would recommend trying the avocado shake if you've never tried it before!"}
{"text":"One of the best Pho you would try in the east coast. Good service clean place. They would go an extra round for you. Recommend 5"}
{"text":"I hate to give a Vietnamese restaurant less than 4 stars. I drove by this place a lot on my way to piano practice and figured I'd give it a try at last.

The interior is more akin to a break room at work rather than a restaurant, but I figured what they weren't spending on decor/ambiance would be compensated gastronomically. I ordered the Banh Xeo (pancake) with shrimp along with an avocado bubble tea. Overall, the food was ok. Didn't hate it but wasn't too impressed. The pancake was a little greasy, and the shrimp was not particularly flavorful, nor were the vegetables that came with it. The avocado smoothie was good though, and the service and speed of delivery I had no problem with. It's a no-frills place, which is ok. Perhaps just not a great night? I wouldn't be against giving it a second chance (I'm guessing this is more of a pho place than standard Vietnamese entrees) but am not in a hurry to get back either."}
{"text":"I'll make this quick; been living in charlotte 10 years (moved from ny) and tried every pho spot around town.  This one ties my favorite Vietnamese restaurant all-time."}
{"text":"I had the #37 rice plate combo and it was a plus! Wish the pork chop portion was bigger, but I will definitely still go back for more if I am craving. The egg rolls was delicious!! 

I also ordered a coconut boba smoothie and it was okay, I've tasted better.

We also ordered the Spring Rolls. The sauce is what compliments the spring rolls and the sauce was really bland. I wish it was a much more yummier sauce! The portion of the spring rolls are a lot smaller than the ones I've eaten before though.

Overall, I give it a 3 star because their pork chop was delicious!!"}
{"text":"I've passed by this place so many times from my way to GMart and finally stopped in today. We were seated and served right away. Overall it is a good place. The reason for taking one star off is that they charge 5-6 bucks for spring rolls and you get two skinny rolls cut in half. Way too pricey for what you get. The pho broth was really good and flavorful but again they skimp out on the fresh toppings. You only get basil and sprouts, and a couple jalapeños. No fresh cilantro or mint."}
{"text":"We tried Pho Huong Que last weekend and had a great experience. It's modest exterior makes it blend into a large shopping complex but it really is worth trying. This restaurant uses fresh ingredients to create authentic and perfectly delicious dishes. 

Pho Huong Que lacks the overbearing (and sometimes quite stale) grease that often overpowers food (and the scent in the air) in many Vietnamese restaurants. As a result, you won't leave this restaurant feeling weighed down, rather their food has a refreshing quality to it.

Arrive early as they seem to run out of popular ingredients quickly (there was no beef by 5PM on Sunday night). 

The interior is clean and comfortable but do not expect ambiance...go here for the food. Waitstaff are friendly and attentive and prices are very reasonable.

I recommend the house special pork dish which offers up loads a variety of flavors; a tiny Vietnamese meatloaf, perfectly cooked thinly sliced BBQ pork chop, interesting ginger noodles, a fluffy egg dish, steamed rice, and a sampling of vegetables. I'd also recommend the shrimp spring rolls; very large fresh pieces of shrimp wrapped in a perfectly fresh paper thin rice wrapper with crunchy veggies + a dynamite peanut butter sauce.

We would certainly visit Pho Huong Que again based on this experience."}
{"text":"Decided to stop by after doing some grocery shopping,  it pretty dark and gloomy inside the table I sat at had a weird odor.. I sat down looked around for a moment and got the menu and decided I was gonna try their Bun Bo!! Hold up I get a tiny dish of bean sprouts and couple pieces of cabbage and to get another tiny dish would be a $1 more . It looked like it.. taste ok They get 1 star for the slice pig feet !!"}
{"text":"MY FAV PLACE FOR PHO OR BOUN BO HUE!!! It's a family owned place and they always greet us ! Anna always knows my order before I step in there lol. That's how you know I'm constantly there lol. Also their desserts are amazing! My kids love it so much that I always have to get two cups of it !!!"}
{"text":"The Vietnamese noodle soup, I paid for 10 dollar a meal. But I can seem no noodle, I think I need to swim to discover my noodle, how cheap is that, with a large size noodle soup you serve like that, that mean you don't need us back next time. And the service attitude is worst part. They need to get some uniform to make your restaurant like a up class first. And judge your customer by a mean way. Anyway  is a stupid service won't go back. And I still leave the tip. Man I don't know if I do wrong on that part. I have suggest my friend to here before, but not any more, I will tell them don't come here again. Thanks asshole"}
{"text":"Me and boyfriend ordered the spring rolls for an appetizer... It was really small, half the size of one I would normally see... but the peanut sauce was really good. 

My bf ordered the pho and he said it was just okay and pretty greasy compared to ones we've had before. I ordered the bun bo hue and it was really good and greasy but I didnt mind.

The waiter never re checked on us and we found him sleeping on the table in the back."}
{"text":"Service is always great, food is always great, and price for pho is very reasonable. They remembered us since the first time we visited. Huge fan of the bubble tea!"}
{"text":"Great food and great service....seriously reminds me of Nah Trang and HCM City. I had the bun and the herbs were amazingly fresh. Can't wait to try the pho."}
{"text":"This place was good! Friendly staff. The tofu crispy noodle plate was really good. I liked the baby corn and the mix of vegetables. The tofu was done well and the noodles were good, they just got a bit soft in the sauce and under the heat of the veggies/tofu. There was also some weird sticky texture in the sauce, so even though it tasted fine it was a little off putting. The boba tea was so good! The frozen matcha drink was so tasty and the bobas were perfection. I actually haven't had boba this good since DC."}
{"text":"We sometimes come this pho place after shopping at G mart. Their pho is always good. Ordered beef combination soup with brisket and vietnamese spring roll(fried one), combination rice flat noodle. Rice flat noodle has abundant veggies and meat and shrimp! But some of noodles were stuck together. Overall satisfied with their service and food. 3 stars and a half! They recently added some dishes on the menu. Will try them sometime soon."}
{"text":"This place is one of my favorite Vietnamese locations around Charlotte. It's close to my work and they maintain a good quality of food, service and presentation. Their summer rolls are excellent along with the peanut sauce. 

I would recommend this place for pickup or lunch, it's not a hangout or seated dinner destination for a group. Service is slow if dining in, I normally order in ahead of time so I make it back to the office on time. 

Hope you have a pleasant experience like I have!"}
{"text":"Pho Huong Que is not some place you would normally drive by and be like \"OMG PULL OVER THAT LOOKS AMAZING\" They let their food do all the talking so getting in there is step one.

Step Two: Order

Everything seems to be super fresh, and the spring rolls we're hot and delicious.
My fiance had some Pho which he enjoyed, while I had a chicken/beef/shrimp and veggie plate with some type of noodle. Although the water forgot about my bubble tea, he was kind and attentive and brought it to me right away when I mentioned it was missing.

The food overall is good, and I will come back in the future."}
{"text":"I love this place. The pho is awesome, the prices are extremely reasonable, the bubble tea smoothies are the best in town (I think they use fresh fruit in a lot of them), and the people who work there are really friendly and always able to make suggestions or answer questions if you've never had some of their menu items before. I eat something from here at least once every two weeks, and I have had great food and service every time."}
{"text":"Food was ok. I will not be going back. My wife asked for additional peanut sauce and the person behind the counter said that the sauce only comes with the appetizers. My wife polite said that she would gladly pay for it and he rudely replied no. If a customer request an item learn to accommodate."}
{"text":"Nice location near by super G market shopping center. Pho Noodle soup is great. But come with  less bean sprout. And larger noodles just like medium size. high recommend noodle style have more option. (Thin rice noodle )"}
{"text":"12/10/16 First time here. We were hungry after shopping at the nearby Costco n Super G. We also wanted to warm up with a try of Pho Huang Que's pho. 

Ordered a pho with rare beef n beef tendon. U know the rare beef cooks in the hot broth by the time u receive it. We're use to eating at East Hartford (CT) Pho 501 where the broth has bn made steeping for a long time for a rich, heavy experience. Miss it. This broth here was \"okay\" for $7.75. 

The noodle is manufactured, not homemade...a lil on the stiff, not fully cooked side but \"okay\" for $7.75.  Portion was appropriate. 

The rare beef was a lil disappointing as it was overlooked n tough by the time we got it. Read in a previous review we should hv ordered the cooked flank as it's tender.  Next time we will if we want to eat something to warm us up while in the area. 

Prices are reasonable for pho. Posted pics of the menu so u all can decide for yourselves. 

The setting is more like a cafeteria with a wide open feel. Do recommend they think about the music selection."}
