{"text":"This hospital has no clue. Poor staffing. My kid fell and hit his head, they kept him for observations yet didn't tell my wife or I anything that they found unless we cornered them. They didn't monitor him correctly either, after the ER, we got a room upstairs around 3:40, they did not monitor his heartbeat till an hour after he went to sleep for the night at 9:30. So at 10:30 they came in woke him up and hooked up the machine which made loud beeping noise when he moved. Still the nurse did not come in when the alarm sounded. From 3:40-10:30 they didn't monitor shit. So what was the point. They gave my kid sugar water without permission, which his pediatrician said not too do until 6months of age due to my wife being type 1 diabetes. The nurses would all came into our room like they were on some game show every time they showed up, even late at night. This kept my 5 month old up more than he should have been. Children's hospital indeed, they need to remember who their patient's are, kids who need sleep. We have seen the doctors for release hours ago yet are still here because the staff can't communicate well with each other. Held captive at the hospital we came to for help. Our nurse is now waiting for a call from the charge nurse on release. Been at least an hour. Phoenix children's hospital, get your shit together. Such a bad experience. Oh yeah and everything squeaked; doors, chairs, the crib, everything. Try putting a 5 month old to sleep with that."}
{"text":"The phoenix Childrens hospital is a great place that takes real good care of the kids. They also host wonderful events including swing fore kids golf classic. 

A few years back I attend an event with my brother and my mom. It was called swing fore kids golf classic. It was a lot of fun seeing all the children including my brother playing golf with the pros. My brother was diagnosed with a brain tumor and was unable to do a lot of things growing up participated in this event because it is for children with cancer. I feel that this event is a wonderful idea. The kids get to finally go out and enjoy themselves. As well as all the donations that they receive go to a worthy cause. This event is very 
important in my point of view to help the family's as well as the children overcome a lot of different things and get to do something fun. This event is hosted by the phoenix children's hospital. And sponsored by pet smart and southwest section of PGA 
. 
When it comes to this event it is not only for the kids enjoyment but also for the donations. All the donations made to this event go to the animal therapy program which helps the kids overcome the fear of their chemo, or just makes the child happy and understanding of all the pricks and pokes to help them. Therefore if you are not a golfer there is an at least 50 dollar donation fee but it includes lunch, admission 
to the silent auction as well as part of the raffle. Or if you would like to just make a donation you can go to this website http://www.cbre.com/USA/US/AZ/Phoenix/Misc/swingforekidsgolfclassic.htm?pageid=0 and fill out a donation form and send it in. They do not have a set donation goal at this time. 
When it comes to the kids at this event. I think it is a wonderful thing to see these kids out and about finally being able to have some fun for once. When it comes to a normal child who is healthy and isn't spending most their life in and out of hospitals they are able to do what normal kids do aka go to school, go outside and play in the yard as well as if their parents wanna take them mini golfing they can. As for children with cancer they have weakened immune systems which prevent them from being able to do a lot of things normal children do. Therefore the swing fore kids golf classic is a chance for these kids to go out and enjoy the weather as well as themselves. At the end of the classic as well is a 50,000 hole in one grand prize which can help pay for medical expenses even just something fun for the child themselves to enjoy. 
Therefore by my perspective I feel that swing fore kids golf classic event is a wonderful opportunity for children of all ages with cancer to go out and have a fun time playing golf with the pros. And with all the donations they are receiving while the children are having a blast they will be able to keep the animal therapy program at large to help the kids when there back in the hospital."}
{"text":"My granddaughter had surgery today, the care time and empathy the staff here is absolutely wonderful, nurse Jaci has been on top of pain meds and meeting our families need, I'm a very happy grandma"}
{"text":"My 4 month old daughter got admitted though the ED over 4th of July while visiting relatives. I was especially impressed with the IV team. They used the J-tip lidocaine device, and my daughter didn't even cry getting the IV. The ED & Short Stay nurses were professional, well educated, good communicators & reassuring. They were incredibly attentive, answering call lights promptly & offering comfort measures to me & my husband. The physicians were knowledgeable & professional as well. They explained their rationale for tests & decisions with me so I understood why things were happening. Things tools a while, as it is a teaching hospital. The two bummers is that the lights are on in the hall all night, making it hard for patients & parents to sleep. And I we had an incredibly discourteous transport worked who made inappropriate comments about his personal life & children on our way from radiology back to the ED.  Overall, a good experience & good outcome for my daughter, which is what matters the most!"}
{"text":"My son had to go here on Halloween for a minor out patient procedure. The staff was so helpful and friendly. They explained everything in great detail so we all felt comfortable with what was going on. I loved how the staff were all dressed up and having the children that were admitted still participate in Halloween. Everything was top notch, we even received a follow up call today with a nurse checking on our son.We would take our son here again. Thank you PCH for going above and beyond!"}
{"text":"This place is a shot in the dark sometimes. You can't blame an entire hospital for a few incompetent health care workers, but that being said, there are a few incompetent health care workers here. On the other side, there are some of the best nurses/MD/etc here."}
{"text":"My son has been screaming in pain for over an hour, we were flown here from Yuma and this is not the first time I have had to watch him suffer. San Diego would be my choice but for insurance reasons we are screwed"}
{"text":"I have been sitting in the waiting room for 4 hours, my daughter is having shortness of breathe. I wonder what the wait will be in the back? All I can say is thank God I didn't wait until the last minute to bring her in...can you imagine! I am not very happy, I know once my insurance pays I am sure I will get stuck with a big bill!"}
{"text":"I could not have been more satisfied with the staff! At 22 i was shocked that they would have even scheduled me for an appointment here. But they did and I had my tonsils removed everyone I came into contact with was amazing! They truly cared to make me as comfortable as possible, they truly seemed to enjoy there jobs. Everyone has off days which one nurse I believe was but it was also 6am.  But she was still nice just different.. My aftercare nurse made sure i was comfortable and not in pain. She was so helpful and truly made my experience the best it could have been. I wish I knew her name but from the pain meds and half asleep I dont have a clue! But I would recommend this hospital to any one who has to take there child here. I know when i have my children it will be the first and only place i go!"}
{"text":"We went in early (3 a.m.) on a Friday morning with my 8 year old daughter. She started vomiting after having a headache for a week. None of the \"headache protocol\" meds got rid of the headache so we ended up staying for the weekend. The nurses and the Kids Zone people were amazing, unfortunately everything else was less than stellar. The room they put us in was awful, noisy, bright and a shared bathroom (meaning only the patient can use it, so the parents staying there all day & night have a nice walk to use the bathroom). They never sent in the PT specialists we requested and the neurologists diagnosed her with migraines, but the migraine meds did not work. They released her without getting rid of the headache, but sent her home with a bunch of meds. 
We tried to contact Dr. Yonker, a Phoenix children's Hospital neurologist, because a friend referred us and Dr. Yonker was so awful that we decided to take my daughter to Cardon Children's Hospital. Needless to say, we would not bother with Phoenix Children's again."}
{"text":"I have brought my kids to PCH for the last several years, and every time we have experienced amazing service.  Our experiences range from ER visits to surgery to office visits in their satellite offices, and we have been extremely happy with all of the doctors, nurses, and support staff we have encountered.  Everyone was so kind and attentive, and the doctors know what they are doing.  It is definitely worth the drive to be cared for at PCH!"}
{"text":"I took my son to the ER and had the worst experience. Now I know that I can stop anything being done on my son that I don't believe is necessary. My son was poked more than 10 times from nurses trying to find a vein, by guessing they felt a vein. After all the poking they end up saying \"I guess he doesn't need an IV\". Another nurse forced the foreskin of my son back and told me that since I choose not to circumsize my son that I need to learn to pull my sons foreskin all the way back to clean him. I did more research, because I knew that didn't sound right plus the fact that my sons penis was red for a couple days since she did that to him. She also would speak to the other nurse about how she has more work to do and she was so impatient that a male nurse stepped in and said he would handle some of what she still had to do. Maybe all these nurses were having a bad day, but it was no excuse for treating my son the way they did and for that reason I will not be taking my children here ever again! I went somewhere else for a follow up because my son got worse and I did not agree with their diagnosis. At the other hospital the doctor wanted to admit my son because he was afraid my son would tire himself out and stop breathing! Unfortunately they said he would be transported back to Children's. Me and my husband did everything we could to buy everything my son would need so we wouldn't return to Children's."}
{"text":"Surgeon and staff was great, however, The outpatient billing office is the most unprofessional group I have ever dealt with. Just because of how they treated us, I will not recommend them to anyone. 
Apparently we had a bill of $70 left over after all the insurance payments, which would have been fine if anyone would have let us know. They claimed they called my phone several times and left messages. I keep all messages and there are not any from PCH. They claim they sent an invoice to my correct address multiple times....again, we pay our bills on time and we are OCD about our credit. So I get a call from a debt collector now threatening that my credit is ruined!!!

Does PCH billing dept offer to correct the error, NO!!!!! They say , sorry, I am on my own. Awful way to handle business. Very dissapointed !"}
{"text":"Siobhan is honesty the best nurse in the NICU. She's one in a million, she took care of my son as if he was hers, she's the most loving and caring person. Thank you so much for everything."}
{"text":"My name is Melissa Diegel and I am the mother of 3 children.  I was once a small business owner and directed a successful preschool in Goodyear, Arizona for 5 years.  Looking back now, I realize that I once seemed to enjoy the regular American life.  However, running a business 24/7 was proving to be difficult as my children's health was declining and so I decided to close my business and focus more on my family.  Before I knew, it both of my daughters became critically ill both requiring feeding tubes, surgeries and bowel clean outs, because their colons did not want to work anymore.  Hannah my then 9 year old was having trouble walking, seeing and going to the bathroom and things were out of control!  It was in May of 2013 that the MRI showed a large brain cyst pushing on her brain stem.  Yes, you read that right!  I could not believe it now she needed brain surgery on top of everything else.

Nevertheless, that is not even, what this article is about.  You see if it ended, there that would be enough to our life story!

No, You are coming into our story when all hell has broken loose.  You see on April 8th 2014 the most horrific thing happened.  My little girls were taken away from me by the hospital and given to CPS.

Both girls were inpatient at Phoenix Children's Hospital and were being treated for bowel impactions. In March of 2014, I asked to replace Kayla (age 12) and Hannah's (age 10) Gi doctor after Hannah was suffering from home treatment complications and the GI doctor Dr Siaw chose not to return any calls.  While waiting for the hospital to replace that Gastroenterologist with a new doctor Hannah ended up in the Hospital again, this time with such a severe impaction her large and small intestine was so impacted liquid contents were coming out of her stomach the wrong way.  Unfortunately, the next day her newly fired GI doctor came on shift for a 7-day stretch.  As soon as the Hospitalist told me that, her fired GI refused to run any more tests and provide more than basic care for Hannah including nutrition I filed a formal complaint.  When all was said and done Hannah went approx. 22 days with minimal nutrition (like fasting) because of the medicine it took to clean out her colon. 

Approximately 2 weeks into the hospital stay I left the room to go get a soda for Kayla and was greeted by a social worker in the gift shop.  She then escorted me to a room in which there was an officer and several other people.  They took a statement and then said they were escorting me to my car and that if I came back to the hospital they would arrest me.   It was that day that I learned that that they were claiming I medically abused my child. 

I believe the doctor acted out of retaliation.  We also asked for a second opinion while inpatient they (the doctors and CPS) said no.  We asked to transfer hospitals our insurance said yes and the hospital said no.  Now my girls are stuck in the system and are being harmed.  The same doctor who ordered for the feeding tubes to be put in the one I fired has now ordered for it not to be used in Hannah.  In addition, Kayla was using hers just 12 hours a day instead of 24 hours.  I was just informed he has ordered for both girls to stop using their tubes and he wants them to be removed.  Both girls have a diagnosis of gastroparesis/ delayed gastric emptying confirmed by a nuclear scan.  The removal or non-use of these tubes could be life threatening.  No tests were done on the girls that would show suddenly why they would need to be removed.

In addition, a geneticist that had just recently transferred from Boston Children's Hospital to Phoenix Children's Hospital had recommended a series of tests be run on the girl's just weeks prior to the girls being \"taken.\"  This coincidentally is the same hospital in which Justina Pelletier was held captive.  Some of the tests the geneticist wanted to do were for deletion syndrome along with a possible smooth muscle disorder connected to Kayla's C-2 deficiency.  He also suggested that some kids with mitochondrial disorder have a congenital disorder glycosylation.  Many other specific tests such as small bowel biopsies were recommended as well. 

Please help us spread public awareness!  Thank you!

          For more on our story please visit us at www.justiceforthesisters.com



Worse yet is the fact that we are not the only family this has happened to.  Phoenix Children's Hospital really can turn into a parents worse nightmare.  Is has for dozens of parents I have talked to.  Educate yourself follow our story."}
{"text":"This is the best hospital, hands down! We've been here for 4 days in the PEMU. Every single person we encounter is super friendly and attentive and I'm not just talking about the nurses and doctors, the janitors, security guards, cooks, volunteers ----everyone! During the day, there are volunteers who come in and offer parents coffee, magazines, books, even toiletries. They even had a \"parents night\" where a volunteer came and watched my children while my husband and I went downstairs and attended a canvas painting event catered by Zupas Cafe. They have therapy dogs that come and pay a visit to the children, they have child life specialists, who bring toys and provide entertainment. There are great children's movies playing around the clock in-room. Oh and I have to comment on the food from the cafeteria ---amazing! What really blew me away was the fact that I was able to get a grilled pork chop, haricot vert, and sautéed potatoes at 1am! Above all, I feel that my child is receiving the very best care possible at PCH!"}
{"text":"Mark E. McOmber, MD was so kind and helpful to our family.  His plan for treatment of our children was well explained to us, and he made us feel good about our options and decisions.  It is a relief to have a Dr. who shows the same level of concern for our kids health as we do.  We highly recommend this doctor!"}
{"text":"My husband and I have brought our son to see both a Pediatric Urologist and a Pediatric Neurologist at Phoenix Children's Hospital, as well as having had services like MRI's conducted at the hospital.   Each experience has been positive - as far as any medical visit could be.   The waits haven't been long.  The staff has been courteous.  The followup has been great.   The facilities are gorgeous.   

I would add a couple of opportunities for improvement (which is why there is one star missing from this review).  First, I think that they should add the ability to send email confirmations for appointments.   (In the one instance, the hospital called to schedule an MRI while we were on vacation and I had no way to write down the appointment time.  When I asked if they could send me an email confirmation, they said they weren't set up to do that).   The second opportunity is with the main parking garage.  The security guards were \"quizzing\" us as to the purpose of our visit.   My husband and I were both perplexed as to the line of questioning.  I think they should coach the security staff to phrase the question better -- especially if it's meant to be helpful.

Other than that, I recommend this hospital, services, and staff to any parent who needs pediatric services.  This is a top notch hospital!!!"}
{"text":"Phoenix Children's is quite possibly the worst hospital in all of the valley. Took my daughter here the other week for symptoms of appendicitis. The doctor ordered a bunch of tests, including a urinalysis, but wouldn't let me give my daughter anything to drink for several hours until ultimately the other tests came back negative. The nurse who drew my daughters blood didn't even have all the items she needed to do it and had to call for assistance while my daughters blood was gushing out of the IV she was inserting. The facility was kept at an unreasonably low temperature. It was warmer outside in the shade at 6:00AM with a gentle breeze than it was inside. Staff wouldn't do anything other than offer a thin blanket. We ended up leaving before they got a urinalysis so I could actually get her diagnosed and treated. Not to mention the fact they refused to even let us leave and threatened to call security if we attempted to until they came back with the discharge paperwork, which they took their time on printing out.

If you care about your child's well-being, stay far away from this place and seek treatment for your child from real medical professionals, or be ready to punch your way out of the place to do so."}
{"text":"I am appalled at the incompetence of Phoenix Children's Hospital. My 5 month old son had a sedated MRI on July 27th and when we requested a copy of the MRI we were mailed another child's records. Even worse, I just found out today that the blood drawn while my child was sedated was submitted incorrectly and the lab needs a new blood sample to conduct the tests. We had been warned about the incompetence and took three copies of the prescription for the needed tests and showed it to everyone we came in contact with and this was still done incorrectly. I am so furious that I have to subject my 5 month old son to another blood draw! How are we ever supposed to trust Phoenix Children's ability to get anything right?"}
{"text":"Fantastic people here. Flat out amazing the sacrifices the staff makes here and the truly genuine feeling of compassion you get from them. Great job Phoenix Children's Hospital. Keep up the great work!"}
{"text":"I'm writing this review as I'm waiting for the discharge that was supposed to be done hours ago.  My daughter was in pain yesterday for hours before they could order pain meds. I told 2 doctors to order them and several nurses. Waited about 4 hours and they did nothing until my daughter got super fussy and was screaming due to the pain. That's when a nurse came to the room and I told her that this was ridiculous!  Now It's almost noon and my daughter hasn't gotten her antibiotics. They keep saying \"It has been ordered and we are just waiting.\"  I was told we would be discharged in the morning and it's almost noon.  Super disappointed"}
{"text":"I think it is extremely fishy that only five star reviews are allowed to remain while 99% of the one stars are in the 'not recommended'. I've had my experiences with Phoenix Children's Hospital as I have four children, and believe me I was underwhelmed. I took my oldest son to the pediatric rheumatologist because my son was having muscle pains and symptoms of fibromyalgia (which runs in my family). First off, my nervous son was cracking jokes (making fun of himself) and the nurse looked at me and said to him with a frown, \"Why not tell some blonde jokes,\" (yes I have blonde hair). She was very short with me, so I thought, well...I'll just wait for the doctor and keep my mouth shut. He walked in, didn't greet us, barely listened to me explain my son's symptoms (and refused to look at me at all, to boot) and basically he told me that there is no such thing as juvenile fibromyalgia (oh yes there is Doc, but obviously you fall into the category of 'it's not a real disease') and he hinted that maybe it was my poor parenting that was causing my son's pain. OK. $75.00 copay for this. So he sends us for blood work, and my son is TERRIFIED of needles. I thought surely because this was a children's hospital that they would have phlebotomists who would be understanding and kind. No such luck, these two woman (Ms. Ratchet and Ms. Griese I called them in my mind) were impatient and outright mean when he cried and was afraid. I calmed him enough to let Ms. Ratchet get a needle in (no words of comfort, just rude and brusque) and he let out a wail...she yanked the needle out and sighed \"you are just going to have to calm him down, ma'am\" and I had had enough of this place. I said to my son let's go, we're out of here. Both Ratchet and Griese argued with me and said Oh no you can't leave, the doctor will be mad, blah blah. I said watch me. That was my first introduction to PCH. The next one was my youngest son needed surgery to correct the hole in his heart, he was an early preemie and had PDA. I will say his cardiologist (Dr. Graziano) is WONDERFUL, a kind man who genuinely cares about his patients and has great bedside manner. His surgery was scheduled for PCH and my husband and I were there for the procedure and stayed overnight with our son. Before the procedure Dr. Graziano told us to come by the surgery room and we could come see our son before he started. When we did, two nurses tried to push us out, and when we explained they refused. The doctor finally came out and said that he told us we could, and they weren't happy at all. But we went in, kissed our baby, and he had a successful operation, thank goodness. We stayed overnight in a cramped tiny room with another family who had about 20 loud family members who took over the room and the TV (they had an adorable baby there too). It was truly uncomfortable as we were treated to loud family arguments about if they could get dinner with their food stamps, etc. Years ago one of our sons had seizures and was airlifted to Northern California Children's Hospital, and we stayed in a SINGLE room with our son and were welcomed like family. This place, a room half the size of the one at NCCH, was crammed like a tuna can. The cafeteria was way underwhelming and rather expensive. I honestly couldn't wait to leave. Next experience, my oldest son had to have surgery on his knee, that was a success but I found their billing department really pushy...the day before his procedure billing called me up and in a loud tone of voice announced that my insurance was paying a certain amount and that I would owe fifteen hundred dollars, did I want to pay the full amount or make payments???? Turned out she was wrong and I owed less than half, but really? What if my son had cancer and we were grieving, is it necessary to call and yell at parents to make sure they get their almighty dollar? Lord knows my insurance company was paying them a huge chunk of money for a basic knee procedure (ten thousand dollars to be exact). This is why I side eye all those donation drives PCH has, who is this money benefiting? Because they sure are aggressive about getting their money, enough to call and harass parents who are already distraught over their child's injury or illness. I've decided when it comes to my children, I'm completely avoiding this place. The Northern California Children's hospital seemed to genuinely care about children and their families, Phoenix Children's hospital seems to care about money and fund raising. I'm underwhelmed by far and I'm sure this review will end up with the 'not recommended' pile so that PCH can keep their four or five stars."}
{"text":"Great and fast service. The nurses all worked together to input our info and attend our baby. Very friendly staff. Even tho we are from California, this has been the best service we've had for our kids medical needs. I recommend this place if your ever in this city and in need of medical attention. But God forbid your child is really ill. Great work PCH!!"}
{"text":"Disrespectful staff. Nurses and NP's discussing patients information in the hallways right outside other patients doors. Laughing in hallways about patients conditions, and admitting they have \"no clue\" what's going on. Will choose to take my child somewhere else next time."}
{"text":"Omg! we drove all the way from Avondale because our pediatrician said it would be a best option. My son has an ear infection but needed an X-ray and urine test. We got there at 3:15...and with a feverish crying baby, like a lot of other partners there.. We waiting for 3.5 hours just to have his vitals taken... Then we waiting another 3 until I am not kidding past 9pm to finally get asked to go in!!!! We gave my son Tylenol 1 while waiting for his fever. He is 9months old. Then.... We waiting another 1 hour for the doctor who seems to be in a hurry and not care about our son... Then another 3 to get him checked and cleared to go home. We got there at 3:15 wedsneday got asked in at 9pm and left at 3 am!!! Now 2 days later we find that they gave us the wrong medicine!! Now my son is has blood in his stool!! I honestly do not recommend them, them saying they care and specialize in kids is all marketing bullshit! They are no better than any other hospital or Doctor. Actually you're probably better off going to those Urgent Care locations. - now just wait for the large sum bill they are going to send me becuase of their expert service! Horrible."}
{"text":"Test of patience in four levels. They move you from waiting room 1 to waiting room 2 to waiting room 3 to waiting room 4 before you can finally see the physician for a couple of minutes.
At all four levels, they refuse to give any estimate of waiting time. We had to wait for well over 2 hours and would've definitely gone back as soon as we stepped in if we were told that it was going to be so long.

Edited to include additional information:
A few days after I wrote this review, I got a ridiculously high bill in the mail. I wish we are given a ballpark estimate of how much the service would cost before we decide on whether we wish to avail the service."}
{"text":"After the experience I had with my son today at the general pediatrics, which was disappointing since I've been taking my kids there for almost 10 years, I will NOT be going back. If you're going to be a nurse working with children, I suggest you have a bit more patience and compassion. And threatening kids is not a good idea either. I walked out of there so angry and upset while trying to calm my son down. I just cannot believe this horrible experience. Sorry PCH, you lost my patronage."}
{"text":"PCH is a great hospital and you can get the best care and help for your kid or teen.And the doctors and nurses here are very kind and very helpful here."}
{"text":"For emergency care for children this is the best in the Southwest. Security and cctv is very excellent and well controlled environment. However, please note after the initial triage then appointments are late and failure to return phone calls a big issue."}
{"text":"This is the more carrying hospital I have ever been in. It's about the children. It's about the children. Did I mention that it's about children. there is not enough room here to fully describe how wonderful they are. Been here a couple of times with the grandson and they treat him like royalty!!!!"}
{"text":"Initial:
So i must say this is the BEST hospital we have ever been in. Everyone here is on top of their duties. Right from entering you are welcomed & they direct you to the right department with kindness & overall the concern as to why you are at the ER.

Pros:
Dr. Justin Lee is AMAZING!...Every Nurse, Physician, CNA, Registration staff that attended us were so professional & knew exactly what they where talking about.  They explained in detail what was going on & what procedures needed to take place to achieve the best outcome.

Cons: 
None...... absolutely none...

Overall: 
I must say if my kids ever need to jave surgery again... I will make sure I come to this hospital. 
This hospitalis dedicated to the care of kids.. & they did everything in their power to make sure they were amazing to my daughter during her surgery & stay.


The one in Yuma, AZ isn't even on the same level as this one..."}
{"text":"So far this is the best children's  hospital  I have been  to. My son has ben inpatient  here for a week now Im verry impressed  with everything  about  the hospital  overall.  The doctors  are very  caring and loving they communicate well with the parents. I like how they do a through  job testing my child and treating  the problem  right away before  giving my child  medicines that affect the heart they do additional  testings a ekg to make shure  his heart is healthy  enough . They also monitored my sons condition to make shure  he has no negative  reaction rather than just sending  him home like other hospitals  would do. They offer a lot of resources and support  for parents and families.  Yesterday  we took my son to the child life zone it is definitely  the happiest  place in the hospital for the kids to go. It is a indoor  play center  where  kids and visitors  can enjoy  different  games, activities  and events. Im glad they have this place because  it made my son happy again. They have pool & air hockey  tables, monopoly  pin ball machine,  x-box, Internet they even have dry erase walls that the children  can draw on with  dry erase markers and it wipes right off without  leaving  ink there's  so much more. This is a great hospital  to take your child to."}
{"text":"I was extremely disappointed with the service. I waited two hours for my son to be seen he's only two months, when I ask the woman at the front fest how many kids were ahead of us and about how much longer the wait would be. She said there was seven people ahead of us. We waited another 30 minutes and they had called more then 7 people.  There seemed to be no urgency for my son to be seen. Every time I bring my kids here the wait is terrible. In total I waited 3 hours and ended up leaving upset!"}
{"text":"Terrible from top to bottom.  My daughter spiked a 100+ fever after a round of vaccines, so we went to get her checked out in the ER.  First, the nurse insisted on taking a rectal temperature even over my objections.  Then, we waited four hours in an absolutely disgusting waiting room to see a PA (not even an MD).  When we asked what on earth could be taking so long, a rude, condescending, unprofessional nurse took a break from gossiping with her colleagues to sneer an explanation as to \"how the hospital works\" (it doesn't).  Then, as icing on the cake, we get a bill for over $800.  To see a PA.  And to be prescribed ibuprofen.  This is by far the worst, that's not hyperbole, ER experience I have ever had.  People with sick kids shouldn't be subjected to this and PCH should be ashamed of themselves.  I will never, and I mean never, return to this hospital."}
{"text":"went to emergency room with my infant son, waited over two hours and everyone who came after us was already seen. When asked why I am waiting so long, they told me the other cases are more severe than mine and there's no indication of how much longer I will be waiting. So, I told them I was leaving and they forced me to get vitals. So, long story short, I am getting a bill for $175 because they did these vitals...they wouldn't let me leave otherwise yet they are telling me my case is not as urgent. The nurse was so incredibly rude about it too. This is sad because I used to be a big fan of PCH but now that I have had one encounter with him, I realize they are a business just like anywhere else. I have never had any of these problems at Cardon's. Expensive lesson learned."}
{"text":"Our experience is far from over, but I must balance out these negative reviews. We are three days into our newborn son's stay post an emergency airlift after delivery and we have had a stellar experience. The team in the NICU are not only incredibly kind and compassionate, but they are the best-in-class providers. We will forever be indebted to them."}
{"text":"Ok first of all I must say that we LOVE Dr Rastogi. In PCH neurology.
2 of my girls have been patients of hers for several years. We adore her!
That being said.
Idk if they have a new person working in the prescription refill department, but I have NEVER had an issue before now.
My daughter ran out of her meds over a week ago, the pharmacists have faxed the request 4 times and still nothing.
This is a daily medication she takes every night for the last several years to prevent her migraines.

I finally had to call the doctors office to see if they were getting the requests, I left a VM and the woman that returned my call has been so terribly rude over the phone, and I can't talk to her in person.
I left 4 messages spelling my daughters full name, DOB, Doctors name, meds needed, dosage and how much she takes, the pharmacy telephone number and fax number and my number. I repeated this info 3 times in each message.

She has called from a blocked number and left very rude messages saying your daughter needs to have a follow up, so I can call in 1 refill that's it.
My daughters follow up is scheduled for the 20th of next month!
Then she says I need to know how much you give her, because it's been several weeks since she was seen.
I left that info on the VM and the request from the pharmacy has all of that info. 
My daughters appointments are always 3 months apart.
So I call again, and leave the same info again.
Still nothing.
My daughter is going through severe withdrawals from not having these meds for so long.
I called the appointment desk, and spoke to a live person. She was very kind and could not believe this was happening, she patched me through to the nurse.
Another VM explaining everything again.
No response. 
Then my husband called me and said I just got a very rude message from a lady at PCH dr Rastogis office.
She called him! Asking for the same info! We have both called several times and left several messages!
I can't do this anymore, I'm watching my daughter suffer through withdrawals, something she should NEVER have to go through, so I am searching for a new neurologist.
Good luck to anyone who has to deal with that woman!"}
{"text":"I brought my 14 year old son to PCH Emergency room at 5 AM with excruciating stomach ache. He didn't sleep all night. I know my son, like all moms do, and I knew something was really wrong. When the doctor came in, I asked for an ultrasound. She said that she had at least 3-4 cases in the last 4 nights where kids came in with a stomach virus(tummy ache, vomiting and diarrhea). I explained that my son had a very bad stomach ache and no vomiting and no diarrhea. I also explained that he's had stomach viruses in the past and this was different. She ordered an X ray and said that if it comes back normal, they will send him home. It was normal. I begged for an ultrasound again, and she said that there is no indication for an ultrasound because he probably has a virus. She was almost annoyed with me and said that they will do a blood test and if everything is ok will send me home. Blood test showed elevated white blood cells. Once again, the doctor said it's consistent with the virus. I told her I know something is wrong. She ordered some liquid med to coat the lining of his stomach to make his feel better and send him home. I was terrified as my son was in so much pain and I didn't know how to stop it. He threw up the medicine. We were there for hours and hours until the pain finally started to migrate from his upper abdomen to the belly button area. At that point they finally decided to get an ultrasound. It took them more than 1.5 hours to get back to me and let me know that they will take him for a CT. It showed Appendicitis with possible rupture. An hour later, he was in the OR getting EMENGENCY SURGERY. I found out after the surgery that the 2 doctors were residents and the attending doctor that signed off on the case never came in once to see us. His pain got so bad that a shot of Morphine they finally decided to give him hours later, didn't even help. 
I took him to PCH because they advertise that they are one of the Top hospital in the country. I agree with other departments of PCH, but definitely not the ER portion of it. We thank our lucky stars that his Appendix did not rupture since they took so many hours to finally do an ultrasound that I asked for as soon as we got there. Word of advise to these new doctors: The human body is not text book. Just because he didn't have pain around the belly button radiating to the right, and just because you saw some kids in the past few nights with a stomach virus, doesn't mean that you shouldn't investigate further. Every patient is different! My child is proof of that. 
I must say, the Surgical team was great! It's the ER that I will NEVER go back to again!"}
{"text":"The views expressed in this review do not necessarily reflect the views of PCH

Oh I've been waiting a long time to write this review. I could write for days on this place. Sooo many days...but I will resist.

I Intern here and in close proximity of the physicians and administrators. Knowing that, I can say with a clear conscious that a vast majority of employees in the dept I work with are passionate about kids. Take my bias as you will, but I can say if your child has been involved in a injury the place you should take your child is to PCH's Level 1 center. 

The doctors work very hard, the research is hitting full speed and they are getting national recognition. It's a good time for PCH. 

Plus its very clean. That is all 

R\_ 

Intern :P"}
{"text":"Great looking hospital! The cafeteria here is awesome. I don't know if they let you eat here if you aren't visiting someone but I hope they do after the person I've been visiting is discharged. The food is great and the prices are amazing. I got the cheese quesadilla with jalapenos inside with guacamole and sour cream on the side with sweet potato fries for under 4 bucks. The quesadilla was huge and they gave me a bunch of sweet potato fries. This is the biggest and cleanest hospital I have seen in Arizona. Whoever runs this place is doing an incredible job! Oh yeah, they have a starbucks inside the hospital."}
{"text":"If you are getting a procedure done as outpatient, I would recommend this hospital. If you need inpatient services, I would recommend a Super 8 motel before I would recommend this place. I gave them a 5 star review so that my review would not be moved to the \"Not Recommended\" yelp reviews (you should really take a look of those). In fact, I am writing this review from my hospital bed at Phoenix Childrens Hospital. Keep in mind I'll be 18 in a month. 

This all started when I got referred to a GI at PCH for constant nausea and abdominal pain. I had also had 2 ultrasounds prior showing a cyst on my pancreas and possible fatty liver disease. The GI (Dr. Raizner) was not interested in any of this. She was convinced that I was extrememly underweight even though I have been the thin my whole life. Dr. Raizner kept using the term \"extremely underweight\" to convince my parents to admit me to the hospital.  Now here I am, stuck. I haven't seen Dr. Raizner for three days and things are much different than she said they would be. She told me I was being admitted so they could see how I normally eat at home and count the calories. Here's how it really is: I have a 24/7 \"sitter, I have to keep the door open when I use the restroom or shower while the sitter stands by the door, I can't pick my own meals and if I don't eat every bite they force me to drink a warm boost shake- the whole thing. They also kick my parents out and take my phone away for 45 minutes at meal times and I can't use the restroom for an hour and a half after eating. My boyfriend said he even heard my nurse conplaining after leaving my room dropping off my food. Once when they brought me dinner and I didn't like it, they forced me to drink 2 warm shakes and then I felt sick to my stomach. I asked the nurse to get a pan for me to throw up in and she walked in with an annoyed look on her face, handed it to me, and walked out without saying a word. I also have to share a room and the parents stay up late being loud and watching tv, not caring that I am trying to get some sleep. The nurses don't even care.

Please don't take your child here for any inpatient services. They have a history of calling cps if you want a second opinion and I am still trying to figure out how to get out of here. I feel much worse and stressed out than when I came in."}
{"text":"They have been so great every time we have needed to bring one of our children in. Haven't experienced any doctor that we haven't liked so far, in 5 years."}
{"text":"pretty hospital great staff!! I had a  great peds rotation here and the place is brand new, plus the food at lunch is so good and international. Like a children's hotel!"}
{"text":"Unfortunately we are frequent visitors here; but we would not go anywhere else. Great staff, amazing nurses and great doctors. Our favorite doctor here is Dr Matthew Troester. He is hands down the best neurologist here (we have seen them all). 

Their ER is also great but unfortunately the wait times are pretty horrible. There have to be something they could do to improve on that. Another thing that I wish would be different is the amount of residents that come in to talk to you and ask questions. It's very tiring and difficult sometimes to have to tell 2-4 people the same thing."}
{"text":"I could not be happier with the service and care of PCH and especially the Endocrinology team.  Wonderful doctors, nurses and office staff"}
{"text":"Love the women in the ortho department, she is amazing and so smart! And she cares for my child so much. Thank you Dr. A! You the best!"}
{"text":"Everyone at this hospital was so nice and helpful! My daughter was seen on the 7 floor for testing and surgery one of her Nurse name was Dan he was so friendly and nice that my baby didn't want to go home when it was time By The way all the nurses were awesome and very attentive Id definitely recommend this hospital to anyone who wants All the answers and The best care for your child or children"}
{"text":"I will never take my kids to this hospital again! My 5year old was crying in pain and had a fever of 102. When I arrived I was carrying her and there was a line just to get checked in. In front of me were older kids that did not appear to have anything wrong with them. They were walking, smiling, talking and obviously in no distress. When I asked the RN who was checking patient's in if their was a priority to who gets triaged first  and told him my daughter had a fever of 102 and she was crying in pain  he said we had to wait.  I left and went to Maricopa Medical and had the best treatment I ever experienced."}
{"text":"We have been trying for almost 2 months to get a billing issue corrected. We hVe twins. They both had the same radiology procedure. Our insurance covered one but not the other because phoenix childrens hospital put the wrong billing code in for one child..like duh! So we called billing. They told us to call our insurance. We called our insurance and they told us the hospital put in the wrong billing code. We have called the actual doctor at the hospital and ,eft atleastthree messages on the nurses line.. No call back. Every time we call we get pushed to different areas that cant help and we get tput on hold. I am seriously starting to think this is a deliberate move by the administration to not correct billing issues... Very sketchy. If you ask me! My husband and I now have to go to the hospital to find these people face to face. Luckily we have twins so we can provve they messed up... I wonder how people with one child handle it?"}
{"text":"PCH is our go to place when my son is having respiratory problems, even though we live in the far west valley. We have been through the ER several times for Asthma attacks and every time they have triaged him appropriately and gotten him seen in a reasonable about of time. His last visit last week the waiting room was packed but he still was seen by a physician and respiratory therapist withing 30 or walking in the door. The staff and doctors know how to work with young children. I highly recommend Phoenix Children's."}
{"text":"EXTORTION ON EVERY LEVEL!!!

PCH has absolutely the worst billing system! Let me start with our visit to the ER. My son developed endophthalmitis (severe and dangerous eye infection) so he needed immediate surgery. We had to check in through the ER and everyone dragged their feet with the paperwork like he had a scratch on his arm or something. No sense of urgency AT ALL! After we checked in and my son was already in the private area they kept sending people in that had no business being there only so that they can bill our insurance for every single useless person that came in and asked what was wrong with him. Even though the surgery was scheduled by his doctor already! 

It gets worse! The surgery was Friday. Sunday he needed these fortified antibiotic drops that could only be mixed by a sterile compound pharmacy which, of course, in a 5 mil urban area could only be found at the hospital on a Sunday. Guess what? WE HAD TO CHECK INTO THE ER to pick up the prescription!!!!! We had to drag my poor son to the ER, wait in the waiting area for 2 hours, be seen by a hospital pediatrician (who came and said \"oh, it's you again, guys\", turned around and left), just to PICK UP THE DROPS!!!!! Of course they got to collect $700 from the insurance for that plus the cost of the prescription. And then we wonder why our health care is so expensive!!! That's pure extortion! 

The night shift nurse was terrible. After my son had an emergency eye surgery she couldn't wait to kick us out so she could go home. Seriously! My son wasn't even awake yet, she loaded him in a wheelchair like a sack of potatoes and wheeled him out of there so she could go home!!! Unbelievable! My son had 9 surgeries and that was absolutely the worst experience in the recovery room. 

Two months later, my son had to have another test done at the PCH. I called in advance to see how much it would cost. They told me if I prepaid it'll be a 50% discount. Knowing how awful their billing is I SPECIFICALLY asked them if the doctor's fee was included in that and they assured me that it was. Well, now I'm getting billed for the doctor SEPARATELY! When I called them to discuss it they say \"oh it was just an estimate, we don't guarantee that it won't be more\". It's unethical and just plain nasty to treat people like they do. People, who have kids with medical problems, and they are already worried and stressed out over that. No, they'll pile up their billing on top of that and make your life miserable. Again, extortion! 

Shame on you, PCH!!! It's registered as a non profit so they can collect millions in donations, get tax breaks, and then turn around and bill patients for hundreds/thousands. 
 
Amazingly, there is a ton of one star reviews that are not recommended. That would bring the rating down to probably two stars at the most."}
{"text":"Full disclosure -- I'm an employee. But I'm also a mom of two patients. #1 son was in a really bad collision and was brought to the Trauma Center by ambulance. Scary for both of us but what impressed me was how organized the trauma team was. There were easily 15 people in the room working on him and it wasn't noisy or frantic. Everyone knew their role and carried it out. Dr. Segal set his broken leg and after 4 days in the hospital, he went home to heal. He's just fine now, thanks to the great care he received.

#2 son was also a patient in one of the clinics. While there was a wait to get an appointment, I think that speaks to the high demand for these specialty services. His case was very complex and I appreciated that docs from the various specialties worked together to treat him.

I'm privileged to see the passion of our staff every day. They are here because they want to care for children. And they are really, really good at it!"}
{"text":"My son recently had surgery at PCH, and was inpatient for a night.  In all, the quality of his care was good, and the doctors, nurses, and staff all took good care of him.

I know that most people don't care for hospital food, but I do feel like they should have more options for children with allergies.  My son is allergic to gluten, dairy, egg, and fish, and there were very few entrée items on the in room menu that he could eat.  There are many allergen friendly brands out there (Ians/Vans/Enjoy Life), and I think that a hospital for children should have options available for these children so they are not stuck with baked chicken for every meal."}
{"text":"Really nice and clean & really big children's hospital. They do surgeries here and etc. 

There's different doctors here. From bone to endocrinology from plastic surgery to nicu. So many doctors. Also they have little offices around the valley so some doctors work at the big hospital & the little offices. 

They also have emergency offices around the valley but are open only till 11pm or so. 

This hospital is open 24/7."}
{"text":"The best you can get in the Valley. I rarely take my child elsewhere for emergencies. Very accomodating for children and compassionate. These people know how to take care of a child! 
I had to take my daughter here for all day testing and was treated very well. While there someone with a cart came around for the parents and patients offering free coffee, hot chocolate and snacks. I have never seen this before! Seriously drive the extra miles and take your child here...its totally worth it!"}
{"text":"I don't understand the recognition this hospital gets the staff is rude and unprofessional and so are the pediatricians. They don't care to give treatment to patients they hurry you along its horrible"}
{"text":"Heads up, I'm a med student and came here for a month to do my Pediatrics rotation. I will clarify that I am not interested in Pediatrics and will not be seeking employment by PCH, so do not worry, there are no beneficial rewards that I can gain from this review!

First off, this place gets busy. It is a top 10 US pediatric hospital in the volume of children they see per year. Kids from all over Arizona are flown in if they are in serious enough condition. Many of the kids here are amazingly sick. So many of them had rare diseases/conditions that I had only read about in my textbooks. The thing is that PCH commonly sees the uncommon so they are well versed in those conditions and have no problems getting consultations and working as a multi-disciplinary team to get the best treatment results. I have been to numerous hospitals, and the residents/attending physicians are some of the most intelligent, most hard working doctors around. Common pediatric illnesses, emergencies, and the rare can all be taken of at this hospital.They have above average staff and resources to help get answers sooner rather than later.

The rooms are spacious - these rooms used to have 2 beds in one room, but they converted it to where there is only one patient per room now. So if you want to stay with your kid throughout the night, you will have your privacy and won't be cramped for space. Also, the amount of things to do in this hospital are amazing. There seems to be an art or teen game center on every floor. So many NFL/NBA/NHL athletes come through the PCH doors to greet the kids that it's really a refreshing sight to see professional athletes being so altruistic. Also, many volunteers will bring their specially trained dogs to visit each child's room (if they want)! PCH makes you feel as comfortable as possible.

I ate here for a month and I don't think I ate the same thing twice. This hospital has more food options that a mall food court....and the quality of food is amazing. It's not just \"hospital food.\" It's the next level. They have a juice bar in the mornings where you can get freshly squeezed juice. There is a crepe bar, an omelet bar, pasta bar, salad bar, grill, asian grill bar, etc....can't list them all!

One of the most fulfilling rotations I've had during medical school, and hands down a wonderful pediatric hospital. If I had kids, I wold bring them here as my first choice."}
{"text":"It's hard having your kid hospitalized but PCH is THE place for kids! From the beautiful building to the wonderful staff everything about the hospital promotes healing in a family-friendly environment. And I thought I knew all there was to know about childhood asthma, but the pediatric respiratory therapists taught me so much. Also, having \"room service\" instead of traditional food trays is great. One suggestion, provide instructions on how to  convert couches into beds for parents ( including ICU and the ones in east building)."}
{"text":"Worst er hospital experience ever, and I'm not one to complain. I have worked in emergency medicine for 7 years and 2 months ago brought my infant in to be seen after having bloody urine and 104.3 fever. We had been discharged from another er the day before and he'd been screaming uncontrollably for 7 hours that day and I was having difficulty controlling his fever. When we got there, There was a long line just to be seen by the nurse, aka get triaged. After 30 minutes of waiting just to get to the front of the triage line the nurse didn't bother to even look me in the eye even though both my son and I were crying at this point. (On a side note, not one child in front of me was crying or in any distress). The nurse showed zero empathy whatsoever. Part of triaging is assessing the sickest children first but I didn't even get a glance for my very sick baby. While I was waiting, I spoke with our pediatrician who advised me to leave considering my son hadn't even had vitals taken after over 30 minutes. When I told the nurse I was leaving she said \"well as you can see we're very busy\". To which my reply was \"I'm not asking to skip the line, only have my baby's vitals taken in a timely matter. What if he has a ruptured appendicitis or something life threatening?\". I said \"if his vitals are normal I'd be happy to wait like everyone else, I just want him triaged\". We finally got the vitals which were relatively normal after I'd dosed him with Motrin and Tylenol. The nurse said it would be probably a 6 hour wait. So we left, and went to his pediatrician who saw us that evening to evaluate us since they were very concerned and we subsequently went to honorhealth Shea.

We got our first bill of $250 on July 5. We disputed it stating we never even saw a provider and were not triaged appropriately, the nurses were very rude and even our pediatrician advised we go elsewhere. The billing lady told my husband she would send it to her manager. Today, we received a bill stating they were sending our \"$50\" bill to collections. Ummmmmm what?! We've only received one statement which we contested so not sure how that qualifies to go to collections this soon. I will never advise a patient to go there for an emergency. Ever."}
{"text":"I love all the nurses here in doctors never had a bad experience ever they have treated my son well. Rooms are kept cleaned they updated me as soon as they had information."}
{"text":"This is a review of the ER. We were so impressed with the care we received for our three month old. The check-in / triage process is extremely efficient and we were placed in a room and seen by the MD within 30 minutes. The care was also incredibly thorough -- our baby had a 104 degree fever -- and they listened to her lungs, looked in her ears, monitored her oxygen and heart rate, took her temp multiple times, checked her urine and blood, and gave her fluid. It was difficult for them to find a vein for the blood / fluid (as it is with most chunky babies), but the staff was patient and soothing as our baby kicked and screamed. We will never go to another hospital for our little one. PCH is the best!!"}
{"text":"I got some tests done here, and I had a good experience here. 

My doctor was nice, as well as the anesthesiologist and the nurses. 

The IVs did not hurt too bad. 

Finally, they pronounced my legal name right!!!!


When I was all done, I got a teddy bear and a card! 

Overall, the experience was good here."}
{"text":"Sunday, 4/15, I brought my daughter to the PHX Children ER. She's a person with mod- severe autism without a prior history of violence. Without provocation, she assaulted me & family members leaving marks and was unresponsive to communication to calm.When I was standing in line at the ER to be admitted, she began to attack me. I explained my daughter's unprecedented ,violent behavior & showed my wounds to staff. She was given a UTI test, which I was told showed signs of UTI, but they would need to be confirmed by the lab. They started her on Keflex anyway. Later, Staff sent in a social worker who set my daughter up with a psychiatrist for Tuesday 4/17 and the prescription for antibiotics to treat a  UTI. The social worker said that we would be discharged as there was nothing else to do now. She stated that my daughter didn't qualify for overnight help at the hospital per policy. Very upset, I escalated this to the Er doctor and clinical supervisor explaining that I was in fear for my safety, my family's safety and her safety. While the staff stepped away to discuss , my daughter and I were left with a behavioral tech. During this time, my daughter for the 3rd time assaulted me in front of hospital staff. The staff then agreed to keep her overnight for observation and gave her two types of medication that didn't work. During this time, she attacked me again and other staff members.  It took 2 large men and 3 women to safely hold my extra tall 11.5 year old so that she was safe and they were safe.  This happened 2x more times.Staff prescribed a stronger medication.Had I not advocated , we would have been discharged moment s prior to this.She was given a 3rd psychiatric medication . 4/16 AM: we met with a psychiatric nurse practitioner, Barbara Browder who said she would give my daughter some Rx & discharge at noon. I asked her what medication & she exclaimed in an impatient tone  ,\"Ma'm , I don't know yet! I haven't even seen her chart.\"( yes, she came into my room to speak as a qualified professional, but yet had not reviewed her patient's chart!!!!) I then asked her if she was aware that my daughter attacked me while under hospital care. Very loudly, \"She attacked you?\" A nearby behavioral tech replied, \"Yes, it's in the notes; she attacked her and some staff.\" Barbara finally reviewed the notes before she spoke to me again. She stated that she would prescribe something to help with impulsivity, anger, and anxiety & keep her until noon to ensure this med worked. I explained that I was still concerned that it might happen again if we don't know cause. Barbara said that it was likely the UTI and her hormones creating, \" the perfect storm.\"  So since the hospital was treating her for UTI and she had follow up scheduled with a psych for next day, I was initially reassured by Barbara. Later I received a text from the hospital lab that UTI was negative. This meant that  I still had no explanation & it might recur. So I decided to speak the RN on duty, Sanjay, who was professional. Suddenly Barbara just appeared & essentially dismissed him from the conversation.I tried to state my concerns & asked for overnight ob or at least a short delay in discharge. Barb's tone and demeanor were that of impatience and annoyance. I explained that my daughter's UTI results came in and they were negative for UTI, and pointed out that Barbara had said this was a big part of the reason for the behavior change and that my daughter had NOT been given a psych eval. It seemed as though Barbara thought her authority was being questioned . She then in a sarcastic tone said to me, \"I believe YOUR word was that the UTI was the \"antecedent.\" I said yes, I used that word AFTER you said that hormones and UTI likely were the cause. I used to word \"antecedent\" to summarize what you said to me, but I don't think getting caught up in exact words is really the issue. My concern is her safety.\" I asked to speak to the clinical supervisor. I witnessed a clinical supervisor Casey, talk with Barbara at length.I was completely looped of the meeting with the clinical supervisor and the psychiatric nurse, Barbara Bowden as they discussed my daughter's case. Mr. Fortenberry , a Director of Social Services, appeared approx 10 minutes after the meeting with Barbara and Casey ended. He was polite & professional and relayed the hospital party line; clearly all decisions had been made with prejudice before speaking to me to get my perspective and thoughts. I let him know in great detail my concerns for my daughter , myself, my family and anyone else my daughter encounters before her psychiatric eval takes place. I let him know that I felt unsafe driving with her. Hospital policy needs to change. The psychiatric nurse practitioner, Barbara Browden needs a refresher course on compassion and communication skills when dealing with families during trauma. Additionally, she might consider reviewing patient files BEFORE meeting with the patient."}
{"text":"The staff at Phoenix Children's Hospital were amazing when we brought our son into the emergency room because he was suffering from joint pain and could no longer walk or even support his own body weight. They worked quickly and with a tremendous amount of care and concern for my family's wellbeing. My son was diagnosed and given a care plan that put me at ease after feeling lost and frustrated when two prior dr visits failed to get us answers. Thanks especially to Dr Jared Muenzer, and all the nursing staff!"}
{"text":"Went to PCH Jan 6. My son had an elevated heart rate, high BP, was dizzy and weak and felt like he was going to pass out. He has Lyme disease and I thought he was having a bad reaction to the medication he's on We waited close to 3 hours. I checked in twice as he was going downhill. They eventually took his BP and again told us to wait. I told them he was hyper sensitive to sound and light. Sitting in the ER made him worse. He could barely sit up. As we neared 3 hours I was told there were still 4 people ahead of us. We left. I told the desk person my son was too sick to sit in the bright noisy room. I wanted to make sure I wouldn't be charged for the visit since they didn't have the capacity to treat him. They said I would not be charged. We went home where I spent the night holding my son crying trying anything I could do to make his pain go away (by then he had a severe migraine and still a racing heart rate). We considered calling an ambulance, but did not want to return to pch. A few nights later we instead went to the chandler regional ER which was an entirely opposite experience. Today....I received a bill on the mail from PCH for $250. This is a hospital that turned away my son and refused to treat him yet I'm still expected to pay them??? I will never step foot in PCH again. I am in utter shock that they think this is appropriate. And yes I called to dispute the bill. The $250 is a charge for them to take his BP.
Update! They're actually charging me $1350 for a 3 hour wait and for a blood pressure reading! Really???!!!"}
{"text":"I live about 3 miles from this Hospital, 2 Days ago my 2 year old ran past a metal table and got a 4 inch cut on her cheek from the eye down below her ear, it was about 3/8 inch deep and bleeding BAD.  We drove straight the Children's and the staff was very quick and friendly, we waited about 2 minutes to see a nurse and they stopped the bleeding, numbed, cleaned and glued the wound shut all in about 75 minutes(including 45 minutes for the numbing gel to work!) Afterward the doctor came back and told her he was sorry he 'made her cry' and gave her a stuffed Pluto the dog, about a minute later the nurse brought her a Popsicle, she was smiling and laughing all the way to the car and we where there for only about 2 hours."}
{"text":"We had an appointment at a different place and the woman at yhe frony desk she called childrens hospital to see if iy was there instead. She was sweey enough tk ask the childrens hospital if they could allow us to come since we were missinformed. So I took my nephew in to see the neurologist at the children's hospital. It was so welcoming and clean. Although, the woman at the front desk seemed to of been having a bad day. My son wanted a sticker and he couldn't decide what he wanted and she said \"hurry up and pick one or I will choose one\" she seemed very impatient because it was onky a second it took him to decide she then counted 1..2..3. I pick. The dr he was very welcoming he explained everything that my nephew needed and how to help him. My son even enjoyed his time with the dr and he wasnt even being seen."}
{"text":"This place is awesome.  It's a one-stop shop for all your pediatric needs. You can stop reading right there if you want because that sums it up.

We have a teenage girl.  It's pretty silly that \"adult\" doctors won't see her until she's 18 because in every other way except the calendar she's an adult.  Fortunately they have a pediatric gynecologist here at PCH.  Her pediatrician recommended she come here to consult about occasionally-severe dysmenorrhea.  She said Dr Williamson was great, so we made the appointment.

Well, Dr Williamson was great.  She communicated very well with our daughter (communicating with a teen is an art form!), and was very thorough.  She asked lots of questions, did a lot of poking and feeling (\"does this hurt?\"), and then had her last blood-work forwarded to her office.  After examining the results she ordered the tests she felt were missing, wrote a prescription for hormone pills (low-dose oral contraceptive; in this case it should smooth-out the hormones to reduce or eliminate the 'cramps', will help with acne, and of course it will prevent pregnancy).  She spent a LOT of time with us.  None of that hurrying out the door nonsense you get with a lot of doctors.  She was great!

Then we were able to get the blood-draw and the prescription filled in the next-door building on the PCH campus.  So we were able to get everything taken care of in one trip.

It's inconvenient for us to come here because we live in Gilbert, but we will be coming back.  Dr Williamson and the PCH are worth the trip."}
{"text":"PCH is an excellent Children's hospital in addition to the amazing care and expertise of this well known facility did you know, that they have a children's toy donation department called \"Child Life\", it is this department that takes unused, boxed toys and it is inspected for each child to deliver to personally. Some of these incredible kids come from various situations of broken homes, poverty, trauma/PTSD.  

I have chosen to participate in giving yearly to PCH and this year, I was very fortunate to find wonderful discounted deals to get more toys for these kiddos and I also came across other kindhearted souls to help with participation.

Here's a true story that must be told! A complete stranger I had met while shopping overheard my conversation with myself being a nurse and using my own funds in collecting toys for kids as he was leaving from a sale, this young man turned right around and said, \"God is telling me to give this to you (it was $100!)\", I told him, no I cannot accept this, you don't even know me and he insisted he wanted to give too. I weeped in joy. Unfortunately, I did not get this gentleman's name as he left immediately. So hopefully, he sees this post.

(will post picture soon) Here are some of the items that have been donated recently. I LOVE kids and its amazing to give without expectations. 

If you are interested in donating toys for various ages and both to boys and girls... 

(Child Life) is available Monday through Friday from 9 am - 4 pm.
One can ask for this department at the main lobby of PCH and a representative will come down to meet a toy donor.

I also have collected for my adolescent patients with art supplies and stress reducing coloring books. I am so proud of the amount collected and the priceless expressions from my pts when receiving these and that it was there's to keep and not something that was being donated as a community use. :)"}
{"text":"My daughter had an appointment here with the dermatology department. She is 3 and gets nervous going to the pediatrician much less a hospital. From the second we walked in and she saw the color-changing lights and glitter in the floor and the cute murals all over the walls she was at ease. We actually stayed after so she could watch the lights. It was cute. I highly recommend them."}
{"text":"Best atmosphere and cafeteria! The facility is clean and staff is very friendly, making it easy to navigate."}
{"text":"Disgusted with the phone service. Trying to reach someone in Gastroenterology dept. Scheduling is a call center so they can't just page someone. For clinical services, you have to leave a message. If you miss their call, they don't leave you a direct number to call so it's a phone tag game. I'M FURIOUS. my phone just dropped a call - woman didn't bother calling me right back. Guess i get to play this game tomorrow again. RIDICULOUS. and to be honest, I'm not that impressed with my daughter's doctor in the first place. The advice I've gotten has wildly vacillated from one extreme to the other in a matter of weeks. absurd."}
{"text":"Phoenix Children's Hospital is a wonderful facility with caring doctors, amazing, loving nurses and an incredible Child Life team! 
Each child is treated with love and as if they were the only patient there. I am impressed with the specialists that remember my son's name and my name. 
Of course, one hope's to never have to take their child to a hospital, sit in a waiting room enduring the strain of nerves, or feel the fear of a new diagnosis, however, if those events are ineveitable, Phoenix Children's Hospital is definitely the place to be. The hospital has the staff, information, specialists, support teams and care to help each child, parent and family member through the experience!"}
{"text":"I L..O..V..E..this hospital! 

Many families don't have children that need acute care or have kids with an incredible diagnosis, but I do. Having this hospital and its doctors as a part of the circle of success for my Princessa is priceless.

Born with a rare and terminal brain abnormality, I am always critical about those that provide care for my daughter. Every visit here has been a good one. They are compassionate and generous and very helpful.  She is always very calm and comforted during her visits and full of smiles.

When she smiles, I smile because I know she is happy and content.  

Any time and every time we have to seek care, I think of Phoenix Children's Hospital first."}
{"text":"Thank you to all the doctors and especially nurses who took care of our baby boy.  I wish I could have remembered your names but due to situation I was too busy just worrying. But I did not forget all you did to help our boy feel comfortable and safe. Night nurses who did not care about your comfort did all the Vital checkings and transfusion on your knees to keep my baby asleep in my arms...I can't thank you enough. Dr. Sanjay Shah thank you for taking time to explain everything. I will always remember floor 7 Hema dept. for your awesome caring people."}
{"text":"I took my toddler to ER, it was my first time there. We were there for five and a half hours waiting. The treatment took 30 minutes. I will not take my kids there. The waiting area was not clean, it was a bad experience. I received a $515 dollar bill for just sitting there."}
{"text":"The worst experience in my life, I have been in so many hospitals since I was 4 years old cause I have type 1 diabetes and I know for sure Phoenix children's hospital is the worst. What makes a place better or worse? Of course the staff so I know they are not gonna change anything cause the staff makes prejuideces and they  forget that they are treating kids and first of all helpless little human beings. My baby fell and got a hematoma on his head and they took x- rays of his hole body to prove that I not abuse my son and 6 nurses went with him and didn't let me be with him and caused pain and when they let me in, they were giving him sucrose without asking me first and their argument was that it wasn't a treatment and that will helping him with the pain that they caused and I am not suppose to give him sugar until he is six months for my diabetes. They didn't letting me holding him and they started to ask each other if I could hold him and as soon as I hold him he stopped crying. They never got us the results until discharge us and when I asked for getting the x rays for my own records they said that they can give me some but not all off them so what are they hiding and what did they did to my son... I wish nobody has a terrible experience as I did. There is not gonna be a next time for my baby to be in a hospital because of me but if he needs to be in the hospital he won't put a foot in there for sure!!!! I hope I can get the x rays and be sure that they didn't abuse him in any way..."}
{"text":"I cannot say enough good things about this place. At a time when I was scared and felt alone- they helped me in every way. The very front desk left a little to be desired but from the doors back- the staff is amazing. Every day there was tears but the staff always talked to me about my options, listened to me, hugged me. Staff unrelated to my child's care always had a smile on their faces. The older gentleman at one of the many parent coffee carts was always so sweet and offering extra treats. The pricing on the cafeteria meals can't be beat and the food is delicious - complete with gluten free meals. 

The patient care we got was amazing and is the only hospital we will go to from now on for our children."}
{"text":"This place is my sister's home away from home. Every time she's been admitted, they've always taken great care of her. No complaints there.

The cafeteria is worth ranting about. You can get anything from pizza to bbq. So good! My favorite is the Mongolian grill. A big selection of veggies to choose from and you get a lot of food for $5. An added plus is the sexy man grilling behind the counter."}
{"text":"We took our five year old son to PCH because his eyes had swelled and his tonsils were also so swollen they were visible from the back of his neck. We arrived at 10am and were back in a room to see a Dr. at 1:30. Then two different doctors cames and examined my son two different times. One of them returned and collected a sample from his throat and left the culture in our room and had to return to get it. She then came back and said the test was negative  and wanted to collect urine. I dont know why she couldn't of got both initially but I asked my son to pee in a cup and his mother led him away.  Before the \"physician\" left I asked her if my son took drink something now as we were told he could not when we first arrived and were checked in. She said she didnt know but would return with an answer and to collect his urine sample.  After 45 minutes I asked what the wait was to collect urine and the physician returned and I asked her  again if my son could have something to drink as his lips had begun to crack and bleed. She said again she did not know but she would go and find out. Finally she returned with a small Gatorade and a straw and scurried off again.  She returned and said the test of his urine was ok  and she wasn't sure what the cause might be for his symptoms.  She then began to throw possibilities and hypotheticals around the room on what she thought might be the cause and what could help.  Using  phrases like 'my guess' 'not sure' and ' I think'. After she left the room we waited for another 25 minutes before he got a note for school we had to insist upon and we got the hell out of there. I feel like I let my son down taking him to this hospital.  I think he could of gotten the same if not better treatment somewhere else.  Dont believe all the hype and the propaganda.  When it comes to the bottom line any hospital maybe just as good Phoenix Children's Hospital for your child and I will never donate another cent to this organization ever again. We left that day at 4:30pm."}
{"text":"I hope that if you're reading this, you are not in dire need of taking a child to a hospital, because going to the hospital is never fun...

I've been to Phoenix Children's Hospital just a few times over the years... Once was just for a tour when I was involved with the Cystic Fibrosis Foundation years ago.  I was super impressed with what I learned and saw during that visit and I became a fan back then even before I had children of my own.

The next two visits were more recent emergency visits with my son... One for Croup and the other for a night terror (of course I didn't know either diagnosis until after the fact).  Both times the lines to get in to see a doctor were rather long.  However, once we did get in, we were very happy with the level of service provided.  Courteous staff and attentive doctors and nurses.  We found them all to be patient as well, which is tough when you know they are constantly dealing with sick or injured children.

PCH has a reputation for being the best in Arizona for a reason... the name speaks for itself.
From the colorful curtains in each room to the movies playing on TVs throughout the lobbies and individual rooms, toys for children to play with as they wait to be seen, etc... They even offered my son stickers as we were leaving.  I am a fan of this place and I like knowing that it's nearby.  That being said, I hope that I won't have to visit PCH again ever.  No offense to the wonderful staff of course (and please know that we are oh so grateful for you being there for our kids).  If the need does arrive, I would not hesitate to return to PCH.  As a matter of fact, I wouldn't even think of going anywhere else."}
{"text":"Billing department is a disaster.  45 minute - 1 hr+ hold times before getting a representative.  Disconnected when transferred."}
{"text":"I love this place.  Always so good to my son when we are seen here.  The place is clean, staff friendly, and of course the nurses are excellent! Might I just add that Dr. Touger in the Endocrine department is one of the best doctors I've ever encountered.  We are indebted to her for her service and help!!!"}
{"text":"My grandson was admitted this evening. I am an ER nurse. This was the poorest run department I have ever seen. My daughters pediatrician called ahead to notify them of our impending arrival. We arrived at 3 pm with a very ill 12 day old. At 5 pm we still had not seen a professional provider. We were triaged, sat in WR nearly 45 min, taken to a room and saw not one sole until 5 pm until I went and found someone. 
That's just the start. 
By 7 pm, this little guy who has not had any nutrition, discovered to be due to pyloric stenosis, finally received an IV. At 8 pm he finally ended up in echo. Do the math. It's now EIGHT PM!!!
Finally at 9:45 pm surgical staff consulted.
It's now 1 o'clock in the morning as I write this. The kids were just taken to a room. Not one place for them to sit or recline in the room. These parents have been up for going on 48 hours now. 
I was actually looking forward to excellent and efficient care when I learned they were going to such a prestigious facility as this. I was embarrassed FOR this hospital. I totally understand triage, but this experience has lacked in all personal care, nurturing and efficiency. 
If you have options, exercise them before submitting yourselves or child to this place."}
{"text":"I previously reviewed and gave 5 stars. I still give the ER and medical staff full stars. However.....I have a very minor billing issue and have attempted to call multiple times. The wait for billing is running from 1 full hour to 41 minutes. I was told my wait time was 40 minutes. I was still on hold at 1 hour. The phone rang to get me to a rep finally and they switched me to auto billing. I have a legitimate issue with double accounts that cannot be fixed with automated billing. If I did i wouldn't have wasted my time. I pushed zero and I was back in queue at THE BEGINNING!! ARE YOU KIDDING ME?!!! UNREAL AND UNACCEPTABLE! Whomever is in charge of the billing department needs to be FIRED. HORRIBLE."}
{"text":"We attended the Gilbert facility.  Up front they are very nice, but I think they are all about the money.  Ultimately they solved nothing keep billing and charging and mistreating.  They are a mass production center for generating dollars.  To date we have spent a lot of money there and have seen no good results or understanding of or reasoning for the treatment."}
{"text":"We are driving home now, after a five day stay at Phoenix Children's Hospital. They were amazing! 

The nursing staff is the best of the best; we cannot say enough good things about the 9th floor nursing staff... they listened to us, listened to our daughter, stayed on top of her needs, and were always willing to go the extra mile for her and for us. 

The child life team was also amazing - they truly made the hospital stay feel like a week of \"special treatment\" for our daughter.

the room service and housekeeping staff were awesome as well - always a smile and kind words. 

Our doctors were outstanding! Especially the infectious disease doctor. They all worked tirelessly to find out what was wrong with our daughter and get her better...we could never thank them enough!"}
{"text":"we were sent here by good night pediatrics around midnight and were told it might be a 2 hour wait time... so we called them and they said it was about a 70 min wait... better then 2 hours so we went with our 2 year old.... she got to ride in the wagon so she loved that part and by 1 am we were finally seen... it was crazy busy with sick kids all around...wish the waiting room was a bit bigger and kid friendly... it was hard to keep our 2 year old still for an hour and just watch tv.. but the time the nurses saw her she was a pro at letting them check her out... i loved that they were trying to make her feel comfortable and make it a little bit more fun. they had a movie playing in the room so that was great to keep her busy while we waiting for the test results and nurses to come in... would rather go here then other hospitals where we live for our daughter but its just so far away from us"}
{"text":"This is a review of the financial aid department at Phoenix Children's Hospital, not the doctor.  The doctor was great and I would recommend her.  I brought my teenage daughter to Dr. Elizabeth Collyer because she has been experiencing recurring stomach issues over the last couple of years.  After running some blood work and evaluating the results, Dr. Collyer recommended that we schedule an EGD (a scope of the upper digestive tract) in order to determine if there were any other issues that might be causing my daughters discomfort.  During my conversation with Elizabeth I expressed the importance of making sure that the procedure would be covered by insurance before the scheduled appointment day.  I wanted to make sure that if things weren't covered I could look for help elsewhere or at least know what our financial exposure would be.

The short of it is that I made multiple attempts over several weeks to reach out to the billing department have them help with the insurance pre-approval through Health Net.  Veronica reassured me that Vanessa (in billing) would be contacting me soon to make sure everything was set up.  No calls.  I did receive an e-mail with a smiley face that assured me that someone would be reaching out to me soon.  Still no call.  I received calls from Dr. Collyers office to go over the pre-op prep and I told them that I still hadn't heard from the finance department to make sure that things were approved.  Again, I made multiple requests for call backs and each time was promised that someone would contact me soon.  I even double checked that they had the correct phone number.  I finally gave up and told them to cancel my appointment which was a little more than a week away.  Finally, yesterday December the 15th I got a call from the finance department.  Keep in mind that my appointment was scheduled for the 21st.

The very cheerful phone rep at Phoenix Children's billing explained to me that although the procedure could be billed through my insurance company and they were happy to inform me of the deductible amount (which I always understood to mean was the full extent of the patient financial obligation), they were not able to guarantee that after paying my deductible I wouldn't receive additional bills from Phoenix Children's Hospital.  When I asked if they could at least identify to me what the potential additional costs/procedures not covered by my insurance might be, she said that she couldn't, but that I would be responsible for paying whatever bill they sent to me after the EGD.  She was nice enough to express to me that she understood why her response might be frustrating to me (which I thought that was a very kind gesture) but oddly I still felt frustrated.  When I asked if they could give me a worst-case scenario as to what my out-of-pocket costs might be, she very politely said that she wouldn't know until the procedure was finished.  It is unbelievable to me that this hospital is unable to provide a patient with an accurate quote for services and insists on a blank check, even though the doctor is within the network of my insurance carrier and even when I agree to pay my deductible.  I can only guess that it would be too much work on their end to work up a best guess quote based on previous experiences with this procedure.  Maybe they just want the freedom to add costs that they know I wouldn't agree to upfront.  This hospital certainly wasted my time and helped to ensure that my daughter won't get the care that she needs this year.  I would recommend looking for a care center that still understands the importance of timely customer service and transparency.  Phoenix Children's made it impossible to make a financially responsible decision and to take care of my daughters medical needs.  Terrible experience.  Look elsewhere for your health care needs."}
{"text":"Since Thanksgiving we have been admitted to the hospital 3 separate times and will have spent 32 days at PCH.  The long ER wait times for a child on oxygen is disappointing especially with a complicated medical history.  Once the check in process has been completed, the ER staff is wonderful.

We have to give 5 stars to the sixth floor main building nursing staff.  They are excellent care givers that love their jobs.  Up until his surgery we have spent all of our time there.  The PICU doctors can be great and include the parents, but unfortunately, there are some that don't care to involve the parents in the child's care.  It's pretty sad when the nursing staff has to apologize for the doctor's curt behavior.  Although, we won't let one team of doctors spoil the other really great teams of doctors or the outstanding services the nurses provide on the sixth floor.

The reason for 2 stars is the east building.  He had a surgery on Tuesday and 
was transferred to the east building on Wednesday.  Once we arrived in the east building it's been a completely different experience.  We had to spell Synagis for the nursing staff and have been told the hospital doesn't administer it and hasn't for years.  How odd considering he's had it administered at the hospital in November and December!  We haven't seen a doctor since the first night he was transferred to the east building.  We've asked multiple questions and received no answers.  I'm not certain what the question board in the room is for.  Highly disappointed in the east building nursing staff and care of the patients.  Oh and did we mention that both elevators were out last night?!?!  One was out for the afternoon and then we attempted to return after stopping at the cafeteria and neither elevator was working?!?!

Way to go sixth floor main building staff in making our stays with you so pleasant!  We miss the care you provided!"}
{"text":"This review is for the Audiology Department. I really cannot say enough good about my experience with them. My newborn failed three different hearing tests, so we needed to be referred to an Audiologist for further testing. We had originally been referred to a different place but when I called them to schedule, they didn't have any appointments until the end of March... I called PCH to see if they had availability sooner. Not only did they have sooner appointments, but they got us in the same week! I made a mistake when writing down the appointment time. I wrote down 830am when the appointment was actually for 8am. Once I arrived and realized my error, I was completely ready to be told that I would need to reschedule. They were so nice about my mix up and they still saw my daughter for the diagnostic hearing exam. Unfortunately, my daughter has hearing loss and will need to wear a hearing aid in each ear. When the next appointment was a no show, they went ahead and did the molding for my daughter's hearing aids the same day, which essentially saves us an additional trip there. We saw Dr. Harding and she was one of the nicest providers we have ever been to see. She was very accommodating and took the time to explain everything very clearly. I look forward to working with her on making sure that my baby girl has what she needs to be able to hear adequately."}
{"text":"Having to take a child to the ER is never something any parent wants to do, but Phoenix Children's ER made our experience as smooth as possible. 

There was no wait and so they were able to get us right into a room.  They were very understanding and great with our 8 week old baby.  He was fine after being there a couple hours and they were able to discharge us with a healthy baby.  It was nice we didn't have to wait around forever once we got cleared as well."}
{"text":"We love this hospital! My son has Polyarticular Juvenile Idiopathic Arthritis and is, therefore, a regular patient to the rheumatologist. Dr. Ede and his staff are wonderful. We would never go anywhere else!!"}
{"text":"Within an hour of my post I received an email from Phoenix Children's Hospital asking me to contact them.  A week after my post they took my account out of collections so I can make my last 4 payments to them.  I'm happy with the outcome."}
{"text":"I have noticed a lot of hospitals have moved over to 24/hour visiting hours. Especially when moms and dads have to sleep over, and still haven't had a break, it would be nice to extend those further a bit and allow everybody to get some rest."}
{"text":"The best hospital I've ever been to. I've been taking my daughter here for the majority of her first year, they helped clear her lungs since she was congested and even with a fever they ran every test needed to find out what was causing it. Also, the ultra sound tech and MRI were so great with her, she had to come in when she was 6 months or so for an MRI because she does have a hemangioma, and it felt scary letting them go but they took care of her so well, and made me feel comfortable. As a first time parent it was a little bit too much with fevers and congestion, but this is by far the best children's hospital."}
{"text":"The front desk receptionists are horrible and very unprofessional. Calling in to set up an appt is like pulling teeth and all you get are people who would rather be doing something else.  One of the ladies even hung up on me.  Been taking my kid here for 7 years but it has gone downhill steadily within the last few years.  Time to take my kid elsewhere.  Side note:  I wouldn't hesitate taking my kid here for an operation.  Doctors/nurses are top notch and know what they are doing.  Front desk receptionists for appointments needs an overhaul.  Also, watch your bills closely.  There have been several occasions where the billing dept tried to charge me for the co-pay, that I already paid for.  Takes calling the billing dept up and going through all this crap for them to go, oh yeah, we made a mistake."}
{"text":"Terrible Billing department.  Received Bills almost a year later after services rendered.  They won't even speak to me even though I am responsible party and the account is in my name.  Worst customer service ever."}
{"text":"Haven't been to PCH in years but had to recently for my youngest child. Our experience was great. Nurses up on the 9th floor were verrrry personable. They made sure my lil one was well taken care of. Dr Flores was also very reassuring and made sure all my questions were answered. Thank you PCH!!"}
{"text":"We had taken our son to the ER at PCH on Sunday, AFTER we had left an urgent care clinic.
We had explained in full detail that our son was in excruciating pain and that the e-rays performed at the urgent care produced zero results.
We shared our concern that we had just gotten back from Mexico the day before and that I (mother) had been vomiting.  
The doctor didn't seem to take any interest in these details and performed ANOTHER x-Ray, which of course produced nothing and sent us home.  
My son ended up with 104 fever for 4 days, which was the result of the Norovirus contracted down in Mexico.  Thanks PCH for solving that one for us.  PCH has turned into a giant urgent care, don't waste your time."}
{"text":"I've visited the Radiology department twice, the emergency room once, as well as their urology specialists. I had a great experiences, and then my daughter had to have a VCUG last Friday. The techs were very nice, but totally incompetent. I have never seen my 3.5 month old EVER cry as hard as she did as when they were trying to jam catheters into her that were way too big. The tech continued to say \"I guess we need a smaller tube\" as she lay there screaming. Didn't ask for help from anyone else, didn't go get someone to do it, just kept trying to jam tubes up there. She then had the gall to say \"don't worry, she won't remember it\". My good experiences were not worth taking my daughter back there ever, especially seeing and knowing how easy it is for lots of other medical professionals to cath her. 

The customer relations person I brought this to was also very kind, but could not guarantee that the same techs would not be in charge of our care again. We will be switching her care to Banner after today."}
{"text":"Well after an unexpected 4 day stay I have to say the staff here really make a bad situation a little better. When I first arrived I could not get my son from the car to ER and the security guard saw me and ran and got a wheelchair and immediately helped me and got my son in there quickly, which I was so grateful for. The check in nurse was very nice, and the Drs and Nurses in the back all were very thorough with my son and showed a genuine concern. My son had a CT and MRI and those staff were also great! When we were admitted we were placed on the 8th floor and the entire staff from housekeeping, nurses and Drs everyone is so nice and helpful and really do their best to help keep the kids from being scared and to at least put a smile on their face. The cafeteria and their staff are also very nice and I have to say the food is pretty good. This will always be my go to when it comes to my son."}
{"text":"Horrible place.  

My daughter was a patient that banner Thunderbird where she was getting excellent care, she has leukemia and needed a bone marrow transplant so had to come to Phoenix Children's Hospital because banner Thunderbird did not perform them.  Things are going very poorly, although my daughter's health is stable at the moment myself and my wife have been bullied to no end on a daily level.  The staff is very sneaky and very disrespectful with no bedside manner whatsoever.  I'm talking about the doctors in particular.  They have made us feel like we are in a power struggle from some bad relationship as they continue to bully us and try to play the boss with us. They have made our experience very stressful and difficult in this already difficult time.  

My daughter is also becoming very withdrawn and has stated how much she dislikes the way they treat her at this hospital stating that she feels like they just talk to her like they are just doing their job not like they care, this is coming from a 15-year-old girl with leukemia.

Yesterday while we were there for her treatments, after over an hour of doctors coming in and not even acknowledging I was sitting right there, hey hospital counselor came in who my also had never met and did not introduce himself to me, he turns to me and tells me I can wait in the next room while he speaks to my daughter (?!?!??) and I told him I was absolutely not comfortable with that. In fact my daughter had said to me that she does not want to be alone with him because she does not like the way he talks to her. The last thing I was going to do was leave so I told them it wasn't going to happen.  

I placed a call to the secretary of the CEO of the hospital and she told me somebody would call me back that day or the next day and two days later still nothing.  It would seem the lack of care goes all the way up to the top. 

There have been many stories of people having good experiences at this hospital and I'm thankful to know that I'm some floors and possibly some doctors are treating people well, as a whole we have been going here almost 3 months and I wish I could say the same. All I can say is please watch your children if you take them here.  I'm sure for outpatient things which we have done in the past with our other children will be fine but if you are here an extended period of time watch your kids."}
{"text":"I took my 22 month old daughter to get seen, because she develop a low grades fever at night. I decided to take her the next day (Saturday) she was being very fussy & did not have no sign of a cold. I was very disappointed at doctor Carol M. Thrall, PNP. She was very rude & aggressive with my daughter. She also made it seem like I was out of my mind & did not know what I was talking about. She kept saying there was no such thing as a low graded fever...umm it's was at 100.9, I'm going to school to become a nurse. In addition, the nurse that saw her before the doctor she even mention she did have a low graded fever. If she does not like her job or is not in a good mood. Don't take it on the children that rely on you. Very disrespectful that why I take my daughter know to banner thunderbird hospital even if it's an hour farther there service is unexplainable they treat children with a lot of care & love. Stay away from Phoenix Children's Hospital. Our kids come first."}
{"text":"i love the pulmonary department so much they have been helping my son with his asthma for  a few  yearsf the staff is very friendly and nice and they always answer all your questions phoenix childrens hospital is the best i wouldnt take my kids no where else but here the emergency room is also great with children they got my son in quick today because he was unable to breathe on his own"}
{"text":"Just had my daughter discharged today and I have to say, the staff is amazing. Dr. McGreevy and staff were thorough, professional and personable. The hospital is spotless and they kept us informed of every step. So thankful to them for providing exceptional care. I highly recommend this hospital."}
{"text":"Both of my girls have seen Dr. Shaffron in the neurology department and we adore him.  So thorough and so amazing with kids.  The office staff is great as well.  The only complaint I have is with the construction which is only temporary.  The guards at the parking structure were a bit rude but I'm not there to mingle with the security guards, just to receive excellent care for my two precious girls!"}
{"text":"My bill $21,284! I brought my 17 yr. son through the ER for severe chest pains. He was referred to ER by PCP. While we were waiting for his name to be called,  his pain intensified. I immediately went to the front check in, and the male nurse informed me that he had already triaged him (no vitals were taken). What?? I requested that he be immediately seen with vitals due to severe chest pain and neck pain radiating. Shortly after they took us to the back and the tele monitors were going into high alert modes. I asked what was happening and the aide said we would walk to his room and the nurse will be in shortly. No nurse, no team came in. I had enough time alone in that room to google, download, and read the manual for the monitor station.  His pain continued to increase. I went to the nurses station and asked if someone could please see my son. A nurse came in and told me that sometimes the glue on sensors creates false readings, they saw it from nurses station but were not concerned. The doctor came in with no worries, I explained that my son was an athlete an rarely complains about pain. She told me she thought it was heartburn or maybe a muscle strain. I asked why the monitors were going off and she said she wasn't concerned...probably the way he was breathing. Long story short, his blood work came back that he was in a life threatening situation. She was planning on the ER discharge when his lab work came back critical. He had a viral infection that settled in his heart. They discharged us 4 days after the ER visit, with no precautions. We followed up with an outside Cardiologist. He was shocked that they did not order the additional diagnostic test and after reviewing the radiology reports found things that the hospitalist did not. The bottom line...PCH is becoming an after hours pediatrician for families. The staff is so conditioned to seeing non-emergencies, unless you come in though an ambulance I doubt that front desk will truly believe there is a medical crisis. I had a choice to go to Scottsdale Healthcare and Phoenix Children's, next time I will go to Scottsdale Healthcare or Banner Cardens. Oh... and back to my bill $21,284. The billing department informed me that these charges were for the \"building and equipment\" the hospitalist and individual specialist will be charged sep. Just so you know they charged me $512 for 2 days of Aleve, $400 for a chest x-ray, and the rest went to the team that almost sent him home in critical condition!"}
{"text":"PCH and their Docs and Staff - Absolutely the best of the best! 

My daughter recently had surgery at the hospital, and I can say the facility and staff more than surpassed my expectations. My 4-yr old daughter had a very invasive surgery - and she said the worst part about the entire hospital stay was getting the stickers/tape peeled off her skin. She literally told me she have fun at the hospital and really like it there. 

I can't say enough about the quality of care we received at PCH. The doctors were all very kind and understanding. They took the time to explain everything and answer questions. 


Just a great facility, great doctors, great atmosphere designed for kids. 

I wouldn't hesitate to recommend PCH, and more specifically their Heart Center, to anyone seeking a top-notch hospital and docs to care for their children."}
{"text":"Great staff! This time I'm in the ER with my daughter and the wait was... Well there wasn't really one! They do their job they're quick and caring and really know how to deal with children. I recommend this hospital to anyone with children!"}
{"text":"I had high hopes for this hospital as it was recommended by a friend but was very disappointed in the emergency department specifically. It's completely run down, dirty, and took roughly 3 hours to see a physicians assistant, and no other nurse besides the one at triage. When we finally got to see the physicians assistant, who didn't wash his hands when he walked in, he spent all of 2 minutes in the room and was very dismissive. I won't bring my son back here."}
{"text":"Well, according to the person I spoke to, *I* a non doctor, non physician, has to dictate where my daughter's info gets sent to.  I kindly asked the lady why it can't be sent to who it was *originally meant to be sent to*. The answer was that she could but it would probably be kicked back to another department. HOW THE HELL SHOULD I KNOW. THATS WHY I CALL THE HOSPITAL. It's like, if I can't diagnose it and send the info to the correct place then screw me. Garbage. 

I donated money and now I want it back. No better than any other bullshit hospital.

Apathy at its finest."}
{"text":"I am not sure about the Hospital as a whole.. I just reached out to the Pediatric Endocrinology Dept to schedule and appointment for my son.. The appointment taker was very rude.. I do understand that it is Monday.. Unfortunately when you accepted the position you also accepted which days you were willing to work.. If this is how the staff is then there is no way I would ever bring my son to visit any of the doctors in that office..."}
{"text":"If I could give this place zero stars I would. I brought my 4 month old son in several times as he had been sick with bronchiolitis and his condition was worsening. That last straw was when I asked if they could please perform a simple swab to double check that he had the virus they said he had and the ER doctor said NO. Then they decided to put an IV in to give him fluids as he \"was showing early signs of dehydration.\" After poking him in both hands and not being able to get an IV in they decided to just not do one. My son was breathing very hard and fast and all I got was, \"he's sick it's expected that he breaths harder and faster.\" They made me feel like I was crazy and paranoid and like I wanted something to be wrong with him. Without giving him any fluids and knowing that he had not been eating well they discharged us in the morning. The next day I took my son into Banner Thunderbird who took one look at him and admitted him. I'm currently sitting in the Pediatric ICU which I feel could have been avoided if the staff had just slowed down, paid attention, listened to my concerns, and stopped to think that maybe just maybe they aren't always right. 

Unrelated to my story when I was waiting for my son to be triaged a man approached the nurses station with his daughter who was clearly in distress and informed them that she was much warmer than when they left home. Instead of showing any concern the nurse scolded the man and said, \"Why didn't you medicate her before you left?\" 

The staff here is just rude and disrespectful and act like you're wasting their time. I will not be back and do not look forward to getting billed for sitting in a waiting room and having a doctor tell me, \" there's nothing we can do.\""}
{"text":"Look, no one wants their kids in a hospital, ever. But if you need to be served by the best children's hospital in the southwest, go to PCH.  The new building is amazing, but you must meet the people - genuine, caring, and hard-working professionals who love serving families.  And if you are blessed to steer clear, then write them a check - they need every donation they can get!"}
{"text":"I got here and had a little trouble finding a spot to park but it was OK. When I got inside the security guard was nice and gave great directions where to go. My 3 ur old got her finger wrapped around the cord of the blinds and the staff here has been so nice and kind and vwry helpful. I couldn't be happier. I would bring my child here again. Very clean and staff nice and straight to the point."}
{"text":"While most of the doctors are nice and appear qualified, the way the clinics and hospital phone system is run is atrocious!
I had back to back appts with 2 specialists for my child. My childs labs came back abnormal, but the 1st doctor never contacted me to discuss and trying to get back in touch with the staff, a nurse, the correct department, the doctor or ANYBODY who knew what to do, literally took me HOURS! While you wait on hold, there is an option to leave a message by pressing #1. Unfortunately it does NOT work.
Each time I called the number on my bill, the number listed on the website, etc, it either went to a fax line, or the staff would tell me, \"Well, Im just an operator, you need to call each department seperately!\" I was calling, waiting on hold and speaking to people who had no clue how to answer me for hours. NOT FUN! 
My child was scheduled for a procedure that required a prep the day before and we literally received NO information for the prep. 3 hours later dealing with phone calls and they tell me they will email me info in a week. Well, this is so inconvenient when your a working parent who travels. I prefer to be prepared with the things I need to purchase for these things and I dont do \"last minute\" in my hectic schedule.
SO, far, I am completely UN-impressed with the way PCH is run and am not looking forward to future visits and the disorder it brings."}
{"text":"I have had nothing but great experiences here. Everytime my daughter has been here she has been seen in a timely manner and they have gone the extra mile to make sure she was okay. I love Phoenix children's hospital."}
{"text":"I used to work at this hospital and I can say from being there daily that this hospital really cares abou their patients and their families. They go above and beyond to ensure patients are cared for in a friendly, non-scary environment. If you have to be at the hospital, why not make it a great experience. Love it."}
{"text":"Our son was born 3 months early and spent 3 months and a week in Phoenix childrens hospital. 3 months at the one inside Banner good sam, 1 week at the main campus on thomas. I could write a book about the incompetence of the nurses (a handful were very good), and the NAL Group (that is the doctor group assigned to my child). Firs the nursing staff: there was almost zero consistency with the staff. After 2.5 months our son was still being seen by new nurses all the time. The doctors in the NAL Group just treat symptoms and can`t tie 2 simple things together. We had been asking the dr`s for 3 months why our little boy was swollen in the groin, they simply said  \"it`s just water retention because he is laying on an incline\". 3 days before the scheduled discharge date I pulled a dr in to actually hands on examine him (which they rarely do) and he said \"wow he might have a hernia, lets run a test\". Turns out he did have a pretty bad hernia, which is common in premie boys, they are born with it. They also attempted to take our son off breast milk and put him on formula WITHOUT telling us, because they thought his feedings needed to be thickened. Our son was constipated since birth, again common in premie`s, but the dr`s would only give him prune or pear juice which only made him gassy. So when that didn`t work they would give him a glycerin suppository just about every other day. One nurse actually said an old drug reglan used to work so good, its a shame they black balled it. I informed the nurse there are major class action lawsuits about the drugs nasty side effects. Our peditrician recommended chamomile tea and valarium root brewed... he pooped 3 hours later on his own. We went out of town for 2 nights and they did a barium swallow on him, moved him out of the unit, into good sam and did not even tell us, just a voicemail 2 hours before doing it. The end medical bill is over $800k and PCH does not even validate parking, because banner owns the parking garage!

If your child ends up at pch spend as much time as you can there, ask questions and question everything they say."}
{"text":"My son was born with a small hole in his heart.  We went to a cardiologist last year in SD and then today was his one year follow up appointment here in Phoenix.  Things went incredibly well!  His hole is shrinking and (knock on wood) will not require any type of surgery!

This hospital is really nice!  Staff was friendly, wait times were nonexistent, waiting room was nice, new and welcoming, its easy to get to, parking is free and their pricing structure was awesome.  If you pay on the spot, you get a huge discount on services rendered.  This was our first major doctors expense this year, so to meet our deductible, we paid on the spot and it will wind up saving us hundreds of dollars out of pocket!  Score!

I have complete faith in this hospital if/when we have to return.  I was very impressed!"}
{"text":"Not that I'm one of those Stockholm mothers in any way, but this hospital is a really nice one. I didn't  mind my visit and I won't be upset when we have to do our follow up in a couple of months. It's awful that there are sick children, but I think the game rooms and the food has to be soothing in some sense or another. My suggestion: do not come in hungry because whatever they're cooking up in the cafeteria lingers in the halls and will make you want to eat an arm. Also, it's a huge hospital and even though we parked in the correct spot we had to trek it on the complete opposite end of the place with the 10 lb child in tow...not easy or fun"}
{"text":"Our experiences with this hospital over the years have been uniformly dismal, involving rushed/overwhelmed/irritable clinicians as well as support and billing staff so disorganized you honestly wonder how they manage to even make it in to work every day.

The icing on the cake occurred last year when I had to take a friend of my son's to the PCH ED with a severe displaced fracture of his arm.  In the ED he was MADE TO STAND in the triage line for close to 30 minutes.  Not a single person showed the slightest bit of compassion about the fact that he was white with pain.  However, they were quite aware of his condition and proactive about insisting that he not have even a sip of water as he might require surgery.  (Not actually a medical requirement) I finally went and found a wheelchair for him on my own.

Our own son is being evaluated for elective surgery here, our experiences with the lack of organization on the part of the staff, and the lack of compassion shown to patients, make me reluctant to entrust his care to PCH.  We are, instead, considering taking him out of state to have the surgery."}
{"text":"This hospital will over charge you for all procedures and in some cases will charge you twice for the same procedure. If you can go to a clinic it will save you thousands! My 8 year old had just a fractured wrist and they charge over 5k to cast it!! Parents beware!!!!"}
{"text":"While I sincerely wish I didn't have to write this... here goes. 
I understand that lots of people have their great reviews of this place it would appear that my children have had the exact order experience.  It would appear that if your child has any issue that might be deemed as \"complex\" you are almost guaranteed to have a bad experience here.

My youngest child has all of their specialists @ PCH.  Which in and of it's is not an issue as they have satellite offices... if you need a procedure done... it's a 45 minute drive to central phx.  Then the drama starts... 

apparently if you have another child you are expected to leave them somewhere or leave your sick child unattended... WTF!   Sorry that's not going to happen. But it would seem that many parents do this as this is their \"policy\".  

Next is their issue of wanting a copy of your drivers license to visit-yeah not happening so you are required to sign in-no problem there- just put down any name and room (they don't actually check) this is just to give you the \"feeling\" of security for your child--they aren't actually going to put a monitor on your child and if you child is mobile and walks out of the hospital on their own they aren't actually going to say anything but there is the feeling of safety

Parking is also awesome (that is sarcasm).  I have had their mall cops leave no less than 6 notes on my vehicle for parking \"violations\" interesting that my vehicle was singled out... perhaps it is the pro LE/military/fire decals they didn't like because my violation was parking in a spot backwards(something I observed other doing with no notes)

Now we are on to their nurses-- if you have not spent the better part of your adult life working in the medical field with some of the worlds best healthcare workers I can understand how you would this \"wow this place is so good\".  If you are like my family we know better-- I have had to manage my child's emergency medical needs on the PICU more times that I can count--- when my child stops breathing I have had nurses turn and walk out of the room as I am applying oxygen and doing CPR on my child- YES in the ICU the nurse had no idea what to do.  

Additionally there is the issue of none of the doctors will ever actually talk to each other.  Everything is done through someone else- while this might be ok on a limited basis general Dr vs surgeon for a badly broken arm--- if you have more than 3 specialists it will take DAYS for a discharge order- yep my ins got billed for 3 extra days of an ICU stay because they couldn't decide what to do with us. 

And then there is the billing--- I get it times are tough and a hospital needs to keep the lights on (pay for all of the fancy bronze statues) I have 2 separate ins policies for my family I asked for an itemized bill--- they billed me for medication that I provided(child has special restrictions they are unable to meet @ their pharmacy).  But they billed me for the Med as if they had supplied it (hello ins fraud).  When called out on this issue they acted as if it was just a small clerical error- yeah if I was paying cash this would have been a huge issue.  


TL;DR
If you have another option go somewhere else anywhere else.  I'm sure at one time this place earned their reputation but don't believe the hype!"}
{"text":"All the staff really strive to work together to help kids get well. It's a clean and upbeat atmosphere."}
{"text":"The inpatient psychiatry unit treats their patients horribly. They treat the kids like cattle and they keep them for months at a time without any treatment plan. They are understaffed and patients physically and verbally abuse staff members."}
{"text":"Ah, the dreaded broken arm on an 11 year old boy! You guessed it. Monkey bars. I was at work! So this did not happen on MY watch! But anyway, a friend of mine in the medical field referred me to the Orthopaedics department, Dr. Greg White. It was difficult-VERY difficult trying to schedule an appointment over the phone and I found myself waiting for several minutes, becoming impatient and then calling back to try again. Well my relentless dialing paid off and I'm so glad. The hospital is so organized and streamlined in their processes, from the parking garage to the elevators, every step of the way, we were greeted, assisted and guided. They even have a automatic appointment confirmation call that reiterates directions and your apt time a couple of days before your set appointment. Onto the staff. I wish I could remember the names of all them, because each one was so helpful and patient. Adam gave ME a sucker because it was my birthday! And he had my son cracking up, anyone that has a kid knows how important it is that your kid is treated well!! The nurses that assisted with Scott's cast were great and very funny and sweet. Everyone genuinely seemed like they loved what they were doing and every kid that walked through the door. My son was probably the oldest the couple of times we were there, but there were some little kids, screaming and crying getting casts on and the staff never let out a sigh and just gently took care of all of them. I'd have to say Dr. White was my favorite part of the experience. From insisting that my son was going to get a pink cast because that was the only color they had, to cracking jokes about his monkey bar skills. He lightened the environment and we found ourselves laughing, smiling and having a good time in what could have been a very uncomfortable and scary situation. He explained every step of the process, he kept me informed and put my mind at ease when I would start to question or worry. He even told me that he would be doing the same thing if it were his own child's arm, which really helped me to feel at ease. We have another appointment coming up and I am honestly excited to take Scott back there! He loves it and so do I!"}
{"text":"I love this hospital they took care of me and my baby . The staff is friendly and attentive. Not to mention the food in the cafeteria is amazing"}
{"text":"I may be biased since this is where I work but I feel that there is a lack of positive reviews.  My daughter received services here and I was extremely impressed.  My daughter had surgery when she was 3 and we got some of the best care ever.  This is why I wanted to work there.  They came in to give her some morphine and even though she was 3 they listened to her concerns that the morphine made her head feel funny and that she didn't want it.  They called the doctor at midnight and got a new order for pain control.  That impressed me.  She currently goes to the pediatric clinic there and they take everything she says into consideration.  This is the only place I would ever take her.  I have had experiences with other family members and their kids at other pediatric facilities and this is where I always recommend anyone take their children."}
{"text":"Honestly, this place is the best if you have a child that needs anything.  The people that work here are sent from Heaven!!!  I have been there so many times ( for surgeries, tests- MRI, Xray, bone scans and reg appointments) with one of my kids and never had a bad experience!"}
{"text":"Went to the ER, my toddler was in severe pain, screaming bloody murder from it and nothing helped. Their response? To quote the NP, \"It just looks like he needs a good time out.\" \"He must just be having night terrors.\" (as he cries and screams in pain for an hour straight in front of her). \"This is absolutely normal behavior for a 2 year old.\" \"Well you know, 2 year olds scream.\" and the classic of all classics, \"What do you expect me to do? It's 10 o'clock at night.\" Um, you're an ER, my child has not stopped screaming. Blood work, something? Anything? Her response? She refused to do blood work, urine sample, anything!?!? Then refers us to Neurology at PCH which I told her doesn't take our insurance. I'm sorry, but how is this exemplary care?"}
{"text":"I've brought my daughter to Phoenix Children's Hospital on several occasions.  She is currently in Occupational Therapy, so my experience is ongoing.

The first time I brought my daughter to Phoenix Children's Hospital, I must admit I was not a fan of the E.R.  My daughter, only 2 at the time, lacerated her toe and sat in the waiting room for 5+ hours with a gaping wound.  I watched as countless people brought in their children who appeared to be ill with the slightest of colds and were seen before her.  The process of the waiting room was just broken - perhaps due to many people being uninsured and using the E.R. as their primary care.  Once called back, the stitches were administered promptly.  I could tell the doctors were very good.

Flash forward to May of this year.  After waiting for three months for a scheduled evaluation, we came back to Bldg. B of the hospital.  Not only were we pleased with the doctor (Dr. Raymond Bunch), but the whole experience in the hospital was fantastic - from the waiting room to the cafe to the art found around the hospital.

On Dr. Bunch's recommendation, we were able to be scheduled with a psychologist who evaluated my daughter and measured her IQ.  Janet Blackham, PhD, is am amazingly caring person who has helped us immeasurably.  

Our daughter is now seeing an OT named Barbara Weiss who is helping her cope with some sensory issues.  She is also helping her correct a previously unnoticed (even by us) weak, slightly turned in, ankle which might be the cause of many of the tumbles our daughter has had over the years!

The best part about working with the group at the hospital is that they work well at communicating with each other for the best patient experience.  On one occasion, Dr. Blackham was coming down to get something from the cafe, recognized my daughter and asked us if we ever got in to see the OT.  And then, upon finding that we were scheduled for that day, she turned around and ran upstairs to make sure the OT had a full report on my daughter before our appointment.  She took what I believe was her personal break time to make sure Barbara had everything she needed.  If I could give her ten stars out of 5, I would!

I am so very pleased with the Phoenix Children's Hospital.  It is worth the wait to get an appointment here!"}
{"text":"Wow! This place really knows how to treat families. I was impressed. Not only do they have state of the art equipment they had lots more. Starbucks located inside building first floor. The cafeteria was a smorgasbord of South of the Border, Italian, Mongolian, pizza, burgers, salad bar, fruit bar, drink station, candy station, dessert station ...  you name it they have it!"}
