{"text":"Nice layout, delicious pho with good service. Will come again. Nice touches like water with lemon and nicely presented appetizers show they care, and the taste backs it up. Look forward to coming back again to dine in and will order here for take-out and skip in near future."}
{"text":"Best and most authentic Viet food in T.O . I took a star off for the less than appealing decor and cramped space of the restaurant. It reminds me of something you would actually find in Vietnam. Loved every dish I have ordered form here. Final word, Booyah!"}
{"text":"An awesome restaurant. We arrived for a birthday with eleven people. Everyone left with a smile. The food is top notch and so is the service. The waitress even phoned me later in the evening to apologize for a mistake in the bill and $20 was waiting for my return. This is an exceptional place to eat and enjoy great food."}
{"text":"We were in the NW area and decided to stop here for a quick late lunch.  I have passed by this restaurant which is located in a strip mall in the crowfoot area but have never tried, so was eager to check it out.  I am always excited for some satisfying and filling Vietnamese bowls!  Atmosphere: 4/5  This is a small restaurant, which is clean, quiet, and modern.  Even though it was starting to get late, there were still a few tables with some other guests trickling in.  Ample parking and conveniently located in a mall.  Food: 3/5  There were a number of menu options, including wraps which are a little different, appetizers, and a selection of bbt, in addition to the usual soup bowls, vermicelli bowls, and rice dishes.  Since it was getting hot outside, I decided on the grilled shrimp vermicelli bowl to keep it refreshing.  There were a number of vermicelli bowl options.  Unfortunately all of them have spring rolls; it would have been nice to have an option without.  However, the staff were accommodating in just substituting more shrimp for me.  Initially the bowl didn't look too big but it ended up being quite filling.  I wish there were more fresh veggies though since that is my favorite part of a vermicelli bowl!  The grilled shrimp was ok; a little oily but still good.    Service: 4/5  Overall efficient; as I mentioned they were accommodating in substituting the spring rolls for something else in my vermicelli bowl.  It did take a while to get the bill though as we were in a bit of a hurry - then we discovered we had to pay up front.  Price: 3.5/5  Reasonable for amount and quality  Overall: 3.5/5  Overall a reasonable and convenient choice for Vietnamese - good for a quick lunch in a small quiet setting;  I would like to try their wrap, which I've seen less of in other restaurants"}
{"text":"Went in as a group of 4, i had the special pho while my friends had the spicy hue noodles. The special soup had a good amount of meat/tripe/etc and noodles but the soup was not to my taste, it did not have the meaty depth i like in pho soup bases. My friends really liked the spicy hue soup. Overall we finished everything and warmed us right up! Only reason i dock a star is along with my preference in soup, there was no choice in soup sizes. Personally slightly more expensive than I'm used to but on the scale of tens of cents."}
{"text":"This was my second time visiting. I  wanted to place an order to go for 5 people. Unfamiliar with the menu, I asked the waitress for some dish recommendations and she just looked at me and she wasn't helpful at all! So I picked a few things and when I got home the portions were small for what I paid. Taste was fair compared to other Vietnamese restaurants I've been too. I won't go back"}
{"text":"Hubby and I came in for a date on a cool October afternoon.   The ambience of this restaurant is cozy and inviting, and the decor is fairly modern.  Since we were having a late lunch, we only ordered the soups and bubble teas.  My rare beef and beef ball pho was flavourful (you definitely can taste the aromatics infused in the broth) and it was served steaming hot.   A lot of care went into the broth itself--it was the clearest and cleanest I've ever tasted.  Although one can only order the pho in one size only, it is a fairly large serving at an affordable price ($9.99 to $10.99). I do wish that they would have given me more rice noodles, though.  The pho comes with your own individual plate of bean sprouts, lime and fresh basil.   The mango bubble tea was made fresh(no powder).  Be sure to ask the server, since some bubble teas are made with flavoured powders...         On my second visit a week later, I ordered the spring roll appetizer(crispy and hot off the fryer) with my son, which we gave it the thumbs up!"}
{"text":"If you like pho, their broth is exceptionally clear and tasty. Friendly service, modern decor. It's right beside a Marble Slab, so if you're craving something cold and sweet right after the savoury and spicy stuff (satay soup is always great on a cold day), you're all set. And that broth...yes!"}
{"text":"Yay!  Another Vietnamese restaurant in Crowfoot area!  I'm a happy camper!  This restaurant just opened 3 weeks ago.  We received a takeout menu in our mail box and decided to try out this newly-opened restaurant.  It's next to the Marble Slab ice cream. There is Grand Opening Special now.  If you dine in and order at least $30 before tax, get an order of spring rolls free (4), worth $5.99.  Served piping hot with fish sauce.  We ordered the following:     23 - Shrimp sausage, ground pork sausage & spring rolls on vermicelli - not too bad, fair sized bowl, lots of vegetables like bean sprouts, shredded carrots, some shredded lettuce, crushed peanuts.  Add hot sauce and fish sauce and we're good to go! 31 - Rare beef & beef balls pho - big bowl of hot beefy broth, beef slices, beef balls, comes with a plate of fresh basil, bean sprouts, lime pieces 36 - Satay Beef Pho (Satay Peanut soup) - quite good satay soup, load of beef slices, loads of pho.  Dad slurped it all up! 39 - Beef stew with egg noodle - Bun Bo kho - I like this beefy soup with chunky stewed carrots.  The soup absorbs the carrots and turns the broth to a rich dark orange bowl of goodness!  Lots of egg noodles, nicely stewed beef chunks, nicely stewed beef tendon chunks - awesome soup!  I'll have that the next time I eat there.   The restaurant has a quite big menu with rice dishes, stir fries, stir fried noodles, vegetable dishes, dessert like bubble tea, Fried banana with ice cream over peanut & condensed milk.  Sounds like an interesting dessert!    Nice little restaurant, sits about 30.  Nice red and black décor.  Some booths and half booths.  Plenty of parking out front,"}
