{"text":"I am a North Royalton resident so this place is close to home for me. My wife and I have been going to this store for around 10 years now and don't even remember how we first stumbled in but so glad we did. We used to call it \"the lucky lottery store\" because we had bought some tickets that turned out to be winners (no, not big winners). The owner greets regular customers by name and always with an upbeat personality. The in-store made broasted chicken is awesome (check out Wacky Wednesdays but phone ahead or you'll be waiting a while). The lunch meat is fresh and priced very competitively. Check out those local coupon booklets for specials and coupons. This place definitely gets 4 stars!!!"}
{"text":"Love this deli! Chicken is phenomenal and the workers are very nice and polite! My family quit buying KFC and now we get all our chicken exclusively from here."}
{"text":"Really Great store they have everything i can think of in there. and the deli and chicken is the best around. try it out its good stuff!!"}
{"text":"Generally very good chicken.  On one occasion however, I pre-ordered the chicken and when I went to pick it up they had 'forgotten' to make it.  They wanted me to wait and I couldn't.  Another time, another pre-order, the chicken tasted like leather. It must have been in the warmer for hours because it was like chicken jerkey."}
{"text":"Stopped here today to grab a bottle of wine before a Christmas function and the minute I opened the car door I smelled chicken and jojo's. The wine selection was very limited but I found a decently priced bottle of Estancia and got out of there. 

Fast forward to my way home after a very dismal brunch and I remembered how good the parking lot smelled. I just had to stop and grab some chicken and jojo's because I knew we wouldn't have any Christmas leftovers in the house and we would be hungry later. Let me tell you it tasted better than it smelled and was very reasonably priced. The guys behind the counter were very friendly and helpful. Next time I'm passing through...definitely stopping again."}
{"text":"This little corner store is a very inviting and friendly place. The minute you walk in the door the staff welcome you. The deli counter is top notch and the sandwich menu keeps expanding. If you dont like the way a sandwich is made, they will make it your way. They really try to give you what you want. Everyone that works there is friendly and willing to help. My family LOVES the chicken and Jo Jo's"}
{"text":"I have been going to this great place for YEARS! Hands down one of the best places for deli meats and best chicken and jojos also. Family owned and the staff rocks."}
{"text":"Best fried chicken in the area! JoJo's are very good. Workers are friendly and work hard. You won't be disappointed."}
{"text":"I live in Parma but was visiting in North Royalton so I stopped because I heard the jo jos where great. Walked in, its a typical beverage store with the usual wares.  The lady who greeted me was very nice and the gentleman who fulfilled my order was also nice and efficient. The jojos are good and filling. Sorry no chicken review as I am veg but the other reviewers enjoyed it."}
{"text":"Best deli in town! From subs, to fried chicken, to an array of sides, Pic Quick is a one stop shop for all your food cravings. Frank is so awesome and my preferred sandwich artist/magician. His sandwiches are literally a work of art that leaving my taste buds dancing for hours. Highly recommend Pic Quick for lunch, dinner, or your catering needs. You wont be disappointed."}
{"text":"Best hidden secret in North Royalton. I just recently discovered this spot. The chicken is the best I have ever had. They have a very large deli, and the prices can't be beat. I am always greeted by a smiling face and great service. Definitely worth a visit."}
{"text":"Never thought I'd be reviewing a deli not named \"Jacks\" \"Corky & Lenny's\" or \"Slyman's,\" let along giving it 4 stars. But this place is a little gem you could easily pass by if you didn't know it was there. 

The people are really nice, the food fresh, the chicken outrageous and prices reasonable. They also have some of THE best chicken and tuna salad I have had anywhere in the country. 

This deli is NOT in my neighborhood by a long shot. Regardless, I am always happy to make the drive because 1) there's nothing better closer to me and 2) I know it will always be worth the trip. 

If they ever added fresh, well-made hot corned beef sandwiches I'd probably ask the owner to adopt me. 

Great little place; give it a try soon."}
{"text":"I am a health nut and a very picky eater. This place is spotless, the chicken is unreal, the corned beef is amazing and the sub sandwiches are delicious. The owner is always there cleaning something with a smile and making conversation. The wait at the deli is so much better then anywhere else, never waited more then a few minutes. The prices are by far better then Walmart, Marc's or Giant Eagle. I would highly recommend trying the hot corned beef sandwich!"}
