{"text":"We ate here for the first time last night.  Tried the duck fat fries - very good but filled us up!  Sardines were nice, but not as good as the ones at Sardine, in my opinion.  Octopus was cooked perfectly.  Ravioli was like breakfast pasta - perfectly cooked egg and brown butter sauce.  The bacon was delicious and a great complement.  Pork tripe was very good - and with a generous amount of pork belly included.  Despite being full, we had to try the Sicilian Sfingi for dessert, which were like warm gourmet donut holes swimming in chocolate - also delicious.  Spring for the chemex  brewed coffee, you won't be sorry.  They give you enough to share - I couldn't finish it by myself."}
{"text":"There is no better place to celebrate life's accomplishments in Madison other than A Pig In a  Fur Coat. Every menu item is personally tailored by the chef, and the items are reconsidered frequently. After dining and experiencing the \"chef's choice\" menu we were lucky enough to discuss the food with the chef. He is extremely grateful to own a restaurant where he can mesmerize his guests with new exciting food. So great."}
{"text":"Visited A Pig in a Fur Coat last night with some friends in Madison. Great selection of brews and wine to choose from.

Since there was 6 of us we all opted to order something different and share it. We also have one friend who has a garlic allergy, which some places handle poorly. We let out server know and within minutes the chef was at our table going through the entire menu letting us know what doesn't have or can come without garlic easily.

We had the duck fat fries, winner. The poutine, some of the best foie gras I've ever had. The ravioli was absolutely amazing. The lamb heart was extremely delicious... Needless to say, there was no disappointment with anything served.

For dessert, I suggest the bread pudding with the basil gelato, and the awesome coffee!"}
{"text":"A very pleasant surprise - food and service at this Madison eatery was far better than expected.

We started with the bone marrow infused meatballs, which were savory and tasty.  The marrow added real richness and silkiness to the dish.  

Followed with the poutine, which was decadent and rich.  The duck fat fries were covered in cheese curds, foie gras and a rich and savory poutine gravy.  This was a highlight to the meal, but we should have had it a bit later as it's a fairly heavy dish.

The foie gras mousse and lardo on fig-infused bombolini was ridiculously good.  The richness of the foie and lardo combined with the sweetness of the figs, and the savory bombolini for a perfect three bites.

Our final main was a Wagyu ribeye that was enriched with marrow and served over lentils with oxtail.  The oxtail meat almost disappeared into the lentils and added flavor, but not substance.  While we liked this dish a lot, it wasn't our favorite of the night.

We ended with the cheesecake, which was served in a small jar, accompanied by cappucino and a Chemex brewed coffee.  A great ending but we were full by the time the dessert course arrived.

Service was friendly, knowledgeable, and timely.  The wine list was heavy on italian offerings, and could have been a bit better by-the-glass. All in all, an excellent dining experience."}
{"text":"I really like this place, although because it is quite rich, it's more of winter restaurant to me.  Some of the menu items are absolutely outstanding, including the ravioli and foie gras.  The drinks are good.  The only reason I don't give five stars is because I think it would be nice if they had a few lighter options on their menu to balance all the richness.  That being said, I will be back!"}
{"text":"For my birthday I did a restaurant crawl, 5 locations in 1 night! Started with Tempest for oysters, intended to stay for one appetizer at Pig in a Fur Coat, pork buns at Unami, dinner at Forequarter, and dessert at Nostrano.  Well when we got to Pig in a Fur Coat, the plans changed.  It was badger homecoming and a bit slow, our waiter was a bit over-bearing but informative, knowledgable, and friendly.  The overbearing was probably due to the lack of other customers.  He offered us tastes of any wines and did not seem impatient while we tasted. We started with the duck fat fries and carpaccio. I LOVED the carpaccio, could have ate 3 more plates all the flavors blended perfectly. My bf liked the duck fat fries, but at the end of the day fries are fries and Hot Doug's in Chicago may have them beat on the duck fat fries. We moved on to the pork belly. Cooked perfectly, since this is something that can quickly obtain a tough and chewy texture. Mind you, we still had 3 more places to eat at.  But I couldn't resist ordering the veal.  Everything so far was a 10, but the veal, still amazing, I would rate a 9, just lacking a little flavor seasoning-wise.  Still moist and tender, greens and potatoes complemented it nicely.  Honestly, my expectations weren't high for this place, I just chose it because it was new. Well people need to start talking about this restaurant more and giving it the praise it deserves because it is phenomenal!  Love the ambience, decor, intimate setting, but ultimately the food was outstanding. Blew the other restaurants from my evening out of the water. We will be back soon to enjoy even more.  Nostrano was the only place we didn't go to due to lack of stomach room without regret, thanks to Pig in a Fur Coat."}
{"text":"Hands down one of the best places I went to in Madison. This review is several months late. On my first night I tried pretty much every appetizer. On my second visit I came with a small group and tried everything else that I didn't get a chance to try. Both nights did not disappoint. Both nights I ate and enjoyed everything, including the drinks we all ordered. The first night, the bartender, I believe his name was Steve, and he was the most helpful staff there. His recommendations on food and drinks were on point and did not steer me wrong ever. Delicious food, very cozy atmosphere and wonderful staff. The wagyu is perfection, the fois gras mousse was mouth watering, and the meatballs were amazing. A must visit in my book."}
{"text":"Willy St Fair:
The singularly most disappointing execution of a BLT that I have ever eaten.  I normally would  not review a restaurant based on a street fair; this misunderstanding of the BLT was so egregious that it pushes me to speak up.  
A BLT is a savory umami sandwich that should have the crunch of lettuce as well as toast.  Wonderbread, iceberg, and turkey bacon can produce a passable BLT which would certainly be more satisfying than what I was served.  
Points of contention: 
This was served on a bun.  A bun that was sweet and not toasted.
The only savory or umami element was bacon jelly; this just added more sweetness, and no salinity.
The bacon on this sandwich was replaced with pork belly.  That's it, just pork belly.  Not smoked salted pork belly which references the missing bacon.  Just fatty pork belly.
Finally there was no crunch to this.
Upon finishing the 'BLT' I was forced to find a place to sit and wait out the diabetes feelings.  A feeling similar to eating an entire slightly undercooked apple fritter was with me for hours.  

Recalling the experience days later, my stomach turns."}
{"text":"We came here for a celebratory dinner as a large group of 11. They were nice and were able to let me add a couple of people to the reservation we made.

However, when we got there, our table wasn't cleared yet, and we had to wait over 20 minutes for our table to clear even though there were only a couple of people sitting there and talking, having already paid. So there we were--a group of 11 people--waiting in the doorway of a small restaurant and getting in everyone's way! We had a late reservation and were all really hungry. 

We would have waited longer if one of us didn't ask the waiter how much longer they anticipate the wait to be. A male waiter very rudely replied, without apologizing, that they can't make people leave.That is fine, but other restaurants I've been to at least give guests a heads-up when another reservation is coming in soon...or have been waiting for over 20 minutes. 

When we finally sat down, the same waiter came after 2 minutes, didn't say hello, didn't welcome us, didn't apologize for the delay, and just tersely asked for our drink order. Most of us hadn't even had a chance to look at the drink menu yet! He was so abrupt, rude, and treated us like we didn't deserve even an apology or even a hello from them. Was it because this restaurant is popular, and they are too stuck up to treat their guests nicely?? I hope not.

We ended up needing to ask for a different waiter. The second one was really nice and asked us if this was our first time at A Pig in a Fur Coat (it was), explained the menu to us, and even helped pick out gluten free items for our friend who has Celiac disease.

Overall, I am wary of coming back here because of the poor service and the uncertainty of being seated even with a reservation. It was not a relaxed, down-to-earth experience.

The food does not make up for how we were treated."}
{"text":"Initially I was drawn into this place by the website. Interesting name, simple design, and an intriguing menu.

The restaurant itself is consistent with the website: small, simple, and clean. The only contrast between the two is that the restaurant was busy and that is a good thing for a new business.

The service was fast and friendly. Even though the dining room was pretty full we were greater quickly and sat down immediately. Within minutes we had water and put in drink orders. I'm a sucker for frosted beer glasses which we were offered with our drinks.

The food was all pretty amazing.

Charcuterie - nicely done pork, chicken, blood sausage and liver pate. Came with some cloves of garlic and crusty bread. The flavors were very good. The only thing I would have liked to see would have been some pickled veggies for contrast.

Duck Fat Fries/ parmigiano reggiano/ truffle  - yup, duck fat fries. Can't really miss with these. The aioli was very small but really tasty. 

Octopus/ chickpeas/ kale/ tomato - very well cooked and seasoned. Could have used more octopus but the flavors and textures were nice.

Ravioli/ egg yolk/ pancetta/ ricotta/ brown butter - very big flavors. We saw every table around us order this item so we went for it. Honestly, it is a little rich for me but it is worth a try to form your own opinion.

Beets/ goat cheese/ arugula - I'm admittedly not a big fan of beats but this dish was pretty good even for me. The pile of goat cheese and balsamic bring out the best flavors of the beats.

Since there were only 2 of us we couldn't try more but I will be back to try to cover the rest of the menu. A few other notes:

- the pig trotters on the website were not on the menu when I was there
- the veal is a huge portion. Looks like the meat at the beginning of the Flintstone's cartoon."}
{"text":"Had their food at Willy St Fair. Got the whole pig and it was mostly partially cooked fat. Yikes! Really? There is no excuse for selling that."}
{"text":"For the most part this place was excellent - nice atmosphere, great service, and the flavors worked well. I wish the veal neck dish tasted more of miso, and the duck egg ravioli was a little on the cold side."}
{"text":"Went to Pig in a Fur Coat on a beautiful sunny evening and our meal was perfect.

We got:
-Chorizo stuffed dates - Interesting mix of sweet and salty. My partner's favourite, since it was so unique
-Egg yolk ravioli - My favourite. I still dream of its delicious savouryness. The ricotta was the perfect, light cheese to top it off.
-Beet salad - Disappointing. The beets were huge chunks to it wasn't delicate and fresh tasting. The beet salad at Graze is much better.
-Porchetta - Fell apart. The meat was beautifully cooked although the flavour was a little uninteresting.

Our waiter was jolly and efficient. The restaurant is well decorated. And the meal wasn't even too expensive - $62 before tip!"}
{"text":"Came on a Saturday night, couldn't get a reservation the night of, but walked right up and ate at the bar. Delicious wines and the charcuterie board was excellent. Prosciutto was to die for. Will be coming back again!!"}
{"text":"I don't want to mess with PFC's ratings, as the place is great.  It may not be as good as it gets, but it is about as good as it gets in Madison.  Our personal rating system would save five stars for only the finest of fine dining, but fair is fair.

We enjoyed an early supper, which always helps to get the chef's attention in advance of the mob that arrives later.  Both the chef and the waiter were on their toes, welcoming and checking both during and after the meal.

We can recommend the rabbit and pork belly specialties as small plates, and we never got to the larger ones.  They were as good as advertised.  What more can you ask?  I didn't order the mussels, but saw them delivered to the next table and would certainly try them on our next visit.  Had a couple of other small plate items, but the rillet and pork belly stood out.

Their selection of wines, brews, and meal choices are sufficient to cover anyone's taste short of those in the allergic crowd.  Limiting the menu and doing everything well appears to be the Pig's focus, and we approve."}
{"text":"One of the best meals I have had this year, especially for the price. The concept is great too. It is like tapas of fine French food that are to be shared with the table. Great stuff."}
{"text":"We tried the chorizo dates, ravioli, venison ribs, scallops, and two desserts. There was A LOT interrupting conversation to say, \"Oh, wow, that's [insert exceptionally pleasurable adjective here to describe food].\" We didn't have anything that we'd consider mediocre- the food was fantastic. The four stars rating is because 70% of the seating is \"communal\" dining, meaning you sit at a large table with folks you don't know. When out for a drink or opportunity to meet new people, that can be great. However, out for a full meal with a partner or small group, it feels a little \"squished together.\""}
{"text":"One of my faves in Madison -- GREAT food that you won't eat anywhere else.  The rabbit rilette is to die for.  Always great wine offerings!  Knowledgeable staff & great service.  We went there for Valentine's Day and their menu was outstanding!  Loved each course AND the wine pairings were outstanding.

Highly recommended!  Go early.

Rock on PIAFC!"}
{"text":"Have I really not written a review for this place yet? Bad, Simon. Bad.

I've probably been here a half-dozen times and am happy to report that it is one of my favorite restaurants in Madison. I've liked everything I've eaten here. We had the NYE tasting menu too, which was excellent and convinced me that I need to keep an eye out for other events.

The restaurant is not \"fancy\" in that french restaurant, fine-dining kind of way. It's more comfortable. I'd gladly rock jeans and a suit jacket or even just a simple polo/oxford. But the food...it actually reminds me of a restaurant that I ate in while in Paris. The food is a little different of course, but that same sort of authentic feeling vibe. I'm into it.

If you're a capital square kind of guy, it's time to stroll down Willy St. (well, if it's winter still, maybe consider cabbing...)."}
{"text":"An excellent meal with a knowledgable and really helpful waitress. The cocktails were great, food very good, atmosphere great. We'll definitely be back!"}
{"text":"Service was amazing. Great bartender and the food was delicious. Food art."}
{"text":"Terrific meal; great service (from the bar no less).

We wanted good food and needed a quiet spot to plan something, so headed to the empty bar. Bartender was spot on with her food advice and made some great cocktails (both ours were just the right hint of both fruit & bitters). She offered us great service in addition to doing her regular job.

Despite the restaurant name, perhaps the best dish was seafood: we had clam/pasta small plate and needed some bread because we could not let the sauce go to waste.

Duck fries & lamb carpaccio were both delicious. 

FYI: porchetta is more of a roast, swimming in juice alongside potatoes, pepper, and (delicious) spreadable pork sulami. Very good, but just a heads up in case you are expect the drier, oven version."}
{"text":"Not impressed. The scallops were cooked to perfection but I thought the pork belly pairing was all about fad and not about what could make the dish delicious or have good mouth feel. It was mush and mush. Also, big faux pax to serve horrendously overgrown green beans along with the wax bean, and then undercooking them to boot. The pork belly dish was fine. The beef fat fries were fantastic. I don't think we will be back. Just not worth a second try."}
{"text":"Fantastic.  We sampled 3 items from each of sections:  starters, small plates, large plates and dessert.  The food was imaginative, fresh and very tasty.   All the food is meant to be shared.  The service was fantastic.  The staff was knowledgeable, timely and friendly.  Very casual atmosphere. Communal dining tables.  Some people were in shorts, some were in dresses.  You can where whatever's comfortable.  A go to place.  Love it.  We are going again when we come back to Madison."}
{"text":"Pig is one of my favorite dinner spots in Madison. the portions are modest, but the food is rich and delicious. the rillette, blood sausage, and veal neck were especially good. the dessert is unimpressive. the biggest disappointment is that they do not change their menu more often, which is lazy for a restaurant of this kind."}
{"text":"I went to A Pig in a Fur Coat to try out their new cocktail menu after work. I didn't plan on ordering food, except perhaps some olives, because the menu is heavy on the meat and dairy (which I don't eat). 

Once I got there, however, my friend ordered dinner along with her drink. I awkwardly explained to the server that I didn't intend to order anything to eat myself because I wasn't exactly in their target market. He, a very enthusiastic and knowledgeable server, got excited. 

\"We love cooking for vegetarians!\" He insisted that the chef could meet any requirement and would be delighted by the opportunity to do it. He quickly rattled off numerous examples of how this had gone down before, and I was convinced. 

We did get the orange and fennel olives to start, and they were mostly delicious. The pinkish ones were my favorite, smoky and meaty, and I would have enjoyed just a bowl of those. The green and black olives in the bowl were fine, but not as flavorful as the pink. 

My friend got the ravioli which she said was excellent, and my small plate turned out to be a roasted potato covered in sautéed mushrooms, asparagus, cloves of garlic, and onion, all resting on a swirl of squash puree. It was flavorful, juicy, savory, and quite good. 

My negroni was tasty, as was a glass of Cote du Rhone. The prices for drinks were lower than I expected ($7 for the cocktail, $6 for the wine), which is especially nice given the the atmosphere of the place. I'll save returning for dinner (which I will do!) for special occasions, but I'll stop by for drinks anytime.

Their warmth and grace were delightful."}
{"text":"I don't think it's a big secret that I like food. A lot. Tonight's meal at Pig In a Fur Coat was one of the best. Great food, great service, great friends. I am blessed."}
{"text":"Great addition to the neighborhood. Delicious, innovative food, cozy hip atmosphere, great beers & wine. I imagine this will become a new favorite on Willy St. Reminds me of some of the cool gastropubs you cam find in Chicago. I prefer to go here with a group as opposed to a one-on-one date, as it is rather lively inside.

Calling it \"tapas\" (as listed in Yelp) is a misnomer, though. Yes, it's small-plate style, but not Spanish style, which is what I think of when I hear tapas."}
{"text":"Love everything about this place. Amazing porchetta, duck fat fries (!!), dates with chorizo very similar to those at Avec in Chicago, beets with fun edible \"soil\". Great staff. The only thing I'd change is that I wish they'd freshen up their menu a little more frequently or have some fun rotating seasonal specials. While everything I've tried is excellent, the menu's been the same for a bit too long -- I want to taste more of the delicious ideas that Chef Bonnano can come up with!"}
{"text":"I was recently at Pig in Fur Coat with a large group of friends.  We shared a bunch of plates together and had a great experience.  Our server was very attentive and our food was timed perfectly.  Everything tasted awesome.  Try anything - you won't be disappointed."}
{"text":"One of the best and most innovative restaurants you will find in the Mid-West (not just Madison). Try the Poutine! It even beats the ones you get in Quebec."}
{"text":"diamond in the rough for sure. surrounding neighborhood is full of rotted out houses, but this place does great things regardless of their location.  charcuterie platter was great, prices are affordable for the quality presented, and the staff was eager.  i recommend the duck egg ravioli, because the brown butter and fried swiss chard give it a winning edge.  fois grois mousse was creamy and the flavor was great with the fig paste, but is was a clunky eat and hard to divide.  all in all we ate like kings, drank a bottle of wine, had desert and split a glass of prosecco for less than $120.  if i lived in the area i would find an excuse to go eat the charcuterie platter a couple times a week over drinks."}
{"text":"Got into a (small) fight with my girlfriend once.  I wanted to check this place out and she did not.    Well, one day I get her to come with me and I've gotta say, she was right.

The ambiance and seating are great, I really liked the place when we first got there and sat down.  I wasn't impressed with the beer menu, hardly any porter/stouts, two or three, despite it being the season.  We ordered the octopus, ravioli, fries, scallops, and one more dish I can't recall.
The ravioli was absurdly small, and yes I know its small plates, and too rich.  Felt like it was more of a dessert.  I had wanted duck fat fries for a while but was pretty disappointed with these.  The scallops and octopus were really good, especially the octopus.  We finished with the Sfingi, which was a fancy way of saying deep fried donuts.

Overall, I was very let down.  We weren't very full, had spent a lot of money without ordering lots of drinks, and didn't think the food tasted that good.  I've enjoyed some pretty pretentious restaurants but this one is not for me."}
{"text":"I can't not give this place 5 stars. We came on a Saturday night around 6, and though we could have had a table pretty quickly chose to sit at the bar. The bartenders were nice and knowledge, but not as attentive as I would expect. They have an interesting wine and beer menu as well as some good looking cocktails.

The food was amazing. For two people we ordered the rabbit, octopus, pork belly, and lamb, which was probably too much; we were stuffed afterwards. Though everything was delicious, my favorite was the rabbit, but my boyfriend won't stop talking about the octopus. I loved how many different flavors were in each dish and how well they paired together. Can't wait for the chance to come back and try other items on the menu!"}
{"text":"It's difficult to avoid the rumblings about a great restaurant when you have foodie friends.  This is really what led to us having dinner at Pig in a Fur Coat. 

I consider myself a foodie, but not a food snob.  I probably won't pick up on something being a tad greasy unless it's really so - and I don't arrive at criticism unless the item in question has hit some major roadblocks.  

That said, I'm a chubby man who loves food and my palate has found a favorite in this restaurant.

The duck fat fries will forever be in my dreams."}
{"text":"PiaFC is one of the best places to eat in all of Madison. There! I said it!

This place encapsulates what I love about Madison. Foodies will love it, but my farmer father thinks it also sounds delicious. The flavors are familiar enough to appeal to a wide group of people, but the execution gives it the wow factor that will keep you coming back.  It is classic food, at it's finest, dressed up in a mink coat. ;)

Service - Great! I love wine and had looked at the list ahead of time, but I still chatted the waitress about the list and she knew it well. I went with a group and we requested to have a slow,  lingering experience. We got that. I never felt rushed and we even got to meet the chef in person!  Every once in a while, he came out and chatted with the customers, which I really appreciate.

Drinks - Mostly Italians wines. Red list is much better than the white. Beers are mostly local (and delicious) with some other good standards from around the country.

Atmosphere - Communal dining. Some small tables, but also a few long, shared tables. Even though it is a small space, they make good use of it. 

Price - I was pleasantly surprised when we got the bill. Albeit, we never ordered a large plate, but ordered MOST of the appetizers and small plates, along with alcohol. For what you get, this is a steal.

Food -   Amazing. Charcuterie and Cheese plate is a really unique combination of delicious cheeses, cured meats, and other various tasty additions. The duck fat fries were all I hoped they would be. The poutine with foie gras was wonderful, but rich. We had many of the small plates, but the stars were the egg yolk ravioli and venison short ribs. The ravioli is like breakfast on steroids. It is a magical combination of creamy, rich, salty and savory. The venison short rib fell off the bone into a glistening, juicy meld of spicy, sweet and savory. I don't even eat venison (because I don't usually like it) but I Loved the short ribs. Dessert was wonderful as well. The Sfingi is much more complex than just a fried dough. There are hints of cinnamon and orange and a thick chocolate sauce. Decadent. 

Takeaway is fabulous! PinFC really is a Madison treasure. Lets hope for a John Beard winner!"}
{"text":"We came as a group of five midweek. We were seated family style at high tables. They have a fairly large selection of local brews. Our meal consisted of a series of shared plates. There are three sizes: appetizer, small, and large dishes. The poutine with cheese curds and four gras was a nice twist on the traditional poutine. We had the grilled octopus that had just the right amount of char to it.  The charcuterie plate was enjoyed by all. And least I forget, the pork belly! We were able to add on dishes as ate along. By the time we were done eating,there was a crowd waiting for seats.  Definitely worth another visit."}
{"text":"I was skeptical about the menu but after hearing excellent things about Pig in A Fur Coat I decided to try it out. Although the menu lacks anything green or light everything was so flavorful and delicious! You must be in the mood for meat as almost everything has some kind of meat and likely pork in it."}
{"text":"OMG. If you love to really taste your food and taste your wine, this is the spot. We had an amazing meal. Sat outside and had a crazy yummy bottle of wine. We'll be back"}
{"text":"I have to say its one of my favorite restaurant in Madison so far. The design of the restaurant is good, and the taste of the food is new and good to me! Just like it !"}
{"text":"This place is great and was shocked it didn't win Best New Restaurant....it should have.  We love to come here with a group of four....eat slowly and order a bunch of different items through out the meal.  The menu always changes and there are always some new preparations.  

Some favorites.....stuffed dates, pork belly, charcuterie plate, scallops, lamb carpaccio, etc.  This place is good.  Go, wait your turn for the table and eat out of your comfort zone.  You'll love it."}
{"text":"Great dinner last night!

Our server was really wonderful. She was helpful (made some great suggestions), friendly, and frankly did a great job making sure we had an awesome dining experience.  Unfortunately I cannot remember her name.  However she had a cool tattoo on her arm - a mountain range that is a ruler.  

The food was really good.  We had:  duck fat fries, arancini (fried rice ball filled with sausage), pork belly, beet salad, and the chicken thigh.  The arancini was a standout.

My wife and I shared all the dishes.  We enjoyed the pace of the meal - not sure who to compliment - our server or the kitchen.  Regardless it was a great pace - not too fast and not too slow.  

The wine and beer list is more than adequate and very reasonably priced.

Nice addition to the Madison restaurant scene.  We will be back!"}
{"text":"this was my first time & all I can say that this is an awesome place. everything I had was absolutely delicious, from the Willet bourbon to the Duck Fat Fries! 5 stars not only for the food, but the staff as well! I would not hesitate to recommend this place!"}
{"text":"Been traveling to Madison for years for work - can't believe it took me 5 years to find this place.  We had the ravioli, pork belly, beets, foie gras mousse, and lamb carpaccio - everything was amazing. The egg bacon ricotta ravioli and carpaccio was our favorite.  Must go here - great service as well!"}
{"text":"Wife and I visited for the first time Saturday. Why? Anyone that plays on the \"Most Interesting Swedish Chef in the World' on their web page gets my attention, and we were looking for something different to celebrate my birthday. 
This is one of the more creative menus in Madison, and they execute extremely well. 
We basically ate off of the appetizer and small plate sides of the menu. ( How can you not try Duck Fat Fries? ) The Foie Gras Mousse is one of the best things I've ever put in my mouth. I'm thinking carry out with those bad boys and a Duck Roll from Muramoto, and I'm set. 
Sara did an excellent job with the service and it was an overall splendid evening."}
{"text":"I seriously can't wait to go back. The Fois Gra, Rabbit Roulette, the venison ribs, and not to mention the Poutine!!!! They are true masters at their craft!"}
{"text":"Are you KIDDING ME?! I found this spot thanks to Yelp (love you Yelp) and I'm so very thankful for finding it. I am in Madison for work and have been hearing more and more noise about Madison being a foodie scene. This place comes highly recommended so I grabbed my (highly skeptical, picky) coworker and talked him into it. Boy was I glad I did. 

They have a great beer and wine selection. I had a couple of glasses of a very reasonably priced delicious prosecco. 

Our server (who was excellent, wish I got his name, he's a tall blond guy, very friendly) recommended the poutine. My coworker had never tried duck fat fries or fois gras so he was skeptical but I talked him into it, provided the fois gras came on the side. OH MY OH MY WAS IT GOOD!!! The cheese curds, the fries, THAT FOIS GRAS!!!!!!!! I ate the fois gras, so I tapped out on eating too many fries (it was pretty rich), but DAAAAAANG was it good. 

In fact, my picky coworker even said he'd try the fois gras next time. 

I ordered the octopus as my entree. It's a small plate, but it was perfectly seasoned and tender. And after the fries that's all I could handle!  

At the end I got a high five and the endorsement to continue picking restaurants. Man this place is great. If you're in Madison check it out!"}
{"text":"Two of us ordered snacks (meatballs, squash blossoms), two small plates (pork belly/eggplant and burrata), and dessert (Sicilian Sfingi - amazing!) to share. Sure, with a glass of wine and tip, you spend more than you might at the Whole Foods hot bar, but it is totally worth it - the price is reasonable for what you get. The food is rich and delicious and leaves you full and satisfied. All the flavors are thoughtful and blend well together - nothing overwhelms and nothing is extraneous. The bone marrow meatballs are not to be missed (those pigs died happy). Next go round, I would skip the squash blossoms - they were lovely, but nothing to write home about. The burrata was what all cheese dreams to be. 

My first complaint is actually that the food came out too quickly - I would have appreciated a bit more time to savor each dish and more time to drink wine! But we were there early on Friday (5pm), and one of maybe three tables. My second complaint is that there was no bread - one needs a bit of bread for the extra onion jam at the bottom of the squash bottom bowl, to soak up the bone marrow juices from the meatballs, for the remains of the eggplant."}
{"text":"Wow!  Best food I've had in Madison since Magnus was Magnus.   Don't think twice - eat here!

Small plates, everything meant to be passed around and shared.  Everything was beautifully prepared, interesting and very tasty.  I will go back as often as my budget allows (not inexpensive). 

Standouts from our meal:
Lamb Carpaccio - with egg yolk
Ravioli - with bacon and duck egg
Trout - oh so good!
Dry Aged Strip - amazing flavor

Less favorite:
Duck fat fries - still just french fries
Sardines - would be better in a paste"}
{"text":"I have been to this place twice and this restaurant has become our new favorite in Madison. The only problem is it's a small place and have long waiting hours. I love the pork belly, arancini and Chorizo stuffed dates. The beets salad is also very good."}
{"text":"I came here with a couple friends and split several dishes.  The food was fantastic!  The communal table in the middle was a little strange (and slightly too high) but it added to the quirky charm of the restaurant.  Of especial note is the poutine (eat it quick before the fats coagulate!) and the scallop.  You can't really go wrong with anything on the menu here."}
{"text":"Pig in a Fur Coat did not live up to my expectations. I had heard SO many good things about the restaurant from Yelp reviews and friends that I expected to be blown away but was sorely disappointed. First, I was not a big fan of the ambience. I didn't enjoy sitting on these tall long tables despite having multiple empty tables where my party of three could be accommodated. It was strange to share the same table with other groups in a half empty restaurant.

Second, the food was just okay. We had:
1. Poutine with foie gras, cheese curds, and poutine sauce - I did not enjoy this but members of my party did. It was just fat on fat on carbs so I couldn't handle it. Poutine sauce tastes like mystery sauce, and foie gras was interesting but not my thing. Overall, creative dish but tastes awful.

2. Ravioli with duck egg, bacon, ricotta, brussel sprouts, brown butter. This is such a letdown. Duck egg tastes very similar to chicken egg especially covered in so much sauce. Bacon is one measly thin piece but probably my favorite part of the dish. Everyone in my party didn't like this dish and thought it wasn't worth the price although very well-presented.

3. Pork belly - I thought this was most worth the hype and price. I loved the pork but was grossed out by the pork intestines. My party LOVED this dish though! It's creative in Madison context but seems like pretty typical Asian dish.


4. Sicilian Sfingi with chocolate, orange - MY FAVORITE dish by far!! I usually don't like dessert, but this one is a perfect fluffy round ball of chocolate mixed with just a hint of orange flavor. Yummy! I would go to Pig in a Fur Coat JUST FOR THIS! 

We also each ordered wine and loved all of our wine choices. Maybe I set the bar too high or ordered the wrong dishes. I'd love to give it a second chance maybe with people who've been here before and can decide on better menu items."}
{"text":"I can say without shame that I come here way too often. 

I work around the corner, so my friend and I frequent PIAFC a lot. I've had almost everything on the menu and my top four would have to be the sfingi, torchon, poutine, and guinea fowl. 

1. Sfingi: when you get your plate of sfingi, you're going to have a hard time justifying $8 for what seems to be chocolate donut holes... BUT THEY ARE SO WORTH IT. The tiny hint of orange mixed in with cinnamon is absolutely fantastic. So much so that the chef always jokes that he's going to make me a sfingi punch card (I'm still waiting on the punch card). 

2. Torchon: the torchon has a bombolini (I just call them little donut holes, hehe), a slice of foie gras mousse, a fig mixture, and lardo (which is a similar to proscuitto but a lot fattier). Simple, delicious and fantastic. 

3. Poutine: awesome, awesome and AWESOME. All the other reviews rave about the duck fat fries, which I adore, but the poutine is phenomenal. You get the best of both worlds because the poutine comes with duck fat fries. The poutine sauce is rich and goes really well with the foie gras, cheese curds, and fries. 

4. Guinea Fowl: the guinea fowl has to be my all time favorite entree here at PIAFC. I love how the feta offsets the sweetness from the fregola and complements the spiciness from the chorizo INSIDE the fowl. Delicious."}
{"text":"I love it. The best American food I have ever had. The pork belly, lamb small plate and fries are fantastic. However the octopus and veal neck plates are mundane."}
{"text":"Went back to Madison, even just for 24hr I was craving for the pork belly.

Food were still mostly fantastic as they were, however the big portions weren't as impressive as the medium/small ones. Lamb and heart was little undercooked; the porchetta was dry...a little disappointed. We finally tried deserts this time. The doughnut thing was okay and very doughy, but Panna Cotta was light and simply lovely!

Regarding my last time complaint, the same waiter waited us, much better but still needs a little more improvement. We virtually sat at the same spot so chairs and space were as problematic as before. 

P.S. the lady to assign seats, if the group on the list did not show up in 10 minutes, can you please just let it go and give them to the next group?"}
{"text":"Excellent, so far best in Madison. Duck fat fries of course, everything else, get a variety and prepare to share. Not the biggest plates for the money at first glance, but if you know your food, a true bargain for what you are tasting. 2 people will drop $85 a piece with a couple beers, but also will eat an appetizer, 2 small plates, and 2 large plates - and as should be, will walk away full and smiling about what you just had."}
{"text":"If you give this restaurant less than 4 stars I kind of question whether you have a soul. As others have said, the duck fat fries and pappardelle are can't-misses. I won't say that every dish is perfect, but they all offer something well above and beyond what you're going to find at another restaurant or (in my case) realistically make in your own home. The atmosphere is also bright and fun, and sharing is encouraged which is very much my jam. Even the beer list is full of great options that you won't find elsewhere in town."}
{"text":"As everyone says, it's small plates that come out as they are ready, so if you aren't into sharing, this is not going to be a place for you. Almost everything was fabulous and unique. It definitely has its own twists on dishes, such as the poutine made with duck fat fries, cheese curds, and foie gras. My only recommendation is to order items that you haven't seen on other menus because even though they are good they won't blow you away compared to everything else you will eat here. This is a must go for any foodie!"}
{"text":"Mediocre-to-average food dressed up with some great plate-ing style. If you're looking for fine dining in Madison, go elsewhere. 

The space is cozy and inviting. The staff is great and very knowledgable. The concept it awesome: the menu is designed for sharing. 

But the food just isn't spectacular. Good concepts all around, but textures and flavors are predictable. Not bad. But not worth the fine-dining price tag. 

And the course categories are misleading. The snacks are served in bowls. With fries.

We were told the \"small\" plates would be a few bites each if we shared: they were full-sized appetizers. The \"large\" plates are designed to share, and I started to worry we'd ordered too much food 'cause we ordered two. But we were fine. Husband ordered scallops and there were three. I ordered rabbit and it was a good portion size for one person. Kind of seemed like there was the same amount of food on each course, although the plates themselves were different sizes."}
{"text":"We had the ravioli, octopus, poutine, scallops and sfingi. Absolutely amazing. Food came out fast (we told the waitress we were starving) and hot. Flavors were amazing. Nothing over cooked. I would recommend this place to anyone who wants a lovely dinner. Cocktails are on point also!"}
{"text":"Yep.  I will be back.  This menu was insane.  The service was wonderful--our server was helpful, witty, attentive, and quick.  Loved it.  My husband and I shared the duck fat fries...ok not a good start, there are WAY better fries in Madison.  WAY better.  Then we moved on to the dates....ohhhh yeah.  Super delicious, wanted more.  On to the ravioli.  Sweet jesus was that unbelievable.  A must-try.  Large plate was the porchetta.  Praise the food gods, pork wins. Amazing.  Hubby was not blown away by it but I thought it was so, so flavorful.  Dessert was good too--sfingi.  Yummy orange scented donut thingies.  Drooling again.  Try it!"}
{"text":"My husband and I came here for dinner on a Friday night and were really impressed.

It's a nicely decorated, intimate space. The service is good, our waiter was friendly and well informed. We had the sardines, octopus, chorizo stuffed dates and pork belly. I loved the sardines and the octopus especially, but all the plates we tried were creative and delicious.

I highly recommend this place if you're in the mood for wine and some small plates that really hit the spot."}
{"text":"I was really excited about going there but ended up very disappointed. The server said that the plates are designed to be shared but it is NOT! It is almost impossible to share.  The food is good but greasy at the same time.. I won't want more than 1 bite..."}
{"text":"Creative, delicious food that lives up to Madison's great food scene. I enjoy coming here when I'm not looking for an intimate experience, as it's a tiny space and seating is close together. Great drink menu too."}
{"text":"Our dining experience here this past weekend was exceptional to say the least. While waiting for a table, we enjoyed drinks at the bar. Their cocktails are definitely worth a try! The Dream Catcher was a dream to drink and the perfect way to start the night.

Once we were seated, it didn't take too long for us to peruse the menu as it was just one page with dessert options on the back. We had never really dined with small plates before, so it was very new to us. Their duck fat fries were definitely my favorite of the night. The fries were so crispy!! Every bite delivered a satisfying crunch and burst of parmesan flavor. The garlic aioli dip was the perfect complement to these lightly salted fries.
We also tried their charcuterie platter, which came with 4 different cured meats, 2 different cheeses, and some crispy bread pieces. I am particularly sensitive to salt, but I think most people would thoroughly enjoy the strong flavors on this platter.

By the time we finished these two \"snacks\", I was already feeling pretty satisfied. But we had already ordered two of their small plates, so the food kept coming. One thing that really stood out throughout our dinner was how patient and attentive the waiters were. Our little table never felt crowded with plates, and the waiter brought out dishes as we were ready for them. Clearly they pay a lot of attention to the guests, and we really appreciated that.

Moving on to the small plates, we first tried the lamb carpaccio: thinly sliced smoked lamb meat served with corn shoots and an egg yolk on top. The entire dish felt very light to eat even though the plate was quite big. The flavors were on point. 

We also tried the octopus, which was so perfectly cooked!! The octopus was not chewy at all and had lots of savory bits from the char. The mole it was served with was also really delicious.

Finally, dessert! We went with the sfinigi, which is a traditional Italian dessert of fried dough balls infused with chocolate and orange flavors and covered with chocolate drizzle. It was the perfect blend of crunchy and soft, sweet and slightly bitter. We were already feeling so full from the meal that we had to take half of the dessert home. But that just meant we would get to enjoy it another time!

Overall, this was an extraordinarily satisfying dining experience. The service was quite exceptional. The plates were creative, inventive, and very well executed. I would highly recommend A Pig In A Fur Coat to anyone in the neighborhood looking for a new food adventure, even if you're just stopping by to see the cute pigs sitting by the windows!"}
{"text":"Insanely tasty and creative creations. Locally sourced ingredients, and hand-picked meats straight from the farm, make the food even more delicious. Interior decor was also fantastic. Best I've had in 8 weeks of traveling to Madison and eating out every night. Spent 10 minutes talking with the chef - wonderfully pleasant individual, and he knows his food!"}
{"text":"This is easily one of my favorite restaurants in Madison.  The food is really rich though so come hungry.  My personal favorite is the duck egg ravioli.  The brown butter with the parmesan is delicious."}
{"text":"Excellent place! Great atmosphere. 
Food is deliecious. Highly recommended."}
{"text":"So many interesting options!  Great food!  Love the fois gras mousse, loved the poutine!  Our waiter Christian was awesome!  Would highly recommend!"}
{"text":"The food was a gluttonous, dazzling experience not often seen in Madison, but it doesn't have me craving it more. 

The most memoriable food was a pork loin on top of pork sausage. Absolutely delicious and defintely not low fat. The sardines come in a cute custom made tin packet. The dates with piquillo peppers were good, though I could only eat a couple.

Probably the most impressive part of the experience is the atmosphere. You can sit at a communal table or at private tables at the side. We choose the private tables, which might as well have been communal, since they were so close together.  (I spent the dinner ease dropping on the first awkward date to my left and a mother/future daughter in law to the right.) You can see the kitchen from the seating area, which also means it's extraordinary hot in the dining area too. I DO NOT recommend going on a hot & humid night. Hopefully they get that fixed.

Our server was new, so I won't comment about how he forgot one of our dessert orders. He was helpful with the wine/beer selection though."}
{"text":"This place appears to appeal to would-be hipsters with its mostly-communal seating and fancy names for different parts of a pig.  There is a tendency for fusion food to be either really well-balanced and more than the sum of its parts or to be just different foods thrown together on one plate.  This place leans more to the latter.  A friend and I went there one Friday evening and after a couple of overpriced drinks at the bar were promptly seated.  Service after that fell off quickly with our waiter disappearing for long periods of time.  Had we just had the cheese plate (which was well-put-together) and left, this would be a different review.  However, I had the octopus dish, which was too rubbery on one end and charred on the other.  My friend had the steak and wasn't able to eat half of it due to the high amount of chewy fat.  He also had to wait an extra twenty minutes to eat it because the chef burned the first one.  You'd think that after messing up the first one, they would have made sure it was a better cut of beef.  Won't be back."}
{"text":"I get that \"pig\" is in the name of this place, but seriously. You open a restaurant in Madison, Wisconsin -- and in the Willy Street 'hood, no less -- and you don't offer a single vegetarian dinner entree? We won't be back."}
{"text":"Absolutely awesome food and atmosphere. I'll be a happy return customer on my next visit to Madison!"}
{"text":"Comfortable, friendly atmosphere. Wonderful. A great place to go with friends and share. Trust me you are going to want to try as much as possible. Everything is made in house, from the head cheese and blood sausage on the delicious Charcuterie to the Panacotta and other desserts.

Once a month a group of friends and I search out a restaurant to experience. We taste as many dishes as possible. The other night we had the pleasure of trying just about every dish on the menu with the exception of the cheese plate, squash blossoms and olive snacks. There was not one dish that I, personally, did not like. Sounds pretty hokey, but it is the truth.  I do, however, have my favorites.

Favorites: 
Appetizers: 
I have seen duck fat fries on tv. They are literally as good as people make them out to be. Best fries I have ever had. They make Ronald McDonald weep and the Hamburgler go straight. 
The Dates are a must try. Sweet, savory, out and out delicious. 

Small Plate:

Pork Belly. This is just a given. Wow.
Orzo - wonderful and the mussels extremely tasty
Honorable mention: Beets. I don't like beets. This dish is making me rethink that statement. Definitely try them. 

Large Plates:  

While all dishes were wonderful, this die hard carnivore has 3 must eats:

Dry Age Strip with bone marrow butter, duck fat fries and sweet breads. Never had sweet breads. awesome literally awesome. Eat this dish and call your cardiologist. But what a way to go. 

Pork - absolutely wonderful, best potatoes i have eaten. 
Chicken thighs. - packed full of flavor.

Dessert: 
You just have to try all of them. You cannot make a poor choice, each dessert is just wonderful. We had the, strawberry rhubarb pie, chocolate cake with smoked sea salt and the panacotta. Wow. Just wow. 
We left with one regret. No one ordered the Sicilian Sfingi. We must have been suffering from a food coma when ordering dessert. 

You really need stop in and try it. Trust me. You will not be disappointed. Bring friends."}
{"text":"I've eaten at \"A Pig in a Fur Coat\" about half a dozen times.

Most recently I was in there for appetizers & desert. The french fries cooked in duck fat, dusted with parmigiano reggiano cheese and served with garlic aioli are wonderful. Perfect fare for a cold blustery evening.

The bar has an outstanding selection of microbrews, and I had a Great Lakes Elliot Ness Amber with my fries.

For desert I had the cheesecake and coffee. The coffee is made in a Chemex drip coffee maker. Early in the novel \"From Russia With Love\" we learn that when James Bond is in London, he makes his breakfast coffee with a Chemex coffee maker. I shared that fact with the waitress, who seemed alarmed that I would know that, but she humored me . . ."}
{"text":"We came here with some friends from Santa Cruz, CA and had an amazing meal!  The food quality and presentation was perfect with each plate we ordered, and the wait staff were knowledgable friendly and top notch!  As we understand from our waiter, the menu changes regularly with what is available in season, but with two excellent bottles of wine we shared the following:

Marinated Olives/ orange/ fennel
Duck Fat Fries/ parmigiano reggiano/ garlic aioli
Rabbit Rillette/ pistachio/ pickled cherries
Poutine/ foie gras/ cheese curds/ poutine sauce
Octopus/ mussels/ green garlic/ crazy water/ greens
Pork Belly/ eggplant/ tomato/ sunflower/ pinenuts
Foie Gras Mousse/ bombolini/ lardo/ fig
Beets/goat cheese/ carrots/ balsamic/ pistachio malt soil

and for dessert we all shared:

Sicilian Sfingi/ chocolate/ orange
Cheesecake/ peach/ brandy/ almond 

We will return soon!"}
{"text":"I think you should go to this restaurant. Just know ahead of time that it's strange. The charcuterie platter was quite expensive for what it is, just a bit of meat, two kinds of cheese, blue and WHAT THE HELL IS THAT?!?!?
The \"other\" cheese is the worst cheese either of us had ever tasted. The wonderfully cheery waitress chimed in \" oh, we agree! When they bring it in, we hold our noses and avoid it\". It is referred to as a \"cave aged sheep's milk\". Well, the maker needs to get a flashlight and go check their cave cuz I think there's a dead emu decomposing in it.
Duck fat fries: Lovely! 
No ketchup for the fries: Idiots. You know, you could make your own artisanal ketchup, guys. Alice Waters has a recipe in her \"Tailgating\" cookbook. I wonder how many times a day they get asked for this obvious condiment.

Dessert: Fried ricotta donuts in chocolate sauce. 5 Stars.

So, all in all, this is a hipster enterprise extraorinaire. They are full of themselves, as great artists often are. Just be prepared to pay for someone else's flights of fancy in a pretty environment.
Please don't review this business if you received a freebie for writing this review, or if you're connected in any way to the owner or employees. Like SO MANY who are reviewing this place here."}
{"text":"Got there early(shortly after 5) before the rush. Our server, Ben, was awesome! He patiently answered all of our questions around wine & food and provided great guidance without being pushy, i.e. he let us make the decision. Charcuterie Plate- very very good; duck fat fries - AWESOME(perfectly crunchy and not over the top), Ben's suggestion of chorizo stuffed dates to go with our wine was outstanding as were the dates; the ravioli was great as well as the foie gras mousse; and then we shared a couple larger plates, the rabbit and the porchetta. I thought the rabbit was OK although others at the table loved it, the porchetta was consensus THE BOMB.. lovely crunchiness to the skin and delicious combo with creamy potatoes and carrots, etc. For dessert the cheesecake was AWESOME and the sfingi OK.(I had higher expectations of it but didn't WOW me like the other dishes). Will be at the top of our list for next visit to Madison. I love the communal table approach.. great way to make new friends."}
{"text":"Amazing food and great service! I left wishing my stomach could fit more goodness in it. The porchetta was divine!"}
{"text":"I had a lot of fun dining here. Never had rabbit before, this is definitely the place to try it for the first time. Excellent menu."}
{"text":"Try this place if you are open to company. They offer some shared seating. The menu has been a little different every time I have been there. Try the stuffed dates."}
{"text":"The food is top-notch; unfortunately, their menu almost never changes, to the point where I'll periodically check their menu hoping to see something new but decide I can't go back each time.
The ambience inside is pretty contemporary with a number of large, shared tables.
Huge, impressive wine list."}
{"text":"Picture this: a Saturday night, pantyhose pulled up and ready to contain, your fake (but extremely convincing) black Chanel bag is draped over your shoulder and you're working a positive attitude seeing as it is finally reaching almost 40 degrees outside. Can you say \"relatable\"? This was me walking into A Pig in a Fur Coat last night and while it may not describe you, this restaurant will invite you in whether rocking a coat of fake fur (I mean, it's Willy St.) or Packers print.

I ate at this small hub of porky goodness for the first time almost a year ago and naturally, the deliciousness of their menu items and coziness of the atmosphere remains constant. Poutine, Smoked Salmon, Venison Short Ribs, Bread Pudding and Chardonnay were the picks of last night and by golly, it was already time to relive them all again upon waking up this morning. The foie gras in the poutine and sweetly saucy (oh behave) bread pudding were definite highlights. Service is friendly, vibes are unpretentious and pigging out is highly encouraged."}
{"text":"Fabulous. Decor, service, presentation, menu, flavors, drinks-everything gets 4 stars. This restaurant is a prime example of a place that really knows what it is doing from the ground up. Call me impressed."}
{"text":"The liver poutine and duck fries as people have said truly amazing. I had the scallops with the vanilla cream topping and apple butter layer underneath. I have a bit of a sweet tooth and found it incredibly sweet and savory. An very well crafted dish.

The only reason I'm not providing the full 5 star is the atmosphere. I thought the food was great but the servers are all college students and gave off a really chill vibe. I'm not sure if it's only me but I would just would like a little more attention and expertise when explaining the wine list when paying a plate premium."}
{"text":"It's an amazing restaurant in Madison. Chef's choice would be a really wise decision for the first visit."}
{"text":"Well, it's definitely good. I will admit that I was expecting to be blown away... and it fell short of that. The vibe is quiet and calm and the staff were attentive but lacked enthusiasm on our visit. Maybe this just wasn't their best night...

They have a limited selection of vodka, which surprised me. My husband tried the drink made with bacon bourbon and enjoyed it. For food, we started with the bone marrow meatballs and stuffed dates. The meatballs are DELICIOUS and ended up being my favorite dish of the meal. They are super flavorful and yummy. The dates were (supposedly) stuffed with chorizo, although I was unable to taste it. The texture was mushy and they were very sweet.. I can't recommend them. Next we tried the ravioli and lamb carpaccio. Both very good. The ravioli was divine and swimming in fat, as others have mentioned, so a few bites is enough. The lamb is more fresh tasting and was a great compliment to the rich ravioli. We ended with the scallops, which I was most excited for. The flavors of the dish were nice but the scallops themselves were chewy. Overall, definitely good food that is prepared creatively and with care. The food is incredibly rich, so to me this is a very special occasion spot."}
{"text":"Always the best! After three hours in the car I feel like I am back in Chicago for a second with the amazing food and great atmosphere. It is well worth a great night out. I eat here because its quality over quantity, if I wanted to have a meal for $10 I'd go to McDonald's. 

My fav is the chorizo dates! I can't get enough. A good bottle of wine, friendly and well trained staff, and cozy atmosphere makes PinFC the best place to hang out in Madison!"}
{"text":"The food is wonderful.  If you are looking for the same old mundane food, go some place else.  Loved the poutine.  The ravioli had a whole egg inside with the yolk still liquid.  The bar made a good Vesper - Bond - Shaken not Stirred."}
{"text":"Really good and inventive food. Great atmosphere and great service."}
{"text":"One of my favorite restaurants in Madison, hands down. That being said I wonder if maybe  A Pig In A Fur Coat is a bit over rated? Either way, Chef Bonnano should be congratulated for his recognition at the national level and his innovative dishes.

Located on Willy St, A Pig In A Fur Coat offers snack, small plate, and entree sized dishes in a cozy, family style atmosphere (meaning you may sit at a table with strangers, obviously divided into your party and the other). My understanding is that the goal of this restaurant when it first opened was to offer up scale dishes in a laid back atmosphere. I think it's fair to agree that the goal is easily achieved.

Flavors are decadent and rich. Some of my favorites include the meatballs with bone marrow butter, lamb carpaccio, and wagyu ribeye.  The meats are always cooked appropriately and of high quality. There is also always some type of addition to the dish that adds a wow factor. An example is the bone marrow butter on the meatballs where there is a rich umami quality that is hard to find.

Service and drinks are great as well. Overall a great dining experience and in Madison second to none for what A Pig In A Fur Coat is trying to achieve."}
{"text":"So nice to have a restaurant as good as this place in Madison...

We tried this place a few years ago and we were not impressed - octopus that was deep-fried and tough as a rubber tire, and most of the dishes were just not very good.  That was a long time ago, so we decided to give it a try once again since we began to hear people praising about this place.  

We ordered pork rillette, octopus, beet salad, pork tripe, and a few other dishes.  the rillette was well seasoned, very tasty, and the octopus was super tender.  Actually, we all loved a piece of roasted pork skin that came with the octopus dish - that was so delicious...We also highly recommend the pork tripe - it was well prepared and perfectly seasoned, and such a comfort dish at the same time.  We would have skipped the dessert, though (we shared coconut panacotta, which was sort of underwhelming...).  

Though the table setting was not the most comfortable one (we were seated at one of the communal tables), almost all dishes were very, very good.  We will definitely try this place again soon."}
{"text":"We lived the cozy, busy little room. Despite the close tables we were comfy. And the people next to us were just friendly enough. My favorite dish was the salmon tartar. Just enough dill,  not oversauced, nutty and unexpected faro. Also excellent was the rabbit rillettes. So rich but also herbaceous and rustic. The Turkey leg was amazing. Could have used just a few more lovely little brussel sprouts. But the meat and the sauce were incredible. The bread pudding with the cherries showed the same attention to detail as every other dish. Just outstanding food and really friendly, attentive service."}
{"text":"Oooook, so, if you are stalking my reviews (which you shouldn't, btw, that's weird), you will notice that, apparently, in my single day in Madison we ate at both PIAFC and Forequarter. Yes, we had two dinners. Well, two 2/3 dinners, so really only 4/3 dinners, which isn't that bad. We just couldn't decide!

Anyway, here we had a beer (Sofie) and two dishes. The place has no cocktails (boooo), and the bar staff honestly just didn't seem that knowledgable about their drinks. I asked for a Black IPA recommendation, got Sofie instead. It's ok, I like Sofie. But still. 

Food, however, was great. Duck fat fries more or less always win, but these did, so that's good. Rich as shit though, so be careful. Decidedly NOT a health food. 

Lamb carpaccio was the best thing we ate in Madison. Very rich, worked well the the egg, cheese, and greens. 

All in all, I think the food is up to par, they need to work on their drink service a bit. Not quite as funky/cool as forequarter - fewer bears, beards, tattoos, etc. I'd say go to Forequarter first (more interesting, less heavy, more veggies), but do PIAFC on day two."}
{"text":"Great place with a great creative menu. Make sure to factor in time for seating though as they stopped taking reservations."}
{"text":"Pretty awesome meal here. Granted it was an extremely unhealthy dinner but so delicious.
On Friday night we had to wait 45 minutes since we didn't make a reservation. It was interesting to eat tapas with the communal seating arrangement.  Now, on to the food:

Cocktails: the wise guys fizz was AMAZING! 10/10 would drink again.

Duck fat fries: largest portion size of the night. Duck fat was deliciously buttery
Charcuterie board: loved it so much. Great variation of flavors and textures too
Ravioli: swimming in butter so that was the primary flavor 
Chicken liver mousse: doughnut holes and savory mousse with fig jam; interesting combination, so you have to eat all the components together
Pork belly: decent and fatty, but not sure I would get it again

Ultimately, we were too full for dessert."}
{"text":"Came in on a Thursday night just before 7 and got a nice seat by the window right away. The menu looked great and the food we got was tasty. Nothing really blew my mind but it was all very good and at a reasonable price. We ordered the meatballs, poutine, beets, ravioli and ended with the cheesecake. The cheesecake was probably the best part of the meal but the ravioli was a close second. Meatballs aren't really my thing but I never knew meatballs could taste so complex. So if you like that kind of thing, I'd highly recommend them. The food was quite rich, we'll definitely be back again but this might be more of a fall/winter sort of place for us. Our server Josh was very nice and attentive. No complaints!"}
{"text":"A Pig In A Fur Coat by far exceeded my expectations!  I checked out the menu prior to going and will admit I was a little intimidated by what I saw (I had never tried, let alone heard of many of the dishes).  However, it was beyond amazing!  We had the rabbit rillette, the pork belly, Wagyu beef, and the cheesecake for dessert.  Everything was perfect.  The service was excellent by all; we received excellent recommendations on both our food and drink choices, the food was timed well, and the environment was great.  They have a few outdoor tables right now and many tables for two inside.  The communal tables are for the larger groups but it did not appear to be too cozy at those tables at all.  The food is truly an art form here.  It was refreshing to experience unique and rich flavors with every bite.  I am not usually a beef person, but my husband wanted to try the Wagyu beef- wow!  It literally melted in your mouth.  We will definitely be back again."}
{"text":"I moved to Madison from the Napa Valley where restaurants from the country's best chefs abound and my expectations for eating out are high.  I had A Pig In a Fur Coat recommended to me by several work associates and I had high hopes for this restaurant.  I am happy to say that I loved every aspect of this restaurant and cannot wait to go back and take all of our visiting friends here.  

When we first got there we had a very short wait for a party of three though I was a little uneasy about the seating of us in the middle of a large table that had a party of 4 and 3 on each end.  There had been no indication that you had to share a table with other parties, though the seats were spread out enough that we didn't feel cramped or that we were imposing upon other peoples conversations and vice versa.  

We started with a few glasses of wine, the cheese and charcuterie platter and the dates.  The platter was very well constructed with two types of cheeses, three cured meats, liver pate, a fig butter and some crustini.  My only critique would be that I think that cheese and charcuterie plates should be constructed for the party they are serving.  If three people are sharing it, then put out portions of food divisible by that number.  No one wants to have to split portions, just don't make us do it!

The dates were phenomenal, perfectly balanced in sweetness, acid, and spice.  Again though, we were served five for a party of 3.  It would make the experience that much more amazing if you could see that special attention was given to who was being served.

We also ordered the duck fat fries which were tasty but nothing special.  I guess I've had duck fat fries enough places to not feel blown away by them, but there was certainly nothing wrong with them and they are a nice, hearty appetizer.  

Our next dish was the duck egg and ricotta ravioli in a brown butter sauce with ramps and bacon.  This dish was heavenly.  I adore brown butter in nearly everything and if you put an egg on something, I will probably inhale.  The pasta could have been a little more noteworthy, but I was very happy with savoring each and every bite.

We finished with the Italian Sfingi which are essentially fried doughnut balls covered in chocolate sauce.  This specified on the menu that there were 5 in an order so we specifically asked for them to include an even 6 which they were happy to oblige.  They were delicate, sweet, and utterly divine.  The perfect ending to a great dinner.

Can't wait to come back and try more of the menu!"}
{"text":"I live in NYC so it's fun to see what other cities have to offer in the restaurant department. Full disclosure I grew up in MSN during the 70's and the most exotic place was  L'Etoile. We recently visited and wanted to take my elderly (but well traveled) parents out for dinner. I also was not interested in \"pizza\" or brats or fish fry (well perhaps the latter in the summer). My attention was drawn to the menu which my wife and I both agreed was intriguing, more akin to what you might find in Cobble Hill BKLYN these days. We were a little daunted by the fact that they do not accept reservations BUT if you call ahead around 4 and explain you have a party of six w 2 elderly folks they would try and accommodate a large table for you. No guarantees but It worked out for us beautifully. The room is pretty standard hipster meaning nice solid tables and groovy lighting. Our server, Ben was very knowledgable about the menu and what might pair with what. For example he suggested the rhubarb cheesecake with the Moscato on the menu. All I can say is just do it :)
The dishes are 2 sizes and if you have a diversity of tastes in your party the tapas model is perfect. You can read about the fine points of the poutine or duck fries above but I would just go with the flow. Do try the beets though."}
{"text":"Clearly, my favorite restaurant is town. The food is delicious. The ambiance and the service are excellent. Sometimes, the wait could be a little long, but it is completely worth it."}
{"text":"Went here on Monday night, and had a great experience. Good wine selection, most of the reds we from Italy, and the most expensive glass was $8.50, so not bad. The octopus was fantastic, juicy, tender, and slightly crisp. I love that the foods come out as they are ready. The dry aged steak with bone marrow, sweetbreads, and lentils was also pretty special. I'll be back."}
{"text":"Literally everything we tried on the menu was fantastic. The bartenders are very knowledgeable and the food is incredible. Locally sourced and high quality. Just make sure you don't diss the foie gras...apparently they no longer \"force feed\" the ducks (the bartender was a bit sensitive to this issue when we mentioned it!)"}
{"text":"My first experience with this restaurant was during the Willy St. street fest, where they had a booth selling pork belly sandwiches. I usually am not a big fan of booth/truck food unless it's like cheap eats, but I was so hooked by this sandwich! I eventually went back for dinner. It's a tiny place, and we sat at the long high table that we share with others. I usually like sitting in a booth and having my private space, but this was not bad at all. Everything we ordered was just amazing!! My favorites are the duck fat fries and the pork belly! This place is pretty pricey (hence minus one star) but these two items are just amazing. I have also tried the meatballs and the porchetta (which is quite a bit of meat). They were all so great. 

I just have minus 1 star for how tiny the place is and a bit pricey. If you dont care about these things, this place is 5 stars for you."}
{"text":"We came to Madison 2 years ago and this restaurant blew us away. It was so good. 2 years later we returned and were sadly disappointed. The poutine had 2 pieces of cheese, which tasted like dough. I'm all about doing poutine in different ways, but it was lacking overall.

We tried the Ravioli next. This was my favorite for sure. 

Lastly, we had the pork belly. I also liked this, but didn't love it. 

It felt like they were trying to make fancy dishes with good plating, neglecting the actual taste. Paying attention to flavor is the most important part. My cocktail redeemed the meal.

I had horrible heartburn and indigestion after this 
meal, which is not common for me."}
{"text":"Great tapas at a very reasonable price for tapas.   Staff is super friendly and the atmosphere is great.  Pork belly is a must of course.  A word of advice, the cheesecake is so good you are not going to want to share!!!"}
{"text":"We just moved to Madison and having spent years being spoiled by nyc cuisine I have yet to have a haunting experience until I had dinner here.  foie gras mousse aka foie gras beignet?! I have not been able to stop thinking about how delicious everything was!  We had the Wagyu beef which was cooked perfectly.  If you love rillette like I do you will enjoy the rabbit rilette which comes with this amazing cherry honey concoction.  We also had the duck fat fries, the octopus salad (melts in your mouth), beets, and the scallops (super sweet scallops).  The service is excellent.  Just as I was wanting more toast for the rillette, someone came and dropped some off.  

Overall, everything was on point.  Our server was attentive and informative.  If you want food that is apparent in care and pride, this is the place for you!"}
{"text":"Perhaps it was just an off night as they had a large party going on, but after reading all the great reviews, I was expecting more. Food was good, but nothing to be wowed about.

We were seated at the community table which was perfectly fine. Had a nice little chat with our neighbors. We started off with some drinks and then ordered everything right away. We had the rabbit rillette, duck fat fries, dates with chorizo, ravioli with duck egg, pork belly, octopus, and the foie gras mousse based off of other yelp reviews. The rabbit rillette was really good. Funny though when the server brought it out, she didn't tell us what it was and we thought it was just complimentary bread and spread. It wasn't until half way through our meal that I suspected it was the rabbit rillette dish. Duck fat fries were delicious. Tasted so light yet so crispy and soft at the same time. I can eat it all day. Dates with chorizo was okay. Not my taste, but it wasn't bad. Ravioli with duck egg was good, but it didn't really have any kind of texture so it was kind bland in your mouth. Sorta like baby food. Pork belly was good, but I wish it was crispier. That would have made it even better. Now, the octopus was surprisingly good, tasted like a well done piece of fish. I wouldn't have known it was octopus at all had I not ordered it. The foie was just okay for me. It's a combination of sweet and salty with a sort of bitterness aftertaste. I probably won't it order again. Overall, it was a nice meal... Something different and will probably visit again to try other dishes.

I noticed that some people were ordering as they go (instead of everything at once like us) which could be good too cause we got quite stuffed by the end if the night. Definitely come as a small group!"}
{"text":"This is one of the best new-American places to visit in Madison! 

We had a reservation for a party of 4 at 5:15pm on a Saturday night. Yes, it's that popular. You probably won't be able to walk in to get a spot. 

We went in on time and was prompted seated. However our host was unreasonable and seated us on a long tall table that is shared with 10 other people. When we asked to be seated on a four person table that was free, she was reluctant. It was completely a reasonable request but she was hesitant, which showed a lack of experience and respect for customers. This is the reason my review is four stars and not five. 

The food deserved five stars. Amongst the four of us, we had two small plates, two large plates, and two appetizers. The plates that we enjoyed the most is the octopus, the shallots, and the duck fat fries. The food reminded us of purple pig in Chicago. 

Overall, the food quality is excellent, on par with acclaimed restaurants like the purple pig. But the lack of experienced host was a disappointment. I hope next time we come we will be treated with more hospitality and enthusiasm."}
{"text":"Went here on a recent business related trip with a colleague. The location is nice and the restaurant decor is pleasant. Being a tapas restaurant I guess the table layout is interesting with a long tall table in the middle which probably seats 16-20 people and then smaller tables for two along a side wall, along with another bar table & larger group table ... very \"cozy\". We ordered the Poutine to share as a starter which I would give a 3.5. It was tasty and while I appreciate the spin by including the deep fried cheese balls I didn't think it improved the dish or added any flavor, a bit bland on the cheese. Still though it is a dish worth checking out. We also had the Octopus (based on the many reviews/photos) and I agree that this was very well prepared, a bit crispy but soft not at all chewy, no strong seafood taste just subtle. A 4 star dish. Next the Pork Belly small plate. This one was a bit of a disappointment. I have seen photos here with shrimp on top so perhaps they change it up now and again, ours came with tiny cherry tomatoes, sunflower shoots and eggplant. Not much really to report that tickled the tastebuds, 2 or 2.5 stars at most. Should have probably gone with the Foie Gras or Ravioli. The one \"large\" dish we ordered was the Porchetta. This was very good, another 4 star. The meat was delicate, succulent and fell apart so nicely. It reminded me of a Japanese meat dish in its texture. Certainly a good choice. Lastly we had the Panna Cotta dessert which was pleasant to end the meal with, not too heavy and just a little sweetness. Overall I would certainly plan a return trip."}
{"text":"My wife and I ate at A Pig in a Fur Coat for the first time tonight and were 100% pleased. The waiter was very helpful and attentive, the appetizers were delicious, the tapas were excellent, and the dessert was perfect with a cup of surprisingly good coffee. Our favorites of the night were the Rabbit Rillette (which I recommend eating with the cherry juice or cherries) and the Foie Gras Mousse. Service was very attentive and efficient, as they have a smart setup where the waiter can focus on customers and someone from the kitchen delivers the food.

We will definitely return!"}
{"text":"Limited seating but great atmosphere. Food was creative, unique and top notch. Dishes are made to be shared which allows you to sample many of their creations. One of my favorites in Madison for sure. Must try the duck fat fries, octopus, and rabbit."}
{"text":"I'm giving them 4 stars for creativity and taste, as the food was delicious and interesting. Flavors were on point and while it is a pork restaurant nothing is lost in the pork flavor but rather elevated by pork's ability to transform a dish. 

Octopus is one of my favorite dishes to order and this is truly the best I've had. So tender. Additionally, the scallops were cooked to perfection. 

The 5th star is lacking simply because of the alcohol program. I was very unimpressed with the wine selection as the menu lacked heavy bodied wines. All the cabs were blends and while I appreciate the Mediterranean approach to the wine program, there could be a better range. Service was okay."}
{"text":"Too expensive.

I used to live in Madison and now I live in New York and this is expensive even by the New York standards. Everything is split into Snacks, Small Plates and Large Plates. Sharing is encouraged. My understanding is that Snacks and Small Plates are somewhat similar size and we were told that Large Plates are the size of an entrée. Well of a really small entrée. All entrees were $22+ and there is no way the amount of food could satisfy a grown person. I am a small woman and I could eat 3 of such entrees easily. For examples, the scallop large plate had 3 scallops on it.

If you try to hit one of best value-priced items order the rabbit rillettes. Be prepared that it's very greasy (as all rillettes go) and order extra bread. That was a pretty filling Small Plate/Snack for $12.

I thought that wine and beer was priced reasonably, $4-5 for beer and $7-8 for a glass of wine on average. For dessert everyone seems to be ordering the bread pudding for $8.

Some tables are communal if you don't mind that. It was warm outside even at tables next to the windows. Big plus for that for a Madison restaurant.

Be prepared for the food to be very greasy. If not animal fat then it will be dripping with some oil. It's tasty but greasy so if you try to eat healthy you will have a hard time but that's not why we go out to eat, right!

At  8 pm on Friday night the place was still packed so the business so far is brisk. Pigs are a casual bunch even in coats so don't worry about dressing up. There wasn't one dressed up person when we were there. So enjoy, it's quite a gem on Willy street and I dare you to order tripe."}
{"text":"This easily tops out as one of my favorite stops in the Willy Street district.  We attended dinner service on a Monday in a group of five.  We were all shocked to walk in and realize we were the only diners (it picked up, we must have just been early!) but this worked in our favor as the service was incredibly intimate and quick.  We ordered our drinks off a delightfully diverse cocktail menu and began examining our dinner menus.  After a while, we decided to order a cheese board, every small plate they had, and two entrees and split them between us all to properly assess the menu.

My tip: don't go rushing through this place, take a couple hours and enjoy your evening of delicacies. Every dish that we received was cooked to perfection and displayed with such finesse that, at points, you struggled to eat it for it so resembled art.  I ate things I never believed I would enjoy, and what's more is that I would do it all over again.  If I honestly had to narrow down my suggestions, definitely order the Tagliatelle (which I foolishly almost did not order, but the waitress suggested it and I am so glad she did.), the Veal Cheeks (WOW!), and the Foie Gras Mousse.  But if I were to be honest, I'd say try everything. ;)  

I will most certainly go back for another beautiful dining experience."}
{"text":"We had such a great date night here! They have a great beer selection for the boy and a wonderful wine selection for me. The wagyu beef is worth it and the reason to go. Seriously, go and get it and call it a day. It also is such a fun atmosphere - you will love it for a date night!"}
{"text":"Oh my, Pig in a Fur Coat may just be my new fave restaurant in Madison. I've heard so many good things about it, but just haven't had a chance to eat there yet. Until last week, when a girlfriend and I went for dinner. It was freezing, and 7:30 on a Friday night. We walked into the restaurant (which is so much smaller than it looks, btw) and were told it would be about 20 minutes. So we ordered some wine at the bar thanks to some suggestions from the friendly \"bartender\" and waited. I don't know how they do it, but the space seems much less cramped than it should. It's a tiny room but it doesn't feel like it. Which is pretty awesome.

When we were seated (almost perfectly 20 min later), our waitress brought us some water and asked if we had any questions about the menu. We decided to order 3 plates to share between the 2 of us. First, the Duck Fat Fries of course. These were amazing - how do they get so crispy?! Even at the end of our dinner they were still crispy. So yummy. We then tried the ravioli which was also very good. The runny yolk in the center made me very happy, And the combination of the sauce and the crispy brussel sprouts was delish. Plus as a bonus you get a slice of bacon! Our last plate was the Foie Gras Mousse. I had just watched Corey talk about it on the news as one of the best plates in Madison and had to try it. I was not disappointed. The combo of the bombolini, creamy foie gras mousse and fig was out of this world. It is a very rich dish, so thank god it's a small plate because I don't think I could eat much more of it without getting a stomach ache. But it is worth it! 

By the end of the meal I was super full and very sad that I didn't leave room for dessert. All of the desserts looked delicious, and I will just have to return soon to try them."}
{"text":"Can someone tell me what the big deal about this place is? 

We waited 45 minutes for a table on a Thursday night. We never would have waited that long except that the hostess (who was very nice and overworked) assured my table of four it would only be about 15 minutes. After seating, service was slow. 

Our apps were good. The duck fat fries were good but many places in Madison boast great fries. The dates were to die for. 

As for the meal... eek. Our plates came out one at a time with about ten minutes in between each, making the meal very very awkward. My friend ordered the ravioli, which the waiter said was a favorite but the plate was the most unappetizing thing I've ever seen. Literally one big brown ravioli with egg inside. My friend said the sauce was very very sweet. 

Mine was served next. I can't find it on their current online menu but I am certain I ordered a pasta and bolognese dish that sounded pretty safe. It tasted exactly like Hamburger Helper, I am not even kidding you. Hamburger. Effing. Helper. A great kickback to my childhood but definitely not something I expected nor wanted to pay for from this trendy restaurant. 

Friend's husband ordered the Chicken Thigh which was the best, juiciest chicken I've ever had. The sides it was served with weren't bad either. I would go back to give that another try. 

My husband ordered the tripe and none of us had a bite of it. 

For dessert we did an apple thing that wasn't great and a panna cotta, which was okay. 

All in all, I'm glad we tried it because of all the hype. but we all walked out wondering what all the hype was about. I kept looking longingly out the window at Umami, which is across the street. I wouldn't spend the money or the time on this place again."}
{"text":"I had the most lovely waiter here. I ordered a Malbec and said I always default to Malbec when I don't know what else to order. He said if I liked Malbec, I should try another specific wine they had, so I did - and he was right! This sort of interaction continued thoughout the menu. I've rarely had an experience like that where a waiter not only went out of his way to be so helpful and then was actually helpful. Or rather - you see that at places like l'Etoile but Pig in a Fur coat is in a different market where you might nor expect that. It was great.

Also the food is very tasty. Fries with truffle oil? I need those. Because reasons."}
{"text":"Favorite restaurant in Madison. Great food and friendly staff.  My wife and I come here as our go-to for dates or when we have friends/family visiting from out of town."}
{"text":"2nd visit better than ever. Don't miss it. Don't eat anything that day before dinner. Take lots of people so you can try one of everything."}
{"text":"5 stars because the food was plated for show, and the flavor backed it up. I can speak for the following. 

Duck fat fries - some of the best fries I've ever had, period.
Octopus - a flavor experience well worth it
Lamb Carpaccio - so thinly sliced it melts in your mouth. Mix some yolk and corn shoot with it, spread on crostini and it works VERY well.

Just be aware, there are community tables."}
{"text":"Looking for culinary treat???  If your answer is yes, check out A Pig In a Fur Coat. I took my studio crew for a fine Christmas dinner and this place did NOT disappoint!!!  Everyone tried something different and it was all amazing!  I had the pork and it was done to perfection!  We shared a charcuterie board to start that was legit. Also had some octopus that was amazing and the first time I had decent octopus so far away from the source. My wife tried the tripe- not my cup of tea. It was tasty, I'm just not much on the texture of this odd delicacy. 

Bottom line- go check it out for yourself. A little pricey but totally worth it!"}
{"text":"The food is rich, and the presentation artful. The flavors magically get out of each other's way so you can distinguish each ingredient as well as the emergent, combined aromas. 

This kind of super power with food was good news for the Beets dish, where the subtle flavors of tender beets and pickled carrots really came through, and the Rabbit Rillette on toasted crostini was punctuated with tart cherries. But a dish like the Torchon, a melt-in-my-mouth foie gras atop a chewy donut, settled in a shmear of fig, and wrapped in a salty ribbon of guanciale was really overpowering. All my senses were inundated with lights, smells, and tastes, and I couldn't handle it. I imagine it's a bit like how babies feel right out of the womb. 

The Hamachi collar was crispy and tender - though I had to spit out a few scales and small bones. The bread pudding came soaked in salted brown butter with a caramelized, crunchy topping. As with the most of other dishes, it was the richest thing I've eaten all year. 

If you are not with a large party and therefore can't try everything on the menu, I recommend ordering based on the ingredients you feel like eating that day. Don't be afraid to ask your servers if you don't know what something is; they are warm and knowledgeable."}
{"text":"I have been waiting to dine here since before I actually moved here, so this review has been a long time coming. 

I started my meal off with an Ale Asylum Hopalicious, and shared a bottle of NV Zardetto Prosecco Sparkling Wine between our party of four.  Loved that this place is a tapas style restaurant. We worked our way up to the large plates, by starting off with the snack plates, we first ordered The Marinated Olives, Duck Fat Fries which comes with a Garlic Aioli, so fantastic, and as well as the Dates which was one of my favorite plates, almost a meaty, sweet, yet spicy plate. 

Our next order was the small plates, ordered the Ravioli, Pork Belly, and Beets...can't explain how much I enjoyed all three, the beets paired so well with the goat cheese. 

On to the Large plates we ended up ordering the Rabbit, wasn't necessarily my thing, but the rest of my party goers raved about it. We then ordered the Sicilian Sfing off the desert menu...so great and not too sweet, perfect note to end the meal. 


Lastly...the atmosphere here was great, loved the cozy feel it gives, and the staff..so amazing, and very attentive. Can't say one bad thing about A Pig In a Fur Coat."}
{"text":"Had a fun and enjoyable meal here on Saturday night. Came in about 5:30 before the dinner rush and were seated after about a 15 minute wait. We waited in the small bar off to the side that got crowded pretty fast! 

We ordered the charcuterie and cheese board, duck fat fries, the meatballs, ravioli, pork belly, and the rabbit. I did not eat the fries. My partner said they were delicious but it was too much for one person to eat. The pork belly was a little tough. Everything else was great. The waitress recommended 3-6 plates to share between 2 people. I think we could have done without 1 or 2 of our selections and still have had enough food.

We ordered the Sicilian Sfingi for dessert but were too full to eat all 5 of them and took the rest to go. They were outstanding. Their coffee was also delicious. 

The service was slow at times and the food was slow to come out. We stayed for over 2 hours and had a great waitress. Our poor waitress sliced her hand open on a wine stem but still was friendly and attentive. It was a nice relaxing meal, and I enjoyed the atmosphere and leisurely pace of the meal."}
{"text":"While the menu was interesting, it is not something I would have typically gravitated towards. To my surprise the group I was with very much enjoyed it! I highly suggest going there with a few friends and ordering a combination of snack and small plate items (don't forget the duck fat fries!). Also had the quail stuffed with chorizo which was amazing. Simply said - great food with a lot of flavor; I will be back on my next trip to Madison!"}
{"text":"If you're vegetarian, Pig in a Fur Coat is probably not top of your list. Despite this, they reconfigured a pasta dish without meat and used mushroom broth to make it vegetarian. Thank you for sweetly accommodating my dietary preferences! Hope to see more veggie dishes on your menu in the future. :) 
PS the desserts alone are worth a stop!"}
{"text":"This place is pricy!!! But the food was ab__solutely wonderful! 
Not sure if it was worth my money but I would go back again!!! Every single dish was fantastic. Recommend try them all!"}
{"text":"My wife and I were visiting in Madison and decided to make a stop here. Food was excellent, I was very surprised. Fresh ingredients and creative menu.

I thought the service could be a bit better."}
{"text":"Had dinner here on Friday night. Crowd was steady but not overwhelming and my fiancé and I met a delightful couple whom I can only hope we are as cool as in 15 years.

Onto the food!

We had a charcuterie, octopus, and foie gras.

The charcuterie was ample! From a selection standpoint, the choices were as expected but the house-made fig jam was a standout.

The octopus was phenomenal and served on a bed of sweet potato purée, fried beef testa and a delicious mole sauce. One note on the mole; this isn't the all too common chocolatey sauce but a more refined approach.

The foie gras was an absolute treat! It was served on an Italian bombolini and was delicious. My fiancé was gracious enough to share one of hers over and beyond her own portion, which only served to make me love her more! 

Our server was Elliot. He knows his stuff. Go see him!"}
{"text":"They recently renovated pig in a fur coat, added a bar section, which is fantastic since there is almost always a wait!

The atmosphere didn't change much though, it's still casual, relaxing yet modern. There are a number of communal tables in case that's an issue.

They are also a small plate/big plate place where the idea is to share. Good portions when it comes to both the appetizers, small and big plates.

We tried the olives, which is a decent size. The ravioli is amazing, the duck yolk really adds texture and flavor to it. Also tried the foie gras mousse, it was creamy, not quite the same thing with actual foie gras, but it hits the spot. The main rabbit veal sausage big plate was an interesting combination especially the plating and the pairing vegetables. The orange sfingi was delicious, but slightly too filling after a big meal, so be aware of that!

If it wasn't the fact that there is always a line, I would come back much more frequently! But again that always comes with a charming lil place!"}
{"text":"Yes I gave them a five star for strictly their duck foie gras. Amazing! Plus they were super cool and treated me well. The chef knows  his stuff. I had the foie gras mousse as a desert. Yes dessert and it was amazing. I wish the grilled foie gras on their Poutine was served by itself.  Sooooo good. I had the stripped bass it was ok, hate to say it cause such a good place, but little more fishy then I was expecting. The meatballs was great the octopus with mussels was decent, I'm from Louisiana and these were the smallest I've ever seen but they were decent flavor wise. The ravioli was awesome. Seriously contemplating coming back a third time before I leave!  Just like their pairings. Get the foie gras anything. Just saying"}
{"text":"Best meal I've had in a while! Madison is such a cute town. Unfortunately I won't be here long enough to check off everything on my mini bucket list, but this one was a no-brainer! 

I didn't make a reservation as I was dining alone, the restaurant is quaint and nondescript; you'd miss it if you weren't looking for it. As I was parking, I saw a couple of hipsters entering, but the vibe is unpretentious and the staff is friendly. 

I decided to sit at the full service bar and was greeted by Alicia. The other young lady who made cameo appearances behind the bar welcomed me with some small talk (much appreciated by the lone diner-me). 

I ordered a celebratory Pimms Cup for my first real drink in almost 3 years (my nursing journey is finally coming to an end!). Alicia informed me that I popped her PM cherry! The drink was quite tasty, considering she didn't have the customary cucumber or mint that I'm accustomed to! 

I planned on ordering the marrow meatballs but got sidelined by the poutine. The duck fat fries were deliciously crispy, topped with silky rich gravy, but my favorite part of the dish was the tender chunks of foie gras in contrast to the golden fried cheese curds. This is the perfect dish to share, I ate about 1/2 of it and grew tired of its richness. 

Next was the octopus; with my first bite, I immediately regretted the first calorie laden course. This small plate delivered big on flavor!! Layer one-the BEST mole sauce I've ever tasted, not too sweet, it had a slight acidity which was addictive; layer two-fingerling potatoes; layer three-fried \"testa\" (I know it as souse, head hog cheese, etc...); layer four-the most tender octopus I've ever had, topped with cilantro micro greens. 

I promised Alicia that I'd return to enjoy a Dream Catcher, a signature egg white cocktail that sounds dreamy, fluffy, sweet, and feminine. All things I adore!!! 

My only negatives were the temperature of the bar, I felt terrible for the bartender because it was so stuffy and muggy even though there's a door that could be propped open, bugs could be an issue. I also had an issue trying to get comfortable in the bar chairs, they're definitely built for small people. 

Well, I guess I'll steal a few of my dad's Lipitor pills, I definitely need them after this meal."}
{"text":"Creative menu, cool vibe and the food was outstanding!  We had the duck fat fries which were the best fry I've ever had, then the scallops and the rabbit.  A little afraid of the rabbit dish, but that was my favorite.  Unbelievable dish.  A must try!"}
{"text":"First I would not classify this restaurant as 'Mediterranean' as Google does.  That usually brings forth imagines of gyro platters and falafel with tzatziki sauce for all...this is not the case.  They have an inspired menu but nothing in that realm that I saw.  The waitstaff was extremely attentive and answered my questions even when he didn't know he would find the answer including the spices in the bitters in one of their drinks! I went with a friend while visiting Madison for a convention and decided on this restaurant based on the reviews and the tongue and cheek website, we knew this place was right down our alley.  We started with the Charcuterie & Cheese Platter and Duck fat fries.  First on the Charcuterie & Cheese Platter, the cheeses were interesting and well balanced with the pate, 3 different types of meat on the board in addition to the mustard and plum jelly.  The only critique would be that the pate wasn't exceptional but was still good. The Duck fat fries were crisp and well seasoned, served with a garlic aioli, good stuff.   We rounded out the snack portion with Rabiit Rillette, which was very good and had popcorn shoots on it to make it interesting.  At this point I should point out that we didn't finish any of these dishes but had them boxed when we were done with them.  We had a healthy leftover meal with all the items we had boxed so what we had could have fed four.  We started in one the small plates with the ravioli, the ravioli and egg were wonderful, the sauce(brown butter), not so much.  It was oily and reminded me of scrapings of a pan right before you put flour in to make gravy.  This was our least favorite item just because of the sauce.  Next was our favorite dish, the Foie Gras Mousse, AMAZING!  This one we did finish, fantastic in every way, texture, taste, presentation, get two, you'll fight over it.  The end was Beets, they were good, the goat cheese were a nice compliment. The large plate was the Wagyu Ribeye, rare.  This was also very good.  We were very pleased with the service, the food and the entire experience."}
{"text":"I've been to Pig in a Fur Coat twice in the past year, and it deserves all the praise it gets for having creative, tasty dishes that involve my favorite food: pork. I stopped in a year ago, and more recently, last night. The atmosphere is cozy, with a modern rustic decor that is well lit, but warm and intimate. 

Favorite first: The first visit was also my first time trying pork belly, and it was a sublime experience - melt-in-your-mouth, but perfectly crisped along the edges. Paired with sweet potatoes, this is easily the best pork belly I've had even since then.

As far as appetizers go, people seem to really dig the duck fat fries. I'm not really sure why - not to say they're bad, but I wasn't blown away. The aioli was light and creamy with a nice smack of garlic, but the fries themselves were something I felt I could get anywhere in Madison. After a few fries, I let my companion finish them off.

And why get the duck fries when you can get the dates (ok, you don't have to choose, you could get them both). I'm a big fan of the dates stuffed with chorizo - sweet and savory, with brightness from the peppers in the dish. 

In addition to the fantastic pork belly small plate, I've had the pappardelle, and the octopus. The pappardelle is perfect for the fall and winter, or any time you need a pasta comfort food dish. The bolognese was perfectly seasoned, and complemented the pasta by covering it, but not coagulating onto it (pet peeve). 

Don't let the octopus scare you off - I lived in Italy for a while and one of my favorite meals was octopus over potatoes. Since I've come back to the states, I've searched for a restaurant that can match that experience, with consistent disappointment. I'm happy to say Pig in a Fur Coat breaks that sad streak - the octopus was perfect, prepared over garbanzo beans (which I actually enjoyed more than the potatoes).  The peppers used are the same as those in the dates - mild but bright, and the slivered olives on the top provide a nice punch of salt. Well done, Pig in a Fur Coat, well done.

As far as large plates, I've tried the veal breast which people also seem to love. It was good, but not something so outstanding I'd order it over trying something new. The meat was cooked to be a little tougher than I was expecting, and after a few bites, I let my friend take over in favor of more pork belly.

Vino: they have a nice wine list, and the staff is more than happy to help you pick out a glass to go with whatever dishes you are choosing that evening. Last night, the waiter was kind enough to chat with us for about 5 minutes about the different wines, and the vineyards they came from. As a result, I tried a corvina which I might have passed over, but I'm glad I didn't. 

More on the staff: very helpful, but not overwhelming. Our waiter was very knowledgeable about the different dishes, and was happy to share it with us. He didn't direct us to the most expensive items on the plate either, which always ratchets up the credibility points with me."}
{"text":"What a great restaurant.  Eclectic, well thought-out menu, great wine selection, and a staff that really knows the menu and seem very invested in the business.  Yes, it's small and can be very busy.  We were a party of four on a Monday night at 6:30 and were seated immediately.  I am still dreaming about the rabbit rillette - yum!"}
{"text":"Wow, wow, wow, where do I even begin? From the beginning usually, right? Well, my party of 3 stopped in after work and we nearly had a pick of any seat in the house (it filled in much more the later we stayed). We ordered the large bottle of 3 Floyds Brewing Company's Alpha Klaus, a delicious dark beer. I later ordered a glass of wine to go with my dinner.

Speaking of dinner, most of the meals were family style, but not like an Italian restaurant where the portions were so big you felt sick for eating so much. But plates that were meant to be shared (more than a tapas restaurant though). There were a ton of great options we wanted to try, like: pork belly, veal, rabbit, lamb, and even octopus. With so many options, we all three decided to go with 4 courses of chef's choice.

Our waitress asked if we had allergies and what we liked. None and everything. I know, it was probably super helpful, haha. I can't remember the proper terms for all of the dishes, mostly because it wasn't directly on the menu, but the first plate was almost like a donut ball with porchetta and other deliciousness.

Next, it was Octopus on cooked plantains with (I think) pork belly. Third course was three different proteins: Mackerel, Veal Cheeks and something else veal (I know, I'm being super helpful). One had some bone marrow on top, all of it was delicious. Thinking back to the second and third courses, I really can't pick a favorite.

Each course the chef came out and explained the dish very thoroughly, on the last dish he told us that we were his Guinea pigs on a hot to cold dessert dish he was trying. Warm sliced pears, room temperature white chocolate what was baked and caramelized, and fresh coconut ice cream! It was really interesting what he was able to do with that white chocolate!

Overall, if given the option to order off the menu or let the chef take you on his own adventure, you let the chef cook whatever he wants for you! Probably one of the best dinner experiences of 2015! Stop reading my review and go enjoy it for yourself."}
{"text":"Recommended by a local organic farmer...  Closed on Sundays, but the posted menu intrigued us, so we made plans to visit the next day.  Wow, well worth the effort!  Best French Fries ever!  We had a small group of seven, ordered several plates and appetizers.  The scallops were fantastic, cooked perfectly.  Octopus was flavorful and not smothered in sauce, just seasoned to bring out the flavor. The best was the panna cotta, just a hint of citrus and so smooth.  Service was great and the server made several excellent recommendations.  A must visit if you're in the area.  As others have said, this is not a place you go solo.  Bring friends!"}
{"text":"WAGYU BEEF. 

I don't even like steak and this is one of the best things I have ever eaten. Get it medium rare and indulge. It comes on a bed of lentils and slowly-cooked onions, which add bright notes to cut through the richness of the beef. It also comes with a small pad of shaved butter on top. Again, it's a must-order item.

Duck-fat fries

Crispy, crispy, crispy. They have a deeper flavor than normal fries. Best fries I have had. (But they're still fries.)

Octopus salad

Yummmm. The octopus wasn't rubbery! Yay! It had a grilled flavor that was complemented beautifully by the crazy water (which is an Italian herb broth--I thought this version had some tomato juice). Mussels, clams, excellent. Second favorite dish.

Ravioli

I'm a huge fan of soft eggs. It was fun to cut the ravioli and watch the egg yolk douse the rest of the dish. There was a perfectly-cooked slice of bacon on top of the dish, which brought a nice saltiness. I would definitely get this again.

Cheesecake fo' dessert

Silky cheesecake, graham crumbles, and a peach-bourbon reduction? Can't go wrong.


Everything here was basically my favorite... Excited to go back because I have my eye on that charcuterie platter..."}
{"text":"It was our first time eating here and was a gastronomical experience.   We shared all of our dishes among 4 people. We had duck fat fries, pappardelle, lamb, porchetta, prime strip and rhubarb pie, which were all excellent.  They are all unusual dishes in how they are prepared and presented, but the flavor combinations were great.  Half of our group liked the pork belly, while the others found the amount of fat overwhelming.  
The atmosphere is casual with a small number of tables outside too.
We will be back!"}
{"text":"Wow. If madison has a real foodie restaurant this is the one. 

I don't think I took pictures of every dish we had because I was just enthralled at the taste. They didn't look incredibly amazing and appetizing and worth the money so I don't think I took pictures, but the taste was crazy. And then I forgot to take pictures. 

At one point we asked for the menu again and kept ordering dishes to share."}
{"text":"Having recently relocated to Madison, I've heard rave reviews of A Pig In a Fur Coat and finally had the chance to try it on 12/4.  We were warmly welcomed by the hostess and seated at a shared, communal table.  The low-key, tasteful interior is warm and inviting, and the wine/beer/cocktail menu was a great start to the evening.  

My partner and I shared one snack and four small plates.  We had the marinated olives (snack), ravioli with duck egg, veal neck, octopus, and pork belly with shrimp.  The meal was enjoyable and contained some interesting pairings (e.g. mole with octopus) and cuts of meat that I have not previously tried (e.g. veal neck).  Two of the dishes stood out and were fantastic - - the octopus was cooked perfectly (not an easy feat) and the mole added some interesting notes to the dish.  The shallot-chi and butternut squash puree  with the pork belly was nicely balanced and a fun combination of flavors.  The other three dishes had some major flaws.  The ravioli was swimming in fat (my guess bacon fat) which really weighed down the dish.  The veal neck appeared to have been cooked and reheated as the meat I scooped from the interior was cold (disappointing). The onion/radish salad on top was a bright point that added a needed acidic note.  I did not find the olives to have been marinated, rather they are dusted with orange rind and had a few slivers of fennel.  They really lacked any flavor.

Our server was delightful and very attentive.  She did a great job of answering questions and ensuring that we had what we needed.  All the staff brought a great energy to a restaurant that was buzzing with a Friday night rush and I commend them all for efforts.   

Overall, I appreciate the chef-driven, innovation that the Pig In a Fur Coat brings to the Madison food scene, and will go back once in a while to see what new inventions they are serving."}
{"text":"Service is a little slow but the food is delicious. The veal neck melted in my mouth.  I normally don't like much fat but it was amazing on the neck. So tender it just fell apart."}
{"text":"My woman and I are foodies.  We like to eat great food.  At its best Pig is some of the best we have ever eaten presented in a manner that is more feast than dinner.  Get some friends and order a variety of stuff to share, working your way through the courses deciding on the next as you go.  Drink some drinks, eat some great frites and meats and beets.  Savor.  Go home happy.

I would make this a 4.5 star though, we have had one trip where everything was not quite as well prepared as usual.  Nobody's perfect.

Do try: The poutine (duh), the beets, the kobe beef, the ravioli."}
{"text":"I had high hopes for this place due to the reviews and what I heard from friends! However, the whole experience was just not that great. 

Entering the restaurant was great. the space has a good vibe and I enjoy community tables. The staff is friendly enough and the menu has a small selection. We were recommended the duck fries, ravioli, or one of the large plates and we went with two of the three. aka the small plates. The duck fat fries came out first and they were nice and fresh, but you can't really mess up fries that badly. the duck fat flavor was good, but seemed to be more greasy than anything. It came with a garlic aioli, which could have been better. We also go the ravioli, which came out to be one giant ravioli piece that we cut in half. However, it does say that there is brown butter on top... it tasted more like straight oil. While I was eating it was hard to taste the flavors over the oil just coating your entire mouth. Lastly, we got the beets. I think they soak half of them in vinegar or something, because it was semi sour. The other half of the beets were perfect and paired nicely with the goat cheese. 

Lastly for dessert we got the Sfignty? you'll know what I mean once you see the dessert menu.  Its basically donut holes drenched in a dark chocolate ganache thing. While this was good. the chocolate was a little too much and the actual donut lacked flavor. I wanted to like this place, but for the price i expected more."}
{"text":"This is one of my favorite restaurants in Madison. It has a rustic modern feel. Excellent small plates with a large sized drink menu and a knowledgable servers. The duck fat fries are great for sharing."}
{"text":"It is absolutely worth the price. We tried the valentines' day menu. The entry is perfect! I love the cream blue cheese! The chicken liver is amazing. I will definitely come here again!"}
{"text":"Hands down my favorite restaurant in Madison.  Pig in a fur coat is great. Like, really great. Dan the chef is a real artist and has the most daring and novel cuisine in madison, I feel.  I highly recommend doing a tasting menu with wine pairings.  The sommelier is great at pairing things that you might not think would work, but end up being brilliant. This NYE meal was not the best meal I've had from them, but it was still lovely... decadent, rich, and inspired. Harvest and Fourquarter ain't got nothing on PIAFC."}
{"text":"This is one of the very best restaurants you will find ANYWHERE, not just Madison. If this place were in NYC, people would be lined up around the corner every night of the week.

It's not just pork, either. Come here for rabbit, turkey, beef, and - OH MY GOD - the scallops. 

I had the pleasure of attending a special event here recently and the chef prepared every single item on the menu for our large group to share. i've never had such an experience and I tried foods I would not have tried had I been with a small group. The communal tables facilitate interaction with neighbors, and the wine list is quite good (I'm a self-proclaimed wine snob).

I cannot wait to return. It's a place we like to take friends who appreciate good food and conversation."}
{"text":"I've been two times at Pig in a Fur Coat and I've must say it's one my favorites places in Madison. I would go more often if it wasn't so expensive but the food is worth it. This is a tapas style place so don't expect big portions. Every plate is very small, just enough so everyone at your table can have a taste of each plate. My favorites are the duck fat fries, pork belly, meat filled dates and cheesecake. But the rest of the menu is just as delicious. My only gripe is that the menu has very few items, I wished they'd add more plates to it. Would definitely recommend this place to anyone in the mood for sophisticated tasting food."}
{"text":"This place ever so slightly missed the mark for me. I'm probably spoiled by the Chicago food scene, but this was certainly better than we expecting in Madison. 

The service was great. Our server did a good job of explaining the menu and answering any questions that we had.

Their bacon was amazing- will stand out. I ordered the ribeye and it was really good, but not on par with what's going on with steak in Chicago.

Overall: I will certainly return when I'm in town. Really great food here, but does not match the Chicago food scene...yet."}
{"text":"Arrived 630pm on a Saturday night, we waited about 20 mins before seated at a corner seat not part of the communal table. The atmosphere is warm and not classy, very good for small gatherings between close friends and couples. 

Food is absolutely Incredible. We two people had \"duck fat fries\", \"ravioli\", \"mussels\", \"octopus\", and \"pork belly\", and ended up very full and satisfied. Everything was nearly perfect, to the extent that I do not pick the best and least good dish of the night. With one visit, a pig in a fur coat is already among one of my favorite restaurants in Madison."}
{"text":"Love it.

Dined here for my birthday dinner last week Saturday and I'm STILL thinking about how delicious our food tasted...and overall, how nice the experience was. Let's break it down, shall we?

Communal seating in the middle, small cozy tables on the side. Simple decor - nothing fancy. People were in jeans, people were in suit coats...everything seems welcome and comfortable here. Eclectic crowd is always a good indicator for me. We popped in at 7:30 on Saturday and there was about an hour wait for two. Totally reasonable for a small and popular spot. No problem, anyway, because there's a super yummy distillery a couple blocks away (Old Sugar) and the hostess recommended we check it out. We were happy to oblige - drank a cocktail and came right back to one of the two-spots waiting for us.

Nice selection of beer and wine - I enjoyed a Tuscan blend with our meal that I really enjoyed. Instead of jumping in on the large plates, we split 4 small plates that caught our attention:

Meatballs/ bone marrow/ bread crumbs
Duck Fat Fries/ parmigiano reggiano/ garlic aioli
Ravioli/ duck egg/ bacon/ ricotta/ Brussels sprout/ brown butter
Elk Short Ribs (not listed online, but on our menu that night)

Plates come out as they're ready, and our food and service was prompt. Every dish left us perfectly happy. The meatballs were tender and rich, the duck fat fries hot & crispy & addicting, the ravioli FREAKING INSANE WITH HOW GOOD IT WAS, and the short ribs beautiful and comforting. Everything was plated nicely, presented well, and seriously yummy. Isn't that the best you could ask for?

We left a bit of room for dessert so went for the bread pudding (yum) topped with salted caramel gelato. We loved it but the piece was so big we couldn't finish...no regrets. 

If I had it my way, I'd eat that duck egg and bacon ravioli every day for the rest of my life. I probably can't do that, however...I CAN return here, hopefully soon, to enjoy it again and try more of the delicious menu items. You should come here, too. I'm sure you'll like it. If you don't you probably also hate puppies, too...which is sad.

They're closed for a bit in April 2015 to expand, so keep an eye out and check before you go (if it's super soon, which it should be as soon as possible)."}
{"text":"Wow, I don't know where to start.  The meal was THAT good!  We wandered over to A Pig in a Fur Coat this past Monday evening after learning that Sardine, where we'd planned to dine that evening, was hosting a wine event and is normally closed on Monday.  Both my BF and I are just thrilled that we tried APINFC (I'm tired of spelling it out).  

We got a table outside and shared a bottle of Argentinian Malbec.  We started with the divine, decadent Duck Fat Fries with Garlic Aioli.  Perfection.  We then had the Chorizo Wrapped Dates followed by the Beet & Carrot Salad.  The dates were interesting.  I ended up liking them but I thought they had a strong green pepper taste at first.  Perhaps another plate of them and I'd be completely on board with them.  The beet salad?  Oh, I could eat that EVERY DAY.  BF and I were goading each other into licking the malt soil and goat cheese off of the empty plate.

We shared the Porchetta, which was quite mild, actually, after eating the beets.  But it was incredibly good nonetheless.  Truffled mashed potatoes.  Maple glazed carrots and parsnips (mmmmmm, parsnips!), veal broth.

For dessert we shared the bread pudding with cherries.  Neither of us had any room left to eat it, but of course we represented and polished it off anyhow.

Our bill before tax was around $100, including a $40 bottle of wine.  Considering all of the food we got for $30 per person (omitting the wine) we both thought it was a good value for the high quality incredients, beautiful presentation and knowledgable staff.

Thanks APINFC.  We will be back."}
{"text":"Came in for dinner on a Friday night and I have no bad things to say about our meal. The highlights of the meal were the duck fat fries, the octopus, and the wagyu ribeye. I would suggest getting the foie gras mousse for dessert, it's decadent and delicious and a great way to end the meal. One of the best restaurants I've been to and although I live in Milwaukee, I wouldn't hesitate to come back. We felt a tiny bit rushed to finish our meal so they could clear our table and get it ready for their dinner rush, other than that, great service. Love that they came right to your table with the card reader."}
{"text":"We had a disappointing experience here for two reasons:

1. The food simply did not taste good.  We ordered the olives, dates, ravioli, beets, and striped bass collar.  All except the beets fell short of our expectations.  The olives and ravioli were bland.  The dates were served in a pepper sauce that tasted like cheap marinara and obscured their flavor.  And the bass collar was so undercooked that it was borderline inedible.  (To be fair, the menu does say fish is served medium rare, but the fish we received was basically raw.)  I expected higher quality given the high prices.

2. Mediocre service.  Our server misdescribed a Belgian beer as \"not sweet at all,\" when, in fact, it was one of the sweetest beers I have tasted in some time.  It took awhile to be served water.  The first four of the items we ordered came out almost simultaneously, followed by a lengthy wait for the final item.  Overall, the employees--both front and back of the house--seemed a bit overwhelmed.  It was a Saturday night and it was crowded, but they should be able to handle the crowd.

Perhaps our experience was an outlier, but I am rather baffled by the high number of positive reviews of this place.  I do not plan to return."}
{"text":"I have been to to this place twice, once for dinner with friends and once for a business dinner. The first time, it was a 2 stars experience the second time a 4 stars. Hence my score.

The first time I went, it was a dinner with my wife and 2 friends. We were put at a communal table, which was ok with us. The waiter recommended the chef's tasting menu, so I got it. My wife doesn't eat meat so there was not point for her getting it.

The menu had decent food, but nothing too good. I don't remember too well what they served me, but I remember it was mostly stuff from the regular menu. The important event of the night happened when it was time to order dessert. I couldn't order since I was on the tasting menu, so my wife asked: \"What dessert are you serving him, so I can order a different one?\" The waiter basically said that they usually put in the tasting menu the dessert other people at the table don't order! How is this a chef's tasting menu! We paid a lot for what it was and I was annoyed.

I went again for a business dinner one month ago. I called in advance and asked to be accommodated at a private table, since it was for work. They were confused on the phone, but in the end they accommodated my request, which was nice of them. We ordered a couple of bottles of good wine, some appetizers for the table, and everyone got a main course. 

We had the rabbit rilette, which was amazing; best dish of the day. The duck fat fries were ok, but not great. The dates were soso. The lamb carpaccio was also very tasty.
My main course was the wagyue ribeye. It was a fairly well-executed steak, but nothing I would particularly recommend.

I would go again for a business dinner where someone else pays for it, but I don't think this place is worth my own money. I think it is decent, but it does not have researched enough flavors for the price."}
{"text":"\"American\" cuisine is perhaps one of the most ambiguous archetypes when it comes to restaurants. You generally know what to expect of a fancy minimalist-plating french restaurant, of a reputable reservations-months-in-advance steakhouse, or a bargain-priced, jam-packed burrito joint. By comparison, what kind of dishes can one expect out of a highly-rated establishment sporting \"American\" cuisine? Burgers? Steaks?

A Pig in a Fur Coat does American cuisine in its own truly unique way. A look at the menu reveals some of the creativity and style, but only after tasting the dishes can one get a grasp of the actual breadth of ambition behind the menu as a whole.

The poutine is simply the best - the cheese curds are my favorite in Madison (yes, I've had curds at Graze and Old Fashioned). Unlike some others, I thought the ravioli was just okay. The fatty-savory flavor profile unfortunately felt imbalanced on the Wagyu beef and the sauce was much too salty, overbearing and covering up the hearty bone marrow taste that I am accustomed to from Korean cuisine. Finishing with a simple, yet exquisite panna cotta made me forget about my disappointment with the wagyu till I got to writing this review.

tldr; The dishes have character. Try the poutine and pass on the wagyu beef, and you can't go wrong.

Overall experience: 4.17"}
{"text":"Delicious tapas style dining. Actual dishes may not actually be Spanish, but very flavorful. Service is great and pretty casual. Duck fat fries truly have the duck fat flavor. octopus is worth a try. Other favs include the ravioli, hamachi and the scallops. They also an extensive beer collection including alcoholic ginger beer."}
{"text":"Great find in Madison. Cute place, great theme and warm and inviting decor. Waitress was great. She really knew how to read her diners. Provided great explanation of the menu selection and really catered her suggestions to our desires. Presentation of the food was excellent. Portions were about ok. Ordered a pork belly app and only came as one serving. : ( there was an interesting selection for dishes though. I think I would have to agree with one of the other reviews, some of the dishes looked as though they were \"trying too hard\". 

All-in-all Pig in a Fur Coat is a Great place. And I would definitely suggest to others. 

Ambience = 5/5
Service = 5/5
Food 3.75/5
Price 3.75/5"}
{"text":"Phenomenal every time and easily one of my top 5 favorite restaurants in Madison. I love that they have communal seating (as well as about 8 tables for couples or groups of 4) since I dine here by myself half the time I go. I've had some awesome conversations at the the communal tables and even shared some dishes with others. The food is delicious and very well thought out and plated. And it's consistent every single time. I usually pick 4 small plates when dining solo, and 2-4 small plates and 1 large plate when dining with my partner.  Love the wine selection! Plenty of options for wines by the glass as well as full bottles. Quite a few very tasty cocktails to choose from as well. The staff, the owners, Dan and Bonnie, and everyone else involved are such great, kind and attentive humans."}
{"text":"Eating at A Pig in a Fur Coat should be at the top of your to-do list this month.

That's all you really need to know, but let me elaborate. The menu changes seasonally. Although I have only been here once, for the first time this summer, I had a lovely experience. I had a server who was relaxed, but welcoming in a temperate way. They also knew how to explain dishes without being verbose. I wish I could remember what my friend and I ate but it was a couple months ago. What I DO remember, and what made an impression was that the food was mouthwatering. We wanted a light dinner and chose two small plates and one large. One of the dishes, which I believe had farro in it was unexpectedly bright, fresh, and light on the tongue. I thought to myself, \"Finally, a dish that isn't overly rich and fatty.\" This is something I believe is worth applause since unbalanced overly rich food has become a tired trend in many Madison restaurants. This is where you take someone to impress, whether family, dating, or work related.

All in all, A Pig In a Fur Coat is a small and intimate place, that is cool in the best way."}
{"text":"Ben is a great wait staff who loves food and will help you pick a great
Set of courses.
From 

 the crispy texture of the duck fat fries to the roasted beet and goat cheese salad, wonderful creamy scallops . the food here is so good.  and the dessert was wonderful a cheesecake in a ball jar.  go early if you like quiet and a small table on the side.  One of the best in Madison, for sure"}
{"text":"As if Thanksgiving dinner didn't stuff me like a turkey, my family and I came here for dinner on Black Friday proceeding to stuff ourselves again...but with no regrets! Our dinner here was full of delicious food and superb service.

We came in for an early dinner around 5:30 or so and were the first customers in the restaurant. We got seated right away which was nice since this place is known for having long waits at times due to its popularity and limited seating! Our waiter tended to us right away and was there to explain any dish and give his recommendations, which was much appreciated. He was the best waiter I have had in the past few months.

We started our meal with an order of duck fat fries and beets. I am not much of a fry person, but these fries were pretty damn delicious and the beets were also spot on. They were a nice mix of roasted and pickled beets, ranging from golden to red beets with a few other variations between.

Next we tried the rabbit rillette, pappardelle, and mussels. The rillette was the waiter's recommendation and man am I happy he recommended it. It's not something I would have picked off the menu but it was divine, the rabbit was smooth with just the right fat content. This was perfectly offset by the sides of honeyed cherries and crunchy toast. This and the pappardelle were my favorites! The pappardelle was spot on...perfectly al dente homemade noodles with a bolognese sauce popping with endless flavor. Anyone who doesn't like this dish shouldn't be allowed to have taste buds!

After we polished off our small plates (probably in record time since I come from a clan of fast eaters) we ordered 2 large plates, porchetta and wagyu beef. These were both very well prepared but if it's your first time here I would fill up on a few small plates instead of one large plate, in order to get a better taste of what they have to offer.

We had thoroughly stuffed ourselves but decided to squeeze in dessert and ordered the panna cotta and the cream puff. Both were delicious, but the panna cotta was definitely more refined in my opinion. It was a perfect circle of jiggly glow, surrounded by these delicious cherries that had been soaked in something and a dusty of something with a little crunch. The cream puff was tasty but not the best value for $8...seemed like something that could be made at home.

All-in-all Pig in a Fur Coat was a solid choice for dinner...come here on your next date night, family dinner, etc!"}
{"text":"One of my favorite newer restaurants.  I always, always, always try the ravioli which has browned butter, duck eggs, and bacon on it.  Poutine and duck fat fries are the stuff of my dreams! You can even feel free to show up in a swim suit with a coverup like we did! haha!"}
{"text":"Cozy, rustic restaurant. Came here from a recommendation of a colleague and was not too impressed with our meal. The high points included the poutine, which was rich and savory, and lamb carpaccio, which was fresh and well presented. The octopus was a bit over done, the beets lacked flavor and creativity, and the wagyu ribeye was nothing special."}
{"text":"Went here with a group of friends for Valentines Day. The food was delicious. Each of our meals were the perfect size and easily shared amongst everybody. The craft drinks were superb. Our waitress was quick, pleasant, and efficient. Check this place out, they're doing things right."}
{"text":"This is a very pricy fine dining restaurant that doesn't match up to the hype. I've been here several times since they first opened and service is inconsistent, portions are small. They have lobbied yelp to remove my past posts, which makes me question how many others have poor experiences that we do not see."}
{"text":"We hesitated in choosing this restaurant tonight, however, we were not disappointed. The seating arrangement and the choices of various sized entrées and items were very interesting and delicious. Three of us chose among the menu items. We preferred the foie gras and cheese curds with Duck Fries to just plain duck fries. We had also the ravioli and the rabbit with veal and polenta, plus beet salad. We topped it off with panecota and bread pudding. The two desserts rather put us over the top for our fullness level. It was a wonderful night out with fine choices of food items. Another vegetable option might be a good addition."}
{"text":"Excellent small plates.  I enjoyed the poutine was a larger portion and very tasty.  The octopus was good and very well balance with the sauce. There chocolate donut dessert is amazing.  Restaruant is small but a fun atmosphere.  Service was good."}
{"text":"As self-professed foodies, we love to find off the beaten path recommendations and Pig in a Fur Coat did not disappoint.  Our server, Ben, was spot on with his recommendations for the rich, savory rabbit rillette followed by the bright, flavorful charred octopus.  With that flavor coupling being exactly what we were looking for, we opted for round 2 of the same:  pappardelle followed by beets with goat cheese and pickled carrots.  For dessert, the cheesecake -- not your typical presentation and absolutely fantastic -- with peaches and a brandy reduction.   

The Pig is a can't miss for foodies....on par with similar places in Chicago, San Fran, and New York but with the a Wisconsin flair.  Loved it!"}
{"text":"Fantastic Gem in Madison!! Excellent Italian Wine Selection...
Food: Duck fries, Any and everything with Pig Belly :)"}
{"text":"Hubby and I had an impromptu night out and decided to try somewhere new. We got the duck fat fries, pork belly, Wagyu beef and the cheesecake. 

Everything came out fairly quickly and was nice and hot.

The fries were addictively crispy with a satisfying crunch- creamy but not too starchy on the inside. With that being said, we thought the fries and garlic aioli were a bit bland. They definitely could have used a pinch of salt to really bring out the herb (parsley, tarragon maybe? I couldn't really tell) and Parmesan that was tossed on the fries. I actually asked for some salt and sprinkled it on, but you know, it's always best to add salt right out of the fryer. Oh well.

Next, the pork belly. It came on top of a sweet potato puree of sorts and was topped with julienned apples (granny smith, I think) and...corn shoots? Our server said they were corn shoots, but the menu says sunflower shoots. So we had some kind of shoot. Either way, we didn't enjoy them. The pork belly however, was divine. A perfect ratio of fat to meat. It was melt in your mouth, and yes, succulent. Hubby didn't love the sweet potato but I was definitely picking up what they were putting down in terms of pork+sweet potato+apple=yum. The hickory syrup didn't really stand out to me, but I'm sure it did something. The almonds offered a nice, subtle crunch to break up the meltiness of the pork belly. MMMmmmm

Okay. The steak. 

First of all, I've never had so much fun eating lentils in my LIFE. I want you all to understand, I don't really like lentils. I eat them because they're \"good for me.\" I believe they were cooked with the oxtail meat and mushrooms. I would order just a bowl of those lentils. 

But then there's steak! Honestly, the steak was really, really good, and I think it was because it came with the lentils. There was a good amount of extra fat and gristle on our steak. I found the best bites were the ones where I took a little steak and a few lentils. The steak, to me could have also used a touch more salt, but once again, the lentils swooped in and saved the day. They were a bit salty, but in the best, most complimentary way. The bone marrow butter was dolloped on top of the steak. It was good, but nothing super special. I mean, I'm not gonna turn away butter though, so no complaints here!

The cheesecake. Get it. 
It was creamy and fun to eat with a friend (or by yourself). I didn't get a lot of apple flavor. We kind of forgot what our server told us it was, but we didn't care. Whoever made that caramel deserves a pat on the back. 

Last, but not least, our server. Give that guy a raise. 

He was everything a server should hope to be- intuitive, timely, professional, but not haughty. I wish I remembered his name. He kind of looked like Charlie from It's Always Sunny in Philadelphia. Anyway, he deserves 5 stars. 

I wish I could give you guys 4.5 stars. The menu is inspired. The portion sizes here don't make me want to flip the table over like some places do. They're bigger than you would expect, which I appreciate. 

 Make no mistake friends, you should definitely go here for a nice dinner."}
{"text":"Probably one of the best restaurants in Madison! We've been here on our anniversary twice now and have had an awesome experience.  The signature cocktails are fantastic!  The food is always superb and the small plates options make t really easy to try a lot of scrumptious dishes!"}
{"text":"A Pig In a Fur Coat has completed me. I'm no longer afraid to die. Because I've tasted what Heaven, or wherever the hell I'm going, tastes like. Seriously, a truly transcendent experience.

Started with the duck fat fries. Ugh! Who'd ever think that fries could be SO great(they're always great, but not to this extreme let me tell you what). The fries had a garlic aioli accompaniment and were such a delicious pair. We ended up ordering another round of fries at the end of the night. My favorite thing I think I've ever eaten. 

As we shared our plates (the dates, ravioli, pork belly, the beets, and the large rabbit/veal dish) our waitress was on point to make sure everything was well with our group. And it was. Each dish looked and tasted better than the last, if that was even possible.

To end the night my party ordered the Sicilian Sfingi to share. I'm drooling.

I was prepared to be floored with a bill compared to my mortgage, but was shockingly surprised at how inexpensive it amounted to be. Four people, lots of wine and drinks, probably seven or eight plates to share and it totaled about 150 before tip. For the uniqueness and genuinely fabulous taste of each dish that one gets here, that chunk of change is well worth it.

Literally to die for."}
{"text":"My wife and I went early because we had an event to attend. I would start by saying the service was great from beginning to end. Foodie heaven this is  a pork focused restaurant that operates as tapas or shareable basis. We truly enjoyed this and were able to try several different items that are a rare find in Madison. 
We started with bone marrow meatballs and poutine. The meatballs were very good and a small plate of 3 was a great size for us to share and taste. The poutine had French fries cooked in duck fat- wow. Finished with scallops and pork belly. Great meal all around. 
Small menu but a good drink/wine list. 
I recommend this for date night but for sure leave the kids home."}
{"text":"I came here because of all the reviews from other chefs saying that this is one of the best meals they've ever had.

This was one of the best meals I've ever had. 

There's a pattern here: You'd talk and the the food arrives - and then a hushed silence as you take a first bite of your food. And then silence all the way as you can't focus on anything else but enjoying your tastebuds being pleased.

I ordered the poutine - they weren't kidding when they listed foie gras as part of the ingredients! None of that lame barely distinguishable taste in the sauce. Right smack on your fries is a decent piece of foie gras seared to perfection.

And then there's the foie gras mousse. It's rich and nothing you've ever had before. 

I'll be coming back for more."}
{"text":"Amazing food, though a little greasy for my taste. Great cocktails, and I love the atmosphere. I love poutine and am a huge fan of Pig in a Fur Coat's take on it. The food here is really unlike anywhere else in Madison."}
{"text":"My friend brought us here while we were visiting Madison. It's such an awesome place. Cool atmosphere and excellent food. Really unique in that it serves tapas (small plates) with some communal seating. Our waitress was very knowledgeable about the menu and gave good suggestions. 

The three of us shared meatballs, duck fat fries, pork belly,  guinea fowl, and porchetta. The dishes came out when they were ready so we paced ourselves accordingly. The meatball was very flavorful and cooked perfectly with just the right density. The pork belly was succulent with a good balance of saltiness and sweetness from the potatoes, nuts, and apple toppings. The duck fat fries were very delicious. Thin and crispy with great texture and flavor from the duck fat. The fowl was pretty good, the meat is tougher than duck but it was still pretty tender. Lastly, the pork (and possibly other meats) in the porchetta went really well together with the veggies. The place is a bit pricey for a small party since you'd want to try quite a lot of things on the menu. Best to come here in larger groups."}
{"text":"The name captured my attention and the restaurant didn't disappoint. It waa a great meal and atmosphere."}
{"text":"I don't know what took me so long to try this spot. What an amazing meal! Four of us visited this weekend and no one left disappointed. We really ran the gamut on the menu; beginning with the meatballs and poutine and finishing with the sfingi and bread pudding. In all seriousness I think there were 4 dishes we did not eat on the entire menu. The drinks were delicious and we had a ball. Terrific, well informed server as well!"}
{"text":"Any restaurant with 4.5 stars is definitely a place I need to check out, especially a spot my foodie friends wont shut up about.  PIAFC did not disappoint.  

My girlfriend and i sat at one of the raised family style tables next to other couples.  After some wine conversation with the others couples was free flowing.

We had the best poutine i've ever had (foie gras, duck fat, perfectly cooked fries- yum)
The pork belly was so tender you could use a spoon to cut it.
And the guinea fowl (main plate) was pretty good too.  The main dish was my least favorite, probably because the other 2 dishes were an 11 out of 10.

One of the couples at our table leaned over and asked us if it was gluttonous to order a second dessert as they couldnt believe how delicious the bread pudding was.  So not normally being dessert people we had to try what they were raving about.  My GF got the bread pudding and verified its deliciousness.  I got the cheese cake and was blown away.  Try the cheese cake. It's stupid good."}
{"text":"I love fries, I'm a big fan, but I don't like the idea of poutine. After watching Epic Meal Time a couple time, I have formed a very negative belief about poutine. The my friend ordered that poutine with fries, cheese curd, foie gras, and gravy. IT WAS THE BEST DAMN POUTINE I'VE EVER HAD IN MY LIFE! The fries was crispy, nicely seasoned. The cheese curd kept warm underneath everything. The foie gras was spot on! Rich, a little gamey but blended in perfectly nice with the poutine, giving it an unique flavor that charmed me. I felt like falling in love. 

We also had the octopus with mussel, I don't like it as much before it was a little over cooked and the texture was not what i expected. But in term of spices and flavor, it was really nice. The foie gras mousse was pretty damn good. And with that price??? YOU ARE WINNING!!!

The porchetta was falling apart tender. But the most beautiful thing about the dish was actually the bed of wide cushion underneath the porchetta. No idea what it is no matter how many times my friend told me. It balanced the dish so well, it makes me want to come back for more. We were picking on it until it was nearly gone. We actually ordered too much. 

Recommendation: poutine, porchetta, rabbit rillette, sicilian sfingi. Do not go there if you don't get that desert!!!!"}
{"text":"Went on a Friday night at 7. I thought we'd have to wait given they don't take reservations. We got a window seat right away and things only got better. Service was great, food was spectacular! Wife and I shared a starter (appetizer), each got our own small plate (first course), then shared a large plate (second course). Highly recommended!"}
{"text":"I liked this place, but  I wasn't blown away by it. 

I shared 4 small dishes plus the duck fat fries with BF. The dishes were all good, but only 2 of them stood out. The oxtail pappardelle were by far my favorites. The sauce had the perfect depth of flavor and the texture was amazing. They managed to make the oxtail feel not greasy at all. And the Parmesan had a breadcrumb crunchiness that stood perfectly against the velvety sauce and smooth pasta.
The duck ravioli (actually a single raviolo) was good. Pasta was the right thickness an the egg was perfectly cooked: firm Egg white and oozy yolk. All as drenched in cheesy butter that of course made it only more delicious.

The elk ribs and the octopus were less perfect. Both meats were coked to perfection: the elk deliciously fall apart and the octopus soft and crunchy from grilling. The sides that came with them were quite underwhelming. The Polenta that came with the elk was way too cheesy and soft and the accompanying plums were lost in the sauce. The chickpeas  that came with the octopus were superfluous and the pepper sauce just wrong: sour and acidic in the wrong way. Note I love peppers, but I rarely like pepper based sauces with added acidity, they jus taste off to me... But I might be the odd one here.

Fries were really good and managed miraculously to not feel greasy or heavy. Dessert was a under filled cream puff: not enough filling and a tiny bit too gummy.

Hats off to the wine: very good! And I also liked the communal table: was nice to chat with some of the other guests!

Will be back and try something different. For sure I will make sure to have the pasta!"}
{"text":"This place is fantastic. I went there for dinner on a Wednesday after work. Very unassuming place judging by the outside, but the food was excellent. Our table of 2 ordered a bunch of small plates/snacks to share, including meatballs, foie gras mousse lamb carpaccio and octopus. The highlight of the small plates/snacks were in my opinion the foes gras mousse and lamb carpaccio. 

The ribeye entree was a great cap to an excellent meal. Very flavorful and cooked to the temp ordered. 

Overall excellent experience with a good staff. I definitely plan on visiting again."}
{"text":"Excellent.  Not the lightest in fare, but delightful.  If you are attempting to impress someone, I suggest taking them here.  The ravioli - lovely."}
{"text":"We were in town for the weekend and wanted to try one of the top rated restaurants in Madison. Great choice! We took another couple with us, ordered six dishes, and left extremely satisfied.

Snack
Charcuterie and Cheese Platter--a bit expensive considering the price of other menu items, but the pate that came with it was amazing.
Small Plates
Ravioli--one large piece and was easily split into quarters for the four of us
Burrata--tasted great, but I would skip it in favor of some of the more inventive dishes
Foie Gras--a must order in my opinion
Pork Belly--didn't love the accompaniments with the meat, but I believe they change that frequently
Large Plates
Scallops--a really nice balance of sweet and salty on the plate

The restaurant features a good beer list and an okay wine list (for my tastes). I'm not a huge fan of Italian wines, however they had a lovely Sparkling Rose on the menu.

One downside to this restaurant is that they don't take reservations, but we got there around 8:30pm and were seated immediately."}
{"text":"This Tapas Bar was quite a pleasant experience!

I would recommend at least getting the Pork Belly and the Ravioli, as those two were my favorites by far.

It can be a bit pricey if you're looking to get variety and don't have a group. The portions aren't anything to write home about either."}
{"text":"Five stars alone for taking reservations!

Booked the two main tables for 12 people. We divided ourselves into six on each table. The menu concept is to share the large plates. DO THAT. It was a lot of fun to eat small portions of many plates. I found the foie gras delectable, the scallops cooked well (not overdone and metallic) and the chocolate covered donut holes (they had a fancy name for them) were, well, amazing.

I recommend this for small or large groups, but as other reviews say, make a reservation!"}
{"text":"Let me begin with the highlights. The octopus and scallops are amazing. 
This place is cozy and the staff are friendly.
The portions for the prices are small, very small. We had several items of the menu. Pork belly, ravioli, olives, Leopold cheese, and the aforementioned octopus and scallops.
The pork belly was okay, nothing great.
The ravioli was good, but you only get one, not great for sharing.
Olives were fine.
Leopold? cheese, nothing to write home about.
We ordered a second order of the octopus. To go along with the scallops.
We would only return for the octopus and scallops and nothing else, and because of the portion it is unlikely we would do that."}
{"text":"Pig simultaneously has some of my favorite dishes in Madison, but I usually don't want to go because the menu is very consistent when compared to similar restaurants (Forequarter, Mint Mark, and maybe Estrellon I consider top tier for small plates in Madison). If you haven't been here and that scene is your jam, I would bump this Pig up to \"must go\".

The following are excellent:
-Lamb carpaccio (corn shoots are a great addition)
-Ravioli (a single big one...it's super fun and I usually am not excited by pasta)
-Meatballs (rich and delicious...and pretty small, which is a plus in my good given the richness)
-Foie gras mousse on bombolini (though I've fallen out of love with this after having it tons of times)
-Cheesecake (not incredibly heavy)"}
{"text":"This makes me want to downgrade Nostrano to 4 stars. Really.

Holy fuck.

Food was outstanding--this is, by far, my best meal in Madison.

I went with three friends and we ordered a bunch of things--split everything!

We started out with the duck poutine, pork belly, and bombolini. Ugh, amazing. The poutine was fried in duck fat and had a few pieces of outstanding foie gras. Everything was fresh, cooked perfectly, and delicious.

Bombolini was served with some kind of liver-ish pate on top, as well as fig. Again...amazing. And the pork belly?! Don't get me started on the pork belly! Phenomenal, and that sweet potato puree beneath was killer.

For the large plates we got the porchette--which was a giant thing of pork (PORK!) served over a bed of garlic mashed potatoes with root veggies and scallops. It. was. killer. Pork was cooked magnificently, along with the crunch of the yams and parsnips? Ugh, heaven.

Oh, and the scallops?! Served over sweet potato pancakes and topped with a slice of pork belly (PORK!) and what appeared to be ricotta. Unbefuckinglievable. Only drawback: scallops were slightly undercooked, but honestly? Everything else was phenomenal.

Dessert was an italian pastry--similar to a munchkin (Dunkin' Donuts) or donut hole, whatever you want to call it--doused in a dark chocolate sauce. Amazing.

Total, with a beer and a 22%-ish tip was $40. That also includes paying for my roommates' second beers (I had just one! ...it would've been about 36-37 with tip otherwise). A bargain by any stretch for what we got!

I must go back before I leave this city. I must!"}
{"text":"Great, innovative \"New American\" cuisine. Very well executed, everything is top notch. 
Pretty pricey, but you get what you pay for. Portion sizes are mostly small, but not the Poutine."}
{"text":"I've been here twice, had two different menus both times, and loved it equally both time. Pig in a Fur Coat is a great choice for apps and drinks, or a larger meal.  

The food is beautifully presented and well-prepared, with all of the various components working very nicely together. There is definitely a lot going on in each of the dishes, but it never feels like too much. While everything is delicious, I highly recommend the ravioli, duck fat fries, and lamb carpaccio. 

The ravioli is a magical, savory pocket of brussels sprouts, bacon, and cheese; for lack of a better descriptor, it tastes like spending a cold night nestled in a blanket fort with your best friend and your favorite movie...and bacon. The duck fat fries are crispy, delicious, and seasoned like a dream. My eating-mates all agreed that they were \"a fry revelation\". PLUS you get a whole pile of aioli, which is much appreciated by enthusiastic over-dippers like myself.

The plates are small enough to share, but rich enough that you really don't need a bunch to fill up. I think a good estimate for 2 people would be 2 snacks + 2-3 small plates, or a snack + large plate. The big plates are really substantial. Great beer and wine list, though most beer selections are not on tap.

The atmosphere is great and very warm. I can't speak to how crowded it gets on weekends, but on a Wednesday and Thursday evening, it is lively without being too crowded. The staff is friendly, attentive, and provide light recommendations for how to attack the dishes."}
{"text":"Went with my mom back last September, and I'm finally reviewing. Shows you how memorable this meal was.

Carpaccio-amazing. Poutine-delicious. Pork belly-okay, but worth it for everything else.

My main comment would be that everything is so rich.. make sure to plan ahead for the food coma!"}
{"text":"Great food, great ambience, great wait staff! Amazing night!! My friend and I shared the duck fat frites with an amazing mayo dipping sauce. Also shared the pork belly and the scallops. Everything was yummy!"}
{"text":"I had the beat service. My service was great! She was very friendly, and welcoming. The food here is AMAZING! We were group of five. We ordered. Chareuterie and Cheese platter. Ohhhh it is so good!!!! Highly recommend this appetizer"}
{"text":"Went here on a date and sat at a table that was like light years away from my date and it was shared with others...kind weird and not at all what I would have expected from a 5 star, really good food, foodie kinda place.  The food was good, but the atmosphere was loud and distracting.  I am tired of these places making it into more of a warehouse than a place where you can go and whisper in your dates ear and be romantic.  Where are all these places? Ot is the romantic age over, and we should just text our dates. Cause the tables there were that far apart!"}
{"text":"Small Plates. Yes! Love the communional tables. They also have a handful of 2 top tables, which is great for date night. The plates come out as they are done. Come with a group to try multiple dishes and don't be shy to ask the people next to you what they are eating. Everything from walk-in to leaving was excellent in service and food."}
{"text":"I was so excited to finally try pig in a fur coat- my mom gave us a gift card so we were on our way last night!  I was disappointed.  We went out on a limb and decided to try the tasting menu....which was not a tasting menu at all but instead a chef selection as all items came directly from the menu.  Had I known, I wouldn't have chosen it as there were other options on the menu that looked good.  Isn't a tasting menu is typically made up of fresh ingredients of the day allowing the chef to exercise some creativity on the spot?  The donut foie gras opener was tasty but seems like it's a little played out on the menu.  The ribs were fatty and the texture was off.  The pane cotta was watery and super Cherri-fied. Needless to say, we felt underwhelmed."}
{"text":"Yumm!!!  The Duck Fat Fries cannot be beat!  The Ravioli with the Egg in it was absolutely amazing!  This is an awesome date night spot and we will definitely be back again and again!"}
{"text":"Best restaurant in Madison in my opinion. 

I've gone three times, and each time it has been excellent. The building is small, but has a comfortable, homey feel. The waitstaff is knowledgeable and friendly. The menu changes occasionally, but always has a good variety of creative and delicious dishes. The chef has even accommodated friends of mine who were vegetarians or had other dietary restrictions. 

The only minor complaint is that they don't take reservations so you might have to wait for a bit, but it's well worth the wait. Go there, share a few plates with friends, and you'll have a great time."}
{"text":"Excellent service from beginning to end. Our server was well versed in the plates and the chef was very knowledgeable about gluten allergies and made sure I was able to enjoy every bite. The meal was exquisite from the rabbit rillette, dates stuffed with chorizo, elk ribs and my boyfriend's papardelle."}
{"text":"Great cocktails, good food, very nice service.  The best was the Foie Grass, complex and delicious and the Fries were awesome too.  We tried two entrees, they were very good but not close to that beautiful Foie Grass.  Shared tables are a hit, when food is good everybody is very friendly and eager to recommend what they just tried. So, if you are in town..."}
{"text":"My favorite place to eat out in Madison! I like that their menu keeps on changing with the seasons - it keeps things interesting and gives me reason to come back and come back and come back and come back! :) My mouth waters right now as I think about their gourmet (yet somewhat comfort food style) dishes that are packed with flavor, texture and are always presented to in a way that is lovely to look at! If you haven't been there yet - just go! :) And don't forget to order the pork belly - it is crispy on the edges but ready to melt in your mouth. Mmmmmmmmmmmmm!"}
{"text":"wow. wow. wow. flavor bomb factory. loved everything. won't go into detail on dishes as others here have covered it. the clincher for me was the perfect combined vibe of the space, staff and incredible food. no salad on the menu - Dan the chef told us he would put one together if asked be he didn't want to waste the ink on the menu. love that attitude. Dan and friends also built the interior and tables from scratch. Such a good fit for Willy Street and Madison. foodies have another reason to flee the sterile streets of the 'burbs..."}
{"text":"The food was delicious. However, we were surprised to find that although folks are encouraged to share all the various plates the portions were served in odd quantities. The \"small plate\" of Lamb Carpaccio was served with 3 pieces of bread and the large plate of scallops only held 3 scallops. A 4th piece of bread and a 4th scallop may have earned them a better review."}
{"text":"Great food. Maybe a touch below forequarter in terms of interesting flavor combinations. Everything was great but the pork belly was average.

Be prepared to wait. Very little seating and always busy. But still worth it."}
{"text":"very interesting food choices.  Not so good if you want vegitables or healthy food. Everything seems to be covered in meat fat.  The food tasted good, but i soon felt overloaded by the amount of lard.  If you love a social place with lots of meat and meaty stuff, then maybe this is the place for you.  Just don't tell your cardiologist you are eating here."}
{"text":"Had a great fall visit to Madison on a mini-vaca and was excited to try this restaurant. Maybe we built up a high expectation reading reviews. Unfortunately, we just weren't very impressed by the food. I target gastropubs, new American and snout-to-tail places to help build my context with my Indy hometown faves Bluebeard, Black Market and Libertine. I have had some great experiences in the Midwest. But at apiafc we left just feeling... meh.

First let me say that the restaurant is cute and I dig the closeness and capacity of the place. Reminds me of dining in great little restaurants in New York City. The beer and wine lists were impressive and our server did well introducing us to local beers. Loved that.

We tried poutine (which I normally avoid) based on the logic: Wisconsin: curds: poutine. It was ok and succumbed to the fat and sauce before we could finish. We had beets, pappardelle, and lamb. All decent, but very prescribed and no surprises, nothing exceptional. We opted to skip dessert.

Maybe I'm asking too much, but the gastropub/new American genre is becoming... I hate to say it... played out. I feel like I've been to this restaurant before in many college towns. Unless a chef brings something to the genre, something regional, some challenging passion of the chef, something to set them apart, then why am I eating here?

I do expect a lot when I'm spending $100 on dinner for two in a casual atmosphere. What's next after the marrow, the duck fat, and the pork belly? If I'm in Madison again soon, I'll definitely check the menu and perhaps come back based on what I see on the menu. I challenge the chef(s) to make a regional statement, invent, and challenge me - the patron. I believe the skill and context is here, but the food isn't yet."}
{"text":"I came here for a birthday dinner.  The restaurant is really small and intimate, and you may end up sharing a table with other diners.  The menu is organized into snacks, small plates, and large plates which are entree portioned.  Everything comes up as it's ready and you're encouraged to share your food with others in your party.  Thick wooden tables and water and coffee served in clear glass carafes defines the decor of this place.

Under snacks category, we order duck fat fries, dates, and rabbit rillette.  Under the small plates category we ordered octopus, pork belly, and lamb carpaccio.  Everything was very rich and filling.  Our party of 3 came away feeling stuffed.  I wasn't such a fan of the duck fat fries.  I didn't taste the duck specifically, and mostly just tasted like well fried fries.  I wouldn't order it again.  The dates were stuffed with chorizo and baked in a piquillo pepper sauce.  So delicious.  I wish it was just a touch more spicy but the dates were deliciously sweet and countered nicely with the chorizo.  I also loved the rabbit rillette topped with pistachios and comes with some pickled cherries.  Amazing even without the cherries.  Ask for extra bread because there will be so much delicious rillette.  

For the small plates, I found the octopus a bit tough but the flavor was good.  The pork belly I would've preferred crispier, but the green apple slaw that it came with balanced so well with the pork belly.  It elevated the dish.  The lamb carpaccio came with a raw yolk on top and was a big hit with my fellow diners.  

They don't take reservations, but at 7pm on a Saturday night, we had no problem snagging a table."}
{"text":"Stopped here tonight for the first time.  I never would have walked in had It not been recommended.  I don't even have the words. This place is amazing.  Our waitress was great. The food was so creative, beautiful and so good.  Fries cooked in duck fat are so good, if you do nothing else stop by for those.   I can't wait to go back.  We had the Wagyu ribeye, porchetta, egg yoke ravioli, beets with whipped goat cheese and duck fat fries."}
{"text":"I was super excited to try this place because of all of the reviews.  Honestly, A Pig in a Fur Coat was a little bit underwhelming for me.  The staff was definitely super nice and knowledgeable.  We got the duck fat fries which were good, but not as good as everyone hyped it up to be.  It was really crispy and delicious but soon felt too salty and heavy. 

Sorry I don't remember exactly what we ordered because it was a while ago that I went here.  Everything that we tried was good and interesting, but it was definitely not the greatest thing I ever ate.  

I'm definitely glad that I tried it but probably will not go out of my way to come here again."}
{"text":"Our first trip to \"A Pig In a Fur Coat\".  We like to try newer restaurants and was pleased we were able to get a table at 7pm on a Friday night, (they do not accept reservations). Seating is family style and we met a wonderful family visiting from Tennessee.  The atmosphere is cute and the service was outstanding, which means  we will revisit the restaurant, but we are not rushing to get back to the Pig.  We need to try different menu items....in order to share a fair experience."}
{"text":"Ive had this place bookmarked for awhile and we finally went. All of the food was absolutely amazing. We started with the meatballs (i know for presentatiom odd numbers look better, but come on... make it 4!), then went to the cheese platter (not a fan of the liver), then the ravioli (very rich, but good), next we had the scallops (awesome) and then we finished with the panta cotta (amazing). 
Overall it was a great experience. Not sure well be back simply because we dont typically spend that much money on one meal. 
The only complaint i have is for how expensive the meal was our waitress was only ok. I expect fabulous for how much we spent on the meal."}
{"text":"A Pig in a Fur Coat doesn't need an introduction. It's on quite a few must-eat lists, so on a recent visit to Madison, I walked from the Capitol to East Madison to indulge in the fried cheese curd, gravy, foie gras, and french fry Canadian dish we have come to adopt and make our own: poutine.

It's rare to find poutine that doesn't use mozzarella in the U.S., but when in Wisconsin, cheese curds are easier to come by than mozzarella. The cheese curds in this poutine were fried and coated in a dark gravy that also smothered the French fries and were crowned by foie gras.  

This is easily a dish that can and should be shared. It's richness is worth raving about, and it's uniqueness is truly Wisconsin. Props to PFC for repping the state."}
{"text":"Went here for Madison seafood week. If you are in for a good small plates type of restaurant, I would recommend this. The decor is very nice and cozy. The food is good and the portion is just right."}
{"text":"Amazing food great service. Expected to leave hungry and I left with twin food babies"}
{"text":"Delicious! I had a duck egg ravioli, which I devoured and I rarely eat eggs any other way than scrambled. I also enjoyed the squash blossom fritters that tasted incredibly fresh. Lovely experience!"}
{"text":"This is hands down my new favorite restaurant in Madison. The food is deliciously decadent and prepared with a lot of attention to detail, the atmosphere is nice and relaxed, and the wait staff are nice.

The food comes in three different sizes and are all intended to be shared. We got one snack size, three small plates, and one dessert for the two of us and we were pretty full. Well even after the main courses I was about to burst but definitely try out the dessert because that stuff is awesome! My favorites for the meal were the poutine (holy cow this was amazing), pork belly, and the bread pudding. If you had to pick one thing, though, definitely try the poutine -- the foie gras is this really creamy texture with a barbequed bratwurst taste, and the french fries and cheese curds are a nice and crispy contrast."}
{"text":"I must admit, I am quick to give a 5 star review to small plate places.

If you like fat as a big flavor component, look no further. They do a great job balancing flavor with mouth-coating fatty flavors and textures. The duck fat fries are really crispy with plenty of gaseous umami flavor. The ravioli is a sinful masterpiece with brown butter, runny egg yolk, and bacon leaving a slippery feeling on your lips. The foie gras is sweet and salty with a great fat/acidity balance; it tiptoes the line between appetizer and dessert.

The atmosphere is pretty hip and trendy. They have a good beer selection with great prices. They have seating to accomodate a date or a large group.

Overall, I'd say that this is a must-visit place for Madison foodies."}
{"text":"Get the fries. They are the best. I have gone here just for those, although the rest of their food is amazing. I like that everything is served family style. 

PiaFC has heavier food than Forequarter but a similar vibe and set-up. Some of the fare is a bit much if it's a hot summer's day, but in cold weather it is perfect. The waitstaff is always great and I have tried so many new things because of this place."}
{"text":"Delicious food, great beer selection, and a very friendly and helpful wait staff. What more could you want? Check this place out if you are ever in Madison. Oh, and order the poutine!"}
{"text":"To be fair, let me just say I am not a big meat eater to begin with. We went for our anniversary and had been given a gift certificate, so we thought we'd try the place knowing the menu was pretty limited for my tastes. They don't take reservations so we went early, at 6p and were seated right away. We started with the charcuterie plate which was delicious and had a nice presentation. The cured meats were fresh and the cheeses were very nice. Then we had the Duck Fat Fries which was pretty adventurous for me and they too were delish! Next came the Beets and the Ravioli. Again both were very good with a nice presentation. Finally we had the Sicilian Sfingi. That was absolutely yummy! The service was excellent and the food came fast but not too fast. I can't comment on any of the large plates as we did not have any of them, but they looked beautiful as they were served to other guests. Overall we had a great dinner. I would definitely go back for the charcuterie, beets and Sfingi!"}
{"text":"Before going to A Pig in a Fur Coat I found myself looking at the giant pile of 5 star reviews on Yelp and thought, \"this place is too good to be true.\" Boy, was I wrong!

A Pig in a Fur Coat served my party the best meal that I have had the experience of enjoying since moving to Madison,WI. You can stop reading the review here if you like. Trust me.

I see you're still reading so I guess you want details, fine.

Our party of three arrived at the restaurant and were promptly seated at a table with two other parties, \"strange I thought, but let's go with it.\" I was already getting a bit of a hipster, trendy vibe from the place. It was small, dimly lit, and had hilarious food puns and pig pictures scattered about. It was somewhat charming.

The server came by and explained the menu is for sharing, think Spanish Tapas style. We ordered a few glasses of wine, and we were off. I ended up with a glass of Rhone table wine for the evening, which came with an adorable personal decanter. I've never really seen anything like it.

At this point I realize, while the conversation of the other two parties at the shared table can be heard, we have plenty of space. The shared table is no longer much of a concern.

The first dish arrives, a charcuterie board that I don't have a picture of because our bear pack was hungry and inhaled the various meats and cheeses. Pleasant, well done, and I'm thankful for the paired glass of wine at this point. The board included a liver pate; I know, liver. The pate was not grainy at all and well done. Surprisingly, I enjoyed it almost as much as I enjoyed the date jam on the board.

If there is one dish on the menu that you need to order, it's the stuffed dates with chorizo and piquillo peppers and a spicy tomato sauce. The sweetness of the dates paired well with the spice of the chorizo and peppers. Perfection. Cut it into pieces to make it last longer!

Duck fat fries, yes that phrase is all over this Yelp page so I am typing it again for emphasis. They were awesome and exactly what you would expect. Beware, you will have visions of a triple bypass 30 years from now while eating them.

Next up, duck egg and ricotta ravioli with asparagus and brown butter, this was the MVP of the meal. All of the ingredients meshed well together, from the sweet to the savory. Protip, dip your remaining duck fat fries in the brown butter, you will thank me latter.

At this point, we were stuffed. Our server, of course, persuaded us to get a dessert. We settled on sfingi with chocolate sauce, which is essentially chocolate donuts covered in a warm chocolate grenache. Warning! These are very hot and delicious. They are pleasantly sweet but not too sweet and not too dense.

After dinner wrapped up and the check was taken care of. I stepped away to use the restroom. I think my experience in the restroom is the only bad thing I can say about the establishment. The bathroom was incredibly dirty! It had one tiny trashcan (smaller than what you are imagining, think of a large coffee can for scale). That one tiny trash can was completely overflowing and had a mess of toilet paper, scraps, and general nastiness in a 2 foot radius around it. Considering, the amazing food, I am going to forgive the mess.

We enjoyed every single dish that A Pig in a Fur Coat threw at us. Very rarely do I walk away from a restaurant feeling so completely satisfied with every single menu item that was ordered, the service, the wine list, and the ambiance. I think I'm in love... with a restaurant?!

I imagine that this will not be our last trip to A Pig in a Fur Coat, and that we will be back alone and with visiting foodie friends who deserve to be wowed by top quality food and the relaxed, quaint atmosphere. 

Pig, let's be friends, with benefits."}
{"text":"Wow!  That is what my fiance said about the scallops on a potato pancake topped with pork belly.  Amazing!  Is what she said about the Duck Fat Fries.  We loved this place.  The prices are reasonable and the service excellent.  My only advice, as we found out the hard way, is that the place is very small and not set up for children.  Had we researched before we stopped in, we would have planned to leave our baby with a sitter.  Everyone was very friendly and we did not feel unwelcome, but the space is just not set up for that. This place is excellent if you like to order something and share, and they recommend that right up front.  Plan to dress a little trendy and don't miss the Duck Fat Fries."}
{"text":"You can never go wrong coming here for any special occasion or just a nice dinner in Madison! This place is definitely a family style setting so sharing plates is a must. 

My favorite dishes are: Lamb Carpaccio (as your appetizer), Tagliatelle (for the carbs), and Scallops (for your main).

Other honorable mentions depending on how big your group is: Duck Fat Fries, Charcuterie & Cheese Platter (awesome selection!), and Wagyu Ribeye.

Substitute your dessert choice with the Foie Gras Mousse. It's sweet and savory, but melts in your mouth! One of my favorite dishes here!"}
{"text":"I came in and tried small plates - in order to sample many thing. 
I liked the duck fat fries. I mean...who wouldn't?
I liked the dates and chorizo although I think a bit of cream in the tomato sauce wouldn't hurt. The acid against the sweet taste and gooey texture didn't *quite* work. 
The foie mousse was delicious, but foie is just delicious. 

The REAL DEAL is the Papardelle. Absolutely perfect, silken, broad ribbons of glory with a PERFECT. bolognese - Dan knows meat.... well. 

Nice little menu and educated palates in the kitchen. 
You really can't go wrong."}
{"text":"Taking a star away for inconsistency in their food.  The portions have grown in size and I feel like the dishes have become a bit unrefined as a result.  Everything seemed a bit rough and heavy.  

Still a decent meal but I wish they'd go back to a more refined menu and smaller portions."}
{"text":"We decided to check this place out because we love our pork. Standout was duck fat fries.  We also tried some small plates- can't remember which ones but they were tasty. I think one was pork belly- very flavorful.  The place is tiny and intimate so expect long wait on weekends.  Server was knowledgable and passionate.  Wine list was expansive.  Would definitely go again."}
{"text":"Had one of the best meals I've ever had here! We had a FIVE star experience here because:
1) amazing quality of the food
2) excellent presentation of the food
3) fast and attentive service 
4) super easy to park on surrounding streets

You can't make reservations here, but even so, we were quickly seated and attended to. There is a very large selection of alcohol and they also had some cocktails. The menu consists of Snacks, Small plates, and Large Plates, and there are about 5 to 6
options for each. The small plates are about 10-13 dollars and the large plates are 22-24 dollars. 

We ordered the olives, which has oranges notes, as mentioned in the menu. I like olives but I didn't like the combination with orange flavors. We ordered duck raviolis and it was such an amazing dish, probably the best thing I've eaten all year. The egg was cooked perfectly and I love bacon. The porchetta was also an equally amazing meal. The pork fell apart just by barely poking it, I've never seen meat fall apart like that. We loved the potatoes and carrots with it as well. We also ordered the chocolate donuts and they were baked to perfect crispness. They have chocolate poured on them and the inside of the donuts are filled with a tiny bit of cream. 


I would absolutely suggest others come here to eat!"}
{"text":"So unbelievable every time I go and last night was no different! I really don't think you can wrong with anything on the menu. I went for the ravioli - which I know they only make a certain number of everyday so I always order if they're not out! We even ordered a second one because it was so melt in your mouth. 
Also had the poutine and veal neck which were presented so beautifully and had such rich and tasty flavors.

I also just love the atmosphere of this place! The waiters are all so friendly and its frequent to see Chef Dan walking about the restaurant :)"}
{"text":"This one has been on my bucket list ever since I came over to Wisconsin. A fancy unusual name always tends to draw you in with mystery!! Sadly, the mystery wasn't so mysterious once we explored it.

Decor : Wooden furniture with black walls kinda reminded of a version of a local butcher shop back home!! Not my cup of tea for a fine dining joint but hey at-least they're being adventurous!!

Service : Friendly overall but average on execution. No explanation of dishes which I thought was a customary thing to do in fine dining places. Alas, our server/s merely named the dish and went away.

Our dishes for the night - Meatballs, Foie Gras Mousse, Octopus, Porchetta, Cheesecake

Good : Let's start with what impressed us the most - Foie Gras Mousse. The foie gras was so perfectly executed and seasoned, it tasted like one of the best butter's I've had in a while. Paired beautifully with a sweet fig jam layer, the contrast of sweet and salty was symphony!. The bombolini was a good carrier as it's soft texture and neutral flavor played the perfect supporting cast :).

Meh/Average : Majority of the dishes fall here. 

The Meatballs with \"bone marrow\" are nothing more than just a very well executed version of your average.....meatballs. I couldn't trace any Bone Marrow at all. They could've tried to keep some chunks of it within the meatballs so it stayed there. 

The Porchetta was cooked fine but dangerously close to being dry and leathery. The stuffing was bland and had no connectivity to the dish at all. The saving grace here was the mashed potato which was sinful! Overall not worth $25.

The Cheesecake had a overpowering taste of a lemon tart but in its advertised ingredients there was no lemon to be seen. Couldn't taste or sense the Lavender at all.

Ugly : The Octupus dish was one that disappointed me the most. The octopus itself was cooked rather well but its accompanying sauce/puree was bitter and god awful. Sorry but that does not bode well for a rather bland meat like Octopus.  

The water we were served had a fishy smell to it and an odd after taste. Sure enough we avoided any more for the rest of the evening.

All in all, disappointed."}
{"text":"We stopped in last week with high expectations after reading about the restaurant (before it opened) and then seeing a positive review of it online.  Safe to say that our expectations were met.
The space is both casual and intimate-some communal tables with some private tables as well.  The menu is simple, sophisticated, and really allows the flavors to shine through.  My girlfriend and I ordered the duck fat fries, the chorizo stuffed dates, and the pork belly.  The first two are labeled \"snacks\" with the last being a \"small plate\"  Even with these monikers, the food was very filling and definitely enough for two people.  All three plates were well prepared with the chorizo stuffed dates stealing the show.  Service was friendly and efficient.

This is another great restaurant to line the Willy St. corridor.  We will definitely be back."}
{"text":"This was unreal, I thought they were kidding... They are very impressed with their fancy that they forgot to make a decent meal."}
{"text":"I cannot even begin to describe the experience I had here, but I will try my best. I came here on a Monday night with my dear Yelp friends. Chef Dan has developed and perfected his craft, and it is obvious why people around Wisconsin rush to dine here.

Environment was small but not crowded. It felt like I was eating dinner in someone's home. Spacing was intimate and the noises are welcoming. What an experience!

Food: I cannot say a single negative thing about any item I've had here. The Wagyu beef dish was incredible, but I will most definitely be coming back for the rabbit and pork tripe. I was so astounded with how each ingredient was paired and represented so well with so many flavors. Eat by yourself or share with friends, but this food is meant to enjoy with others.

I cannot wait to come back. Thank you to Chef Dan for making us a meal we will never forget."}
{"text":"My fiancee Santi and I came across this tapas-style restaurant on Yelp and decided to swing by for an early dinner. Décor-wise, the restaurant had a nondescript exterior, sidewalk seating, communal tables, and all-around wooden interior. We were the first to arrive, but eventually the room was filled with small groups, families, and young professionals at every turn.

The Rabbit Rillette ($10) came with a large jar of chilled rabbit and handfuls of crushed pistachio embedded. There was also a side of sweet cherries marinated in thick syrup, and the crisp toasted bread had a nice texture and crunch. Once these ingredients were stacked together, the rabbit was absolutely sensational. There was plenty of meat in the jar to mix easily with a top layer of rabbit fat. The cherry also added an unusual sweet-tart dimension of refinement, and the server was generous to provide additional servings of the toasted bread. I thought the bread could use a smoky flavor to extend the overall experience, but otherwise it was a nice opener that is easy to share. I highly recommend it.

The Lamb Carpaccio ($14) came with thinly sliced raw lamb, corn shoots, raw egg yolk, and salsa verde. The innovative combination had a unique flavor, but our taste buds were able to come to some coherence by the second serving. For the price, the plate could have included more lamb. I also thought the dish needed an additional egg or alternatives such as quail or duck eggs to make the innovation much more compelling. There were also no kicks in the salsa verde, which was another idea that the chef should consider playing with. Otherwise, I enjoy the lifts in the flavors generated by the corn shoots. I really liked this dish, but thought the innovation could take a few more turns and twists. 

The Octopus ($13) was served with two long tentacles stacked on top of a good number of mussels, green garlic, crazy water, and spinach. The octopus was very tender, but a hint of charred smoke would have sent it out of this world. The mussels were excellent with good size, fresh, and very moist. I also enjoyed the spinach, and thought the complex seafood flavors mingled nicely with the use of seawater. Having more seawater to serve as a dip would be a nice idea to consider for the future.

Lastly, the Veal Neck ($21) arrived with miso, carrots, turnips, ramps, and radishes. The carrot was nicely pureed into a sauce that went nicely with the charred turnip. Although the veal was tender and easy to fork off the bone, it also needed more seasoning. Very simply, the taste of miso was absent to help the veal to make a stronger statement. We didn't enjoy this particular dish and weren't able to finish it.

Our server was very knowledgeable, friendly, and attentive. He knew the menu inside out, and was prompt to provide new plate settings while he orchestrated the meal. I'd be very interested in coming back to try their Porchetta, Pork Tripe, Pork Belly, and Foie Gras Mousse."}
{"text":"A almost 5-star restaurant on Yelp that lives up to its name? Absolutely yes.

Came here on a Friday evening (with a reservation for 2). We were quickly seated in the warm little restaurant. Our waiter came and explained that everything was meant to be shared, which was a fantastic thing to hear, as I hate being confined to my own plate! The drink menu was a lot more extensive than the dinner menu, but that is quite alright. What they offer in terms of food cannot be beat.

We started with \"Calm Before the Storm\" beer and a cider. The beer was excellent and had a coffee-like aftertaste rather than a yeasty one. Highly recommended. Cider was alright and was poured in a wine glass, so the portion was definitely smaller (that's fine though, allows you to enjoy it slowly like a wine!)

From here, we ordered one snack (duck fat fries), two small plates (foie gras agnolotti and grilled octopus) as well as one large plate (the scallops with pork belly). Everything was absolutely amazing. The duck fat fries came out in a wonderfully large portion (for only $6!), crispy and drizzled in what we believe tasted like truffle oil. Next came the grilled octopus. The flavor on the octopus and the crispiness was divine. The one strange thing was that the texture seemed to be a bit off (a bit flaky inside), but the flavor of everything was so delicious that we did not question it.

The best dish we had all evening was the foie gras agnolotti, which was one of the pricier of the small plates. My SO detests uneven numbers, but alas, it came as 5 agnolottis. It was absolutely delicious and hands down the best thing we had here. The foie gras was rich and flavorful, and the sauce the dish came in was absolutely divine. I found myself dipping my agnolotti back into the sauce because it was that rich. The portion size ended up being perfect, as it was such a rich dish. 

Finally, the seared sea scallops came. Three perfectly seared scallops on a bed of pureed squash with artichoke and seared pork belly all around. Earlier in the meal, I had joked that we came to \"A PIG In a Fur Coat\" but we ordered all seafood and duck, however I was glad they managed to incorporate pork in our meal. The seared pork belly, while a bit dry, was wonderfully flavorful and crispy and contributed to how filling the meal was. The scallops are highly recommended and beautifully plated!

All in all, we tend to not eat as much as the average 2 person party, but I think part of what made the meal so filling was ordering the duck fat fries, so I would recommend some sort of starchy snack side to help fill you up and enjoy the delicate but flavorful portions. 

We were to full for dessert, but I am sure they are also wonderful.

In terms of service, our server made sure to have our waters filled all evening and our dishes came out with impeccable timing (one at a time with no huge lulls, which allowed us to savor each component). Nowadays, technology has moved forward and our bill was taken care of right in front of the table. Perhaps I am not embracing technology very well, but keep in mind it is slightly awkward to calculate/input tip as your server is hovering by you (although they do try their best to look away). For food this excellent, the bill was very very manageable and I left very happy and quite satisfied. I will most definitely be returning!"}
{"text":"Great sharable plates and beers. Came here for first time for special dinner for wife's birthday and was very impressed. Everything we ordered was fantastic: fried squash, beets, pork belly, ravioli, scallops, and sfingi."}
{"text":"Such a cute spot for date night! I went with my boyfriend last Friday. I called a day or two ahead to make a reservation and had no trouble getting in when we wanted (7:00). 

Ambiance: Cozy. Eclectic. Artistic. You're seated close to the folks around you, but the place isn't too loud, so this didn't bother me. 

Location: in the artsy Willy Street neighborhood. Parking can be a bit of a challenge on weekends (for Madison). We drove around for a few minutes and a spot opened up right in front. 

Menu: Different! Lots to choose from. They recommend sharing plates, which is my favorite way to eat. 

Noms: We loved the duck fat fries (though the name gave me pause...). Loved. They come with a fancy mayo dipping sauce. Definitely unhealthy and definitely will get them next time. Meatballs were also very yummy. You get 3 to share. My boyfriend loved the octopus. I liked it a lot - admittedly, I'm not a huge fan of mole, which is the sauce it's in. Great texture though and nice flavor combo. We tried the foie gras mousse on recommendation. Hmm... it's definitely interesting, and I'm glad we tried it. Unlike anything I've eaten before. I'm not sure if we loved it, but it had a cool combo of flavors and textures. 

Dessert: Sicilian Sfingi, per rec. Can you go wrong with chocolate covered donuts made fancy? No, you cannot. Major yum. 

Drinks: I was excited to try the Dream Catcher from Yelp reviews, but sadly they were out. I went with the Mad Mule Beet Drop, which I really liked. It's as it sounds. My boyfriend thought it tasted like a garden (he's not a beet person), but I thought it was well balanced and yummy. He got a Nitro Stout, which was properly poured. 

$: pricy, but not as much as we thought! 

Overall, awesome place. Can't wait to come back to try that drink and more things off the menu."}
{"text":"This is a quirky little restaurant on Madison's funky Willie Street. The restaurant is small so it utilizes a couple long communal tables in the center with a handful of tables around that. It only serves wine and beer. The menu is very small and the emphasis here is firmly on the food. I highly recommend examining the menu before you go. The selections are not only very limited, there are no \"safe corners\" of the menu. By that I mean pretty much every dish other than the duck fat fries contains at least one \"challenging\" ingredient that may be off-putting for the less adventurous diner. 

We tried four dishes:

Beet salad with goat cheese puree, watercress and pickled carrots. This is a dish that seems to be everywhere at the moment. This one is delicious with beautifully roasted, earthy beets. The distinguishing ingredient here is the pickled carrot. That really helps elevate the dish.

Next we had Ravioli/ egg yolk/ bacon/ ricotta/ brown butter/ swiss chard. This was an intensely salty dish. I happen to like that. It is very, very rich. The egg yolk is very runny and combines with the brown butter to make a very hearty dish. We both liked this one a lot. 

Next up was Mussels/ crazy water/ leek/ spinach/ chilies/ toast. This was just a basic bouillabaisse with just lots of muscles. I didn't detect any chilies in the dish which I think would have given it more excitement. This was just average to me. 

Lastly we had Panna Cotta/ orange/ brandy/ cherry/ shortbread. This was beautifully done. The panna cotta had a wonderful texture and the cherries had absorbed plenty of the brandy flavor. 

Service was attentive and friendly. The isn't a hint of pretense here, the interior is sparse with plain wood tables and hanging exposed filament light bulbs. The one flaw is that the light level was too high. It actually hurt our eyes and made the place seem less intimate than it is. I'd strongly prefer much lower light and a candle on the table.

We'll definitely be back to try other dishes here."}
{"text":"I went there on a Saturday night expecting the place to be packed. surprisingly, it was not. we had the Carpaccio (3/5 stars), the beet salad (4/5), and the Octopus (5/5). my companion is not very adventurous so he ended up not eating at all... More for me :) 
I wish their menu had more descriptive text of the items to order. also a couple of \"normal' options wouldn't hurt. i thought the prices were OK, but I was expecting better after reading all the rave reviews on here. the seating is also very \"unorthodox\". I didn't want to eavesdrop but the people next to us were loud and we could hear all their personal business...
Would probably go back. I did enjoy the octopus immensely!"}
{"text":"This place is definitely five stars! I love the way their menu is organized and the philosophy behind their restaurant. All of the plates are made to share so as a party you can share twice the number of plates that you could get by yourself. A restaurant that encourages sharing? That's already a win in my book.

Moving on to the food. Everything I had here was amazing. We started with the duck fat fries which were absolutely heavenly. You would think that fries can only be so good but these are some of the best that I had. We had the duck liver agnolotti which was amazing as well. I'd highly recommend you share it amongst two people since after eating about 2 pieces it was definitely hard to handle. It was very rich and flavorful. Absolutely heavenly. The grilled octopus was decent. The flavor was great but I think the octopus may have been slightly overcooked.

For our main course we had an entree of seared scallops. They were cooked to perfection and the pork belly on the top definitely accentuated the flavor. I would highly recommend getting this dish. I have nothing to complain about. 

The service was amazing. Nothing much else to say about it. Waiters were all very friendly and attentive. All around just an amazing place. Will definitely be coming back!"}
{"text":"Cute little placed tucked in on Willy St. Their signage doesn't have any lettering so if you are looking for that you might walk by it. Look for a pig made out of wire/metal. Also note it is not wearing a fur coat. :)

Got the duck fat fries. Basically the best fries you could ever eat. I had some leftover (how? right??) but I did and brought them in for lunch. I reheated them in the microwave and everyone in the break room started exclaiming something smelled amazing. Still delicious the next day.

Pork belly...mmm....like bacon. But better. You can't be afraid of fat if you want to eat this dish.

Also got the guinea fowl, which was good but not as memorable as the pork belly.

The place is very charming, you can't get anything bad here really. I'm giving 4 stars, while everything was extremely delicious, I don't think I had a wow moment where I was amazed by a dish. But I will definitely come again because I know it's bound to happen at this amazing place!"}
{"text":"We went there for special birthday dinner on a Monday night, and everything we got was very good (the Poutine, Meatballs and the Lamb Carpaccio), but the kitchen was out of the top two items we wanted to order (squash blossoms, the Ravioli), which was super disappointing. We left every due to some very loud ladies sitting next right next to us due to the large, long table setting, even after I emailed the restaurant to get a nice quite spot due to the special dinner. They said no problem, even though they don't take reservations, and we were not mad when we got there, but it was sad to have to cut our dinner short. I will go back though, maybe then we can try the items we really wanted to try."}
{"text":"Shazam - Madison's best share a plate, tapas style restaurant. We were there for a business dinner and probably ordered just about everything on the menu. My favorite was the pork porchetta. Th squid with pig face - we'll just order it... delicious. The poutine while likely a bit fancy by my Canadian friends standards, was full of favor. The cocktail menu isn't to be ignored either - riffs on the classics and the classics. Pig in a Fur Coat has been in my radar for awhile - was afraid it wouldn't live up to hype. It did - I'll be back."}
{"text":"This is my absolute favorite restaurant in Madison! It's perfect for any occasion, no matter how casual or formal.

I'm extremely picky about my steaks (blue rare) so I never order it out at restaurants; however, the Wagyu Ribeye here is a MUST.  Every aspect of the dish perfectly compliments each other & is guaranteed to leave your belly happy!  I always order it with a side of foie gras because I love eating the two together. Also, the quality of their foie gras is phenomenal.

Some other favorite dishes include: Lamb Carpaccio, Scallops, Pork Belly, & Octopus."}
{"text":"I want to use curse words here to describe how F*%&)*%)*  great this place is.

It's adventurous, inspired, completely unique, and just damn delicious food. You'll talk about it for days. 

Everything is not just good, but one of the best dishes you've ever had. 

GO. GO AND EAT EVERYTHING."}
{"text":"We tried several dishes. The highlights were the chorizo stuffed dates, dry aged strip, the turkey leg. The turkey leg had a bacon onion jam that was simply amazing. I highly recommend."}
{"text":"Favorite place to eat in Madison. Everything is delicious, great selection of drinks, and I love the communal dining tables. Such a wonderful restaurant!"}
{"text":"My wife had the marinated olives, which she thought were great. (I hate olives.) It's a lot of olives too for $4, so that bit is a great deal.

The lamb carpaccio is excellent. The poutine with foie gras and cheese curds and truffle oil is really memorable, one of the most decadent dishes I've had in a long time. We had the quail stuffed with chorizo, which ended up being a bit dry somehow (possibly overcooked?), so I wish I ordered the pork belly + scallops + sweet potato dish our table neighbor ordered. Those looked amazing. The donuts dessert is excellent. Smothered in chocolate and just barely cooked so the dough is still soft and creamy. I'm a fan.

Our server was extremely friendly and helpful. A bit of a wait due to dinner rush but it's not a big deal, just be warned if you walk in on Friday night at 7 p.m.

Would go here often if I lived in Madison."}
{"text":"My wife an I ate here on. Friday night three weeks ago. It was a wonderful experience and maybe our best meal in Madison in 2012.

The setting is cozy. Not cramped, but very (very) cozy. This does create a lot of noise and a bit of jostling around, but this all helps create a convivial atmosphere.

This is a very meat-focused restaurant, and not necessarily seasonal, but those are the worst things I can say about APiaFC. 

We waited at the bar for no more than fifteen minutes (we arrived after 9pm though) before being taken to our table. 

Service was efficient, friendly and knowledgeable.

The food is outstanding.

Duck fat fries: unbelievable. The truffle oil is just a whisper that you almost won't notice until your fourth or fifth fry. 

Arancini: deep fried risotto balls with pesto sauce. Crunchy, hot, astounding if out of season...

Duck egg ravioli: the only unsuccessful dish we had, but more related to presentation (it's an ugly brown plate of food) than flavor 

Grilled octopus: I will order octopus if it's on a menu knowing it will be over cooked half of the time. Not so here. The octopus was cooked perfectly and subtly hit with vinegar. Delicious.

Chorizo stiffed chicken thigh: simply the best, comfiest dish I've had in Madison this year.

We will definitely return."}
{"text":"Maybe 3.5 stars would be better.  I took friends from out of town, and some of them seemed a little uncomfortable with the family-type atmosphere.  And the waitress seemed kinda short for the table height -- we felt sorry for her!  Anyway, as for the food:  The fries were good -- I've had better in Madison (at Brasserie V), the dates however were great.  I also ordered the orzo/mussels (a very nice cold salad) and the octopus/chickpea dish.  The octopus was cooked very very well, and the chickpeas -- meh.  I hate chickpeas.  But the octopus in that dish was great.  The tempo if the meal was good, although the veal (large plate) that one of my friends ordered -- the other 4 of us ordered and shared small plates -- was very late in arriving.  So we were wondering when he'd get served.  That was kinda odd.  We also sampled the beets (can't eat them -- allergic), the ravioli (great buttery sauce) and the tomato/burata.  I really really liked the mini mini tomatoes they were using in their dishes.  They were excellent!  For dessert,  I had the peach panna cotta (Seemed more like nectarines to me) that was very nice, and my companions had pumpkin cheesecake that they all swooned over.  The waitress was very knowledgeable about the wines, and the one wine-drinker was very satisfied with what she suggested.  

So this is a place I'd go to again, but I'd not take people who want a more traditional seating in a restaurant.  Or maybe next time we'll be luckier and not be seated next to people who are drinking just a *little* too much vino."}
{"text":"Everything was amazing. Best restaurant I've ever been to. The food, drinks, service and ambiance were absolutely outstanding. I can't wait to go back."}
{"text":"Everything was spot on.  We started with a snack plate and they let us combine the cheese and charcuterie platter. It was fantastic, we were practically licking the plate. Out of the small plates the carpaccio was the favorite. loved the little  flowers on top! The veal with the apple-kraut and polenta will make us regulars. Really friendly atmosphere, we went in with a good size group and shared  everything. Remember to save room for dessert its worth it!"}
{"text":"Excellent food.  Get the duck fat fries, the ravioli with duck egg, pork belly, and beats. Really good drinks and great service.  B"}
{"text":"They got a liquor license. And they figured out the food: bone marrow meatballs were amazing,  chorizo pepper dates were out of this world, and wagyu steak was \"one of the best steaks I've ever had in my life\" according to one of our guests. Went back 2 years later and the food was fantastic."}
{"text":"Excellent cuisine ! Cute \"hipster\" atmosphere

The foie gras mousse on home-made profiteroles and a fig jam was delicious. It was very flavorful, very  fresh testing. Highly recommend. 
The 2nd plate ordered was the grilled octopus. Excellent as well. Very fresh and tasty with a tick sauce that tested like \"piment d'espelette\". Delicious.

I have found a new gem in Madison !

The only negative: the bathroom. They need to be cleaner and with more personality."}
{"text":"Have you actually seen a pig in a fur coat?!? You won't see one here but at least you can enjoy all the eccentric items on their menu!

I had a 5PM reservation and surprisingly there were no other guests until I finished my meal.

The three dishes I ordered:

Rabbit Rillette - $10 - rabbit meat, solidified oil and on the side sliced toast with pistachio and cherries. Sorry Bugs Bunny but this jarred dish was delicious! The meat is bottled with the rabbit meat topped with a thick gloss of oil. Take the toast and spread the meaty mixture on the bread and then top it off with the pistachio and cherry marmalade. If I were to order this again, I would scoop out the stiff oil and spread the meat directly to the toast. Great choice.

Lamb Carpaccio - $14 - corn shoots (made it extra sweet), egg yolk, salsa verde and thinly sliced lamb. We enjoyed this dish but there were only 3 slices of lamb and wasn't enough to justify the $14 price.

Veal Neck - $21 miso, carrot, turnip, ramps, radish. This dish was the loser of the night. We didn't enjoy it because it lacked flavor and ended up wasting it.

They have regular seating and a community table in the middle of the restaurant. If you come here, make sure you come early and get the attentive service we received. The server gave me recommendations and explained each dish spot on.

Even though I didn't have any pig during this meal, this place deserves a visit because of their variety, presentation and ambiance."}
{"text":"This place is awesome! We went the Friday before Christmas so it was really slow, but the space is fairly small so I bet it gets pretty packed on an average weekend night. My boyfriend and I split a bunch of tapas and none of them were disappointing. The duck fat fries and dates are musts! Both are very flavorful, and for tapas the portions are decent. Our server was great and we didn't have to wait too long before the dishes started coming out. As with most restaurants on Willy St. you will need to street park."}
{"text":"My new fav restaurant in Madison, and I'm pretty fickle.  Located right off Williamson St. with plenty of nearby parking, we enjoyed every dish.  For starters, we went with the marinated olives, a generous mound of assorted olives with shaved fennel, and the squash blossoms, deep fried in a garlic aioli.  Delicious, but I would have preferred a lighter presentation with less batter.

We then moved on to the Octopus, served with garbanzo beans, and the pork belly, served with hints of maple syrup.  Both were outstanding and not to be missed.  If you love bacon, which I know you do, then the pork belly is not to be missed.  Probably the best use of fat on the planet.

For entrees we went with the porchetta, a generous cut of pork served with parsnips and carrots with a hint of maple.  One of the most filling and delicious entrees I've ever had.  If Madison had a pro baseball team I'd use all kinds of baseball metaphors, like they \"hit it outta the park\" and \"a grand slam.\"  But, since Madison is known for...ice fishing...I'm really at a loss here.  Well, anyway, it was \"quite the catch.\"  Get this.

The dry aged NY strip was also delicious, but for once I didn't have dinner envy as I was enjoying my porchetta.  Cooked just right, tender and juicy.  

My love for this place is now akin to that of Kermit and Miss Piggy, and I look forward to her loving embrace, swimming in an ecstasy of pork fat."}
{"text":"Fantastic food. Stretches your culinary preferences to a surprising level. Flexible food, serving structure, knowledgeable friendly staff. Upscale yet unpretentious!"}
{"text":"I have been waiting to try Pig in a Fur Coat since it opened. A couple of months ago, a family friend started a stage in Pig's kitchen, so when my parents came to town, I knew this was my moment.
**As an aside, if you ever have the opportunity to go to a great restaurant with someone who works there or someone who is a well-connected member of that food community, DO IT. Your experience will be improved tenfold because, generally, the food community takes care of its own. 

The single greatest thing about Pig is their cured meats. Chef Dan has been raised curing meats and accordingly, Pig does all of their own meats in-house. Because we came in with my friend, Chef Dan presented us with his own charcuterie board that was easily twice the size of the normal board. Needless to say, we got a great selection of meats and everything was fantastic. In particular, I thought the chicken liver pate (incidentally, made by my friend) was going to kill me, it was so good. I would eat that stuff on every thing, for every meal, every day. 

For dinner, we had the foie gras, raviolo, elk ribs, beet salad, carpaccio and bread pudding for dessert. Everything was very good, but unfortunately (or fortunately?) paled in comparison to that pate in my mind. My father almost lost it over the foie gras, which was incredibly rich, made richer by the fluffy bombolini (dumpling-like) and the lardo. My taste tends to gravitate towards lighter, more subtle flavors which is why I loved the pate so much whereas my dad preferred the rest of the meal for the opposite reason. Overall, everything was high quality and beautifully presented. I will likely go back as a solo diner and sample a wider variety of the menu.

The only real drawbacks of Pig appear to be temporary. They're in the middle of an expansion project and the existing space is very small. While our party waited for a table we were often in the way of waitstaff moving about the room, which--as a restaurant employee myself--made me very uncomfortable. Once Pig gets their bar and larger space set up, this will no longer be an issue."}
{"text":"When my wife and I moved to Madison five years ago, we weren't so thrilled with the restaurant scene.  In the last few years, however, things have really been invigorated by the opening of three great gastro-pubby places: Graze, Roast Public House on State Street, and now A Pig in a Fur Coat.  

We just got home from a really, really wonderful meal.  We'll definitely be going back again.  There were a handful of very small issues that I'll note in brackets.

- We called ahead to inquire about the wait and the hostess told us it would be 30-45 minutes and graciously took our name.  We got there about 35 minutes later.  The space is very nice and very bustling.  It's a loud restaurant, which I happen to like.  I won't go into the seating too much, since it's been discussed.  We took a seat at the bar while we were waiting for a table and just decided to stay there, which worked out just fine.

[Minor complaint #1 I would love to see this place expand into  a slightly bigger space.  I'm not into communal dining, but it would be fine if they kept that at the core.  I'd just like to see a few more options for small-medium sized parties.  As it stands, I can't see taking my folks here when they visit for a nice family dinner, and that's a pity.]

- We ordered drinks.  I had a beer (forgot what kind-- I'm not a big beer guy) and my wife had a very nice house-made blood orange soda.  

[Minor Complaint #2: No hard liquor.  I kind of expected some inventive cocktails.]

- We started with olives.  This was the the low-light of the meal.  We both love olives, but these were strange.  I couldn't put my finger on what was so weird about them, but my wife was certain that it was the (pickled?) fennel that was overwhelming the flavor of the olives.  We each took a bite of each kind and pushed the plate away.

[Minor complaint #3: It would have been nice if someone had asked if there was a problem.  I didn't want to complain, since we just didn't care for the taste, but part of me was hoping that someone would ask.]

- Then we had a lamb carpaccio that was out of this world.  Really, really fantastic flavor combinations on this plate.  

[Minor complaint #4: It only came with two small pieces of bread.  Maybe I don't understand the economics of bread, but I'll never understand why restaurants will serve you some luxurious dish and then skimp on the bread.  I'd rather risk having a piece left over than have to worry about whether or not I'm putting too much on any slice.]

I'll go out of complaint mode, though, because we asked for a little more bread and it was delivered fresh out of the toaster by the chef himself a few minutes later.  That was nice.

- Then we had the poutine.  Wow.  Really, really good.  I'm a huge fan of this dish, and in the past I've generally thought that there were two kinds of poutine: correctly made traditional poutine and crappy cheese fries masquerading as poutine.  This innovative take proved me wrong.  The combination of the duck fat fries, generous slices of foie gras and fried cheese curds plus a sauce that wasn't quite a gravy but was really, really good just blew me away.  

- Dry-aged strip.  Another big winner.  Perfectly cooked medium rare steak covered with generous globs of bone marrow butter and served with sweet breads and lentils.  It was just as good as it sounds.  Since we were so stuffed at this point we had about half of this wrapped up.  I think I'll eat it right after I finish this review.  

Overall,  this was a really, really fantastic meal.  One thing I really appreciated was the portion size-- I kind of expected that their \"small plates\" would be much smaller, and I appreciated the bang for the buck.  We would probably substitute out the large plate next time for another small plate and dessert.  

This is really great food in an energetic space with a very friendly staff."}
{"text":"Ok. Listen up minions. Dan's a genius in the kitchen. You want world-famous in Madison? You want Michelin stars? The pig eats your face with amazing. Get some at the Pig. My recommendation: just try everything. Start top left, go down, middle, go down, and sprinkle in some entrees. You're welcome. Now get out of here..."}
{"text":"Preface: do not go here thinking there is any way you'll be able to avoid eating your four-legged friends. Not only will you eat them, you'll do it all while boasting a shit eating grin. Needless to say, I had to take a \"break\" from my vegetarian stint for this experience - I mean, come on, the guy was up for the James Beard award. What more excuse do you need than that?

Dylan K is right: \"holy fuck\" This is the perfect place to go if you're into eating family style. To top it off, they have communal tables. The whole thing makes you feel like you're sitting in your nona's kitchen waiting for the next feasty course to come out. Only your nona probably doesn't make poutine with duck fat fries and pork belly. She might make ravioli but I bet it isn't served with egg yolk, bacon, ricotta, brown butter and brussels sprouts. I'm pretty sure my heart stopped beating while we were at A Pig In A Fur Coat. The feasting didn't stop there - we also had the pork belly with butternut squash, maple syrup and sunflowers. Delicious, but note that this dish is truly a \"small pate\" as it's name notes. 

Our server couldn't have been better. He was extremely laid back and responded with honest but tactful answers to our questions and even told us a few fun stories from previous diners orgasmic eating experiences. We were attempting to save a bit of room for our next stop, Forequarter, but according to several of the wait staff, we couldn't walk out the door without trying their bread pudding. Bread pudding made with cherries, white chocolate, pecans and homemade caramel gelatto. Pig In A Fur Coat officially earned itself a spot in Brittany's \"Pants Unbuttoned\" list."}
{"text":"Great food great service. If you want to try something new check out this place. Rabbit, lamb, scallops, beef veg dishes. You name it they have it. I loved the family style serving so you are encourage to share."}
{"text":"This is one of the top restaurants in Madison. 
Each and every dish was done close to perfect. 
You can see how the the kitchen pay attention to small details and the \"view\"'is as good as the food quality. 
Only the cheese cake was \"4\" out of \"5\".....
Take the medium size \"to share\" dishes - and pick them all."}
{"text":"Dined at Pig In a Fur Coat for the first time this past weekend and was not let down. Their casual atmosphere and phenomenal food pair well together. After seeing their chef at Kohler Food & Wine we knew we had to make the trip to experience his cuisine.
Our server was casual and laid back which was a nice change for this kind of cuisine. The duck fat fries must be ordered. The ravioli with brown butter sauce was great however rich which is the theme of their food. We had the porchetta and waygu strip for entrees and were again very pleased with our choices. Great wine and beer list although next time I might pass and focus on filling up on the delicious food. The food is delicious and rich with generous portions, plenty for leftovers."}
{"text":"Vegetarian friendly!!  My boyfriend and I are vegetarians, so were hesitant to come here, but then we were told that the chef actually enjoys cooking vegetarian options that aren't even on the menu (although I do eat seafood and got a scallop on one of my dishes).  So we tried it, and are so glad we did!  The chef came out and spoke to us about what we were looking for, and then created our own three-course meal!  The food was simply amazing, and the chef and waiter were both very concerned about how we thought the dishes turned out.  The chef brought each of the dishes to our table himself. The entire experience was fabulous and everyone should come check this place out!"}
{"text":"Decent, but overhyped and quite expensive. The boyfriend and I traveled to Madison for the weekend. After looking through both yelp and TripAdvisor we saw that this restaurant was highly acclaimed. We were very excited for it! But I personally do think that it did not meet my expectations considering the price tag.

My biggest impression is the meager portion size of each dish. The poutine was a good size but was a majority fries with two cheese curds and one piece of foie gras. The pork belly was $13 but only came with one piece while the scallops were $28 yet only included 3 scallops. Had the portions been a bit bigger my perspective would have been more favorable.

As for flavor, I thought every dish was good but not the most amazing thing on earth. The pork belly was tender and delicious although the sweet purée didn't seem to match well for me personally. The scallops were well cooked but just ok.

Luckily, the boyfriend and I walked in not starving, but had we been hungry, I don't think the portions would have been enough to satisfy."}
{"text":"Don't give the 5 star often but this place was on point. Just moved here from Portland Oregon and our food expectations are quite hi. This place certainly impressed. My favorite was the ravioli with the bone marrow, just amazing. My wife's steak was cooked perfectly and the service was great. I've told a few people that they got to go.125 for two people so bring your wallet :)"}
{"text":"I think I'm in love. I thought about you all night.  Is it too soon to call you again? I think we have something special here... A very elevated meal in a very casual space. One could almost call it a hole in the wall, but affectionately. Wood surfaces, trendy and small dining room. There is no hard alcohol served, only beer and wine. (I was a little sad about that, but hey, I get it.)

 Their menu is designed to be shared, and does change with the seasons and special items that the chef comes across. (YES.) Plates come in three sizes: Small, Medium and Large. Between two people we sampled a variety of items, including the Duck Fat Fries, Wagyu Beef, Foie Gras, Meatballs, and Pork Belly.  (Only the Wagyu steak being the 'large' or entree size amongst them, and was about double the price of any other item we tried.)  Everything was delectable. I particularly loved the Foie Gras plate with fig and beignets. (Though you only needed a little taste of the plentiful amount of fig paste provided, or it overpowered the rest of the flavors.) The steak was very tasty, but frankly it was not as spectacular as the ox-tail lentils provided with it and serving as both sauce and side dish.  The meatballs were tasty and satisfying, but the star of that dish was the bone marrow juice/sauce at the bottom which obediently soaked into bites of the meatballs. And the duck fat fries?  Well, obviously duck fat fries are delicious, so no surprise there. And the garlic aioli they provided was melt-in-your-mouth smooth.

Anyway, I thoroughly recommend this place. We left quite satisfied, feeling fat and full and decadent after 5 plates, most of which were small and medium sized, plus a beer, for about $75. For the food quality, and very adequate service, very reasonable."}
{"text":"Just tried this place on 12/05/2012.  I must say it was very good.  The food I would give 4 Stars.  Almost Everything I ate was good.  First, we started with Chorizo Wrapped Dates and Duck Fat Fries.  The Dates were a little sweet for me, but the Duck Fat Fries were incredible.  Next, We had Lamb Carpaccio.  Thinly Sliced Uncooked Lamb with an egg on top with a few toast points.  Very Very Good Dish.  For the main course I had The Chicken Thigh Dish.  It has been mentioned in several yelp reviews.  This dish was a little disappointing to me.  In the reviews they talk about juicy pieces of chicken with tons of flavor.  I found the chicken to be very dry and bland.  My Girlfriend has pork loin which was terrific.  The Service was also very good. 5 Stars! I was a little disappointed they do not have hard alcohol and only serve beer and wine.  But, What can I say?  I'm from Wisconsin.  Overall, I would come back and enjoyed my meal."}
{"text":"Everything was incredible. I went with a group of three and we shared everything family-style,  which I suggest when you're here, and not a single thing we ordered was less than amazing. Duck fat fries, do it! 

As a side note, I'm not much of a meat eater, a recovering vegetarian really, but I can gladly make exceptions for the kind of experiences Pig in a Fur Coat serves up.

The place is small, somewhat cozy, and really enjoyable - both laid back and a bit classy. Good for small groups - visiting with family or friends but not big work parties."}
{"text":"3 reasons why Pig in a Fur Coat is in my top 3 favorite restaurants in Madison:

1. It's lovely and quaint. The wooden tables make you feel like you're in some upscale log cabin or something. It's a small room and sometimes they'll sit multiple parties at the same long table. Very conducive to conversation. Good place to go on a date or with a small group of friends.

2. Fun, nice staff. I'm always writing about how nice the staff is at restaurants...but here they're also a lot of fun! It adds to the communal vibe of the spot in that they're having fun with you, sharing your good time!

3. DELICIOUS FOOD!!!! The dishes are \"fancy\" without being unapproachable and the menu is diverse enough that there's something for everyone. Pig in a Fur Coat manages to turn intricate, high end food into comfort food! I recommend sharing a bunch of plates with your group as it's a tapas style menu. The food is really decadent so you'll probably want to try a few magnificent bites of each dish before moving on to the next one. Here are some favorites:

*Foie Gras Mousse: Perfection. The closest thing to a foie gras donut you'll ever try (or until greenbush comes out with one ha!). They should change this to \"foie gras for beginners\" on the menu because a lot of my friends ate this as their first foie gras experience and loved it! A lot less intense and just an amazing combination of flavors.

*Rabbit Rillette: if you can get over thoughts of your 2nd grade class pet, you'll love this! It comes with tart cherries which compliment the fatty, salty taste of the spread. Super rich though so it's enough to share with a large group.

*Ocotpus: yummmmm, beautiful dish

*the only dish I didn't like was the dates. Kind of tasted like a weird eggplant parm.

Don't forget to ask your server for help choosing a wine!"}
{"text":"Fantastic place, with outstanding food and cocktails. Chef Daniel truly loves what he does and his passion comes through in his food. I've been a few times now and had not had one thing that I haven't liked yet. Pig In A Fur Coat is one place where you will want to leave room for dessert and where you will never leave feeling disappointed!"}
{"text":"Should've been a great experiences, but by the end we felt a bit blah. We likely ordered all dishes that were a bit too rich with sauce and butter. The tenderloin was cooked really well, though. Almost reminded me of lamb the way it was prepared. The ravioli was quite tasty, but again the sauce seemed overpowering. Scallops were nice as were the bits of thick bacon. Didn't get a chance to try the dessert. I would highly recommend coming here and eating less to try more with the group. Perhaps then, you can leave room for dessert either here or elsewhere."}
{"text":"Among the best in Madison!

Not just Madison, I wish it was in Chicago because I would easily be a regular. We ordered the rabbit rillette, foie gras mousse, lamb carpaccio, veal neck, ravioli, and the lamb chop with heart and sweetbreads. Everything was outstanding and fresh, presented wonderfully and appropriately priced. We had twice as many dishes here than at another fine dining restaurant for practically the same price but the food and service was far better at Fur Coat. The foie just melts in your mouth and the veal falls apart delicately. All items on the menu looked worthy of ordering.

If you're curious about Pig in a Fur Coat stop debating and get yourself a table."}
{"text":"Not that this place needs another great review, but I'll put in my two cents. 

The food here is awesome! Small menu, but they execute it so well! It is always changing. 

The atmosphere is really neat. The only thing I'm not a huge fan of is how you are pretty much sitting on top of each other. I'm also not a fan of sitting at community tables. Regardless.... That does not change how I feel about this place. 

The staff is friendly and well informed. It makes for a nice experience. 

Seriously though.. Go spend some money here. Your stomach will thank you!"}
{"text":"A small intimate restaurant that is a shining star in Madison.  The fries are delicious but the squash blossoms are not to be missed.  The Porchetta is to die for.  Savory with just a hint of sweet.  The garlic mash potatoes round out the dish nicely.  The meat just melts in your mouth."}
{"text":"If there were 15 stars it would be more appropriate for this venue. The chef is a culinary genius, the quality of ingredients are indisputably top notch. You taste it in every amazing bite of food, every plate we tried was exceptional. Probably the most amazing foie gras, that I've ever encountered. We were told it's a rare local treat, raised humanely by a nearby local Wisconsin farmer, who won't deliver more than 2 hours from his farm. 

Then we had the lamb carpaccio, so delicate, with such surprisingly wonderful flavors added in. Each flavor the chef adds to his dish, is like a surprising delight. I agree with the reviewer who said, you talk and then your plate arrives and there is a silent reverie as you savor each bite of food. 

The staff is great, the drink menu has some amazing choices. They kindly and amazingly accompanied my allergies to soy and canola and we left our choices up to the chef, which was our best choice of the last week. He surprised us with a delightful octopus, scallop, pig dish. If we lived near here, I think it would be difficult not to make this a weekly experience. 

Please never change, keep doing what you're doing. We can't wait to come back!"}
{"text":"Ambiance and plate presentation are great. You get to share a table with other couples which might make some uncomfortable especially if you have a husband that can be socially awkward sometimes. Overall the food is great but small portions, can be pricey but for the experience, it's worth it."}
{"text":"Our group of six Shared the following items; Duck fat fries, meatballs, pork belly, mussles, pappardelle, lamb carpaccio, dates, octopus, beets, porchetta, guinea fowl.  Dessert we had Cheese cake custard bread pudding and port tawny.

Top choices for the group were duck fat fries, pork belly, and the dates.  These were all outstanding.

The rest of the items were very good except the lamb.  I don't recommend ordering the lamb.  It was slimy, tasteless, and way over priced.

The service was good.  Our server did a great job recommending a wine that I really enjoyed.  Bill was close to 300.00 for all of the food and several drinks plus dessert.  I thought this was reasonable.

I would definitely come here again."}
{"text":"This is what I've been looking for in Madison - a cozy, well thought-out, upscale restaurant. Their menu is very unique and quite expansive - while most of the dishes don't sound super appetizing from first glance, there's definitely a lot of finesse that went into the menu dishes. A few standout items were the lamb carpaccio, the fries, and the foie gras. If you go with a group of 6 or so, you can almost try every item on the menu which is super fun!

I highly recommend making reservations on their website beforehand. This place gets packed on weekends and is pretty small to begin with! The ambiance is perfect for this type of shared food. While the place is definitely great for a date night, you just wouldn't be able to try all the great dishes. A group of 4 would be ideal to at least taste a decent amount of their eclectic menu. The service was also superb - the waitresses were all very knowledgeable about the food and wine list. 

I HIGHLY recommend this place - definitely some of the best quality food you can find in Madison."}
{"text":"Great atmosphere, food, and service. I ordered the octopus, duck fat fries, and ravioli. I've heard the hype about this place for a while and now could finally say that I dined here and agree!"}
{"text":"We've eaten here twice, and enjoyed it tremendously both times.  It is, I think, somewhat unusual for the Madison restaurant scene, in that it's a pretty upscale restaurant but the serving and seating style is more family style.  So, if you go, just be aware that you might be sharing a table with others you don't know, and that the menu revolves around small plates that are meant to be shared.  I would not plan on going with a large party or if I knew that we wanted to have a \"special-occasion-serious-conversation\" kind of vibe.  I can see what other reviewers have meant about the pacing, too ... stuff comes out of the kitchen when it's ready, so again, if you're OK with sharing the small plates, that's not a problem, but if you're expecting that everyone gets their own meal served before you all start eating, it will feel weird.  

I think the food is excellent.  The ravioli with the duck egg and the pancetta and brown butter made my heart sing.  The burrata with heirloom tomatoes was outstanding.  The turkey leg is amazing (and I don't usually like dark meat turkey).  It's not very vegetarian-friendly, but I'm told that they will accommodate vegetarians if you call ahead.  The waitstaff are very knowledgeable about the wine and beer selections, and very friendly and attentive."}
{"text":"4.5 would be where I rate it.  I was going to go to a cheap BBQ place here in Madison, but when I got there a big \"For Lease\" sign greeted me.  I headed over to another place, but noticed that I was going by Pig in a Fur Coat.  \"What the heck...\" I thought, and pulled over...and I'm glad I dd!  

I started out with the Foie Gras Mousse/ bombolini/ lardo/ fig dish.  It was the best of the three things (!) I tried. The people sitting next to me were referring to it as \"orgasmic\".  It was.  Really.  Embarrassingly delicious.  

Next up I had the Ravioli/ egg yolk/ bacon/ ricotta/ asparagus/ brown butter small plate.  It was good, but not as spectacular as the mouse.  It was sort of \"one note\".  The brown butter sauce dominated the flavours to the detriment of the rest of the dish.  Good...but I wouldn't get it again.

Finally, it was the Octopus/ mussels/ green garlic/ greens for desert.  You pick your dessert, I'll pick mine, OK?  This moved back into the Oh My This Is Amazing category.  Not orgasmic, but certainly on the road there.  The shellfish were done Just Right.  The octopus was super tender.  It was pressure cooked and then finished off in the wood-fired oven.  It's always a risk getting octopus...  this was worth the risk.

I was quite happy I stopped.  I'm sitting here in my hotel room with that \"My, A Good Meal!\" feeling...contentedly sated.  The servers are wonderful, and the room is welcoming.  Good place... go there!"}
{"text":"Meh. I wanted to like this place because I live nearby but I was incredibly disappointed. For a pricey tapas restaurant it's lacking in atmosphere and consistency in the quality of dishes. The space is tiny and stuffy and the bar is beer & wine only. I had four dishes. Two were excellent and two were awful. For the price and pomp I expected a better overall quality. For dessert I had the bread pudding. It  was bland and tasteless. I'm not one to walk away from desserts but after two bites I knew something was wrong and didn't finish it. If you want good quality tapas for a similar price and in a nice setting skip this place and head over to Icon."}
{"text":"Honestly more of a 3.5 star for me. I was not particularly impressed by Pig in a Fur Coat, especially given all of the raving reviews - mostly from fellow elite yelpers who's tastes I have high regards for. 

I loved the ambiance of the restaurant, but found it a little too stuffy (I don't think the kitchen was ventilated particularly well because I could smell a lot of the kitchen oil from where I was sitting, and it made the restaurant almost unbearably warm). 

Our party of three was seated at one of the large communal tables, which we had to ourselves until the latter part of the meal. Although I liked the idea of the communal tables, I found the height of the table/stools a little awkward. Either the table was too high or the stools were too low, but I felt like I was sitting a little too close to my food with my elbows uncomfortably high.

I must commend our server though, she made us feel really welcome and did her best to offer suggestions from the menu. 

Anyway, on to the food:

Rabbit Rillete - I'm not a huge fan of any concoction that seems to be super high in fat content, but since my friend (mistakenly) mentioned that he had tried it before and loved it, we put in an order for our group. It was definitely an interesting combination of flavors and juxtaposition of sweet (cherries) and savory, but it was definitely not my cup of tea.

Ravioli - Probably my least favorite dish of the night. I definitely think I missed the point of the presentation and preparation of the dish, because I couldn't really appreciate how the different ingredients were incorporated together.

Pork belly - (recommend!) Well-prepared and flavorful, but nothing super, super memorable. Definitely something to try though if you are a huge fan of pork belly!

Guinea fowl - (highly recommend!!) Guinea fowl stuffed with chorizo, a fantastic (and unique) combination! I also loved the bedding of fregula and mixed vegetables, they were definitely a great addition to the poultry dish.

Cheesecake - (highly recommend!!) can you say peaches and cream(cheese)? super rich, but a great dessert option to share with your dining companions. also, it is served chilled in a mason jar with a side of peach jam, so what is not to love?

For me, the highlights of the meal were definitely the guinea fowl and cheesecake! I would recommend at least three out of the five items we ordered, which is not a horrible statistic. However, I find Pig in a Fur Coat relatively pricey for the size of their portions, so I probably won't be back unless I am dining out with company that is really into tapas style restaurants (or perhaps someone I'm trying really hard to schmooze up to)."}
{"text":"Getting my pork on!!! 
Oaxaca Old Fashioned - delicious. Giving up margaritas. 
Bone Marrow meatballs -it's a meatball 
Foie Gras Mousse - scrumptious. Give me more. Pork and goose liver should be BFF. 
Scallops and pork belly - crispy light pork belly sweetly savory scallop .
Chocolate balls- all balls need to be made of and slathered in chocolate and fried in pig fat. This is worth a trip to Madison, Wisconsin.

Ashley was wonderful company mixing cocktails and conversation simultaneously."}
{"text":"Ate here only two times, but both times the food was wonderful, cooked to perfection. Drinks were on point. Great name, cute restaurant, clean and neat. Made for good times with friends."}
{"text":"I'm just a visitor, but I'm pretty sure this place embodies what Madison is all about-- Friendly people, comfortable atmosphere, great service, and casually upscale quality without the slightest hint of being pretentious.

I had the lamb carpaccio and the ravioli to start. The corn shoots on the carpaccio weren't my favorite, but the rest of it was pretty spot on. Fresh 'salsa verde' (more of a chive vinaigrette to me) and salty, rich parmesan really rounded out the flavors on top of the subtle lamb. Tasty but not incredible.

As for the ravioli, it's easy to see why people come here for it. The duck egg is raw inside the ravioli, and quite possible the lightest part of this dish. Between the brown butter, truffle, and cheese, there's plenty of richness. This may sound blasphemous, but I'm not sure it really needed the bacon. I found it slightly overwhelming in certain bites, but it did pair nicely with the runny yolk sauce.

Rabbit stuffed with veal sausage for the main course. I'm not usually a big fan of polenta, but this stuff was perfect. The creamy sweetness balanced perfectly with the meats and the sweet earthiness of the mushrooms, carrots, and onions. Simple ingredients, masterfully prepared.

4 stars instead of 5 because while the flavor and service is excellent, tapas prices just don't lend themselves to frequent visits. If money were not an object for me, this one's definitely 5 stars."}
{"text":"We went here on a Saturday, no wait, it must be losing its flare. The vibe is ok, I thought it would be more rustic. The drinks are divine. We had apps and we're going to sit down when I realized that the apps were extremely salty and heavy. There are literally no vegetables on the menu, after thanksgiving weekend I just needed something more green"}
{"text":"Vogon Constructor Fleet rating: If the world were destroyed to make way for a galatic super highway, I simply wouldnt remember this place.  I would remember Girl adn the Goat, and mourn it.

Service and noise level really made this experience a challenge. I wanted to give it four stars. Couldnt.
Get:  The duck fat fries, figs and tomatoes and the steak. Vodka Collins
Dont Get: Duck egg dumpling, foi gras or the burrata. Their verison of the Dark and Stormy cocktail.

Service: 
-We were ignored quite a bit.  I suppose its a busy place with more diners, but water and soda refills are basic needs that we shouldn't have to ask twice for."}
{"text":"A fun place to try for a special anniversary or date. We tried the poutine as an appetizer and got the pork belly and the gnocchi as dishes to share. Everything was delicious!"}
{"text":"Food was fantastic! The idea of sharing was a little odd at first but I liked it once I tried it. Loved the pork belly and the chocolate soufflé with passion fruit and chili sauce!!!! Super fun for a date night!"}
{"text":"The weather's changing, 
the menu's changing, 
but one thing remains the same... this is probably where I will eat my last meal in Madison. Keep your pants on, I'm not going anywhere. Just simply stating that because of several factors including octopus, price-per-portion, creativity, staff, octopus, consistency, wine offerings, rotating menu and octopus, it's high on my list. In a city overcome with elevated and interesting fair, these guys are consistently coming up with menu items that read like a dream and taste like heaven. And they have an amazing bottle of Rose right now (forgot the name) with just enough sparkle to light up an evening. Staff is always helpful at making recommendations, charting out an evening, and I've never felt rushed to make decisions, even when there's been a gaggle of people waiting outside. I know people stay close to the Capital. 
I know when people head East they don't head too East. 
But if you haven't been to Pig In A Fur Coat you are doing yourself a disservice. I find it harder to snag a table in the colder months (perhaps because they eliminate patio seating?) so now is the time! Do it!"}
{"text":"The food was quite good, however, as with many fancy restaurants the dishes are very overpriced and have a very little amount of actual food. 

If you're hungry, this isn't the place for you. 

A bit of an uptight wait staff is quite a turnoff as well"}
{"text":"I've eaten at so many restaurants and Pig in a Fur Coat will always be a favorite. They do a great job at having some modern upscale food but they always seem to have that Midwest heartiness and flavor that I love. Any version of their foie gras mousse is one of my top favorite things to eat and definitely save room for dessert every time you come here."}
{"text":"My only complaint about this place is that I wish it was bigger so it was easier to get in! 

It's a 'cozy' environment....but still great! We went around 4:00 and avoided the crowd but by 5 the place was packed with people waiting. 

The menu is small, but everything on it sounds interesting. My husband and I shared several dishes----everything was amazing. We couldn't even say no to dessert, the Sicilian Sfingi.....these little orange flavored doughnut balls covered in a chocolate glaze. Unbelievable."}
{"text":"Thanks to Jessica H for asking a favorite ravioli question, which reminded me that I needed to write this review.  A Pig in a Fur Coat is definitely one of the best additions to Madison's growing restaurant scene.  I was fortunate enough to finally try the restaurant out the week I was moving out of town.  

Like what others have said, the dishes are intended to be shared with another.  Everything on the menu looked ultra appealing, so there was quite a bit of debate on what to order.  We ended up settling on the ravioli, pork belly, and lamb carpaccio small plates and the steak large plate.  

First my criticism.  With a name like \"A Pig in a Fur Coat\" I was expecting the pork dishes to be the standouts.  I have to say that I was a little underwhelmed with the pork belly small plate.  I can't give a specific reason why, but there was just something, flavor wise, missing from it.  Perhaps, it was an off night.  Now onto what they did really well!    The highlights were the ravioli and steak.  The ravioli with ricotta and duck egg was the best \"pasta\" dish I've had in Madison (or in Wisconsin, for that matter).  What really made it stand out was the brown butter and huge slab of pancetta on it!  When describing it, rich is an understatement.    Get it and share it with another person or two......it'd be quite a bit for one person!  As awesome as the ravioli was, we actually enjoyed the steak the most.  A great steak, in and of itself, is a pleasure.  Add some fried sweet breads (my absolute favorite thing), duck fries, and mild basalmic sauce, and you have a perfect meal, in my opinion.  Basalmic is one of those ingredients that can absolutely destroy a dish by overpowering everything else.  A Pig does a great job to make the basalmic compliment the flavor of the other ingredients.  

Dessert wise, we ordered these Italian chocolate beignets (can't remember the name).  I'm a huge fan of fried dough, and these gems get my approval!  

A Pig is a place I definitely look forward to returning to on my next trip to Madison in about three weeks.  Not only is the food very good but the service was excellent.  Price wise, it's on the middle end for Madison, but portions are rather generous and you'll definitely get a memorable meal!"}
{"text":"The place is small but the food is big....there are so many good restaurants in Madison and this is one of them.  If your looking for a menu that is different this is the place go to.  I had the pork belly as I am not that adventurous and I refuse to eat rabbit which is a story not appropriate for here.  Check out their menu, I am sure you will find something you would like.  They have small and large plates and as a smaller plate eater this was perfect for me.  They have a small bar for those who want a cocktail or wine with their meal.  We enjoyed our experience and would go back."}
{"text":"Pig in a Fur Coat is one of my favorite restaurants in Madison.  It's a charming little space with communal seating in the middle and a few tables against the walls.  I've never had difficulty finding a seat but I usually dine here either early or late in the evenings.  

The menu is divided into three parts: snacks, small plates and large plates.  On my first visit, the waiter was quick to share with me two things: that they really love food at Pig in a Fur Coat and that the large plates were at what they really excelled. He may have been taking pity on me as I was dining by myself and didn't have anyone with whom to share small plates.

From the large plate selection, I am quite enamored with the porchetta. This hunk of porcine deliciousness has been my go-to favorite. On my last visit, it was with great difficulty that I forced myself to branch out to another menu item. Even before I got to the restaurant I had told myself, \"Self, stop being so damn predictable and try something new!\" 

There were a couple of additions to the large plate selections that looked intriguing: the Hamachi collar and the lamb heart. I grilled the waitress on the preparation of the two dishes.  She was very indulgent and descriptive with me.  Eventually the lamb heart won out. It's lamb heart after all and how often do I get to try lamb heart.

The dish consisted of shredded lamb formed into cubes, potatoes, summer squash, and heart of palm topped with slices of lamb heart and covered with Arugula. My waitress had told me that the lamb heart tastes like lamb but to me it tasted just like beef heart.  What it lacked in lamb flavor was more than made up for by the shredded lamb.  The combination of the components worked perfectly.  I devoured my meal while listening to oldies like Sherry Baby.

Now that I've found another large plate item that I enjoy as much as the porchetta, it'll be a tossup between the two on future visits. That poor Hamachi collar will probably never get a chance."}
{"text":"Fantastic food and very interesting menu. Small place with an eclectic vibe. Highly recommend anything on the menu, but especially the scallops, tripe, or the lamb carpaccio. The charcuterie plate was one of the better ones I've had in Madison."}
{"text":"Overall, I was very satisfied with my experience at Pig in a Fur Coat. Food quality was excellent, portion sizes were pretty good, and the menu is a bit more creative than the standard trying-slightly-too-hard fancified comfort food places. 

That said, it's not cheap. This is one of the more-expensive places that I feel justify the cost, but that's just me. 

I'm of two minds about the communal seating. Sometimes if I'm feeling particularly boisterous (i.e. drunk) and think my conversation is particularly entertaining to others, I don't mind table-mates joining in or whatever. On the other hand, sometimes I just want to go out and have a nice dinner and not have random people all up in my grill."}
{"text":"Warning: their duck fat fries & dip are addictive. For the entre I split a plate of chicken, bacon, & apples, followed by egg nog cheesecake - delicious. Chill atmosphere, friendly staff, and a menu worth exploring more. I plan on going back. My 8 year old even enjoyed it but it is definately more of a date place. I would recommend getting there earlier in the evening as seating fills up quickly and there isn't a lot of privacy once it does fill up. Wish I could check out the NYE dinner spread, sounds like a delicious feast but I already have other plans. Their booth at the Willy St. Fair always has delicious pulled pork so I may order that next time. 

Side note:  We were seated by the front window (which was pretty chilly, kept my coat on for the meal) this gave us a front row seat to the action on Willy St... it felt like an episode of COPS outside where at least 6 squad cars and a fire truck were parked out there apparently responding to a call."}
{"text":"One of the most urbane restaurants in Madison.  I like the communal, intimate feel. You can sit down at one of for tables for two or 4 or one of the 3 larger tables with seating for seven or eight. At these larger tables, you may sit with just two people and then 6 other people may join you.

Now, about the food. The food overall was fantastic. My favorite dish was the ravioli with duck egg and bacon. The duck fat fries were phenomenal. They have Parmesan cheese and a garlic aioli to dip in, they were hot and tasty.  a few other dishes that we shared with our friends included the beets, the octopus, scallops, and ribeye steak. Everything was cooked very well. The flavors they imparted to the foods were amazing.  The aforementioned ravioli was probably the best bite of food i have had in 3 years.  A couple of smaller issues for me: the ribeye was a little overdone and I thought a little dry. Also, the piece of octopus I had was unchewanle.  However, our friends, who shared the dishes with us, raved about the tenderness.

We were there for 3 hours and the service was excellent and unobtrusive the entire evening. Overall, I would absolutely go back to this restaurant."}
{"text":"Hidden gem on the outskirts of Madison! Quite far from downtown where you expect all the good restaurants to be- definitely would not have found it if it weren't for yelp! Coming from Chicago, this restaurant reminded me a little of the Purple Pig and Girl and the Goat, 2 of my favorite restaurants in Chicago. 

To start, we got the duck fat fries with garlic aioli. Super delicious however I do wish the fries were just a little bit thinner cut, but that's personal preference. 

For small plates, we shared the lamb carpaccio and the octopus. I think the lamb carpaccio is definitely worth trying! Super tender meat paired with the crunchy toasted sliced baguette was a perfect combo. And just a note for those who aren't familiar with carpaccio, it is raw! The octopus was good too and very tender but wasn't as spectacular as the lamb. 

For large plates, we got the wagyu ribeye and the scallops. The scallops were cooked perfectly and paired with a butternut squash purée and sliced asparagus. They were also served with pork belly on top, which was a nice addition, but I could've done without it too. This combination was surprisingly delicious and good pairing of different textures and tastes. The ribeye was mediocre, I didn't particularly think it was mind blowing. They're not kidding when they say large plate for this one- it was quite a hefty piece of steak and we didn't end up finishing all of it!"}
{"text":"Found this little gem via Yelp and did not disappoint at all!  It's a very informal place with delicious food!

Our server was very friendly and she replaced our dirty plates and utensils several times when new food came out. Nice touch. 

After reading the reviews here, we ordered the meatballs (one of the best meatballs I've tasted with great bone marrow sauce), pork belly (melts in your mouth), foie gras mousse (only knock was the bombolini was a little hard), grilled octopus, and lamb carpaccio (fantastic). The food lived up my expectations and so good!

The drinks were just as tasty and refreshing too. Not the cheapest place ($111 before tip) with 5 small plates and 2 drinks each. 

Definitely try this place out when you are in downtown Madison!"}
{"text":"My wife and I decided to take a recent celebration dinner trip here.  It has been on our list for awhile.

The space is very tight as they try to maximize the ability to accommodate more patrons.  I don't usually prefer to be in such an enclosed area, but it does give you great views of the food coming out.

Neither of us could really decide on what to get.  Many of the options looked incredibly good and we nearly decided to order far too much food.  In the end, we decided to each go with the tasting menu.  Not only was this a good way to try multiple items, we were also served items not on the menu.  With the menu always changing, I am not going to delve too far into what we had.

By no means was any of the food bad.  That said, I was very underwhelmed with the pork belly.  It was the least impressive part of the five courses.  This is something that I try to get everywhere that I can, so when it can out I was pretty excited.  Though, after a couple of bites, most of that faded.  Being a huge bacon and pork belly fan, this was a bit of a let down.

Easily our favorite dish was something that was not on the menu.  It was a variant of a (I believe) pork dish, but with lamb instead.  I have never found lamb to appealing.  Having past up a chance to avoid it, I decided to give it a chance.  Not only was this the first time that I finished a lamb dish, I found myself trying to get every last bit.  It was amazing.  Again, this was not on the menu and further increases the value of the tasting menu.

Our table service was a bit spotty.  We found it hard to find our server when we needed something and drinks weren't offered consistently.  It wasn't clear what the issue was, but it seemed to be related to poor awareness.  The bar staff was very knowledgeable and attentive, which helped compensate.

I very much recommend trying the tasting menu.  Overall, the price is better.  However, the best part is the experience of the chef creating something for you.  You really never know what you'll get."}
{"text":"Absolutely outstanding! In a city where, generally, style reigns over substance this place delivers. The food and service were outstanding in a hip atmosphere that was still comfortable. Go now and often!"}
{"text":"YOU! I've been looking for you.

It's unfortunate I stumbled upon you after eating a filling Laotian meal, but I was able to find room after hearing about your desserts.  And also a little extra for some wine.

We got:

Sicilian Sfingi:  I know, you're all like buhh? But they're essentially chocolate beignets with a hint of orange.  So soft, hot and fresh with a healthy drizzle of chocolate.

Strawberry Rhubarb Lavender Pie with Honey Ice Cream: Feel free to read that over as many times as you like.

When the server came over and asked how everything was, my cousin found it within herself to shout, \"HOLY SHIT\".   He responded saying that best thing she could have said.

It's communal tables, so mind your elbows and talk to you neighbors!  It's a really fantastic menu, and flawless service for such a young restaurant.

And do I need to mention how glorious the name is?

May the pig be with you."}
{"text":"Had a fantastic dinner here with friends. Arrived early for our reservation, so I sat in the bar enjoying a couple of cocktails before dinner. The bartender is a great resource and develops some top notch cocktails. Try whatever she recommends!

Plates come out as they're ready and are intended for sharing. The kitchen was well paced - we never had too much or too little at a time. Sick to the regular fries, which are fantastic. The poutine was short on cheese and gravy and not an improvement over the original. Quite probably the best octopus I've ever had: tender and flavorful.

Cheese plate was a great starter and the desserts were delectable. From start to finish a wonderful dining experience."}
{"text":"One of the best restaurants I have ever been to in my life. The chef here clearly has some great skill and creativity. We've been to Pig In a Fur Coat twice and have traveled from Phoenix and Atlanta to eat the foie gras mousse . We also had the lamb carpaccio this time around which I highly recommend and their coffee is delicious here as well. I recommend the Chemex coffee. Can't wait to come back next year!"}
{"text":"Arrived a little after 5 on a Friday. Perfect time. It was my wife's birthday and she had been looking forward to going to this place. Foie gras was on her mind and she was NOT disappointed. The pictures don't do it justice. The food was outstanding. Between the two of us, three drinks - Pimm's Cup, Old Fashion and a glass of wine (generous glass of wine...no complaints here) along with two \"snacks\" and three small plates; our meal was $80. I thought that was very reasonable for the amount and quality of food we received. 

The Poutine for a \"snack\" would of fed three people. The foie gras in this was really good and the cheese curds were tasty. I think these are the duck fat fries too but I could be wrong. 

The bone marrow meatballs were full of flavor with onion. The ravioli with duck egg was very, very flavorful. The carpaccio was okay. Was a little messy I thought but was just okay. I love carpaccio but this wasn't my favorite. 

The star of the night was the foie gras mousse with bombolini's and fig. Absolutely thee most amazing small plate I've encountered. A must have. I'd go back and order two plates of that with a glass of wine any day. Great restaurant. Very good service. The pace of everything was spot on."}
{"text":"Items Selected:
Rabbit Rillette - Pistachio and Cherries
Poutine - Foie Gras, Cheese Curds, Poutine Sauce
Ravioli - Duck Egg, Bacon, Ricotta, Brussels Sprouts, Brown Butter
Foie Gras Mousse - Profitteroles, Lardo, Fig
Octopus - Mussels, Clams, Swiss Chard, Crazy Water, Leeks
Guinea Fowl - Chorizo, Fregola, Summer Squash, Bacon, Leeks, Feta
Porchetta - Potato, Anaheim Pepper, 'nduja, almond
Sicilian Sfingi - Chocolate, Orange

Planned as a meet-and-eat with University of Wisconsin students whose recommendations helped guide me to several great bakeries throughout the state capital, my 7:00pm arrival at Pig in a Fur Coat found two new friends waiting on the restaurant's patio and transitioning indoors to a high-top communal table beneath Edison bulbs juxtaposing the small bar it would be mere moments before our server arrived, a menu featuring no less than sixteen selections I'd have gladly eaten soon presenting us with tough choices from which our eight course experience was made.  Best described as cozy without being cramped and featuring portions far larger than one would expect given the price-point or quality of cuisine it was with a giant jar of potted rabbit that our meal began and immediately struck by the rodent's nutty sapor my expectations for the rest of the cuisine rose substantially, a follow-up plate of crispy fries topped with squeaky curds and a sizable slice of seared liver further upping the ante without a bit of sogginess to be found.  To this point unexposed to the restaurant's signature ingredient but soon to be treated to a plethora of pork it was next a small pocket of yolky ravioli that arrived and with flavors harkening breakfast I was again left smiling, a follow-up of terrine-topped choux draped in briny pork fat and reined in by balsamic perhaps the best plate of the night.  Stumbling next with overcooked octopus and guinea fowl that got lost in everything else on the plate it was unsurprisingly with pork that Chef Bonanno righted the ship and although seemingly a bit aggressive given accoutrements of peppers and Calabrian sausage the flavor was actually quite restrained, a light bit of smoke set against creamy potatoes and ample aromatics arriving from the porchetta itself.  Unfortunately not currently serving their oft-raved bread pudding it was finally in a quartet of donuts that our meal would end and with rich chocolate poured over each bite as light notes of citrus occasionally peaked through I was admittedly glad when my tablemates stated they were too full for more than one, the last golden orb gobbled up with glee before the modest bill was paid."}
{"text":"One of the top restaurants in town. Everything we ordered was good, and many dishes were great. The waiter was also excellent."}
{"text":"Best dining experience in Madison since I moved here a few months ago. Had the beets, duck fat fries, and foie gras mousse and a crazy delicious lavender cocktail. Wow!! I've tried several other restaurants and none have paralleled my experience here."}
{"text":"On of the best meals I have ever had. The duck fat fries and foie gras were delicious!"}
{"text":"Absolutely delicious. I've heard great things about this place so I was very excited to try it out! Very cute spot with outdoor seating. Wasn't too busy as I went around 6pm on a Tuesday. I had a glass of rosé, the poutine with foie gras, and the wagyu. Basically the perfect meal.... :) Everything was delicious. Usually with poutine majority of the fries get soggy from the gravy but these ones stayed perfectly crisp. Also side note the cheese curds were fried. The wagyu was super juicy and fatty... and was perfectly medium rare. The lentils it came with were very buttery and extremely flavorful. Probably one of my favorite restaurants in Madison. Will definitely be back."}
{"text":"Hands down my favorite restaurant in Madison. The drink selection is amazing, the service is wonderful & the chef is often in the dining room chatting with the customers. I always spend more than I need to because the menu variety and flavors make it hard to decide! Go there & share... one of everything!"}
{"text":"I realize yet another five star review for APIaFC might be piling on at this point, but man did these guys earn it! My wife and I went in for dinner on Monday night, which was our 7 year wedding anniversary. We've been wanting to go for months and I'm really glad we decided to finally do so. 

Drinks - 
Pinot Grigio for her (crisp, complex, very enjoyable), New Glarus Scream followed by Surly CynicAle for me. Loved the Scream, less so the CynicAle (little too sweet for this meal, but not bad). 

Snacks - 
Meatballs w/onion and bone marrow: delicious! Tender, hugely flavorful, great taste and texture from the onions.

Dates w/ chorizo and peppers: fantastic!!! The piquillo pepper sauce is the stand out star of this dish. Spicy, fragrant, great mouth feel; I'd have eaten a whole bowl of just the sauce. That being said, the other elements of the dish contribute to making the whole greater than the sum of it's parts. Fatty, smoky chorizo and sweet chewy dates work great together. 

Small Plates -
Burrata: really nice. The very best bites were those with a bit of the onion, mostly because these brought in a touch of saltiness that the rest of the dish strongly benefited from. 

Pork belly w/ shrimp: really nice! Perfect textures in this dish, and the shrimp head is the real star. The belly was cooked perfectly; tender but not at all chewy. 

Octopus w/ testa and potatoes: PERFECT! The dish of the night by FAR! Better than any other surf and turf I've ever had. The testa (head cheese) comes as a thin slice fried to perfection. Rich, robust, and incredibly meaty with each small bite. The herb and citrus pair the potatoes to both the octopus and the testa immaculately. Every bite was better than the last, and the mole took the whole thing over the top. An absolute favorite! 

Large Plate -
Scallops: great flavors. Loved the squash blossom pancakes each large scallop arrived on, and three scallops was a nice sized order at this point in the meal. The only minor complaint was that the scallops could have used a touch harder sear to both enhance their flavor and add a bit more texture. This dish would have benefited hugely from a bit of crunch. 

Dessert -
Sfingi - excellent closer. The key to the whole dish is the fact that they're not too sweet. Great balance of flavors (especially the rich chocolate cut slightly by citric acid from the orange), and a really fun way to close a great meal. They arrived piping hot, so be careful! 

Ambiance was great, and service was attentive without being overbearing. Probably not in our price range for regular rotation, but will be tough to beat for ANY sort of celebration or special occasion. Thank you guys so much for a remarkably good meal!"}
{"text":"Everything was great, but the chorizo stuffed dates were an epiphany. You HAVE to get them. The octopus and the pork belly were also stellar. Needless to say, I will be back. Hopefully very soon."}
{"text":"I actually went here a year ago, but recently started writing reviews. I remembered this place being one of my favorite meals of all time, and I had to share. I specifically remember the poutine and wagyu beef being amazing!!! The flavors so rich is was all very well worth the price. I remember I ordered some other dishes along with this, but these two were the most memorable for me."}
{"text":"We chose this restaurant because the chef was recognized as a rising chef by the James Beard Foundation, and it was not a mistake.  The restaurant is in a funky neighborhood in Madison, away from the circle around the Capital, in more of a warehouse district.  Inside it reminded me quite a lot of The Purple Pig in Chicago, with high tables that are solidly built.  Diners are perched on bar height chairs and you share a table with other diners.  We were a group of five, so they put one of us at the head of the table, and it worked out beautifully.


Now to the food--there are small plates, appetizer plates, and larger portions, and we shared a mixture of them all.  The French Fries fried in duck fat was my favorite, but others at my table favored the poutine, which was the aforementioned fires covered with gravy, with some fried cheese curds and some fois gras for those who didn't think the dish was quite rich enough. They do make things that are fired exceptionally well, but the porchetta with mashed potatoes was stunning as well.  They have a lovely selection of Wisconsin microbrewery beers to go along with the fabulous food, and I would highly recommend this place."}
{"text":"6/28/2017 Update. Back from last time. This place is still an all time fav when in Madison. You need the rib eye! They had this porkloin that was amazing. Ordered 80% of menu items and all were off the chain. Come here!

This place is amazing! We had pretty much 14 choices of 20 in the menu. Great beer and good food. The wagyu ribeye is a must! Squash blossoms are great, pork belly awesome, rabbit rillete...."}
{"text":"Absolutely fantastic place. The wine list is very good and the presentation of the dishes was great. I was very hesitant to go there because when I called the place, they said the did not take reservations so that took me by surprise. Now, I understand why they don't take reservations since it is a very small place and they have basically communal tables. It is kind of like a tapas style type of place but they do offer large entrees as well.
The duck fat fries are a MUST try (I assume they are always on the menu but you you may want to check). I'm unsure how often the menu changes but  have a feeling that it is at least weekly.
I fully recommend this place for a fun experience and a reasonable option for fine dining."}
{"text":"A hidden gem and has a great atmosphere! A small intimate setting with a unique menu. I would suggest making a reservation. 

We tried so many different small plates and each one was delicious. Our favorite was the beet salad and the fried octopus. We were hesitant ordering the octopus because we didn't think a small restaurant in the middle of WI would really know how to cook it... And we were wrong! It was by far the best fried octopus we've had so far in the US. 

This is a restaurant I would highly recommend to anyone that wants to enjoy a unique dinner experience."}
{"text":"Awesome overall dining experience. The cozy interior was pleasant and clean.  The waitstaff was very attentive and helpful and dishes were all unique and delicious. There were four of us, and we ordered 
Snacks:
1. Duck Fat Fries/ parmigiano reggiano/ garlic aioli
2. Dates/ chorizo/ piquillo peppers
Small Plates:
3. Pork Belly/ sweet potato/ apples/ sunflower/ almonds/ balsamic
4. Mussels/ crazy water/ leek/ spinach/ chilies/ toast
Large Plates:
5. Wagyu Beef (mushrooms, not sure what else, but different that currently shown on their internet menu)
Desserts:
6. Sicilian Sfingi/ chocolate/ orange
7. Panna Cotta/ orange/ brandy/ cherry/ shortbread

The highlight of the meal for me were the Duck Fat Fries. I just couldn't imagine a french fry could taste so amazing. My dining companions liked the dates, but I wouldn't chose them on a return visit. The Pork Belly was the most delicious meat that I have ever had in my mouth and went so well with its accompaniments. The Mussels were plentiful and very nice--with a delightful mild flavor. The Wagyu Beef was very nice but seemed like a less special preparation than the small plates. 

The Sfingi were delicious donut holes and we thought  they were much tastier than the Panna Cotta, which had a wonderful smooth consistency but didn't have much flavor.

With wine and tip the meal was about $155 for 4, which I felt was reasonable for the dining experience. I'm definitely planing to return. We went at 5:45 pm on a Saturday night, and there was plenty of communal seating, but the two tops were mostly filled. By 6:15 the place was packed, but when we left at 7:30 there was plenty of communal seating again. So if you don't like to wait for a table, I'd advise going early or late. I always prefer to go somewhere where I know I have a reservation, but I realize the difficulty of offering reservations in a place like this, where it is very variable how many courses a table will order and where the bulk of the seating is communal."}
{"text":"Visited on a Saturday Night and had to wait for our table.  Ordered the Whiskey Flight and Duck Fat Fries, WoW!  Shared several plates and thought they were all GREAT, but the Foie Gras was to die for.  Our son thought it would be a lovely first date place to take a very special lady, we agree."}
{"text":"Great new place. Been there twice and loved all dishes. My fav was sardines! Not so great for vegetarians but great fish dishes along with awesome meat based selections. Prices very reasonable for the quality of food presented."}
{"text":"Wow, wow, wow! You can tell that each and every dish is the result of a real chef that CARES about being creative, unique, and innovative with the food that his restaurant produces. 

It's restaurants like A Pig in a Fur Coat that have made me crave and love local businesses and shudder at chains. There is so much passion and thought oozing form every duck fat laden dish!"}
{"text":"A pig in a fur coat was amazing.  I went with a group of 5; we arrived right at 5pm and were the first people in the dining room, although within 25 minutes the room was full.  If you'd like to go here, I would suggest arriving before 5:30 or after 9pm (the chef told us that 9pm is about the best time to come).  We had a fantastic and leisurely meal, leaving around 7:50.  There were lots of people waiting by 7pm, and the room was growing loud but not unbearably so. 

I thought the price was more than reasonable for the quality and amount of food we got.  We shared the charcuterie & cheese platter (came with bread, sausage, jamon, pork cheek, quail egg, mustard, blue cheese w/honey, and some really funky and delicious sheepsmilk cheese, althoug I would expect the board to change with availability), arancini, duck fat fries, ravioli, pork belly, venison ribs, beets, & poutine, & finished with the Sfingi & bread pudding.  I think we ended up with 1 bottle (maybe $36?  wine ranged from I think about $25-99/bottle and about a third of the list is available by the glass) & 3 glasses of wine, 1 beer, and then after-dinner coffees/espressos/hot chocolates, and were right under $50/person before tip.  

When I go back (*if* is not a question), I will probably skip the fries (blasphemy to some, I'm sure, but after the poutine maybe I was fry-overloaded), but will be most tempted to order the ravioli and arancini again.  Everything was fantastic, though. The dishes are really well put together-- always something surprising, and uniformly delicious. All food comes out as it's prepared. We intentionally took it slow and only ordered a few plates at a time, which the waitress told us was fine (especially since we arrived relatively early). 

Everyone we interacted with was very helpful and friendly. The space is sparsely decorated but welcoming.  This place is a gem."}
{"text":"The food wasn't that great but the service was decent.  Not worth the price."}
{"text":"Great dining experience! Fun place to try new things and share with others in your party. The Charcuterie and Cheese Platter was a great sampler of unique items and the Duck Fat Fries were without a doubt the best fries I've ever had! The rabbit was great as well as the scallops. Service was excellent and the speed at which the food came out was pretty incredible for how busy they were. Top notch and bill was very reasonable for the meal we had."}
{"text":"I came here for my farewell dinner with coworkers, and wow was it great. Our host arrived early to make sure we were able to get a table. 
 After all of the party arrived we ordered one of everything on the menu, there was five of us and we devoured everything. 

Some standouts were the duck fat fries, pork belly, scallops, octopus, dates, rabbit, and the ricotta doughnuts. 

Service was very good, he suggested a great wine for me that paired with a lot of the courses. 

Chef stopped by the table and made sure everything was great. 

IMHO best restaurant in Madison!"}
{"text":"Almost perfect.  Attentive service, great atmosphere, and creative menu.  The only thing that I think fell short was the preparation in food.  It could be preference or perhaps an unusual fluke, but I just felt that the food fell one step behind perfect.  Due to this, most of the dishes weren't as memorable as I wanted them to be.   I did order  dishes with ingredients that I am familiar with cooking with, so I would like to say that I know the potential for flavors.  The dishes I ordered are listed below.  

Duck Fat Fries/ parmigiano reggiano/ garlic aioli
Octopus/ garbanzo/ greens/ olives/ piquillo
Wagyu Beef/ bone marrow/ potato/ onion/
mushroom/ oxtail
Ravioli/ egg yolk/ bacon/ ricotta/ brown butter/ swiss chard
Cheesecake/ peach/ brandy/ graham cracker

The duck fat fries were amazing.  I would say this was the one dish that I might have dreams about.  The octopus had a lot of potential.  I  would have preferred it to just be braised.  I think it was taken a step further and grilled.  Maybe grilled too long?  The grilling took away from the flavor. The Wagyu Beef was good, but was not as flavorful as I expected.  Perhaps under seasoned?  The Ravioli and cheese cake was good but didn't sparkle.  Overall it was good.  

My little nit picking might be due to the fact that I had visited Forequarter the night before.  I felt the restaurants were very similar, but I think Forequarter exemplified perfection at all level.  The concepts were similar, but I believe Forequarter had a better menu and execution of the food."}
{"text":"Great decor with PP Reuben's style portrait of a pig behind the bar. A minimalist menu and understated ambiance. Service is second to none. Did I love all the dishes? No. The tortellini with egg and Brussel sprouts was fine but the brown butter it came with did it no service. The lamb carpaccio was great and my wife loved the scallops. Not an inexpensive meal by any measure but not regrettable either. Great cocktails and a decent wine selection. All in all we enjoyed ourselves and so will you."}
{"text":"One of my favorite restaurants in Madison. Always get the stuffed dates. They're perfect. All of the specials that I've gotten were on point and you always feel like you are getting a good value with their portions.

Plan ahead though, it's a tiny restaurant and fills up quickly."}
{"text":"My fiancé and I came here last Friday at around 9pm and didn't have to wait for a table. Once we were seated, we each ordered a glass of wine: the Malbec and Tempranillo. We really like red wine, and both were yummy. As for food, we ordered the dates, poutine, pork belly & ravioli. Everything was satisfactory, but nothing \"blew us away\" or wowed us. We always look for small plate style restaurants when going out to eat, and this menu seemed very predictable...especially after living in Chicago for 4 years. For dessert we ordered the bread pudding and panna cotta, and these were probably the highlight of the meal! I love when restaurants make pandoro bread pudding (it's my favorite type of dessert). Overall, I wouldn't go back, but I think it's worth it to try it for yourself."}
{"text":"Good food, great atmosphere. Service is awesome and fast. Taste is definitely top tier in Madison. 

What is missing for a five star? Imho, it is a killer entree. Most menu items are great food, however, I have not yet identified a \"super\" dish to order for now."}
{"text":"For me, poutine doesn't get any better.  I'd love to eat the foie gras from the poutine on it's own, let alone the phenomenal cheese curds.  Ravioli and pork belly dishes were great as well!  The only dish I had that could've used some was the octopus.  I wasn't expecting it to be so heavy, and neither the mole nor the potato made sense to me.  I would like to look at your menu and know what my lighter options are.  That being said, I am already looking forward to going back and trying other dishes.  Great ambiance, great food, and I had a great mixed drink although I can't remember what it's called.  Not to mention the best service, which may be expected at the slow hour I was there but the constant replacing of silverware and plates between courses was much appreciated."}
{"text":"If you are in the Madison area you must try this restaurant. Only open for dinner. A few seasonal items on the menu. Nice wine list. Italian fare that is more fusion and it is simply amazing. Family style but great for couples. They are currently expanding and will be closed part of April. For starters we had the poutine. Foie gras, deep fried cheese curds and poutine sauce over nicely fried French fries. Amazing poutine flavor and a very rich taste. We then went to a small plate of lamb carpaccio. Again, just amazing!  Thinly sliced lamb with corn shoots, salsa verde that provided a nice little kick, and an egg yoke. 4 toasted bread slices. A nice compliment to the poutine. We finished with a main course of porchetta. For me it is a comfort dish. Pork roast over truffled potato with root vegetables (parsnips and carrots). The sauce was reduction with maple syrup. Just amazing again. Compliments to the chef, owner and staff. Our waiter was wonderful and knowledgable. The atmosphere was warm and cozy. Seating for about 50 which is why they are expanding. I will come back here again."}
{"text":"Okay, so this place only has 309 reviews, which is weird, because I'm fairly certain that more than 309 people live in the Madison area. WHY HAVE YOU NOT ALL BEEN HERE YET??

This was the single most delightful dining experience I've had in quite a few years. Our server was amazing, and helpful. We started off with the duck fat fries, and all I could think of is how I wanted to keep stuffing them in my mouth until I died. They are SO GOOD. I could have just had those and been perfectly happy. But we didn't stop there, noooooo.

We moved on to the ravioli. The ravioli wasn't really my thing, but it was good. The brussels sprouts tho. They were caramelized and amazing. Everything in the dish worked really well together.
Next, we had the scallops because I am a sucker for scallops. And they were delicious. Salty and amazing with the sweetness of the butternut squash and balsamic. 
We were debating on getting another plate or dessert, and our server recommended the foie gras, saying that it was sweet but not overly so. And when I tasted it I decided that I was going to leave everything to him in my will.

OMIGAWD YAAAAS KWEEEEEN! This dish was so amazing. I loved everything about it. The warm crispy little bombolini, the fig, and the mouse. THE MOUSSE.  First you taste the sweetness of the fig, then the bombolini, and then the salty rich mousse melts in your mouth, making your life better than you ever thought it could be.

I loved every second of my dinner, and I think you will, too."}
{"text":"Place is bombolini! I had the pork belly, ravioli, octopus, olives, and foie gras mousse, all of which were top noch. The ravioli was one big ravioli with a runny duck egg inside. That oozed out when you cut down the middle. The octopus was the best I've had and tasted. Like a steak. I finished on the foie gras and it had donuts, fig jam and lardo, making it the perfect sweet ending... This chef knows what he's doing!"}
{"text":"Went a while back for my birthday with four friends.... Great place for group because you can try more items.  So we tried virtually every app, the egg was the best and fries were okay when compared to the egg.  Elk ribs were outstanding and grits below I still dream about.  Wine was plentiful. Desserts were good but over shadowed by the rest of the meals highlights!"}
{"text":"This was our kind of place. Small and homey with good food. The meatballs were ok. The veal tagliatelle was phenomenal. It was pulled veal with a crisp exterior instead of ground veal, which is what I was expecting. The pork belly with shrimp was tasty. The porchetta was melt in your mouth. Wished there was more veggies to balance out the meat though. Service was friendly and we never felt rushed."}
{"text":"An impressive meal to say the least! I was quite fond of the small plate, communal dining ordeal at A Pig In a Fur Coat. It's the perfect place for sharing so you can try out a bunch of their dishes. The amazing part is the portions. While you'd expect downscaled amounts of food, most dishes provide a hearty serving. 

Lucky for us, we visited with the perfect dining companion, a fellow yelper who happened to be in town and knows his stuff in terms of hunting down quality food. We made sure to order a medley of dishes, featuring everything from octopus to plenty of foie gras.

Here's what we tried:
-Rabbit Rillette with pistachio, pickled cherries 
-Foie Gras Mousse with profitteroles, lardo, fig
-Poutine with foie gras, cheese curds, poutine sauce 
-Ravioli with duck egg, bacon, ricotta, Brussels sprouts, brown butter
-Octopus with mussels, clams, swiss chard, crazy water, leeks
-Porchetta with potato, Anaheim pepper, 'nduja, almond
-Guinea Fowl with chorizo, fregola, summer squash, bacon, leeks, feta
-Sicilian Sfingi with chocolate, orange 

While every item was delicious, the poutine, porchetta, and guinea fowl were stand outs. 

Poutine has been sprouting up on menus right and left these days and I'm always inclined to test it out. Luckily, we gave this poutine a shot because it was heaven. The already rich dish is supplemented with a nice helping of fatty foie gras, which compliments the cheese-gravy medley perfectly. Each ingredient is intense on its own, but they surprisingly are not overwhelming when combined in this dish. Equally represented and equally flavorful, the fries, cheese curds, sauce, and foie gras are incredible and make for a cohesive, memorable dish. 

The porchetta and guinea fowl were both served as rather large entrée portions, but were easily polished off. The meats alone were quality and the other components of the dish were similarly beautiful. Their menu may rotate frequently, but the restaurant has shown their expertise in pairing delicious flavors together so each future dish is sure to be fantastic.

I really haven't found a better plate of poutine yet. The craving for that cheesy plate of goodness is hitting pretty hard right now. Definitely need some of that in my life reaaal soon."}
{"text":"Great place.  Love the setting and the interior.  Communal tables are fun.  There isn't a ton of tables though.  

Favorites: Dates, Ravioli, pappardelle, Porchetta and Pork Belly.

Good but not great: Squash blossoms, dates, grilled octopus

Meh:  Octupus ceviche

Solid place to go and another great alternative for high end, casual dining, which is they way it should be done."}
{"text":"I'm so glad to have discovered this restaurant during my trip to Madison! 

First, the ambiance was lovely. It was tastefully decorated - with art by local artists, rich colored walls, and what seemed like handmade beautiful furniture. It felt warm and welcoming, especially contrasting the cold, damp air outside.

We sat at the bar because there was a bit of a wait to get a table. The bartenders were super helpful as we navigated the menu. They even brought out the chef to go over the menu with us. The service was very friendly!

The chef was incredibly accommodating to food allergies. He let us know what he could do and ensured us that he'd make modifications that would not only be accommodating but also be delicious - and he did superb! 

We ordered the beet salad, which was served with roasted red and yellow beets, yellow carrots, pistachios, balsamic glaze, sprouts, and corn shoots. The corn shoots were a fine garnish, and made for a great presentation. I loved the roasted beets with the pistachios. I didn't care for the yellow carrots. They had a bit of a vinegar flavor, which usually I would like, but I didn't care for it alongside the other flavors and textures.

Our next dish was the octopus, testa, over mole. The chef prepared the octopus baked versus fried, and it was delicious! Testa is the head of a pig...it was prepared mashed over the mole and underneath the octopus. The combination of flavor from the mole, testa, and octopus was spot on. 

For our main dish we shared the scallops - served with pork belly, over a carrot purée, with green beans, roasted fennel and onions, and some balsamic. The scallops were perfectly cooked, and the combination of flavor with the pork belly was delicious.

I don't eat a ton of pork, but the pork additions to the recipes here were great compliments with the other flavors. We left feeling satisfied and enjoyed trying the local farm fresh ingredients. 

I highly recommend this restaurant if you like local food, unique flavors, and whether or not you have dietary restrictions or not. They handle allergies really well, and this place is great for farm to table, pales, gluten-free dining. May be hard for vegetarians, but that beet salad is a nice dish suitable for vegetarians. And they had some pasta dishes too. Check it out!"}
{"text":"One of the best dinner experiences in Madison!!! 

What you need to know:
1. Go HUNGRY
2. Definitely go with at least another person that you can share food with (so you can SAMPLE more which = ENJOYING more. You will thank me later)
3. great beer selection (we had the tyranena dirty old man--- oooh, soo smooth and good)
4. Arancini (perfect perfect perfect! Wish we could have had more!)
5. Duck fat fries (need I say more? You got to try it. They don't have ketchup- but ask for it and instead you will get something way better! The chef whipped up a red pepper dipping sauce in SECONDS!)
6. Rabbit rilette (hubby and I didn't know what it was- ordered it anyway and googled it after eating half of it). Just eat it. Enjoy it... WOW!
7. Quail: hubby said \"this is sex on a plate!\" it was really that good!
8. Agnolotti: perfectly cooked- amazing-- melt in your mouth, oooh-  yum!!! 
9. Didn't eat dessert- please see number 1. We ate too much. Will DEFINITELY be going back!!! 
10. Great place to wow someone and make them feel special!"}
{"text":"Pig in a Fur Coat can be good, as long as it's what you're looking for. When most people think of tapas in Madison, they think of something a little different and less \"gourmet\" (for lack of a better word) than Pig in a Fur Coat is doing - and that's not a bad thing. But the kind of fare you'll get here is different than a place like Icon.

I've had the duck far fries (superb), the burrata with tomatoes (again, superb, and a great light dish), the pork belly (great, but could have used a little more acid) a bite of the octopus (I can understand people liking it, but I'm not a fan of octopus generally), and the lamb carpaccio (a bit oily, but I haven't had enough carpaccio to compare it to much else).

Service here is hit and miss. I've been on a day when my waiter gave recommendations on beer and on food, and he was great about helping us pace our leisurely meal well. I've also been when my waitress just said \"Oh, everything's good!\" (that's not helpful when you're asking for a recommendation).

Overall, my experience here has been good. I love their long tables, as they can accommodate large groups or throw together smaller groups. They also have tables for 2, and make a good date night location."}
{"text":"The DUCK FAT FRIES nailed it. This place is like a hole jn the wall from the outside but pretty fancy inside. Get the lamb carpaccio too!"}
{"text":"Excellent everything!! Be sure to bring a few people and share plates so u can experience more of what they have to offer! Excellent wine list and great service! The inside decor is also very up to date yet classy! Will definitely be back here probably once a month!"}
{"text":"I get it...Tuesday night, winter storm brewing- no one wants to be working but at least go thru the motions! Made reservations (for the practically empty restaurant) at a later time thinking the place would be packed but there were only three other groups of diners there- food was great except for one burnt meatball- noticeably blacker than the other brown two-also if you're doing shared plates and there are only 3 pieces and four people- add the fourth piece and charge a bit more so everyone gets one instead of having to split a meatball! Inconsistent ravioli- one order beautifully plated, egg yolk and filling intact and beautiful strained butter sauce, second plate, egg yolk and filling exploded out of pasta, tons of black sediment in butter sauce (still tasty but hard to overlook the other diners beautiful plate compared to our obvious screwed up one ...sfingi were very tasty but a hot mess hserved in a bowl and drenched in chocolate- how about a small dish of dipping chocolate on the side or served on a platter and drizzled with chocolate! Wine was great- our waiter was trying but dishes served unceremoniously with barely any fanfare- here's the pork belly, here's the ravioli...hated seeing the cooks texting on their phones in the kitchen, being rushed to leave at 8:30 and having to ask for clean plates and utensils after charcuterie, rillet, meatballs and beets...come on guys! We'll be back but step it up!"}
{"text":"I usually do not eat at restaurants like these because it's not your typical menu. However, I tried about 9 different items from the menu and they all blew me away! It was absolutely amazing food! The meatballs especially!"}
{"text":"It's tough to say what kinda of cuisine this bistro serves... I'd say Wisconsin tending French. The food selection is limited but I'm guessing that's because they try to source it ethically and locally.  In any case, the food was great. The beer bottle selection is much more extensive and equally strong. I felt like they're cocktails were lacking, though. Don't skip the cheese cake if you can get it!"}
{"text":"Absolutely incredible. The small and unassuming dining room is so pleasant and has a communal dining feel. Our server was relaxed, friendly, and helpful. We approached the meal as a small plate/shared experience and all of us enjoyed absolutely every morsel and bite. We ordered a wide and full array of every section on the menu. We enjoyed rabbit, faux gras, and the most exquisite, mouth watering pork in a variety of styles. The sauces, the sides, absolutely everything was prepared with impeccable attention to detail. This meal was a completely refreshing experience that reignited a passion in my palate for such fine food. Our wine service was fabulous. Our cheesecake was served in a mason jar. Yum, yum, yum - from beginning to end. The next time I visit Madison I will most certainly go to A Pig In A Fur Coat."}
{"text":"A friend of mine had recommended this place multiple times, so I finally tried it. Probably one of the top 5 dinners I've had in Madison. It was pretty easy to get in for dinner, though there were only 2 of us and it was a weeknight. It's pretty small though, and since the several tables outside aren't usable during the winter, I would imagine it is much harder to get a table during the colder months. We were seated outside right away, and I loved the sparkling rose our waiter suggested for me.

We got the duck fat fries, ravioli, beets, scallops and pork belly. Every one of them was amazing. I pretty much never say no to beets, and these beets were fantastic. The sauce they were served with complemented them really well. The duck fat fries tasted as good as they sound. The pork belly was mouthwateringly good and is probably the dish I'd come back for. I wasn't expecting the scallops to be as good as they were, because my standards for seafood in Madison are pretty low, and this place is known for its pork (obviously).  I also ate a dish that Pig in a Fur Coat offered during the Willy Street fair, which was just roasted pork.... some of the best pork ever. It was a little paper bowl half full of really moist and flavorful pork, and half full of the fat from the belly. Both were so good, though I felt a little guilty eating literal cubes of fat."}
{"text":"If you're a foodie and love shared plates style dining, PIFC won't disappoint.  Half of the tables are community, so be prepared to share space with others.  Their craft cocktails are unique and delish.  If you go for a drink and an appetizer, the duck fat fries with garlic aioli are a must.  The menu changes often but everything we've ordered has been outstanding.  They have a great charcuterie board that never fails to impress.  They don't' take reservations and it is usually packed on a Thursday, Friday or Saturday night so be prepared to wait...but it's worth the wait for sure!"}
{"text":"Best dining experience in Madison in a long time. Four of us shared duck fries, beet salad, mussels, ravioli, octopus, porchetta, pappardelle. Put simply it was awesome. Adding to the great food was the friendly and knowledgeable staff and we could actually carry on a conversation. We will go back."}
{"text":"A bit too precious for my taste: the restaurant's self-consciousness gets in the way. The expectation is that you're supposed to be blown away, but I always feel a bit disappointed after eating at Pig in a Fur Coat. The dining room is too small and awkward. I'm not a huge fan of meat either, so perhaps you shouldn't take my opinion too seriously."}
{"text":"I visited this restaurant during my trip madison for a conference. I would like to try something special before I leave. I visited this restaurant because it has the best reviews. The environment was great, waiter was very nice and patient. To be honest, I was shocked by the quality of the food. Very special and creative, amazingly executed. I think it's a Michelin star quality restaurant with regular price. Highly recommend."}
{"text":"We have eaten here 6 or so times in the last year and have yet to have even a single misstep happen.  Great food, fun atmosphere, excellent service!  Duck fat fries, stuffed dates, pork belly, steak, rabbit, octopus and more.  It's better with at least 4 people so you can try many small, medium and large plates.  Wonderful wine and beer selection, too.  What's not to love?  I guess, if pressed for something to complain about, it would be no reservations.  Arrive early to assure a table."}
{"text":"Great food and wonderful service. We fully enjoyed the tapas style experience with another couple. The location is perfect, nestled in the heart of the Willy Street neighborhood. We also enjoyed the cozy communal seating. We will be back soon!!"}
{"text":"One if the best meals I've had in Madison thus far! Great place to go with with friends so you can get everything on the menu. Dishes are perfect for sharing. We got cheesecake for dessert and it was AMAZING. We sat at one of the shared tables, which was neat. The staff are friendly and the manger chatted with us for a while. Some people say it is expensive, but I don't think it was too bad, even with alcohol. This is definitely my choice of restaurant for special occasions!"}
{"text":"We stopped in for a late dinner this evening not really knowing what to expect. We were both very pleasantly suprised. This restaurant is simply wonderful! We started with the stuffed dates and the duck fat fries... both were great, but the dates were outstanding, the red pepper sauce was a perfect with the dates. We then tried the lamb carpaccio and the Clam and Mussel orzo.. both wonderful. The veal breast with apple cabbage and polenta was outstanding! The dining room is warm and intimate and the staff is very friendly and informative. Loved the music this evening... excellent taste in tunes!

 Madison is fast becoming a sophisticated place to dine with wonderful small locally owned establishments that keep on getting better!"}
{"text":"An anniversary dinner and a James Beard nomination (nom-nomination) finally got us to PIAFC. Two apps, three small plates, a bottle of wine and dessert. Any place that serves sardines, in this case pickled and lightly smoked, is starting on the right foot, as far as this guy is concerned. The pork rillete was very tasty once it warmed up. The grilled octopus with a spicy red sauce on chick peas was outstanding. A red beet plate with pistachio 'soil' was an excellent palette cleanser before the venison raviolis. We ended with a high-end, fancy version of donut-holes (5) with chocolate sauce. Do not miss this desert! I managed pics of almost every other dish but these almost disappeared before I regained my composure and remembered to grab a shot of the last one.

This is foodie territory. No burgers, cheese curds or Walleye here. Beautifully presented (eat with your eyes, then your mouth), intensely flavored .... good stuff. Decent, Italian-leaning wine list. Since it was an anniversary dinner, I toyed with the idea of bringing a special bottle of wine. When I queried about a corkage fee, they replied \"$25/bottle, two bottle minimum\". Why not just say, \"f*ck you, drink our wines\".  I'm still getting used to Midwest attitudes about wine and food.

A wonderful dinner. A little over a hundred bucks and worth every penny. We'll go back for the large plates soon."}
