{"text":"April you were Awsome and your service and extra mile is why we will keep coming back. Great BBQ. And nice atmosphere! Just a couple guys working late looking for good place to eat that uses our security system ADT. April you will be our next customer for RK Marketing!"}
{"text":"Walked into Piggly's, super friendly atmosphere, no wait on veterans day which was awesome. Our waitress had a friendly personality, and was  dressed appropriately. I glanced to another table where a waitress has her boobs hanging out and a tiny skirt! There was a family ordering, and I noticed the DAD staring at her boobs, in front of his wife. Extremely inappropriate, this isn't Hooters. Anyways, pulled pork sandwich was fantastic and so is their sweet tea."}
{"text":"We arrived 25 minutes before close and Justin made us feel welcome and unrushed. Great service and friendly employees. And the best brisket I've had in a long time. My husband got the ribs and loved them."}
{"text":"Just driving through town wondering where to eat and decided on Pigglys. WOW, did we get lucky! Not only the best chicken fried steak all you can eat special, but also Karaoke Night!! What a fun time, great singing and  friendly friendly people. We will be back and we'll make sure it's on a Wed.  Kudos to April, our very helpful and personable server."}
{"text":"I recently turned to pigglys smokehouse for catering my daughter surprise backyard bbq party!! Not only was it everything and more they made cotton candy bags for each child to have!!! Janine, the owner, really made this party a success by making sure everything was hot and ready!!! Hot dogs, hamburgers, pulled pork, fresh hot buns, macaroni and cheese, potato salad, chili! My guests kept going back for seconds or thirds!!! Everyone was raving about the food! I would recommend them for any catering event you may need!!! Thank you once again I couldn't have done it without you!!!!!!!"}
{"text":"I had my twenty first birthday here last night, and it was amazing! I loved the bar tender, he was very sweet and made sure all of my friends and I were taken care of. The food was fantastic, I'm in love with the chop chicken sandwich! I'm definitely coming back over and over!"}
{"text":"This restaurant is located close to my house, which was the reasoning for giving this place a shot. I ordered the all you can at ribs, which was a suggestion from our waitress. My lady ordered the chicken strips. Luckily, she doesn't eat very much so I could finish off her chicken. I didn't even ask for more ribs after the first plate of the all you can eat came. I spent ten minutes attacking the barbecue sauce drenched ribs while leaving plenty of meat on the bone. It was disappointing because there truly aren't too many things better than a well prepared rack of ribs. Unfortunately, I won't be returning to Piggly's. After, trying a classic barbecue staple that was not good, I am rather turned off from attempting another meal from Piggly's. Other than the average food, the service was great. Very personable and talkative."}
{"text":"Totally impressed! Husband and I here on business. Husband dying for barbecue and we saw this place. It looks like a kid's place, sort of. it is red and looks like a barn but then it has these sophisticated looking fire lamps in front. Anyway, we got the platter of brisket, ribs, turkey and pork. OMG! The turkey was incredible. I expected it to be dry but it was as moist as the brisket with so much flavor. The sauce was delicious, not tomatoe-y tasting like some places. The salad bar was the perfect compliment. They also have deep fried oreos and twinkies, which I was too full to try. I wish there were one of these in CO! Far better meat here than Famous Daves!"}
{"text":"This place is great!  The smell of the barbecue is enticing and everything I have eaten here has been perfect. I am just surprised that it is not too crowded, perhaps due to the other restaurants next to it. I highly recommend it, and their cream corn is really good. May have to head there tonight."}
{"text":"Went here with my wife after a movie, found it to be ok. I see a lot of great reviews for Pigglys but I'm not feeling it.  Prices were a bit on the higher side but to be fair the portion size was good. The sides seemed like they had been cooking forever, not bbq delicious forever, more like overcooked to mush forever. Won't be going back."}
{"text":"I had Southern fried chicken and smashed red potatoes. It was so delicious!  The warm corn bread was sweet and tasty. I look forward to coming again. The interior was quirky and fun."}
{"text":"Well I would like to start off by saying our waitress Lisa made our first experience a really good experience. Lisa was very knowledgable of the products and right there anytime we needed anything. Now the food, it was better than I expected. The smoke in the meats were just right, portions good and price excellent. Nothing compares to Phil's in  San Diego but that's Phil's lol. Two thumbs up Pigglys."}
{"text":"Love the salad bar. BBQ plates are a little expensive for the quality but they give a big portion. This is the same bbq you used to only be able to get from the fair. You at a picnic tables which is sort of neat. Full bar down to earth people."}
{"text":"I had been looking forward to going there.  I love a good BBQ place.  From the moment we walked in the experience was not a good one. We waited 15 minutes before anyone even asked us for our drink order and that was only after we waived someone down.  We waited 40 minutes to get our food and everything was cold. We watched our food sit in the service area for at least 10 minutes. The employees were more interested in each other than they were in delivering the dinner.  I love a good BBQ but I would not recommend this one.  Even if the food was hot I don't think I would return."}
{"text":"Tried this place for the first time tonight. Had the brisket sandwich, which was very tasty. They have wonderful lemonade. Our waitress provided excellent service. I liked the decor and how it reflects the origin of the business normally being at the fair."}
{"text":"Went here for dinner tonight. Waitress was good. Dinner was AWFUL. Ordered pulled pork and there was hardly any meat on the sandwich it was mostly skin and fat. YUCK....."}
{"text":"Found this place about a month ago. No need to go anywhere else for a real down home atmosphere or food. Very kind staff and family owned.   Food portions are very good in size, try finding that at other places these days,lol Food is cooked to perfection, each time I come in. Prices are very good and they have specials everyday. My favorites are the Smoked Prime Rib and the all you can eat Beef Ribs as well as other dishes that are too many to list. I give this place 5 stars for Food, Price, Atmosphere and our waiter Lilly! Lisa W"}
{"text":"I've been here twice. Once when it was \"pigglys at the fair\" and recently when it was \"pigglys smokehouse\". It was not too great either time. Food was very greasy both times. The only plus is it doesn't get very busy and they have happy hour every day. There are much better options in the area, but if you want some cheap drinks and maybe some appetizers without the wait then i guess it will do."}
{"text":"Don't be fooled by the newly renovated outside of this building; they tried to make it look like a more serious restaurant (complete w/a sign that states, \"Serious BBQ\"), but it is over-priced and laughable at best.  I had been here before and it was OK, because it was a novelty and one visit was late night.  Piggly's has nowhere near the quality of food found elsewhere, especially when it comes to BBQ.  (Their \"fair food\" menu and fried offerings are OK, if that's your thing.) The place was pretty dead when we came late afternoon, except for the bar area, where a major NFL play-off was airing, It took rather a long time to get our food, and the small tray of complimentary cornbread wasn't that great. By the time our food finally came, I had given up trying to find decent greens, etc. from the salad bar, and was very disappointed in the dressing there as well.  My husband's pulled pork sandwich was passable, though, as he put it, they didn't lose any money on the extremely small portion of coleslaw that came on the sandwich, and the potato salad was nothing to write home about.  I unwisely chose the prime rib special. The meat wasn't tough, but wasn't overly flavorful. The good flavor that usually comes from the fat was negated by its lukewarm-ness. The \"mashed reds\" came smothered in white gravy (not mentioned on the menu, nor alluded to by the waitress), had tough skin bits in them and were pretty bland.  Add to this that my meal continued to plague me the rest of the day and evening (something that is totally unusual for me), and you will conclude that we are not happy campers, nor will we visit this establishment again. There is a reason the parking lot wasn't busy. I don't mind paying for good food, but I hate paying a high price for bad food and its residual effects. Ugh. Shoulda stuck with soup and salad at Charleston's instead!!!"}
{"text":"Since the remodel and improved menu finally went into place things are much improved over my initial experience. the whole at the fair decor and attitude was too gimmicky lacked quality."}
{"text":"I should have known not to go in when the parking lot was packed, all the other restaurants were busy and this place was practically empty.   In my opinion the meat was on par with a cheap buffet. The brisket was not flavorful, the pulled pork was dry and I almost thought it was chicken at first. I didnt ask for bbq sauce to go with the meat but with this kind of food why does it not come with sauce automatically? My son enjoyed his burger but for $46 this was very unsatisfactory.   I'm not a snob but if my meal is being served on disposable plastic plates I don't expect it to be expensive.   The waitress was very attentive and pleasant and made sure that we always had a full drink."}
{"text":"Love coming here with my family! Corn bread is awesome as well as the service. My husband always gets the wings and loves them! The zucchini is HUGE and the dressing they come with is SO good :)"}
{"text":"OMG this place serves its famous fair food and let's face it we love fair food Put as a restaurant not so good  The food is old and dry without flavor and seasonings the service was non existing  I had to get up to find a refill on the drink to wash this down Here's what I suggest fire the management And being in a group to train these poor servers tell them that playing games on their phones may not be the best service idea I tried to send it back but could not find my server so I went to pay the check and stood at the desk for a full tan mins to pay Sad experience and I won't be back"}
{"text":"Absolutely a wonderful spot!  I drove in from San Diego tonight on business.  I headed for the Texas Roadhouse for a predictable outcome, then spotted this sleeper across the parking lot.  I was nervous because it was pretty empty on a Sunday night, but don't let that fool you........the place is GREAT!!!  It won't be empty often or for long.  The owners are the real deal and the staff is great.  The hostess was warm, sincere, and friendly.  Nancy at the bar is engaging, friendly, and professional.  Speaking of food, check out the brisket with cream corn and cowboy beans.  Next time I'm trying the prime rib on Saturdays & Sundays.  The cornbread is sin, but eat it and sing another verse of Amazing Grace.  No, I am not a friend of the owners, but I left hoping I will be someday........great folks doing a great job and their presence sets them head and shoulders above the franchise joints.  I travel thousands of miles per month.....don't miss this spot when you have business or play in Arizona!  When you travel as much as me, you want to find these spots.  I met Ted Turner at his Buffalo Grill in Atlanta a couple years ago.  This is that kind of spot.....don't miss it."}
{"text":"The chicken I order was pink and Berly had chicken it was more bones the chicken and my boyfriend ribs didn't have any flavor. Our valentine Dinner was suppose to be a Texas Roadhouse but the wait for 45 Minutes to 50 and our movie start at 920 so we decide to try this place. Sorry but I didn't like it"}
{"text":"I ordered the smoked pulled pork, slightly dry but okay. The sauce was mediocre. I asked the server which sides he suggested, he said the Mac n cheese was his favorite (not mine at allll).  He also suggested the cowboy baked beans..spicy and just okay. I ordered the Sweet Tea & after tweaking it a bit with simple syrup it was pretty good. My friend ordered the beef ribs and he would give them a 6 on a scale from 1-10. Our server was realllly nice and checked in often. He did as much as he could to please us. The food was very fast..it came within 5 minutes of ordering it, which made us raise our eyebrows.  They cater and work the fair circuits and THIS is why they are still in business.  I gave 3 stars because it was fast, it wasn't terrible and the service was great."}
{"text":"Super disappointed in typically a very accommodating restaurant. Sadly on this visit the expectations were sorely missed as the hospitality was not there. To explain my SO and I arrived from a 30 minute ride to get the (as advertised on there website) \"all you can eat ribs\". Well the website DOES NOT list any day in which this offer is not valid. When we placed our order there was some confusion as the staff themselves agreed that no date is provided so the offer appears to stand. My SO and I proceed to request the offer and the sever goes to confirm with management. Now this is where I feel things where poorly handled. The sever returned to inform us the owner will not up hold the offer THAT IS ADVERTISED on their very own website. Now if any class was shown the \"owner\" would of greeted me at the table and explained why or kept with the offer as it's false advertisement. So sadly we will not be returning, remember people your word is everything."}
{"text":"Great food! Southern style, Texas style...a little of everything. Thoroughly enjoyed the brisket and BBQ. Priced well, wait staff was efficient and attentive. Enjoyed the fun desserts...moist brisket and fried Oreos are the way to go!"}
{"text":"We came here for dessert and got the deep fried oreos, highly recommend it."}
{"text":"Very good ribs!  The 1/2 rack was more then I could eat. Cowboy beans are good. Great smoked food! My wife got to sample the catfish fry. Very good fish large serving. We will definitely come back soon!"}
{"text":"Went there for the first amd only time. Wanted to order take out. Waited over 45 minutes for tiny portions. Not worth the excessive prices. Will never go there again."}
{"text":"I've eaten here many times now and figured it's time for a review.  Here's what you need to know:  The food is very good. I would put this BBQ up against any fine BBQ establishment in the valley. My favorites are the prime rib, moist brisket, and catfish (which blows away Texas Roadhouse, yuck). I don't think you can go wrong with anything on the menu. Be sure to check out their daily specials, it's a great deal.   The servers are great and do a great job, never had a problem.   Yes, the presentation isn't the best but, I'm pretty sure this is a BBQ restaurant and if you have higher expectations for this type of joint then you are reviewing the wrong type of restaurant. Go to a good Kansas city BBQ place and see what they serve your food on.   Tl;dr  Great BBQ, great prices, great service."}
{"text":"Yum this place is good! Authentic BBQ and a wide variety on the menu. Priced super fair. Try the Piggly fair fries... I had no idea what to expect but they were so good  Pulled pork sandwich was great- relaxing atmosphere. Will be back!"}
{"text":"The food is amazing as well as the service. People talk a lot about Joe's BBQ, and as an avid BBQ lover I would pick Piggleys every time. I had the brisket and pulled pork platter and it was the best BBQ meat I've ever had, and I've had a lot. Will definitely come back again."}
{"text":"The food is terrible! My mom and sister went last week for lunch and loved it so we figured we would go for dinner. The restaurant was empty but the service was excruciatingly slow. Like 15 mins to get a beer or soda refill. We finally received the food after almost an hour and 5 of our 6 meals were cold. Not warm -- COLD!  We were so hungry by that point we took a few bites of the DRY cold Pulled pork and asked for to go boxes. What a waste of a night out with family.   Honestly the best thing about the meal was the basket of warm corn bread and butter we received while waiting for our drinks.  I will never be back -- huge disappointment!  The waitress Brittany was nice!"}
{"text":"Delicious food and a great place to bring kids! They can color on the table and even the chalkboard wall. The service is good too and usually only a small wait if any. The salad is yummy and the BBQ sauce is so good.  I highly recommend this place!"}
{"text":"This place is really pretty awful. We ended up here on Father's Day because the wait at Charlestons and Texas Road House was too long and there was no wait at Piggly's (red flag!). But we had a hungry baby so you go where you can get food the fastest.   The hostess didn't have a clue. Our server didn't show up for 15 minutes. I could hear complaints coming from every single table that surrounded us. No silver ware, no water, cold food, etc. It's June and 115 outside and people inside the restaurant are fanning themselves it's so warm. Not sure if an AC was broken, but it wasn't comfortable.   The food was really a bad impression of BBQ. We shared a combo platter and every single type of meat was dry except the brisket which was drowned in way too sugary sweet BBQ sauce. The platter was served with rolls that looked like they had just been popped out of the Pillsbury tube.   The decor is weird and confusing. Lots of Americana country trinkets (think Cracker Barrel) combined with a fair theme and amusement park rides.   Wish we would have saved our self some money and had a much better meal across the street at In n Out."}
{"text":"DH and I were enjoying the beautiful day and, as we drove by, the smell of smoking pig just pulled us in - like a magnet. Just could not pass it by......  It was lunchtime so we decided to do sandwiches and their salad bar.  The salad bar by itself would not be a good deal - the lettuce was not terribly fresh although it was a nice nix of spring and romaine. nothing too exciting on it - all the usual suspects although I have to admit, I was raised to never put the end of a cuke in a salad but apparently my mom didn't teach these guys.  but it was okay. Next time I'd go for a side and check those guys out.  They do bring you cornbread with the meal which is just weird with a sandwich but, never having met a carb I didn't like, I dove in.  I love my cornbread moist, coarse, and not too sweet.  This was pretty much everything I don't like about cornbread - sweet and more like a cake.  But that is all in the preference.  The sandwiches weren't bad.  My hubs had a pulled pork with slaw that was nicely portioned.  The slaw was creamy and fresh, not sweet, not oniony. The bun fresh and grilled.  The pork was really nicely smoked and moist - just as it should be. The price was a little high for his sandwich platter compared to other smokehouses and eateries with comparable menus.  I had smoked brisket. Moist.  with sauce on the side.  That was dang good brisket. Very nicely fatty but not overly so (I am sorry to all you lean brisket folks but seriously - brisket should not be lean, you need that fat cap to flavor it during its journey to your plate). It was shredded which is not always my preference as it can sometimes be a tough grind if you know what I mean but this was tender.  Kudos to the smokers! They had one job and they did it well!  Now that brisket sandwich was a bit more pricey.  I kind of wavered a bit on ordering - I had been out to a local microbrew earlier in the week and did their brisket.  Bout the same price but the sandwich was a bit more plentiful.  And for $2 more, I could have had a 10 oz prime rib with 2 sides - I think I chose poorly, grasshopper.  Probably that was my biggest complaint - I didn't think the sandwich was worth the price compared to others in the area.  Last item:  sauce.  Two choices: sweet or spicy.  The sweet was thin and sweet with a vinegar overtone.  The spicy was not very spicy.  So the solution for me was a mix of the two of them. Although there was no way to thicken it up.    All in all - quality was pretty decent. I think you need to shop the specials to make it worth the cost.  I can guarantee I will be back at least to try that smoked prime rib though - who needs a bevy of virgins in heaven when you can have smoked prime rib on earth?????"}
{"text":"AMAZING service and great food too!  We held a small baby shower here last month for my sister and the staff went above and beyond!  They even blew up some extra balloons for us to use as decoration without us even asking.  Our server was super attentive and took great care of us, as did everyone we encountered!  Each person at the baby shower ordered something different and everyone said that they enjoyed their meals.  I would highly recommend this restaurant!"}
{"text":"Fantastic BBQ. Meats are flavorful without drowning in sauce. Great sides  (we had the red smashed potatoes with gravy and the green beans), good cornbread (no jalapeños in it, for those who do not like spicy).  Drawbacks: Slow service (even though it was not busy) and loud music...and flies indoors Also noticed cook was eating while cooking. Pass on salad bar--fresh but plain..."}
{"text":"We went last Sunday night.  Very friendly staff.  I had the smoked turkey.  Lots of meat and it was very tasty.  My wife got the smoked chicken.  It pretty much tasted like smoke.  Not much flavor and she did not like it.  My son had the pulled pork sandwich which he really liked.  My other son had a full slab of ribs which we all sampled. Good taste to the ribs.  Coleslaw side was good.  Fries were limp and slightly greasy.  Desert was fried oreo cookies.  I didn't try them but my son liked them.  Dinner for 4 of us came to about $80 before tip.  Return factor is 75%"}
{"text":"Bunch of us went here on Saturday night, and if you know the area, were surprised that we got a seat right away! Service and the food was great, price reasonable and portions generous. We all agreed that this was a place to defiantly come back to. Something fun that they offer besides barbecue is fair food, corn dogs, deep fried twinkies and such."}
{"text":"I have gone to piggly's twice I'm not very impressed with the quality of the food. The brisket is ok the sides are just so so. It was pricey for what you get. Which is a bummer because I love to visit smaller or local owned places. There are lots of other choices in the area."}
{"text":"I went here for lunch with a friend once, she claimed it was \"better than Famous Dave's.\" I was pretty excited by that.   I order a pulled pork sandwich, macaroni and cheese, and a beverage. The meal comes out to be $15 and change. A little steep for what I was ordering, but maybe it was really good barbecue.   It wasn't.   First things first, I pulled a sizable chunk of plastic wrap out of my sandwich, first bite. I informed the waitress, she apologizes and says she'll let them know in the kitchen. She then promptly leaves, no offer to replace it. So I reserved myself to my hopefully plastic free sandwich.    The rest of the sandwich wasn't much better. There was a bunch of fat and skin(?) marbled in with the pulled pork to the point where one bite consisted of the rest of the meat coming out in almost one piece. The macaroni and cheese tastes bland and watery. But hey, the Mountain Dew tasted like Mountain Dew.   Long story short: it's not better than Famous Dave's"}
{"text":"Great food. Some of the best brisket I've ever had. Staff was friendly...but the service was terrible. Host walked us around the entire (empty) restaurant before settling on a booth next to their paper cutter (loud). Took 10 minutes to get menus, and they were up our ass to decide within 3 minutes.  Food was amazing, no question about that. Wife's bun had a hair on it though. Check was brought before meal was finished.  Favorite part was watching the whole hog get put on the smoker. However with \"I touch myself\" playing in the background, it got a little awkward.  I'll order take out in the future."}
{"text":"First time here,  had the 1/2 chicken dinner     only like $9    delish great service   live band    I would come back"}
{"text":"Huge BBQ joint with nobody eating there at 1pm on Monday afternoon. The manager was nice and friendly and offered me samples of what i requested (lean brisket and turkey). They serve turkey with cranberry aioli for some reason, but that might be a better choice than the standard sweet BBQ sauce which is good too. Both meats were excellent and it is a tough choice between the two items. Turkey was thickly sliced, yet crumbly and made for some good sandwiches. They include two slider rolls in each meat order, so you can just slap the meat on there also for a snack. The brisket was well marbled and a had a great bark and flavor. It reheated well in oven and was simply excellent.      I do believe the per pound prices for the brisket are wrong on the menu and it now $18.99 per pound, which is getting a bit up there. The turkey was about 7 bucks for 1/2 pound. You could also buy one sandwich for about $10-$11 with a side, but I think per pound is better for to-go orders. Either way, the inside is nice and roomy and the BBQ is legit, yep a shocker for Mesa."}
{"text":"The ambience and food here is a delight. It's like the fresher better side of carnival food at its best (Turkey Leg, foot long corn dog, giant beer battered onion rings, etc.) also comes with full selection of beer and selected preferred choices of liquor for happy hour prices.  The owned even came out to greet us and they have a live band on weekends!"}
{"text":"My wife and I were planning to eat at Texas Roadhouse, but we decided to try Piggly's instead. The restaurant was clean and got my mouth watering with the smell of smoked meats.  It wasn't apparent whether we should seat ourselves or if we would be seated, nor was it immediately obvious that we'd need to order at the counter.  My wife ordered the smoked chopped chicken sandwich, and I ordered the two meat platter with pulled pork and lean brisket. We were treated to some complimentary corn bread, which was fantastic. Our food was ready in a reasonable amount of time. My wife's chicken sandwich was great. The portion was generous, and the chicken was tender and bursting with tangy, smoky flavor.  I was disappointed by both the pulled pork and the lean brisket. The pork was on the dry side,  and lacked the aromatic, smoky flavor of good pulled pork. Likewise, the lean brisket was more reminiscent of a bland roast beef. It was chewy, and almost flavorless.  The staff was nice, and it seemed like a cool place, but the food quality needs improvement."}
{"text":"This place is Just OK. Went on a sunday for lunch. Ordered the turkey plate and the brisket dinner.  The sides we ordered were mac & cheese. .yum ..salad  bar..disappointing (after reading other reviews)  green beans ..yikes, greasy. They brought us yummy cornbread when we sat down but with dinner disappointing rolls? I say serve the cornbread and ditch those dinner rolls.   It was happy hour/ which equates to .50 off drinks lol. They also offer a happy hour selection of appetizers but they are just normal bar food and wew didnt try any.  So the best thing about this place are the sofa seats at the bar haha these made me laugh but they were super  compfy. Anyhow 3 stars because i think its overpriced food that was simply \"fine\"."}
{"text":"My husband and I decided to give this place a try since they offered a free veterans meal. The pla c en was clean and service was nice. We both had the chicken. The chicken itself was delicious,  not smothered in sauce. We had sauce on the side. The bbq sauce tasted like doctored up bottled sauce. We received grands biscuits it tasted like canned dough biscuits. I was excited to see homemade deserts but please do not advertise homemade deserts for using pancake mix for funnel cakes and deep frying prepackaged candys.  If you say homemade desserts I'm thinking red velvet cake from scratch and the like. I am a big deserts person and there is no way that I am wasting my calories on funnel cake or deep fried twinkies."}
{"text":"Went for dinner tonight, decided to try something new. Prices were good, and they had good weekly specials. I had the bbq pork sandwich and my friend had ribs. Our meal together was $40. The food itself was tasty and filling. Shortly after receiving our check, a GIANT (about 3 inches) cockroach came crawling down the wall next to me. I got up, called the waitress over and she continued to process our bill. Working in the restaurant business, I know that my restaurant would have given the entire meal for free if customers were disturbed by a nasty bug...we didn't even get a 10% discount...nothing. We will not be going back."}
{"text":"Went in on a Thursday, it was all you can eat beef rib night. Should of known by the missing crowd of people to turn around. There was a lady up front that greeted us and sat us down. Waiter came and took our drink order and brought us som bland cornbread with what was supposed to be honey butter (gross). We asked for the Smoked combo platter, we were told we can choose moist or lean brisket so we chose moist, it came with 4 beef ribs (I asked the waiter what kind of ribs came with the meal he said he didn't know, from a cow smh), sliced turkey and we chose chopped chicken over pulled pork. We also order the Riley cheese fries for an appetizer.   Food came out, Riley fries were nasty just tasted like the dirty oil they fried them in  Ribs were dry, turkey didn't touch it looked old, brisket was mixed in some ketchup style BBQ and still dry. So unimpressed didn't touch the chopped chicken.   Waiter came back and asked if we satisfied, I said no really unhappy with the meal. He asks if we'd like a box... Um no this was gross. So he then says he can take the plate. I would think at this point he'd run to his manager and let them know there's unhappy guest out front, but no he bring out our 50 dollar bill. So I ask for a manager then. She comes out asked what's wrong, I told her about everything, she looked like she didn't care, told us to wait her never comes back but the waiter brings out a new receipt with 20 dollars off!!! I don't think I should of paid anything but I paid, left the waiter 20% and will never return."}
{"text":"Awesome happy hour specials. Can't beat the $.59 cent wing special. Everyday during the week from like 3-7 and all day Saturday and Sunday.  I have yet to try anything that was not great. The staff is friendly and good at what they do."}
{"text":"Absolutely LOVE this place!! Just finished having their all you can eat cat fish and am impressed!! It came out quickly and was clearly freshly cooked! We've been here now twice and have left with boxes of food both times! Why? Because we are actually FULL from eating!! Best BBQ I have had in a while.! Had server Jessica this evening and her positive and friendly attitude made us feel like we were having a meal back home!! I can't wait to try out other items on their menu and am definitely happy we've found a home away from home to eat and relax at!!"}
{"text":"This place has servers that act like the walking dead.  The young guy at the front looks like he thinks he's too good for the world. The food has no favor or seasoning. The only thing good is they have an A rating for cleanliness. Not coming back and not recommended."}
{"text":"I really wanted to like this place, I hear them advertised often on a local radio station, and I like the idea. They originally started as a \"fair food\" establishment but then switched over to barbecue, which is unfortunate because I wanted to try their fair foods.  Barbecue is a really personal thing, but one quality should be present throughout: moistness. Unfortunately they failed here. I ordered a prime rib special, but it was smoked and I think that really killed a lot of the moistness. Even rare, it was dry and chewy. Some barbecue can be a little dry because you're expected to use some sauce, but prime rib shouldn't really have anything but horseradish and au jus. The green beans were really good, but the other sides were so-so.   As other reviewers have commented, we went here because Texas Roadhouse was crowded and loud, and Piggly's wasn't. There's always reason."}
{"text":"Food is good, service is good. Ambience is a little lacking. Definitely food for a relaxing day, but not so much for a family dinner.  Justin the server was fantastic, attentive and on top of everything."}
{"text":"I have to say that this is by far the best BBQ in the Valley. It's consistently great, the beer is cold and the service is good too."}
{"text":"Tried Piggly's for the first time last night and it was a very good experience.  Loved the atmosphere.  We didn't bring our kids, but the paper to draw on would have been helpful if we did.  Love that the menu was front and back, not 4 pages.  We were seated right away and our waiter Montel was very welcoming.  My arnold palmer was ok, but my girlfriend really enjoyed the adult lemonade.    Cornbread was decent enough.  Could be warmer and be a little more risen.  We ordered our entrees and I got the salad bar, which was great.  Everything was very fresh and appealing.  Smoked bacon was on point.    Entrees were the turkey leg for myself and the girlfriend the the top stack? burger.  We both ordered piggly fries which were perfect.  You could tell they were prepared in the restaurant and not oily or over seasoned.  They have two bbq sauces with I interpreted as a memphis and KC style.  Both were tasty.  The burger was one of the best burgers I have ever tasted.  The turkey leg was the best turkey leg I have ever tasted.  Really happy we decided on this place and we will be back."}
{"text":"My husband thinks it's a little above average. Maybe because I like Joes so much, I found it very average. The meat was neither tender or though, mine had a lot of fat which is nasty to me. They have a regular and spicy BBQ but the spicy is pretty mild.   Cornbread was good, salad bar was clean and fresh. If they tell you the coleslaw is like KFC,don't believe them! It has vinegar flavor which KFC does not. Mac and cheese is made with big seashell pasta it was fine but nothing special.   Service was good, front desk lady was very friendly. Cute decor. A little baffled by the combo of smooth jazz and 70s love songs but to each their own.   Summation: BBQ is a personal preference thing. For me, it's fine but not worth the calories or cost."}
{"text":"The cornbread was good, the ribs were moist and tender, the catfish portions were great but the breading was to heavy, the sides need to be reworked, they were tasteless, bland and cold. I would go back for the ribs and the cornbread only at this time."}
{"text":"Going to be honest.  We were planning to go to Texas Roadhouse, but found the 1 hour wait not very appealing and we were hungry.  We've seen this place before but always figured no crowd = not good food.  We like to live dangerously and tonight we did!  I'm very glad we disregarded the reviews and lack of a long line.  This place was amazing.  We got barbecue wings and hoggly fries and they by far have been the best combo we've had yet in the valley.  We got 6 each of BBQ, mild and the El Jeffe.  The fries are beer battered and fried to perfection and the wings were juicy, flavorful and grilled masterfully.  Justin was our server and this guy was solid.  We were honestly impressed.  Place was half full which was crazy to me.  We will definitely be coming back regularly."}
{"text":"This is the BEST BBQ any where!!  And the service is amazing as well!  I would travel even farther to eat one of their wings and brisket and smoked turkey....just a few of my favs!!!"}
{"text":"not disappointed, but similar to other local BBQ places. desert choices are fun which gives Piggly's edge... tasty but only if I'm in the area."}
{"text":"Looked interesting so I wanted to come here. Came here with my boyfriend. We split the pulled pork plate with cowboy beans, Mac and cheese, and a side of fries. The service was stupid slow. The food came lukewarm. Bad service I can forgive but cold food is just nasty. My boyfriend ordered beer before we ordered our food and it came seconds before the food. He was really upset about it. The piggly fries were the only hot food we were served, unfortunately they came in a mushy brick of fries. Just go to Tom's BBQ, it's cheaper and better."}
{"text":"Ribs with no sauce means ribs with just a little really really sweet nasty sauce on them. I wiped it off with a napkin but it still tasted like sweet sauce instead of meat. Fish fry meant nicely cooked bland fish in almost raw batter with no seasoning.   Won't be back. Can't take my boss here cause he Hates sweet sauce like I do. I don't understand why no one wants to make dry rub ribs, some people can't have sugar, some people want to taste pork not sauce.   To top it all off they were out of chicken, chicken makes them the most money on the cheapest meat, they make more money on chicken than any other product, but sorry we are out of chicken.. Thinking on it now they probably would have put sauce on the chicken if I had gotten it anyway..   The second star is for Kilt Lifter on tap.. can you say YUMMMM"}
{"text":"Delicious! They even have all you can eat beef ribs on Thursday nights, need I say more??? Portions are very generous"}
{"text":"Don't the overflowingbparking lot fool you. They're at all the other places, not here! 40 minutes from entry to entree. Come on! It's all pre-cooked (smoked). $18.99 for a two meat platter (pictured). Brisket tasted fine but as much fat as muscle. Two small slices of turkey didn't add much to the over priced platter. Turkey was moist and tasty.  Mac & cheese side wasn't even hot enough to melt the taco cheese on top. Baked potato was they only redeeming part of the meal (except for the Kiltlifter).   I've tried over and over again to give them a chance, but this is the last."}
{"text":"Love the food and the service! Anytime we're craving bbq pork, this is where we head."}
{"text":"They smoke the brisket for 14-16 hrs overnight over Almond wood and Pecan wood. Literally every single side is amazing but try to potato salad.  Creamy!  The salad bar is robust and the atmosphere screems out fun.   They get very busy so sometimes a small wait but every good BBQ joint I have been to always has one.  The owner Jenine is always around and mingling with the tables.  She is a local legend.  Very fun place for kids and adults."}
{"text":"Hosts were not very attentive and the service was slow. However the food tastes great! I would go back agin in hopes of better service."}
{"text":"We stopped in for Mother's Day yesterday bc there was no wait time.  We literally, sat at our table for 15 minutes and the only time any staff came up to us was to try and give us a tray full of food that we had not yet ordered.  We hadn't even seen anyone to get a drink order.  We were in the middle of the restaurant and watched tables get seated and even served all around us.  We ended up leaving. I was very disappointed."}
{"text":"Love this place! Very nice staff! I have pretty much tried everything on the menu, including things I don't normally eat, and like the food. They catered the lunch following my husbands funeral services last year and I appreciate the kindness, efficiency, and quality of food they provided. If you have any problems, just ask for the owner!  She's great and will make sure you are taken care of!"}
{"text":"I really wanted a beer and some food and was next to Piggly.  I ordered the Piggly beer there and Turkey dinner for takeaway. I liked the Turkey dinner as the Turkey was real smoked turkey and great. Piggly fries were ok but a little salty. Mac and cheese was alright. Beer was my favorite thing and tasted very smooth as a lager should. Overall I recommend Pigglys for a goid drink and a snack."}
{"text":"Decent BBQ touted as being \"fair food\" so everything is served on paper or plastic plates and bowls.   Our group ordered everything from a burger, chicken, ribs, salad bar (NOT all you can eat but did include homemade croutons) and prime rib. Super smokey flavor in everything but the prime rib was super fatty. The sauces were really tasty but you only have two to choose from: spicy or sweet.   We thought we would give a dessert a whirl and the birthday funnel cake was AMAZING! Funnel cake covered in ice cream, whipped cream, and strawberry preserves. Delish.   Unfortunately, we had really, really poor service. It took awhile to bring 4 drinks - three ice teas and a water. Refills were almost impossible. The restaurant was almost completely empty and we weren't told the credit card machine may not be working until AFTER we ate our meals. Fortunately, we were able to pay by card because if we needed to pay by cash that would not have been an option for a $100 bill!"}
{"text":"We decided on BBQ for dinner. We really enjoy the laid back comfortable atmosphere.  We usually get our own meal, tonight though we decided to split the 4 meat combo ( meat only) and then we added a stuffed back potato. It was more than enough food for 2 of us.  Come hungry and enjoy!!!! Must try the deep fried Oreos next time!!!"}
{"text":"I was tempted to leave and come back tomorrow, because of the sign out front stating \"smoked prime rib + 2 sides $14.99. Saturday & Sunday Only\", but I went inside anyways. I was delighted when the waiter told me that the prime rib was available today also. I immediately selected the prime rib. It was delicious. The meat was a little firmer than usual from the smoking process, but the added smoke flavor was well worth the sacrifice. I chose the cole slaw and potato salad as my 2 sides. They were also delicious."}
{"text":"greasy greasy greasy funnel cake burnt pieces and grease  i can't believe people eat here  if you want a heart attack go to the piggy place"}
{"text":"The food is good but the service was horrible! We were more than patient but it was like we were being served my kindergarten kids. The food is pricey and they serve it on paper plates! My husband ordered prime rib, and he didn't like it. They forgot eating utensils the horse radish...the to go box we asked for repeatedly and the check. They make several trips and bring nothing nor take empty plates either."}
{"text":"This place is a neat dine in picnic/cookout type feel environment. It was very nicely decorated and pretty neat. We went in and ordered the ribs brisket and turkey. Let me just say that I didn't really taste anything. More smokey than flavorful lol. I feel that it was very expensive. The portion of food was alright. I was a bit disappointed in the fact that I think the food could taste a little better. Place is pretty cool and staff is nice tho :)"}
{"text":"My husband and I tried this place for the first time. We both love barbecue and are always up for trying new places. Unfortunately this place was not worth the second chance.  While our waiter was nice once he finally came over, it took over 15 minutes before he even stopped by. And that was only after my husband got up and went looking for someone to wait on us. The place wasn't even very busy.  Once the food arrived, it was not at all impressive. He has the pulled pork, which was moist but lacking in flavor, and I had the rids. My ribs were chewy and tough. Overall not impressive."}
{"text":"We have been to 3 different BBQ places (Joe's BBQ, Dickey's & Famous Dave's) other than this in the Mesa area & this was our least favorite.  The pulled pork was dry so I had to add sauce. Unfortunately, the sauce was cold which was not appetizing. The first time I ordered the fried zucchini the coating was amazing & flavorful. They are served in long thick slices rather than thin circles. However, the second time I ordered it was not as good & I feel like the slices were too big. This used to be called Piggly's at the Fair & the theme was bright colors, etc. Now they change the facade to have black awnings & took away the \"at the Fair\" but it seems like that is the only change they have made."}
{"text":"Where to begin? First of all, we had to stand around a few minutes before getting sat in a booth. The place was not busy at all so there was no excuse for that. Once someone actually took our order, it took forever to get our drinks. Considering we ordered iced tea and sweet tea, it shouldn't take 10 minutes to get drinks. Getting our food on styrofoam and plastic plates was a little surprising especially considering that the meal wasn't exactly super cheap. I would expect it from fast food, but not a sit down casual restaurant. The food was pretty disappointing. The cornbread was kind of tough and the corn pieces in it were really chewy. The sides seemed really bland (I actually had to remind them what I had ordered because I didn't get my entire order) and my chopped bbq was just some chunks of meat swimming in a lot of bland sauce. I had to add hot bbq sauce just to make it taste like something. My husband's pork sandwich wasn't much better. He said it lacked flavor and something seemed off about it. We finally got our check (did I mention our service was horrible?) and were able to get out of there. My husband and I felt sick for the rest of the day. So we will definitely not be going back.   Oh and did I mention the hooker picking up customers at the bar? Mid afternoon on a Sunday? Classy!"}
{"text":"This is definitely NOT a smokehouse or BBQ joint I would ever recommend to anyone. It's a weird concept because they also have fair food too (funnel cakes, corn dogs, etc.) There were 4 in our party that came in on a Saturday night- it was pretty dead inside whereas all the restaurants in the surrounding areas had waits/lines out the door. There's a large smoker and BBQ pit in the middle of the restaurant and there was NOTHING going on in this area! I was scared the food had already been made and we were just going to get stuff warmed up.   Our waitress was completely clueless- whenever we asked her a question she had to bring other servers and even the bartender over to answer anything. We weren't asking anything crazy- just if they could make a Mai Tai. Even though they have a \"full bar\", 3 of the drinks requested couldn't be made because they didn't carry that specific liquor. My friend finally decides to order a shot of Jack and said the alcohol seemed \"watered down\".   Food arrives and parts of mine were cold (mac and cheese and the meats were barely warmed). I went with the 2 meat (chicken and pulled pork). During our meal, our waitress takes away the BBQ sauces to \"refill them\", even though they were more than half way full. I hardly ate my food because everything tasted re-heated and awful!!   Stay far fary away from here!"}
{"text":"My wife and I went here for a date. The atmosphere was fun but the food was average. I'm a huge brisket fan and love Mac and cheese. It honestly tasted like a fast food BBQ with a sit down kind of price. Would not recommend this place. I was hoping for it to be more then it was :/"}
{"text":"service is good,food is good.got tosee the back where they smoke the meats , people are very friendly.nice plac"}
{"text":"You can order just about anything deep fried here.  The fried oreos alone are worth the trip"}
{"text":"The food is good, the service sucked! Took forever to get our drinks, the food came out on time but the fries were cold, like they been sitting out for a while. You're better ordering it and taking it to go!"}
{"text":"Smoked pulled pork for the win. Their Mac and cheese is also good and don't get me going on the corn bread and hones butter. I love this place. Highly recommend eating here"}
{"text":"The service was horrible, literally 4-5 other families in the whole restaurant, we stood for 5 minutes before anyone paid attention to seat us, then another 25 minutes before they bothered to take our order and that was after we asked someone to take it. Food was good but seriously not worth the wait. I'd hate to see how slow they are when it's actually busy. No need to take my family there again, my 8yr son fell asleep waiting for his food."}
{"text":"The pulled pork, brisket,  cole slaw, sweet sauce &corn bread were very good. However I did not like  the cowboy baked beans."}
{"text":"This place is probably the best source of GOOD chicken wings that I can find.   Yes I said CHICKEN WINGS.  The name of the place doesn't say everything!  They have wings that are not greasy or crispy,  just meaty and good.  They have a great sauce with cilantro in it. Wings are half price on happy hours and all day Saturday.   Give them a.try.  You'll like it!"}
{"text":"We came in on a Friday night and was greeted promptly and sat down. Montel was a great server. Super friendly. We ordered the 1/2lb classic burger and a bbq pulled pork sandwich. Food was good. Burger was a lil under seasoned but it was good. The bbq pulled pork sandwich was good as well. Sauce was tasty and sweet. Their sweet ice tea is really good too! Piggly's fries were amazing. Tasted fresh. Will come again whenever we are in town."}
{"text":"The food was very good. I had the unlimited tacos, but they initial three tacos were so big that I did not ask for more.  I also had the funnel cake with strawberries.  The service was very friendly and I enjoyed my meal very much."}
{"text":"I give this restaurant a 5 star mainly for service. We just celebrated my Dad's Birthday there. There were 30 family members and Lily went above and beyond to make sure EVERYTHING and EVERYONE was taken care of. Food is good, Service is great! She put table clothes on the tables, decorated our tables, put balloons up etc. We also got to have separate checks which was awesome for a big crowd. Ask for Lily :)"}
{"text":"My experience tonight at Piggly's was extremely disappointing. I ordered a cheeseburger, onion rings and a vanilla shake, and my total came to $17. I had sticker shock for a second but I was so hungry I honestly didn't care. My husband got his brisket sandwich about 10 minutes after we ordered, but mine took over 20 minutes to come out. When it did, I realized I didn't get my shake, so I went back to the counter to ask for it. They had forgotten. I waited another 5 minutes at the counter before I gave up and sat back down. Another five minutes and the girl brought me my shake, which was full of ice crystals, like it was made with freezer-burned ice cream.  My onion rings were cold and parts of the onion tasted raw, but the most disappointing part of the meal was the cheeseburger. It tasted like it had been frozen for a long time. Completely dried out, flavorless and the entire outer edge of the patty was actually hardened. I never spit out food, especially as hungry as I was but I just couldn't chew the hard pieces of the burger.  The waitress didn't ask how my food was, otherwise I would have told her the truth. I can't believe I just spent $17 plus a tip for that meal, only to come home and make myself a frozen dinner. I will not be back, and I do not recommend this place."}
{"text":"I came in for lunch on a Saturday. The decor is fun...the colors are bright..and the restaurant is open and airy. I walked up to the open doorway and the smells made my mouth water! Yummy!  I was there for 2 hours. I watched the owner, who has a broken foot, jump up to greet customers. I had not only my waiter serving me my drinks and meal, but another server would stop by as well. Great service. Great food  Great price range!"}
{"text":"We stopped in for a quick lunch before a movie.  The servers were very friendly and the food was fantastic.  We would eat here again (if we didn't live in TX)."}
{"text":"It's been a LONG time since we've walked out of a restaurant because of piss poor service at a totally unacceptable level. Tonight we walked out of Piggly's after almost waiting 20 mins or more to even be acknowledged ...tonight's service sucked. We walked across the parking lot to Chili's (!?!) and our order was taken within a handful of minutes. We won't bother trying the place again...."}
{"text":"Moist brisket was extremely good! I was very impressed! Definitely will go back for more!"}
{"text":"The food is fantastic! Being from Texas I was really missing those awesome catfish frys...until now. Piggly's has all you can eat Friday Catfish fry! They serve BIG filets of fish and a small amount of sides, (the way it should be). My hubby had the ribs and a monster baked potato with chili and cheese. The food is cooked perfectly and served nice and hot. The only reason this place is not getting 5 stars is because they do not have ham on the menu. How can you be a BBQ smokehouse with a name like Piggly's and not serve ham? Weird...but the food and BBQ sauce is amazing! We will definitely be regulars. Oh, and the price is very reasonable for what you get."}
{"text":"First off, service is lackluster. Drinks and waiter came quick but that's it. We waited a long time for our food. Finally we got our food, but NO ONE EVER came back to check on us. My beef brisket came out lukewarm n dry. Never again!! Fail! Fail! Fail!"}
{"text":"Head to Piggly's for the Best Jameson this side of the Mississippi. Ask for Baby and enjoy the ride"}
{"text":"On a whim, my wife said, \"Lets eat there!\". In some ways I'm glad she did and in others I'm not. I'm use to BBQ joints where you get your money's worth of meat. I got my with the ribs, but our Pulled Pork sandwich was probably the worst example of \"Piled High\" (straight from the menu), I've ever seen or eaten. See photo. It didn't even have half the meat compared to every other BBQ joint I've been to. That includes eateries that didn't specialize in BBQ, but still served a Pulled Pork Sandwich. And it was served with no Slaw like the menu said. Had to ask. Half a Star right there. The meat was good, though a little dry, but nice flavor. I won't be coming back here for a sandwich. I will be coming back for the ribs. We tried the \"4 Bones\" for $8.99 (steep). So was half a rack and a whole rack. The highest prices I've seen anywhere in the valley. They had lots of meat, though the smoke bark looked more artificially red than what you would get with properly smoked ribs. They did taste very good and I'll be eating more of those. We also had the Fried Zucchini. Simply Wonderful. Huge strips with a nice lite sauce for dipping. So many they were my dinner the next night. I'd say go try the Ribs and skip the sandwiches until they start putting on some real meat. Try some other items on the menu. We will on our next visit."}
{"text":"Cute place but the ribs were super fatty! Ugh On plastic plates with plastic forks, hard to eat with. Hubby had the smoked prime rib, dry but tasty. The cornbread was yummy!"}
{"text":"Texas BBQ!!!!! YES!!!!!  The food was on point. The ribs were great without sauce. The brisket was moist and the both had a great rub. The service was helpful and polite. I will definitely be back with friends for them to try it out."}
{"text":"The Piggly's BBQ place has very good brisket, pulled pork and ribs. I especially liked the ribs because they were properly wet and seasoned. The zuccini appetizer stellar-- but it's HUGE! Only get one for the whole family.  Prices were on par with the huge portions, although you will end up with leftovers in most situations. I'd definitely return. The prices were a bit high, so I'd likely only go with my wife, as it could get expensive for the whole family. Staff was wonderful and helpful."}
{"text":"This place has really good food.  There's something that everyone in my family can enjoy, which is nice since we have some picky eaters.  Everything that we ordered was delicious and we had a fun time here."}
{"text":"We went here for our first time on a Friday night at 9pm. Yeah way too late to be eating dinner but we ate a lot. Our server Justin was very good at recommendations and of course we had to try it all - except I ran out of room for dessert, will have to go back.  The service was excellent, ambiance is very comfortable and the food - even an hour before closing was amazingly delicious- best Mac and cheese ever! We will definitely be going back. Thank you Justin"}
{"text":"We had a very positive experience at Piggly's BBQ. Upon arriving we were immediately greeted by a friendly young man and although it was Saturday evening, there wasn't a wait (SCORE!). We were pleased to find sweet tea on the menu as well as a number of other delightful items. Everyone in our party of five was pleased with their meal (SCORE AGAIN). The restaurant itself is comfortable and well maintained with tables being bussed immediately upon a party leaving. No complaints here. Food was great. Service was good. The environment was clean and comfortable. Thumbs up all the way around!"}
{"text":"This place is awesome. A group of friends and I used to go every week to eat all you can eat beef ribs on Thursday nights and watch Thursday night football.   $20 I think for all you can eat ribs, salad, cornbread and a side.   The service is awesome and they are good at keeping up with you.   You can also get fair food like funnel cakes and deep fried twinkies etc.   Not the best for a date but great for guys night out."}
{"text":"The food is pretty good, but they seemed pretty short staffed when I went by today to pick up a to go order."}
{"text":"flys, ants, crappy food and filth. all i can say is look for it on a future episode of Bar Rescue. The staff including the owner is constantly too busy chit chatting and not paying attention to customers,  cleanliness but sure know how to drink while on the job. Not all the staff but the female owner and 1 other older female employee had been drinking for sure.  Sad that u can't get any good barbecue anywhere.  If u do find it it is here today gone tomorrow."}
{"text":"This is the 2nd time we've eaten at this establishment.  The first time we were ignored, and promised ourselves never to return.  We decided to give them another try.  We were greeted and seated very quickly.  Our waitress/bartender was courteous and prompt in getting our drink orders.  I noticed that she had 2 tables before us, and was given an additional 3 while we ate our meal.  There was maybe an additional 2 tables in the rest of the dining area.  She brought our drinks over quickly, along with the complementary cornbread.  The bread was moist, had a hint of honey to it, and had whole niblets of corn in each square.  There was also a large pat of butter on the side of the cardboard container she provided our bread in.  She also gave us roll-ups of silverware, and some paper plates to enjoy the meal.  When we finished our cornbread, the zucchini spears came out.  You could tell these spears were hand-breaded, seasoned, and then fried.  There was a hint of sea salt and black pepper to them, and they came with a slightly green tinted ranch dressing.  They were piping hot, but delicious, that I almost ate the entire basket on my own.  Our mains/entree came out 10-15 minutes later, which allowed us plenty of time to enjoy conversation at the table and the appetizer.  Our meals came on plastic plates or another cardboard platter to give that backyard BBQ feel.  My son got a corn dog with mac & cheese.  His corn dog didn't appear to be hand-dipped, but the mac & cheese appeared to be homemade.  There was melting cheddar cheese on top and some already melted cheese on the bottom mixture.  I ordered the chopped BBQ Chicken Sandwich with homemade coleslaw.  My significant other got 2 meats, salad, and coleslaw for his sides.  His appeared to come with some bread, that made his meal look like two sliders.  There are condiments on the table along with spicy and regular BBQ sauce.  The meal was delicious, and we couldn't eat everything provided.  Due to the additional seating, our waitress took some time cleaning our table, provided us with the check, and getting us our to go box.  She offered to get us a lid for the coleslaw but never provided it nor the bag to take our food home with.  When she picked up the check, we asked for these items but when she dropped off the change, she didn't bring said items.  We had to ask the waitress for assistance, and she quickly delivered.  Our meal roughly came out to $45 without dessert.  I think the serve was good, but has some room for growth.  I think the salad bar is sorely lacking in the veggies department, and variety of options."}
{"text":"First time going to dinner at Piggy's was completely worth it. While all of the chain restaurants had a 30-45 minute wait, we were sat immediately. The food is great, I loved the breading on the Catfish Fry. Normally am not a fan of alot of places potato salad, theirs was great! Definitely worth a shot!"}
{"text":"Brisket, dry over cooked Pulled pork, dry, the ends with the bark could not chew Onion rings, very good Cornbread, very good Potato salad, tastes processed out of a can Bartender, provided great service  Over priced"}
{"text":"Went for lunch on a Saturday. The special was a 10oz smoked prime with 2 sides. Also got the fried tower burger. It was good but I don't think I would get it again. The corn bread was yummy so was the piggley fries and the potato salad. Justin our waiter/bartender was really great. Lots of food so we couldn't eat dessert but we'll most definitely go back for the funnel cake!"}
{"text":"I normally do not rate places, but I was so disappointed in this place that I put some words to it. My friend and I decided to come here, and regretted it soon after. The atmosphere seemed simple but cozy so we didn't mind the table covered with a large piece of paper and crayons. We started with the Cheese Riley fries and onion rings.  The fries came battered with cheese sauce from a can and onion rings came with a cucumber dipping sauce. The fries seemed a little undercooked and flavorless without the cheese, and the onion rings needed the cucumber sauce or a dash a salt. Both were coated in a pepper looking batter but tasted bland by themselves. The waitress recommended the side Mac and Cheese, so we both got that with our smoke platter. On the smoke platter my friend got the sliced turkey, potato salad and the Mac and cheese. I got the \"moist\" brisket Mac and cheese and baked potato. The Mac and Cheese came out tan color with a faint taste of cheese flavor, watery, with a few sprinkles of real cheese.  The turkey was dry and flavorless and only tasted good when the provided BBQ sauce was added.  The potato salad was a sweet version but wasn't too bad. My Platter of \"moist\" brisket just meant marbled slices which was what I was looking for but that too had no flavor by itself and needed BBQ sauce or seasoning. The baked potato was okay, would have liked a toasty salted crust, it just same in foil with no crunch to the crust. I know smoked BBQ to be meat that can stand alone on flavorful spices and the smokiness, but this place seems to rely on dipping sauces across the board and was such a disappointment. We didn't even finish half our food, didn't try any desserts and didn't finish the beers we had ordered."}
{"text":"My first time visiting I was driving in the area saw this sign had to wait over 30 minutes when I did get my order ribs had more fat then meet poor service"}
{"text":"I had Lily as my server and she was great! She spoiled my son and was very nice. The food was great! I got the pulled pork sandwich and was more than I can finish. The restaurant is definitely worth a visit if you like BBQ food."}
{"text":"I wouldn't eat here again. I can't say it was 'bad' per se. It just wasn't good. In other words there are things that a restaurant can do that will make your visit better than other places. They don't do that here. They don't toast your hamburger bun. They bring your food on paper plates. But your knives and forks are metal, figure that one out. The server asked me what I wanted on my burger, then when my burger came without it, he said he forgot to write it down! The food is mediocre at best. Pass this place up if you have other choices."}
{"text":"bargain prices fantastic food-we like Justin and Matt as waiters......nice salad bar....really clean and awesome fried zucchini......"}
{"text":"I ordered prime rib with mash potatoes and coleslaw. The prime rib was Luke warm and not med well it was much pinker than I would have liked. Coleslaw was good mash potatoes were just ok, kinda wish I had gotten the baked potato instead. My waitress brought me out warm cornbread before my meal I was hungry so I tried it there was no taste to the cornbread. The service was good and also friendly but not a big fan of there food. I won't be spending my hard earned money there."}
{"text":"Another WONDERFUL catfish dinner tonight and great service. I have to add that the woman that owns this establishment gives it 110%. It is so sad to see hateful comments about her on this website. My husband and i visit here on a weekly basis at all different times of the day and we have NEVER seen her with a drink or drunk and if she so chooses to have a drink WHO CARES the lady is ALWAYS at the resturant working doing something everytime we are there. Maybe she needs a cold one once in awhile dont we all. People should worry about there own backyard!!! And I cant leave out the bbq hater on here. This place has fabulous bbq. Try pigglys out and see- my family and I love it. Thank you for another wonderful affordable dinner Piggly's Smokehouse!!!"}
{"text":"The food here is amazing !!! Everything I've tried has been out of this world bbq food. The prices are very reasonable compared to nearby restaurants and the staff are very friendly. They make you feel at home here. Watch out for the desert lady she'll reel ya in with a fried Oreo yummy !!!"}
{"text":"I was so busy trying to eat my turkey leg I couldn't focus on my review..had the turkey leg dinner with green beans and potato salad..oh my, although the place has changed a bit since the last time I was here, the food is still top notch tasty.  It was kind of slow last night, but the service was great.. the smoked turkey leg is like no other along with the other bbq."}
{"text":"I came here for some drinks and light dinner with a friend. We sat at the bar which was awesome! The place really has a fun feel good atmosphere!  I ordered a buffalo chicken salad and was warned it was large; but man it was a giant size! I did enjoy it though. We also had the mac and cheese which was super yummy, and they serve warm cornbread and butter when you sit down! Awesome!!  The bartender was helpful and friendly as I had never been there before so was unsure of what to order or how things worked! I would defiantly go back!"}
{"text":"Let's just say... this was the first and last time we will be spending our money here. After a long day of work on a Friday night sometimes you just want to get some yummy BBQ and go home. Well sh*t hit the fan after getting there. Husband went in to order. Was told to wait at the bar for 45 min. We ordered two two-meat combos and sides. I should have realized something was off after he handed me the bag and it felt like air. $16.99 per meal and you literally get scraps. More fat than meat with the brisket, turkey was dry as heck, the coleslaw was soggy and had a bad aftertaste. The buns are so tiny like the size of the sauce cap. Don't even get me started on the green beans and bacon (literally looked like cooked wet skin) ended giving my dogs a very expensive supper. Please don't waste your time."}
{"text":"Me and my family are visiting from California and were looking for some decent BBQ. My ribs were super hard and did not fall from the bone like most places I've been to, I asked them to put the spicy BBQ sauce and he said no, I had to put it myself. My sons mac n cheese was cold and so was my daughter's mashed potatoes, my mom hated her brisket.  My step dad said his brisket was cold and he paid extra for it for his baked potato. Maybe we are used higher quality food and maybe we are picky but this was gross. I rather go to Texas Roadhouse any day any time."}
{"text":"I used to come here all the time when they used to have more fair games and a whole roasting pig right at the front entrance. Upon my most recent visit 10/12/16 I packed an order for pick up and when I got to the counter every staff member noticed me but it took me 12 minutes for anyone to even stop by to see if I needed anything, it was only me and 4 other parties in the entire restraunt. After getting a third staff members attention finally a women named Lisa came to help me. She handed me my check and said my food would be out shortly. As I waited at the counter I can see what the cook is doing as it is an half open kitchen. I see the gentleman grab my piece of chicken and put it in my to ego box  with his bare hands and then whites his face and then continues to touch my other food items with his bare hands. I told politely told Lisa to ask the gentleman if he could put on gloves. She tells them gentleman ''She saw that you don't have gloves on so put gloves on for her'' as if that is okay. That is against health code regulations and discussing! As I still continuously waited he called me a bitch to multiple employees and as an end result there was spit in my food. This place is filthy and really needs some proper management. I will NEVERRRRRRRRRRR BE BACK."}
{"text":"My husband and I went here one Saturday night and it was empty (should've known)  However, the servers and all workers were very nice- although the actual service was average at best. We ordered brisket, pulled pork, and prime rib. Everything was dry except the brisket. The BBQ sauce was average- not good or bad. The sweet tea was good but the server never put ice in the tea so it was luke warm. The Mac and cheese was good. The cream corn was gross. Overall, I wouldn't go back. We spent way to much money for a below average meal. ($50)"}
{"text":"I stopped in this place during a trip to Mesa. The initial service was a little slow with the seating but after that everything was great. I tried the sampler meat platter with the baby back ribs pulled pork turkey and brisket. My favorite was the brisket it melted in your mouth but the rest of the meats were very good. The only negative comment would be about the ribs the meat was a little chewy but the flavor was excellent. By far the brisket was my favorite. Definitely a place to visit if you're in the area."}
{"text":"The food was mighty tasty and the service was decent, but my rating of 3 comes from presentation.  The corn bread, again tasty, but was served in a paper boat with a cheap flimsy plastic knife.  My dinner was served on plastic plate as well.    If I wanted to eat off of disposables, I would have went camping.  I wouldn't even care about the disposables if the price reflected such. But when menu prices are equal to a tablecloth and cloth napkin restaurant then that's what is expected.    This place used to be Pizzeria Uno, so surely there are dishwashing capabilities.  The only 'real' service ware was the knife and fork for dinner but they were also very flimsy, cheap, and SAMs Club quality.    This place was fine for me to come to. But I certainly wouldn't bring family or friends here if I wanted to impress them with what  Arizona has to offer."}
{"text":"Where do I start, we showed up and there was no hostess to greet is. About 5-10 minutes passed and the hostess took our name \"Jeff party of 4\". We stepped outside to wait when 30 seconds later the hostess asked us if we were \"Lao party of 4\" we had to remind her who we were. After about 15 minute wait we were seated after reminding the hostess we asked for a booth and that we did not want to seat by the open outside door. Once seated we reviewed the menu and I noticed how expensive the food was so we were expecting some really good BBQ. I ordered the 2 meat platter for $16.99 and my wife ordered the half rack of ribs for $15.99. Once the food arrived I was truly disappointed,  the food was served on paper plates like the ones I would get at the grocery store. My 2 meat platter had a ice cream scoop of brisket and a scoop of pulled pork, so I proceeded to try my meal and the meat was stone cold, I looked over at my wife and her ribs were stone cold as well. We told the waitress and she took the food back to be re-made, When she finally returned with the two plates it was obvious the has used a microwave to reheat our food. At this point the food was not worth eating the outside was super hot and the middle was still cold in the middle and no longer worthy to eat. Please remember the price. REMEMBER 2 meat platter with 2 sides: $16.99, 1/2 rack of ribs with 2 sides $15.99. Portions were small, over priced, and COLD. Avoid this place unless just want to throw your money away. The only positive of this dining experience is the didn't charge us for the unacceptable food."}
{"text":"The food was great but the portions were not worth the money. We sat at the bar and it wasn't that busy. The service was terrible and our male bartender was not engaging. We had to ask for our bread 3 times which was supposed to come with our meal and we ended up eating it as dessert. We stopped at the bathroom on the way out and it was disgusting. The restuarant itself was not as clean as it could have been. I wish we had a better experience since the food was super tasty. We will not return."}
{"text":"Save yourself the drive. Not! Worth! It!!! My Mom always said if you walk into a restaurant and no one is eating there, leave. Well. We didn't listen to mom. There was one table sat in the entire place. The bar had one guy. The guy working at the bar came over and sat us at a table at the bar. We saw pics on yelp and none of the food we saw on yelp we could find on the menu. We wanted to just leave. But we had already ordered sodas so we felt bad to just leave. We wanted nachos and the server recommended cheese fries and add BBQ meat. Food came and omg. They were fries that were battered and fried. Smothered in cheese. Topped with cold chopped brisket. We ate maybe five bites and were done. So greasy. $25 down the drain."}
{"text":"We are from out if town and We have come to Piggly's numerous times when it was called Piggly's At The Fair and loved it. When we saw the new name we were worried it might have changed. The menu items were still great and we will indeed come back again. Great BBQ and a variety of sides as well as kid friendly options. The Foot long corn dog! The service was especially great this time. Very friendly and helpful! Five stars for service this fine Sunday in Feb. Thanks Piggly's!"}
{"text":"Great atmosphere, I went with the Combo platter.  The brisket is excellent and moist not over salted or seasoned.    Bartender described the menu with great precision and accuracy.   This is a place you can take the most picky eater to and leave with a smile.  Vegetarians need not apply."}
{"text":"Good ribs, had the beef ribs ayce on Thursday. But for take out lol.. good smoke. Hot bbq sauce is good ! Need better happy hour drink specials :-) will be back."}
{"text":"Back at Pigglys b4 we leave town. I had come to feast on some smoked prime rib that is on special the entire month of March and found out that chicken fried steak in 3 flavors  (chicken, pork, and beef) is all you can eat for $9.99! Now how do you do that? I have now finished all 3 flavors and it is awesome! Real mashed taters topped with white gravy made this dinner 2 thumps way up!"}
{"text":"I have been looking for good fish and chips for quite a while.  I decided to try Piggly's last night. The special on Friday night was all you can eat catfish, $9.99.  (Southern style, not beer batter) The special came with two sides. One of the sides that I asked for was the salad bar. As a side you are allowed to make one trip to the salad bar. The portion of the catfish was great. I really didn't need to get a refill of the catfish. But seeing it was all you can eat I asked for one to see what size refill you get. The refill came as a single piece of fish and it was a reasonable size."}
{"text":"I've been to Pigglys about a handful of times and have tried a few menu items. The fried desserts are really good, but I feel are a little pricey for fried Oreos. The corn dog is huge and delicious, and big enough to share for a starter. I've tried the brisket and pulled pork platter, and was pleased at the amount of the flavor, tenderness, and variety of BBQ you get to choose. I've also had the salad bar each time and it's been fresh and delicious, and sometimes I just get that and a few drinks.   The last time I visited, I came with my cousin and her two kids. She had suggested Charleston's, but I thought Pigglys was more kid appropriate with the cool decor and being able to doodle up your table because they put down butcher paper. We did have a great time coloring and playing tic tac toe. I just got the salad bar and they went with the taco Tuesday special. To be honest, I didn't think the tacos looked great, but they didn't say they were horrible, either. So, I guess for unlimited tacos they were happy with what they got.   I love corn bread very much, and have had some of the best around, but Pigglys bread was a little on the dry side or maybe we got a bad batch, so I just added some sour cream and salsa to wet it up a bit.   All in all, great atmosphere, nice bartenders, decent food, and fun for the family. Thanks!"}
{"text":"Went to this little jewel of a BBQ restaurant at Stapley and 60 in Mesa and ordered a Mega Meats combo. Ribs, brisket, pulled chicken, sliced turkey and 3 rolls. No need for sides with this much protein! Brisket can be ordered lean or moist and I went with moist because there is so much more flavor and tenderness with the extra fat. Flavor was excellent on all meats and the sliced turkey came with a cranberry aioli which was magnificent! Definitely bringing the wife back here."}
{"text":"Came in for a quick bite to eat before work with my dad and he got the AYCE ribs which was 21 bucks for all you can eat beef ribs, salad bar, and 2 sides. I got the pulled pork and some zucchini sticks which was delicious! We even got 2 foot long corn dogs to-go lol can you tell we miss the fair and it's food? Anyway, the owner came over to talk to us and was wonderful! Definitely a good place if you like fair food. And Justin our server was very helpful and attentive as well :)"}
{"text":"My brother and I have been wanting to come here for a few years.  So, finally we decided to give it a try.    This established appeared very clean and organized.  Very unique decor; the \"garage doors\" in place of regular doors is interesting.  I somewhat regret not trying the \"fair food\" type snacks they offer.    I haven't had a turkey leg in a very long time!  That being said, I ordered one, to include a couple of sides.  Not impressed with most of my lunch.  My turkey leg was more so fatty than anything I've had to eat.  I'm sure there are other places to get turkey legs, like at the Arizona Renaissance Festival (always enjoyed scarfing down one of them back in the day).  The green beans were not hot... so, I'm not sure how long they sat until the waitress decided to bring the order to the table.  However, the cole slaw and cornbread was very good!    It was a slow day, so it wasn't busy during lunchtime.  Service was mediocre, and slow.  Waitress was clueless about beer on tap.  At least there was Blue Moon to wash down the fatty turkey leg!"}
{"text":"This place is right by my house and I had never tried it. A friend of mine catered a party with food from pig leave and I could not believe how good it was. So today I came in and got a pulled pork sandwich and it was unbelievable"}
{"text":"I was hesitant to come here because of the poor reviews, but I've been wanting to give it a try since they first opened.  It's very casual with paper plates and paper towels.  The complimentary cornbread was great!  My husband ordered the prime rib (Saturday special price) and said it was very good.  My son ordered the kids chicken tenders and having a bite myself, the chicken almost melted in my mouth!  I ordered the pulled pork sandwich and had a side of Mac & cheese.  Both were amazing!  They don't put any sauce on it, but have 2 varieties on the table for you to choose.  The Mac & cheese was definitely home made and was almost too cheesy!   We had a funnel cake for desert and it was out of this world!   Would definitely be back!"}
