{"text":"I love this place.  We usually go for lunch and then do a walk around the grounds.

Springtime:  we came for mother's day brunch.  It was busy but we had a reservation.  Then a nice stroll around the orchard, not apple picking season but awesome regardless ...saw apple blossoms and trilliums (Provincial flower of Ontario).   The Mother's Day menu was filling & hearty:  choice of sandwiches, soup in a cup, dessert, coffee/tea.

Summer:  Mid/August we came to pick the first apples that are in season - MELBA.  Came during a weekday, and it was so quaint and peaceful.

Will definitely come  to pick other apples."}
{"text":"In the midst of the thanksgiving hustle and bustle I needed an escape and what better place to escape to than the great outdoors of a local Apple Orchard and Farm hidden away North of King Road along Jane street. 

For those of you who've likely never heard of this spot I encourage you to look less at the stars I award but at what this place offers. Pine Farms is a great family friendly spot that you can really only get in the suburbs. Row upon row of Apple Orchards with each row labeled by the specific variety of Apple you can hope to pick. 

Given the long weekend it's natural to assume this place was going to busy, and busy was the understatement of the day. Cars pouring in and out of their tiny parking lot, people lined up with barrels of apples waiting to pay, just a nightmare for anyone with a fear of crowds... but all they way out here? Who knew? The crowds and the disorder of parking was my main gripe with this place, and I felt that the students directing traffic could have been a touch more courteous. 

If you're not a fan of foraging for your own apples you can shorten your stay by walking into their historic, cute little cabin-like farm house which is now converted into a multifaceted retail store for pretty much anything apple (or pumpkin).

Inside there is an assortment of pre-baked, baked pies, a selection of baked goodies (cookies, pastries), a cappuccino bar, a cold fridge packed floor to ceiling with home made apple-cider, hokey knick-knacks, and oh ya... apples... tons and tons of apples.

After doing a round of the retail store we grabbed a couple of cappuccinos (which were mostly milk sadly... but given the busyness of store I can understand why quality was not up to snuff) and a couple of delicious Chocolate Chunk cookies, and sat out on their rear deck to enjoy the crisp fall day! Bliss!!!!

For those who want to avoid the seasonal hustle and bustle, the store is open year round AND whats more is they have an excellent menu of hearty foods for you to enjoy (apparently their daily soups are to die for).

This place does the trick for me and it will for you as well. I look forward to updating my review when I return for a bowl of soup and some hot apple cider later this fall!"}
{"text":"We enjoyed the free entrance to Pine Farms, along with the variety of apples for picking. 

Upon arrival we parked in the general lot by the Cafe. As we walked towards the trees, I noticed other cars were driving further for \"pick-your-own.\"  I was disappointed that nobody told us where to park or greeted us when we arrived. 

Grabbed our vehicle and drove to the correct spot;  parking was limited. All of the rows are labelled and on that day, there were 5 varieties available.
Cost to pick your own was $1.85/lb.

We purchased a big of pre-picked Honeycrisp apple (5 lbs for $14).  The Cafe was busy with coffee/breakfast purchases but we didn't try anything.

The cafe was busy by the time we were finished mid-morning. We were happy to leave as the farm was getting very busy and parking over crowded. If you're planning a trip, try to arrive right at 9:00am (and hopefully you will be greeted with directions)!"}
{"text":"Wow wow wow. Just went to open up one of the two pies that I bought. These pies were made in nova Scotia. What in the fresh hell. They have the nerve to sell them for $8. I'm never going to this farm again. I'm so pissed off. My rating went from 4 to 2. 

I chose this farm because the one down the road is closed on Mondays. There is no fee to enter. You simply pick your own apples and pay by the pound. Many different varieties offered depending on the time of year. Rows upon rows of apple trees. There a rustic shop that sells pies, baked goods and random house decor. The pies are $8-9. The staff aren't very friendly but not rude. I went around lunch and it wasn't too busy however by the time we were done, many people were parking. The parking lot is small so watch for pedestrians. They also sell apples already picked and packed. There's also massive carrots, sweet potato, onions and other veggies to purchase. I would recommend this place but I'd probably check out the one down the street. I found this farm to be a little pricey. They are open 7 days a week from 9-5."}
{"text":"I've been wanting to apple pick for years! When living in NYC, it just seemed silly renting a car, paying all the tolls, just to drive north. When living in DC, all the closest orchards were at least an hr away. Finally we came to visit my husband's family in Toronto which happened to to be Apple picking season, I decided to look up a few orchards in the area - after a little research, we agreed  to check out Pine Farms Orchard. 

Unlike most orchards which charged an entry fee per person, Pine Farms did not and required no minimal purchase! As you entered, workers handed out their plastic bags and explained their pricing - $1.99 per lb for any variety/mix of apples. Every variety of Apple trees was clearly labeled; There were at least 10 varieties to pick from! 

We were allowed to eat the apples while on the field. After eating apples left and right, I finally figured out my personal fav - royal Gala. 17 lbs of loaded bags of apples, we were well on our way. 

As if sampling 10+ varieties of apples didn't fill us up, we decided to stop in at the cafe to check out their baked goods and drinks. The dining space was extremely cramped so we bought the baked goods and drinks with us instead - Apple blossom, raspberry coconut tart, butter pecan tart, white chocolate pumpkin cakes, and Apple ciders. Everything was scrumptious and definitely tasted home made! Would had been nice if we were able to warm up some of the pies/tart before devouring them however. 

Highly recommend to those looking for Apple picking orchard! Looking forward to returning if my husband and I decide to settle down in the Greater Toronto area!"}
{"text":"Pine Farms Winery & Orchard feels extremely isolated, but is close enough to the GTA to visit at any time.   I visited their Bakery and Country Cafe with my mother a few days ago, and was absolutely charmed with what I found there.

The cafe is located in the original apple grading and cold storage barn.  There is an old & large wood stove near the few tables, and they have a lovely selection of salads, sandwiches, and delicious seasonal soups.  I had a cup of potato leek soup, and a salad of brie, baby romaine, and apples, with a balsamic glaze.  I immediately regretted getting only a cup of the soup.  It was so good, I could have just had a bowl of it for my meal.  My salad was extremely fresh, with nearly an entire wedge of brie sliced up and laid on top of it.  It was costly at $14, but for the amount of brie cheese they used, I can be a but forgiving.  Many of the menu items featured apples, and other products from the farm, which truly showcased their pride, and the inventive combinations were rather enchanting.

It was a lovely lunch spot, with the sun streaming in the windows, and the smell of warm wood, spices & fresh baked goods from their bakery.  The pastries I saw in the display case looked fabulous, and are apparently baked fresh each day.

In the shop attached to the cafe, they sell pressed cider, specialty cheese, organic coffee, natural honey, maple syrup and their own gourmet jams, jellies sauces, chutney, & salad dressings.  They also sell home decor accents and the work of local artisans.  They had a super cute rolling-pin shaped tea light holder.  If only a had my own little country kitchen to put it in!  Be sure to check out the pictures I uploaded.  This is a great place for a romantic day trip or just lunch and tea with the ladies."}
{"text":"Went to this farm today to pick some apples.  We did originally go to their competition down the road but that location was too chaotic.  Therefore, we tried this location.  There was a police officer directing traffic which is really good.  Unfortunately, all the applies were already picked but we still decided to purchase some of their apples at their store.  

We purchased a bag of Honey Crisp for $33.  This is quite steep.  Other orchards around the same area were cheaper so we were shocked about the price.  We were also a little deceived.  We bought Honey Crisp and they sure were NOT Honey Crisp.  It did not taste like Honey Crisp nor did it look like Honey Crisp.  Not sure what kind of apples did we purchase.  But not impressed with their mislabeling.  I need to do better research and go to a different orchard next year."}
{"text":"Yesterday morning I was there for coffee with some friends.  I can't really comment on the orchard but I love the store front and the coffee there.  I took home an apple crisp for husband which he baked and loved."}
{"text":"Worst apple picking experience ever. The staff we encountered were rude and annoyed. We spent 10 minutes picking apples and 1.5 hours in a line of cars getting in and out.   Apple picking is supposed to be fun. This proved to be anything but and an exercise in frustration. Once you enter the loop of cars, there is no way back. We ended up picking apples while my bf stayed in the never ending line of cars. Never again."}
{"text":"This place is a hidden gem! 
The food is fresh and has that rustic, home made look and taste, their soups, salads and sandwiches are excellent and the ambiance is that of a charming Canadian country home! The jellies and preserves in the shop are very good also and make for pretty gifts.
What I enjoy most is their outdoor patio in the summer and going for a walk on the premises,( farm animals and pretty fields along the path) after a wonderful, healthy meal! 
Have visited this spot 3 times and will be sure to return!



Update October 2 2014
Well I have just dropped by and it seems they are getting too much traffic these days and their quaint homey feel is being lost as a result!

My love and I dropped by there at 3:30 pm, on the page I read open until 5 
Had looked forward to the good food and fall colours. And I had wanted to take him here for a long time...
Well it turns out the kitchen was closed ( at 3) but they still had soup, we asked for the leek potato soup, however we weren't offered to eat it in... 
It was handed to us Luke warm ( I guess microwaving it a minute longer was too much work?) and presented to us in take out coffee cups...
It felt like they wanted us out of there. Meanwhile the store was still open but we certainly didn't feel motivated or welcomed to browse.

Really?.. We drove 45 minutes to be treated like this? 
And I had spoken so highly of this place prior to this....Very disappointed!!! 
I understand the kitchen was closed but they could have heated the soup up properly and offered us bowls at the very least. 
I guess it's no longer the hidden gem it once was, popularity has affected the ambiance I fell in love with. 
Having said that the soup was tasty even though it was barely heated...
I wish they had been a little nicer since their opening times are miss leading
I'm not sure I'll be so quick to return."}
{"text":"We came in early October 2017 (a while ago) to do some apple picking before the season ended. There are a few other orchards in this area to choose from but we liked that they had a cafe that you could eat at as well. When we drove in, it was just raining earlier and you have to drive a bit uphill to get to the best apples, so we were a bit scared our car would get stuck, but it was alright. There were a lot of families with their pets picking apples, and they were clearly labelled which apples in which rows, which made it convenient if you were looking for a variety. They provide you with plastic bags in case you forget to bring your own (also out of convenience for when they weigh them as you leave). The apples were probably more expensive than at the grocery store, but you're paying for the experience more than for the apples.

The cafe/shop area was pretty small but a nice break after going apple picking. You can grab a quick drink or apple cider, or some freshly baked apple pastries to snack on. It's a nice little weekend adventure if you're looking for something different to do."}
{"text":"Great place to get apples. I'd recommend going during the week when it's apple season. Much better time and excellent food available there as well. Multiple unique jams, sauces, and condiments available and there all delicious. Eat well friends!"}
{"text":"This place has pretty good food, and the bakery items are pretty good as well. I had the soup and salad and both were quite tasty, especially the soup. The tea isn't the greatest though, and it's unfortunate that the apples aren't organic and are overpriced. I also don't get why they sell those nasty pre-made pies with questionable ingredients that are passed off as fresh/homemade when they aren't. But if you avoid those it's a pretty nice place to eat with the location probably being the best part."}
