{"text":"Can't go wrong with a brick oven pizza and a $3 glass of wine. It's become a quick favorite in our house.  -S."}
{"text":"You need to understand that the owners are French. Once you compliment them, then you get great service. \") People, stop putting down a restaurant that serves great food just because you think the owners are uppity.  If they offer a dish and don't mention the price, ASK!  Don't blame the establishment."}
{"text":"I've been here a few times.  I've tried a lot of their pizza which seems to be their specialty.  I've had pasta there - not so good.  For the 4 stars - it's all about the PIZZA!  The crust is perfect and the toppings are fresh and they don't skimp.  I've had a few salads there as well and they are pretty good too.   I've had their sangria 3 times - first time it was GREAT, the next two times it was so/so -- a bit too sweet.  Beef Carpaccio was really very good!    I'd really give it 3 1/2 stars but couldn't figure out the 1/2 star mark ... so factor that into my rating as well  : )"}
{"text":"I have to say one of the best hidden spots on the north side of Scottsdale. Wood fired pizza, crispy on the outside and chewy in the middle, served with infused oil and Parmesan.  The first time I went, I was a little confused by the counter ordering system but otherwise the service was friendly, prompt,and gracious. Rotisserie free range chicken with salad and pomme Gaufrette is a huge and delicious portion of tender, roasted poultry and can be considered a signature dish, next to the pizza. The sandwiches are good and the Nicoise salad is excellent, even if the dressing was underseasoned. Overall a great place for some post-movie munchies!"}
{"text":"I'm honestly teetering between 2 and 3 stars, but I think I've got to go with 2, because I left thinking, \"eh, it was ok, but it could have been so much better.\"  Some positives: 1. Great location for going to a movie at the Harkins theater at Scottdale 101 2. Great ambiance. 3. Attentive & clean cut waitstaff. 4. Bread made on location is a GREAT touch.  Negatives: 1. I went with a friend. I ordered the French Dip, she ordered a vegetarian pizza. My sandwich was out a full 5 minutes before her pizza. That's not acceptable in my book.  2. The French dip was over-salted, and the meat tasted slightly old.  3. The friend I was with took a bit of time to figure out what she wanted, and the guy who kept checking back to get our order was visibly irritated. I'll be honest that had I been our waiter, I'd have been a bit irritated too... but I wouldn't have shown it so blatantly.  4. There was maybe 2.5 to 3 oz of meat on my sandwich... a $13 sandwich!   5. The sandwich came with fries that were clearly frozen fries, not made on site. I can't believe they go to the trouble to make their own bread, but order in fries. What a difference that would have made if they made their own fries... or at least ordered in a better frozen brand. For roughly the same price for a sandwich at the Green House, I get MUCH better fries.  6. The side salad accompanying the sandwich was bitter. If you're using bitter greens, you need to compensate with a different (sweeter) dressing. The salad was really just \"blah\".  Because my food was sub par given the price, and the service was just not what I'd call \"A-OK\", I'm giving this a two star. In all honesty, it wouldn't take much to get up to 3 or even 4 stars. But it's those little extra steps that take so much effort and a diligent management.  I had SO wanted to like this place too."}
{"text":"Cafepino takes every opportunity possible to inflate your bill.  Our server asked us if we would like bread brought to to the table and then added $2.50 to our bill for it.  The specials were read to us.  I ordered the salad that was on special that was described as, \"Mixed greens topped with  warm grilled seasonal vegetable and chicken breast.  Imagine my shock when I received the bill and was charged $19.50 for salad!!  I was billed $15.00 for salad and an additional $4.50 for the chicken!   I went in for a quick bite with my two kids before a movie and ended up with a $75 bill!!!  Will never go back."}
{"text":"Seems like this restaurant has changed ownership. It used to be a lovely Italian cafe with nice food and reasonable prices. However- beware: the new owners charged my friends $4+tax for a cup of tea (really?) and I was asked to pay $8 for a very bland soy cappuccino. What a rip-off! Not going back! And the service was pretty unfriendly on top of everything ( because we didn't order any food we assumed). Absolutely NOT recommended."}
{"text":"Stopped in to kill some time for a glass and an appetizer whilst waiting for a movie time. Found the place overpriced - $18 for a grilled vegetable plate of no particular distinction. Really? Service was of the Lower-East-Side-of-NY variety, brusque and a little in your face. Not a pleasant experience."}
{"text":"Never, Never, Never step foot in here!!!In my 66 years in this world I have never experienced a co owner that cried I hate you, this business, and humanity as a whole.  It's taken a month for me to settle down and write this review, but now I can review this place rationally without emotion. We did not have a reservation, but decided after a night at the movies we would just walk in and take our chances. We waited 40 minutes, but that was ok. When we were seated, we waited 15 minutes before the owner came around, running by our table, only to brake stop and say are you ready to order. Since waiting fur the fifteen minutes, I asked for some water and he tersely said, you would have to wait another ten minutes for him to come back for our order if we got water. We said we were ready to order after that statement! I then asked if I could get a half order of the meat platter and he rolled his eyes in disgust. I then went with the kakabobs. Two small skeweres later with a half a cup of tossed salad cost me $ 14.00 and were marginal at best. We asked if they served bread we were brought some prior to our meal.  The check came and I noticed we were charged$3.00 for 4 slices of bread. I brought it to co owners attention and he said they have been charging for the bread since they opened years ago. Then it happened, he says, You are not happy here, all of you, Never come back again. You are not welcome here.  My friend, could not believe what he was hearing and went over to the other owner and explained what happened and how rude this guy was to us.  Even as we walked out the rude owner pointed me out and said that he had an issue with me and I was not welcome and there are plenty of other restaurants I can go to He's got that right!!!!! He took lessons from the Seinfeld, Soup Nazi personality wise...except the food is simply not worth the bother!!!"}
{"text":"My wife and I stopped in to the restaurant after a movie to have a late dinner. This was the first time we had dined here (and the last)! The food was decent, however we found it to be somewhat pricey for what you got.  When the check came, I noticed that the price of my wife's entree was more than the price listed on the menu. I pointed it out to the bartender who just happened to pick up the check and credit card. He stated that they are in the process of getting new menus and the new ones with the new prices won't be in until next week. Not really sure how that was my problem. He said he would mention it to the manager. When my CC receipt was returned, by someone completely different, nothing was mentioned about the price differences AND there was no adjustment on the check. I was furious.  I called over someone who I guessed was the manager. He was a bald guy with an accent and I am guessing it's the same guy who is referenced in this review  ( http://tinyurl.com/28smh9j ). I told him my issue and he says he was aware, but that we had picked up old menus and the new price was over there - on a chalk board. First, this is a completely different story than the bartender told us. The 'manager' was implying that it was our fault that we got the old menus. How is it our fault, when the person who seated us handed us these menus?  Secondly, how anyone is supposed to know to look at the 'chalkboard' for the real prices is beyond me. What about the people who ate outside on the patio. They couldn't see the chalkboard prices! Anyway, he continued with his arrogant, nonchalant and careless attitude and stated that I should withhold the money from the tip and next time, \"if there is a next time\" dessert was on him! Excuse me!    As a former restaurant manager for a very highly respected and well known restaurant I can tell you what happened to my wife and me is beyond comprehension from a customer service standpoint. Given that the restaurant is so closely located to the movie theater, their attitude seems to be that customers are a dime a dozen and they don't need to focus on any sort of customer service.  We will never return and I hope my review serves as 'food for thought' for those considering eating here. Caveat emptor!"}
{"text":"Excellent Restaurant..... Great Pizza! Absolutely loved the Ambiance. ... I Highly highly recommend it!"}
{"text":"Love the decor. Love the food. Love the owners.  Yes, it is on the pricey side but a) you are in scottsdale and b) you get what you pay for - the food is high quality! The freshest mozzarella is used in their salads, pizza etc and the desserts are outstanding (the tirimisu and macaroons specifically)  Love it! I'll be back often!"}
{"text":"This is a great neighborhood spot and the perfect place to grab a bite before or after a movie at the Harkins Cine Capri.  The restaurant is bright, casual, and modern, the owners are friendly, and the service is quick and attentive.  They serve salads, pizzas, sandwiches, and pastas - you order at the counter and then they bring it out to your table.  Some of their salads are better than others  - the Caesar is pretty good, while the grilled chicken salad was mediocre and overpriced (at $12), with just warm lettuce, shredded carrots, and dry chicken in too much peanut sauce.  Their pizzas are very tasty, with a delicate, chewy crust, plenty of sweet, delicious sauce, and very fresh cheese and other ingredients.  My only complaint is that the crust underneath towards the center of their pizzas is too soggy - I love thin crust, but it shouldn't collapse and make all your ingredients slide off when you try to take a piece.  Cafepino has become one of my go-to spots for a reliably good, quick meal."}
{"text":"Great for al fresco dining, friendly staff, and brilliant food. If they didn't sweeten the tomato sauce I think this pizza would have been absolutely perfect... pity about that. Salad was also very tasty but desert (we had Tiramisu) was dissapointing."}
{"text":"I hate to be picky about a local place but I wouldn't go back.  The only thing positive is the decor.   The pizza was super marginal, greasy, and the bread on my sandwich was really chewy. The wine tasted like vinegar for $9 a glass.  My sandwich came to the table 5 minutes before the wifes pizza.  Service never checked on us, restaurant was slow on a Saturday night, except to give us the bill and process the payment.  Hate that.  Really wanted to like this place but wont be back.  Two stars only because they are local."}
{"text":"Decor is nice and gets it extra stars. Definitely overpriced for what it is. The wait staff practically bullied us to order some wine. Different people, including the owner, kept coming to our table and abruptly asking, \"what are you drinking?\"  They walked away a little rudely when we initially didn't order anything. I didn't like the overall feel of the place due to the waitstaff and felt that they were trying to nickle and dime us by getting us to add extra things to our order. The home-made pasta was good, but overall simple and not worth the over $15 price tag.  I won't return due to the attitude of the owner and servers, and the overpricing. We ended up paying over $30 per person for our meals, which is too much for a very average meal with poor service."}
{"text":"When we first moved across the street, we called over to see if they had an online menu so that we could order takeout (we have a very active toddler so eating out isn't always worth the trouble). The owner answered and said that he was \"too old school\" for an online menu but encouraged us to come in. Annoying, but okay fine.  Earlier today, I went in to pick up a takeout menu (they have a parking spot specifically for takeout so I was assuming they did a lot of takeout business) and they laugh and tell me that \"they don't do takeout menus.\" What's the point of offering takeout if you're not going to offer your customers a menu?? Heard bad things about the customer service and didn't want to believe them. Wish that I could taste the food, but with the bad attitude, I won't be a customer."}
{"text":"Went to Cafe Pino recently with a friend for Sunday lunch. The location is easy to find as it is right next to the Harkins theatre on Scottsdale 101. The restaurant is quite spacious with both indoor and outdoor seating and a decent ambience.  We ordered a tuna salad and a vegeterian pizza with extra topping of mushroom (the mushroom made the difference , I felt, but then again i like mushrooms on everything italian). Both the dishes were very good. The salad was very fresh and had a good dressing and the pizza was also the right crist size and flavorful.  Had a tirmisu for dessert which was also good , but not the best I have ever eaten.  All in all ..good service, good food and had a nice time. Gave it 3 stars instead of higher simply because I personally didnt feel there was anything else on the menu I was dying to try so may take a while to come back here. But certainly worth a try."}
{"text":"The asparagus soup is amazing. Sandwiches as good as Pane Bianco. Any chance a second location could be put in Ahwatukee/Tempe?"}
{"text":"Went there after a movie for a quick bite with friends.  While the food was good, the manager/owner is beyond brusque, bordering on rude.  Made for an uncomfortable dining experience.  Surprising they stay in business with such crappy customer service in a town filled with excellent restaurants.  I won't be going back anytime soon."}
{"text":"The service was terrible.  The bald french guy who seated us is incredibly rude and uncaring.  The food is overpriced and very mediocre.  I ordered a chicken salad with peanut sauce that was overpowering and the lettuce was limp.My wife had the Pino burger, which is basically a hamburger on flat bread.It was hard and overcooked.  I would not recommend Cafe Pino to anyone.  You are better off going to the Elephant Bar."}
{"text":"I recommend this place.    Three of us went on a Saturday night arriving about 8 PM and there was no wait for a table.  We sat outside on the patio because after a few minutes sitting inside we were all freezing.  Turn up the thermostat!   We were glad we went out to the patio because it was very nice out there.  It was bordered by nice plants, it was quite, and the lighting was pleasant.  Inside the lighting is bright and somewhat harsh.  The menu is centered around the pizza offerings, of which there were 12, plus three daily specials priced from $9.95 up to $14.95 for the specials.  Many sounded great.  There are 6 sandwiches made on bread made at the restaurant, that all come with french fries and salad.  All sounded good.  Priced from $9.95 to $12.95.  Other offerings are: Beef Minestrone Soup, Beef Carpaccio, Antipasto Pino, Antipasto Mea Culpa, Rotisserie Chicken, Lasagna Bolognese, Grilled Chicken Pasta, Smoked Salmon Pasta.  There are six salads that sounded good; Nicoise, Caesar, Pino Garden, Caprese, Canasta, Grilled Chicken, and a Fresh Fruit Bowl.  Prices were from $6.95 to $11.95.  There are also 5 items on the Kids menu; Chicken Fingers and fries, Pasta Bolognese, Pasta Marinara, Pasta with Butter, and Grilled Cheese.  All $5.75.  We ordered a bottle of Duboeuf Pinot Noir  for $24.  It was pretty good, but not great.    Three of us split a Pino Garden Salad ($6.95)  which was very good.  It was a nice size salad for three people to split with a pizza.  It would have been a lot for one person to eat and have room left for anything else.  We paid $1.75 for bread so we could try the three olive oils they provide for dipping.  We only really liked one of the oils.  Two were kind of plain, lacking the fruity taste we like.  We split one of the three daily special pizzas, the margarita pizza with prosciutto and arugula ($14.95).  We all liked the pizza very much.  The wood fired oven gave the crust the perfect crispness and wood fired flavor we love so much.  The sauce and toppings were very flavorful too.  One person in our group thought she would have liked a little more herb flavor.  My only complaint is that there was a little too much sauce, such that the sauce was running off the pieces and the toppings were sliding off the slices when cutting and trying to lift a piece for a bite.  I found it better to leave the slice on the plate and use a fork for the first few bites.  The sauce also made the crust a little soggy in the center such that it wouldn't support the toppings when you tried to pick up the slice.  Cut the sauce and it would have been perfect.  We ordered one Spumone for desert ($5.95) to split.  It was my first time to try  Spumone.  It was kind of a chocolate and vanilla ice cream pie that is wonderful.  But I would guess it's not ice cream like is made in the USA.  I would highly recommend you try it.  We loved it.  The owner came by our table a few times to say hello and make sure everything was to our liking.   The service is excellent because the owner constantly walks around supervising the staff making sure your every need is taken care of.   Our total bill, before tip, was $58.05 for a bottle of wine, one pizza, one salad, bread, and one Spumone desert.  Cafepino is just to the right of the Cine Capri theatre entrance.  Give it a try.  UPDATE:  On Saturday, October 19 we went back again at 6:30 PM after a movie and we ended up at the end of a line of 30 to 40 people all lined up to place an ordered at the counter, and then get a table.  The first time  we went here they seated us like a normal restaurant.  I guess when they  get a big crowd all at once they have you order at the counter.  We didn't like the program and left.  Too bad.  We really wanted to try another pizza.  Maybe next time."}
{"text":"Ever since we first came to Cafe Pino, wee love this spot! Their Pasta Pastor and Margherita Pizza are fantastic, and the food is authentic Italian. Their dessert and coffee is also great! The place is a little pricey, but definitely delicious. Also they don't serve bread automatically, but if you ask they'll give it to you!"}
{"text":"Went for lunch witha friend and had the best coffe and eggs benedict.  The patio seating was enjoyable and even got a little spring sprinkle.  The service was great and the food was tasty.  Can't wait to go back."}
{"text":"Maybe I experienced Cafepino on an 'off' Friday night considering their sever / host couldn't get my order right after 3 attempts / 40 minutes. I was willing to pay $20+ for a pizza in the desert but I did not receive any food! I guess one star is for the refills on the ice water during the debacle."}
{"text":"This place is crazy good. I love the service and the food. You know when the staff speaks italian to one another you are in the right place for authentic food. The sangria is great!"}
{"text":"Whether you are going to a movie afterwards or if you are just looking for a good meal, Café Pino is definitely worth a visit.    As many of you are probably thinking, myself included, if a restaurant is going to charge $14 for a personal pizza it better be good.  Fortunately Café Pino is able to back up the prices that they charge by serving consistently good pizzas.  I must say that they have some of the best pizza in the Valley - and since Yelp is providing me with the platform to do so, I will say it.  If pizza isn't your thing, their lasagna is pretty damn good too.    My only word of warning is that if you are eating with 6+ people and everyone orders pizza, their oven doesn't seem to be able to handle an order of that size."}
{"text":"I went today for lunch. The vegetable soup was delicious, the salad was very good...but one bite of the tuna sandwich was a much as I could handle.  When the server approached she asked me if I wanted a box, I said no thank you and said I didn't care for rit.  She rudely responded well if you told me earlier I would have made you another sandwich. I responded as nice as I could, I did not want to stoop to her unprofessionalism and said 'Had somebody come by to check, I would have told them\".  Then the owner came over and started to yell at me and let me know he is the only restaurant to make it in this shopping center. I was so embarrassed by his behavior. I would never refer this restaurant or go back!"}
{"text":"We visited this restaurant, Cafepino, for the first time last evening.  It was quite noisy and the decor was nothing to write home about.  The waiter was very brusque and hurried.  When I asked to have a few small pieces of fruit instead of the fries that came with my meal, he insisted that I purchase a fruit bowl for $2.98 more.  (Other restaurants in the past have made the substitution.)  I had a grilled veggie sandwich with side salad, no fries, for $13.  The fruit bowl, with a tiny container of yogurt , was $2.98.  The salad was OK but quite small, the toasted bun was burnt and the yogurt tasted spoiled.  The veggies inside the bun were OK, but nothing special.  The fruit was tasteless.  My husband loves fruit, and I was sharing it with him.  We left most of it because it was of such poor quality.  One of our companions had a grilled chicken salad which had very little chicken in it.  When we were finished with our meal, the waiter asked if we were happy with our meals.  I said \"No\" that I was unhappy with mine.  He immediately walked away, without asking what had been wrong with the meal, or even expressing some kind of apology.  Despite this, we left a 15% tip (we usually tip 20% or more) although I felt he didn't really deserve even that much.  I wrote on the bill some of what had been wrong with my meal and we left.  I would not recommend this restaurant and we will not be returning.."}
{"text":"Awesome!  Pizza rocks!  Pasta is great homemade stuff.  Really different than pretty much Italian type restaurants."}
{"text":"Went last night before a movie.  Had read the reviews, but decided to try them anway.  Disappointed in the so/so food and very high prices for the quality and quantity of food.  Felt constantly rushed as the owner/waiter kept coming back to us which gave me a feeling of 'are you ready yet?\".  Portions were small for the cost:  lasagna too rich, heavy and cheesy and  small portioned at $14.95 - Really?  Absolutely nothing comes with the meal - no salad, no bread, both extra at $4.95 each.  Foolishly came back after the movie to try one of the tempting desserts pictured in a table card.  When it came to the table we were shocked that it was a fraction of the size.  Very deceiving. Although tasty, nothing special except ice cream covered in choc chips and nuts, and for $6.95.  I would not recommend this place.  There are many better choices where food is genuinely good, prices are reasonable and service exceptional."}
{"text":"Sitting next to the Cine Capri Theater, Cafe Pinot is somewhat of an unknown gem. We love this place and frequent with friends here often. The staff is always friendly and willing to do most anything to make everyone happy and feel special. The food is always fresh and superb. Ownership has always been present whenever we've dined here, which tells me they take a lot of pride in what they do. Any bad reviews on this place have to be random and the rare exception. If you're a coffee snob like myself, they have some of the best in town. Highly recommend the Malaga!"}
{"text":"I stopped in here for lunch with my sister around 1:30 on a Tuesday and we were the only people in there.  The service was horrible, I mean we were the only people in there so it was pretty extreme how bad the service was.  The food took forever so I asked for some bread.  What came out were hard pieces of stale bread.  I got the shrimp salad that ended up being 20 dollars with tax.  And to our surprise on the bill the bread cost 2.50!!!!!!!!!!! I was outraged! I will never be returning!"}
{"text":"Great food. Good prices. It's a great little taste of europe in town. One of my favorite highlights of the place is they always have a new special. And it's always good. Only downside is fighting movie traffic for parking."}
{"text":"We had two very different experiences at Cafepino.  The first visit was great! My daughter and I were somewhat pressed for time as we had movie tickets so, rather than order a whole salad, we decided to share a Nicoise salad. The salads had already been split in the kitchen when they were brought to the table and they were great. Tasty tuna, huge capers, small green beans and pieces of potato, etc. They had been carefully prepared and were tastefully presented in two bowls. The service was friendly and the food came out of the kitchen quickly.  We were so impressed that we went back two weeks later. My husband came with us. This time we weren't under any time constraints and were prepared to linger a bit. One of us ordered a glass of wine. Unfortunately it was served in a small unattractive glass.  My husband ordered the Grilled Chicken Sandwich which was excellent. We also ordered their Homemade Bread which also was excellent although they charge $1.75 for it. My daughter and I ordered the same Nicoise salad.   Imagine our surprise when only one salad was brought to the table on a plate. We had again opted to share the salad and had assumed it would be split in the kitchen the same way as it had been on our first visit. When we commented, our server told us the salad could not be split in the kitchen. When I said we were just there two weeks earlier and the salad had been split in the kitchen, she said she got into trouble for splitting it the last time and had been sent home. Regardless, I reiterated my request that the salad be split, but my request was denied. Instead, another smaller plate was brought to the table and we were left to muddle through the sharing process on our own. Frankly, the meal was ruined before it began.  It is noteworthy that there were only two or three other people in the entire restaurant and the kitchen could easily have taken the time to accommodate our request but, for whatever reason, chose not to, or someone (a manager or possibly the owner) told them not to.  No one said \"thank you\" or \"goodbye\" when we left.  No restaurant, especially in the current economy, can afford to be this cavalier and inflexible as far as its customers are concerned. There are simply too many other restaurant choices.  Finally, their prices are somewhat on the high side. The Nicoise salad and the Grilled Chicken sandwich were $12.95 each.  Although we loved their food, under no circumstances would we ever go back. In fact, we couldn't wait to leave."}
{"text":"I enjoyed a few glasses of wine on the patio one evening while waiting for a friend. However, I was disappointed they didn't inform me of the 1/2 price bottle night. The sign was on the table, but I'm surprised with how slow they were they didn't give me the verbal offer as well.   My friend and I ended up taking advantage of the 1/2 price bottle upon her arrival. We also ordered a margarita pizza. The waiter asked if we wanted garlic on it. He said it's very good with garlic. It should be the best garlic ever cuz we got upsold and charged 2$ extra for adding the garlic!   Overall, I would return b/c I really enjoy the atmosphere!"}
{"text":"Excellent food and wine. Open for BL &D. Homemade fresh pasta woodfired pizza stop in for a great meal."}
{"text":"While enjoying the Phoenix Film Festival this weekend Ive made two visits to this very cute restaurant. The service was great both times, once with a party of four and again with a takeout order. The host and servers were very attentive to make sure we made the best selections. The food was good as well; nice variety and good flavors. I will be visiting again!  Hopefully when I'm not in such a rush!"}
{"text":"The highlight of my evening.   The sensuous flavor of our meal rolled onto our tongue as we devoured every morsel.   If you have not tried this place,   give it a go.  I loved the atmosphere,  attentive staff and oh I can't forget the food.  Oh the food...MMMM.  Love love love this place!"}
{"text":"Thought stopping in to Cafepino was a great idea after taking in a movie- I was wrong. We were 6 starving people on a line waiting and waiting and waiting... I took my Mother to sit at a table while the others were on line, and was asked by a waiter and then a manager, to please leave the table for the next people on the line.  (There were plenty of other empty tables available) - but this is the way they do business...  You CANNOT sit down at a table until your food is ordered.  I was even asked to point out the people on line who were ordering for me , and when I did, (because there were about 10 people in front of my party) ,they said we would have to leave the table until the food was ordered??  Not a good way to do business -  My husband is a VP in the Restaurant -Franchise Food Industry, and feels this was uncalled for... Obviously the six of us left the restaurant and ate at an establishment close by that welcomed us with \"open arms\" -  JoJoe"}
{"text":"Hadn't been here in a long time. The couple other times it was pretty good, and as others have commented, the location is perfect if you want to catch a movie.  At least last night there was no 'line' to wait in. We were seated and given menus - a first. Unfortunately nobody came to take our order for at least 5 minutes (even drinks) until the (I'm guessing) owner wandered over and took our order. The other servers were standing around watching some MMA or fighting stuff.  Caesar salad came right away. Salad was fine, nothing special. We also ordered some 'homemade' bread. Perhaps they should buy their bread - because it was hard and not very good. Reminded me of naan bread, but not as good.   My pizza, the Sicilian, was burned on the bottom. My wife's pizza, a special with prosciutto and arugula, was less burned, but I think they just put the prosciutto on after the pizza comes out. Mmmkay, I'd have guessed it would be cooked on the pizza but whatever...  Then the bill comes. My pizza is listed at $13.95. I was pretty sure it was only $11.95 on the menu. I asked the girl, who instead of looking at a menu on the table next to me, walked to the owner and talked to him. Nope, it's $13.95. Ok, I'm sure I was wrong - would not be a first. As we got up to leave I just thought I'd peek at the menu - my pizza was $12.95. I didn't say anything and just walked out.  SHADY and BAD FOOD. Stay away. Go to Tea Light Cafe instead, just by the Cold Stone and also right by the theatre. Better food and HONEST"}
{"text":"Went in ordered a pizza. Waiter asked me if I wanted garlic, I said sure. Got the bill $2.00 added to the bill, Pathetic, -  pizza was very average - Sande s."}
{"text":"The food looks decent but you would have to get pass the incredibly rude owner which has no sense of what service means. Sadly they reinforce the image of the rude Parisian restaurant. Will never set foot in this place again."}
{"text":"When we went into the restaurant, we ordered a half salad, a kid's pizza, and a cookies and cream dessert. The salad was alright, but the pizza and cookies and cream was very good. However, they charged us wrong for every single item. When we told them that they did, they wouldn't comply. We called later to try again, and they still wouldn't help us. We will not be going to the restaurant again."}
{"text":"We stumbled upon the location and the outdoor seating. Finally a family owned and operated buisness here in Scottsdale great service the pasta specials were spot on good and large portions. The cesare salad was good homemade dressing and croutons nice shaved cheese on top!  Thank you Pino"}
{"text":"Super yummy food. Great service! We had the large meat and cheese platter even though we are not regular meat and cheese eaters. It was fabulous. Several types of salami and prosciutto and cheeses served with a very delicious crusty bread and excellent fresh fruit. At $28+, it looked expensive, but for a very enjoyable meal for two it was a bargain. I also had a side salad with was great. I loved the quality European style service and attention we received. I will be a regular at Cafepino!"}
{"text":"Great food from one of the Co-founders of AJ's grocery stores. Great place to go before a movie and great food."}
{"text":"One of my favorite eateries in Scottsdale. Excellent service, 5 star food and so many personal touches by the owner. Try it!  You'll come back again and again"}
{"text":"Crime Brûlée is to die for. Caramel latte macchiato is insanely delicious. FANTASTIC SERVICE!!!!  Prices are are a bit high but I promise you the food, coffe, and service are worth every penny!"}
{"text":"Cafe Pino is the sort of place I am totally mixed on. I wanted to love it - cute, conveniently near the movie theater, serves late, broad, well priced wine list. But, my experience here was odd at best.   Went with one of my friends, Meredith G., after a movie. We were never told whether to order at the counter or if we would be waited on, and we basically stood around for a while. Once we ordered, it took a while for the food to be delivered, which was odd b/c we were about the only people there. Also, the owner kept staring at us and coming by every two seconds to ask if we were \"ok.\" This quickly went from friendly to down right annoying.  The pizza and salad we shared was tasty, but the service was a hassle overall."}
{"text":"Stopped in last night after seeing a movie and were pleasantly surprised. To us it was obvious that you order from the counter. After ordering they gave us a number to put on our table. The food came out quickly and was exactly as ordered. We sat on the patio which was lovely, but we were a little to close to the speaker which was too loud so it was difficult to carry on a conversation. It is the perfect type of place near the movie theater. The food was great. The only reasons I did not rate it higher was that it felt too cold to sit inside and the music was a little too loud outside."}
{"text":"I had lunch there this week-The vegetable soup was good, the salad was okay and the Tuna sandwich was awful. I did not know that they prepared it-tuna nicoise and took one bite and stopped eating it. The server came with the check and asked if I needed a box. I politely said no thank you, I did not care for it. She responded very rude and said,\" had you told me immediately I would have brought you something else\". I said back to her, had you checked on me I would have told you. Then the tyrant owner comes over and starts to YELL at me that he is the only restaurant to make it in this shopping center. His food is delicious and I need to pay for this because it is only $8.95. People were staring at him while he was yelling and all I could do was be embarrassed for him.   I am in the Hospitality business and I would never refer nor enter this restaurant again-EVER!!!!!"}
{"text":"After reading the reviews from whiners complaining about the prices and service at Cafepino I had to update my review. First of all, the service at Cafepino is better than I have experienced at most restaurants, not only in the valley, but in most of my travels in the US and abroad and at any price point. The staff are mostly charming French men (what's not to like about that?) and they are incredibly attentive, efficient, but not intrusive. I have never experienced a negative attitude or  anything but a warm welcome from the staff and proprietor. As for the prices, yes they are on the pricey side, but all the food is incredibly high quality, fresh and completely made in house, including the pasta and desserts. The owner will whip up a special \"house\" salad on request to perfectly complement your entree. Last night he surprised us with the Monte Carlo...fresh greens, still warm roasted veggies and a light dressing with flavors to die for. This is not the type of establishment one goes to if they have to pinch pennies. If you want a bargain for your family of four go to a chain restaurant with dodgey ingredients, tasteless food, zero atmosphere, poor service and guaranteed heartburn. Cafepino is fine casual dining and priced accordingly.If you want a nice dining experience for a date night, casual lunch with friends or just a great glass of wine and dessert after a movie, Cafepino is the place to go."}
{"text":"Very bad service. Our food came at different time and we had to wait 15mns for extra bread. Over/priced cheese platter for quality. Very ordinary pizza. Won't go back ."}
{"text":"Average at best \"Italian\" food. Way over priced for the quality of food and service that you receive. I suggest saving your money and going elsewhere."}
{"text":"My husband & I occasionally go to cafepino & love it ! It's cozy, great food & the staff are very attentive . I'm \"obsessed\" with Europe so I enjoy speaking with the owner who is from France & very engaging . We were there on thanksgiving & thoroughly enjoyed it , we do not like the traditional turkey , however it was available if we wanted it . We sat outside on the patio & the music was perfect . The pasta dishes are excellent !  We will be going there for Christmas also ! It's our little \"hidden gem\" ."}
{"text":"While waiting for a movie we noticeds Cafe Pino, I just wanted to look at the menu but ended up having espresso and tiramisu (and a beer for the husband).  I was going to just have a bite since Im not a big sweet eater however we ate the whole tiramisu!  I loved it!  16 years ago I had a tiramisu and have never found one that compares, until now!  Cant wait to try more from Cafe Pino!  Having lunch there later today!"}
{"text":"Came here just to get a glass of wine before a movie, service was awful. Took 15 minutes for the wine to come after ordering, by the time it came I had to chug it to make it to the movie on time."}
{"text":"Really enjoyed the food as always plus great service not to mention the wonderful ambiance.We sat on the beautiful patio this afternoon and had such a great experience . I always recommend Pino to all my friends!!"}
{"text":"(Considering this is one of those places that has two different Yelp pages depending on how you spell it, this will be the same review as seen on the alternate spelling/grammar page)  I would give this place one star; however, the decor was nice and the location is handy for a \"dinner and a movie\" night. (but not handy enough to warrant coming back.....)  The prices were alright, I would expect things to be a little cheaper based on a few things though: .The food was mediocre to bland .The ordering at the counter, yet having a \"server\" rushing around tables like he was in some sort of relay race is just obnoxious. .No one welcomed us upon entering, after a couple minutes someone asked if we were ready to order or if we needed to look at the board longer  1/4 way through our experience here, we felt like we had already been ripped off.  The food really was nothing exciting at all.  The place itself appears to be in some sort of identity crisis. I mean is it counter service or sit down? You can't be both, it just annoys people.  Meh. My opinion...skip it and just fill up on popcorn or leave early for the movie and go some place else... perhaps with flavor and an identity.  Just a thought."}
{"text":"Amazing gem, hidden adjacent to Harkins CiniCapri, another outstanding theatre and business, meals are very generous in quantity and high quality.   The owners, Guy and Paco, both French, are veterans of many eating and food success with Guy having a CV of amazing depth and impact in the Valley of the Sun. In fact, he was the original owner/creator of the famous French Corner in downtown Phoenix.   Yes the people are interesting and the food is very interesting as well. The variety and depth of the menu excellent."}
{"text":"We chose Cafe Pino because we were early for a movie. We were confused on where to sit and/or if we order first. We questioned a gentleman where would he like us to sit if we were only going to have coffee and wine. He did not seem happy that we only wanted beverages as we chose a counter seat.The person taking our order ( who I now know to be one of the owners) informed me that the coffee item I ordered is only ordered by men and suggested I have something else. Some of us chuckled as we thought he might be joking with us until he let me know he wouldnt serve it to me.. it didnt say for men only in the menu! My grown daughter ordered a coffee drink with hazelnut. The drinks were delivered and then shortly there after a dessert showed up, we told the person delivering the item that we did not order it.  The person called over to the owner who had been hovering between us at the counter and another table, \"they said they didnt order it\" He came over and insisted we ordered a hazelnut dessert, we indicated she ordered a hazelnut latte.. He argued that he couldnt understand us. He was saying something in a different language that let us know how upset he was. He handed the dish to the person that had delivered it to our table, threw his hands up in the air and said again something in another language.   After that he stood and glared at our party .    I do not care how good any food is at this establishment, he was so rude and rather scary.    Its unfortunate that he has a prime location close to a theater that will draw people in for more of his abuse."}
{"text":"I was there for a lunch w/ a french friend that recommended the place. Like the menu and the place. A little pricey maybe, but they have lunch specials. I ate a pizza and was very good, I also order a cappuccino that they serve exactly how I like."}
{"text":"I have been to Pino twice and have had a pleasant experience both times. The service was great. Many of the servers seems to work as a team to ensure no table was forgotten. The pasta is freshly made and you can definitely tell. They have a good wine selection as well! I will definitely be returning."}
{"text":"I might try this restaurant again, because I love fresh pasta, but on my only visit, the lasagne apparently was placed under a heat lamp.  How else to explain the hard, dried first layer of pasta.  Otherwise, the dish was excellent, with delicious sauce and other layers of pasta much,much better."}
{"text":"The owner is a thug.  They upsell on everything, if you order a tuna nicoise salad they ask if you want anchovies, if you say yes they charge $3.00.  If you are asked if you would like bread, $2.50.  The charges wouldn't be so bad if they told you in advance, but they don't.  The thug owner walks around like he wants to kill somebody, very unpleasant experience for mediocre and not cheap food."}
{"text":"This is the first time my family has completely different opinions about the food. I personally love there thin, crunchy  style pizza. However, for rest my family it was too thin and the crust was too crispy. If you like thin crust pizza then you should definitely try this one."}
{"text":"This food is the closest traditional Italian food that I've had ( after visiting Italy, it's hard to find a spot to live up to my expectations). The owner is very pleasant and has fulfilled all of our requests during every visit, but a greeting upon arrival takes a bit of time...The wait is worth the food, however!"}
{"text":"Asked my server what a certain specialty latte was and was told it's only ordered by men and then he wouldn't describe it to me. I'm a gal and this is why he wouldn't describe it in case that wasn't already obvious. Yes, in the year 2015 someone who works with the public thinks it is totally okay to say that apparently. Crazy. Did not have much there foodwise but what I did have was not that great. Won't be going back again due to the odd, rude and very inappropriate service."}
{"text":"When you get offered bread and then get charged for it. ..food was average but overpriced. ..never again!!"}
{"text":"I'm surprised by the bad reviews. I actually enjoyed it and it one of the best and authentic Italian restaurant in the valley. The gelato is just like back in Italy and served in a cold bowl as it should be!   service was great but I can see how some might not like it (very direct and sharp like in Italy). For me it all adds to the experience."}
{"text":"The service was terrible and there is this one waiter who was terrible rude the food was not that great they need better service and better attitude   and they need to pay attention because This on waiter poured water into Sprite because she wasn't paying attention"}
{"text":"Had dinner at Cafepino last weekend before a movie.  They were able to accommodate our party of five quickly.  Seeing as we were seeing a movie, the staff was quick to take our order and the food came out pretty fast.  I'd have to agree with the comments regarding the owner's abrupt style.  It was a little intimidating, but in the end good food and fast service wins.  We all shared a couple pizzas... the garlic margarita and a sausage.  I loved both, and particularly enjoy when the sausage is crumbled instead of in chunks, so their pizza was spot on.  The garlic pizza was garlicky for sure... they don't skimp.  We also had a pasta, which the owner specially made for us.  I believe it had lamb sausage on it and it was in a tomato sauce with pappardelle noodles.  It was pretty darn good.  Overall, I liked the experience/meal I had at Cafepino.  As a regular movie goer, I'd fully consider stopping in to Cafepino again before a flick."}
{"text":"2 drinks, one salad, one bread and one appetizer for $60. Are you kidding me. A small dinner portion salad, ceviche that dis not have marinated shrimp and 2.50 for a small bread. We are used to pay for great food and small portions but not small salads by a movie theatre. No wonder the owners are just hanging out and the place is not as busy for a Friday night. Shame on you for treating your customers like this."}
{"text":"Consistently euphoric. Everything is always so fresh it tastes likes the salads were just picked ripe from the garden and all the dishes I've had (which is a lot bc i come fairly l regularly) are always intricately flavorful.  You can definitely taste the French influence and appreciation for freshness and artful preparation. If you don't absolutely love this place, I'm sorry but it's most likely because you aren't cultured and probably should go to a place like Golden Corral  or dominos pizza because you've never developed your palate for anything outside fast food or chain restaurant junk."}
{"text":"Giving it 2 stars cause my family enjoyed the food, but otherwise not a great experience at all. I have sent many people here before I even tried it myself due to it being across the street from my work and I've heard good things. Well today, the 1 time a year my family is here together we were very disappointed with the service. Each one of our meals came out separately...so here we are together, the 1 time a year we get and we didn't even get to eat together:( my nephews meal came out last when he ordered a medium done burger, it came out extra well. So not only were we all done eating, but his meal was not cooked as ordered.  After today's experience I will no longer refer my residents there, and I manage the community across the street."}
{"text":"We stopped into Cafe Pino for drinks before heading to the movie theater next door. The host was very polite and offered us a table but we decided to sit at the small bar, since we wouldn't be long. We both ordered a grey goose & tonic with lime. They did not have lime, which is okay, but the drink was weak (less than an ounce pour) and the tonic was starting to go flat. We should have sent the drinks back but we didn't because we wanted to get to our movie. The worst part is when we got the bill ... They charged us $12 per drink! I know this is Scottsdale but that is way too high for a mediocre cocktail. Especially when we could have gotten the same drink over at the sports bar across the way for a fraction of the price."}
{"text":"My two girlfriends and I went to try this place before a movie. We were only interested in coffee and dessert. After we were seated the waiter handed us a menu and listed off the desserts. We all ordered small espresso beverages. I asked for a chocolate latte which was not on the menu. When the second waiter came by he brought our drinks: two large drinks and a small hot chocolate. I said that I wanted espresso in the hot chocolate as I had asked for a latte. He seemed displeased and insisted that this was what I had ordered. I asked him if he wouldn't mind putting a shot of espresso in it. He said nothing and walked away with my drink and returned the same drink with a shot of espresso floating on top. We then ordered \"gelato\" which turned out to be a very disappointing selection of freezer burned ice cream. I asked the waiter if they made the gelato in house. He said no so I asked what company he got it from to which he did not know (this guy turned out to be the owner) , I then asked him if it was just ice cream and he walked away without answering me. When we brought up that it was freezer burned the first waiter (owner) said we would need to pay the bill but we could just not leave a tip if we wanted to save 15-20%. He completely dismissed all of our complaints and inquisitions on top of being rather snide. I would not suggest this place to anyone unless you are looking for bad service in a restaurant where the waiters do not know English well enough to distinguish your order correctly. I love eating at restaurants with a European feel and authentic attributes, however, my experience here left me feeling accosted and demeaned. I will not be returning to cafe pino, ever."}
{"text":"I love this place! We've been coming here for years and have never been disappointed. The service is excellent, the atmosphere is pleasant, the presentation is on point, and the food is high quality. They serve breakfast, lunch, and dinner: at breakfast, try the Nordic Platter and if you want a great wood fired pizza, go for the Prosciutto with Arugula!"}
{"text":"Yummy food and good service. I had the tuna sandwich which was a nice change from the normal mayo soaked versions you get at most places."}
{"text":"Owners are very welcoming. Food was great and they were very accommodating with my few special requests. Atmosphere was nice, nice spot for a movie date night or just casual lunch. I will be coming back for sure."}
{"text":"Warning - if not on the menu ask for the price for anything and everything.  They love to push specials. For example we were charged $19 for a salad \"special\" with roasted vegetables and chicken which consisted of of about 90% lettuce, maybe 1 asparagus spear, one small tomato and one mushroom and 1/4 of a small chicken breast. The vegetable pizza $15 tasted OK but very scant in vegetables - about the same as the salad and did I mention we were charged $2 extra for garlic on the pizza (which they asked us if they wanted - no extra charge specified). Won't be back."}
{"text":"We go here for lunch every time we visit my Mom in Arizona.  We always get the same thing because we love it so much.  The Asparagus Soup to start and also a Cesar salad.  Then we get the 4 cheese pizza and my mom makes her own combo pizza.  It is so good.  It is Italian pizza if you like that style.  It is just hard to find it made like this anywhere.  Can't say much about anything else there, but if you go this route you will be very happy."}
{"text":"Pizza was fantastic & service was excellent! They also have an amazing almond cake that is probably my favorite dessert anywhere. I usually come in pretty late, & it has been sold out from time to time in the past, so I recommend calling ahead to make sure they have it in stock. I often come in right before seeing a movie @ the theatre next door, & when I tell them I am in a hurry, they always bring the food & bill asap. Very good Sicilian pizza. Great place, great people!"}
{"text":"I went here with my wife, my brother and sister in law. Good service. The Creme brulee was really good as well as the rum cake (Im not a fan of rum but everyone else loved it) overall it was a nice experience with a chic aesthetic."}
{"text":"Significantly overpriced for very ordinary fare. $18 for bland shrimp and pasta, $15 for modestly sized (tho apparently tasty) pizza. The ambiance is agreeable, but the mean portions mimic fine dining, and prices head that way too.  Couldn't complain about the speed: we ordered and food arrived in 3 or 4 minutes (pizza took a little longer). It's as if the kitchen knew already....  V Cheeky to charge the Scottsdale mark-up when it's not even in Scottsdale. Cafe Pinothankyou."}
{"text":"The food here was pretty good! I ordered the creamy asparagus soup. It was DELISH! The bread could have been a little better. It was somewhat hard. I like the overall decor of this restaurant. ONE thing I did NOT like was the layout of the bathrooms,. In the women's restroom the toilet aligned perfectly with the gap in the stall door... so if someone were to walk in they would be able to see you sitting on the toilet. I was thankful enough that nobody walked in."}
{"text":"Went here after the movies to have a quick dinner because it was conveniently located. Learn my lesson about always asking the prices on specials and reading the fine print so you don't get duped. There were two specials: one, a pasta Bolognese with sausage. We asked how much and was told $18. The second was a pasta with olive oil, garlic, chicken and shrimp. Made the wrong assumption that it may be slightly higher because of the shrimp but roughly in the range. When the check arrived, we found that we were charged $18 for the pasta with olive oil and garlic, plus an additional five dollars for the chicken plus an additional seven dollars for the shrimp. Hence, total cost for one SMALL bowl of olive oil pasta with chicken and shrimp was $30. With a small portion sizes, we asked for some bread and olive oil. Later, we discovered the three dollar charge for the four small slices of bread, totaling six dollars because we naïvely asked for two because there were six of us. Their pizza is good tasting; I\"ll give em that. The problem I have with this place is the lack of disclosure, what feels like being nickeled and dimed, extremely mediocre tasting pasta in return for fine dining prices, and a proprietor who acts like it's your problem not his. No wonder there was only three tables seated at 7:30 on a Wednesday night in a town filled with awesome restaurants. We will never return."}
{"text":"Service was Outstanding!! Food was outstanding!! Walked by this place last week and had to try it after lookin at the menu and talking with the owner. Came back and found a hidden gem!! My father and I will be back to share this with our friends and family!"}
{"text":"Excellent service and food. You can watch them kneading the bread dough and the wood fire oven. The atmosphere is open and spacious. It feels like you are sitting on a beautiful European patio even thought you are out of the Arizona sun. Love this place. We have to come here anytime we are this way"}
{"text":"This dinner was absolutely delicious. There were two of us and one of us wanted to try something from the \"breakfast all day\" menu. I wanted something dinnery. We each got our wish and what a delight our meals were.  I have had Steak au poivre at a lot of restaurants both in the US and in France. This steak au poivre at Pino was as good as any dish I had in France, it was so flavorful and peppery. It was just excellent.  Not everyone likes fennel. I'm one of those who loves fennel. We shared a salad that was fennel & avocado with a very lemony dressing. I loved it. My breakfast guy thought it was too lemony. But then, he ordered breakfast for dinner so take that from whence it comes.  Ok, then my guy got an omelette for dinner. I have to say, it looked really good. The fact that this place has the confidence to serve breakfast all day and a French Steak staple at the same time, says a lot about a restaurants ability to not take itself too seriously, while at the same time, serving seriously great food.  All and all, we will definitely be back."}
{"text":"Food was okay, but staff is RUDE. Still trying to figure out how I was charged $15 for what should have been $8.95 as lunch special. A bowl of mediocre pasta for $15? Definitely not worth it."}
{"text":"Cafepino never lets us down. It is consistently good. We love the Lasagna and the Tuna Fish Sandwich. The Margarita pizza is excellent as well."}
{"text":"This is a great place to stop in for an intimate dinner or a bite before a movie. We went in and got a sandwich and a pizza, a glass of cab sauv and a mojito. The only confusing thing were how many people attended to our table. The pizza was just okay, but the hubs sandwich was delicious. I would go back and order some pasta, anytime. Would definitely recommend"}
{"text":"I feel bad that I am giving this such a poor rating because my friend (and now fellow Yelper), Shari V., really seems to like this restaurant.  However, the wine menu is extremely limited, in my opinion, and the food was terrible.  I have a friend, Michael C., who said to me once that it is not fair to rate a restaurant based on only one visit but...  I can't help it.  I had only a half grilled veggie sandwich (because I was sharing), and I couldn't even choke that down.  \"Shoe leather\" is what comes to mind.  With so many other good restaurants, I would not suggest anyone waste their time with this one."}
{"text":"The owner was rude and provided terrible service. When I mentioned that water was poured into my daughter's Sprite he shrugged his shoulders and never did anything about it, we had to pull another staff member over to fix it.  He told my sister-in-law to \"breath\" twice when she complained that my brother got a dish he did not order.  He then ground black pepper on her dish after she asked him to stop.  Horrible!"}
{"text":"hilarious how most of the lower reviews are fairly consistent ...   yes, the bald lookin french dude, who i found was the co owner has to work on his service...  sad that he even had the guts to write me a foul note that i had to swallow some service or whatever that means... shrugs* it is what it is...  how do u expect others to venture within if you write notes as such? i will fwd it to those who are interested... just cause im nice:)  food was mediocre to say the very least .... prices are high, and honestly, even though it looks as if a fair gem from afar, there's a reason why people write poor reviews ...   def NOT comin back."}
{"text":"The food, wine and service were all excellent!!! Fast and friendly service.  The salad was delicious and fresh baked bread. Definitely will be going back. The patio is very cozy and rather nice."}
{"text":"Horrible experience! We decided to try this place before we went to a concert at MIM. Was there 1 and 1/2 hours before show. Very gruff server ( owner) took order and we told him we had a concert. Ordered a Caesar Salad and he asked if we wanted anchovies. We said \" great\" another server asked if we would like some bread. We said \"fine\" although we really didn't care. We also ordered two pizzas, the salad arrived and it was delicious hence the one star. Then we waited and waited and waited, pizzas never arrived 45 minutes later, we kept asking and were told varous excuses, finally we ran out of time and asked for our check. Owner told us \" fine but you are paying for the pizzas\"  my friend said \" we are not,we told you four times we had concert tickets \" then the owner told my friend( who was very nice) that he will b kicked out of restaurant. Check came without charge but had two high charges for bread and anchovies. We will never go back and didn't deserve this treatment from owner. At least the concert was wonderful."}
{"text":"I would not recommend eating here. It's close to the movie theater so after the movies, we walked over to look at a menu and to find out their closing time so that we could plan dinner later. The bald Italian guy is either the owner or manager. I was asking the lady who greeted us at the door about the hours when he came over asked the two of us to follow him to be seated and when I said that we were not eating just yet, he rolled his eyes at us, waved a dismissive hand flap and walked off talking about us. Got a few feet away and gave us another angry look.  The lady tried to apologize for his actions.  I have traveled the world and the US. Good food don't overcome bad behavior and the funny thing is today is Christmas. Just a nasty person. Rude, rude, rude."}
{"text":"Our first visit here and I was impressed! Service was quick and seemed like a little tiny Gordon Ramsey style cafe. It was a vey good team working and it seemed like the owners were a part of that team. We got the Carmel macchiato and it was so good! The oven cooked pizza- Sicilian with capers. Mmmmm. Everything seemed fresh and healthy. The desserts looked amazing as well but had to save that for our next visit. If you aren't hungry at least go here for some coffee & dessert or a glass of wine and cheese platter! Unique little place! Happy we tried this place out!"}
{"text":"Okay peeps. It's been long coming. Cafepino finally gets a five star rating from us after announcing a free wifi rollout in their european style locale next week. Very refreshing after getting tired of all our franchise places. It's time for you workaholics to leave the beaten path and settle in to your new home. Bring your laptops and share the buzz among only your closest friends. I don't want to regret telling you and winding up not getting a (hot) spot anymore ;-)  I just heard that they have breakfast now on Saturdays and Sundays until 4:00 PM. My kinda peeps :-)"}
{"text":"I had a similar experience to Emily and Steve (see reviews below) I ordered a plain pappardelle pasta with tomato sauce which was $18 and a drink $9. They asked if I wanted bread or a house salad I said sure not knowing that would be an extra $9. The food seems fresh but nobody likes to be nickel and dimed. I tried the tiramisu which was lacking in flavor for another $8. The place itself is clean and the staff is 'attentive' for lack of a better word. They seem impatient and the whole experience felt rushed even though they were not busy at the time. The people that came in after me even left before me. The lunch special might be worth a try if you wanted to check out the food without spending a ton."}
{"text":"I absolutely love the food here! I've never had anything off the menu that I didn't like -- and their sangrias are hands down the BEST in town (and did I mention they have them all the time?!)"}
{"text":"I will be going back to try breakfast and lunch. the dinner and dessert were amazing. if you like salmon, try the smoked salmon penne. food is so fresh and delicious. the staff is unbelievably friendly and efficient. thank you Paco for a great night."}
{"text":"Had an excellent salmon fettuccine, and a delicious eclair slice. The decor was very trendy, and the selection of coffees was very nice.  The only regrettable thing was that my mom got the home made lemonade.  Is in you pour water and sugar into lemon juice.  Good concept, but it was too sour for me.  Other than that the experience was very pleasant, and we even got a little chat from the owner."}
{"text":"A superior dining experience at Pino! My steak salad was out of this world flavorful. The staff is very attentive and polite. There is a variety on the menu with many delights to select from. The decor is inviting for all ages. I would encourage anyone to stop in to enjoy an unique dining experience. Your palate will most definitely be satisfied."}
{"text":"Nice setting and a great \"organic\"menu. Pizza is wood fired thin crust, mmmmm. Family run business is very sweet. Menu is full of great food! This day and age you pay for great food and Cafepino is no exception. Also I found a great favorite of mine that is not found easily anywhere in Scottsdale in any Italian restaurant... SPUMONI Gelato! So, I'll be coming back! Atmosphere mid day is very pleasant, music is soothing and the temp is great."}
{"text":"When was the last time your table was bused between courses in any restaurant?  I mean -- wiped down, new utensils, napkins, etcetera?  We came here last week, after going to Cine' Capri. We searched Yelp for a nearby restaurant, to try something different and came across Cafepino.  It didn't register to us at all and we thought we knew the area.   As we were leaving, we noticed it on the left. Could it be Cafepino?  Because of the dark tinted windows and trees, we've always walked past it and never thought to go in. Stupid, because 'Pino is a special kind of place.  The family that owns and runs 'Pino is from France. In fact, the original restaurant was started in Paris in 1958 and is still going strong. As I mentioned, it was the busing of tables that started a conversation with one of the owners. As we came in and looked at the posted menu, he encouraged us to stay in a Gallic sort of way, and we're glad we did!  We ordered their 'Pino Garden Salad ($9.00) that came with a flavorful light balsamic vinaigrette that was just right.  When we ordered, we told them we were going to share and without instruction, two plates were brought along with the salad. I know this might appear minor, but it gives you an idea of their professionalism. The wait staff is a ever watchful tag team effort. Very French!  As we were finished, two employees cleaned our table and our pizza arrived.  The Margherita ($14.00), was very good.  We ordered it half garlic for a $2.00 up-charge. Next time, we'll try the 'Pino's pizza with black olives. That's what the table next to us had and it looked good!  When the bill came, we thought we were getting away with something special, since it was only $25.00, before taxes and tip.  I've noticed on the bottom of the check, it says: \"CAFEPINO, it's something else!\"  We would agree.    It also teaches you to search Yelp, even when you know an area for new places. If we didn't, we would of turned right to our car, and not left. In the process, we would have missed a great little restaurant.  We'll be back.   Enjoy!"}
{"text":"My GF and I were very regular customers here for the last eight months. The owner would always stop and talk to us, then one day my GF goes in without me and he proceeds to hit on her and ask her out. How unprofessional can you get? Gentlemen I wouldn't recommend bringing your ladies here!"}
{"text":"Food is ok, interesting pizza combos.  Waiter service was great, except food for our party of six was served over 15 minutes as each item was prepared.  Not great for a celebration dinner as it would have been nice to eat together.  Everything is a la carte, even the bread!!  Pricey for a pizza place, $265 for six.  Won't go back."}
{"text":"What a bummer, service was minimal, food was eh.  I had been to Cafe Pino once before and after tonight, I won't be coming back.  Came in for dinner with a girlfriend.  I met her there and got there about 15 min early so I decided to sit down in a booth.  The restaurant had one party inside and 2 on the patio. Place was dead.  Well, it was a Wednesday night.  The booth seats are close to being ripped apart.  They were all cracked. Glad I was wearing jeans, if I was wearing a skirt or shorts I know that seat would have been uncomfortable.  So I was seated by an employee and waited for 12 minutes to get someone to come to my table to ask if I wanted a drink or water.  My friend showed up and a it took another 5 minutes for a server to come to the table to see if she wanted a drink. She ordered a glass of wine.... Oh, they are all out of that kind.  It's a Wednesday and the place is empty, how can you be out of a certain kind of wine?!  We were given 2 menus.  One was the specials that was a front and back laminated that looked to be printed with a home printer in Times New Roman and the other menu looked to be professionally printed.  It was just confusing.  My girlfriend had been there a couple of times before and these specials were the same ones.  We did get bread with oil and vinegar.  Bread was nothing to brag about, it was flat and hard.  We both ordered the Pasta Tuscan with chicken. She ordered hers spicy.  Which was not.  But she said she liked it. I enjoyed mine as well.  While we were having dinner we kept hearing this banging.  We looked around thinking we would find a kid making the noise like banging a booster seat.  Come to find out it was an employee sweeping into a dust pan. This was around 8:30  and there were more people in the restaurant.  The acoustics in the restaurant are not great so everything echoes and having this employee making noise was annoying as hell.  He stopped for a bit then he started up again.  We looked at the dessert menu and the server gave a couple recommendations.  I asked what flavors the gelato was and he said it is a surprise.  But if I had an allergy to let him know. We ordered cookies and cream, server said its a warm chocolate chip cookie with ice cream.  It was 3 hard chocolate chip cookies with nuts (glad I didn't have a peanut allergy).  It also had chocolate, vanilla and a chocolate chip gelato. The gelato was very good.  The hard over cooked cookies eh, could have done without.  Should have been a warm soft cookie to go with the gelato. While we are eating our dessert, with other customers in the restaurant, the employees are putting the chairs on top of the tables.  Bang, bang, bang.... that employee is sweeping again. He was sweeping around us , I thought he was going to ask for us to put our feet up to clean underneath the table. Dude!?!?! It's loud, do that when your customers leave!!!! We paid the bill and at 9:40, the lights went bright, ok ok we get it, you want us to leave.  I felt like we were in a club at closing time and they turn the lights on to tell people to leave.  4 stars for the pasta dish and gelato and no stars for service, bread and hard cookies.  Learn to give your customers a good experience!"}
{"text":"Never got a chance to eat in this place. Hostess took our name and told us 10 min no longer to sit. 25 min later which wasn't the problem a man I think the owner grabbed two different couples that had just walked in and sat them. I thought it was inconsiderate of him since the hostess had a list of patrons under control, it bad business to take others in front of people waiting when your not a fine dining reservation restaurant! Would never step inside this place again even if food was great and free! One star is only because it's still open and not out of business yet!"}
{"text":"I was here recently during the Phoenix Film Festival and really enjoyed it.  This struck me as a nice sit-down kind of place, so the order/pay at the counter and clip a number to your table thing doesn't necessarily \"go\" with the overall decor, but I guess it works.  Two girl friends and I shared the caprese salad and the Four Seasons pizza minus the ham (okay so maybe we only had three seasons), and both were delicious.  The pizza was very flavorful and tasted like it was baked in a wood-burning oven.  Thanks, Cafepino, for having a bottle of olive oil on each table -- we definitely consumed our share of \"healthy\" fat by sopping it up with the pizza crust.    The service was extremely attentive.  It seemed like every time I took a sip of water, someone immediately filled my glass all the way back up.  That seemed a tad odd, but certainly preferable to no refills at all!   I'll definitely have to go back and try the wine and desserts."}
{"text":"Always a solid choice. Good food and service. Makes you feel like you're in a neighborhood restaurant in France."}
{"text":"Came here for lunch today and the place was dead. We should have left but we decided to stay for lunch because we were starving. I have to say that Cafepino wasn't the first place we wanted to eat at today, we went to TeaLight Cafe but had to leave because it was PACKED OUT and there were no tables, hence our decision to eat at Cafepino. We sat down only to realize how expensive this place is!!! Holy cow, I mean come on, not even a \"lunch special menu.\" I can't imagine spending $15 for pasta at lunch time. We did order a pizza which was good, we shared.  This place has potential if they offered LUNCH SPECIALS! There are tons of office buildlings across the way and I can't imagine why this restaurant shouldn't be packed out at 12:30 on a business day.  And we should have checked the price on the old ice tea they served, $3.00, YIKES.  Kids menu was priced high too, $7 starting.  We will not be back, sorry."}
{"text":"The owner comes off as rude but he is just abrupt, we were not sure if we were going to stay but we saw the coffee menu and wanted to try it.  I think the owner/owners come  off as rude and it is mostly because of a different culture. Creme brûlée is amazing. Mousse is amazing. Espresso is amazing. You can tell management is tough on waiters.  The cappuccino was impressive, the espresso was strong and robust, it actually kept me up way past midnight!  We didn't have a meal but their menu looked promising so we'll be back!"}
{"text":"I love the food at Cafe Pino!  I have to comment on Heather's review.  She mentioned that the owner kept asking if she was okay and that it got annoying.  The owner's at Cafe Pino are Italian, that's just how they are.  If you ever get an opportunity to visit Italy, you'd better get used to that kind of service.  That's just how they are.  I do agree that the ordering system is a little confusing though.  Try the Sangria!  It's homemade and amazing!!!"}
{"text":"This place is the best. They are quick and have great food. My wife and I visit here frequently!"}
{"text":"This place was delicious and the service was very professional and attentive. Would definitely recommend! And it is so convenient to go right before a movie at Harkins next door!"}
{"text":"Friend suggested meeting here for casual Italian. Amazing, delicious, excellent personal service and incredibly high-end clean casual. Antipasto appetizer was enough for a full meal.  Two of us had specialty salads as meals - delicious. One had a pizza - stunning. The creme brûlée was nothing more than authentic leaving the taste buds wanting more.  Music and ambience delightful and can't wait to sit on the beautiful patio with a bottle of wine when the weather warms up. We definitely will be returning and would recommend this restaurant to any of our friends with the pickiest of tastes.  Well done!"}
{"text":"A friend brought me here boasting the best pizza in the world. My expectations were not high, but still--I was intrigued by this slanderous boast.   The place is very cute for being adjacent to a shopping mall. Shopping malls just give me the impression that a place will be packed with hordes of awkward teenagers. I think that's the old age in me creeping in though.  Cafe Pino is probably a decent date spot. It's cozy and modern and the service is pretty top notch. The pizza. It's o.k. Thin crust, brick oven pizza. The sauce tastes a little weird to me, but other than that--it's a decent pizza, just not the best in the world."}
{"text":"I really do love Cafepino.   the servic e for one, is excellent. the owner, a polite Frechman, is always there to greet his customers and to oversee his business, which in this economy is the watermark of a good business owner. He is also very helpful when it comes to menu decisions. The wait staff, however, is a little lackluster. They simply bring your food, and then leave, and make little to no conversation at all. I've never had complications/bad experience at Cafepino, and the only problem is perhaps their waitstaff.   The food is excellent. A little pricey, but good nonetheless. Usually while I'm there, I get this creamy tomato sauce penne pasta dish- I can't remeber exactly what it's called, the Ceasar salad- which is fresh, crispy, cold and has the right balance of cheese/lettuce/dressing, or the pizzas, which are best when they are cooked crispy!   The atmosphere is cozy but modern, and is a good place for date night, or simply just a night out.   If you're willing to pay a tad more for some good food, then Cafepino is worth it!"}
{"text":"There is no better italian food in the Phoenix area than CafePino. Such a great atmosphere and hospitality as well.  Owners are always at the site to recommend specials and customize order for you. Highly recommended."}
{"text":"I think this place is good. I've had pizza here twice. My only complaint is the beer selection. They charge Scottsdale prices, but they don't offer what other Scottsdale eateries can offer. Considering this place is next to a movie theater and several more affordable options with better beer choices - quite literally in the same parking lot - I'm not sure how long they will survive here."}
{"text":"It's always nice to be able to write a good review. Despite being in a strip center next door to Harkins, Cafe Pino has a real bistro feel to it. A pretty varied menu, all I can answer to is their pizzas. Nice Roman style with thin crispy crust, a good sauce and a variety of toppings.  I've come in on my own several times, and the service is always warm and inviting."}
{"text":"Pino's customer service was exceptional throughout my visit. The French dip was good but the pizza is amazing and the creme brûlée was perfect. The five stars would be well earned from just the service alone but the good lived up to expectations as well. Thanks."}
{"text":"Cafepino is a marriage between French and Italian cuisine. It borders the Cine Capri Theatre. The main dinning room is spacious with the tables reasonably spaced apart so you have some privacy and elbow room. They have a glorious outdoor patio with small trees and greenery climbing the trellises on the perimeter of the patio. The lighting at night is perfect for enjoying a meal. This is a great place for date night.  The restaurant that we decided to go to on the Saturday night before Easter in Phoenix was closing at 7pm (who does that?), so we decided to head back home to Scottsdale for Plan B. We decided to try Cafepino out since the Yelp reviews were so good. My wife and I really enjoyed our meal as we dined al fresco. The outdoor dining area reminded me of Van Gogh's painting \"Cafe Terrace Arles\". The service was perfect. I had the french dip with au jus, french fries and a salad. All of this was served on one plate. The salad was lightly caressed with salad dressing with mainly greens; it was fabulous. Although the fries were not my favorite, they did the job. The French Dip was perfect as their homemade bread added to the flavor of the meat and au jus. I would definitely order this entree again."}
{"text":"Pino is a European Pizza Chain. The owners are French and opened the only Pino in the United States. The menu offers wood fired Italian Style Pizzas, appetizers, sandwiches, many salads, entrees, specials and some French Food. Pino truly doesn't feel like a chain. The owners are very welcoming and all the food is made by scratch.   I had the lunch sized Bonita Salad. I received a nicely prepared piece of grilled wild salmon over a romaine salad with avocado and a few other things. The salad was indeed good.  My husband had the French Dip on their house made bread. Again indeed good.  At this point I'm undecided between 3-4 stars. Atmosphere is very good, Service is very welcoming, charming and good. Food is good but not exciting. So I try dessert and order the Lemon Meringue.  The Lemon Meringue is obviously house made. but had a soggy crust and thick not so lemony curd. The meringue was kinda flat and too chewy.  After dessert I felt this was closer to three stars.  3.5 stars just like the Yelp average at this time."}
{"text":"Only been once so more of a full review will follow.  I was waiting for a movie and got an espresso because I'm C&C, yeah that's right, cultured and classy.  Coffee was very good, menu looked great as did the actual food I saw people eating around me while I was staring creepily.  The overall place feels pretty legit too, the waiter had an Italian accent which reminds me of the old country ( I've never been to Italy but I've seen The Godfather and they sound like this guy).  Either way I was impressed def gonna go back, also they have biscotti the side of a loaf of bread here! BADA BING!"}
{"text":"The lunch special are very well priced for what you get.  I had the Caprese sandwich with vegtable soup that was very tastey.  Service was spectacular.  The food was prepared with the passion you come to expect from a high end resturant."}
{"text":"Horrible service.  They are a bunch of thieves. I was served by the bald guy, one of the owners. He claimed to want to \"take care\" of me and he took away our menus and made us \"custom\" dishes. We ended up getting charged a ridiculous amount for some average salad and pizza. $90....I will not go back. Grazie in old town is much better."}
{"text":"This gem has amazing carpaccio, the bread they serve with infused olive oil & balsamic vinegar is amazing.  We love stopping in here for lunches, and will probably give a more detailed review after we move back to Arizona... we used to come here when they first opened a little more than a decade ago, but we moved away.  We're moving back and delighted to see that they survived the economic crisis that happened while we were gone, and have come out, looking and tasting just as good as ever.  The owner is always there, seems like a bit of a curmudgeon but really is on top of things in terms of quality and always stops by to make sure we got everything just the way we wanted it.  You feel like you're stopping by his home and he's checking up on his guests... and the food's quality reflects the owner's care.  VERY worth the stop."}
{"text":"Bordering the Cine Capri theater Cafe Pino is a rather spacious restaurant with a generous out door patio seating area with small trees and climbers on trellises along the periphery. But that's where the pleasantness ends.  The service was definitely substandard. It felt more like roadside eatery than an actual restaurant. We had asked for water without ice and several minutes later someone came by with two glasses full of ice. That set the tone for the rest of the evening. I had ordered a BBQ pizza which was definitely subpar. While they say is all freshly made, this definitely felt microwaved. It lacked flavor, the chicken on it seemed rubbery, and overall just a really bad.  My partner's mean definitely more delectable but then I was coming off tasting the worst pizza I've had in ages. She also had some bedouin tea which for 6$ was definitely not worth it. A strongly avoid recommendation in my book, save your money and go elsewhere."}
{"text":"Imagine what it would be like to eat an authentic french dip sandwich....  A thin bread roll cooked to crusty, dark brown perfection in a brick oven, its crumb moist and chewy.  Beef that's neither chewy or fatty, nor with any hint of gristle.  Caramelized onions that add just the right amount of flavor. And all of this this topped with mozzarella cheese, delicious, authentic mozzarella cheese in the correct proportion to the meat...not so much as to create a chewy glob, yet enough to add even more flavor to an already delicious treat. Now add a flavorful au jus that doesn't rely on salt for its too too delicious taste. It's a fucking miracle this sandwich. A real life miracle.  I've never experienced a french dip as heavenly as Cefepino's, making me conclude how one day when I decide to fuck-it-all...no longer eating sensibly or exercising, I'm going to live out the remainder of my days eating these things until I swell like a tick, pop and keel over.  The service was highly attentive with a variety of new faces stopping by every few minutes to fill our glasses, wipe down the table between servings, or provide information relative to the menu choices. One of the servers even provided the background of the restaurant, which we learned has a long and storied history in Paris.  The house chianti paired splendidly with my minestrone and french dip. A small (quarter sized) ramequin of horseradish was also served with the meal, it was slightly creamed and had a mildly strong flavor, in a word, supreme. Overall, this was an extremely pleasant dining experience.  If you're a French bread aficionado and, you live in Phoenix Metro where you know there just aren't that many places to get hard crust, oven-fired breads, you have another option....Cafepino.  Cafepino in my opinion is definitely a standout in the lineup of mediterranean eateries here in Scottsdale."}
{"text":"Nice place!  Had dinner here last night!  Great food! Owner a little grumpy and doesn't smile, but the rest of the staff seem ok."}
{"text":"I had read so many mixed reviews of this place that my expectations were fairly low.  I was pleasantly surprised by the attentive staff, pleasant ambiance, spacious menu, and tasty dishes.  The only real drawback was the semi-nauseating adult contemporary that they had playing throughout the restaurant.   Not the best Italian in town but certainly worth a visit."}
{"text":"A friend and I wound up at the wrong movie theater and decided to eat dinner instead.  Since Cafepino is right there, we decided to go right in.  I am glad we did.  We both had salads, which were good.  I had the roast chicken and fries and felt as though I was in Paris.  My friend had the steak au poivre and fries and liked it.  It felt very French to me, which was very nice.  The service was good, too.  As was the lemon merengue pie.  I would go back."}
{"text":"We just finish having dinner there and we love it!!! Best Cesar salad I ever had!!! The pepperoni Pizza and margarita were phenomenal!! Our server paco and all staff were  very friendly   The gelato and cookie and cream are so delicious we are definitely coming back!!!"}
{"text":"Cafe pino more like cafe scamo. We got scammed into buying bread!! They asked us if we wanted bread for the table and even tried to make us get 2 loaves before we even had a chance to answer. We figured it was free, but oh boy were we wrong. That bread was $3 and not EVEN QUALITY!!!!!! We then informed them of the celebration of our friends birth, just to get an \"ok\" as a response. When we were deciding on a dessert, the waiter shouted \"OK A COOKIES AND CREAM FOR THE TABLE\" before we had picked one. We thought he meant we would be receiving a complimentary dessert but again WE WERE WRONG! He said it was chocolate chip cookies with ice cream on top, but those cookies were FULL of nuts. Good thing we aren't allergic or we would be dead. Honestly the meal was good, but 0/10 for the service."}
{"text":"My favorite place! You have to be educated and seasoned abroad to understand European Dining. The owners get bad reviews but it's from people who don't know what true dining means."}
{"text":"One of my favorites place. Pizza is so delicious and tiramisu is amazing. Good service. Nothing to add"}
{"text":"I sat outside with my boyfriend. we had great service from everyone. I got the ham& swiss omelette, he the cordova omelette. They were delicious. We liked the ambiance and food so much, we went back two weeks later and plan on adding it to our regular breakfast spots."}
{"text":"This is the second time here, loved it! Specifically, my food was outstanding. They had the ability to make homemade gluten free pasta, just for me. The texture of the pasta was dead on to regular pasta.  Speaking for everyone else dining with my, they really enjoyed the food and service. Creme  brûlée completed my perfect meal.  We will be back!"}
{"text":"Phenomenal service, with a great wine selection, and an authentic European atmosphere. Everything is made in house."}
{"text":"Amazing dinner!!  We stopped in before seeing a movie next door. The service was excellent, with very attentive and knowledgeable staff.   We ordered an appetizer that was not on the menu with fresh mozzarella, scrumptious zucchini, fresh bread and an assortment of other goodies. We also ordered one of the specials not on the menu which was out of this world. Strongly recommend this place to anyone looking for high quality Italian food."}
{"text":"Cafepino is awesome!  Don't wait to try this wonderful bistro when you see a movie like we have. This place is like you are in a European /New York/San Francisco eatery.  The staff is always at your table, the owners are like the captains of a ship wanting you to enjoy your experience.  Hats off to the owners for this excellent find!   The pizza, salad and ceviche was over the top!!!"}
{"text":"Wow wow wow! Food and service are nothing short of amazing . Such a great place to take a date and then enjoy a movie at the Harkin's theater next door. We enjoyed the Avalon Cab and fresh antipasto only to fine and enjoy the unbelievable special of the day afterwards. All of this and the deserts are amazing. If I could I would give 10 stars based on the magnificent service and how delicious the food was. Hard to believe it was not packed on a Friday night but I believe once the word gets out it will. I will frequent this establishment from now on!!!!"}
{"text":"I have had lunch here several times and have never had a bad experience. I have to rave about the asparagus soup it is so delicious, rich and creamy. I've also had the pizza, calzone, and several of their sandwiches. They have the best bread of all times. I'd also like to know how they make a Caesar salad better than anywhere else. I highly recommend Cafepino.  I'm guessing the sangria and desserts are also nice but have only been there for lunch. I"}
{"text":"Without going into all the details lets just say the experience at Cafepino is underwhelming, the food is extremely under seasoned, the service/servers can be a little abrasive, and for what it is, in my opinion overpriced...especially when you are told one thing and get a bill for something else.  The one thing it has going for it is for the fairly good atmosphere."}
{"text":"Pizzas and salads were very good. Limited wine list but inexpensive. Service was friendly and prompt. Excellent gelato and cappuccinos for dessert."}
{"text":"Straight forward genuine Italian cuisine. Service is warmhearted and absolutely superb. Food is very fresh and flavorful. Portions are very generous. Desert is a must- just to complete this truly great and relaxing dinner experience. This place would be great for a date with your partner or special dinner with your family. I promise: every one will be happy."}
{"text":"Wow, what a treat! We discovered this place because we had too much time before our movie, and I am so glad we did!   I have no idea why folks think they're rude here. They're not. If you smile and are polite, guess what? You get that in return. :)  We had dessert and coffee: an apple caramel pie, a chocolate eclair pie, malaga lattes, and coconut macaroons.   We will be back. Serioisly. The quality is phenomenal (and rich! You have been warned), and the atmosphere was a delight."}
{"text":"Such a fantastic find! Homemade fresh pasta  The ambiance, the food, the entire experience was perfection! And the banana split was out of this world!! Such a unique presentation and the flavor was beyond amazing with the caramelized bananas. Memorable place for sure!"}
{"text":"The owner comes off as rude but he is just abrupt mostly because of a different culture. The French dip is amazing. Pasta is amazing. Creme brûlée is amazing. Mousse is amazing. Espresso is amazing. You can tell management is tough on waiters. Overall delicious and fresh."}
{"text":"My wife and I really love this place for dinner or coffee and dessert. The service is friendly and the food quality is excellent. Their coffee drinks truly stand out! It is a great place to eat before catching a movie (Harkins theater is next door) or when you are looking for a romantic date on their patio."}
{"text":"Pizza is pretty good here, but I can't say it's the best I've taste.  Fast service I might add so the pizza was on the table 10 mins after I sat down - I can appreciate that!  Thin crust through a flaming oven; it's a lost art coming back into popular culture - it's good and a must now.  Wine and beer on the menu, not too shabby, but nothing that really pops (not sure bout the $10 glass of wine - sheesh!) This place has a great location - right out the Harkin's Theatre, if you can't survive this location then you can't anywhere else!  I like the ambience - hip and hoppin' with some modern flare.  The tables are rock solid, literally...don't bump your knee into these babies; they are meant to last a life time - enjoy!"}
{"text":"I'm addicted to the Pasta di Pastor--best pasta in Phoenix, hands down. Super convenient eating here before catching a movie at the Harkins Theatre. The owner has always made sure we get our food on time to make our movie, as we have been regulars here for years. Nice touch. The terrace is relaxing, and it's also worth mentioning that their specials menu is delightful, as is their art selection. Believe local artists. Going back tonight for I, Tonya."}
{"text":"Used to be one of our favorite places to eat until we ate there again recently.  We were the only table in the restaurant so you would think that the service would be excellent.  NOT the case.  We had to ask three times for drink refills.  At one point I had to personally clear our dishes from the table so we could have more room to eat.  Food was wayyyyyyyyyyyy over priced!!!  You even have to pay extra for bread at the table. Salads were crazy expensive and the pizzas were out of line on pricing as well.  This is not considered a fine dining restaurant but their prices do not reflect that. We will not be returning."}
{"text":"CAFEPINO is becoming one of my favorite restaurants.  You can come here for any full sit-down meal, a quick lunch, or just enjoy a coffee and pastry. Both the indoor and outdoor seating areas are lovely.   Everything I have tried here is great: creme brulee, the drinks (both alcoholic and non), and the pizza. The salmon topped pizza has fresh salmon on it; none of that canned business. Service is top notch; people are quick to refill drinks, check on how we're doing, and make great suggestions from the menu.   As Victoria mentioned, there are gluten-free options, and the staff was very accommodating to any variations to the meals."}
{"text":"Stopped in to get a hot chocolate before the movies.  I asked for it without whip cream...it came with whip cream.  Oh well.  I drank as much of it as I could but it was too sweet."}
{"text":"Whether we sit indoors or outside it is comfortable. The owner Paco can be a bit gruff but the food is consistently fresh and flavorful. His staff is kind and helpful. I've enjoyed the cup of cream of asparagus soup, the very perky mixture of veggies in my salad with the proper amount of dressing and my salad Nicole's tuna on ciabatta crispy roll. There is no skimping in the sand which of olives, tomato, arugula, capers and potato, & tuna. This combo is a feast to me.   We splurged and shared a tiramisu dessert and found the slice large and wonderfully rich with flavors with a hint of rose water, yum.   We'll continue to return."}
{"text":"This casual dining restaurant is not hard to find so I am surprised no one has yet Yelped about it, but they should have!  I went to this cafe for the first time before I saw a movie at Harkins 101 up in North Scottsdale.  The restaurant is right next to the movie theater entrance; the decor is nice and it has an outside patio.  You can either order at the counter or sit and have a server take your order.  Either way, the menu is the same and it is delicious.  Not exactly cheap, but delicious, and the portions are very large.    I ordered the caprese sandwich.  Warm, oven fired bread, plenty of mozzarella cheese and tomato, pesto, basil, a large side of fries and a fresh salad.  So much food that my friend and I said we should have split our lunch.  After a lunch of attentive and terrific service, when they asked if we wanted a box , we sadly said, no.  We were going to the movies.  THIS IS THE BEST PART OF OUR LUNCH!  They brought us boxes and kept them for us in their fridge until after the movie!!!  We got to take our doggie bags home after all.    Upon leaving the movies, we stopped back in, picked up our sandwiches, and I was able to enjoy my lunch again the next day.  Way to go Cafepino.  I will definitely be back!"}
{"text":"I've eaten here a handful of times but most recently just this weekend, and felt compelled to review.   The first time eating here I got a pretty simple pasta dish, and while it was done well I felt I could have made it at home. I only went back again because I was nearby and wanted to give it another try. The second time, I got sucked in trying a bite of what my fiance got - the lasagna bolognese. My veggie sandwhich was not doing it for me - the bread was extra crusty and dense, and the veggies were extra soft and not very flavorful. His lasagna, however, was excellent - so excellent that I had to go back for a full plate of it myself this weekend. It's a bit expensive for the size but the quality here really shines. Fresh basil on top and cooked within, quality parmagiano generously sprinkled along the edge of the plate, flavorful meat sauce.... and the cheese! It's not difficult to make a lasagna that \"people\" would like; it's melty meat and cheese after all! But this place puts in quality ricotta in a thick layer that you can sink your fork into. I take my time eating it, and don't feel ashamed or too heavy afterward.  I also had the cream of asparagus soup. Not many places have that on their menu so I ordered it on a bit of a lark really. I'm not a particular fan of asparagus or this kind of soup, but OMG it was spectacular. The balance of asparagus and cream was perfect.  The prices seem a bit too high, even considering the good quality of their dishes. I will keep going back, despite the prices, and hope I find more gems on their menu."}
{"text":"We enjoyed a quiet late lunch here last week.  Menu sounds like a French/Italian fusion, they had several items on the lunch menu for the Picky Vegetarian.   The Veggie Soup was made freshly chopped vegetables and was served piping hot, the best I have had in any place.   The Veggie Pizza was absolutely the best I have had recently, It was as good as or better then the Sicilian Pizza I had in Santana Row last week. They have a ton of dessert options for about 5$.   Service was absolutely the best. I am going to be a regular."}
{"text":"Restaurant is pleasant, team is friendly, food is good. Great moment. We appreciated our pizza and the chicken kebab. Pizza were too big, we weren't able to taste dessert. For the next time."}
{"text":"HORRIBLE SERVICE!!!!!!! Went in for a simple sandwich before the movie, was seated right away but ordering that was a different story. Sat there for 20 minutes without water or being able to order, had to walk out or I would have missed my movie."}
{"text":"We stopped by on our way to the Scottsdale Film Festival.  I couldn't have been more impressed.  What a cute cafe!  The food was fresh and delicious!  We split a specialty salad and the veggie wood fire pizza.  The prices were very reasonable and the service couldn't have been better!  I'm definitely coming back!"}
{"text":"On our vacation we stopped by for lunch awesome food and we meet the owner and that completed the experience."}
{"text":"Ok place.  Not enough cheese on the pizza, crust is ok, but I like the sauce a lot.  I rather have Pizzeria Bianco"}
{"text":"I had the French Dip and vegetable soup. It was very good. Service was fast and friendly.  Will have to come back and try desert."}
{"text":"Consistently good food, never disappointed, love it as well as my kids, good family restaurant, the owners are great and friendly with great customer service. A+++"}
{"text":"I can't take issue with the service, as all 4 different people that attended to me and a pal for our brief dinner stop during the Phoenix Film Festival were great.  What I can say is, while my pizza was tasty (bianca with olive oil added by request), I expected a more traditional, crispier thin crust versus the New York-style it arrived with which, at 12 inches, is too filling to be a personal main course but would be perfect sharing with 2 or 3 people.  That said, I wasn't entirely surprised given that the place is definitely not pretending to be classic italian. They are clearly going for the modern interpretation, as evidenced by the signage, decor, and menu selection. Probably not a bad choice given the location, but all of that along with the high expectations set by the prices left me underwhelmed.   The clean, modern style vanished as we were led to our patio seating, which consisted of generic, if sturdy, furnishings and table dressings, including the odd choice of oil candles in pint glasses. The plain 8 1/2x11 laminated \"Specials\" and the small acrylic table topper wine list weren't helping the matter. It made the outdoor seating feel like the kids' table compared to the sleek dining room and gave the distinct impression that the budget got stretched thin by the time it reached outside.  All in all, it's a good choice for convenience (especially for moviegoers) or for the sake of variety, but I just don't know that you should go out of your way to eat here. I'd recommend trying Picazzo's, at least for comparison's sake, as I feel that it has for slightly more interesting fare and is only a stone's throw away."}
{"text":"This lovely little restaurant recently opened (replacing the Cafe Carumba that was previously there) in the Scottsdale 101 development right next to the Harkins theater.  A friend and I popped in to unwind on a Friday evening and had a very pleasant evening.  They could use some signage to explain the \"order up at the counter and then pick your own seat, we'll serve it to you there\" logistics, but their attentive staff quickly saw our confused faces and guided us through the process.  They have a nice by-the-glass wine list (but no HH specials, boo) so we indulged with some reds while sharing a caprese salad and four cheese (we got it without the blue, and just kept the mozzarella, brie and goat cheese -- yum) pizza.  The food was fantastic, great thin-crust pizza and the olive oil made the crust like a second appetizer!  The service was almost too good--this place is obviously family-owned and they must have every cousin and uncle in there to check on you every 5-10 minutes.  Extremely attentive, sincere, and accommodating service.  It has the feel of a restaurant that is eager to please and really wants you to be a return customer.  The ambiance and music was perfect for a Friday night -- lot's of people watching as the patio opens up to the main entrance of the Cine Capri theater and the traffic is nonstop.  Very cool, mellow music and comfy booths -- great date place.  Nothing mind-blowing but certainly a convenient and worthy staple that I will add to my portfolio."}
{"text":"Best pasta in town. Pizza's are great   Food made from scratch. Owners are passionate. Great dinner and movie destination since it is next to Harkins Cine Capri."}
{"text":"Had a soup and sandwich and everything was OK.  Nice, casual environment.  Service was poor."}
{"text":"we come here often and its amazing every time. The salads/pizzas/pastas and even the dessert is delicious!! The staff is friendly and knows the menu and can make suggestions if your not sure what to get... the location is great! right next to to harkins theater and about 5 minutes away from our house. the prices are a bit high but the portions are big and we always have left overs if everyone orders their own item. its pretty loud at times so its a great place to take my 20 month old daughter who tends to be loud at times."}
{"text":"Great tasting pasta, but the wood fired pizza is out of this world good.  Everything is just fresh and good.  Service is always excellent and the staff are very friendly and attentive.  5 stars all the way!"}
{"text":"A few years back a group of friends of mine went to dinner at Cafe Piano with a very negative experience that I reviewed here on yelp. Well, my neighbor and I chose to try it again last night and I was very pleasantly surprised!  They had finally updated their menu to just one (they had four different ones then) and the prices were correct when the bill came (another big source of contention with my first review). Our server was very attentive to be sure that we got everything we needed and answered all her questions and was very concerned with our satisfaction.  We enjoyed the delicious endive salad and a the margarita pizza and their signature garlic Parmesan cheese. I am so glad the improvements were made since I was there last because this is a great location and the ambience is perfect for date night, a quick bite, or a small group. Good job Cafepino!"}
{"text":"As a gourmet chef, I'm tough on restaurants.  The food has to be better than I can prepare at home, so take that into account when you read this review.  I had a lunch appointment, and my colleague suggested this place.  I arrived a few minutes before 12:00 and there were just two other tables occupied.  Bad Sign. My colleague arrived and as I was perusing the lunch menu , I picked out a pasta item that was reasonably-priced at $8.95 The ?owner? walked by and mentioned that they had a special that was not on the menu: linguine with olive oil, garlic, and shrimp. He neglected to mention the price (Bad Sign Number 2).   I'm always leery of lunch specials that are not on the menu.  Too many times they consist of items left over from the night before.  I decided to order it any way.  It arrived and it was a disappointment. The pasta was undercooked and the shrimp was over cooked.  Worse yet, when the bill arrived I discovered that the charge for this dish too awful to finish was 24 dollars!  I understand that the restaurant business is tough and they have to make a living, but a dollar's worth of poorly-cooked ingredients is not worth $24."}
{"text":"Lets make this simple...ordered a Caprese sandwich. Bread was so hard we thought we'd be visiting the dentist afterward. Completely unremarkable sandwich. They did, however, manage to charge us $15.95 for that sandwich. If Caffepino wasn't located near the Cine Capri we would've never considered it.   We told our server about the stale bread and it seemed to bore him. Not to worry...we'll never be back."}
{"text":"If I could give this place 0 stars I would. I went in and sat down with my mom, and Gus, the \"owner\" was so rude to us. They charge for bread, so beware, when they ask you if you want bread. Gus should be ashamed of himself. He spoke so rudely to my mother and when we asked why we are being charged for bread in the table, he fired back at us and yelled. I will never ever step foot in this place again nor would i recommend it. Save your money! Rude rude owner!!!!"}
{"text":"This place is \"tops\" when it comes to quality and service!  Located right next to the movie theater at Scottsdale and 101, they are very understanding when you have a movie to make and will even store your leftovers in the fridge for when you leave the movie.  I was excited when my husband and I asked the waiter \"which pasta of yours should we try\"....his response (in a thick Italian Accent) was \"oh, not on the menu\", asked us a few questions, and returned with a pasta dish from heaven - all made from scratch I'm positive.  Definitely one of the best restaurants in the area....try and enjoy anytime - you won't be sorry!"}
{"text":"This is one of my favorite places to go with the family. The food is incredible and the owners are very friendly and create a very comfortable atmosphere."}
{"text":"Cafepino conveniently sits right next to the Harkins Scottsdale 101, which is also home to the Cine Capri movie screen. As you walk in through the front doors, you're first enticed by their elegant and tempting pastries. Awesome way to draw us in Cafepino. Cafepino doesn't fall short of deserts. During the evening I came in for the first time, our party was immediately greeted and were given a quick summary of what was offered on the menu...a menu with a very wide selection. We were seated at the outside patio on a pleasant February, Saturday evening, which surprises me was not more greatly used at the time. We were surrounded by empty tables in the patio with candles lit up at the center and stringed lights strewn across the perimeter of the patio area. Although, you could see all the activity by the movie theater, you could feel a sense of separation from it with the lights and plants setting up a wall between the patio and the movie theater. The interior of the restaurant felt high-end casual.  It was very late in the evening, so I had no interest in a big meal. I ordered a large hot chocolate and a chocolate eclair. My companions followed suit with the hot chocolate. I guess I came up with a great idea! One of my companions selected a tiramisu while the other selected one of the specials of the night: a seafood calzone. My chocolate eclair wasn't quite what I expected. It was a chocolate eclair sliced into a pie shape. Same went with the tiramisu. My chocolate eclair was alright. It wasn't quite as sweet as I wanted it. I tried the tiramisu and it wasn't as sweet as I would have expected either. The hot chocolate was what I needed for late that night and it went well with the chocolate eclair. I didn't try the seafood calzone, but it was large and it looked tempting. I was told it was really, really good.   I loved sitting in the outdoors during the evening. There's tons to choose from on the menu, so more than likely you're bound to find something you'll like."}
{"text":"Beautiful decor with a terrific location. Waiter was very attentive. Had the chicken salad which I found bland but everyone else at the table had wonderful meals. Will definitely try this place again and order something different."}
{"text":"Definitely one of my fave spots in North Scottsdale to grab great dessert and some of the best coffee around. Every visit I've had, has been great. The guys, whom I'm assuming are the owners are always very cordial and helpful in assisting with a new dessert to try out and ensuring my experience was a positive one. I haven't had the opportunity to get a full meal there yet, but the food smells delicious and looks soo appetizing each time I visit, so that's on the to do list for the next stop in.  I have to highly suggest the creme brulee- so far it's my favorite dessert item. The plating of everything makes all the dishes look like masterpieces!   Bon Appetite!  *check out the photo gallery on Cafepino- you maybe sold just looking at some of the pics I uploaded :)"}
{"text":"I luv luv this place! I bring everyone here ! I've been eating here since they open many years ago! The owners are always there & so polite! Def a place to try, my fav pizza is the fellio!"}
{"text":"I will NEVER AGAIN step foot in Cafepino near the Harkins 101! First,  the owner was so rude to me. I asked the busser to please tell our server that we would like to order, the owner came over and said to me, very curtly,  \"okay, your order!\" I gave him my order quickly in the spirit of his attitude which at this point, I thought was in a fun manner.  I quickly replied with my order for a chicken gf pasta dish. He finishes the table's order and I verify with him that he noted my gf request and he says,  Aw! Well if you want gf you have to tell me this,  how will I know if you don't tell me this? I replied that this is exactly why I had just verified this with him.   Then, trying to be friendly,  my husband asks him where in France he was from, he says,  \"Paris but the Muslims have turned it to garbage! He then mimics them by bowing and calling out Allah Akbah!!  Needless to say our dinner party of 5 will never be back. I'm disgusted at the blatant bigotry that he felt no shame in openly displaying in his restaurant.  This experience has left me sick to my stomach!"}
{"text":"They have really good service here. They also have a really nice free range rotisserie chicken meal that is pretty scrumptious. Secondly they have ORGANIC and gluten free pasta!   Also they use real olive oil not any of the fact crap, thank god.   I have been so busy lately to actually dine in; and get my to go. I can tell the dinning atmosphere would be nice here though.  Furthermore everyone I have encountered worker their is and acts like a professional with a enough experience to be working in a restaurant like this. To be blunt about it, it's nicer than going to a place with a bunch of adolescents that  don't know enough care enough to do their job properly.  To the best of my knowledge this is probably one of the most real and authentic Italian Restaurants I have been at.  It's hard to find real food this days that isn't loaded up with a bunch of unnecessary garbage. So for this reason I'm giving you lots of praise.  Lastly even though I had a few very specific questions about some menu items because of the food allergies I'm dealing with nobody talk to me in a rude or condescending manner.  Thank you,"}
{"text":"I have been to this restaurant several times, only prior to seeing a movie.  I went on this particular evening to get a quick bite of what I had experienced on my earlier visits to be rather overpriced, but convenient and decent to good quick italian food.  Thumbs up on the quick (food was out in minutes) but cant even say what I was served was close to decent.  My smoked salmon pasta was in a bland liquidy sauce with clumps of cheese hanging on to the glob of smoked salmon smashed in the middle.  The salad had no dressing.  I asked for bread and was charged $4.00 for it.  I also was charged 5.95 for a side salad which on their menu clearly states 4.50.  In any case, what really prompted me to write this review was not the bad expensive food- (my tab for a quick bite was $33!!!) but rather the owner's DISGUSTING behavior towards me.  I told him I had had this dish twice before and this wasnt even close, he merely shrugged his shoulders and grabbed the bill  and money from my hand. Then when the server told him they overcharged for my side, he threw his hands in the air \"like I dont give a f- she's not coming back anyway\"  The poor server apologized for his rude behavior. I will NEVER go back and I advise you dont either! Dine elsewhere even if its not next to the theater, worth the extra drive."}
{"text":"Love cafe Pino and their customer service!  My favorite pasta is the pasta pastor and tiramisu..  My husbands favorite Calabria pizza.. We love coming here for date night, it's nice not too crowded. It's perfect for a date."}
{"text":"Heard about it from friends. Went there with our 4 year old and 1 year old, who both have been to more restaurants to date than I did by 18.  Ordered Beef Carpaccio for $13 as an app, Chicken pasta with an olive oil sauce for $13 and a Chicken Sandwich.   Everything arrived at the same time, not with the Carpaccio out first.  For $13 I would have expected better carpaccio. It was drenched in olice oil and had some lettuce shreds around it and some shaved parmesan. At Flemings, I can get cheaper carpaccio that is a larger portion and tastes devine with a mustard aioli. This was blah.  The pasta consisted of low quality penne, not made fresh and more olive oil. It sucked. The sliced chicken on top was very flavorful.   My wife's chicken sandwich was uninspired, with what appeared to be thousand island dressing on it. It did have a side salad with a really tasty dressing (with dijon perhaps).   Overall, the people working there were pleasant. The food was pedestrian and overpriced.   Wont be going back."}
{"text":"Huge fan of this great Italian restaurant.  We are always greeted by cheerful and friendly employees.  The food is always delicious (especially their pizza!)  Their cappachinos are big enough to bathe in!  Its cozy and a perfect place to enjoy lunch or dinner.  One of my favorites for a lovely and casual date night too!   We love Pino!"}
{"text":"Terribly disappointed. Ordered the tiramisu and a cappuccino, the Cappuccino was like a watery latte and the tiramisu  was absolutely tasteless and watery with no coffee taste. NEVER will I stop by here for a pick me up."}
{"text":"Great service.  Great food.  If I lived in Scottsdale this restaurant would become my local."}
{"text":"Truly one of the small treasures in Scottsdale to go for Italian. The food, the staff is amazing. I've gone here off and on for 6 years and always impressed how good the food and how polite and friendly the staff. The owner is amazing, comes and talks to you, will easily adjust to your needs / wants."}
{"text":"Stopped in last night during the Christmas movie rush, but I only got a coffee, so I'll be short. Delicious coffee, and what looks like an interesting menu, but $23 for an antipasto plate that contains pate' seems a little too high for me.    That being said, they were packed, and there were a lot of happy customers, minus the rude customers who couldn't wait for a coffee."}
{"text":"Authentic European flavor and presentation!  We enjoyed the most delicious linguini carbonara!  The caesar salad was the best I have ever had as well."}
{"text":"I had forgotten how exceptional their pizzas are! Made perfectly to order - Italian food that is some of the best I've had in Arizona - really terrific -"}
{"text":"I don't quite understand what this place is trying to be. It's like an odd combination of take out and dine in that ended up just being more than I could take on a rushed evening in between films.  A friend and I arrived with two others on their way and decided to start off with a glass of wine. While we were waiting, we were pestered more times than I felt necessary given it looked like it should be a relaxing experience and it wasn't very crowded. And we weren't just pestered by one person, but by several. I wasn't sure what role any of them played and the whole thing just seemed annoying and disorganized.   When it came time to look at the menu I was disappointed. I was really hoping for more variety. I've been to plenty of Italian places that serve several dishes that do not contain huge chunks of tomatoes, so I know it can be done. Yet, the menu only contained two items I could enjoy, and for what I paid, I expected it to be better.  For what it's worth a quick run in to order coffee to go is usually painless, the coffee's fairly decent and the price is reasonable. I just don't think I'll head over for dinner again any time soon."}
{"text":"GREAT location - right next to the theaters. However, it's not that impressive if your other choice is Buffalo Wild Wings (sorry BWW hardcore fans, but I dislike \"bar\" food). However, the ambience and attentive and fantastic waitstaff really makes this place memorable.   They were very courteous about #glutenfree, which is always nice to see in a restaurant, the wait staff had no issues asking the chef multiple times on different items. They also provided a to-go cup for my friend who loved their Jasmine iced tea. The food was not mind-blowing, but great for a dinner and a movie kind of night. They looked like they had a great wine listing as well. I was kind of weirded out that the salad came with dressing on the salad, but I guess that's just the kind of restaurants I'm used to - the \"oh we ALWAYS put sauce on the side\" kind of places. My girlfriend really liked the mozzarella sandwich.  Would recommend this for sure if you're in the area (choose this over Outback Steakhouse please) - but I wouldn't go out of my way to go here again. Great to know if you're in the area though!"}
{"text":"First time here. Went on a whim,and were happily surprised. The food was great, flavorful and fresh. While I'm not sure we ever had an official waiter, we were well taken care of."}
{"text":"Cafepino is a cool little bit of everything.  Part cafe, part wine bar, part italian restaurant. and part coffee shop/bakery.  If you're willing to splurge on slightly overpriced but good food, I highly recommend it as a good spot to get a meal or a snack before hitting up the movie theater next door.  My fiancé and I were just looking for a light meal.  We both had sandwiches.  The sandwiches come with both fries and a salad.  The salad is in a small glass bowl, which is a great to keep it all on one plate, but not the hot sandwich and fries with the cold salad.  The salad also contains mixed greens and arugula.  Way better than some cheap iceberg lettuce side salad.  The fries are perfect, crispy, and not salty.  I had the french dip, she had a chicken sandwich, both were good.  The restaurant is big.  It's more or less divided into the bakery/coffee bar and the dining room.  THere's also a nice patio.  My only complaint about the service was the server (who I think he was actually the owner) was a little aggressive in the beginning).  Not in a bad or impolite way.  He just a little pushy about asking what specials we wanted to hear about.  They have entire menu of specials.  We barely had sat down and looked at it, so it was awkward, and confusing.  After that, everything was pleasant.  All the desserts that Cafepino had on display look amazing."}
{"text":"Cafepino saved my long overdue date night. After a bad experience at another restaurant in town, we thought we would try Cafepino for dessert. We were so impressed by the food, the waitstaff, and someone who I assumed to be a manager/owner.   We ordered the chocolate hazelnut gelato special and a strawberry tart. Both were fabulous!!!!  We will definitely be back for another date night."}
{"text":"This is SUCH a great place! Everything I have gotten has been delicious. The pizza is so god and the cream brûlée and cookies and cream desserts are to die for. Perfect place before or after catching a movie at Cine Capri which is just next door. You will want for nothing as they are quick to refill drinks and bring you whatever you need. Can't say enough good things about Cafe Pino! I always make a point to go when I am in Phoenix."}
{"text":"Meh.  If you're desperate before or after a movie, maybe.   But not impressive in any sense of the word.  Bland food, nice owners. But nothing special by any means."}
{"text":"I think this place is fantastic.  I go there for lunch and dinner.  I had lived in across the street for over a year and never noticed this place.  Finally while waiting for a movie I went it.  I only wanted something light like some soup when I heard one of the owners reading the specials to another table and heard him say \"Merguez\" and I was sold.  Merguez is a spicy beef or lamb sausage from North Africa. I grew up on the stuff and it's very hard to find it in the US.  I ordered the tuna sandwich but brought the merguez home.  It not only made my day but the whole week.  The following week I went back with a co-worker and had their burger.  It was perfect!!  The food and the presentation were terrific.    One reason I really love the place and will continue to go there is that they know how to make a proper Café au lait.  Sadly I have yet to find any other place in the valley that know how to make it properly.  I only have one complaint.  Being from the east coast and being used to a higher cost of living, I find their prices are rather reasonable.  However, when I take friends there they tend to balk at the prices.  A $12 burger seems extravagant only to the person who hasn't had to pay 20 dollars for the same dish in other cities.  Just be considerate of who you're talking and you won't be disappointed."}
{"text":"so delicious!  I work right next door. Its casual, but up scale dining. Its a little pricey but it is worth it. I love the olive oil thats intended to dip your pizza in. the workers are all nice and helpful. An italian family owns the resturant. Been there many times with always a good experience"}
{"text":"Fantastic restaurant! The best dining experience I have had in a long time. The food was excellent. Everything was fresh and home made from the salad to the desert. The servers where on top of everything the whole time and were very informative. Very nice restaurant. I couldn't have asked for a better evening. I will continue to come back."}
{"text":"NO PIZZA FOR YOU!!!!!!!  So my wife and I ran into Cafepino for a quick bite before our movie started. In the past we have found the food and service to be okay, and with 40 minutes before movie and slow dinner crowd we thought we would have no issues getting seated and served.   The hostess was very nice and sat my wife and I rather quickly at a table for two. Then for the next 10 minutes (which felt like and eternity) we did not have one waiter or busboy visit the table to either give us some water or let us know that someone would be with us shortly. After over 10 minutes I finally flagged someone down and politely asked them if we could get some service. Another five minutes passed--no acknowledgement.   So, since my wife and I were both a bit irritated and on a time crunch we got up to exit the restaurant. Just as we stood up and were getting our things together the owner (small and stocky middle aged Italian man) asked what we wanted to order. By that time our minds were set and we were ready to move on. I told him rather politely that we had been waiting for nearly 15 minutes without any sort of service and that we were going to pass on dinner there tonight.   Now, a reasonable and respectible business owner who understands that his customers have other choices than Cafepino would have probably responded like, \"so sorry for the delay\", \"please sit down and let me take good care of you guys\", or something to that affect. Well not this guy--he told me and I quote, \"if you leave this restaurant, never come back\"! I was so shocked that I said, what? He said it again, \"if you leave, never come back. Needless to say this set me off a bit as I could not believe the nerve of this guy. After a couple of verbal exchanges on the way out he proceeded to follow us out and verbally abuse us from the patio.   As I alluded to before, my wife and I have visited Cafepino a few times and have found the experience okay. As with many of the other reviews we have found the service to be sub par as they are 10X faster at swiping your credit card then they are at refilling a water glass, but the pizza is pretty good. And with the movie theatre around the corner it is a convenient choice. Suffice to say you need to be aware of the \"Pizza Nazi\"--which is meant in tongue and cheek for those who remember the \"Soup Nazi\" from the Seinfeld days. So, if you complain or get up and leave because of no service, you could have a small Italian man yelling \"No pizza for you\"!!!"}
{"text":"Great recommendations and delicious off the menu items. They have also have amazing french fries on the kids menu."}
{"text":"I haven't been to this place in several years since I moved away from it down to my beloved Tempe but it is still as good as I remember. I didn't have a full meal but instead shared a bottle of Malbec from Argentina and a cheese plate while attending the Phoenix film festival and it was lovely. I love the ambience and the owner and wait staff are wonderful. If I lived closer, or if it was on the light rail, I would probably go more often but location is everything. If you live out in North Scottsdale this place is definately worth checking out. :-)"}
{"text":"Right next to the movie theatre so convenient to grab a bite before or after. I wanted to try the pizza because of their wood burning oven. Unfortunately I was told as soon as I walked in the door that no pizza being served that day. I found this odd due to the fact it was Saturday and more than half of their menu is pizza. I decided to try their Caprese sandwich.  It was decent but not worth $12. My server seemed less than enthusiastic to be there and did not make me feel very welcome. Didn't even say thank you or goodbye even though I walked right past him as I was leaving. They do however appear to have a rather extensive coffee and dessert menu that I will be going back to check out. I was just so turned off by the poor service I had to get out of"}
{"text":"So, as I am in town again, I decided to give Cafepino another try. Not much on the menu has changed... The prices are still a bit steep, especially given that it is summer and there are not that many people in town, but I guess when you are next to the theater, you have a somewhat captive audience.  My meal was actually pretty good. I ordered the Chicken Kebabs. The portion was a nice size and it came with choice of pasta or salad. I went for the salad. The salad was a bit over dressed but the dressing was good. I would have seasoned the kebabs a bit more, but you do need to cook for the masses I guess.  What really got me was the fact that the owner came to my table to bring me my receipt after I had paid and under his breath he made a comment about maybe this time I enjoyed my meal and would write a better review. He just walked away in a passive-aggressive manner. Shortly after he came back by and started talking to another member of the wait staff about me... Don't forget that some Americans speak more than one language.  I have to say that I will not go back... Not because of the food, but rather the attitude of the owner. Good luck"}
{"text":"Just coming out of the movie theatre and hungry with no clear idea of where to eat.  Cafepino was an easy choice so we wandered in for our first experience.    I liked the atmosphere, cool interior with some really nice music playing, appeared to be well-staffed although not too many patrons on this weeknight.  Service was generally good, seems to be a family run establishment.  One huge distracting annoyance was someone cleaning with a broom and dustpan (how could that be noisy??), but this gentleman successfully clunked and clopped in his cleaning duties THROUGHOUT our entire meal. Management was completely unaware. Not very relaxing.  On to the food: First choice - lasagna - \"no we are out\".  Waiter suggested spaghetti & meatballs and we bit.  We were not impressed.  The meatballs were okay, pasta & sauce not too inspiring, served with several breadsticks and nothing more for $14.  Would have been a lot easier to justify the price if it was served with salad or veggies or something....   Caprese salad - no complaints here and the entire platter was devoured. Homemade bread was offered for addtl $2.50.  HUmmmmm, no thanks.  This place has charm and potential but what they offer for the price is no value.  Spaghetti & meatballs (no sides), caprese salad, 1 soda = $30 before tip.  It seems about 20% too high too me.  For a casual stop with movie traffic, they need to reconsider menu and overall pricing.  Sorry Cafepino, there are so many other options in the area, I would not be in a hurry to return for a 2nd try."}
{"text":"Owner is angry and rude to his employees and customers. I came in for lunch but won't be back. it was difficult to enjoy my meal after spending any amount of time in this restaurant. They need to step it up."}
{"text":"This is a hard restaurant to review as to the number of stars. On the positive side, the food was good. We started with the calamari appetizer and it was OK, not great not terrible. We also had the beef carpaccio which was very good. My wife and I split the calzone Vesuvius which was quite good and plenty of food for two.  One of the other people in our group had the rigatoni with chicken and eggplant which he liked a lot.   Now for the negative, the owner is absolutely one of the rudest people I have encountered in the restaurant business. One of the people in our group is a very sweet, reserved, sophisticated lady in her late 70's. She had a couple of questions and when she asked the owner, who was waiting on us, he went ballistic and started yelling at her. She told him she thought he was rude and he threatened to kick us out of the restaurant. There was a mixup, due to him trying to tell us what we wanted to order in stead of listening to us. That resulted in another incident with him yelling at this sweet lady.  I don't care how good the food is, there is no chance I will ever go back there. There are too many good restaurants to give my business to a person like this."}
{"text":"Amazing food with such detail and perfection! Extremely knowledgeable staff and a reasonable price, especially considering how much is made in house! I can't wait to bring my family here"}
{"text":"Usually only frequent this  restaurant after a movie but decided to go at the spur of the moment. Historically we would order the \"Mea culpa\" appetizer  the chalkboard indicates a price of $32.95 & the menu  indicates $29.95 guess they need to update their display of prices.  In either case, the price is ridiculous!  Staff makes you feel rushed & are very unfriendly.  Too many managers (owners) making you feel you have to make a quick ordering decision.  Even for Scottsdale, the prices are out of line. $2.50 for a side order of a few slices,of baguette with a $16.95 entree Really!  It is amazing that this place has lasted this long.in a shopping center with a large turnover.  We wish them continued success but we will never return."}
{"text":"So I hit this place today for lunch with some friends, first time dining there.   My impressions are that the atmosphere is great, very modern and upbeat, different from what you'd expect from the typical Italian joint. We ended up dining on the patio, which was a nice experience. The ambiance out there is perfect, you have shade, some trees, nice stone-topped tables and it isn't cramped by the other tables.   We skipped appetizers and decided to go for some of the signature dishes. I went for the lasagna, since I'd seen it raved about in other reviews here. I have to say that I was somewhat underwhelmed by the portion that I got. It was basically about the four inches by 5 inches and about two and a half inches tall. The very first thought through my mind was, \"That's all?\" To make it worse, they serve it on a plate that is gargantuan, which only serves to make the poor thing look even smaller than it already does by itself. Considering this dish is priced at almost $15, I was really expecting more (a lot more). In terms of the flavor, it was excellent, so no complaints there, but the presentation was definitely not polished or perfected. It really did look on par with something someone made at home, not in a professional setting. Again, for nearly $15, this fell short of my expectations.   The service seemed excellent throughout our meal, with constant and super friendly drink refills and courtesy from all parties we interacted with (including the owner).   Would I go back? Probably if I was someone's guest and they wanted to go there, yes. On my own, probably not likely to return or take anyone else over there. I just can't get past the absolutely ridiculous pricing they have for portions which leave you hungry. I topped out at nearly $25 with tip and all I had was the lasagna and a drink, no salad, no bread, no sides, nothing. I'm sorry, but one should be ashamed to charge that much for so little food unless it is otherworldly good, which this definitely was not. I would give one star for the food but considering we had fantastic service, I offer a second star.   My advice to anyone at Cafepino that is reading this, lower your prices or start giving people more food for the money. Quality is fine, but portions are ridiculous for what you charge. This place could be great if it wasn't pricing itself out of existence."}
{"text":"This place is so confusing even yelpers can't figure out where to place a review for it... http://www.yelp.com/biz/cafe-pino-phoenix#hrid:z2ZnUFQknWPI95C38cz0AQ/query:cafepino  You enter and I'm still trying to figure out if you have to Order at the counter and then if you want to order more from the high presure service then you can order from the table..  Came hear cause \"lightbulb\" the movie I worked on played and WON best picture at the PHX film fest! and this looked like a great Meeting place...  and every time someone met us here... they would sit down and go oh I order up there?  One of the Worst Salads I've ever had I ordered it twice thinking it was a fluke... its just bad...   Tuna melt much better at Paradise...  Vegie sandwich 13$! I saw no safron on there... theres no reason for this...  I want to love this place, love the decor and the owner did seem nice but the rest of the staff seemed pushy...  Grrr...I will come back and hope that its food matches its location and decore..."}
{"text":"The waiter presented four specials for the evening and one sounded great. Pasta with sun dried tomatoes and artichoke hearts. Three of the for of ordered it without asking the price. My wife ordered a chicken dish which came out first and looked over cooked, which was odd. When the bill came I was shocked to be charged $28.00 for thr pasta dish and $2.50 for a very small plate of bread. The lesson here is to ask how much the cost is first. Or a professional waiter would have shared that and then we plan to return which now will not happen..David Brunn"}
{"text":"This is my favorite restaurant in the Kierland area, with a very good location if you are going to a movie at the Harkins 101.  They bake their own bread in house on a constant basis, which is really good however you have it, either with charcuterie platter (the veggie tray has a really flavorful eggplant camponata), oil and balsamic, butter, as the bread in their sandwiches, or as one of my favorites with a light coating of butter with their really good, strong hot chocolate as dessert/ a snack.  Their burgers are good, 9 ounces of beef that they will cook to order (they will go to a true medium rare, which is always very nice to find), and their pizza (which the crust is very reminiscent of their bread) which just tastes really fresh and flavorful (I almost always order the Calabria, which includes sausage and pepperoni, both of which a of a good quality).  My favorite desert here would have to be the cookies and creme, a scoop of vanilla and a scoop of chocolate gelato, with two large, warm, freshly baked chocolate cookies with an abundance of walnuts, but the tiramisu is also reliably good."}
{"text":"I guess they really do have those hidden fees, came with a big group for celebrating and they asked us about the lunch special pasta with a special sausage.  3 of us got the pasta.. it taste just like the 8.99 lunch special however we were charged $26. The sausage it self was over $5.  We were never informed by the waiter. I honestly really loved this place before this but I'm not so sure anymore."}
{"text":"I've always wanted to try this place because of all the good reviews from yelp. So we decided to try it. When I first walked up to the entrance, I was a little tentative and not sure this was the best idea. We tried it anyways and i wasn't disappointed. We were seated right away. The owner was our server and had I had a hard time understanding everything he was saying but the food he was describing sounded very good. He was a little pushy but not sure if this was part of his European background or what. He wouldn't tell us all the special but would only ask us which specials we were intrested in. Sort of strange but he had a long list of specials. He told us that he was going to take care of us and give us a really good meal. He was right.  We had the salad Monaco with grilled chicken and asparagus. This was very fresh with the chicken cooked just right. Tender and juicy. To top off the salad we had the Napolitana and Calabria pizza. Thin crust, fresh ingredients, excellent sausage and 7 pieces for each pizza. One of the best pizza I had in the valley. We topped off our dinner with a chocolate eclair which was out of the world. I'm used to eclair being like a donut but this was like a slice a pizza. Creamy with hard chocolate on top. I would have to say that the food was really good and comparable to another top Italian restaurant in San Francisco North Beach area called BaoNecci Restaurant. The price was a little steep but comparable to BaoNecci. The service was excellent and friendly. They kept on filling our water cups and would take our empty plates once we were done. They also wiped down our table and made sure it was clean. My wife even asked about the salad dressing and they were willing to tell her all of the ingredients and told her it was very easy to make at home. Surprising they actually gave away their secret. You have to be careful what you order here cause it can get pretty pricy but the food is sooo good"}
{"text":"We are here before a movie on Christmas, with my family. The waiter is completely miserable and couldn't be more rude. Unfortunately this place is the only place to grab a drink & bite before our movie. Paco, who claimed to be the owner was horrible and rude. We didn't have food, only drinks but it took at least 25 minutes for 3 shots and ended up being wrong. The waitress was really nice and tried making up for the horrible service but all in all Paco was the grinch."}
{"text":"This was my first time here and I really enjoyed it. It was recommended by my boss who frequents Pino. My first impression was it was warm and inviting. We sat on the patio under the nice shade. One thing I was extremely impressed by was the staffs attentiveness and teamwork. We were checked on throughout our dinner and each person was pleasant. It's a shame to see others weren't given the attention we did by reading other reviews but I never felt like that was the case at all. The pizza was delicious and the creme brûlée was superb. We will be back!"}
{"text":"Incredible Italian meal and service!  I had the Cesar salad and Del Mar pasta, both excellent!  The owner and staff checked in on us multiple times through the meal.  I can't believe this place has been in my neighborhood all these years.   Best Italian dinner I have had in a long time!"}
{"text":"The most amazing thin crust pizza I ever had! Not to mention the atmosphere and service. My fiance and I were very impressed with how each staff member, aside from the chefs, came and made sure that we were comfortable. They made us feel like family! Great food and great service! Get the pizza!"}
{"text":"Interesting reading other reviews complaining about the rude owner too. It is the main reason I will never put my foot in Cafepino again, apart from the fact that it is overpriced. I much prefer to go to AMC Desert Ridge and have drinks and appetizers half price during happy hour at the Yard House, where the manager is welcoming and cares about his customers. Eight of us went to movies and had dinner at Cafepino last month. The food was okay but I had to cancel dessert because it took so long to arrive and our movie was starting in a few minutes. We were there long before the movie started to have enough time to eat. When we wanted to pay separately because everyone didn't have cash, the owner scoffed at us and basically said he couldn't accommodate us, only one person had to pay. We were all shocked at how rude he was and decided to move our once-a-month movie night to a different location. Good job in loosing eight customers in one fell swoop. Bon chance!"}
{"text":"Amazing service, the patio is fantastic and the Banana Split is absolutely to die for!!!"}
{"text":"We have loved this place for years! My favorite is the grilled chicken salad...my husband loves the pizza...and you can't miss the cookies and cream dessert it's amazing :) You can be in and out extremely quick to make a movie etc or take your time and enjoy your meal. It's one of Scottsdale's hidden gems!"}
{"text":"This place is in a great location. I had dinner there a few weeks ago before movies with the girls.  The restaurant was decorated very nice, but the service was better than the food. I though the prices were okay for the location it was in, but then the food came out and it was not so great. I expected better."}
{"text":"I couldn't even begin to give this cafe a one star. My husband and I have a lived in S.F, CA & Sedona, AZ.  Never to  experienced an owner talking to us in the manner his address us. At one point I want to call 911 because my husband thought he is crazy. We have travel the world and I never experienced an owner yelling, threatening me & our guests. I have lived in New York & Europe as a fashion editor never experienced a human being of his class. The food was not edible - only as if you we're going to McDonald's after the movies. The only reason we went there was our guests knew the chief that was not working that evening."}
{"text":"Don't eat here the chicken smells so bad and they don't even use romaine lettuce in their salad. Glass of Cabernet was from an open bottle tasted so flat! And even when we complained they didn't offer ANYTHING else... $20 salad is better at Mastro's"}
{"text":"Cafe Pino is another new restaurant that needs to get it's act together.  Let's start with what we liked. -It's convenient to the Harkins Theatre, right next door -The decor is great  Now for what we didn't like: -We walked in and couldn't figure out if we were supposed to order at the counter or be seated and waited on. Turns out it could be either. That makes it too confusing, they need to make up their mind what they want to be. -The food is well, just okay. I think with some practice they could get it right, but for now they need some help. -The prices are high. Yeah, I know, food costs have gone up, but for the portions they serve, the prices are still too high.  We'll give them another try (my partner says he won't--but we will) and take more time to figure out what to order."}
{"text":"When I walked in to this establishment i really wasnt hungry but my friend was so we thought wed give this spot a try. I am so happy we did! First of all the service was amazing. The owners im assuming were SO incredibly welcoming and kind. We ordered pepperoni pizza and some chicken alfredo pasta. Both were AMAZING. My appetite grew quicky during our visit as I have never had such good food in my 30 yrs of living. The food was VERY flavorful and delicious. The creme brulee was also very good! worth every penny. we will be back!"}
{"text":"Delicious what a pleasant surprise. Loved their French dip, latte and chocolate mousse will come back"}
{"text":"Went to Cafepino with a group of 8 just before seeing a movie at the adjacent Harkins.  I was a little apprehensive when we first walked it, the place looked too fancy to be next to a movie theater.  After only a few minutes, though, I realized a better description was \"trendy casual\" ... not too loud, not too pretentious, and essentially just right.  We let the waiter know what time the movie was to start and he worked backwards from there assuring we would be served and finished in time.  In fact, 6 of our party had already ordered and despite that our orders were taken about 10 minutes later our food was served just slightly after the rest of the group.  Our server was exceptionally attentive and on top of his game.  He was there when needed and not a pest when he wasn't.  Used plates, and unused settings were removed swiftly and efficiently by the busser.  It was half-price wine night, which encouraged us to buy several bottles of wine.  We may not have done that otherwise because the wine prices were out of scale with the food prices and the ambience of the restaurant.  At half-price, the bottles were reasonable.  There was a variety of food ordered by our group.  I ordered a French dip (despite the cuisine leaning toward more of an Italian genre).  It was, to me, just the right size, served on a fresh baked roll with caramelized onions and a somewhat tasteless au jus.  I preferred that it was more tasteless than the overly-salty au jus I have had at other restaurants.   The meal was served with a large portion of really good shoestring fries and a creative little pre-dressed salad and accompanied with small crocks of ketchup and horseradish.  At under $14.00 it was reasonably priced.  Other guests' meals were attractive looking and everyone remarked that their food was very good.  Most menu items were priced reasonably, maybe slightly high considering the movie theater mall location.  I think what makes Cafepino run so well is the fact that one of the two owner/partners stood dead-center in front of the open kitchen facing the dining area and acted like the captain of a ship.  His eyes were on everything that was happening and he was constantly giving subtle hand signals and calling in team members for quick verbal instructions.  He inspected every meal before it was delivered to the tables and made several quick rounds to greet his guests and assure their satisfaction.  I truly have never seen such involved, personal (but yet subtle) involvement by a restaurant owner.  My star rating is based, in order, on quality of food, quality of service, and value received.  Value received brought the overall down slightly because I don't think most people expect to spend as much for a meal prior to seeing a movie and those that do spend that much probably won't go out of their way to dine at a casual restaurant in a mall next to a movie theater."}
{"text":"Excellent food! Very attentive and nice staff... great selection...and a good spot for lunch... i used to go to Whole Foods to grab something quick, but it never tastes that good.. I spent the same money at PINO, and was very satisfied... bread is delicious!"}
{"text":"Very attentive staff, great four cheese pizza (thin crust).  Our daughter comes here frequently."}
{"text":"We love that place and are regulars because I love how they cook, present, and serve the food. Service is 5 stars European. We love that lovely patio and my husband is big on fresh pasta dishes!!:)) Merci!!:)) xoxoxoo"}
{"text":"A couple friends and I came here after seeing a movie.  We quickly looked over the menus that were outside before we went in.  Since it was a Sat, they had brunch until 4 pm.  We were seated at a table and given all the menus except the brunch menu.  After a few minutes, the employee returned and I asked if we could have the brunch menu which we saw outside.  He seemed annoyed, but returned with a couple brunch menus.    We were not \"served\" by the regular wait staff.  This was either the owner or manager.  He did not have on the same uniform as everyone else.  After several minutes, he came back to take our orders.  Two of us ordered french toast, the other two decided to split a pizza.  The server then asked if they would like a \"side salad\" to share.  They agreed.  I ordered a cappucino in addition to my french toast.   The food came out relatively quickly.  The french toast was excellent and from what I could tell, my friends really enjoyed the pizza.  The server did not return at all during the rest of our stay.  My friends were out of water and noone ever came back to refill.  We finally flagged down our server for the check.  Once the check came, we all were shocked!!  My cappucino was $6!  That was a $1 less than my entire meal!  The two friends that split a pizza, realized that they were charged $12 for what they thought was supposed to be the $4.95 side salad from the menu.    My friend did address the issue with the cost of the salad with the server who then proceeded to ask, \"well did you eat the entire salad?\"    After some conversing, they agreed to reduce the price to the $4.95.  We were just digusted with the overall lack of service. and even though the food was tasty-- it was completely overpriced for what you actually got.    We paid our bill, left and do not plan on ever coming back."}
{"text":"I had been to Cafepino for lunch earlier this year with my sister. She liked it a lot, I thought it was just okay (we ordered the same thing, so go figure). I went back for dinner last night before seeing a movie. It was an enjoyable dinner. I told my boyfriend that it made me feel very European.   We ordered a salad and pizza from their menu of specials. The salad had sun dried tomato, radishes, fennel, and olives. It was served with an herbed olive oil dressing. I added a splash of balsamic vinegar. It was a nice, light salad. We also ordered some fresh baked bread to accompany the salad - it was delicious and made me anxiously anticipate trying the pizza crust.   I wasn't dissapointed. Excellent pizza crust. The pizza was topped with red sauce, mozzarella, proscuitto, and arugula. It was a really great combo of flavors.   The service was very good - everyone was very nice and attentive. A lot of people were there enjoying glasses of wine and yummy looking cheese platters that I'd like to try. Overall, Cafepino is not a place I'd go out of my way to go to, but would gladly go to if I'm in the area or before or after a movie."}
{"text":"The cutest hidden gem!!!! I was on my way to a movie just stopped in for a cup of coffee! And I was BLOWN AWAY. I'm from Seattle so I'm a huge coffee snob. This is hands down the best mocha I've had in my life!!!!! I will be back for food next! Get the mocha you won't be disappointed"}
{"text":"My wife and I were patrons two years ago, and we had a good meal and experience.  We took friends their tonight. I saw the owner, and asked him if he knew a server at La Cucina in Scottsdale, and he angrily said no.  The four of us were seated and it took some time to place our order and even get four waters.  My wife ordered a salad with salmon, our friend ordered a grilled vegetable salad entree and and our other friend and I each ordered minestrone soup and grilled chicken marinara as our entrees.  The grilled vegetable salad (which was soaked in dressing) came within 5 minutes along with our soup.  The soup was spicy and looked like beef vegetable soup that you get from a can.  When the owner walked by, we asked if the soup was minestrone, he curtly said yes. My friend took two spoonfuls and left the rest. My wifes salmon came soon after the soup being served. When the salmon dish was served, my friend politely asked the server for another salad with no dressing. My wife and friend finished their entrees, and we were still waiting for the pasta dinners.  The server was delivering entrees to other tables who were seated after us.  We still waited and waited.  We were so dismayed  about  not receiving our pasta dinners, I told the server to forget it, after which the owner went into a verbal tirade.  He called us \"a..holes\" and told us to get out. He was yelling so loud, that everyone in the restaurant heard him.  He said he would have a mind to dump the salad on my friends head. He kept on yelling \" go to La Cuccina\". It was apparent the if we didn't leave, a physical altercation would have ensued. I paid the bill because I was afraid of my well being.  We left without eating. We would not recommend anyone patronizing this establishment."}
{"text":"Absolutely love this place. The food is fantastic and the owner and waiters are always at your service. The restaurant has a beautiful ambience and classic jazz music. Lovely way to spend the evening with loved ones and friends."}
{"text":"We really like this place. For example tonight the owner comes over to see how we are doing. I say we are trying to decide what pizza to get and he says tell me what you like and I'll make it for you. The food is always fresh and yummy. Love their Sangria as well. Their patio is beautiful, we love sitting out there when the weather allows."}
{"text":"I don't understand why this place is still open. I ordered the endive salad which had nice toppings but the endive was inedible had had no flavor. Also the salad was huge and endive was 90% it. My friend had a chicken penne pasta that I could have easily made better at home and I am not a good cook. The service was overwhelming at first, we were greeted by three different people, then half way through our meal it was nonexistent. We watched a busser service all the tables around us while our server had disappeared. Even a man who appeared to be a manager/ owner cleared the empty plates from the diners next to us, offered them dessert and coffee and delivered their dessert. Meanwhile, my guest and I seemed to be completely invisible. I assume this is because we both had most of our food still on our plates and no one wanted to ask why we hadn't eaten it. Still no server around, the busser finally comes and asked if we are finished, we say yes and he takes our mostly full plates without concern if we enjoyed it. I didn't volunteer any info since the service was so bad I wouldn't go back even if I liked the food. I work in a restaurant so I know the difference between a server who is swamped and a lack of interest."}
{"text":"I was shopping with a friend in Scottsdale, and we were recommended to go to PINO for lunch..  We sat outside on the patio and shared the Falilo pizza & Monaco salad. Both of which were super good & not too expensive for the quality!! Highly recommend. I took a biscotti to-go -- amazing biscotti by the way.  Will definitely go back soon!"}
{"text":"We were looking for a little place to grab a late night sandwich, and this place filled the bill plus had a nice atmosphere for conversation and drinks. I didn't explore the pizza menu which seemed quite diverse, but perhaps another time when I'm hungry this will be a promising place to return. Not stuffy but yet not fast food, but still a good place to have a meal before catching a movie."}
{"text":"My wife and I popped in here a few times in April during the Phoenix Film Festival.  Both times we visited the staff was great and the food was on point.  Will definitely be back."}
{"text":"Every time I come here I am very satisfied.   The food is seriously delicious!   I always get the pappardelle with pastor sauce.   It's homemade pasta.  Oh,  and the cappuccinos are THE BEST!  They never disappoint ... ever.  The service is impeccable.   I love this family run restaurant and I highly recommend it."}
{"text":"This restaurant doesn't even deserve one star!! We went to have a meal before the movie and decided to try Cafe Pino. The endive salad was terrible, no taste, and overpriced! We told the waiter that we did not like it at all and he started to argue with us! He said that the other table just had four of those salads and THEY LOVED IT!! Very arrogant. I think he must have been related to the owner, otherwise, I think he would be fired by now. All the waiters walk around looking so miserable, no one smiling, just rushing around. No one came to our table to provide additional ice tea. Overall, the service stinks and the prices are inflated for what you get."}
{"text":"Horrible. Served us the toughest pound cake we ever ate. God knows how long ago it had been baked or resurrected from the pits of unfresh.  Goodbye precious $5 + tax."}
{"text":"Great place, great food ,awesome service and the price was very fair. The world could use more places like this. Everyone that worked here was very passionate about their job."}
{"text":"Always great food and the best service!  Love this place!  Have been here at least 20 times and never been disappointed!"}
{"text":"A favorite restaurant with an exceptional staff. The service is second to none, very nice atmosphere, relaxed but upscale, and  the food is great. Definitely recommend"}
{"text":"Great atmosphere, Great Service! AND EXCELLENT FOOD!  There are many good places to eat in Scottsdale and Phoenix, but not everyplace with great food has the atmosphere and service to make you always come back. I have eaten here numerous times and the quality of the food, especially the pizza, is fantastic (I love thin crust pizza). They make the bread right in the brick oven, and many other items are delicious, which is why I always come back (I work close to here).  Yesterday I decided to have desert first, yummy! Amaretto Baba w whipped cream n caramel sauce Very moist cake, with just the right amount of cream and sauce.  I also treated myself (I have three kids under 4, so my wife and I need a place to relax, this is my first choice, with or without the kids, good family restaurant). My drink of choice: Monte Cristo - double espresso, grand marnier, kahlua, baileys, milk, whipped cream; served nice and hot, wish I had a picture to show you, would make you desire one from your computer, and not available at those multiple coffee houses. Drink and desert was filling, so had a sandwich for meal: Caprese sandwich, fresh mozzarella, tomato, shaved parmesan, basil, extra virgin olive oil; I swear this french owned place has hidden my Italian family in the back; all the dishes I try remind me of some place in Philadelphia or my family picnic!  What I also love is that I am supporting a local business. Being a business owner myself, I know how important it is to buy local, so I give my repeat business to as many local places as I can. When my family is in town, this is the perfect spot for lunch or dinner and a movie.  Cheers!"}
{"text":"Clean, varietal, always consistent good food. Need folks like this staying around! It's right next to the movie theatre so its a great place to get some pre-movie food too."}
{"text":"Ran out of my house by realtor showing it so I came here for breakfast. Eggs Benedict - excellent. And the home fries are very good as a side. Good Bloody Mary but if you ask for it spicy, beware. Good but beware."}
{"text":"People complain about the owner, but I found him charming and authentic.  He's there to run a business and serve good food, and he did just that.  I've only been here once, and the pizza and pasta was great.  They were able to handle a large group of about a dozen people with no problem, and the food came quickly.  I did rate it a 3 and not a 4 as the name at the restaurant does not match their website which does not match their google search, so it was a bit too difficult to find when it should have been easy."}
{"text":"The food quality was great, minus perhaps a bit of under-seasoning on the chicken.   The owner/manager was a very nice and accommodating frenchman. However he was moderately pushy to get us to stick around when we walked in and just explained we were scoping out the menu first (due to dietary restrictions). He explained to us the 'special' salad and that it \"came with chicken or shrimp, our choice.\"  As stated, the food was delicious, however to my surprise, 2 salads and 2 iced teas equated to a $48 check. The chicken was an additional charge per salad and they must be very proud of their tea.  in conclusion, overpriced for what they are. Deceptive in how they explain menu options to you. But, on the upside, their food is very good."}
{"text":"Just left this place where we wanted to eat after a movie. We entered and the manager was asleep behind the bar, not a great start. We ordered (from the manager)a mushroom pizza for one of my boys and a pasta dish for the other. I had a ceviche and asparagus soup. The pizza came and there were no mushrooms which we mentioned to our waiter but told him it was fine, they'd just eat the cheese. When the pasta didn't arrive we mentioned that to our waiter and the manager came storming out and was visibly angry. He denied that we had ordered the pasta and said \"I can cook some mushrooms for you in a minute\", sarcastically. I said it was fine and that the boys would share the pizza and he threw his hands up and said \"well why did you get me out here then?\" and stormed off. I NEVER asked for him to come out. He NEVER apologized for his mistakes and we decided to leave immediately. He charged us full price despite the fact we hadn't eaten anything and had simply sat and been shouted at. I simply don't understand how anyone could say the service is good here. My husband and I have had similar but not nearly as bad experiences with this man before. How could he treat a mom and her 2 sons like this when we did absolutely nothing wrong? I'm so upset and obviously will never, ever eat here again."}
{"text":"Wonderful flavors and freshness.  True French personality.  Salad Nicoise and bread were delicious.  Good aromas and atmosphere."}
