{"text":"C'était vraiment bon.  Les tapas étaient délicieux.  J'aime vraiment la diversité des plats!!  Pas trop cher pour le service et la qualité des plats!  Nous allons revenir!!"}
{"text":"This is another great find in my neighborhood. They serve small portions of many different dishes. It's kind of like tapas, but this is the Basque version of tapas. I would describe it as mix of French and Spanish cuisine.  It's not cheap, nor is it overpriced though. Everything we had was excellent and it was well worth the investment. They have some very good wine and the service was excellent too."}
{"text":"This was my second time at this restaurant and it's been about a calendar year. We had a really wonderful dining experience then, it was equally good, if not better, this time around.

One of the things I really love about this restaurant is the staff. They are always very courteous, patient, and offer really good food/wine suggestions. 

The menu was more or less the same as on our last visit, but that was fine with us because we ended up revisiting a lot of the same plates. The quail, clam and artichoke, blood pudding, scallop, and stuffed fig dishes are favorites of ours. My boyfriend and I usually order 8 plates and share. 

The tapas at this restaurant are so creative and well-presented that other tapas restaurants that we go to pale in comparison. We are looking forward to our next annual trip to Montreal so we can eat here again!"}
{"text":"Fantastic intimate little restaurant with great staff and amazing food. 

Tapas were absolutely DELISH!!  We ordered 16 tapas between 4 girlfriends (2 each of 8 different ones), and only had room to share 2 desserts (I have to admit we are not big eaters).  Tapas are presented in groups based on increasing texture/heaviness.  Each dish was 2-4 bite sized, flavors very complex and complementary.  And also an extensive Spanish wine list.  Our server recommended a beautiful white wine based on the flavors we enjoyed.  Very reasonably priced wine.

Loved loved loved the restaurant.  Would come back again and again."}
{"text":"Outstanding! Great tapas! Great service. Loved the fact that the wine list is only spanish and that the waitress are knowledgeable about it.
Will go back as soon as I can."}
{"text":"After reading so many good reviews of Pinxto on Yelp, I made a reservation for 2 on a Saturday night. The waitress recommended sharing 4-5 small pinxtos (portion is smaller than a tapa) and 1 main course to share between the two of us. The service was great and attentive, but we found the food just quite average:

Foie gros torchon: was decent but it didn't give us the \"wow\" moment

Scallop with Chorizo: the scallop was charred on the surface so the burned flavour instantly overwhelmed the taste of the scallop, which was a pity since the scallop was nicely cooked inside, it was soft and wasn't dry at all.

Stuffed Calamari: it was pretty blend and the squid tasted qutie fishy.... would not recommend this dish

Black Pudding with Apple Chutney: by far our favourite out of the small plates we ordered. It was served with a sherry reduction. 

Grilled Octopus with Chorizo: the octopus was too dry and my boyfriend commented that \"it tastes more like chicken\".

Fillet Mignon with goat cheese: we ordered it medium rare, the beef was cooked well but it lacked a bit of seasoning. the goat cheese overpowered the taste of the beef just a tiny bit. 

Final Verdict: the restaurant is really cozy and I heard from other Yelpers that they have a great selection of Spanish wine. Service was good but the food was somehow mediocre. We had cocktails too and they were pretty good."}
{"text":"My friend and I are visiting Americans and wandered into Pintxo last night and ended up having a wonderful meal and perfect evening. Our apartment is not far at all and I passed Pinxto a few times our first few days in town. We couldn't find a good dinner spot last night and finally decided to give Pintxo a shot. We were so glad we did. 

The service was terrific. Very attentive and communicative staff. We had to wait a little bit, but were treated so well the entire time. I mentioned we were celebrating my friend's birthday and ordered a chocolate cake secretly before we were seated and it arrived in perfect timing with a candle at the end of the meal. It was delicious. 

As was the rest of the food. We weren't starving, so we didn't get to try as many pintxos as we would have liked. The strawberry gazpacho was amazing and the crab and prawn duo was very tasty. We shared the filet minion, which was perfect. Our drinks were very good as well. We've had a lot of trouble finding good cocktails around Montreal, but Pintxo had really terrific ones. I'm sure the wine experience is great, but we did not partake. 

Overall, it was a perfect evening. We are both going to rave when we get home to the US."}
{"text":"This place has mostly excellent food in very small portions. The grilled artichokes and clams with ham was delicious, as were the bulk of our dishes. The beef carpaccio with fried capers and manchego was great...but all of the meat and cheese could have been crammed into a soda bottle cap had it not been spread out razor-thin. What granted this place four stars was our server, Laurent (sp?), a lovely lady who was attentive and selected the perfect wine for us. The venue is cozy and the lighting is perfect but Laurent made the night for us. We would go again."}
{"text":"Went here for the first time with a group of 6 for my birthday and really enjoyed both the service and the food.
2 of the group ordered the menu degustation, which really is a great deal depending on the chef's choice of tapas.  As mains, one chose the braised beef cheeks, which were so tender they melted in one's mouth.  While the other ordered the sliced duck, which was quite good but one must like rarely cooked duck (which I do).  One of our group ordered the filet mignon and it was cooked perfectly and the accompaniments were quite delicious.

Now the other 3 of us ordered a bevy of tapas to share, which included the following
Highlights:
Great wine selection!
Foie gras torchon was actually some of the best foie gras i've ever had.  Unlike most foie gras, which can be quite bitter, this one was buttery with a great flavor to it.  
Grilled chorizo and octopus was made perfectly!
Seared scallop with bacon tapenade
Garlic Prawns in red pepper sauce (the sauce is great for dipping bread in as well)
Stuffed fig with serrano ham 
Goat cheese raviolis in duck stew
Bison ribs

Alright: 
Asparagus with ham was good quality ham, but could make this at home if I just purchased a good quality serrano ham

Would not order again:
Crab and Shrimp Piquillo was too fishy for my taste and had a mushy texture that I did not like 
Snails and wild mushroom lacked flavour

Overall a great dinner and great place to share a meal with friends.  We all left very satisfied and very full.  Price came out to about $60/person including the 2 bottles of wine that we got."}
{"text":"A great place...the pintxos are the right size and the flavors are perfectly balanced! Great choice of private wine importations. A definite must in Montreal!"}
{"text":"We went for lunch. Nice service, killer food. 

Highlights: duck confit ragu and mushrooms, bison ribs, and the grilled vegetables (believe it or not).

Why not five stars?  They said they couldn't bring us extra homemade BBQ sauce that they put on the ribs."}
{"text":"Every so often, you find yourself at a cross-roads. 
On one hand, you want to keep it a secret because you worry about not being able to get a seat at your favourite table. On the other hand, you want to shout from the rooftops that \"EAT HERE!!! IT IS AMAZING!!\", because no one should ever have a bad meal.

So having remained tight lipped on this place for a few years, I think it's time to share. 
This is a cosy, warm and well thought out restaurant. The menu does not change too much (some specials) and is consistently executed well. I have yet to have a badly executed plate.
As far particular dishes, I would say that you could order blind and you will be happy. However, my favourite dishes are:

- Poached Octopus
- Crab & Prawn duo
- Wapiti Carpaccio
- Calamari w/ Onion confit
- Cod Filet with a pepper/tomato sauce
- Tower of grilled veg (unbelievable)
- Half Quail 
- Bison Cheeks
- Mushrooms with Duck Confit (holy f**k amazing)

Add to that a reasonable wine list and the consistency with which the kitchen pushes food out and you have the sort of place you can keep going back to forever

Fun fact: I have gone to Montreal just to eat here about 10 or so times!! That means, I have taken an overnight bus from Toronto (16 hrs round trip) just to eat here..10 times."}
{"text":"Great Restaurant!

The food was delicious, meticulous and presented very well. My girlfriend and I ordered 10 small plates to share and it was just the right amount of food. The wine was good and the service impeccable. We sat in the left part of the restaurant and the atmosphere was lovely. I would go back any time. Well done!"}
{"text":"My friends and I stumbled upon this restaurant after a day out in Mont Royal. We're a tough crowd to please but this place was so so good. The tapas were flavorful and a good portion size. They staff was also accommodating in seating is quickly without reservations --which can usually be hard with a group  of 5. Would definitely go back! Highly recommend the mussels and the octopus salad."}
{"text":"I have been to Pintxo so many times. And always loved my experience. I am spanish so i know exactly what pintxos are. I tasted spain in every of my plates. Last time i was there we decided to order about 10 pintxos, the choice of the chef knowing that my friend was lactose intolerant. We had great recomandation of wine. And everything was perfect
One of my favorite thing to eat is the morcilla. 
And what i eat everytime is the chocolate creme brule with a glass of Dulce. Please try it!!!"}
{"text":"Amazing experience. Great food and the best service ever! We were visiting from New York City and chose this restaurant because it was highly recommended by the owner of our B&B. 

The food was great -- especially loved the scallop with chorizo, but every one of the 9 or so pintxos we had were great.  Honorable mentions--the veal medallion & the crab and shrimp stuffed piquillo. 

I especially want to mention the phenomenal service. Our waiter was patient, attentive and refreshingly cheerful. It really made our dining experience one of the most perfect nights out ever. 

If we ever return to Montreal we will definitely go back!"}
{"text":"This was the fifth visit to this terrific place. Each plate is better than the last. 
The rabbit, gazpacho and any dish with chiorzo is yummy.  Uniques wines. Lava cake for dessert was sensation.  All around great food an service. Hope to make a sixth visit soon."}
{"text":"My wife and I went there tonight.  The menu is simple, but the combination of food and flavor is perplexed.  We had a number of dishes and we liked most of them: Beef carpaccio (love the combination of parmesan and beef), quail on macaroni (tint of sweetness), duck tartare (very appetising with the capers), artichoke clams (instead of using lemongrass, the chef skillfully use the sourness of the artichoke in the broth), lobster tail, garlic shrimp, seared scallop (cooked just right) and passionfruit dessert with crumb base and chocolate ganache (this is my wife's favorite)

The bill comes to $75, which is not too bad knowing the food is exquisite and delicious.  But, don't be surprised by the wait time of the food and Pinto size of the dishes, the two of us were pretty full from the meal :) By he way, the staff were friendly and helpful."}
{"text":"Great tapas, great service. Would recommend about 4-5/person. Really liked the duck tartare but everything is good. We ordered 10 tapas and not a single one was bad."}
{"text":"Si c'est bon? Oui. 
Si c'est mémorable? non. 
Si c'est cher? Oh que oui!

Quand j'y suis allée, nous avons pris le menu dégustation et de la façon que ce menu était expliqué, nous nous attendions à 5 services, mais non. C'était seulement un plateau avec 3 bouchées différentes pour commencer et deux plats minuscules à partager. 

Nous avons dû commander autre chose parce que nous avions encore beaucoup trop faim.

Le service est convivial et l'ambiance est agréable pour un souper en amoureux tranquille sans fla fla.

Outre le prix, c'est un très bel endroit."}
{"text":"My favorite restaurant since 2006.  The quality and presentation of the food is exceptional.  The staff is attentive, friendly and professional.  If you want to impress a date or a client that knows something about food and wine, then this is a great place.  Quality / price ratio is hard to beat.  Oh and they have the best Torchon de foie gras in montreal.  A must."}
{"text":"Wonderful discovery  for us though it has been around for 7 years and one of the best all around resto experiences. 
Food was fabulous and atmosphere was cozy. 
Staff was very helpful and knowledgable.
You can actually have a conversation because there is no noise."}
{"text":"WOW c'est la 4 ieme fois que j'y vais et je suis toujours épatée. La bouffe est incroyable! Les Pintxos sont assez gros pour partager a 2 personnes donc si vois êtes plus doubler les portions ( surtout pour le plat de pétoncle) Mon top 5; le tartare de betterave, les pétoncles, le Chorizo/Pieuvre, Boudin, Artichaut  & La Morue. En résumé bouffe et service extraordinaire! À essayer!"}
{"text":"I went here around valentines day of this year and couldn't have been more pleased about the food. Despite going to most of Montreal's reputable restaurants Pintxo had somehow flown under my radar for 4 years.
Portions were a perfect size for sharing and not one tapas was bad. I highly recommend trying their spicy sausages"}
{"text":"I'm lucking enough to live right around the corner from many restaurants in montreal, and was excited to try this Spanish restaurant, 

We came in on a Monday night and it was not too busy. My partner and I wanted to try the tasting menu ($38 each) and you can have chef selective apps and your choice of a main (these range from $27-35 on there own). However we decided we would share the rib eye main ($44) and get the tasting menu for this, the food came and was good, and we were ready to head out when the bill came, it was to our surprise that we both got charged the $38 plus an extra $16 for the rib eye. This was shocking as usually it's only an extra $12 dollars for the main to become a 3 course meal. But we were charged an extra $48 on top of the $44 ($92) After asking the waitress and explaining that it did not make sense and the menu should probably be worded differently or should be explained better if you wanted to share, the manager decided to angrily confront us saying we are the first people to ever be confused.

I then asked if I were to order the rib eye alone as a tasting menu what would I pay, this would be $38+$16 ($54) and my partner then could have ordered a different main as a tasting menu for $38. (Total $92) So we would have had payed the same price and would have got a second meal. This really is crazy. So if you ever go here and want the rib eye, make sure you order it alone and get your partner to get a different meal, even get it wrapped to go if your not hungry, For some reason you will get charged the exact same amount. This would be smart, as the food is good and the service was good. 

The manager eventually decided to give us a discount for a future visit. Which I will be using for my next visit to this Spanish restaurant."}
{"text":"Great wine and interesting tapas. Limited gluten free options and not always friendly service for English speakers! Must try the fig serano Ham and monchego cheese dish!"}
{"text":"We love Pintxo and it's wonderful menu of pintxos (it's Basque, not Spanish). The beef cheek was ever so tender. And the Foie Gras is always wonderful and melts in your mouth. The service may be slow and the only reason that I didn't rate higher. It really is as good as it gets, if they can get it to your table more consistently."}
{"text":"What a meal! Pintxo is Basque for tapas, and this place does a creative take on the little bundles of flavour that spread around the world from Spain.

Tip #1: Skip the boring-sounding main dishes, and order a bunch of pintxos (pronounced \"pinchos\").

Yes, the plates are small, but contrary to what another reviewer said, not small for the price. The torchon de foie gras for $7 would have cost double that in New York or Toronto. Strawberry-red-pepper gazpacho was $4 - a smallish bowl to be sure, but quite enough to start the meal, and really tasty.

Other highlights of our meal were the scrambled eggs with cod; salmon carpaccio with yellow beets and goat cheese (served chopped, like steak tartare); and boudin noir with apple. The waiter recommended five to seven pintxos per person. My better half and I shared 12, and were too stuffed for dessert.

A good list of Spanish wines is reasonably priced. The bill - 12 dishes and a bottle of wine - came to $140 plus tip -- very reasonable for the quality of food and service.

I can't wait to go back!"}
{"text":"This is the second tapas place I've tried , and it did exceed my expectations . Portions are small of course but the flavors will leave you wanting more to taste. I've come here twice and enjoyed myself immensely . The atmosphere is quaint and cozy. Wines compliment the food. Service is great."}
{"text":"Je dois être nostalgique de l'endroit original. Ici tout est approximatif, incluant l'accueil, le service et hélas le repas qui ne vaut pas le détour."}
{"text":"Went for dinner on May 3rd, 2014. Went some time ago and wanted to revisit. Decor is great and service is attentive and friendly. The place is owned by a gentleman from Mexico who worked in Spain before, precisely in the Basque country. While the food is Spanish, it is not 100% Basque and  many regions of Spain are represented . We shared one main and a degustation menu ( 4 pintxos and one maint $38.00, a great deal).

Pintxos were the following: cream of mushroom, duck magret and lentil salad, foie gras and a stuffed fig (Mahon cheese and Serrano ham.)
Mains we had were salt cod (bacalao) with virgin sauce, grilled cherry tomatoes and mashed potatoes, and also duck magret with saffron risotto. Dishes were all very good, full of flavour and well-executed. However, the weakest link here was the stuffed fig. While the sweetness of the fruit can be well paired with saltiness, Mahon cheese and Serrano ham together overpowered the fig. I would have preferred to feel a better balance, a better flavour contrast.
We split a dessert, tarta queso, a chessecake made with Spanish cheeses that was sweet but just enough and very satisfying.
Libation-wise, we each had a fino (Rama, $11) , which is one of the best aperitifs one can ask for, and we had a bottle of  Spanish white, a Rias Baixa Terras Gauda 2011, crisp and refreshing and perfect with all our food selections. I was disappointed by my coffee, which while good, was not a Cafe con leche but a cafe latte. Booh. Do I have to go back to Madrid? I think so!

Overall though, Pintxo is a gem. A small, cozy place that serves great food with the best ingredients. You will have a wonderful meal."}
{"text":"Excellent petit bistro a tapas, ici nommé Pintxo (prononcé Pintcho), l'équivalent basque du premier. 

C'est très petit alors il faut réserver d'avance ! Le menu regorge de bouchées ou de plats principaux nous faisant saliver : pieuvre grillée, canard fumé, morue noire, pétoncles, chorizo, et autres !  On nous recommande 5 pintxo par personnes, mais pour moi 4 a été amplement suffisant (32$ en tout, pour 4). Vous avez le choix de les prendre a la carte et d'agencer ce qui fera vibrer vos papilles, ou bien de prendre le menu midi, tout aussi délicieux, mais choix du chef ( et plus abordable aussi..)

Comme les photos le démontrent, il y a un cellier a vin, donc plusieurs importations privées et autres nectars a déguster ! Ne vous laissez pas rebuter par les apparences simplistes de la façade, c'est une vraie petite caverne aux merveilles !"}
{"text":"This place is hands down one of THE best restaurants in Montreal! Small and cozy, the atmosphere here is always great. I've been 4 times, and have never been disappointed. Amazing tapas, even better waiters who don't stick to you so much yet are magically always at your table the second you even think you need them. Amazing service, good prices, and an overall fantastic experience!"}
{"text":"El Pintxo, ou quand un petit poucet viens jouer dans la cour des grands.
Étant d'origine Basquo-landaise et amatrice de bonne cuisine (on ne vient pas du Sud-ouest de la France pour rien! ;),  je suis plutôt exigeante question grande gastronomie. 
Pintxo est tout simplement l'une des meilleure experience culinaire de ma vie. 

Les produits sont extrêmement frais, les saveurs inédites et le cadre aussi chaleureux et animé que dans une peña de San Sebastián.
Plutôt que de prendre des plats nous avons opté pour des pintxos (petits tapas): Gaspacho de fraises et poivrons rouge, carpaccio de Wapiti avec vinaigrette de chardonnay, chorizo et pieuvres grillées sur purée de pois chiche à l'encre noire, Txipirones  au confit d'oignon, figue farcie de jambon serrano et fromage mahon, duo de chorizo grillé couronné de boudin noir, Raviolis farcis de fromage de chèvre avec gésiers de canard, Mariage de crabe mariné et crevette avec poivrons etc.

Difficile d'expliquer le bonheur ressenti à chaque bouchée, juste l'impression que mes papilles étaient sur le gros party! la figue farcie et le duo de chorizo sont même allés jusqu'à nous déclencher des fous rires.

Bref nous avons été totalement conquis, Alonso Ortiz est mon nouveau héros.  

Pour le prix, nous en avons eu pour environs 50$ taxes et vin inclus chacun. 

Ah oui, et vous ai-je dit que les serveurs étaient adorables?"}
{"text":"My boyfriend and I went to Pintxo based on a recommendation. And it was well worth it. 

Although I write the review being a vegetarian, my boyfriend is not, and we got a full range of foods from the menu. Most of the menu are pintxos, or small plates, where you and your companions can pick and share from. The waiters will tell you 4-5 plates each person is recommended, but 3-4 is more than enough.

The plates were delicious. We tried everything from quail, escargot, manchego cheeses, and lobster tail. Everything was delicious.

The wine selection was great, and the servers can give great suggestions on both food and drink. Everyone was extremely friendly.

The only reason I have 4 stars instead of 5 was that there were very few vegetarian options, and also by the time we got there around 8pm they were out of some of the foods already. Otherwise it is a great place to eat."}
{"text":"The last night in Montreal, we had the pleasure of a meal at Pintxo. The restaurant is on a quiet street just off the hum of St Denis. We decided to order a selection of 12 small plates, all of which were outstanding and perfectly prepared. The black cod, lobster tail, duck confit, shrimp, and venison were the absolute highlights. Out waiter was friendly and cracked some quality jokes throughout the night. This should be a required stop for anyone visiting Montreal and looking for a break from the french food after a few days bistro hopping, but stands shoulder to shoulder with any of the top Spanish restaurants in North Americal."}
{"text":"I've been meaning to try this El Pintxo (pronounced Pincho) forever! Luckily we had a special guest from out of town who wanted to try something new. Without hesitation, we bolted out of the office to make it to our last minute reservation for 7pm. We warmly greeted by our host and proceeded to carefully studied a vast menu with 38 different types of pintxos and over 10 main platters to chose from - impressive! 

Three words to describe the food: Bright, Bold and Basque! Octopus Carpaccio with vinaigrette, Yellow Beet Tartare with smoked salmon and feta cheese, Foie gras with caramelized onions, Chorizo and grilled Octopus on a bed of chick peas and lemony red onions, Grilled Prawns with garlic, Basque grilled Cod, Bison ribs with quinoa salad, Asturia Cassoulet, Gazpacho with strawberries and red bell peppers... surprisingly all these small plates do fill you up quite fast.

In business for 7 years, Chef Alexander Ortiz, Mexican of origin but trained in the great kitchens of Spain delivers an outstanding menu where fish, seafood and meats are layered with complex flavors, a simply prepared and so fresh. Do come and try it for yourself!"}
{"text":"One of the best meals I've ever had anywhere.  Scallop and chorizo stands out as absolutely exquisite, to be long remembered."}
{"text":"A wide variety of dishes but I enjoyed all of them, a top recommendation if you are looking for a variety of small plates."}
{"text":"fairly good tapas and service. decent wine, especially in Canada. the food is fresh and well seasoned. 

cozy place and dimly lit. a good date place, i think."}
{"text":"Tastes of Barcelona and beyond. A special dining atmosphere with attentive and knowledgeable staff. Cava rosé was dry and delicious. Favorite pintxos were quail (top notch!), bison rib, halloumi cheese and arugula salad, garlic shrimp (in flavorful roasted pepper and tomato sauce). Chocolate melting cake is just that and if you choose to share like we did you may regret it. The fruit tart with strawberry ice cream was the perfect neighbor dessert. So go. You won't regret it."}
{"text":"I haven't been to this restaurant since they moved to the new location on Mont Royal, so I was happy to be back, and they didn't disappoint! This place is perfect for a date - not too large, outdoor seating in the summer, great food and wine, gentle lighting, it puts you in the mood ...
We had the pintxos (tapas) exclusively, and stayed away from the main courses. We started with the soup of the day, squash, which was rich yet had a lightness to it - lovely! The Spanish charcuterie has 3 different types of cured sausage ranging in depth of flavour and spiciness accompanied by cornichons, tapenade and a great olive selection. The smoked duck tartar is a marvelous taste experience of the duck combined with subtle spices to enhance the flavour, served with more of that delicious tapenade. The foie gras torchon with onion confit is superb! The unctuousness of the foie gras with the sweetness of the onion confit is heaven! The black cod with virgin sauce has an excellent balance of the fish and vegetable sauce. The grilled octopus with chorizo was fabulous! The octopus was cooked properly so it was still tender, and the chorizo was cut into strips and fried so it provided the crispy and spicy counterpart. The garlic prawns with roasted red pepper sauce are as good as they sound, tender and so flavourful. The goat cheese raviolis with duck stew are terrific bundles of goat cheesy goodness in a rich duck stew sauce. The deer chop in pistachio crust was great - the gaminess of the deer balanced by the crunchy nuttiness of the toasted pistachios. The beef cheeks with mustard mash was the kind of rich, hearty fare that cries for a great glass of wine. Good thing they have a solid selection of Spanish wines to help out!
The specials also provide more opportunity for greatness and gluttony, so we had the lobster croquettas and clams, which was amazing!
We rolled out of there happy and very content. Muy bueno!"}
{"text":"In the world of tapas it is wonderful to see someone with Basque heritage using that experience to elevate local ingredients to lofty heights.
The restaurant is clean, quiet and well laid out - perfect for a date. Service is exceptional - skilled, knowledgeable, and very friendly. We had 11 plates between two of us, but there was certainly some gluttony involved to reach that number!
The Spanish Charcuterie was very tasty, but I thought the portion a little small, even for tapas. The foie gras torchon with onion confit was delicious, just as good as it should be. The smoked duck tartare was a revelation - incredible rich duck flavor that spoke of the quality of the food. The elk carpaccio was a bit disappointing - the meat was not sufficiently dry, but the chardonnay vinaigrette was a lovely accompaniment. The scallop with chorizo tapenade was insanely good - perfectly cooked, perfect balance of flavours. The prawns in red pepper sauce were also exceptional - thank god there were two so we didn't have to fight over the portion! The mushrooms stuffed with duck confit were probably the apex of the evening - I don't know where to go for more superlatives on this one. The goat cheese raviolis with duck stew were marvelous little flavor bundles - mmmmm! The bison rib was fantastic - tender, rich and full of flavor. The veal medallion was tender and perfectly accented by the squash. And the rack of lamb was deliciously delicate yet gamey - the hallmark of good lamb.
The wine list is all Spanish, which is wonderful, and the staff can help those unfamiliar with Spanish wine to navigate the list to their liking.
Hasta la proxima!"}
{"text":"The absolute best tapas in Montreal!  Authentic and small like real spanish tapas should be!  Don't even consider the main dishes...order a bunch of \"pintxo\" (the basque word for tapas) and indulge!  Try the mushroom stuffed with lamb! trust me...you will definitely be ordering another one. Great selection of red spanish wines that accompany the palette with elegance.  And go ahead and stuff your face with their warm home-made bread and equisite extra virgin olive oil! Doesn't get better than that."}
{"text":"Came here in a group of 7 thanks to Restonania's lobster festival deal which costs $15 that gives you a lobster tail and a white wine. We also ordered their tasting menu and sangria. Food was all pretty tasty, particularly loved the foie gras which was flavorful and not greasy. Another favorite from the group was the spinach soup although the portion in the tasting menu was a bit too small, making it almost just a dip than a soup. Service was a bit disappointing in comparison. We weren't given any menu at the beginning and turned out it was assumed that we would only get what's included in the deal. Bread was only served when we were half way done with the appetizers (which was after we finished the lobster). The sangria served to the table next to ours had a slice of orange in each glass which didn't come in ours. At last the waiter also forgot to bring the oyster that should come with bloody caesar! Somehow we felt a bit being discriminated perhaps for the cheap deal or being English speaking. I would give 4 to the food but overall experience made it only a 3."}
{"text":"This was a great find. We had several tapas and then shared a full plate. Service was perfect and since I don't speak French, the opportunity to speak Spanish was fun.  We spent three hours tasting and chatting and enjoying a bottle of Spanish wine. 

Garlic shrimp, elk, fig rellenos, all extra delicious worth perfect flavor. Scallop was over the top perfect. The duck breast on saffron risotto was amazing.  Lots of gluten free options which was great for us as the fiancee is GF."}
{"text":"So apparently a pintxo is like a tapas, only smaller... as our friendly server explained to us as we sat down.  We were four people out for dinner and got to sample many of these small and delicious pintxos before the night was through.  They have several specials which are posted on the blackboard in addition to their regular menu.  Each dish is about 2-3 bites (depending on how big you tend to bite, I guess).  The food is very rich and filling, so around 5-7 plates per person (assuming you want to save room for desert) should do the trick.  Every plate was super tasty, the standouts would have to be the goat cheese ravioli, pork loin with 5 spice rub and the scallops with maple syrup.  They also have a nice wine list of mostly Spanish wines, we had a lovely syrah that went down way too easy.  Desserts were just ok, we had the iced nougat and passion fruit cake.  I would have actually saved that tiny little corner of my stomach for another delicious maple coated scallop.  It's a small restaurant, and space is cozy but not cramped.  Reservations advised, especially for weekends.  Service was great and well paced, they bring things out 2-3 at a time so you don't get bombarded with all your order at once and get a chance to savor each one."}
{"text":"First time coming to pintxo and I really enjoyed myself.
We decided to come for the last night of oyster mania for 9 pm as that's the only time the coupon was available at.

We started off with our oysters and a glass of bubbly. Oysters came fairly quickly and they were nice and juicy.

We chose 10 tapas to share we scratched two off but the waitress told us that the scallops and octopus were the best so we added them back on.

Food came pretty quickly as well so that was another plus and it was to loud in there so we didn't have to yell to hear each other like we did the night before at Joverse.

We had the foie gras which was very good, the shrimp were okay a bit bland. Scallops were perfectly cooked. Boudin was very sweet and came with sweet biscuits and caramel so if you're not a fan of sweet boudin skip it but I liked it. The ravioli were okay but the sauce should of been thicker. The octopus with chorizo was very good well cooked. The charcuterie with olives were good as well. The beef with mashed potatoes was our Favourite they legit killed this dish. Meat was
So tender and potatoes weren't to mashed a little chunky so they went well together.

I love that we got to try a bit of everything I would love to return here now that I have my favs :)"}
{"text":"Pinch-hitter Pintxo hits a home-run with Basque-influenced small plates along with smartly selected Spanish wines.

A fair sized, intelligent selection of Spanish wine from various regions with most glasses between $8-12, dating mostly from '08 to '10 for the reds (with 08/09 being very good vintage years) is likely to please a wide range of palates.

The wine service is a step above the norm.  Each time a glass of wine was to be poured, the staff first checked the clarity of the glass (looking for water spots or other issues) against a light.  Whenever a new bottle was opened, the server would do a sniff test for check for TCA (cork taint) or brettanomyces getting a bit too friendly.  I appreciated the small sample taste glasses that my server provided when I hummed and hawed between a Ribero del Duero and Rioja that both looked interesting.  Random tip: I find this offer of sampling much more common when sitting at the bar, where bottles are within arms reach.  

The tapas dishes were a mix of rustic and refined, simple and complex, in both preparation and presentation. And my observant dining partner-in-crime astutely remarked that the dishes were brought in order of delicate/subtle to robust flavors and that this wasn't by accident.

The squid, with caramelized onion, served on apple, was crunchy and sweet; a novel way to do calamari for me.  The black cod was perfectly cooked: very moist meat with crispy-fried skin, served on top of garlic mash potatoes dressed with grape tomates, zucchini and olive oil.  A little more fleur de sel / cracked pepper on the skin would have been a nice extra, but it was already great.  

The fig stuff with serrano ham and cheese was an interesting mix of sweet, savory and richness.  To get a bit more edgy the blood pudding was served like a paper-wrapped cupcake of black, moist, earthy, rich, dense melt-in-mouth goodness, topped with a pinch of finely diced mixed peppers for color: a nice touch of contrast for the eye.

The staff were friendly, attentive (constantly filling up water glasses) and easy going.

Noise level was much quieter than the average ~15 table restaurant due to bisection of the tables by the entrance & foyer, making for a bow tie kind of layout, essentially cutting the dining room size (and noise level) in half.

I'd easily come back anytime I'm tempted for tapas ."}
{"text":"The New York Mag (or NYT) once wrote that Spanish was the new French, partly in reference to the proliferation of Tapas places throughout the City. We could apply this trend to Montreal also, but with different proportions of course. Out of this comes Pintxo: one of my best culinary experiences in Montreal. I went there once and it will leave a unique memory. 

Aim for the Pintxos directly. You will find a wide range of flavors ranging from goat cheese cherry tomatoes to more original foie gras tapas. And you won't be worse-off ordering every single one of them if you're a party of at least three. Moreover, there is a descent selection of wines which will definitely match any of your food choices. All of it for a price reflecting its quality.

But Pintxo is not only about food. It is the charm of such a cozy spot ironically situated next to Montreal's most active neighborhoods. You could even walk in front of it and not notice it, its coziness and simplicity being major parts of its charm. Once inside, I recommend seating in the left side of the restaurant if you are looking for a tasteful and romantic diner. Bigger parties should consider the opposite one.

Unique."}
{"text":"Lunch
  Not quite sure why I even read the menu, my server ?Siege? was amazing picking perfect wines with every selection. I was lost on Spanish wines, I should have let him pick the entire lunch. The Basque influence of this Spanish tapas restaurant forays into game dishes done wonderfully! Potions were varied, sardines small, but the foie gras torchon buried me, would have loved another crostini to finish the generous portion. The rabbit was finger link'n good. My last ordered dish was goat cheese ravioli but I got the goat cheese tart. It was too delicious to return. Ravioli on the next visit. 4 tapas make a meal. 3 if you do the pate."}
{"text":"Exquisitely prepared food with lots of attention to detail. We went for lunch; they offer a sampler menu of several tapas. Everything was gluten free except the fried leeks used as a garnish on one item, which they left off. Pretty pricy, but delicious. Fabulous service."}
{"text":"Tres bien!

At first I was afraid we'd made the wrong choice for dinner----the menu didn't feature an obvious vegetarian option other than a garden salad. But, after asking our [stellar] server if this was going to be a problem, he assured of us it was not. I was given chef-created, vegan options based on my veg likes and dislikes, and it was the best meal I had in Montréal the weekend I was there."}
{"text":"We had 9 different pintxos and every one was fantastic.
I would eat here once a week if I lived in Montreal.
The wine list is a little confusing but the waitress was happy to explain everything."}
{"text":"I've been there a few times and I've never been disapointed. Service is always spotless, tapas are both delicious and creative, and even though the wine selection is limited to Spanish wine, every single one I've tasted was excellent.
The only small downer is the small capacity of the place (max 40-50?). It can be hard to get a reservation the same day. However, it does contribute to the charm of the restaurant, making it a very intimate place, perfect for some nice times with friends.
Highly recommended"}
{"text":"I've been to Pintxo over 20 times. I'll be back within the next 3 weeks. I always am. The food and service are always amazing.

Fois fras torchon... unimprovable By man or god!"}
{"text":"The menu consists of more than 25 small plates, small bites of Spanish and Portuguese-influenced foods. The food is creative, quite delicious, and the atmosphere is generally cozy and boisterous. Serviceable wine list. This is an excellent neighborhood restaurant."}
{"text":"3.5 stars.. rounded up

my buddy, my fiancee and i came here for dinner recently to get away from all the french food we've been eating.. they recommend you get 5-7 tapas.. but you can do fine with just 4.. 

although there were plenty of tapas.. some were pretty bad (gazpacho, grilled vegetable, octopus), others were just ok (beef cheeks, quail).. 
there were also also some that were quite good (cod, clams).. 

if you ever come here.. definitely get the cod as well as the clam dish"}
{"text":"Small cozy place, we walked in on a Saturday at 11:30 and the place was empty. 
They offer bottomless mimosas, which we accepted with pleasure, hoping it would fix our hangovers. The waiter was refilling our glasses every two sips, so I say it was worth the 25$. They are using Oasis orange juice, and a sparkling wine I did not recognize. 

They offered everyone miniature croissants with papaya jam. I appreciated the attention, and the jam was excellent. Croissants were a little overcooked. 

Then we got the food; cream cheese and salmon Tartare bagel & chorizo and cheese waffle. 
The bagel plate came with sundries tomatoes and capres. The Tartare was creamy, cut into really small pieces and well seasoned. 
The waffle was light and fluffy, a little sweet and was topped with spicy chorizo, montego cheese and aragula. 

The price is similar to other fancy brunch places in Montreal, plates are between 14-18$. Coffee is not included (4$ lattees or capucinos). 

I will go back next time I'm in the neighbourhood."}
{"text":"I went there on sunday night with my friend. It was our first time there so the waiter took the time to explain the menu to us and everything. We had a choice of 4 tapas : onion soup, foie gras, duck tartare with an olive tapenade & langoustine. I ordered the duck breast it came with a risotto that was so devine. Overall the experience was good why im giving it 4 stars instead of 5 its because the place was a tiny bit too small lol. But I would definetly recommand it to others:)"}
{"text":"We went to have oysters at night, and many people were almost full, and the waiters served well, and the atmosphere was good."}
{"text":"Fantastic service, atmosphere and plating, but quite expensive. The food is of a high overall quality but a little inconsistent; I'd have religious moments with things like the duck tartar, only to then be let down by things like the wapiti carpaccio. I was amused by how unusually wonderful the complimentary bread / oil was.

While it may not be a foodie must, it's a great spot for a quality, relaxed meal in an otherwise busy neighbourhood - just have your wallet at the ready."}
{"text":"We found this place off the street and it was such a great surprise. The waiter was so attentive, the food was incredible, and the drinks were perfect. They treated us so well and made sure we had a great experience. They were so helpful with the area. Such a pleasant experience. We spent three hours here! A definite brunch must see."}
{"text":"After not being able to get a last minute reservation at Khyber Pass which is a few blocks away, I was able to get an online reservation at Pintxo through Opentable.  This is a very comfortable, classy place that isn't formal.  The wine we had was wonderful and the small plates were delicious.  Would definitely recommend."}
{"text":"I'm not much of a foodie, so I'm sure I didn't appreciate this place as much as I could have, but the food was tasty and the main dish portion was large.  A tad expensive for my taste but it was worth it for the atmosphere and delicious food.

My group had the pork chop, lamb shank, beef cheeks and more and all was very tasty and generous portions.  The chefs choice pintxo's were also very good.  The atmosphere was very tasteful and upscale.

I would return for special occasions."}
{"text":"Tappas restaurant. 45-minute wait. The restaurant was especially busy on Saturday. Friendly staff. Had an ice cider while waiting for table. Nice ambiance, a bit loud at times due to patrons. Big wine list; tappas were meant to be had with wine after all. 

Tappas were good, but REALLY small portions for the price. Garlic shrimp and calamari were OK. Mushroom and snail was good, as was foie gras. Kind of filled up on their bread. Main dish wasn't anything special. Had a lamb shank with couscous. 

For foodies, I would venture. I'm certainly not, so I felt that it was way expensive for what I was getting."}
{"text":"This place was made for my heart and my stomach. 

If it were up to me, every restaurant would be based on tapas, so I can try a little of everything. Inside this warmly lit cozy restaurant, you will find some of the most interesting dishes, using some of the most amazing ingredients. Each time I go, I try different tapas and so far, I have yet to be disappointed with any creation they have. 

I love the paintings they have, the windows, and the service has always been spot on. If I had to play favourites for their tapas, I would have to say the wild mushroom and escargot, the smoked salmon with beets, and the sardine with avocado was to die for. Their wine list is very thoughtful of the various dishes they serve. I liked the opportunity to try wines that aren't the average run of the mill house specialties.

If I was a restaurant, I would totally marry this restaurant and live happily ever after."}
{"text":"Our first time... But definitely not our last.  All 4 of us ordered the Chef's choice 4 Pintxo's plus a rack of lamb (my absolutely favourite meat... which even comes with a handle:-))   We also let the waiter suggest a wine.  It may have been the easy way for us newbies... But it resulted in the perfect dinner experience.  Everything was delicious... the lamb serving was more than generous... service was excellent.  We will be back."}
{"text":"I reluctantly give these guys 5 stars.  Ambiance I fantastic, menu creative and flavorful.  A lot to choose from and the chef executes well.

Im not a fan of the microwave but I reckognize the chef's need to use one with so many items to prepare at once.  I had a great view of the microwave from my seat.  it irked me as the radiation never stopped.  

All in all it is head and shoulder s better than most restaurants."}
{"text":"Spectacular food, service and ambiance.  After being turned away initially at the door for a table sans reservations [book in advance!], I returned an hour later.  

Highly recommended: txori-pulpo: chorizo and squid atop a bed of pureed garbanzo beans with lemon-marianted red onions.  Alcatxofas con almejas y jamón serrano: grilled artichokes with clams and jamón serrano - incredible slat balance and one can still taste the ocean!  I also had the venison filet which is currently not on the sample menu online.  I would highly recommend this as well!  

Next time, I will certainly opt for the menu dégustation!"}
{"text":"The service was good. The food had great presentation but some of them was too heavy.
The waitress recommended for two of us, we should order around 10 pintxos or the tasting menu with 4 pintxos and a main dish $38. 
We decided to order pintxos only. 
The bill ended up to be $110. 
I like the dishes, but my date felt their food was ok."}
{"text":"I came on a very stressful morning run with the taxi drivers. I appreciated them letting me sit in the restaurant while I collect myself, I asked for a menu and I ordered. All the food were done right, except, I wish the meat was less well done. Their mimosa tastes great tho!! 

Overall, I had a nice brunch despise a very hectic run-in with the taxi drivers. I missed out a brunch with my girlfriend but the waiters were courteous enough to let me sit a little while. 

Probably will be better off coming on a less busy day, other than mother's day."}
{"text":"My husband and I found Pintxos 4 years ago on our last visit to Montreal. We had a great experience and when returning to Montreal this past weekend, we knew we absolutely wanted to go back.  Now, I almost wish I hadn't...

The food was fine. They were out of figs for the fig/serrano/cheese item (one of our favorites at any tapas place). The taste of the food was fine, though not amazing. Overall a 3-3.5 stars for the food. We did order the mushrooms with snails and couldn't find any snails in our mushrooms. The wine (we ordered a half-bottle) suggestion from the waiter was good and reasonably priced.  This was all good.

Now the not so good... we ordered 7 items. We weren't hugely hungry and were considering dessert, so we erred on the side of caution (they suggest 5-10 per person). As expected, the items were small (they are called pintxos for a reason). Add to this the bread and it was a reasonably sized meal. The problem was with the timing.  I'm not sure if it is because we ordered fewer items than suggested or if they are always this disorganized, but we immediately got 2 of our tapas. The others came sporadically, often with a 15+ minute wait in between. At one point, they cleared our plates and eventually brought us new ones. However, we waited 30+ minutes for our last two tapas... that then came at the same time. During this time, waiters/servers passed through (checking for used plates??), but didn't stop, didn't ask if we'd like anything... eventually my husband had to stop our waiter to make sure that they were going to bring the rest. It had been so long we were assuming that they had forgotten.  Communication would have been appreciated.

All in all... we decided not to have dessert here - who knew how long we'd be waiting! And, unfortunately, we've decided not to return to Pintxos the next time we are in town. While the food is solid and typically an interesting mix, the service left a lot to be desired."}
{"text":"This was the best restaurant we patronized in Montreal on our recent visit. The plates are indeed small, and the vegetarian options are limited. However, flavor, presentation and quality cheeses go a long way with this vegetarian."}
{"text":"After a series of underwhelming meals during our weekend in Montreal, Pintxo delivered a memorably delicious culinary experience! We had 10 plates, which was probably two or three too many, even though both of us came hungry.

My favorite dish by far was the foie gras torchon. It would not be a bad idea to get multiple plates per person. Who can argue with foie?

We also liked, in order:
Crab and shrimp stuffed piquillo pepper with a shellfish sauce - the sauce, especially, was great for scarpetta (sopping up the extras with bread)
Seared scallop with chorizo tapenade - worth getting multiple, since they only serve one per plate
Strawberry and sweet bell pepper gazpacho - a refreshing, $4 amuse bouche
Grilled chorizo and octopus, chickpea puree, marinated red onions and citrus vinaigrette
Garlic prawns with roasted red pepper sauce 
Goat cheese ravioli with duck stew

The sole misses were:
Stuffed calamari with cheese, pine nuts, and prosciutto - this missed badly, as the manchengo completely overpowered everything else
Duo of Spanish cheeses - this was fine, but not worth $10

Beverage and bread service were also excellent. I'm a fan!"}
{"text":"I went here a few months ago with some friends. 
I will be honest, the variety and quality of the food was very high! Most dishes were good. I am not the biggest fish and seafood person, but I did enjoy the lobster and other items too. Very good cervidé as well, I would say that was the highlight for me. 

On the downside, for a table of 8 it is unacceptable that the waiters continually fill the water and wine glasses of only two patrons. We had to hide the wine bottles, so everyone could have some and also especially to avoid those two falling off their chairs!"}
{"text":"My family and I went here during a visit to Montreal. I had to try 3 different times to make a reservation - if you're interested, try calling 2-3 weeks in advance (kinda made me feel like a rockstar to just walk right in though, not gonna lie). I'd advise going for a prie-fixe menu or sticking to a certain number of tapas: it is VERY pricey here and your bill can climb quickly (I think for four people, my dad dropped over $400).

Beyond that, though, some of the most delicious and creative tapas I've ever had. Very original pairings and an extensive wine list. I'd agree that this is a place for foodies, but as a fairly adventurous eater with no particular dislikes, I was very happy here. The walls are also covered with original artwork (on discreet sale) and the rest of the decor is tasteful and makes good use of the space."}
{"text":"I ordered the Menu Degustation which comes with 4 pintxos and a main dish:

The Lamb shank with couscous main dish was dry and had no flavor.  The waiters were nice enough to bring me salt and pepper, but I don't think that did the trick.  The 4 tapas dishes were not worth mentioning.  Not coming back again."}
{"text":"Our meal was incredible. We had the grilled halloumi, the smoked duck tartare, the foie gras torchon, the beef cheek, goat cheese ravioli, grilled lobster, beet and smoked salmon tartare and the Asturian stew. The service was exceptional and we will certainly be back when we visit Montréal again. You will not go wrong choosing to eat here."}
{"text":"The food was ok bit a bit over priced. Nowhere as good as real Spanish tapas, but the quality of food is good. Atmosphere was nice."}
{"text":"Yes! Yes! Yes! I am soooooo happy that they reopened and I'm over the moon happy that they are super close to where I live. The quality of food is out of this world. The staff is fantastic. The wine is wonderful. The ambiance is quaint.
I usually order 10 pintxo's for two people so that I can have a assortment of different plates and flavors. They have some pintxo that are \"classics\" and others that are the special of the day. Some of the plates that I order EVERY time I go are as follows:
- Foie gras torchon with onion confit (a MUST)
- Crab and shrimp stuffed piquillo with a shellfish sauce
- Garlic prawns with roasted red pepper sauce (yes!!!!!!!!!!!!)
- Stuffed fig with serrano ham and mahon cheese (I wonder if they can deliver this to me now)
- Goat cheese raviolis with duck stew (ok, I'm starting to get hungry)
- Grilled lobster tail (I love youuuuu)
- Duo of salmon tartar (eh, I think I'm naming all the items on the menu)....

Please hold as I make a reservation for tomorrow!"}
{"text":"This is an excellent restaurant. Christophe was our server and he was wonderful. Our French is non-existent but we try. Christophe was very patient and helpful and we really felt he was pleased we were dining with him. Some places we have been, the servers seem a bit put off by our lack of French. 

Anyway, the food is unique and clever. We just had pintxos, no main dishes. I would say that 8-10 will do you fine. 12 tops. Add a bottle of wine and with tip you'll spend between $150-200. 

Do yourself a favor and read about the very unique Basque culture before coming. It's not super traditional, but the menu certainly gives a nod in that direction. Don't miss the basque cod and the venison. Definitely my favorites."}
{"text":"Love tapas and this is the place that comes to mind when I develop a craving. I've tried tapas in many different places, large and small. Pintxo is the restaurant by which I measure others."}
{"text":"Located in a bustling and hip district right near Anthony Bourdain's favorite Montreal destination, Au Pied de Cochon, this peaceful and romantic Basque tapas restaurant will lure you with it's compact, quiet and unassuming facade and warm interior.  Very romantic and perfect for intimate conversation, the simple white and wood interior sports a small-ish number of tables in two rooms.

Nowadays its virtually impossible to walk a block in any major city without encountering a \"small plates\" or tapas restaurant, but rarely will you encounter one as competent as this one.  Every single little dish (and they are pretty little) that came out of the kitchen was fabulous.   We tried half a dozen and enjoyed every one.  Hell, the Foie Gras was so good that we ordered a second plate of it - perfectly seared with a lovely fruity accompaniment, this $5 (Canadian) dish shocked us in its perfect implementation and unbelievable value.

Don't miss the mushrooms with duck confit, the calamari, or the artichokes.  Yum.  May just reset your standards for tapas!"}
{"text":"Pintxo is upscale dining at its best. From the moment you step in, you can feel this will be an exciting culinary experience.

I always get a bit nervous when I go there: \"What will I eat? What will I drink? What if I miss out on something? Who's that girl I'm with?\".

You have to know, this is not tapas, this is pintxo, which means the portions are bound to be smaller than what you would expect form your regular tapas place. That being said, everything is fresh, tasty, inventive and unpretentious and the fact that portions are small means you can try more things.

I highly recommend ordering a bunch of pintxos and just skipping the main course, you'll have a ball!

It's a bit on the expensive side, but it's well worth it."}
{"text":"Seriously this is one of the best restaurants in Montreal! Everything I ordered was amazing and the perfect portion. The wine is delicious and the restaurant is cozy and decorated beautifully. A+ service by the staff. I highly recommend this place!"}
{"text":"I was told to be one of the best tapas in Mtl but for me it was just regular. I agree that they have a great variety of food but the portions were definitely too small, 3 bites max for each tapas. Yes average plate prize is 5 to 8$ but u have order around 10 plates to satisfy your stomach. And since the place is very small, tables are very close to one another so not fit for an intimate dinner"}
{"text":"Good: Server was friendly, and suggested a reasonable number of pintxos (pichos?) to order between the two of us. I was pleased that she didn't oversell - we were satisfied but not bloated with 5-6 dishes. 

Better: The atmosphere is somehow buzzing but also quiet enough for conversations.

Best: The food! We ordered a variety of dishes and everything was really tasty - seafood, veg and meat. The octopus was perfect, highly recommended if you're a fan. The portions look small but pack a huge flavour punch. 

A great find - fantastic food, romantic and reasonably priced. This is a perfect place for date night. 

Dollars: Around $75-80 (I can't remember the exact amount) for enough small dishes to feed two people, and two glasses of wine."}
{"text":"Aahh I am a fan of this place now. Pintxo is a great place and honestly I am just so blown by the food that the more I write is less. My last visit was during Valentines Day and the place was packed. It has a nice ambiance for Small group of friends and couples. Light is not kept too bright, and the candles add a nice touch to the romantic feel with small and cozy tables and chairs. 

The best part here honestly is the food. I think this is the first time I ever finished a dish completely before the other person on the table. I had duck breast which were exquisitely tender and perfectly flavoured. You could tell the the gravy was made from very fine dry wine and the meat texture was nice and soft. The creme brulee was great too, and melted deliciously in my mouth. They have a good spanish wine collection to go with the meals.

Heres why I left out one star. The service. Unfortunately they didnt seem very hospitable from the get go. We got there 10 minutes earlier to our reservation time and were waiting out with other guests. The host seemed confused and maybe a wee bit frustruted and made an awkward comment while he was getting us seated. Our server even though polite, also looked dazed as to when to come attend and not etc.... 

With that being said is this going to stop me coming here again, and even come give the staff another go? Heck no! And I say even you should come see this resto out if you havent yet :)"}
{"text":"The service, atmosphere and plating were lovely and delicious.  I think at one point, I wanted to lick the plate because the sauce was so good with the octopus. Only downfall...they don't have one in NYC.  Helped make my Montreal trip great."}
{"text":"Wow! Where to begin?

The food was delicious, unusual, beautifully presented, and creatively prepared. For example, they have a dish which is grilled octopus and grilled chorizo. The octopus is in large pieces and the chorizo was in thin slivers, served over the octopus with some sort of pickled vegetable, and with chickpea and squid ink sauce as garnish. I am NOT someone to get excited for novelty for its own sake. These dishes were extremely creative, and all the flavors worked together.

Service was very polite but a little slow sometimes. They could probably do well to hire a few more people in their kitchen. The waitstaff were very friendly, made great wine suggestions, were patient with my mother's and my poor French, and didn't make us feel rushed at all even though we knew that they needed our table. 

Overall a very high-class experience. Highly recommended!"}
{"text":"HAND DOWN, my favorite meal while in Montreal this summer (2010), and, also, one of the relatively less expensive. Having read some of the less-than-stellar reviews of the main plates, we ate almost all tapas (small plates), other than one main cheese platter. Unlike a lot of tapas restaurants, the tapas were not drenched in oil, and the food was not heavy. The portions were tiny, but we were totally satisfied with about 8 tapas, and one main. The servers - including the food runners - were uniformly beautiful, which helped. The restaurant is located in a charming residential 'hood a couple of blocks off St. Denis."}
{"text":"I was looking forward to tasting pintxo at this restaurant and I was not disappointed. The service was top notch and the food was delicious. 

Their set menu is a good way to go if you have not tried Basque cuisine before, the restaurant has more of a intimate ambiance, it's somewhat small but perfect for that date or a small gathering with friends. They also have a non-alcoholic beer on the menu which is not that easy to find in some places. 

Overall, a pleasant experience. Definitely will be back."}
{"text":"Walking in the restaurant, the first impression this restaurant gave me was very modern and still cozy atmosphere. I was presently guided to our reserved seat and the waitress brought us menu. Surprisingly, this restaurant only had Spanish and French menu which. We ordered tasting menu which consists of 4 appetizers and 1 entree.

The first plate had 3 appetizers, beef tartar, bean soup and foie gras with caramelized onion. The foie gras was good, however the size of foie gras is too big. They should put smaller foie gras and more caramelized onion. Bean soup was very good, I found the fusion of bean and curry-like flavor very fascinating and enjoyable. However, the beef tartar was over-salted and overcooked. The sauce on beef tartar was quite salty which I did not find very tasteful.

The other appetizer was scrambled with mushroom topped with fried leek. I certainly enjoyed this dish. Since I do not like salted food, the quantity of salt they put in the dish was quite satisfactory. The combination of fried leek with fresh mushroom was quite tasty. I have to mention that this is the dish I enjoyed the most for my dinner.

I had lamb for my entree. Although the lamb and vegetables were over-sized, the flavor of lamb was quite fascinating.

In total, the service of waitress was brilliant, food was good for 38 dollars."}
{"text":"This cozy and intimate restaurant serves delicious, beautiful and refined tapas but somehow left me not totally satisfied over my dining experience. You see, no matter how good the food was (and it was), what stood out the most for me was how slow the service was. 

On average, we waited 20-30min between services. And when I say service, I mean teeny-weeny plates called pintxos. First a little clarification is needed: as the name implies, this restaurant serves pintxos, not tapas. As I have learned the hard ways, it's not quite the same: pintxos are bitesize tapas, so roughly half the size of normal tapas, if not smaller.

In total, we spent a good 3 hours at the restaurant on a Wednesday night, restaurant not completely full. We could have ordered more but we didn't want to stay that much longer. 

Amongst the dishes that stood out: Yellow beet tartare with smoked salmon and feta cheese, Foie gras torchon with onion confit, Seared scallop on chorizo tapenade, grilled octopus and duck breast with risotto.

Overall, we had a very good meal but I can't say I will be back."}
{"text":"Bien... sans plus. J'avais le goût de tapas et il y en a bien sûr une longue sélection. En général ils étaient bons mais pas particulièrement goûteux ou inventifs. Certains étaient carrément fades. La liste de vins est assez bien mais plutôt limitée au verre (quoique ok). Par contre les prix sont corrects (2x SAQ à peu près). Le service était très bien.

J'y retourne mais par défaut plutôt que par choix."}
{"text":"Service impecable, agreable déco et belle presentation des plats mais si vous avez faim c'est pas votre place haha tres petits pintxos.. pas si savoureux que ca .. Sorry je suis difficile ( minimun 4-5 pintxos par personne ).

J'ai quand meme eu du plaisir mais je vous suggere de manger un peu avant ou demander du pain extra... 

Mon pintxo preferé le tartare saumon avec betteraves blancs.

Et il faisait froid dans le resto :("}
{"text":"I have been to this place a few times, but had not been there in well over two years when I decided to bring a friend visiting from NY here last night.

Let me begin by saying that  we called at 10h15, and were able to get a 10h45 reservation for 3, much thanks because it was a mid week, mid winter, snowy day and it was a given we were holding everyone back by arriving so late, extra kudos for customer service.

When we arrived we were very warmly greeted and seated, (we had been warned to order upon arrival given our last minute reservation), the lovely Carolina was our waitress and she took amazing care of us answering our many complicated question's (we are restaurateurs' and our guest was a latino Chef), and very gladly suggested various dishes in three languages no less!

here is what we settled on for food
2 pintxo of Chorizo and Octopus (the special of the day)
2 pintxo  red peppers stuffed with crab and shrimp (the special of the day)
2 bison ribs (with a delightful sauce which was sweet and spicy, I guessed the ingredients but won't give it away) (the special of the day)
one order of cod ( Bacalau) and scrambled egg
artichoke and clams
and an assortment of about 7 different cheeses (read slices), which were excellent, I cannot remember all the names but the blue cheese one was by far the best!

We got one bottle of red which was Spanish, one glass sparkling wine, and then 3 glasses of another red served with the cheese.  I cannot remember the name of the red by the glass but it was far superieur to the bottle (I know that the bottle from which it came had a all black label with white writing)....

We loved loved loved the decor and commented on the wall art which was stunning, the waitress chatted with us easily (especially since it was just us), and I can assure you she knows food, wine, and is very professional, by far the highlight of the evening.

Here is the only thing which keep this from being a four or five star in my list.

  I know the portions are meant to be small, but the price does not fit.  The flavors are good and interesting, but not at that cost....each of the pintxo was literally a one person bite leaving you famished (not a bite for 3 just one bite per pintxo), yet you just spent 196$, not including tip, so now we are up to 230$, so that part does make me hesitate to return for a full meal.
 I don't mind paying for food and wine, but this seemed to turn or initial lust into a \"are you kidding me, how the hell did that happen!\" moment.  Maybe they should consider either lowering the costs per bite, or letting people know as they go, since it is tough to calculate, and when you're going on recommendations, well let's just say it's tough to figure out if this will be a repeat....."}
