{"text":"Amazing place for a glass of Whiskey!  Has an awesome cowboy themed vibe going on with an awesome selection of Bourbon whiskey."}
{"text":"Menu looked promising. Bartender seemed unfamiliar with the menu as he had to keep referencing something behind the bar. As a result, it took 25min to get 7 drinks to to the table. Once the drinks arrived they were invariably too sweet for a classic cocktail bar."}
{"text":"Granted, it was a school night. The bars next door were full of college students. This place was empty aside from us."}
{"text":"Excellent bar! The staff is top-notch and mixes some of the best cocktails in all of Montreal. The western theme gives it a unique edge within the downtown area and puts it in a class of its own. The addition of a menu in recent months also makes it a great location to grab a bite to eat. All in all, worth a visit or ten!"}
{"text":"This was a lovely little bar I went to last summer, A western themed bar/saloon type of feel. The drinks were amazing, the bartender was amazing, we tried a lot of different drinks on the menu and they were all great, It was pretty quiet the night we went on a Thursday night, I believe. Overall it was a really fun experience we definitely felt very welcome,"}
{"text":"I've tried Pistoleros on multiple occasions and refrained from leaving negative feedback in hopes that it was  \"off\" nights. I found myself leaning towards a nicer review because I know enough staff here to know that some nights must be terrific but if I don't know who's working I would be quite discouraged to return. The first visit (ribs and fried chicken) weren't anything I would reorder despite being the \"special of the day\". This time around, apparent problem with the kitchen printer resulted in an hour wait for food, but I get it, things happen. The fried chicken and sides were ok, but the cornbread was a complete no go. The burger was again, ok, another friends pulled pork, ok yet again. Having tried that much of their food, and the fact that we were all quite hungry (and had our fair share to drink) left me wondering how none of the things I had tasted stuck out to me. Service was below average considering how few people were in the place (about 20). Never an offer to refill our empty drinks despite being seated at the bar, no question about if we were enjoying our meals either during or once they were being taken away. Would I come back? Not really. But I wouldn't discourage people from trying the place out because it seems Like a real hit or miss as I've heard good things."}
{"text":"One of my favourite spots in town. Sincerely, Jay (the bartender) makes the best old fashions that I have tasted. This place has a cosy feel to it, with country music often playing in the back. This is the place to bring friends, have a blast drinking and have a great time."}
{"text":"Texas tavern looking bar , the decor is rally good . The bartender makes great drinks (cocktails about 10$ each). Open on week days too."}
