{"text":"Was a decent Lunch. Had the chicken kabobs with rice. Not much chicken for the price and was a bit dry. But all in all. Was a good meal."}
{"text":"Wow. Sorry I tried to help. The last thing I was expecting from a 3 star reviews (that pinpointed exactly what could be improved on) was being attacked, blamed and not believed by the owner (see comment by business owner below).

If you can't take constructive criticism well from your own REPEAT customers then how can I feel confident that next time I visit your business that I would have more than .0002 seconds to look over the menu or I won't have to eat watching an employee using her cell phone (that I doubt she washes every times she uses it) in the front of the house. If that is going on in the front then I don't want to know what nastiness if happening in the back?

Blaming a customer that requested time to actually be fully in the store before asking what she wants is completely unacceptable.

So Business Owner let go of your ego, stop attacking customers that give three stars and perhaps listen to us.

I won't ever go back. I have updated my review to a one star because of the ill response I received from the owner.

I'll go spend my money where my concerns or suggestions are appreciated."}
{"text":"Good for gyros, excellent deal on pitas. Great super casual Greek place, really good for take out."}
{"text":"Very yummy indeed. The pita was soft and had great flavor. In expensive Scottsdale it was a great find for something fresh and inexpensive."}
{"text":"I stopped in here for the first time yesterday for lunch. Not only was I very impressed with the menu selection but also the cleanliness of this place! Staff was very friendly and recommended their favorite menu items. Let me tell you I was not disappointed! Their Greek fries were unreal! Can't wait to take my husband here, he will love it!"}
{"text":"Awesome med food.. North scottsdale badly needed this place. Great options for lunch. I had the grilled veggie pita with jalapeño hummus... It was yummylecious. The service was pretty quick. We were served nice hot and fresh pita, enjoyed my lunch and will definitely go again to try the southwest bowl ;)"}
{"text":"best. Greek food. we've found.

we just moved here from Cali and could not be more grateful this is down the street from us. how did we get so lucky?

we basically ordered everything on the menu and every single ingredient is delicious and the portions are huge.

you better get out here asap to try!"}
{"text":"So I've been dying to try this place and I'm glad I did! Love supporting mom and pop places like this one! It's not a fancy place at all and is super casual and kid friendly. I ordered the gyros for $5, which is their special. The pita was fresh as was the gyro! Highly recommend it, although next time I come here, I need to try more stuff! I will definitely be back!"}
{"text":"Amazing customer service! Five stars just for that! I was in town for a conference and mixed up the two stores since both are on Scottsdale road. Oops! 

Christina, the manager at the other location, farther from me, brought the delicious food to the store closer to me! Nastasia was very pleasant and helped me at the store closer to me through all this chaos! I very much appreciate you guys! 

Food was delicious as expected! :) Definitely recommend it!"}
{"text":"I was in for lunch today on the patio.  Food and service was great, as always.  Just wanted to give a compliment to the friendly staff that had to deal with an angry customer.  From what I heard, this person ordered the wrong food, thinking it was vegetarian.  When they got their food, they insisted they did not order that, due to it having meat in it.  The staff very professionally and courteously, informed the guest that he ordered an item with meat, and offered to have him order the correct, vegetarian item.  They were not very happy with that option and then began to talk about the food being equivalent to dog food.  I have to say, as a fellow server, the staff did a great job of defusing the situation, but it is sad that \"we\" have to deal with disrespectful customers like that.  Regardless, the Pita Cafe staff handled the situation with finesse and grace.  Still, one of my favorite places for great food and service, no matter what."}
{"text":"Exceptionally friendly staff and very reasonable menu. Try the Chicken Schwarma, you won't be disappointed."}
{"text":"They had great food and the staff were very friendly,  thinking ahead of time for what I might need to make my meal even better.   When I was done,  they were quick to get my plate from me and wish me a great day.  Great place."}
{"text":"My hubby and I ate here for a late lunch/early dinner and we really enjoyed it. I had the falafel which was perfectly crispy on the outside and fluffy on the inside. My husband had a lamb gyro and thought the meat was seasoned really well.  Plus my side salad was made with fresh veggies and olives.  

The service was good as well, the cashier at the front was friendly and attentive. I took off one star because it's definitely lacking some ambiance and also because they are using styrofoam cups - with so many alternatives out there, there's just no justifying doing that! So if you're the manager reading this - please switch your cups so that we can come back and support your business some more."}
{"text":"This place is horrible. Ordered salad with chicken \"shawarma\". The chicken is pounded chicken breast cooked on the flat top. No seasoning. Certainly not Shawarma. Maybe the gyros are good, but I won't be back to find out."}
{"text":"Excellent!  Their hummus is great, and so are their gyros and the chicken shawarma.  Nothing super incredible to inspire me to give 5 stars, but just short of that.  Thumbs up!"}
{"text":"We were staying at the Marriott next door and walked over on a whim... what a find! Our group had 3 different pitas and a bowl. All were amazing! The Southwestern bowl was huge..probably could split it.  Everything tasted homemade. We definitely will be back. Better than Pita Jungle in our opinion."}
{"text":"Jalapeño hummus and gyro pita are delicious. Place is clean and has nice service. They also have $3.99 pitas during the week from 3-6! Cheapest I've ever seen and very tasty!"}
{"text":"Delicious.  Was staying at the Fairmont Princess, ordered through Yelp based on review!!  Got there and food was ready, hot and tasty.  Gyro was great, chicken seasoned perfect on the schwarma.  Thanks!!"}
{"text":"Solid place for Mediterranean food!

I ended up getting the gyros pita and it was really good! Loved the sauce and the vegetables that went with it were super fresh. Gyro was so savory and delicious and would definitely recommend. I also had a side of fries and those were good as well.

My friend got a bowl and it was also good. The portion seemed like a lot but it seemed very worth for the price.

Would recommend!"}
{"text":"Stopped at Pitadale tonight and had the chicken Mediterranean salad and I got the large and boy it was large. My husband got the beef Shwarma
fries with a salad. Both are really good but I was more impressed with my salad full of greens, corn, cucumbers, and I added chicken and had a good amount. I would probably go back again and get a different salad just to see the differences. Overall we spent 30 bucks so not a bad price."}
{"text":"Probably the worst Mediterranean food I've ever had. The quality of the ingredients is poor. The food is bland and tasteless. The \"schwarma\" was plain chicken, no seasoning. 

If McDonalds opened a greek restaurant, I would imagine this is how it would taste."}
{"text":"Ordered a quick Pita Gryo and it was really yummy..couldn't resist ordering another one..."}
{"text":"A good \"fast-food\" Greek option. I would liken it to a Firehouse Subs if Subway were the low end sandwich shop. Good quality, fast, and friendly. The front staff was very helpful and made a couple of suggestions as to portion sizing mid-order that really helped out my wallet and waist line. I would frequent this spot for a quick lunch if I lived local. 

Location is super clean as well!"}
{"text":"Already being a regular customer at the location on Scottsdale and Pinnacle Peak I was excited to hear they were opening another location on Scottsdale and FLW which is a little closer to my house. I came the first week they opened and tried it out... Food tasted just as amazing as the original location. I had ordered the gyro. My food came out in a timely fashion and the pita bread was LOADED with meat! 

The place is very clean, bathrooms too! The staff is very friendly, I give them a A+ on customer service! One thing I love about this place is that every time I come eat at either location the taste of the food is always the same. 

I recommend everyone give this place a try. You will NOT be disappointed."}
{"text":"Food was fairly mediocre and the service incredibly slow. We waited about half an hour past when our online order was supposed to be ready. 

Of the three visible employees, the two guys were slowly assembling several orders, while the girl did absolutely nothing.

The sign outside says \"Pitadale\", which is a little confusing when you're looking for Pita Inn Cafe."}
{"text":"Excellent food and great customer service.  Great variety of fresh,  healthy options. The picado pita is my favorite. You can order a wheat pita of you'd like,  too. They load it with a ton of fresh chicken. The side Greek salad that comes with it has the best dressing and always very fresh vegetables and greens.  I've gone there so often over the last couple months that they've gotten my usual order memorized.  Highly recommended!"}
{"text":"I arrived to find a dude in a man bun taking my order.  The combo special is 8.99 gyro or chicken pita with side (rice, greek salad, or fries) and a drink.

I ordered a chicken pita with rice as my side. I also ordered a side of red pepper humus ( but not spicy) with pita slices. I had initially asked for no onions but he brought out onions with meal. They kindly told me they could remake my meal but I insisted I could just pick out the onions. I immediately felt so bloated for about an hour after the meal that I felt nauseous , due to some small onions I had eaten.  I had plenty of left over rice and humus to take home."}
{"text":"Service was great.  Had the hummus bowl with gyro meat and grilled veggies. Also had a side of falafel.  The bowl was a bit weird and the presentation was lacklustre. A slop of hummus in a bowl all swirled together with the grilled veggies.  Gyro meat was great, grilled veggies were spot on.  Hummus was bland and falafel were way undercooked."}
{"text":"Barebones atmosphere but great pitas.  Recommended"}
{"text":"Hoping to be able to update this review after another visit, but the first one was a little disappointing. I came here because of the vegetarian and vegan options available. Unfortunately, it started off poorly when they informed me that they didn't have enough falafel to complete our order. We substituted some other items, but the substituted salad ended up covered in feta and, therefore, rendered inedible for my wife and me.  It wouldn't have been a big deal except for the dairy-free discussion when ordering and the fact that it was a to-go order. I didn't have the time to make a 40 minute round trip drive to get a new salad. As I said, hopefully things will go better next time. I was hoping for a better experience. 

The falafel was pretty good -- I'd go back for it. But I stand by my claim that Saba's has the best falafel in the Valley."}
{"text":"I've always had good food and awesome service. 
I recommend the Cesar it's really good. 
Thank you guys for your hard work."}
{"text":"Everything from the service to the flavors was on point. Initially thought to try it out based on other reviews and was not disappointed. Will certainly be back again :)"}
{"text":"There aren't any Greek or Mediterranean restaurants in the immediate area, so I was excited to give the new Pita Cafe a try. 

Pros:
- They have an easy online ordering system where you can order and pay. I love this convenience when I'm working. So much easier than having to call in and have my co-workers listen to what I'm having for lunch.
- Portion size was large, I ordered the south west Greek salad and the chicken & gyro slices were cooked perfectly, and the tangy tzatziki dressing was delicious
- The staff was very nice and gracious
- My order was ready quickly, and I was able to pick it up right away with no wait time

Con:
- The salad was a little on the pricey side at $10, but I think that's par for the N. Scottsdale area

I will return to try some more of the menu! It's nice to have a decent Greek option in the neighborhood."}
{"text":"This is our go to place for Greek food. We normally order for pick up and take it home. Their food is fresh and it tastes good. Its about a 10 minute drive from home and we pass another Greek restaurant that is just not as good when coming to Pita Cafe. They are always friendly and their portions are generous and the price is very economical. My Mom who is picky about Greek food always wants to get food from here when she is in town."}
{"text":"Awesome food! very authentic, coming from MI, I've had it all over the place and this is right on par!  Tried their vegetarian falafel and dipitizer (roasted red pepper and jalapeno hummus). Couldn't of had a better combo.  the GF always requests it when im in the area. nice and clean and the owner is really cool and down to earth."}
{"text":"I usually call ahead because there is usually a wait on the food but their Falafel Pita is UNREAL!! This is place is and will always be my number one spot in Phoenix!"}
{"text":"Great food!  Fast!  The cashier was super helpful and let me taste the different hummus. Yuummmm!"}
{"text":"I visited here based on reviews of Yelp. Totally agree with these reviews!! 

I ordered bowls of grilled vegetables with gyro and greek french fries. Taste, quantity and price are very balanced. I don't eat mediterranean food usually, but I loved foods of this restaurant. Inside this restaurant was also clean and nice atomsphere. Staff treated me was also friendly."}
{"text":"Food is alright , affordable . But they need to do better job with upkeep. There is this persistent smell of something not so good . I wish someone else would also bring this up so that management does something about it ."}
{"text":"This is a really good cafe for a quick lunch.  Salads are fresh & don't taste like chemicals.  Staff is really nice & food is so good.  Can't wait to go back!"}
{"text":"Just had chicken shawarma and rice and I was sat it was absolutely amazing. I ordered from Doordash abc can't wait to try another dish. Lots of flavor and nice portion!"}
{"text":"Great new place! Lots of menu options. Good came out fast and was cooked fresh. We got Pitas and a side of hummus. Good was fantastic! Would definitely return for a quick lunch again."}
{"text":"I have eaten here four times, having arrived at different times of the day and ordering something new each time.  I have been extremely happy with the food, prices, and service.  The quality of the food is a cut above other Greek places I've had in the area.  It's obvious they use high-quality ingredients and take care in preparation and cooking.  I'm not sure what kind of cooking style they use but it's definitely working!

The house salad dressing is great - good blend of olive oil and spices.  The grilled veggies are a must.  The grilled chicken is both flavorful and juicy.  Good-sized portions on everything.  

While the venue isn't anything particularly special, the food certainly would stand the test of any high-priced restaurant."}
{"text":"Excellent food and great portion sizes. I love that they have a kids menu with good options.  Food came out piping hot and fresh. Pita bread was the best I've ever had, very soft and warm.  Woman at the counter was so friendly and had the best customer service. I'm not from this area but would highly recommend"}
{"text":"Great food, easy for to go to eat in hotel room later. glad we tried it!"}
{"text":"I've been a few times now. I've stuck to the platter: chicken kabob, roasted veggies, & rice bc it's what I crave & go back for. Husband has been a lil more adventurous. We've loved it all. Roasted veg doesn't sound that exciting but they season it so yummy."}
{"text":"Pita cafe is a great local place for Mediterranean food. Food is always tasty, excellent hummus, fresh & fast. Michelle gives this restaurant a homey, happy atmosphere!"}
{"text":"We daughter and i had an original and a grilled veggie gyro and they were both delicious.  Service was friendly and fast.

Groupon brought us in this first time but we will definitely be back again and again. Can't wait to try their other items. 

Extra kudos for having FOX News on their TVs!

DADDY!!!"}
{"text":"Friendly owners and good food. They have $5 gyros and chicken pitas ready! Any place with braggs liquid aminos and apple cider vinegar as condiments is alright with me. I'll be back"}
{"text":"LOVE The Pita Cafe! We first stumbled upon this gem at their other location, we loved the food but it was a little too north for us, so we were beyond excited to see the location right on FLW and Scottsdale. We have had lunch a few times and the food is always amazing and we really like the family like service they provide. Most recently we were having dinner and my bf enjoyed his beef pita so much he decided to order a second one. The young man at the cashier had asked him if he tried the gyro and they talked for a minute about the two meats. When the beef pita came out the owner had put a bit of the gyro meat on the plate for my bf to try! Totally impressed by that gesture! and the gyro was A+ as well. We will pro continue to make the Pita Cafe a weekly spot! Thanks for everything!"}
{"text":"Ordered takeout from here. I ordered a gyro with Greek fries and a large hummus on the side with pita bread to dip in the hummus. The fries were dry and the definition of Greek fries was some feta cheese with some meat on top. The portion was also huge! Which isn't bad but for a single person it's almost impossible to finish. My gyro was really good! Good amount of meat and I was surprised that they didn't mess up my specific instructions for it. However a little bit more sauce and feta in the gyro would have been good. The side of hummus was HUGE I was not expecting THAT much hummus. I think I maybe had a few scoops and then I was full. Definitely enough to feed 4-6 people. My overall opinion is that the portion sizes were too big and that the fries needed way more flavor. However the hummus and gyro were delicious!"}
{"text":"Lately I've been craving gyros and since this is close to my workplace, I thought I would give it a try based on Yelp reviews. I ordered the gyro platter with the side of rice and Greek salad. Based on another review, I knew the portions were going to be big and planned to eat some for lunch and take the rest home for dinner. The portions are definitely generous!  I ate all the salad for lunch since I knew it wouldn't save well for dinner and then ate half of the gyro and rice. Unfortunately, I forgot to bring the remaining gyro and rice home from work and then got locked out of the building when I realized I forgot it. The platter could definitely feed two people but only comes with one pita."}
{"text":"First time & I'll definitely be back! Try the Beef Schwarma pita w/hummus sauce instead of cucumber sauce - it's fantastic! People are friendly, great with suggestions, and pay/sign at what looked like an iPad terminal. Convenient & quick!"}
{"text":"The jalapeno hummus was very good and a little spicy. The pita chips that came with it were nice and soft and warm. I had the chicken shawarma and the chicken was very delicious as was the sauce. I think this place will do well."}
{"text":"This place is amazing the chicken Sharma and the fries are so delicious.  Gets busy for lunch so would recommend calling before.  The best gyros and sharmas in AZ.  Go and get it they are amazing!"}
{"text":"This place has good pita bread and good tatziki sauce. But other than that, my partner and I were not impressed. I ordered the veggie platter: The hummus tasted off and the grape leaves and falafel were just OK. I ordered a side of baba which was good. My partner ordered the fattoush salad with chicken kebabs. It wasn't prepared like traditional fattoush salad and seemed just like a green salad with a few sparse chicken chunks. In fairness, the chicken was good but nothing special. This place just seems like a fast food wannabe Greek place. Maybe the gyros are good? But no tahini sauce yet they have siracha sauce? Even the things I liked - the pita and tatziki sauce - I'm not convinced they were made in-house. 

Prices are high for a self-serve mediocre restaurant with OK portion sizes. Service was friendly and the place was clean. But overall, if I want Greek food I'll just go across the street to The Persian Room."}
{"text":"I LOVE the fatoush salad with their kabob chicken. And I also go here for the jasmine tea, but last time I was there they didn't have it. Hopefully they have it next time. Also, the chicken rice bowl is really really good. Everything is in pretty big portions and the people there are always super nice and service is fast. I definitely recommend going here!!"}
{"text":"This is one of the best mediterranean restaurants i've ever been to! The Gyros here is my favorite, especially on top of the fries in the greek fries appetizer, must try! The costumer service is excellent, and the restaurant atmosphere is very nice, highly recommend!"}
{"text":"We just enjoyed a classic Greek gyro from PitaDale!  These are delicious and everything you might expect from a vendor on the streets of Athens or Santorini.  

PitaDale offers a decent portion of meat paired with a pita, some light onions, lettuce, tomato and tzatziki sauce.

We stop in here at least once every month or so, as we know they produce a consistent sandwich for a reasonable price.

The location is conveniently located just north of Frank Lloyd Wright on Scottsdale Rd."}
{"text":"Pita Inn was a surprising find. I've eaten there twice and the food is excellent and a good value. The staff was super friendly. 

They have some \"American\" options like a philly pita with chicken or steak.  

Give it a try. You won't be disappointed."}
{"text":"Had a Groupon and we were in the mood for this type of food.  Very clean.  Nice patient staff who described meals in question.  Ordered a chicken shawarma platter w/fries and salad and hubby got Gyro plate w/fries.  Both came out quickly.  The green salad is ample and the salad dressing on the side was a bit tart for my taste.  A little goes a long way.  The shawarma was delicious especially with the Tzatziki sauce.  We both had leftovers to enjoying the next day.  Would definitely go back.  There is a great daily special that would satisfy any hunger pangs."}
{"text":"Updating to 4 stars because the manger said they do allow substituions of tzatziki to hummus. He also offered 20% my next visit. Great to see that they respond to their feedback.

I've been a few times now...The food is pretty good but only giving three stars for their services and prices. I ordered my meal and told them to hold 3 of the items (dressing, tzatziki, and feta) because I don't eat dairy and asked for hummus instead. They said they don't do substitutes and I would have to pay extra. Really??? I mean cmon I am already saving you a bunch of ingredients. 

So I ended up paying $10.75 for some rice, three pieces of falafel, and some raw veggies. Not worth the price for the amount of food."}
{"text":"Great food and great customer service! The guy at the register was very nice and patient, recommended the original gyro and it was great! Will definitely be back soon, thanks!"}
{"text":"I have been asked what cuisine I would choose if I could only have one until the day I die.  I would choose Greek.  The broad spectrum of favors and textures as well as aromas makes this cuisine the best.  I have traveled far and wide throughout this valley and have not found a cleaner restaurant with amazing food prepared exceedingly quickly and accurately as the Pita Cafe.  A family owned and operated establishment John flew around his open air kitchen allowing anyone to see all aspects of the cooking process.  The courses arrived beautifully presented and highly tasty.  His cousin Jasmine was delightful and knowledgeable with expert advice on the assorted menu items.  Her smile was as warm and welcoming as the wonderful aromas coming from the other side of the glass kitchen partitions.  Overall we loved it and took a second meal home.  Highly recommended for any craving or anyone who truly knows great food."}
{"text":"Worst food I've ever eaten . Very expensive small portion did not resemble any middle eastern food I've ever eaten . So greasy"}
{"text":"Fast, friendly service and fresh, tasty ingredients. Ordered chicken schwarma on a pita (grilled chicken with lettuce, tomato and onion with tzatziki sauce) plus hummus. Very good and quick to go! Was traveling on business and staying at a hotel across the street. Great find."}
{"text":"Just as awesome as the other location.  I love that this is a family run business.  This location is super clean, and I love that they have so many places to sit.  The food is always top notch, fresh and comes out fast."}
{"text":"Best chicken gyro my husband has ever had.  The beef shawarma was also good.  A touch pricing compared to back home in Colorado, but everything here seems just a bit pricier."}
{"text":"Our first visit off a Groupon and we really enjoyed the pitas and talking with the staff. I ordered the gyro and it was HUGE.  I have never seen so much food for $10.  I was stuffed and the lamb had a very good taste with a hint of salt.  Most gyros I have had in the past were bland and needed the sauce to give it taste.  

My guest had the salad which was also two meals. 

See my pictures to see what I am talking about.

I would recommend regular fries unless you like the Greek style with sauce on it.

Probably the best value around for what you get in taste and quantity. 

Love the soda as they have the old fashion type of ice you do not see that often anymore."}
{"text":"Yummy!! Sitting in the restaurant right now as a first time customer. I love gyros so my boyfriend and I decided to come try this place. I just got a regular gyro pita and it was exactly what I was craving, more fresh than gyros usually are! The pita was very soft and all of the veggies were crisp. My boyfriend got the chicken schwarma and it looked so good! He also got the side salad and it was so zesty and fresh. I will definitely get a  side salad next time.

Restaurant is clean and much bigger than I expected. The guy at the register (no name tag so I didn't catch his name) was so friendly and helpful. He got us signed up for the rewards program so we are exited to come back and try their other items and sides."}
{"text":"I went in right before closing. The menu is a little bit overwhelming but the guys working we're pretty helpful and friendly. The hummus was great. And it came with so much Peter bread. I ordered extra and it wasn't necessary. The grilled chicken is great also!! No complaints at all from my friends and I."}
{"text":"Pita Cafe knows how to make great Greek food!  I've eaten here three times just to make sure it was really consistent, and I wasn't disappointed. 

The pita bread is fresh and soft, the meat tasty, and the sauce fabulous. 

The service was friendly and full of lots of smiles. The restaurant is clean and nice decors too. 

I would strongly suggest this quick serve greek restaurant to anyone!"}
{"text":"I've been here twice in two days if that means again. The staff is very friendly, and the food is fresh. It's a fast-casual place, but feels like full service. The gyro and chicken pita is stuffed full and tasty. Greek salad is a bit plain, so skip it. The french fries are really good, though."}
{"text":"Fast food Mediterranean food. Yes please.

I got their chicken pita and a side Greek salad. It was so good, I inhaled it. My husband got a gyro double meat and the size of that thing was ridiculously huge. He was a happy camper. Facilities are clean and service is prompt. I did think it was cute they have siracha as their condiment next to the ketchup."}
{"text":"Great place to eat honestly it's taste just like back home the food is priced great and big quantities customer service makes you feel like you're at home there sauce is to die for"}
{"text":"Stopped here yesterday and got take-out. I've eaten at their other location several times and it has seemed like the food has slightly changed over time. Not for the better. I was very disappointed to see a man throw a bag of gray gyro meat chunks on the grill as I walked in. So I guess they don't slice the meat fresh off a spit. My daughter noted that her meat was weird in her gyro - some jagged chunks, large cubes, and thin slices. The taste wasn't up to snuff either--likely from the less than optimal way it was prepared. Their hummus was still good but could use a little more garlic or something.  I'll be taking a lengthy break from Pita Cafe."}
{"text":"This place is great!  Need shawarma pita with gyro fries is the bomb dig!  Will be going back again... Real soon"}
{"text":"Always loved this place... But had a Mediterranean gyro .. Was really bad. Soggy .. Lettuce bad and lots of oil ! The salad was not good either.. Was like it was sitting out for awhile. Not fresh. Bummer !"}
{"text":"I really quite like this place. The food is outstanding for being a quick serve place and the staff is always friendly. Has a \"doesnt seem like Phoenix\" vibe which I dig. Hope it sticks around."}
{"text":"The food is absolutely delicious. My falafel was perfect and reminded me of my trip to Israel over the summer. It was a great quick bite."}
{"text":"Just moved to Scottsdale across the street from Pitadale (was called Pita Inn Cafe prior) and I want it every day and night now. I am obsessed with Mediterranean food and this is simply the best in the area!!! EVERYTHING is good and the staff is so nice and efficient!"}
{"text":"Great service and delicious food! The hummus and baba ghanouj are outstanding! Very reasonable on price especially for the quality and quantity of food you receive... highly recommend the wonderful and clean place"}
{"text":"I just ate here for the first and last time. I had a gyro and side of rice. when my food was ready I took it outside to eat with my Rotti as the patio is dog friendly. as soon as I looked at my food I knew I made a mistake eating here. there was a long black hair on the top of my food. the gyro meat was paper thin and totally dried out like it had been sliced off hours ago and had a bad greasy taste to it. the rice was odd, yellow and very small grain. it tasted ok so I ate it. I won`t be back !"}
{"text":"Bomb.com, got the Mediterranean Pita and Jalapeño hummus.  It was amazing! My wife had the Greek fries and it was delicious. Must come to place in Scottsdale!"}
{"text":"I was a bit disappointed with my order. I ordered through a delivery service and was going to eat during my lunch break. I didn't get any salad dressing with the fatoush salad. One of my pet peeves is when restaurants forget the salad dressing. Might as well forget to add lettuce... Dolma had a nice flavor but it was over cooked. It was mush and fell apart before I can pick it up with my fork. I may try again but I'd have to pick up myself so I can make sure everything is there and isn't falling apart."}
{"text":"I'd been anxiously awaiting their opening day, ever since I saw their signage go up in December 2014. Today was the day.

Inside is spacious and open. There is a refrigerated case stocked with bottled drinks, but there is also a fountain machine for soft drinks.  I also liked that they offered different Bragg's condiments (Hello Nutritional Yeast Seasoning!) as well as Sriracha sauce and other options. In true cafe style, there are a handful of tables inside and a few tables outside as well.  My personal favorite here (as far as decor) are the canvassed pictures of Santorini along the wall. It makes me long for my bucket list trip to Greece. 

On to the food... This was my first time at Pita Cafe (there is another location further north on Scottsdale Rd), and the worker (owner?) was very nice, helpful, and patient. He answered all of my vegan-y questions. Luckily, this place is very veg*n-friendly. (There are plenty of meat options for you carnivores, but as a vegan, I will focus on their veg*n options.) 

For starters/ appetizers, there are several different flavors of hummus, Veggies Dolmas, Spanakopita (vegetarian, but not vegan due to the feta cheese), veggies and dip, Veggie platter, Baba Ghanoush, etc.  If you enjoy pitas, they have a Veggie Pita (omit the taziki sauce to make it vegan), Grilled Veggie Pita, Hummus &  Tabouli Pita, and of course Falafel Pita.  There are also quite a few (7!!) veg*n salads (if you're vegan just remember to omit any cheeses and the taziki sauce; it contains dairy).
For bigger appetites they have platters. Veg*ns can choose from a Falafel platter or Dolma platter. Both come with your choice of 2 sides. 

I ended up getting the Falafel platter and the Dipitizer. (Wait for it!) 

FALAFEL PLATTER:
My Falafel platter came with 6 perfectly seasoned and cooked falafel balls, what looked like a red and white onion mix, a whole piece of falafel bread, and it normally comes with taziki sauce but he allowed me to substitute for a small cup of hummus (which was perfect). For my 2 sides, I got rice and a greek salad without the cheese.  Their rice is NOT made with animal broth or animal by-products, so it's completely vegan-friendly.  It was very good and the portion was very generous.  Same with the salad. No okie-doke, Baby Stewie portions here. It was a full container (I had a carry-out order) of luscious greenery.


DIPITIZER:
This is for my double-dippers! Raise your pitas in the air! Then dip 'em like you just don't care! Oh yeah! 

You get to try different hummus flavors plus a third dipping dish, which the menu lists as taziki, but again, the worker (owner??) was SO nice and accommodating that he allowed me to sub for Baba Ghanoush (which IS vegan).  
1-JALAPEÑO HUMMUS: Delicious AND it had some spicy kick to it (unlike some other places). Perfect!
2 - ROASTED RED PEPPER HUMMUS: yummy!
3 - HUMMUS: the original hummus flavor, but there is nothing ordinary about it. It's very fresh and each ingredient is distinctly present. Easily the BEST hummus  that I have had in the Phoenix area. 
4 - BABA GHANOUSH: it's a pureed eggplant dish, so it's good for dipping. The flavor was amazing! The eggplant tasted as if it was fresh off the grill and into the mixer. Some of the best Baba Ghanoush I've ever had. (Even if you typically don't like eggplant - like myself - I suggest trying it.)

They don't offer Tahini sauce as a side option, nor do they have french fries.  The tahini apparently isn't popular, so that's an understandable business decision. But the other location offers french fries (goes fabulously with a pita sandwich), but they do not... I had my mouth all ready for some fries. But regardless, I still love this place. Excellent food, excellent customer service.

FYI - they also have gluten free pita options (for an additional charge).

The owner is working on labeling items as veg*n and \"gluten-free options available.\"

DD got the Chicken Pita and she loved it. In her words, \"I should've gotten 2!\" Not because it was small, but because it was so good.  
(You can get the Chicken Pita or Gyros for only $5; available all day.)

Looking for them? They are on North Scottsdale Rd, north of FLW/Bell (the tall blue sphere), on the right side of the street (if traveling northbound). They share the parking lot with Sushi Brokers, AT&T, Nothing Bundt Cakes, etc. If you pass the Fairmont, you've gone too far."}
{"text":"Just had lunch with the family here. It's amazing! The food is plentiful, fresh and full of flavor. There's a wide assortment of beverages. Inside and outside seating and you can even charge your phone at your table while you eat. Very clean and the staff are great. I lived in Greece for one year and this is as close to authentic as you can get. I will be back!"}
{"text":"Best Mediterranean food around the area and excellent chicken pita. My go-to for lunch"}
{"text":"Fresh ingredients make this place a standout. Had the freshly cut lamb gyros and Greek salad. Both items were tasty and fresh. Got my order to go, everything was perfect."}
{"text":"Pretty good for falafel pita and side salad. Recently opened when I visited, so the full menu was not yet available. I will need to try it again and write a more detailed, updated review."}
{"text":"Very clean well run restaurant. Many Mediterranean and Greek alternatives in the neighborhood. They are always pushing their $5 pitas which is a great price for a gyros or whatever protein you choose but they fill it with mostly vegetables and only a few pieces of steamed gyros meat?? I like my gyros fresh off the spit and crispy. Many other similar restaurants right in the area charge another $1 or $2 for the same but give you three times the amount of protein. I would rather pay $6 or $7 and have more than vegetables and bread."}
{"text":"I come here a couple times each months and the food is always great.  Reasonable prices and friendly service!"}
{"text":"Pita Cafe was a pleasant surprise! My husband loves Greek food and was in the mood for a delicious gyro after church on a Sunday. Most places are packed on Sundays with long waits for food, but not Pita Cafe. There were plenty of diners in the cafe but the service was quick and very friendly!
My husband was impressed with his gyro and french fries, and I loved my chicken pita. (I also tried his fries: they were nice and hot with a yummy seasoning salt on them) Everything was very fresh. My pita was soft and tasty, and the chicken was seasoned perfectly. Prices are reasonable. Thank you Pita Cafe for a wonderful lunch!"}
{"text":"Nice small family owned cafe close to  Nothing Bundt Cakes.

We ordered the Gyro and Chicken Pita which each were $5. Both were very good and tasty. Just enough mayo on the gyro where it complimented the taste rather than took over.

This is a small cafe with around 15 tables and you walk in to a aisle leading to the counter to order your food.

I liked this place and for $5 how can you beat the price and this is a great alternative for burgers or pizza.

Will definitely be back again and try other items from the menu."}
