{"text":"I love Pita Nutso! I've been coming here for as long as I can remember. They probably have the best tasting shawarmas I've tried thus far. If you're craving shawarmas, you MUST give this place a shot. :)"}
{"text":"I come here regularly for lunch.  The portions are generous, the staff is friendly, and the food is always delicious.  The menu can be divided into two categories: dinners and wraps.  The dinners have a base (hummus, salad, or rice) with your choice of shawarma meat (chicken, beef, or lamb) on top.  I usually get the 2-for-$14.25 dinner deal, splitting with a coworker.  My favourite item is the Hummer (hummus) with double chicken.  If you're feeling particularly hungry, The Works is a great deal at around $11; however, I've yet to meet someone who has been able to finish it.  The location is pretty small, so if you're with a group I recommend getting your meal to go.  Otherwise, this place is fantastic!"}
{"text":"The food at these places is awesome. The portions are  very generous and prices are reasonable. My personal favourite is the chicken shawarma dinner or pita. Not the greatest looking place, but definitely worth the trip for take out.  Oh, the sauces are delicious too!!"}
{"text":"Yummy ! The boys here are always very nice to us! The food is very good as well. We are regulars when in the area :)"}
{"text":"Queen Street in Mississauga has 5 shawarma places atm (including one beside this one and another a few stores apart). This I think is the best as far as the actual shawarma wrap goes, it's just as good if not better than Osmow's at least and the guys here are more friendly...they always have soccer on the TV so it's hilarious when their favourite team is playing and they start cheering. They glaze their pita with a mild garlic sauce which is delicious and they stone grill the bread rather than using a toaster which makes the pita taste so much better...wish other shawarma places would do that.. I dunno about other locations which don't have as good reviews but this one is nice. Not a lot of sitting room and the music is a bit too loud at times but if you're getting take-out then it's good or if you don't feel like waiting in a long line at Osmow's and need an empty table. The prices are also reasonable, they give a shawarma + a big plate of either fries (which I can never finish) or potatoe wedges + a drink for like $6  For UTM students, this is a pretty good place to go for lunch cos it's an 8 min ride on the 44 from UTM and much better than our food options. If they wanna improve then they can maybe use less lettuce in their shawarma's (just my preference) and use better sides because potatoe wedges aren't really that great and the fries are avg (oh and turn the music down during lunch lol)."}
{"text":"Been coming here since 2001 when it first opened...always enjoyed it. Taste changed a little a few years ago when the owner made it to a franchise model. But this is still my go to place for shawarma."}
{"text":"Every time I come to Canada, I must have Pita Nutso. It's just awesome. We don't have anything that comes close in Michigan, even though we have shawarmas and pitas. It's certainly not gourmet, but Pita Nutso is to Shawarmas what Taco Bell is to Mexican, I suppose."}
{"text":"Absolutely delicious. I've been coming here for 10 years now and they never disappoint. I recommend the spicy ricey with cheese!"}
{"text":"When I'm in this area, I usually go to Osmow's; however, Pita Nutso is definitely the next best thing. Sometimes, the line-up at Osmow's is too long and I actually choose to come here instead.   The sauce at Pita Nutso is pretty good and I like how you can add more sauce on it yourself. Only thing is that I wished they would put more meat in their shawarmas, especially since it is a bit pricier than other places."}
{"text":"Had the grilled veggie pita meal. Hot, fresh, delicious. Amazing prices especially for more than one, they have great daily deals such as 2 pita for 14$. Fantastic."}
{"text":"Great Shawarma!. Possibly the best I've had so far. I can't comment on any of the menu items but I would recommend trying their Shawarma."}
{"text":"The best pita across any chain anywhere! I love pita and have tried many places but this location beats them all! They have mastered the technique and their meat off the grill always tastes fresh! The servers are just one of the best you will meet- always greeting you and taking a second to know you! Most importantly they make a point to remember what you like and how you like your food served and that's awesome! I've been having Pitas at this location for years and it stands top of my list still!"}
{"text":"Used to be one of my favourite places to get Shwarma in Oakville. I agree with other reviewers that it can be a bit slow at times but the Chicken Shwarma is worth the wait! Can't really disagree with Bryan G's review other than Id like to highlight the Garlic Sauce. Amazing! If you dont mind having garlicy breath for the rest of the day.   I like eating in the restaurant. They provide each table with bottles of the garlic and hot sauces so you can spice it up as much as you please. Ive been known to drain the garlic sauce bottle quite a bit :). My recommendation would be the chicken shwarma as it really is their best dish."}
{"text":"When I'm craving a spicy chicken shawarma sandwich, Pita Nutso on Trafalgar is tough to beat. With my sandwich in one hand and the bottle of garlic sauce in my other hand, I make sure that every bite has a generous amount of garlic sauce. The sauce is really that good! Also, if you're a mango fanatic like me then you'll enjoy pairing the sandwich up with a can of Jumex Mango nectar."}
{"text":"Average Shawarmas nothing special, Good price...probably better than a McChicken for 7 bucks but I have had better Shawarmas in Toronto and Mississauga."}
{"text":"I love Pita Nutso. SOOO MUCH! I've cheated a few times with other shawarma establishments, but I always come back."}
{"text":"Priced right. Big portions. Chicken on the rocks is a must. Parking is at the back, a bit hard to find. Busy at evenings. Good value for the money! Make sure about ur shawarma, it gets a burnt taste if you don't tell them not to get it toasted for so long. Happy eating!!!"}
{"text":"I've been going here since I was a kid. Ali, the owner is amazing. Last night when I was ordering dinner, I had a brain block and fully ordered 2 Falaffels when I meant to order 2 chicken Shawarmas. I when I mentioned my mistake they made me two Shawarmas anyway! I insisted that I pay the difference but they told me not to be ridiculous lol.   It's rare that you find a place that will happily remake your food for you even if the mistake was yours!"}
{"text":"The food is of decent quality but the staff at every location seems to be complacent... If you turn up 15 minutes prior to closing expect a lie about them \"running out of chicken\""}
{"text":"Though I am undoubtedly a Seinfeld superfan, even I can admit that sometimes the Seinfeld reach is just a bit too far. It's like anything powerful, put into the hands of the wrong people, bad things can happen. Like the name of this chain.   The t-shirts actually say \"No Pita For You!\" on the back of them so I'm clearly not just making this up. But once you get past the Seinfeld slaughtering, you'll find that Pita Nutsy offers up a pretty good meal.   Oakville has a habit of providing food at lower quality but higher prices than Toronto and this is no exception. Sometimes you can get in on a great \"deal\" like 2 chicken shwarmas for $10. A kafta, shwarma or souvlaki dinner is fucking $14. You'll be mad until you realise you can't get a cheaper meal without going into the city.   Once you calm you'll be treated to some of the better food the suburbs have to offer. Loaded with a thin but tasty garlic sauce, the chicken shwarma is, in my opinion, the real winner here though many like the kafta as well. Personally, I find it difficult to get into any food that sounds like that beginning of a giant loogie. As soon as I try to order it, I'm turned off. I'll stick with my shwarma.   The meat is tender but grilled up nicely so that it has it's crispy parts and the guys behind the counter seem to at least mostly know what they're doing - even if they do get a bit flustered if there's more than 2 people waiting.   Incidentally, they do not offer soup."}
{"text":"My go to shawarma spot in mississauga, best in the city. Good portions and price. Definitely prefer this over ozmos."}
{"text":"Way better than osmows as you don't have to wait hours for your food. Food is good and the staff is good as well"}
{"text":"I tried a \"supreme\" chicken shawarma pita on the weekend. A supreme means they add hummus and tabbouleh as well as their usual toppings.   I found my sandwich was very thin and light. I don't think they're doing this on purpose because my dining companion's sandwich looked pretty hefty and wide. It's obviously just a consistency issue. Normally a shawarma pita from any shawarma place fills me up, but this was definitely merely \"snack-sized\" for me because of the lack of heft.  The chicken tasted pretty good and the veggies seemed fresh. A couple of disappointing things (aside from the thinness of my sandwich): the garlic sauce wasn't very garlicky, the hot sauce wasn't very hot, the vegetables on the pita were tomatoes lettuce and onion (no pickled turnips, pickles, or hot peppers), and I didn't taste any tabbouleh. I don't know whether he forgot to put tabbouleh on or maybe they just skimped and it wasn't detectable.   This place is great for persons who are averse to strong flavours, but it's not going to satisfy those looking for really garlicky sauce, spicy hot sauce, and awesome pickled turnips."}
{"text":"Great food. Went on yelp to look up restaurants to grab food. Pita Nutso had 5 stars so I thought that I would take a chance. Turns out the reviews were right. Fair prices to. I got the works and couldn't finish it and I am a big eater. Would recommend to anyone and would definitely go again."}
{"text":"The best place to get a pita IMO. The two main guys working are a riot. Every time I go there I'm leaving from laughter because they know how to joke around and make damn good pitas. Also you can't go wrong with the prices either. Two thumps up for this place definitely."}
{"text":"I had to wait an hour in line on Canada day evening after the fireworks. But it was definitely worth my wait. I'll be back!"}
{"text":"The best thing about shawarma is that the meat works almost as long as you do to get the amazing rotisserie taste, so when I find a place without the skewer, I get really disappointed.   3/5 stars because the chicken is on the skewers, but not the beef. The beef is sliced up into chunks and pre-cooked. When you order it, they pull it out and heat it up on the grill.   Also, the dishes are too inconsistent to warrant a higher rating. You get the salad and it comes with pickled beets and pickles one day and the next day it doesn't. Disappointed.   The chicken is decent shawarma, the garlic sauce is a little lack lustre. Overall, it's an ok place. Nothing to rave about."}
{"text":"I have eaten the shwaramas from this location a few times. The service has been inconsistent where sometimes it takes quite a while to get your order. The food itself I found to be OK, nothing special, but my parents absolutely love this place. I found that the shwarama here is more like a pita as opposed to a sandwich, hence the name pita pit.   Overall it is a good location to grab a quick bite as the staff are quite nice."}
{"text":"Just ate at Pita Nutso at Royal Windsor and Ford Drive. The store owner was AMAZING. He stayed open a couple minutes late for me and gave me a truly fantastic Chicken Pita. PITA NUTSO you have a customer for life."}
{"text":"Great food and customer service. The severs greet you with a smile and always delivery great quality food. The portions and prices  is of great value. My favourite is their chicken Shwarmra  with fries. If your looking for good food and great customer service this is the place to go."}
{"text":"If you haven't tried Pita Nutso's chicken shawarma pitas then you need to go now, like right now. They are amazing! My friends and I like to call it shawarma crack. Regular, lots of garlic sauce, spicy. Trust me! I could eat their pitas every single day and not get sick of them.   My husband just had his first experience a month ago and wants to go regularly now. My friends in Hamilton ask me to specifically bring Pita Nutso when I go visit them.   Their prices are fair, they are always friendly and the food is hot. I will be going back again and again and again."}
{"text":"Ita been awhile since i ate here but i remember it being amazing. Yesterday i ordered a Shawarma with extra meat and boy did they deliver. Service still going strong after all the years. Deservea every star."}
{"text":"I've been to their location in Streetsville, but sat down this time and went for the hummus platter. I don't believe I've come across a platter before where the whole base of the plate is hummus, and then topped with rice, chicken and your choice of veggies.  I like the concept of the platter as I LOVE hummus, but like my previous experience with this chain, flavour is okay but lacking. The hummus is smooth, but the tahini and garlic are too subtle IMO. Hot sauce is too mild and almost as sweet as it is hot. Chicken was quite good with a nice crisp but still tender and fresh.  I enjoyed it, but only to an extent as I'm looking for bold flavours and they seem to cater to people with a milder palette than mine."}
{"text":"Yummmmy ! I knocked off a star for slow service! But the food is delish! And they give you unlimited garlic sauce for the table!! Check it out!"}
{"text":"The good: It's a large pita with very fresh ingredients, and variety of toppings to chose from.  The not-so good: The meat is not really seasoned (though it was fresh), the sauces don't have much taste and the hot sauce is about as mild as you can find. You don't really get Middle-Eastern flavours, but only a slightly improved 'Pita Pit' experience.  What to expect: a large, fresh-tasting pita - but frankly pretty low on the taste scale. I was a bit surprised at the high rating, but it all depends on what you're into."}
{"text":"First time I had a Falafel sandwich that had falafel that was doughy and soggy.  Meh...  My eating mate had the ultimate chicken thingy... Also meh...  Last time I will eat here."}
{"text":"I've been coming here for years and years. Delicious and addictive food and garlic sauce. Enjoy the falafel, shawarma, salad, just about everything they offer is very tasty.   Seating is limited and usually filled at lunch time so its mostly a take out spot.   I love the place."}
{"text":"Chicken on the rocks was so amazing! We need this in Southern California! The flavor of the chicken was delicious. The garlic sauce i can literally put it on everything. The plate was filled with rice chicken and the pita bread. I'm going to miss this place and will need to come back up for some Pita Nutso."}
{"text":"The first time I had a shawarma was at this place. This was shortly after this restaurant replaced a Greek restaurant. Vince insisted that I give the garlic sauce a try and I was hooked. I've tried shawarmas at other places but I always come back. Still remember Vince telling me how he's gonna call the place The Pita Nazi (like The Soup Nazi) while I ate my shawarma at the counter. I highly recommend this place."}
{"text":"First time here. I came with 2 toddlers and the staff was beyond helpful! The girls and I enjoyed our food, but I would definitely come back even just to support a place that prices themselves on customer service."}
{"text":"Not good. So many better quality choices out there. The Steak should have been trimmed. Chew for days."}
{"text":"Great Shawarma place, always fresh and taste is awesome. The best dishes I like is \"the works\" and \"Spicy Chicken\" Shawarma. \"The works\" comes with salad, Pita bread, rice chicken it is really great. One must try it."}
{"text":"Definitely one of the top shawarma spots in Mississauga.  The Chicken on the Rocks is top notch - fresh chicken and rice with a savoury garlic sauce. Portions are more than filling too.   It's hard not to compare it with Osmow's because they literally share the same building, but I'll give Pita Nutso the edge. If you love Osmow's, you need to give Pita Nutso a try."}
{"text":"Used to eat here when it was 'Pita Nutsy,' and despite the name change, it still delivers the best falafel and chicken shawarma wraps! I am vegetarian right now but would gladly have a cheat day and eat their chicken shawarma wraps. My family and I haven been eating here for quite sometime and enjoy the consistency, and the garlic sauce, yumm! The wraps are fresh and quick, and well priced. Either location in Oakville (Lakeshore) serves the same delicious food."}
{"text":"I took my Dad there as i was convinced they have good pitas. We were both disappointed though. Quality of the shawarma declined throughout the years. I don't know what happend. Used to be a really good shawarma but the product is just not matching the same standards. Be aware pita mates!"}
{"text":"This place has been open for as long as I can remember. When I was a little girl we lived in the apartments above the strip of stores its in. I really have no clue how long ago that was but the owner used to work there himself. It was small, always sweltering hot and everything was wood! It was definitely the hot spot in streetsville and i could say that majority of mississaugians know of this place whether they have been there or not. I has true heart. They have now become a franchise and have locations all over the GTA and are growing. Its and irreplaceable taste and feeling of comfort being inside this place. I have had the food at the other locations and although they are good no other beats the hometown original like the Streetsville location. The food is always good and super fresh moist meat. There is another shwarma place half a minute away, but they still do not compare to Pita Nutso. During our Bread and Honey festival people are walking all over queen st and you better believe they are smelling and tasting this food when they walk by. I think im so passionate about it because its from my home town in the city, and they have put so much effort into revamping the restaurant but keeping the home sweet home feeling. I definitely suggest this place to any and everyone who will ever be in the Mississauga area. If you cant get here then definitely try one of the other locations. Even if the people suck, the food should still be amazing."}
{"text":"When we feel like having a really good shawarma, especially spicy, this is where we come !! Best Libanese take-out in the area!"}
{"text":"I have mixed feelings about pita nutso.  Overall it's a pretty decent place.  Their chicken shawarmas taste good, their fries are pretty decent and the prices are not that bad.  The actual restaurant interior itself is kind of small though so you can't always rely on seating being available, and it's not exactly the cleanest place either, so I usually don't feel overly comfortable about eating in here.  I guess this might be the reason why I have an underlying negative impression of this place despite the pretty good food.  I sometimes wonder what exactly goes on behind the scenes and whether or not their \"chicken\" is actually chicken.  The people working here weren't the greatest either.  They were a bit on the rude side and one of the guys likely forgot to make my fries for me since it took like 25 minutes for them to be made even though there was nobody else there.  I went with a female friend of mine once and I could tell that the employees were scoping her out from behind the counter, quite immature and perverted of them.  Go here at your own risk"}
{"text":"Not bad..  I prefer their chicken to Osmow's next door which is \"cheat\" cooked on a flat top, not true vertical rotisserie style like a shawarma should be.  This is the original location before they popped up with 20 other chain locations.  It was best years ago when they were The Pita Nazi (then Nutsy, then Nutso)"}
{"text":"Had to check this place out after hearing constant raves!  I'm surprised that this place was very quiet and it's really hidden in the corner. This review is in regards to the chicken on the rocks, since I'm all about trying and comparing it to other places.  First off not bad with the Chicken! It's flavourful, juicy and not dry, rice is good too, fries was not soggy when topped with Chicken. Also, I like how they give you the whole bottle of white saucevand hot sauce to drench your order in. The white sauce was very garlicky, just the way i like it. The hot sauce had a really good flavour but not too spicy. I would say their portion with chicken to fries to rice isnt as much as Lazeez though.  Customer service was great! The place is small but there are tables around. If you don't have time to wait around and line up, i say give this place a try! You wont be dissapointed"}
{"text":"Had takeout today...falafel on a bed of hummus was pretty tasty. Hubby had the chicken on a bed of hummus with pita on the side. He enjoyed his meal too. Not much else to say."}
{"text":"I decided to visit this place after having a not so fabulous experience at Osmow's. I ordered their version of Chicken on the Rocks, while they did take an effort in preparing it, it didn't just level up to what I am used to from other Shawarma places. I found the sauces and the chicken itself to be too salty. While it may have been an \"off day\" for them, I am willing to give them another shot based on some of the raving reviews of the place."}
{"text":"Pita Nutso is a Streetsville staple just like black Kramer ( look him up if you don't know who he is). My usual meal is the is shawarma on the rocks which is chicken with rice. They have great deals if you are getting more than one shawarma, so bring a friend and check it out."}
{"text":"Seriously delicious Shawarma. Whatever they put in the sauce makes you want more...and more. For me, this place is in direct competition with Ali Baba's. If I had this place on one side, and Ali Baba's on the other, I'd split in two.  As an added bonus to the awesome taste, the staff is friendly, energetic, and overall pretty awesome. :)"}
{"text":"I had the chicken shawarma and it was tasteful but not that good, it's about $7 and I don't think it worth it. I've had a Chicken shawarma combo at Rabbah for $5.60 and it comes with fries and a can of pop. Which I think is a way better deal then $7 for just a shawarma that isn't any better then the Rabbah one which fills me up way better. I went after reading the reviews but I honestly don't even see hype about this place, sure the shawarma is a generous size but it doesn't justify the price hike. Probably won't be returning here."}
{"text":"This is the worst shawarma place ever, I've been today afternoon to bring lunch for my family and the person who took the order was rude and doesn't have any customer service experience; i've requested not to put rice or fries on the meal as I'm on diet and he responded with rudeness what do want?   I stated that only salad with shawarma will be good.  When he filled the plate with the meal he took some of the shawarma back again, and i said why you did that but he did not replied! Also the shawarma was not fresh and it seems to be leftover from yesterday.  Not recommended at all; there is another shawarma restaurant just 100 m to the south i heard it is much much better.  Avoid buying from this restaurant..  This is the first and hopefully the last time for me."}
{"text":"I ordered 6 meals from Pita Nutso this afternoon. Ali and his assistant were very gracious and the food was sumptuous.  My colleagues were tasting the food for the first time and they were very happy with the flavour and the portion sizes.  Good job Ali and team.  Keep it up."}
{"text":"So bland. I had a chicken shawarma and a buddy had a lamb kabob, both had zero taste. We both wanted it spicy but neither had any kick. Only good side is it the food came fast. I wonder why I used to go crazy over this place back in high school when they were pita nutsy. Either they completely changed their recipe or my tastebuds evolved. Either way this will be my last visit to pita nutso.   Do yourself a favor and go to either Osmows or chefs door."}
{"text":"I followed the trail of Yelp positive reviews to this place.  I would have never come here on my own as this place is easy to zoom by without noticing it.  When we walked in, you're wafted by the smell of fresh grilled meats.  There's a HUGE rack of the shawarma just roasting and you can see it's not dry at all.  All the vegetables and pitas are laid out as well and it's clear they're all fresh.  The place is TINY.  Though there are probably 5 or 6 tables, they're all taken during the lunch hour.  There's not a lot choices but what they do, it's dang flavourful.  I got the chicken shawarma on salad.  It came with half a fresh pita that was grilled (yum!).  The salad was HUGE.  It was loaded up with black olives, feta, tomato, and onions.  The dressing wasn't oily and it had great herbs in it.  The chicken was nicely charred and had that great bbq smokey flavour.  I would have preferred to be given more but it wasn't so bad.  It probably was about half a chicken leg amount.    My colleague ordered the lamb kabob on a rice plate and he said it was really tasty.  The rice amount was insane.  It was a HUGE pile on top of the plate.  I also saw a lot of people order the pitas.  They are just huge in portions as well.  I would say it is easily 4 inches in diameter.    The service was fast and also nice.  I'll definitely return and try their falafel next!"}
{"text":"I like to come here once ina while to get my filling of tasty pitas.  The garlic and spicy sauces are the bomb!  The service is friendly and the portions are pretty large.  I am salivating whilst writing thei quick review....."}
{"text":"Flat out the best shawarma West of Toronto!! Perfect mix of vegetables, sauces and a lot of meat! We love how they grill it after also.  Furthermore, the customer service these people offer is outstanding!! Ali and his team take such good care of our family every time!"}
{"text":"I was never really a fan of shawarma, until I came here with some co-workers. This place is pretty much a hole-in-the wall with limited seating (a counter and about 3-4 tables) so we usually order to go. They cook and prepare everything in front of you. The best deals are 2 grilled pitas for $11 (one for lunch and one for later), or if you're really hungry and have a friend to split, 2 dinner entrees for $15. Sometimes the dinner entree defeats me (can't finish because there's too much food)."}
{"text":"I basically went there after reading the reviews on Yelp. The place is clean, the service is very good. However, I was disappointed with the food. There was a bitter taste in the meats. The rice was very good.  And the salad was kinda dull. Overall, nothing to indicate that this place is as highly rated as it seems.   I didn't have the Shawarma. So if that's the prime item, I have yet to try it. Perhaps next time."}
{"text":"My friend and I got a large to share which didn't take too long and the plate was just full of rice and chicken. It smelled amazing. The pita bread that came with it was very tasty too. There's just something about the way Pita Nutso does their chicken on the rocks that is just super delicious. Chicken was cooked very well, the hot sauce was just right, and their garlic sauce was just a little bit better than other shawarma places."}
