{"text":"Awesome shwarma's. The kids are friendly and this is overall an awesome place. I'm not a big fan of sweets but they gave me one of their almond thingys and damn that was awesome too."}
{"text":"Pita Grill, in my humble opinion, is one of the best donair shops in Calgary. It is a small space and the lunch crowd fills it quickly during week days. The ordering process is a bit funny, but it works.   The menu is varied ranging from shawarma  plates to XL beef or chicken donairs. Be adventurous and get a \"Mix\" donair - totally crazy - beef and chicken together in same pita wrap! The sweet and garlic sauces are awesome as well!  This place is a \"must try!\""}
{"text":"I was impressed with this place as soon as I walked in...it appears to be clean, organised, and well managed. I've only tried the falafel so far, but it was darn good and the portion sizes were huge (a small is like a normal size anywhere else). I will be back..."}
{"text":"They are very busy during lunch hour which says a lot about the quality of the food and its popularity. They have chicken shawarma sandwich for 6.25 and beef or lamb shawarma sandwiches for 6.50. The place is clean and organized. The sandwich is big and stuffed with meat.  Their dinner plates range in price from 9.99 to 12.99 and they are very tasty and filling. Plenty of parking."}
{"text":"I went back for a falafel sandwich, and couldn't believe that the falafels were deep fried to order!  I have been searching for a place like this in Calgary for years, but all other places reheat their falafels.  I could see the falafels were uncooked when they were putting them in the deep fryer, so I knew they weren't just re-frying old ones."}
{"text":"I was hoping this place would remain a secret for longer :/. Even though they are much busier, the quality is still superb. The Shwarma platter is an inordinate amount of delicious food for $10.50. Honestly, it's hard to eat shawarma/donair anywhere else in Calgary because it's never nearly as good as Pita Grill."}
{"text":"The BEST place in the city to get a shawarma. The place is a hidden gem and I don't go anywhere else but here. Their food is fresh and the quality of their products is amazing. The staff are very friendly too. You will not regret coming here!"}
{"text":"Best shawarma in mississauga i eat here at least once a week. Their garlic sauce is the best I've ever had. My favourite is the chicken shawarma plate however all the pita I've tried beef and lamb are just as tasty. The plate is huge comes with rice salad and your choice of meat. Its always busy no matter what time you go in because they do make the BEST shawarmas in sauga."}
{"text":"I have eaten alot of Lebanese style food, and Pita grill has without a doubt the best steak shwarma I've ever tasted. Only thing I would warn about is getting the jumbo, it's about 8 lbs and will prohibit you from going back to work after lunch."}
{"text":"Been trying all the other places in Milton and all are kinda OK nothing special until I found this place by accident and they make pretty good shawarma, I lived In London ON for several. Years and there is a sizeable middle eastern population.sndcof course few good food  joints, so I know when I try places here and place and compare with London  good  plsce And my new  fave"}
{"text":"4 stars for fresh and authentic tasting food and super-generous portion sizes.  This quaint family business has quickly become a lunch favorite for me. It'll barely seat 20 so if you come during a busy lunch hour, be prepared to get your food to go."}
{"text":"My girlfriend brought this home while I was working on renovations. Pita is ok but nothing to write home about. The beef samosa was cold, not like it had cooled off on the drive home it wasn't even room temperature it had been in a fridge all night and it was not very good even after I cooked it up myself. For the price I've gotten better somosas that were freshly made that day."}
{"text":"I always order the pressed grilled chicken dinner and  there is enough food for me for 2 lunches.  I am not a fan of their Sharma because of the seasonings.. but I know a lot of people who love it."}
{"text":"Top notch. Both the platter and chicken shwarma wrap were excellent. Unlike many other places they don't cheap out on meat quality, nor quantity, though that's something I care less about. The seasoning used for the shwarma meat is different than other places, it seems almost slightly Caribbean influenced and the meat is definitely not dry. Salad was plain and perhaps the only weak point flavour wise but it always is at a shwarma place. It was fresh and crispy and the tabouleh was very lemony and made from properly fresh parsley. Rice was fluffy, well seasoned and not an afterthought. A real hidden gem in an industrial looking plaza.  Don't miss out."}
{"text":"Always the best!    It gets busy here but for good reason.  This is probally the best donair/Shwarma place in Calgary! Fresh ingredients great sauces and delicious meats."}
{"text":"Yep, this place is legit! Can't believe I've lived so close for so long and never went there before...guess it's because I'd almost lost hope of finding a real donair shop.  These guys actually treat the donair with respect, by using a very flavorful beef (and actually storing it properly) and using homemade pita bread.  You can tell it's homemade because it's not just a perfect, white circle like in the package.  The sauces are done right and the place always seems very clean...which is rare for a donair joint...so this is definitely a plus.  No doubt that I'll be heading back asap."}
{"text":"Amazing food and great value. Ordered a chicken wrap and the chicken was perfectly cooked.  10/10 for value."}
{"text":"I love this place.  First of all, the service is great. Consistent staff who know what they are doing and present owners make for a good experience time after time. They are friendly, knowledgeable and attentive.  The food is great-what a nice alternative to traditional fast food. AS a previous reviewer noted-the portions are crazy big so order carefully. Both the schwarma and the donairs are excellent. Fresh ingredients put together very well. The baklava is also good if you are wanting a little something something to indulge your sweet tooth afterwards.  They also have a range of specialty middle east grocery products for sale and some different sodas you wouldn't see elsewhere.  This has become a regular spot for us to grab dinner on the go and it's something I actually have started to crave if we go too long between visits. Definitely something you should check out!"}
{"text":"On a business trip in Calgary I checked the reviews for The Pita Grill. I was impressed about the many positive reviews and thought I would check it out. To be honest, I wanted to see how this place would compare to my favourite Donair place in Surrey. I never found a place that would give the Donair Affair a close competition.   Well, move over Donair Affair, the Pita Grill is my new favourite Shawarma and Donair place. I was blown away with how much care they were preparing my large chicken shawarma. The chicken was grilled to perfection, the vegetables and sauces were spread evenly on my pita bread and they were more than happy following my special requests. What makes this shawarma also special was the fact that they toasted the master piece as well.  I ordered large and large is an understatement.   I have to say that the staff was also extremely helpful and told me how the vegetable dolmata is home made and that they never have a large stock of  Bhaklava and rather sell them always fresh. I also liked that the place looked very clean and was spotless, which speaks for the management of this restaurant.   I am sold, and I will come back for more when I am in the area. What a neat restaurant. If you love shawarmas and donairs you won't be leaving disappointed."}
{"text":"Being from Toronto with lots of good shawarma options, it has been difficult to find anything comparable in Calgary.  I have tried multiple places in Calgary and was disappointed, but decided to give this place a try due to a fellow Torontonians review below. I was not disappointed. While not completely same level, this place is a decent shawarma joint! Would recommend it. Went at noon and all seemed orderly and service was fast. They did forget to give me pop even though they charged me for it, but that was the only negative I will call out about the experience."}
{"text":"great beef donair, great chicken donair, great steak donair!!. the potatoes are also amazing. Unfortunately those are the only items I've tried on the menu so far... I'm quiet upset I haven't gotten around to trying more as I only eat take out once a week and only do my cheat meal at pita grill tans how delicious it is. can't wait to try everything on the menu yelp is going to need 6 stars*!!!.  All the workers look like young high school kids but don't let that fool you they make just as good of donairs as the owner and owners family... I'm assuming the family owners and employees are all eastern Indian???. DAMN can they make a donair!!! highly highly recommend trying pita grill out even if it means traveling across the city you won't be disappointed!. I'm willing to put money on the line that Pita Grill is easily in the Top5 if not Top3 donairs in Calgary.  I have not seen a bad review to do with pita grill. even on \"urbanspoon\" Pita Grill has a perfect track record. long story short keep it up pita grill!."}
{"text":"March 2016 - I had to up them to 5 stars. The food is awesomely delicious!!! The service is efficient and friendly and their prices are fair. The chicken shawarma is my favourite. The garlic potatoes are a hit. I kind of wished I had gotten some baklava, next time I will.. :-)   PS,  The garlic sauce is to-die-for!"}
{"text":"They have a great product here.  They just need a better system for ordering and assembling and paying.  If there's a lineup, don't expect to get your food in a timely fashion.   It is worth the wait when you do finally get your food."}
{"text":"Don't ever get a take out in this place ... they give you the sauce and hummus 'on the side' which I don't like at all and they didn't want to put anything on it even when I asked because 'that's the way they do it' ... shawarma is decent but I would recommend oaza shawarma ... soooo much better"}
{"text":"So I've been working in Mississauga for the past two months and have gone exploring on many a lunchtime hour, looking for new places to eat at but always find myself going to this mall at least once a week.  Instead of having just one decent lunch spot, it has THREE (Pita,Bamboo,Artisano).     While the chicken shawarma pita is by far my favorite, my preference is  1 - chicken 2 - falafel (and this is a steal at $4) 3 - beef  4 - lamb    The dinner option is a few bucks more, but I would recommend AGAINST that option because it lacks most of the veggie options that come with the pita.  The plate is essentially a deconstructed pita with a lot of extra meat.  Once you use up the pita that they give you, you are just left w/ a lot of meat and not much of anything else.  If you are hungry or are trying to feed a few people, seriously consider getting them a pita each and skip the dinner plate.  It'd be a dollar or two more but would be a far tastier option."}
{"text":"I always order the chicken shawarma wrap.  Overall, it's a good wrap.  Taste is good and price is still reasonable (at least they haven't raised the price yet due to the minimum wage hike).  Place is very clean and there is plenty of seating space.  Although, an annoying thing from this place is when they ask you for what toppings you want.  I always say \"Everything is good except for pickles and turnips\".  And always I get asked, \"spicy?\", or \"hot peppers ok?\".  Like I mean ALWAYS.  It's so annoying.  I feel like saying, \"what part of 'everything EXCEPT pickles and turnips' did you not understand?\".  C"}
{"text":"My usual stop when heading to Costco (in back). The felafel pita is amazing with their topping and extra grill at the end. Be prepared for a lunch time rush as this place is very popular but they are efficient and the line moves quickly. A good amount of seating as well."}
{"text":"Came here a few times for work lunches. Ive had the chicken shawarma and the falafel and both were very tasty. The portion size is quite good and the price is fairly reasonable. The place is pretty large but they get pretty busy around lunch time, so plan accordingly.   Their samosas also look pretty good, and I'll most likely try one of the rice options at some point because they look really good too."}
{"text":"Love their food I always get the donair their cashew chocolate rolls are soaked with honey. The staff are very polite and friendly."}
{"text":"Hands down the best shawarma I had in my life. Went to Calgary for a road trip from toronto. Sad to say Toronto has none that's even close to it."}
{"text":"Oh, Pita Grill. I couldn't stay mad at you forever. I now know that as long as I only come during the afternoon shifts M-F, I don't have to worry about dirty tables, and old and cold samosa offerings. In the afternoon, this place is a bustling, sparklingly clean place full of falafels, and samosas that look fresh. The staff in the afternoon is friendly and cheerful, and will put as much sriracha on your food as you can handle. Just take off the top and put a straw in the bottle, thanks. I'm writing as many positive things about Pita Grill as I can, before I stroke out from reaching MFD: Maximum Falafel Density.  I LOVE YOU.  Bonus points for the phonetic spelling of my name on my order bag: Teffuni"}
{"text":"The food here is great. I love their beef and lamb donair. However they all are extremely slow and have a horrible system and will often get your order wrong if you do not watch them. You are required to tell them what you want on your donair when you order but the person putting it together often does not read the ticket properly and they seem very confused. And don't get me started on how challenging it is to order sauce on the side...  Do not order a pie unless you have 20minutes to wait. They are delicious but their process is ridiculously slow.   Great food but it is a frustrating experience."}
{"text":"I was looking for a fast meal and stopped in here for a lamb shawarma. There was no one else there, so it got made pretty fast. I thought the meat was seasoned and cooked well, although if you get every additional component that they offer (which I did), it can get drowned out depending on how well mixed everything is inside. I found that the meat got stuck on one side, but those things are huge, so it's hard to fit it all in your mouth for a bite. The place is all the way in the back of a parking lot and is kind of squished on either side, so you might miss it if you're not paying attention."}
{"text":"Have seen this place when I come to Starskys and Costco nearby.  Felt like Middle Eastern food so why not?  Busy at 2:30pm on Saturday.  Cashier was friendly.  Ordered falafel wrap and a chicken shawarma wrap.  Both were freshly made and tasty.  Great place for a quick reasonably priced bite to eat.  Better value for your money than the Artisano in the same plaza that sells wafer thin roast beef sandwiches for $10."}
{"text":"Amazing food, I mean everything! The chicken are so fresh and the garlic sauce is delicious that adds good flavour to the meal. I would get anything that has chicken and ask for extra garlic sauce. I will always come back!"}
{"text":"Best donair in south Calgary hands down. Family friendly, family run, and fresh and tasty donair, gyros, chicken, and fava. I always get mine with lots of humus; I think they home make it."}
{"text":"Tried out the beef shawarma which was pretty good 7/10  Pita was well toasted but garlic sauce was a little too strong for my liking  I would return in future to try out the chicken as I have had better beef closer to home  Overall a pretty solid place if in area"}
{"text":"I have been frequenting Pita Grill from time to time over the last year, in my neighborhood of Riverbend.    Every time I went, I predictably got a falafel.  I am not a vegetarian, but there is something about looking at a big cylinder of meat baking vertically, and getting carved off a slab that personally gives me the whillies, so I have declined for years.  Until this week.  My mom is visiting from out of town, so there has been a lot of people coming around for visits, food and a few drinks.  On one particular sunny evening after work, it was pretty hot out, so nobody felt like cooking, and nobody who was over wanted the same thing, so I ended up making a few quick stops to accommodate random food requests, and a Chicken Wrap was on the request list by one of my friends at Pita Grill.  My first positive comment has to be the smell.....  The chicken was carved, and then thrown on the grill, and then transferred onto the wrap a few short feet away from me.  Wow... the waft was delicious.  A big delicious squirt of garlic sauce was applied, and it was bundled up and handed to me.   Next notable comment, was that I was asked to pick up a \"medium wrap\".  This wrap should have been called a jumbo wrap.  I can only imagine what the large and jumbo wrap would look like!   It was almost the size of a newborn.  I kind of held it like a newborn too (only because I was juggling my purse, and other random take out items from the area).  I quickly lost interest in my dinner, and I was swarming around that chicken wrap like a buzzard.  I managed to fandangle myself a bite and I instantly was struck with plate envy.  The meat was tender, juicy, flavorful and the garlic sauce was delightfully offensive for a good hour or two.  I am now a lover of donairs/schwarmas.  Good bye, Pita Grill Falafels.  Helloooooo Pita Grill, Chicken Schwarmas."}
{"text":"Garlic sauce is so bomb!  They have more choices of vegetables than other places and everything but the pickles and jalapeños looked and tasted fresh.   The Friday lunch line was decent sized at 1pm with most tables full. The ordering and assembling line is a quick system and with 5 people in front of me I sat down within 5 minutes to eat.  The servers are friendly for a counter service place and a few looked up and smiled while people were waiting in line. Tables,  counters and floors were clean.  Overall a very good quick stop lunch place! Worth $7"}
{"text":"It is two o'clock on a cloudy Monday afternoon. The sharp pangs of bewildering hunger overwhelm all rational thought.  From casual happy Benny I morph into Beeyotchscwatch.  I must feed. Enter P & G.  Order:  Half and Half Platter (chicken, lamb, salad and rice) and one Chicken Shawarma. Minor wait of no more than five minutes and \"The Feeding\" begins. Wait a stinking second. I gotta take pics. Begin the feeding!  Chomp chomp, nom nom, burp burp, lift left butt cheek, ahhhhh. The feeding was finished. Time:  Two fourteen.   Verdict.  Half and half platter.  The salad was weak spinoff of Fatoush.  I requested a healthy drizzle of tahini over the meat  and rice which they gladly accommodated. I topped it all off with a Benny sized squeeze of hot sauce.  Chicken was moist and flavourful.  Lamb was good too. Not salty or over spiced,  just good ole mankie lamb.  Lol. Yellow rice done right.  Garlic sauce was good. I smeared it on the extra pita and made a garlic shawarma.  Any one got gum?   Chicken Shawarma. Um um yum yum good.  Had length, weight and girth.  Don't go there ok?  Don't. Chicken so moist and flavourful. Oh I am coming back for this.  My only real upsets were the portion size of the platter meats, no hummus or tabouli on platter and the house hot sauce was very weak.   Oh yeah, a lentil rice with fried onions would have been a nice option.  Peace out my Fellow Yelpers!"}
{"text":"This is THE BEST take out Mediterranean salad I've ever had! The staff is so nice & accommodating. I asked for some turnip on the salad - no problem. Some tahini on the side - no problem.   Everything is super clean & the prices reasonable. If your in the area come for lunch!  I only wish there was one close to me!   This is a 5/5 lunch spot for sure."}
{"text":"Ratings: Food: 9/10 Drink: n/a Service: 9/10 Value: 9/10 Hygiene: 10/10 Aesthetics: 8/10  This is probably the best chicken shawarma in the area, the chicken here is marinated well and not overcooked. I like to go for lunch to order the chicken  shawarma wrap and get a samosa on the side.  The first time I went to this place I ended up getting a lamb shawarma, it was a little too dry, but the ingredients they used were much better than the nearby alternatives. I'm glad I came back to try the chicken.   The quality is great for the dollar value. The cost is under $10 for the wrap and a samosa.   The store is really simply decorated with mostly booth seating. There isn't a lot of places to sit, so if you go during the lunchtime rush, try to go a little earlier if you want a seat.   I would recommend this place, and I'll definitely be back. Also, make sure to get a stamp card, buy 9, get 1 free wrap."}
{"text":"I walked in and the 3 teens running the place barley knew what was in anything.  I asked what was in the vege samosa.  One teen boy said \"I dont know\".  So we had to disect it to figure it out.  I ordered the beef  and chicken shwarama.  Both smelled of old man butt or jock strap and tasted the same.  The falafel balls are days old.  You might as well go to extreme pita and get a real falafel thats days old microwaved up and put inside a pita, instead of using the pita as a wrap (which its not, thats why its called a pita pocket).  Anyways, the tabouli was 100% parsli.  It wasnt tabouli, it was parsley in a bowl...yuck.  Theres nothing great about this pita place, its overpriced and the debit card machine asks for a tip, as if these teens were waiting on me hand and foot for hours to deserve one?  THe sauces were non-existent and when asked for some, they tasted as thick as pudding.  Not exactly a sauce, more like a topping or jelly.  The portions are tiny, and not nearly worth the 10$ for a small.  If you must have the best, go to jerusalem shwarma, stay far away from pita grill.  Theres extreme pita in a mall near it, just go to that place and save yourself the pain of eating an old mans armpit, which is what the shwarma tasted like.  The falafels were days old, bland, no seasoning, and horribly yellow inside flavourless styrofoam.  Avoid this place like the plague, at all costs.  The baklava made from the same place as all the others is good, they must have ordered it in recently.  I'd recommend going to the source if you need baklava, never this pitagrill.  The beef shwarma is kept in a cooler outback, next to the caged cats.  The chicken is the same spit from 1997 thats been rotating."}
{"text":"This place is fantasic.  The amount of food as well as the quantity go beyond the expectations i had for them based on there prices.  They put on a very satisfying amount of sauces as well as meat. The meat put on there wraps is also amazing with the spices and how perfectly its been cooked.  The people who are serving the food are always freindly.  This is definatley my favourite place to get a wrap.  Ive purchased lots of wraps here and have never been disapointed with it.  Ive recomended this place to lots of my freinds.  It is definatly a place woth trying.  Chances are if you try eating here once it wont be your last time."}
{"text":"I'd give pita and grill 6 stars but 5 is the limit. Best shawarma in Mississauga!  I've been coming here for over 10 years and the food has always been on point! They recently added lamb to there menu and it just pushes them far ahead of the competition. Fresh toppings, whole wheat options (win!) a wide variety of marinated meats. The lamb pita is my favourite however you can't go wrong with any of the other wraps or dinner plates. Dinner plate includes a fresh salad and Mediterranean rice.  The only bad thing I could say is I wish they made their falafels fresh to order.. I might be a little spoiled.  Stop in for a bite and be prepared never to go anywhere else for a shawarma.  Bon appetite!"}
{"text":"The restaurant was a bit difficult to find as the sign somewhat blends with it's surroundings and also cause it's not a big place either.  There's around 4 to 5 tables which seats 4 people and a row of single seaters right by the window looking out to the view of the parking lot.   You place your order first at the counter, pay then wait for your food. There's 2 huge LED screens displaying the menu right above the cash register which makes it super easy to order. Adding on, their menu is fairly small, one screen displays the different type of pitas they serve and on the other side it displays their \"dinner\"/\"combo\" which comes with salad and a side.  Mostly what their menu consists of is skewers (chicken, beef, veggies), Shawarma (beef, chicken, lamb). They also have a small section for sides, if you're looking to add fries, rice, pita, etc to your meal for a few bucks.  We went on a Sunday evening at 7pm, the place was nearly empty. We ordered and within 10mins, we could see our food freshly made by the cook, We ordered a half & half with lamb and beef dinner. The plate was filled with food when we got it, it comes with salad and pita, also your choice of fries or rice.   I've had middle eastern food before and I know that portion sizes are fairly generous, so we decided to order one dinner to share between 2 people and I'm pretty glad we only ordered one because by the time we were finished, we were fully stuffed!   The food tasted great! The meats were well seasoned, hot and juicy; fries were crispy and hot, signs of fresh fries; salad was a good portion size, well dressed and fresh; and as for the pita, that's the last thing they make to your meal, throwing it on the griddle heating it up while toasting the outside.  At the end of the store, you help yourself to condiments; vinegar, salt & pepper, ketchup  and hot sauce, basically mostly all you need. You can also grab your utensils while you're there, either you're eating in and want stainless steel utensils or you prefer the plastic ones, they're all there for your choice. As for napkins, there's a napkin dispenser at every table which make it super convenient especially if you're a messy eater.  I would definitely come back again because for good food at $14 that feeds 2 people for dinner, I can't possibility ask for any better deal!!"}
{"text":"Overall my meal was good. But they for got my pita bread and I'm sure I was over charged.  I also find it funny that they use fancy TVs to display their menu but then have no real operation system to make the food. Not say they the proses that they used is flawed but I could see how you could miss things.   I would not get the falafel it's dry"}
{"text":"I haven't been here for a long time but am glad that I went back. They have clearly done a renovation since I last came and it looks great. The best thing about the renovation is that the food hasn't changed.  Ordered my husband and daughter a large to share and me a small.  My husband asked if it was smaller than usual but it wasn't and he was full after sharing with our toddler. There was nothing that wasn't great. The balance of meat and sauce etc. was great and it was more than enough for a meal. I got some tabbouleh and baklava as well which stretched it to two meals for three people.   So fantastic and will try not to wait years before we return."}
{"text":"I come here at least once a week, sometimes maybe 2 of 3. The chicken shwarma wrap is the best thing, and I've never had any better in the whole world!!  A+, and the staff is excellent."}
{"text":"The good reviews made me try the pita grill, and they are well deserved! Great service, and the food was the best shawarma I had in Calgary.  Would recommend and will return."}
{"text":"Went there for lunch today. Was absolutely packed with a long lineup to order. We ordered a mix grill which my husband and I shared. The vegetable skewer was a bit meh since it only had green peppers tomatoes and onions. The chicken and kofta  were juicy amd succulent. Their rice is one of the best tasting ones anywhere. We were in and out within an hour even though the line ups were very long."}
{"text":"I use to love this place but i have not been here in awhile, but on thursday i decided to eat there and get my usual med beef + chicken mix and a order of french fries, but it seems they have gone cheap now as the fries are now half the size and they were not even crispy, the mix pita was good but their medium now looks like their small. i have to say i was not as impressed as i was with them in the past is seems they have had to cut back some even though when i walked in they had a line almost to the door."}
{"text":"This place is one of my go to food joints for shawarma. The service is great, the staff is friendly and take your orders in an efficient manner. I have only good things to say about these guys. The food is delicious but you had better get there before the lunch rush or you may have to wait your turn."}
{"text":"Tried the donair and the falafel platter.  The guys at the counter were friendly and you get to pick your veggies and sauces here.   The ingredients were very fresh.  Overall, it was good and we would come here again if you were in the area but we both agreed that we like the taste at Jimmy's better."}
{"text":"Extremely professional and friendly service. Just walked in after seeing it on Yelp. Low carb lamb and chicken platter was tasty and reasonably priced. Would try the pita wraps after my diet ends:) fast service but not so much of a typical fast food."}
{"text":"Falafel tasted very authentic - not that I would know but if I were to guess authentic this is what I would guess!  They have those \"spits\" of meat turning around the burners which I do appreciate. Food was good.   I would like it better if the had a different type of pita... maybe home made? hahah or a thinner pita? But overall I enjoyed my falafel pita :)  They obviously specialize in Mediterranean food, but they also have Jamaican patties."}
{"text":"Pretty good shawarma, I would give it 5/5 if it wasn't for two things. 1. Wayyyyy too salty. I have never had such a salty shawarma. 2. The smell of my wrap. I don't know if it was the grill that its warmed on or the meat, but it was a kinda old meat smell. Like it rubbed off from the grill to my wrap. Every time I went for a bite I or turned off of what I was eating because of it."}
{"text":"This is the BEST CHICKEN SHAWARMA in the GTA!  I go here for lunch, a minimum of once a week!  It's exactly $7 for a Chicken Shawarma wrap, and it's big and delicious... just make sure you dont have any important business meetings after lunch because you will taste their garlic sauce for hours afterwards.  The falafels are alright, beef shawarma is okay... but seriously this is the best chicken shwarma i've had in my life!  This is now a franchise with a couple more in Mississauga and one on Bremner Blvd. near the ACC / Rogers Centre in Toronto... they're all good, aside from the fact that the one in Toronto seemed to have hot dog condiments instead of traditional lebanese condiments to put in their wraps, which i found sort of weird.... but I just had them smother it in the garlic and hot sauce and it was still amazingly delicious."}
{"text":"After hearing lovely things about Pita Grill from Tiffany N., and considering its proximity to my workplace, I ventured off to Pita Grill on my lunch break yesterday, for some rainy day falafel.  I have to first say, that this was a very strange trek for me. Riverbend is actually the area my family first lived in when we made the pilgrimmage over to Calgary from my homelands of Sicamous BC. It was strange to see that not a lot in the area had changed from the early nineties; same Boston Pizza, same vet clinic, I swear the same dollar store, the only thing missing was my favourite video store as a kid, where I would always rent Rainbow Brite only. It was at this video store where I first begged my dad to let me try a sip of his Coca Cola and I got sick in the car and on the stairs when I got home. But I digress.  Filled with all of these clearly pleasant nostalgic images in my mind, I pulled into the parking lot and walked into Pita Grill. I was surprised to see it so busy at 3:30 pm on a Thursday, but maybe the neighbourhood is already aware of its awesomeness! There are four sizes for wraps here. I ordered the medium, feeling as though I was up for the challenge. My. Good. Science. I don't know if I've ever been served such a large falafel, and there were still two sizes to follow this one....a large and a jumbo! If I am ever sharing with someone, I would consider ordering the jumbo just to see how big it actually is. Hahahah.  The gentleman making my falafel was extremely pleasant, and when I informed him I was vegan, he double checked twice that meant that I couldn't have dairy either, and prepared my falafel accordingly.  Not wanting to embarass myself by digging into this falafel and making a mess out of things in my office, I took a bite of this falafel in my car before taking off to gauge how messy it was. Horrible idea, as I dropped little falafel and hummus pieces all over my lap. But seriously, this thing was so delicious, it was worth it. I did end up finishing this falafel wrap. It was pretty much the only thing I'd eaten all day, but it put me into a food induced comatose for the rest of the evening when I got home.  I guess it's a good thing, just warming up for Thanksgiving over the weekend.  I will be back to try some of their other veggie-friendly fares, such as vegetarian samosas, dolmades, tabouli salad, etc. For omnis and those who can have cheese, it looks like these guys also have some good looking pizzas! This is a great alternative to many of the other chain establishments in the area! I highly recommend Pita Grill."}
{"text":"This is one of the best spots in the city to get donairs. the staff are very friendly. Place is clean food is always fresh and tastes great. their donair meat is seasoned to perfection and their sweet sauce is excellent.  I love coming here and reccomend it to anyone who like donair and shwarmas."}
{"text":"Ordered a chicken shawarma for lunch yesterday in addition to three other sharmarmas for friends. We Got REALLY bad food poisoning and have felt like I'm dying since. I will never ever eat here again after this experience and i highly recommend you to stay away as well unless you enjoy throwing up absolutely everything and pooping yourself a couple hours after eating this food (for the next couple days).  Note. This was the first and last thing we ate all day. We had to miss work the following day to recover from what we just endured all night and morning"}
{"text":"Not bad, not bad at all!  Was recommended from a friend, way better than I expected given shawarma places are usually hit & miss. Doesn't look like much from the outside, but definitely quality food.  Chicken shawarma plate is the perfect size, and comes with a bit of everything."}
{"text":"This is hands down my favourite shawarma place in Calgary! We moved here from Toronto and this is the place that comes closest to our favs out east! The staff are so nice and the shawarmas are huge! The regular size was a little bigger than most places which was amazing. They put lots of sauce which totally makes it taste  awesome"}
{"text":"I've been here a couple times and it's awesome.   They're very generous on the serving size.  The rice and potato platter comes with salad and a pita plus dip.  I love how they slather the garlic sauce on top!!!"}
{"text":"My favourite thing to order here is the Veggie Falafel. I've been to other Mediterranean restaurants and this place serves the freshest vegetables. We like to go there for lunch quite a bit. A lot of companies in the area do. The only down fall is they play there music way too loud. Then it's hard to hear them at the counter when asked a question and you can't take any business calls because they play their techno/dance music way too loudly."}
{"text":"Fresh wraps filled veges, chicken, beef, lamb, falafel, kabobs in pita style.  Clean an small resto.  Good portioning and good value.  Friendly and helpful."}
{"text":"My friend and I came here for a quick bite after the gym and wasn't disappointed. I got a small chicken shawarma sandwich with all of the toppings and a coke. It wasn't very pricey. The chicken was cooked perfectly and the combination of the sauces was great. Service was also quick so this is a good place to grab and go for lunch time."}
{"text":"I was recommended to come by and try the lamb shawarma by a middle eastern friend, the lamb wrap is actually as good as he described, staffs and the manager were polite and friendly. Will come back any day for quick lunch/ snack."}
