{"text":"It took a long time to get our order and they gave us the wrong order twice before we received the correct one. Once we finally got to eat, the food was really good. My wife and I split a steak shawarma and a chicken shawarma as well as the feta fries. My wife, being a big baklava, said they have the best she has ever had."}
{"text":"I was a little disappointed in my experience, after reading all the positive reviews. The chicken pita was good, but it took a while to receive it. I would not suggest the pita chips. They tasted like they had been deep fried once then again before they were served. Not appetizing at all! The hummus was ok. The kid got a burger from the kids meal. It didn't have any cheese on it and the bun seemed dry. He took the meat off the bread and didn't even eat half. It was a pre-made patty that looked like it was almost burnt. Not sure if I'll give this place another try or not."}
{"text":"Very good!  Satisfying but not too heavy. I had the beef kabobs, hubby had the gyro combo and mom had the steak shawarma - everyone loved their food!  It was also very reasonably priced. Service was very good and owner was friendly. I'll definitely be going back.  I like supporting small businesses and this one definitely delivers!"}
{"text":"I heard about this restaurant from a brochure that blew into my yard, and let me tell you... IM SO HAPPY IT DID. Not only was the food wonderful, but the staff is awesome! The man working late at night hooked it up with Meat on a gyro; and also made it delicious! Il definitely be coming back!"}
{"text":"Was excited to have a Mediterranean restaurant finally on the west side.  Unfortunatly the food is not good.  Very, and i mean very bland/tasteless...I dont think theyve heard of salt and pepper or seasoning here period!  Called to complain, got a thanks for the feedback and no refund even offered even though i had to go back out agagin to get diffrerent food for dinner because pita palms food was not edible.  Gave it a shot, Never going back.  bummer i was really excited about this place too:("}
{"text":"Came for the first time. Im a bit of a falafel snob coming from NYC. GOOD falafel. Will come back. Place was clean. Owner very friendly. Nice addition to Goodyear."}
{"text":"This place is not very tasty at all. If you want delicious Mediterranean food I recommend PITA KITCHEN on 99th ave. It's much much better. My husband and I will never ever eat here again. Awful. They need a new cook, this one isn't very good. Not to mention we waited for at least 30 min to 45 to be served and we were the only customers there....."}
{"text":"This is one of the cleanest and best places I've eaten in. It is just great. It is calm, no noise with great food. It is not expensive and the service is good."}
{"text":"I was terribly disappointed by this place, especially given the reviews it had. Seems like those who got the gyro were happy, but we got other stuff and weren't. Here is a breakdown of the specific things and our rating:  Chicken shwarma sandwich - 3 bland Falafel - 0 so so bad! Do not order! Hummus - 1 blaaaand Baba gnouch - 3 decent  Dolma - 5! Excellent! Tabouli - 3 Fattoush - 4- promising but drenched in vinegar  The only thing we would order again is the dolma."}
{"text":"The food is great, not expensive and yummy... You should try it. Wonderful service. I'm coming back for sure..."}
{"text":"Glad to finally have some Mediterranean food on the Westside. I had the steak shawarma and it was great."}
{"text":"Visited 03-18-16. There was nothing better then pulling into the parking lot and smelling the aroma of Mediterranean food. The shop was clean and inviting. The staff warm and friendly. And the food!!! The food was to die for. I enjoyed a beef shwarma in a pita. There was so much meat the pita could not close. If you never have enjoyed the flavor of  shwarma, this is the place to take your first bite. Don't miss out on this lil jem of a spot."}
{"text":"It's not easy to find a good Gyro, but their Gyro succeeds! Great meat! Nice, soft, fresh Pitas! The Palms Mixed Grill is yummy too. I eat here once a week minimum.  Employees are always very pleasant!  Those complaining about seasoning... there's salt and pepper on the table. Have at it!!!!! Not everything needs to be loaded with salt or sauce."}
{"text":"My favorite Mediterranean restaurant is Pita Palms.  They have scrumptious food. Their place is very clean.  The chef cook, Qosay is very gracious.  On every visit, I always enjoy my meal"}
{"text":"The food was not good at all. the gyro meat was really strange (not sure what it was) It was cut real thick, the fries were cold, the employee's kept arguing. My gyro was put in another customer's bag and they had to go dig it out. I waited 30 min for my order and there was only 2 customers in there. There is a much better gyro place on Dysart and Van Buren next to Sam's Club. The gyro's are really good and they put the feta cheese on the fries for no extra cost and it's cheaper."}
{"text":"The food here is fantastic! I have no complaints. Good service, good food. I was told that management changed in last 6 months but, I ate here 18 moths ago and then again very recently and I can't see any difference with regards to the food. So far so good. Will keep coming here. Oh, if you need more sauce just ask! They are very willing to give you more if that's what you like."}
{"text":"Just had a great meal here! I had the chicken kabob and my buddy had the gyro plate. The chicken was so tender, the rice was delicious, and the Greek salad on the side was great. The gyro plate was loaded, and the meat was super tender as well. Lots of food for the money. I'll definitely come again when I am in town."}
{"text":"It's the best shish kebab and chicken kebab in west phoenix and the price it's very reasonable"}
{"text":"As always, I'm befuddled by the myriad of 4 and 5 stars Yelp reviewers give to establishments I consider to be \"meh\".  Surely, it's not fair to compare every Middle Eastern restaurant in the Valley to Haji Baba; but I admit to only being human.  That \"flaw\" makes it hard for me to review other Middle Eastern restaurants without comparing it to the \"gold standard\" of Haji; but I'll try.  For me, the star of this place is the tzatsiki.  It's loaded with lots of dill, but the spice doesn't overwhelm.  The tzatsiki is thick and tasty, but I'm at a loss to figure out everything that's in it.  There's something thick, smooth and \"buttery\" in there and that's not full-fat yoghurt.  Sour cream?  Maybe.  But there's something about the consistency that is nothing like yoghurt or sour cream.  Next on the \"positive\" list are the people who work there:  always friendly.  From there, it goes somewhat downhill.  The gyro meat is tender and tasty.  You'd think that wouldn't be so big a deal.  Alas, you haven't been to The Golden Greek, where gyro meat resembles 4 year old Nikes donated to Goodwill in both texture and taste.  Pita Palms' chicken shwarma is bland.  In fact, most of the food here, while good, is bland ... something a bit unusual for Middle Eastern food; but I guess that leaves you the ability to spice to your taste.   I'm not saying more jihadists would try and desert from ISIS if they were fed some of Pita's dishes; but neither would they be so willing to become martyrs, if, instead of 72 virgins, they found the chicken shwarma from here waiting for them in the next world.  For a quick, local craving of Arab food, this place works.  But four or five stars?  Insh'allah; but not from me."}
{"text":"I went there last week for the first time, We ordered 2 of the pita specials, which was   reasonably priced. The pita were really good, hot, seasoned good and fresh pita, however the  tsaziki  sauce was at the bottom, usually its on top. It came with fries with option of seasoning, I chose seasoning (NOT a good choice) neither of us liked it at all.  The decor was blah, but If you like TV they have plenty of them, big ones too. Service was good and food was good, would recommend if your in the area and your hungry."}
{"text":"What do you do when your favorite west side \"mom & pop\" gyro place --aside from outstanding gem Tomo's Sushi--closes its' doors?   Camera pan into the shot of Pita Palms in the continuously growing Goodyear - wait -- wait--it's difficult to view because it's so unassuming and almost overshadowed by Augie's next-door.   Totally a score though, wow!   The ambience is down to earth, made me feel like I was on vacation on an island or somewhere with 3rd world country charms, with the gentle hum of overhead fans and friendly, but unobtrusive, staff/owners that take pride in their craft.   I watched, as we waited for food, and saw the gentleman from the counter hand a To-go bag to customers, look them sincerely in the eyes & shake their hand as if to say, \"thank you for your patronage, please come again & enjoy your delicious meal\".  Oh, that's right the food.   Our former spot's gyro had a lot of taziki sauce which was fine but made for a messy meal and hid the fact that the meat itself was decent but not excellent.   This Gyro was phenomenal. From the soft toasted bread to the minimal but perfect amount of sauce and the tender moist and generous portion of Gyro meat. The hubs had his favorite Chicken Shawarma -could barely utter the words \"Iss izz da bess shwaaa ma..evvvah\". Plus their fries & sides? Da bomb.   After an amazing meal for two people that cost the same price as a supersize-me meals or just one entree elsewhere --we let the owner know about how happy we were to find them. He was gracious and thanked us saying he's been in this business for 30 years. It showed.  And get this-- when we told him about the other Mediterranean place nearby that closed down--his first reaction was sincere sadness that a fellow business owner shut down. It left us humbled at this mans' pride in his culture & craft.   If authentic & delectable food, pride of ownership, warm atmosphere  & extremely affordable is up your alley, Pita Palms delivers on all fronts. I can't wait to go again!"}
{"text":"Pita Palm is awesome! We go there often and always get exceptional customer service. On top of that the gyros are incredible!!! You get so much meat too. They also have pretty great spanakopita! And all their food is a great deal. Shout out to Q for always booking us up with great food :)"}
{"text":"Being that my ethnicity is middle eastern and I'm from Chicago, a city known for mediterranean food. Pita Palms has fulfilled my expectations for a great stomach filler. The chef (sunny) and his team were very kind and curdious.   Mind you, I'm always skeptical about trying new med restaurants . Today I wasn't let down at all! I ordered two Gyros plates, two shawarma sandwiches, the palms falafel, and a large hummus. Everything I ordered for my family was delicious. We were all pleased and stuffed. I was going to order extra meat on one of our gyros sandwhich, because alot of places for some odd reason believe I want tons of lettuce and tomatoes in my sandwhich. Which I hate! but sunny said \"I make it like I eat it\" let me tell you, I'm FULL!  All in all Price was affordable food was great service was up to par. I'll definitely be eating at Pita Palms ALOT."}
{"text":"We go here every chance we get. The food is above amazing and the service is top notch. So friendly and kind! If you've never been here try it out. You will be back for sure!!!!"}
{"text":"Food is pretty good and servings aren't bad either. The girl that works there is cool and the guy with the army hat is as well. The third guy that's there doesn't seem to speak much English and has messed up our orders a couple times."}
{"text":"This place was really great! My daughter recommended it to me and if never gotten around to going in but I'm sure glad I eventually did! The food is amazing! The dining room is small but a very nice environment. (Family friendly) I had chicken with rice to go and I will absolutely be back! The staff was super nice and patient as I decided what I may like. The cashier was happy to explain what the different dishes were also. Very positive experience. I will be back for sure!"}
{"text":"I eat lunch here all the time. I love the Gyros. It's a very friendly restaurant and very good food."}
{"text":"Gave it one more try. They forgot our large hummus and a chicken kebob from our order this time. I understand that mistakes happen sometimes, but I don't think we've had one correct order in the past 2 years."}
{"text":"Food was excellent and the service was equally good.  Had the Mixed Grill Platter.  Definitely coming back."}
{"text":"I went in to this restaurant last week and the customer service was really fantastic ! Everyone was very gracious and friendly, not to mention their Greek salad with falafel was delicious! Thank you, guys for the wonderful experience!"}
{"text":"Food .....service and staff excellent.  Staff was attentive to all needs. Will definately return.  Staff was very friendly"}
{"text":"Found this place via Yelp and very happy we checked.  Best Gyros I've had in years,  perfectly flavored on the freshest pita. Hubby had a chicken kabob and said it was flavored excellent and it came with a perfect Greek salad and rice.  We will definitely return. Hubby said his chicken was just very slightly overcooked but not enough to not come again.  Everything was perfect. Great little find."}
{"text":"From Greek deceny I unfortunately have to say this is no greek or meditereanean restaurant. Our 1st experience for both of us. So disappointed- was looking fwd to a nearby decent place....   We ordered a gyro wrap with fries (not Greek but hey thought I'd try em). We also ordered the gyro plate. The fries were way over seasoned and god knows what with - tasted lemom-like and I don't know what.. how can you wrong poor fries like that?! Lol they were clearly frozen as well.  In the meal, the humus was good but the pita chips were stale and flavorless. A med place should have killer pita bread - do I really have to explain that one.   The gyro meat also not fresh and bland.  So, won't be eating there again - best of luck!"}
{"text":"So a friend of mine and i met for coffee at the coffee shop next door and she was telling me that pita palms had really good food! I love Mediterranean food so of course the following Sunday after church my family and I decided to pop in for a bite! We were glad we did! We had the hummus to start off which was delicious. My husband and I love hummus and the hummus here was really good. Afterwards I ordered the grilled chicken entree with a salad . LOVE LOVE the Greek dressing by the way. The chicken was very good and let me just say that the portions are HUGE! My husband and son got the gyro with fries. My son had never ha a gyro be he LOVED it! My husband did as well of course. And they sprinkle some nice seasoning on the fries, which they both liked. The service was nice and the restaurant was clean. We will definitely come back!"}
{"text":"Service was a great. I had the chicken entree that came with rice, salad and pita on the side. The chicken was tasty as well as the salad. This will definitely be my go to place from now on."}
{"text":"Good personable service,  good food.  Glad to find it here in Goodyear and I'll be back!"}
{"text":"Small place with good service. I've been here a couple times, and finally brought my wife. We both enjoyed our meals.  Enjoyed the Gyros, and my wife had the chicken kabob. She doesn't eat much so we took her leftovers to go. To my surprise my picky 12yr old daughter liked the kabobs and finished the plate ; ( no leftovers for me. The fries that come with the gyros combo are way good. Next time I'm gonna try the Baba Ghanoush. Ok, I like the gyros too much so I probably won't, but I just like to say Baba Ghanoush.  Also, forgot some spendy sunglasses here on a Friday, called them Sunday night and they had been holding them for me.  Nice."}
{"text":"Decided to come here to get a bite to eat..We usually go to the Pita Kitchen,but since we live in Buckeye...it's a little bit of a drive,to just get a bite to eat.We found Pita Palms,and I'll say that we weren't disappointed at all...the gyros pita was filled with meat and their fries are pretty good too.Love the place will definitely come back...Good stuff!!!"}
{"text":"Super friendly staff & the food was very flavorful. I had the gyro with fries and drink. Everything was great, can't wait to try their Greek salad."}
{"text":"First time eating there, so we had the special with fries! I was pleased the man at counter told us the fries was seasoned! I thought well let's give them a try! My husband was only going to get the gyro but talked him into fries, he said the fries made the meal even better! We both liked the gyro, lots of meat and the right amount of sauce!! The pita was soft and fresh! All our food was hot and worth the wait! Saw employee give away free food twice while sitting there waiting ! He could have been owner, don't really know!!! He also brought our food and asked twice if everything was okay and also stated if we needed anything else let him know! It's a very small place but it was not real busy so had seating! I always hesitate to give 5 stars when I have styrofoam and plastic cutlery! But we will be back anyway!!!"}
{"text":"This place is great. I love the gyros. Tons of meat and it's delicious. Yet another great local restaurant to try"}
{"text":"I love this little hole in the wall place. We always order hummus with steak and pita chips so good! The man who is always working works the counter and cooks. He is very nice and genuinely seems concerned about food quality and whether we are hapoy"}
{"text":"I am not sure which was better the food, service, atmosphere or the speed of which it all happened. So nice to have a delicious quaint restaurant close by."}
{"text":"Very bad experience. Service was nonexistent. Food took over 30 minutes to prepare and then when I finally got my food, fries were old and cold. The way my chicken pita was wrapped caused all of the meat to fall out when I pulled it out of the paper bag, falling all over the table at the restaurant. I didn't even ask for the order to go so why was it packaged that way? I will not be returning to this establishment."}
{"text":"You can't go wrong with a Gyro Pita combo, my daughter and I love Greek food, I have always ordered lamb ( the meat in the pita) for her since she was 1 years old, we are Californians at heart and I'm glad to see a Greek food place in Arizona, love it!! I'm sick of American food, this would be my # 1 choice as something new if you aren't familiar with Mediterranean's food, which we have plenty in Orange County, California. Its safe to say I'm not homesick anymore :)"}
{"text":"bast in my experiences they have the best delicious dishes and the owner it's been over 25 years Chef I've been coming eating in the Pita palm once a week with my family they are nice and friendly. Great atmosphere great food chicken kebab awesome delicious and I will continue to bring my family every week one time the best food in the town, i'll recommend this place10/10."}
{"text":"The food is really good! The service was awesome ! All 4 of my kids loved it not one complaint which made for a wonderful dinner! This restaurant is a must try!!!"}
{"text":"Decided to finally come here for the first time... soooo good!!!! We had the entree gyro and I got half chicken with it and did hummus rather than a salad. Everything came out fast and was actually very good!! We love locally owned places. We'll be back! The 2 employees were very friendly inside too."}
{"text":"I've dined here twice since they opened up. Good food, clean, big portions, & great service! They are a little on the slow side when it comes to getting your food to you. I'm hoping that improves once they've been open longer."}
{"text":"Nice little spot, good mix of Mediterranean food. Steak shawarma  is on point here! I come here for my fix."}
{"text":"Was a bit disappointed as many reviews made it sound great. Food was average and service nonexistent."}
{"text":"The food and service here is outstanding!  So happy to have a Greek restaurant nearby!  Definitely coming back!"}
{"text":"My fiance and I came here after a long day of moving houses. We were so hungry and we had a hard time deciding between the same few places that we always eat. We drove by this place and decided to give it a try. From the start we were greeted with a smile, we let them know that we hadn't been in before and they gave us a run down of the menu which was really helpful. When we got our food, it was way more than we expected for the price (that is always a plus). It also seems like their workers are very dedicated to their job. It looked like one was on break (she had her phone and purse with her sitting at a table). I think that the guy forgot to ask if we wanted hummus or something with our food, so she jumped in to ask us and went to get it for us. She was on break and still caring about the customers. We will be back for the delicious food and customer service!!"}
{"text":"It's been a while since I ate here last, but the three dishes I ordered all were delicious, and I strongly recommend trying it if you're in the area. The Turkish coffee was very potent and authentic (unlike any coffee I've ever had!)."}
{"text":"Excellent service!  All food is fresh and made to order quickly!  Family owned! Delicious and not to be missed!"}
{"text":"You can do better. I ordered two pita sandwiches and neither came with tsaziki sauce. Both were extremely dry and barely edible. The sandwiches were extremely under seasoned (as in NONE) and had little or no flavor. I ordered combos, which are supposed to come with Greek fries and a drink. The Greek fries are supposed to have feta cheese on top, yet there were none on mine. No dipping sauces were provided with the French fries, either.  The ratings are misleading based upon my experience today. Maybe it was an off day. You'll have a much better experience and eat much better food at Pita Kitchen nearby."}
{"text":"Finally a mediterranean restaurant in Goodyear!"}
{"text":"Fresh and Tasty  Today was my first time eating at Pita Palms, the service was exceptional and the food was good.  The serving sizes are generous at Pita Palms. Today, my friends and I ordered the Gyros lunch special, Chicken Pita, fries, and hummus. The gyros were large and very tasty. The lunch special comes with a side of fries, greek salad, or hummus, today I went with the hummus. If you like hummus at all, you need to try it, you won't be disappointed.    If hummus isn't for you Pita Palms offers a wide variety of entrée selections. There are  salads and great desserts. The service is friendly, courteous, and the food is fresh and made to order."}
{"text":"Delicious and fresh! We got gyros and fries, and loved them! Can't wait to explore the rest of the menu."}
{"text":"Great value for money and tasty food. The staff we met were awesome!  Gyro meat was tender and sliced perfectly coupled with perfect amount of onions and tomatoes. Fries were seasoned like they should be. Next time we will try the shawarmas. Keep in mind this is a fast food type place so you aren't going to find a fancy place but for the price you pay we prefer Pita Palms over other gyro places in the West Valley."}
{"text":"This place was open on Christmas Eve and was a great place for picking out freshly cooked chicken shawarma for my road trip to LA! The man who worked there was really nice. Not only did he give me an absolutely full plate to account for the special day, but also checked on me for extra garlic sauce and such. I'd definitely revisit during my road trips!"}
{"text":"Popped in here killing time between my sons baseball games. Great place! I wish it was in my neighborhood. Had a shawarma sandwich and it was fresh and delicious. Young man behind the counter was friendly and attentive. I didn't order a drink and he brought me an ice water. Nice family place."}
{"text":"I was running errands and found myself driving down Estrella Parkway. Unfortunately Estrella is a wasteland of food choices (Panda, MacD's, Chinese, Jack, and fast food Mexican). To find good food you have to turn off the main road.  I didn't want a full sit down meal for lunch, just something filling, fast, and delicious. That's when I stumbled upon Pita Palms.  I love Mediterranean food but have a hard time with the dish names. I described what I wanted to the pleasant young man at the counter. With just a few questions he figured out what I was looking for and pointed me in the right direction.  I ordered the gyro special but substituted chicken for beef. The special costs $8.99 and includes a gyro, drink, and your choice of humus, fries, or Greek salad. I opted for the salad and was not disappointed (a key ingredient for me is the olives, unlike other restaurants, they didn't skimp on them).  The food is good, the staff is friendly, and the restaurant is clean. I will be back and next time will bring hubby with me,"}
{"text":"Finally a Mediterranean place in the west valley! Delicious shawarma, good hummus, and good prices. I will be a regular!"}
{"text":"Service was fantastic! You walk in they greet you and if your dining in you get seated and someone comes and hands you a menu. The place is very clean and the people are very nice.   The food is nothing but bland. I really wanted to give this place a shot after reading all of the great reviews. But it fell very very short from all of that.  We ordered the beef and chicken kabob combo comes with rice and hummus/salad, feta fries, and a drink. Our total was $18 which is not bad for Greek good.   The rice was so bland it didn't taste like anything but the water they made it in. The pita was a little on the dry side but served it purpose. The hummus I didn't even touch. My husband says he's had the canned hummus and that's what it tasted like. The chicken wasn't anything special and the only thing I ate a side from the fries. The beef kabob was very squishy and had a weird texture and also had no flavor. The feta fries were just that I don't know why I was expecting more. It was just French fries with pepper and a little bit of crumbled feta on top.   I wish I could give it more stars but I can't. I would never eat here again."}
{"text":"Delicious food, quick and friendly service and on the west side!  What more can you ask for?!  The chicken shawarma is so good.  It was presented beautifully alongside my hummus with my combo meal.  I will be back!"}
{"text":"Pita Palms was recommended to us a few times so we finally gave it a try.  First of all, great customer service. The cashier/manager(?) was kind enough to offer up a coupon that made our entire meal about half price, and threw us in a few more for later use.   Second, the chicken wrap wasn't bad at all. It was missing a few ingredients I'm used to, but it was pretty delicious regardless. My wife's gyro was large, with a very generous portion of meat. They even tossed in extra garlic on the side at no cost, like some of the others often do.  It is the only Mediterranean eatery as far west as it is, and I'm glad we have it. Overall, it was a good experience and I'm sure we'll be back soon enough."}
{"text":"This place has a ton of great reviews so we were excited to try it. Yelp, you have let us down. Honestly, two stars seems generous.   The food was not great. I had the chicken shawarma and it was bland, bland, bland. The chicken was cooked well but there was no flavor to the sandwich. The server had to go back in the kitchen to find salt so I could add some flavor to my sandwich. My husband had the gyro and fries combo. The gyro meat was decent but he felt the flavor was definitely lacking overall. The fries have some sort of seasoning on them that left me with an aftertaste of that taco seasoning packet my mom used when I was little. I'm sure some people love the flavor but it was definitely not our style.  The atmosphere could use a little work to be more consumer friendly. When we pulled up to the place, there was a guy leaning against the door talking on his phone. Not the most welcoming thing. It turns out he was our server. He was friendly, but not really professional. There were a few televisions on in the restaurant, each set to different channels. This wouldn't be so bad but the volume was up on two of them so it was a chaos of sound. The bathroom didn't appear very clean either. There was a roll of toilet paper that was almost out of paper sitting on top of two empty dispensers. It really made me wonder how long it had been since the bathroom had a good cleaning. Ew."}
{"text":"Have been 6+ times since they have opened.  I get the gyro special each time.  Clean inside.  The two guys working are friendly.  Gyro is very good.  I will keep coming back for lunch."}
{"text":"Excellent service and the flavor of the food was to die for!! So good and will definitely go back soon!!"}
{"text":"This will definitely be my go to place for a delish Gyro! Perfect thin and tender lamb meat. Loved that it is so close to home and so affordable! I'm spreading the word because it is a little hidden gem."}
{"text":"The gyros was a bit oily. I don't like lettuce in mine and I should have read the menu better. Bc they pile the lettuce on your sandwich. I think I'd also prefer the fries with out the seasoning. Overall it was okay. Place was clean. And the a.c. was set at a cool temp."}
{"text":"Visited this place over the weekend.  I do not know anything about Mediterranean food but I have had a few gyros in my life.  The portions were good and plenty.  The Greek salad was good. But the gyro meat was very dry.  It was served curled up in a long 6 inch cylinder form.  The outside was very dry but the inside of the curl was moist.  I have never had it served like that.  Needless to say, halfway through the meal, all the meat was dry.  Sorry not going to be able to try again.  We will stick with the occasional trip to the one by Sam's Club where you also get complimentary lentil soup."}
{"text":"Out in Goodyear for work and stumbled upon this place. Not only did they give us a free serving of hummus and pita bread while we waited... Our food was amazing! I got the beef and my coworker got the chicken.., he was raving about it. Great place if you're ever out west"}
{"text":"Dining area is very small, employees are not very personable and food is ok. There is a much better option for this kind of food. If you're looking for something better go to Greek Gyro Express on Dysart between Home Depot and Sam's club."}
{"text":"Great gyro!!! The baklava was very authentic & one of the best I've had. The falafel was crispy outside & tender inside, very flavorful. Staff is very friendly & personable. I can't wait to come back!!!"}
{"text":"So I really hate to have to write this review since I've seen the others, but I feel I need to :( well, my husband and I are foodies and we try out every place that looks like it's worth trying, which is why we had dinner here. We ordered the gyro special. The meat was dry and the hummus did not have a good taste to it. It kind of tasted like it was powdered mix and then they saturate it with olive oil with sweet pickles as garnish. Tasted like other foods it must have been stored near. Just wasn't what I thought it would be. Really did not enjoy this place. Will not be going back."}
{"text":"Very good food! Loved it. Very nice people too. We loved the gyro and the veggie plate."}
{"text":"So glad we discovered. Delicious Gyros and fries combo for $7.99 is a great value. I never tried falafel and it was delicious. The gentlemen who work here are very nice and accommodating. Definitely recommend."}
{"text":"Simply amazing!  Our family loved the food, our belly's have not been this happy in a great while, we will return."}
{"text":"We love Mediterranean food, my wife and I, and this place prepares it well. Everything we've tried is excellent. Plus, we were eating fast, but not fast enough!  When they noticed our falafel was still on the table, they brought us fresh. So nice."}
{"text":"Absolutely amazing food. By far the best Gyro I have ever had. Very good, clean, family operation."}
{"text":"A+ guys seriously....  If you are looking for fresh food, look no further. I was fortunate enough to stop here last night and pick up a mixed meat platter. WOW! the food was so fresh, and hot. It was the most amazing food I have had in months. This will be a new frequent stop for me and my son. \"Q\" was the most helpful and friendly guy ever. He helped me choose what I should order and stayed diligent throughout. A+... If you don't try this place, you are only doing yourself a huge dis-service.  oh! almost forgot!! THE HUMMUS!!! DEAR LORD, GO EAT ALL THE HUMMUS!!!!  -Zak"}
{"text":"Great place..... Very Clean and food tastes good. Comfortable place with big TV's. Got mix grill pretty big portion."}
{"text":"The owner went all out for us making us feel welcome and as for the food we ordered it was outstanding.  We had falafel nd a variety of Hummus.  Wow!"}
{"text":"Food was OK, too many mistakes and it came out cold. Much better Greek food at the same or better price to justify coming here."}
{"text":"Great service great food had gyro salad double meat lots to eat. Wife had chicken kabob salad double meat chicken was cooked perfect with all white meat and so juicy and favor."}
{"text":"Great gyros! Delicious for sure! The rice was dried out that is why I could not give it a 5 but totally would go back just for the yummy gyro and awesome sauce!"}
{"text":"This is our first time here. We ordered Gyros Pita Lamb Beef & Baba Ghanoush. There were impeccably delicious! Pita bread & meat are made perfectly - not stringy or hard. It just melt in your mouth! Baba G was very tasty! Prices are reasonable & customer service is EXCELLENT!!! We will be back. Thank you for your passion for providing a high quality of Mediterranean Food."}
{"text":"So lucky to have such a good mom/pop restaurant on the west side! Gyro meat is the best I've had west of the I-17, hummus is fresh & yummy, kebabs tasty, chicken fresh & moist. Baklava is pretty darn fresh & not over-syrupy as well (I've been quite disappointed in Phx area baklava). Service is a little slow but the staff is super nice. Yum, yum. We'll keep coming back!"}
{"text":"Wish I could say it was better. Flavor was lacking in both dishes. The chicken kebab was decent. Salad has no dressing, rice had zero flavor, gyro fell flat as well. Best part were the fries. Sadly. Won't be back. Pita Kitchen is still the best in the valley, they never disappoint."}
{"text":"Great quick stop!  The gyro and garlic pita are both delicious!!!  Also love the Greek salad with gyro meat or falafel."}
{"text":"I really enjoyed this place! The staff were super friendly, and were willing to go that little extra mile to make everything better. The chicken shawarma was on point, as was the taziki sauce. I'm happy I got to check this place out while I was in town, and will be coming back the next time I'm in the area. Thanks guys!"}
{"text":"Owner is the coolest guy and food is delicious!! Great atmosphere and romantic setting..FUN and staff is awesome too! I will be back soon. Try the pita palm fries and the coffee. Insane with flavor. This place is a must!"}
{"text":"Great food. Excellent service. Had the chicken shawarma and it was mouth watering. Not to mention they make the best fries. I would recommend anyone to this place. Very satisfied."}
{"text":"I finally decided to go to Pita Palms and it didn't disappoint. I ordered the steak shawarma wrap while my girlfriend ordered the chicken shawarma wrap...both were pretty satisfying. However, what really blew me away was the pita-chips and hummus! If there was one thing I'd recommend, its the pita-chips and hummus! Will definitely be returning."}
{"text":"Came here today for lunch and I was so disappointed. We had both the chicken and steak shawarma. Our food took over 30 mins to come out even though there was no one else in the restaurant. The rice was terribly bland and the chicken and steak were both unimpressive. Not bad but nothing I would come back for. The pita are delicious and the garlic sauce had decent flavor. Overall I would not recommend this place and definitely won't be back. There are much better places to find Mediterranean food on the west side!"}
{"text":"Below avg chicken shawarma pita. Poor presentation, and it was just meat in a pita. Bland taste and it only gets two stars because they cooked it fresh at least. Pita was soggy 2 minutes into eating the damn thing. Not a fan"}
{"text":"Wish I could right a review but when you get in the front door at 1040 and the sign on the door says they open a 1030 but the employee says \"we won't be set to take orders for another 20 minutes \" they should think about changing their sign to opening at 1100 or have their employees start earlier so that can be prepared for their signed opening time.  First time possible customer - lost future sales , sorry not coming back."}
{"text":"We love the food here. It's always fresh, fast, and low price for quality. The owner is always kind to us."}
{"text":"Tonight was our first time trying Pita Palms. We just moved into the area and have been trying all of the nearby businesses. This food was honestly so good. I got the gyro entree, my daughter got the grilled chicken salad and my fiance got the gyro combo. We all just pretty much ate off of each other's plates. Oh, and the fries are the best. They are covered in this delicious seasoning that we all enjoyed. The man that took our (I'm assuming he was the manager or owner) order also brought us a plate of hummus and pita bread to try, for free! Awesome food, awesome customer service, awesome experience. Highly recommend."}
{"text":"This place had some wonderful reviews, so my family decided to have lunch here one day.  Honestly, wasn't the best.  I would say the food was okay, but a little bland all around.  My kids had the cheeseburgers, and they barely touched their meals.  I had a gyro and my husband had a vegetarian plate.  It was just so bland.    The hummus was good, no complaints there - but there are better places out there."}
{"text":"This used to be a good place to get gyro and kabobs but looks like they've cut cost quite a lot since the last time I was here. First off, their chicken kabob used to be really good. I was really disappointed to get a dry and sad chicken and beef kabob today. My mixed grill order came with hummus and pita bread. They gave me tortilla thin bread instead. They used to serve the fluffy soft pita bread (same as the one they use for gyro sandwiches) with their hummus. The gyro meat is consistently good. I will definitely think twice before coming back here again."}
{"text":"This place was amazing. Friendly staff, great service, wonderful food! I had the chicken kabobs, with rice and Greek salad. Also tried the fries! Owner, is the chef and hooked up extra rice and baklava to try!! Outstanding, i will def be back!!!"}
{"text":"Been here twice in the past week with my husband for their gyros. I've only had gyros once before so I'm not an expert by any means but Pita Palms was delicious. Tons of meat and just enought sauce to add extra flavor but not drawn it. My husband also had the fries and said they were great. The employees were very friendly and explained the menu to use newbies. Will definitely be going back."}
{"text":"We ordered the mixed grill with extra gyro meat It came with 2 bites of chicken that was dry beef shawarma that was burned and the gyro meat which was good. They piled all the meat on the salad The tzatziki sauce was more like dressing. We ordered baba ghanough that they did not bring I guess he forgot to push the button. He did bring us some and I'm glad we did not pay for it... Very bummed out I guess we will have to continue going all the way to dysart or  99th ave for Greek food. For a gyro and fries lunch probably just for a diner nope not again"}
{"text":"I went here last night to bring dinner to my family of 3.  The first thing I noticed as I walked in the door was the amazing smell of the meat.  I was then greeted by one of the nicest and best food industry people I've ever met.  Hugh is a great cook and was so helpful to me a first time patron of the restaurant.  I got 2 gyro combos with pita chips and hummus for my wife and I, and my daughter got the chicken nuggets kids meal.  The portions were great, I wound up eating it in 2 sittings in the same night.  Everything is made fresh I believe all the way down to the the pita chips.  I'm actually going back there for lunch for my wife and I today.  Thats how much we enjoyed the food here.  All of the veggies were super fresh too, that is a very big thing with me."}
{"text":"Ignorant worker. I'm sitting here waiting twenty minutes for a gyro. He is on his phone the whole time even while taking my order. Needless to say he messed up the order by not paying attention. I was here before it was good but I won't be back. Ignorant fool had his earpiece on the whole time."}
{"text":"Had dinner with 2 of our friends last night.    3 of us had the Beef Kabob, with rice, salad, and great Hummas.  I ate the Chicken Schwarma with Fries.  The new owner used to be the owner of Kabob Palace in North Phoenix, and brought his great recipes over here."}
{"text":"Great gyro! Closest to a Chicago gyro I've found in the valley. Inexpensive and very clean. I will be going back."}
{"text":"While I sat there pondering what to order every customer that was finished with their meals leaving would say \"bye\" praise the food to the chef and say \"We WILL be back\" so I figured that was a POSITIVE.   While waiting for my Chicken Greek Salad I reviewed my receipt, there was a price discrepancy between what I was charged and the listed menu prices. I inquired about the difference and the cashier assured me was not to pull one over on me but the prices have increased.  All in all my salad was good, it was missing the pita bread it said it was to come with and they do charge $.50 for additional sauce (understandable). BUT the dressing cup 1 comes with is just not enough for the large salad. In addition, Regardless how good something is, prices listed should be accurate especially considering they have the menu listed digitally."}
{"text":"Catching up on my reviews, I've returned since my first visit a few times and didn't check my take out order prior leaving and instead of ordered gyro, it was chicken shawarma I think. Not bad gyros since it's nearby. For delicious gyros I head over to Dino's."}
{"text":"Excellent food.  Great portions.  Friendly service.  We stopped this place based on Yelp's review.  Better than our expectation."}
{"text":"I was excited to see this place open and anxious to give it a try. We both ordered the gyro special which came with a drink and your choice of fries, hummus or a Greek salad.  I went for the hummus and my husband had the fries. Both sides were good but the star of the meal was definitely the gyro. I would have been more than satisfied just having that. The meat and sauce was really tasty. I definitely want to go back and try some of the other dishes.   The only thing I would caution is that it did take. While for the food to come out. More like you would expect at a sit down restaurant than a take out place."}
{"text":"I like the food. (Kebabs, salads, etc).  They need to sweep the front -- the cigarette butts and trash and spiff up the tables so that it's more appealing."}
{"text":"Fabulous service. And great kabobs! They have a clean dining room and everything was cooked to order and fresh."}
{"text":"Great food and nice people. I usually go here for lunch. It's smaller and on the side of a strip mall so if you have more than 8 people you may have to split into 2 groups."}
{"text":"For what it is, this place was worth the trip. It's pretty basic gyros and such, but at least it tastes good and the owner was very nice. Also, I appreciate that it was very clean and the tzatziki was pretty good. If you don't have a lot of money to spend and you want a decent meal, this is a good place to eat."}
{"text":"My husband and I went to Pita Palms on Friday, February 17, 2017.  It was my first time, but my husband had been there once before during a week night.  He had a great experience the first time and I had been wanting to try this place.  We support local restaurants and I love Mediterranean food.    First and foremost, the reason for the 3 star rating was due to the experience we had and not because of the food.  The food was excellent and I will get to that soon.  Let's start with the positive.  My husband ordered the Chicken Shawarma and Gyro.  I ordered the Chicken Shawarma, large hummus and the Spanikapata.  Everything was incredibly good, very generous portions and fresh.  Love having this type of restaurant in the West Valley.  I work in the East Valley and enjoy the choices the East Valley has compared to the West Valley.  The not so positive-when we arrived, they were full and busy inside.  We expected that we would have a small wait time.  We waited an hour for our food.  Which is unacceptable.  They were only staffed with a young man at the cash register and a young lady cooking; she seemed to be cooking one order at a time versus managing multiple orders at a time.  They were out of Falafels, which is exactly the only reason I was going there; I love falafel!!  They ran out of rice.  It was incredibly hot in the restaurant.  Two large parties (one w/4 people & one with 6 people) arrived, after we were there 30 minutes, and then left when they heard how long the wait was.  They locked the door to not allow any more orders in the restaurant since these two young people were overwhelmed.  The young man behind the register did do a few things right!; he provided free fountain drinks to all of us waiting and he offered hummus with pita bread for free for those of us who had been waiting 30 minutes for our orders.  This courtesy went a long way for my chef husband and I.  At about the 45 minute wait point, my husband became pretty frustrated, since he is in the restaurant business, and decided it was best he wait in the car.      With all of this said, I will return to Pita Palms.  The primary reason; the food.  It was terrific, generous portions and fresh.  I will not fault an owner/management decision for not staffing properly a Friday night.  We will probably go back on a week night, hoping our wait time will not be that long.  The hummus alone is worth the trip back!"}
{"text":"First time there , great food , a little hidden , right next to the smoke shop , very friendly and very clean place  , food taste like back home , and very handsome man !"}
{"text":"Super good food at a cheap price and great customer service will recommend this place to anyone ."}
{"text":"This is the first time I've tried Pita Palms since moving to Buckeye from north Phoenix and I'm sure glad I did. Ordered the chicken Schwarma entree and Spanakopita appetizer as a take out. The Schwarma was excellent and the Spanakopita was some of the best I've ever had. This will be my go to Greek place."}
{"text":"Food tasted good, but service was VERY slow. Waited 35 minutes for my gyro. I don't think the guys working there have any restaurant experience.  No hustle, organization, or decoration skills. Silverware looked like they bought it used at Goodwill (all scratched and worn) and the straws dispenser was a cardboard box with the top cut off. Guys, you need to hire a woman to decorate and class the place up! Really like to support new businesses, but this place needs some help or they won't be around long."}
{"text":"Good service but distinctly mediocre food. Note to self, if a middle eastern restaurant is located in a strip mall and has the word Pita in it, then it's probably not very good. I had Hummus and the Shawarma (Beef). The hummus tasted like some sort of mass manufactured substance that was served right out of the fridge. The Beef Shawarma was basically just small strips of beef that looked it it was cooked up on a griddle - as opposed to the real deal that is carved off a vertical spit. Completely devoid of taste. I've been to the Middle East and had the real deal - this is not even close."}
{"text":"Great food. Close to home and extremely friendly people. I'll be coming here all the time! My whole family loves their food. The falafel are made fresh, and they will soon make home made baklava ."}
