{"text":"I was excited to visit the PBC solely to experience their \"exotic\" types of burger meat. I chose the salad bar option, which was poorly stocked. The selection did not look all that appetizing.  When ordering burgers, the first selections that we made were not available so I settled on a Bison Burger. It was not much to speak of from the bun to the toppings or even the meat itself. It wasn't memorable or particularly tasty. The french fries I tried seemed overdone and like they had been sitting out.  Frankly. I would not recommend this place. My meal left me feeling disappointed and unsatisfied. The food was not that good and the service also left something to be desired. The restaurant was a little dark, uncomfortable booths, and didn't have a nice atmosphere.... If you're in the area, you'd be better off at Red Robin,"}
{"text":"Awful. Waited 40 minutes for a burger with \"caramelized\" onions that were closer to burned, and fries that were scorched. I sent everything back and left."}
{"text":"I'm nine months pregnant, and I wanted a delicious cheeseburger.  We  could have gone to Tessaro's or Burgatory and had a successful delicious cheeseburger mission.  Instead, we opted to try Pittsburgh Burger Company because it was closer to our house. When we walked in, we were greeted by a cooler of desserts that looked like they were a month old and a some raw \"exotic\" meat that apparently you could purchase for your burger at the restaurant or take pounds of it home.  Weird.  The interior looked vaguely like a sports bar - several TVs - although most of the screens were static-y - and neon beer signs.  We were visiting right after the first Steelers game of the season, and we should have known better and left when we saw how empty it was.   I ordered a Shroom burger and my husband ordered an American burger.  I was told that the mushrooms and onions were stuffed in my burger,  but I didn't taste them or see them.  The bun looked as if it was toasted, but was cold.  So, maybe it had been toasted earlier that morning.  I don't know what kind of oil the fries were made in, but they tasted like I think dishwater might taste like.  On top of that, my burger was not cooked through.  The only saving grace of my meal was the ranch dressing.  Good ranch dressing."}
{"text":"Right around the Waterfront are a ton of dining options but only 3 were local restaurants: a Japapense place, a Mexican place and this burger joint.  My wife and I were resolved to try some new local places though Chick-fil-A was calling my name.    It looked like it used to be a Fuddrucker's not all that long ago.  But, Pittsburgh Burger Company is trying to put a local spin on things by adding Kobe beef, lamb and bison to the regular old burger choices.  All in all, the food was fine.  Not exceptional, but it hit the spot for all of us.  There wasn't a wait, the service was fine, and the food was OK.    I went with the bacon bleu burger.  Mine was cooked at a proper medium, fries were soggy (but they are bottomless if you care to make yourself sick!), and the garlic mayo I had on the side was OK.  The kids split a chicken finger dinner and fries.  They seemed pleased.  Considering that there is a TGI Friday's and a bunch of other chain type places, there is a great opportunity for a local joint to do something quite different at a higher quality than the chains can deliver."}
{"text":"Went there with my wife on a Sunday afternoon, just after 1:00.  It was empty, maybe 5 or 6 tables had customers.  Our waitress was friendly, but the service was slow.  It took almost a half hour to get our meals.  The burgers were o.k.  They were cooked to the right temperature and juicy but not $9.  The \"bottomless\" fries were terrible - soggy and greasy.  I didn't even finish the first batch, so I can see why they can safely make that offer.  I won't go back."}
{"text":"This was my first foray into the new wave of burger joints in pittsburgh.  They seem to have taken the locovore/ organic route which is good. Several of their burgers feature exotic game meats.  I ordered the ostrich burger, while my brother ordered both the kobe and the elk burgers (yes he was hungry).   All were delicious and had sauteed onions and mushrooms heaped on.   12 dollars for a burger could seem a little pricey, but realize mcdonalds is 7 or so these days and is pretty much garbage. They do need a better beer selection however.  I would go back, and I would recommend others to go there."}
{"text":"It must be tough to be compared to Fuddruckers, whose formula of ordering at the counter, filling your own drinks and piling nacho cheese and toppings on your burger was ace. Unfortunately this restaurant didn't measure up.  We were seated and given menus, from which I chose a stuffed burger - as another reviewer mentioned, it was to have cheese stuffed inside - but the burger arrived with the cheese on top. The pico de gallo, one of the things I loved most about Fudd's, was almost nonexistent on my burger and the bun wasn't toasted. Both the burger and fries tasted good, no complaints there, and the burger was the same size as the ones Fudd served (generous). Too bad the fries were greasy and the server never offered a refill. We overheard a woman at the next table complaining to her server that the cucumbers on the salad bar were rotten. We also had to ask for drink refills and wait around to ask for our check. The service leaves much to be desired.  I noticed adult milkshakes on the menu (milkshakes with alcohol) and perhaps I'll be back to try one of those, but I doubt I'll spend another $10.50 on a burger and fries here."}
{"text":"On a Costco run with my wife and son.  All of three of us were hungry and you know what kind of mistake it is grocery shop while hungry, so we decided to eat before fighting the crowds at Costco.  Red Robin has disappointed us lately, mostly due to not just poor but NO service, so we thought we'd try PBC.  Besides, my wife told me that a colleague of hers had been here and absolutely LOVED it.  Dear God, I wish I had called up the reviews on my cell phone first.  I can only endorse what everyone else said:  BURGERS: stale buns.  small patties (the 8-ounce I ordered looked more like a half-dollar!  Cold, almost \"plastic\" extras (lettuce, onions, tomatoes).    SALAD BAR: wilted brown head lettuce and wilted romaine.  Standard toppings.    SOUPS: unmarked.  Seemed wise to avoid.  CHICKEN STRIPS:  Okay, but seemed frozen and reheated.  Certainly not fresh.  SERVICE:  This where I differ slightly with the other reviews: the staff was warm, welcoming and friendly.  Attentive and good-humored, too.  BUT when my wife asked what kind of bun was used with the chicken sandwich, the server froze in her tracks and stuttered out, \"Uh, you know.  Buns...\"   Seriously?  You don't train the staff to know the buns?  DECOR: Cheesy 80s corporate restaurant feel.  I can accept that at a place like Hoss' or other cheap \"family\" restaurant, but not here.  I was hoping for the best and left disappointed.  Maybe this place will transform itself again.  Great location right across from Loew's.  P.S.  In the car on the way home, my wife called her friend.  Oops, she meant Brgr in East Liberty.  Silence the rest of the way home..."}
{"text":"The burgers were mushy and obviously not a fresh product.  I could not even eat mine.  The waitress was very nice but the quality of the food is very inferior.  I would not recommend going there at all.  Not even to try it"}
{"text":"This is probably one of the easier reviews I have ever written. Came in with a party of 6 on a Sat night. 2 things worried me. One, place was empty. Two, someone else chose this place and only had 2 Yelp stars.   They have several different types of meats. They were out of 2 of them. Server did not mention this until we tried to order. Chose hot wings for the table. They were ok, but not great. 2 people in party ordered med rare. Burgers came out like hockey pucks. They were so overdone. It was really bad. GF had unlimited salad. She spent the night puking it up. Some dessert items were also missing from the menu. No apol from server. She was slow and unresponsive. Other than take the 2 burgers off, (b.c. we said we were not paying), she was really just a waste of skin. I cant imagine this place will be open too much longer with all the other choices in town."}
{"text":"After a hard day of mini golf and just generally faffing about, burgers were the only antidote that could have even a hope of putting a dent in our hunger.  That, combined with a desire for off-the-beaten-path meats led us to Pittsburgh Burger Company.  Pittsburgh Burger Company is your typical Waterfront business... it's not really my scene, because it's basically a local restaurant housed in the same kind of building that holds your everyday big box chain.  We got in, and were seated in the bar area with all of the other riffraff.  Disaster began to strike at this point.  We'd been sitting for a few minutes, enjoying our drinks, when one of our number noticed that he was getting dripped on from above.  Turns out the condensation from the AC was dripping on him.  We got moved to another table, no problem.  That table was still a bit drippy, but not nearly as much.  I like the menu here a lot.  They give you a list of ingredients and let you assemble your own burger, and there was nothing I wanted to put on mine that I couldn't find on the menu.  I got to build my perfect burger.  Nice!  The burger was pretty good... definitely not a disappointment, but nothing out of the ordinary.  Their fries are awesome, though! And they're bottomless.  I made myself sick because of this.  Now, our server.  It was almost impressive how many silly little mistakes she made.  No single one of the mistakes made were gamebreakers, but I definitely didn't get precisely what I'd ordered, and she basically disappeared on us for a good bit toward the end.  Not cool.  Ah well, I voted with my dollar, there.  I wasn't too disappointed, but I wouldn't go out of my way to go here again."}
{"text":"I very rarely give a place a second chance when I give them a one star review, but since the former FUDDRUCKERS\" is now the Pittsburgh Burger Company, I should give it a try and review the new place.  It's basically the same as Fuddruckers, I had a veggie burger that honestly was left on the grill a bit long. It was dry, chewy and pretty tasteless. No amount of ketchup, mustard, onion, pickles could save this.  I'm only giving this place two stars because the service is a little better than when it was Fuddruckers. There are so many great burger places dotting this city now, like Burgatory, Winghart's, and BRGR, at least at those places you know what you're getting, the way you want it."}
{"text":"I am not sure where these negative complaints are coming from bc I just had a delicious meal at the Pittsburgh Burger Co with my family and we will be back.  The 8oz stuffed bacon cheese burger I had was amazing! I have never seen stuffed burgers featured at any other burger joint but the cheese was just oozing out of the burger and the overall flavor profile was out of this world!!!!  I just love burgers so I am always looking for a great cheeseburger.  I loved the bottomless fries! My husband had a buffalo burger and he really enjoyed that.  Great happy hour specials too! They had half priced appetizers and half priced drinks.  The service was good and the place was clean. We sat on the outside patio overlooking the river and on a nice warm evening it was great to enjoy a cocktail out there-especially a half priced cocktail bc we got there in time for happy hour.  I guess things were shaky when they first got up and running but it seems they have everything together now and they have made a loyal customer out of me."}
{"text":"I'm always looking for a good, local burger, so when I saw Fuddruckers had become the Pittsburgh Burger Company, I had high hopes. After all, with all the new burger joints in Pittsburgh, and being right next to Red Robin, you'd expect this place to be above average-- boy was I wrong.   The atmosphere of this place is very commercial for what is supposed to be a local place- they didn't do much inside to change it from Fuddruckers. As you walk in, you are greeted by a cooler case filled with meat patties made from beef, ostrich, boar, buffalo, and many more exotic meats. The patties looked huge, but I think these are for show only (I'll explain more shortly). Next, there's the \"salad bar,\" a small cooler that I thought at first was a prop- half of the case was filled with heads of lettuce and other uncut veggies surrounded by small trays of salad fare. Not very appetizing.   Looking at menu, the prices seemed high. At $10.50 for an 8oz burger with toppings, it's slightly higher then I'm used to spending. I don't mind spending more for a good burger, but when you are next door to Red Robin where their burgers are a few bucks cheaper, you have to make that extra price worth while. The exotic meat burgers- the only redeeming quality in this restaurant- are $12 and might be worth it if the meat is good (I didn't try one) and if the fries that came with it didn't suck (shoestring crispy fries that were just okay). Also, I would be weary of trying an exotic meat burger in this establishment. I'm betting they aren't selling a ton of these meats, and being that it isn't cheap to keep these in supply, who knows how long they sat in a cooler or freezer.   Next, the beer selection sucks. They had Coors, Miller, and Budweiser on draft, and a bottle list that had few if any craft beer- I found Magic Hat for myself. My friend had a Corona, which was billed on our check as a \"premium bottle.\" Really? If I'm willing to pay more for a burger, I'm probably the kind of customer that is willing to pay extra for a matching beer. Please get better beer.   When I got my food, which took forever, the first thing I noticed was that my bun was bigger then my burger patty. Big mistake guys. I expect a patty to at least reach the boundaries of the bun, not miss it all the way around by a quarter to half inch- I'm not paying to bite into a nice bun. There is no way the patty on my plate looked anything like the raw patties I saw in the cooler case at the entrance of the store. Also, medium rare is supposed to be light pink inside- mine was no where near medium rare. Bluh. I had mine made with cheese, mushrooms, and bacon, and except for the garlic mayo, this burger was nothing special. The meat was something I could have made at home, the bacon was thin, and the mushrooms were goopy. At a just okay taste, this burger was not worth a second visit.   Bottom line, with all the choices available in Pittsburgh for a local burger place, I would not go here. If you want this concept to work, you need something special to stand out- a cool atmosphere, really good food, good beer pairing, or anything else to hook me in to want to come back. Judging by the small crowd that was there the night I went, I'm betting the Pittsburgh Burger Company won't be lasting very long.   Last tip for the owners of he Pittsburgh Burger Company- try working on making a quality product before you invest in overpriced T-shirts with your logo on it... just sayin'..."}
{"text":"As a man I think it's in my blood to love a hamburger. I don't need a fancy dining experience if I can get a juicy burger and some french fries. I will say I did get that, but everything else about this place is meh.  Okay so as many people in Pittsburgh know this place used to be a Fuddruckers and I always enjoyed Fuddruckers. When you walk in you can see it is sort of set up how Fuddruckers was which I felt was lazy on the new owners part. You can see the different types of meat available if you're into that. Me, I want a cow to eat not an ostrich but if you do then that's cool too.  The decor of this place is a mix of aunt's living room and a sports bar. I truly don't get it. I think Fuddruckers gave them their old decorations and then they stopped a Kirkland's that was going out of business to complete the rest of the look. As stated in another review the place has no original feel to it for it not being a chain restaurant.  The salad bar was tiny and actually the only reason I ordered it was because I was bored (says a lot about me right?) Anyway what I thought was weird was once I finished my salad the waitress says, \"can I take this or are you going back up?\" WHAT?! I've never been somewhere that lets you go back up to a salad bar with a used plate. Isn't that a health code violation? Yuck.  I just felt very underwhelmed there. I think the staff did too. No one really looked to thrilled to be working there. It seemed like they weren't sure about what orders to take where. And one final thing that annoyed me was that they sat everyone so close together. I understand the rules and regulations of sitting people in the world of the restaurant business, but c'mon I don't need to be able to reach other grab a fry off of the person's table next to me.   Also if it tells you anything about the return business I went here months ago with a coupon I received from work I checked into FourSquare both then and today and I am now the mayor there. Really shows you that once you Pittsburgh Burger Company you never go back."}
{"text":"Pretty horrible. Operates similar to Fuddruckers. Burgers were comparable to fast food and the nothing was fresh in the condiments bar. Soggy lettuce and cucumbers."}
{"text":"PGC is an average burger restaurant. The best feature of the restaurant is the variety of toppings and meats. I ended up trying the Venison burger. I ordered a medium rare and received a burger that was closer to well which is understandable for a restaurant trying to be safe (but not one that is going to earn my favor).  Our waitress was extremely nice and the tables were clean. There were also plenty of TVs providing a vantage point from what seemed like every single table."}
{"text":"hit this place up today for lunch. It was empty which sort of surprised me since it was right in the middle of crazy holiday shopping season. I think there were about 2 other tables. The waitress was less than friendly - you'd think with such a small amount of customers that they would want to be more welcoming - especially if they wanted repeat business.   I ordered a bacon cheeseburger. I normally don't like burgers much but went to make my husband happy... while intrigued by the game meats I just went for the basic burger. The burger itself was not bad - ordered medium was still juicy an cooked correctly. The bacon, on the other hand tasted off - like it was either old or cooked on a dirty grill... either way I ended up removing most of it. Fries were great.   Not sure if we'll head back. My husband did enjoy his burger and would likely return... service really needs to warm up and be friendlier - especially in light of the number of complaints online about them."}
{"text":"Alright so first off, I would like to say that I have attended this place when it was Fuddruckers, when it was just starting to change over, and recently now that it is completely the Pittsburgh Burger Co.  The place has gone downhill.    When I was younger I was able to go to the grand opening of this Fuddruckers.  It was amazing.  Really flashy, exciting order-at-the-counter atmosphere, put your own toppings on; the place was a blast.  I thought it was the coolest place in the world when I was at that young age.  My second trip to the restaurant was just a few months ago.  It was during the switch over from Fuddruckers to Pittsburgh BCo.  The atmosphere I remember was still there.  Order at the counter, delicious food, put on your own toppings.  It was excellent.   I spent the next few months telling everyone I knew thats where the best burger in Pittsburgh is.  However on my next trip I was left disappointed.  Just last week I went to PBCo. with my mother and sister.  I was very confused walking in because there was no ordering at the counter.  It was very quiet inside.  The atmosphere was replaced by a sign that read \"Please wait to be seated.\"  I found myself thinking where the hell am I?    We sat down and looked at the menu, from what I remember it was the same food and menu from my second trip.  It is just now that all the excitement was gone.  I asked the waitress what the best kind of burgers were from the $12 section, and she had no clue.  She just told me what people usually order.    I wound up getting the salad bar instead of fries which was a mistake.  FIRST OFF, IT SHOULD BE A SOUP AND SALAD BAR!!  NOT JUST A SOUP OR SALAD!!  I was amazed when the waitress told me I had to choose between getting a bowl for soup or a plate for salad.  The salad bar was pretty pathetic.  But then again, salad isnt the most exciting thing.  I also just looked at the soups (obviously not daring to take some, for that would be ridiculous -_- ).  The soups were not even marked?  Our food then came out.  The appetizer nachos were delicious.  The entree burgers were also delicious.  It is just that it is sad that the atmosphere of the fun restaurant is gone.   PLEASE BRING BACK THE FUN ATMOSPHERE.  PLEASE."}
{"text":"I am not one to write reviews usually but the service was so poor and the response of management to the issues so underwhelming that I had to write a review.  Sad but this restaurant is NOT ready for prime time. they have tried to take the Fuddruckers formula private. This is the same owners as the previous Fuddruckers at the same location. the Fuddruckers franchise has declared bankruptcy earlier so the owner or owners have tried to go private with the restaurant.  here in lies the problem. I am guessing the wait staff is not trained for sit down type guest ... as the old style was order your food, and they call your number, get your burger, and add your own fixings. now with sit down service and wait staff to bring you your food it is not that simple guys! you have to provide customer service or I would just go to a fast food restaurant (and by the way I will definitely be going to a fast food burger location instead of here ... They have 100% better service (sigh))... What is bottom less drinks and bottom less fries (when you charge for them) if the wait staff does not come by and ask you if you want refills and remind you its free refills for both fries and drinks! then on top of that the area of the restaurant we were seated in was very dark. you could see the track lighting track is there but there were no light fixtures installed on the track (duh).  now it is strange when you have a party of friends and the friend who arrived latest and ordered about 10 mins after the others gets his food first ... then another group of us and then the final two about 30 mins later! ok so you have problems with chefs but that should not affect the order the meals arrive should it? this points to what the other reviewer have implied or said you have issues with your computer order system or training with the wait staff entering orders, or the printers in the kitchen to issue the orders to the chefs! fix it guys... do you have a Sous Chef? Is he or she asleep at the wheel.  ok to keep adding fuel to the fire... we finally have to talk to the manager.... and his explanation does not answer why the food is late and his response of being sorry was followed up by 20% off our food tab when the last two people should have at a MIN been free or at least 50% off ...  So lets see about why I go out to eat at a restaurant:  1. Atmosphere = FAIL 0 out of 10. No lighting, the place was very cold and it seemed like they did not have the HVAC heating balanced as the other part of the restaurant was warm. The Bar Area was like a freezer  2. Service = FAIL 3 out 10. At least he took our order and it arrived. that is it. no follow up on drinks, fries, or how is your food? Request for manager did NOT get results. had to find manager on my own.  3. Food = FAIL 4 out 10. The burgers were not special and the buns should be warmed or slightly toasted. The waiter did not ask what we wanted on our burgers. No Cheese was on the side when arrived. The Salad Bar is small and poorly stocked compared to most any restaurant in the Waterfront.  Management had as they call it \"a moment of truth\" to say hey we screwed up and we want to make it right... other restaurants that I would go back to after an issue like this, the manager at that location admitted they were wrong, gave us 1/2 off our food and free dessert and owned the issue. This manager did not. he said he was sorry but did not sound sincere and I walked away feeling that the 20% was more of an insult then a real apology. He also said he would give us managers return card of some sort (again failed as we never received it with our bill). bottom line is it sounded like he has been through the scene that unfolded a dozen times and had a standard excuse and response. that is sad...  this other restaurant that they did the RIGHT thing was Grand Concourse Station Square... takes lessons guys and you guys are not even charging as much for your meals.  I am guessing this place could qualify as a place for the worst of the TV series Hell's Kitchen..."}
