{"text":"Un endroit qui ne paie pas de mine et qui propose des plats simples mais de bonne qualité! 
Idéal pour les 5 à 7, y prendre une bière entre amis et pourquoi pas une petite pizza leur spécialité: Pâte fine, bon assaisonnement, cuisson parfaite, et choix multiples sur la carte. On peut y ajouter un peu d'huile pimentée c'est encore meilleur!
Le service est super rapide et le personnel vraiment adorable! 
L'été la façade s'ouvre complètement donnant une vue sur la place des arts. 
Très bon bistro sans aucun doute."}
{"text":"Fun, very casual bar. Great thon and olive sandwich. Was disappointed in the sangria, which was nothing more than red house wine with orange juice. Great view during jazz fest of the crowds circulating the area however. Great open garage door windows for cool breezes on hot summer nights."}
{"text":"Piz Pistol est un super restaurant de style bistro. Selon moi trop négligé par la clientèle du quartier des spectacles. Il est certain qu'à première vue ce resto semble banal et même un peu kitsch avec son nom et son enseigne. Ne vous laissez pas tromper. C'est l'une des meilleures tables du quartier. Se situant entre le resto superchique et celui du coin. Tout le monde est bienvenu, que vous soyez en robe de soirée aussi bien qu'en jeans. De plus, c'est probablement l'adresse où l'on vous remettra la plus petite note de votre soir.

Ma recommandation, coté nourriture, la pizza arrabbiata avec du peppéroni en extra. Soyez avisé la sauce a un petit kick qui la rend très intéressante. Elle danse dans la bouche. 

Alors, pour quoi ne pas l'inclure dans votre prochaine soirée au quartier des spectacles."}
{"text":"We got the Chicken Panini and it was barely edible.    Bland, cold in the middle, not good.    Most people around us got the pizzas, which looked thin, crispy and yummy...maybe that is the thing to get here.

Wait staff seems very busy and they forget to bring stuff all the time.  ."}
{"text":"We stopped in today for a quick lunch while out walking on Rue Sainte-Catherine. We both had panini - Dave had the Neopolitain and I had the vegetarian. Both were excellent, came with a salad alongside on the plate and were crispy, warm and fresh. The service was pleasant and efficient, but not overly attentive or hovering.
It's nothing to write home about, but a nice lunch on a fall afternoon."}
