{"text":"Pizza is really good better then little ceasers . Wait area is clean friendly service."}
{"text":"Great prices, decent pizza, 10 min. takeout time.  If you want your pizza in your face faster go to Little Cesars.  This establishment was right across the street from my old apartment.  There is no place to sit inside so I recommend sitting in the middle of the floor.  It gently sends a message.The ingredients aren't the best, but what do expect from cheap pizza.  You get what you pay for."}
{"text":"Customer service sucks  Pizza is really good Better than Pizza Hut and they have good deals"}
{"text":"Friendly staff and remarkable pizza!!! They have great prices and the food is delicious. We went there with our Groupon coupon and ended up buying more food because they all tasted awesome. Pizza crust itself is enough to go there. My children loved the buffalo wings and the Garlic-con-Queso wings. It was our first time there but we will definitely be regular customer after now on."}
{"text":"The customer service is horrible. The lady taking orders was upset because i started asking her questions about the pricing. I order 6 wings and she told me i could get 12 for just another dollar. When i looked at my recipt it was the full price for the 12 wings. She got upset and said it was due to the taxes. I broke down the price for her and she was got upset. I ended up canceling the order and going to dominos. Much better quality pizza and also for a lower price. Its not that i couldnt afford the full price for the wings its just the principal. No need to lie and to get mad. Will never come to this place again. Dont go to a place where they don't appreciate your business. Would rate Zero stars if possible!"}
{"text":"I had higher hopes of being true mexican pizza like i got growing up.  I will say it was very cheap!!  I also love their marketing."}
{"text":"Absolutely LOVE this place. 4.99 wings and 1 topping pizza! Used to like the square pieces better, but now have switched to normal triangle cutting. Love the service and prizes! Prefer Patron over Ceasers any day! :)"}
{"text":"Over all good eats. Friendly staff, clean, and very affordable. The cheese sticks and marinara are the whip, for the price it really is a no brainer for crowd hunger control and overall munchies cure!"}
{"text":"The pizza is good but they take forever to have the pizza ready even if they don't have any other orders to prepare."}
{"text":"Good pizza considering the price. Fast and friendly service."}
{"text":"We picked this place based on good reviews. Don't trust the good reviews!! It was the most under-whelming pizza experience ever. The Mexicana was gross!! Fake weird chorizo. The Hawaiian was ok. We added jalapeños which made it slightly better. And we took one bite of the bread sticks and threw them away."}
{"text":"This pizza is really good for its price. However this location is dirty. My boyfriend and I walked in and was looking at the menu hanging on the wall and there it was, this huge roach dead hanging there... ON THE MENU. At least clean it up so the customers don't see it. Disgusting. Now I know why the pizza was so good."}
{"text":"order the 3.99 ready pizza to and it was very good. it took 30seconds in and out and the peperoni pizza was very good. I will return."}
{"text":"Mediocre pizza. OK. wings.  The pizza was cold and greasy, and tasted like the dough had been frozen instead of freshly made. The person who took my order over the phone was hard to understand, with loud music playing in the background. I was expecting better pizza, by the info on their website. The website needs to be updated badly. Probably won't be eating here again."}
{"text":"I come here alot especially for there wings damn there so good.  What you dont believe me come on down and try some and if you dont oh well more wings for me lol."}
{"text":"This place....it's pizzas are to die for...the crust is thin, the toppings are great...it's just amazing....don't mention the price. The only draw back, is they don't deliver...Dominoes have nothing on them, except delivery"}
{"text":"Horrible pizza place!!! Pizza is gross and the service is equally as bad. I called for a large pizza and was told it was $4.99. I asked for half pepperoni and half bacon. When I went to pick up my order they charged me an extra $2.50 for splitting the toppings. Would have been nice if they told me that when I called to place the order, especially when I specifically asked for the price. I asked to change my order since I wasn't warned about the extra price and I was told NO. Never going back!!!"}
{"text":"3 stars. Because the pizza was great! But the service could use major improvement. The woman taking our order clearly hates her job lol but i mean, i dont take things to heart. I'll give this place another shot since i really enjoyed their pizza but cashier lady, would it kill you to smile?!"}
{"text":"We tried the pizza for the first time last night . What a surprise. This was very good pizza. Well made and tasty"}
{"text":"I am a fan of Pizza Patron, because of the low prices but very good quality pizzas they make.  I remember over a year ago, I was struggling in the US with working two jobs, construction and driving a taxi on the side.  After a hard day of work at my construction job, before going home, I sometimes would drop by here and get a large pepperoni pizza for only $5.  And the pizzas come out fresh from the oven!  And the pizzas actually have some flavor and texture, unlike Domino's, which I must say, tastes just like the cardboard box they're delivered in.  Because of my personal experience, I remain a loyal fan of this establishment.  Friendly service, good pizza, and very good prices."}
{"text":"Can't beat the prices here. Parking a little scary. The pizza was great for the price. Good for hungry teens"}
{"text":"NOT impressed at all. I have had frozen pizza which is better. There is a lot better pizza out there then this place. If you value a clean, nice atmosphere with quality tasty food. Then run to another pizza place and don't look back or go to your local Safeway and purchase a frozen pizza it will taste a little bit better."}
{"text":"Worst pizza and service without a smile.  Next time I would rather eat frozen cheep pizza then this crap.  It tasted like Tomato sauce with some garlic and salt mixed in.  Cheap cheese and the crust was like pre-made frozen. The staff were more concerned with talking and playing on the cell phones."}
{"text":"$3.99 for a large pizza, great deal!  Not a lot of chesse or sauce but is still good.  Location is a little far from me but I just toast a few slices in the toaster oven to heat up when I get home.  The toaster oven makes the crust a little crispy and it is great!"}
{"text":"==A Slice Of You==  A romantic comedy by Jetta  (The dimly lit pavement of a strip mall parking lot. JETTA, a glamazon in her early twenties, stares longingly into the night. An alluring ingenue with a dark and questionable past, she shivers in 90 degree night, tears forming in her eyes. Behind her is PIZZA PATRON, a tall, fedora-wearing gentleman. He sports a mustache that doesn't play by the rules. JETTA knows he is behind her.)  JETTA I'm sorry. I just can't.  PIZZA PATRON Why can't you let me love you, Jetta?  JETTA Because there's nothing left of me to love. I've been burned before. Lured by promises of reasonably priced large one-toppings and hearty, flavorful hot wings. Only to be given hot plates of garbage and crunchy and disturbingly misshapen wings of what I can imagine were once, long before growth hormones, in fact chickens. I don't known if I can trust you.  PIZZA PATRON But I'm not like the others.  JETTA They all say that. I like you, PP. I like your logo depicting a Federale whose about to cut me open and empty my stomach of all that cocaine I spent all morning stuffing in. I like how you scream \"PIZZA PATRON!\" at the top of your lungs to me whenever I step in the store. I like your queso sticks and chorizo-topped pizza. I even like how you accept pesos in lieu of dollars, no matter how many shithead right-wingers boycott and protest your storefront. Don't you see? I like you. If I open my heart to you, I could risk hating you. Can't we just settle for \"like\"?  PIZZA PATRON What would be the point? Why offer a 4.99 large one-topping if the box isn't going to litter your living room floor. Why offer lime and pepper-flavored chicken wings if I can't know that somewhere, it's you're lips sucking the meat off the bone? Don't you see, Jetta? Without you taking advantage of my ridiculously underpriced food, there'd be no reason to make it in the first place. I don't know how else to say this--  JETTA Shhh. You had me at \"$4.99 one topping\".   (The two embrace. Music plays dramatically in the background.)  Somebody put a stop to me. Please."}
{"text":"This pizza place has intrigued me ever since I noticed it late at night after hitting the 24-Hour Fitness that sits in the same parking lot.  The bottom line...it's not good, but it's also not that bad.  Pizza Patron is a franchise, and strikes me as being a poor knock-off of Little Caeser's Pizza. They operate on the same business model...offering pizza, breadsticks and chicken for extremely low prices...although I would say that Little Caeser's offers more in the way of flavor.  If you asked me to describe how the Pepperoni Pizza ($4.95) tasted, it would be difficult because it had almost no taste! It didn't even taste bad, it just didn't taste like anything! The same goes for the breadsticks...they were so bland that they were neither good nor bad, just edible.   If I had to place this in the realm of pizza chains...I would say it's a step above Cici's Pizza, but also a few steps below Little Caeser's...definitely not worth checking out for the pizza or bread...perhaps the chicken is better.  On another note, they do accept Pesos as a form of payment...so if you have any left over from a trip to Mexico and don't feel like going to the bank to have them exchanged, use them here!  ----5/22/2013---  I returned to Pizza Patron and tried the Pollito Chicken as well as the Queso Sticks, and I have been hooked ever since!   Though the pizza is not very tasty, ALL of the chicken offerings are fantastic! Particularly the Lime and Pepper chicken wings and the aforementioned Pollito Chicken.   The Queso Sticks are tasty as well! Essentially, these are the normal breadsticks with cheese on them and what tastes like a bit of garlic. This does wonders for the taste and makes them pretty darn delicious!  Definitely a fan!"}
{"text":"Really good pizza for really really cheap price you can't go wrong with that it feeds all the kids it just tastes really good and they have a lot of different flavors and their wings are amazing"}
{"text":"Decent pizza at a great price!! Better than frozen pizza and cheaper too! My go to for kids pizza friday nights or parties. They are always great and prompt and friendly. Consistently good all the way around."}
{"text":"You know you're broke when you even think about eating this. Marinara sauce tastes like it's cut with salsa, and the pizza crust tastes like it was brushed in margarine. Questionable all around, but it's even CHEAPER than Little Caesar's, so do you really have a right to complain?"}
{"text":"*sung to the tune of \"Hello\" by Adele*  Hello? Can you hear me? I'm in Arizona dreaming about eating cheesy pizza. I want it, so bad but you never called me back...  Hello to pizza patron, You put me on eternal hold.  Then leave your phone off of the hook, I know for sure because I took a look.  then you never came back on the line, or picked up when I called back. I just don't get it, why would you do me like that?  Hello to pizza patron, I really tried to order by phone... Still you don't answer for me any more. :'("}
{"text":"Yuk! Terrible pizza! I think I got food poisoning!! Yuk! Yuk! Yuk! Yuk! Yuk! Yuk! Yik! Still Yuk!!!!!@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@ Yikes yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk yuk"}
{"text":"My family LOVES this pizza! Price wise it sure beats Little Caesar's in our opinion. The crust is awesome, sauce. We think it's the best $5-6 pizza you can buy. (We go to the one on 19th Ave/Glendale.)"}
{"text":"Very affordable pizza, it's even cheaper than Little Cesar's, quality is not exactly better but about the same. They have different kind of pizza for all tastes. I recommend La Mexicana"}
{"text":"Do not come here. Not worth the time or money, and service was extremely terrible."}
{"text":"We have got pizza and wings from here a few times... the pizza is great but the wings and customer service not so much... I'm pretty sure the wings are what made 3 out of the 5 ppl in my house sick and I think that cause 2 people didn't eat any."}
{"text":"Got a pizza and a 15 piece wing sampler of all three of their flavors (Lime 'N Pepper, Buffalo, and Garlic Con Queso)  Loved it all.  Especially the wings!   It's nice having some place good to eat when you work on this side of town.  It's BRAND new at the time of writing this, so my only complaint was the relative cluelessness of the staff. But they were friendly, which is good enough for me.  It's gonna be a regular place to eat lunch for me..."}
{"text":"I can't really tell if having a pepperoni pizza tasting like popcorn was a good thing or a bad thing.  It was even more odd because I know that wasn't intentional.  For a $5 pizza, it is what you would expect it to be.  But I would actually prefer going to Little Caesars over this.    I more than likely won't be coming back here again."}
{"text":"Good pizza. People are nice. Nothing to it. Cheap prices. Unlike other pkaces where it's all dough and no go. No drive up."}
{"text":"Horrible customer service. Inside of 'restaurant' is tiny & so filthy. Pizza is really greasy, soggy crust. The workers were young and did not wear gloves when handling food. They did not get our order correct. I would go down the street to little caesars for 5 buck pizza."}
{"text":"Well they messed up my order again. Two weeks ago I paid full price for eight wings and only received six. Today I paid for a side of sauce and didn't receive it. Frequently you go in and they don't have pizza ready because they can't prepare properly. And it's never fully cooked! I have to take it home and throw it in the oven to be able to eat it Last time I'm going here, especially with a little Caesar right up the street."}
{"text":"Pizza is good, people bitching about it are just trolls trying to sound important and food egumacated. For the price  of the pizza its good, you get sick? maybe you should wash you dirty hands etc. Plus yea its not in the best location, what were you doing there in the first place lol. If you are broke and hungry its a good place. Service is pretty good, quick and eazy."}
{"text":"You can't beat pizza patron. The price is amazing and the pizza is good. How do you beat a 3.99 pizza? Also taste great. Why buy a 20$ pizza from someone else when this one is just as good. I always go there."}
{"text":"When this place opened several years ago, it was decent for chain pizza. I picked up a pepperoni pizza earlier this year. They've clearly slipped. The pizza was greasy and orange, without a crisp crust. The ingredients were low-end; all I could taste was oil.  Pizza Patron doesn't deliver and has no seating. It is takeout only and I think it may only take cash (although they do take both US and Mexican currency -- I kid you not). It is cheap, around $5-6 for a single topping. They have some pizzas always ready, in case you can't wait."}
{"text":"Easily the best pizza joint in the neighborhood, hands down. Short waits and any pie under $10 or their pepperoni deals for $4, definitely better than Domino and Papa John's."}
{"text":"Cant beat $4.00 pizza. It is really good for the prize. My husband likes it more than little Caesars and my brother likes it way more than hungry howies. Best of all, no waiting in line, you just walk in and pick it up. Not the best pizza in town but again, what do you expect for $4.00?"}
{"text":"Chorizo pizza is the bomb. Hands down in the top 5 pizzas in phoenix az"}
{"text":"Great service and super fast checkout. Loved the pizza too. Unlike the super dry and chalky Little caesars, their pizza was flavorful and delish. I'm the type that likes a little grease on my pie and the pepperoni formed little pockets of yumminess!"}
{"text":"I used to like this place! Pizza pretty good considering the price. But this last time we got from them sucked not going back! We called in and ordered,they said it would be 30 minutes. We live right across the street put in order left house 10 minutes later. Went in and paid, sat outside and waited. Went back in at the 30 minute mark, the guy working there said he just gave are pizzas away!! Who does that, we weren't late not even a minute! Plus we called and ordered it! Then proceed to give us attitude and said we would have to wait longer so they can make the pizzas again. They said either wait or we'll give you your money back! My money back I did want my pizza its not my fault you gave it away! No discount or a free appetizers, I think you should compensate for giving are pizza's away! Never going back, the guy was a Fucking Dick!"}
{"text":"Excellent pizza at an excellent price! This is my wife's favorite place to go for a quick pizza. 3.99 pepperoni has fair amount of toppings for the price. Very tasty."}
{"text":"Love their pizza. They are not over priced like most pizza joints. I have never been dissapointed. The pizza has its own unique taste due to the seasoning they use. AMAZING"}
{"text":"Here else can you get a pizza with chorizo and jalapeno and at around $5? No frills place, but who cares. Tasty!"}
{"text":"Pizza crust is average. Toppings are few. I ordered the groupon special 2 pizzas with 3 toppings each. Shop purposely cut back on toppings for whatever reasons. It's silly because if pizza is bad, at least the toppings can save it. Learned my lesson. Don't waste your time here."}
{"text":"I recently walked into this place an hour before closing to be told that they have no pizza. Yes, you heard me, they have NO PIZZA. The rather flippant teenager behind the counter stated it was a busy day and they had no more pizzas for the night.   This all happened after they realized I am not a Spanish speaker, having greeted me in Spanish, and seemed puzzled that I didn't speak it. Not all Mexicans speak Spanish! I'm from the U.S.A.!!   How does a pizza place have no pizza, and remain open?   They only got the other star because when they DO have pizza, it's half-way decent, and cheap."}
{"text":"Food was really good but a little on the pricy side. Otherwise it was great! I wills finitely be returning here"}
{"text":"Bette then papa johns,little ceasers,Pizza Hut,But it's better to eat right away definitely not a great pizza to enjoy cold"}
{"text":"I'm not sure why this place has all these stellar reviews. The super greasy, to the point of slimy. There are pools of grease on top of the pizza. The white sauce pizza with chicken is not good and that's hard to mess up. Idk why someone would say this is the top 5 pizzas in Phoenix."}
{"text":"Actually the $3.99 pizza from Pizza Patron looked pretty darn good when I opened the box. It was hot but I noticed immediately, no pizza aroma! Adequate amount of pepperonis and cheese and the crust looked good too but had absolutely no flavor...none! Like a generic pizza..Possible imitation cheese, pepperonis, sauce and dough. I sprinkled copious amounts of garlic salt/powder and crushed red peppers all over it to give it some flavor. I guess if you don't mind doing that it's worth $3.99. Prob better to go across the street to Little Caesar's for $4.99! The star is for me and my seasoning additions! Haha Could give another star for convenience but parking is bad!"}
{"text":"I think the little kwik-e-mart pizzas taste a bit better than these.  I had both peperoni and just cheese and both were somehow both drippy with grease and really really really hard to bite through."}
