{"text":"Soooooo many good things to say about this place!! Pizza is finger lickin' good! My co-worker and I eat here at least twice a week! The Owner is suuuupeer friendly. Not many places that have good food and great service!! We are so happy you moved in!!"}
{"text":"Just had this delivered nicest man came to deliver. Wasn't sure what to expect but it's really good. Not New York style or anything but it reminds me of toppers pizza in Ventura county california which is one of my favorites. I definitely recommend it"}
{"text":"Great Pizza! Very fresh and tasty! If you are looking for awesome tasting pizza in Las Vegas I say give this new place a try!"}
{"text":"Excellent food. My husband and I ordered a pizza and drinks for lunch. Just the owner working and he was friendly and funny. Gave us complimentary garlic cheese bread which was amazing. Fresh garlic and bread only made me want more. Will definitely come back."}
{"text":"Pizza was off the hook! Made from scratch pizza dough and sauce! Fresh quality ingredients! You can really taste the difference! These guys really know how to make pizza! Great selection of specialty pizzas and subs. I recommend the chicken parmigian pizza and the pastrami sub! If your dining in they even have a nice selection of beers. Definitely a place for foodies! Only negative is that they only have one location right now. When are we gonna get a Pizza Gourmet in the Northwest? Well worth the drive for my family and I."}
{"text":"Owner has owned Pizzerias for over 40 years. His Chicken Parmesan Pizza is a must choice when you are here. Very good thin crisp crust made to order. Whole pies or by the slice...They are located on Fort Apache behind Fanco Lighting...."}
{"text":"Just got home with my combination pizza and it is amazing!!!! The crust is crispy and chewy and cooked perfect. The toppings taste so fresh and were so good. This is my new favorite pizza place!"}
{"text":"Owner is super friendly- he'll tell you all about his decades-long history as a pizzeria owner back in California, and everything that led him to open this store! Interior is nicely decorated, classy for a place that offers by-the-slice and whole pies.  Specialty pizza list is extensive, their best seller is the phenomenal-sounding chicken parmagiana. Lunch specials available by the slice, with toppings, for $5 and $7, with and without a side salad and drink. In addition to pies, they also have sandwiches.  Crust here is unique- crispy, with a touch of garlic, almost cracker-like, and slightly burned with a good char. Fresh toppings are used, and produce in salads is fresh too- not sure if the dressings are homemade though."}
{"text":"Great pizza. Back east style. Not greasy. Crisp but chewy crust. Homemade flavor, fresh ingredients. Really nice owner."}
{"text":"A hidden gem!  The owner makes pizza to die for.  He told me that he makes the pizza crust and sauce from scratch.  The crust had this light texture that was absolutely delicious!  The vegetables are freshly chopped too!  So many gourmet toppings to choose from!  And the best pastrami sandwiches too!  Highly recommend that you try this place."}
{"text":"This food is amazing!  I've had the pizza, the vegetarian sandwich and the mediterranean salad and everything was excellent.  Super fresh ingredients and cooked to perfection.  The owner is super friendly.  Will definitely be coming back soon."}
{"text":"My son and I enjoyed the pizzaiolo (all meat). It was awesome! Fresh ingredients and full of flavor. Also the ambiance is nice and service is great! Such a warm and friendly place. We will definitely be going back soon!"}
{"text":"Quality ingredients, real cheese, great sauce, THIN crusts, REAL ROASTED Garlic (not the minced stuff that comes in a cheap olive/vegetable oil mix, from a bottle or can).  I'm a fan!  This place is only a month old and they are really serving to please. The owner and woman at the counter are truly, lovely humans, also.  Make the stop, definitely worthwhile.  ..did I mention the gluten-free crust is yummy??!!"}
