{"text":"Great menu and food was tasty.  Loved the buffalo chicken sandwich and Taco pizza!"}
{"text":"Location is not the best but we go there for the food. Tried their  Greek, Buffalo chicken and seafood specialty pizzas. Great stuff great value for the money!"}
{"text":"I've ordered twice thus far- both times for delivery. The pizza was average, not bad, just ok.  The gyro was very good by pizza shop standards. The meat was high quality, though the sauce was just ok. Overall, a welcomed addition to the area."}
{"text":"Buffalo Chicken Hoagie is AMAZING! The gluten free pizza came loaded with cheese and pepperoni, plus, BYOB! Pro tip: Stop at Sinicrope, the beer distributor down the street, grab a few adult slushies and stop in at Pronto to watch the Pens and eat some delicious food."}
{"text":"Much better service the last few times ordered. Got the food fast and everything was in the bag. Happy costumer again."}
{"text":"Pizza is excellent.  I've only had delivery but they are quick and the drivers are very friendly. Highly recommended."}
{"text":"Good wings and pizza. Plenty of toppings on the pizza and wings are perfect, crispy on the outside and very tender/juicy inside!"}
{"text":"Just terrible. We decided to go off the beaten trail and venture away from the safety of Ephesus' menu. Partly because we are experiencing dissatisfaction with their decline in quality and value and looking for something new to WOW us. Pizza Pronto ain't that place. We ordered a fancy pizza and a gyro to perform our thorough due diligence of testing their menu and execution. They failed. The roasted eggplant pizza was the grossest slab of choad toast. First off, the eggplant was deep fried and seemingly done so in vaseline based on the putrid greasiness and burnt petrochemical flavor and aroma we observed. The crust was like biscuit dough leavened with sawdust. Awful. Regrettably this pizza did not live up its potential with such an all star cast of ingredients in its composition. A real shame. We couldn't even eat more than one slice. Even worse still is I have this stinking, rotting mess of a pizza in my trash until Wednesday before it completely through menacing us! Still on the subject of this brick oven abortion, we called to express our dissatisfaction and were met with a similar lack of attention to our complaints as our food. This put me over the top and prompted my public expression of this disappointment. Do yourself a favor and avoid this same fate."}
{"text":"Delicious and fresh! Very nice people and our order was ready promptly.  Generous portions and satisfying meals.  Place was clean and smelled wonderful!  We'll be back next time we are in the area!"}
{"text":"I ate here like 3 years ago passing through town on a road trip with my family from South Florida to New York and back. This was one of the favorite places that my family and I stopped to eat at. I swore I'd get on Yelp and write a review at some point and here I am.  There wasn't a ton of people dining when we were there and the owner and staff were incredibly inviting and nice to us. I think I inadvertently insulted the owner by saying that the yelp pictures just didn't do it justice (at the time there were only a few quick pics uploaded). What I really meant was that it's hard to tell from a picture how delicious something is and the food served here was great quality and great tasting.  We were looking for a local pizza place that took pride in their business and that's exactly what we found. This is a great little restaurant and I still think about our experience there. If we're ever back in the area we'll definitely be stopping back in for some more of those stuffed garlic rolls."}
{"text":"This new location opened just recently in an area that has had difficulty keeping businesses.  From what I can tell, it has been a hit in our neighborhood so far!  We ate inside Pizza Pronto on a Friday night, the same day that everyone in the neighborhood got menus in the mail.  It was BUSY!  So busy that I'm not sure the staff was ready for the onslaught of pizza customers.  The take out orders seemed to be constant, and as a result the kitchen was slower than what they hopefully normally be.    Pizza Pronto is BYOB and has a handful of tables in a cute room connected to where the take out orders are picked up.  We ordered several pizzas and shared... the Bacon Cheeseburger Pizza, the Spinach and Chicken Pizza, and a Pepperoni and Cheese.  Everyone at the table loved the pizza, especially the crust.  It is crispy on the outside and very soft and doughy inside.    The staff was extremely nice, but like I mentioned before, overwhelmed.  Our pizzas came out at different times and we were waiting for longer than we expected for our food.  That being said, I always cut new businesses and new waitresses a little slack in this area, so I'm not factoring this into my review at this time.  We had a great time inside the restaurant, and will definitely come back.  It's a nice place to relax and have a few drinks and slices before going out for the night.  I also noticed they have a great gyro and fries special that we will order at home.  I hope Avalon and the surrounding areas continue to support this new business!"}
{"text":"The offerings and menus are almost usually identical except for the pizza shop name, address and telephone numbers. Love the service always fast and friendly. Gyros are excellent, kinda small but hey it's a neighborhood spot so not bad for a neighborhood joint. They've stuck around not like some of the others who have come and gone here in Avalon.   Kudos"}
{"text":"I order from here often for delivery or sometimes i walk up the street. Whoever answer the phone is always nice. Price is great. Pizza and gyros are my fav. The place  is a little smal but i like the ambiance. And everyone is always welcoming."}
{"text":"Awful service. Never had a chance to even try the food. Rude staff and poor customer service. We live less than 2 miles away from pizza shop and delivery took almost 60 minutes, way longer than quoted time, Called to cancel and was told I had to speak to the manager and he was very rude.  We will never order from them again. 0 stars"}
{"text":"Last night my family and I wanted some good Italian takeout and came upon Pronto on yelp. We ordered 3 pasta meals: eggplant, meat pasta, and chicken parm. They all came with AMAZING garlic bread, a standard small side salad and a huge portion of meat and pasta. It was phenomenal and we had lots of leftovers for a great price. I can't wait to try more things on the menu. I also did the online ordering through yelp and everything worked out well. Super easy."}
{"text":"So I have never ordered from this place before and will never again. Ordered a half hawaiian and half plain pizza and got it for delivery, the time of the delivery was decent, what wasn't decent was that they gave me the complete wrong pizza.... So after calling our delivery driver and telling him about the wrong pizza, he asked if we just wanted that one since he would have to go all the way back and get ours... like are you freaking kidding?! So after another 30 mins he finally came back and of course the pizza was cold, and not to mention we ordered a large and there was only 8 pieces instead of 12... So I called and complained as anyone should and the lady I talked to said she was sorry because they have new workers and they're still learning and that she would give me a $3.00 credit! This place is a joke, save your money and go somewhere else!"}
{"text":"Great food and friendly service! The meatball sub was AWESOME and their homemade Garlic bread is a must-have"}
{"text":"I was a bit pizza'd off the night I came here.  There was nothing Pronto about this Pizza. They don't serve slices and aren't at all friendly about being asked. Their Gyros are not made with the actual spinning Gyro thing, which is what makes Gyros in Pitt delicious. So on the whole, I wasn't impressed by anything other than their opening hours, which are not actually reliable since they were closed up a good 40 minutes before the posted closing time on the chilly night I was here."}
{"text":"Ordered online via yelp and everything went great. Delivery was faster than anticipated. Food just isn't good, though. It's cold, and all fried items are soggy. Roasted eggplant pizza is a fried eggplant pizza. I actually thought we got a pizza with gyro meat on it. Nope, it's fried (not roasted) eggplant slices. Just disappointing :("}
{"text":"Service is fast and workers are friendly and polite. Took advantage of their online ordering though Yelp and got to select our pizza and toppings which was nicer than calling in the order. Opted to pay upon pickup so very convenient.   Pizza is on the better side with fresh toppings and doughy crust. I was especially impressed by their specialty pizzas-the broccoli cheese and bbq buffalo chicken were pleasant surprises and worth the extra money."}
{"text":"I am turning into a regular customer and  still haven't ordered the same thing twice.  Great small town  atmosphere.  Quick and friendly service.  I highly recommend the artichoke dip and pita bread ."}
{"text":"I stopped by here two nights ago as part of a night where I would try three different pizzas in the Bellevue/Avalon area.  I called ahead and placed a pickup order of their XL cheese pizza and cheese bread special and was told that it would be ready in 20 minutes.  30 minutes later I arrived at the shop and my food was ready.  Before I walked in the shop I did not know how extensive their menu was but all of the items were written around the pickup area.  I didn't notice the dining room next to the pickup area until after I had left the shop and gotten in my car.  It looked pretty nice though with the only two people eating in it being a pair of Avalon cops.  Pizzas in general can be broken down into three separate components: cheese, crust and sauce.  The crust on this pizza ended up having a medium thickness and while cooked through did not have any crispiness to it.  Its sauce was definitely there but I couldn't taste too much of it until I actually tried a little bit off of the pizza where it had a mild and decent flavor.  Finally the cheese of which this pizza had a ton.  Unfortunately it wasn't too flavorful and I think that it actually covered up some of the flavor of the sauce.  On the pizza alone I would give Pizza Pronto 2 stars.  It's saving grace came in the form of some cheese bread which was part of the deal that I got.  Whenever I hear cheese bread from a restaurant a picture of some breadsticks covered in cheese is what comes to mind.  I couldn't have been further off from the cheese bread from Pizza Pronto.  Here is comes shaped like a calzone, browned nicely on the outside with some garlic salt and Parmesan and absolutely stuffed with cheese.  I can't imagine eating a whole one by yourself as there was that much cheese in it.  It was delicious though and I highly recommend ordering one if you even head here.  The bottom line for me is that I can't see myself heading back to Pizza Pronto again for pizza with so many other places nearby.  However I could see myself going back for some cheese bread and maybe trying something else on their menu like the surf n burger which is an angus beef burger with fried shrimp on top."}
{"text":"Old reliable.   Press a few buttons on yelp, and 35 minutes later, the (really cute) delivery boy is at the door with carbs. Can't be beat.   I should ask him out next time.  Nah.   I live just down the hill from Pronto, and I order pizza, wings, salads or fries from them every payday. Everything is really good, but my favorite is probably the cheeseburger pizza. It just tastes like a cheeseburger! I don't know why. It's just good!   I love that they offer ordering from yelp, so my social anxiety can be kept at bay. Haha.   They are quick and the food is always good. Sometimes they forget the ranch I order, but it's all good.   Happy Eating!"}
{"text":"Holy Molies! This place rocks! The food is unreal, the employees are the kindest in Pittsburgh, and the delivery is much faster than everywhere else in the area.   Because I work in Bellevue everyday, my staff and I order from here quite often. We've tried almost everything! Everything we eat is amazing. My friend is a self proclaimed Gyro Connoisseur and he loves them here! I'm a buffalo chicken fan, and their wings are great and the sauces are amazing!   But my God, the BEST thing is the Homemade Ranch Dressing! It is to die for!   Needless to say, this is one of my favorite delivery restaurants ever. I urge you to try it!"}
{"text":"Pizza is ok. Not much around this area to choose from. Little slivers of pizza and not very doughy. It was good, but there are way better pizza places in the Burgh. Specifically,  for a bit further down the road go to Doughboy's in McKees Rocks."}
{"text":"Best gyro in the city. Authentic lamb that they are very generous with the portion sizes. Pizza isn't bad, but there's no need to get anything else besides a gyro here!!"}
{"text":"Stopped by for lunch since I was in town on business. Was greeted in front and directed to the dining room which was clean and well maintained.  I was the only one in the dining room for the entirety of my stay but there were several take out orders.  I was served by John, the owner. He offered me the remote for the tv in the dining room. I ended up ordering a half gyro hoagie and fries with coffee to drink. The gyro hoagie was very good with delicious gyro meat and fresh toppings. The bun was perfectly toasted. The fries were pretty standard but perfectly cooked, crispy on the outside with a fluffy interior. Staff was attentive and quick to refill my coffee.  Prices were quite reasonable. Give them a try."}
{"text":"We were passing through the area and decided to try this place. The pronto rolls were delicious! The service was amazing in a real person to person sort of way - kind and considerate like you were a guest not a customer. Even though they knew we were from out of town (won't be back anytime soon) we were treated so well and the food was wonderful. I'm sad they don't deliver to Florida!"}
{"text":"Turkish owned pizza shops are abundant in the burgh. And they are pretty much all the same, almost as if there were a 'kit' available for Turkish entrepreneurs. Welcome! Here's your kit! The offerings and menus are almost usually identical except for the pizza shop name, address and telephone numbers. Even the online ordering systems seem to be connected, and if you order from home or the office, the site leads you to the closest kit shop.  Same seems to be true for local Asian buffets. Here's your 'kit' and good luck! Bottom line is, they're mostly all the same.  That being said, whoever is handing out the kits for the Turkish owned shops is doing a very good job, as these shops tend to be the most consistent decent pizza shops in the area. Pizza Pronto is no exception to that rule. The food quality is consistent, the pricing is the same, and the service is as pleasant as any other shop.  What makes Pronto stand out is the venue. While many of the kit shops have a counter or an incidental table or two if you decide to dine there, Pronto actually has a restaurant that is very pleasant for dining in.  Comfortable tables and chairs, a typical kitschy Italian-ish setting, and neighborhood regulars who you see frequently. It's an ideal neighborhood spot for grabbing wings, good sandwiches or gyros, a variety of pasta dishes or salads, and of course, pizza.  Now for me personally, I never get pizza 'out'. To me, pizza has become that stuff that comes in a box that is delivered to my door when even mac-n-cheese I can't be bothered making, I have a little extra in my budget, and I'm REALLY freakin' hungry.   BUT, when I'm not in the mood to cook, and want to actually get 'out', but not TOO far, having Pizza Pronto a mile away in Avalon, and with a cozy dining room, makes it a go-to for me. I wouldn't think of it as a 'destination', and definitely not for the 'foodies' in town, and even though a half mile closer in Bellevue are three or four more 'here's your kit' pizza shops, they don't have the comfortable dining room that Pronto has.   I've never had bad service, and the only time I had even a bad bite of food was one time when the former friend who introduced me to the place, a friend of the former co-owner, 'took control' of our meal and ordered a giant pan of wings 'well done' and they arrived extra crunchy and dry. That's how he ordered them, and was not the restaurant's fault. Since returning, the wings are always cooked perfectly, and the sauces are delish.  The only other real 'Italian' option in the immediate area seems to be Luigi's, which I find to be one of those overpriced and totally average family owned 'we don't really care now give us the money' spots. The atmosphere is almost the same, and the prices slightly higher, but the food quality just doesn't match. It's 'just ok' at best.  For anyone who lives in the Bellevue, Avalon, or even Brighton Heights areas, a quick drive down to Pizza Pronto is an easy solution to a decent Italian night out."}
{"text":"My husband and I ordered a large cheese and pepperoni pizza. The price was $11.75, which seems reasonable for the size and quality of the pizza. The taste was very good and a strong 4 stars.  The dough wasn't too thick, the sauce was good, and there was plenty of cheese. Next time I will ask for extra oregano, but that's just my taste. The place looked very clean and the staff was friendly. I'll be ordering from here again."}
