{"text":"District Manager David doing a great job training his Team at C.Falls PIZZAFIRE on Portage Trail. Trying news things that are working! First place my wife and I stopped after returning from Mexico, we were hungry, and the pizzas were GREAT!  Great Job David and whole PIZZAFIRE Team!  Awesome Food! Awesome Place! Awesome People! Awesome Service!"}
{"text":"Forget what Mady  T says. The pizza is made to order for one person not a group. The pizza is perfect size for one person. It's like Chipotle in Pizza form. So you wouldn't or one burrito for two people at Chipotle would you? So with that said it was amazing and they come out and ask you how was it. Also they ask what they can change to better their service. The staff is nicer then the people at Chipotle. Also it is alot cleaner then Chipotle. Highly recommended to try. Once you try it you will come again guaranteed."}
{"text":"The pizza was good but expensive. For four pizza and three small drinks it cost us $45. The girl making the pizza was very nice and very patient with my two 10yr old sons ordering."}
{"text":"Advertises gluten free but they use the same sauce ladle for regular pizza and gluten free.  Total cross contamination.  Do not eat here if your gluten free. The manager thought that rinsing the ladle made it gluten free."}
{"text":"The dough in the pizza had no flavor. Service could be a bit more organized. The chicken and ham must have been from a can. The chicken had no taste and it was a ground up type. The pizza is chard well though."}
{"text":"Web page really not user friendly; had to go back and forth because definition of items on one page, order page on another.  For just opening the place was sort of dirty looking.  Food all over the floor.  One of the cooks dropped his gloves onto the floor; cause you know when you're on the job texting is primary.  He bent over and scooped up the gloves-didn't toss them!   I usually can get a pizza that I can actually sink my teeth into and have left overs. From here, maybe comparable to a slightly larger than single serving size."}
{"text":"Great tasting pizza at reasonable price. The dough and ingredients taste very fresh and flavorful. They have good number of toppings available. Overall a great experience.   The only negative could be long lines but considering it is new restaurant it is to be expected."}
{"text":"Biggest complaint is that it was very bland.   Second complaint, eating it felt strange. The sauce tasted raw, if that even makes sense. It's very difficult to describe the pizza and what's bad about it. It's as if they baked the bread, pulled it out of the oven and then put raw sauce and toppings on it. Everything but the bread was cold."}
{"text":"Waited far too long to be helped and even longer to get my breadsticks. Slow service and the pizza is slightly below average, they're extremely scarce with their topping and not generous at all, ran out of napkins and garlic sauce as well."}
{"text":"This place was excellent, great food great food great staff and quick. Matter of fact my 8 month old baby grabbed the pizza tray and took it right to the floor leaving my 11 year old with nothing to eat. I went up to the front to buy a new one and I believe one of the owners was there and provided us with a new pizza free of charge. If you're in the Brunswick area this is a great place though have a quick bite!!!!"}
{"text":"While the pizza at this place is very good, they are incapable of delivering their promise of a pizza in three minutes. I have visited this establishment twice and both times they were unable to make a pizza. I stood for nearly 20 minutes waiting for them to make two pizzas. Not to mention they messed up the order on my son's Pizza, it was only plain half pepperoni. Do not waste your time waiting in line or visiting this establishment. Maybe the other pizza places are faster but this one can't get it right. Do not go here!"}
{"text":"Gluten-free and vegan options! They are even allergy conscious, changing out gloves, utensils & cleaning the prep space. Amazing! Courteous and friendly every time. Thin crust, brick oven style with freshly grown basil. This place rocks!"}
{"text":"Went here for dinner before the Ravens vs Browns game. Our pizzas came out in good time. Even had dairy-free cheese! The only issue was that the crust was burnt badly on both of the pizzas we got.  Will probably be back but only because a place that has dairy-free cheese is hard to find."}
{"text":"Went to pizza fire today. No wait for lunch. Service was slow and poor. Ordered three lunch combos. The pizza and sides were all burnt. Went to counter. No apology by any employee. Requested refund. Will not be back. Awful experience and product"}
{"text":"Kids love to see baking pizza in a real fire oven. Pizza tastes good. Price is OK. It is a good place to have fast food."}
{"text":"A big selling point is the fresh vegetable toppings. My favorite pizza is with fresh mushrooms. I ordered my pizza with fresh mushrooms but the one I received had canned mushrooms and they were particularly awful. I will not return."}
{"text":"Pizza was super fast, very fresh and the BBQ sauce was to die for, only complaint about this place is the ridiculously priced drinks, $2.49 for a small!! Will go back but just not to eat in."}
{"text":"Very disappointed.   Not fast.  Even though only 3 people in front of me, it took about 8 minutes to order.  Then 20 minutes to get the pizza.   Maybe they had a big phone order or the oven was acting up.  I would consider my pepperoni and mushroom pizza to be undercooked.  Especially the toppings.   The mushrooms are not fresh.  They are from a jar or can for sure.   I won't be back."}
{"text":"Fun place to take kids as they can get exactly what they want on a pizza. We found that tow kids (ages8 and 10) can share one pizza with not a crumb leftover . We like their chicken with BBQ sauce pizza the best . Definitely will return to,this Pizza Fire"}
{"text":"I had to write because I was truly excited to try their margherita pizza.  It's a fast food pizza place.  Not on par with a good pizza joint.  I won't be back."}
{"text":"Right away entering the new location, I was greeted, menu was explained to me, clean, nice modern atmosphere, great aroma. Took my sister and her kids, and had a great time, great meal. Mainly chose pizzas from their recommended ones, and were hot/fresh in less than 10 min, light and not greasy, great flavor. For being a under 10 dollar per pizza place, and how quick they were, they deserve five stars. The employees were great as well. Really enjoyed it, will be coming back for more."}
{"text":"First Time Here. Just Watched The Employee Have A Customer Bring A Pizza Back In And An Employee Ran Out And Gave It To Another Perosn Because They Messed Up The Order. This Is Not Acceptable Practice In Any Food Serving Establishemnet I Have Ever Worked In. Once Food Hits The Table (Or Someones Backseat Of Their Car) You Should Not Be Able To Serve It To Someone Else. Wish I Didnt Already Pay For My Pizza.... First Time-Last Time At Pizza Fire."}
{"text":"Great concept and idea but very poor execution and delivery.  The pizza is good but is not worth the 20-30 minute wait in line.  Pass on going there until they learn how to handle the crowds or when popularity dies down."}
{"text":"Pizza can be the same from place to place but the pizza here is not only unique but some of the best pizza I've ever had. Been there a few times now and gotten a few different pizzas and not once been disappointed. Never had to wait in line and have only ever waited 10 minutes for my food to be freshly made. Will be back soon!"}
{"text":"Fast, thin crust and yummy. Fast food style ordering. Cooked in a brick oven for 3 minutes. We got the Cleveland because ... well we were in Cleveland. Also has the meatballs in the spicy marinara. Would definitely go back for a quick pizza fix again."}
{"text":"The lunch special is a great deal! However, the pizza is not that great.  Crust isn't crisp. No real crunch. Even after eating salad first the cheese and toppings tend to slide off pretty easily."}
{"text":"First time here, and wouldn't have changed a thing! I had the Chicago pizza, yum! The place was clean and employees were friendly! I'll be back!"}
{"text":"Ordered online twice. Good pizza when you are in the mood for a thin crust. If ordering to pick up, it will be ready before 20 mins. And make sure you let them know you are picking up as they don't ask, when you come in,  and its probably ready. Warms up nice in the oven. They didn't charge me extra for the fruit fly either. Best thin crust is three palms in Hudson, but this will do when I want something closer to home."}
{"text":"It's fast service pizza. For what it is, it is a great place. Only issue was that the guy making our food had no idea had to make a salad."}
{"text":"This is REALLY good for fast casual pizza. Freshly made, flavorful, thin crust that seems to not have preservatives in it and really fresh toppings. Will pick this over delivery pizza anytime.   Had 3 types - a green pepper onion - a plain and a Margherita pizza both times we went.   Their Margherita still needs some work; they are WAY too light on the cheese (even for an \"authentic\" Neopolitan style pizza).  If they are making it the way they are told to - the pizza needs 2-3X as much cheese as they are currently putting on it. We have had authentic Neopolitan pizza in Italy and the US including places that have the \"Vera Pizza Napoletana\" certification.  They are still working out some opening month issues. Went once when it was quiet and the pizza was solid. Went once when it was busy and the placement of the toppings was off, as was the amount of cheese on the pizzas and the pizzas seemed to get pulled out of the oven too early with no char on the bottom.  I'm hopeful they work this out.   The only problem I find is their \"number\" system. They give the customer's pizza (not the order - but the individual pizza) a number - which they tell the customer and the customer has to relay that to the cashier (5 feet away). It would seem better to assign a single number per order and convey it directly to the cashier somehow.  I ordered 3 pizzas and had to remember 3 numbers that were not sequential; the cashier did not enter them into the system correctly and did not get us one of the right pizzas initially."}
{"text":"I've been there twice now.  The first time, my pizza was a little overdone and the crust was charred. And I wasn't impressed with the garlic olive oil sauce.  However,  we tried again last night and it was much better this time. There was a long line,  but once we ordered our food, it came out pretty quickly. I had a three topping pizza (red onion, tomatoes, and green peppers) with shredded mozzarella and basil pesto sauce. I liked that sauce much better than the garlic olive oil. I will be back to try the salads."}
{"text":"Enjoying this fresh creation! Quick, hot and just love the concept!! Nothing better than a wood fired pizza."}
{"text":"I visited Pizza Fire today for the first time. It was a Wednesday at 12:15PM. The line was about 10 deep and moved quickly as I waited 5-6 minutes until it was my turn. I ordered a \"Margherita 72\" and was told my number was 48.  After another few minutes, it was my turn to pay and I was asked for my number and what I ordered. I'm not sure why they ask you for your number AND your order, but, nevertheless, I added a small drink. My bill came to $11.50, a bit steep in my opinion; $8.59 for the pizza and  $2.29 for a small drink. Small drinks are usually under $2 at other local fast casual restaurants.  Their drink selection was nice as they had three flavors of iced tea (one unsweetened) in addition to the soda machine. There were plenty of open seats and the tables and floors were very clean.  Now, onto the pizza.... The \"Margherita 72\" is a thin crust with fresh mozzarella, basil and parmigiano reggiano. It wasn't 3 Palms tasty, but it was good.The crust, which was cooked perfectly, a little crunchy but not burnt, was a bit too salty for me. Maybe next time I'll order it without the added sea salt. The fresh ingredients are a nice touch as they pick the basil from the plant when making the pizza. It looks like they grow their own basil and lettuce. The sauce was great; not too sweet or tangy.  I eat lunch out everyday, Monday through Friday, and I'll try to stop in occasionally. I wonder if they offer a healthier option such as half pizza/half salad. If so, I might visit more often."}
{"text":"For some reason about 12 people (including myself) came in for pizza an hour before close and these young ladies HANDLED it.  The staff was extremely professional and friendly, and the pizza was great!"}
{"text":"This has to be the slowest pizza Fire ever. The service is terrible. It's 6 pm and we called ahead for 2 pizzas. Nothing complicated.  It's literally been 15 minutes and still waiting. It's really bad at lunch also. Service takes forever. Also they really do t want you to use your app to check in at this location. The reader to scan it ( for free pizzas) is behind the counter and you have to remember to ask for it each time."}
{"text":"Pizza is alright. Great idea for a quick bite before heading into the game. Went in on a Friday night before a Cavaliers game. Slightly busy but still ordered and received pizzas in great time. Only issue we had was some harassment from a homeless man hanging around inside that ended up taking some of our pizza...  And having to explain to my 8 year old why a different seemingly homeless man was sleeping and drooling at a table near us the entire time we were eating.  I don't know if they just pay little attention to the dining area or if they are homeless friendly. Either way. It was... uncomfortable."}
{"text":"Could of went to Cici's Pizza and had better the crust is so thin the pizza flops downwards. Pizza isn't just about toppings the bread is super thin the Pizza is pretty damn small I could of ate 2 by my self and I am a small skinny guy.   Don't waste your time with this place go to Fast Eddie's instead and get a delicious burger or pick another Pizza place that deserves the money."}
{"text":"Pizzas are very small so order more than one if you're hungry. Nothing special about them at all. They don't take orders over the phone and no delivery? Weird! Said my order would be ready by 5 and it wasn't. Totally screwed my order up and they had to remake one of my pizzas, so I had to wait another 20 minutes. I didn't even custom order anything so it shouldn't have been that hard. They are really disorganized and need to get it together. Won't be ordering again."}
{"text":"We love this new pizza spot in downtown Kent!! Everything is done quickly (as in your pizza is done in 4 minutes)!  Our kids love it too. The specialty pizzas are truly unique and taste spectacular. We've been three times now. :)"}
{"text":"Are you kidding me!!   Made pizza wrong.  Now I'm waiting 15 more min while everyone in the place gets pizza.  Just asked where our pizza is,  they forgot to remake it.  1 pepperoni cheese pizza, WOW!!! Never again!!! 1 star because I can't give 0."}
{"text":"DO NOT GET A SALAD!!! They are pre-packaged and seem to be prepared using yesterday's leftover veggies. Barely enough wilted lettuce to cover the bottom of the plate. An absolute Joke.   The drink cups come in one size (small). Definitely cutting corners on the food quality. Overall poor execution on the pizza. My coworker ate one slice and didn't even want her leftovers.   I am always a customer that lets my wallet do the talking. I will not be back"}
{"text":"Went with my friend for the first time. There wasn't a wait nor was there any delays. I had the Land pizza, the toppings included onions, sausage, mushroom. The thin slice was a surprise but it was made very well, the toppings tasted fresh and the food came out fast too. Wasn't expensive either, ended getting a drink also(they had the DIY drinking fountains)  Definitely will be back whenever I visit The Land."}
{"text":"I didnt get the experience of going inside because someone bought me a pizza for my birthday. I pretty much liked it. My crust was cooked,sauce was good. The bacon and pepperoni were tasty. I wouldn't go out of my way for it but would buy it if i am in the neighborhood!"}
{"text":"Saw their ad on TV that showed a new location had just opened in Fairlawn. Unfortunately, I drove by or tried to stop-in three different times, and each time the windows were covered with paper. I heard they had a few problems opening, but finally they unlocked their doors early this month. I stopped in around 5:00, on a Friday, and of course they were a little busy. But the process didn't take any longer than their other locations when busy. But should they turn out to be much more popular, Pizza Fire should think about adding to or expending the bake ovens.  Anyway, I decided to test them by creating my own pizza. I ordered a Three-Topping for $7.49. My sauce of choice was the original Neapolitan, covered with shredded mozzarella, and topped with pepperoni, bacon and mushrooms. The dough is fresh and they stretch it out when you order. When baked, my pizza measured about 10 1/4 inches across, roughly an inch smaller than I'm used to getting at other Pizza Fire locations. So maybe a bit of training is necessary as I am sure there are corporate standards that should be met. The sauce was terrific. There were fourteen slices of pepperoni. And the toppings covered from within an inch to a half-inch from the edge.  The only thing I didn't like was the bacon. I'm a big bacon fan, but it has to be crisp. The bacon on the pizza wasn't. The bacon was obviously pre-cooked (don't know if P.F. does it or if it arrives that way from an outside source) and crumbled. But, as a fan of bacon, I know personally that, if allowed to sit, bacon absorbs back some fat and softens up. The length of time they bake the pizza is not enough time for bacon to re-crisp. So, don't order it with bacon unless you are O.K. with it not being crisp. Oh well, that's my problem, and I am not going to penalize Pizza Fire for my idiosyncrasy.  The other Pizza Fire locations are on the Belly network. When I was here they did not have the network on-line. So, no credits.  I am going to give this location four stars. I would like to give it 3 1/2, at least until they work out the kinks and bugs and are comparable to the other Pizza Fire stores, but Yelp doesn't allow that. I am placing it towards the bottom of the 4-star list."}
{"text":"Pizza Fire is starting to become one of my go-to's. When other places close at 9:00 or 10:00, Pizza Fire will still be available. So if you are hungry and that favorite Mexican joint closes up just as you turn into the parking lot, which happened to me a couple of times, go to Pizza Fire. They'll be open and it won't take long for you to get in and out. I promise you.  Another promise is that they will be consistently good, no matter which place or what time you go, as I am finding out. I also strongly suggest that, when you go to Pizza Fire, you try the monthly special. Definitely the best deal for the buck. I just tried the October Special, which was pepperoni, sausage, shredded mozzarella and Neapolitan sauce. Very tasty. For $7.49 the pizza measured 11 1/2 inches across with toppings covering it from the edge to about an inch from the edge, pretty normal for pizza. The Neapolitan sauce was delicious and the flavors really came through. While not the biggest fan of sausage, it being a highly seasoned product of all the left overs from the pig, I will say the sausage was more than passable. And they don't skimp on the cheese. Thank you, Pizza Fire.  Yes. I will return. In fact I am thinking about going back right now."}
{"text":"Terrible customer service. Never asked about additional toppings for the pizza. Just shoved it in the oven and moved us down like they were manufacturing products in an assembly line. Excited to see a new restaurant in the area, but super disappointed. Do yourself a favor and skip this dump."}
{"text":"Delicious unique pizza. Choose ur sauce, toppings and ready to eat in 5 min. By far the best I've eaten. Chipoltle like but with pizza. A must for a quick lunch or dinner."}
{"text":"Good pizza, great prices, yet management is horrible. The restaurant does not keep consistent hours. For example, the website says the restaurant should be open until 2am tonight, yet we were told they couldn't fix anymore pizzas after 1:00 am."}
{"text":"Noisy, confusing, and when you place your order they can barely hear you for all the yelling out of orders to co-workers. This is the second time we've been there and each time the pizza is totally soggy in the middle. A family of four in front of us paid $49 for their dinners. And this isn't a place where you sit down and they wait on you! You stand in line, order your food, and stand around and try to pay. Very confusing at the cash register. Not just for us but other folks around us.  I don't know how a young family can afford $50 for pizza. I'd just as soon have Di Giorno pizza at home and save my money."}
{"text":"Very good pizza, fast! Great quality and price! Friendly staff! A wide variety of flavors and so many combination possibilities, it would be difficult to get bored. You can't beat great quality and friendly service in such a fast paced location. The staff takes the time to get it right every time!"}
{"text":"So,  the food is quick and fresh but,  the store is probably one of the dirtiest.  The floors are filthy both out in the dining room and behind the counter.  I could see scraps of food covering the floor and it looks like it has not been cleaned in a week or two.  Makes me hope that the hygiene is not reflected in the 3rd food prep.  The bathroom was severely neglected as well. Nice service but,  it the cleaning needs to catch up."}
{"text":"Great personal pizza for the price, and fast. Kids eat free on Wednesdays as well. You should definitely try it for lunch!"}
{"text":"I absolutely love pizza fire. This was my first time going into this location. I was able to find parking easily. It's in a great spot and the inside was nice, clean and welcoming. The staff from the pizza preparer to the cashier was extremely friendly.   There wasn't a line to order when I went in so I was able to order immediately. I got a 3 topping pizza with a base of garlic and oil topped with their regular pizza sauce, spinach, chicken and broccoli. The pizza didn't take much time to cook.   I love their pizzas because the crust is thin, and they only use a thin layer of sauce and toppings, which makes it just right.   As I paid, I grabbed a butter garlic sauce. Let's talk about their garlic sauce...AH-MAZING!!!! It adds so much flavor to a  already delicious pizza...I love it!  Overall, love this place and this location and will return soon."}
{"text":"There is a book, and that book is a dictionary. The word we are looking at inside this book is the word \"skimp\". According to The Free Dictionary, skimp is defined as \"To provide for or supply inadequately; be stingy with\" (TheFreeDictionary, 2017). In the vast majority of the American culture, the inhabitants of this land prefer cheese on their pizza, and being a pizza place, one would expect there to be cheese on it. There were approximately 75 pieces of shredded cheese on the whole thing, which equals near a quarter cup; way too insufficient for a pizza that one would mistakenly take it as a joke...like me and my husband did. Same goes for the toppings. They may as well do nothing because all we saw was sauce. We got a sauce pizza.   Skimp. (n.d.). Retrieved December 17, 2017, from https://www.thefreedictionary.com/skimp"}
{"text":"Amazing! Guy working was super knowledgeable and very helpful. 1st here and definitely will be returning! Delicious pizza and awesome concept. A must try!!"}
{"text":"Outstanding.  Living up to fast and fresh.  Tried the Austin and a pesto chicken pie.  Very tasty and the cookies were good too.  Definitely coming back."}
{"text":"As expected, I had another good thin crust made to order pizza. This time I knew to only get the top melted a little more.  I do wish they had a freq guest card that didn't involve downloading yet another app onto my phone. I will be back."}
{"text":"I actually enjoyed this pizza.  I built my own with pep and mushrooms.  Then the cashier asked about two different options, the options had names but i don't remember what she called them. One was to cook the pizza a little longer so the bottom was crispy. The other was to broil the top.  I chose both, but next time I would just do the bottom."}
{"text":"Great and quick! The pizza quality is 100x better than papa johns or dominoes and is is the same price and you get it quicker (in 180 seconds to be exact). New favorite pizza joint. Also gluten free and vegan friendly:)"}
{"text":"Worst Margherita pizza I've ever had. Mostly sauce, hardly any fresh mozzarella or basil. Very disappointing."}
{"text":"I absolutely loved my pizza!  What's not to love about fresh dough, fresh ingredients, a wood fire grill and all at an affordable price?!! You can choose from one of their pre-selected pizza's or build your own. They charge $7.49 for 3 toppings or $8.49 for 5 toppings! Most places nowadays you are paying close to $2 per topping!   The staff was incredibly friendly and they all worked well together. It was the start of dinnertime when I arrived so my pizza was out in under ten minutes. I am excited that there is one now in Rocky River close to where I live. I might be spending all my money here to try all kinds of different combinations of pizza!"}
{"text":"What a sheik eat in / takeout pizza place. Located at the heart of the city, it is close to everything. The pizza is fire oven cooked in front of you and it turns out delicious. Toppings galore! It's with your while."}
{"text":"Pizza fire is a very good pizza. ! No it's not just the best. People who work their are cool. I'm in a wheelchair and they help me a lot. SO come to.  PIZZA FIRE... they also have salads. Desserts. Try PIZZA FIRE.  SOON."}
{"text":"Went in to try it out because it was close by and fast.  I was pleasantly welcomed with a greeting - something I wasn't expecting.  Nice touch!  I ordered the Margherita pizza.  Mistake #1 came when they cooked it with the basil leaves on the pizza (you're supposed to top basil after the pizza has been in the oven so the leaves don't burn).  Now for the pizza.  The crust is borderline flavorless.  The sauce is far too salty (and I like salty).  The cheese balls (\"fresh mozzarella\") barely resembled cheese.  All in all, Pizza Fire has spent a ton of money on the marketing engine as well as the store displays, menu presentations, and speed ovens.  What they haven't spent any money on is better ingredients, freshness or  quality.  As nice as the staff was, I won't be back."}
{"text":"The guys who worked here were nice. But the food was mediocre. There was nothing special. Too much salt, and no flavor. The pizza seemed undercooked. I just was not a fan - probably won't be coming back again."}
{"text":"It was good... But not good enough to come back a second time. But 8mim for a pizza is good for that fact. My wife would give it 3 stars."}
{"text":"Walked in to very helpful and nice staff that helped me choose the New Yorker and I have no regrets in my choice! Wish there was one in Avon (like we need any more pizza places). Will definitely come back to try one pizza that had chicken and pesto on it (can't remember the name)."}
{"text":"Not the best pizza I've ever had, but I do think it is really good! The price is great and the speed for a higher quality food like this is a definite bonus. It's basically the Subway of the pizza world as you pick your sauce, cheese, and toppings. Will be back for sure!!"}
{"text":"I have a few complaints about my one & only experience to this place, starting with the pizza, itself.  My son and I went there, ordered two pizzas and a salad.  The salad was pre-packaged, and we were asked what kind of dressing packets we wanted to go with it. But, that wasn't too bad.  The two pizzas, however, were both significantly burnt on the bottoms, to the point at which, I hadn't realized they were burnt until I took my first bite and tasted charcoal, mixed in with the other toppings.  Then I looked at the bottom, and sure enough....black, burnt dough.  (See picture).  Now, the typical pizza that you order anywhere, might have a little bit of this issue around the very edges of the pizza. but this was ridiculous. This place boasts on having your pizza ready in 3 minutes from the time it's placed in their 800-degree oven. ..but maybe that's the problem.  I would rather a place takes the time to cook it CORRECTLY.    Afterall, the average cooking time of a pizza is about 10-13 minutes.  Why should I be impressed that my pizza is done in only 3 minutes but is burnt and tastes like charcoal??   Besides that, this place should invest in better napkins, better paper towels in the bathroom, and better plates.  This might sound petty, but really, the first thing I noticed about their napkins, is that they are very thin, tore easily, very cheap. -which means customers will need to use many more of them throughout a meal, instead of using just a couple of 'better' ones. Also, this place only provides paper plates for the customers. I was reminded of being at a carnival or picnic, instead of a restaurant. And then I thought, if this company is willing to invest money on millions of paper plates that will be thrown out after one use, why not use some money to buy 'real' plates that can be used over & over again, after going through a washing machine?  ...call me crazy.   Anyway, after I finished two slices of charcoal pizza (the 2nd of which I just ate the toppings, and left the burnt flap of dough), I went to wash my hands in the bathroom.  Again, I was surprised and disappointed by the cheap, ultra-thin paper towels in there.  Of course I had to use about 5 of them in order to dry my hands. In most restaurants (and, even pizza joints), 1-2 paper towels is all I need.  But, this is Pizzafire.  The only two positive things I can say about the experience, is that the staff were nice enough, and they had good music playing which wasn't too loud, so it's still easy for people to have conversations without shouting. In the end, though, I won't be spending more of my money at this place.  There are far too many better pizza places out there."}
{"text":"Great! Used to make fresh brick oven pizzas and these are fantastic. For what you pay and receive I can't say one bad thing, great cheese, crust, and toppings"}
{"text":"Pizza lovers need to experience Pizza Fire. The toppings are all right in front of you and so fresh. You can pick what you want on it or go for one of the prepicked options. There are so many options sauces as well. Its a very unique concept and well done. The pizza barely takes anytime to cook and you are on your way. The staff was very friendly. I would go back once again. The only downfall is parking. You are in downtown Kent and it does not have its own parking."}
{"text":"Came here for a quick bite. Not too bad.  I'm gonna give this place the same rating I gave their competitors, BLAZE Pizza.  Ordered a pepperoni, ham, & sausage pizza (I'm a carnivore so sue me). It was prepared pretty much the same way and in about the same amount of time. And the price was good too.  The staff was very friendly and nice.  Great conversation.  The only bad thing was the sold Pepsi products.  Pizza jones solved thanks!"}
{"text":"Greeted when I walked up to counter and asked if I wanted an overview - yes. The friendly staff went through how to order and the ingredients. All the ingredients looked fresh and well prepared. I chose The Cleveland and proceeded to pay for my order. This part of the experience was very much like Chipotle. I sat while they made my pizza, it was done and brought to my table very quickly. The pizza - crust perfect crispy outside, chewy inside. The sauce was good though I may try spicy next time for more flavor. Ingredients tasted fresh and were sized correctly, the sausage was very good.  Definitely going to make this part of my lunch rotation."}
{"text":"This place is ok, not bad. But, not great either. Just ok. It has the same decor, style, flow and lines...... The crust is the best part. Mediocre."}
{"text":"Like the fact they have a vegan pizza option.  I got a veggie loaded pizza with gluten free crust and vegan cheese.   Was pretty tasty.  My wife wanted pizza and I figured I would only be able to get a salad, with the vegan option I was able to get pizza as well so that was a pleasant surprise.  Overall, pizza was decent, and came out super quick, so no complaints at all!   I will be back!"}
{"text":"I am giving this place 5 stars because it's pizza, fast, cheap, and tasty. I read some of the lower ratings due to cleanliness and being overpriced? Whenever I've gone into this location it's always been very clean, maybe the other person went on $5 movie night and the place was packed. For someone to say it's expensive, I'm puzzled. Each pizza is big enough to be shared or eaten by one very hungry adult and they're each about $6 bucks. When me and my fiance go, we always get one for each of us. He always finishes his there, i take half of mine to go and finish it later. I say for price and speed, can't beat this pizza, I've never had one that I didn't like."}
{"text":"Great customer service. I also love that the ingredients are fresh. If your in a rush the pizzas come out fast, so it's perfect for a family on the go."}
{"text":"Always had great food and great service here. Love the spicy sauce. The people in charge are always friendly and the place is clean."}
{"text":"Fast cheap build your own stone oven pizza place. I got pepperoni, sausage, meatball pizza w/ fresh mozzarella & a spicy marinara sauce. Was very affordable @ $7.49. Pizza was ready w/in 5 minutes. The staff was friendly & helpful. They were more than willing to help to explain the concept. The pizza came out very hot. Over all it was very good & I will be back."}
{"text":"First time trying the pizza. Very nice atmosphere & great concept. I tried the feature pizza of the month \" Shrimp Scampi\" pizza. BE AWARE when ordering with the shrimp topping.. Something is NOT fresh & NOW I'm suffering with Food poisoning... gggrrr..."}
{"text":"Why 2 stars? Because it's convenient, but it tastes convenient.      ---   ---   ---  99% of the time, I'll take quality over convenience and Pizzafire is a shining example as to why.   We were walking in to Game 7 of the World Series, and Downtown was a mad house. It seemed like every business had hundreds of people loitering in front of it, so when we saw Pizzafire with only a couple of people inside, we called an audible and decided to stop in. Sadly, we quickly realized why this was the only ghost town in the area.  You walk through a line similar to Chipotle and build your own individual pie. There's also the option to select one of the items from the menu, but the BYO option was too tempting to pass up, especially since you could add up to 5 toppings at the base price.  Here's where the convenience over quality comes in: as I'm going to eat the pie, it's just falling apart. Literally all the toppings and cheese are just coming off of the dough and falling onto my plate. It quickly turned into lasagna more than pizza. And the taste was 'okay' at best. I often eat Lean Cuisine pizzas for lunch at home, and it was comparable to that. On top of that, the red velvet cookie I picked up tasted like something from a gas station.  The folks here were nice and the customizable drink machine was the first one of its kind that I've seen from Pepsi, so that was neat. But the pizza left a lot to be desired. Thinking I may have just built a bad combination of toppings, I tried my brother's Hawaiian pie and it was also very 'meh' in the taste department.  Plus, we lost Game 7. Should I blame Pizzafire for that too? I mean, when I ate at Barrio before Game 6 of the Finals we won, sooo....."}
{"text":"Ordered a pizza for delivery and it took an hour and a half to be delivered. Wasn't any particular rush period either. The manager called several times and apologized and added a free pizza coupon. When it finally arrived, the pizza was totally cold. I used the coupon today and my pizza was burnt. At least they tried. I'm at a loss for words."}
{"text":"This restaurant grows their own herbs and lettuce and you can taste what a difference the freshness makes.   We got the Chicago and Margharita pizzas.  Both were delicious.  I was amazed by how fast they were ready.  The Margharita was so flavorful for as few ingredients goes into it, which is a testament to the quality of the ingredients used. Great sauce, dough, cheese and herbs. My boys slammed the meaty Chicago...we ended up getting them each their own.   The staff was friendly and efficient.  Since this was our first time they walked us through the menu and asked for our feedback.   We will be making this a regular stop."}
{"text":"Pizza Fire is decent, cheap pizza. I think it's pretty fair to compare it to a \"modern\" Ci Ci's Pizza. The pizza is large but I can eat all in one pizza because it's so thin. The first time I came I ordered the buffalo pizza and the sauce was dripping everywhere...I was basically eating buffalo soup with bread. I still ate it. The second time I went I order pepperoni with garlic sauce and it wasn't messy. The pizza is cooked fast and the staff is nice. It's a good place to take a bunch of kids because the place is pretty big. If two people are on your bill you'll most likely spend just under $25.  If you're a germaphobe I wouldn't go here. The staff was cleaning the pizza station and making pizzas at the same time. The rag bucket was so close to my pizza and the toppings it was kind of gross to see. The counter was a mess and just looked so dirty like they wait until the end to whipe the counter. The pop machine is the kind you touch to select your drink (yay more germy fingers). The counter was gross both times I went soooooooooo I'd pass if you're a germaphobe."}
{"text":"Went here before a concert. Cashier was pissed i asked for a new cup.... it was dirty, possibly used. She later was constantly dropping f bombs about how busy it was, and if it was always like this...shes \"Fucking quiting\".The tables were filthy. They do not often use cleaner to wipe down. Only carry a trashbag around, and toss boxes and plates.... nasty. The soda machine had no ice. The worker tried to get a drink, saw there was no ice..... did not fill the machine. The pizza was fresh...tasted ok. Like a step up from Speedways lol. Nothing great. I won't be returning."}
{"text":"I wanted to try a new place for pizza, so we decided on Pizza Fire to carry out two pizzas for lunch on a Saturday. At 1:30 pm there was a short line and it moved quickly. There are quite a few good options for specialty pizzas such as buffalo chicken and a pineapple, chicken and BBQ and also many ingredients to make your own combinations. Gluten free crust option and several sauce options including bacon ranch, BBQ, and spicy and regular red sauce, basil pesto and garlic oil. Cheese options include fresh mozzarella, shredded mozzarella and vegan, We opted for two pizzas with two and three ingredients and it cost about $16. The toppings included a wide variety of common meats and vegetables including broccoli and pineapple. The ingredients which all looked fresh are on display as the pizzas are made in front of you, subway style and placed in the oven in view of the customers. The pizzas only cook for about three minutes; the crust is a thin crust. The pizza was good although somewhat smaller than we thought they would be so two pizzas didn't quite satisfy five people although two people per pizza would probably be adequate.   I didn't feel like this was \"spectacular\" pizza and it definitely wasn't bad pizza. Perfect to meet for a lunch or a first date, before a movie, etc. Not destination eats by any means, but quick for pizza, lots of options and and tasty. They get bonus points for having gluten free and vegetarian options, though and I didn't think the prices were out of line with the product. There is a children's meal available as well."}
{"text":"Excellent food and friendly staff!  We love it!  My son enjoys being able to create his own pizza.  It's a fun and tasty experience!"}
{"text":"This place is kind of a sh*t show. I had to say my order, very slowly, 3 times and still got the wrong thing. And I got one of the menu items, not a create your own. Employees seemed very confused and were mostly standing around.   I am still going to give 3 though because the pizza was good once I got my hands on it and the shift manager seemed genuinely sorry and gave us a free cookie."}
{"text":"Ordered a margarita pizza and their breadsticks for delivery. When it showed up, both were cold and had to heat the items up in the oven. This probably took away from the taste, but over all taste was not that great. The breadsticks were also soaked in oil and were hardly edible.  Would probably try to eat in-store before I got it for delivery, if I were to order from here again. Has a lot of potential to be better, just needs some adjusting."}
{"text":"Ordered a \"Cleveland\" with extra mozzarella cheese I saw two spots of mozzarella and that was it.  Not the best pizza but convenient. No deal on prices either"}
{"text":"i'm looking forward to Pizza Fire opening in Fairlawn (close to work) and Strongsville (close to home).  Today Danielle and I went to the Cuyahoga Falls location and tried it for the first time, and I think I'm in love.  Danielle had a 1-topping pizza (tomato) w/ fresh mozzarella and roasted garlic and oil. she had said it could use some salt or even more sauce but it was good.  I had a 3-topping pizza (tuscan pepperoni, banana pepper and mushrooms) w/ the spicy Neapolitan sauce. I loved the crispy crust. the toppings were delicious (though the mushrooms were not at all \"fresh\" - they were clearly canned). the sauce was spicy but not too much so. had we not also gotten the PizzaFire breadsticks i could have easily eaten another pizza.  there are salads, gluten-free crusts and vegan cheese also for those who have chosen to jump on those trends. like i said, i look forward to this place opening in Fairlawn (wherever/whenever) that might be. it's going to be a huge hit with my coworkers as well."}
{"text":"Great concept poor execution. Nice and fast when you order but like most other people said skimping on the toppings and canned mushroom. Don't promote yourself as using fresh ingredients if you chose to use canned products. 1 meatball split among the pizza, really. It did reheat well, although I thought the sauce was bland."}
{"text":"Still a fairly new location, we were excited to try it out but were a bit disappointed.   Waiting time: there were 8 or 10 people ahead of us. I think we waited about 30 minutes until we ended up getting our pizza. Not horrible for a Saturday evening.  Staff: I'm sure they are still adjusting and a bit overwhelmed. Not much energy or enthusiasm from most of them.   Food: it looked good.. cooked well! Taste wise not bad, not great. My pizza was pretty bland including the dough, sauce and chicken. The pizza rolls were okay.   All in all not the worst experience but probably not one to make us return. Maybe it will be better with time."}
{"text":"Stopped by for lunch it was 11:45, they are slow. I felt bad for the guy at the front asking what you wanted because he made the whole pizza including putting it on the fire oven. He did this while 4 others stood around. 1 stood at the end of the ingredients just to write your name on the ticket and what you ordered. 1 stood in front of the cash register, another right behind her and the last one just standing there doing nothing. When they called my name to get the pizza or ordered the crust was burnt. The guy just stood there like here you go, I said thanks but I would prefer one that wasn't burnt. Another gentlemen had just come out from the back and said oh no problem we'll get you another one. I believe he was the owner, nice guy he came out and gave me a card for a free pizza and apologized. I'm not sure if he wasn't there I might have been stuck eating a burnt pizza. So thank you.    I gave a three cause the pizza was decent. Hopefully the slowness and the dirty tables are just cause it's new.  Otherwise it might not last long."}
{"text":"Excellent concept-quick pizza, which when done right is quick. Not the best but isn't trying to be based on the casual space and low price."}
{"text":"Kids eat free on Wednesday with adult purchase. Great pizza and wings. Downside = slow service"}
{"text":"Its a bit slow which was frustrating during lunch.  This made me want to leave a 3 star.  Lunch is not a good time to train a new register employee either with the folks trying to make pizza having to baby sit and thus slow them down as well.    They at least have great pizza.  Sure, its not the best wood fired in the world, but its solid and the toppings are fresh and good.  The New York and Cleveland are too good examples of flavorful and great pizza.  The Margherita also looked excellent on someone else's table.    The antipasto salad was underwhelming but again, fresh lettuce and good ingredient quality without variety.    The major complaint other than the lack of speed for this day is to tell the topping guy to quit chewing his gum like a cow as he made my pizza.  In other words, my review, good food not so great staff.  Management should pay a visit and look as a customer for some improvement."}
{"text":"And it's a NO from me. Pizza crust is burnt and tastes bland.  Barely any sauce.  Toppings taste bland.  My daughter took one look and said Yuck!  I drove 20 minutes to get this small,  tasteless pizza.  Never again!  I'm sticking with Romeos in Berea."}
{"text":"Pizza was delicious. I got a build your own with spicy red sauce shredded mozz pepperoni sausage and bacon. Crust was super light and flakey and pizza was cooked perfectly. Everyone was very nice and polite. I would recommend online ordering at peak times because the line takes a while to get through but definitely enjoyed my experience."}
{"text":"I ordered from Pizzafire because I was craving pizza late at night and this was the only place that was open.  I'm happy I got my pizza fix, but this place is just average.  I guess it's good for late night drunken munchies, but when your sober no thanks!  I most likely won't order from here again because there are way better pizza places in the Cleveland area."}
{"text":"Pizza Fire is a great option when you want pizza and want it quick. I love the fact that you can make your own or order a type they already have created! My favorite pizza is definitely the Austin. I wish they had more specials or deals, especially since it is in a college town, but the prices are reasonable."}
{"text":"Before pizzafire moved into Strongsville, I didn't have any experience with neopolitan-style fast-fired pizza places. So as a pizza lover, I was *ecstatic* about this opening! Which made my experience all the more disappointing. You walk in, wait in line, order your pizza, they make it and queue it on a metal holding tower with a bunch of other people's creations. Then they throw it in a super hot oven, and you get pizza in 180 seconds, or so the ads say. The crust flavor is great, although a bit limited in what you can do with it (maybe due to time constraint). The cheese is a tad sparse, and having worked at pizza hut for 3 years as a teenager, I know that cheese is the biggest single ingredient cost to a pizzeria. So these factors lead me to ask this question: WHY DOES IT REQUIRE SO MUCH OF MY TIME AND MONEY?  My first experience was by myself, stopping in during lunch break. There was a line of about 10 people in front of me, and it moved I n c r e d I b l y s l o w. To the point that I considered walking out, but decided to wait it out since 20 mins in I'm pretty much time committed at that point. Approx 30-35 mins in, I make it to the counter. Hallelujah. Service is friendly and employees seem to be having a decent time, although I can not say the same for the customers. I order a simple pizza, it's assembled in less than a minute and put on the leaning tower of pizza (sorry ). I'm staring intently at my creation, I've become somewhat attached to it at this point. This part takes way longer than it should. In fact, just about every part does. You see, most of the advertising pitch is that you get personalized pizza, fresh ingredients, in 180 seconds. I did the math, and my visit was closer to 4,500 seconds. Yes, that's about 1 hour and 15 minutes that I waited. For a personal pizza. Work wasn't happy, but I was just relieved to bring my pizza back and partake in the gloriousness of neopolitan decadence. My enthusiasm faded quicker than you can say c'est la vie. The spices were good, not great. The quality of ingredients was good to excellent. But, I had seriously overestimated the amount of cheese they put on my pizza. It was like, you're making a pizza at home and having to grate your own cheese and your hand cramps up and you say screw it. And just throw it in anyway. If I wanted dough with pizza sauce and a few toppings, I would have... I don't know. Nobody serves that because nobody wants that. Except PF. And the kicker is that this single serve pizza with practically no cheese that probably cost them $0.87 in product cost me $8.99. And 1.25 hours of my time. Now like I said, the ingredients themselves were excellent, and service was friendly, hence two stars instead of one. But after that wait, I would have expected a coupon for next time, or at the very least, a free cookie or something. Nope. Nada. The second visit was with my wife. We were undecided where to have dinner, but had a bogo mailer coupon to PF and so I thought ok, maybe they have shored up the service times. We walk in and there are about 8 people in line in front of us. We waited close to ten minutes and the line had not budged at all. Fearing PF wait time cage match 2.0, we made the decision to go elsewhere, and walked out. Haven't been back since."}
{"text":"Went here today with a freind! Pizza was nothing great really! I took one bite and all my toppings came off with it! The ceasar salad I had was horrible! Soggy lettuce tiny pack of dressing and croutons! Tables were dirty! Ice machine barely had any ice! Won't be coming back! Nice concept but there are way better pizza places than this!"}
{"text":"Not sure why there is so much hate for this place.  I went today with The Wife and The Kid around lunch time.  There was no line and the ordering process was relatively easy.  Seemed to be more staff there than were probably necessary but I think some of them were getting trained.  The decor is industrial and +1 for the cool soda machine.  It smelled nicely of char but there was definitely an odor of burned gas.  It wasn't terribly pleasant, but fortunately there was a very nice patio outside with nice tables and chairs.    We ordered a Margherita pizza combo with meatball side and a Chicago style (think meat lovers) pizza.  They were fairly rapidly put together and baked in that huge oven.  Of note, their vaunted organic basil looked really pitiful- like it had been taken out many days ago.  See photos for proof.  They probably should pick out less of it at a time.    But how was the pizza?  That's all that matters right?  It was quite good.  We really enjoyed it.  Nice crust, good chew, appropriate amount of char.  Toppings were tasty- including surprisingly, the basil.  My daughter ate an entire piece- of which she rarely ever does.  The meatball was decent, though if I'm honest, it was lukewarm but the sauce was tasty.  Like the touch of having ricotta on it. I think it was about as good as \"My Pizzeta\" in NorRo and this is far more convenient.   I think that I'd consider calling an order in advance to grab and go.    So anyways, I thought this place was pretty good.  Hope they find a way to exhaust more of the fumes from the oven better because really that was the only really objectionable thing that I saw.  We'll be back again- when we're in the mood for pizza."}
{"text":"Fastly becoming my favorite place for pizza. It's fast, convenient, and delicious! Fresh ingredients and fast friendly service."}
{"text":"Awful service. The staff doesn't understand the preparation well. They are fumbling and trying to just make something out of bread and toppings. Uncourteous salesperson"}
{"text":"very disappointed with the delivery service.  it has been 2 hours and they are just not coming.  We ordered from 3 different places.  2 showed up and Pizzafire hasn't.  The Pizza is good. The delivery is a huge FAIL!"}
{"text":"We ordered here over the weekend. Fantastic. I never get out that way but Skip delivers for a pretty decent delivery fee so we tried it.  One 3 topping pizza, meatball, pepperoni, green peppper, spicy red sauce: So good, topping were great although the meatballs were smaller they were super yummy. The pizzas didn't come in sizes and was a tad smaller than I realized but I can plan for next time. It's about the size of a medium, thinner crust which I liked.  We also got the cinnamon sticks....oh baby. Soooo good and they give you a side of icing like in a package similar to how they present it when you buy a box of Toaster Strudel, perfect amount of icing inside. Very yummy I ate most of it myself lol.  Very good, I usually opt for Deweys but this is a close second. I will return here this summer."}
{"text":"Disgusted!! I ordered a margherita pizza to-go. I found a big piece of metal sitting on my pizza. Then, I tried a slice and it was so salty and inedible. I'm usually not picky about food, but this is just horrible. Of course they don't post a phone number to take any complaints. Never again!"}
{"text":"The Woodmere OH store was very very dirty. I found it quite disgusting. The staff were unorganized and seemed quite confused. Very disapointing."}
{"text":"I've been a few times. Once it was really good, the other times the pizzas have been burnt. Usually the basil is old. Employees seem very inexperienced and overwhelmed...even when there are only 2 customers."}
{"text":"service was terrible, i ordered online for 5 pizzas and when i got there they wrote down my order and made it right there, messed up three out of the five pizzas, while i stood waiting for my pizzas (which should have been ready) i witnessed most of the workers talking while only one person manned the counter. do not recommend for quality food. would have given zero stars but i am required to give at least one."}
{"text":"They took over 25 minutes  to make 3 pizzas and then dropped one and had to start over, which took an additional 15 minutes. All the pIzzas were cut poorly and they almost forgot to cut one.  After making it clear how unhappy I was, all they did was offer me a buy one get one free coupon."}
{"text":"I didn't know what to expect coming in here due to the discrepant ratings, but I was very pleased with our margherita pizza (with the spicy tomato sauce). The service was pretty fast (2 groups in front and we got our pizza in less than 10 minutes). I absolutely loved the fresh basil topping that was picked from the plant right before it went into the oven. Very chipotle like and low key with decent prices; pretty consistent with the downtown branch.  I love the classic, thin crust, Italian style pizzas, so this was very good.  I'd come back for fresh tasting pizzas coming right out of the oven. Great addition to the fast food scene."}
{"text":"Grand Opening 6/16/2017 I was excited to see this local chain open closer to me. I love Napolitano style pizza but hadn't gotten around to try any of the other locations.  Considering this was their grand opening (their sign was lit earlier in the week, I noticed), I expected a madhouse and opening day chaos. I knew from reading Yelp reviews for other area locations that wait time is an issue, so I went straight to the online ordering. On the main Pizzafire site, the Pizza of the Month Special is advertised, but when you go to the actual ordering website, there isn't an option to actual order the combo special. Determined not to waste my lunch hour or more waiting in person, I called the store to place an order for my small office (6 pizzas total). I was told I had to order online. When I noted my interest in the monthly special but inability to order it online, I was told to place the order without paying and that it would be taken care of at the store during pick-up. Well that sounded fine - aside from the refusal to take a phone order  - but there's no option for paying cash at pick-up. x2. So I reluctantly charged it. And then I noticed that I was being charged sales tax on a to go order of pizza - no drinks, etc. When I pointed this out as I waited for my pizzas (was told 10 minutes, but they weren't ready for over 20 minutes), it took two cashiers, one of whom had to consult a manager, to correct with a cash refund of the wrongfully charged tax. A barely uttered \"sorry\" and no indication of any appreciation for pointing out a(nother) glitch in their system. And that makes  x3.   I can roll with any one of these issues and has plenty of slack to give for the fact that it was they just opened, they probably had all new staff, and were very busy. I get it. We're all human. But I will wait a good while before thinking about trying them again. The pizza itself was okay. Not bad. But not great. To their credit, even though tickets were missing so the poor guy putting out orders wasn't sure what was coming out of the oven next, our orders were made correctly.  I tried the Hollywood and the flavors were good. The chicken looked like shredded from a can, but I'd rather have that than undercooked salmonella chunks. I also had a bit of my coworker's pepperoni. It wasn't the best and I wouldn't order it myself, but she liked it okay. Maybe I'm spoiled living in the Land with such an amazing food scene, but I was hoping for more.  It's worth noting that they have vegan cheese and gluten-free crust options.  As expected the lines to order and receive food were very long. If you give this place a try, order ahead. If you can... All in all a very 'meh' experience."}
{"text":"They are lucky that their food is so-so.  I'm standing here now writing this review because I'm pretty upset. They had a pretty easy website to navigate and order online, which I did. I then got a text message from them saying they got the order and are preparing. 20 min wait time. Cool! I work down the street so I went on my 15 minute break. \"I can make it on time!!\"   Low and behold, I get there, my order was never received or ever made. This tall man said, oh here it is, we just never started it. Are you kidding me? My coworker ordered The Hollywood and when the girl started making them, she explained they are out of BASIL PESTO. Girl.. make some.. I see all the basil in the world over there. You are a pizza shop. How do you run out of a main ingredient. Then, during the make of my Large Custom Salad, I said oh can I get chicken on that? He said, for $2 more... uMMM.. after all that, you're not just going to throw it on there? No thanks.  Then I got back and one of my coworkers pizza wasn't even cut.  End rant."}
{"text":"Worst margharita pizza I've ever had in my life. It was literally like campbell's tomato soup on toast, which is not an exaggeration. I really can't believe how bad it was. I wanted to throw it at them."}
{"text":"I have eaten here countless times and each time the pizza is amazing. There is a gentlemen who I believe is the manager that is extremely friendly and accommodating. He always checks on every table to make sure they have everything they need. My boyfriend has tried all of the specialty pizzas but favors the buffalo chicken one. I always order the 'create your own' with the garlic and oil sauce and vegan cheese. It is delicious and I love the variety of nice fresh toppings. The arugula option is a must (sadly they were out of it during my most recent visit so I substituted spinach). Even though it is always pretty busy when we head in, service and the on-the-spot cooking is quick."}
{"text":"The new menu is good, but the wings are great! Now there is three pizza sizes to choose from."}
{"text":"We went for kids eat free on Wednesday and that was wonderful. Kids had a blast. Every staff member was very friendly. My husband ordered the Buffalo chicken pizza and he enjoyed it I ordered the chicken Caesar salad and I was disappointed The salad was quite small for the price of eight dollars. We will definitely be back but I would not order a salad"}
{"text":"Fresh pizza fast... that is how this place rolls... after your pizza is made it cooks in about 3 minutes. The service is top notch and the Restraunt is clean."}
{"text":"This is a good concept executed quite poorly.   Ordering - The company recently \"upgraded\" the online ordering to a system that is less intuitive, slower and way to complicated for a store that basically sells different versions of the same thing.  Store- Clean and well kept. Staff - The best part of PIZZAFIRE is the people who are friendly and hard working.  Unfortunately, the stores seem understaffed and that was before they added delivery.  The result is a general feeling of chaos as they try to keep up with various orders from a combination of pick up, delivery and those choosing to eat at the store.  The result of this chaos is the Pizza is almost never ready when it says it will be.  In some cases i have showed up at the pickup time and they have not even started the process of making the pizza.  In another case the pizza was done but they did not realize and I waited for 20 minutes while the pizza sat on the counter behind the register.   Price - No complaints   Overall this is a good concept with a decent product that suffers tremendously from poor execution."}
{"text":"I have celiac disease, and I am rating this place one star *for people with celiac disease* -- if you don't have celiac disease, it looks like a fine place to eat.  They offer a gluten free pizza, and their website says they use separate gloves and a separate pizza cutter on gluten free pizzas, so I was excited to try it out. We went at a busy time, so there was quite a line. After 15 minutes, we get near the front of the line, where I can see the cooks preparing the pizzas. They pick each round of dough off the board and spin it in the air, and you can see clouds of flour flying off of it and landing right in the bins of sauce and ingredients, which are all right in front of the prep area.  So we got out of line and had to find somewhere else to eat. I understand Pizza Fire, like pretty much everywhere else, has a disclaimer that since it's all made in the same restaurant, they can't guarantee zero cross contamination. But for a place who offers the security of changing gloves and wiping down the prep area, I cannot believe how willing they are to dust all their sauces with a layer of flour every time they make a pizza!"}
{"text":"Tried for the first time last week. Even for the low price, I was not very impressed. The dough was not very good and under cooked. I expected it to taste like a wood oven cooked thin crust but is was just flappy and not the normal nice chewy-crispy texture. The topping and cheese portions were skimpy (just enough cheese to cover 80-90% of the pizza with a wide plane edge crust) and 5-6 pieces of canned mushrooms. Brick oven Freschetta pizza from the freezer section is much better, cheaper, and more substantial."}
{"text":"Pizza fire staff advertised opening day at 2/29 but store is still not open as of 3/2. Sign on door says next week."}
{"text":"Great place with excellent select of pizzas !! Enjoy going there everytime. Nice atmosphere with ample of parking in the evenings and weekends. The pizzas surpass any other pizzas I have tried thus far. Bryan is a very nice and friendly guy and makes sure the pizza is made to your liking. Would highly recommend this place !! Thx DR MD"}
{"text":"Great pizza. Not too heavy...nice choice of toppings.   Can take kids and they can order what they want.   Quick service at decent prices."}
{"text":"My favorite item at Pizza Fire is the unlimited toppings for $8.99. It's a good deal and you can put whatever meats and vegetables you want! I enjoy the buffalo chicken and meatballs. It is a clean environment inside but I usually get it to go. Pizza is on a thin slice which is good because you don't feel like you are overloading on the carbs like at other pizza joints. Only criticism I have is that it takes kinda long to make the pizza amd wait in line. Im not sure how they could improve that though since it already seems pretty efficient... Anyhow the wait is definitely worth it, and I recommend you try this place out!!!"}
{"text":"Pizzafire was delicious! This was my first time trying the place. The staff was extremely friendly and the food was fast and very good. I recommend this place to everyone!!!"}
{"text":"Delicious, fresh and fast pizza; made to order! Trendy atmosphere and friendly staff. Check it out for yourself!"}
{"text":"Today marked my second visit to Pizza Fire and I am confident in saying that my first very positive experience was not a fluke.  When we come in we are warmly greeted. The pizza is made in front of you not much unlike a subway sandwich. The pizza cooks in an astounding 3 minutes. The result is quite amazing."}
{"text":"We tried Pizza Fire today and it was good, but not great.  Pizza served quickly but the dough was not crisp. A little too under cooked for my taste. I had the Buffalo Chicken and my daughter had the pepperoni.   The location is in the same shopping center as the AMC theatre so they should cater to the movie goers, but I would have never located the place without using Yelp."}
{"text":"We had been wanting to go here for quite some time but when we found ourselves out and about and hungry, always forgot about it. Finally stopped one day in between lunch and dinner on a Sunday and it was empty inside. I liked reading about the history on the wall and found out that one of the founders founded Romeo's, another favorite pizza joint of mine. I also liked that the pizzas are a somewhat small size and thin but priced right--around $8 before you get topping-crazy, should you decide to do so. My husband and I like totally different styles of pizza--he's all about the various meats and untraditional sauce, whereas I love regular pizza sauce and pepperoni and mushrooms. Here, we both got what we wanted without spending $30 on two medium pizzas like we would elsewhere.   The pizzas were cooked nicely and very crisp--not doughy and thick so I wouldn't recommend it here if that's the style of pizza you're looking for. They also had a nice wood fired taste with a little brown without being burnt. I had traditional cheese pizza with pepperoni and mushrooms, and for as thin as it was, it was definitely on the greasier side. He had some sort of Tuscan pizza with a creamy ranch sauce, potatoes, chorizo, and onions on it. We both had about half leftover when we were full, even though it was thin pizza. I saw the garlic sauce when checking out and added that on for 70 cents hoping it'd be like Papa John's garlic dipping sauce, but it wasn't quite the same.   All in all, good place to come if you're with family or friends and you all like different styles of pizza or toppings. Everyone can get what they want without paying a fortune, and it's made fresh right in front of you!"}
{"text":"Terrible. Unedible pizza. I don't know where to start. The crust was undercooked but had burnt pieces on the bottom. My only guess is that it came from the oven. The sauce was also very bad. The sauasage was parthetic with no flavor. I would never go back."}
{"text":"This was my 2nd time here and to say that I love this place is an understatement!  Employees are incredibly friendly, service is real efficient and food is so dang good!"}
{"text":"Have eaten in & had it delivered, both times it's been some of the best quick pizza I've had!  Service in store is great, fast efficient & friendly. Create your own pizza for a reasonable price. Same goes for delivery too, ordering online is a breeze."}
{"text":"I really wasn't impressed but it was ok  I was disappointed they didn't serve Coca Cola products the salad was good - nothing special - I'm just - well the Order here and pickup here doesn't impress me - I like service it is run like a subway or chipotle  - I guess that's the idea for less employees"}
{"text":"Going in I didn't have very high expectations.  That all changed once I took my first bite.    I ordered the Cleveland pizza, and was really impressed by the dough and the sauce.  The pizzas are cooked in a brick oven stove, and come out crispy with a little bit of chew.  The sauce was flavorful with some slight spice to it, and not so  much in terms of acidity - definitely the highlight of my pizza.  My girlfriend ordered the Margherita pizza 72, and it was really good except for one thing - the salt.  They put some sea salt on the pizza, and her's tasted as though it got just a little too much.  It was still edible, but on the higher side of my salt tolerances.  I am happy that the old Zoup location has become a pizza shop!  The total wait time was about 10 minutes, so it will be a perfect lunch spot during the week."}
{"text":"I love their spicy sauce here. I personally feel pizza fire is a bit over priced but that doesnt take away from the fact that their food is good. I tried a ruben sandwich here which wasnt that bad but i felt i was better off eating the meat on a pizza.  The staff here are patient and really nice. They will recommend something for you if youre an indecisive customer."}
{"text":"The sudden appearance or this place combined with word-of-mouth hype and convenience of location led some friends and I to try it.  Not understanding the hype. Pretty basic mainstream pizza joint, where you get to stand in line and order either a pre-designed menu pie or one where you choose your own toppings. Not necessarily faster or better or worse than any other mainstream pizza place. Felt overpriced for what we got.  Nutshell: Meh."}
{"text":"Not you average pizza place. Far from average. The pizza has some unique flavors and toppings. It is awesome that you can see the wood fired grill in the restaurant. The food is average price. They also have one of those cool coke freestyle machines."}
{"text":"We were really looking forward to trying PizzaFire. What a great concept - pizza made to order in a matter of minutes. The idea is very similar to Chipotle, you place your order then watch while they make your pizza. Seems simple enough. I had their signature potato ranch pizza and my husband had a build your own pizza. While the pizzas were good, we're not planning on coming back any time soon. The restaurant was filthy!  All the tables and chairs in the small dining area needed to be wiped down, the floors were a mess, the area near the beverage dispenser needed to be cleaned and the food preparation area behind the counter was very messy!  No matter how good the food tastes, I will not return to a restaurant that is so dirty!"}
{"text":"I'm still upset they took away Qdoba and put this, but l write this review without any bias. The idea is genius, create your own personal pizza and have it ready in under 5 minutes. The pizza is good size, the amount of toppings and combinations is pretty much endless. The crust is good and crusty, not doughy like some other local pizza chains. They put a normal amount of cheese, I get light sauce usually because I don't really like the taste of tomato.  They place it in their brick oven and 4 minutes later dinner is served. Overall my whole family was able to eat for under $20. It was quick, delicious and filling."}
{"text":"5/25/16. Loved it the first time.  OK the 2nd and 3rd times. Last week: Too thin crust, canned mushrooms (were fresh on first visit), and pizza way over salted.  Bye, bye, Pizzafire."}
{"text":"Great new pizza place.  I love the ability to not only select a pizza already designed but I can also create my own.  The ingredients are fresh. The pizza is made relatively fast compared to other pizza locations.  Mine came out in a little under 10 minutes.  They are also on the Belly app, so you can earn points for free stuff."}
{"text":"So I wanted to be impressed.  I liked the pizza more than I liked the process that's for sure.  And the pizza was ok, not great. First, waiting in a crowded aisle by the nasty soda dispenser to get my order didn't really seem like a great design choice.   Second, speaking of soda, $2.49 for a very tiny cup that I fill myself at a dispenser overflowing with ice and other people's runoff?  McDonald's is selling any size drink for a dollar and they do the dirty work.  Finally, they say you don't want to see how the sausage is made. In this case I don't want to see how my pizza is baked. I watched my partially baked pie come out of the oven and sit while the cook complained that things were not cooking right.  Then after a minute back in it goes. According to the signs the crust should be slightly charred.  I got that on one side.  The other side was under cooked. There is better pizza available up and down.the block for less money.  Maybe with a good coupon I would try carryout at some point in the future, but I don't need the cattle call to place my order the the cattle call to get my order."}
{"text":"The regular pizzas are good, not keen on the flavor of the chicken that they put on the pizzas. Service is not fast, but not slow either. Nice place to go for individual pizzas."}
{"text":"Yummmm. I created a mess whereas my friend created a masterpiece. It's actually my second time coming back. The line is often very long during lunch hours though. Also, after about 3-5 toppings you are charged $1 for additional toppings.  Food was still pretty good. Stop by if you have the chance, but it's not really a place you go out of your way for."}
{"text":"Personally I like the pizza- but I've seen friends get small wack pizzas. So it's hit or miss. Little pricey but I don't care. Very good cookies!!!! Soda machine has options and touch screen but has Pepsi which is so lame. Diet Coke Hollywood and Margherita are best pizzas"}
{"text":"Wonderful food.  Close to the convention center with an easy 5 minute walk.  They go above and beyond to be customer friendly.  Lunch combo is a great deal.  small pizza with any toppings you want, side and a drink under $10.  Can't beat it for convenience and quality with quantity.  Check it out at least once.  It's the Subway / Chopotle of pizza joints.  We will be back for sure this weekend, even if it's only for carry out."}
{"text":"I've had much better from the frozen pizza aisle at my local grocery for a lower cost. Overpriced and lack of flavor. Not impressed."}
{"text":"If I could give this 0 stars I would. Delivery took an hour. Pizza arrived cold and not prepared as ordered. Sausage is completely unseasoned pork topping.  Gross is the only word I can think of to describe this pizza. Save your money. You'll get better pizza from the frozen food aisle at Giant Eagle."}
{"text":"Delish! I got the 72. Perfect. Saucy. Salty. Amazing. Haven't even gotten into my salad yet but had to post bc it's that good!"}
{"text":"My kids really LOVE this place!  They love picking out what is on their pizza and watching it being made. The people working there seem a bit disorganized and not very efficient.   My kids love going there and think this place is the best so we will definitely be back."}
{"text":"I'm here... right now... I just finished eating.  First of all, I was greeted right away and the girl explained to me that aside from their menu pizza, I can make my own. Staff in general was very polite which made the experience better.  I decided to go with one of my favorite pizzas, ever, the margherita pizza. Here they call it \"Margherita 72\" -- why 72 do you ask? Because according to them they only make 72 of them a day, and once they're gone, they're gone.   I ordered, paid, and sat down. Five minutes later, if not less, out came my pizza, it looked and smelled good, the crust was slightly burned a bit (photo) but I just peeled whatever was too burnt. I LOVE salty foods but wow is it salty! I think it's in the original sauce that I had. Anyway, this may be a concern for someone who doesn't like salty. This was a personal sized pizza but could easily feed two that aren't extremely hungry. The overall taste was OK, it didn't deliver for me on what I like my pizza to be. It was underwhelming. I am a big fan of Vincenza's Pizza on Prospect, and if you've had that, you know it's hard to compare anything else to their pizza.  I paid about $12 total for the pizza and a drink. I don't think I would return for pizza, maybe I'd give their salads a shot."}
{"text":"Quick, fast and yummy food. Pizza, wings, salad, meatballs. Lunch specials and combos. The staff was friendly and helped me navigate the menu. They had a very clean line and the vegetables looked fresh and clean. The buffalo pizza is my favorite and always comes out fast and hot. Great experience and made it through the line quickly. Very clean bathrooms too. $-$$"}
{"text":"Pizza is fast, cheap and good. The only problem was that I got 3 pizza and they were all cooked differently. The oven is huge and I think they have a hard time with heat distribution. But the pizza was great and the staff was very friendly. Close to home and love how fast they make the food."}
{"text":"This pizza always tastes great. I always get buffalo chicken, ham, and pineapple. Sometimes the tables are dirty but you can also get it delivered or to go. One thing I don't like however is their new pricing. They used to have different price brackets based on the number of toppings you added, now they charge per topping. Oh well"}
{"text":"Very nice pizza!! The dough was different from traditional pizza and it tasted great!! A bit overpriced. But worth it!"}
{"text":"Its very hit or miss for the downtown location, but if you know what to order its almost always good"}
{"text":"Good food ,great management and workers ,AWSOME cookies. They use a lot of fresh ingredients and the place is very clean"}
{"text":"50 minutes for an online order and didn't  offer a thing, not even an apology . Horrible customer service"}
{"text":"Ordered online. When I got there, there were issues with online orders being printed and so there was a fair wait compared with planned order ready time. Staff was nice but seemed overwhelmed by volume (was a Saturday night)  Pizza: dough was bit soggy, sauce was good. Toppings great but overall not really great pizza."}
{"text":"I have no idea what people see in this place, but presumably they see something, since this is the third branch opening in Northeast Ohio. They started in Akron (YEAH AKRON!) and now this is their newest branch. The pizza is nothing special, I was severely underwhelmed. It is exciting to stand in line, watch them get your meal ready and see them pull out an herbal plant every now and then to show you that they use only fresh ingredients but the outcome is sub par. I could make better pizza at home (and I don't cook often). I'm not saying it was bad, but I had leftovers and I didn't want to eat them. So that cinches it for me. My friend shared my opinion about the pizza. I got the Hollywood and she got the New York. Hers seemed better than mine. Neither of us really customized our pies, so maybe that could make a difference if you choose to try it out. The other people we were with seemed to like their pies (apart from one who found the Margherita pizza too salty, which I see has been an issue for other reviewers) so that's something I guess.   As for pricing, it is about $8 for your personal pizza, which would be exciting to me if I didn't find it worse than the average pizza chain in terms of taste. Since it doesn't compare, and you can get the others delivered to you for the same price + tip, I wouldn't call it a win from a financial standpoint either. Though perhaps in that part of downtown Cleveland, the pricing might appeal to some."}
{"text":"I stop here strictly out of convenience.  Overrated and overpriced \"pizza\". I regret it almost  immediately . $8.99 for a Margherita pizza the size of a frisbee with sparse toppings.."}
{"text":"This place needs major help with customer service.  The only kind person That smiled was the lady at the register.  No need to ever go back! Thanks for the poorly crafted burnt Pizza and overall bad experience.  The manager with the bad attitude is probably the root of these issues."}
{"text":"So far not off to a great start, as my order was being prepared, the girl put the wrong toppings on twice, I asked for sun-dried tomatoes and she put regular, I asked for artichoke hearts and she put mushroom..she removed the mushroom but never took off the original tomatoes (which I'm sure I was charged for) also this \"180 second\" oven is a joke..took way to long to get our food! And the place is empty. We can in 30 mins after opening.. The taste wasn't bad but not awesome by any means.."}
{"text":"I got the Hollywood - free range chicken, peppers, onions, with - my favorite sauce ever - PESTO.  Pizza was baked to perfection, no burns on my pizza which is hard to see when it comes to fire baked pizza places.   Personally, I think the best part about this particular franchise is Garrett. Such a personable, energetic, and passionate employee, his service makes me want to return to this particular store just to see him."}
{"text":"I have to admit, I was pleasantly surprised at just how good the pizza was.  A co-worker and I showed up just before the lunch rush, which gave us ample opportunity to review the menu.  I opted for mushrooms, italian sausage and fresh basil.  My pizza was cooked to perfection.  I can't wait to return!"}
{"text":"I am short on time but just have to stop and offer a review.  I will keep this brief as there honestly is not much to say; This was simple the best artisan pizza I have ever had hands down.   Look it is a little pricey but that is what you get when you visit a place where everything is homemade, high end ingredients and expertly prepared.   When each and every ingredient can stand on its own you know you have something. I mean you could just eat the crust with nothing on it; flavorful and the texture is outstanding.. You could easily have that and dip it in the zesty sauce; great snack. The sausage.. OMG the sausage full of flavor, not fatty and none of the little hard bits you get in low end sausage. The vegetables are vibrant and fresh.   I have only been here twice and need to come much more often.  Oh, the service is on-point as well."}
{"text":"I love Pizza Fire. It is quick and they use fresh products! The staff is always professional. They also have Pepsi, which is big deal for me because I am a Pepsi lover"}
{"text":"Delicious pizza! I love their pizza and breadsticks are the best. I highly recommend for a nice lunch. Everything tasted fresh and was delicious. Nice staff as well!"}
{"text":"Was a little skeptical about this place at first, but boy am I glad I chose to get it for dinner tonight. I made my own pizza with BBQ sauce, chicken, bacon, and onions. Only $7.49 which IMO is a good value. The ingredients were fresh and the pizza itself was great. You get about 6 small pieces. Would give 5 stars if it was a bit faster. I spent about 15-20 minutes in the store."}
{"text":"Such a wonderful restaurant with wonderful fresh food. The staff was amazing. The best pizza I've ever had!!!! The place was spotless. Can't wait for one to open in my city :)"}
{"text":"Place is awesome....Everything from scratch and countless toppings to choose from...Even 5 different cheese and sauce options. Cooked fresh while you wait. What a fresh alternative to other pizza restaurants!!"}
{"text":"I was a fan at first.  It's a great concept but not performed well at PizzaFire.  I noticed they use a lot of oil and press their dough in a machine.  What was a nice, new looking oven is now blackened inside.  I thought this was normal from usage but noticed my pizzas were coming out dark on the bottom, but not crispy dark - scum dark with the caked on oil from the oven.  They claim it's \"real Italian\" but I've been to Italy and they use semolina flour - not oil.  Given the obviously unhappy staff, my visits there became extremely disappointing."}
{"text":"Its chipotle for pizza, decent size for a person and good hot pizza's..not overloaded with cheese like other pizza joints. Must try !!"}
{"text":"Hubby and I had our first Pizzafire experience here, and were not disappointed. On a whim, we ordered the Buffalo pizza ... creamy bacon ranch sauce, mozzarella cheese, and buffalo chicken, (nicely shredded chicken, not chunks). It was finished with a swirl of hot sauce. Very tasty ... good crust, right amount of heat tempered with the cool ranch bacon sauce. We also tried the pepperoni rolls, which are a definite fave! Quick, convenient, and most of all, delicious ... we'll be back."}
{"text":"The whole staff was great, and Nick had an excellent energy and made the whole lunch experience cheerful."}
{"text":"they changed their menu. everything is so expensive and overpriced now. WOULD NOT RECOMMEND!!"}
{"text":"Good and fast service. The food is nothing special. The pizza is flavorless, extremely thin, and soggy. Don't waste your money or your time"}
{"text":"My colleagues and I just went there for lunch today. We left the office and returned within an hour. That tells you service was quick. Each of us ordered the 3 topping pizza which is $7.50. The pizza was made and cooked with in 8 - 10 minutes. Everyone at our table like the pizza they ordered. There were no complaints and all said we will come again. I did see some customers walk out due to the long line so I recommend getting there early. The restaurant is a bit crowded and cramped at lunch time but the place was clean."}
{"text":"Not at all happy with this place the whole idea is to get a pizza how you want it and fast well I just paid 2.00 extra for 2oz of cheese that is so crazy to me I can buy a whole bag of cheese for that price and then they put very little of the other toppings you are paying for!! Never again"}
{"text":"My first time here on the evening of 12/9/17 was pure disappointment. The menu TVs were in the wrong order. The first one was just an ad. The rest were closer to the register than the first place you order. The menus were also too hard to read due to such small font. As my family and I were trying to figure out what to order and trying to squint to read the menu the worker kept spouting out \"What can I get you?\" impatiently. So...we left. Doubt we will be back. Thumbs down. Penn station got our money last night."}
{"text":"This was our first visit and the food was amazing! We got a Chicago pizza and garlic stick and both were very good. The service was also fast and friendly, we will be back!"}
{"text":"I originally went here when they first opened and had a very poor experience. But, I recently learned they delivered and saw they had some great specials for delivery. The delivery was insanely fast! I'm probably about a ten minute drive from the location, my pizza arrived in less than 20 minutes. This was very impressive. My only complaint was that my pizza wasn't cut at all, and that is a pretty big complaint. Aside from that, the pizza and firestix were great for the price and the delivery time was very impressive."}
{"text":"It's the Chipotle of pizza.  Nothing special, nothing bad, made to order with the toppings you choose. I think the gold standard of any pizza place is the pepperoni pie.  Pizzafire's is just unremarkable.  Undercooked sauce (apparently Neapolitans eat raw tomato sauce), skimpy on the cheese, crust has no character.  There are lots of places around town where I can get the same or better pizza.    If you are going to die without a slice of pizza, you can get one here. if things aren't that dire, drive the extra two miles to Sweet Basil."}
{"text":"Sometimes the concept is better than the execution, and that's often the case at the PizzaFire in Kent. A pizza place, open late, that's affordable? A dream come true!   Though, for sure there are things to improve. First, PizzaFire has no parking of its own so either you make a hike to get there or park illegally if you go there during the day, and best believe Kent City Parking Compliance will be there to snipe you.   Second, there's no consistency in the product. Even though it's customizable, I should still be able to expect a crust cooked evenly through every time or slices evenly cut. Many times that does not happen, even in regards to ingredients. For example, some days their spicy red sauce is inedible from heat and spice and some days, it's indistinguishable from the regular red sauce.   I'm hoping some of those kinks work their way out, since this is a newer location with a staff that seems inexperienced. In any case, I always leave quickly and satisfied with the end product."}
{"text":"Good custom pizza place. Owner/Manager always very pleasant, so is the rest of the staff. Rare thin, wood oven pizza crust with pesto sauce instead of the regular marinara is the way to go for me!"}
{"text":"Let me first start by saying that Pizza Fire has great pizza, but the customer service is HORRIBLE! As we walked in the door no one greeted us, no one asked if we needed help with our order. I went to refill my drink and I did spill the drink on the floor, I did clean up my mess but no one at Pizza Fire had the decency to ask for help, I got a very rude commented from an employee, she looked at the mess and said \"Really.\" I told her I was sorry I'm cleaning it up.   Working customer service you NEED TO GREET YOUR GUEST AND CUSTOMERS that come into your place of work. Great customer service is very important when it comes to keeping a company, without great customer service you have nothing.... if I could give no stars I would."}
{"text":"False advertising... Fast?? The pizza doesn't take long to \"cook\". Sadly the employees were only cooking 2 at a time. With 1 person in front of me & 3 in my group it took over 30 min.   Fresh?? I got the mushrooms. They were very clearly canned. Maybe they mean fresh out of a can?  Pizza was pretty bland. Outside crust had a burnt taste but the middle was soggy & undercooked. In case you are wondering about the \"everyone gets what they want\" the pizzas approx 8\" with a thin crust. Not sure everyone in the family needs to get their own."}
{"text":"If you like half your slightly warm toppings on your tray - this is the spot for you. The pizza was too thin in middle to hold them. Disappointing."}
{"text":"Pizza menu and salad selection looked good.  Staff was friendly.  Prices were reasonable.  Toppings and (green) sauce were good, but the crust was burned in spots, greasy in others. Wanted a beer but not served there.  Sadly empty for a Sunday lunch."}
{"text":"Okay food. The service and the prices for the items make it not worthwhile. Ordered online and had my order ready and the woman behind the register didn't bother asking why I've been sitting and waiting for fifteen minutes finally the man making pizza had to say something. Managed to forget my meatballs and when I asked for them scooped three tiny meatballs into a cup which cost $3. Overpriced, bad service, not worth it."}
{"text":"Quick and delicious...lots of good fresh choices. From order to receiving my pizza was about 4 minutes tops on a crowded day."}
{"text":"Interesting spin on the pizza place. Like most they have a specialty menu but you can build your own, lots of different topping to choose from. The pizza isn't thick, its thin all around and crispy. They prepare it right in front of you like the subway counter then toss it in the old style rotating oven. The flavors weren't strong and defined but it wasn't a bad pizza at all."}
{"text":"I love Pizza Fire for a quick dinner when we are heading to a game or event, or for a cheap and easy dinner when we have the kids in tow.   Pizza Fire offers a thinner crust, fired in a brick oven, so it's nice and crisp. The crust can occasionally get a little burned in spots, and my kids hate that, but I just tell them to eat around it. :)  The featured pizza offerings seem to taste better than what I have concocted on my own, so just stick to those. Also, try a salad. Their lettuce is hydroponically grown and picked fresh daily, and their house Italian is really good!  Food is totally worth the stop...but this is Euclid Ave, so it is a bit of a hike from the Q or Progressive Field...and sometimes you just never know what you might find. On our last trip here with the kids, we encountered a woman outdoors who seemed to have some mental health issues. She told the kids (who had not spoken to her), \"See, I told you your dad was an a--hole!\"...and then she walked off. In all fairness that could happen anywhere, especially in a city center. My kids were a little thrown by it, but we used the opportunity to talk about mental health."}
{"text":"I went here last night and was not impressed.  The guy who took my order made me the wrong pizza so he had to start it over.  I ordered the Chicago which is supposedly an award winning pizza.  The pizza was generous with topping but unfortunately the crust was soggy and kept flopping over with all the weight of the toppings. It tasted ok but nothing special at all kinda like what you get at the food court in the mall.  The breadsticks were ok but nothing to write home about.  They claim the pizza takes 3 minutes to cook but I was in there about half an hour waiting for my food.  I could've went to any pizza place and waited that long.  There are several better options in the area I don't think I will be back."}
{"text":"Our first visit to Pizza Fire was pretty much of a disappointment overall. Pizzas done so quickly we discovered the dough was raw in the middle. Crust is more chewy than crispy. Definitely edible, but nothing at all special.  We had 3 pizzas and none of us was very happy with the food. The chicken is minced, so not much flavor at all. I see the \"concept\" -- try to turn the whole artisan pizza thing into a fast-casual chain -- but I'd rather pay a few dollars more for an actual artisan pizza.   Salads, which sounded pretty appetizing as described on the menu. were unfortunately of the pre-made, grab-and-go variety, so we politely passed on those. They looked pretty tired.  Prices seem somewhat high for what you get -- around $30 for three at a place like this is too much for me, especially considering the atmosphere.  As far as atmosphere goes, they have done absolutely nothing to this former Qdoba space except take down the Qdoba signage. It is very cold. The place was completely empty when we had dinner, and the booths on either side of us were filled with pizza boxes being folded. The TV blared women's college basketball. Nice.  When you have 3 leftover half-pizzas in the fridge and no one is interested in taking them for Monday's lunch, you know it wasn't worth it.  For the \"real thing\" -- please visit In Forno in Avon."}
{"text":"I'm in Cleveland on business and ordered delivery from Pizza Fire. It was awful, I wish I had ordered Domino's.   I got a garden salad with ranch. This was a tiny pathetic salad. The ranch was obviously from a jar - it was thick and somewhat sour. Not pleasant.   The pizza was a \"make your own\" and they didn't include all of the toppings. There was also practically no cheese, even though I ordered two types of cheese. The sauce was overly salty and there was a ton of it. And the whole pizza was burnt.   Overall, bad experience."}
{"text":"PIZZAFIRE is one of the better pizzas that I've had in the Akron area. I don't care much for many restaurants using the now-cliche Chipotle style of serving fast casual, but PIZZAFIRE is one of the rare hits of this format. My grandma and I come here often, and she always gets what I ordered the first time we came here: the Austin with parmesan ranch sauce instead of BBQ sauce. I really like the gluten-free menu items. While the gluten-covered crust tastes better, the gluten-free crust is almost as good and is goes through my body well. I don't even need to poop after eating their gluten-free crust. Impressive!  They have one of those new Pepsi machines that lets you mix and match drinks with flavors. The machine also dispenses SoBe Life Water, so there's that.  Please forego going to Chipotle one day by coming here."}
{"text":"We stopped in on a recommendation from my cousin. First off, the wait was a bit much. For having to stand in line for my food and only having about ten people in front of me we were there too long. The sign out front said \"custom pizza in under 180 seconds\". It was more like fifteen minutes.  That being said though, the guy making our pizza was very polite and fun. We let him customize a pizza for us his own way, a surprise. Honestly, after just coming from Italy very recently and being a bit disappointed with their pizza, I was amazed. Probably one of the best tasting pizza concoctions I've ever had. I ate my whole pizza and half of my wife's. It had to be done...  In short: Great people, great product, needs work on the process, wait time was a little much. Perhaps another oven?"}
{"text":"Went here recently for a quick dinner.  As far as fast casual goes, this is one of my new favorite places.  Probably because I'm a fan of Romeo's, whose owner is a part of this chain.  I have been to another pizza place like this but found that they burnt the crust a little.  Pizza Fire did not - the crust was not too crispy or too soft.  They have a variety of veggie and meat toppings and for just a couple dollars more, you can have unlimited toppings.  The staff were very friendly and made sure we were enjoying our food more than once.  They also have a Pepsi machine with all the different sodas.  The firestix were a little disappointing. The garlic flavor was ok, but this type of dough doesn't get too fluffy so it felt flat and one note.  This location is right down the plaza from the AMC so perfect for dinner and a movie."}
{"text":"I ordered pizza online Sunday night. Wanted it delivered but apparently they weren't delivering because the weather they said?  Why its cold? WOW....Said pizza would be ready at 5pm. Got to pizza fire to learn that the ingredients on the pizza I ordered were out. Employees were annoyed when I was thinking about ordering a different pizza instead of settling for what they made already minus the caramelized onions (one of the reason for ordering that pizza). Did not end up walking out of Pizza fire for another 20+ minutes for them to cook, cut and box the pizza. Place was a mess too. All the employees working there were standing around, didnt care if people were waiting and was just overall a bad experience. By the time I got home, pizza was cold already, cut like a child did it and had spent $30 for a terrible experience.  My wife said I am better off giving them a chance to address the issue with an inquiry through website instead of a bad yelp review because they're new and I should give them the benefit of the doubt. I go to leave a comment through the website and then it doesnt work!!!! HA!  Oh well, I can go to Town Hall in Ohio City and get better gluten free pizza and better service for the same price minus the attitude.  There you go...Goodluck, she might be back but I probably wont."}
{"text":"My wife and I went for our first time today. Love the idea and the choice of toppings however when it came down to the final product I wasn't impressed whatsoever. First thing, the crust in the center was floppy and not crispy like I would have expected. It also seemed underdone. The sausage was like cat food, i have never seen sausage with a mooshy texture. The outside crust was good but overall I was disappointed. Perhaps if you go ask them to put the pizza In a little longer. The cheese wasn't even browned ever so slightly. I could go to Aldi and make a frozen pizza taste better."}
{"text":"The pizzas are on the small side but that's not the issue. Half the crust was soggy and the other half kinda burnt and crunchy. We ate there to support a fundraiser buy I don't think we'll be going back anytime soon. The quality of the pizza is not worth it."}
{"text":"Interesting concept. Margarita Pizza was good, crust a little burnt. Say no the breadsticks, it's just the pizza crust with some seasonings. The staff was very entertaining and friendly."}
{"text":"Yummy personal pizza's made to order! If you are wanting it well done be sure to ask them to keep in in the over a little longer."}
{"text":"We ordered from Uber eats, and the initial wait time was about 40 minutes. We ended up waiting far longer, approximately 1. 5hours and we live a little more than ten minutes away. The pizza was really cold and Soggy so my guess is that it was more an Uber issue than the pizza, but Parma doesn't exactly strike me as an Uber Hotspot so that could also be the issue. Once the driver picked up the food it arrived in good time. Unfortunately there wasn't a way to leave feedback on Uber so I can't even do that. I might order again but never from Uber eats."}
{"text":"Got two soggy pizzas without much taste. The pizza gets cooked quickly but not that well. I'd rather wait longer and get good pizza."}
{"text":"I like the made-to-order pizza concept and the relatively quick turnaround--about 5 1/2 minutes from finishing the toppings to being handed my pizza at the counter.  What I did not like was the quality of the toppings:  I ordered the meat-centric Chicago pizza which came with Italian \"sausage\" that was ground down to nearly powder form, crumbled pieces of meatball (ironically about the size you would expect Italian sausage toppings to be), and bacon bit-sized pieces of bacon (though, thankfully, were not as dry as actual bacon bits).  With the focus on a quick-cooking, thin-crust pizza, toppings might be the best way for a Pizza Fire pizza to stand out, but clearly the focus is churning out cheap pizzas instead of taste.  The single pizza ($8.49) I had for dinner was a decent amount of food and can probably be split between two people pretty easily.  Fountain drinks are $2.29 with free refills.  Pass on the $0.79 garlic sauce containers--the thin-crust pizza does not give you much to work with for dipping.  More attention to cleaning tables is needed."}
{"text":"Let me first off by saying that I was excited about trying Pizza Fire finally since it took over the space of a sub place my coworker and I frequented. Today we ordered our food online. The online ordering process could use some improvement. (more on this later). The website said our food should be ready within 20 minutes of ordering so we gauged our departure from work to the store based upon that. I mean we're working with only 30 minutes. All minutes are crucial. Anywho, by our judgment ordering at 12:30 should have had our food ready by 12:50. We arrived at the store at 12:53 and they haven't even made the pizzas yet. We ended up sitting for another 7 minutes waiting on our pizza to be created and fired. Not only that but I got a combo with a salad and that wasn't even made. They make it when you arrive. It would have been nice to know this on the website. It would have also been nice to have had the salad made while we waited on our pizza. 2 and 2 is not 4 here. The efficiency is lacking. In the rush of making my friends pizza, half of the pizza had no toppings.  Thanks Pizza Fire. You can miss me on the lunch run from here on out."}
{"text":"I enjoy the concept of Pizzafire but the service was bad and the pizza had too much \"flop\". We waited a long time in line to have our pizzas assembled even though there was only one customer ahead of us. I was very displeased with out wet the pizzas turned out to be. I ordered a simple pepperoni where as my guest had a veggie. We both felt like for \"making\" our own pizzas we should have been more satisfied. I don't think I'll go back to this particular fast casual restaurant."}
{"text":"Showed up on a Thursday evening with a group of about nine. The Indians were playing that night but I had no trouble finding a free spot along Euclid not far from the restaurant. The place had a constant stream of customers, but it was not too busy inside and we were able to put together three tables for our group. Also found no issue with the cleanliness or decor, and I would like to mention that although the music was a little older, it was nice to know all of the words and a couple guests were even bopping along to the music in their seats.   Staff was friendly and informative when I asked about the ingredients and which pizza's they favored. Turns out they get their veggies from a local source and I even saw someone get a whole basil plant from the back! You start out with about a 12 inch pizza dough (I'm guessing here) and you can either select a house specialty or choose from a variety of toppings to create your own. It's also neat that you can see them build the pizza right in front of you so you can ask for a little more or less of something as they are putting your toppings on. Next up they place your pie in a special Italian fire oven where it bakes for about 3 minutes and comes out hot with a couple specks of black but definitely not burnt.   I went with The Buffalo pizza and it was definitely cheesy with a good amount of buffalo chicken shredded on it. I thought it was pretty tasty! There was about 1  1/2 - 2 inches of plain flat crust which I am not always a fan of, but you could easily get a side of sauce to dip it in if you don't want to throw the crust away. The pizza is cut into six slices so you could share it or eat it all yourself without too much guilt since it is thin. Others at my table got The New York and The Hollywood pizza and both of them looked pretty tasty as well. One person said their Margherita pizza had way too much sea salt on it so if you get that one maybe ask for less salt when they make it.   Overall I'd recommend this place for a fast and simple bite to eat if you're downtown AND it's also pretty affordable at about $8 a pizza. They offer salads and big cookies too if you want to balance out your meal :) A little side note: the owner of Pizza Fire also founded Romeo's Pizza so it's no surprise they are busting out other locations right away. Besides having a location in Akron they will be opening up spots in Cuyahoga Falls, Rocky River, Kent, and Strongsville soon!"}
{"text":"Ate at the PizzaFire in Rocky River tonight with our family. The pizza was amazing. The ingredients are exactly as advertised. Super fresh basil, meats, cheeses and veggies!! Even better than the food though, was the GM Dennis who introduced himself to us and made sure we always had everything we needed!! We will be back again very soon!! *side note if you like bar-b-que and pineapple \"The Austin\" is the way to go!!!"}
{"text":"If think this is good, you need to get out more. Over priced garbage. My boyfriend brought home 3 pizzas bc he was shocked at how small they were and I was flabbergasted they were charging close to $9 each. Chef  Boyardee pizza is better. Heck better yet hit JJs pizza in Fairview. This was atrocious and embarrassingly bad. They won't last. Bank on it."}
{"text":"Pizza was so-so  Went and both times I went the crust was really soggy in the center of the pizza. I had to eat with knife and fork so the toppings didnt end up in my lap.  I didnt have any problems with the staff, they were not overly friendly, but were not rude either.  I ordered the buffalo chicken pizza and Cleveland Pizza.  If I didnt have the buy one get one free card, I wouldnt have gone. I feel for the price of a pizza its overpriced.  Also it was soggy which made the center of it taste doughy.  They dont have choc. milk for my kid so we had to bring it in with us. (only have capri sun- yuck)  Overall its ok, but im not in any hurry to come back."}
{"text":"Ok I have called ahead twice now for carry out and given a half hour notice the first time and 45 minutes the next time and both times the pizzas have not been ready even when I am 5-10 minutes late. Not good service. Feels disorganized."}
{"text":"Today was an opportunity for Pizza Fire to shine or it would be our last visit. We had free pizza coupons due to lousy service on our last visit. Not much has changed except for the prices and the menu. Coupon stated unlimited toppings. I found out that fresh mozzarella was not a topping?  So I paid the extra $, scratching my head \" if it's not a topping what could it be\"? Hey, I was getting a free pizza so $ wasn't a big deal. If you like soggy pizza you would have loved this one. My husband always orders the unlimited or build your own pizza.  Nope, not any more it is off the menu. My husbands pizza was as soggy as mine. Ugh! They were a little more organized than past visits but the pizza needs to improve. Looks like Neapolitan Pizza in the strip mall in front of Costco gets my business with friendly organized staff and a nice crust."}
{"text":"Basically what you would expect. It's a step above frozen pizza or CiCis. It's \"good enough.\" It's a great place for a young family to take their kids, or for early teenage kids to hang out. Adult taste buds will be less-than-impressed, but I don't think that's their market. Ingredients are fresh, the dough is \"fine,\" and the selection of sauces is interesting enough.   It's good for what it is. Nothing more, nothing less."}
{"text":"Has a coupon and saw the special was a shrimp scapi pizza so I figured I would give Pizzafire a try and I have to say I was a bit disapointed.  The decor  and the space is dividers into half dining area and half production line.  I counted 6 different people who handled my order: dough cheese & sauce person, toppings person, to the oven person, out of the oven person, cashier, and delivers the pizza person.  It seemed a bit much and it just seems to be the oposite of what a Neapolitan pizza should be; simple and lovingly prepared.    The shrimp pizza was a bit of a disapointment.  The crust is a hybrid of American and Neapolitan crusts, thin but not quite as simple and a bit boring to me.  The garlic sauce did not quite hit the spot, I think a touch of salt would have helped.  The cheese was ok, nothing special.  The shrimp were cooked when they went in the oven so they came out overcooked and rubbery.  Overall the pie was a bit bland and unexciting.  The breadsticks followed used the same crust and sauce with the same results.  They did come with the tomato sauce for dipping which I thought was a bit one not as well and lacked the slight sweetness I would have hoped for.  Pizzafire is hoping to be the \"Chipotle\" of pizza; unfortunately I found it to be not like the \"Taco Bell\" of pizzas; lacking in flavor and not a true representation of the cusine.  Of course your mileage may vary."}
{"text":"This place is going to be a huge hit. It's really conveniently located right on Euclid next a healthline stop. The style of build-your-own pizza is great because you can see every ingredient you're putting on it. The service is incredibly fast and it tastes fantastic. One recommendation I have to them would be to make a whole grain crust option for people who might want a slightly healthier option. An overall fantastic experience!"}
{"text":"First time ever trying it and first glance everything looked clean and good. The line was OK and we ordered margarita pizza and the buffalo with the neat balls spicy. Very pleased with the service and the transaction. The taste was great and good quality. We will come again!"}
{"text":"Good pizza yes, great pizza no.  Gas fired rotating oven Ritchie look, not true to the name.  They are close to a fired pizza but not there.   The crust gets soggy quickly, although the crust taste is great.  Al in all I will be back."}
{"text":"Pizzas   are great.. dough is light... I have had 3 different pizzas  and one I picked the ingredients . ..All awedome. Friendly  staff...."}
{"text":"My boyfriend and I enjoyed eating at Pizza Fire on Portage Trail this afternoon!  We got our food quickly (as they advertise) and it tasted great.  The District Manager, David, was very nice and wanted to ensure that we had a good experience.  He offered both of us a scratch-off card that can be redeemed when purchasing a pizza and gave us 2 more (before we left) that we could use during our next visit.  We \"won\" a free soda and a free cookie - he let us redeem them today.  This was my first time ever trying Pizza Fire and I will definitely be coming back to this location."}
{"text":"It was a late night in beautiful downtown Cleveland.   Although I had already eaten, the Fat Boy in me was dying to come out so I sauntered over to Pizzafire; a restaurant within a short distance of my hotel.. I was incredulous about the 180 second pizza claim, but sure enough, my pepperoni, beef, and green olive pizza was done in about 180 seconds.  AND it was less than $10!  How did it taste?   Well, gourmet it was not and as those of you who read my reviews about other pizza places know that I'm not a big fan of the charred crust. My Pizzafire pizza had a somewhat charred crust.  However, the pizza in of itself was good.  Good sauce and other ingredients.  I almost went back there again tonight! Hahha!"}
{"text":"Ate last night there and had a good experience.  Came back today and witnessed an employee who was making the pizza throw up all over himself.  Safe to say my appetite is ruined and I won't return to this place. Y u c k! And... they got my order wrong."}
{"text":"Ok...so, the service is terrible! The minute we walked in, I overheard the one kid say to the other, \"man, we should close at 6 on Sundays!\" Really? My first experience with this place and I am left to feel I'm not wanted as a customer before I even get my order going? Off to a rocky start. As we waited to be  acknowledged, I noticed the place needed a major cleaning. The floor was dirty and the tables all could have used a good wipe down. I was honestly nervous about eating from here. But, it is quick service..its fast food pizza. I have unfortunately seen worse. We placed our orders, asked one of the employees to wipe a table down for us, and grabbed a seat. Thank heaven the pizza was good! All pizzas we ordered were hot and tasty, which is what has saved this review. I would eat here again, but not before cautioning friends I bring about the possible conditions of the place and personality issues with the workers.."}
{"text":"Pizzafire is a great take on pizza your way with quality ingredients you won't find anywhere else.   Truly it is following in the footstep of Chipotle."}
{"text":"We really enjoyed the pizza we received! We went with their signature style cleveland. And it was great! See more information about our experience at www.tastytidbitt.blogspot.com !"}
{"text":"Ordered the buffalo and it was delicious! All of the pizzas as personal size so if you are hungry I would recommend not sharing. The remade my pizza because it fell apart in the over and they gave me a free pizza for the next time I return just because I had to wait an extra 5 minutes ! They were super nice and had wonderful customer service I would recommend this place for that reason in itself."}
{"text":"The service was impeccable but the pizza left something to be desired.  Probably won't visit again.  Loved the thin crust, but the red sauce tasted generic and I think that's what makes a good pizza."}
{"text":"New. Fun.  Fresh.  What can I say.  Finally fired pizza on the Westside.   Easy order.  Menu simple.  Topping good. Dough fresh. Friendly staff.  Crispy pizza  love it. I have been spoiled with great pizza in Florida but this is close and they will only get better.  Price points are affordable and bathrooms clean.  Will be back"}
{"text":"Excellent! My hubby and I went here after seeing a movie next door. Very fast casual. Customize your own pizza with various toppings.  Then cooked in wood fired oven.  Great prices, delicious food.  Breadsticks were great too.  Many more options like salads and cookies!!  Will def come again!"}
{"text":"was semi skeptical about trying after reading the reviews on here but it seems they are really working to right their wrongs. I got the marg pizza and it was amazing. The crust was awesome and everything tasted awesome. All of the staff present were really helpful and friendly. We told them we were in because it's exciting for the area to get new lunch options because we seemed to have exhausted everything on the brecksville side and the woman behind the counter spoke up to make sure I knew they do lunch specials which was a nice touch . I'm glad that I gave this place a chance regardless of previous reviews."}
{"text":"They! Have! Vegan! Cheese!  That was THE main reason why I wanted to try them out so bad!  And they are pretty close to my job as well.  Earlier this week I decided to stop and grab a pizza for dinner in between getting off and heading to volunteer.  With me loving every vegetable in the book, I did the unlimited toppings for $8.99 in my mind is a good deal.  They have all the toppings plus spicy red sauce!!!  #WINNING!  They also offer a variety of other sauces too.  When you walk in, it has an updated pizza diner feel to it, which is nice.  One of my friends described it as a Chipotle but for pizza.  That is how you order your pizza, they make it right there in front of you.  The pizza bakes fairly quickly which is good if you are short on time.  They also sell sides like meatballs, breadsticks and salad.  So if you wanted something extra with your pizza.  The pizza is a decent size for one person.  I would say it is between the size of a personal and a medium size pizza.  I basically smashed the whole thing with no leftovers because I was so hungry!  The service at the place was subpar....  The person who was making my pizza seemed unbothered by me and seemed pretty busy.  But the person working the cash register was extremely nice!  They even bought my pizza to me while I was sitting at the table.  I would say try this place out at least once!  It is fun to create your pizza while you are standing in line and they have on of those cool touch screen drink dispenser things!"}
{"text":"I'm really surprised to see all the negative reviews here.  Pizza fire is great!  The order process is similar to Chipotle, where you go along the counter and they build your pizza to order.  Next you pay and they put your pizza in their hot stone oven for 3 min and it's done.  It's really fast food.  There are different sauces and tons of toppings to choose from so you can get creative or just get one of the signature pies.  Their spicy sauce is a nice medium heat and the toppings are fresh.  The place is clean and the staff is helpful and efficient.  You can watch them slide your pizza in and see it baking.  Look, I understand it's not a gourmet pie made by someone who studied in Italy, but for the price and speed it's hard to beat what they have going on at Pizza fire."}
{"text":"Tried this place for the first time tonight. Ordered online, said it would be ready in 30 min. Get there and the pizzas were just put in the pizza oven. Waited maybe 5 minutes. By the time I got home less than 10 min later, the pizza was just warm. The pizza was paper thin (which is why I think it was warm by the time I got home) and I didn't think it was all that great, it was just \"meh\",  but it wasn't bad either. I wasn't impressed. Honestly, I would rather go to Mypizzetta on State Rd., better tasting sauce and crust."}
{"text":"Awesome fresh ingredients! Have specialities and the ability to build your own. Extremely yummy!!"}
{"text":"Fast delicious pizza, they have so many options or you can make your own. The choices are endless. Friendly staff and they have awesome selection of drinks!"}
{"text":"This was my first visit to any Pizzafire. First, every staff member was friendly, which was a nice change of pace. Second, I did enjoy the pizza very much. I can't say it was the best I ever had, but I would definitely return. Everything, including the restroom, was very clean. Good experience!"}
{"text":"It's a decent pizza and there are plenty of topping and sauce options. The staff doesn't really have the speed or system down yet that they need to keep the lines moving. Once your pizza is prepared it only takes three minutes for it to cook.   Cools: They have a pizza of the month that is discounted. Kids 12 and under eat free on Wednesdays. Touchscreen pop machine with tons of options. Costs the same as ordering pizza for the fam but everyone gets exactly what they want.  Not Cool: Longer lines (think Chipotle). Extremely small water cups. People waiting for food blocks the pop machine (poor layout)."}
{"text":"We live this place! Pizzas are all custom made right in front if you, plenty choices of toppings, Pizza is ready in 180 seconds. Seating is a little sterile, but the Pizza us well worth it an very affordable!"}
{"text":"4/5 stars. Here is why.  I had heard from coworkers that this place was great, and I had received quite a few coupons, but just never really thought about going there. I'm not a huge fan of pizza, because I'm very picky. I don't like pizza that is too doughy I don't like sweet sauce etc etc etc. so today I figured what the heck I'll give it a try. I had a coupon I was hungry so I went in. I could barely hear the lady who is taking my order over the shrieking from couple of kids in there. The kids were absolutely screaming their heads off climbing on tables and the parents couldn't be bothered. It was very hard to place my order over the screaming and since this is a big open area similar to like chipotle, if a kid is screaming you're not gonna hear the workers  on the other side of the counter. I had to ask her to repeat herself more than once but luckily it seemed she understood. Sorry can't hear you if there are three kids behind me shrieking andthe parents are too busy deciding with drinks they want to shut them up.  The food was awesome! The dough which she stretched in front of me had a really unique good flavor to it. I had a vegan cheese which works really well with the spicy sauce. I topped mine with onion mushroom and spinach. It got cold by the time I got home and I think having to reheat it in the micro made it a touch soggy. But still it wasn't any less tasty. I wish I could've eaten in, which is what I wanted, but maybe next time. All in all I will go back just be advised people, if there are kids in their screaming you are not going to hear the people on the other side."}
{"text":"hi im steven from strongsville ,I NEVER,EVER,EVER play games at all ,i wish i had a girlfriend ,but back to the review the pizza  store in strongsville (PIZZA FIRE) ok the pizza itself is very small,and the pizza crust is so ,so ,so thin , and all the topping just slide off ,like a sheet of ice ,and goes into your car and it takes about 200 sec ,anyway ,the good part only is the topping ,however are relly fresh indeed.and the pizza dosent even taste like a pizzaree .i would  also agreee with the user ANDI E she wrote on 9-7-16 ,it was awful ,the crust taste like jenos  pizza like inside the walmart,giant eagle,marcs,(ANOTHER words the crust taste like garabage  ,and save yourself $8.50,at  least-when you get jenos inside a grocery store at least it only .99 cents  ,nothing special at all ,not even the service either,very bad place ,and if you look at thier menu  ,they have a chicago -not thick crust at all?????????,anyway pizza for 8.50 (FOUR TOPPING only ,but you can make your own the same excat wat ,but you get the same rotten pizza with 5 topping  ,instead of 4 ,you if use your smarts,.never ever WILL I GET  the smarts to go back ther ,dominoms ,pizza hut,dominos,marcos,even speedway pizza is still 5 times better then the pizza fire ,and the pizza looks burt .,big buubles ,ok have fun if you go there ,and you be dissappointed ,i try to tell you!!!!!!out    of here  good bye  everybody take care"}
{"text":"These types of restaurants are becoming commonplace now. Piada, Chipotle, etc. ...it's pretty good. Fed 7 people for $42. Had 2 pepperoni pizzas, a buffalo, and a margherita. I don't really care for thin crust, but that's what you get. The place is decorated a little sparsely. The novelty I guess is that the pizza comes out pretty quickly. I've had better, but I'd come back."}
{"text":"My experience here was totally mediocre. I was excited for the make your own personal pizza aspect and the toppings I selected seemed decent in quality.  I really liked that they have ricotta and fresh mozarella as options!   However, the pizza was cold by the time I got to the second slice and it just was not very good. I'm not certain how these are actually cooked but it did not remain \"fire\" for long at all and, although I generally like cold pizza just fine, this one was totally underwhelming.  I probably won't be back unless I am with others who insist on trying it.    I'd personally recommend any other pizza joint in Kent where you can get a LOT more bang for your buck with $8/person! Kids may like it for the 'create your own' aspect but I will pass."}
{"text":"Excellent pizza, good service. I like the Subway/Chipotle model they use. Order at the counter, tell them what sauce you want, what cheese, what veggies, what meat(s)...I ordered a pie with red (\"Neopolitan\") sauce, fresh mozzarella cheese and bleu cheese crumbles (I love having the bleu cheese option--yum!), and spinach. They even showed me the pie and asked how it looked, asked whether I wanted more spinach, etc. My dad had a pizza with shredded mozzarella and anchovies. Very good. I love that they don't skimp on the red sauce (if anything, there might be a bit too much) or smother it in a pound of cheese. Good crisp crust when it first came out, though it got a bit soggy as our meal progressed. Good value, interesting neighborhood that's come a long way from the time I was a kid."}
{"text":"Pizzas were very good- light and fresh and hot and FAST. The customer service was not good, not helpful, not friendly, not smiling. Get the employees to like their jobs and the overall experience from the customers perspective will improve. I realize that you just opened-- so how can the employees be so jaded already???"}
{"text":"Great pizza with a fast turn over time. I enjoyed ever slice and did not feel greasy after I left. My only complaint was that the crust was slightly plain. Favors the thin crust pizzas and offers many healthy choices.    The chef was warm and inviting. He even came to speak with us about how we liked the pizza. If you're a pizza lover, this place is worth a try."}
{"text":"This place is okay. The staff at this Pizza Fire seem really young and kind of cocky. I would get there before or after rush hour because the place fills up FAST and gets really loud.   The pizza is okay. A little too thin for me and there's something about the sauce I don't particularly care for. It always seems like the pizzas are made with barely any toppings too, which sucks because I'm a big cheese person. However the pizzas take less than 10 mins to make and one whole pizza can fill you up. I like that you can make your own salad as well, but I've never tried it. A lot of the pizzas sound too appetizing that I forget about a salad."}
{"text":"Pretty soulless chain pizza. Has a food court vibe and taste. Crust was mostly tasteless. Still not awful. I would go again if I had a deep craving for pizza and had no other options. I can't imagine these franchises will last."}
{"text":"When we finally got the pizza it was fine-even good. Problem was place was totally understaffed with one person at 4:50 on a Sunday afternoon managing orders,  register,  online orders,  and pizza prep. Of course she burned one of our pizzas after taking 22 minutes to take our  order and had to redo it. I really felt sorry for her because she was in an impossible situation. Where was management? Also, they were totally out of napkins in the entire place including the storage area.No help, no napkins, no service."}
{"text":"Yeah never again. I've tried multiple times with it just not working out. The pizzas themselves aren't too shabby. It's a nice concept and the food is okay.  The service is absolutely awful though. Every time I go in there, the service is just completely lacking. Last experience just happened today. I sat there for fifteen minutes, they burned the pizza completely. It was obvious it was in there too long but the guy behind the counter just seemed completely out of it and not paying attention in any way shape or form.  He just stood at the end of the counter and just motioned for me to come over and said he burned my pizza and has to remake it. I was already running a bit late for meeting and asked for my money back. He just stood there with a glazed look and looked bewildered. There was no apology, no offer to discount me next time or even any remorse.   Previous experiences at this place include homeless people coming in and hustling me while I'm eating. So yeah that's not a good experience.  Not coming back."}
{"text":"-A Slice Of Heaven-  I heard very mixed reviews of PizzaFire and I was a bit skeptical when my friend suggested we go and grab PizzaFire, rather than run through a fast food drive-thru or order from a major pizza chain. I attempted to shoot down the idea, but was outnumbered by the rest of the group that had not yet eaten there either.  We attempted to get the pizza delivered, but were too far away (they only deliver within a 4 mile radius). So we placed an order for pick up and started our journey to go and grab it.  When we got home, we opened up some signature pizzas (The Buffalo and The Hollywood) and an order of FireSticks (not an Amazon product, these are their cheesy breadsticks). I tasted both pizzas and was pleasantly surprised.  Their pizzas are a bit different, fluffier flat bread-like crust as opposed to the run-of-the-mill pizza chains. Their seasoning and ingrediants were delicious on both pizzas. They were different, but not bad. Seemingly less greasy, and a little bit fresher ingredients. The FireSticks were also pretty good, but there was nothing really special about them. They were pretty flat, but they still tasted alright.  It's worth a try for something different, and something that is seemingly more healthy. I will probably start going to PizzaFire over Pizza Hut if they continue to deliver great quality pizza."}
{"text":"-A Soggy And Disappointing Mess-  After having tasted the pizza from PizzaFire in Kent, I knew I wanted more. I decided to try the newly built PizzaFire on Royalton Road.  I ordered a Buffalo Pizza (which I loved when I had it the first time), a sausage and pepperoni pizza, and an order of FireSticks.  I drove out to pick it up where I was met with a friendly staff and prompt service. My pizza was ready-to-go the moment I entered the store. The interior was clean, but not really busy so I was able to grab my pizza and go.  Upon arriving home, I opened the box and much to my chagrin, each pizza was a mess. There was no order to the toppings, things were haphazardly thrown onto each of the ordered pizzas, causing them to be an overfilled and sloppy mess. I didn't think much of it and grabbed a couple of slices.  The pizza was disappointing, unlike the ones I got from Kent. I know that New York style pizza is supposed to be thin and a little bit floppy, but it just seemed incorrectly cooked. Either the dough wasn't done cooking, maybe the grease got to it, or maybe the weight of the soupy toppings caused the dough to collapse under the weight. If I wasn't as careful as I was, the toppings would have been able to slide right off the slice and onto my lap. I did manage to keep everything in order while I ate, but it wasn't as fulfilling as I had hoped. At least the FireSticks were alright.  I'm not sure if it was new employees, or the fact that this PizzaFire was new, but the pizza was not up to par. I may try it again in the future in order to give it a fair second chance, but I probably will not be stopping there for a while.  If you're planning on stopping to grab a pizza from this location, I suggest that you go elsewhere for your pizza (at least for now). Let some time pass and maybe consider it in the future."}
{"text":"I love pizza fire! I have been happy every time. I like to experiment away from the typical pepperoni and this lets me do that without limitations. The price is great! Where else can you get a 6 piece pizza custom made in 10 minutes for $8-$9? That's great! I've gotten garlic and oil, mozzarella, chicken, red onion - ALWAYS get the garlic dipping sauce at the cashier. It tastes literally exactly like papa johns (giordanos? I think).   The cleveland is also delicious - red sauce, mozz, pepp, sausage, onion, mushroom. Pesto, ricotta, onion sausage!   ONE improvement is to cook or steam veggies before putting cold on the line, just so that they are still fresh but also cook throughly in the 5 min it's in the oven. You can always ask for extra time.    Convenient, consistent, and I find myself craving it."}
{"text":"We had seen a review of this on a Cleveland TV station and always wanted to try it, so the night of the Lady Gaga concert it was the only place that wasn't crowded.  The inside is nothing special, in fact, needs a good cleaning.  My husband went up and ordered for both of us, and the person making the pizza said one pizza would be enough for the two of us.  We ordered a side of meatballs as the signs there showed them looking delicious.   The 4 meatballs for $4, definitely on the small side, were served in a paper cup with a little bit of sauce and cheese.   My serving looked nothing like the picture that is displayed.    Our pizza was ready in minutes which totally surprised me.   Not sure what kind of ovens they use, but the pizza was cooked superbly.   Tasty crust, good sauce and cheese and our toppings of sausage, pepperoni, peppers and onions were all fresh.  Truly liked the pizza, but it was small, and we could have each eaten one ourselves.   The meatballs were nothing special at all.   Don't waste your money on them, eat more pizza."}
{"text":"Disappointed thus is not a wood forno. Thinnest crust ever, nearly unable to pick it up. Wheat thins are thicker. No plates- not even paper plates, so it's hard to eat neatly. Sauce is ok, lots of grease pooled on top. Dining room is extremely loud with an echo. Napkins are waaaay in the back."}
{"text":"Theres a lot of choices when it comes to pizza. I appreciate pizza fire because it does have a different spin on it which is fun. Pizza was good...not the best I've ever had, but good. Good for kids and the prices arent bad."}
{"text":"First time at this location, waiting for the new restaurant kinks to be worked out. I must say the place was spotless and the service was really great!  Pizza was very similar to the good stuff I've had at another location, fresh and very yummy!  Love the fresh basil, spinach, with olives and they are always very willing to cook it a little more for me because I like it crispy.  Welcome to Fairlawn, Pizza Fire!"}
{"text":"I was there again today and it's still fresh and very tasty!  Been there several times at this point and it's always good.  Very happy that a new, closer location is coming!"}
{"text":"This has to be one of my favorite places in the area!! As a nurse I came in today looking forward to a great personal pizza and instead made a great friend and appreciate what David did for us! He greeted us personally and recognized that I was a nurse and during Nurses week, went above and beyond to share his appreciation for the day to day effort that our profession deal with! Thanks David!"}
{"text":"I've been there twice now. Both times I really enjoyed the food, but the cashier checking me out struggled. At my first visit, she rang me up twice per pizza resulting in my bill being $32 and then was uninterested in correcting the mistake. At my second visit, the same cashier forgot to give me and my mom our drink cups. I politely asked for them. She looked me in the eye and turned away. When I was handed my two pizzas I asked again. I was told \"You should've just asked!\" with a snarky tone. I didn't appreciate that.   Like I said, the pizza I had was very good. I've had the margarita both times and I've heard great things about the pepperoni pizza, but the horrible customer service while checking out deters me from eating there again."}
{"text":"Great place to take the kids on a Wednesday. They get their own free when you buy one pizza for yourself."}
{"text":"This was my first time here, and I have mixed feelings. Pros: pizza was hot and crust was pretty much perfect. Cons: employee making my pizza had zero personality and only gave the most simple responses to my questions; canned mushrooms are used instead of fresh; and the majority of the dining room tables were dirty. This place just opened last week, though, so I assume they're working out the wrinkles. I'll give it another shot in about a month."}
{"text":"Loved the pizza, could use a touch more cheese or at least an option for it! Will return often."}
{"text":"This pizza was very good and the service was awesome. Well just dont use GrubHub because they never picked my pizza up I had to go get it my self after 1 hour and 20 minutes of waiting. Not the pizza place fault at all."}
{"text":"My first time eating at Pizza Fire and the pizza was ok. But the service was horrible. I came on my lunch break so I decided to order online an hour before. When we arrived our food wasn't ready. My food finally came out and the person just sat it on the counter and never even said my name. He did however a knowledge the others behind me. Then I finally got my pizza but the person I was with did not get hers until 30mins later. No one apologized, even though we had to rush through our lunch because of their mistake. On top of it all the tables were Dirty and no napkins. Not a great first experience."}
{"text":"After a very long concert and longer night at Music Box, we realized we wanted pizza (obv). We then realized it was a Saturday night and most delivery places would have an absurd wait. Enter PiZZAFIRE. In truth, we chose them because UberEats promised the wait was short. From the time we pressed a few buttons to having the pizza in hand at my friends house, it was maybe 20ish minutes. When did UberEats drivers become the fairy pizza godmothers of urban cities?   The ingredients on our pizza were some of the freshest i've ever had on a local pizza. We ordered one of their basic pizzas and added extra cheese, pepperoni and basil. When we opened the pizza, it was a nice set of colors! I've never done PIZZAFIRE before, but I understand they make their pizza in a wood-fire grill in 180 seconds. Because of this style, the crust is very thin. Our toppings were infinitely heavier then the crust, so eating it was a bit of a challenge.  I would order again from here, but with better expectations on what i'm getting. Yet, if I have to choose between greasy ingredients on a hearty crust that I feel guilty eating, or non-greasy fresh ingredients on a super thin crust, i'll take the latter."}
{"text":"Ordered takeout from here on Friday night.  We each ordered a create your own pie online.  Went to pick it up and it was less than 15 minutes.  I was really impressed with how quick it was.  My pizza tasted delicious, however my husband just thought his was ok.  I ordered a pizza with vegan cheese, spicy tomato sauce, hot peppers, giardinara, and topped with pesto.  He ordered a margherita pizza and added sausage to it.  Since it's my review, I'll stick with the high rating.  My only complaint would be that it needed to be cooked a bit longer.  Next time we order from there, we will ask for the pie to be cooked well done."}
{"text":"This is an update to my review:  If you are looking for a quick, hot, delicious personal pizza, than this is your place. This place is comparable to Pie Five and Blaze Pizza, which are in other cities across the US. You can order a pre-set option or choose to design your own personal pizza. I ordered \"The Refund\" pizza, which comes with sausage, onions, & red and green peppers. It normally comes with fresh mozzarella, but I chose shredded mozzarella. The pizza is cut into 6 slices. I like that the crust is thin and a bit crunchy.   Later that night, I had stomach cramps. My coworker also experienced stomach cramps. We both ate there and we both had sausage and meatballs on our pizzas. I mentioned to the guy fixing our pizzas that there was some cross contamination of the toppings. His response was that it happens. Whatever it was on our pizzas, we both felt weird the next day. It's safe to say, we won't be back."}
{"text":"Ordered delivery. They offered a section to give specific instructions to the staff for preparation. I explicitly stated twice to NOT put any cheese at all on the pizza. Pizza arrived covered in cheese. Reading is tough."}
{"text":"Pizza Fire is a chain, but does give great service.  They have several choices on how to create your own personal pizza.  They have different sauces, toppings and styles that will make it hard to decide.  They also have an old fashioned soda fountain that I liked.  I'm not too keen on their pizza in topping size or crust; yet it was tasty enough.  I'd return with my friends like I did earlier last month."}
{"text":"Meh.  Ordered something simple - pepperoni and sausage.  Crust was ok, more on the well done side which is typical for this preparation of pizza.  Sauce tasted like canned pizza sauce that was a little more watered down - but it wasn't bad.  It fell apart at the toppings.  The pepperoni had no flavor, something I have never experienced before.  The sausage was soggy and wet, I would have expected it to come out with a little crisp on it after going in to that oven.  There is a saying business in front party in the back in describing mullets...  this pizza is crunchy on the bottom and soggy on top.  May try it again one day - but won't be a special trip."}
{"text":"My wife and I went here about a week ago.  I'd say it was good but not great; if I could, I'd probably give it about 3.5 stars, instead of 4.  We each got a pizza, both with the regular red sauce.  I got sausage, mushrooms, and red peppers, she got anchovies (and I don't remember what else).  They were both good.  The toppings are nice and amounts are adequate.  The crust was very good, reminded me of a New York style, with a little bit of a chew.  The sauce was kind of bland - I would get the spicy marinara next time.  The pizza were also a little bland overall; I think mostly because of the sauce.  Wish they had some powdered garlic and red pepper flakes - it needed a kick.  One pie is maybe a little big for one person, but would be too small for two.  We split a salad.  I guess they make them there, but they are in pre-packaged containers and was pretty bland with the house Italian dressing.  It was barely acceptable.  They don't have a liquor license, so it is just soft drinks.  The place was a little messy.  Sure, there are a lot of kids and families, but they weren't keeping up with it, and they had a lot of staff.  My wife thought the kitchen area looked a little sloppy too.  I'd come back some time, but I wouldn't go out of my way to go there."}
{"text":"Great place for a quick pizza fix. There are endless options to customize your pizza. The pizza is probably one of my favorites around. It has a great crust, and you can't go wrong with designing it for your own taste."}
{"text":"You have got to go here and try this pizza. This place is good and it's fast and the service is friendly. A unique way to operate a pizza shop. It won't break the bank either. The pizza is all thin crust and I'm not a thin crust fan but this was good. The pizzas are smallish but just right a one pizza per person. Cool place I will spend more of my hard earned cash here without a second thought."}
{"text":"My family goes to the Pizza Fire downtown Akron all the time but the parking isn't ideal on a Friday night so we decided to try the new portage path one. Well that turned into a major disappointment.   The customer service was completely lacking. At the alron one, someone always greets us when we walk in. The one woman was preparing the dough while 3 other employees  just talked behind her. She acted like we were bothering her and didn't seem like she exactly knew what she was doing.  Then after she finished preparing the dough, another (super nice) guy came over and made the pizzas for us.  Next we waited for our pizza. Once the pizzas were taken out, we had to wait for the next employee to finish his conversation with another employee before he could cut it. Now this was unlikely a work related conversation because it was apparently hilarious and we had to tell them twice that it was to go before he put it in the Pizza box.  Finally we got the pizza home and realized that my fianc's pizza was burnt.   I guess we will just go to the one downtown Akron."}
{"text":"The pizza is ok but the staff seems a little lax. The place wasn't busy when we went in, there was about 7 people there when my sister and I stopped in for take out. Out of the 5 people working only 2 were helpful, the rest just stood around talking. My sister stood at the register for a while before someone asked her if she needed anything. I understand relaxing a bit when it's slow but at least attend to the  customers you do have first.  Overall: cheap, fast and decent pizza with a meh staff."}
{"text":"Very nice guys, clean restaurant, and good pizza. Pizza could use a little more toppings, but that could be me.  It is cool they only make personal pizzas, everyone gets what they want. If you are staying in the area give this place a try. You will not be disappointed!"}
{"text":"The service is always exceptional- very positive, friendly staff and very family friendly.  Food is great too...my favorite is the Hollywood pizza with basil pesto, chicken, garlic, and roasted red peppers"}
{"text":"David and I ate here on a Saturday afternoon.  The pizza was very good.  It was cooked perfectly.  The crust was very nicely done - no burnt edges.  My one complaint was the west wall is all windows from floor to ceiling and the sun was brutal.  Everyone was trying to find a spot to east with a little shade.  We will eat here again."}
{"text":"I am embarrassed for the ownership of this neat, modern looking franchise. I walked in with my wife and son with 4 young kids working behind the glass that didn't even address we were standing there. This was our first time so I had to ask the manager at the register where we order. She turned around and told the four high school kids working to greet customers. 3 of the 4 employees continued to make there own personal pizzas while my wife, son and I wait. The manager was more concerned with the amount of toppings the employees were piling on there own pizzas instead of taking care of the paying customer. Very surprised by this lack of customer service and total absence of any concern for the customers experience. In a very competitive market sector, this will hurt business. Very disappointed. Will not return or recommend.   Very poor experience took place July 30th, 2017 at 3:42pm."}
{"text":"Stopped in after seeing a movie upon recommendations from friends...the prices are very reasonable and the pizza is really quality. The food was out to us in 5 minutes. The manager was very friendly and helpful. I would recommend this to family and friends"}
{"text":"Pizza Fire supplied our dinner for the Olympics Opening Ceremonies night. Friday night is take out night for us. It's a cool concept. No phone orders... you order (and can pay) online. When you arrive your pizza is assembled, they toss it into the fire and it's ready in minutes, fresh for you. We tried the Cleveland,,, yummy and fresh ingredients and the Chicago. Thin crust was a nice change from the massive doughy stuff we usually get.   You can order and eat on premises as well.  This is a great way to pick up a pie on the way home from work."}
{"text":"This was my first visit to a Pizzafire. The first thing that I notice is the huge pizza oven in their kitchen. An impressive beast of an oven that cooks pizzas in a few minutes. They offer a ton of options if you choose to build your own pizza. From a variety of sauces to toppings you should be able to put together something to your taste. If you are not into that their menu offers a variety of specialty pizzas.  We got one of their large 14\" thin crust specialty pizzas called The Cleveland. It has pepperoni, sausage, onion and mushrooms. A super delicious pizza that I enjoyed. The ingredients are top notch and you can taste it. To be honest, I think a large is enough to feed two people well.  It is thin crust so keep that in consideration if going in with a larger group. It is nice to see a fine addition to other great pizza shops in the area."}
{"text":"Went here the other night for dinner.  The Good: Toppings are fresh and their is a good variety.  The Bad: Cooking a pizza in 3 minutes at 1000* is not a good idea. It leaves the outside of the crust burnt to a crisp, the mozzarella and pepperoni burnt on the edges and the crust in the middle and sauce completely soggy.   Also for some reason they put the pop machine right behind where you stand while waiting for your pizza, want a re-fill? Yup hey excuse me just gotta get by you 7 people.  I'd recommend avoiding this one, seems like even the employees don't want to be there, do yourself a favor go down a bit and get a fresh and ready for half the price that's cooked in a proper oven."}
{"text":"Pretty much your standard woodfire grilled fast-ish food pizza place.   You basically know what you're getting if you go Margherita or pepperoni, but I've really liked a couple of the special pizzas I've tried. The ranch lovers potato pizza with chorizo is absolutely delicious.   If you order the firestix, it's basically like ordering a garlic pizza. It's the exact same size and shape as a Neapolitan, just cut in smaller slices. It's really good, just might not be the breadsticks you'd expect."}
{"text":"Food is really good but service is so bad. Beware of ordering online to pickup or have delivered."}
{"text":"After a few hours of working in the yard, we were hungry, but felt neither motivated to cook nor to change into nicer clothes, so we brushed ourselves off and headed to Pizza Fire.  Without spending a lot of time (still yard work left to do) or money (less than $20 for two pizzas and two fountain drinks), we had a quick dinner, and I brought half of my pizza home to be my lunch tomorrow.  On this Sunday evening, several families were seated and enjoying their meals (this is a kid-friendly eatery), but it was not terribly busy.  That being said, the prep area could be neater;  rather than allowing the toppings that don't land on the crust to remain on the counter, it seems that cleanup should be done before preparing the next pizza.   For amazing pizza, I will cook at home or head to a sit-down-be-waited-on restaurant, but for quick, passable pie, Pizza Fire is close, quick, and inexpensive."}
{"text":"This opened pretty recently and my friend and I went to try it out. We got there a little bit before the lunch time rush, so we got our pizzas quickly. I got the Margherita Pizza and it was fresh and the pizzas came out very quickly. Especially in the Broadview-Heights area it is a good place to go to get a quick fix for pizza cravings."}
{"text":"Awesome pizza, nice atmosphere, and probably the BEST Gluten Free dough around!"}
{"text":"This place was an awesome mix of fast food and pizza. It was my first visit to Pizza Fire. The staff was incredibly friendly and helpful throughout the process. I was there at an off time between lunch and dinner and the place was nearly dead except for one other table.   You can choose from a pre-designed pizza off the menu or you can create your own from scratch. The pizzas all come in one personal size that could feed most people for two meals. I chose to create my own pizza from scratch and the pizzas are priced based on the number of toppings you choose.   People say you learn something new each day. Well on this day I learned that I'm a horrible pizza creator.  The toppings were delicious on their own, but the combination I came up with didn't work so well. It comes on a thin crust. There's many options from sauces to veggies to meats, so I found myself overwhelmed and ended up with an interesting mix.   The cooking time took less than 5 minutes. It didn't seem like I waited long at all between paying and grabbing a drink at one of the touchscreen soda fountains with over a 100 possibilities. When eating the meal, two separate employees came up to make sure that everything was ok. It certainly was and I'll be back to try my hand at a different topping combination. Working on my next concoction in my head right now."}
{"text":"A place to avoid unless you have kids. Pizza is okay - nothing special but it is fun to watch them make it. The day we went it was very disorganized. There were only two people working at first and it was very slow although the employees were very nice. Worst set up is the dining area. People have to walk through the dining area to place their order so people are constantly Salkin, running and even bumping into tables. It feels a lot more crowded and filled with commotion than need be."}
{"text":"the only reason this place deserves two stars is because the pizza rocks. otherwise this restaurant is always dirty and extremely slow with making food. the woman with the red hair at the register has absolutely no idea what she's doing. it took her about 15 minutes to make us two side salads and check us out. she had to repeatedly leave the front to get more items to stock the salad bar as we asked for them. we took our food TO GO yet the entire process of being in the restaurant took about a half hour."}
{"text":"Super disappointed. Maybe I'm biased bc my brother owns Novacento, a pizza joint in Las Vegas w a real WOOD fired oven and this is a gas one the difference is monumental. Kind of like a real fireplace and a gas one. Wood one gets really hot, and has a great aroma, gas one doesn't put out heat and is merely for show. Same thing w pizza fires oven. I presume my pizza came out of the oven Luke warm w the mozz barely melted instead of bubbling and the entire pizza flimsy including the crust bc the gas oven can't properly heat it. The Dough was another disappointment this takes \"thin crust\" to another level as it almost see thru thin which I would think would be easier to heat and create proper texture but the gas grill can't do it in 180 seconds atleast. Very skimpy on the sauce as well maybe on purpose bc the dough can't hold up to it idk. It's a great sauce tho best part of the pizza. I had the buy 1 get 1 so I had 2 diff pizzas but identical results. They would be better served w a conventional oven and cooking time. It's gimmicky and will not be back"}
{"text":"I always went to the one in Akron. Super excited there's one closer to home now. It takes a little while to get your food but that's for obvious reasons. Every time I've been there I've had amazing service. One of the guys can make you feel a little uncomfortable but he's very nice."}
{"text":"Omg!!! What a experience. I order the Basile/pesto sauce with fresh mozzarella and bacon and green peppers!!! Talking about a mouth-organism!!! Not only was the food Fast-Fresh & Fantastic but so was the serve. They we polite and friendly and wanted to make your pizza experience great!!"}
{"text":"What's better than fast made to order pizza? The people behind the process. The food at Pizza Fire is delicious and the ingredients are a refreshing change from the run of the mill pizza joints.   The employees are fun and attentive and seem to really enjoy themselves    Stop in and don't forget to play around with different combinations. Oh, and grab a cookie too!"}
{"text":"Quite possibly the worst pizza I've ever had. Just not my Cup of tea. the people weren't that great especially the managers. the crust is biter on the pizza when you leave it in there too long which ruins the whole thing. Pizza 216 is a way better option if you're looking for that style of pizza"}
{"text":"Great thin crust pizza. The wife and I split a half Chicago half buffalo. She added a salad and drink for $4.00. Ended up taking half the salad home. With 8 different specialty pizzas for $8.99 we will return."}
{"text":"Decent Pizza for the price. The style that is more Sauce than cheese.  Does not travel well; eat it there."}
{"text":"I have gluten allergies and it's so hard to find pizza places that are accommodating. This place went above and beyond. They asked if it was an allergy, and took Extra steps to ensure my pizza wasn't cross contaminated. A+ pizza too ;)"}
{"text":"Pizza Fire was just OK, but nothing to 'shout from the mountaintops'.  Considering how fast the pizza is made (in a wood fired oven), it tastes good (at best), but it is overpriced in my opinion.  I like the crispy crust, but the rest of the pizza was just average.  The pizza sauce was on the bland side.  They need more extra-virgin olive oil, oregano, basil, etc. in their recipe for sure! Another issue, is that our pizza crust was clearly on the burnt, black side.  They need to learn NOT to overdo the cooking!  Also, it would be nice if they offer Kalamata olives instead of cheap, bland plain black olives.  I don't know if I will be back anytime soon.  Maybe if I am pressed for time and want a quick pizza."}
{"text":"Tried it tonight for the very first time with two friends. An amazing crew of two young men and a young lady walked me through ordering. So many options including vegetarian and gluten free. We each got a different pizza and added the combo which was great value for money. Seriously the two guys made ordering such fun. I got not only great customer service but also a great customer experience. They checked on us after sitting down with perfect timing and great care and efficiency. I wish I got this level of service in some high end $$$ restaurants! I will definitely be back."}
{"text":"I have been looking forward to the opening of Pizza Fire at Portage Crossing for months and I finally had the chance to visit today, just a couple days after their grand opening.  Pizza Fire brings pizza to the fast-casual style of restaurant. You walk through a line--just like at Chipotle--and tell them what kind of pizza you want and what you want on it. Then you pay and wait for you food to be cooked!  I decided to try their \"Margherita 72\" which is their take on the classic Neapolitan Margherita pizza. I also had them add some Tuscan pepperoni to mine. They specify sea salt as one of the toppings on this pizza and I personally thought the salt was very overpowering as I would imagine it is a hard topping to judge how much you are adding. Overall though I thought it had a very good flavor. I really like that they use fresh ingredients for their toppings; they even have fresh basil and lettuce growing inside the store!   I also ordered a side of \"Pizza Fire Breadstix\" with cheese. Their breadsticks are made on the same size dough as the pizza but cut into smaller, rectangular slices. It is plenty of breadsticks to share with one or two other people if you each have a pizza. They claim that they are \"The BEST breadsticks you have ever had!\" and I tend to agree. They were definitely very good.  It was relatively busy when I visited but the line moved quickly. I did not have to wait too long for the pizza to cook after I payed either. I did definitely notice some confusion by more than a couple people on remembering what their food number was. It would be nice if they could print these numbers on the receipt. I had number 47 and 49 even though my pizza and breadsticks were on the same order.   I am a big fan of pizza and I love places that use fresh ingredients and have a unique style. Pizza Fire is definitely a place I plan on visiting again and their menu has many options to keep me entertained for quite some time!"}
{"text":"I've never had a bad experience at Pizza Fire in kent! Their gluten free crust isn't bad! I've tried their vegan cheese out of curiosity and it's a great alternative! I recommend the buffalo, very tasty. They usually pretty quick in getting your food to you and it's always delicious!!"}
{"text":"My pizza was burnt on the bottom and some of the crust. I hate burnt pizza.  I would rather have them cook it longer that 3 minutes at 800 degrees and get a better tasting pizza.   Maybe because they just opened a few weeks ago, but everyone that worked there looked like they had no idea what they were doing. Took forever to get a 3 minute pizza.  I got the margherita pizza for $8.49. (the pizzas are 12 inch)  Very little toppings ( I counted three pieces of basil on the entire pizza) and the fresh mozzarella was scarce and not really fresh.... or it was completely ruined by the 800 degree oven.   very little food for $8.49.   I was Very underwhelmed."}
{"text":"I love pizza fire! It's the perfect place to go when you're feeling pizza, but are short on time. Every time I visit, I am greeted instantly and the staff is always beyond friendly. I had a lot of questions the first time I visited, and the workers were happy to answer and let me try some samples.       They have pre-made pizzas, or you can make your own. I prefer to make my own, and your best bet is the three topping pizza. I go for the spicy red sauce, pepperoni, banana peppers, and mushrooms, but there's a huge list of anything you could want (even gluten free crust!).       Once they take your order, you head to the check out to pay. The last few times I visited, I was given a free mini cookie that made my day! Once you pay, you find a seat and they bring out your pizza a few minutes later when it's ready.       Every time I have visited, the person who has made our pizza has personally come over to check that it was delicious and that everything is what we wanted. I absolutely love coming here and the friendliness of the staff!"}
{"text":"Staff was very friendly but the food was not good. I got a pizza with the garlic sauce but it was more like a garlic paste with some olive oil, it was horrible. The pizza was also very thin and the toppings were not done enough. Very bland. Don't see myself going back."}
{"text":"Our first visit to Pizza Fire and we are hooked!  My husband ordered the Buffalo Chicken pizza, I created my own pizza, and we shared the mozzarella bread sticks.  Everything is made fresh as you order it, and was SO good.  The authentic neapolitan sauce is absolutely delicious!  Staff was super friendly and helpful.  We will definitely be back!"}
{"text":"Really good pizza. One size (8\", I think) thin, crispy crust, 5-toppings, made to order and ready in about 5 minutes for like $9. Fewer toppings=cheaper. Two people could easily split one pizza. Wife, daughter and I each got one and we brought home an entire pizza. Check out the web page - they have a few \"pre-configured\" pizzas (I got a \"Cleveland, girls got a \"Chicago\") but you can customize any of them. I may have invented the \"Hot Cleveland\" - substitute spicy sauce and add peppers (banana or jalapenos)  Awesome!"}
{"text":"Nice restaurant, clean, with lots of seating. It IS Chipotle...but with pizza. The staff here is very friendly and kind, and service is quick. As for the food itself...the crust is nice, chewy and thin, which is something different for me. I thought the sauce was a bit bland, fancy soda machine is fun. Very expensive IMO. Ordered a lunch combo with small pizza, drink, and small salad. Was about $10...whereas I can get a larger pizza for about that elsewhere."}
{"text":"Have been twice. Acceptable food, even if marginally overpriced. A better price point would be 2 simple pies and 2 drinks for under, rather than over $20.   My only complaint is with staff. The place is new. I get that. They hire kids. I get that. Training is hard. I get that. But managers are right there, not observing. First visit, a young man working the pizza line and cash register grew frustrated and began banging his forehead and hair, gently, against the food prep surface, in full view of customers (I did discreetly say something to the young man, but not the manager. Give the kid a break). Last night, a young lady also working line and register decided, again in full view of customers, to spend her time arguing with an apparent boyfriend/brother/whatever about why he *couldn't* apply for a job and work where she worked, for a long time, ignoring customers waiting and shaking their heads.   Management needs to be more observant, to step in when teens (who just don't know better) don't behave as they should in the workplace. Their training needs to include behavior as well as how to build a pizza or work the cash register.   And get some modestly larger beverage cups. What you have are too small."}
{"text":"I got a pizza with the standard (\"authentic\") sauce, vegan cheese, green peppers, red onion, roasted red peppers, broccoli, and fresh basil. The guy who made my pizza was very friendly and helpful. The pizza was ready quite quickly and tasted great. I was quite hungry so had no trouble finishing it off, but the portion size is plenty big. I wish there were a place like this in the Dayton area, because while we do have at least one rapid pizza location, they do not have vegan options."}
{"text":"The ingredients were fresh the service was quick the cook time was quick the sauce and the crust were only ok, almost bland. The crust even though it was brown it was limp there was no taste added from the flash cooking like there is when you use a wood fired oven."}
{"text":"If I had to eat one food every day for the rest of my life, it would probably be pizza. As a college student, I pretty much live and breathe pizza, and Pizza Fire is my new favorite place in Kent to grab a slice!  When you walk in the restaurant? itself was super clean and pretty spacious. For a small price, you can get unlimited toppings, and they definitely? have a ton to choose from. I got extra pineapple, mushrooms, onions, peppers and sundried tomatoes. My mouth is literally watering right now thinking about that pizza. The individual pizzas are pretty big, so I was able to save half of it and eat it for lunch the next day.  I'm so glad that this restaurant? moved into? Kent recently because I'm definitely? over eating cardboard-tasting cheap pizza from other local places."}
{"text":"Ordered a pizza and wings from here and had it delivered to my hotel. Wings were okay. Pizza was awful. It was cold, not just not hot, but cold and so soggy you could barely pick it up. My husband wouldn't even eat it. I was very disappointed because I love fire pizzas."}
{"text":"Friendly staff. Limited choices of pizza which is a good thing! No so overwhelming!   Two things I wish they would do, larger size pizza option and leaving it the oven a tad longer!   Other than that this place is the go to on the run and a quick dinner!   The Chicago pizza is awesome!"}
{"text":"I want to like this place! The premise of a pizza place that operates like other successful \"build-your-own\" meal franchises, and the promotion of grown in-store greens really sounds great!   It took about 40 minutes (line, register and pickup) for a pizza that takes 3 minutes to cook. And the result is a thin personal pan style pizza for around $8-9. If I didn't have a $5 off coupon, it wouldn't have been worth it.  The service in-store just isn't up to the task. I think this is either because the store is still new and the employees are still figuring out a system, or the existing training system is poor.   My positive criticism:  I used to work at a Subway store. Pizza Fire Parma should try having each employee on the line take a customer from start to finish, so the slower customers with bigger orders don't hold down the line, and there aren't employees standing around waiting at the register while a line wraps out the door."}
{"text":"The concept is amazing. It's Chipotle for pizza. Load up on 6 different types of sauces, 6 different types of cheese and numerous meats and veggies and throw it all into a 900 degree brick oven for 5 minutes and voila! The pizza itself was just fair to middlin'. it is very thin and the pies we got had some burnt spots on the top and bottom. The toppings are good and you can load it up real good. The price of $8 for a 10 inch personal pizza is where they lose me. I get it that you are paying for the service and what not, but for 5 of us (including 2 kids) to spend over $55 in pizza and salad is a little expensive. I would probably try again solo just to get another taste, but I'm not rushing back."}
{"text":"Good pizza with fresh ingredients. They weren't too busy so the wait time actually wasn't long for us. The staff still seems new and getting used to the process but were nice and pleasant to deal with. The location is also pretty convenient. Looking forward to my next visit to try another pizza."}
{"text":"Went here because it took over Qdoba's location and I was very curious about what it was. Pizza is made very quickly and I must say its one of the fresher tasting pizzas I've had. Awesome to see them growing all the herbs in the back and they seem to make fresh salads throughout the day to purchase as well. Will definitely go back here, just never seems to come to mind as my first pick for pizza."}
{"text":"Pretty good pizza! It's a pizza for one person, on a delightfully thin and delicate crust with your choice of sauces, cheeses and toppings, cooked in about 3 minutes. In fact it took them longer to take our order then to cook it. The meatball side dish is amazing, however mine was just barely warm, not hot. The lunch combo was a pizza, drink, and a side for $9. Worth going in for, worth going back. Clean restaurant, although the service was a little slow. Still, I enjoyed it and would happily return."}
{"text":"I went their because they use Belly and I had a \"Belly Bite\" for a free one topping pizza from Pizza Fire. While there I came across very friendly employees.  They made my food quickly. They were willing to recommend and explain the different ingredients that I could have on my pizza. I went there around lunch time. I came across a few booths that needed to be wiped down, but overall this is a good place to visit for a bite of pizza. I ordered my pizza with the ranch bacon sauce, mushrooms, onions, and vegan cheese. It was too good and I would definitely be going back there."}
{"text":"My pizza would have been amazing if it wasn't SOO SALTY! I LOVE salt and this was too salty for me, for a normal person it would probably be inedible."}
{"text":"The food is good and the people are nice but man how hard is it to clean a place!? The floor looks like it's NEVER been mopped..the chairs and walls and everything. I would love to thoroughly clean that place and it hasn't even been opened long. Weird."}
{"text":"Stopped in on a weds. afternoon astound 4:30.  None else in the place. Ordering was quick and easy.  Got a medium Neapolitan.  Pizza was edible but not great, hubby thought it was good and would get again.  Place was dirty, dirty, dirty.  Ingredients that missed the mark were falling into the bins of other ingredients.  It wasn't busy, they should have been cleaning.  Server was nice enough, but was still a trainee, yet left to his own devises.  Manager did come out when it was time to pay to show him how to differentiate between cash or credit payment. Wrong change given, he was polite about correcting.  Maybe management needs to be looked at for their training methods.  Throwing to the wolves generally does not a stellar or happy associate make.  Would go back if hubby desired, but not of my own volition."}
{"text":"PizzaFire is a nice place for a delicious pizza but I would say that their kind of thin crust can't hold the deliciousness I would choose to top it with."}
{"text":"Just tried this new location after always going to the one in downtown Cleveland. Space was nice and clean. Pizzas are amazing. From building your own to picking one of the specialities, I don't think you can go wrong. I really like the margarita pizza. It has tons of flavor and only has 520 calories. Sometimes I feel like the pizza gets charred a little too much so I always ask them to cook it on the lighter side."}
{"text":"This place is awesome. The pizza is fresh and so tasty. I must admit I think the speciality pizzas like he Margherita and buffalo chicken and better than build your own. It gets busy around lunch, so plan ahead. I haven't tried the cookies, but they look amazing every time I am in the check out line."}
{"text":"I was so excited to try this place! And after one visit, still not sure where it ranks on the list of places I will frequent.  Love the concept and was pretty satisfied with my pizza but still some major disappointments that are pause for thought. Love- thin crust, wood fire pizza! Love- ability to customize. Love- red sauce flavor, crust consistency and flavor. Overall pizza taste.   Annoyed beyond about the 'toppings'. I ordered grilled chicken, red pepper and artichoke.  The person topping my pizza gave me the smallest scoop of super chopped chicken-- less than yummy looking. Then I watched as she took one artichoke heart quarter and proceeded to PEEL it!! So basically I had the outside layers of one quarter heart on the pizza. Gross!!! No one wants to chew on those! And definitely missed the mark on artichokes.   I did still think the pizza tastes good after I picked off the gross artichokes.   I almost got a salad as well- but they looked pretty sad in the case by the register. Not worth the cash at all!!  But I am giving it four stars because flavor was there and it was priced well and they just opened. Plus, I do want to eat it again and so that has to factor in."}
{"text":"Took the family and met some friends at Pizzafire recently. We all got to build our own pizzas. I chose the regular dough, but they do offer gluten free. I asked the cook to give me their most popular sauce. Then I got mushrooms, onions, and mozzarella. The pizzas were cooked quickly in their rotating ceramic oven.  They offer a soda fountain with a variety of flavors. I opted for Mountain Dew with cherry and vanilla flavors and it was delicious.  My pizza cooled off quickly and it was delicious. It was of very good quality, but the sauce wasn't notable and they didn't add enough cheese. I definitely liked the crust, but I usually don't eat it. It's fun to choose your own toppings for once.  Recommend!"}
{"text":"Alright, I rate PizzaFire 3 stars. I feel that their execution is lacking, here's why:  (Background: I travel all over USA and I've been trying this style of pizza. I've had MOD, Blaze Pizza and Rapid Fired Pizza)  - Upon entering the place, it was trashed and very dirty. (The ambience reminds me of a cafeteria)  - the ingredients are basic and remind me of frozen tombstone pizza with subpar ingredients  - The Cutlery/napkin/toppings area seems like the focus was saving money. A big stack of paper plates, some crappy packaged toppings, and some no brand boxes - the staff seemed flustered and a little unorganized (maybe they had a big rush not that long ago?! I came around 5pm)- they were still friendly  Overall I feel that the owners of this chain decided to get involved in the fast fired pizza craze and they cut corners everywhere they could to increase the profit margins. It feels like a solid AVERAGE 3 star establishment.   If you are a local, as of this writing- there isn't a MOD or Blaze pizza nearby. This seems to be the local chain of Cleveland. So, not having other options, this place is pretty dope.   (There is one Blaze pizza joint in Canton- and one coming soon in Mentor- so if you're in those areas, give it a shot and you will see what I'm referring to).   I also realize that my Opinion only represent this location and not all, and could have been circumstantial. However first impressions are powerful- and upon my first impression, I wouldn't return nor recommend to anyone."}
{"text":"Delicious, quick and inexpensive! The concept is similar to Chipotle style where you choose your sauce, toppings and cheese. They also have several options they have already created. I was with two other people and we got the Austin (Bbq chicken) and made our own with sausage and peppers with red sauce. Just those two pizzas and a cookie was great to share and only $23. They were ready in about 3 minutes and tasted great and so fresh!  The customer service was wonderful too. Everyone seemed to really be enjoying their job and they even brought the pizza out to us when it was done and cleaned up our plates while we sat and talked.   We headed there before seeing a movie at the theatre right behind it. Worked out great! Wonderful spot for lunch!"}
{"text":"I was really looking forward to trying this, but I don't think I'll be back. The toppings, sauce, and cheese were all good. I got authentic red, fresh and shredded mozzarella, black olive, roasted red pepper, mushroom and garlic.   HOWEVER, the crust was so floppy, almost soggy, that you could barely hold it without all the toppings falling off.  It was just extremely soft. Not crispy at all till you get to the actual end crust. The crust was just so flimsy and soggy that it ruined it all for me.   I'm sticking with Napoleons for pizza"}
{"text":"Went to this location for the first time and it'll be the last !!!! Not friendly staff at all. Never was greeted. Had to ask were to place are order. The male stated \"right here\" . Rude not a happy person. So a lady came over asked what we would like . Order a med size pizza , realized it was to small , asked for a large pizza which was not even made yet. It seemed at this point it was a problem. Attitude  from employees started. All down here from here.  The large salad was pre made and was terrible. Very waterier. If it was fresh I'm sure it would be good ! Then the  Pizza came out . They charged us add'l dollar to have shredded cheese  to are pizza . Very unacceptable with the cheese. Whatever ! The pizza crust was good , put the sauce was terrible... So So So salty !!! Not impressed with Pizza Fire at all !!! I would suggest not to go there .  Nasty !!!!!"}
{"text":"Pizza Fire has been in my view at work for the past few weeks and I was excited that it finally its opened doors last week. I'm a huge fan of the Romeo's Pizza chain and with this being a creation of the owner of Romeo's this was a no brainer for me to try. I found my way there today for lunch a little before noon to beat the lunch rush of downtown. I was glad to see that the line was not out the door but there were plenty of patrons in line (almost no seats available).   This place definitely has the \"Chipotle\" feel as you go down a line creating your masterpiece. You get the choice of sauce (I went traditional), cheese (shredded mozzarella in my case) and multiple toppings (pepperoni, Italian sausage, green peppers for me) all from between 6-9 bucks, based on how many toppings. The pizza crust is very thin and cooked in a revolving pizza stone oven that cooks your lunch in no time at all. They give you a number and you pick it up when called.   I thoroughly enjoyed my meal. The pizza was the perfect size for my lunch and I would say someone who does not eat as much would definitely have leftovers. The traditional sauce was spiced well and did not overtake the pizza. The crust was chewy and crispy in all of the right ways. The toppings were fresh although I would most likely not get the Italian sausage again, it was too crumbly for me and didn't add much to the overall taste.   Big kudos to the staff as they were all super pleasant even being bogged down during the lunch hour. What I liked was that the establishment was properly staffed and everyone working had a purpose, which makes for a good operation. I waited probably no less than 10 minutes with a long line, which is a good wait in my eyes for downtown lunch spots. The price was right and the dcor and restaurant itself was super clean. I will definitely be back to try another pizza, most likely one of their signatures"}
{"text":"Have since sent three different emails anytime I drive by one and can just remember to do it no responses but the company continues to grow so maybe I had a bad experience but as a corporation you think they would reach out and apologize or at least reach out"}
{"text":"Only thing I like is bacon ranch sauce. After that this place sucks. I think the owner Is a nut job. Every time I've gone there. They changed it for the worse. No more unlimited toppings, everything is extra. No more chipotle like. They play the music sooo load. You can't even order the food. Very weird!!"}
{"text":"My girlfriend goes to Kent State University and I live about 2 hours away and everyone I come to visit I'm always wanting to go to pizza fire because it is such a good place to eat with amazing pizza. Clean place, fast service, very customizable, and great atmosphere. If you were visiting your student that attends KSU or just having a to go by here and need a quick bite to eat, i would highly recommend this place!"}
{"text":"If you'd like a quick, fresh pizza, this is the place. I had the New York with red sauce and the spinach, broccoli and tomatoes were generous and fresh.  We also had the Chicago which is like a meat lovers ~ but not too much meat. Worth a stop for sure. Eat in or carry out. Clean dining area too."}
{"text":"I've been here twice now.  I'm going to toot my own horn and say I'm a pizza purist and aficionado.  I've had some of the best NY style and Neapolitan style all over in Brooklyn, Manhattan, DC, etc.  For a chain doing this and for a reasonable price, Pizza Fire is outstanding.  I guess it is a mostly OH chain with franchises in certain other markets/cities.  They have the domed brick oven churning out the pies quickly.  Note: they have it setup as a rotating timed surface in the oven probably to prevent the kids working there from messing things up.  I asked them to keep it in there a little longer so I have a little more proper char and crispness since I don't think the temp in there got up to 800/900 degrees.  I'm a purist so no BBQ chicken or Hawaiian pizza nonsense.  I chose my own option...their red sauce which is super fruity as it should be using what I think was a San Marzano sauce base and fresh mozz.  I added 3 topping including fresh basil.  Toppings are fresh.  So out the door it was $8.49 for a six-slice pie.  I was super hungry and finished it all but in the past have had a slice or two to take home.  These are one pie per person, though.  They're doing things right for a fast-foodish Neapolitan pizza replication.  In other cities/brick oven pizza spots, basically the same kind and size of pie will start to creep to around $15 when you factor in three toppings.  There is virtually zero difference here.  But, if you are some rube or amateur expecting thick crust, tons of cheese, and grease then this place isn't for you.  This area really needs Pizza Fire though since the pizza scene is pretty pathetic, IMO.  Well done Pizza Fire!"}
{"text":"Had the shrimp scampi pizza and it was delicious! It was a special for March at $7.99. Can't wait to go back and try the Margherita pizza. I'm in the area often and will be my go to place when i'm hungry and need it fast."}
{"text":"Great place to get you a pie in a hurry I came in at a busy time we waited 10 minutes for a pizza called the Chicago Pepperoni ,sausage,and bacon! Great pizza and very friendly service. The inside a nice comfortable booth to sit and enjoy your pie . They have a variety of salads and are on The Uber eats , and skip the dishes platform! Thanks much Pizza Fire!!!"}
{"text":"Fast pizza with a gluten-free crust! It was delicious! I will definitely be back."}
{"text":"Great pizza! The staff were so friendly and kind. We each had a pizza and leftovers to take home. We were too full for dessert but the cookies and the cinnamon sticks looked really tasty! We will definitely visit this restaurant again!!"}
{"text":"Goede eerlijke pizza. Snel klaar en niet duur. Dunne krokant deeg, nog niet de echte dunne Italiaanse maar toch niet de dikke standaard USA bodem. Goede toppings en kruiding. Lekker van smaak. De pepperoni paradise, pizza van de maand, was iets pikanter dan de voortreffelijke Cleveland. Vriendelijke bediening. Ook om mee te nemen."}
{"text":"If I could give negative stars to Pizza Fire I would.  I've had frozen grocery store pizza that was better than this.  I ordered the special of the month (pepperoni something) and received a taco pizza which looked like a nightmare.   So, I called to get my order corrected and was told to call back in 10 minutes so the employee could speak to his manager to get my ordered fixed.  Ok fine - will do.   Called back in 10 minutes and was told they didn't have the right pepperoni for the pizza but could cut it up.  I said that would work.  An hour later I received a greasy, burnt mess of a pizza that tasted like I was eating a bucket of sour greasy pepperoni.  I suggest that everyone takes their business elsewhere, even if it's a frozen pizza from giant eagle.   Also, don't fall for their fresh salads.  I got the antipasto salad that had to be made last week sometime.  The cucumbers were soggy, slimy, and no longer crisp, and the lettuce was brown and watery!"}
{"text":"It's ok, better options out there. First visit. Walked through the door and was confused about which side to order from. I stood in the middle, waited and then after a minute I was told to place order at the other end. They need more employee/customer connection to understand a new concept. I ordered the Cleveland Pizza and added green olives. It was ready in 5 minutes. Cashier was a bit confused on a take-out order with sales tax added.  Staff needed some pepping up. Crust was good, could have used more sauce around the wide edge. Sausage was bland, gray crumbled mix, green olives were good, red onions were fresh."}
{"text":"The table was very sticky. The 'Tuscan' pepperoni tasted like ham - and nothing like pepperoni - we were told it was spicier than regular pepperoni. Also, the toppings were very 'skimpy' - compared to the pizza fire we usually go to near Broadview."}
{"text":"So my last experience with Pizza Fire was a downtown location and let's say it took 3 hours to get my delivery. So I received the coupon that's  in the attachments because of the poor service. Flash forward I try and use it at this location. The girl at the counter asked a manager should I take 10% and he yelled 20%. No where does it say only small or no large. They may want to update their coupons. She did hand the coupon back to me, but I will never come back here. For $13 there are plenty of better pizza shops."}
{"text":"My first attempt at Quick Serve pizza and possibly my last. With all of the quick serve pizza concepts popping up around the country I was excited to try one with local roots. Pizzafire was underwhelming  The dough was pre-stretched and staged. The topping selection was good but quality and freshness were questionable. Staffer helping me was clueless, asked for me to repeat my order about three times and torched my pie while fighting the register.  The only saving grace was a young guy, wish I could remember his name, who jumped in and remade my order after he saw his coworker trying to pass a burnt pizza off on me. Pizza in a pinch and nothing more, I'd rather wait a few minutes longer for a real pie!"}
{"text":"Their pizza is really good, but definitely not worth a half hour wait. I'm still waiting in line as a write this. I've eaten here before and i do like their food but their employees are incredibly slow. As I'm standing here I see 2 people making food but 5 people on staff. The other 3 are standing around doing nothing. The line was not long enough to justify a half hour wait. I am incredibly disappointed in what was a very promising pizza place. There is another pizza place in Cincinatti who have their pizza making line up down to an art. I prefer Blaze pizza over this restuarant (which is exactly the same except fire pizza is more expensive with less toppings.)"}
{"text":"Probably will not be a repeater for me. This pizza is one or two steps above Ci Ci's pizza. Visually the pizza was very unappealing, the crust was very chewy, they were very stingy with the toppings, and I have say this is the first time I've ever had ground chicken on a pizza. Note to self, \"Don't ever put ground chicken on pizza\". HORRIBLE"}
{"text":"Pizza fire is located in the front of a strip mall on Pearl Rd in Strongsville.  Very close to the high school.  Nice location.  You wait in a line and get your pizza made in a line Chipotle style.  That has both pros and cons to it.  Since it only takes them 3 minutes to bake your pizza in a large brick oven that sounds pretty fast.  Biggest downside is if you have 8 or 9 people in front of you you will wait over 30 minutes in line to get your pie.  Pizza itself tastes fresh.  All the ingredients taste really good and fresh.  Crust is thin and crispy outside with a tender inside.  Several options for sauces and toppings make it really tasty.  They also have salads and soft drinks.  At peak times I may use their web site to order a pie to go instead of waiting in a long line.  Stopped in on a Wednesday.  Its kids night.  I thought I was walking into a Chuck E Cheese with all the kids running around and sippy cups all over the tables inside.  Each adult pie gets a free kids meal.  Good deal if I had kids that age.  I like the buy 7 pies and get 1 free card.  They offer it sporadically so I have forgotten to use it a couple times.  Overall, a great place.  Great pizza.  As long as you don't go at peak times."}
{"text":"Nothing glamorous, but gets the job done for lunch or a late night snack after a comedy show."}
{"text":"It's good and since they weren't busy really quick. Not mind-blowing pizza but I enjoyed it."}
{"text":"A little late as this was from valentine's day. We wanted simple and to get to a movie and have wanted to try this place out. Great service  helpful and so many choices  impressed with fresh ingredients and how quick the food came out. We will definitely be back."}
{"text":"Absolutely the slowest service I've ever had. Wouldn't recommend to my worst enemy. The pizza was cold and the drink machine was broken. The employees were ridiculously rude and fought with several customers including myself. Absolutely ridiculous. DO NOT GO HERE"}
{"text":"Tried Pizza Fire for the first time this past Wednesday.  I have a very picky, vegetarian daughter and a picky husband.  My other daughter will try anything!  Omg- EVERYONE was happy and walked out full!  Last night, both daughters requested to go back; and we did! Love that I can split a pizza with one of my girls, too.  Very friendly staff as well.  I am sure this will be our new \"go to\"!"}
{"text":"Dined in today for the first time. Ordered a white pizza with fresh spinach, fresh mushrooms and Canadian bacon (~$8 total). Pizza came out very quickly (before I even paid, got a drink and sat down).  Crust was good. Right crisp and good flavor. However the toppings were very lacking. There were barely any of them on the pizza and the mushrooms were definitely from a can."}
{"text":"When I heard there was going to be a Pizzafire opened in Broadview Heights, I was extremely excited to try it out.            I ordered the Margarita pizza, which did not disappoint. The crust was thin and slightly burnt, but I loved the flavor. Since it is so thin, I finished the entire pizza. The authentic sauce was the best part of the pizza, and the bites with basil were amazing.           I recommend trying out this chain, especially if you like thin crust pizza that is a little burnt on the edge!"}
{"text":"I've been to this Pizza Fire location twice, once when it first opened in which it took me 30 minutes before I could order. The second time was during the KSU winter break and no one was in the restaurant except me.   So if you haven't been to a Pizza Fire before the whole gimmick is that you get a medium sized, thin crust, personal pizza that baked in a rotating stone grill. You can choose from their present menu options for design your own, except any additional toppings costs you about $1 each. It's actually a good deal when you consider the variety of options you can add to your pizza.  The two times I came here I ordered items that were already on the menu. The first pizza I ordered was \"The Cleveland\" just because we were playing Chicago Cubs in the World Series (I really wanted to get The Chicago). Again, it took like 30 minutes to get though the line because they JUST opened and EVERYONE in Kent was there. I ordered the pizza 'to go' and drove home which is about 15 minutes away but by the time I sat down to eat, the entire pizza was cold. I think it's because the pizza crust is so thin and doesn't absorb heat for very long. In addition, the toppings were cold as well. Not the best experience.  The second time I came here the World Series was over, we lost, so I sucked it up and ordered \"The Chicago\". The staff was super friendly, the pizza cooked up quickly and this time I took it back to my office in downtown Kent so that it wouldn't get cold. I was impressed! It tasted great.   You can also order other things here like salads but their main entre is pizza. Would I recommend it to others? Sure. I mean, I wasn't blown out of the water by the pizza but it wasn't disappointing. You might think that it's amazing, or maybe just average. You never know until you try it."}
{"text":"Came here with a group of friends and D for dinner on a Thursday evening. The place wasn't too busy and there was enough seating for our group which was nice. This place is like subway-style pizza. You choose the toppings and sauce and meats and they make the pizza for you in a real wood-fire oven. The toppings looked pretty fresh and they were generous with them if you wanted.  They do have a few pre-made \"specialty pizzas\" as well as you pick pizzas.  D and I decided to go with the specialty pizzas this time. We got one Hollywood and one Margherita. We also got an order of breadsticks. If any of you have read previous reviews of mine, I think of myself as a pizza connoisseur. This pizza was pretty decent! I liked the little bit of char on the bottom from the wood-fire and the crust had a good bite. I enjoyed the Hollywood pizza more than the Margherita and if I were to get it again, I'd add artichokes. As some of the other reviews stated the Margherita was a little salty, but for us, not overly so. The prices aren't bad - for two pizzas, two Peps'is and breadsticks - about $23.  Overall, if I worked downtown, this place would be dangerous for my waistline due to my love of pizza and the fact that I look at all pizza's as a challenge.. leftovers are for suckers."}
{"text":"I was so excited when I saw that pizza fire had opened its doors downtown that I made my way over on opening day! Since then, I've been back twice and each time, the service and the food is consistently great!  The employees are awesome! I haven't encountered a single one that hasn't been friendly and efficient! Once they build your pizza. It goes around in the oven for 180 seconds and it's done! On opening day, my pizza took a few minutes longer because they were getting used to the process and two people went out of their way to apologize - and like I said, it was just a few minutes more. Very sweet. I think I've gone at the right time each time I've been there- I've only ever had just a couple of people in front of me in line, if that. Sounds like peak lunch and dinner times are busy, though.  The process is simple, you stand in line, order your pizzas- watch them flatten out your dough and add sauces and ingredients as you tell them what you want if it's not one of the specialties (subway or chipotle style), then they pop it into their fast wood fire oven. You pay and just a few minutes late, your pizza is ready to inhale!!  They use fresh ingredients. One employee said they literally chop ingredients in the back. Their lettuce is growing in the case in the front and that's what they use for their salads.  My pizza of choice has been the margherita 72. They literally only have enough of the special dough to make 72 of these per day- and they're great! My only critique is that they sprinkle some salt seasoning on the top and the times I've had it, the person has had a heavy hand. So if you're not into super salty pizza, ask them to go light on that (like I will next time!)"}
{"text":"Pizza Fire is decent, fast casual pizza.  I met up with a group of Yelpers downtown for supper club to check this place out.  Dough is made fresh on the premises and all of the pizzas are assembled and baked fresh to order in their turbo oven. Toppings are plentiful and fresh and they have a good selection of sauces and cheeses to pick from.  They offer some cool specialty pizzas.  I had The Hollywood which consists of a base of basil pesto sauce, with chicken, roasted red peppers, roasted garlic, and topped with shredded mozzarella and Ricotta I think? It was good, but didn't wow me the way other pizza experiences can. I think it was probably the crust. I wish it was more airy and fluffy instead of all crispy. They also have pre-made salads and giant fresh-baked cookies. The cookie was pretty tasty.  The interior decor is really well done...bright and vibrant colors. The workers are very friendly as well.  The manager came to thank us for our business.  Overall, this is a decent place for a quick pizza lunch, but I wouldn't go out of my way to get one of their pizzas.  I heard they're opening more chains though, so if one comes to the west side suburbs, I'll give it another shot."}
{"text":"The chipotle of pizzas!!!  Great thin and crispy crust. I have been longing for a stone cooked pizza and was not disappointed. Quick and friendly service. Have not seen the last of me!"}
{"text":"Tried Pizza Fire for the first time tonight and loved it! Purchased two pizzas to go and chose a variety of toppings. All very yummy! My niece tried the margherita and devoured it. Our family will definitely return again and again! It's great to have local pizza that doesn't taste greasy or overly processed like most chains do. Crust has a great texture and the flavors are exactly what you'd want from a fresh pizza. Worth the visit!"}
{"text":"I tried it twice and was not impressed. First when it opened I noticed a manager making the employees count toppings. What's wrong with a little more? Both times the pop machine was out of most types of soda."}
{"text":"I have been dying to try this place out and I'm glad I did!  After reading some reviews, I wanted to get there a little early because I thought it was going to be packed. Nope, not packed at all...not even close. But who cares, I didn't have to wait in a long line! I don't know why it felt different to \"build your own pizza\" when you already do that at other pizza places. For some odd reason, lol, it felt different at Pizza Fire. I decided to get the Neapolitan red sauce and three toppings (free range chicken, black olives and jalapeno peppers). For all you gluten free peeps, they do have gluten free crust for an extra fee.  Staffers were okay, no complaints here.  Because it was kind of empty, I didn't get a number, just stood off to the side and when my pizza was done, the guy handed it to me. I actually like the thin pizza...crunchy, a little on the charred side but still yummy. I really love the red sauce, it wasn't sweet or can't think of the word but it was really really good. I do wish they would sell alcohol, a nice cold cider, ale, or even beer would go even better with it.   Two thumbs up!!!"}
{"text":"I was really surprised at how much I actually liked this place.  For one, I don't really like thin crust pizza all that much, and two, the space from the outside looked quite commercial to me, which is just not my personal preference.   That being said, I ended up enjoying eating here much more than I thought I would. I ordered the Margherita pizza (which was around $8 and change). The pizza was really delicious, super thin and crispy crust, but not so thin that the toppings bleed through. The toppings weren't low quality either, everything seemed really fresh and tasty, and the portion size was perfect for me.   The space inside feels like any other franchise, but it is comfortable enough and there is plenty of seating. My only complaint here would just be that the music seemed a bit too loud for a conversation (or maybe I'm just getting old).   The real star quality about this place though was that the pizza was ready SO FAST. Like, I realized it was thin crust so it takes less time to cook, but this was like Jimmy Johns fast. Coming from someone who only gets a 30 minute lunch break from work, this quality bumps this place up about 3 notches in my book. That combined with the friendly service and unlimited fresh brewed iced tea makes it a winner for me, and I definitely will be returning!"}
