{"text":"Great pizza and great service! Loved the tasty red sauce, crispy crust and friendly atmosphere."}
{"text":"Overall the atmosphere was fun, service was good, but given the other awesome restaurants across the street on E. 4th, you should eat somewhere else.

Giant meatball was okay. Good, not great. It was lacking flavor and the meat was dry.

We also ordered the Spicy Pie. Again, good but nothing to rave about. I like that it was oven style pizza. I think I was expecting a little more flavor and WOW."}
{"text":"Arrived at 3pm so there were only about 10 people sitting at the bar. Stood by the \"wait to be seated sign\" for about 5 minutes and no one ever addressed us. We ended up walking out! Horrible customer service!"}
{"text":"Best thin crust pizza I've ever had (and I eat a lot of pizza)! Spicey sauce is where it's at. Great beer selection, and the service is great. Excellent experience all the way around."}
{"text":"We stopped here while visiting from out of town.  Pizza was fantastic with blended cheese.  Would definitely come again if in town.  Great, friendly service also!"}
{"text":"Stumbled upon this place after an Indians game. We had some of the best thin crust pizza I've had in recent memory. We ordered plain cheese and our friends ordered the marguerite pizza. Both are pretty plain choices, I know but they were delicious! Also had a small side salad with mine. The salad was a step above average. My only complain would be that the salad was served in a metal pan. Personal pet peeve is the taste of a fork that has touched the metal pan. I know I'm crazy! Beer selection was also good. I wish I lived closer to have this become a regular pizza spot in my rotation!"}
{"text":"I love this place. I would highly recommend their buffalo pizza, though everything on their menu is great, along with a full bar with my favorite beers on tap."}
{"text":"Pizza was okay, service fair.  Craft beer selection was nice but temperature was a bit on the warm side.  Had a side salad which was iceburg and pizza cheese, unimpressed.   Based on the price and very average food, I wouldn't go back."}
{"text":"Loved this place! We were in town for just a few days and ended up here just as a baseball game and two concerts were about to start. So... The wait was long, but in the end, totally worth it.

Pizza is delicious. The crust is perhaps the best part -- crispy on the bottom, but just the right softness and taste.

We also tried the mac and cheese, which was excellent."}
{"text":"This is easily the best pizza I've had in Cleveland since we moved here from Chicago 6 years ago. The crust is thin and crisp and delicious. The sauce is light and very flavorful. Everything was fresh and perfectly prepared. I feel lucky to have stumbled into this place."}
{"text":"I went to Pizza 216 with my boyfriend last night. We ordered \"The King\" pizza and it was absolutely delicious. The server we ended up with was friendly as well. I may never go back again due to how we were treated in the beginning.  A host/waiter greeted us and then told us to wait and ran off to the back. I was fine with that until the guy came back and didn't say anything to us and was chatting with the waiter we ended up with about how it was his turn. He told us that he would seat us and told the other waiter that he would tell him where we were sitting. Basically he was pushing us off on someone else. Then he told us we could sit where we wanted. That made me upset because why should we have waited by the hostess stand for so long if we could sit where we wanted? It was rude. I understand that it was the other waiter's turn to have a table. That was completely unprofessional to act like that in front of customers. It made me feel unwanted there. I don't care if the pizza is absolutely amazing. There are many other restaurants in Cleveland that treat customers well and have delicious food."}
{"text":"A Great brick oven pizza the crust was just thin enough and the buffalo chicken salad was awesome the salad dressing was tasty the place is cozy and the staff were friendly"}
{"text":"I work in downtown Cleveland and when I want a VERY good cheesy, crisp pizza with my favorite toppings, this is my \"to go\" place.  Service is always top notch, the owner is always on hand and the pizza always comes out perfect.  I love this place."}
{"text":"Best new restaurant in downtown! Great service, hardworking staff, and solid management.  Couldn't find one item we wouldn't order.  Kids had a blast and also ate everything we put in front of them. Looking forward to returning very soon."}
{"text":"Great food great service.  Our waitress recommended the perogi pizza and it was fantastic."}
{"text":"Really great pizza.  Perfect for a quick lunch since the pies only take 2 minutes to make and cook.  Also have a really nice bar setup and extensive beer list.  Dinner menu offers apps and other items not on the lunch menu.  I'll be back often."}
{"text":"My wife and I stopped in here last weekend while passing through town. We ordered the Margherita and the Spicy Pie. Both were phenomenal. My wife has lived in Brooklyn for the past 4 years and she said \"this is the best pizza I've had outside of NYC.\" 

Also, they've got a respectable selection of beers on tap."}
{"text":"Nice new downtown spot for pizza. Oven visible from almost anywhere. Had custom pizza which was excellent. Service slow but it was sat night and game night. Will come back."}
{"text":"The menu looked good, but service at this place was Lacking. We waited 15 min for the only overworked bartender to even get to us, so finally we get a drink, 15 more minutes and this poor girl finally has time to get to us...then she tells us they are out of the ingredient of one of their signature pies. Paid and left. I understand it is a new place so suggest waiting until they work the kinks out"}
{"text":"The best pizza in Cleveland! Garlic knots are pretty good too. Highly recommend for lunch or dinner."}
{"text":"Johnny, glad to see you checked the tape.  The guy quoted me 20 minutes, why did he do that if he could not commit to the time? Did you see the person in front of me that was being apologized to upon my arrival because their pie was so late? Did you see the amount of time I stood behind the counter before someone helped me at the different times?  Did you see your staff member eat a piece of patron's food while working behind the counter? Did you see that my order was not even placed on the line? Did you see the lady lie to me when I arrived and said it was only going to be another 5 to 10 minutes, then scamper to the back to even find the order? Did you see the three guys behind your counter just clowning instead of cooking?  The only thing I saw them cook during the time I was there was two orders of garlic knots - maybe that's why you were so far behind?  Did you see your hostess was hanging outside petting her dog when I arrived at a place of business with a sign that says wait to be seated?  Heck, did you see that none of your TVs were even tuned to the Cavs game?  I could care less about a discount - after being lied to and watching the guys making the food just goof off I was ready to go.  
 
BTW I really like Cleveland.  Where does your angst about that comes from? Keep living on your laurels instead of addressing the issues of over promising and under delivering, and having employees that are counterproductive.  Remember this was my experience of your business not how good your pizza tastes - how many others have felt the same way and not said anything.....I'm sure you make good pizza, but if it is a pain to get and you're stuck dealing with a bunch of clowns - because they are acting like goof offs - sorry man I got better things to do."}
{"text":"Staying at the Hyatt, and the entrance through the arcade was open so we walked in and stood around awkwardly. No one told us what to do, so we grabbed a seat in the window where we found a menu. Waited 15 minutes, no one came by. My partner went to find someone and a guy at the other entrance said it would be 15 minutes before we could get a table. He said we've been sitting at one for 15 minutes already, and the guy didn't seem to understand. Told us we could sit there but he would come get us when he found us a table. Frustrated, we ordered pizza to go instead. Tried to sit at the bar to get a water while we wait, but unfortunately we have a toddler so was told we couldn't sit there. Not exactly what a overheating pregnant woman wants to hear. Glad the pizza is good because the service sucks pretty bad."}
{"text":"Sometimes I wish I never had the spicy pizza because now I crave it almost on a daily basis! It's a must try! You really can't go wrong with any item on the menu- they're all delicious! So glad they opened... This is the kind of pizza Cleveland has been waiting for!"}
{"text":"This restaurant was a pleasant surprise. My husband and I were there on a Thursday night at 9:00 PM. The atmosphere was fun and upbeat. The host, Christian, was also our server. He was very attentive and pleasant. Now, for the food. We ordered the King pizza. YUM! The ingredients were very fresh and it was baked to perfection! We will definitely come back, should we find ourselves in Cleveland again."}
{"text":"The owner is very attentive and took care of us the entire visit. Food was excellent, drinks abundant, atmosphere chill and we will be back."}
{"text":"This is a good pizza! Actually is not soggy I've been eating pizza everywhere and it's soggy this pizza is still crunchy and it's thin. Most pizzas get soggy very easily but this one even tho is thin is just amazing!! Definitely recommend it! Plus they have a happy hour menu"}
{"text":"Ok spot. Maybe they couldn't handle 2 guys and the RNC crowd.

Came here for a quick dinner while working. Place looks great. Definitely a good chill spot for drinks and good talks over food.

Once we were seated that's when it got interesting. They don't do anything smaller than a large.... Not cool. So I ordered a Mac and cheese with ham and bacon. Came back to find out you can't put ham in it (even though it said add any pizza topping you like). Our server was new and not very knowledgeable about the food.  It wasn't extremely busy but the food  was late.

Great spot just not a great experience... Too bad."}
{"text":"Came here really late. Kitchen closes at 10, but they can still make you a delicious pizza. 
We had pierogi pizza and plain cheese. They were both great. 
Crust is thin which I love.
Friendly people!"}
{"text":"This place really exceeded my expectations! We were seated right away, however we asked to be moved because of a draft. No problem, they moved us quickly without a complaint. 

Next we ordered drinks and food. We got a pizza half pepperoni, half cheese and we got an order of their Italian Nachos... These things were DELICIOUS!!! Pasta fried chips, almost like fried wontons, topped with house made cheese sauce (amazing), pepperoni, sausage, and pepperoncinis. They came out piled high, you could easily feed 3-4 people!! The best part was that after eating half of them, there was still plenty of toppings on the under layers of the chips! No scraping the plate looking for toppings - there's plenty!

This pizza is so good, so fresh, and not super greasy. The crust is hardy and the pizza itself is super thin, as if they were trying to be like a NY style but on a smaller scale. The pepperoni was crisp on the edges and has a slight kick too it, which I love in pepperoni! 

The service was great, too. The server remembered our drinks, kept them filled, and was consistent in stopping by to make sure we were okay without hovering and without us having to flag him down. This was a great experience with great food and service. Highly recommend."}
{"text":"Opening again in February 2017, Pizza 216 brings brick oven, NY style pizza to The Land. 

We were craving a 'wood-fire' type pizza on a Friday night and checked to see if Pizza 216 reopened following some bad luck structural problems. My wife and I were so happy to see they were, and man they were packed. We were lucky to get a cozy 2 top and a great tag team of servers that didn't let us go thirsty or hungry. 

For a pizza place Pizza 216 has a great beer list and small plates menu. We ordered a couple craft beers from the tap list and an order of Brussel sprouts as we settled on the pizza (s). The Brussel sprouts were huge and tasty, perfectly crispy and well seasoned. 

We couldn't decide on just one pizza so we went with two. A pepperoni with spicy red sauce, and the Bianca with mushrooms on half. The pizzas came out in less than 5 mins, and were perfectly cooked, which is a byproduct of there brick oven cooking style. I was surprised it wasn't more expensive based on how much we ate."}
{"text":"Great service pizza was fabulous. Decor is awesome. Owner Johnny was the best. Extremely welcoming and personable."}
{"text":"Just had our first pizza at pizza216 and it surpassed my expectations for Cleveland pizza! We were feeling lazy and go it take out and the pizza was still delicious. Decided to make our own pie with spicy sauce, mozzarella, mushrooms, garlic and pepperoni. The ingredients were great quality and the dough was tasty yet not overpowering and too thick. It's somewhat pricey, cost us $21 and the pizza easily filled 2 people. Can't wait for our next visit. Next time we will definitely eat in house and enjoy the atmosphere."}
{"text":"Good, chewy New York style thin crust.  Toppings and cheese were sufficient and appropriate for the crust. Fun spot and great service."}
{"text":"I got the Pierogi pizza it was AMAZING!!! The staff was really nice and helpful. Our waiter was awesome too. They had this very interesting way of making their Italian nachos that I've never seen before. It was soooo good and tasty. Please check this place while you're in Cleveland!"}
{"text":"After walking around downtown Cleveland for an hour or so, it was time for lunch. We couldn't decide what to have. There are a LOT of choices in that particular area. We eventually decided on pizza, and this place had the reviews and menu pictures to back it up. 

We went with the margarita pie. I often like to test a new restaurant by its simplest item, and this was their equivalent to a 'cheese pizza'. The sauce was on point. It tasted very home-made, which I am a fan of. There was a good balance of cheese to sauce ratio and the cheese had a very appealing, fresh flavor as well. The rough-cut basil added that extra zing and the crust wasn't too thick or thin, and had a great chew to it.  It was lightly charred as well, in a good way.  

They even brought us a free pizza at the end of our meal because they had \"made too many\". That was the cherry on the sundae for us."}
{"text":"First time here and I'm really impressed. Pizza is very good and locally sourced. We got the spicy pizza and it was amazing. The crust was just right and the spice was perfect. Service was friendly and I'll definitely be back."}
{"text":"Love this place! Great service and tasty pizza. We started with the Brussels sprout appetizer. It was plentiful and very good. We had the white pizza and mushroom pizza. The crust was light and flavorful. Will be back."}
{"text":"Stopped by while in town on a work assignment. Good decision. 
Sorry to say I forgot what the pizza I had was called. Been a few days since I was there.  But it had lots of meat and was spicy and, well, damn good!  Yeah!  
It was a normal size, around 12\", and I usually only eat maybe just one piece less than half. I ate 3/4 if it because it was so good. Really.

Definitely going back next time in Cleveland !"}
{"text":"So good! Love the thin wood fired pizza. The atmosphere is also great, very modern. They have several TVs with sports on, staff is friendly. Almost all tables are high tops, which feels more casual, but not my personal fave for comfort."}
{"text":"Went on Saturday night 7pm. Pizza excellant. Had the white was one of best white pizzas I've had. Had the red with garlic and mushroom also very good. Brussels sprouts appetizers very good and plenty for two. Too many places serving pizza now but this place will make it and the average places will be out of business quickly."}
{"text":"Best pizza in Cleveland, hands down. We have not had a GREAT pizza place that I can think of in 10 years of living downtown . Great food is what sets Cleveland apart from other cities so rank this one up there with our top restaurants. This place will have a line out the door as soon as word spreads about the quality of this place so go now before you can't get a seat."}
{"text":"Great pizza. Fast and fun options. I wanted more variety on tap - 50% IPAs. Feels like a sports pub with TVs and tall tables. Would definitely eat here again."}
{"text":"I had heard great things about this place, so I popped in at 11:30 this past Wednesday for lunch.  No one even greeted us, and when someone finally did, it was a very grumpy young woman working the cash register and ordering area--she was in no hurry to take anyone's order.  I also thought it was odd they had Diet Coke but no regular Coke.

The pizza was OK and decent for the price, but it was nowhere as good as I'd heard through social media.  It was not anything special at all.   I will not eat there again."}
{"text":"Great place and really nice service. Cool spot in downtown Cleveland. The wings could use a little bit of attention, though."}
{"text":"Although it can be a bit pricey if you have multiple drinks and food, I love Pizza 216! I've never had an item off the menu that I didn't like (my favorites are the brussel sprouts, mac and cheese and all the specialty pizzas) and there are so many beers and drinks to choose from. The service is great and all those who work there are friendly and accommodating. Highly recommend Pizza 216!"}
{"text":"From our of town and we ordered food from 216. The pierogi pie was outstanding! The garlic knots were on point as was the marinara sauce! The manager was from my hometown too so always a plus!"}
{"text":"I thought this place was awesome. I went to go back on Sunday, just to find them closed. I wanted to try their pasta nachos or whatever they are called. I just had a pepperoni pizza on Saturday, but absolutely loved it."}
{"text":"Awful. The pizza bianco was good, the mushroom pizza was awful. Fried pickles were ok except for the heaps of crumbled cheese on top which didn't compliment the sourness of the pickles. Crumbled cheese does not automatically make food look or taste more appealing. The mac n cheese was average. We went with our four kids and were made to wait almost 20 minutes while they \"got a table ready for us\", meanwhile sat 3 other parties (of 4-5 people each) who came in after . There was no shortage of space, the place was half empty. Finally we get seated. Wait almost ten more minutes for someone to come by to say Hi and bring water. Once the food was ordered it didn't take long to arrive. When I used the restroom there was a manager (I assume based on her directing staff earlier) just lounging against the sink on her phone while there was a huge pile of wet paper towels on the floor and no clean ones in the dispenser. I'm not a super picky person. I like decent food and clean restaurants, but got neither at this place. Wouldn't return unless they seriously improved."}
{"text":"Omg, great pizza made by my Athens Georgia brother NATE, then John the bar tender made perfect dirty martinis, make sure u ask for Ciroc vodia! Then you know your in the right place when one of the owners A different John... makes your pizza as well.
All in all one of our favorite places in cleveland. And we ate in little italy two nights... Eve and Louly columbus Ga..."}
{"text":"Short review: 
- service is great
- food is bomb
- price is decent
- location is nice 
I had a great time. (: (making your normal buffalo chicken pizza tastes amazing btw)"}
{"text":"Hands down the worst downtown Cleveland dining experience I've had in years. To say the service was non-existent would be too generous: our server was defiantly inattentive. It's as if she knows how awful the situation is at this restaurant and has decided that \"owning\" it is her only option. We had made reservations 90 minutes before the start of the Cavs game thinking that would give us plenty of time. Wrong. We waited 20 minutes to be seated, 15 minutes before the server came to our table, and 45 freaking minutes to get our food. All the while, servers avoided eye contact with guests for fear of being asked just what the hell was going on. 

How was the food you ask. Let's just say that I should have taken Joe Tait's advice (whenever he got a rumbly in his tummy) and ordered a microwaved DiGiorno at the game instead."}
{"text":"Yay!!! Finally a Neapolitan style pizza place! First, cool vibes in this place and the wood fired pizza oven looks awesome. It will be so cozy in the fall and winter. I saw some bad reviews regarding service (between being new and being busy w the RNC), but ours was great! We were told 10 minutes for a table, but they got us in quicker. Our server was very attentive with checking on us for drinks and asking how the food was. The appetizers we got came out decently fast too. We split the fried mozz, beet salad, Brussels sprouts, and Italian nachos. The Brussels were soooo crispy coming out of the oven. They were perf and the balsamic was nice and sticky drizzled over it. I have mixed feelings with the Italian nachos. The \"chips\" were fried Ohio City pasta bites. They seemed more like fried wontons. They weren't bad, but it was just kind of weird. The toppings though were delicious. It had crispy pepperoni slices and crumbled sausage and the creamiest cheese sauce. The waiter gave us the brilliant idea to keep the dish when the \"chips\" we're gone so we could dip our za crust in the sauce. Finally the MAIN EVENT. We got the Margherita and Bianca pizzas. The crust is totally nailed. These slices have a thinnnn crust which is nice and chewy on the bottom with soft, pillowy edges, everything crispy on the outside. The Margherita perfectly balances the sauce, cheese and basil. The Bianca, holy garlic. Beware vampires and people on first dates. I love garlic, so I dove in head first. Now I am in a pizza coma and content in dreamy haze; it made my walk home through the nutty RNC and protesters sections nearly pleasant."}
{"text":"Great food. In town for work conference and stopped here on a Monday night for happy hour. Had a glass of wine and small pizza. Plenty of food and the wine was generous!"}
{"text":"Not impressed with the beer choices for a \"craft\" bar.  Garlic knots and service was good though."}
{"text":"Enjoyed the Buffalo Chicken Pizza. They forgot my blue cheese but gave me crumbles to put on top which was fine. The wait was not bad at all considering it was a brick oven pizza! Good customer service!"}
{"text":"Came to Cleveland from California for work and found this newly established gem.  The food was amazing from the presentation down to the taste.  The chicken wings are a must try!  The Bianca pizza is a great choice if you want to skip the traditional pizza with tomato sauce.  Johnny, the owner, is very friendly and leads an amazing staff.  Gabriella was so sweet and accommodating.  Don't miss out if you are in the downtown Cleveland area!  Thank you, Johnny and staff!"}
{"text":"Ordered pickup from Pizza 216 and was pleasantly surprised. Was quick, priced well and tasted fantastic.

Absolute favorite was the white pizza. I know it might seem like sacrilege for an Italian to say they prefer white pizza over that with red sauce, but that's long been the case with me. And this was even better than I expected. Great crust (thin, chewy and elastic) + great ingredients = great pizza .

We were able to get a couple pizzas that appeased all appetites from the pickiest to the more adventurous in our group."}
{"text":"Good, solid pizza place. Thinner crust pizzas and lots of local beer option. Another reviewer said they have vegan cheese but they don't."}
{"text":"Just opened in Cleveland, well worth the visit.  Wood fire pizza is hard to come by, making this place a freaking gem. Food was most excellent!"}
{"text":"My first time visiting Pizza 216. Our work team, went as a group of 8 for lunch.  We entered thinking that the restaurant was full service....well it's not, even though we had a reservation. We actually had to go back to the counter, after seating ourselves, to order, individually.  For those that ordered salad, there was pick-up at the counter, and then your name is called once your pizza is ready.  There is also a do-it-yourself, water station with plastic cups.  The food was  definitely a 4, but the experience was a 3.  The side salad was tasty, but a little bit small, and the pizza was pretty tasty, I'll admit, generous toppings, nice crust.  I'm sure this business model was created to save $$$$, but it just didn't work for me.  For the time and effort put into opening the restaurant, the space is nice, but there are 2 other casual pizza places within a short distance, that I would frequent for the \"do-it-yourself\" experience.  I'm hoping that maybe dinner is full service?  If not, I doubt that I would return."}
{"text":"Went to pizza 216 last night with my girlfriend for the first time. Now, we LOVE pizza. It is our go to whenever we are undecided on dinner but tonight was a Lil different. We checked out Cleveland's best pizza places list and thought pizza 216 looked a lil more upscale for date night. We made reservations but they weren't busy at all when we got there. We were seated at a high top that was literally the size of my purse, with a large pizza stand on it. Besides the table size, the decor was nice and the staff was friendly. The prices are a lil up there in terms of pizza but I expected this out of a downtown location. You can't half and half a speciality pizza which I was disappointed about (my gf isn't as adventurous as I am) so we settled on a pepperoni pizza and garlic knots. The garlic knots were delicious and came out quickly. Our waiter was only two days on the job but he did well. The pizza oven is visible so it was nice to watch them working. Decent beer list but was out of the one I wanted.. the pizza came and looked amazing.. strangely coming out of a super hot brick oven, I was able to take a bite immediately. It wasn't as hot as I would've liked. The crust is super thin but didn't have that charred bubble on the bottom that you look for from a brick oven. It was actually kinda floppy, the cheese was amazing and the pepperonis were great. I was just expecting a little more crunch and bite to the crust"}
{"text":"The pizza is pretty good but overpriced considering there are a lot of great places in town. For perspective we got a specialty pizza and it was 20 dollars. It's a good place for groups, or sports. There was a vibe that I can only describe as grown up frat boy. I would get take out if downtown for an event but not a place I want to spend time."}
{"text":"We came from a Cavs game and we're surprised to find it not full and busy! We didn't have pizza but had the Garlic Knos (they looked like bow ties!), mac and cheese with jalapeños and the chicken wings. All was delicious! $50 out the door with two adult drinks! Can't complain."}
{"text":"The wait was outrageous but with it being game night we understand even though we called ahead for the two of us. Took quite awhile for our drinks to come but our pizza came quickly. The taste was so yummy as it was authentic and we had \"the king\" and it was perfectly cooked and offered a lot flavors."}
{"text":"Horribly stupid takeout system. You have to wait in line at the bar along with people trying to buy drinks."}
{"text":"This was my first time visiting Cleveland - media covering the RNC here. This place is in the arcade where the Hyatt Regency is located which is where I stayed. So convenient! This place is absolutely great. They have been only open for a couple weeks and damn they are doing a great job. Their owner and staff are fantastic. Absolutely loving their pizzas and their service. Thanks again for the great hospitality for my week visit here in CLE! Go here for great food and friendly service!"}
{"text":"What a unique pizza experience! Pizza 216 has a menu with specialty pizzas, or you can tell them exactly how you want it made. The pizza is personal size and it's only about $8. They have a wide variety of meats and vegetables that you can mix and match. They also have vegan cheese! Service was super quick, food was cheap, and I was full when I left. Will definitely go back!"}
{"text":"Decent place for pizza and drinks. 

Not the best pizza you'll find in Cleveland (that goes to Crust) but a decent place for a beer and pizza.  Pizza 216 is definitely a step up from the nearby Pizza Fire, and with few other options for decent pizza downtown, I'll go back. 

Standard brick oven pizza - nothing really stands out about the crust, and the toppings won't blow your mind either.  

Brussel sprout appetizer is fantastic though and would definitely recommend that."}
{"text":"Pizza 216 has such an amazing vibe. I came in on a Saturday night and ordered the crab cake appetizer. They were the most AMAZING crab cakes I've ever had. Little to no filler; all delicious crab meat. The bartenders, Jess and Darren were super personable and accommodating and the music was great. Can't wait to return!"}
{"text":"Well, I was going to give this restaurant 4 stars, but then I realized that I was overcharged for the happy hour items. I came into the restaurant 10 minutes before 7 pm. The menu said $4 cocktails and $5 cheese pizza. Somehow, I left with a $16 bill before taxes. Not a huge sum of money, but irritating no less.

Update: The owner reached out and explained that the cocktail I ordered wasn't under the happy hour price. Not sure how I missed that, but he gets an extra credit point for reaching out and looking into the issue. This is how you stay in business. Thanks, Johnny!"}
{"text":"The service is horrible. Took 15 minutes to get initial service, took 20 minutes after that to get drinks. Food was undercooked and horrible. Appetizer was completely flavorless. One Long Island which was two sips and mostly ice was 12 dollars. Will never return here."}
{"text":"Best man n cheese in cleveland. Love the brick oven centered fire all to see.i had great drinks and excellent service. Well definitely go back again and again."}
{"text":"I ordered online earlier this week with the yelp eat 24 hours. I set it so that I could pick it up at a certain time. I set it for 45 minutes after the order went through. I showed up a few minutes late, and they tell me that it is in the oven baking and will be out in a minute. Which that is fine with me. About every 3 minutes the cashier would come up and say another minute, it is in right now. (half the time the oven was empty) After more than 15 minutes of just 1 more minute, the guy tries to hand me a pizza that is not my pizza. I instantly reject it. He then goes up to the cooks and they all try to talk quietly about the fact that no one made my pizza, even though I've been standing there for more 15 minutes. Before they even start making it, the cashier guy comes up and says it'll be another minute, it's being baked right now. Now that might fly if I could not SEE them MAKING MY PIZZA and LITERALLY NOTHING IN THE OVEN! After more than 20 minutes of waiting, I finally get my pizza, half burned. For the wait I had, I could have walked up and ordered and got it faster than my wait for an order that was supposed to be ready when I arrived. 

If you're going to tell some it's in the oven over and over again, you should probably make sure that they are not in eyesight of the oven. 

There were girls standing waiting for salads and they were there before I got there and were there after I left. It's just that they had made it wrong."}
{"text":"If I could leave 7 stars, I would. I'm a freak about pizza, and in the Cleveland area the only other place that really \"does\" it for me is Dewey's. So, if you like Dewey's and/or NY style pizza then I HIGHLY recommend Pizza216. 

Our first experience was made at a recommendation when we were staying at a hotel downtown (the Schofield across the street.) We ordered takeout and it *literally* changed my life. When you're pizza serious and  haven't been able to find the spot that really hits your spot, it's slightly depressing. So ya, life changing. 

We lived in Lakewood and would take Ubers into the city JUST to eat here. The Brussels sprouts, garlic knots and plain old pepperoni pie are our usual order. The pizza has a light, airy crust and is a thin crust. The ingredients are sooo fresh and the red sauce is sooo good (not sweet though, it's a pizza sauce not marinara sauce.) 

I love sitting at the bar and watching them make the pizza (hand tossed) and then rotating them through the brick pizza oven. So entertaining! 

And now, the service. Since we we always sit at the bar we typically get Jess as our bartender. She's awesome! 

We've also had a chance to meet one of the owners, Johnny, and really appreciate his presence in his business on a Friday night. 

We recently moved to Playhouse Square and are chomping at the bit for them to re-open. Can't wait!"}
{"text":"No local beer was available! What a bummer since I was from out of town. I will say it was the only reason they are getting 4 stars. The service was great, the place wasn't too wild. Lots of fun to mellow or after an extremely long day."}
{"text":"Date night on Saturday, after a comedy show at Hilarities ventured to Pizza 216...sat at the bar, crowded, ordered a caeser salad and large \"King\" pizza... pie was up in about 15 minutes... salad was fresh Shaved pieces of parm covered in caeser dressing... I would recommend salad. The King was delicious, green pepper, mushroom, pepperoni and sausage... 216 has NY style thin crust which is my personal favorite... makes it easy to \"fold\" your slices as you enjoy the delicious ingredients... pepperoni and sausage were very good, would have liked a bit more sausage on the pie ... wait staff friendly and efficient, very satisfied with meal and whole experience... since I live in Columbus I won't be a regular, however I will visit 216 again as I visit the \"land\" , I think you will enjoy their pies!!"}
{"text":"great pizza & an awesome atmosphere! it even worked out perfectly for an hour lunch break during the work week. the owner & staff were super nice too. cant wait to go back!"}
{"text":"Order a pizza online, showed up 20 minutes later (super hungry) to pick up the pizza only to learn that they didn't make that size pizza after 3pm.  So no pizza.  Really really bad customer service addressing this situation."}
{"text":"I've been here for 45 minutes and no orders have been taken... bruh.. I'm pretty hungry. Nice ambience though"}
{"text":"Classic brick oven pizza. Crust is very thin so it is easy to crush an entire pie without feeling overly stuffed. Went with a friend and we ordered the Margarita and the Bianca pies. The red sauce on the margarita was a stand out (I ordered a side of sauce on the side for dipping) and the Bianca pizza was laced with a buttery, oily, garlicy flavor that played like a symphony on my palette. 

Craft beer list was solid, but not spectacular - they have a limited draft list, but a lot of cans/bottles. Also, the speakers in the place are terrific. Would be a great place to watch a game."}
{"text":"My boyfriend and I ordered pizza and salad from here through the UberEATS app. Which is great bc pizza delivery to the Ohio City area is totally lacking. This was our first time trying 216, and to be honest we are kinda pizza snobs so we definitely had high expectations. We were very excited about the \"make your own\" option, we chose a spicy sauce, traditional cheese blend with pepperoni and fresh basil (we figure if you can't make a good pep pizza, then your out) We LOVED the pizza, the sauce was excellent, just the right amount of spice, the pizza is wood fired so it has that smoky flavor, but it's not over powering at . The Caesar salad was good, a little bit too much Parmesan cheese for my taste. The croutons were some of the best I've ever had,silly but they can certainly make or break a Caesar. We will definitely be ordering from here again, hoping to stop into the actual restaurant soon as well!"}
{"text":"We had pizza here last night. The pizza is delicious. We ordered pepperoni, artichoke, and black olive pizza. We also shared a Caesar salad. The salad had a little too much dressing, but the croutons were amazing. The only thing that kept it from a 5 star rating was the beer menu. There was an electronic one and a paper one, but we were told by our server that neither was correct. We ended up picking beers and then he checked on his iPad if they had them. Overall, though, a positive experience."}
{"text":"Wish we lived closer to this place. The King pizza was so so good! The brick oven style crust was thin and perfectly cooked, giving it a nice crunch and flavor.  The place seemed low key, but a nice atmosphere. Great place for families to take kids in the area."}
{"text":"This is the second time visiting Pizza 216 ... It is hands down our favorite pizza spot in #TheLand!! Highly recommend!! We love the Margherita Pizza! Wings are great too!!"}
{"text":"I am loving this pizza! First time here, but definitely not my last. Made fresh and fast- I love the cheese.

The atmosphere seems pretty cool- I want to bring friends and hang out here. Hard wood, tvs, bar."}
{"text":"I enjoyed this place, until this guy comes and sits a few seats down from me and starts being obnoxious and banging on the bar as I am trying to eat my pizza. Very disruptive. He starts playing with the staff, yelling about how his Yelps will take this place down. Additionally, this guy was asking for the tv I am watching to be changed to a hockey game, with nobody consulting me as I am obviously already watching something. Well, come to find out \"Brian\" is apparently an employee here, and this place very quickly starts to lose its charm. Establishments would do well to have stricter protocols for employee conduct on and off the clock. I felt like I was the only one not in on the joke."}
{"text":"Quite a nice place...outstanding salads and the pizza is first rate, the nice thing being you choose your own adventure."}
{"text":"My God. This place is fucking awesome. Had a 'Za with spicy marinara, classic cheese and half pepperoni. Immediately tasted it and wished I lived in Cleveland. 

If my wife was here, she'd be all over the Italian nachos. Not my bag, but what a great twist. 

Stellar atmosphere, great new age decor and a brick pizza oven with a rotating base that I'd kill to own. 

Bar tender was awesome too. It's total home run."}
{"text":"As anticipated, I visited here a second time before a Cavs game. 

Much like our first visit, my husband and I were able to find seats easily at the bar. This is a HUGE perk at this place - easy seating - considering how crowded the E. 4th area gets on game nights. 

My husband and I split the Spicy Pie. MUCH better than our happy hour experience. MUCH better. The pizza was solid. Was it the best pizza I've had in my entire life? No. Was it the absolute worst? Not. Even. Close. I would totally order this pizza again.  

Our service was spot-on. Our orders were taken quickly, our drinks were never empty, and we have zero complaints. 

A new solid pre-game dining choice."}
{"text":"4/18/17 Ok back again and seriously annoyed. Got the salad again only this time the waiter completely forgot to bring it out to the table. Brought it wrong and never showed up with it again.  Got up and went to the bar to ask about the salad and he said it was being remade. When it showed up the salad clearly was 1/2 the size of the first one with bloody uncooked chicken. I promptly left and my waiter didn't even ask why. Unbelievable. 

 I went to pizza 216 for salad and garlic knots. Sat down ordered my salad with no bacon and no cheese and the waiter says sorry no alterations our chef is a Michelin star chef and wont make them. So I said really I was just here last week and they did it. He said well we're not this week and I was like really?? Your kidding right;  dead no customers and I cannot get this salad. He's like nope. So I left. Would have loved to give them no stars. 

So after stewing about this situation I reached out to Johnnie the owner and we cleared up my waiters ignorance. I agreed to stop in and enjoy my salad which I did tonight with fresh made garlic knots. 
Thanks Johnnie I appreciated the accommodation. 

Ok back again and seriously annoyed. Got the salad again only this time the waiter completely forgot to bring it out to the table. Brought it wrong and never showed up with it again."}
{"text":"We ordered delivery from Pizza 216. In under 30 minutes, we had  \"The King\" on the table, a brick oven pizza with local sausage, pepperoni, green pepper, mushroom, and onion. For me, wood fired pizza is often hit-or-miss, but this was a hit. I'm also not normally a crust eater, but the crust on this pizza was like eat-every-bite-good. It was seasoned magically and a perfect golden brown. The portion size was huge, and ironically, the pizza even tasted better the next day when re-heated (I've never had this happen to me in Cleveland). Yes, it's a little pricey, but I think you're paying for the quality. The veggies were fresh and the entire pizza was very satisfying. We barely put a dent in it and were full!

We also had the poutine. But as for that-- we probably wouldn't get it again. While it looked great (golden fries, short rib, cheese curds, fried egg), it sadly had no flavor. We ended up layering some sauces from the fridge on it to spice it up. Even if the short rib was just changed a little in how it was made, it could be bursting with flavor. I'll have high hopes they'll make some tweaks to it.

I'm excited to have finally tried Pizza 216, and I'll definitely be back for a visit to their location on Euclid Avenue!"}
{"text":"Stopped in after the Cleveland Summer Beerfest last night to soak up some of that beer.  We were seated immediately and had great service.  They have a good beer list which made me happy.  We each ordered a create your own pizza.  They came out fast and were quite tasty with a good crust.  The pizza needed a bit of salt, which was my only complaint.  It doesn't quite reach the heights of our favorite Ctown pizza place, Vero Bistro, but it's still quite good."}
{"text":"Really solid pizza.  I was afraid it was going to be like standard American pizza but I was pleasantly surprised by the crunchy crust and proper balance of sauce and toppings.  Great prices too!"}
{"text":"The wood-fire pizza is outstanding! The sauce and crust is second to none. Great atmosphere and the service was excellent. It is a must if you're in the mood for pizza :)"}
{"text":"I just want to let everybody know that the best burger that I had in my life came from pizza216 wow"}
{"text":"Staying at the Hyatt Regency at the arcade. We decided to order pizza from downstairs pizza place. I was impressed. Garlic knots had a good taste. Little thin but seasoned perfectly. Wings were crispy just the way I like them. Big and meaty. Only 2 flavors. We got the Buffalo sauce. Had a good hot kick to it. Now the pizza. Toppings were good. Crust was on point. Sauce was not overpowering. I will say that if ever looking for a place to eat while at the hotel. Give it a try."}
{"text":"Excellent pizza! We had the perogi pizza and it was amazing. The staff was helpful and they were attentive."}
{"text":"This was ordered for us at a recent shoot and oh man, it was so tasty! I have three words for you: Short Rib Poutine. You'll thank me and want to buy me gifts later. It's basically tasty fries covered in cheese and shredded beef. Holyjesus it is #$%^&! Our photographer is gluten free so she got this and shared with us and I sing her praises because it so flippin' good!
I had a few pieces of the basil pizza with cheese (which I looked up and is their Margherita Pizza, which I usually don't like) and it was AMAZING! We also got some Garlic Knots and Provolone Wedges. 
Just. Stop. Oh man, so much good food! Since it was carry out I have no opinion on the service but if it's half as good as the food, you are in for a treat!"}
{"text":"Incredible place.  Great food.  Great drinks.  Great service.    Thanks for the hospitality Johnny!!"}
{"text":"In from out of town. Great pizza!!!! Love the thin crust. Had the chicken Caesar also. Very good food."}
{"text":"Boasting homemade, hand-tossed dough, zippy sauces, and a wealth of delicate toppings--carmalized onions and artichokes anyone?--downtown CLE newcomer Pizza 216 aspires to be the city's signature artisanal pie joint. If it falls short of this goal, it is by only the slightest of margins. Decor-wise, Pizza 216 is dark as a storm cellar, the only real illumination to speak of spilling from the yawning ovens in front of which a pair of dough experts perpetually labor and toss. Service can be terse, but not wholly uninviting. The pizzas at hand are adorned by and large with commonplace ingredients (no goat cheese or pickled fixins' to be found here), though they are uniformly fresh. They are, however, impossibly thin, managing to fill up only an alarmingly slight quadrant of the oversized boxes. Despite their Lilliputian stature, these pies are flavorful. Garlicky, savory, sweet. The Pierogie Pie, with its swirls of sour cream and mashed potato peaks, is a hearty homestyle winner, more interesting than the Bianca: a lake of EVOO with flotillas of garlic floating about in it. Each of these babies will set hungry patrons back $18, an eyebrow raising sum, particularly with their minute composition. Still, Pizza 216 is worth a look for downtown diners, even though it is not the Neopolitan game changer locals might be craving."}
{"text":"We had garlic knots, half cheese and half pepperoni pizza. My husband liked the pizza. But I did not. My son hit the head on the nail when he said \"it just tastes like SALT!\" He took two bites and asked to leave. Same with me. That was after I slopped the grease off with three napkins. That was only his piece. The garlic knots were pretty good! Heavy on the garlic, but good! For the price I would have hoped for a better pizza... The flies flying over the pizza wasn't that appeasing either. We also were seated next to a pillar and away from everything. Almost felt like being shunned... Attention was minimal."}
{"text":"I've enjoyed both lunch and dinner here, and I'm definitely a fan. At lunch, the pizzas are a reasonable size for one person, and service is reliably fast after ordering at the counter. At dinner, pizzas are larger (a comfortable split between two people) and it changes to table service. I really like the thin crust on their pie, and they do some pre-built combinations if you don't feel like creating your own. There are plenty of options for vegetarians (the Garden of Eatin' is particularly tasty). The beer and wine list is well-chosen, with some good local and regional options for drafts. The menu could be more focused, but I'm splitting hairs. There's something good for everyone here."}
{"text":"Love this place. Food and service is great. Despite being always busy the service is second to none. Highly recommended. Had the wings and lots of drinks. Just love the place!!"}
{"text":"Went here on 2/4/17 for the first time and was absolutely blown away. Their wood fired pizza reminded me of my favorite pizza shop on the East coast. Their spinach salad is also amazing, one of the best salads I've had in a long time. Service was quick and the atmosphere felt classy and enjoyable. If you're looking for a great place to have a date night, Pizza 216 is the place!"}
{"text":"As a man in his 30s I have had pizza thousands and thousands of times. So when going to a new pizza place you don't expect that wow factor any longer. I cannot say that about pizza216 I was indeed wowed.

The Ambiance of the place is pretty inviting nice decorations decent seating. The service was pretty fast in the menu is an overwhelming. When ordering I order the pierogie pie. I added buffalo chicken which was a great choice. The pizza talked about 5 minutes altogether not very long at all which was a great thing for a lunch hour event. 

The Taste is amazing for at least a pizza I tried. It was not overly dressed, very subtle but the flavor was huge. The crust was the amazing part when you have such a thin crust us crisp but yet  delicate it is a dichotomy of tastiness.

I would recommend anybody looking for a tasty Pizza to hit up pizza 216 I will definitely be going there in the near future"}
{"text":"My beautiful wife and I had a veggie pizza.Wow that's not my cup of tea but it was delicious."}
{"text":"A fantastic spot in Cleveland I discovered quite recently, which is adjacent to the busiest nightlife in the city (East 4th). I'm quite a fan of this place. The owners Brad and Johnny are really friendly guys that are extremely passionate about pizza, which shows in their delicious NY style thin crust. I challenge people to name or find superior NY style pies anywhere in Cleveland. I've had the buffalo pie and well as the margarita. Both have high quality sauces, cheeses, and toppings. My favorite part is probably the crust- reminds me of what Papa Gino's may have tasted like when they were still just one restaurant.

The draught beer selection is displayed on trendy LCD screens, featuring a rotating selection of unique local microbrews. Pizza 216's interior is laden with black, silver, and gray colors that are in perfect harmony, adding to the already sweet, hip vibe. The tall mouth of the rotating brick oven is exposed to the first half of the restaurant and bar, which I thought was cool. As recent as this year, they added a much needed patio area where more deliciousness can be served."}
{"text":"Good tvs, good beer selection, cool atmosphere- and the pizza was phenomenal. My boyfriend and I are basic when it comes to pizza- we usually just get cheese. While the white pizza and spicy pie were tempting, we opted to go with our traditional cheese, and it was nothing less than amazing.

We also ordered the \"giant meatball\"- we were warned it would take about 25 minutes, which makes sense for a giant ball of meat. Unfortunately, when it got to the table, I cut it in half, and it was raw inside. Not undercooked- literally the center of the meatball was cold, pink, legitimately raw meat. We decided to just send it back instead of waiting for them to cook it through, since we inhaled the entire pizza before our server made it back over to us. They took it off the bill but never really apologized about it. Kinda weird but to be honest I'm not even mad about it because the pizza was just THAT good. Will definitely be back to try the specialty pizzas!"}
{"text":"Had lunch on a Sunday. Wasn't very busy we sat at the bar. Had good service. Had Buffalo wings to start were pretty good. Sauce had good flavor and we had a regular pepperoni pizza and it was delicious. Was our first time there an would definitely be back again."}
{"text":"Didn't think I'd find this good of thin crust wood fired pizza in Cleveland. Excellent"}
{"text":"Yum! Great pizza, awesome service! The atmosphere is perfect for a night out with friends or a casual date."}
{"text":"More sophisticated than most downtown restaurants; prices higher than typically found in  the area - I mean it's pizza and salad- so lunch crowd may not include regulars as Vincenzo has, just blocks away.
Pizza was very good- crust thin enough, interesting toppings, salads ample to share.
Ambience - well done with different seating options, lighting perfectly on the dimmer side.
Service - just ok - with only a handle of customers, we sat at the bar and 2 bartenders never refilled water glasses, or asked about a second glass of wine, but seemed busy talking to a couple who are parents of a colleague - 

One suggestion - music level should be adjusted for crowd level.   Meaning the music was way too loud for comfortable conversation.  And perhaps vary the music genre- one size does not fit all.
We will definitely return as its a great addition to the revolving look of downtown Cleveland."}
{"text":"Great crispy thin (but not too thin) crust pizza. The Brussel sprouts and Italian nachos as apps were great too."}
{"text":"Working out some kinks as a new business but excellent pizza! Can't beat a real wood stove."}
{"text":"Best pizza in the 216... Best pizza anywhere! I am from Pittsburgh, but visit Cleveland often. This was my first time visiting Pizza 216 and it certainly will not be my last. The restaurant itself is very large, open, and well lit. The staff was friendly and attentive. I also really enjoyed the open pizza kitchen concept and the ability to watch the pizzas being made. Now for the food- we had the provolone wedges and build your own pizza with red sauce, classic cheese blend and mushrooms. Although we were there during a Cavs game, the food came out very fast to my surprise. The wedges were incredible. Very crispy and flavorful and covered in the midst delicious red sauce I have ever had. As for the pizza, it is evident that the ingredients are as fresh as can be. The crust was crispy and thin and made an excellent base to the bold cheese blend and mouthwatering sauce. 
I cannot wait to come back to Cleveland just to eat here again!"}
{"text":"Amazing food even better staff. Went in for a meeting, the staff was extremely friendly (worked well with my allergies!) and brought up their crab cakes being the best in Cleveland. I was skeptical but the gentleman sold my colleague and I on them. 

We decided to try them, honestly they were the best crab cakes I had ever eaten. Better than Baltimore. We got to talking with the staff who were very receptive to our ideas on how to get the crab cakes more well known (Pint and Crab Cake for $10 during happy hour). Can't wait to bring back friends, colleagues, family, strangers, essentially anyone who will listen to come try this amazing food. Can't wait for the re-open!"}
{"text":"Truly the best pizza in Ohio. Service was spectacular. Wouldn't come to Cleveland without stopping here"}
{"text":"I wanted to be wowed by this pizza and this place, it was just \"ok\".  I walked to the restaurant since I was staying close by, but if you are driving check and see if the Indians are playing (or Cavaliers) because there is NO parking and lots of roadwork that make it difficult to park.  There are garages and lots that you will pay to park in.

When I got to the restaurant I waited for the hostess to finish her personal conversation.  After a few minutes, her coworker finally addressed me.  I'm big on customer service, not much here.

I ordered a house salad without onions and red wine vinaigrette (picture).  It was ok, a lot of hard white ribs so not really edible.  I didn't like that it came in a metal tray either. 

I ordered the margarita pizza in the personal size and instead was brought the regular size (14\" or 8 slices), disappointed because it's just me and no refrigerator for leftovers.  The pizza was very thin but not very hot, like room temp!  I was surprised since I assumed it was made to order.  There we no tomatoes on the pizza (?) just dollops of sauce.  It was ok, probably wouldn't order it again.   In a pinch, I'd come here again, if not, I'd keep walking.  Plenty of pizza in Cleveland!"}
{"text":"Pizza 216 is the pizza place we have all been waiting for downtown, so wait no more. Located to the right of the Chocolate Bar, it's easy access to all. With their simplistic, yet diverse menu, makes it easy for an person to find or create something tasty. And to top it off, their motto that lines the wall colorfully as you enter the restaurant says, \"Eat pizza everyday\". 

We created our own pizza with the spicy red sauce, shredded fresh mozzarella, and pepperoni cheese, which I highly recommend because it was unbelievable, truly. Kudos to the chef.

It was so fun to watch the chef make our food over the bar top where we were sitting. It came out crisp, fresh and mouth watering to say the least. As a true pizza lover, I can't wait to be back again because it just made it into my top 3 favorite places I have ever been too, not only in Cleveland, but everywhere. 

This pizza place is one to be reckoned with and I can't be happier that they have a home right by East 4. The owner is so kind and welcoming to all, you'll feel right at home here; promise."}
{"text":"What else can I say but AWESOME AWESOME so happy they are back and just how they remember. After a long repair my favorite pizza place is back. The best pizza in Cleveland and so delicious and fast. This is a must I n your foodie bucket list

So would like to update on my favorite pizza place. As always awesome food and great service. We're regulars so the pizza is one of our favorites however the Brussels sprouts and spinach salad are awesome. The owner always recognizes us and says hello and always checks on us. So here we get personal service and great food what else can you ask for?"}
{"text":"This pizza was fantastic. Cooked perfectly. I ordered the Bianca (all white) with mushrooms. It was hot with toppings that were perfectly proportioned. I highly recommend this place."}
{"text":"Located next to the Chocolate Bar and in the bustling nightlife area of East 4th street, you can't miss Pizza 216 if you are walking along Euclid Ave. 

I actually could not find the pizza spot because I was on the other side of the street and the sign isn't as big. Someone finally (after 2 mins) directed me to the right location. I certainly did not want to get lost because I was rushing to get to my friend's place to watch a tapped Bachelor season finale (like OMG, can you believe Arie for humiliating Becca like that?)

Okay, back to reality....lol. I ordered takeout here last night and picked it up on my way to visiting my friend who lives downtown. The pizza was ordered about 15 mins before I picked it up so it was definitely ready quickly. My friend ordered a large vegetarian pizza with 2 cokes. We didn't even check want toppings were on the pizza but it was so delicious (minus the onions). The crust is a normal type of crust but it was a bit on the skinner side. Overall, my tastebuds were so satisfied that I even forgot to take photos.

Inside the establishment is big and a perfect hang out spot for after work or whenever.

In the end, the pizza was great and the service equally good. A fantastic end to a Tuesday night."}
{"text":"My absolute favorite place to get not only pizza, but other delicious food from. The short rib poutine is so amazing, I can't even deal with it. The bartenders and servers are just a delight. 10/10 would recommend to anybody in the downtown area."}
{"text":"Oh how I wish this place were open just a little later on weeknights. I went after an Indians/Dodgers game. I called right after the game, about 15 minutes before closing time and hey put my order in. We walked over to get our pizza and the staff was nice. The pizza was good and the garlic knots were to die for. The next night the game ran a little late and unfortunately they were closed. I really wish the stayed open a little later."}
{"text":"Enjoyed a hot, tasty, crispy thin pizza and a Caesar salad. All good.  Very good service."}
{"text":"Had to order my drinks twice. Waited 45 minutes for a pizza.  Sausage was the 11 of quality that you get from a fiesta pizza chicken pizza.  Honestly if you're hungry call Domino's.  If you're hungry and downtown."}
{"text":"Not your typical pizza joint! Walking in for the first time I was pleasantly surprised by the crisp environment. Perfect mix between modern/rustic look and great place to meet the bros for a drink. Brink oven pizza that have bits of complexity. Can't complain, everything I wanted and more. Got the Bianca pizza with sausage"}
{"text":"Pizza is so delicious. The crust that sets up the whole pizza is so light and thin. It's perfect! Then you get to the sauce and you can tell they take their time and make it in house, it's so good. Their pizza isn't cheap but it's \"downtown\" pricing and it's worth every penny. I ate there last night and wish I could go eat it again for breakfast. Love this place and if I'm ever in town again I will definitely be back and ordering MORE pizza!"}
{"text":"We stopped in here as I had heard wonderful things about it. I was pretty underwhelmed. Service was great and quick but our pizza didn't taste any different than any other pizza in the city. We ordered the margherita pizza and while it was good, there was nothing wrong with it, I expected more flavor or something to set it apart. It was pretty pricey at $17 for an average pizza. I would rather go elsewhere and have a much more intriguing meal."}
{"text":"I'm a very patient person almost all the time...at least, I try to be. But the first time I stopped in to this place for lunch, I was so annoyed by the awful, rude, slow, inefficient bordering on non-existent service that I was thisclose to just leaving without my order. 

That would have been a huge mistake.

Seriously the best pizza ever. Ever. Omg.

Also, I've been back a couple times since and they've done a 180 on the efficiency at lunch and it's been awesome!!"}
{"text":"Easily my favorite pizza in Cleveland! Our #1 go to before Tribe games and concerts!! Cheap pitchers of beer too!"}
{"text":"Save your time and money, way better pizzas out there in CLE. Very unprofessional establishment, I would never even consider taking a family or group of friends here"}
{"text":"GREAT pizza!!!  Fresh and cooked in a wood oven.  The only reason I give it a 4 is because the music is loud and obnoxious.  If that were to change, it would be a 5, as far as the pizza is concerned.  Staff is friendly and attentive.  You cannot go wrong if you are looking for a pizza to go, that's for sure."}
{"text":"Went on a Tuesday afternoon when many of the area restaurants are closed between lunch and dinner. They have maybe 10-12 beers on tap, with a good variety of local beers. They have an extensive nondraft beer list, would've liked to see a couple soft options like cider or framboise or something. 

As my Yelp reviews suggest, I'm always going to judge pizza places like this one on their white pizza. This one had fresh mozz and ricotta in addition to traditional pizza cheese blend. The olive oil and garlic was spot on. 

My friend had pierogie pizza - not my bag, but an interesting local spin and she enjoyed it. 

Fast service, bartender was adorable and polite."}
{"text":"Sorry that I have to do this, but UberEats is blaming you guys for my order arriving 44 minutes late with all the food stone cold. I ordered a pizza, garlic knots, wings, and 2 cokes. The cokes were the same temperature as the food. When the driver arrived he said he had a \"hard time\" - no clue what that even means. At 9:14 the order was confirmed and being prepared with an eta of 10:04, then it updated to 9:54p. Great!

How does a 9:54p eta w/ a 9 minute drive to Tremont turn into a 10:38pm \"slight delay\" (see attached photo). 44 minutes late on a 40 min eta is not slight, that's a pretty significant delay. 

The food looked good, but sure didn't taste good cold. Maybe rethink your partnership with UberEats, they're making you look bad. 

- Jon"}
{"text":"Stopped by on a business trip to get some quick dinner. Wasn't expecting much from a trendy looking pizza/sports bar, place looks nice and clean, with cool modern/industrial decor. Good start. Great Lakes special (Best the CLE has to offer) fantastic as expected. I asked for the pasta special...chicken Marsala. Wow. Did NOT expect that. Seriously great stuff. Pasta (pappardelle?) was al dente...heck the mushrooms were al dente!! At a sports bar/pizza cafe! Honestly the pizza looked fantastic too but I couldn't eat a whole 8 cut pie myself. Go here."}
{"text":"Downtown Cleveland finally has an amazing pizza place.  Pizza 216 is located at the end of east 4th street and is a great location to grab a pizza after a ball game.  Pizzas are made in a 700 degree rotating wood oven.  Pizzas are made with great fresh ingredients.  I recommend the margarita pizza with nice big leaves of fresh basil.  Stop by for a pizza or just stop in to grab a drink at their amazing bar."}
{"text":"Great place for pizza downtown!  I came in for dinner with fellow Yelpers, Darren R and Dan S.

Pizza 216 is located right on Euclid in the Old Arcade. Johnny, one of the owners, stopped by our table and thanked us for coming in...very cool and laid back guy.
Darren, our server was awesome and made some great beer and pizza recommendations. We had 3 rounds of appetizers: 

1.) Mushroom risotto - very creamy and the asborio rice was cooked perfectly al dente!

2.) Braised pork belly over cheesy grits - my favorite app of the night! Great flavor from the pork and the grits were a nice accompaniment.

3.) Teriyaki wings - the wings were tender and not overcooked, the sauce had pretty good flavor, but was a bit runny and the greens and jalapeños put on top made for an odd presentation.

Our pizzas came next and the crust was very thin and light...definitely not heavy like some of the more doughy pizzas can be.  I had the margarita pie and it had good flavor with a nice balance of toppings. Darren had the Bianca pie with buffalo chicken added and it was good, but just tasted like a normal buffalo chicken pizza IMO.  Dan had the Pierogie pie with bacon added and it was my favorite of the three. It tasted just like a pierogie! The mashed potatoes and sour cream swirl made it stand out. Overall, the pizzas were very good, but didn't wow me.

Thanks to Johnny and Darren for a great dinner downtown with the guys.  You've definitely got something good going here, and I wish you the best! When I'm downtown, I'll definitely be sure to stop on in again! Cheers!"}
{"text":"Feeling pretty mediocre about this one. I came in for lunch and the hostess was very friendly, she let me know that they just do a limited menu for lunch. I'm glad they had someone up front explaining that and also my assumption was that by offering a limited menu that they would be able to focus on getting orders out faster and more efficiently. 

I ended up ordering Margarita pizza and side salad with the gentleman taking orders at the front. He wrote down my order and my first name, after which I proceeded to the register. The guy at the register also asked my order and name. I then waited at the counter for my food but when they called my name it was clearly the wrong order. The girl next to me explained that was her order and that it was to-go. They then asked my order again (if you're keeping track, I've repeated my order 3 times by now). A few short minutes later, they gave me the correct pizza but no side salad. I explained that I had ordered and paid for a side salad. They asked me yet again what I ordered and what dressing. After giving me my salad, I went to find a table but there was no silverware, so I went back up again to get some. This all happened in only a few minutes and I love that the pizza is ready so fast, but I just found it odd that they had such a hard time keeping orders straight when it wasn't really even busy.

After all that, I have to say the pizza was good but nothing special. There are so many of these wood fire pizza places popping up and honestly I found this place comparable to Pizza Fire. Maybe because they are newer, they just need to work out a few kinks, but I find it funny that they had such a hard time getting orders out efficiently during what was essentially a really slow lunch. For a downtown restaurant, they probably get slammed during dinner. I don't feel the urge to return and although I wouldn't discourage people from coming here, I just didn't feel it's worth the hype."}
