{"text":"I've eaten there many times in addition to 2 days ago.  Entered about midway thru lunch hour.  It was busy but not near capacity.  Nobody manning cash register.  Had to wait several minutes for somebody.  Salad bar was a mess and greens needed immediate stocking.  Fresh pizza prep was not keeping up with demand.  At least 7-10 patrons  milling around either waiting for pasta or pizza.  Some gave up on trying to get a salad.  I was one of the last to leave after the lunch rush.  Table after table of dishes needing to be bussed.  Where is all the help?  Was anybody there in charge?   What was there seemed  disinterested.  Salad bar was completely restocked when I left but by then the dining room was about empty.  It wasn't the best experience."}
{"text":"Decided to try this place since I received a coupon in the mail.  It's similar to other pizza buffets except that it has a huge selection.  They have over 20 pizzas to pick from and another 8 or more dessert pizzas.  They also have a salad bar and a pasta bar.  I personally stuck to the pizza.  Easily my favorite is the firefighter.  It's quite spicy and has great flavor.  Most of the other selections were also quite tasty.  And who doesn't love a great dessert pizza.  Now, here's the bad.  The crust is incredibly tough.  My jaw was sore after leaving this place.  Still, I would probably go back for the interesting flavors, especially the firefighter pizza."}
{"text":"Depends what your going for. We usually go for the salad bar! The have good salad! It's great for families, some nights they have a theme or have a Disney character hang around to entertain everyone. 

Pizza ok
Salad great 
Pasta great
Price great 
Service great 
  

In other words if you want excellent pizza you might want to try Lou malnatis and pay $20 for a tiny pizza. I mean come your paying $5-6 per all you can eat. If you want fancy, go get fancy! :)"}
{"text":"Great place for hungry kids.  Good food. This is not oreganos, so don't go in expecting that. Way better than peter piper though.  Salad bar and pasta bar was great.  Would have given 4 stars if I could grab a beer too. Yes, we will be back."}
{"text":"Went in at 2:00. Pizza and deserts were old probably from lunch. Salad was low on some items. Cheese sticks and garlic knots were hard. The worst thing Sara would go up to the cash register with her gloves on and handle the money and tap her hands over the counter top and cash register. Then she went back to the kitchen and cut pizza and messed with dough to make half pizzas with the same gloves that she just touched money with. (I guess since that time of the day they only make half pizzas  which 3 were only made). I told the manager he said he has cameras that she does not need to take off her gloves and that she washes her hands at the sink. We looked at the cameras and he saw she did not remove her gloves nor wash her hands. He then told her to be sure to wash your hands. He wanted to give us free buffet coupons. I said no thanks we will not be coming back."}
{"text":"Hands-down my favorite all-you-can-eat pizza place.  Not only is the pizza delicious but they have a great salad bar and even a pasta bar!  
The salad bar is clean, well stocked, and has a great selection of toppings and dressings (my wife was a big fan).  The pasta bar (which I think is a great addition to the standard pizza and salad restaurant) is delicious and has a nice selection of different fresh pastas and sauces (pro tip: get some of the marinara to go with your cheese bread, it's awesome). 
Now to the pizza.  Normally I stay away from all-you-can-eat pizza places because they trade quality for quantity.  This place has both.  The quality of the pizza here is comparable with any take out or sit-down pizza place in the east valley that I have tried. Not only is the pizza high quality but there is a huge selection of creative combinations.  They even have dessert pizzas and new flavors every month!  At PPC they go way beyond the standard flavors. My favorites were the pesto chicken and the chicken bacon ranch while my wife loved the Hillbilly and the BBQ chicken.  I also love the fact that you can get cheese sticks in the pizza buffet as well.  
In addition to the food we found the customer service to be friendly and attentive and the atmosphere to be comfortable and inviting.  They have everything from big tables to intimate booths.  
I have already recommended this place to multiple of my friends and will be returning soon!"}
{"text":"So I advise everyone not to ever go to Pizza Pie Cafe over on Val vista and Elliot!!!
Yesterday my friend, Drake, and I went there. We were having a good time enjoying their food and all. I got drake I big bowl of spaghetti (he love spaghetti he can eat it all day if I let him) well he was enjoying the spaghetti. I went and picked up a noodle and under that noodle was a freaking BOLT!!! A bolt that hold screws into place!! It was in my sons food! He could swallowed that and choked!! He's just a year old!!All they did was apologize brought me more spaghetti (which we didn't eat) and give me a freaking free coupon nothing else (like I'd ever come back to this place!)
I was SO pissed off! And I'm still heated about it! So needless to say don't ever go there they are careless about there equipment and rude and could care less!!"}
{"text":"Ambiance nice. Customer service good. Buffet fair: pizza crust was hard on all their combinations price does reflect quality food. Suggestions: improve crust and have ice tea available."}
{"text":"My kiddos (7 and 1) absolutely love this place! The price is great for an all you can eat buffet and our whole family loves trying all of the different kinds of pizzas and pastas. We love the salad bar included and the dessert pizzas too! The layout is super fun with different sports themes in some of the booths. We have been here once a week since we discovered PPC and we'll continue eating here. Definitely check this place out with your family!"}
{"text":"I'd actually give it a 3.5. It wasn't a bad place to go and eat. The price was inexpensive. My favorite part was the salad bar!! That was the best out of everything! They had fresh veggies and green salad! Along with lots of topping options. So besides that the pizza was fine. Nothing special. Pasta was good. Only tried one sauce, and again nothing special. The only thing that wasn't so great was that it took awhile before the busser would clean up tables. So it was prettyy busy on a Saturday night an not enough tables were being cleaned. Not only that but they had plenty of workers in the back, young kids. But that means there should always be fresh pizza and it should be constantly put out of it runs out right away. Also I didn't like seeing workers standing around the front talking to the cashier girls when there is always work to be done. Like cleaning tables and refilling the pizza. Too many workers not enough work being done. But anyways it was yummy to say the least, I left full and pleased with my husband. It's close by and one of a kind restruant in the Gilbert area. I would suggest it to my friends and family."}
{"text":"First impression was great upon walking in. The front desk gal was pleasant. But that's where it ended. The salad bar was underwhelming (like the whole experience). All the ingredients were nearly gone. The dressings were on the last drops. The pizza is subpar. I think it's the crust. It is not good. I tried multiple flavors and rhey all had a strange flavor. The only answer is the crust. Also, the plates for the pizza are big enough for one slice. What the heck?!?! Probably won't return."}
{"text":"The only reason why I gave this place 2 stars is because the food was good and it was a nice place. 
However the customer service is AWFUL. When we walked in, no one was there to greet us, waited at least a minute for a kitchen person to ring us up. He didn't take off his kitchen gloves while working the resister, and he didn't not change his gloves when he went back to working in the kitchen. 
While ringing us up, we asked a couple questions, in which he didn't know any answers. 
While eating, we noticed other customers enter and we overheard the same worker complaining about having to ring up more guests and that he didn't want to. 
Another customer complained to some chick who was stirring sauces that whoever cuts the pizza clearly doesn't know how to do it because it sucked. You can barely tear off a piece without touching all the other pieces. 
More customers walked in and had to wait over 2 minutes before someone took their order (I timed it). 
I do not recommend this place to anyone because customer service was absolutely awful. Just a bunch of teenagers who didn't want to be there or slightly care about cleanliness and customer service."}
{"text":"I don't know where to start. Most of the reviews are correct. The pizza is no good and looks like it's been sitting out for hours. I tried about 4 different slices but none of them got more than 2 bites taken out because they were so bad. The only slice I actually finished was the Oreo dessert pizza. The pasta is precooked and they only throw it in boiling water for about 10 seconds to reheat it so the consistency is very mushy and over cooked. The only thing I semi enjoyed was the salad bar. It's true, the lettuce isn't the freshest, it was a bit wilted but I still liked it over the pizza and pasta. One soda machine was \"out of order\" and the other two were out of most of the sodas with the exception of about 4. The service was friendly. The girl in the front counter explained the buffet to us and said she gave us a discount for signing up for the rewards program but once we sat at our table there was a advertisement, which said it was \"happy hour\" and the buffet was already discounted. All in all, we probably won't be back."}
{"text":"Better than most pizza buffets you will find in the east valley. I loved the salad bar since it had a lot of choices, the pizza on the other hand was mediocre. The pizza guys didn't change the pizza out unless it got busy so we had to wait  for a fresh one to come out a few times. Besides that tables were all super dirty and it was super slow. We had to take a napkin to scrape the excess food left from the prior people. Overall a nice family environment pizza place.  My son would go nuts seeing so many pizza choices!"}
{"text":"Staff was awesome! It was my 3rd time going to this establishment and everytime it has been great. Tonight was May the force be with you theme (StarWars) haha.  I definitely do not understand others comments of this place. Nothing in life is perfect! Pizza Pie Cafe is awesome!"}
{"text":"So glad this place opened. ii've been to locations in utah and idaho. Great Value. the pizza is delicious and wide variety of pizza. Love the pasta. There is a spicy pasta sauce that is to die for.  They make the pasta to order so its hot and fresh. Salad bar has enough toppings for price. Great place to bring kids and family. My Kids beg me to go back now.. great value."}
{"text":"For the price this wasn't a bad place. We were looking for somewhere fast considering we have younger children so buffet works out great. Both kids enjoyed the pizza and pasta bar. The staff was friendly and the place was clean. The pizza was good."}
{"text":"This was a family outing. It was a great experience. Both husband & son said the pizza selection was big enough & the pasta/sauces were great. My personal favorite ~ the salad bar was well rounded & allowed for a variety of ingredient choices & dressings. The staff was friendly and seemed to have a positive energy among themselves. The restaurant was clean & conversation didn't seem to echo or travel across tables/sections. We will be adding this to our family list of places to get a bite."}
{"text":"I like the food, except the pizza is a bit tough to chew .  Nice service and music.  Clean and nice place."}
{"text":"This place is good for the price! If you sign up for specials, you can get the buffet for $4.99-$5.95 instead of $8.00+. Decent selection of pizza and pasta :)

There are a lot of younger people working there however they have never been rude and have always been helpful!"}
{"text":"Great pizza, great price, pasta and salad bar need work."}
{"text":"What a fun place to visit. It is a buffet of pizza where you can get as much as you want. The variety of pizzas is terrific. I love the oreo dessert pizza. A great place for the family to visit. Fair prices too. I'm allergic to dairy so they made me my own pizza there. excellent staff."}
{"text":"Horrible because the pizza was old and hard to chew! The pizza dessert, gross! Never again and the staff was not customer serviced oriented. They didn't come and ask how everything was and didn't even acknowledge you when we entered! Gross, I don't recommend this place to anyone!"}
{"text":"We love the variety and with three growing boys you can't beat the price.  The one gets a bowl of pasta and dessert pizza.  The other gets pizza and a salad.  The last one gets different things on different days.  With 4-5 sauces and 4-5 different pasta shapes a large well stocked salad bar and a variety of pizza and dessert pizza. You don't have to eat the same thing twice."}
{"text":"Tried this place tonight and was pleasantly surprised. First of all it's super clean and decorated really cutely! The food was good! So many pizza choices, loved the salad bar and pasta bar. The cinnamon sticks were probably my favorite! Rest of the fam loved the cookie dough dessert pizza!!"}
{"text":"Pizza is pretty good. Hasn't been super fresh each of our visits.  Salad bar kind of sucks through.  Not a bad place for a quick meal."}
{"text":"I'm on a diet. I'm trying to lose a hundred pounds. I get one cheat meal a week. This week we chose to try Pizza Pie Cafe. I love pizza, pasta and salad so it sounded like a perfect fit. Kudos for the drinks. The cups they gave us were HUGE. The restaurant was very clean and well decorated. It was busy but not bad and the staff was all very attentive and friendly. Unfortunately the food was just disappointing. The Alfredo sauce was too dark and void of real flavor. The noodles were way underdone and chewy. The pizzas were disappointing. Not a big fan of the crust or of the types of pizzas that they had available. Now they did have a TON of dessert pizzas. EXCELLENT I thought. I tried the raspberry, peach and apple. All were disappointing. I have to say, the salad was pretty good but that was my favorite thing. :/

If you're looking for a pizza buffet there are plenty of other ones that are a LOT better. Even Peter Piper's buffet is better. Disappointed."}
{"text":"We love this place, they do customer request pizzas. Tanner is one awesome manager at this place.  

My daughter loves the cinnamon sticks dessert pizza

Love that they have mug root beer.


Emma treated my daughter great."}
{"text":"I'd say that this place is about a 3.8 so I'll give it about 4 stars.  The salad bar has some really excellent options and it is the first thing all 5 of us load up on.  The garlic knots are great when you get them fresh.  But just 4 stars because once in a while the lettuce & knots don't seem 5 star..... SO that said, Good options/variety on pizza and dessert.  BUT sometimes the main advertised dessert is empty (happened to us twice for July blueberry cookie), and my tip to owners is to add an ice cream machine to top or side to dessert"}
{"text":"The idea is great and the salads are really good, but every time I crave this and we go, I realize it's just not very good. The pizza is mediocre at best and the pasta is pretty gross."}
{"text":"Disappointed. Showed up on a Friday night at 7:30 pm. The place was not overly busy, but seemed understaffed. Tables left dirty for too long, the salad bar woefully underfilled, pizza cold, pasta bar out of marinara sauces (marinara!) and service lacking. For $8 bucks I guess I shouldn't have expected better."}
{"text":"I love this place!! It's great to find a pizza buffet that does not cater exclusively to children! It's a fun environment that is great for everyone. The pizza is good and they have several fun flavors. My favorite is the Oreo dessert pizza. 

They also have a pasta buffet that is pretty good! You choose what type of pasta and sauce separately. 

If you go later at night, you can get a really good deal!"}
{"text":"First time hearing about this establishment and the pizza was great they also have salad bar and pasta oh yes almost forgot to mention it is all you can eat prices at $5.99 can't go wrong the establishment is very clean atmosphere and workers are very friendly and professional at there job I would highly recommend family and friends even kids birthday party's the pizza and pasta are 100% gluten free"}
{"text":"First time here. Told the lady first time and she just stared at me. I asked so what's the process and then she explained. Tried the pizza and they all looked dried out. Salad is not very promising either. They have a pasta station that no one manned. And we had to ask someone to help as employees passed us and didn't help. I asked for a refund and they said they can give me a free buffet card. I'm not coming back but hey here you can come back. Ugh. Would not and will not return."}
{"text":"Heard a lot about this place so decided to give it a try. Can Friday night around 7:15 and the pizza looked like it had been sitting under the heat lamp since it opened. Not fresh at all. Salad bar was ok, needs more selections. Dessert bar was the same as the pizzas. Will give them another try and come right at opening when I know everything will be fresh."}
{"text":"This is one of those places I really wanted to like unfortunately the only thing good there is the staff.  pizza slices are super tiny and very tough to cut through when trying to serve yourself quickly. Pasta bar was decent but the meal wasnt worth the $9.70. Im  disappointed because I really want to like this place"}
{"text":"Tried it for the first time today. Not bad! Will revisit again once we give them a chance to get things running right. What I noticed was that the salad bar was pretty good with plenty of fresh add-ons.  a few of the dressings did not have names on them so it was a bit difficult to distinguish ranch,blue cheese or lo-cal ranch apart or even know if these are what they were. I tried the ranch and it was not very creamy and flavorless. I poured it over my salad and within a couple of minutes it looked like I never put any dressing on my salad- very thin or watered down. The pizza had a good flavor and better than other buffets but the crust was a bit hard. Oh, the salad bar also had a couple of pasta salads both very dry and unflavorful.  I tried one of the hot pastas. The portions they give you are fair and I only tried one sauce and it was okay(carbonara )
cons- All the tables around me which were about 5 tables were not bused in a timely manner and plates were piled 2 and three high.. I will give it another try in a couple of months and reevaluate then for a possible better rating.  I don't think it will get a 5 but could easily be a 3.5 or maybe 4 max."}
{"text":"The food is good, there is a lot to choose from, and it's affordable. The staff is friendly, the music is good and the atmosphere is cute. My only complaint would be that sometimes it looks a little messy, like maybe they could take a little more time to clean the salad bar etc. but overall it is pretty clean for a buffet."}
{"text":"Staff was great. Desert was good. Salad bar was good. Decor was nice. Pizza is NASTY! Thought we'd give this place a try. It has to have good pizza....My god it has \"pizza\" in the business name right!? Yeah, no. It's like a Chinese buffet that serves pizza. It's just that bad! 

Sorry guys. One huge star for the staff but thats it. When you fail at the core product nothing more should be given.. 

It was lunch time too and it was dead. 

Sounds like a change of pizza recipe is needed but unfortunately it won't matter unless the original  franchisee listens. I dont understand how this business is expanding. Another franchise hoping to make it but not this location. Give it 12 months....closes....and it will magically turn into a Chinese buffet!"}
{"text":"Went for lunch today and was impressed. Simple salad bar but fresh and tasty. Large variety of pizza including some unusual flavors. Really enjoyed the potato pizza and the hillbilly (meatlovers). Staff was friendly.  Will definitely return."}
{"text":"Unlimited pizza for an ok price. Honestly like there pasta better than the pizza but over all ok.  Might be worth a check out if your hungry."}
{"text":"Fun place for larger groups of people of 10 to hangout and eat. Not the best pizza by any means but there is a variety."}
{"text":"I love that you can have the pizza and salad, but I really love that you can make your own pasta as well. 
They have fun dessert pizzas and great food. 
Without all the insane noise of the wildly out of control competitors. This is a family,  sit down, enjoy your meal restaurant for everyone. 
And it's quiet. 
And if you need they have tv's as well."}
{"text":"1st visit for my family and I tonight. Pizza was like any other, but I did very much enjoy the oreo pizza. Of course, my kids enjoyed themselves tremendously. 

My main ratings are in regards to the young kids that were working this evening. The young man and young woman who worked the front of the restaurant welcoming patrons, bussing tables, and keeping the floors/counters clean...did a fantastic job of continuously working and being so polite. I'm not sure if they were high school students, but if they were, you definitely don't see alot of good work ethics anymore from students, like we saw of these 2. 

Kudos to them. Hope their manager sees this comment. Wish I knew their names. My husband was so impressed, he had to tip them although it's not typical with buffets."}
{"text":"I'd been to a Pizza Pie Cafe location in Provo UT multiple times and loved it, so when I found out that this Gilbert location opened so close to my parents house, I had to drag them along to try it out.

As usual, the pizza was all fresh and delicious. There were many different kinds to choose from and the dessert pizzas were on point. I LOVE the cinnamon sticks the most. The problem with an all you can eat pizza buffet is it's impossible to stop eating your favorite things once you start. 

Definitely come here. The price is unbeatable for what you get. $8 for hot fresh unlimited pizza pasta and salad. The only downside is that they're a Pepsi establishment"}
{"text":"Pizza Pie Café has opened its second Valley location in Mesa, making it Arizona's second installment of outside of Utah or Idaho.  Pizza Pie Café is less Café and more Buffet offering two dozen types pizza, including sweet dessert pizza, a salad bar and a made-to-order pasta bar.

At the smallish salad bar you will find a choice of three types of fresh lettuces along with toppings such as fresh and pickled veggies, beans, diced meats and eggs along with a larger selection of dressings and crunchy toppings to make a salad just the way you like it.  The pasta bar offers various types, flavors and shapes of pasta which you can top with five different types of sauce ranging from your basic Marana sauce, to a thick, spicy sausage sauce, an Alfredo sauce, a spicy red pepper sauce or meat sauce.  I suggest a half size order of pasta and experiment with sauce and toppings.  The pizza bar is a two tier affair with mostly thin to medium thin savory slices arranged in such a way that you must choose the three or four slices in front; there is no cherry picking your slice here, or choosing that slice way in the back.

For an additional fee, you can get a beverage that offers unlimited refills of Pepsi products at the two self-serve drink towers.  There are dessert pizza options too, however, they are typically on the super sweet side despite most being on an unsweetened thin pizza crust.  If you choose the \"Pizza of the Month\" then get ready for your jaw to cramp as this is often a combination of fruited 'pie filling' and candy or marshmallow drizzled with a sugary frosting or chocolate, or both, layered on the top of a thicker cookie dough-like crust.  The good thing is they slice the pieces into thin, narrow slices . . . and for most people, this will be plenty. 

This location certainly is set up for better access to the pizza pasta and salad bars and seems to have a larger selection of pizzas. However, notably in comparison to the Gilbert location, the staff here is not quite as attentive or cheery as the Gilbert location. For instance, pizzas are slow to be refilled, the salad bar tends to be less kept and refilled as often, and finding someone to make your pasta does take a bit of eye contact and patience.  However, with time, things may improve.

Overall, you really can't go wrong given the price, selection and atmosphere of Pizza Pie Café.  If you join their loyalty program, they will send you reminders of midday and mid week specials that make it a bargain to eat here. You can fill your plate, drink all the soda you want and stuff yourself for under 10 bucks!  However, if you can have some restraint, and eat more salad than pizza, you will feel less guilty for eating multiple slices of pizza and still get in your serving of vegetables.

Overall rating: 3.6
Quality: 3.6
Service: 2.8
Cleanliness: 3.2
Value: 4.2
Atmosphere: 3.6"}
{"text":"The service here is pretty decent. They make a real attempt at giving you good service  It is apparent that one or two people, possibly a supervisor, try to get around and clear tables and make you feel welcome. At first our plates were being cleared pretty well. By the time we were done, our table was full of dirty plates. The pizza is OK. It's not super but it's not bad. I really like their pasta section. Their salad bar is good too, but it was lacking due to not keeping up on refilling a couple things..my children always requested the Pizza Pie Cafe in Utah. I feel that that location was a little better. I expect my kids to want too return to this location again. I'll come back upon their request, but it won't be my request."}
{"text":"My son and I ate there yesterday.  I paid nearly $20 for the pizza buffet and 2 drinks...to find a dirty table (place was not busy) and to eat cold pizza and get a stomach ache.  It was gross!!  I gave up by the 2nd piece and tried some pasta...which in all fairness was mass produced but better than the pizza, meaning it was at least warm.  I did mention to the employee that the pizza was cold on the buffet and he didn't seem concerned.  Both my son and I ended up with stomach aches after eating there.
 Anyone can buy frozen pizza dough, slap ingredients on it and open a buffet...there is nothing out of the ordinary here.    Lesson learned....I wouldn't go there again."}
{"text":"Great pizza, salads and dessert! It's not gourmet, but for a buffet it's really good. Very nice staff as well, and it's clean!"}
{"text":"For the price and compared to other All-You-Can-Eat places, I was not impressed. When my family came in we went directly to the salad and pizza buffet. The pizza buffet was sparse with most pizza trays empty, or with a couple of pieces that had been there at least two hours. I work at a place that makes pizza and this stuff was definitely past its holding time. The pizza makers just look at you as if to say...eat what is left otherwise we wont make new pizza. The pizza was hard and the cheese was hard from sitting too long.The salad bar was out of most items and the lettuce looked as though it was left in the walk in fridge overnight without being covered. It was limp and soggy. After this we went on to the pasta buffet for some pasta. It was gross. My kids and wife refused to eat it. My son went to the restroom and came back to report to me that the place is old and dirty and the urinal doesn't flush. He is 7 years old and was grossed out.

The only thing that was good was the Raspberry dessert pizza.   I know that food borne illness takes 12+ hours to set in but I feel miserable two hours after eating there. I have eaten there once before and was not impressed, however I thought I would give it one more try. It got worse."}
{"text":"This place was sooo gross. I've have not the best pizza, and I can't even explain how disgusting the food was. Pizza cold, lettuce brown, and pasta tastes like freezer pasta. I would not recommend this in a million years!"}
{"text":"Thought we would try this place again because we had a coupon.  Wish we hadn't. Once again we were terribly disappointed. The pizza was cold and had a really odd flavor. Several of the pizzas had little to no flavor.  Waited 5 minutes at the pasta bar before the young man making pizzas in the back stepped forward to dish out my pasta.  The salad in the salad bar was wilted and brown. The jalapeño ranch dressing, which I usually love, was the worst ever.  And to top it off, they served Pepsi products, not Coke. We tried to give them another chance but once again, a waste of money."}
{"text":"Pretty hit or miss with the food either it's delicious or it tastes like cardboard, but when it's good I'd reccomend it, not too expensive and it's a convenient location to drive to"}
{"text":"We showed up about 4:30 on a Saturday afternoon, with a couple of missionaries that we were treating to dinner. There were very few people (which is why we like to go to dinner really early or incredibly late).  

The adult buffet is $8.25, much less for kids,  and even the drinks are quite cheap.  For four adults and an 11 yr old it was under $45 -which, by the way, is cheaper than Burger King. They have plenty of seating, from tables and booths for four, some cute little semi-enclosed-seeming booths which would be fun on a double date, high tops, and then big round tables for 6-8 people, and even a giant long banquet-style setup for really big groups. 

I really enjoyed the salad bar; there was Romaine, spring mix, spinach, and iceberg to choose from for lettuces.  There are many protein and vegetable topping  options, along with things many salad bars scrimp on, like cheddar, bacon, hard boiled eggs, cottage cheese and all the crunchy croutons, crackers, etc you might want. The Romaine wasn't the best looking. But the other three were very crisp and cold. The best part, for me, were the dressings.  The ranch is fantastic (tastes like when you make Hidden Valley Ranch with Best Foods may? -you know the ranch mix in the packet you make at home? It's a major old-timey comfort food trigger for me)  and my husband the bleu cheese dressing snob ...really likes the bleu cheese dressing.  

Pizza was plentiful and of great variety. It's neither super thin nor thick crust, and I like the flavor and chewiness of it.  There are crazy kinds of pizza and all the standards you'd expect: pepperoni, \"hillbilly\" (all the meats), BBQ chicken, chicken Alfredo, something like Spud-o-Rama or something like that.  More than you can possibly sample and still walk afterwards. They even do a \"customer request\" so if there's something you can think of that they don't have, I expect you could ask for it. 

I loved the DIY pasta bar; 6-7 kinds of pasta (which is al dente and they do a quick dip and strain so it's fresh) and at least that many kinds of sauce, and four bins of cheeses to top them with. Yummm.  

There are garlic knots and cheese bread and such. 

Then... the dessert pizzas -oh. my. goodness.  I wish I could have had more.  I tried the smallest available pieces of Raspberry, cookie dough, & cinnamon sugar, but they also had apple, peach, I don't know what-all.  Sooooooo delicious. Soooooo sooooo delicious. 

They have the \"good\" ice and you do your own free drink Refills. A very cheerful staff was extremely eager to please and swept away plates and offered to help continually, then asked sincerely on our way out, how had we liked it? 

It was a great, super casual, family-friendly, incredibly inexpensive place to enjoy dinner and friends.  I recommend it for just such an occasion."}
{"text":"Took my kids here for dinner and it's not bad.  I mean it's not gourmet or anything but it's definitely better than Little Ceasars or the buffet at Peter Piper Pizza.  The restaurant is clean and the staff here is friendly.  Many varieties of Pizza... salad & pasta choices.  I mean, it is an Atkins dieters nightmare but I liked it & I would definitely go back!"}
{"text":"For a all you can eat pizza buffet this place is very very good. The establishment is always clean and the staff here is very nice. When you think all you can eat pizza you probably imagine a run down restaurant but this is very much the opposite. Smiling service is always a plus. Great place to host after sports parties and the prices are very reasonable."}
{"text":"Very good for buffet pizza!   Great desert pizza,  nice staff,  clean.  Loved the Apple pie desert pizza and the garlic Knotts.  They also have salad - but really?  Salad vs pizza....  Pepsi and I think spaghetti but didn't get a look at that.  Great place to take kids or families.  Decent price for what you get."}
{"text":"Good concept and dessert pizza of the month was good. (Maybe cookie dough crust). However we will not return. We found The pizza crust to be very hard. Reminded me of just flour and water. Sorry"}
{"text":"Absolutely no complaints. Good salad bar, large variety of pizza, and a handful of tasty dessert pizza. My favorite pizza  was the firefighter... Pepperoni, chicken, and jalapeño. Best dessert pizzas were cinnamon and apple!  There is also a section for pasta and sauces but I didn't leave room to eat any of those. We had a group of 13 and everyone found something they liked. I've never seen my 90 year old Grandma eat so much in her whole life!"}
{"text":"Pizza is a personal preference. The salad bar had a descent variety. With multiple lettuce and spinach options and a variety of salad toppings. If you like Peter Piper pizza (or Cici's pizza) you will like their's too. 
For us been there done that."}
{"text":"It is very good and the dessert pizzas are very good, but it's not the same quality as a 15 dollar or 20 dollar pizza. It's not meant to be that. It's a great value for the price and the pizza is really good! I don't understand the reviews here saying that it wasn't perfect or wasn't the best they've ever had. This is a pizza buffet and by far the best pizza buffet I've ever eaten at."}
{"text":"If your at the superstition mall, this is the place to try. Buffett style pizza , salads, and pasta. For an amazing price. Under 10 bucks and from 2-4 on weekdays it's only 5.99 for the Buffett!! Cmon!! No one has a Buffett for pizza that cheap. 

I've been here 2 times. Ow and everyone knows I love my buffets hehee. Can't beat the deal and the quality"}
{"text":"Always see this place when I drive south on Val Vista so took the family to go check it out. I ate at cicis pizza a while back and the experience was sub par, so in a way, I didn't get my hopes up considering it is a pizza buffet. With that being said, this place is actually really good, for $8 a person the food is solid; is it gourmet artisan new York style pizza approved by Gordon Ramsey? No. But you're also not paying $30 for one pizza. Salad is good, typical salad bar, and pasta is nice as well. I like how they boil the pasta on request so you don't have a bunch of pre cooked penne that's been sitting under a heat lamp for 4 hours. Then you get to pick from like 6 different sauces. Overall a really solid pizza buffet, good for if you and the family are really hungry or craving pizza."}
{"text":"This is by far my favorite all-you-can-eat pizza, pasta, and salad restaurant! I was amazed by the pasta bar, especially, because you get to pick your pasta and sauce. It's not even pre-made or warmed; they cook it right in front of you! Service is attentive and the restaurant itself is so cute! It's a well-liked place, but luckily, they have lots of seating for busy days. Overall, it's a very yummy, clean place, great for families!"}
{"text":"I enjoyed Pizza Pie Cafe, but it's not perfect.

The salad bar which isn't big, but it is sufficient for a pizza buffet.  The pasta bar was unexpected with numerous pastas which you pick and they quickly boil and there are a bunch of sauces you can add yourself.

Regarding pizza, the cheese pizza is great, but unfortunately the other pizzas just didn't seem appetizing to me. They looked like they have been there for a bit too long. I tried the BBQ chicken which had pineapple; I've never had pineapple on BBQ chicken, it seemed out of place.  The pizza was also a bit dry as it seemed to be out for a while.

I tried the apple and cookie dough pizzas, the apple tastes like an apple dessert pizza from any other place and just pass on the cookie dough.

Overall, I see myself returning sometime in the future to give it another chance as they have potential, maybe lunch  on a Saturday is not the best time to come for fresh pizza."}
{"text":"If I could give it zero stars I would. Absolutely nothing was edible. The pasta sauce was gritty like it had dirt or gravel in it. The pizza was dried out  and we couldn't even eat any. It was so bad My 6 yr old wouldn't even eat any dessert pizza. I got up a few minutes after arriving and my table had been cleared. Never again.. That was my forst and last time there. What a waste of time and money. We go to dinner only you leave as hungry as you came in."}
{"text":"The is a huge selection of pies for the buffet.However,their crust is just God-awful gooey & spongy! It tastes like it's not fully cooked.And a salad bar lacking in onions and mushrooms makes for a poor spinach salad.I do recommend the pasta bar.Unlike some other buffets,your choice of about 10 pastas is dipped in hot water to order.And there is an impressive selection of sauces and freshly grated Asiago cheese."}
{"text":"This place is amazing! Our first time here- We will be back! The chicken Alfredo pizza is awesome, the pesto pizza was good, could have used more pesto sauce, firefighter- to die for!!! Strawberry blueberry incredible. The salad bar is very fresh with a very good variety."}
{"text":"Hubby, Little one and I decided to try this place for the first time last night. Place was busy but didn't feel like it since it has a nice set up. It has lots of different pizza options which we all found good. Great salad bar selection!! The pasta station is very nice... you pick your pasta type, they drop it in the water to warm up and you pick your own sauce. The spicy sausage sauce was very good. The pizza desserts are plentiful and hubby almost had 2 slices of the cinnamon pizza even though he was full beyond belief... they were that good!! We will be back soon :)"}
{"text":"Overall it was ok...most of the pizzas were cold, i noticed that a couple of my slices of pizza tasted like they had sugar on them, almost like they either didn't wash the pan or there was a mix up of some sort, buffalo chicken pizza does not taste good with sugar on it. Overall it was ok for the price, I may give it another try, but I would have to be in the area, I wouldn't make a special trip."}
{"text":"The food here is just really bad - and I'm not picky either. There were just a few cheap items in the salad bar, and the pizza had been sitting around for a long time, so it was hard as a rock. After waiting for a while, they finally brought fresh pizzas out but they tasted very bland with a bland hard crust. And they had strange pizzas like chocolate! Smh? The pastas were already cooked, so then they put it in boiling water to heat up, so you can imagine how that tasted. As Steve P. said on a google review: \"It's the kind of food you'd get at a high school football game or a skating rink.\" Save your money and go somewhere else!"}
{"text":"Solid visit to pizza pie tonight. Pizza was hot and tasty! Pasta was great! Service was awesome! One suggestion, soft serve machine near the dessert pizzas would make a world of difference to the peach, raspberry and cookie dessert pizzas!"}
{"text":"This was my first time here and I will be back i wish they would have this in Chandler the food was awesome and the employees were nice I would highly recommended coming to this if you like pizza and cheap prices"}
{"text":"This place is great! It's a big building so no matter what time you come, you'll definitely be seated. For under $10 it's basically all you can eat pizza, pasta, salad, and dessert, and a drink as well. The food tasted good for the price. And they have different options to everything as well. You can pick your pasta and sauce, and their salad bar looks clean and up kept. Their desserts are delicious. Definitely go for the oreo or cookie dough one. Went with a friend and it was a good time."}
{"text":"I ate their this weekend with my wife after my in-laws ate their over their spring break after a trip to the movies. My wife and I agreed to go check it out and try it. The pizza dough was very dense and thick making the crust very chewy. There was a big lack of flavor because a lack of seasoning. The buffalo wing pizza was really sweet and sugary as well as many of the other sauces for the pizzas and pastas. The most frustrating part on top of the extremely poor quality of food was that it was almost impossible to get pizza from the counters because of the positioning of the sneezes guards, I had to reach in with my hands every time. I for sure will not be eating there again nor recommending it."}
{"text":"Just awful pizza. Nice variety, but all terrible. Service was just as bad. Dessert pizzas were promising but all very stale. Don't waste your time or money."}
{"text":"Bad experience. Sorry. No one clearing tables. Slow getting the pizza out. Felt like a similar local pizza buffet place and that is not a good thing. Probably won't be back. If this was not enough, a hair on top of my pizza."}
{"text":"So I guess that this is where you go if you have no taste buds? The pizza has no flavor what so ever. I sampled 4 different slices and they all tasted the same, blah. I tried the pasta and it was also blah. Salad bar was sad, and not many toppings. The crotons, fake bacon bits and sunflower seeds had a small cup to scoop them them out. This is nasty since you have to hold the cup to scoop out the toppings and then the cup is thrown back in the container and touches the food. Ewe! 
The pizza is under what I thought were heat lamps but none of the pizza was hot or even warm. They did not bring out a fresh pizza until every slice was gone so some sat there with one slice forever. 
I did try a piece of the apple dessert pizza which was ok, I tried the cinnamon slice but it was hard as a rock. Most likely because it had been sitting there forever. 
I didn't see anyone over the age of 18 working there. Maybe the manager was asleep in their office?"}
{"text":"Guys. This is a pizza buffet for $8 a person. For those of you expecting amazing artisan pizza, go elsewhere. For everyone else, especially parents, that are looking for an easy, no fuss, and pretty good dinner, this place is for you.

The pizza is pretty good. Definitely the best pizza buffet pizza that I've ever had, but far from the best pizza overall.They have a ton of different pizzas to choose from beyond the basics. The pasta bar is good. The pasta is well cooked and there are 6 different sauces that are delicious, but far from authentic. The salad bar is small, but is stocked with most peoples favorites and is a nice addition to the rest if the food. The dessert pizzas are fantastic. They beat any dessert pizza I've had anywhere else. 

This place is more than what I expected it to be. For $8 a person, you definitely get your money's worth. Thumbs up."}
{"text":"This place is good, good pizza and alot to choose from.. I tryed several differant kinds. All were good. Probably  the combo and hillbilly were my favorite.  And they have a very nice salad bar.  They also have a pasta station, i did not try it this time and several dessert  pizzas.  I was expecting  the quality of peter piper. But this place blows that away.  A very good pizza buffet.  And  very reasonably  priced.   I will try it again if i am in the area."}
{"text":"This is what you would expect from a buffet type of place.  Cleanliness and service is decent,  I enjoyed my salad the most, as everything else seemed to lack any real flavor.  The pizza is very dry and flat, the pasta is ok, a little on the over cooked side but fine otherwise."}
{"text":"Pizza Pie Cafe is an extremely CHEAP pizza buffet - if you're looking to fill up on a budget this is definitely a place where you can't go wrong. 

That said, you get what you pay for. The pizzas are very thin-crust, relatively crispy, with thin amounts of cheese and toppings. Again, not a bad deal considering the price, and there is definitely a wide variety of different toppings, as well as \"dessert\" pizzas which I found very good despite initially being skeptical about \"desserts\" on pizza crust. But it would not be a good deal at any higher a price.

Especially if you happen to be a fan of crispy crust pizza, you probably won't be disappointed. However, if you are a fan of thick and/or soft, gooey-crust pizza with lots and lots of cheese and toppings - and are willing to pay a correspondingly higher price, you would be far better served to head just a few miles due west to the southwest corner of Southern and Stapley for Organ Stop Pizza and enjoy the tremendous musical entertainment to boot. That's what I'll be doing. 

All that said, Pizza Pie Cafe also offers a sizable salad bar with many offerings, as well as a pasta bar with multiple types of pasta and sauces to mix and match as you choose. The pasta, unlike the rest of the offerings, is not self-serve; a server dips your selection into boiling water momentarily before placing it on your plate and then you ladle your choice of sauce on top from a \"soup-bar\" type set-up of sauces. The quality and variety of pasta is very good and I might suggest that despite the name of the establishment, Pizza Pie Cafe would be more appropriate as a first choice for people looking for a Pasta buffet rather than a Pizza buffet."}
{"text":"This is a fun and small buffet with pizzas, pasta, and salad bar.  They regularly have discounts and if you sign up for their coupons they will send you one what feels like daily. So, you shouldn't ever pay full price here! This is a smaller buffet so the food isn't anything spectacular, it is fun to try the different and interesting pizza options. They also re boil your pasta for you when you go for the pasta bar so that it is hot for you every time; however, ask them to extra strain it because sometimes it can still have lots of water left from being boiled.   They have like 5 different sauce options and cheeses to go on top. It's a fun place to take a family and everyone can find something they will like. They also have great dessert pizzas."}
{"text":"This is our first time trying out PPC. Not very busy in here, but I found the staff to be friendly and attentive. The pizza guy told us he could custom make any pizza we requested. The selection for the salad bar isn't the best I've ever seen but we were happy with it. They seemed to be rotating the pizzas pretty often, every time I looked over they were bringing a new pie out. Pasta was okay, nice to have different noodles and sauces to choose from. We liked the alfredo and the roasted red pepper. Jalapeño ranch was also a big hit. For $5.99 during happy hour we really had no complaints. Will definitely be back."}
{"text":"I really want to like this place. It's very clean and friendly and the salad bar has everything I love. The selection of pizza is perfect but they need to change their pizza crust recipe. I've rarely met a pizza I didn't like but Pizza Pie Cafe crust tastes odd and is rubbery. Once they do that I know this place will be packed and 5 stars all the way."}
{"text":"I was a little worried this would be like other \"all out can eat buffets\", but was pleasantly surprised.  The atmosphere was family friendly and there were various TVs throughout the place (we watched the Suns).   The salad bar was fresh and had nice choices.  There was a multi-leveled pizza area with a lot of fun choices - including dessert pizzas (Oreo, Apple, peach etc.). Now if you go, you must try the pasta bar.  They have a nice selection of various pastas to choose from - and once chosen your pasta is boiled a few minutes to ensure its freshness and taste. Then you have the tough task to pick a sauce.  Spicy red paper, carbonara, meat marinara, Alfredo, spicy sausage and more.  My entire family enjoyed it, and the service was friendly and helpful.  The price wasn't bad at $8.25 which did not include the drink.  I think this place will be added to our rotating list of restaurants."}
{"text":"Mediocre. I like the concept & it's a great place. But buffets aren't totally my thing. But my kids think this might be the best thing that ever happened to them- they're boring cheese pizza eaters. But they LOVE the dessert pizza selection. And the pasta bar is their fav. I like the salad bar but the topping selection is super disappointing! Lame might be a better description. I'd love to see some nuts & anything besides thickly shredded cheddar cheese-- let's try feta! Trade the beets out for mushrooms! And the chicken is frightening, and not labeled! Plus to feed my 4 kids a lunch buffet it was $32. A little overpriced for my budget."}
{"text":"I'm sorry but I believe the pizza here may be the worst I have ever had and that's even including frozen pizza. The crust is tasteless and has the texture of cardboard and the toppings kind of all taste the same. Never tried the dessert pizzas, that's not my thing. Employees are friendly, the restaurant is clean and pleasant. Salad bar is actually really fresh and good. The pasta bar is a good idea and is OK but some of the sauces are just average.
Unfortunately the pizza makes the place not on my list."}
{"text":"Found this place by buying a Groupon and will be back.  It's new, nice and clean.  The salad bar had a big selection and the pizza was yummy.  The staff also had smiles on their faces.  loved it"}
{"text":"I typically come to eat here every few weeks, variety with salads and pasta, many pizza options as well. New pizzas are constantly put out. This place always has deals like happy hour and especially if your part of their rewards program making the buffet super cheap.

This place is also inside the mall which makes it super convenient. It's right next to Dillard's entrance. For the price you get your money's worth. Staff is great as well, always cleaning up your plates and are polite."}
{"text":"Mmm those knots!

The Phoenix metro area is hard to navigate for food.  Why?  Because there are so many options!

Anyway, we got some coupons in the mail from this place and on a kiddo weekend we decided to try it.  We didn't use the coupons but that's beside the point.

The pizza was fresh and hot, there were plenty of options to choose from, and everything was very tidy.  (It didn't look like a herd of elephants had gone through the buffet line before us.)

The garlic knots were my favorite part, hence they were mentioned in the first line.  :)

The dessert pizzas are pretty standard but apparently they rotate one monthly.  That's cool.

Very affordable, quick place to grab lunch - particularly with picky little ones.  We've been back twice already and I'm sure we'll go again.  (First visit was about a month ago.)"}
{"text":"PPC is middle of the road, like the reviews imply. I went after 8pm and only paid $5.99 which was fair - the dinner price of $8.50 would be too much. Seating is mostly designed for larger groups with only a half dozen booths and no tables-for-two.

There is a lot of variety in pizza toppings as you would expect for a buffet. So that's cool. Unfortunately, the dough is very thick and dense, which doesn't make for very good pizza. Worse, is that most of the pizza was lukewarm so cheese wasn't gooey. However, the density of the dough ends up being perfect for garlic knots! Grab those for sure! 

Salad bar was basic, not as good as Ruby Tuesday's and for a place that is \"Pizza, Pasta, Salad\" I was expecting more variety. 

The pasta bar is a cool idea. They heat up par-cooked pasta and you add sauce yourself. The carbonara has no egg but and nice smokiness from bacon. 

Highlight is the dessert. Yum! My favorite was the \"cookie dough\". 

In summary, I'm glad I tried it, but am unlikely to return unless I get a craving for their dessert pizzas. I think about the fact that I've spent more than $5 on a dessert at other restaurants; here I could pay that and at least get a whole meal even if 90% of my visit is dessert!"}
{"text":"I came here with the family and ate like a fatass. This shit is good. The only reason I'm not giving it 5 stars is because they don't have any meatballs anywhere. My kids ate for free with a coupon and they ate like 10 plates of food. The spicy sausage sauce for the pasta is good af. They even have dessert pizza. I felt like I did something wrong after I came here. My son ate until he literally went into a food coma, and this is a kid who usually will barely eat anything. He woke himself up from said coma to eat \"two more bites\" of his Oreo pizza. Wtf. If you have kids you can't go wrong bringing them here unless they are diabetic or lactose intolerant, and one of my kids is one of those."}
{"text":"Pizza is subpar and I won't be returning. The first time I was disappointed but I decided to give it another shot months later and it was still not good. It's not bad, it just doesn't taste that great and isn't worth the money at all."}
{"text":"This place is awesome, for what it's worth. Their salad bar is larger than expected with several different toppings. They have a large variety of salad dressings as well (jalapeño ranch is my favorite). Their pizza selection is bigger than any other pizza buffet chain. The taste of the pizza is pretty much equivalent to any other chain--not great, not terrible. They also have a pasta bar, but I haven't tried it. They also have a couple of dessert pizzas--all really good!"}
{"text":"I love this place. It's a little far from my normal routes but I drive out of my way for it. We came for the lunch buffet twice now and have no complaints. 
Plenty of options for vegetarians -salad bar, pasta w/ marinara sauce. All excellent. They have about 5 options for dessert pizza too. 
The salad bar is awesome, the pizza is fresh and tastes nothing like cardboard like other buffet places. I hope this place is around for a long time!"}
{"text":"First of all I think Pizza Pie \"Café\" is a misnomer. They don't serve coffee. They have self serve soda and iced tea. Second this place is awesome. We came in and bought our meals. We were asked if this was our first experience here. It was and the girl told us all about the place. I don't understand other reviews about bad customer service. This is a buffet. You serve yourself. That's exactly what I did.
 
There is a pretty nice salad bar with fresh greens and plenty of toppings. several dressings to choose from. First course done.

There is a pasta station. How this works is you select either a half plate or a whole plate of one of several types of cooked pasta. This is where customer service may play a part. They will measure the specified quantity and submerge it for 30 seconds in boiling water to freshen it up and get it hot. They plate it and you ladle out the sauce of your choice. There are a 6 or 7 different kinds. I had the fettuccini with (I can't remember the name) a creamy sauce a with bacon flavor to it. It was pretty good. Second course finished.

The pizzas are made fresh. The crust is homemade every day, never frozen. There are about a dozen dinner pizzas and 8 dessert pizzas to choose from.  The pepperoni and sausage combo was ok. I likes the veggi pesto. That was my favorite. The crust is thin, (Score) and holds up to all the toppings. There is a little less sauce than I like. There is an adequate amount of cheese. (Can you tell I'm sort of a pizza snob?) Third course is history

The dessert pizzas are the highlight of the meal. The pizza of the month is a dessert pizza. \"The Monster Cookie\" This is a graham cracker crust topped with a coconut custard and sprinkled with chocolate chips. I could have made a meal of this. I also tried the raspberry pizza. This was like strudel. I had a piece of Oreo cookie pizza, also good. Fourth course, stick a fork in me I'm done.

I will be coming back here for sure. The buffet is $7,25 all day."}
{"text":"An Idaho based company, I was glad when they came to AZ. I was even happier when they opened on up in my neighborhood at the Superstition Springs Mall. I got a coupon for a $5.99 lunch special so I promptly came in. This store is located in the lower level of the mall where Ruby Tuesday's used to be. They really gave this place a contemporary look. They offer unlimited salad, 6 or 7 kinds of pasta, and about 20 different pizzas to choose from including 6 different desert pizzas.

I arrived just as they opened. The pasta was out, but not the pizza. The salad bar was good to go. The items in the salad bar were fresh and good quality. There are several options for toppings and dressings. Vegetarians would not be disappointed.

I made my way to the pasta table. I got a 1/2 order of spinach fettuccini with a creamy Alfredo sauce. They make the pasta ahead of time and then give it a soak in boiling water to warm it up. The sauces are in kettles in a steam table where you can help yourself. There were 6 sauces to choose from. 

By this time they had several pizzas ready. I tried 5 different slices then I was full. The pizza is good quality and a good value. The crust is thin and crisp. They offer a cheese bread for those who just have to have the bready experience. They have a pizza of the month. I didn't stay long enough for that one to come out. They also have a spot labeled customer request, so apparently you can design your own concoction and they will make it.

This will be a regular spot to slay my pizza cravings as the price is right, the quality good, and the quantity unlimited."}
{"text":"Love the great selection. Good prices.   Only thing I didn't care for was the pizza crust was on the tough/ chewy side.   Pasta was great.  Very nice interior.."}
{"text":"We loved this place, for a family of six this place was perfect. I have 3 boys that eat like they've never seen Food before and this place was up to the task. The price was more than reasonable the food was great and the staff even walked us through all the different bars since it was our first time. 

Somehow the owner caught wind that it was our first time and came out once we were done to check up on his store, I was extremely impressed!

I highly recommend Pizza Pie Cafe, five star."}
