{"text":"Stopped in to grab some slices to accompany my brewskis in the park. Solid slice. I'll be back for sure. Probably tomorrow."}
{"text":"This place is excellent for cheap, takeout pizza! About 4 dollars a slice. Slices are a bit smaller than pizza pizza or pizzaiolo but it's great to support this local business and the location is great if you live near Christie Pitts."}
{"text":"Everyone can sing, not everyone can sing well. Everyone can make pizza, not everyone can make pizza well.

Pizza Park is not a franchise chain. It's not greasy like Pizza Hut and doesn't taste like cardboard as so many Domino offerings do. 

Their pizza is not cooked in a Tuscan inspired brick oven and they don't have white truffle shavings as a topping option. Due to this individual slices and full pies are available on the cheap. 

Pizza Park isn't trying to be something it's not. They sell pizza and their located across the street from a park. It's that simple. A hidden gem."}
{"text":"My best friend lives around the corner from here so we came as soon as the doors opened. I may not be the best person to ask about gourmet pizza's and fancy sit downs but as far as pizza goes on weekends and late nights, this really is the best joint. 

Ive always had good customer service, great prices, quality of pizza is so worth it I often travel from the east end to pick some up. By far my top spot!"}
{"text":"I live near Christie subway station and discovered this place one night on my way home from work. It's just opened and pretty good. I really dislike chains so always like to find new Mom & Pop locations to check out. Not the best pizza I've ever had, but definitely worth it after a long day. Prices aren't bad and the guys in the shop are always pretty friendly. They have the usual array of pizza choices, and their Santa Fe pizza is quite good. All in all, not bad."}
{"text":"LOL.  There is a reason it is cheap.  X-large pepperoni pizza has 13 pieces of pepperoni on the whole pizza.  Got green olives and mushroom - maybe three green olives on the whole thing.  Mushrooms about the same.  Good if you're on a budget but if you have $13 to spend order from pizza pizza."}
{"text":"Ordered off uber eats.  The food arrived and it was all cold. The pizza was gross, it tasted exactly like frozen McCain deep and delicious.  The poutine was also cold and the gravy was a disgusting cold congealed lump. The fried chicken strips were ok. 

I would avoid this place"}
{"text":"C'est pas cher (11$ la pizza large avec 3 toppings), c'est ouvert tard et le personnel est sympa, que demande le peuple?"}
{"text":"Really good, similar to Pizza Pizza in look, but does not taste like cardboard like Pizza Pizza. good mom and pop place to grab a slice"}
{"text":"Cheap and quick. The only two words I care about when we're talking about pizza in this area. They do both of those things really well. I know the pizza isn't great but I still enjoy it."}
{"text":"I ordered delivery from Pizza Park last night.  I cannot comment on accessibility or cleanliness.

My partner and I wanted to order pizza locally.  We were torn between Pizza Park and Pizza Gigi.  I wished we had ordered from Pizza Gigi even though it's more expensive.

When I called Pizza Park, the person who answered the phone and I were having some communication issues.  He was not familiar with my street, even though it's only 5 streets over from the restaurant, so I had to spell it several times.  The person also informed me that Pizza Park does not offer mushrooms as a pizza topping.  This struck me as very odd.  When I asked for the total, the person paused for a very long time.  Then I was put on hold.  Another person answered the phone and was able to clarify and confirm my order in a clear and concise manner.

The pizza arrived very quickly, but I wished it hadn't.  The pizza looked VERY under cooked.  The cheese had barely melted.  Had my partner and I not been exhausted, we would have called and sent it back.  But we were starving so we ate it.  The pizza,despite being under cooked, was still VERY greasy.  It was \"cheap pizza\".  It wasn't bad but it wasn't good.  However, given that Toronto has some SPECTACULAR pizza options, I will not be ordering again."}
{"text":"Not sure if this is more of a reflection of pizza park or Just eat. Likely both. 

Pizza was terrible. Hardly any cheese on it, and crust was like cardboard. I threw out the entire thing, minus two bites. 

Delivery was also terrible border through Just Eat. The driver missed a digit in our street address, so called us looking for a non existent address an hour after our initial order. Still hadn't shown up 45 minutes later, so I phoned the number he called back to cancel (who wants to eat a pizza that has been sitting in a car for more than an hour??). He told me I was not allowed to cancel the order (I should have protested more- I was paying in cash on delivery ), and insisted the pizza was \"very fresh, still hot\" which was ridiculous, as it had been sitting in a cardboard box for over an hour. 

Sigh. Pizza was disgusting. The experience was terrible. No apology from pizza park or just eat. Next time I'll pay the extra two bucks and order something edible."}
{"text":"I was hungry before heading to Clintons on Saturday and decided to stop here for a slice of pizza.
After asking the guy for a slice of cheese pizza I looked at the pizza on the shelf below and there was a cockroach walking across the pepperoni pizza. I immediately walked out declaring there was a cockroach on his pizza. He seemed unphased by the entire thing.
I get bugs and mice are a problem in the city, but if they are crawling all over the food, it's a serious problem!
Gross Gross Gross!"}
{"text":"Solid pizza, friendly owners and a staple to any tee ball game with the kiddies. Especially fond of the meat lovers."}
{"text":"I actually really like the pizza slices here. The meat lovers is delicious and I also like their fried chicken. But then again I'm not a picky eater. However the restaurant is disgustingly hot when it's even a slightly warm day. I literally can't be in it for more than 30 seconds. They need an air conditioner ASAP"}
{"text":"I suppose it's not TOTALLY fair to give this place a 1 star review, given that I never actually got to EAT anything on the menu. Let me tell you a little about my Friday night. 

Arriving home, exhausted, my partner and I decided that our weekly \"date night\" would be comprised of ordering a delicious pizza and watching American Netflix in bed (I know, how romantic can you get?!) 

We knew this place existed (it's a few blocks away from us) , and after reading some fairly positive yelp reviews, I opted to order online (as suggested multiple times on their website, www.pizzapark.com). The following occurred: 

1. I attempted to order the Pizza Park deal- 2 medium pizzas with 4 cans of pop for 19.99. The interface of the website made the drop down \"toppings\" selections nearly impossible, and required multiple \"reloads\" to ensure that I could actually make the order. 

2. From the list of toppings, we were unclear as to whether \"cheese\" comes on all pizzas, as \"cheese\", \"extra \"cheese\", \"cheddar\", \"mozzarella\" and \"ricotta\" were all options. Yikes. 

3. My partner and I both painstakingly chose our toppings (4 each), I followed the prompts, and completed the order. 

4. After 4 minutes of not receiving an email confirmation or phone call (which I am used to because of justeat or orderit) I got worried. I called Pizza Park directly. 

5.
PP:  \"hello?\"
Me: \"hi, is this pizza park?\"
PP: \"yeah.\"
Me: \"Hi, okay, I'm hoping you can help me\"
PP: \"What do you want?\"
Me: \"um... I ordered a few minutes ago online, I just want to make sure that my order went through?\" (I'm a spazz and we were HUNGRY)
PP: \"no. it didn't\"
Me: \"So there is no online order showing up?\"
PP: No. what's your name?
Me: Sara Malkin. phone number : xxx-xxx-xxxx. Is my order there? 
PP: No. don't use the website next time. (I'm sorry- did a company just tell me NOT to order online.. when their website CLEARLY prompts that?!)
Me: Okay... I\"m just confused as to where all of my information went.. I provided my address, phone number, all of that online. Where did that go? 
PP: I don't know. Do you want to order or not?
Me: (SHOCKED AT THE RUDENESS) um... okay. Can I have the Pizza Park classic? 
PP\" What is that?
Me: (reads the entry / description on the website) 2 pizzas, 4 toppings each, 4 cans pop. 
PP: Yea. we don't do that
Me: Well then why is it advertised on your website? 
PP: Its not. you're thinking of justeat. 
Me: No I'm not. I'm looking at your website right now and I'm reading that directly. 
PP: Oh. So you ordered on OUR website? 
Me: YES! Does that mean you have my order? 
PP\" No. What do you want? 
Me: Okay, well I want that combo. On the first pizza, I want ricotta, chicken..
PP: Chicken counts as two toppings. What is ricotta? 
Me: The website doesn't say chicken counts as two... Ricotta is cheese...
PP: Chicken is two toppings and we don't have ricotta. 

At this point, I was almost hysterical given that the above conversation made almost NO sense to me and was easily the most frustrating and worst customer service I've ever experienced. Based SOLELY on the way I was treated on the phone, the lack of customer service, the disconnect between online and reality, and that when I asked about the chicken I was borderline scolded.. Pizza Park is not somewhere I will ever give a second chance."}
{"text":"The crust is just one step better than the usual pizza joint. It happens that they overcooked our first pizza. They were Nice enough to make us another one with extra everything and offered us free stuff on top without us even having us to complaining.

To summerize great pizza super customer service."}
{"text":"It's good and it's cheap, what more can you ask for out of a pizza place?

I wasn't expecting much walking in here. The restaurant itself isn't the nicest looking place but it's fine for what it is. The guy behind the counter (owner?) was nice but was a little hard to understand.

I placed my order of a medium pepperoni pizza (Wednesday special for $4.99) and then took a little walk around the neighbourhood while I waited for it to be made. When I came back it was just coming out of the oven. 

It was a nice night so I walked across the street to Christie Pits and saddled up to a picnic table to enjoy my pie. And enjoy it I did. The crust is good, not greasy and not dry. There's a nice amount of cheese and they weren't stingy on the pepperoni. I have absolutely no complaints.

Nov. 30-day challenge 34/30"}
{"text":"Really shitty gross pizza. It's really hard to make a bad pizza but they did it. I still ate the whole thing, but never again."}
{"text":"Is this great pizza? No. Do the slices on display look pretty gnarly? Yes. But, these are the only real downsides to this greasy 'za nook across from one of my fave parks. 

If you've got 15 minutes before your picnic in Christie Pits, you can get a fresh medium pepperoni for $6. Hooray. It beats the crap out of Pizza Pizza or Dominos in taste and price, and has that same satisfying, so-bad-it's-good feel. 

I hope you have a very happy picnic!"}
