{"text":"The best pizza and sandwich I have ever tried  for this price ..great hospitality and friendly staff.. Please try once and you will not regret .."}
{"text":"Wow, Great new pizza, the first time I've been here.. will comeback many more times,  The Toppings are awesome and fresh.. best I've seen.  Thanks for bringing such an awesome place to North Las Vegas.."}
{"text":"Have not tried their pizza-- rating this on my ordering experience. Ordered delivery online about thirty minutes ago and I receive a phone call from the online service they use saying that pizza republic will not answer their phone. The hours here state they opened at 11 am this morning but still haven't heard back from them so we are ordering elsewhere."}
{"text":"We came here for the unlimited toppings were greeted by a great staff very friendly the pizza was awesome we love our new pizza spot"}
{"text":"Really good, really cheap pizza. The staff is super friendly and remember me everytime that I walk in. Not in the best part of town but that doesnt really bother me."}
{"text":"The customer service was great however, the pizza was not good.  The pepperoni is the same pepperoni you would find on a individual frozen pizza at the super market for $.99.   The thin crust is not crunchy throughout the pizza and the veggie pizza was dry.  Would not order again."}
{"text":"Found this place on yelp and I was happy I did they have unlimited toppings and are fresh .....pizza was great and made fast they also deliver plus you can be a member of their club and they send emails with deals pizza maker was patient so you could look at everything and was very friendly ....I would recommend this place not the best area but it's worth it! We will be coming here again"}
{"text":"My husband and I went by and ordered separate pizzas from Mr. James Mills and staff's location here on Pecos.  The staff was warm and friendly, courteous service and Mr. Mills came over and made introductions, told us about Pizza Republic's history and invited us to try whatever toppings we want for no extra charge.  The charge for the pizza was nominal and to get ANY or ALL of the toppings on it at NO extra charge was music to our ears.  We took it home and enjoyed the freshness of the ingredients (alfredo sauce, ricotta, mozarella, artichokes and chicken...just on one side something special and different for me) And of course red sauce and a ton of other toppings.....YUM. I will be going back and telling others to go there.  Get to know them and help them GROW and stay in Las Vegas....C.Carroll"}
{"text":"I'm in pizza heaven and my daughter just ate almost a whole pizza!! If you like thin crust and all the best toppings you could think of including pesto sauce and ricotta cheese and you have to get the sun dried tomatoes, then try this spot. The are running an awesome special right now two for $10 and that's including all the toppings you want."}
{"text":"I went by today and was greeted by a wonderful staff.  The restaurant looked new, bright and clean.  I am more conservative and only had 4 toppings on my Pizza but the man behind me had a least 12 toppings in a very specific order.  Everyone was kind and explained everything to me since this was my first visit.  I will be back.  Thank you."}
{"text":"Tried to come back and give this place another chance but the customer service was still awful. Burnt pizza and the toppings weren't fresh, try a main stream pizza place they have quality standards to follow unlike this place."}
{"text":"Love all the options they give you. Pesto, alfredo, marinara, vodka, and bbq... and that's just the sauces! So many more options it's amazing and for such great prices. Love it and will be back 100%"}
