{"text":"The food was good, however what turned me off was the waiters response to my tree nut allergies. I always mention it before ordering and he assured me that it wouldnt be problem and that they always add the nuts afterwards and would let the chef in the back know to prepare it with clean utensils and bowls to make sure it wasnt contaminated. We ordered the charcuterie board which had a generous selection without any nuts. We thoroughly enjoyed it. However when the calabrese salad came, i noticed that there was pesto on it, which is usually made pinenuts. We flagged the waiter to ask about the pesto and it was indeed made with pinenuts. This was fine however he then turned to my boyfriend and said \"can you not eat it?\" Of course he said no and the waiter reluctantly brought it back and came back with another, sans pesto. I felt bad because having allergies is sometimes embarrassing and may seem as pretentious but we continued to enjoy our meal. The pastas came and what turned me off was that whenever he came back he would ask if i was \"still alive\". This happened atleast 3 times which was really inappropriate. At the end of the meal i told him politely that he shouldnt say that to customers with allergies- especially life threatening ones. Ive been to the hospital for anaphylaxis over 10 times so its not a joke and i tried my best to be understanding but in the end i left with a terrible taste in my mouth and was so uncomfortable with my dining experience.  I will not be coming back."}
{"text":"My wife and I have been there twice - outstanding food and service (pizza especially good) - a wonderful addition to the neighbourhood! Highly recommended."}
{"text":"Great pizza. Amazing crust, light toppings. Just perfect. The ravioli was good but at $24 way overpriced."}
{"text":"A neighbourhood gem! Right from the start our server who I think is one of the owners was friendly and helpful and made great suggestions. We started with a Negroni which was one of the best I've had. The appetizers were fantastic make sure you try the calamari. Pizza was perfect!!  Our server recommended dessert which I'm glad we had was the perfect end to a great meal and night. Very impressed with this restaurant a must try."}
{"text":"Been to this place several times with my family and have never been disappointed. In fact my kids love it and always want to go back. Pizzas are pretty authentic Italian thin crust at a reasonable price. Wait staff is pleasant too. I'll be coming back until my kids find a new favorite pizza joint."}
{"text":"A great new addition to the growing list of quality Humber Bay Shores restaurants. Wife and I have been there twice in the last three weeks and the food and service are first rate. I had the mushroom ravioli special which was excellent in all respects. Next time out the pizza special featured smoked trout which sounded odd but was also delicious. Staff are very helpful and offered some excellent (but inexpensive) wine parings. The calamari is the best! We'll be back soon."}
{"text":"I went there couple times.  The owner (I think he is the owner, the happiest guy in the room :)) is great, he knows his food and takes care of you like no other!  I must say the best tiramisu I ever had, apparently for a dollar more you can take it home if you're too full (might happen).  Had pasta few times and I must say it perfect! Fresh and lots and lots and lots of flavor.  The best dish there is pasta, for me , of course.  Had pizza couple times and although I like it (the duck pizza is a must) I wish the dough in a middle wasn't soggy, watery and falling apart.  I would give it 5 stars if that would not happen every time I order pizza there.  Still on search for best pizza, as I have my best pasta there !"}
{"text":"Expertly crafted Neapolitan style pizza. The location is unassuming, on the north side of lake shore between park lawn and islington, but a nice little patio tells you you're in the right place. Tables are all full on a Saturday night but we are seated with minimal wait. The Piatta d'oro may be the best antipasto platter in the city - pickled veg, a selection of meats and cheeses, arancini balls, fried calamari...terrific. Red and white pizzas each have their charms, on top of perfect chewy-crunchy crust. We are too full for dessert but what went by looked amazing. Will be back soon!"}
{"text":"Nice atmosphere , calamari was delicious and the pizza wood fired , fantastic . Parking in the strip plaza and street . They squeezed us in on a busy Saturday night . Well with it , price reasonable :)"}
{"text":"Really good pizza!  It's a little pricey but it's quality food. It's not your average walk in cheap pizza place; you come here for an experience and it's a very nice one.  My boyfriend and I really enjoyed the food but unfortunately it won't be an every week/weekend visit due to the prices."}
{"text":"Made a reservation on a Friday night for 7:30pm for two. The place was busy but we were greeted and seated right away upon arrival. Owner and waiter were extremely welcoming and friendly. Food service came quickly as we had water on the table immediately. My girlfriend and I ordered our own pizza each to share and the fried calamari as an appetizer. Everything tasted great, good service, great atmosphere. Will definitely be back!"}
{"text":"Awesome food Better service Great to see a restaurant in Mimico packed on a Saturday night. From 6pm when we were the first in, by 7pm there wasn't a table left"}
{"text":"The ragù alla bolognese was as good as those I had in Italy. In this case they made it with lamb which I thought slightly odd at first until I tasted it and realized it captured the distinct gaminess of those in Bologna (where they likely use grass fed beef). For pizza I had the Oro, an orgy of meat while somehow not overdone. The crust had the perfect balance of snap, chew and char essential to any great vera pizza napoletana.   On my previous visit I had the Diavolo which was equally impressive. This was preceded by appetizers, the wife and I shared bison carpaccio and arancini. Had the meal ended at that point I still would have been thoroughly satisfied; having the Diavolo and tiramisu afterward was like desserts 1 and 2.  Add to that the patio and this restaurant is a welcome addition to the neighbourhood. Bravo!"}
{"text":"Pretty cool, 90 seconds to cook your pizza at 900 degrees... Unfortunately it's also about 900 degrees inside (air conditioning a necessity for longevity..).  The oro pizza was excellent, be really nice not to be hounded for TIPS on everything nowadays.. Expensive enough as it is to eat out, felt since 'tude for not tipping. Sorry $20 for a medium sized pizza is a lot of money. One time visit at these prices, if it was $10-12 we'd definitely go back.  Great to see this and Tich (next door), these area totally blows, dumpy and ugly. They could bulldoze most of Lake shore around here."}
{"text":"Oro di Napoli has been a staple local eatery for us since it opened. Both the food and service is consistently outstanding. I've brought family visiting from out of town a few times; they agree it's great. Their pizza is my favorite in all of Toronto. Love this place!"}
{"text":"Located not too far away from the Mimico GO Station (just west of Lakeshore Road W and Park Lawn Road), this is a casual joint with a very intimate and relaxed vibe - think twinkling lights, brick wall, open space with a decent amount of seating. A nice setting for a date, or a family or group dinner.   First, parking. There's street parking in front of the restaurant, and on the residential street adjacent to it (but you can't park on the residential street between 8:00 AM and 5:00 PM).  Second, the food. Overall, it wasn't anything spectacular, but it was nice and did the job. We ordered the Vesuvio Pizza ($17.00 - crushed tomatoes, crispy breaded prosciutto, salted ricotta) and the Gnocchi Fritti ($16.00 - fried purple potato gnocchi with green apple and crushed chestnuts). It isn't the best Italian food you'll ever have, and there are certainly better joints in Toronto, but the meal was perfectly fine. The pizza was lacking in prosciutto (we could barely find any) so they unfortunately scrimp on the meat, but the textures were interesting and it was delicious and light. The Gnocchi was fine, but didn't have very much body in terms of flavour. Portion size was also smaller than expected - at $16.00, we thought it was pricey for the small handful of gnocchi pieces we were served.  With tax and tip, our meal came to around $45.00 (no drinks). It's a nice place to check out at least once, but it terms of value, it seemed pricey for what we received. Overall, not bad - service was great, and food was decently tasty. A solid 3 to 3.5*."}
{"text":"Happy to welcome this place to the neighbourhood. I have only ordered a takeout pizza so my review is based on that alone and what I saw while there.  The space is really nicely decorated and great for the area. Napolean style pizza and delicious Italian food, you can't go wrong.  The pizza I ordered was delicious. It was called the Diavola and came to $17 with tax picked up. You can order through their app which makes ordering easy.  The place smelled amazing when I went in to pick up my food that I definitely need to go back and sit in for dinner. Everything looks super fresh and they post some excellent pics of their specials on Instagram.   If you are looking for a great pizza and Italian food that is a step up from some of the more family friendly places in the area, definitely check this place out!"}
{"text":"First restaurant that we visited in the Mimico area - it was a treat.  Friday night, no reservation, we managed to squeeze in - I really do recommend reservations.  Service (the owner) was attentive and prompt, and we definitely enjoyed the food. The specials sounded enticing, but so did the regular menu.  Will definitely go back, and would definitely recommend."}
{"text":"Had recently moved into the area and was looking for something tasty to feed a handful of people. We stumbled across this place and opted to do takeout.   Staff were incredibly friendly and gave off a really warm vibe.   We went with the following pizzas:  Margherita D.O.P. Diavola Pizza Oro Tartufo Bufalina  Of all the pizzas, Tartufo and Diavola were hits amongst the crowd. The flavour profile on the Tartufo was bang on and the Diavola was a close second to favourites amongst the crowd. Crust was really good- tasty, good cook and not chewy. Had a good weight to it that didn't really slow you down. Comparable to a Pizza Libretto in terms of overall taste, but would put their crust ahead.  Will go back, solid Neapolitan style pizza in the neighbourhood."}
{"text":"Pizza was good, but not great.  Atmosphere:  Dim, bustling on a Saturday night, with exposed brick walls.  We didn't have to wait for a table, but restaurant was almost full for dinner!  Service was better by the male than the female server.  He actually came by to check-in and genuinely there to serve.  My rating would've been 1* less if it hadn't been for this guy!  We ordered:  Ortolana ($14) & Napoletana ($13), both were 12\" and I thought waaay more than 1 person could finish.  I found all the toppings quite salty on the Napoletana  - even bites without anchovies and olives!  There was no tartness in the San Marzano tomato sauce.  It did have a sprig of fresh herb on it - oregano/marjoram?    Ortolana was good and had really tasty roasted sliced eggplant on it.  You definitely had to fold this one in half 'cause of the chunky veg toppings!    You can taste the freshness of the toppings in both pizzas, but I like the pizza at Whole Foods better due to the crust.  I like a thin, slightly crunchy crust as opposed to chewy dough.  Overall, I'd visit again ONLY IF I was in the area."}
{"text":"This is probably my favourite pizza place in the city. Always a good choice! Ask for Tony, he makes you feel at home - and I personally love everything on the menu. If I had to pick just one The Diavola is Devine!!"}
{"text":"Al fresco on the patio good fare good service checked out the pasta despite pizzeria name. Special was homemade lobster ravioli little salty and chewy but tasty pesto penne not homemade pasta but good. Only 2 months old and worth a second visit."}
{"text":"Good service and delicious food. Diavola pizza made on a stone oven was really good. Sopa di pecce was delicious. All plates Presentation was beautiful. I would recommend it to my friends."}
{"text":"Second visit better than the first!! Great service! Awesome food! Next time I'll break from my pizza fix and try some of the homemade pasta and desserts!!! You have to go!"}
{"text":"We had the Margherita and Oro Pizza and Mushroom risotto. Atmosphere was quaint. Familial vibe. Food was very good.   Will come back again."}
{"text":"Really delicious pizza. I ordered for takeout and it was ready in about 20 minutes. I had driven by many times but wasn't sure if it was different than similar pizza places in the area. I really appreciate that it's more affordable here than say FBI and a single pizza is a great portion to share or for 1 person.  I ordered the Ortolana with no cheese. The crust was delicious as well as the toppings. I'll definitely be back."}
{"text":"We have found a new favourite in the Park Lawn Lake Shore area. A very good alternative to the overpriced fare at Eden. Real wood fired oven. Much more convenient than our other wood fired fave, Dinos on teh Queensway We sat on deck and although it only has the view of Lake Shore road we were focused on the food.  We all had pizzas and they were all good. Light crispy crust. Only negative was the non-stop banter of the waiter Bill. Despite that we will be back and intend on doing take out next."}
{"text":"I love this place. The service is always so warm and welcoming. The food is amazing. The pizza and pastas are so fresh and delicious. It's quick as well. They were so kind when we showed up with an infant during dinner hours and very accommodating. I can't recommend this place enough."}
{"text":"Food was okay but the price was not worth it. The portion sizes of the salad and pasta were super small! Average male would definitely be hungry.   The margharita pizza was okay. I prefer pizza 850 more. The pasta was too chewy and there were barely any meat! The beet salad was yummy but it was again tiny!   The guy who took the order was friendly but the girl at the bar when we picked up the food was short and unfriendly. Way to go...new restaurant...piss off your new customers.   Anyways. Next time I would rather drive to downtown for better food and way better price...and less a grumpy greeting girl."}
