{"text":"Make sure you arrive hungry! I got the double cheese/double spinach/double mushroom, which was a huge delicious slice, plus, to my surprise, it was served with a pizza roll AND dipping sauce. The guy said it came with that! Pretty awesome. I went in for a simple slice and was fed a feast. :)"}
{"text":"This pizza is unbelievable. Thin crust. tasty sauce. It just all works and is the best kosher pizza in a city with a lot of great kosher pizza.  The caramelized onion pizza may be the greatest innovation since the printing press."}
{"text":"Stumbled upon this place today. Solid slices here. Not your generic franchise pizza. I recommend the spicy fries poutine pizza ."}
{"text":"Another update, they get upgraded to 4 stars since I have found myself virtually addicted to their vegan pizza and seasoned fries.  We ordered pizza for a work event and people would not get their damned cheese-eating paws off the cheeseless pizza that was ordered just for me. How good is that pizza? Well apparently SO GOOD that they kept eating that one, rather than the cheesy Greek-style pizza they had (also no meat)."}
{"text":"Don't be fooled by the generic sounding name and dangerous-looking exterior... The food inside is cheap, delicious, filling, and relatively healthy!   I'm currently training in this neighborhood and don't have a car or the motivation to pack lunch everyday, so yesterday I decided to not judge a restaurant by its exterior and to invite myself in. I'm actually not a huge fan of pizza (crazy, I know), but saw \"falafels\" on the name banner and as a huge middle eastern food fanatic I knew I needed to at least see the menu.   I was pretty impressed initially by the pricing although not everything is dirt cheap, especially the salads, which are around $8-12, which is comparable to salads sold in downtown Toronto. The pizzas looked interesting, and I can see them making them from scratch in the back with all the giant ovens. I ordered the small falafel platter $5.69, which came with a whole wheat pita, 3 deep fried falafels that they make on the spot, dipping sauce (tastes like tahini?), and a small aluminum container of side dishes, including hummus, baba gnoush, purple cabbage, marinated mushrooms, salsa, etc. Trust me, I eat a lot, and despite how small the portions looked, it was all very, very filling as you can expect from fiber and protein. Everything is supposed to be vegan, but who knows. There's also a large version of this priced at $8. Other non-pizza food options include salads, salmon platter, fries, soup of the day (made in-house, changes daily), etc.   The staff members are very nice, and there always seems to be a steady flow of customers. Most of the customers are Jewish and look like regulars, so evidently Pizza Cafe has received the stamp of community approval, which truly says a lot about the food!  They also do catering.  Will return!"}
{"text":"The manager/owner Tomer Malta is extremely abusive and unreasonable. I heard him yelling at his employees and some customers while I was there. I just left before risking an order. How crazy do you have to be to be so abusive to your customers and employees? A regular \"Amy's Baking Company\" moment. I'm too frightened to even try eating here! CRAZY PEOPLE WORK HERE!"}
{"text":"Excellent food and service! Love their Turkish subs, the best I've ever tastes anywhere."}
{"text":"If you stumble upon this place like I did, then mazel tov to you too! I was primarily in the area for some Filipino eats, but got drawn to the display case of slices from the outside. This pizza place is kosher, which makes it vegetarian (but not vegan) cause dairy and meat aren't served together. It was about an hour before the lunch rush and I got one of the last slices of caramelized onion which tells me it was probably from the night before. It was heated up in the pizza oven and while it didn't taste peak freshness, the caramelized onion topping was excellent. Some of the best I've ever had. At $4, this large tasty slice was a great deal. Note that parking is limited.  Rating: 4 sexy Israelis named Gal out of 5"}
{"text":"Was here because of the taste of the Manila festival but wasn't feeling for Filipino food so I decided to check this place out.  I like how they have a veggie cheeseless pizza which is great if ur staying away from dairy.  I also had their falafel wrap and love all the other topping that they have to put in the wrap like roasted eggplants is one of them.  Would go back for sure!"}
