{"text":"Es stinkt immer nach Resten um Backofen und nach altem Fett. Geht gar nicht.  Außerdem ist der Chef sehr unfreundlich und macht auch vor der angegebenen Zeit schon Feierabend bzw Mittagspause. Er scheint nicht wirklich Geld verdienen zu wollen.  Fazit: Nicht hingehen!"}
{"text":"Ich war schon öfter dort essen und war bis jetzt immer sehr zufrieden.  Es ist keineswegs ein Sterne-Restaurant, eher eine Imbiss-Bude.  Aber es ist die Beste, Frischeste, leckerste Pizza, die es meiner Meinung nach im ganzen Kreis Giessen zu essen gibt.  MAn kann dem Koch beim zubereiten zusehen, das fand ich sehr toll, da man wirklich sehen kann, was alles drauf kommt."}
{"text":"Ambiente ist nichts besonderes. Dafür die Pizza um so mehr!!! Die Beste weit und breit! Wird vor deinen Augen zubereitet und gebacken. Suuuuper lecker! Schade dass Die keinen Lieferdienst haben...... PS. wird schon seit eh und je von den Eigentümer selbst gebacken. Soweit ich es weis stammen die Inhaber aus Sardinien....  !"}
{"text":"Diese kleine Pizzeria ist ein kleinod der Deutschen Gastrolandschaft. Der Pizzabäcker hat, bevor er Piccola Firenze eröffnete ein sehr gutes Restaurant geführt und somit ist es kein Wunder das sogar Leute aus dem 65 km entfernten Frankfurt sich den weg machen um Pizza und Pasta zu genießen. Echte gute und frische Zutaten sind das geheimniss des Erfolges. Ich bin schon seit der Eröffnung Stammkunde. Man kann mit dem Betreiberehepaar über Gott und die Welt philosophieren und sich ganz nebenbei die Wartezeit verkürzen indem man zu schaut wie die leckere Pizza entsteht oder die vom Chef selbsgemalten Bilder an der Wand bestaunen.Kreativität ist hier in jeder Ecke.Ich habe bis jetzt nur in Rom eine Pizza bekommen die an das Ergebniss der Piccola Firenze heranreicht. Für die vorsichtigen bestellt einfach eine einfache Pizza oder laßt euch beraten. Absoluter Geheimtipp !!! Echt Lecker !!!"}
{"text":"Allgemein ich war mal wieder bei meinem Lieblingsitaliener in Lich. superklasse diese Pizza. sehr sehr lecker und immer wieder gut. hohe qualität im Ambiente und charme einer kleinen Trattoria. Bedienung wie immer unglaublich herzlicher empfang und tolle gespräche , man fühlt sich wie zuhause bei Mama. Das Essen Pizza Romana gegessen. ein Gedicht....suuuuuuperlecker. Das Ambiente wie immer sauber , ordentlich, einfach wie zuhause, Trattoria Charme, mit vom Küchenchef selbstgemalten Bildern. einen Besuch wert Sauberkeit hier wird mit produkten ordentlich umgegangen, mann kann dabei zusehen wie das essen zubereitet wird , lobenswert"}
