{"text":"The margarita pizza they have with a soprassa-stuffed crust changed my life for real. One of the best Neopolitan style pizzas in the city. The rice balls are also my jam. Staff were attentive and had lots of personality. I'm not even Italian at all - but it made me feel like I was at my Nona's house!!  A homeless lady came in and stole a loaf of bread when we were in line, props to that lady! Gotta give credit to Via Mercanti as well for feeding the homeless."}
{"text":"This is a very nice addition to this stretch of Gerrard ... Large open and inviting space space with nice decor and laid back atmosphere. Place was packed with families and couples. Our server was amazing in helping us figure out which pizzas to order, which were both amazing. And the price was below what we expected."}
{"text":"Absolutely a treat! The pizza's were amazing!   Not only was the pizza amazing the staff was great. There was a couple in the venue who wanted to skip out on their bill. They were causing such a scene. In fact I'm surprised the staff didn't tell them to go where the sun don't shine. However they dealt with it with up most decorum. I commend them for being so patient and kind to these people who were becoming obnoxious and obscene and I was getting ready to throw my table at them if they weren't asked to leave.  The wait staff came over and apologized for the ruckus more than once. Although it shouldn't have been them apologizing, it should have been that ignorant couple for disturbing my meal! ANYWAY back to the pizza.  Pizza was amazing my friend and I cut ours down the middle and shared. I always like to try flavors I can't get else where so that is what we did and it was so enjoyable.  Great food great staff great atmosphere."}
{"text":"My favorite Italian pizza spot in the city! Being of Italian origin, I am a bit of a pizza snob. When I found Via Mercanti last year, I was hooked! I love the non-pretentious and casual vibe and of course, the delicious pizza.    My favorite is the Ciambella - a margherita pizza, with the crust stuffed with salted ricotta and spicy sopressata salami.  I have been to this restaurant a dozen of times over the year and I will continue to go back.  The only criticism I have is that their desserts aren't great. I have tried the tiramisu, the ricotta pear cake, and the nutella pizza and found them to be lackluster.  But I don't hold this against them as they've gotten their pizza perfectly right!"}
{"text":"Absolutely delicious pizza and pasta. Family of four shared the Caprese salad-where did they manage to find great tomatoes in January? Fagottino di parma was ordered gluten free and every last bit was enjoyed. Our server recommended the Pasta alla Bolognese and I thought \"how good can bolognese be?\" Well, it can life-changing. At VM, this is a sure hit. The sauce was so rich and deep and decadent and the linguine perfectly al dente. Wow! I will crave this pasta all winter. Bambino and Via Mercanti pizzas were perfect. Excellent char on a tasty crust with bright, fresh tomato sauce and oozy cheese. The fries on the Bambino were strange but the child loved them. Massive servings of the tastiest gelato ever topped off a perfect meal. Service was flawless and our server/manager Brittney was charming and knowledgeable. We will be back very soon!"}
{"text":"The best pizza in Toronto right now...they're bocconcini di pizza are really good too. Same flavour and taste  as if you're eating pizza in Italy."}
{"text":"Via Mercanti, ti voglio bene. Perfect pizza backed by authenticity and real Italian charm.   This quaint and simple pizzeria is located in the heart of Kensington Market and when our server sees us approaching, he extends a warm:  \"Buonasera!\"  It's a simple place but all Italian. The owners are from Napoli, Eros Ramazotti plays on the sound system, and the kitchen brigade are bonafide Italian, not a bunch of botchagaloop imposters. Enrico, our server is charming and perfect at his job. I tell him this and he answers in his lyrical Italian accent:   \"I love what I do, so that makes it easy!\"  Tonight is a special night as I'm having dinner with my love and the parents who happen to be in town from the Big Apple. Dad is picky about his pizza and he has every right to be as an Italian New Yorker. I'm hoping that Via Mercanti lives up to the hype.Mamma mia, I'm impressed. We are all impressed. Even Dad shouts:   \"The best pizza I've had! You get my approval!\"  First slice: Napoletana. Black olives, perfectly blistered cherry tomatoes, Italian oregano, and tasty anchovies. Thin crust, not soggy, unlike some other popular places in the city (I won't mention names). They know what they're doing here. Second slice: Ramolo's. Tomato, olive oil, fior di latte, prosciutto cotto, assorted mushrooms. Heaven on a slice. They make a great Negroni here also.  My only disappointment is the Tiramisu. It's not bad but it's lacking in caliber. First off, it's served in a small round ramekin. In my opinion, Tiramisu should be served sliced with a great view of the Savoiardi biscuit layer and the contrasting mascarpone. Secondly, it's lacking in espresso and liqueur and dominantly tasting of raw mascarpone. The Cannoli looked good and apparently, it tasted even better. Mom had the Crème brûlée and she liked it, but from a former pastry chef's perspective, I can tell you it's lacking the significant burnt top layer and the custard consistency is thinner than it should be. The desserts here need some fine tuning and focus. Perhaps they need me to pay them a visit.  Desserts aside, Via Mercanti is the perfect pizzeria."}
{"text":"Excellent pizza and value. Kida were treated like kings. Loud family style restaurant. Great staff."}
{"text":"what a horrible experience,  my date and I were offended by the unabashed homophobia the owner expressed when I kissed my date on the way to the washroom after we put our order in.   not only did she express her repulsion to our affection, she claimed that we were disturbing the rest of her patrons.  will never recommend this restaurant to anyone."}
{"text":"Hard to find location. Good Italian food. Finally have liquor license.  We've been a couple of times - the first time was during their soft opening, and most recently last weekend when we learned we could finally order wine. :)  My husband has tried the Pizza Diavolo and Pizza Bambino (without the fries); I've had their Pizza Margherita and Linguine Al Pomodoro. The pizza is good - nice thin crust, fresh ingredients. Pasta was fresh as well, perfectly al dente. Although I would say close neighbour Mercatto has slightly better pizza and Strand 241 slightly better Pomodoro pasta, we still really enjoyed our food. The $10 Pizza Margherita is a fab deal. The bread was great - rosemary Parmesan flatbread.   Staff are very friendly and always personally open the door to welcome us in. They pump in satellite Italian music and there is a TV in one dining room (the brighter room). I do find the decor or ambiance a little cold, but could be that it's brand new.   The location seems a bit odd, attached to the YWCA and behind the hospital and around the corner from the bus station. They probably still need more signage because it's hard to find. But hopefully with more outreach and publicity, more people will find out about it and fill the space. This could be a hidden gem!"}
{"text":"I suspect that they just cant get the right heat with their ovens and they have to cook the pizza for too long.  The cheese seems broken and the crust is dry and hard.  A bit disappointing.  The service was average at best.  Nothing new here."}
{"text":"The pizza is quite yummy. Thin crust and great ingredients;  you get more dough edge compared to some other Neapolitan pizza places and that's fine by me.  Definitely give it a try when you're in the area."}
{"text":"Amazing pizzeria! I've been here 5 times and it's consistently great. The dough is done so well and made traditionally like in Naples. The service is good and the ambiance of the place feels like in Italy. I'm in either Rome or Milan each week for work, and this restaurant is as good as any good pizzeria you'd get in Italy. I love it and highly recommend it!"}
{"text":"Very secluded. But neverthless an interesting location to me. Loved the way the restaurant looks, very vintage and old school, something organic about it. Not sure what pizza I had, it was awhile back, all I know is it was pricey but the experience was nice and unique. I'm pretty sure it was linguine al pomodoro but it could've been something else. I never remember wtf I ate in these places by name, but yeah, trying to upgrade my visits from regular pizza pizza, or pizza nova joints, getting snobby, it was one of the most authentic pizza taste I had in Toronto, since I came back from Venice."}
{"text":"Wow. I'm speechless.  It's been 14 hours since I've eaten here and I haven't stopped thinking about this place since leaving.  The manager and staff are extremely friendly and approachable, the atmosphere is amazing, and has a noxious smell of espresso, wood fired pizza and baked goods.  We waited almost 20 minutes for food, and it was worth the wait. Lots of seating, 2 tvs playing live european football, and friendly staff make this place a sure hit in the heart of Kensington Market.  The Margherita Pizza is the best I've ever had. The crust is thin enough to not fill you up, and not thin enough to cause spillage of toppings and sauce. It's perfectly foldable and you can actually taste the wood from the oven in the pizza. It's simply marvelous, just like a fine wine. I paired the pizza with filtered water and an espresso which went down very nicely. my tastebuds were doing backflips, my stomach was purring like a kitten and my eyes were jumping out of my skull. My sinus cavity thanked me for some well needed scent based TLC, and for once everything was in perfect harmony.   Full open bar here too I might add with a decent liquor selection too.   The espresso here was great, and I usually hate espresso.  My favorite from this place was the rice ball though. Inside had lots of cheese  and sauce, just the way it was meant to be.  Move over Commisso's, you have some new competition in town.  Viva Via Merchanti!!!  Saluté!!"}
{"text":"After finishing eating some crab cakes next door to this pizza joint, we decided to give it a try since my gf and I enjoy the new 90 sec to make pizza with fresh toppings...We got a seat right away and we ordered 'Broccolini with Sausage Pizza'...  The crust reminded me of the same quality like domino's, pizza pizza etc., But the toppings were pretty nice to try. Broccoli vegi taste like mustard taste and is unusual to add on pizza. The sausage meat was good too. The only complaint was the crust dough factor which we felt was a bit too tough to cut through.  btw...We sat there for a good 30 mins b4 our pizza came out...I guess the guy making pizza and cooking could not handle 6 orders...  The chili oil was pretty tasty with the pizza...Next time if around the area, maybe try a different pizza..."}
{"text":"Food was ok.  We ordered a caprese salad, magherita pizza, the pasta special: spinach and ricotta canneloni and one other pasta dish that i forget..  we arrive at 7pm and the place has about 10 empty tables and they say they aren't sure if they can seat the 3 of us (my mom, sister and i)... then they decide they did have room for us but we had to be out by 8pm. fine. i'm ok with that.  they seat us and the guy offers us flat or sparkling water. i say flat thinking it's tap water (my fault). i just found this to be such a scam. ended up being $5.  we order our food after a few minutes of deliberation. i ordered the canneloni and he says it takes 15 minutes to make and reminds us that we have to be out by 8pm.. it was 715pm by that time, not much of an issue i dont think.   our mains arrive well before our salad does and our waiter just seems all over the place-- it wasn't overly busy, but he just wasn't attentive. One reviewer also mentioned they were touched by the people who work there-- while i wasn't touched, i was definitely creeped out with their forward behaviour. i was with my 14 year old sister and my 55 year old mother... not appropriate. at all.   the food was only meh. my canneloni, tasted just of tomato, there was barely any ricotta inside of it as well.  the pizza was probably the best dish at our table.  in any case, we all felt way too rushed with the constant reminders of having to leave at 8pm. we were done by 7:40 and out the door by 750.   I won't be going back. and trust me, i will be telling all my friends to stay away from this place. i was looking forward to another option from terroni & libretto.. i'd rather wait in line 2 hours at libretto then go back."}
{"text":"After reading NOW Magazine's Top 20 Pizza Joints, I dragged a few friends and we headed to Kensington.  Very busy, nice vibe.  We sat at the counter and watched the old Italian guy place the pizzas in the super hot oven.  Very entertaining for us foodies.  I had their Via Mercanti Pizza (margarita on top of another pizza, need I say more?)  The pizzas were truly fantastic.  We ordered the Nutella Pizza to share for dessert - unbelievable.   And the wine was delicious.  I'm a die-hard Queen Margarita Fan, so I felt a little like I was cheating.  But alas, had a great time!"}
{"text":"This pizza rivals Terroni... That's a big statement! (Read my review of Terroni).  This is the real shhhhitiiiitttttteee if you know what I mean. If you've been to Italy and have tasted a lot of pizza you know what you are getting here. I haven't branched out of the pizza area yet because it's just so flipping good I can't help but keep ordering it. I'll sit in with friends or take it to go for a lunch in the park. It's just soooo goood.  The service is very authentically Italian pizzeria style. I use to live in Italy and would go to pizzerias with my ex boyfriend to watch football matches and I swear Via Mercanti has imported their servers from Italy direct!  Gotta check this place. Sure beats freezing your arse off waiting to get into Terroni and let's face it Kensington is a cooler area than the wannabe Queen West anyway."}
{"text":"I was looking forward to the menu as I looked at the menus at the other locations.  The menu at this location was very limited to pizza and pasta...things children would like.  It all made sense as our dining experience was like sitting in a middle school cafeteria with all the screaming children.  Service was neglectful as we were low maintenance so we were basically ignored.  The food was just adequate. My friends and I will not be back. My neighbours had the same experience with a disappointing birthday dinner.  No atmosphere, it really is like a cafeteria."}
{"text":"I really want to like Mercanti but over time I've found that their dough is way too salty.  I thought it was just maybe me but another review also mentioned it.  The dough plus the ingredients that are also high in sodium, cheese, sauce, meats makes the combined pizza just too much to enjoy.  Maybe they do it just so you drink more beer. . .   The service is also a bit of a hit and miss.  Some nights it's ok, other times it feels like they are just processing another order.    It's too bad because they seemed to be better when they started out."}
{"text":"If you're looking for a good quality tasty pizza, definitely check this place out. The pizza is quite tasty -- crunchy crust, fresh toppings and sauce, and thin.  However, try to get a seat on the main level, I had the unfortunate experience of having a table in the basement, it felt like a dungeon (small, dark, and dirtier). If it wasn't for that experience, I would've probably given a higher rating."}
{"text":"Unfortunately this pizzeria does not serve authentic Neapolitan pizza. Sadly the pizza is super doughy and not tasty. Not even close. I came there many months ago and I was pretty sure that the pizza was different back then. Could anyone confirm if is was right? Well 1)Don't bother going for pizza 2) Even though the pasta is \"made fresh\", something is off, the sauce is quite bland and I would guess that it was cooked in a starchy water too. 3) The Calamari & Shrimps were also meh.... Frittura  di Pesce should actually contain fish, that's what Pesce means. And either it should be just dusted with flour or a super thin and crispy light batter. Instead, no fish, just shrimp and calamari and a rather chewy batter. Not worth the calories.  However, if you are looking for drinks and atmosphere this place has a lovely buzz. If you are foodie, I would avoid it. For the prices, the food should authentic and tastier.  I really hope they upgrade their pasta and pizza.  I really like the location. best wishes, Id"}
{"text":"I had the pleasure of visiting Via Mercanti this afternoon. With 3 friends we ordered 2 pizzas and their Bocconcini Di Pizza (little dough bites filled with ricotta, fior di latte and prosciutto). The minimum order for Bocconcini is 4(they gave us 5 with one on the house!), so there's no trying one, but after having 1 you'll want another anyhow. I found that the prosciutto distribution in them wasn't perfect, and a couple lacked any meat. By and by it was okay, but I'd hate to get a plate full of them missing meat, and it's a numbers game.  All pizzas have Olive Oil and Parmesan cheese unless otherwise noted, and they have a selection of pizza with or without tomato sauce, the alternative being a creamier pizza usually with potato. We got one of each pizza.  To be honest, this was my first experience with Neapolitan style pizza. I was very pleasant though and the pizza was absolutely tasty. The Bocconcini Di Pizza are tasty morsels and I definitely recommend ordering.  The place is affordable: 2 pizzas, 4 morsels and flat water came to $45 after tip. Wouldn't be going there all the time, but a nice place to hit up now and then when you feel like having something particularly delicious. Strikes me as a good date place.   Decor is pleasant, feels very clean with white walls and wood. Lots of nice light from the windows in the front.   Service was alright. It  took a while to get the bill and they didn't seem overly busy, but in their defense I was in a small rush. Service was courteous, but I think a few extra little touches would go a long way.  They also have a dessert menu, didn't get a chance to try."}
{"text":"Great experience here! The Calzone pizza was fantastic, it had hot soppresatta and ricotta cheese stuffed in the crust. It was very original and delicious. The Margherita is a tasty standby too. Their caprese salad was great - the fior di latte cheese was very fresh and full of favour as well as the tomatoes. Portion size was good too - we shared three pizzas and two salads among five adults with leftover.  Also, the restaurant atomophere was comfortable and laid back. I didn't have room for dessert, but their gelato bar looked incredible. I'll definitely be going back to test it out!"}
{"text":"Very cute and Large Italian restaurant. Great quality food and great service. Our waiter, Sam, was very knowledgable and helped us narrow now our choices. Had great recommendations. Would defiantly return. Only down side is that menu is partly in Italian so was somewhat difficult to navigate on our own."}
{"text":"The pizza was great, the risotto balls were dry, the salads were ok, and the prices were really reasonable. However, our server was awful. He was really creepy, then we later realized that he had overcharged our group significantly. When I returned to the restaurant to clear up the bill, the manager initially refused to provide us with a refund, because our server had already left for the night and she had given him the extra money in cash. Would not recommend for a large group."}
{"text":"Went there a few weeks ago. Food was very good but service was outstanding.  Britt was our server and she was so friendly and competent. We were very impressed. She's amazing"}
{"text":"Great food, great service. Nice atmosphere and ambience. The pizzas here are awesome and the sandwiches across the street at their Mercanti sandwich shop are equally as amazing."}
{"text":"This is probably my favorite pizza place in town. Simple but with some much flavor. Javi orders the special pizza. My sis in law ordered the \"patate e pancetta\", her husband ordered his favorite pizza -fungui- (he is from Toronto), and a I got the mercanti salad. It was a feast. Everything was just amazing. It tasted like authentic home-made Italian food. I high Lot recooked this place."}
{"text":"Casual, friendly service and atmosphere. I had the margherita pizza and it's the closest to the pizza I had in the region of Italy after which this restaurant is named. Will be back for sure!"}
{"text":"Happy to see a new restaurant open up in the neighbourhood. It is much bigger than what I thought and great for families or large groups. I loved the decor and my fiancé appreciated that he could Ignore me to watch the blue jays on one of the multiple screens in the restaurant. We ordered A caprese salad, calamari and pizza rolls to start. All were delicious, in particular the shrimp and calamari were perfectly cooked and were not overly battered. The pizza via mercanti - double decker- was delicious. The service was fantastic from start to finish. We will definitely be back."}
{"text":"Went on a Friday night, the service was actually great, contrary to some of what I read here.  The food was a disappointment. Had the rice balls, mozzarella balls and calamari to start, plus the warmed olives. Ollives were great - the mozza and rice balls were so bland, not worth the calories. The calamari was very fishy tasting. The pizzas were okay, just merely adequate. Libretto. Terroni, or even a small joint like Terrazza does it better... BUT if you're going for a casual meal w a group of friends the wine is reasonably priced, they WILL take reservations, and the atmosphere/service was good."}
{"text":"My Margherita was juicy and fantastic. I also like retro Faema coffee machine here, although I don't like Segafredo as my coffee. I like the inviting pizza oven at the front. Overall it is nice and pretty much the only one Italian pizza place at Kensington area."}
{"text":"Went with 5 other people. Everyone enjoyed their meal. I had the Via Merchanti pizza; 2 layer pizza. It was excellent.    This is a nice place in Kensington market. A bit noisy but that didn't stop us from having a good time. Service was good."}
{"text":"My wife and I ate here after reading about it in NOW, which had a favourable review in its list of top pizza places. Before seeing the review, we had walked by so many times and not even thought about stopping in.  We both really enjoyed the pizzas we had, especially the Margherita, and you can't go wrong with the price. It's very affordable, with most of the pizzas priced between $10-$15.  But if you go with someone else and you're very hungry, you may want to get a pizza for yourself or order something extra because if you're sharing one you may still be a little hungry (you can say that for pretty much every Neapolitan-style pizza place in Toronto).  The food came out quick and the staff was very attentive.  This is a nice little gem in Kensington."}
{"text":"Got the pizza via mercanti to go. It was pretty good, a little overly salty, but the ingredients were good. The outer crust is pretty thick but the middle is thin. It's on the pricey side but this particular pizza is double layered and enough food that I could make 4 meals out of it (good for sharing). I'll be back but will probably try a different pizza."}
{"text":"We cobbled together a group of 7 friends who didn't want to cook on a Sunday evening and all headed for dinner at Via Mercanti.  The first thing I noticed: the staff are actually Italian....and extremely friendly...and enthusiastic. The service was an enjoyable topic of conversation throughout the evening.  The food was simple and tasty. My wife and I started with Mozzarelline Fritte (5 breaded and fried mozzarella balls). They are as delicious as they sound. Each ball is about the size of a walnut - not bad for $4. We also tried one bite of calamari, which was average  Tip: for those of you who love breaded, deep-fried calamari, this ain't it. It's the real stuff with garlic and oil)  The table also shared the signature Bocconcini di Pizza - these are much bigger than the mozzarella balls and well worth the $1.50 each.  For a main I had the Ciambella Ripiena pizza (so much fun to say!). It has hot sopressata folded into the crust - like a fancy stuffed crust. Mmmmm  Everyone ordered pizza and seemed very satisfied with their choices (Capricciosa, Traditrice, Quattro Stagione)  Tip: You can add ingredients to any pizza (my wife added *ugh* anchovies to the Traditrice)  Finally, we collectively ordered creme brulee, nutella crostada, and 4 flavours of gelato for dessert. The creme brulee was thicker than I've typically had (more custardy) and tasted great. The gelato was creamy and flavourful. I didn't try to nutella crostada, but the reception was \"meh\"  Overall a comfortable, relaxed Italian joint with solid food and incredible service.  Jon recommends."}
{"text":"If all the pizzerias in Toronto that I've been to, this one has the most friendly service and the best food. Having been to Italy myself, I can tell you that the pizza (both the Biance and Rosse) here is authentic and delicious, as are the many appetizers.   The staff are friendly, and the atmosphere is great, only serving to make your food taste that much better! TIP: Try dipping your crust in the olive oil. Ask for Danielle; a very friendly server."}
{"text":"Best pizza I've had since I was last in Italy! If you like authentic Italian pizza this is the place to go! The only thing I'd like to see more of would be lunch time specials."}
{"text":"The flavour was there, but the way the pizza was made was pretty terrible. Authentic Italian pizza must have a thin, crispy crust... this one was super soggy from the oily cheese and from being WAY undercooked. The dough was quite chewy (again, undercooked) and a little too thick in some areas. Not good.  The potential for a great pizza is there when the staff learns how to master the wood ovens, because as I said previously, the flavour combos are excellent. Until that happens though, I think there is much better pizza to be had in this city."}
{"text":"It was a rainy night when my boyfriend and I decided to go to Kensington Market. I had no clue this place existed and boy was I impressed. It's not a fancy-pants place, but simple delicious food with wonderful wait staff. We shared a divine margarita pizza that came with a blisteringly hot crust -- yum -- and a luscious lasagna. We also had a basic green salad that wasn't special, but provided a vinegary counterpoint to the cheesy mains. We also had a jug of red wine, and then we ran out into the rain. I can't wait to go again."}
{"text":"Things started off well: the hostess was friendly, and offered us a choice of tables. Our waiter was engaging and accommodating. The ambiance is just right for the neighbourhood: bustling, loud, family-friendly. It's not trying to be anything it isn't, but the space is well-lit, and first impressions - other than a regrettable varnish/paint smell, which really ought to be gone after several months - were positive. Our food came out fairly quickly, but that's where things took a turn for the \"meh\".  While there was nothing specifically wrong with the two pizzas we had, there was precious little right about them either. Although the crust looked right - just a hint of bubbling and scorching at the edges - the effect on the palate was... nothing much. Bland? Floury, perhaps.  In any case, devoid of that magical whatever-it-is that the best Neapolitan-style pizza provides.  So too the pizza toppings: the porchetta managed somehow to be similarly lacking in flavour, and the texture was also not to my liking; I hesitate to speculate, but I wouldn't swear that it had never been frozen. The margherita suffered from the same crust issues, and its tomato sauce was identifiable chiefly from its red colour, and location on top of a pizza, rather than any memorable tomato flavour.  Hoping to liven up my dinner, I reached for the chili oil; devoid of anything I couldn't have got by chewing a chili and taking a shot of cooking oil, it provided heat and disappointment in equal measure. Preparation of a decent chili oil ought to include more than just literally those two ingredients artlessly combined. The bolognese sauce on the pasta dish was somewhat better, managing to provide some flavour, but for the money that's the least it could do.  In the end, food vs. value is what lets this restaurant down: the food would be alright if it cost less, but with its pizzas going for $17-$19, Via Mercanti on Gerrard prices itself into a league in which it simply isn't competitive.  I know that the Kensington branch of Via Mercanti was founded by chefs who had previously worked in Italy, and subsequently at Queen Margherita, but that heavyweight resume just highlights the failings of the Gerrard incarnation. As dinner here costs the same as dinner at Queen Margherita or Libretto, I'm unable to find any reason why I'd bother returning to Via Mercanti."}
{"text":"So if you saw any of my other reviews (not that popular, I know), you'd know that this place is where Back Alley BBQ used to be. Why I'm posting that piece of 'irrelevant' information in this review is because I had made reservations to go to Back Alley about a week ago. I had sent an email reservation, got a reply back saying come on in, and when I showed up for my reservation, ended up walking up and down the street confused and bewildered...no sign of the restaurant. And so the story resumes...  Scared, confused and a little unnerved at my perceived lack of ability to follow a map, and freezing my tush off outside, I decided to walk in to what was very evidently a pizzeria (at the address of the Back Alley BBQ). I abashedly walked through the door and fortuitously stumbled upon one of the chefs (and owner's) of this new Neapolitan pizza/pasta joint immediately as I walked in.  Feeling quite foolish, I asked him if he knew the location of the BBQ place; he smiled and said that about a week earlier, they had flipped the restaurant and turned it in to a Pizzeria, specializing in authentic Neapolitan Pizzas and so on...  I typically would feel embarrassed in this situation as I was having a couple friends come meet me and had made the reservations. Thinking quickly on my feet, I thought that I'd save face and make the best of the situation; I chose to just end up staying where I was for dinner, I figured I was divined here for a reason...very glad I stayed.  First things first, while I was waiting for my friends to show, I had the pleasure of speaking with what I can only describe as a very passionate chef, dedicated to bringing his love and experience of Neapolitan food to us hapless Torontonians. He gave me further confidence by telling me that he also had helped open up another great pizzeria, Queen Margherita in the East end of the city. Bonus points awarded!  My friend showed up while we were talking and were quickly escorted to our seats. The place was a little empty but to be fair, Kensington was very quiet everywhere that evening. We sat down and looked at a one page menu with a nice diversity of food; starters, pizzas and pastas, salads etc.. They had a few draught on tap and some wines.  I'm not going to say that this is a 'review' of the restaurant as I don't think it's completely fair having opened only a week earlier; let's just call this more of some 'note-sharing'. Here are the highlights:  - service was attentive and friendly if however not fully knowledgeable about all aspects of the menu; but eager to please - serving sizes were very good; a large sized Caprese was very generous, more than enough for 2; I would have liked a bit more flavor but the way I see it is that they may not have found all their perfect suppliers yet for the tomatoes and Mozzy - not a big deal to be honest; was still fresh - atmosphere was very relaxed and low-key - pizza was FANTASTIC; cooked perfectly, fantastic flavor combo which I hadn't experienced before, didn't want to share, didn't leave a crumb, wanted another one...that good - my friends were equally satisfied with their pizzas and reluctantly we all shared a little of our pizzas with each other; if not per the social code of pizza eating  Anyways, as one of my friend's put it, she was excited that they had this style restaurant open up in her neighborhood. She seemed absolutely elated and had little doubt that she'd be coming back soon.  So there you go, not really a review, but a few 'notes' well-shared I hope.  Go, eat, enjoy...Mangia Mangia."}
{"text":"Best pizza in Toronto for those who dislike Pizza Pizza. Thin delicious crust. Reasonably priced. Atmosphere - like in good  pizzeria in Italy. Amazing tiramisu! My foddie friends from NYC agree with me + said that tiramisu is such that they would travel just for it from NYC!"}
{"text":"Wonderful food, great menu, very attentive service by Massimo,  fair prices.  We'll be coming back often."}
{"text":"I've been a few times, and the pizzas, salads, etc are all very good.  Atmosphere is warm and friendly, and so is the service.  I've heard a few people say this is the best pizza in Toronto, but I think that's a bit of a stretch.  Probably top 5 though."}
{"text":"One of the best real Neapolitan style pizzas in Toronto.  Wood burning oven, excellent ingredients and cooked by people who know what they are doing.  My kind of place with a very good beer selection and nice and attentive people.  Not fancy, but a salt of the earth type of place."}
{"text":"We had people visiting from our corporate office so for team dinner, one person suggested bringing them here. They have \"the best pizza in Toronto\" after all. And was featured in \"You Gotta Eat Here\". I don't know why those two are valid considerations when choosing a pizza place but we had a consensus.  So off to Kensington Market we go, braving the traffic, going crazy finding parking and having a close encounter with a very interesting man with a snake.   And the consensus was no, it's not the best pizza in Toronto. Not by a long shot. And there being about 15 of us, we ordered all kinds of pizza and nothing stood out. Some were even shot down.  We did have better luck with the appetizers and the free bread you get is stellar so it was not a total fail. Service was fast and friendly too. It's just not a good pizza place. And definitely not the best pizza place in Toronto. Sorry John Catucci, that's 1 point off your street cred too. Why did you tell us we gotta eat here?"}
{"text":"This is probably my favorite go to place for pizza.  Their sour dough bread will amaze you. Before, you can just ask for it but now they only offer it if you get an appetizer/starter   Recommendation: margarita and scarpariello (if you like spicy, def ask for chilli oil)"}
{"text":"The food is amazing...but unfortunately, reservations don't mean anything here.  We had a reservation and were 20 mins late...but they still made us wait over half an hour and didn't seem to care.  Usually, restaurants will hold a reso for 30 mins.  So don't go if you're starving and haven't eaten."}
{"text":"Just returned from an evening in Kensington Market with the family. Expereinced Via Mercanti..........piacerevole, divertente, and definitely Delicious!!!! Service was great......from the host Maurizio to our server Errico(gorgeous set of blue eyes) We had the capriciossa, patate and proscioutto, and the 2 pizzas in one.  I think its the house special.  Very filling, you may want to share that one.   We then had Nutella pizza for desert...............delizioso!!!!  Ci vediamo a piu presto Ciao ragazzi"}
{"text":"First time there. Must say that the service was quick and staff was very good. Food was just ok. I guess I expected more because of all the hype. All and all, if you happen to be in the area and you're in the mood for pizza, it's the go to place. Wouldn't drive down there just for that."}
{"text":"Order up the house specialty, the Via Mercanti   This is a unique pie; inside stuffed with ricotta, prosciutto, and mushrooms,  then on top with mozzarella and tomato sauce and a leaf of rapini. Like two pizzas in one.  This is one seriously beautiful tasting pizza.     The place has opened for 2 weeks but I feel will become a hot spot in the coming months.   btw, on the table there's in a glass mason jar with this amazing concoction of fresh slices of red chili pepper and olive oil. Love it. I could do shots of it!"}
{"text":"Been a number of times now and it's always been very good. All the pizzas we've had have been as good as Libretto or Queen Margareta and the appetizers are very good. Service is good."}
{"text":"Love this place. Classic Neapolitan pizza the way it should be: chunky around the edges, thin in the centre, perfect amount of sloppy wetness and chew. If you're looking for wafer thin, crispy crust, then go eat a cracker. Pasta and bread are homemade too. Delicious. I brought my  Nonno here and he loved it.  Nonno was even able to tell that the pasta was bronze cut. The waiter was impressed and told the Chef.  Later the Chef came to the table with a big smile and the actual bronze die. What a great experience!"}
{"text":"This is a fantastic authentic Italian restaurant. My favourite pizza in Toronto. Great atmosphere and Staff. Go here"}
{"text":"I still haven't been to Queen Margherita Pizza. Despite all the wonderful reviews it's gotten, a lot of people I know have told me it's really not worth the wait or the distance. I have, however, been to QMP's spin-off location (well...not exactly but you know what I mean) a couple of times for lunch in the past few weeks and I really like it.  Service was excellent both times except for the one waitress who didn't make a whole lot of sense when we were trying to order smaller bottles of San Pellegrino (they only have the jumbo family-sized ones). It's a nice little spot and if Kensington Market is looking to move up a notch on the upscale/rustic movement, this place will fit right in, though it kind of takes away from the whole Market vibe.  Both times I ate here, there were very few empty seats (it was lunchtime) and people seemed to be enjoying their food. And both times, I ordered the capricciosa and really can't comment on anything beyond this. On one occasion, I went with a friend who is vegetarian, though I cannot remember what she had (she seemed to like it). I was a tad disappointed the first time as their idea of capricciosa does not include artichoke which some places do, some don't--I prefer it when they do. Nevertheless, VM's was pretty delish and their spicy oil is a bonus. I can't seem to break away from capricciosa when it's on offer, mainly because it has a lot of my favourite things and they all taste good together. I can't do Margherita as I find it way too plain, though I will eventually try out some of the other items that were mentioned by other Yelpers.  Definitely worth a try if you like your thin-crust and haven't been already. The prices are a bit less than a lot of other thin-crust joints too. Could be the location, but hopefully it stays that way as I find it a tad ridiculous paying upwards of $20 for a pizza these days. I get that some items are imported but it still seems kind of silly when we're not talking about uber-supreme ingredients."}
{"text":"when this place first opened its pizzas were not in the same price range as liberetto and queen margarita pizza so the 2 times i went there over a year ago, i didnt expect too much. they were ok.  going back yesterday as a party of 7 i noticed the price was hiked to liberetto standards, as such i was judging them accordingly. Unfortunately their take on napoletana pizza is barely average  -its too doughy of a pizza, and very unevenly pressed out in alot of areas leaving massive bread chunks in certain parts.  -the sauce was incredibly bland. not sure if it was just a lack of salt or poor choice in tomatoes or both? also the pizza was not wetted enough with sauce imo, it was very dry.  -the fior di latte was decent but the amounts on the pizza barely made the minimum amount required. I recall their bieng at least 1-2 more areas of cheese.  service was ok at best , nothing to rave about.  All in all i wont be going back i think, sticking with liberetto and QMP who offer a better product at that price range"}
{"text":"I just tried this place today. My friend and I were tight on time so we needed something to go and that we could eat on the run. We got a couple of calzones. They were *slightly* too heavily seasoned, but overall were tasty and really hit the spot. My only complaint is that it is way too expensive. We ended up paying $36 for two calzones. Also, I felt it was total bush league when the waiter asked if we need change for the $40 we put down. They must be insane to think that it is appropriate to expect a $4 tip for a takeout order, especially when their prices are ridiculous to begin with."}
{"text":"I went there to try the summerlicious dinner.  The pappardelle ai funghi was excellent: very tasty sauce and the pasta was cooked at perfection. We also tried the Romolo's pizza and the quality was great, as usual.  Our server was friendly and spoke Italian.  Can't beat that!"}
{"text":"Ladies, don't go unless you wanna get sexually harassed. Which, by it's definition, you don't.   Pizza is good but not the best, very bright and we waited for over an hour when we were promised a table in half an hour. Then we were bullied into trying a wine the waiter promised was the best; it was terrible (don't trust me, trust the sommelier at our table who went along out of politeness) and cost $60, in the highest range for the restaurant.  Before the end of the night, our sever had \"massaged\" two of the women at our table, after they said no, hit two in the face with an errant prosecco cork he let fly to impress ladies at another table, borrowed one of our chargers for another woman patron he was hitting on, and then looked annoyed when we asked to split the bill. Over my protestations, we paid it, and even tipped.  Just goes to show, I should've trusted my gut and walked out when we were first rudely lied to and ignored.   This was my second visit to the place, the first was just good pizza and bad ambiance with mediocre service, none of this outlandish stuff, but god help you if you're server is a creepy short Italian man with boundary issues and no wine sense."}
{"text":"Authentique. De la pizza savoureuse qui se déguste comme un plat plutôt qu'un objet géométrique qu'on emporte. Ajoutons à cela un personnel efficace, sympathique et adore s'interpeller l'un l'autre en italien. La popularité du lieu est un témoignage de l'excellence de la cuisine.   Prenez donc les calmars. A Toronto, c'est souvent servi tout caoutchouteux, limite plastique. Chez Via Mercanti, tout le contraire, de calmars al dente sans être des bouts de chambre à air."}
{"text":"If I could give 0 stars, i would! This place is just REALLY overpriced horrible food! I would prefer to eat a $1 can of ravioli than their $20 ravioli dish. They charge $8 for 5 very very tiny mozzarella balls that honestly tasted like nothing...maybe salted rubber. The service was almost as bad; unfriendly and unaccommodating. When a FLY (yes, a fly) was found in my beer, I didn't even get an apology...however they did give me a new one. They automatically added a 18% gratuity charge (on top of tax) for our party of 6.  Just feel taken advantage of...and still hungry :("}
{"text":"Came to this place on a Saturday night. When we arrived at the address, we weren't sure if this was a restaurant or not but we poked in and asked if this was where the restaurant was. It has a weird storefront but once you get in, you'll see that there's a bigger eating area to your left. The decor of this place had a homey feel, wasn't exactly the atmosphere I was looking for, but that's what it was. I ordered the mushroom pizza. The toppings and sauce tasted quite fresh, but I was disappointed to find that the pizza was so thin that the tomato sauce had made it soggy in the middle. It was so thin the toppings would slide off when you lifted the slice because it didn't have much strength to it. There are tons of pizzeria places in the area, I probably wouldn't consider coming back."}
{"text":"I have dreams about the scarpariello. It's that good. Their specials are also something to keep an eye out for, especially any time they have gnocchi! To die for.  Easily the best Neapolitan pizza in Toronto."}
{"text":"Best pizza in town. Less salty than Libretto, although the atmosphere isn't as trendy.  The Elm St. location has a great patio in the summer."}
{"text":"Great za's, decent Italian. Nice room and feel. Id go again"}
{"text":"The Margherita pizza was delicious. The house salad was pretty average but the seasoning and bits of orange and fennel stepped it up a notch. The atmosphere and service really won me over. The patio was spacious and beautiful and the staff was fast, friendly and attentive. The Italian music on the radio was nice, but my gf wanted me to take a star away because the played Celine Dion."}
{"text":"We were at Via Mercanti on Augusta last night.  for what they are worth, I offer a couple of comments.  1. I have to scold you (severely) on your wine markup. How in goodness name can you take Cavallina (LCBO $7.60) to $36 a bottle? That's a 4.4x markup. That's just ridiculous and leaves a very bad taste in my mouth.  1a. by contrast, your beer pricing was fairly reasonable I thought and your selection quite interesting. Keep that side of things up.  2. Everyone else seemed to enjoy their pizza (or didn't comment) but I found the crust on mine (Quattro Formagi) overly thick and chewy. Not at all as I remember a good pizza in Italy."}
{"text":"The pizza dough tastes more like they got Naan from the local Indian restaurant or perhaps pita. Toppings were ok. I will give it another try hoping it will be better."}
{"text":"Went on a Tuesday evening, promptly seated at the patio and had perfectly adequate service throughout, so perhaps it varies based on who's working.   Between two, had a pesto pizza, and the two layer via mercanti pizza. The double layer one is really something, it's a margherita on top of another meat pizza. Yes two crusts and all!   The pesto is made in house, and was pleasantly light. A nice contrast to the double layer beast. Only it was a bit much with the oil, and pools of olive oil pocketed the surface. The whole base of the pizza was mushy and not quite my style, but the taste was there.  Would go back if I'm in the area, but don't rush to try it out."}
{"text":"I wanted to have some authentic pizza and this place was close by so we gave it a try. The entrance to the restaurant is dingy but the seating area is cute. The food itself however leaves little to desire. We had the margarita pizza and the eggplant pasta. The pizza crust was under salted and kinda soggy. It wasn't inedible but I wasn't impressed. The pasta was smoked mozzarella and eggplant, which had an average taste but unfortunately was undercooked. The server was alright but was not the most friendly. The prices were average, $13 for the pizza and $20 for the pasta but not worth it for the quality of food. Overall, I wouldn't go again."}
{"text":"Yes, I'm a fan! Great service and great tasting Italian pizza make this restaurant a must visit at the Kensington Market. Only draw back I found was that it was noisy! But, that won't discourage me from visiting again."}
{"text":"I've been to the Kensington location, this one is very similar with a good floor space and a relaxed vibe.  These pizzas seem to be well-made with a good texture but I find the flavor is incredibly bland and flat. I hate paying about 20 bucks for what seems like a naan bread with a pop.  Libretto, Queen Margarita and even North Of Brooklyn are better IMO."}
{"text":"Have had pizza at this location 5 or 6 times, it is beautifully rendered in look and texture but truthfully for me it's kind of dull tasting. It's like eating Naan bread.  Every time. I could take it or leave it.  For the classic Neapolitain here's Pizza Libretto (Danforth & elsewhere). Maybe Queen Margerita too but they can be hit and miss. North Of Brooklyn is great if I just want a slice of something remotely close to that (1/6 pie is $5.)  For the exotic and aberrant I'd go for Descendant Detroit-Style Pizza. The farthest thing from Napoli but I can't deny it's brilliant."}
{"text":"I think you need to stick to pizza at this place.  My pasta was beyond bland.  Weak service.  My friends enjoyed their pizzas though."}
{"text":"Authentic Neapolitan pizza, great service & a nicely decorated, casual restaurant. One pizza per person for dinner is perfect. Definitely recommend."}
{"text":"The decor of the restaurant was quite lovely with large windows and plentiful seating.  The location is tucked away from the hustle and bustle of downtown.  After reviewing the menu online I had high hopes for a lunch meeting with friends.  Sadly, I was very disappointed with my pizza.  I ordered the Carpaccio (sp?) with prosciutto, black olives, mushrooms, tomato sauce and cheese. The middle of the pizza was ridiculously soggy and swimming in the sauce!  this affected all four slices and required eating the pizza with a knife and fork (since picking up the slice by hand resulted in all the sauce and cheesind dripping).  There was a good quantity of prosciutto but very few mushrooms.   The non-soggy parts of the pizza were quite tasty though.  My friends enjoyed their meals (they ordered pizza without tomato sauce and some apps).  Hopefully this was just a one-off - I would be willing to give this place a second chance at some point due to the ambiance.  I also found the restaurant to be pricy for lunch (no lunch specials were offered to us).  The service was prompt, for the most part, but not overly friendly or intrusive."}
{"text":"We had an excellent meal of pizza, pasta, bread and gelato. The crust on the pizza is top notch. The toppings are fresh and well blended. Pasta is properly cooked and flavourful. Trecce pasta is superb. Lots of tables, family friendly! One of the best in Toronto."}
{"text":"Romolo Salvati knows his pizza!   Being a fan of Queen Margherita and Mercanti in Kensington, I was excited to eat here!  Located at Elm and University, this is a great spot for lunch with co-workers. The restaurant is inside the historic YWCA building, close to Bus Terminal, and Sunnybrook Hospital.  There were lots of young hospital staff grabbing a bite.  I had made a reservation in case they were busy, but there were many tables available at noon.  The menu had $10 lunch specials -- which were tempting! But we split a a pizza and 3 appetizers so that we could try more items.  We ordered the pizza before the appetizers because we were worried about how long it would take to make.  It came out before we ordered the appetizers! The Capriciossa pizza ($15) was topped with prosciutto, black olives, and mushrooms.  The crust was perfectly toasty and chewy. A light pizza that two people could finish off easily.  The arancini rice balls were huge! ($5 a piece). Moist and filling, cheesy and saucy... Interesting with peas and beef. Slightly over-fried though but still good!  The fried mozzarella balls ($4) were freaking delish. There were five small, bite sized pieces.   They weren't big, but super tasty and salty.  The calamari alla marinara was really fresh! A simple appetizer sauteed with olive oil, white wine, and  tomatoes. After we ate the calamari, we were quick to soak up the oil with fresh bread.  We left very happy with our meal. Via Mercanti is a great spot to grab a pizza in the core!  Now all they need is a sign out front so people can find the restaurant."}
{"text":"A great price, great atmosphere and delicious pizza. Now has become one of my favourite in the city. I am a big fan of thin crust pizza and this pizza has a delicious thin crust, fresh tomato sauce and the perfect amount of cheese. We also had their signature pizza balls which were nice too, they even customized them to make them vegetarian for us with vegetables vs meat. Will definitely be going back!"}
{"text":"Excellent pizza and outstanding service. Came here on a chilly winter night with my friends and was welcomed by 3 servers the moment we walked in the door. The service is fast and very friendly. Really inviting atmosphere. The pizza smelled so good the moment you enter the restaurant.   The food is top notch for a small location in Kensington market. Really good pizza and drinks.    Cannot wait to come back soon!"}
{"text":"Amezing pizza , all the food here is original , authentic and delicious , big up to the owner Romolo Salvati and all the staff of VM always ready to accomodate any request."}
{"text":"Decided to try them for winterlicious. DO NOT ORDER OFF THEIR WINTERLICIOUS MENU. The pizza was the only edible item at the restaurant (which is not part of the menu ) Appetizers like stated in many other reviews seem to be a low quality pre-made frozen type. We had a risotto ball that was completely dry. The two pasta dishes were completely under cooked. First time I ordered a spaghetti carbonata and it was like eating soup. The desert was several days old. You could barely cut into it, did not even touch it. Waitress was polite but did nothing only offered a cup of coffee on the house. Check came out to $140 for 3 people with their cheapest bottle of wine. The pizza was the only thing that was cooked fresh to order. Decent pizza I would give it 7 out of 10.  I Only am giving this restaurant 2 stars because of the pizza."}
{"text":"Unfortunately, our experience at Via Mercanti was not good. after ordering our food, they brought out a bread basket - I found a piece of bread that was bitten into, not only that there was also a piece of hair in it!! we left immediately and will not go to a place that recycles their food."}
{"text":"Looks like a cheesy family place but the food is delicious!  All the cooks are actually from Italy and the food tastes like it.  The Fagottino di Parma was the most delicious pasta I have had in a long time.  It says \"wrapped in proscuitto\" but it's actually freshly cut proscuitto laid on top - amazing.  Been craving this dish every since.  Pizza was amazing too."}
{"text":"Went to Via Mercanti on a Saturday evening.... The place was busy and almost full....The Marinara pizza was okay. The Linguine Allo Scoglio was good but the portion was disappointingly small for the price. Good Creme brulee and Strawberry sorbet. Good service and this place as its own charm...."}
{"text":"Beautiful day in Kensi Village and always wanted to try this place.  I had the arancini balls that came with arugula and un sauced.  I'm use to having marinara sauce with the arancini balls, but these were so good they didn't need it.  I had the Margherita pizza which I devoured. Cheese, crust and sauce was all on point.  Will be back definitely!"}
{"text":"Just had some of your undercooked margarita pizza from uber eats Gross!!!  There's no way you are the same as the Augusta location. Sauce, crust and quality are not the same  Yuck raw dough and barley melted cheese"}
{"text":"Delivered via foodarama, yummy as usual. Def beats ordering pizza pizza. Will order in again."}
{"text":"By far the best pizza in the city. Better than Libretto and Queen Margherita - in my opinion. If you are a fan of Neapolitan pizza, this is your joint! And yes, I've had authentic neapolitan pizza in Naples. Fresh ingredients, great service, casual atmosphere, family friendly, wood burning oven. The pizza dough has that perfect stretch/elasticity that neapolitan pizza should have. MUST ORDER: Margherita Pizza. I always order a margherita pizza at pizza restaurants in order to make a proper assessment :) The way I see it - if you can't nail a classic margherita pizza, you've got some work to do."}
{"text":"Gotta give the full stars to Pizzeria Via Mercanti. I planned a lunch for my family and needed a place that can hold 9 people comfortably. PVM delivered with amazing food and service. Today was hot... I mean HAWT! Patios and a picnic in the park would've been so uncomfortable. PVM had a great space and it's air conditioned, water was ready for everyone. We shared family style: - fried shrimp and calamari - fried pizza - arancini - mozzarella and tomato salad - margherita pizza - vegetarian pizza - neopolitana pizza Good and condiments (EVOO, balsamic and spicy pepper infused olive oil) were Amazing! Both adults and kids were happy and full. The servers were very patient and accommodating. I had to change the reservation for another hour because some people were late. Service was all smiles and quick.   Highly recommend Pizzeria Via Mercanti. Delicious food, Amazing service... Takes me back to Rome.  Side notes: - they missed preparing an order of seafood risotto but we were so full and cancelled it anyway - our server pointed out that gratuity has been included in our bill Since we were a table of 9... Really appreciate that!"}
{"text":"Excellent pizza. The pizza dough itself is soft and pillow and reminds me of naan in taste and consistency. The atmosphere is a bit like a cafeteria, as another reviewer said, but it is laid back and comfortable.  The potato crocche starter was crispy and delicious.  The Crudo e Rucola pizza was tasty and had sufficient argula, and the Ravello pizza was excellent."}
{"text":"Every time I come here whether it is a weekend or weekday, it is always busy.  The smell from the pizza baking is intoxicating. The pizza here is authentic and it is prepared quickly as how it should be. Never had a major problem here and will be coming back soon."}
{"text":"If you're around the neighbourhood I'd highly recommend trying the mussels and 6ix pizza! The people here are real Italians who cook exquisite food. Both the pizza and pasta are inventive, smart and beautiful to look at.  Everything here is worth the price and it's even better when you're with friends!"}
{"text":"If you want real authentic Italian pizza this is the spot.  Atmosphere is amazing, really nice pizza oven. Best pizza in toronto"}
{"text":"reallly impressed after happening on this spot when few other options were available on a friday night at kensington. it was bustling and much larger than expected but you couldn't tell at all from outside.   service was ultra quick, serving up our two pies. the crust was insanely thin (too thin to hold itself up against any toppings but sooo chewy good.  lots of offerings and they make all their pasta in house, every week.they'll also have the game on but instead of feeling like a sports bar, it's got a nice homey feel."}
{"text":"One of the best pizzas i have ever had in my life. Highly recommended. Authentic Italian pizza."}
{"text":"Brilliant restaurant. Best Italian food I have ever had. Thoroughly recommend you try this place for choice, quality and price"}
{"text":"Two words: RAW CHICKEN.  Seriously, this is the only restaurant -- anywhere -- in which I have ever been served chicken that was absolutely raw inside.  Not mildly pink, but RAW.  The waiter was quick to take it back to the kitchen and replace it with a pizza, which at least I could see being cooked.  Regardless, you can be sure that I will not be back.  Someone should tell Gordon Ramsay that his work is not finished..."}
{"text":"Three words: stuffed crust pizza. OH and the pizza balls.  That is the best pizza I've had here so far.  The one and ONLY complaint I have is that the second time I came here the manager was our server, and he was extremely rude upon giving us the bill, which we didn't even request. I made a mistake while paying on the machine and he practically made me feel like a complete idiot and told us to \"stop talking and focus on paying\", even though I was not talking while paying ....  That definitely soured my experience here. If you just want good pizza, check it out. Otherwise I'm probably going to go to Margherita next."}
{"text":"You want to go for a swanky pizza date in Kenstington Market? Fine, I'll go with you.  This place has amazing pizza, the staff actually speaks Italian, and the ambiance is classy, all achieved literally feet from weed dealers hocking product. That's the beauty of Kensington Market, and if that upsets you, go pay more at some other snooty place that caters to your snooty face :)"}
{"text":"We went for a quick lunch at Via Mercanti. It has beckoned me since it opened with the large pizza oven and warm wood interior. It has that inviting look that average pizza joints don't have. We both ordered the lunch special (available until 3pm) which was a small Margherita pizza and a salad and a drink. The pizza was delicious, with a tender thin crust and flavourful sauce, although I did mop up some of their chill infused oil which I couldn't get enough of. The arugula salad was beautiful. It came with fresh parmesan shavings and cherry tomatoes dressed and absolutely delicious. The small table we had by the window was perfect for watching the streetscape. The restaurant is a welcome addition to the zaniness of the market providing a pleasant space to sit and enjoy your meal. Drinks offered are limited to beer and wine and are a little on the pricy side  The best part about having lunch at a great place like this is that lingering warm feeling your get from good food after you leave the restaurant. Just writing this brings a little of that back!"}
{"text":"- tomato sauce is everything. and theirs is darn tasty. - libretto is still top dog, but having another option in the dt core is beautiful. - if you go and don't try the their speciality - the Via \"Mercanti\" (kind of a thin double stuffed pizza). an interesting take if you dont want to have your standard thin crust pizza. - service is a little sketch as they were severely understaffed the night i went."}
{"text":"A great place to eat authentic Italian food . Have been trying it out to see if it s always so excellent, it is! I can whole heartedly recommend this little gem of a place,right in the midst of the busy market. Good beer & draft ,nice and cold. A really fine Pinot ,reasonably price. The pizzas are original & inspired and taste great! Really friendly servers ,professional & are well versed with the menu. Watch the game or enjoy a nice place to have a conversation,a cheerful & bright atmosphere. Service is geared to how quickly or relaxing you want. The soup of the day is always a winner! Salads are huge and beautifully plated, and so fresh. Try this place,you will not be disappointed !"}
{"text":"With a  rustic inspired setting and Contemporary Sicilian music to set the mood , I was undoubtedly taken off the streets of Kensington market to a brick oven, pizza tossing sanctuary. The menu, although seemingly heavy and pricey turned out to be delightfully light and jammed packed full of flavours. My meal was  a fantastic combination of heat and savour.  The staff performed like ghosts...always near but never invasive."}
{"text":"Best pizza I have ever had in Toronto. Better than Pizzeria libretto by far. A whole bunch of red and white pizzas. Fun atmosphere and very friendly staff."}
{"text":"Pizza was good, but not at the Queen Marg or Mangia & Bevi level. Tomato sauce was agreed by 4 of us not as good as either of those places. Crust is good, but not better. Decor could use some work. Tables and chairs don't go with the minimalist-modern cafeteria style design. Lots of families with little kids on a Sunday dinner time (if that might bother you). Double espresso for $2.50 is a nice deal. Service was inconsistent, very attentive at beginning, then they left us waiting to pay the bill for 10-15mins at the end. Weird. I'm hoping they can improve, as the area needs more good places."}
{"text":"This place is fantastic! My girlfriend and I dropped by here to pick up a pizza. The guy who greeted us was super friendly, and talked with us while we waited for our pizza. He had a great story - came to Toronto from Italy five years ago - and really made us feel welcomed in the city.  The pizza itself was awesome! We didn't have to wait long for it (10 min). It had a great thin crust. All of the toppings were high quality. I grew up in Chicago, so I know my pizza - this is up there with some of the best I've ever had.  Would definitely return. Great food, and nice staff. All the employees - including the chefs - waved to us and thanked us as we left!"}
{"text":"Freshly made wood oven pizza, very authentic Italian restaurant.  Friendly service, plenty of bread, love the spicy oil.  Definitely go back and try the different options!"}
{"text":"The waitress recommended the quattro fromagio pizza ($19) which doesn't come with any tomato sauce, it came out super fast. The dough was very light, had a char in all the right places and the cheese was so melty. The pizza was surprisingly thin. It was a refreshing authentic Italian pizza, some may not be able to appreciate its simplicity. I wasn't too hungry and I was able to eat about 3/4, I saw many people ordering 1 pizza per person.   Service was okay, we were in and out pretty quick. I've been wanting to try here out for a while since its supposed to be one of the best pizza's in TO. It was definitely a good pizza, for flavour + price I prefer the funghi misti pizza from Tosto's... comes with truffle oil"}
{"text":"Great restaurant! Great service and great pizzas! Consistently good service and excellent food. Great Beers on tap. Friendly staff and decent prices. Will continue to go back!!"}
{"text":"Atmosphere: stark, with bright lights, no candles, TVs in background, 80's music. Would a  few candles and a dimmer switch really be that hard? Do not take your date, especially your first.  Service: friendly, unpretentious.   Food: only had the Margherita pizza. Soggy, and not with the crisp crust as I'd expected. No wood flavour.  A few basil leaves.  Certainly passable, but not an outstanding pizza that I'd return for.   Summary: pleasant service for an occasional quick bite"}
{"text":"Their pizza is soooo good. Great selection. Crust is perfectly cooked; thin, golden, bubbly and just a little chewy. The amount of toppings is the perfect amount that the crust can handle. So flavourful!  Service was good too! Wouldn't mind going back for some more!"}
{"text":"This was my first visit. Just had some pizzas with friends. The caprese salad was delicious and all the ingredients were fresh and flavorful. The pizzas were fantastic and our server was very pleasant. Will definitely be going back."}
{"text":"Do you like non-existent service?  Then this place is for you!  Walked in and took a minute or two to be noticed.  Sat ourselves, though.  Lots of 'reserved' signs on tables.  About seven minutes passed (in restaurant time, that's a lot) before a server came by.  At that point, he took our orders but there was no guidance - just, like, listened to what we were having and that was it.  No, \"Would you like anything to drink?\" or anything.  Food came out within five or so minutes. We never saw our server again.  We didn't get any of accoutrements we saw around - no chill flakes, no olive oil, no salt or pepper.  Just the pizzas down, the server gone.    I liked the pizza alright. It was overpriced considering the laid-back atmosphere and lack of service.  The topping were not that exciting, but the crust was good.  Could have been hotter.  Should have been hotter.  Had to find a server for the bill.  I wouldn't go back."}
{"text":"This is the best pizza I've ever had, and I've tried many in this style. I got the margherita so that I could focus on tasting the quality of the basic ingredients. The crust is soft but still has texture to it, the tomato sauce is tangy and fresh, and the mozzarella pillowy and flavorful. Every part of the pizza tasted like heaven. You can watch the authentic Italian chefs cook it so you know it's the real deal. Perfect portion size too. Altogether an amazing experience, the waitress was incredibly friendly, attentive, and quick! Definitely come here if you're in Toronto."}
{"text":"So. They have two other locations in Toronto, and both are wonderful. This is a great addition to the east end! We already have QMP and Libretto, but Via Mercanti brings a more well-rounded Italian experience to the hood. Lots of appetizers, pastas AND pizzas, a good wine list, and wonderful, genuinely enthusiastic service. Authentic Italian? Yes! We had a great meal here, finished with ice cold Limoncello, the way it should be :) We will return!"}
{"text":"As the Neapolitan pizza trend blazes out of control, this place stands out for its amazing waiter whose name I cannot recall due to my consumption of five rum and cokes, but he served us on the lower level to a ménage of drum and bass, country and some hip pop while being generally stoked about delivering a fucking awesome dining experience which he most certainly did, only accentuated by his entry-level Mohawk and sterling silver skull jewelry."}
{"text":"I've been here a couple times and the first time was really great. It's definitely one of the best pizza places in Toronto. We ordered the Margherita and Bambino. The sizes are pretty large, although the two of us did finish both of them. I have to say the bread gets a little salty as it cools but still really good. Our bill was around $35 for the two pizzas. I think its a nice place for a lunch date. Its a big place, they use a nice special oven and I usually don't like crust on the pizza but ended up eating it all."}
{"text":"Hands down the best pizza outside of Naples!  I am here weekly, if not monthly basis.  Though I tend to eat the same delicious pizza (ciambella), I have had my fair share of pizzas on the menu and PVM never disappoints!    It's a great place to have a bite after a long week, invite friends for a casual dinner, or bring family together.  The wait staff is very friendly and accommodating to all your needs.  I am happy to have this little gem in the city and it is  a treasure :-).  A must for any true pizza lover!!"}
{"text":"So incredibly good! From the food, to the ambiance to the fast seating, I'm so in love with Via Mercanti. My last 'fancy' pizza visit was to Terroni, and that turned me off what I perceived to be snooty, trendy pizza places.   Via Mercanti is so not that. The service was friendly and efficient. The queue was short and moved very quickly. The ambiance was  warm and welcoming. The space didn't feel so crowded that you felt that you were rubbing elbows with your neighbour (I'm looking at you, Terroni).  And the food! I already have my menu items earmarked for my next visit.   For my first visit I had the  Bocconcini di Pizza (pizza balls), the signature 2 layered pizza & the linguine al pomodoro (linguine with sauce). The pizza balls were these delicious morsels of salty goodness. The signature pizza was incredible all around. The texture of the homemade linguine is so unlike any pasta I've ever had.   And... save room for the tiramisu. You need to have it! I basically snatched the shared dessert from my husband a split second before he said I could have the rest of it. Next time I'm getting one just for me."}
{"text":"I would like to start with the things I liked: the service was good, the mineral water was good, and the pizza crust was good. In terms of what I didn't like was The pizza itself was very watery and bled everywhere, the mozzarella was cheap, it was very stringy which is a generally not a good sign. The flavour was okay but overall for the high price I wouldn't think it is worth it."}
{"text":"We're back on the HUNT for Toronto's BEST! Stop #8, and the LAST stop: Pizzeria Via Mercanti  To wrap up the pie tour we weaved our way through Kensington Market to this bustling pizza restaurant. It's a sizeable enough restaurant with a ground level and basement floor, though since they make ample use of the space, things can get a little cramped. You'll be comfortable once you take your seat, but getting there may be a minor effort.  Things started up with a complementary appetizer of fresh bread and caprese salad (with arugula instead of basil). This was a nice surprise, but I've got to be a little ungrateful and say that the mozzarella was sort of reminiscent to tofu, in that it lacked flavour. Things may have improved with some added salt, but for some reason the tables aren't readied with salt & pepper shakers.   For the main we skipped their Via Mercanti pizza since neither of us was prepared for two layers of pizza and the ensuing coma. Instead we opted for two red pizzas; the Capricciosa and the Calzone. The Capricciosa is a pie that is not shy on flavour. It has fior di latte, prosciutto cotto (i.e. dry-cured ham), mushrooms, and black olives. I've been a proud member of team bold flavour for a long time, but I think things went too far on this pizza, specifically with regard to the amount of black olives. The rendering down of the olives during the baking process allowed its flavour to spread throughout the pie, which would normally have been great, but went a notch too far for my liking. On the other hand the Calzone kept things much more simple, and served up a spicy, yet comforting pie. On this pie you'll get bufala ricotta, cheese, and hot soppressata (i.e. dry salami). The soppressata quickly lets you know why it needs no other partnering ingredients on the pie. This was definitely the better of the two pies.  With this being the last review for the Pizza Hunt, let's see which pie reigns supreme. 1) Maker Pizza 2) Levetto 3) Pizzeria Libretto 4) Cucina Locale 5) Pizzeria Via Mercanti 6) Terroni 7) Blaze Fast-Fire'd Pizza 8) Bitondo's Pizzeria Assigning the top rankings wasn't much of a challenge. Libretto serves up some really innovative pies that will definitely have me coming back eventually, while Levetto creates some genuinely mouth watering experiences. In the end though, Maker Pizza finishes strong with a pizza experience so unique yet still delicious that it brings a smile to my face just remembering it."}
{"text":"My husband and I love coming here. Their pizzas and pastas are both great and we love getting their pizza bites. They have a good variety of pizzas. My only criticism would be that because of how thin their pizzas are, they get soggy pretty quickly, but the crust is delicious!"}
{"text":"I was on a 2 day course in the same building. My one and only experience at their Kensington Market location was not a good first impression but I did enjoy their pricey food. So I figured I would give their new location a try.   Day 1: I had their $10 lunch special. They have a few choices and I went with the veal \"something Italian named\" salad. My colleague got the margarita pizza and salad. She had a nicely sized portion and ate it all!! I had something I was not expecting; a small salad with some veal cooked and chopped up on top of my salad.   Day 2: my colleague didn't want to go again. I had the meatball sandwich with a salad off the menu for $15. It was a very generous portion. I ate half of it and got the other half to go.   If you are on a one hour lunch from work and need walking time, this may not work out. I was in the same building and managed to be seated, served my beverages, order taken, food eaten and back upstairs at the one hour mark.   Good food, depending on what you order the portions vary and the same pricey prices from their flagship restaurant. Nice spacious space."}
{"text":"We found this place by accident while wondering around the area. It was the best accident we ever made. I love pizza and I'm very funny about it. Let me start by saying, this is a real pizza!!! The sauce was incredible, it had just the right amount of sweetness, where you could eat it plain. Real mozzarella cheese slices, not too much, just enough to mix well with the flavor of the pizza. The crust was also delicious and the texture and flavor was just right. The reason for the 4 star was because our waiter was at our table removing dishes and items eat too fast, we felt rushed to get out of there. Do yourself a favor and stop in for a pizza!"}
{"text":"Finally, good pizza in Toronto!!    After tasting real Neapolitan pizza in Italy, I've been searching desperately for something like it in Toronto. The much-lauded Pizzeria Libretto on the Danforth rendered extreme disappointment while Queen Margherita Pizza left me indifferent.   So I decided to no longer waste my calories on pizza in this city - that is until I read about Via Mercanti in Kensington Market.  While skeptical (as I've found myself often at odds with Toronto Yelpers' opinions) I decided to check out this place with an open mind tonight.   ---- Items ordered:    1. Margherita Pizza ($10):  While I would have wanted the crust to be slightly crispier, I was generally pleased with the thin, billowy, slightly-chewy texture. Oh, and the cheese, tomato sauce and basil were just lovely!  2. Pork Sandwich ($15):  WOW!! OMG!!!!!  This was the clear winner for me. Okay, I didn't like that there were chunks of fat in a couple of the slices of pork (which I plucked out) but the meat was so succulent and nicely seasoned, that I was willing to forgive that. Plus, I realize in many parts of the world, eating lumps of jiggly fat isn't seen as a gross, yucky thing.    The sandwich came in some type of pocket bread (I think??) that was thin and crispy. Perhaps it was made from the pizza dough?? In any case, it was very good. I also liked the rosemary and olive oil that garnished the sandwich. Oh, and the accompanying salad was simple but tasty. Too often in North American restaurants, you get salads drowned in too much sour and oily vinaigrette - argh!!  But this was lightly dressed. In fact, the vinaigrette simply enhanced the fresh, crispy lettuce and plump, juicy, flavorful tomatoes!  (Tomatoes with actual flavor, what a novelty!)  3. Margherita Pizza + sausage ($12.50):  See review of #1 but add to it some tasty bits of sausage. I just wished it had more!   ------  Service:   A bit strange. Hard to describe. Will leave it at that.   Menu:   In a city where most people don't speak Italian, it would make more sense to list the ingredients in English. Sorry if this makes me sound like a big hick from the sticks, but I'm just speaking from a practical standpoint. We had to ask the waiter what this and that was...but it would have saved everyone a lot of time if items were just listed in English, thus eliminating the need for a consultation. Don't you think?   But because I absolutely LOVED the food tonight, I'll definitely come back and try their other items like pasta, risotto and white pizzas.   I'm salivating and getting hungry again just writing about this!  Oh, I can't wait for my next meal there..."}
{"text":"This was such a nice place on Kensington! I'm a sucker for Italian food and it definitely lived up to my expectations. The food was delish! They really aren't lying when they say they have the best pizza in Toronto. Their margherita pizza was amazingg. So yummy and juicy. Also had the pasta, not bad. I got this appetizer, I forget the name but it had mashed potatoes and cheese inside and it was a ball of some sort but sooo good. It's only $4, wish I got more!   The place was also really nice, it has a bar and TV, and our server was quite good as well."}
{"text":"Recommendation- the via Mercanti pizza! This pizza is a double layer pizza with prosciutto, ricotta cheese, and mushrooms. The double layer was thin, and absolutely genius!"}
{"text":"My family and I have been coming here for years. We have celebrated many birthdays with Via Mercanti and even booked their private room in the basement for a function. I frequently go with my grandmother who is over 80 and her sister who is 90. They have issues hearing and can be abrasive at times (who isn't) but I was appalled by how they were treated by the Via Mercanti staff at our last visit.  Their policy states that parties of 6 or more can be subject to an autogratuity of 18%. We were a party of 5 and an autogratuity was added to our bill, without any indication from the serving staff. My grandmother paid and tipped her usual 15% (shes 80 and vows to tip no more than 15%) on top of the charged 18%. Bills were collected and not a word from the serving staff that she double tipped. Before we left, she noticed that she tipped twice (a total of 33%) and mentioned it to the server who refunded the first transaction upon her request.   This behaviour is sick. Its abusive towards older people. The policy clearly states on the menus that parties of 6 or more may be subject to an autograt. We were 5. This appalling behaviour indicates that there is a clause in the policy stating: if you are elderly and easy to take advantage of, we will seize the opportunity. It greatly saddens me to think of the other times she may have been taken advantage of by Via Mercanti staff without noticing. Please don't do this again."}
{"text":"Amazing friendly place.  Pizza is amazing and super cozy place to hang out on a day off during the week.  Hang there for a bit and then venture out for another adventure in Kensington market.  Love this place."}
{"text":"Pizza is ok but a little on the soggy side...it's a nice, open family restaurant....I'll have to try the pasta sometime....service is very friendly!"}
{"text":"Pretty good pizza but the crust could be better which would make it excellent!...service is attentive and friendly, even late at night when everyone's tired..."}
{"text":"Someone suggested Via Mercanti (Kensington location) but we happened to be closer to this one so we decided to try it out. We were here on a quiet Sunday afternoon and it was very nice to have the patio all to ourselves (this was in the summer). We started off with the pizza balls. They were pretty tasty and even better when I requested some marinara to dip them in! I had the fagottino di parma, a pasta with cream sauce wrapped in prosciutto. Very delicious but it was not something I could eat too much of - very rich, creamy and salty. The service was decent, not terrible but could've been better. Next time will try the Kensington location."}
{"text":"Food: 2.5/5 Service:2.5/5 Ambiance: 3/5  I was stoked when this new pizza joint opened and was dying to try the food here. I've enjoyed some of the best dishes in many parts of the Italy.  Italian owner from Amalfi cost + Authentic pizza = uber high expectations.  Went for lunch on Thursday. Didn't make a reservation. Showed up at 11:45 a.m. and no one was at the restaurant- best time to go if you do not have reservation.  I entered thru the Elm street entrance (there are 2 entrances). There's no sign from outside. You walk in to the YMCA building and the entrance is to your right. Note: You won't be greeted if you enter through Elm Street entrance.  I got to pick where I wanted to sit when I walked in.     Service: Server was very pushy- we needed more time to look at the menu but she kept coming back every 3 min.   Food: We ordered linguine all scoglio (seafood linguine), quattro stagioni and napoletana pizza to share.  Quattro stagioni: Who divides 4 toppings into 4 sections? I've never ever seen that anywhere. It was ridiculous and wasn't an enjoyable experience to share that pizza.   Napoletana: Uber salty and unappetizing. All the toppings were on one side of the pizza.   Linguine all scoglio: they skimped on seafood- tiny pieces of chopped calamari was sprinkled on top with couple of clams and mussels. Price tag $20.50.   All dishes were very very salty....all of us kept drinking water all day after lunch. If you are watching your sodium intake, this place ain't for you.    Ambiance: not very inviting.   I was quite disappointed with the food and service. I'd rather spend that $60 somewhere else."}
{"text":"Third stop of TO food crawl. Slight fatigue setting in. We ordered a cheese za, keeping it simple.  It's great! Extremely thin, naan-like pizza dough. Amazing fresh. Eat quickly, when it's fresh out the oven. Solid sauce and flavour."}
{"text":"Great pizza and convenient location for us since we were at sick kids. Same great quality as the Kensington location. No frills just great Neapolitan style pizza! Recommend..."}
{"text":"I visited Pizzeria Via Mercanti (thanks to an episode of You Gotta Eat Here!) on a Thursday night and shared the Mozzarelline Fritte, Potato Chrocche, Ciambella Ripiena pizza, Pollo pizza, and tiramisu. The staff were super nice and they were very accommodating of my dietary restrictions. They allowed me to leave the sopressata out of the Ciambella pizza and replaced it with veggies (mushrooms, zucchini, and tomato), and let us do half chicken on the Pollo pizza. Everything was SO good, I have been dreaming about going back ever since. We can't wait to try the pasta! :)"}
{"text":"Went for an early dinner today at 4:30pm with 4 friends. Two of the friends that came with us have been here before and raved how good it was so we decided to try it. Service was slow, our waiter took our appetizer and dinner order but no drink order. Our dinner came before our appetizer. I ordered a chicken Marsala which the chicken was rubbery in my first bite so I returned it and ordered a pizza which was very watery. Would not go back and don't recommend it...there are better places in the area."}
{"text":"Whoaaaaaa.   Stopped in here after an event in Kensington with my friend as we were needing something to eat before our drive home. We stumbled upon Via and thought, what the heck, we're into pizza right now.  We were greeted right away, the place had maybe two tables of peeps. We sat at the pizza bar cause it looked cool. The atmosphere was warm and cozy and we felt right at home.   Our server brought us menus, got our drink orders and promptly brought back two nice glasses of red.  We ordered the Margarhita pizza and the Margarino (sp?) pizza's. We saw the guy making them at the pizza bar and so we knew exactly what we were getting.  Pizza came promptly, and OMG. I am drooling just thinking about it. Both 'za's were hot, juicy and really nice and thin. The crust was incredible and they brought us this AMAZING chili oil to drizzle on top. It was perfect. It was beautiful. It was everything I've ever wanted in a pizza.  I haven't had a margharita pizza like that in YEARS and it is definitely the real deal.  I will absolutely be back, and very, very soon. I haven't been to Queen Margherita Pizza either and I'm not needing to go any longer. I don't care how good it is. This place is close, amazing and quite simply omnomerrific!"}
{"text":"The best pizza I had in Toronto! The crust is amazing and its authentic! The atmosphere and service was good also. Recommend it to anyone!!"}
{"text":"Large, friendly, loud restaurant...  Reservations accepted,  so if you have a large party on a weekend night, I'd strongly suggest calling in.  Pizza dough was nice but the sauce was weak.  Seafood linguini was fresh.  Not sure what the fried stuff was (wide and kid ordered it) but was so-so, so I ended up eating it vs them.  Lasagna was okay...better than most but had better ..been looking for a good lasagna to be my all time favorite...close. .  Would come back to try the other pizzas."}
{"text":"Best pizza I've ever had in Toronto. The dough is light and chewy. I didn't know what to order so the server made suggestions which were incredible and it was ready in under 10 minutes! Scarpariello is my fave so far"}
{"text":"Best pizza I've ever had in Toronto (Gerrard location). The dough is light and chewy. I didn't know what to order so the server made suggestions which were incredible and it was ready in under 10 minutes!"}
{"text":"Quality food and a really good size for the price. Paid around $18 for a really decent sized pizza with good ingredients. Cute interior, good service."}
{"text":"Went on a Sunday afternoon when it wasn't busy and had a nice table by the window.  We ordered Margerite (spelling sorry).  My son didn't think it had enough cheese, was very saucy and less cheese than I would expect.  I ordered the fresh pasta of the day with mussels and clams.  It was good though I wasn't told it would be spicy and would had appreciated knowing that.  Hubby had funghi pizza.  Very tasty and I liked the spices added to the pizza.  I ate the crusts just to taste the dough and it is very good tasting.  I haven't been to other places yet to compare but it wasn't as crispy as a crust as I was expecting.  It was more soft.  Overall not bad but nothing I'd go crazy about and returning for.  But it was a nice place to sit and have a meal."}
{"text":"Worst service I've ever had at a restaurant. Ever. Everything's overpriced, and our entire group of 10 said they'd never go back. It's a shame too, they've got a nice patio and an awesome location."}
{"text":"Ordered Margarita from them today. The pizza came cold (doordash's fault), but even cold it was one of the best pizzas I've ever had!"}
{"text":"The great place to taste Italian pizza...the menu has a lot of choices for pizza which I love about it...the bread is home made and the sausage tastes so good... The prices are also good !"}
{"text":"Best pizza I've had in Toronto - rivaled only by Libretto and Mange e Beve. Price is reasonable. The Kensington vibe is great. Service is inconsistent - sometimes good sometimes meh."}
{"text":"This place is over-priced and my waiter was a jerk so I knew the food would be good. We went here at my friend's urging before hitting the bars because she said the pizza was amazing. I let her order one and we shared. I was horrified when she ordered. The pizza arrived covered in olives and anchovies. Two things I think I hate. I decided to throw caution to the wind and just eat the damn pizza. It was soooo good. The sauce tasted very fresh, the crust has a nice crisp and a little char. The amount of olives and anchovies was exactly right to give a good burst of salt without being over-powering. I will go back again and maybe try some toppings that I don't think are gross. My only real complaint about the food is more about fancy pizza in general. What's up with the minimalist approach to cheese? One can never have enough cheese. Cover that stuff up Pizza Pizza-style. Mmmm."}
{"text":"This place can be hard to miss because there isnt any real clear signage but worth the effort. It is located in one of these old exposed brick building that just adds to the charm of the place.   The place is decorated cleanly and minimalistic which matches the exterior of the building.  Our server (I suspect was the owner) was was efficient and courteous.   We ordered the margheritona and via mercanti pizzas and the small antipasto plate. Pizzas was freshly made and cooked until the crust was just crispy enough.  Margheritona had delicious prosciutto shaved on top and covered with fresh grated delicious pandano. The via mercanti was a pizza within a pizza (aka the inception pizza) with the top layer being a margherita pizza combined with delicious mushrooms, ricotta cheese, soppresetta, and prosciutto.   The small antipasto plate was a big serving and was pleasantly surprized by the portion size.  Great combination of olives, variety of cheeses, and more prosciutto! (See a theme here?)  After the meal, we were told that the chef in the kitchen does award winning fresh pasta so this place will warrant another visit in the future."}
{"text":"One of my favourite restaurants of all time. Their pizza is absolutely delicious. The only flaw of this place is the desserts. They are mediocre at best. Your best bet is to eat dinner here and find dessert elsewhere. Make sure to try their Calamari as well. Great atmosphere, great food."}
{"text":"Wir sind spontan hier vorbei gekommen. Das Personal ist sehr freundlich, das Essen sehr lecker und frisch. Hier kommt man gerne mal wieder hin."}
{"text":"Amazing pizza outside of Italy. As good as a couple of places on NYC. We finally got a table - the last couple of times we've come here the line has been outside the door!"}
{"text":"My husband and I used to love going here, but I think the chef must have changed recently. The last time we went, our pizzas were undercooked and had way too much cheese, so they were too soggy to eat with our hands. My seafood pasta was tasty enough but I remember everything being delicious before.We will give the restaurant one more chance but we were very disappointed."}
{"text":"Expensive and just nottttt good. The pastas are terrible. I haven't tried the pizza but the pastas need to be tasted before serving. They are just awful"}
{"text":"People need to do their research on pizza if they don't find this place awesome.  This place specializes in a type of pizza from Northern Italy.  It's a frickin delicious pizza that you get when you come here.  Try the two layer pizza and don't be one of those lame people who don't eat the crust to save carbs.  The crust is one of the best parts about the pizza!  Amazing place and my favourite pizza in town!"}
{"text":"Awesome place to grab a slice, and I loved the oven burning pizza. Such a great place. Service is fantastic."}
{"text":"Absolutely loved my meal! I had a fungi pizza and my table shared a salad. Everything was delicious and the whole experience took me back to my trip to Rome. Everyone was very friendly and welcoming. I will definitely be back!"}
{"text":"This is a properly reviewed establishment. 3.5 stars is right for this place. I gave 4 because its better than a 3-star but not quite an actual 4-star place. It's tucked between the hospital and the YMCA and that's not their fault, but you ask yourself 'what is this place?' as you sit on the patio looking at the back of the hospital. Nice patio though. Pizza is ok. Nothing wrong with it but it's not fantastic. I had their signature 'za and I feel like it should have been better. Crust needs salt. And shouldn't be soggy in the middle since this is your signature pie."}
{"text":"The best pizza you will find in Toronto. I was reluctant to come here, due to its location, but the scenery of a dirty street fades away immediately as you walk in and you see the Italian like ambiance, accompanied by the always fitting Italian music.   Now on to food. The service was VERY fast, unexpectedly I'd say, and the pizza has not only the look of original pizza,but also the smell and taste. You can tell by the consistency and quality, that it is down with the best of ingredients. Strongly recommend their home red wine as well. TIP: do not order the diavolo pizza unless you're REALLY ok with eating spicy food.   Pricing: pizza doesn't go above 20$. With drinks, it is 60$ for 2 people, everything included. I'd say it's affordable"}
{"text":"I am definitely a fan of this spot. I've gone about 5 or 6 times, and have only been slightly disappointed once... when they had run out of their DELICIOUS signature bread. The meal was still very good (the food has yet to disappoint), but the bread and pizza crust are what make this place stand out for me... and bring me back again & again.  The pasta is fresh and yummy, the pizza is what they're known for (rightfully so), the servings are generous, but the service is only pretty good, and borders on just OK from time to time. The coffee is very good, but don't order the tea. They bring you a mug of hot-ish water, with the tea bag on the side (blasphemy for a tea drinker)."}
{"text":"I was going to give a 4 star but really they deserve a 5 because I came during a black out and they were still able to serve us letting us know they can only make pizza, and guiding us to a window to not sit in the dark and good thing pizza is what we came for because Their pizza is so delicious !!"}
{"text":"Really good and fresh tasting pizza. The dough is soft but chewy enough. The ingredients actually stand out in their own without blending into the sauce. The place is really busy and I went there on a Thursday night. Pizza is better than a lot of the Italian restaurants in the downtown area.  Definitely worth the visit and there are many other items on the menu too."}
{"text":"Some servers are very slow and rude.. Very Very uneducated..Seriously.. But my dishes were not bad. Except 20$ chicken steak? My friend got that one, and there was only one slim chicken(idk what part of chicken tho) n 3 kinda veges.. what the..?"}
{"text":"I love eating pizza. I spent 6 months in Manhattan just eating pizza. My friend wanted to try this place out. I have never not finished a pizza. This was the worst pizza I have ever eaten. It was so bad I could only eat four bites. My friends pizza was so saucy his plate looked like a soup. My pizza wasn't even cut in slices. They had to take it back to the kitchen 2 times to try to cut it. I am seating in the back of an uber after this experience with stomach pain and fear of shitting my pants. Let's all pray I make it home without deficating in my pants."}
{"text":"The food was decent, but the experience wasn't.  I went in around 4pm, looking for an early dinner. When the waitress seated me, she asked if I was waiting for anyone, and I said no - just me. I got a menu and a glass of water and then sat for what felt like a long time as a swarm of waiters ignored me while taking other table's orders. I had my menu closed, giving every indication of being ready to order, but got nothing until I finally managed to catch the eye of the woman who'd seated me, and she sent over a waitress.  The waitress said, in a way that sounded  incredulous, aren't you waiting for someone? When I said no, she took my order, and things arrived fairly promptly after that.  I had a pint and a margherita pizza, which was pretty much fine except the basil was scant - four leaves of fresh basil. Those bites were delicious, but it wasn't really a proper margherita in my opinion. The dough was quite salty, but I liked that.   I finished my last bite, put my fork on the plate, and 30 seconds later my bill arrived. No question if I'd like anything else; they just seemed to want to rush me out of there. It wasn't so busy that they needed my table - there were plenty of deuces open - and it felt weird and rude I tipped 15%, rather than my usual, because the beginning and end of my meal was so weird and uncomfortable.  The waitress who seated me rushed by and said something I didn't quite catch about being sorry for my wait - that was nice of her.  I don't know if I just caught them at a bad time, but the food wasn't good enough to overcome the service issues."}
{"text":"So this pizza place topped Now Magazine''s Toronto top pizza place: http://www.nowtoronto.com/food/story.cfm?content=190800  I like the way this place looked. For those who come here, it's north of Denison Sq (the little park in Kensington). The numbering does not match up with those across the street so it fooled me a bit. The exterior looked inviting with bright lights inside that make it appear welcoming. The inside was warm and didn't feel chic which is totally what I think Kensington should be.  The pizza, we ordered four: Margherita - Didn't feel like there was much basil and it was a bit outshined by other pizzas Funghi - My favorite, might be because I like mushrooms but the taste off the mushrooms shined brightly Pizza Bambino - pepperoni and french fries. The french fries were very sparse, not too many which I think is a good thing Via Mercanti - house specialty of a Margherita pizza and another pizza with sausage and mushrooms on the bottom; i thought this was very heavy  So overall, I like the taste off the crust as it was soft and tasty. But I just found it very thick for a thin crust pizza. I wouldn't say I was overwhelmed by any pizza though I would eat it again.  The olives were decent though was I supposed to get bread on the house? That never came if I was supposed to, which I did see several tables get but also several not.  This place isn't so packed that I had a hard time moving around. It's nice and spacious though not enough space to put a stroller right next to a table (which isn't an issue for me).  The service, he was attentive though at times appeared a bit annoyed. I would say #1 in Toronto is a bit of a stretch but it's worth coming to."}
{"text":"Had lunch at this Restuarant. Shared the house salad and pizza with my husband. Both delicious and excellent service. Will definitely recommend it and we will be back soon to sample the other items on the menu."}
{"text":"This place is a hidden gem. Our waitress was wonderful, the food was excellent and the bread to die for."}
{"text":"Perfect visit.  Pizza was quick, amazing tasting and server was super helpful.  Can't wait to return.  Yum."}
{"text":"Via Mercanti is a great, casual little pizza place in Kensington Market.  The food is always delicious, very reasonably priced for the quality.    The service is excellent.  I have been here three times - once with family and they were so sweet to my parents explaining the menu, once with a friend during a rainstorm and they let us stay for a couple hours, just chatting and drinking our diet cokes until the rain stopped.  This kind of service is so rare in Toronto.  It is maybe not the type of place that you would want to bring someone you wanted to impress (not at all fancy) but if you want great, authentic food in a comfortable environment - you should go to Via Mercanti."}
{"text":"This is the best place in the city for a traditional wood fired Italian style pizza. Definitely check it out. It's worth it."}
{"text":"One of the few places to get genuine Neapolitan fare in North America. Quick service as well.   Will return profusely."}
{"text":"If you have a craving for delish authentic Italian pizza or pasta,look no further. This place has the potential to offer both the feel and the food. We ordered Pappardelle ai Funghi and Scarpariello. The pizza was very soft and well cooked and the pasta had such a distinct taste, we couldn't stop eating even after we were completely full. It's a reasonably priced causal setting with good food and polite staff. Next time you're in Kensington, order a pizza, pair it with wine and learn an Italian word or two."}
{"text":"I was here for a birthday party.  The food was delicious and seemed very authentic.    The unfortunate thing was that the service was INCREDIBLY slow.  Now with a big group, I expected things to be a big chaotic at first, but I was quite disappointed by how long things took considering it wasn't that busy.  While there were plenty of staff members, there were a lot standing around and not doing anything.  I had to ask for the drink bill 4 times and it took over 30 minutes to receive it.  The automatic 18% gratuity was not worth it, but to be honest I didn't even have time to fight it as I just wanted to leave!  A lot of our party cancelled last minute which was quite unfortunate, but almost a blessing in disguise because if we had more people I'd probably still be there waiting for my food/bill."}
{"text":"After eating a few big fat American pizza's we were happy to have some proper Italian pizza. These people know how to make real pizza, the tiramisu is amazing, so is the wine! Just go here, don't expect whatever other pizza you can get at standard pizza places in Canada and America: this is the real deal."}
{"text":"Based on my meal alone I probably would have given this place just two stars.  We went on a Thursday night and they were able to easily accommodate our group of 6+.  As it was a last minute decision to go to Via Mercanti (our original destination could not accommodate us), I hadn't heard/read much about the restaurant other than its connection to Queen Margherita pizze. I like Queen Margherita but this place didn't seem as good.  First off, the service was just off. Our server not only misheard a number of our requests, he also overfillled glasses (water, wine) several times to the point of overflowing onto the table. He also for some reason didn't bring any water to our table (even though they brought the glasses) until more than halfway through the meal and only because we asked for it (we noticed other tables got water right away). The server also went on a weird tangent about taxes, tipping, etc. as we were sorting out the bill, which was totally unnecessary.  Aside from that the restaurant was just way loud even when it wasn't full. The patio looked like it would be a nice option for a smaller group during summer though.  The table shared a salad, which was nice, warm olives and some arancini (which was decent but not amazing).  I ordered one of the specials for that night: seafood risotto. While it looked amazing it was hugely disappointing. It was bland/under-seasoned and the seafood, especially the monkfish, was overcooked to the point of being dry and grey. The three of us who tried it had to drown the dish in house-made hot sauce to make it remotely palatable.  One of my friends took pity on me and my bland risotto and offered up a piece of her pizza. It was nice and flavourful, with the same tasty crust as at Queen Margherita. Others at the table who ordered pizza also enjoyed it.  Definitely would stick to the pizza if I were to return to Via Mercanti."}
{"text":"Went for a dinner date a while ago so perhaps they have improved, I don't know. I'm just going to write about my experience. I am very reluctant to give them only 2 stars. I probably would've given something closer to 3 but they really rubbed my date the wrong way - she wanted to Yelp 1-star so I'll be generous and split the difference.  The food was nothing to be excited about, not terrible, but given the price point and the emphasis on authenticity, I found it lacking.  The service staff seemed either pre-occupied or inexperienced. We had to ask for someone to come take our order after sitting patiently with our menus stacked on the table. Strike #1.  When our arancini arrived, the outside was very nicely done, crispy and a nice golden colour from the deep fryer. Unfortunately, the block of cheese on the inside was ice cold. Clearly from the freezer. Strike #2.  When my date flagged a waitress down to explain to her it was stone cold, there was no apology, nor offer to heat it up, nor gesture to take it off the bill. There was just a repeated explanation that the balls are made beforehand in a big batch and then stored so that's why it's cold in the centre. Strike #3.  I'm not sure what happened afterward but our waitress disappeared into the kitchen for a while and I actually had to get up and find someone working the entrance to help me get the bill.  Like I said, this was not within the last couple of weeks. Maybe they had a bad day, maybe they've corrected their kitchen and staffing issues, who knows. I hope so. I'm just sad to have to give such a promising establishment a less than stellar review."}
{"text":"This Pizzeria has two things going for it in a big way...  1. Seating. Wow!!! A place in Kensington Market where you and 3-4 friends can easily sit and have table service.  2. Good pizzas and salads. While the 10$ lunch special is a tad puny, the taste of the pizza is good. Opt for a full-sized pizza for a more filling meal.  Service here is very good, and they can also handle larger groups with relative ease."}
{"text":"It's tad pricey but the quality of the pasta and pizza matched the prices and the service is very good.  We had both shared the pizza and pasta dish of the day with a couple of pints and it came to about $40 all-in.  Not bad considering the quality of the food and the fact we immediately got a spot on the patio.  The patio is tucked away on a quiet street and they have a selection of beers from Amsterdam.  Great option for an easy, quiet patio."}
{"text":"I was worried that the hype for this place would out weigh the actual food, thankfully, I had no reason to worry! This is a no-frills kind of italian pizza place that focuses on making great food and not screwing around. Awesome!  Went for a little celebration for my girlfriend, just she and I, and we split a few things. First we had the warm marinated olives, which were AMAZING, and totally unexpected. Would get them again in a heartbeat. The bread that came with it was perfect and added to the app. Next we were treated to the Bocconcini, or what they should really be called \"little pizza bites from heaven\". I'm not going to lie, we could have just order 20 of these and been happy for the rest of the night....  Luckily, we didn't go that route, and ordered a fantastic Margherita pizza. Dear lord it was good. 90 seconds at 900 degrees means that the crust is perfectly chewy, the cheese is bubbly, and everything is just the right amount of cooked. If you're looking for a crispy crust pizza (i.e. not Neapolitan) then this won't be for you. But if you want authentic, then this is the way to go.  As lovers of pizza, we will be back soon, and have already recommended the place to everyone we know! We used to be Queen Margherita people, but this place blows them out of the water. Just go already!"}
{"text":"Direte la solita italiana all estero alla ricerca di un ristorante italiano!comunque sn a Toronto per la terza volta non per vacanza,ma lavoro e alla pizzeria dei mercanti ci sn capitata per caso,ho visto portare a dei tavoli delle pizze e dall'aspetto sembravano propio come a Napoli così incuriosita sn entrata!e devo dire che per essere \"dall'altra parte del mondo\"la pizza merita un bel voto! Il posto è una terrazza tra i tipici grattaceli delle città nordamericane,ma il servizio buono i camerieri molto carini.il prezzo,beh come detto siamo dal altra parte del mondo quindi ok per la qualità...."}
{"text":"Great atmosphere and food. Try the meatball sandwich for lunch, won't be disappointed!!"}
{"text":"Awesome pizzeria in Little India. This place is particularly great for families because it has lots of space, room to move around and very accommodating staff. The pizzas and the appetizers are great, but a bit pricey. I love the desert bar though. I've eaten here three times in the last year and I'll definitely be coming back."}
{"text":"The pizzeria via mercanti double layered pizza was huge and delicious! Very well worth the money. Would go again."}
{"text":"First strike against this place is that they don't have adequate signage out front, making it hard to find for a first timer. Second strike is the confusing service, which was both excellent and lacking at the same time. It's a team service approach, and the guys we had were great - when you could actually get them over to the table. The food is just okay. Margherita had an excellent sauce and nice cheese, but the crust was flavourless and way too thick around the edges. The napoletana was, frankly, disgusting. The patio looked nice, though, and I can see this being a good place for drinks and apps when you're in the area."}
{"text":"I have to confess that I am usually not a fan of Kensington Market, so I was surprised to find myself here for a weeknight dinner with our toddler in tow. Our experience and the food were fantastic. The staff and very warm and welcoming, and went out of their way to engage with and entertain the little guy. All of the food was incredible, from the pizza bites (must try), to the fries (so random, so good), to the pizza itself. I am not usually a fan of prosciutto but I have been dreaming about going back for more of their prosciutto and mushroom pizza. Definitely a sure thing, especially for families."}
{"text":"\"My friend said they have pretty good pizza here.\" -- cross check yelp to verify.  okay, it has a good rating.  \"Okay so I'm already here and we're in luck there was a spot available for me and my two friends\" -- the waitress was super sweet and was prompt in providing service.  I agree with all the yelpers who gave them 4Stars. The wood oven pizza is delicious and the appetizers are pretty good. We ordered the breaded mozarella and the Napoletana pizza.  The waitress suggested a coctail - Aperol with white wine and it isn't in the menu. So this is my tip I wish to share with all of you avid readers of Yelp! I even tried the Italian Pop- chinotto- its like coke and root beer and was also really nice to sip on while having my tomato base pizza. We ordered creme brulee in the end and it was like cotton candy on custard and we finished it as soon as it was on our table.  It has a very relaxed atmosphere and I particularly like the paintings on the wall. I am not an Artsy person but it instigated a conversation between me and my friends and before we knew it , we were indulging in our interpretations of the painting!   There were lots of couples on a date and I could see how this could be a coool date place. Not too hard on the payer's wallet (whoever chooses to pay the bf or gf or gf or gf or bf or bf )  and yet impress the date with your amazing choice of venue.   Walking to the place, I wanted to try the bar next door ( there was good music and ambience, i totally forgot the name though) or even go opposit to handlebar for a few drinks. So the neighbourhood yet again makes it an ideal place to go for a date.  Would definitely recommend it and hopefully get to go there again to try the eggplant appetizer"}
{"text":"Came here for lunch on a Wednesday afternoon.  The restaurant is very spacious and clean.  I ordered their lunch special (Mon-Fri 11am-4pm) of small margherita and side mercanti salad for $10.  Their portion size was adequate and filling.  The mercanti salad came with balsamic dressing.  The margherita was flavourful and the crust tasted good.  They also gave free bread as appetizers with balsamic vinegar and olive oil.  They also have a gelato bar for those that have room in their tummys after their meal!"}
{"text":"This one of the most amazing authentic Pizza i had, great Service fast and very nice patio  Definitely comming back"}
{"text":"Went here yesterday for a work outing. Amazing restaurant the staff are very attentive and kind. The chef walks around to see if everything is good and the food is delicious. I got the lasagna and it was delicious!!! Definitely going back!"}
{"text":"Best pizza place in Toronto? I think so! Liberetto and Queen Margherita Pizza have been dethroned. Decently priced, great decor, amazing tasting food, what more can you ask for? This is easily one of my favourite restaurants in the city."}
{"text":"My family ate at this restaurant partly because we love pizza, but also to support this great neighbourhood. We left feeling a major \"meh\". It's not a cozy place - seems really out of place. It's got the charm of a cafeteria. Who the hell designed this place? Very loud music (even though it was good), prevented us from understanding our server. The white tile everywhere, smell of paint at the entrance and draft dodgers placed along the windows, gave us the impression that this joint could use some more soul and style. The pizza was ok....but a bit soggy. Salad was basic - we expected more for the price. We will NOT be returning."}
{"text":"The situation - large party , Via Mercanti tops out reservation people count at MAX of 10 people - you can ask them if they'd be willing to stretch - I originally wanted to book for 15, but they were willing to meet me half way @ 13, which worked out because since my actual body count turned out to be 12.   Reservation-wise it was pretty simple, although a confirmation call from the restaurant would have been appreciated - but it's ok, since I called to confirm myself. Since I was here for a 5 person landmark birthday celebration, you know cake was involved - so it is important to note that no cake cutting fee applied here, and they were cool with storing the cakes for us - while we ate.  Order wise - I'll break it down by pizza then pasta  Via Mercanti - I loved it pretty good, a bit over the top, but I loved the taste, the mushrooms added a great moistness to the pie and a wonderful earthy flavor  Eggplant Parmesan - I think we ordered two and I didn't get a change to nibble on it, it didn't make it down to my end the table because it was all eaten up.  Margarita - Probably my kind of pie - because it's so simple and pretty much what I look for in a pizza - reminds me of the QMP pizza, but a bit crispier and not as toothsome as the Libretto Pie.  There was another pizza that had a cured meat with ricotta on and folded into the crust - this was middling and so-so, so I would give this one a miss.  Pasta   The chicken and Mushroom pasta of the day was a popular hit with those of us who ordered pasta, one has to be send back because the pasta was undercooked, but they brought us out some comp nibbles - while the offending pasta was redone - no fighting or quibbling on it, just taken back and replaced.   The parma pasta was good - it looked like risotto from afar, but it's ruffled edged pasta that is wrapped in the prosciutto pasta tossed in a creamy sauce and if it wasn't for the fact the person, who originally ordered it, didn't have much left - I probably would have ran off with the plate.  Service-wise - they were pretty nice and polite.  I do feel that I have to mention that once they get busy - their attention is a bit hard to obtain, but  overall I was quite happy this place."}
{"text":"Absolute best pizza I've ever had in Toronto, as a cheese person I always go with the Quattro Fromaggi, it's real cheese inside, the blue cheese is very tasty, excellent service, the real Italian pizza. Pizzas are 15-20$ and Well sized"}
{"text":"I highly recommend this place!!!! Pizza has never been the same after trying theirs. They have a lunch special of salad and a personal margherita pizza for only $10. While waiting for your food they will serve you with bread to munch on while waiting. I have also tried their lasagna and other pizzas. I liked them all. This place was also ceatured in the show \"You Gotta Eat Here\". Located at Kensington market."}
{"text":"The best pizza  in Toronto. Fresh,  good service,  cool oven made by real Italians!  Recommend it to anyone"}
{"text":"Hands down the best lasagna I've ever had. Sadly a bit crowded however the nicest crew."}
{"text":"Via Mercanti used to be my hands down favourite place to eat in the city. I would frequent the restaurant and recommend it to all of my friends and colleagues. After my experience last night, I will never return. It was 10:10 (50 minutes until close) though they looked as if they were slowing down for the night, so we came in and asked if they were still open to be polite. We were invited in and told to sit wherever we liked. We chose a seat and then proceeded to be fully ignored for 12 minutes. There were two bartenders cleaning glasses, servers walking up and down stairs, a group of at least 6 cooks, servers, what appeared to be management/owners, and others in the front all casually chatting amongst themselves, and not a single person followed up with us to even bring us a menu. This wasn't just the worst service ever experience it was ZERO service, just totally ignored, with hope of us leaving we assumed? If they were closing early that night and did not want to serve us loyal customers they could have easily told us that when I asked if they were still open. However they chose to seat us, fully ignore us until the point of us being offended and leaving. It is a shame that our once favourite restaurant in the city will now never be visited again, truly disappointed and offended."}
{"text":"3.5/5, +.5 for service  Dined here with a friend when I was back in the city over the holidays. My friend recommended this place for awesome pizza in Kensington Market, as he works nearby and has tried many establishments in the neighbourhood.  Arriving at around 5:30pm, the place was already full and we had to wait about 30 mins for a table. However it was interesting that by the time we left around 7:30pm, the place was practically empty. I guess Italians dine earlier?  I had the Salsiccia e Friarelli, which was pizza with mozzarella cheese, rapini, sausage, and an olive oil coating. It tasted good, but the portion was quite small for $19. The crust is quite unique; it's not exactly thin or thick crust, but felt more like a \"puffy\" crust. Reminds me of Red Ember Pizza back in Winnipeg.  Service was excellent, and yes the reviews were correct in that many have a thick Italian accent. Regardless they're still communicable, and I overall enjoyed my time here and will return next time I'm in the area craving pizza."}
{"text":"Ordered take out from here, and it was absolute garbage. The pizza looked like it was slopped together and they skimped on the toppings. Terrible attempt at Neapolitan pizza. Save the headache and check out Queen Margarita or Pizza Libretto instead."}
{"text":"Know of this place because I, saw it on You Got It Eat Here, the tv show on Food Network. I have to say the pizzas are very good. I really like the crust. The service was okay. The servive was good and fast. All the pizzas u can see they are made to order.  Next time I will try other items on their menu."}
{"text":"Casual dining place. I got their margherita pizza, tiramisu and creme brûlée. All three of them were good. The service was decent."}
{"text":"This was my first visit with 5 friends. Two of which have been here before and swear by it. The place is nice and bright and fairly busy. We spent a total of three hours here!! The wait staff was really good; they were patient and prompt at the same time. The bread was homemade but I really wasn't a big fan.   I started things off with the arancini which I was really impressed by. The exterior was nice and crispy. The interior was creamy. The seasoning was spot on. It sat on a bed of arugula.  Really good combination.   Then I chose to go with the pasta of the day which was a gnocchi with osso bucco.  The meat literally forked apart and was tasty. The gnocchi was fluffy and delicious. I could eat this dish every day for the rest of my life and still wouldn't get tired of it.   I will most definitely be going back. Highly recommend this place. I miss it already."}
{"text":"Came here for a friend's b-day. We had a large group out on the patio and food and service were great plus the prices are really reasonable. Something that stood out immediately was how authentic the place is. All the staff were speaking in Italian - always a good sign! We loved our server from Capri who was warm and friendly. He made recommendations with confidence, telling me friend that if she didn't like the lasagne he would pay for it himself! The location is a bit hidden in the midst of hospitals and office buildings. The indoor seating area is actually very spacious and the patio is nice. Highlights included the Calamari alla Marinara and Pappardelle with mushrooms, asparagus and walnuts in a creamy sauce. People raved about the pizzas and cannolis. They actually let us do separate bills, which made life easier. All in all, a solid dining experience and I would certainly be back."}
{"text":"The food is delicious! I highly recommend the pizza bites (which we shared as an app but I preferred over the pizza!) we also had a mushroom pasta which was ok. For dessert we shared the Nutella cake which was scrumptious, ice cream and tiramisu."}
{"text":"This is a very busy Italian Restaurant in the heart of Kensington Market. It was a Friday & the place was JAMMED\"!   The appie was bread (which was delicious) & we also ordered olives. This is the 1st time I've eaten hot olives. The were spicy & delicious & has onions/red peppers with them. Awesome!  The pizza was another thing however....it wasn't great.  It was simply mediocre. I ordered the \"Pollo\". It was tasty but the crust was VERY SOGGY. This was despite the fact that I asked for it extra crispy. This is too bad cause I would/could have ranked it a 5* but not. The service was solid & the waite staff seemed genuinely happy."}
{"text":"Dropped by Pizzeria Via Mercanti for a quick bite to eat while visiting the Kensington Market. It was pretty hot outside and we were tired of standing around and eating, so when we came across this restaurant, it seemed like a good spot to sit around and chill in AC for a bit.  The wait wasn't too bad. We arrived on a Sunday a little before 2 pm and waited maybe 15 minutes for a table to open up. It's bigger inside than I thought, as there's a whole seating area in the back as well.  I started off with a mimosa ($9), because why not? And then my friend and I shared a simple thin crust margherita pizza for $13. It was delicious, though I wish there had been a little more basil on it and that the crust wasn't charred. But I can't complain too much, as the crust and tomato sauce all tasted very fresh."}
{"text":"Best pasta and all the rest of the dishes on the menu ever! Friendly and helpful staff first experience here and absolutely coming back"}
{"text":"Best value pizza in this part of the city. Crudo e Ruccola with proscuitto di parma a must try. Great place, great value. Not the best wine selection though. Good service. Theyll make it to go if you pick it up. Wheelchair accessible too."}
{"text":"This places serves one of the best tasting pizzas I've ever had. Their potato and sausage pizza was beyond incredible. I never even heard of having potato on pizza until I came here, and I'm a huge fan of it! The dough and crust was cooked perfectly, and of course the toppings worked well and tasted delicious together. They have spicy chilli oil for dipping the crust in. Highly recommend checking this place out and trying this particular pizza!!!"}
{"text":"Great location and restaurant patio in the heart of downtown. The food itself was decent. The appetizer bread tasted tough and stale. I had a calzone, while the majority of my party ordered different kinds of pizza. I found the crust of the calzone and pizza to be too thick, although the cheese, sauce and meat were quite good. My friend found pits in half of his olives, which forced him to eat his food delicately to avoid biting into a pit.  I didn't have any drinks, but perhaps this is a good place for relaxing with a few beers on the patio. But don't go for the food."}
{"text":"It was Canada Day and I was hanging with my two friends(they are both Korean-Canadian like myself) around Kensington. It was one of the few places that was open, so we decided to check it out.    Food: We had mercanti salad, stagioni pizza(thin crust, had tomato sauce with veggies and ham). My friend had an Italian soda while I and my other friend had just water.  Although the pizza was soft and had fresh ingredients as toppings, everything was sliding off when we tried to cut it and eat the slices. Toppings were just thrown sparingly and so eating slices while toppings were sliding down was not fun.  Heads-up: this pizza is quite salty! So I would recommend you to order pizza with olive oil, or pizza with tomato sauce without ham.    Service: The waiter greeted us with a warm smile when we entered the restaurant. We noticed that we were the only Asians in this place, but that didn't bother us. There were about 8 other people dining around us.   After, he took our orders and brought them to us. That was pretty much the end of the service. No re-filling water(mine was almost empty!), checking to see if we needed anything....that would've been very nice, especially because one of my friends has never been to Kensington before.   We just felt like we were ignored for the entire dinner. The waiter would go around and check on other people(they were Caucasians), but would not bother to come around to check on us. My friends were so bitter by the end of the meal that they just wanted to pay for the meal and get out of there a.s.a.p.   I love Kensington, but I won't be back here. My friends felt that the waiter avoided us, and I felt like I was a ghost sitting in this place."}
{"text":"Excellent pizza. Good selection. My favourite place in Toronto actually but i will say their pizza isn't crispy enough as I enjoy it in Italy. Even when you ask for well done its not crispy. This is the main difference between this pizza and Terroni in Toronto."}
{"text":"I have an Italian friend (born in Italy) who claims this place has the best pizza in Toronto, and is really authentic. The guys here used to be the cooks at Queen Margherita which I always heard great things about. It's definitely decent pizza and the place is clean. I would recommend checking it out on a summer evening when the front shutters are open.  The reason I can't rave about the place is because I like my toppings. If you just want a wood oven fired tomato/cheese pizza than this is the place for you. If you want more than that, then check out Pizzeria Defina."}
{"text":"I love their Via Meranti pizza! It is my favourite on the menu which is saying a lot as you really can't go wrong with whatever you choose!"}
{"text":"If you like Italian food this place is a must. I'm Italian and very particular. Pasta is fresh and homemade. The pizza is great. Try this place out, you'll be back."}
{"text":"The place looked busy so my friends and I decided to go in. The server seemed a bit impatient with us to start. The service was way too fast, not sure how fresh their food was considering our appetizer was ready in less than a minute of ordering and our rice ball was cold in the middle. We did not try the pizza, we all got pasta. The cherry tomato sauce was really good, but my ravioli could have been cooked longer. Not sure if I would go back here for the price of the food as I know I could get better quality pasta for cheaper."}
{"text":"Looking at the menu and hearing the waiters I had expectations of a true italian restaurant. However the food was not as good as I would have hoped. It was good but not great. Potato crocche , linguine allo scogloi, charcuterie and the mozzarella balls. Although the service was fast and the staff was very nice. If I were to recommend something I would recommend the mozzarella balls, they are small but good. They also have good bread they bring to the table."}
{"text":"Soggy pizza. The waitress lost her voice but decided to come in for work! Another server had no social skills! He simply shoved the interac machine onto our table! No service and soggy pizza. I guess they've diluted authenticity and hospitality for their student crowd? I would not recommend this place to my worst enemy!"}
{"text":"My go to for pizza.  Great atmosphere, amazing service, authentic food, favourite pizza joint."}
{"text":"First of all, I am not the biggest fan of pizza, compared to most, and I have gone years without eating it. However, after noticing it was open on New Years day, and seeing John Catucci on their web page I decided it was worth a try for dinner this evening. I ordered for take-out and stuck with the simple Margherita. Customer service when I went in, and when I called to confirm hours, was great; they were very friendly and helpful.  The pie was ready in no time. I was really impressed... it was delicious! The crust tasted fresh, as well as all of the minimal ingredients, I loved the real mozzarella. Real and fresh ingredients make a huge difference and I was really pleased with everything. I could appreciate the flavour of everything without anything being over salty or over powering. I would definitely recommend stopping in and visiting Pizzeria Via Mercanti!!"}
{"text":"Pizza is okay.   Our server was hysterical! Like she totally made the visit. The location is usually packed, and it feels like with people who just want to be in kensington market at a \"nice\" or \"trendy\" place, rather than actually in a good pizza place. Again, the pizza is decent, not great.   The nutella pizza which I found to be one of the more unique items on the menu was a 5.5/10. Really it was the nutella that was probably the delicious part of it. The crust was slightly burned and uneven. (But not uneven in a \"bubbly dough\" way...uneven in a \"poorly rolled out\" way)   The other pizzas/doughs were a little bit better. The sauce was adaquate, but nothing thaaat impressive.   I'd say go here if you are already in the area and want pizza, but not to search it out as there are better options in the city."}
{"text":"I'll start by saying that I had heard absolutely nothing about this place prior to walking up the steps.   Dropped by for a solo lunch; from the minute I sat down the sense of authenticity was apparent.   Service: 5/5. Prompt, attentive, knowledgeable and courteous. My water glass was filled without asking and one of the staff went so far as to take a napkin that I had used to wipe up a bit of spilled water on the table and replaced it with fresh napkins before I could even ask.   Food: 4/5.  The pizza was delicious, if a little less firm than I'm accustomed to. I ordered the Traditrice, which was recommended by my waiter as a spicier offering. I tasted some without adding any spice initially; good spice level for the Italian palate, less so for an Indian palate. Liberal amounts of chilly oil were required, but I can never fault a restaurant for not meeting my abnormally high spice tolerance levels. Only thing I found off was that the pizza seemed almost soggy in the middle.  Net rating: 4.5/5.   Enjoyed my lunch thoroughly and will definitely be back with some of my fellow pizza lovers."}
{"text":"Service and decor were top-notch, but the pizza was rather subpar. The anchovie pizza left me a horrible first impression, because it was way over-salted.   The nearby environment was also displeasing, which also makes me wonder why I didn't go to the one in Kensington Market.  Kinda disappointed, and regret not checking yelp ahead of time. Likely not ever coming back."}
{"text":"I went here today with a few colleagues for a team lunch. I've passed this place by many times, always wondering why it was empty any time past lunch. Well, now I know why.   Service: It went from bad to worst. We had the \"audacity\" to ask for lunch specials (with $15-$20 for personal pizzas and $18-$24 for pastas you kind of look for a value).  The server (one of the owners?) gave us a measuring look, half-turned to walk away and throw some words over his shoulder that none of us caught. They don't have the specials printed anywhere.   The boys running around with water have very limited English.   It took whooping 45 minutes for our food to arrive.   When two of us asked to have the pizzas to go (in hopes to salvage it later with cheese and fresh herbs), they've folded the slices of pizza one on top of the other (even though it was half tomato, half white source) and wrapped it in aluminium paper. It was all smooched together and had to be thrown to trash later. When we've confronted the server (owner?), he instantly got rude and aggressive, saying staff like \"everyone in this country is asking for pizzas to go, its too expensive to have boxes\" and something rather unflattering in Italian.   Food: That was the main insult. The pizzas are awful! I don't exaggerate: we had ordered 4 different pizzas and all were half-baked, with cold pieces of cheese and tomato souse out of the box. The middle of the pizza was soggy, greasy and downright disgusting. As for the authenticity of the whole experience, everyone at our table have been to Italy at least once, with two guys born and raised in Italy, and all have confirmed that this miserable excuse for a pizza has nothing to do with Italy.  Pastas fared a bit better, but the \"seafood\" was one shrimp cut into smallest pieces imaginable and pasta with basil had no fresh basil on it. For $23.99, the linguine alone was not worth it.   Verdict:  With so many other choices (including good Italian places), why would you subject yourself to this awful food and bad service? Dine somewhere else."}
{"text":"VIBE  I have heard many mixed reviews about Via Mercanti but I wanted to try it out for myself. So we walked in as part of our restaurant/bar crawl that night. So yeah, the guys that work there do the flirtatious stare but otherwise, we didn't have a problem.  Service is a bit off. No Peroni. They had the other one...that tasted just like Peroni. Actually, no other international beers. It was weird.  Also, so much drama around getting us a seat because *every* table was reserved. We were happy to sit at the bar. They didn't need to make a big deal out of it. The pizza makers were fun and nice but don't really speak English. I'm not complaining.   WE ATE/DRANK  I had the Ciambella Ripiena. It's a margharita with salumi and ricotta in the crust. It was delicious. The cheese was gooey, the tomato sauce slathered and the salumi just spicy enough. Plus, it's made in the oven. I really liked it.  A solid contender in the 'za wars in Toronto.   OBLIGATORY CATCHY REMARK MERCAN: the pizza is good.  MERCANT: Service could be better and less dramatic. As well, you may want to have Peroni on hand if you sell it."}
{"text":"This place is amazing. A true Italian experience from the ambiance to the food. I had the rigatoni today, but I think I tried everything on the menu at least once. There was so much to choose from on the Summerlicious menu so I went 3 times. Try it out. You'll love it."}
{"text":"This place is not as fantastic as mentioned in other reviews, but it was exceptionally good.   The pizza, was fantastic, one of the best i ever had in my lifetime. The thin crust was unbelievably good. It was busy, so it took a while but boy, it was worth it. Moreover, the service was good, waiter was nice, and I love the pizza oven..gives the restaurant a nice cozy feeling."}
{"text":"Very cute Italian restaurant in the middle of Kensington market. I discovered this place after seeing it featured on the Food Network Show \"You've Gotta Eat Here\" along with there Via Merchanti pizza, which is a pizza on top of another pizza! As a pizza lover, the two tiered pizza did not disappoint! Filled with prosciutto, hot soppressata, mushrooms and ricotta, which was a very nice touch on the first layer. Then it's topped with a margherita pizza. It was absolutely delicious! I've also tried the pollo and quattro stagioni pizzas and they are also very good, but if you are only getting one pizza the Via Merchanti is a must!"}
{"text":"I came here with a group of 10 friends on a snowy Friday night and the consensus at the end of the night is that this place is great! Service is fast, friendly, efficient. The atmosphere is nice and cozy too. They have large tables for larger groups, and I also see plenty of small tables for two people to have a dinner and still able to have a conversation without being drowned out by the conventional loud bar noise.   Almost everyone at our table ordered the signature Via Mercanti double layered pizza with ricotta, prosciutto cotto, mixed mushrooms, hot soppressata, topped by their famous margherita. This is a pizza about the size of a standard dinner plate and we were all surprised to find no one at the table was able to finish their double layered pizza! Needless to say the double layers of meat, cheese, and mushroom were as filling as two pizzas. While the taste is great overall, my husband did mention that the disadvantage of the double-layered pizza is that it made the crust soggier so next time we would like to dry their other single layered pizzas.   I also had their lasagna and I have to say it is my favorite of the night! I was half expecting it to be salty based on my previous experience, but I was pleasantly surprised that this lasagna was perfect. I enjoyed every bite of it to the very end without needing to chug water the more I ate, and fought with my hubby to finish the rest of this since we were sharing other food!   Their baked eggplant (Parmigiana Di Melanzane) was also very yummy. In fact overall I loved this and the lasagna more than the Via Mercanti pizza.   I definitely want to come back and try more from their menu."}
{"text":"I ordered a Margherita pizza to test this place out and found it OK. It's a bit expensive for what you get compared to the other neapolitan pizza restaurants."}
{"text":"I really hope those other happy diners are correct. For me, this is the second worse meal I've ever had. The first was over-cooked rice noodles and ketchup, called Pad Thai. Oh, and it's really loud! Oy"}
{"text":"Great staff, good vibe, and pretty awesome pizza in the heart of Kensington Market. The restaurant can get quite busy, but we sat at the bar and were happy with the decision - since the kitchen is open, you get to see the pizzas as they're made which adds to the experience. Reasonably priced too, given the quality of the pizza.   BONUS: Gluten-free options are available for all pasta dishes.   HEADS UP: Pizzas aren't garnished too generously."}
{"text":"Great pizza and pasta. Just as good Pizza Libreto with having to line up. Fantastic house made pastas."}
{"text":"What a little Italian gem in Kensington. The service was quick and friendly, and the food was phenomenal. We ordered the seafood linguine and the \"pizza via Mercanti\" which is TWO layers of deliciousness. Don't forget to ask for the hot oil if you like the extra spice!"}
{"text":"Met a friend for dinner on a Thursday night and was surprised by how busy and bustling it was.  Ambiance was definitely lively and louder than I was hoping it would be for a catch up dinner.  I was 45 min. late (this NEVER happens) so my DC went ahead and ordered appys - Mozzarelline Fritte ($5) and Potato Croquette ($4).  I preferred the mozzarella balls but they could have used a side of dipping sauce.  Didn't care for the croquettes - too mushy on the inside.  She also got a 1/2 liter of house red ($26) to wash it all down but seeing as I was insanely late, we should have just ordered the whole bottle!  We ordered the Margherita pizza ($11) and the Insalata Mercanti ($10) to split.  The salad was pretty spectacular - light, refreshing, love the dressing!  Pizza was also tasty.  I've had similar at Queen Magherita and Libretto.   Still a good dinner with great company and decent food."}
{"text":"We went to Via Mercati for Winterlicious 2017 and there prix fix menu was perfect for Italian lunch. For 3 course lunch it's heavy  cause by the end I was full and struggling to complete desert. Salad was perfect with fresh veggies and liked with chilli oil and Parmesan cheese.  Fungi pizza was perfectly baked and loved every bite. Best was the chocolate caprese. Every layer of this desert had an almond bed with chocolate filling and tasted really good. All this for 18$ is not bad."}
{"text":"I stopped by for some authentic Italian pizza with beer. I wasn't disappointed. One can judge the quality of the place by the quality of their most basic pizza - Margherita. In my case, the pizza was outstanding. The staff was friendly and courteous. The location is somewhat odd, but the patio is great on a hot summer evening. If you're craving Italian and happen to be in the neighbourhood, I don't think Pizzeria Via Mercanti will disappoint you. On the contrary, I think you will like it :)"}
{"text":"Delicious food, efficient and friendly service even during the busiest times"}
{"text":"Best pizza in Toronto. Get the Via Mercanti double decker and be prepared for gorgeous leftovers. The spicy dipping oil . . . Do they sell it? They should, I would buy a case."}
{"text":"Best pizza in the city. Servers are Italian sweethearts. I freakin' love this place, and the Kensington location too. Get the Via Mercanti double decker pizza."}
{"text":"really not exceptional.  pizza is thin but with huge massive crust crown border. topping is ok but lacks fresh tomatoes (stop it with sundried tomatoes everywhere, they are good for antipasto and in pasta, but not on dry pizzas).  clearly overpriced, on top of that. not sure i'll try again.  why the h... do these pizza places not accept any customization of their pizzas, such as less cheese or... 2 slices of fresh tomato!? of course we would pay for the add! 1 dollar for 2 slices of tomato on top, they'd become richer and would made customers much happier!"}
{"text":"My boyfriend and I shared their infamous double layer pizza and boy was it delicious! The pizza was thin and flavourful, and their home made chilli oil pairs well with their pizza too.   The waitress was very friendly and the service was quick. The decor was simple and rustic, like eating at someone's home.  I will definitely be back to try the other items on their menu. Also I can't wait for their Elm Street location to open, so I don't have to walk as far."}
{"text":"Excellent place!  Gluten Free Pasta!  I had the Gluten free pasta with a meat sauce and it was great also the homemade French fries were excellent.   The other people had the pizza and they were all raving about it. They said it tasted great and the sauce was the best. Thin crust and perfect size for one person.   The espresso was very good as well. Sometimes it's hard to find a good cup of espresso but this place was perfect.   Great atmosphere with lots of Windows so it's nice and bright and the tables have that nice rough look to them. Really nice."}
{"text":"This is as close to NYC pizza as it gets! I've spent the last two years in New York City and I can say that Mercanti is absolutely one of my favorite pizza places in all of Toronto. The way they cook the pizza and the ingredients are also very similar to pizza you would have in Italy. Staff is super friendly and the interior has a great local vibe."}
{"text":"Service was pretty bad because nobody even looked at my table when we were all staring at them to get us anything... Ordered lasagna, wasn't my cup of tea, it was just way to soft like mash potato. when we asked for the bill the waitress asked us to wait. She came back about 10-15 mins later... so sad."}
{"text":"Pizzeria Via Mercanti has expanded east of downtown with it's third location opening at Gerrard & Coxwell in the heart of Little India. This massive location can seat nearly 200 by the looks of it, making it perfect for housing groups of hungry diners. Over a dozen staff work at any given time, assisting customers with a friendly attitude and plenty of politeness. Authenticity and hospitality are definitely the focus here.  Typical Italian restaurant offerings make up the menu: salads, pasta, pizza, panini, appetizers, and desserts which include a full gelato bar. A completely open space from the entrance to the back of the dining area makes for an electric, romantic atmosphere. The kitchen is partially exposed so you can watch your pizza being cooked in the classic oven.   I was asked by 5 different staff members how my meal was going, which was very impressive. Without a doubt, this place is going to be a hit with the hip Leslieville crowd. If you're not sure where to start on your first visit, go with the Margherita. After a few moments of cooling down, it's one of the best pies I've tried anywhere. Give 'em a shot."}
{"text":"BOTTOM LINE: Libretto remains king, but finally, a solid and much needed (Neopolitan) pizza joint in Kensington Market!  (3.5 STARS)  Via Mercanti is brought to you by the guys behind Queen Margherita Pizza and it's a welcome addition to all the food choices in Kensington Market. Their space is large and the seating is comfortable. I couldn't help but smirk at the crooning Italian pop playing in the background. Located just north of Bellevue Square on Augusta, I have a feeling this place will be packed come summer time.  They have a wide selection of pizzas (with and without tomato sauce), and whilst most of them are vegetarian, you can add meat for extra. They also have a good selection of appetizers. The menu, however, is a bit cramped and can make reading a bit difficult.   I had their lunch special of a 6-inch Margherita pizzas with an arugula salad paired with their sauteed rapini with sausage:  -The pizza was a good size and can be finished in one sitting. The tomato sauce was sweet, it had a good portion mozzarella cheese, but I couldn't taste the basil very well. Their thin crust isn't as thin or chewy as Libretto's but I quite liked it. The salad, similarly had some really tasty cheese on it.  -I loved their rapini (fresh and bitter) and sausage (with the skin removed so it's just chunks of pork) that was served with their house-made chili oil. Speaking of their chili oil, whilst clearly freshly made, I would've liked it spicier and with a stronger flavour.  My dining mate ordered their mushroom and olive pizza, and all I can say is that I generally can't stand olives, but these were the first I actually enjoyed! They're not salty at all and the I didn't find the flavour to be overpowering! That's a win in my book. The mushrooms, however, weren't as flavourful as one would've expected.  Whilst we didn't try their pastas, they make their own from scratch and I've heard good things about it...so I can't wait to come back and give it a go.  Finally, they have a respectable selection of beers, including the Amsterdam Bone Rattler (a rather hoppy IPA) and some from the local Augusta Brewery. There's also a healthy selection of wines.  According to blogTO, they're expected to upgrade their oven in a few weeks that should make their pizzas (especially the crust) even better. Their pricing is affordable ($30 for the lunch special + appy + pint  + tax and tip), but Libretto still gives you more bang for your buck. Overall, I'm looking forward to returning and trying their other offerings."}
{"text":"C!!ame here for a lunch with co-workers. Service was okay... not amazing... but the food definately made up for it. It sucked waiting 30 minutes for our meal to come out (after the other 2 people in our group got theres 30 mins earlier). but everyone was happy with their meal. I tried myf riends pizza and it was very good. Not libretto good but still very good. I was very happy with the rice ball i ordered (a bit pricy at 1 ball for 5 bux but definately a BIG ball and soo yummy topped with some chilli oil). I also ordered the caprese salad at 15.00. The salad was huge, fresh and loved the addition of fresh peppercorns and pomegranite seeds. I was only able to finish half so i was able to box up the rest. Didnt order any wine but they seemed to have a good menu. Will definately come back to try more of their items....hopefully servcie can be faster next time so i can give it a true 4."}
{"text":"Have always had good experiences here. Usually come here for lunch, and it's always quite busy and happening. Even if it's busy, the service is good and food usually comes pretty quickly. Today was my first time coming for dinner and I think I enjoyed it even more since we had more time. We tried the special Via Mercanti double layer pizza today which is to die for! Their arancini balls are huge, and by huge, I mean it's really not possible for 1 person to finish a whole ball, unless that's all you're having. We made this mistake the first time we came here and ordered one per person. Our server really should have warned us! The pizzas are great- my favourite is of course the margarita pizza. The pastas are homemade and absolutely scrumptious ! The space is quite large especially for Kensington and is great for larger groups."}
{"text":"Terrible food and terrible service. Would not recommend this place at all.   Came for the summerlicious dinner with friends last night. Between my partner and I, we had the potato croquette, the arancino, the faggotino, romolo's pizza, the cheesecake gelato and the tiramisu gelato.   NONE of it was palatable. The appetizers tasted like bad quality frozen appetizers you'd get at your local discount market. The pizza sauce was dripping off the dough like the gross condensate that you get if you don't shake your ketchup after a long period of not using it and tasted like nothing but salt. The pasta was glorified KD and the gelato was mediocre - neither flavors tasted like what they were advertised to be.   The quality of the food in and of itself should be enough to dissuade anyone from coming here right? BUT WAIT - IT GETS WORSE. All but one of our table's entres arrived and we had to ask for it because the waiter was ignorant of it. Not only did we not get an apology, but when the dish was finally ready she actually slapped it down on the side of the table as if we were inconveniencing her.   Being the gluttons for punishment that we are, we decided to order a nutella pizza for the table to end the night. We waited over 40 minutes for it to arrive... Twice during that time we were brought a slice of nutella pie by accident. TWICE. And of course when the pizza finally came it was burnt in spots and not at all yummy.   Tl;dr - do not come here."}
{"text":"This is a bold statement to make but here it goes: THE BEST PIZZA IN THE CITY.  There are different types of people and we all got our preferences. Some of us like 'em a little top heavy with masses of... toppings. While others are more fond of the bountiful cushion that's found a bit lower - the crust. Since I'm a girl who admires a bit of wealth on a guy, I tend to go for the dough. And the bread on these pizzas is phenomenal! I'm not usually about that thin-crust life, which is why I love this place. It's so soft and wonderful to bite into when it comes out of their wood ovens.  What makes me love this place more is that they're very accommodating.  Want to remove a topping? You got it!  Want to add a topping? Done.  Want to faceplant into your pizza? Go right ahead!   I got their namesake the via mercanti which was good, but I prefer the regular pizzas. The via mercanti is a pizza on top of a pizza. This should be tasty but I found it a bit overwhelming. Personally, I pick a pizza off their menu with toppings I like and/or sub whatever I don't. I always add mozzarella where appropriate. Portions are quite big so you can definitely share. Add chilli to tailor the spice level if you need it. Service is amazing here and there is always plenty of seating!"}
{"text":"This is the first time I've had risotto in a restaurant and wasn't disappointed.  They did a fantastic job of bringing out the mushroom flavour, and the texture was perfect.  The service was very friendly and attentive. This will be the local family restaurant for us moving forward.  Excellent!"}
{"text":"I went to this restaurant with friends on a Saturday night. We had reservations so we didn't wait long but the wait was pretty uncomfortable because there is no room really for people standing just inside the entrance. The place is pretty bright and the kitchen is the open concept style. The seating isn't bad but the tables are a bit small. The waitress was very friendly and accomodating and we didn't feel rushed at all.   We started off with Caprese salad which was nice and fresh. I had the Pappardelle Funghi Porcini e Asparagi e Noci (pasta, mushrooms, asparagus & walnuts) $18 which was pretty tastey and a good portion size, which to me means not too large. Next I tasted my friend's meat lasagna $15 and it seemed very bland in comparison, all I could taste was ricotta cheese. For dessert we shared a Nutella pizza which isn't really as good as it sounds; it's basically Nutella on a small pizza dough and ANY Nutella is good Nutella of course but for $12 I was expecting more than the good stuff just spread on flatbread, so I was kinda dissapointed with it.  This place has a casual, neighbourhood restaurant atmosphere. Would I take a date there? Probably not. Would I go back? With all the other undiscovered restaurants that I have yet to explore, probably not."}
{"text":"Pizzeria Via Mercanti servers great hand tossed pizza and house made pasta. The special of the day, tomato, basil, olive oil and fresh pappardelle ($19.95) was simple yet spectacular. The capricciosa pizza ($16) with fior di latte, prosciutto cotto, mushroom, and black olives was made to perfection. The servers were friendly. We had a wonderful conversation about soccer and live in Italy.   Now, you may start to wonder, why Pizzeria Via Mercanti received a poor review based on the aforementioned. The key issue with my experience were the plates provided. The first two plates had dead flies on them. The second plates had black specks all over. The manager than tried to joke it off as it is it acceptable and common to have flies on the plates.   While I enjoyed the food, I felt the plates were unappetizing and the cleanliness of  Pizzeria Via Mercanti questionable. Although, edible insect protein is all the rage, I am not yet ready to join the movement."}
{"text":"Fantastic service .... Amazing authentic taste and the bread basket and hot pepper oil is amazing.  Even we're kind enough to go off the menu and make linguini Alfredo for my 11 year old.   Very casual and relaxed atmosphere and I think they have live one pc. Entertainment here sometimes.  A must stop for anyone craving italian when in Kensington."}
{"text":"At least they were eager to see us..  The benchmark for any Italian restaurant and pizzeria is the margarita pizza.  I mentioned this to the waitress who assured me that was indeed the way to go.  My pizza arrived promptly, my disappointment followed as quickly.  The crust was already soggy in the middle of the pizza, and made for a rather chewy experience.    Perhaps the greatest culinary marriage of all time is the marriage between a fine mozzarella cheese, and basil. The margarita pizza raison d'être is the showcase this marriage.  Plopped unceremoniously in a puddle of wet cheese was the single basil leaf.  To their credit, after a little prompting, the maître d' brought us over a generous bowl of basil.  We had also ordered the caprese salad-yet one more time to celebrate what should be a fine marriage!  The olive oil was a bit pedantic, the cheese acceptable, and the rather unflavourful tomatoes had been refrigerated! What self-respecting chef permits tomatoes to be refrigerated?  All in all, I won't be back, there are too many excellent pizzerias an thicity restaurants in the city that can compete."}
{"text":"Neapolitan-style pizza is all the rage in Toronto these days. This newcomer to Kensington Market adds yet another voice to the thin-crust chorus. Pizzeria Via Mercanti is on Augusta Ave, just north of Bellevue Square. It's a large, brightly lit space with lots of seating. The wood-topped tables are nifty, and a large bar gives you full view of their pizza oven.  The menu offers a few appetizers, pasta, and of course, you-know-what. They have an eponymous house offering which is literally two pizzas stacked on top of one another. This of course sounded horrible so we opted instead to share the capricciosa (mozz, mush, ham, olives) and a patate e panchetta (potato, panchetta, mozz, black pepper). They have quite a few options without tomato sauce, and the latter pizza fell into this category. (How brave of us.)  No doubt this restaurant will demand comparisons to Toronto's other pizza pushers. Unfair perhaps, but c'est la vie. In my humble opinion their pizza was OK but not great. The crust was a bit thicker and chewier than I like and I found myself dousing my pieces with chili oil for a flavour boost. Also, at other spots the pies come out sizzling hot with some charred spots. I didn't notice this here (and I like this), so it makes me wonder if their oven is getting hot enough.  Service was fine, and our server's delivery of a few corny jokes didn't hurt matters. As a Kensington-thusiast, I'm glad this place exists.  Obligatory Title Pun: You MERCANT be serious.  Menu Readability: Needs to be redone. There is no need for all those caps, and that watermark is embarrassing.  Need to mention: Decent wine list, some beer, and not much to speak of cocktail-wise.  What this place teaches me about myself: While I consider myself to be saucy, my pizza doesn't have to be."}
{"text":"Yummy little authentic Italian spot next to Kensington Park. The menu holds a number of items similar to what you might find at a Pizzeria Libretto (Neapolitan style pizza, various pasta dishes, antipasto, salad, etc) but without the trendy upscale decor. This place is all bright lights, melamine and wood tables, Italian trinkets on shelves, and a big screen TV broadcasting the soccer game.   And its great.   Service is fast and friendly, the food is good and reasonably priced (e.g. pizzas are one size and average about $16). My friend and I ordered a classic Margherita and the Quattro Formagi and while both were good, I was more partial to the Margherita. The heaps of ricotta on the Quattro Formagi were a little to heavy for me, and I wanted more gorgonzola. This is a me thing perhaps - I'm a blue cheese fiend. Both pizzas were well complimented by the house made chili oil.   So glad to have another cheap and yummy spot to rely on in Kensington."}
{"text":"WHAT TO TRY??  Their pizzas and their pastas!! Between the white and the tomato pizzas, I personally like the tomato based pizzas more. I tried both at this restaurant and it just isn't the same without the tomato sauce. I know it's common in Italy to have the white pizza, but I feel like it's lacking the satisfaction impact you get with tomato and cheese combination!   The pastas, breads and the desserts are all made in house so expect the al denté pastas and chewy pizza doughs. The breads are like the pizza crusts but they cut the pieces in small squares and top it with some sprinkled salt.   I liked the linguine allo scoglio which is seafood linguine. The sauce is very simple and wasn't heavy at all. The pasta texture was the best part, Cooked to al denté perfection! If I were to go again, I would try their other pizzas too!  I tried a white and tomato pizza each. The white pizza we tried was patate e pancetta which is potato and pancetta on the pizza. After trying the potato on pizza, it's not for everyone because I thought the combination tasted weird. For the tomato sauce pizza we tried traditrice which had fior di latte which is Italian mozzarella, hot sopressata and hot chili pepper. Mmmm this pizza not only had a nice kick of chili hotness to it, but the cheese tomato and hot sausage combination made you want more!   Last tip?!  Try to see if you can make reservations when you decide to go because this restaurant does get busy. It's located inside the Kensington market and ask for some fresh Parmesan and hot chilli oil if you want more to your Italian experience."}
{"text":"hidden and hard to see off the main streets...but their pizza is amazing!! i had the margherita and a spicy salami garlic cheese one..  the wait staff are super friendly everytime i come. the restaurant is really clean too. great place for a casual date."}
{"text":"So there's been lots of hype about this place, I've been hearing that it's the best pizza in Toronto voted this year, blah blah blah so naturally I wanted to try it, because I'm a sucker for thin crust woodburning oven pizza. Came here with a large group yesterday and we tried enough of the menu (maybe had close to 12 dishes) that I think that I can speak to most aspects of the menu. So here we go:  Atmosphere: It has a very comfortable yet modern feel. White stucco walls, blue tiles on the ceiling, wooden tables, steel ducts on the ceiling. They have along bench against one wall. It's a very casual third date kind of place. It's not a romantic, candles on the table or even flowers on the table, intimate, dimly lit spot. It was very loud inside- to the point where we had to yell at each other to hear one another across the table. I think the high ceiling created a bit of an echo throughout the entire restaurant. When you superimpose music onto an echo, it makes it very difficult hear people you're having dinner with or getting to know new people. Hence not an ideal first date place.   Food: We had a bunch of appetizers. First off, the Arancini rice balls are not nearly as good as the one served at Libretto or Enoteca Sociale - its night and day-you can't even compare them. These were just disappointing. They had a nice crust on them however the inside was like all glutinous rice with no cheese, just very dense and heavy rice. The rice was yellow but it lacked any flavour, just bland.  It was also served on a bed of arugula rather then a tomato sauce so it was also dry. I would definitely not recommend this at all.  The pizzas: I think we had seven or eight pizzas on the table including their signature Double-decker pizza and their panzerotti. Immediately you can see that the pizzas themselves were really small; if I'm paying $16 for pizza, I don't want to see any white plate underneath the pizza. The other thing that you could notice right away is the distribution of the ingredients was not equal across the surface of the pizza. Multiple pizzas that we ordered had the toppings almost completely all one side. My SO and I thought this is very strange. Similarly the crust was uneven, thicker on one side, paper thin on the other. The crust itself was much thicker and drier than a soft, flavorful, Napoli style crust. This was almost, and I hate to say it, kind of reminded me of Pizza Pizza crust only because at the end of eating several different slices of pizza, I just had lots of crust leftover on my plate that I just couldn't eat (and didn't want to eat). Whereas normally I would eat the entire pizza including crusts. The panzerotti we ordered also had a huge crust around the edge so that when people are cutting into it you only really had one bite with filling/topping and two bites of dry thick crust. Overall, pizzas were underwhelming and def not the best pizza in Toronto. I didn't find the flavours well balanced and the pizzas were poorly executed. Oh, and the signature two decker pizza was overkill. I wouldn't get this again.  The upside is that everybody really enjoyed the appetizers. The rapini was wonderful and beautifully presented; they weren't over salted, great texture and flavor to them. We also had an antipasto platter with all of the usual ingredients; everything seems fresh and it also included handfuls of arugula on the side and a few different slices of cheese. These warm olives were excellent as well, flavorful and a very nice variety of olives. We also got a pasta (gluten free) that was average at best.   Service: was pretty good. She misheard is a few times, but was otherwise attentive. We actually had to go up to the bar to order which was unconventional, perhaps because it was too loud or we couldn't get her attention. We got all our food at the same time which is great. We got pitchers of ice water which is always way easier than flagging down wait staff for a refill.  Other: It was half full when we got in at 8pm, I never noticed a line-up here so wait times are probably not an issue."}
{"text":"one of the best pizzas in the city. there's literally no way to overstate how good it is, so instead of me using a lot of superlative adjectives, you should just go eat one and find out for yourself."}
{"text":"I went to Via Mercanti expecting good things after the reviews I read. The restaurant was crowded and we were seated a table LITERALLY wedged in corner, and it was surrounded by two large groups so it was quite loud. The appetizers we ordered were the fried mozzarella balls and the potato croquettes. The server gave us the mozz balls, but gave us calamari as well and when we asked where the croquettes were, she simply took the plate away and said nothing. The croquette was pretty good when it DID come, but the fried mozz balls were kind of tasteless and gross. The pizza was good,but not quite amazing. Overall, not too impressed and wouldn't go back, despite all the recent glowing reviews."}
{"text":"Kensington was dead quiet on a Sunday early evening and so my friends and I thought there would be no problem getting seated here. We walked in and were greeted by a man with a very obvious Italian accent - great! I thought we'd be getting some authentic Italian dishes tonight. So I thought.  Asked for a table of 3 and the waiter asked if we had a reservation when the restaurant was partially empty. We said no and he took a long time pondering where to seat us, odd.  Menu consists of what you'd usually find at any of these casual Italian places - pastas, paninis, pizzas (both red and white!), and a fairly good selection of drinks. Browsed quickly and noticed their pastas were a bit pricey in my opinion ($18-22), so opted for the white pizza with potatoes and pancetta, my 2 friends ordered pasta.  Pretty sure they forgot to serve us bread while we waited but our food came fairly quickly. Upon first bite of my pizza I was disappointed. Not sure about anyone here but I like my pizza crust a little crispy, this pizza was chewy and blah, topped with just 3 pieces of pancetta, I was not very impressed.   If you've had actual pizza in Italy, you'd know that this can't possibly compare. Definitely won't be coming back anytime soon. A bit overpriced for very mediocre Italian food - if I had a nonna I don't think she'd be impressed either."}
{"text":"We really enjoyed the atmosphere at this restaurant. It is quite spacious, so even though it was busy there was room. It is also family friendly, not that i care about that - i will take my kids anywhere.  The service was excellent and our order came quite quickly. My husband and youngest both got pizzas and really enjoyed them. My oldest got the ravioli and loved it. Now...i got the lasagna, and let me tell you, the sauce was delicious. But that is all I got...a big bowl of sauce and cheese, no pasta. My server agreed with me and took it back to the kitchen, where she was told that the noodles had cooked down but there were noodles. She then returned the SAME dish to me. I am not an idiot, it was clear there was no lasagna in the lasagna. She took it back again for them to add pasta to it. So now, this plate of food has gone back to the kitchen twice. At no point did they just give me a fresh order. So as much as I would like give them a great review, I cannot. Sadly being treated like an idiot means no return business."}
{"text":"The environment was fine and the servers are really nice and prompt. As much as the food was well made and had good flavour, we found it pretty salty. We ordered the marghertia pizza which is plenty for two to share but the crust was like bread full of salt so it was a bit difficult to finish. Not sure if this is normal for Italian pizza but I might just have to try something else next time."}
{"text":"Via Mercanti! We trudged along the early blistering sunshine of the day (yes what a struggle...) And came into a restaurant roaring with all sorts of celebratory cheers because Roberta Vinci (she and another Italian, Flavia Pennetta, went into the first-ever, all Italian finals) had beaten Serena Williams in the U.S Open Semis. What a time to enter a proud Italian Pizzeria especially when the owner's around eh?   No discount for this momentous occasion though, I asked but failed (+10 points for attempted bravery)  Anyways, we came into Via Mercanti with big hopes because we've been hearing from fellow co-workers who said, \"it's THE best Margherita pizza around\" and that got us very interested to try this place out.   Vika and I shared a weekday lunch special ($10) a 4 sliced, thin crusted Margherita with perhaps the most appetite-inducing vinaigrette and olive oil salad (tasty) and were treated with the friendliest of service -- these Italians I must say -- treated us so nicely, it almost feels like we're at home and the weekday atmosphere with sunlight pouring in made it feel even more badass.   As for why it's only 4 stars, we felt that something's lacking in the dish and would've loved to have more basil in there to pump up that dish. Maybe not the best Margherita pizza around but it was a positive experience (next time round, we'll take up our server's recommendation for the Romolo's pizza -- his personal fave and maybe that'll take it up to 5 stars)"}
{"text":"I keep coming back hoping this time I will have the experience everyone else has. I find the pizzas always have blackened crust, mine gave off to strong of a burnt smell, the middle was very soggy. Although toppings are fresh and delicious. The atmosphere is loud. I can barely hear who I'm with. Tonight they played The Rolling Stones (odd choice) at least 2 albums, and the stereo skipped. Very distracting. My dessert was sold out, the wine we ordered was also not available. My husband on the other hand enjoyed his food, agreed on the noise level but would come back again without thought. He just may not be going with me."}
{"text":"Its a casual place. The mercanti salad & pizza were great but other appetizers we got didnt taste good. It's a 3.5."}
{"text":"When you dine here it feels like you've just arrived in Italy.  Lol.  Love the true Italian vibe here and most of the waiters have a very authentic Italian accent.  Also addressing me as Señora and saying Gracie when I left.    Have to say that the portions are unusually small.  Had the ribbon pasta today with mushroom and asparagus.  Taste is pretty good but small portion with just a few stands of ribbon pasta for $20.    Daily bean soup wasn't good.  Too salty and beans were hard.  The one thing they didn't do was no one came to ask if we needed any pepper, salt, hot chilli oil, Parmesan cheese, etc.  Basically zero service.  No one came to ask if we liked the food either.  So we just ate and left.    Won't be a place for us to come again too soon."}
{"text":"Came here 4 months ago with a colleague for lunch and This place is amazing!!!  I had the rapini and sausage Pizza and it was just perfect, if your looking for real neopolitan pizzas this is the place to come, the only reason why im not giving a 5 star rating is because of the ambiance and the deco inside it's kinda \"old\"place looks a bit run down , but hey the food is on point!!  Try there tiramisu it's to die for."}
{"text":"On Sat 2014-03-15, 3 of us went for an early dinner.  We were the first ones there so the restaurant was empty. After 6:30pm, more people arrived.  This is their second restaurant. The first (\"Via Mercanti\") is in Kensington Market.  It is located inside a YMCA building. We went in the main building entrance which led us to a small door to the restaurant (which happened to be their side entrance). The main entrance can be seen from the corner of the YMCA building. See my photos of the storefront.  The waitresses were Italian and everything else was Italian.  The service was courteous and prompt.  The food was very tasty and well-presented. The pizza were large (approx 18\") so it is enough for 2 people to share. We ordered separate pizza for each and ended up bringing half of each home.  See my photos."}
