{"text":"I've held off eating here for a while as most people I spoke to about this place said disappointing things of their pizza and pasta (which is reheated in a microwave on order). More recently, I heard people saying good things about their pierogies and fish and chips. And then, I got hungry and decided to give them a go and eat none of those things.

I had a Chicken Cutlet Sandwich which is essentially a thin piece of breaded chicken on a toasted bun with a bit of tomato sauce and your choice of green peppers, mushrooms, and onions. Mozzarella cheese also available for $1. One thing immediately unimpressive is the chicken cutlet has been sitting under a heat lamp which they rewarm in the pizza ovens while toasting the bun.
So basically $7.10 gets you a sandwich with cheese, which doesn't seem like a bad deal at first. The problem is that the chicken inside is so thin and low grade that it's not very filling, and really not that great tasting to begin with. Then throw in the experience of queasiness an hour later (and I have a generally strong stomach) and this place is officially on my \"will never eat here again\" list.

This food court is generally pretty terrible, and that's the only reason I can see how a place like this has existed this long... Purely based on the mediocrity of its surrounding competition."}
{"text":"I like the food and prices here, and the service is even better!

The staff are very kind and friendly.

I recommend the fish or salmon! It was very tender and moist. They have many side dishes to choose from including noodles, mixed veggies, regular salad, rice or pasta. They also have chickpea and bean salad.

The food here is pretty decent considering the other food court options.

Overall, great spot if you want filling food for under $9."}
{"text":"Some Fridays, when my colleagues and I feel like cheating, we get their fries with gravy. They actually do a good job with that particular order and it's not too expensive.

HOWEVER, one day the weather was really bad and I didn't bring lunch so I asked just for chicken strips.  I think they gave me five strips and, no word of a lie, it came to close to $10!  I wouldn't have ordered it if I knew it was that expensive but the prices weren't clearly marked. They were so greasy that I couldn't stomach them all.

Aside from the fries, I would avoid."}
