{"text":"When it comes to interesting pizza in Toronto, you have to look very hard. I saw their unique style pizza and Ubered over to their shop for a few slices.  The staff was so friendly and nice, and the pizza was great. Id like to get a fresh whole one next time I'm visiting. Very glad I made the trip.   The crust is so delicious and I really appreciate the heaftiness of it."}
{"text":"This pizza tastes like a cardboard sponge cake that's been left on a counter for a month. Their toppings are low grade at best, McDonald's would be an improvement in meat quality. The smell alone killed my appetite, and after one bite I was sick. Do your self a favour and order from anywhere else."}
{"text":"In Saskatchewan there is a particular type of pizza - you know it if you'd had it - for years I have threatened to open a place here in Toronto that makes \"Saskatchewan\" pizza. It's a kind of heart attack on a plate with a crispy heavy crust and mountains of toppings...mmmmmm. Now there is a place on Queen East called http://pizzathick.com/ and they are doing it!! Here's the thing - the pizza is fabulous, but the people are yummier! They gave me the wrong topping - so they phoned me when they realized, made me another - drove it over themselves and apologized, AND GAVE ME TEN DOLLARS BACK AND GAVE ME TWO PORTUGUESE CUSTARD TARTS FRESH FROM THE OVEN! I urge you to support!"}
{"text":"Don't walk, run, to my new favorite pizza in Toronto.  I'm a fan of both NY style and deep dish, and this deep dish pizza is the BOMB.   Their combination of toppings are both interesting and DELICIOUS, and it's all well supported by the hearty crust!    Don't forget to visit when it's Custard Tart day.  They are to DIE for!      Next time, when I have left some room for gelato, I will be having me some of that!"}
{"text":"I was reluctant to try Pizzathick again because I'd had the pizza under the old owners and it was...well...gross (like, I threw it in the garbage).  I was impressed by the improvement! Yummy crispy thick crust, lots of cheese and just the right amount of toppings. A great Leslieville find and reasonably priced. Have not tried the ice cream."}
{"text":"Like some previous reviews $30for a 15\"pizza is a it steep for the basic topping options they offer. I ordered the Canadian surfer which was half the Canadian pizza and half the Hawaiian.      The pizza is pretty heft. It was layered with toppings and cheese I was so excited to devour the pizza.    What disappointed me about the pizza was that it seemed to lack flavor.  Though the meats like pepperoni and bacon were present they were just too salty. The cheese a bit rubbery and sauce could have used some spices/herbs to season. Even after we doused it with hot chili oil I found the pizza just bland and one dimensional."}
{"text":"Tried the Queen West location on Saturday evening. They are open and operating as per usual. Was pleasantly surprised. I have had challenges finding half decent pizza places in the city but his is by far the best pizza that I have found here in Toronto. Was well worth the drive down from the north end. Awesome crust and super fresh toppings. Served piping hot!! My wife and I ordered the largest size they had and it was more than plenty. Next time we'll dine in as the restaurant looked very nice inside. Met the owner and he was very nice too!"}
{"text":"Note: this review is for Death in Venice gelato (served here) but also the fabulous service at Pizza Thick.  After a lovely Father's day lunch on the east end we went for a stroll in the sun. We were walking to the Leslie Spit area, but decided that ice-cream on the way was imperative. We had planned on the reliable and delicious Ed's Real Scoop. After a sweaty few blocks, we spontaneously spotted Pizza thick and I spied the Death in Venice sign. Jackpot!!! I had been meaning to try this gelato on Queen West (it's served in the Turkish Constonple bakery) but had no clue that it was sold around town.   The gelato is phenomenal - so fresh and pure and no added sugar. I tried the award wining lemon ricotta rosemary. My sister had a winning combo of turkish coffee and ginger and my dad had bocce Nutella crunchy bits. The server was super friendly and gave us our dad's gelato on the house in honour of father's day. Adorable move!    They have other crazier inventive flavours such as smoked eggplant and tahini, anchovies, and even pigs blood! UM interesting but, ah, no thanks...  If I lived in the area I would definitely come back and try the pizza too :)"}
{"text":"Finally got to try this \"Regina style\" pizza joint! Was it the same? Not really, you can't expect the same quality pizza as where the city originally made it. After trying out several pizza places in Regina, I had pretty high expectations. Prices were comparable, $20-25 for a medium pizza and large around $30. We ordered a hawaiian pizza and a pound of wings and it came out to $38! Super pricey but was very filling with the thick crust. I would say there isn't as much meat compared to Triple 8 in Regina. Maybe I l should have ordered their popular pizza because this one lacked a bit of flavour. The parmesan chicken wings were delicious but not sure if i wanna pay $11 again for 8 pieces of wings. Another thing that I wanted to mention is that upon receiving the pizza it wasn't piping hot. I called and ordered 20 mins before pickup but it wasn't ready yet or maybe I was just waiting on the wings so the pizza got cold. Overall, overpriced pizza and semi tasting pizza, can't compare to Regina!"}
{"text":"Honestly,  this place isn't worth the money.  It was almost 40$ and the pizza was bland, soggy and not all that thick. It was so gross I didn't even finish it."}
{"text":"My partner wanted to try a new pizza place, the internet suggested here. He ordered when I left work assuming it wouldn't take more than an hour to arrive.  It ended up taking about an hour and around 40, he had to call, said it was out for delivery.  I had rather lost interest and heated up some food from the freezer so I only had a piece. It was okay? It is a thick pizza, but the crust wasn't that strong and kind of fell off.  It's an okay pizza with a ridiculous delivery time. Might be better if you eat in? We probably won't order from here again.  Wasn't bad but not worth the time or money."}
{"text":"Wow best pizza EVER! My fiance and I absolutely go crazy over their pizza. Absolutely fantastic. We always order half/half always. We always order the bacon double cheeseburger and then switch it up for the other half."}
{"text":"I absolutely enjoyed the Gelato.  Didn't try their pizza unfortunately but it did look good. Their Gelato flavours are amazing..I tried the Pina colada and the strawberry with red wine. Whoo weeeee, burst of flavor  in my mouth. I don't drink wine at all but the Gelato is divine!! I was looking for a decent icecream place in the leslieville area and I kinda love this place. The guy at the front was really helpful...explained the flavors and recommended flavour combos to us. Let us taste a couple so we could. Overall great experience."}
{"text":"Great staff that are doing the absolute best to recreate Saskatchewan style pizza. Unfortunately they only similarity that I found was the way the cut the pizza.  So if you are like me and looking for Sask pizza the hunt continues.  As for hitting the mark for pizza overall it's pretty good. They are not skimpy on toppings. The cheese does not have that \"gooey\" texture a pizza should have. I felt the crust was close to Pizza Hut.  They also have Kawartha's ice cream that is amazing."}
{"text":"Got the pepperoni and cheese and the 5 cheese.... very disappointing. Taste like frozen pizza. No taste to the crust. Salty and bland and rubbery. Big fail."}
{"text":"Pizza Thick is under new management now and they've been doing great things! They've improved on their pizza tremendously from the original owners, and they also carry gelato from Death In Venice (a must try). Who can say no to pizza and gelato?!  My husband and I went today to their Slice & Ice Event, and it was great! We tried their new Big Smoke pizza with sausage, pulled pork and some other meats that I can't remember, onions, BBQ sauce and they even offered hickory sticks to put on top. It tasted amazing and had a good balance of salty from the meats and sweet from the BBQ sauce. We then ordered a slice of their Canadian (pepperoni, bacon and mushroom) to share and again a great slice! We will definitely be back to order a whole pizza of their new Big Smoke.  We then moved to tasting their Death In Venice gelato made by Kaya, and our minds were blown! We sampled Turkish Coffee, Jack Daniel's Dark Chocolate, Saffron with Vanilla & Ginger, Mexican Chocolate Mole, Pistachio Baklava, Porcini Pecorino, Satay and a few more (too many to remember). Each one was really good, and incredibly unique! We bought two pints for take out."}
{"text":"Yummy finally a place where you can buy a great tasting and filling pizza slice. No nonsense thick great tasting pizza dough with lots of toppings. Biggest bang and flavours for your buck in the area"}
{"text":"Four new parents and two babies (one very fresh, one looking quite the giantess next to the very fresh one) sat around in the east end trying to figure out what to have for dinner. The newest mom wanted pizza, so pizza it was! The newest dad wanted to try weird, unheard of pizza, so weird, unheard of pizza we had!   The thing is, though, this prairie-style (whatever that is), thick crust 'za is actually quite good... and not weird at all. It is more of a flat bread covered in goodness than a pizza, in my opinon, but it was still great. Heaps of cheese? Check. Hot and fresh? Check check. My only issue is that we wanted some sides, like wings which are on their menu, and they were out. Who runs out of one of their few menu items? A bit cheeky, but I still like Pizza Thick."}
{"text":"I'm going to say the pizza at this joint is... pretty good, but not the best value ($35 for a large is not $, more like $$).  They're certainly not screwing around with the name: this pizza is THICK, toppings are generous, and a large can easily feed 3 people.  Staff are friendly!  My issue is the actual taste of the pizza.  I've tried 4 types so far and several had an underlying musty sour taste.  I'm thinking it could be their choice of mushrooms, and possibly the bacon.    Cheers D"}
