{"text":"I hate to have to give, only 4 stares. All in all, the pizza was great. Wings, really really good, but..... , they were very small wings. Size does matter. Plus it was a one hour wait, for the delivery. That came from, just up the street. Time wise, a little excessive. But after all, it was still a great meal. And it was worth it."}
{"text":"I'll tell you I'm a huge pizza critic, and for 5 dollars it doesn't get any better than this. The cheese is so tasty and the sauce is zesty and yummy. Also, the bread sticks with the butter sauce is oh so heavenly. Definitely one of my local go-to pizza joints"}
{"text":"Great place to get a large pie.  Always support local businesses and great prices rather go here then Little ceasers and pizza patron."}
{"text":"Their pizza is awesome! Even though there's no dining area to sit down, you can take your pizza inside that sports bar next door, and get a table. As long as you order a drink from their bar."}
{"text":"Good quality at a great price. You can't beat the $5 special. Staff is friendly and the order was correct like always. Thanks guys."}
{"text":"I have yet to to taste the pizza and wings but this is a post about customer service.  The location on grand has great employees and they are attentive and knowledgeable. I have never had better customer service with such an affordable price.  The taste test will come later.  Upon Eating the pizza its better than little ceasars but not enough to sway my vote.  The wings are small.  I do not know where they buy them but a change up would benefit.  I have been trying to find a local spot to compete with US Pizza but it seems impossible."}
{"text":"This is a hidden jem .. This is the best sausage and spinach pizza I've had .. Although the neighborhood must be well aware of it as there is a steady stream of take out and eating at the counter .. There is a place to eat downstairs though ..so much variety and choice and everything looks so good and so hand crafted that I new it was going to be good before I ate .. But it's better than good ... Next time you want pizza , drive to Atwater market and get this pizza instead of delivery ... It's at the very end , same end as the Christmas trees are at :) Such a wonderful surprise on a cold November day !!!im giving it 5 stars for the quality of the food alone !"}
{"text":"Legit local pizza joint. Homemade dough. Flavorful house sauce. Fresh grated really good custom mozzarella cheese. $5.00 large one topping pizza for carryout. This pizza joint would be right at home in a neighborhood in New York. It's divey with hard working and slightly rude pizza veterans running the restaurant. I look for that kind of character, as an indication of authenticity and flavor. Obviously no corporate bullshit here.   There aren't any tables, just a service counter with a tattered laminated menu and an old school individual letter menu board. It's carryout or delivery only. The menu is extensive including: wings, desserts, salads, subs, breadsticks, and vast selection of fried appetizers. The mission today is the pizza. $5 one topping large carryout special. I just ordered cheese. judgment will be passed in a pure form.  The order was ready quickly and promptly served hot. I had ordered at around 10.30a, not a particularly busy time. The boxes are very cool, wait with unusual pizza box qualities. I can't exactly remember but I'll get a picture. Open the box released a billow of intoxicating steam, revealing a golden cheesy pizza grail. It was beautiful. I looked at the pizza on the website and my pizza was exactly as shown on the tin. Wow! (I will add pictures soon/next time.) This is my new favorite pizza place in town. Blows the pants off of any chain pizza joint - you know who you are.  The crust is light yet chewy and crunchy in spots. Delicious homemade sauce is perfectly proportioned and adds the right amount of sweet tomato tang. The cheese is the slight bubbly molten golden stretchy kind I dream of on a pie - but realized!  This is a pizza of dreams if you want a really good authentic LOCAL hand tossed pie. I don't know what to say, I'm smitten. The cheese pizza is everything I've been craving in a slice of hand tossed pizza. Absolutely delicious. I have to say that cheese is my favorite. I'm a salty sailor, but the addition of parmesan cheese brought out more flavor and made the slice absolutely perfect.  I wasn't the only person to  picnic on the sidewalk, stacks of discarded pizza boxes in the trash cans outside attest. It's no frills. I didn't get napkins or cheese or peppers. And you know what I don't care I just paid $5 for the most legit pie in the valley.   Tip: The website & menu list an assortment of specials. Seriously you can't beat housemaid large one topping for $5."}
{"text":"Some of the best pizza in montreal. Very casual. It's not really a sit down restaurant instead you order at the counter and can eat outside in the Atwater Market."}
{"text":"A few years back a $5 large pizza sign catches my eye when looking for something cheap and quick to eat near where i live. Tried it and it hit the spot. Pizza has been pretty consistent and actually better quality than Lil Caesars.  Now to the bad part...had a decent sized crowd of kids to feed so I bought a \"$10 Gift Certificate\" from online. You think, $5 pizza is already a pretty good deal and now i can get 3 of them for the price of one(plus tax) by using the gift cert and feed these kids. Whats the catch?? Minimum order of $15...ok so now is the perfect time to use the Gift Cert because I'll reach the the minimum. Order the pizzas, hang up and I get a call right back with them stating that the price was about 3 times higher than I expected(basically full price for 3!). Went back and forth with the guy on the phone, and finally ended up talking to the manager. Manager proceeds to try to make me believe that they have nothing to do with the gift certificate and that the company did it on there own, they dont make any money off the deal and when all was said and done basically wanted me to pay full price for the 3 pizzas!!! Even though I let him know that I order from there often and was on the verge of never goin back because of this, there was AB-SO-LUTELY nothing done to accommodate the inconvenients. The situation with this Gift Certificate situation was making me feel like i got baited and switched, and in the meanwhile, HOW DO I GET MY MONEY BACK?!?"}
{"text":"Best pizza ever. I live across town and still go to this place for the pizza. I compare pizza to this pizza nothing compares at all. You get the best pizza for the best price 5 bucks. You can't beat that!"}
{"text":"Found this place two years ago because of $5 Pizza specials. It used to be good but I think they changed the recipe got sick last two times I ate it. Hopefully they change it back and I will be returning"}
{"text":"Pizza Mia is fantastic! We usually order Papa John's or Domino's.  We were in the mood to try something different but we still wanted Pizza.  We called in our order and let me tell you, I'm now converted from commercialized pizza chains.  They said it would be about 45 minutes, it took about 35.  Gotta love it when your food arrives earlier than promised.  The delivery guy had a personality.  The pizza crust is so light, even the kids eat this crust.  Oh, and the wings are soooo good and they have an even better price on them.  For a large pizza, order of wings & breadstick (comes with sauces) our total before tip was around $24.  Most places, you start adding wings it really gets up there in price.  Great service and great food for the value."}
{"text":"Our first time trying Pizza Mia and we love it. Price is very reasonable and great wings, pizza and bbq ribs. Thank You so much."}
{"text":"Made from scratch crust, flavourful sauce, and lots of delicious cheese make for awesome pizza. There cheesy bread with butter sauce is sooooooo good.  Baked not fried wings are the best I've had!  Friendly staff with great personalities. Yes the pick up area is small and sometimes crowded but I'll take a $5 pizza from a local business over little ceasers any day! Soooo worth the trip."}
{"text":"With so so many reviews I hate to give a poor one, but honestly the pizza wasn't all that great. We ordered and walked into a run down building with a glass shattered door and 3 very young adults running the place. The got our food, and helped us out, but they didn't tell us that to use a coupon that we had, you couldn't use the deal we originally used. bummer. So we spend 10 extra minutes trying to figure out how to get the price to $30 and the oldest out of the three (he was like 22) was confused and angry as to why would couldn't work out the price,, but that was mainly because they have know electronics or even a cash register. All their prices are variable, and some we were told in person were different that what is on their dingy billboard The experience wasn't great. The wings were extremely tiny and baked the same oven cycle as the pie, so not crispy. And the pizza taste like what would happen if lttle ceasars was to sell thin crust pizza."}
{"text":"I ordered from here today, 11/22/16 and had a simple delivery order.. From the time I was on the phone I had a feeling it would be a bad experience.. I ordered a pizza with all green peppers and half pepperoni since I don't eat meat. An hour later it was delivered and tipped 25% ( just so you know I'm not one to complain or be a bad customer ) it was full of pepperoni and only half was green pepper.. I called and asked what they can do. The manager credited me for a free topping.. Not a pizza, just a free topping. Then I was hung up on. I will never order from here again- horrible service and m"}
{"text":"Best pizza joint around. And there is some good pizza in this neighborhood. Wife had mia minis. There little cinnamon bites with icing side. Nice little treat."}
{"text":"Absolutely amazing place hidden in such a big city of PHX but the food is worth the trip as well as the bread!! I love local shops and this one by far has got my full attention when it comes to pizza!"}
{"text":"Love it! Full disclosure, I like my pizza thin and saucy and a little \"soggy\" doesn't bother me one bit. If you are one of those people who needs your pizza to be crisp or the dough to be thick then take a pass. This is NY style and I think it is great. No seating area so plan on delivery or pick up :)"}
{"text":"I kept hearing how great this place was, so I decided to give it a try.  Unfortunately, I found it to be so-so.  We ordered a pepperoni, an Ultimate and a large order of  breadsticks.  I tried the breadsticks first and they tasted great, so I was pretty encouraged about the pizza.  I tried a slice of the Ultimate and it was very bland.  The canned toppings were rubbery and the sauce had no flavor.  The only thing this pizza had going for it was the crust.  The pepperoni pizza was also bland, with its flavorless sauce and minimal pepperonis."}
{"text":"This is a tiny little pizza shop in Atwater Market. I'd have to say best pizza in Montreal. If you're with friends order a few different half slices to try as many different types of pizza as possible. I haven't had a bad slice here."}
{"text":"Yummy! Amazing market with a great little spot for some pizza and other goodies. It's hard to decide what you want with so many pizza options! Sit outside or bring the food to the water and enjoy a tasty lunch or snack."}
{"text":"Great Service, pizza is good they just need to work in the location paint the walls in the lobby and replace the entrance door."}
{"text":"Delicious pizza! The sauce is sweet and very cheesy! I'm a crust fan so the crust was good. It was thin but it to thin, edges were nicely browned...I also purchased a salad nothing to special BUT I enjoyed and for 1.99 yes please! 1st time buyer and I'm always willing to try somewhere new!"}
{"text":"Delivery boy never showed up. Manager does not seem to care.  Not recommended"}
{"text":"I am not sure why Pizza Mia doesn't have its own business listing on Yelp. After all, they do make the best pizza in all of Montreal. Nothing else I have tried (and I have been to the highly rated pizza spots) has come close to what Pizza Mia offers. The slices are full of toppings fresh from the market a few steps away, and the dough is still the best pizza dough I have ever tasted. Their vegetarian pizza scores off the charts in the flavor department, especially with chili oil on top of it.   Aside from pizzas they also make and sell a myriad of other delicious food like macarons, calzones, cannollis, etc...  Before you crown one of the other good pizza places in Montreal as the best, give Pizza Mia a try!"}
{"text":"By far the best pizza I've had in Montreal... and I've tried a lot. Perfectly crunchy thin crust, great marinara sauce, and good prices for a filling slice or two. Don't miss it!"}
{"text":"I rarely give 5 stars, but this place is deserving. Excellent customer service and simply the best pizza in terms of fresh flavorful topping, nice thin chewy crunchy crust and to boot fantastic value. Don't miss eating here if you like pizza"}
{"text":"The area is a bit run down but I tell you this pizza is awesome! A large cost you $5 and its delicious, way better then little Caesars. It's a small business company and I don't about you but I fully support small business but this pizza joint is where I go to but my children's bday party pizzas."}
{"text":"Yelp Says they are 43rd and Happy Valley. i called for delivery they answered the phone and put me on hold for about 5 mins. when they came back on the phone they said thank for calling Pizza Mia on 43rd and Bethany. I told her their Yelp account said they were on Happy Valley and 43rd, she responded \"well were not\". I said ok you may want to update your Yelp account and she hung up with out saying a word.   I guess they are just to busy to be polite."}
{"text":"Pizza and wings are very good and the price has always been low. This is by far our fav place to eat. We have tried many of the locations around this area but Pizza Mia is the best."}
{"text":"Best $5 pizza!!! Small shop, made fresh to order.  Friendly staff, always accommodating.  HIGHLY RECOMMEND!!!"}
{"text":"I have had pizza here twice. One was a pepperoni pizza and a couple weeks later it was a pepperoni and sausage pizza. It tastes great and is reasonably priced."}
{"text":"Pizza is good and cheap. You can get 2 Large 1 topping pizzas for $10. The wings are good but i would skip them. Their bread sticks are really good but BEWARE they will stink up your house, that parmesan and butter is a stinky combination."}
{"text":"Very simple pizzas. Half a square is around 7 dollars  Making the full slab 14. Flavours range from arugula and feta to olives and meat. Personal I find these pizzas to be bland and extremely oily. It would be better if they did something with sauce as the bread is extremely fluffy it would work welll.   Normal slice of cheese pizza 3 $   Putting prices on the pizzas would be great there is a board but didn't have any idea till having to ask many times prices of items.  Cronuts are 5 $ there's two kinds mustard and original."}
{"text":"The pizza: is it great? It is not. I think they've tweaked their formula in recent years. The sauce is suddenly overly sweetened and stale oregano is prominent. However, it's the best pizza that cheap money can buy.   Interior is essentially just a white counter from which you can be told that they gave your pizza to someone else, so if you could just be cool, they'll get a replacement in the oven and it'll just be 10 minutes? 20 minutes will pass, and you'll debate going to the bar next door, because there isn't typically anywhere to sit. You just sorta lean on the white wall and watch the small army of teenagers loudly struggle to figure out how to run the place. They hooked you up with a free ranch, though, so it's cool.   Despite that experience, you oughta know: I went back there. Many times. Because it's the best pizza for cheap money."}
{"text":"My wife and I were on a walk around the area and we stumbled upon this place. It smelled really good so we had to go in and give it a try. The customer service was excellent and the food was pretty tasty for a 5 dollar pizza. Their crust is actually really good too. It has a nice crunch on the outside but light and airy on the inside. This is definitely a step up from Little Ceasars 5 dollar pizzas."}
{"text":"I was looking for a place which had a good chef salad and someone recommended this spot to me. I wasn't happy that it was lettuce from a big plastic bucket, or that the guy preparing it was pulling it out of the bucket had no gloves, very unsanitary. They give more ranch than others spots. The mushrooms were ok, nothing to do flips over., I wish it had tomatoes.   I hoping I could find a place to sit down and wait for my pizza which was real good in taste, and economically affordable , and it tastes better then Little Caesars. but it's a small dive so I had to take my pizza home to eat. I'd give it another star if not for witnessing the dude preparing my salad."}
{"text":"I love this place.  The pizza is ALWAYS delicious.  I just wish they delivered to my home, but I have been known to drive the extra couple miles.  The ingredients are fresh, its a mom n pop place..  I LOVE UHT!"}
{"text":"Is this place still in business?  I was looking to order about 10 pizzas today and this place was close by and near the top of yelp. Went to the website and tried placing an order online but it won't let me.  Why say order online if you really can't?!?  So tried slicelife.com and it said this place wasn't accepting orders.  So since online ordering wasn't working I have tried calling every 15 minutes since it was supposed to open at 9am. The phone just rings and rings.  Needed to pick pizzas up but I'm not going to waste my time driving to this place."}
{"text":"Sometimes Pizza Mia stops by my office with a few discount hot pizzas. My favorite part is that its basically delivery without the delivery fee, thats why they have so many repeat customers. I enjoy how the dough has a unique softness and the sauce has a unique zest. I tend to support the smaller pizza shops like pizza mia rather than the chains. Pizza mia is even competitive in price with Lil Ceasers! Keep up the good work and regular delivery route. Things are clearly mutually beneficial."}
{"text":"I really have a disdain for franchise pizza. I support local pizzerias as they produce the best product. Pizza Mia pizzas are the best I've had while here in Phoenix. One evening, I ordered takeout and they prepared my order incorrectly. Which wasn't a problem as it was a size smaller then ordered. The owner quickly decided to add another 12\" to my order! You now have a loyal customer."}
{"text":"I would rate it 3 stars, but the service was horrible. My buddy and I went for pick-up and he had an Entertainment Book coupon which was a \"Buy one get one free.\" The guy working the counter wouldn't honor the coupon. He kept saying that they were running a special that was a better deal than the coupon. A line starting forming and we just paid the full price to avoid the hassle. Granted, if you are expecting to pay full price, it may be worth it. If you have a coupon, don't even think about it."}
{"text":"Wow is all I can say.Pizza was really good crust,sauce,cheese all were excellent.The total for two large one topping pizzas and bread sticks(which were awesome too) came to 17.00 bucks and that was a delivery.Will definitely be returning to Pizza Mia"}
{"text":"Really good pizza, a large is $5. Good sauces as well. Better than the big chains that's for sure."}
{"text":"This is one of the local gems in town, great pizza always made right! Its got a good sauce and great crust. The prices can't be beat,  and its always made fresh and fast . So glad they are in my neighborhood!"}
{"text":"Great pizza! I will go here over others, because the price and the quality. Awesome bread sticks to. With the butter sauce, its like heaven."}
{"text":"Lasagne réchauffée au micro-ondes avec une assiette en plastique presque fondue avec la lasagne ! C pourtant simple, il ne faut pas réchauffer le plastique avec ce plat !  mauvais service ! Attention !"}
{"text":"im giving it three stars because the staff were really nice.  I wasnt a fan of the pizza but havnt tried the sandwiches or salads, not sure if i will bother.  But nice staff goes a long way."}
{"text":"These little hustlers are the bomb... were were enticed to purchase a pie after the guy dropped by the Hoot Owl bar on 43rd and Bell rd. I asked if they were any good and he gave us one.. free. We scrounged about 5 bucks and paid for it anyway.   The pizza was just about a prefect little classic style pizza, nothing strange, nothing outstanding but man it hit the spot while ending our night out.   Thanks Pizza Mia. C U around."}
{"text":"As a former NYer, I *know* good pizza, and I'll admit I am a bit of a snob in that I critique inferior pizza rather harshly.  I actually have lived around the block from this place for over 20 yrs, but never tried it, since they give a lousy first impression (storefront only for pickup, location and crew look kind of shady, distributes lots of local flyers with conflicting prices, their advertised website has expired, etc.)  But they are now available under Amazon Restaurants, so I figured I'd try them.    Got a large pepperoni pizza and 10 hot wings.  Price was actually about a dollar less than flyer I had ordered from.  I was shortchanged by clerk, may have been an honest error, but beware. I was only customer there when I picked it up.     Pizza was barely warm, although I picked it up less than 15 minutes after I ordered it (Suspect possibly premade and reheated?), baked evenly, a bit soggy, very thin sauce with oily mozzarella (usually a sign it is cheap generic).  Edible, perhaps average by Phoenix standards (although even Papa Johns is is a bit better) but we ended up throwing most of it away.  However, the wings were actually good.     Sometimes first impressions are correct.  Not going back."}
{"text":"I am not really a big fan of pizza, even less so of mediocre ones. Right now my stomach is unhappy with me over my impulse choice for lunch.  The peperoni pizza I got was lukewarm, greasy and chewy.  Flavor wasn't too bad.  There is no inside seating, the one time one of my employees went over to get lunch for the crew she had to wait outside.  So it is take out or delivery only.  They (crew) did say they thought the subs were better than the pizza and both of them like pizza.  So how did I end up consuming a 12\" pizza for lunch?  Every so often in the late morning one of their drivers comes through the complex offering pizzas for $6.00 (used to be $5).  That really is a pretty good price for a delivered one topping pizza.  Selling door to door like that I didn't even think about a tip and after eating the pizza I didn't feel bad about it.  You do have to admit it is a pretty good marketing scheme to hit up industrial areas just before lunch.  I think he only starts with 10-12 pies so they cannot get too cold before he is done.  I usually pass and will for quite a while yet now."}
{"text":"So this is my first time trying Pizza Mia they have always put coupons on my apartment door and I've always wanted to try it but I've never made the effort I guess lol. But I was craving pizza and figured ahh what the hay, I ordered 2 large pizzas one pepperoni and one cheese for 15$. Now to the official review I like the sauce it's not too overpowering flavor wise. The crust was okay nothing special.  Not too thick nor too thin if you've had pizza from another homemade pizzeria the crust is about the same. I like their cheese blend. Overall I have nothing bad to say 5 stars"}
{"text":"Boutique dans le marché Atwater qui fait des pizzas, chausson, empanadas ... J'adore les empanadas boliviennes au boeuf, cumin, petit pois. Un délice et j'ai vécu dans des pays où c'était la spécialité donc je sais de quoi je parle :D Les pizzas sont biens bonnes, il y a soit des pointes soit des parts rectangulaires. Jamais décu les fois où j'y suis allé et en plus la facture finale n'est pas trop élevée à la fin ! Bonus, il y a des places assises dehors quand il fait beau !"}
{"text":"Good value for the price! Plus it's open late, which is a nice plus! Perfect place to go when you wanna eat a late night tasty but unhealthy meal!"}
{"text":"Mediocre pizza, slow service, nowhere to sit so make sure you call and order ahead of time. Building looks super ghetto and there was a bullet hole shattered through the door glass but the pizza was good. As you can see the workers in the back, I had my eyes toward the sink and noticed they didn't wash their hands, I really hope they did when I wasn't looking. Regardless, the pizza gets cooked anyway so I wasn't terribly worried about germs. The young order taker was unorganized and forgot a couple of mg items.. he was very young looking so I'm not holding it against anyone. Poor kiddo.   In a nutshell, it's better than little caesars for takeout pizza and they deliver."}
{"text":"The breadsticks are really delicious with that garlic butter! Wings and pizza were also great. We often get the Pizza Mia Deal."}
{"text":"Pizza Mia has great deals and is inexpensive when you're on a budget! Make sure to ask them about the specials for carry out!"}
{"text":"The pizza and wings are great and for the price even better! Love the dough always perfectly cooked, the customer service is also good. We have been coming to Pizza Mia for years!! I wish they would open a second location on the West side, closer to the 303! Lol!"}
{"text":"Not bad, guy offers a $6.00 pizza door to door, Is this legal? I got on yelp to verify if this is a real place.  I still have not been to  43rd Ave and Bethany Home but I will next time im in the area.  I look forward to try a sub, thanks Scott"}
{"text":"This pizza place is close by to where I work and we've run into the owner from time to time shopping at Restaurant Depot, so it was only natural we were bound to try it out eventually.  This place is definitely a step above Pizza Hut and Domino's so stop ordering at those places right now and support a local business!   My favorite is the pepperoni with jalapenos and a side of cheesy bread.  Definitely get the cheesy bread.  They serve it with a side of melted butter and I swear you'll never reach for marinara sauce again.  The wings are also awesome and I'm not even a wing fan.  I've been dying to have the boyfriend check it out as he's a wing connoisseur and I know he's going to love these.   I live close by, but I'm moving soon and need to get food to feed my hungry helpers, so we'll definitely be ordering up a huge spread for every to fill up on.  Too bad that after they eat no one will feel like lifting anything heavy."}
{"text":"Great pizza with a (how it should be) thin crust  You can buy them by the slice and if you're lucky you can have a freshly made one ( taste even better)"}
{"text":"My first yelp review! The food here is always consistent. It's nothing crazy, just good pizza joint fair done right. Great service. Delivery times are always pretty good and prices are pretty fair considering they're so much better than the rest of the pizza places in the area. I order from them once or twice a week so I figured they deserved a nice review from me"}
{"text":"The best, no joke, best Italian Sausage and spinach pizza in Montreal.  Montrealers all have their own favorite pizza joints, while those in the McGill ghetto rave about Amelios, by far  the best pizza you want, without having to sit down for  restaurant service and if you're on the go, is Pizza Mia in the Marche Atwater. Everything about their thin-slice pizza is perfect. Thin but strong, slightly crispy crust, flavorful sauce, better quality cheese when melted does not  form tiny pools of grease, in fact, just from the taste alone, you know they're using superior quality ingredients and that makes a HUGE difference.  Have a slice of this pizza, sprinkled with hot chili pepper flakes and you're good to go for the rest of the afternoon while you do your food shopping. But they just don't have pizzas here. I saw pizza pies, Calzones, fresh salads in the fridge, macarons and tiny cupcakes of all sort on the offering. You can take stuff to go or sit down and eat your slice in the tiny eating area they offer outside, along the window, or in the back."}
{"text":"Impressed... The pizza man himself came around multiple times while we were on the patio at Stacy's on Melrose. While we didn't have the highest of expectations for pizza being delivered to the bar. We were quickly impressed with how hot, fresh and tasty this pepperoni with bacon pizza truly was. Enough to ask the man where the pizza was from and to actually want to write this review. We all agreed that next time we go do Stacy's the pizza would be a regular part of our experience and even committed to going to the actual brick and mortar location if ever in the area."}
{"text":"Pizza Mia est bondé de gens peu importe la journée ou l'heure donc je suis surprise qu'il n'y ait pas plus d'avis que ça! Ils offrent de la pizza sous toutes ses formes: régulière, pan pizza, calzone, pizzarertta, carrés de pizza, etc. Elles sont toutes très bonnes et vous pouvez les manger sur place ou bien pour emporter. Ils ont aussi une bonne sélection de salades pour ceux qui n'aiment pas trop la pizza. Et la meilleure chose que cette place a à offrir: les macarons! Ils en ont de toutes les couleurs et saveurs possible. C'est une parfaite petite bouchée sucrée de bonheur juste après une pointe salée et savoureuse!"}
{"text":"They have the best pizza! The cheese is good and they're not stingy with it either. Way better than little cesars, pizza patron, dominoes"}
{"text":"My new go to place for Pizza, Spegetti and Salad, and I can't say enough about their Customer Service. On a 5 rating, I give them a 10!"}
