{"text":"Same experience as Weez.  Very Inconsistent but last 2 times have been like 90 minutes for delivery (The place is 20 minutes WALKING slowly) and a 5 minute drive.  The last few times have been the same story and the pizza was cold.  Waste of money."}
{"text":"I don't know why I walked by this place so many times without giving it a try. Now it is my fav pizza place in town!! Try the one with gorgonzola, so heavenly good...mmmm. Oh they have many veggie options too, big plus!"}
{"text":"They messed up our order and then argued about the toppings I chose.  I ordered a 1-topping pizza that comes with 1 topping. I chose olives for the topping. The guy on the phone tells me that \"1-topping pizza\" doesn't come with any toppings. Even though we both agree that the receipt and order says \"olives\". Why would a receipt and order say olives if there isn't olives on the pizza?  They refuse to make any sort of amends for over-charging me.  Order from FBI pizza instead -- they are better in every way."}
{"text":"I have ordered on two occasions (via Just-Eat.ca) and I am happy to say that I have no complaints. The pizza is delicious and on both occasions was delivered fast and ready to eat. Our first order was a 'Create Your Own Brick Oven Pizza', and we were pleased with the variety of toppings offered with the price listing. Our most recent purchase was 'Al's Favorite'  was flavorful and not salty (due to the bacon and feta chese topping)."}
{"text":"We had our second and last experience with Pizza Flora tonight. Both times with their delivery. The first time we waited for two and a half hours. This time it was only two hours. The person at the restaurant was no help. They quoted us under an hour when we placed the order. When I called back after an hour and fifteen minutes they said the order was ready and that it was going with the driver right then. When I called back after another half hour they said they'd try to get in touch with the driver but couldn't seem to reach him. They said they'd call me back. I called back after another 15 minutes but no one answered the call. The driver when he arrived said he had left the restaurant with the order only twenty minutes before. The food itself was tepid, tasteless and straight out of a package. There was no cheese for our pasta. No cutlery, napkins or condiments. Hunger is the best sauce but it was still disappointing. We will never order from them again.  Very annoyed."}
{"text":"Good, cheap Italian-style pizza with about a billion different topping combos to choose from. The buffalo chicken is really good. If you're ordering by the slice get whichever one came out of the oven most recently - it really suffers from sitting under those heat lamps.  Pizza Flora is my favourite walk in by-the-slice place, and for pizza night at home, if it's not half-price pizza night at Amicos on Queen (Wednesdays!), Pizza Flora is my go-to place."}
{"text":"Delicious pizza!!! I always get the margarita with garlic oil on it. I order extra pizza sauce on the side which makes for a yummy dipping sauce. The garlic knots are great too, and the Cesar salad is decent.   I've walked in and had a slice and it doesn't taste as good as if you order a whole pizza. The one criticism I have is that they close a bit too early during the week and on the weekend... About 9:30pm. They should at least stay open until 11pm on weekends. They would make so much more money!"}
{"text":"A great local independent pizza shop. This is our go to pizza place these days. The pizza has a nice thin base that gets floppy from all the toppings they load on and a thick doughy crust. Delicious!  Their extra large, for $20 is big and perfect for a feeding a party. Free delivery for orders over $15 and if you're hosting something where you  need pizza for a specific time, they are more than happy to accommodate (like Superbowl halftime).  The place feels family run with a few people hanging out at the tables near the counter anytime you walk in. Speaking of walking in, this isn't the kind of place you really want to eat in at. I mean if you're just grabbing and going, maybe, but my recommendation would be to stick with take-out.  Anyway, check it out. Pizza Flora makes a good pizza."}
{"text":"This replacement for Papa Zee's Pizza is no better.  Five dollar slices of cardboard.  Sorry, but true."}
{"text":"Two words: Lasagna Pizza- get this. Also, the wings are big and really tasty. Throw out those other pizza flyers and give these guys a call."}
{"text":"I've been here twice in the last month and overall I'm digging it.   I went for a slice the first time and it was alright. Nothing special. A couple weeks later I went and took advantage of their large pizza walk in offer and I dug it. The crust was thin and crispy. Sauce tasted good, pepperoni was good, all around decent pie for a good price.   It's not a gourmet pizza by any means but there's 1000 other places you can go for that instead. It seems like an old school place where you're gonna get a decent pizza for a decent price."}
{"text":"Inconsistent.  I would have given this place four or five stars before. The first two times we ordered food from this place, everything was fantastic. So last night we ordered from Pizza Flora that third time, the proverbial charm, the one that would have cemented it as a great neighborhood pizzeria.   The first time I ordered the Parmesan Garlic Wings they were crisp and delicious. Last night they came sitting in a container with 1/2 inch of grease pooled in the bottom of it which had oozed out over everything else in the bag. Yuck. Slimy, oily and lukewarm with flabby skin. Whoever was responsible has no idea how to cook and serve bone-in, skin-on chicken.   The first time I ordered the Garlic knots they were absolutely delicious; so good, in fact that the next time we got a double-order.  Yesterday night they weren't fully baked all the way through so the middles were doughy and inedible. Luckily we only got a single order this time.   The last two times we got pizza delivered it was really good. Last night the toppings were still nice, but the crust was limp and soggy. I like my pizza with a thin crust that is crisp on the bottom and has some bite to it. This had the texture of wet Wonderbread.   We did reheat the pizza which improved the crust immensely, and likewise the garlic knots got better after we reheated (aka cooked) them too, but seriously: I ordered from a restaurant to have someone else prepare my meal. I didn't really want to turn on my oven and bake my own food in 30-degree humid weather, nor should I have had to.   It's a shame really, because this place seemed very promising less than a month ago."}
{"text":"Ordered a pizza from Pizza Flora tonight. The delivery guy didn't open the box to show it to me, so I didn't see it was completely burnt until I sat down to eat it. And I mean burnt...not just a little crisp.  I phoned to get it replaced and was told they would send another one in 30-40 mins.  NEVER CAME! I'd definitely like my money back. And I'm not ordering again."}
{"text":"I have been in there many times over the years, and was in there today, but it looks like it's changed owners, there is all different people working there now. While I was there, I got the chicken parmesan sandwich, and was in there for 40 minutes and the slices that were there when I arrived, were still untouched when I left, so how old are they? The sandwich was OK but it somehow lacked taste, it needed garlic and salt, I went to put some parmesan cheese on it and the the container was all dried up and empty and it looked like there was something in the bottom, I couldn't tell what....  I'd noticed for the last two years that the store and the windows had gotten dirty and the bathrooms are really disgusting, now the store seems cleaner but the product isn't as good.  It used to be better there.  Check in on July 28, 2016; the last time I go there, slice was like warm rubber, no sauce, no flavour, the crust is dry and leathery and the cheese isn't melted and has no taste. Like it had been sitting there for hours and hours.   Funny, the place used to have families and quite a few people sitting down, now you go in and it's empty,  They are serving  slices for 14 year olds coming home from school.   I will never go again."}
{"text":"This was our favourite go-to pizza place in the neighbourhood. I really liked the fresh vegetables like spinach on the pizza, the thin crust and the really fast delivery. However, last week we ordered our favourite and it seems like they changed the recipe! No more thin crust! It  was quite disappointing. I hope they go back to what they used to do. Otherwise, I'm going to have to order from the other places in the neighbourhood with thin crust... UPDATE! They changed the crust back! YAY! So 4 stars again!"}
{"text":"I was totally surprised to find in this unassuming joint the best slice of pizza I've had in a very, very long time.    Perfect crust was thin, crispy, light and fluffy at the same time. Not so sturdy at the vertex, so I forked and knifed it.   The tomato sauce was fresh and sweet tasting.  Cheese was mild, fresh and tasty and had perfect goo-factor.   All of this was probably helped by the fact that the pie was just out of the oven, so I do admit part of my enjoyment can be chocked up to good timing.  I had the Toscona ($3.99) which was topped with mushrooms, roasted red peppers, a touch of blue cheese and some other stuff. I don't even know, just good stuff. To top it off, they drizzled it with really tasty olive oil before they served it .  The prices are on par with fast food joints that serve cruddy 'za, so for the amazing quality you get I'd say Flora is absolutely a deal."}
{"text":"The quality of the pizza is very good for its price. Good attendance, we could choose four different flavours for a large pizza, but as we wanted 2, they made a discount. Very nice from them!!!"}
{"text":"We ordered two vegetarian pizzas via Just Eat and loved both! Will order again. It arrived quick and we devoured them."}
{"text":"Inconsistency must be the name of the game for yogis place. I had a slice that looked nothing like these other pictures people posted. Had no taste, cheap products and nothing good about the slice."}
{"text":"Let me start off by saying that I am a strong supporter to small businesses and am extremely loyal and faithful to the businesses in my Roncies community.  I have been ordering from Pizza Flora since they first opened in my neighbourhood.  When they first opened, the pizza was great.  The Italiano was always a personal favourite.  Unfortunately, the last 5 times I have ordered, I have been extremely disappointed.  Yes, I have given them an extra 5 times of dissatisfied service.  From getting extremely undercooked pizza, to taking a long time to get delivered, tonight was my final and last attempt at being their customer.  I placed an order at 6:45 and was told I would receive it by 7:30 p.m.  At 8 p.m. I called, only to be told they made me the wrong pizza but I would receive it within 5 minutes.  I received my order at 8:30 p.m., without so much as an apology.  I'm sorry Pizza Flora, but you have exhausted your chances with me.  As much as I love to support this small and independent neighbourhood pizzeria, I unfortunately will have to reconsider where I get my pizza next time.  Sadly, it will not be you."}
