{"text":"Pjays is the best hidden gem in Scarborough for Jamaican food! Fave items: ox tail with rice and peas, beef patty and chicken fricassee."}
{"text":"Best spicy beef patties. Spice is just right, pastry isn't too buttery. Sooo good."}
{"text":"Sketchy building but delicious beef patty, spicy enough, and piping hot. Tastes like it was made with love. Caught us off guard how good it was."}
{"text":"This place is hidden but it's one of Scarborough best kept secret. This food is real authentic jamaican food.  Their prices are so great and reasonable. I got a large box of half oxtail with curry goat and rice and peas with coleslaw for $12 flat!! Amazing deals in there,  the food is so amazingly good and authentic. This is coming from a jamaican born and raised in jamaica.  Trust me, find this place and you're happy you've found it. It's right after  huntingwood on Kennedy north.  Great little spot. Oxtail is so juicy and tender and full of rich flavour.  Will go again forever, highly recommended spot."}
{"text":"I love the foooodd here!! My boyfriend ordered just the Jerk chicken meal which was $10 for a large takeout box (great deal if you ask me)  I ordered the ox&chicken meal which was $12 for a large!  !! AND YUMMMMYYYY!! I couldn't finish it all so i had to split for dinner aswell!! BUT I'M COMING BACK FOR MOREE!!"}
{"text":"The best patties I've ever eaten. Thin crust, juicy meat filling. Better than patty king, michidean, tastee's, etc. oxtail very good, curried goat could use more sauce and spice. Come here and eat patties. I'm glad they don't offer mild!  ;)"}
{"text":"This tiny hole in the wall joint in Scarborough has zero seating, as emphasized in their name, but serves up some seriously delicious food. Curried Goat, Ox Tail, Stewed Beans and fresh made patties, it's worth the drive. Please note its cash only."}
{"text":"Wow. What a fantastic meal. As others have already pointed out, it is a hidden gem, tucked away in an unassuming strip mall past Huntingwood. I got the mixed dinner combo (oxtail and curried goat on top of rice and peas with a side of slaw) and added a jamaican patty on top of it - which are Randy's patties I believe and was delicious btw. I was hoping to buy an imported ginger beer to complement my meal but unfortunately they dont carry it anymore.  My meal came to around $15 and it was absolutely glorious. It is truly only a take-out joint, so no seating. I will be returning way more often since it is within short driving distance of where I work.  Highly recommended place!"}
{"text":"You could walk by or drive by P Jays and never notice it. It's located inside an alley in a small plaza on Kennedy Rd just North of Huntingwood Dr in Scarborough. It's really unfortunate because the food is really good authentic Jamaican food.  I ordered a small jerk dinner meal ($8.75 tax included) with rice and peas with oxtail gravy over it. The chicken was fantastic, perfectly done skin and seasoning and the meat was tender and juicy. The rice and peas were nice and moist and the oxtail gravy was rich and flavourful. The plantain was also really good. The only thing that wasn't too good was the coleslaw which wasn't creamy enough.  If you are looking for good authentic Jamaican food in upper Scarborough at a reasonable price, definitely try out P Jays."}
{"text":"P Jays is hidden.  Even all these years that I've driven on Kennedy road.  The tiny undesirable plaza it resides doesn't appeal to too many people as you see the barebone convenient store, a few chiropractors, an office here and there and less than a handful of take-out restaurants.  P Jays is hidden as it doesn't face directly from the main Kennedy road.  You have to walk-thru an open internal pathway and during dark nights it can be your trial-runs for the true ghetto-ness of more southern regions of Scarborough.  P Jays closes roughly 8pm, so it'll never get dark enough but there might not be too many souls around if you travel alone.   3.5'd  Definitely the typical west-indie carribean take out shop setup: old-school analog register, fridge full of west-indie beverages, a basic handwritten blackboard menuboard, swing-door leading to the kitchen, and the hot pepper sauce bottle next to the register.  Same old same old.  Mix(2 choice of protein $11.00 tax included)  -    From a choice of Oxtail, Curried Goat, Fricasse Chicken, Jerk Chicken, Stew Peas(Fridays only), I got Jerk Chicken & Curried Goat which came with Rice & Peas, Slaw and a couple pieces of Plantains.  Curry Goat has good overall spice flavour not too overwhelming while the meat is tender enough without falling apart on it's own.  The Jerk spice on the BBQ Chicken was just as good and the Chicken was BBQ'd nicely.  Slaw is a-ok'd.  Small complains making the meal hard to chug was that the Rice & Peas were quite mushy.  Secondly the Jerk Chicken was chopped into 3 pieces which created some miniscule bone shatters, so please do not chug but rather chew carefully.  Enjoy.  Ting's brand Old Jamaican Ginger Beer($2.00 tax included)  -  This is a Jamaican brand Ginger Beer but tasted more like Lemonade sweetness with small hints of Ginger kick.  Unlike the ones I've had before where it has enough kick to make Scotch Bonnets feel weak.  The sweetness and fizz definitely makes this a Ginger Beer for the uninitiated."}
{"text":"Best beef patties in town! I have been going to this place for over 5 years and have no regrets or complaints. It's nothing fancy in terms of decor or location but it's cheap and hits the spot."}
{"text":"Terrible food came here once never again waste my time ate a few bites of their jerk chicken threw it out and instead went to chris jerk. The chicken was old and dry their patty was okay. The rice was soggy and flavorless. Would not recommend the 4 stars duped me into coming and spending my money here."}
{"text":"Mmm... I recently came back and tried the ox tail. The ox tail sauce is perfect with the rice and peas."}
{"text":"This place is my first experience with Jamaican food.  I first tried their jerk chicken with fried plantain, and I loved it.  The chicken is juicy and tender.  I tried a different thing each time, and nothing had ever disappointed me. Their menu is small and you can try them all in one time if you are throwing a party : )  Their veggie patty is yummmm!! ^^ The jerk chicken is better than those I had in Jamaica. I'm glad that I had given P Jay's my \"first\" ^^"}
{"text":"I couldn't wait to write this review after finishing my meal. It's hard finding a place that serves up top quality oxtail. I have had my share of oxtail and most places serve them overly salty or the meat is overly fatty with very little meat. Not P Jays though, its done perfectly here. For $12 you get a whole lot of fall off the bone meat, rice and peas which is nicely sauced up so its not dry, a side of coleslaw and finally a nice caramelized plantain which really surprised me (5 Stars).  I also tried the beef patty and it was pretty good. Flaky crust and moist meaty center (4 stars)  Just like others have said this place is really well hidden. As you drive by you won't find any signs and even if you try using street view on google maps it will not reveal anything. You have to walk into this tunnel-like area to find this place.   4.5 stars"}
{"text":"Scarborough is such a great foodie heaven.  Some of the best foods from all nationalities are found here and P Jays is no exception.  P Jays has been here for a long time and its been a few years since I've been here to my dismay as they make some fantastic Jamaican fare.  Located in a dying old plaza where most of the stores have closed, stands a gem where some delicious oxtail, curried goat and jerk chicken and pork are made.  The menu is limited but the stuff they do make is fantastic.  I ordered a mixed combo entree of oxtail and jerk chicken over rice and peas accompanied by fried plantains and small salad.   Dang it was freaking delicious!  The oxtail was ultra tender and the jerk chicken full of flavour over the rice and peas.  The meal brought back many memories of my high school and university days...sniff:)  The place is really tiny and there are no seats so its definitely a take out place.  They also sell patties but I forgot to ask which brand they carry now as they use to be Randy's Patties.  Its almost impossible to find as the signage is almost nonexistent so keep an eye out for the old plaza.  Trust me, once you find it your taste buds will never forget again:)."}
{"text":"Overall the food was really good! The Rice and Peas with gravy amazing!! Not giving it 4 stars because of the price... Paid $29 for 1 small jerk chicken dinner and 1 medium oxtail dinner and drinks.  Given these were small take-out containers... we both felt it didn't deserve 4 stars.  Jerk chicken and oxtail were both good, however my brother and I both felt the Rice and Gravy were definitely above average - mostly the gravy tho.  I wouldn't mind coming back again, even tho it was expensive.. but Chris Jerk is still my first choice this type of food. In my opinion, better Rice and Peas, better oxtail, and cheaper price...  No recommendation from me, but would return."}
{"text":"Drove here after seeing tons of rave reviews. I expected a store like Chris's but it was a significantly smaller store with no seats at all.   Upon arrival, I noticed that the kitchen is in the back with no display of any sort of food except for patties in the front. It gave me a very \"ghetto\" vibe, like I was ordering from some secret underground store that was banned from selling food.  I ordered a large oxtail after seeing one of the Yelpers below with a picture that looked decent. It's cash only. I paid and asked how long of a wait it will be. The lady gave me a funny look and said it won't be long. I was expecting Chris's wait time - 10 minutes ish. But she was out with my food in less than a minute.   I went home with the food and sadly, i noticed that it was in those small sized containers, contrary to the Yelper's oxtail photo below which had her food in the larger container. The oxtail was tender but 99%bones, the rice was nasty, and the portion was way too little for the price I paid, especially for a takeout place.  Felt slightly scammed and upset. If I were in the area, Chris would be my default choice. Food is fresher, people working there are much nicer, and you pay for a portion you'd be surprised at."}
{"text":"My favorite place for ox tail! I've tried most, if not all, places that offer ox tail and P Jays take out is by far the best. Their ox tail is meaty and big. Other places have ox tail that is small and bony which makes it exhausting to pick out and eat, but this place doesn't. Also, the meal comes with rice or rice and peas, plantain, and coleslaw. The plantain is amazing with the ox tail and usually comes with two pieces. Service is pretty fast. The price for a large ox tail meal is around $14 and a small is around $12.  You have to try this place at least once if you like ox tail."}
{"text":"Truly a hidden gem in Scarborough, both literally and figuratively. Tucked away in a random plaza with empty storefronts around it. Been going here for the curry goat and oxtail for years (the plantain is ). Then this year a friend mentioned that their patties are the best ever so gave that a try, too. Did not disappoint! Really juicy and flavourful inside. Bought a fresh one to go ($1.75) and a box of one dozen frozen ($16). Such a great spot for Jamaican food!"}
{"text":"When I crave Jamaican food, this is the place I think of! The Jamaican food here is sooooo good. This is definitely a hidden gem in Scarborough, tucked inside a small empty plaza. It's a small store that focuses on the food.   I ordered the chicken fricassee and the ox tail. The meat is so juicy and tender, it just falls right off. It is also saucy and full of flavour, and comes with 2 sides, the plantains and the rice and peas. The plantains are the best!!! I've never tasted anything like this. Sadly, you can't order a whole box of these, which I wish they had because I can just eat this for an entire meal.   Tip: Go early! They ran out of the rice and peas and the jerk chicken...which I've also tried and loved. They also make amazing patties."}
{"text":"Small hidden gem. I've only had the oxtail and it's always always blessed! The only thing is they don't have pepper sauce :("}
{"text":"So I just went to pjs and I ordered 1 large oxtail and 1 small... the small had more oxtail than the large... not happy about that and it was flooded with gravy"}
{"text":"I hate using cliches so calling a place a hidden gem generally makes me cringe, and although this place is not really a \"gem\", it is no doubt hidden. Although bookmarked since forever, I've never really had the time nor the energy to look for this place so when I chanced upon it when I was visiting this plaza, I was uber excited. My mother was complaining about me walking around the plaza and not going with her straight to the doc's office, but wandering sure has its rewards.  I ordered a small take-out oxtail with rice and peas and a small take-out jerk pork with rice and peas. As another reviewer said below, the rice and peas are a bit mushy, but i do think they taste the best this way. The jerk pork was definitely not as good as the jerk porks I had in Jamaica - not as tender and not as juicy. But the oxtail and its gravy were mouthwatering good - just writing about it now makes my mouth water.   It's not super cheap at $9 for a small (including tax) but the portion was more than i can handle though my brother says a small would not generally be enough for him. So together, two smalls was enough for the two of us.   Don't get me wrong: although it's not a perfect place with every facet and every dish being 5 stars, I am still giving this a five-star rating because it's not easy finding Caribbean food this good in this neighbourhood."}
{"text":"Totally a hidden gem. Oxtail was delicious, jerk was delicious. Their food has so much flavor, it's never over-salted and always tastes fresh. My only wish is that they served plantain as a menu item (they cook it to perfection!)."}
