{"text":"Seriously impressive. The menu offers a good selection of foods and it tastes amazing. You have to try the smoothies."}
{"text":"Cute plant based local restaurant. Great deserts and meatless burger is a must. They have a different menu everyday so make sure to follow them on Instagram or Facebook."}
{"text":"Will and Tina are among one of the most down to earth owners. The display of their restaurant conveys minimalism and simplicity for the mind and for their food. I had the butternut squash Mac and cheese, which is something I strongly recommend. It's the perfect evening comfort food. Make sure you ask Will or Tina for some of that amazing hot sauce. The Mac and cheese was rich and creamy; most importantly, filling. I also had the cheez burger. Looks simple but packs a lot of great flavors for a good night meal or snacks. I've been vegan for 4 years and I'm from SoCal where there are so many vegan restaurants. Plant Powered Prep is definitely on the top of my list when I visit Arizona again next time. Thank you Will and Tina!"}
{"text":"I love this place, too. Much needed healthy prepared food and drinks. Though vegan, the curry bowl was awesome and filling. I didn't miss the meat. It's called \"Plant Powered Prep\" and came up under juice bars and smoothies so I was expecting greens, beets, carrots, cucmber, ginger, etc. on the menu - especially from vegans. The drinks were both good and healthy though.  When greens (plants) are added, I'll come even more!"}
{"text":"Makes my life so much easier!! I go in before my 9 year old son and I train, get our dinners and then I don't have to stress about what I am going to feed him after we work out! And I know it's healthy and better yet, it's tasty!! I have had a lot of vegan plant based foods out there. They don't stack up to PPP! Other places take out the animal products and it seems the flavor too! Not here!! Will knows what he is doing! PPP has been such a lifesaver for this busy single mom!! Don't believe me then check it out yourself!"}
{"text":"OK so I'm a driver for Fedexfreight and I try to eat as healthy as I can to stay in shape for my job when my customers had recommend me to this place I met the owner will and I am going to tell you I went on an experience of a lifetime that foodies wish they could only do Will thank you so much and you will see me soon variety of foods surprisingly not a single one of them has meat I highly recommend that you go by and see what he has in the ready to go section and give it a shot the prices are right and just the fact that you can put something in the microwave and not worry about prepping it like hello fresh is awesome thank you Will I greatly appreciate the fact that you have a business like this"}
{"text":"Will and the crew at PPP are doing it right! The smoothies are fantastic and the meal prep options are great! It's 2018 and quick access to delicious plant-based meal options is more important than ever.  Check them out if you're into that sort of thing or if you're looking to integrate some healthy lifestyle changes!"}
{"text":"I decided to try Plant Powered Prep for an overall introduction to healthier meal habits.  I love the whole concept.  Fresh, clean, vegetarian meals, simple, clean design and excellent customer service.  I order 6 meals at a time and eat them as my large meal of the day, for the week.  The food is fantastic.  I never thought I could eat Vegan meals, but honestly there is so much fresh flavor I do not feel like I am missing anything.  I do not feel weighed down after I eat and I know I am treating my body right.  The owner, Will, is a wealth of knowledge and has helped me to understand how different foods can benefit my well-being.  This place is a gem."}
{"text":"Picked up our 1st order last evening and already planning to place another order this Friday! The serving sizes are nice, flavors amazing and everything is fresh. We ordered 16 meals x 4 options and will do this again. Great value and easy way to eat healthy and cruelty-free."}
{"text":"Really wish I lived closer! 100% plant based goodness. This is such a perfect place for busy individuals that are conscious of the food they consume.   I came here a while ago and we tried the pitaya bowl. Bomb! My kids loved it.   Now, I finally made it back to try the food. We got burgers and tacos. So good. The pico and guac on the tacos were so fresh and flavorful. And my kids loved the burgers. I should've tried one of the dinner plates, they have them premade in a fridge ready to grab and go - definitely will be trying next time.  Cute set up. Very clean, simple and inviting.   And the best part of it all - the owners are awesome! You can tell they really care about their customers and are very passionate about what they're doing.   Will definitely be making the drive over here on the nights I don't feel like cooking."}
{"text":"Love the tacos! Best tacos I've ever had. Curry bowl is great too. Nice clean place - I'll definitely be coming back for lunch here more often!!"}
{"text":"Great concept. Good healthy solutions for those too busy to cook. They also have options available for stop ins."}
{"text":"I wish I could add an extra star on yelp for this review. PPP is fantastic. There food is fresh and delicious, with flavors and taste that aren't readily available in many restaurants in the valley. Will, one of the owners, is always welcoming and extremely knowledgeable on their products as well as Plant based cuisine as a whole. I will definitely be using them frequently as their service has simplified lunch and dinner for me and helped me shed a few extra pounds in the process."}
{"text":"Stopped in today and met William and Tina, great people! Love this concept and the community needs healthy and convenient options like this one. Tried the Curry bowl, very good. My son had a mango smoothie, he loved it. We are trying the six meal plan to start. Very excited to pick up our food next week!"}
{"text":"I recently returned to a plant based lifestyle and have been searching for locations in the East Valley that provide quality food quickly for my busy lifestyle. I stumbled on this gem of a place! Owners are very nice and the food is delicious. I immediately texted my wife to tell her I found our new favorite vegan place."}
{"text":"om nom nom!!! I've been vegan for close to a year now, PPP has made it that much easier for me to continue on this path. Meal prepping for me has always been a challenge on my weight loss journey. With ready to eat delicious vegan meals, being vegan and losing weight has never been easier. And did I mention that the food is absolutely to die for? I will absolutely be recommending Plant Powered Prep to EVERYONE."}
{"text":"Love the concept but there's a lot of room for improvement.  I ordered the 20 meals to split with a friend.  Would have been nice to be able to select 5 different meal options, 2 of each, to make it easier to split.  Also comes with no re-heating instructions or ingredient/nutrition list.  I'm trying to track what I eat and it was impossible without knowing ingredients and quantities.  If you live near the store, the twice weekly pickups are no issue, but it would be nice if they gave people out of the area more options that didn't align exactly with rush hour traffic.  Finally, and most importantly, the meals I ordered were incredibly bland.  I don't believe they were seasoned at all.  The price per meal was reasonable, but I won't be back."}
{"text":"Just Capital WOW! Sooo sad this place is a pretty good distance from me but you bet ya I will be back!! This place is mostly a meal prep place but has a few things you can order on the menu to eat there. My husband and I got the tacos and cheeseburger....... woahhh the Tacos were unbelievably fantastic! I couldn't stop talking about it every bite I took. I don't care if your vegan or not this is a top best taco I've ever had! The cheeseburger was very simple but flavorful. It was so good that we couldn't leave without buying a weeks worth of meals and a few extras to go!   Thanks guys!!"}
{"text":"For a busy mom and fitness instructor always on the go, I love the different food options, peace of mind knowing that I can still eat clean and healthy without sacrificing taste. Plus it's vegan and longer lasting in my fridge. Not that it does cuz my family eats them as soon as we get them. Even if you're not a vegan you'll love and appreciate the care and time they took for each meal to be prepared and seasoned.   Not to mention I love the express model where you can hop in and pick up a last minute dinner( if there are any left).   I will for sure continue to use plant powered prep as a part of my weekly food prep and incorporate it into my eating plan."}
