{"text":"Place is clean and nice inside. Help was very nice. The subs are another story. Meat is measured as per other toppings and bread is very soft. Overall quality of meat is sub-par no pun intended. Therefore 2 stars for help and inside interior."}
{"text":"I would give a zero star if I could.  No bread?  Really?   This is what you do.  You make sandwiches on bread."}
{"text":"I've been there twice and there was HAIR IN MY FOOD BOTH TIMES! Super Gross! And the guy who took my order was fairly rude (felt like we were interrupting his day!) I am never going back and you shouldn't either!"}
{"text":"Took my family for lunch today! Great menu with a nice variety for everyone. We loved their sandwiches especially the bread! My son got the super hero which is an Italian style sandwich that is spicy. He loved it.  I got the turkey and added guacamole instead of mayo which was delicious.  My husband  enjoyed  his  Greek salad and my 4 year old said her kids ham sandwich was the best sandwich she has ever had.  So glad this opened in my neighborhood and we will be back again soon. Nice friendly service too!!!"}
{"text":"Planet Sub is amazing and definitely my favorite sandwich shop on this side of the valley. The staff was fast, friendly, and helpful. I ordered the Buffalo Chicken sandwich and it arrived fresh and perfectly toasted out of their oven. I'm not typically a bread person but theirs is by far the best I've ever had and it made an already great sandwich incredible. Literally everything about this experience was fantastic. Highly recommended!"}
{"text":"My favorite sandwich shop! The bread is so fresh and delicious, service is fast and friendly, they even checked up to make sure everything was good half way through our meal. Putting cream cheese on a sandwich is a revelation, and planet sub pioneered it. Do yourself a favor and eat here. I got the Experience and my boyfriend had the buffalo chicken and both were incredible. I can't say enough good things about planet sub!"}
{"text":"Great customer service, sub selection is amazing! The bread is nice, soft & light it's perfect for sub where you're not full on bread.  The ingredients are fresh and make nice blend like their Creamy Club is delicious.  I would totally recommend this place."}
{"text":"I don't think I can say enough good things about Planet Sub! My coworkers and I started going to the first AZ location in chandler years ago! We were so excited that one opened right down the road from our office! The food is always great and never disappoints. The staff is great too, friendly and fast! Keep up the good work PS!"}
{"text":"My wife and I tried Planet Sub for the first time tonight.  I ordered The Experience and she ordered the Chipotle Wrap.  We paid for our order and about 5 minutes later the manager came out and informed us that they were out of tortillas.  He offered to make it as a romaine wrap or to upgrade to a full sub, so we took the upgrade.  About 10-15 minutes longer and he brought our subs out, apologized for the wait, and gave me a card for a free chipotle wrap on our next visit.  The food was amazing and I was appreciative of the manager going the extra mile to make sure we were happy customers who would come back again and again."}
{"text":"rude customer service, I personally saw rude behavior from the staff towards a client.... long waits, forgetful of requested items.  Unfortunately not a place I recommend."}
{"text":"Great place with great food. The folks running planet sub are super friendly and get your order out fast and hot. One of my favorite sandwich shops."}
{"text":"My husband liked his turkey sandwich but he felt the bread was a little dry. I had the Oven Roasted Turkey with Bacon, Cream Cheese, Sprouts, Tomatoes, Mayonnaise. I thought mine was pretty good. I ate half then and finished the rest the next day, and the bread was still soft. I'd like to come back and try more."}
{"text":"Ordered from here using Uber eats, I ordered the \"Green Turkey\" without the salsa and my boyfriend ordered the \"Chicken Club\"
Our subs arrived hot and fresh. The cream cheese and guacamole on the Green Turkey go so well together, my sub was truly delicious. We both enjoyed our food and would order from here again."}
{"text":"This place is great! Whether you're full carnivore, vegan, vegetarian, gluten sensitive, and love great food - this is your spot! The pricing here is amazing as well. 

I had the Tempeh BBQ sandwich (soooo good). My wife had the Chicken Parmesan (she loved it).

We will definitely be coming back regularly!"}
{"text":"Just got here at 3pm after lunch time.  I'm the only one in here and every table but 1 is dirty. 
The one I sat at seems like it's going to collapse. I think this place is fairly new. Surprised the table is already broken.  Sub just came out.. pretty quick.. hot pastrami.. just so so.. meat seemed microwaved a little too long."}
{"text":"We've been a few times and it's always good the Italian sub is my all time favorite.  Seems clean and staff is nice.  I would say try it for yourself."}
{"text":"Come here twice a week consistently! I never thought a sub place could be all that different from another but Planet Sub introduced to me a sub called the experience. So good! And not like a typical sub. Also not a bad price either. Ingredients always seem to be fresh and a lot more satisfied than subway. Thanks guys"}
{"text":"I ordered the Planet Sub since it was my first time here. Found the half size (6 inch) to be very filling for the size. Also, they toast the sandwiches (or you can have cold) and I found it very tasty. Great value and great taste."}
{"text":"I wanted to love this place.  Tried the $3.99 1/2 sub special today.  The Green Turkey almost made me ill.  Hot guacamole?   Never.   Add it after the sub is baked.  Then the Planet Sub house sand which was very bland.  Service was slow.  One and done."}
{"text":"Positives: the subs are good and the employees are nice. 
Negatives: we were the only people (2 adults and 3 kids) in the restaurant at 11:30 and it took 28 minutes, yes 28 minutes for 3 sandwiches. All the customers behind us it took over 20 minutes. The manager came over and apologized, gave us his card for free sandwiches. Several guest left when they saw the wait.  $31 for 1 small sub, 2 big subs and 2 drinks. They also didn't make my kids sandwich correct but there was no way I was waiting for another. 

I could be far more understanding if they were busy but we were the only people. They had one person running between orders and making subs. Later a manager came in and still only had one person in the front and an employee in the back. 

Unfortunately I think the time to service will impact their business. Nice people, but obviously something is way off regarding how they run their business. You could eat in a full service restaurant for about the same cost and time."}
{"text":"Decent place. I was surprised they had tempeh. Very easy to get yourself a vegan sub. My bf got the experience & wasn't too crazy about the chipotle sauce but he said he would try again. The girls working there were very nice & we even got free bags of chips with our subs. I personally would go back bc in Gilbert they don't have a lot of casual vegan friendly restaurants."}
{"text":"I've had two sandwiches in the last two weeks and I'll go back again. It's not as good as Capriotti's but better than other chain sandwich shops."}
{"text":"We have been trying different sandwich places lately. Planet Subs food was very delicious. The made my sandwich to order and they were very quick about it. The were very friendly.  My only concern was that there were no shades on the windows. It was very hot in the building."}
