{"text":"I have been there a few times to try their drinks.  I love their variety of teas and you can have it hot or cold.  They are not your typical starbucks tea drinks."}
{"text":"Taste, customer service, atmosphere are all 5/5 so but the price and location is not letting me give an overall 5/5..
Go if you feel like treating yourself a little"}
{"text":"Plentea's Thai Dragon is amazing! Watching the barista take the cardamon seeds into a mortar and crush it, just like I do at home, was immensely gratifying. Would recommend it with almond milk and on a cold windy day. The fact that each drink's spices are mixed-to-order and the prices are on par with others is impressive.

More bonuses: free wifi, great + quick service, neat layout."}
{"text":"So happy to have this new tea stop around the corner. My first drink was the Black Velvet and it totally hit the spot. Definitely going to be a regular"}
{"text":"Amazing tea service knowledge and execution of formulations! As an avid tea drinker, well worth the drive from downtown Brampton to Plentea"}
{"text":"Fantastic customer service, the owner provided several recommendations on their tea lattes and everything we ordered was a hit. The flavour of the drinks were all on point in the way the owner describe to us. The black velvet was bold rich and flavourful while the Thai dragon with the hint of coconut made it so soothing and refreshing."}
{"text":"Great place! I tried the berry tea and rooibos latte. Husband had a coffee based latte. Excellent espresso, locally roasted (forgot the name).
Apparently the black tea based drinks are fantastic, will try next time.
It's a minute walk from our house, excited about a good quality tea/coffee shop so close, hope it does well :)"}
{"text":"I absolutely adore this place!!  I'm very picky with my tea and coffee and I have rarely tasted so many options that I love.  I also have a sweet tooth and normally need to add sugar to my drinks -- but this place has crafted their drinks so well that you honestly don't need to add anything to them!

Love it!!!"}
{"text":"I live in the area and decided to pop in on a whim. The barista was very helpful, talking me through the menu and eventually helping me pick out a drink based on my tastes. I got the coconut oolong late with almond milk and I loved it. It had the right amount of froth and sweetness without being overwhelming. I will definitely be coming back to try out more of their menu."}
{"text":"The owner is too kind
He explained me most teas 
I chose black velvet that was also really nice"}
{"text":"This is a nice place in Parkdale. It is located at Dufferin and Queen West. I went to there by streetcar because I saw many good reviews here. I ordered Izu Green tea Latte. The tearista was very nice. She was explaining about how the shop worked and how I could order. The inside the decoration was nice. All of the place was clean. Bathroom was clean. It was stylish place. I really liked it."}
{"text":"I think this place is one of the best tea places in town. Make sure to ask for his special seasonal flavoured teas. The mixture of spices and teas creates heaven in your mouth. As for the items on the menu I really like tiger spice tea and the matte."}
{"text":"Maghrebi tea is out of this world. It had a nice mild minty/flowery taste. The teatenders are lovely to chat with. And most importantly, I had a quite productive study hour on a Sunday!!"}
{"text":"I ended in this little space simply because i needed to use the bathroom, but after a small conversation with the amazing barista, i end up buying an iced green tea with notes of lemon grass and ginger. The tea wasnt as good as the service. A real proof of how having amazing staff that love what they do create real value/money. 

They have nothing more than a davids teas except that barista made my day better."}
{"text":"They're tea aficionados here! Cool ambience, great tea. The location is a little out of the way but it's great if you're in the area."}
{"text":"I was walking down queen with a couple girlfriends and happened to stumble upon this place (so glad I did). The gentleman behind the counter was very friendly and helpful!!! I ended up getting the coconut cream tea. It was delicious. I can't wait to come back and try out more!"}
{"text":"The black velvet combined with a dark chocolate vegan bar hit the spot. Everything tastes great and the space is big and naturally bright with an industrial feel. Would highly recommend."}
{"text":"I am so happy that there is a trendy little tea shop so close to the hotel I'm staying at. I don't drink tea enough - I usually opt for coffee - but it is just so darn good.

Plentea is bigger than it looks from the outside, but not so big that you'll get lost from the counter to your seat. It's concrete walls are full of cute art and the smell of tea wafts toward you from wherever you're sitting. It's a truly delightful atmosphere to walk into. (Oh, and if you're looking for the washrooms, just go down the stairs until you can't anymore. I was a bit confused at first.)

I got the chai latte with soy milk - a recommendation from the barista and it was honestly the best chai I've ever had. It wasn't sickly sweet like a Starbucks chai latte, but it wasn't too spicy like some others that I've had. Just the perfect amount of both, especially with the soy milk addition. It balanced it out really well.

The barista was so friendly and chatty. I mentioned I was out of town and we had a good little chat about Toronto and Halifax and tea in general. I'm definitely going to try to get back there before I leave!"}
{"text":"One of my favourite coffee/tea places! I swear by their chai! I get it everytime I'm craving one, and they can make it with rooibos tea so its a decaf chai. Having chai in the evening isnt an issue for my sleep anymore :) yay."}
{"text":"I usually prefer coffee but I absolutely love the tea blends here. Plentea knows their teas! There is also an option to mix your own blend which is great if you know your own taste :D"}
{"text":"I seemed to have ordered the two drinks that everyone else is raving about and I suppose I can rave about it some more. We tried the black velvet and the Thai dragon. I loved the Thai dragon because it was like drinking dessert, rich and creamy with hint of coconut, enough to satisfy my sweet tooth. The black velvet, as others have said, is bold and equally as rich. There is a strong taste of cinnamon which next time I was ask for it to be a bit milder. But it was still delicious and I finished it with no problem.

The two guys working the counter were friendly. A customer walked in \"aggressively\" as though no one else was there waiting and they politely informed her of the 4 others in line presence.  It was a rainy Sunday and it wasnt packed, a few grab and go orders and some others doing work in the loft area where there's seating. We got a seat. The loft is very trendy but still cozy. I'd spend more rainy days there. 

I look forward to the summer and trying their iced versions!"}
{"text":"I came across this place this morning when going to a work meeting. I always say being a tea drinker in a coffee world is hard. I thought I was going to have to settle for mediocre tea at coffee time but found this gem. So amazing. I had the Thai dragon and fell in love at first sip. The staff was so nice and explained everything & made sughestions based on what I said i liled. I don't work close but will have to find a way to make regular stops here!"}
{"text":"Great place for tea drinkers. Modern space, clean, friendly service. Pumpkin tea latte was awesome!"}
{"text":"I was walking down Queen and passed this place. I looked in and was greeted with a wave - thinking to myself, \"do I know that person?\" I entered. Turns out I did NOT know the person, but I was happy to meet him. The owner of Plentea is kind, friendly and always up for a conversation. I'm an avid coffee drinker (black, espresso) and somehow he persuaded me to get a yerba mate. 

I loved it so much that I came straight to work and wrote a review on here... all while still sipping on this delicious, light tea. 

I'll be going back, and I hope you go too!"}
{"text":"They have an excellent selection of teas and tea lattes, and everything is made fresh, quickly and with a lot of care and passion. they also allow for customization which is always a great bonus. the biggest draw back is the lack of seats, which can be improved given they have a large area to work with."}
{"text":"Lots of choices ! The staff were super friendly. I loved that they shake thee tea w ice and strain to make an \"iced latte\", versus Starbucks who just loads the cup up with 90% ice.  Flavours were almost TOO strong - be prepared for a totally different tea experience than you're used to.  Nice clean space - a welcome addition to the area"}
{"text":"Great idea and new for the area! I'm very impressed with the layout and how big the space is. The variety of wraps is impressive and good selection. I like how they offer all there teas iced. I'm more of a coffee drinker so I grabbed their espresso and it had nice flavour and was an impressive size for the price! The guys who run he shop are very friendly and converaational and take the to explain the items to you. I definitely will come again for a lounging day where you have a variety of seating upstairs and large wooden communal tables:"}
{"text":"So I walk in and I'm expecting your typical tea shop. Wrong. They have various whole ingredients lined up against the wall, and I'm told they grind the ingredients and blend them to order. Love the concept as all the other tea shops I've been to have the tea blends pre-mixed in a container.  I hate that I didn't get their names, but the lovely baristas explained the tea process, and suggested a few popular options. I opted for the Chai Karak, which I would recommend if you're partial to bold, spicy south Asian flavours. The Karak blend includes cinnamon, cardamom, cloves and black pepper, and is prepared with whole milk. The black pepper is an unexpected surprise and adds such a nice kick to the drink. 

The cafe is a little out of my way but I would definitely make the trek out here to indulge myself once in awhile. Can you guys do me a solid and just move closer to the Harbourfront area??

Definitely would recommend, they've got several options for all types of tea lovers."}
{"text":"Everyone here was friendly and didn't mind explaining all the types of tea they offered. The wall menu decor was pretty cool. I ordered the iced Thai dragon, it tasted like a chai tea latte with cinnamon. The barista pours your drink right in front of you. I enjoyed their tea, as well as the atmosphere. I would return to try all the other flavors!"}
{"text":"Staff show their friendliness and knowledge about their teas by giving us a run through of the popular teas in the cafe. I had the pleasure to try the Peach Breeze and the flavor was dynamic and complex. The first sip I had was as if the tea did a flip in my mouth. The first sensation was sour then flipped to fresh minty ending with peachy sweet. A very fascinating and worthwhile experience. I definitely recommend anyone try this place out. The staff who were on shift this evening was enthusiastic about their tea and spread positive vibes. Upstairs has a few tables and the place was quiet when we were there. CHECK THIS ONE OUT!"}
{"text":"Oh boy, this place is excellent. Wow!!! Starbucks...move aside!

I had an iced latte in a day that was hot and humid so that I could cool down a bit. 
The coffee I had didn't need any sugar and for me, not to put any sugar in my coffee here in Canada, is a rare thing.
People here has a different taste when it comes to coffee: very strong that mostly leaves you with an after taste of burnt coffee beans.
Personally, I'm more on the roasting type where the beans instead of coming out black they are dark brown. 

So, here at Plentea, I found the coffee to be an absolute pleasure.

Staff is great, very friendly and knowladgable of their product.
The ambiance is very industrial and the operating hours are fantastic.

My next visit will be for what this place is famous for: tea. It appears that they have a tea sommeliers on site. Their concept of tea is based on fresh organic teas, mixed in front of you,  hand ground and then brewed with either water or sweet milk.
The guy on shift today recommended to go for a Thai Dragon next time I'll check in.

Definitely I'll be going back."}
{"text":"Great spot to chill or work.  The owners are super nice, the teas are all interesting and I've never been disappointed.  They'll recommend something to you based on your tastes. Great local spot!"}
{"text":"My new favourite tea spot! Way better quality custom teas compared to David's tea or Starbucks for a similar price. I had the black velvet latte with almond milk which was smooth and creamy, spicy and gingery. The staff is very knowledgeable and take the time to explain the process and the teas."}
{"text":"A great spot for tea lovers! 
The barista was very polite and helpful. Asked about what kind of tea I liked before recommending one, and it was a good choice. There are some snack options too, if you are hungry. 

There is a cozy work space upstairs with a couple of large communal tables and lot of light."}
{"text":"I didn't really interact with the teatender bc I ordered from Ritual to collect points, but I sat at the high tops by the window and all the interactions they had with other customers were very very nice! They didn't just give the \"hey, how are you? Good, cool, what do you want?\". They genuinely ask about people's day, what they're up to and really tried to fit people with a drink to their described wishes. People were also waving in from the window to say hi when passing from time to time!!!!!!!! 

I had the Silk Road Cider (half sweet) as is. At first I was weirded out by the strong/different flavour but after the first two sips, I loved it. It was like David's Tea on steroids. Lots of flavour, and it tasted exactly as described. 

I almost got another tea to go, but it is expensive, even for a small. It's a hell of a treat, and I am hooked on my first visit!!"}
{"text":"What a delight to have discovered this tea bar by chance! My boyfriend and I were quite lost as to what to order and the two behind the counter were so friendly and guided us so thoughtfully to making a selection that suited our mood. I ended up ordering a cold Silk Road cider and my boyfriend, a hot lady Grey. I have to say, I loved both. The Silk Road cider had such delicious notes of both apple cider and cinnamon, while the boyfriend's lady Grey was flavored with notes of lavender. The decor in the cafe was minimalistic, but so tranquil and trendy at the same time. My only complaint is that I don't live closer to here or I would definitely become a regular."}
{"text":"I found this place right here on yelp and it was the perfect suggestion from all the other yelpers! This place was easy to find and in the great location! Once we walked in we were greeted by the barista who explained the concept of tea infused latte to us! He gave us amazing recommendations for a tea latte. I got the thai dragon which was perfect! The vibe and atmosphere of this tea bar was very inviting and makes you wanna stay there all day! I definitely would come back and aim to try everything they have!"}
{"text":"Great place to grab a hot drink, they specialize in tea lattes. Which is a good switch from coffee. I have tried a bunch of different flavours here but I love their vanilla rooibos latte the most. The staff here are always nice and they offer different milk alternatives too. They do offer espresso drinks also however I find their tea lattes the best I've ever tried. They do teas here right. Prices are a bit higher then regular espresso lattes I find. But it's worth it for a yummy tasting tea latte that warms you up during cold days. Besides sometimes you just need to change it up from espresso drinks. A great addition to the Parkdale area. Lots of seating available."}
{"text":"Such a great little spot. The two owners are so nice and friendly. The Tea is delicious, with tons of options. They make each cup from scratch. My only improvements would be if the space was more like a cozy tea shop instead of a space for hipsters to work on their laptops all day. It would be harder to have smaller cozier tables with the space though. But the service and tea is well worth it. Good job guys!"}
{"text":"I have loved everything I have tried here.  I am a tea lover and am so impressed with the variety of drinks here.  There's really something for everyone; milk based vs non dairy based, hot teas,  iced teas, etc... if you're stumped just ask Tariq and he's always ready with a suggestion.  For those who insist on coffee,  there's something here for you too!"}
{"text":"my dream cafe - i love tea as much as i love coffee, it's often a dilemma i have. it's unfortunate that Plentea is not in an area that i'm usually around but i have made the effort to go west just for a cuppa. their infused tea really does make all the difference, my favourite by fair is the Thai dragon! i love that all the ingredients (herbs and species) are freshly made and steeped. you can really take the flavours! the owners are absolute gems and really take the time to explain each tea blend to help you find what you'd enjoy most. their also have fresh pastries that are pretty good! i've had the banana bread to go with my tea. i also appreciate that they really do serve your tea HOT. i hate when you order a drink and it gets cold after 5-10 minutes. my cup stayed hot for the 20 minutes it took me to guzzle down (i drink tea/coffee like water)! highly recommend :)"}
{"text":"I've been meaning to go here for a while, and brunchin' nearby in the west end made it happen. Turns out this business will have you smiling-a-plenty.

Plentea is an interesting tea shop concept, different from the DavidsTea-type of places. They don't have pre-made tea blends ready to go, and they aren't a fan of stuffing leaves in tea bags. Ingredients on a wall are taken as needed, grounded, mixed, brewed on the spot on order (in a contraption resembling an espresso machine). Watching this was like watching a Chinese herbalist get ingredients from various drawers and prepare an herbal mix. It's quite something, even if it takes a bit more time. And it does leaf some room for a bit of customization--want a bit of cardamom? I guess.

There is space to work, study and chill up in the mezzanine, and the staff/owners are happy to point you to the right tastes or draw a short conversation. I am a sucker for chai teas, and saw \"Matchai\" on the giant cleverly designed menu board on the wall by the door, so let's do it! I don't know how the spicy notes of chai works well with the creamy bitterness of matcha, but they make it work. It's quite something, even if it seems weird and interesting at first.

They're a plenteaspoonful with words as they are with teas (and coffee).

[TTC: 501 or 29 to Queen/Dufferin. Eastbound streetcar doors line up nicely with the entry, making Plentea a great \"bus shelter\".]"}
{"text":"What a great spot! Friendly staff and delicious teas...Modern and spacious with a cool menu for both tea newbies and fans alike."}
{"text":"Finally stopped by this place and WHOA NELLY THIS TEA IS THE BOMB! I got a coconut chai latte made with almond milk. It's better than any other tea I've ever had and is sweet and satisfying like ice cream (but without the sugar or the dairy!). It's my favourite part about today so far, and I've had a pretty good day. I'm very glad this innovative tea place moved into the neighbourhood and I definitely see myself making \"plentea\" of stops here in the future."}
{"text":"Plentea was a great after work stop for some delicious tea/tea lattes. I had a yummy Black Velvet tea latte with soy, at the barista's recommendation, and would definitely bring any tea-lover back for a cup. Only con is that it is a little pricey, even considering the teas are artisanal."}
{"text":"I went there with a few of my friends and we tried the Black Velvet (chocolate chai with black tea), the Thai Dragon (chai coconut) and the Chai Karak. I absolutely love Chai and it was so delicious. The Black Velvet and the Thai Dragon were super special. I will go again to try their Matchai!"}
{"text":"Like most other reviewers, i had the Thai Dragon, and it was fantastic! Next time i might ask for it a bit less sweet but the flavours were delicious. 
I really liked the owner, he chats with all the customers and is super friendly. The upstairs is quiet and a great place to work with big tables, so nice with the breeze coming in from the open door, most coffee shops are freezing!

Don't hesitate to go past the bridge to try out this unique tea spot."}
{"text":"DELICIOUS. Sumptuous, nuanced flavors, just soooo good! I'm getting mildly addicted to the Black Velvet, otherwise known as a Chocolate Chai Latte, I should really start mixing it up and ordering something else before I get too attached. I've also tried the Matcha Latte, so tasty! Yeah, it's a little expensive, and be sure to specify when you want a smaller size - the owner is a really nice guy, but he'll always super size your drink unless you ask specifically for a smaller size. Also, for some reason, drinks here always seem to be wayyyy tooo hot, and there aren't any sleeves available? I like to sip right away, but no can do here - wait 15 mins for it to cool down! And then enjoy. Good stuff."}
{"text":"A recommendation by a colleague brought me to this gem in the heart of Parkdale.

I was greeted immediately by the barista when I walked in. The place is very big, spacious, and clean. It looked like a good place to have lunch, study, meet friends or go on a date with. You can definitely people watch on the bar stools that face the window. The barista was great at helping me decide on what to get. I wanted something with espresso in it and he recommended the chai latte with a shot of espresso - he called it the chaipresso (clever). Side note: The name of the coffee shop is also very clever in my opinion! He showed me the chai he used and poured the drink in front of me. He was very approachable and made my experience at this new tea shop a good one.

The price of the chaipresso was around $8 for a large. It's on par with other gourmet tea/coffee places, but just a tad more expensive than what I am used to paying for. The chaipresso is very flavorful - I taste the spice (possible cardamom and nutmeg) and cinnamon flavour quite well and it's not too sweet. In fact, it reminds me an indian chai, which is delicious. I feel this tea could definitely help with a sore throat due to the spices in it! Another thing I love is that it does not leave a tea after taste. It's more of a nice cardamom nutmeg flavour.  

I would definitely come back and try their other teas when I feel like treating myself during work! They accept credit cards."}
{"text":"Discovered this gem by pure luck!!! Smart name and absolutely fantastic latte. The choices of spice to mix are great. The smell when u enter this place is exquisite and puts you in the mood immediately. Very pleasant and helpful staff. Would go there everyday if I lived nearby!!"}
{"text":"This is a great new tea shop that opened up in Parkdale right at the corner of Queen and Dufferin. It's very unique as I'm sure Toronto has nothing quite like it. They specialize in tea lattes or \"teaspressos\" as they call it. They even like to refer to themselves I believe as \"tea-tenders\". But the terms are fitting as they make every drink to order for you and none of their teas are pre-blended so you can customize your tea-based drink to your liking. I had the Thai Dragon, which had hints of cardamom and nutmeg. It was very tasty and had lots of flavour. The space is also very well designed, with good seating space upstairs. I can definitely see this place as a great hangout spot or workspace. Will definitely come back again to try all their other interesting and unique flavours. Tip: Their wifi password is \"teatender\"."}
{"text":"A fancy shmancy tea shop specializing in tea lattes - which are my favourite things in the world so, gladly, I made my way over here after hearing about this place.

First, don't listen to Google Maps. We had typed in Plentea into Google Maps and it took us on some random narrow street called Milky Way (or something), down a weird alley that definitely, definitely didn't have tea lattes.... in short, as of the date of this review, turns out Google Maps may potentially route you to a spot about 2 blocks west of where Plentea actually is (it's actually at the corner of Dufferin and Queen Street W). Type in the address instead (1205 Queen St W.), and you should be fine.

Second, the actual shop. Once we finally found it, we stepped in and the first thing that hit me was the decor - very open, spacious, with a really modern & contemporary yet laid-back atmosphere. There are two levels - the ground level where you order, and the second level where you can go upstairs and sit, read a book, hang out with friends, whilst sipping your tea!

Third, the actual tea latte. They had a pretty good selection to choose from - black teas, green teas, oolong, etc., all tea lattes made to order. We ordered a \"Tisane\" large Rooibos tea latte, caffeine free - we were told that this is a decent option to go for in the evening after a meal. 

The verdict: quite delicious. It's definitely on the sweet side (which many people will probably like!), and the flavours were strong and made a statement. It's quite milky, with traces of vanilla in the drink that left a slightly nutty aftertaste. It was quite good, but next time, I'll probably go with one of their black teas, as the Rooibos was a bit too sweet and tarte for my liking. However, personal preferences aside, the fresh and bold flavours of the tea are definitely there - quality stuff.

A Large cup was slightly taller than a Starbucks Grande cup. For one Large Rooibos tea latte, I paid $4.86."}
{"text":"Couldn't believe a little cafe like this existed right at Dufferin x Queen! It almost felt like a hidden gem to me as I stumbled across it after another cafe nearby was too full for me to work out of. The staff were very welcoming. I actually asked the barista what he recommends for me, and he hooked it up with an iced Thai Dragon latte and it was bombbbb! I would definitely come back here, wifi is strong, seating is fair, however outlets are scarce so come with a charged laptop or prepare for battle."}
{"text":"Fantastic teas and super friendly staff. It's definitely my favorite place to go for tea or coffee."}
{"text":"I love tea so much, but always when people talk about \"tea parties\" they are referring to boring things, right? NOOOOO!!! 

With Plentea it's always an amazing time. These guys make teas even more interesting. You can try some authentic (and infinite) combinations, they also encourage you to \"Make new patterns\", also used as their slogan.

My favourite so far is the Chai Latte with chocolate, really good and all ingredients are really well balanced. But I'm excited to try new patterns at Plentea.

The service is really good, the guys are so kind, attentive and smart! They deserve the 5 starts for sure. And YOU, go try it out!"}
{"text":"A nice place to stop by or even work on your laptop upstairs, though the machine gets noisy. The baristas are super nice and great to talk to! Unfortunately, the teas taste odd and not as soothing or refreshing as I'd like. I've tried a number of them including the Thai dragon and Sahara, and I really would want to like them more than I do."}
{"text":"This place is perfect for tea drinkers, especially when you like milk in your tea! They specialize in tea lattes and they taste so darn good. I have had nothing like this before. After reading some of the recommendations from other reviewers, I got the Thai Dragon Latte with Almond Milk. It was so good, it was like having Thai dessert in a cup but not too sweet which is perfect. My friend likes Chai, so she ordered the Chai Latte and ended up liking it so much she bought the tea blend to go.

There are two large tables and one small table upstairs, perfect for working or chilling. I wish they had more locations though. If they open one in the financial district, that would be perfect!"}
{"text":"Finally got to try this new lofty place that opened in Parkdale located at Dufferin and Queen West. The menu is located on the wall and they offer a range of teas The owners were very friendly and introduced us to all the unique blend of tea lattes that they have. Being a fan of coconut milk flavour I decided to try the Thai Dragon while my friend decided to try the Black Velvet tea latte. Both are black tea lattes. To add some flavour I decided to try it with some almond milk as well. The owner grinds spices and herbs with a mortar and pestle and then brews the tea latte. The latte is then poured into the cup through the strainer.

The Thai Dragon tea latte was very rich, creamy, thick, unique, and flavourful. I was able to taste the hint of coconut, almond milk, and the spices that they added. The black velvet tea is more spicy but equally rich and creamy. For my initial sip it definitely left an interesting tingling cinnamonn-y flavour on my palette. The spice was definitely the more dominant flavour for the black velvet while the sweet creamy coconut almond flavour was more dominant for the Thai Dragon.

Upstairs there is a place with 2 large wooden tables and once small desk at the back. Probably has enough for 15 people. There is wifi as well. Nice place to come by to warm up on any cold day! They serve ice cold drinks as well so would be nice to come by and try them out during the summer"}
{"text":"I haven't written a review in ages, and this place is totally worth of me coming back from my hibernation. It's a solid five star (or six, if there were that many) tea/coffee (but heavily tea) house, specialized on tea lattes - DELICIOUS tea lattes, which they'll brew with any kind of milk you like, no fuss, and serve you with a beautiful smile, like you are their best and only customer, the Queen ( or King) of Tea World, as you're offering them a million dollar per cup (and you're not - it's the same as Starbucks). I felt so special there I want to come back every single day. 

This place is my tiny little paradise in Parkdale. Please exist forever, as I love you."}
{"text":"Super friendly staff, chill atmosphere with a unique product in Parkdale!

(I found parking on the street behind the building on Melbourne Ave.  Free.  :)

Space is loft-like with an upper level with seating.  Main floor has the spacious bar with an extended condiments counter.  Entire space has a cohesive graphic branding that is a continuation of their sign - window treatment - menu, etc.  You can tell that the space was very well planned.

I got the Black Velvet which was a spicy chai-like drink.  Taste was quite bold and I saw them pour my tea through a strainer.  No mixes, so don't expect anything syrupy sweet which works for me 'cause I find most pre-mixed lattés way, way, waaay too sweet!

Owners were very friendly and personable.  One even stopped by the tables to chat with customers before he left for the day.  

A really nice change of pace from all those bustling, chain coffee houses!"}
{"text":"Good selection if teas, very interesting idea. West Queen West needs a good tea place, I think this fills that void. Very calm environment, and they blend their teas on the spot, and steep it in a espresso type tea machine. The Lady Grey I got was really good. Def for a revisit in the future"}
{"text":"I was greeted the moment I walked in. It was really nice that the barista asked about how my day's going and where I came from, super nice service! Don't remember the exact name of my drink but it was some sort of matcha tea latte. Omg it was the best matcha tea I've ever had. I'll remember the taste forever lol!! Overall, a really cozy cafe with really amazing tea. It's definitely worth going, you won't be disappointed."}
{"text":"Possibly my best Toronto tea find... ever.  

I came here because of the overwhelming Yelp praise and also I'm an avid loose leaf drinker.  I simply was not prepared for how great this could be.  Last time I was blown away was at M Squared using the honey soaked Chai tea from Australia.  Plentea blew that out of the water.  If you love teas of any type, you owe yourself to try the teas here. 

Unlike other places which boils water and drop in a tea bag, this place hand curates and blends the leaves and spices together right in front of you.  That's like asking a barista to choose beans in front of you, cut up a vanilla bean, scoop the seeds, and create a fresh simple syrup if you asked for a vanilla latte.  I won't go as far as milking a cow cause I'm sure the Toronto by laws prevent that.  

So we came in on a Sunday morning to be greeted by a warm and friendly gentlemen who was very interested in offering the best he can after learning we just walked in for the first time.  The menu is artistically presented on the two story wall where you can see many options.  Some are as simple as a green matcha and other goes as rich and developed as a black tea mixed and blended with citrus notes and spices.  

The cafe is super open and clean with 2 stories of seating to enjoy your cup.  Main floor is just a few bar style seating with the upstairs with large work space tables to collaborate over great tea.  

I tried two which still sticks in my memory a day later... Black Velvet black tea latte and Thai Dragon black tea latte.  The depth and strength of the tea reminds me of the same ones I experienced in HK where your taste a wonderful robust tea flavour and not just how water with some occasional bitter tea leaves.  Another great thing is that there is a wonderful balance between the tea and the milk for the latte.  The milk is just there to help create a wonderful smooth taste and not water down the flavour.  I also appreciate how the gentlemen was thoughtful to recommend soy for the Black Velvet and almond for the Thai Dragon.

Black Velvet Latte - Described on the wall as simply chocolate chai latte.. I would describe it an eye opening experience on what true flavourful and rich tea can truly taste like.  This was a bold and smooth black tea that was sweetened with the hot chocolate.  It gave the drink a rich creamy feel that was very surprising.  The spices were incredibly complimentary to the chocolate and were not overpowering.  If anything, it gave you the feel of perfect Christmas drink of real hot chocolate in one hand and fresh from the oven spiced cookie.  5++/5

Thai Dragon latte - Another drink that blew us away.  Tropical because the first taste note is a young coconut flavour that gives away a light sweet tea note.  It almost feels like there is another tropical fruit hiding in there because the sweetness is not a sugar overload but rather a sweetened fruit taste.  The almond milk added to the whole flavour by adding just the right amount of nuttiness to compliment the coconut.  Another winner 5++/5

I wish this place was in more than one location!  I would visit every day if I could.  For now, I'll be happy to trek another extra 20 minutes from wherever I am in Toronto to get this."}
{"text":"Love this place.  It's redefined tea for me. Their pastries are also very good, almost as good as their tea. The main owner is super friendly and it's always a treat for us whenever we have time to walk there and grab a tea."}
{"text":"This place has a million flavor of tea!  I love their latte so so so much!  The \"teatender\" recommended several options when we first entered the store,  super friendly!

Got a black tea latte with giner flavor (sahara)  and matcha latte with chai flavor (matchai).  Sahara has a really strong ginger flavor, love it!  The matchai is softer but the matcha flavor really stands out!  ( better than starbucks of course)

We also ordered the raseberry white chocolate scone. Goes perfectly with the latte.

They also have cold tea and cold pressed juice too!  The space is so big and good for groups. Perfect place for a weekend afternoon."}
{"text":"You know, sometimes you don't NEED a coffee. I walked into Plentea and immediately asked for an iced americano and the barista gently asked, \"you don't want a tea?\" Right, I'm in a tea shop, maybe I should get a tea. 

Don't worry, they do have an espresso machine and can make you your americano or latte if that's really what you need. But today I decided to break my habit and go for an iced tea. 

The barista was really helpful, realizing I don't drink a lot of tea, and asked me a few questions to help me narrow down my selection. I settled on a high caffeine (I'm still a coffee addict at heart after all) peach iced tea. And here's a cute detail: they shake their iced drinks in a cocktail shaker here. 

I appreciate these kinds of small details. And you can see them throughout the decor here too. Quickly glancing at the shelves on the second floor I can see a number of decor pieces I recognize from local vendors. 

Also of note: this could be a great co-working space. There are number of communal tables and, at least when I visit, it is not over crowded."}
{"text":"Everything I said before still stands, I just wanted to update and add a little more love...

+They've upped their snack game, some excellent savoury options
+They're open until 8pm, to tickle your evening tea fancy"}
{"text":"Great selection of tea, from black tea to oolong tea to green tea. And they also have unique combinations of tea, such as chai with chocolate and black tea with coconut. 

I tried Thai Dragon, which is black tea with coconut, and I asked using almond milk instead of milk (the guys told me they have 2% milk, almond milk it regular as alternatives to meet different requirements) 

The taste is beyond my expectation! It's really unique in a good way! Not too sweet, creamy enough for me, and light tea flavour combining with light coconut flavour combining with some other tropical taste inside of the tea. 

Really good! 

The place is very relaxing. Upstairs there are couple seats and tables. 

Also downstairs washroom is using sound control system (very Eco-friendly and smart) ! -- add a star for this:)"}
{"text":"Great place for tea at the corner of Queen and Dufferin! The barista was super friendly and helpful as I asked for recommendations. I decided to go for the \"Before Sunset\" green tea; hints of spice/ginger and lemon, something that I would probably like. I opted not to put sugar in the tea as I usually drink it black anyways. Love the warm, friendly atmosphere of the place and will definitely be returning for more! They do not use teabags but custom blend their tea ingredients on the spot which make it unique."}
{"text":"plentea...plentea...plenty! 
I was dropped off on a streetcar because of a short turn, to kill some time I figured I would check this place out, I saw pictures on BLOGTO about this place. you walk in and it feels very hip and fresh being in here. the service is awesome to the point where the barista?(I think) was asking me about my day, whats going on, plans for the evening. this was all chit chat before evening asking what I wanted to drink! im partial to tea\cappichinos as I love the smell of coffee, but it tastes bad to me. I decided to stick with a rooibos tea. when this place makes a tea, its not bagged, its completely loose. after about 2-3 minutes of him whipping this coffee together, I was warned that the tea was pretty sweet solo, I added some honey to it. from the first sip I was absolutely hooked, the flavors and gentle notes made this tea absolutely stand out from almost any other cup of tea I've ever had in my life. 
BEST SHORT TURN EVER! 
this tea actually gave me the thought to change my route a bit, which lead to me getting home a little bit faster, because an accident was present further down the line I had to take to get home. im not in this neighborhood often other then travelling through it. but absolutely fantastic teas! 
transit options are the 501 queen, and the Dufferin busses, this tea bar is massive with a split two level shop(almost like a loft?) and super clean. 
they also do cold teas, and have some treats.
as noted they make some BOMB servings of tea...they call themselves tea sommeliers, I call them awesome!"}
{"text":"My friend works in this area and she's visited Plentea plenty of times. Instead of eating lunch like normal people at noon, she took me to Plentea and greeted the extremely friendly staff, who loves teas and Sailor Moon.

Such a great atmosphere!!! And they make your tea to perfection. AND FAST. They're so fast! I didn't even finish studying their menu (I was busy picking out the tea for my next visit).

There is a beautiful upstairs for peaceful studying or (in my case) lots of beautiful catch-up gossip. In our most polite voices, of course.

Try try try try, and try ALL of their teas. They are as delicious as they sound. But Plentea isn't just a tea + hot water, they make really good tea lattes. I'm a huge huge huge fan of rich teas with rich milk, who knew they go so well together!!!"}
