{"text":"The food was terrible roasted Brussels sprouts were under cooked; the meatloaf was burnt and over cooked dry and tasteless; the roast pork loin was over overlooked and had a bad combination of roasted sweet leak and pork.  We felt the pricing was too high for Neal that was server. There nothing artisan about this diner except for the price. I would not recommend going to this diner to anyone. One star is generous."}
{"text":"Seriously good, wholesome, honest food! Delicious and nicely presented. Service is personable and staff did their utmost to make us feel welcome and at home. We came here with an out of town guest and were charmed by the easygoing and genuinely pleasant atmosphere. Our verdict: We'll be coming back here many times over!!!"}
{"text":"Had dinner here this evening - impeccable. A fantastic new addition to the Calgary restaurant scene. Fresh, wholesome ingredients, honest serving sizes  - we had the shrimp, beet tartare, and roasted chicken. I wouldn't change a thing. Dave was a gentleman and crafted great drinks based on our tastes, as well. Excited to get back and try the brunch menu!"}
{"text":"This place has a very laid back, artisan hipster feel to it which circulates from their online presence (seriously, who doesn't have a restaurant website or keep their FB page up to date in this day and age?!) to their service. If you're like me and you need to see what's on their menu (I've included a photo of one since you can't find a legible one anywhere) or are on a tight time schedule (we inadvertently had a ~1.5 hour lunch), this may not be the place for you.

That aside, when our food finally arrived it was pretty good. We decided to do it tapas style since all of us wanted to try a bit of everything:
Plowshare skillet - braised short rib with poached eggs, roasted veggies and hashbrowns
French toast - strawberry & banana, nutella drizzle
Roast chicken BLT - applewood bacon, tomato and lettuce with a side of fries

So, the french toast did not look appetizing. We were expecting slices of strawberries and bananas and out came two pieces of french toast with a pile of blended greyish goop on top. But, we looked past that and it was quite tasty. The hearty winter veggies complimented the short ribs well and the harvest bread and roasted chicken made a delish sandwich.

I'd go back to Plowshare again, but probably on the weekend when I had more time as opposed to lunch during the workweek. Time is money!"}
{"text":"Came for brunch. Service was scetchy. The waitress was friendly but not attentive. The food was average and bland. Not impressed."}
{"text":"Mixed feelings about our visit to this restaurant. First of all, we had good service from our waiter and they don't really have a drinks list, it's more what they call a \"discussion\" and then they'll whip up a drink based on it. Drinks were pretty good. 

We started with pretzels served with beer mustard and shared the brussel sprouts, bacon wrapped meatloaf and the seared salmon. I actually really liked the sprouts dish but it had some parts of it that were very salty where it was an overwhelming bite at times. Seemed to be sprinkled with salt on top and not mixed in well, the bacon and sauce were yummy however. Bacon meatloaf was delicious, came with herb mash potatoes, on wheat toast and beer gravy and would order that again. The salmon was extremely salty to the point where it was almost inedible. I thought that the salmon may have been sitting in a brine of some sort and then sprinkled with salt again when it was done cooking. 

I am sad the two items were overseasoned but felt like the flavours and comfort food theme of this place would make us come again. The atmosphere is unpretentious and they have a good menu. Would like to the try the brunch!"}
{"text":"Love the duck and waffle. It is my go to and my favourite full eggless meal. Plus the staff are ace."}
{"text":"Had brunch there on Sunday from their all day weekend brunch menu. Delicious food with very nice touches that made theses traditional plates updated while keeping them wholesome and filling like they should be. Very nice atmosphere and staff were very attentive. They also have a dinner menu and I will absolutely go back for that. Menu says all ingredients are local if I recall correctly."}
{"text":"Average at best, for a diner, food should be good, service brisk and friendly, decor comfortable.  For an Artisan Diner, seems the prices did not match.  Always be willing to try places out, I'll will, ultimately though there are too many choices to make it often."}
{"text":"Stopped in here to eat based on a recommendation from a local as well as Yelp.  We were glad we did as it did not disappoint. There were five of us and we were thrilled with the unique flavor of the food. Our server Dawn was great and helped us with recommendations. The interior is rustic in feel and down to earth, which matches the style of the food. Like other reviews state \"comfort food.\"  We were glad we tried this place and would definitely go back."}
{"text":"Stopped in for an early dinner during our visit to Calgary. The owner was also our waiter and made our experience a laid back pleasure. Mac&Cheese with mushrooms was perfectly balance, grilled cheese with tomato soup followed by apple pie and a solid cup of coffee. Great ambience as well with Radiohead playing at the perfect level. A thoughtful offering."}
{"text":"Very, very good comfort food menu!  So many things sounded appealing, and everyone in our group enjoyed their brunch.  We will be back to try dinner another time. High quality ingredients (delicious variety of mushrooms rather than plain old white button), from-scratch baking, pleasant and attentive service.  Good stuff!"}
{"text":"I organized a work party here. Half  our party was an hour late but our server was good to us about it. Wine is $13 for a six ounce or $52 for a bottle. Beers range from $7-$13. 

I had tummy problems so I couldn't eat, but the food smelled great. The kitchen is open so you can hear the chefs gearing up after you order. My friend liked the tomato soup and grilled cheese. The caprese salad looked really fresh. My friend's meatloaf looked very yummy and filling. 

This is a great place if you want to away from the heavy drinking party scene on Stephen Ave. It's quiet inside and charming in an old school heritage way."}
{"text":"Very hip and outstanding quality food. Server was really friendly and helpful.

This is a breakfast and lunch type of place. I had the duck sandwich but was told that breakfast is generally the way to go."}
{"text":"Lovely place c although no air conditioning, so avoid on a hot day.   I enjoyed my spinach havarti pie. Friendly staff."}
{"text":"Went to eat there for lunch. We had the meatloaf and the cheese pie and both were too salty. The mashed potatoes with the meatloaf was good but way too rich and for 19$ I don't really want toast bread on my plate. The greens that my wife ordered with the pie were a joke and no real attention was put into the dressing. The pie crust was burned and the 9 grain rye crust seems to be just toast bread (again with the toast bread...) The service was ok and the place looks somewhat interesting but a bit under decorated. I wish they served tap beer and not just bottled. Overall it wasn't bad but we felt it was overpriced for the quality of food and both dishes should have been 4$ cheaper."}
{"text":"Plowshare was delicious! One of the best burgers I've had in Calgary. The server made up for not being great by being funny. My friend tried to order a cocktail and they didn't have cocktails but then again what diner does? They may or may not have ginger ale. My fiancé ordered one and it never came. Anyway, I would eat there again in a heartbeat!"}
{"text":"Really enjoyed my meal here, and the owner and staff were very friendly. I had the salmon sandwich for lunch, and liked it so much that we came back for brunch the next morning. The eggs benedict were also on point!"}
{"text":"Having arrived hungry and tired from the US East Coast, I stumbled on this restaurant which was a few steps from my hotel. What a delightful surprise! The menu was creative and very interesting. I settled on the spinach and havarti pie and was not disappointed. I made a good choice!"}
{"text":"Visited with a girlfriend last week for dinner. It was a quiet evening and the owner made us feel right at home. Classier take on a diner, the price point was perfect and the food was amazing. I had the salmon entree and it was to die for. Definitely a must try for new places to eat in Calgary!"}
{"text":"I went here with a girl friend on a Saturday for brunch. Both she and I had never eaten here before, but to be frank, I probably won't eat here again. The employees were nice, friendly, and informative but definitely lack the urgency to feed their customers. My friend and I waited about 45 minutes or so to receive our meals. I ordered a skillet and she ordered eggs benny. (Both meals don't take that long to cook- am I right?) Given that it was a Saturday, this restaurant wasn't busy at at. Including our table, there weren't more than 5 other tables occupied at the time that we were there. So back to my skillet- after the 45 minutes of waiting for our meals, I noticed that my skillet didn't have any meat. Any meat?!? I notified our server as soon as I noticed and he quickly told the cook, the cook then whipped up a side plate of my meat in literally 2 minutes. I don't understand how stir frying veggies and cooking a couple potato slices took 45 minutes then?! I also overheard the server apologize to about 3 other tables near us for other reasons so that makes me think that this restaurant doesn't really have it together at the moment. Anyway, the meal was good, after all that. But definitely not worth the unnecessary  wait."}
{"text":"Not too impressed. Their small \"comfort food\" menu was limited to start with and they were out of Burrata Cheese at 5:45 pm on a Tuesday. 

They only carry 2 red wines, one of which is a low quality \"Woodbridge\" Cab. 

There was no ventilation the evening we were there. The griddle in the middle of the restaurant emitted a lot of greasy smoky smells. My clothing smelled of this when I got home."}
{"text":"Love the Grilled Cheese with Tomato Soup at Plowshare!  Very tasty and comfort food.  Good, fare prices for lunch.  I'd come back to Plowshare."}
