{"text":"The waiting staff is incredibly rude.

I am part of a softball league that plays at their fields, and our league brings in thousands of dollars worth of business every year for them.  One player brought food in from another restaurant.  He then went to the bar to buy beer from Po'Boys.  While he was waiting to be served (expect to wait), another waiter came up and rudely commanded that the food must leave immediately.  After informing him that the food belonged to a person at the bar, the waiter forcefully attempted to throw it away.  Only after pulling the food away from the waiter did he relent.  Even then he swore at us.  With no tact and incredible rudeness from the waiting staff, this bar is not worth the trouble of the drive.  I highly recommend any of the more courteous and better tasting restaurants and bars in Champaign-Urbana."}
{"text":"Even though the restaurant would sound like it has a surplus of sandwiches they are mainly known for their pizza.  The pizza special of Sundays are awesome.  However their major downfall would be their lack of service with their waiters.  Sometimes you can expect to wait for 5-10 minutes to get your drink order and there will only be 2 or 3 other groups there.  The food at Po' Boys can be sometimes lacking but the weekly homemade pie can make up for it."}
{"text":"food tasted good, but the shrimp PO boy had at least four times as much bread as.the amount of actual shrimp could support. It was like bread with a light spread, not a full po' boy sandwich.  For $8.50 I felt ripped off...and still hungry.   I've had great po boy sandwiches -- this was NOT one of them."}
{"text":"Came to taste some food so we can have them cater our wedding! Delicious BBQ, and the owner Jean is super friendly and very helpful!"}
{"text":"Italian Beef Sandwich will make you :)
They have outside seating :)
Prices are fair, ahout $10/person"}
{"text":"Their pizza is phenomenal. On Sunday's their special is 1/2 off all pizza, and we go almost every Sunday for their pizza. The salad bar is always fresh and the selection is great. They always have a great selection of homemade pie, the lemon angel pie is to die for! The bartenders are always friendly and the drink specials are hilarious as well as tasty. They also have beautiful art on the walls from local artists. This is a great restaurant, everything on the menu is delicious."}
{"text":"PoBoys is great!!

I had the Pulled pork pizza with the original BBQ sauce, I wasn't sure how pulled pork on Pizza would be and I was very happy with my decision, the pizza was GREAT!

Someone else at my table ordered a mixed BBQ sampler- GOOD.  BBQ Sauce has a good balance of sweet and spicy.

What really sold me was the salad bar, I love to add my own fixins to my salad, this is key for me.  The other big seller for me...homemade PIE...amazing.  We were too full to actually eat the pie in the restaurant so we took 3 slices home, yes 3, and all were amazing.

Service:
I went on a Friday afternoon for lunch.
I was seated quickly and had a water and drink from the bar in a few minutes.  My order was taken quickly and our food came out soon after.  

Support a family-owned small business over a chain restaurant."}
{"text":"This place makes the best thin crust pizza in Champaign Urbana!  Po-Boys!  Go figure!
If you are longing for awesome pizza like they make in NY & NJ, this is the only place you can get it out here!
BTW, I live in the furthest corner of Southwest Champaign, and it is well worth the drive!"}
{"text":"Hearty, greasy, fried perfection. I had a sirloin steak sandwich with onions, mushrooms, and green peppers. Think of it as a Philly Cheesesteak on buttery toast. Absolutely great. 5/5.

They've also got a big selection of homemade pies. They all looked really impressive. Peanut butter pie: 5/5.

I'll be back!"}
{"text":"went recently on a Friday evening.

first impression, Clean and BRIGHT!

had the BBQ sampler since we hadn't eaten here before.

baby back ribs; tasty and tender.
smoked sausage; flavorful, not too hot (spicy)
pulled pork, tasty and tender
roast beef, a little dry, not much flavor. it seemed like the same beef that would be served as Italian Beef, with au jus and a pepperoncini, i'm sure it would be fine.

sides:
mac and cheese; pretty standard, nothing to write your mom about.
baked beans:  tasty, flavorful,  not too spicy
cole slaw:  a nice blend of vinegar and creaminess.
kettle chips: home made and crunchy!

PIES! PIES! PIES!

i had the banana/strawberry on a graham cracker crust, while Lisa had one called \"Millionaires Pie\" (ingredients unknown).

we like the pie so much, we bought carry out two days later for more.
the pecan, peach/blueberry, Millionaire, banana/strawberry were all very good.

save your fork, there's PIE!!!

yeah, we'll be back and try the pizza next."}
{"text":"Family owned and ran. Amazing food and drink, great prices, and a very relaxed atmosphere! A definite must do in the area! Whenever we come down we will make sure to make this a stop!"}
{"text":"This place is one of favorites in champaign however can't give it a full 5 stars and I'll explain why but first let me share the good.

The food is amazing there isn't a thing I have had here that I didn't like and the polish as well as the pizza are favorites. With pizza I normally dislike thin crust very much but at this place I'll choose it over almost anything else ever had. The BBQ is awesome as well and when they have the jalapeño poppers they are also best ever had.

Now the bad.. The place looks wise is run down and also very random.. Also a place with a bar that closes at 8pm even on weekends in a college town at that? Just makes you wonder what they are doing. Also while it has only ever happened once in about 25-30 visits I did once on a totally dead Sunday afternoon sit down for 20 mins before being talked to and my wife and I just left. But other then that one time the place was amazing every other so 4/5 definitely."}
{"text":"Today I went there for lunch. I was in a group of 7. Our group arrived at approximately 12:05p for lunch and there were only two or three tables in the whole place, all small groups of two or three. Upon sitting down we are greeted by a polite waitress who promptly too our drink order. (Only three out of the group of seven were there at the time) The rest of the group appeared shortly afterwards. The waitress was well kept however her hair was down and not pulled back at all, and for some reason she was wearing sandals. I've worked in the restaurant business for fifteen years and I've NEVER been able to wear sandals to serve food. This is the second time that I've seen this while I have been there.  Nevertheless, the food there is great, which is annoying because their food push time is not. We arrived and ordered at approximately 12:15 and by the time I left at 12:52p (to be back at work because we have an hour lunch) our food was just arriving at the table.  For a restaurant that isn't pushing a ton of food at that time because they don't have very many people there, it seems a little silly to take 40 minutes for food over the lunch hour. 

Again, I've always liked the food that I've ordered, but today is cause for a very poor review."}
{"text":"I had the Italian beef sandwich and it was good! The meet was delicious and juicy. My friends has the pizza and salad bar combo which was the special. They both said that it was good. The service was sot on and we got out of there quickly which is important for lunch. I would recommend this to anyone around here looking for a lunch spot."}
{"text":"Staff are friendly, I really like this place. Staff are very knowledgeable with regard to allergies. I have an issue with gluten and the staff take precautions. I like the smoked half chicken and BBQ beans."}
{"text":"if the decor was a bit toned down, or different.. or something, I'd go 5.  I loved the old Po Boys, and well... I don't really need to go into a big long deal about how this spot is not like Arnie's spot in Downtown Champaign.  I will tell you that they have the original sauce, and the original Polish.  I love this combo.   The beef, the pork.. about a touch under being great.  One thing they have that I f n love, is Chicken, which the Original spot didn't have.  I just took stars off from Porgy's for the horrid way they have let their chicken go, but Po Boy's original sauce on that chicken.... It's heaven."}
{"text":"Always great when one finds a long time local favorite and it's actually still good after several decades. This is one of those places!

History says it started as a hole in the wall and now it's a modern, simple restaurant with great pizza, sandwiches and BBQ, and still family owned. 

I tried the Pork Fry Nachos which was BBQ pork with fries and nacho cheese in a bowl. A little messy, but delicious."}
{"text":"Po'Boys is located in a nice strip mall with ample parking available all the time. The restaurant has a bar, slot machines and plenty of space to accommodate large groups and small families alike. Off peak hours, there might be some regulars hanging out at slot machines. 

Menu is regular with good choices for barbecue and pizza. I enjoyed their fresh fries with some jalapeno-cheese sauce. They have nice thin crust pizza for reasonable price and its really delicious. I would strongly recommend this place for thin-crust pizza. 

Nothing extraordinary, just the regular menu prepared right."}
{"text":"Great little spot.  Great food and very clean little restaurant. Got the Italian beef and it was phenomenal."}
{"text":"Food was good but overpriced. However, I had the worst service ever the waitress named Brandi was sooooo rude. She messed up the order twice and blamed my friend and then didn't expedite the order and made her wait for food after everyone else in the restaurant. Then accused us of trying to get free food just because my friend wanted to eat her messed up meal after waiting 30+ minutes. No manager on duty and was smug about that, we didn't feel like giving her our credit card to pay so some of us went to the bar to make sure the waitress wouldn't do anything shady and she told us to sit down to pay. Very rude I will never come back and everyone will know how terrible the service is at Po boys!!!!"}
{"text":"I can't believe I have not left a review for this fantastic place yet! First thing first, the service is SPECTACULAR! I mean it, the folks that work here are really nice. Super friendly and helpful. Next, the place is CLEAN. It is in a strip mall and really basic from the outside but when you go in, you know the staff/owners really care about this place. Great feeling in a restaurant, in my opinion. And the food....OMG...the FOOD! Salads, yes. Pizza, heck yeah. Wings, yes. Onion rings, yes. Sandwiches, yep. And the pie.....PLEASE GIVE ME MORE! Can you tell I have been here a few times?!?! I will say that the double $ sign is accurate for this place but, trust and believe - it is worth every penny. This is not cheap basic fast food. You will pay a bit more but will not regret it. I never have. I will be back. Again and again. Do yourself a favor and check this place out!"}
{"text":"Great place for some gluten free options! Their pizza crust is really good. Their barbecue sauces are all GF, as are their baked beans! And to top it off, they have gluten free pies! They make them with pecans for a crust, so even if you don't have to eat GF, they are to die for!"}
{"text":"No atmosphere. Unimpressive food. The pie (which they rave about) had a thick graham cracker crust that was disgusting. No real beer selection. Won't be back."}
{"text":"Went here yesterday for the first time since opening and ordered the chicken wings which were smoked.  The wings themselves (plain) were VERY salty and had buffalo and teriyaki on sauces on the side with a side of fries which were completely over salted!!! I hate salty food, (McDonalds does this to there fries now too) HEY!!!! customers can sprinkle their OWN damn food with salt. I was pissed and wished I had not went.  No MAS!"}
{"text":"No thank you.

The service at po'boys is nice, but the food was just...hideous.  I went on a Sunday afternoon with a friend and we managed to choke down al the food in front of us and immediately regret it.  The barbecue was just absolutely gross and the location itself was entirely lackluster.  While I know it has its fans, I just can't do it, PB.  I'm sorry."}
{"text":"Po Boys is the place for BBQ and Pizza!!
Its my opinion that you should combine both tasty delicacies and have the BBQ Pizza! The pulled pork pizza is out of this freakin world!!! 
If BBQ is more your style without the za' then you will be pleased to know that Po-Boys has 3 different BBQ sauces to choose from! 
The service is amazing and very attentive.... Oh and did I mention THE HOMEMADE PIE!
Every time I stop in Urbana I always make sure to eat at at Po-Boys because its just that good!!!"}
{"text":"We visited Po' Boys simply by chance. We were leaving downtown Urbana and decided to grab lunch. The restaurant is in an unassuming strip mall on University Ave. It has ample parking but is set back a bit from the street, so it is easy to miss unless you are looking for it.  Tables had white table cloths and we were greeted and seated the second we walked in. Po' Boys specializes in BBQ, but we had a basil and garlic pizza and an Italian Beef sandwich. The waitress was very attentive and answered all of our questions and even made recommendations from the menu. We never had our water or drink glasses less than half filled, she made sure the condiments at the table were full for us, and she even gave us a quick history lesson on the place. (It was in Champaign for many years, then on the outskirts of Urbana, and now near downtown Urbana. It was always known for BBQ.)

Anyway, the pizza was amazing. A nice, somewhat crisp, thin crust. Not entirely unlike St. Louis style pizza crusts. And the dough itself was quite tasty. The sauce is a cooked sauce and is not too sweet and not too tangy, but has the taste of good, meaty, summer tomatoes. The basil and garlic were a perfect combination. Overall, I'd have to say it is one of my favorite pizzas in CU at present. The Italian Beef came on french bread and was full of fairly thick slices of beef. Maye 1/4 inch thick slices; definitely not deli shaved slices. It was served with plenty of sauce and there was topped with hot peppers, not chopped Giardiniera which, at least around here, is more customary. But delicious nonetheless.  The meat retained some pink and was very tender. The sauce was hot and more than ample for the sandwich.

The walls of the restaurant are lined with art that is for sale and apparently rotates from time to time. The whole place seemed immaculately clean and the service was excellent. It has a casual meal menu, but has the ambiance of a nicer restaurant. We're definitely going back, and next time I want to try the barbeque."}
{"text":"My wife and I stopped by here the other night as we had been wanting to try it out. We both ordered a Caesar salad and the pulled pork BBQ sandwich w/fries. The salad was pretty watered down, had no cheese and was definitely not worth the $8 / person. 

The pulled pork sandwich, however, was delicious and well worth the trip. We don't like spicy food so went with the sweet BBQ. The fries were basic but good. Service was pretty fast and friendly. Did not try out the pies but maybe next time? :)"}
{"text":"Stopped by Po Boy's for lunch and was treated to some delicious BBQ. I opted for the BBQ Pulled Pork Grilled Cheese with the hot sauce, and it was quite good. The pork was tender and the sauce had a good mix of spice and sweetness. The fries were also very good, with the portion generous. Nothing mind-blowing about the place, but it made for a good, cheap lunch stop."}
{"text":"Service: 100% A+
Cleanliness: 100% A+
Food: 100% A+

Absolutely fantastic resturant to eat at! Very friendly staff, very clean, and food is made to order. Definitely one of my favorites!"}
{"text":"Service 5 stars, food 4 stars, atmosphere 3 stars. This is a BBQ and Pizza place with a full bar. I had the thin sliced beef bbq sandwich. It was great. The meat had good flavor and the sauce was very good. Much better than Hickory River. 
They also have a small salad bar."}
{"text":"Stopped in for luch today and boy, was I impressed!  My favorite was the bacon-wrapped jalapeno peppers--the whole group loved them.  Also had their half price homemade pizza which was delicious.  The piece de resistance, however were the homemade pies!  tried two different kinds:  both  Pina Colada and Peanut Butter were devoured by the group with smiles cheek to cheek as evidence of their deliciousness!"}
{"text":"Holy cow! This place is amazing! Went there for a rehearsal dinner last night. The pizza was phenomenal!!! I tried the bbq chicken and sausage pizzas and they were out of this world! So so good. We will definitely be coming back!"}
{"text":"I had this last night actually bought it for two coworkers also! And this was the worse meal I had this week and I am very disturbed NEVER AGAIN!!!! Nothing was good ugh I will stick with Lil' Porgeys!"}
{"text":"Wow!  What a gem.  I was travelling and saw some good reviews on this place so decided I'd give it a try.  I ordered the Po' Boy Porker pizza and holy crap it was amazing.  So much meat ... And high quality meat.  The pulled pork pork and sausage on the pizza were so tasty.  I also got a chance to sample their  smoked wings -- yet another big win for these guys. The service was great too.  The bartender Josh was super friendly and made me feel at home.  I highly recommend this place."}
{"text":"absolutely the best pizza in town hands down. service is great, food is priced accordingly and comes out at the usual time that food should come out at. the owners are very nice!"}
{"text":"Always enjoy po boys, though I've never been there for anything other than lunch.  The ribs are very good and one thing I look forward to is their salad.  Best Italian dressing ive had.  Great pecan pie too!"}
{"text":"We just ate here at po' boys after a good 10 hours travel. We were hungry and cold and ready for good food. Po' boys delivered! We had the cheese pizza (the crust is amazing), hamburger (no complaints) and the Italian beef sandwich (AMAZING). After stuffing ourselves we decided to eat pie... The blue berry was amazing and the chocolate peanut butter oreo was like \"biting into a candy bar\", SO GOOD! Highly recommend if ever crosses your path! Service was great! Overall GREAT restaurant!"}
{"text":"So today I went to PO Boys, in Urbana, IL. I had a CiSaves certificate. I purchased it for 5.00 in order to get 10.00 worth of food. I was told I could not use it on half price pizza day (which is Sunday) i said ok I can come back another day and use it but I still want the pizza. The waitress said that I could order something else on another ticket and use it on that since it expired on 4/7 and I was not sure I could make it back before that. So that is what I did. I ordered a piece of pie and some wings to take home. When she went to cash me out she came back out and said that I had tried to order the Pizza on the CiSave certificate before and that she remembered telling me I could not. I was throughly confused at this point. The owner Andy then came out and said that he had told me before that I could not use it on the half price pizza. All of this was done in front of other customers. I was so embarrased. I tried to tell him that I had never had a conversation with him about the certificate and half price pizza. In fact we had not been there for almost half a year or  longer. I think he got us confused with another mixed couple (imagine that there are only hundreds in this area) He would not believe me and basically called me a liar. I said I would not come to the restaurant to order pizza and lie to save 5.00. They handled that horribly and I will never go back there. I advise others to think twice about going to a restaurant where a customer is called a liar and treated with such disrespect. I tore the certificate up and told him to charge us for all of it without the 5.00 discount, paid and left!"}
{"text":"Po' Boys has become our regular Friday night spot. They have great service and are super friendly. The pizza is probably one of my favorite in town. My wife loves the meatballs and blueberry crumble. As good as it is, we never have to fight for a table or parking. It is a real gem. I wish they stayed open a little later since we sometimes head out for dinner at 8:00. They also have a salad bar, a full booze bar, local art for sale and gaming machines. If the weather is nice, you can dine on the patio. I highly recommend eating here."}
{"text":"I was surprised twice by this place.  I figured it was a sub shop but the name and when I walked in, the first thing I saw was the little bar.  Then it was the video game machines which is a real negative for me.  

But I didn't have much time and the first thing on the menu was BBQ so I decided to try it.  I wasn't expecting much but then got my second surprise.

Great pulled pork and house made kettle chips topped off by yummy cherry crumble pie.   Looking forward to coming back again. 

5 stars without the video poker machines."}
{"text":"Nice place with good food. They need better iced tea (yes, this is a big deal to me) but the  chicken Cobb wrap I had was very good and my dad's Italian beef was excellent with a lot of flavor. I would definitely return."}
{"text":"I was unfortunate enough to come here, not of my own decision. I sat through an hour of slow service, terrible food, and noisy children. I walked out to my car across the fake grass as fast as I could."}
{"text":"I have been to Po-Boys a few times and think it's amazing!  As a vegetarian I have not been disappointed by the salad bar or pizza.  We have gone as a large group and everyone was very happy with their meal and the staff is super friendly!  I highly recommend you check this place out!"}
{"text":"Ok, some items are better than others. The shrimp poboy was delish as was the fish sandwich. The bbq platter was ok and the chicken wrap was eh. However, the superstar of the entire meal was the pie. The pie!!!!! PIE!!! Tried a couple of varieties and it was very good. In fact, it was so good, that the next day we ate somewhere else and stopped by just for pie."}
{"text":"I'm one of those people that plans ahead. So for a group meeting, I must've bothered Po' Boys's staff quite a few times on the phone to reserve some space & pre-order food. The staff was courteous & very accommodating. They had everything set up - from tables to food. Service was attentive & friendly. They were very helpful with servings & pizza recommendations when I called to pre-order. Everyone seemed to enjoy it all since all the pizza was devoured. It was affordable ($19.50 for 16\" specialty pizzas, $2.50 soft drinks). And they let us mull around & chatter & eat & offered to post our club's information in case other patrons may be interested. The place was clean, well lit, & decorated with local art. The downside was the lack of bike parking. There were only 2 for the entire strip mall. But overall, it was a good experience."}
{"text":"I have never encountered a waitress with such an attitude and so rude. Brandi messed up one of our group's order. Instead of apologizing she blamed it on our friend although we heard our friend order correctly. She ordered Buffalo chicken salad with crispy chicken and blue cheese dressing in the side. She got a wrap. To make matters worse Brandi  didn't expedite the order to correct her mistake. When the order was delivered it was incorrect again - this time it was the salad but it wasn't crispy chicken. Brandi felt we were trying to get free food and got extremely defensive. She yelled at the cook for what was obviously her fault. We asked to speak to a manager and were told she wasn't on site but if we left our contact information she would let the manager know. When it came time to pay our bills we noticed that the bills were incorrect. Brandi was pretty rude by that point. I paid with a debit card. I went to the bar to pay since that was where Brandi was hanging out. She rudely asked me what I wanted and I said to pay my bill. She told me to go sit down. I told her I wanted to observe her running my card. I had no confidence that she would run it right. Although the food was good the service ruined the dining experience."}
{"text":"Stopped by for the first time Thursday evening. I had the special pulled pork sandwich with steak fries. Would definitely be back
 Was really good and prices were reasonable"}
{"text":"Amazing homemade food! Bbq, pizza, sandwiches, appetizers and every other item on the menu was made perfectly. Everyone from our 3 year old to teenager was very impressed with the food. We highly recommend any of the bbq and the chicken bbq pizza. Staff knew the menu well and made very good recommendations."}
{"text":"I was extremely pleased with my dinner here. My buddy and I stopped by on a Saturday and our pizza was fantastic. I can't remember what the deal was but it seemed like a steal. The bartender was also extremely cordial. I'm definitely going back."}
{"text":"Been back. Surprisingly, the pizza is really tasty. It is a different style than pizza m or papa dels."}
{"text":"Went today for the first time for lunch. Food and service was EXCELLENT (2 of us had barbecue and one had a salad), and while I didn't have pie, my dining companions gave it two thumbs up! I'll definitely be back, and can't wait to try the pizza. You need to try this place!"}
{"text":"If I could give them 0 stars for lunch I would.  We have 45 minutes for lunch, have to be back at our jobs by 12:30.  We got there and ordered around noon, in actuality it was a little before noon, but we are giving them the benefit of the doubt.  Our food showed up at 12:25.  When my boyfriend stated that they just burned up his entire lunch time and he needed a to-go box, all the waitress had were excuses; there was a big table that came in right before you, we only have two cooks.  I'm sorry, but your excuses are not what we want to hear.  And I think the kicker was the insincere \"I'm sorry\" from the waitress.  The excuses got the waitress $0.00 for a tip.  So, we will certainly not be back for lunch or dinner for that matter.  I cannot in good conscience recommend this place if you are looking for a fast lunch.  Also, the food is meh at best."}
{"text":"Boring food in a boring atmosphere.  I'm afraid there was absolutely nothing that made me want to come back (nothing to make me running away screaming either) except that our waitress was great."}
{"text":"Amazing tender pork  sandwich and the best homemade pies with real whipped cream. You just can't get food like this anywhere in town. The pies are amazing, allof them!"}
{"text":"Great crispy crust on my individual pizza.  We went for lunch and our waitress kept in mind that we were on a tight schedule.  Husband thought his sandwich was ok, priced right but nothing special.  The hit of this place, as many have said, is the homemade pies!  Save room for a slice, very tasty!  Can't think of another place in town with homemade pies like these."}
{"text":"Great pulled pork sandwich!! Nice and tender the medium sauce had just the right bite! Will come back for sure!!"}
{"text":"Lifetime Urbana residents likely have fond memories of Po' Boys and its legendary barbecue. The original restaurant is no more but its current family-oriented incarnation has much to recommend it.

Tucked in a strip mall behind Wendy's and the U of I Credit Union on University, its nondescript appearance is a fooler. Interestingly, this iteration has a connection to another Urbana tradition as the owner is the son of the proprietor of Huey's. Huey's was an incredible emporium filled with just about anything you might want to buy, perhaps most famous for its inexpensive t-shirts (I just retired my last Huey's shirt a few years ago) and it was located just across the street from where Po' Boys now resides.

This place has a lot of tradition to live up to and it does so in style. The restaurant has quite modest furnishings but is very airy and spacious and features a decent salad bar. There's also a cozy six-seat bar to enjoy your favorite libations, although there's a somewhat incongruously placed group of coin-operated arcade games plopped adjacent to the seating area. That aside, the American menu focuses on sandwiches, salads, pizza, and BBQ. Pulled pork is generously portioned and delicious.  They also make a great shrimp po' boy; this eponymous sandwich comes with crispy breaded shrimp on a bun and accompanied by fries. Buffalo chicken wrap or the sister salad are both good choices as well. Friday fish sandwiches are overfilled with flaky breaded filets. I've never tried their pizza but it sure looks great and something I'll try on a future visit.

While these menu items are standard restaurant fare and not especially notable, what really stands out are the homemade pies. There's a rotating selection of fruit and sweet pies that will tempt even the most staunch dieter. Blueberry crumble, pecan, and chocolate pies are my favorites. Somehow I always seem to be able to find room to put a slice a pie away after a filling lunch.

Food isn't fancy but it is well-executed and makes for a great lunch or dinner stop. The staff never fails to make me feel welcome and to take a few moments to chat, even during busy service times. The owner is often out on the floor, talking to customers, running food, and making sure that the dining experience is great. Po' Boys will leave you with a happy tummy and wallet as well. Highly recommended."}
{"text":"This is the old OTB on High Cross with the softball fields/sand volleyball courts and is half-bar, half restaurant/banquet area. I have been only once since they changed ownership.

I hear that they have good food, mostly reminiscent of the apparently hallowed former Chambana institution of the same name. The word is the current owners bought recipes from the family that ran the old Po' Boys. Next time, I'll try the BBQ.

When I went (in winter), I had beers and a fried cheesecake with jelly syrup and ice cream dessert in a martini glass. It was really good. Service was also good. Beer selection was pretty good, about a half-dozen of the usual suspects on tap with a better selection in bottles, although the prices were kinda high.

The room on the right seems perfect to rent out for a medium to large size gathering. I have been a over the summer to watch folks play sports (when it was still the OTB), and it is pretty good for that. Decent prices on light beer in bottles.

All in all, this place is merely average at best, with prices a little higher than I would expect. If you live out in the country and this is the closest place to you, I can see it being your go-to place, especially to watch sports. If you live in central Chambana, dont have a softball or volleyball game there, and are not a BBQophile, you have no reason to go to Po' Boys."}
{"text":"REALLY love this place!!!!!!!!!!!!!!!!!!!!!!! :)

Went with a bunch of my cousins and was able to try a bunch of things

My little 6 year old cousin LOVED the chili.. she ate more than she normally ever does! she shocked us all

Ribs were AMAZING!  I got the hottest sauce cuz that's who I am but still mouthwatering

My 18 year old cousin finished the pork bbq in about 4.5 seconds flat.. no joke.. inhaled.. and then helped his dad on his huge pizza... 

My cousin's wife ate all of her pork tenderloin and I really didn't think she would.. just lots of food!

My 11 year old cousin who is picky in eating insisted in bringing home the leftover and the sauces.. when her mom asked why she brought home the sauces she responded with \"the ranch and honey mustard they gave us are better than what we have in the fridge\"

family owned.. much love.. fast service and great food.. please do yourself the justice and go here!!!  DELICIOUS!!!!!! :)"}
{"text":"Probably one of the worst dining experiences.  The food is not good.  Everything is pre-made or previously frozen.  My bf and I shared the mozzarella sticks.  He swore they were from Aldi's.  He then had a bbq sandwich, while I tried out the shrimp po'boy.  My bread was super chewy and unedible.  I think it was microwaved, it was warm but dried out.  Also, the shrimp were cut up into smaller pieces, so I had 3 whole shrimp at max on my sandwich.  It was ridiculous.  They also charge for extra sauces.  That's only annoying because it's not spelled out on the menu.

They have a full bar, but not specials.  Well that's gonna attract customers.  The staff seemed pretty incompetent as it took forever just to get our drinks."}
{"text":"Honestly, everything I've eaten on the menu has been delicious! I love their BBQ pork and the pizza is great! And yummy desserts too.
It's a very fun and lively restaurant. We come here for date night, and also to take the kiddos for lunch or dinner. The owners of this restaurant are great people, awesome and hardworking-good folks! This place is awesome, 5 stars all the way!"}
