{"text":"Amazing quality of fish for Poke without having to fly to Hawaii. Thanks Cindy for your hospitality! We will definitely be going back."}
{"text":"had to sample this Poke spot in Calgary.  made a custom bowl...scoop of their regular Ahi, scoop of Shoyu Ahi & a scoop of Spicy Ahi over white rice & garnished w Nori & Seaweed Salad.  also ordered a Sumo Dog & a side Spam Musubi.  giving this spot FIVEShakas for the Poke Bowl but FOURout of five Shakas on the Spam Musubi & Sumo Dog only cuz the Spam Musubi was 1/3 the size that i'm used to & there was wayyy too much Sauce on the hot dog...but it was definitely GOOD!!!   suggestion for the newbies... keep the bowl simple w the Shoyu Ahi (Marinated Ahi in Soy Sauce) w a little extra Shoyu on it & top it w Nori & Seaweed Salad! seriously, that's all u need. u can get brave w the toppings the 2nd, 3rd, 4th, etc time u go!  if ur in the Calgary area check them out!  www.po-ke.ca  SHOOOTS!!!  #Poke_YYC #PokeBowl #ShoyuAhi #SpicyAhi #HawaiianKineGrinds #Calgary #Canada"}
{"text":"Fish and ingredients really fresh and tasty. A a bit pricy (I guess acceptable for Calgary standards). Need to speed up the wait time though. I built my own bowl and ended up costing me around $19 since I added the ahi tuna. Overall a tasty place."}
{"text":"Great selection of ingredients to make your own Poke. Only problem was the tuna, which was clearly frozen and very cold to the point that we couldn't eat it right away. Otherwise the other ingredients were fresh and delicious."}
{"text":"Do yourself a favour and go here! I've ordered the first two poke bowls from the menu on lettuce so far and they've both been awesome (poke special has been my favourite though). There is a lot of fish in a regular bowl which justifies paying more than $10 for lunch. Friendly staff and good loyalty card. I'll be back a bunch more over the summer since it's  filling, fresh and doesn't leave you feeling gross after eating out."}
{"text":"First time trying this place. Food was phenomenal!! Decently priced at $15, and my bowl was so full they could barely fit the lid on it. Amazing flavours and very fresh. Will definitely be going back!"}
{"text":"Great food for the price! I've noticed that other restaurants in Calgary are starting to emulate the same style, and its easy to see why, it was a great experience!"}
{"text":"Glad Calgary has finally caught on to the poke trend!! I wasn't sure what to expect as I've been to a handful of poke places in Vancouver and LA before but I was really pleasantly surprised!   The fish was fresh, toppings were unlimited and portions generous! At other places, I've found that they can be stingy with the protein portions but this was not the case!   I made my own poke bowl, asking for half spinach and half rice which they accommodated me for! Avocado was an extra $1 and Ahi Tuna was an extra $2 which can rack up the bill pretty quick but it was really good!  Verdict: Service - 4.5/5 Atmosphere - 4/5 (wish there was more table seating)  Food - 4.5/5  Would I return: yes!"}
{"text":"Really good sized portions and quality ingredients. I went here on a Tuesday night and there was a steady line. The food was coming out fairly quickly. The staff were friendly and didn't seem stressed with the amount of people. I could see this place being a logistical nightmare for the indecisive. I recommend checking out the menu and deciding on what you want before getting started as there are a ton of choices if you are building your own bowl. I would definitely come back again."}
{"text":"SUSHI BURRITO'S!! SUSHI BURRITO'S!! SUSHI BURRITOoOo's!! 'Nuff said.   Really though, if you like to eat fresh, flavourful food you have to try this place! Aside from the DELICIOUS SUSHI BURRITO'S the bowls are bomb too; each kind offering a ton of variety.   Overall, in my experience, all of the dishes are oh-so-tasty and packed with some beautiful colour.   On another note the space is clean and inviting, and the staff have always been friendly :)   Seating is limited - couple little tables outside and wall/window seating inside.   Seriously addicted"}
{"text":"My favourite poke in the city, I love building my own and all the ingredients are great! I usually ask for less rice if I want to make it a bit healthier without skipping the rice all together and opting for lettuce, since they give you such massive rice portions (not a complaint!) The only thing I don't recommend is paying extra for avocado, it's not usually fresh, and isn't that great. But that's just my experience!"}
{"text":"Service is bar none the best! I care as much about service as I do the food, and they took the best care of me. I spilled my po-ke bowl and they didn't hesitate to make me a new one free of charge, nor did they make me feel bad. I will be a repeat customer! Strongly recommend."}
{"text":"There was a lot of stuff in the bowl and most of it just masked the taste of the fish, which is a good thing if the fish isn't fresh. After having poke in Hawaii, I'm used to the fish being the star of the show with little extras other than rice. Definitely not my kind of thing but worth a try. I got the regular size and was quite full after."}
{"text":"Damn this place is amazing would eat here again immediately had a burrito and took a salad for the road!"}
{"text":"I checked this place out for a late lunch, I decided to make my own Poke Bowl and I ordered their Poke special dog and two Musubi. The Poke Bowl I picked three proteins marinated Ahi Tuna, marinated Salmon and Special Scallops. I almost got all the toppings, picked 3 sauces. I like my Poke more saucy. The three sauces made it amazing. The seafood was fresh and tasty. The only thing that they need is Tamago. The only negative thing I have to say is that everything I ordered they kept saying that's $1 extra, that's $2 extra. I think adding $2 for ahi is really pointless due to the 3 proteins you choose one would be ahi any ways. The Musubi was OK. The photo shows nor I wrapped around the musubi so you can pick it up. Mine came with no nori wrapped around it. The hot dogs....I won't order this again. The bun was stale and hard the dog was nothing special. Next time I will try the burrito, but for sure I will have their Poke Bowl again"}
{"text":"My favourite poke place in the city. I enjoy their sushi burritos, spicy Salmon bowl and musubi. I find the regular bowls are a great portion. There is limited seating by the window so a lot of ppl tend to take theirs food to go. There is parking right in front and behind the store"}
{"text":"So far, so good! Great section including build your own poke bowls, sushi burritos and more! The place is small, best for take away. I look forward to increased speed of service and full topping selection (they were out of avocado!) as they are open a bit longer."}
{"text":"The poke trend is coming to Alberta and we took this opportunity to visit Po-ke on centre street for a quick dinner.  This is a small place but already there was a line-up almost out the door when we got here.  Atmosphere:  3/5  The place is a little small for a sit-down meal but most people just seem to order and go.  Also it was a little difficult to find parking, but overall clean and neat since it is newly opened.  Food: 4/5  I had the custom poke bowl with three scoops - salmon and tuna, on salad, and added corn, mandarin oranges, seaweed, artificial crab, and cabbage; there were also a variety of 'preset' bowls and the option of white or brown rice as well as a number of sauces to choose from.  I really enjoyed the fresh ingredients without too much sauce, and it was a good portion size for me.   Service: 3/5  They were getting quite busy and almost mixed up my bowl with the next person's, but overall effective assembly line system.  Price: 3/5  A little pricy for the type and amount of food as I can probably make the same bowl by purchasing the individual ingredients and putting it together...  except for the sauce.  Overall: 3.5/5  I really enjoyed my poke bowl and really just poke bowls in general - fresh ingredients and ability to customize your own bowl, except it is still a little expensive for type and amount of food."}
{"text":"My husband is from Hawaii and I've gone to Hawaii more than enough times to know and love poke! Although I love JUST eating the raw fish by itself with minimal sauce/seasonings, For the price you pay here, it's totally worth what you get. They give you tons of fish and it's always tasted fresh. I usually get lettuce or spinach to be on the healthy side :) better than the other place downtown, better hours too."}
{"text":"A good choice for people who want both healthy and delicious food. The poke special bowl has ahi tuna, salmon and so on. The base rice is still warm. I like the plain tuna and salmon better than the marinated ones. It looks so fresh and gives you the original taste of seafood. The price is fair I will say. And the place is kinda small, there's only about 4 or 5 seats for you to eat inside the restaurant. But it offers delivery and takeout. Overall, it's a nice place to come and try."}
{"text":"Food is fresh and delicious. Had the Po-ke Special Bowl with ahi tuna and salmon on brown rice. Staff friendly. Would highly recommend."}
{"text":"My first time trying a Poke bowl, and it was exactly how I imagined it. Sushi in a bowl of salad.  I got their special, most popular bowl. It was good and tasty. The Salmon was well flavored and seaweed salad in it was delicious. I opted for spinach, but next time I'd ask for half rice and half spinach.  Nice service there. Just heads up the seating is tight there.  I thought it was a tad expensive though. One regular size bowl and drink was nearly $20. Not something I'd splurge on daily, but a definite treat to myself."}
{"text":"Nice place,it is refreshing to have an introduction of a poke place in Calgary. Fish quality was good for a restaurant in Calgary, and regular portions are adequate. The various selection of sides contributed to the multitude of textures. Only downside is parking related, and is get busy, parking further away may be necessary. Definitely worth to come on a hot summer day."}
{"text":"Not bad. The food was fresh, refreshing, and tasty. The price was far for what was offered. Location is central but parking can be challenging. And layout of the place is definitely not busy, family, or kid friendly. There were lots of stools but only about 5 bar seats. We were intending to eat in but because we brought our 10 month old there was no place for him so we had to go. I guess that is what the set up is though - so they achieved the \"fast food\" type."}
{"text":"Improved experience from last visit.  I built my own bowl today and chose the regular size (two scoops of protein) and it was very generous portions - along with all the mixers and toppings you can choose, my bowl was full to the brim and I am full from eating only half! I chose the marinated salmon (delicious) and scallop (meh - they use the mini scallops so the texture it's off) but I liked everything I picked.  The rice is a bit gummy so there's still room for improvement on that.  Service was much better with a different guy and he actually took the effort to chit chat!   Also, they still don't automatically offer the loyalty card to you but gave it to me right away when I asked - so be sure to ask for yours!"}
{"text":"Great flavor, portions are good, and the price is okay. Service is very friendly and quick Been waiting ages for a Po-ke joint to open in Calgary  I've been here twice now and since my first visit, they actually are more generous with the rice and protein now. Which is great because now I think the Poke Bowls are worth the $$  Overall another great experience at Po-ke My bf and I will definitely be returning again soon"}
{"text":"I LOVE Po-ke. The prices are fantastic for the amount of food you get. I did my build your own bowl and the staff are super generous with the ingredients. I like how much fish you get. I ordered two scoops and every single bite of my massive bowl had a piece of fish in it. Ingredients, particularly the fish is very fresh.   My husband ordered the Po-ke special bowl, which I liked more than my version. Build your own is fun and great if you are watching your diet, but the speciality bowls have the balance of the ingredients and flavours/sauces done better than I can try to recreate.   I'll be back to try the burritos, hot dogs and every poke bowl. With the customer reward card, it won't take me long to fill it up. This place is a gem. So glad Calgary has an awesome poke place and it's affordable to go often.   Room for improvement... the employees. They seem inexperienced and the type that don't need to work but are doing it for fun. Nothing wrong with that - but perhaps being a bit more focused on helping customers rather than hanging out would improve the whole experience."}
{"text":"I'm a bit disappointed, this place has so much potential. I'll start off with the pros of this place and I'm going to jump right into the negative.   The variety, loyalty card and the portion. I really enjoyed seeing the toppings, choice of proteins that they offered in comparison to Toronto. However, the scallops are just the bay frozen ones you can buy at T&T. I thought it would be chopped sea scallops. The avocado are a $1 extra for two slices... I finished it 3 bites. The rice.... It was hard, and undercooked. Two tips for the owner, puree the avocado and switch the white rice for sushi rice. You will be able to mix and portion better as this option brings a softer way to eat poke.   The final straw- crab/kani, this ruined my appetite and I ended up wasting a $17 bowl. I don't know if this was a bad day, but the crab it tasted so old, and had a very dry squid flavor- like nuoc mam ugh. WHY.   I know this place is new, but man the service and the knowledge of the staff... Sloppy. I felt the place was run by teenagers and I was hoping the owner was there especially if it's a new business. I started off with choosing my base from one worker, literally just the rice part and I waited 5 minutes to choose my protein from another worker because apparently it's hard to scoop 3 protein into my bowl. She stood there, at her station doing nothing. Didn't reassure me that someone is going to help me with my fixings. The guy who started mixing my protein literally flipped it once with some sauce, and just dumped it into my bowl. (he was stressed to see more customers flowing in)   I wanted to love this place, but I don't know if it's worth it knowing there is better options out there."}
{"text":"This place is quite impressive for being a poke place in the prairies! The fish is pretty fresh and the flavours are definitely all there. It's great that they offer parking in the back as well because the location isn't the most ideal for parking."}
{"text":"Food was fresh.  Got build your own.  Liked that they had scallop option.  +$2 for tuna.   Fish was fresh.   Found that price adds up though.  Ended up paying 3 scoop $18 for a build your own which was tasty but small portion size."}
{"text":"Really good Poke! Fresh fish and lots of options for toppings and sauces. However Im disappointed they don't have plain wasabi only wasabi mayo. So surprising!"}
{"text":"Waited until the hype for this place died down a little before trying it. I was excited to see that poke was finally available in Calgary and hoping that a place specializing in a limited menu would offer high quality ingredients.   Found parking irritating here as I only saw street parking with most of them being permit only. I asked when I was inside and they did say that parking was available behind the complex.   The place is much smaller than I thought, with very limited seating to eat there. I would not recommend for people with children to attempt to eat there as I did not see any chairs suitable for kids.   The only difference between a large and a regular (from what I could see) was that they add 3 vs 2 scoops of the protein of choice. I opted for the traditional as I wanted the tuna while my bf chose the special. We both selected the spinach for the base for a lighter option.   Probably an unfair comparison after eating sushi/sashimi in Japan, but I found the bowls in general lacking a lot of flavour. I found the traditional barely had any flavour that I even took the bowl home and added mangoes to it. The special was a bit better and had a bit more flavour as there were more toppings to it but overall, both bowls seemed like something I could easily whip up in my own kitchen. The seaweed salad in the bowls reminded me of costco's packaged seaweed salad and I didn't feel like either of the tuna or salmon were marinated enough or of amazing quality.   We also tried the hot dog which was actually pretty good - a tad on the salty side but a great value for the dog plus a pop. It would be a nice option for someone who wants to eat here with friends but maybe doesn't want any seafood.   The staff were nice enough at the location but someone had been eating Tim Horton's while working the cash and left a bag of half eaten chicken wrap or something next to the till. Gross. Seems like mostly younger kids working here so maybe they need a little refresher on working in food. I lost my appetite while paying for my food and then taking it home to find a underwhelming quality of tuna and salmon.. I would maybe build my own bowl if I decide to return next time.  I would still give this place a try if you are looking for a poke specialty place in Calgary as I have heard many rave about the place and maybe I just visited on an off day."}
{"text":"While my less food-adventurous kids were busy, hubs and I took advantage, and went for dinner at Po-ke.  I totally enjoyed the Special Bowl, with half lettuce and Hal spinach- impressive with very huge servings of protein and really intriguing and delicious sauces.  Hubs had the Cali-sunset sushi burrito and found it very filling- so packed with food, was actually hard to keep as a burrito. My previous experience with a poke bowl did not have such huge protein servings, so I was impressed.  There is very limited seating here, so be prepared to take away- Rotary Park is close by, so could offer a nice view to enjoy the food.  It is also a bit pricy- obviously reflected in the large portions of protein- but worth it as a more impressive and healthier option for \"fast food\"."}
{"text":"Japanese Hot Dogs! Heck ya! This place is delicious! Getting here by bus, walking or parking from a distance; It is worth the visit. Although the menu appears small with limited choices, the picture of the hotdog and the ingredients made me drool. Ordered me both hot dogs on the menu and let me tell you, it was Epic! Has the same sauce which they use for dragon eyes sushi for \"the sumo\" hot dog. The \"Po-ke hot dog\" sea weed was okay texture almost felt like spinach so I'm not a real big fan of those greens but it still tasted good. I kinda hoped the hot dog itself was bigger but it worked out as it is. They have Different selections of drinks that were foreign and some common canned pop. Dining is quite small inside but I suppose its fast food, plus there is two patio tables outside. Haven't tried their bowls but people tell me it's filling, so I'll have to come back here again and see for myself. For a shared washroom, it is well maintained. Staff is very friendly. Recommended for newcomers and hot dog lovers. Definitely go and give this place a try."}
{"text":"Delicious and fresh! The large is a generous portion of protein! A new favourite for sure"}
{"text":"Great addition to the neighbourhood.  Bit too noisy for us old guys to eat in but the young ones seamed to like it.  Do not understand the food but had a special on brown rice.  They were very kind to explain the menu.  Owner is not a stranger to quick service knows how to train his staff and it shows great customer service everybody had a great attitude.  I thought it was excellent value and will return.   The food felt \"clean\" they did not cheap out on the fish or the avocado and the sauce was fresh.  Now if they would only turn down the music so I could hear what they were saying."}
{"text":"The girl in my office won't stop talking about this place so naturally I had to try it out.    Wish it had more space to sit and eat felt like it was more of a subway. Witch I wish it operated like as you can see all the toppings but it's just pushed through seemed a little unorganized. I don't think I even got what I ordered.  I do have to say that I did enjoy my meal and I will probably order from this place again"}
{"text":"Came to Po-Ke in the evening.  This is a place where you place your order at the counter, they make it and at the other end of the counter is where you pay.    I ordered the Po-ke Special bowl.  As your order moves down the line, you can basically watch them craft your meal.  I must say that I wasn't overly impressed with the way in which my meal was put together.  Small ice cream style scoops were used to basically scoop and slop the ingredients into the bowl.  The person making it seemed to not really care about the manner in which the ingredients were going into the bowl.    Once the bowl is prepared a lid goes on it, and you are at the cashier.  I have an issue with places that make you tip prior to an experience of the food or service.  This is basically a take-away place that has a few places to sit.  When the minimum expected tip is 15%, it seems overly excessive for effectively zero effort on their part.  I was told that if I tip, I need to select it at the cash register.  Once I swiped my card I was presented with another prompt to tip !  Po-ke needs to fix this... This is something that just pisses me off.    Once I got my bowl, I was surprised, by really how small the fish portions were compared to the oversized portion of mandarin oranges.  The salmon and tuna combined was about half as much as there were oranges.  I have to say the flavour combo was really not a good combination. The sauce they put on the fish is a bit sweet too.  This to me is just not what proper Poke is supposed to be.    For my 15% tip, I had to clean up my own bowl and while I was eating, I did not once see any of the staff go tidy up any of the seating areas.  Don't get me wrong, I'm ok tipping as long as you can see evidence that the folks are working hard.  Needless to say, there wasn't evidence of this.   Overall, it's a swing and miss on the food at Po-ke.  I've been to Hawaii, the birth place of poke, and this is not the way to do it.  The service was lackluster.  I will be trying the other options out there for Poke."}
{"text":"Awesome food, very well organized. You get a lot for what you pay for. Tina is very helpful and friendly. Will come back and recommend to others!"}
{"text":"Po-ke serves great bowls, but poke purists need to keep an open mind when they try this place. Calgary has super expensive fish (duh, we're landlocked) and there's a lot of filler in Po-ke's bowls that you wouldn't see in traditional Hawaiian bowls (see my pics of Coco Cove if you want to see an example).   From my time in Hawaii, traditional poke bowls literally comprised of only two things: tuna and rice. However, Po-ke's bowls are very refreshing since there was so much variety in a bowl. I highly recommend adding mandarin oranges and pineapple to your poke bowl for additional flavor blast.   However, the most important thing when I try anything raw isn't portion control: it's freshness of fish. The fish at Po-ke is super fresh; the trays of fish deplete and get rotated out super quick.   You can pick their special bowls or you can make your own bowl. I noticed making your own bowl garners larger portions but Po-ke isn't generally stingy and the bowls are very filling.   And if you're not into raw fish, you could always get tofu as your \"meat\" for the low price of $10!  Go give Po-ke a try, they're so worth it!"}
{"text":"I love poke - like a lot!! Its borderline addiction so I'm glad they have a stamp card where if I buy 7 I get one for free haha   I usually get the large poke special bowl (16$) which includes a base of either rice or spinach, three scoops or fresh diced fish and veggies. I get a half brown rice and half spinach base with two scoops of salmon and one scoop of tuna mixed with their signature sauces - you can also do marinated fish or have the sauce on the side. The veggies include avocado, seeweed, masago (fish eggs), orange slices topped with dried seeweed. I like the combination of these flavours and it is really yummy!   You can also choose your own bowl with your choice of protein and veggies as well! The regular bowl is the same thing with 2 scoops of fish instead of 3. They have present scooping bowls which is good in that it avoids server variability in how much fish or veggies you get but I still find that sometimes it does happen! Sigh   Other things to note: There is limited seating inside this restaurant and no wifi; Free parking at the back and a Starbucks across the street for some coffee post meal! Overall, I like the poke special bowl so much that I haven't tried any of their other bowls - would definitely recommend if you like raw fish/sushi!"}
{"text":"I just love how this is presented and I get to build my own while seeing all the ingredients. It is the perfect Keto meal.... can't wait to go back"}
{"text":"I used to be a huge fan of this place! It's a bit far from where I live, so whenever I went, it was a real treat. I haven't ate here in months so when I had the opportunity to go today, I was very excited. I got regular two scoops of shoyu salmon with the signature sauce as well as many other toppings. I always get the same thing and in the past it tasted amazing. It used to be so fresh and flavourful. But today, I was extremely disappointed. The salmon was a bit warm, and although it was supposed to be marinated, it was flavourless. The rice had a very weird texture. I am just sooo disappointed and I truly feel like I wasted my money. I ended up eating a couple spoons, which were really disgusting, before throwing it out and just ordering McDonald's. I know Po-ke can do better but unfortunately due to my experience today, my family and I won't be coming here again."}
{"text":"Went on a Sunday afternoon for an early dinner/late lunch.  The person who prepared my bowl that day was attentive and pleasant, he didn't skimp on anything and places toppings carefully, that can't be said about all of the staff though.  In the couple times I've been there, my experiences have been consistently good. Po-Ke is definitely a great place for a quick eat."}
{"text":"I came on opening day and it was well worth the wait, even though they had almost run out of protein! I have come a few times since and each time is delicious! The staff are friendly, but sometimes seem a bit unorganized (but they did only just open so I think this will become less of an issue). I've had a couple different poke bowls, the SumoDog, and a sushi burrito. I'm not sure but I felt like the burrito had msg because I felt extremely drowsy after eating it. Other than that, no complaints! A tasty, healthy meal!"}
{"text":"With two of Calgary's recently opened Poke shops opening within a week of each other, it's tough not to compare. Despite the more convenient location of Kona Poke for downtown workers, I have to say that I much prefer Po-ke to the +15 alternative.  With similar price points, I have to say that Po-ke has better value (despite Po-ke charging an extra $2 for Ahi Tuna). Po-ke has a wider range of toppings available and the portions are more generous. I love the variety of toppings, from edamame beans, tamago, crab salad, garlic chips, to onion crisps! I customized my own bowl using a brown rice base - the rice was flavoured with the right amount of vinegar and the texture was on point. I had put in so many toppings that the customer standing behind me had asked which bowl mine was (I should totally have my bowl as a listed choice on the menu!). On top of my customized bowl, I also ordered their spam musubi. Already feeling full, I had forced my brother to share with me just so I could try it. Even though he was full to the rim, he complimented that the rice was soft and tasty (legit Japanese rice) and stated that he could've order 3-4 of the musubi's as a meal in itself. Although a line was present when I arrived, it didn't take long to get my order. The assembly line was efficient with a sufficient number of staff in store. Surprisingly, the bowl got to us sooner than the musubi did.  Poke bowls are definitely a treat due to its price point, but I can see myself returning to Po-ke when I crave for some fresh tasting and healthy meal. I only wish I had known about the loyalty card when I was there (not sure why staff didn't offer or advise customers of a loyalty card). I'm sad to know I missed out on some stamping action, but will have to remember to ask for one the next time I'm in store."}
{"text":"As a fan of poke in general I enjoyed it. My husband on the other hand didn't like it. He's never really been a poke fan I think, even at other restaurants. I found it tasty and filling. I think with my next bowl I will be building it with my own toppings myself. It wasn't terribly busy but I got the feeling the assembly line wasn't the most efficient so I can't imagine how chaotic it must get during a rush. Any other dish outside of the regular poke dish seems to throw off the groove. The back is quite a bit cramped so having several people behind the counter looks \"uncomfortable.\" Hopefully my next visit will be more efficient. As a former Subway sandwich artist we used to start from the beginning and build all the way to the end. It seemed efficient. I've seen other locations delegate stations and I'm not convinced it works as well. Anyhow...enough about my rambling on about behind-the-counter efficiency. My point is that I felt I waited longer than I should've for cold food with no line in front of me. Next time it should take no longer than 3 minutes start to finish to make my poke bowl. Boom!"}
{"text":"The atmosphere is friendly and is a rather cozy place but unfortunately with hot rice out of the pot with cold sashimi cubes in the same bowl, they don't work. The hotdog was not good. Over cooked, cold bun and basically dog in bun plus little extra seaweed and mayo."}
{"text":"There are some good stuff about this place  I got the Poke Special Bowl. The fish were fresh and the portion was big. The scooper spoon they used was big. They were very generous on the fish. Only thing I didn't like was the rice as a bit hard. I wish it was more soft and warm. But overall, I loved it. Good big generous portion for the price I paid.   Too bad the restaurant is not in downtown. It is a bit of a walk from my place (downtown). Definitely can't come here during lunch time.   Highly recommend giving this place a try."}
{"text":"Its effectively all the stuff you use to make sushi crammed into a bowl. Pretty fast service, great food quality."}
{"text":"So many choices and very delicious. Also, great value for what you get. I would definitely recommend!"}
{"text":"Finally, Calgary has hopped on the poke bowl train!!! I've been wanting to try Po-ke since they opened but I knew that it was ALL the hype so I waited for it to die down. After helping my friend move some furniture on a Friday evening, we were hungry. We were looking for something on the healthier side when I remembered Po-ke. We put Po-ke in google maps and it took us to Centre street NE. It was around 6:45PM and parking was easy to find. Even after all the hype, there was a little line and the place was bumpin'. They offer, poke bowls, sushi burritos, poke dogs and musubi which is spam on rice wrapped with nori. For the bowls, you can get regular size (2 scoops of protein) or large size (3 scoops). Mandy decided to go with the po-ke special bowl with a spinach base. It came with Ahi tuna, salmon in the signature sauce topped with seaweed salad, avocado, mandarins, masago, sesame seeds, shredded nori and drizzled with unagi sauce. I decided to go with the salmon bowl with a half brown rice, half spinach base and it came with salmon tossed in ponzu topped with green and sweet onion, cucumber, corn, crab/seaweed salad and topped with sriracha aioli. The lined moved, it was neat watching them work fast, they have a good system going.   They also sell Well Juicery drinks as well as other beverages. There is some seating inside but not a lot, kind of bar style seating. They have a couple of tables outside which is also nice. Mandy and I took a table outside, we were super excited to try these poke bowls. It was love at first bite! Fresh fish, fresh ingredients, just so refreshing!! I love how everything went well together, it felt like such a light, healthy dinner...just what we were looking for. We were MMMMMM'ing while eating, it was silent for the most part unless we were talking about how good the bowls were.  I noticed a lot of people ordering skip the dishes/uber eats and recently a friend told me she ordered from Po-ke and said she was impressed.   I guess my only complaint would be that they need a garbage outside. It's not a huge deal but it makes sense to have a garbage/recycle bin outside when you have a seating area and use plastic bowls but otherwise, everything was fantastic and I could literally eat poke bowls every day if I could and not feel any guilt! Though, next time - I will customize my own bowl so I can get all the toppings I want!! :) See ya next time Po-ke!"}
{"text":"Yum!!! This place was incredible and their options were out of this world. I loved all the different ingredients at no extra cost, like mandarin oranges. If you like sushi and poke, look no further as this is your spot."}
{"text":"The ahi tuna bowl was quite good.  It was filled with all kinds of tasty and healthy stuff.  The sushi burrito looked awesome too"}
{"text":"The first time coming here I was excited the line was long but staff are nice. Food is average. But my stomach got sick a few hours later, maybe because the fish is not cold enough & been sitting there for too long. I got one of their signatures but didn't like it so I usually get the make your own bowl. My first experience was horrible I swear I would never go back but I find myself going back because of the craving for sushi. I'd rather get a bowl than go to a sushi restaurant."}
{"text":"Review: dinner.  When I first heard about the concept of poke, I was thrilled because it was such a brilliant way to utilize Japanese ingredients. Po-ke was the first restaurant to offer it so I had to experience it myself.  Bottomline: good execution of their poke bowls, but ingredients were somewhat standard and left me wanting more out of the poke bowl.  Atmosphere: small cafe style restaurant with limited sitting. Decor was modern and refreshing. Service was good and quick.  Food: if you like sushi, you can't go wrong ordering a poke bowl. It's essentially all Japanese ingredients mixed into a bowl. Their execution was done well. Ingredients were fresh and everything was balanced well, but their poke bowls weren't all that special. It's a fairly easy dish to make at home with the right ingredients. The poke bows here unfortunately pales in comparison to the ones I had in Vancouver.  Value: reasonable prices for the amount of food you are getting, although lately it seems they have skimmed out on the sashimi portions of the bowl."}
{"text":"NEITHER QUALITY NOR QUANTITY  It makes me sad that people think  this place is any good. I had their traditional poke bowl. The tuna did not taste fresh at all. It looked like it had been lying out for a long time . A decent marination of green onions and lemon juice could have saved the dish,  but even that was not well done.   I got the large bowl for $18 - for which I got about one tablespoon of meat . I hope to check out the other poke place and see if it's any better.  If not , I might just stick to sushi.    Yes, they do have a lot of sauce options, but that is designed to cover the taste of the fish - which tastes rather stale.   In the meantime I'll fantasize about the poke I had in Hawaii."}
{"text":"Nothing Special about the PoKe Special Bowl (their signature item)  Nothing to write home about. I've been on a Po-ke kick recently and have been trying different places. A po-ke bowl is meant to be a healthy alternative to the usual lunch meal. What I have found is that many establishments ruin otherwise fresh ingredients with heavy sugary sauces.   Po-Ke is no different.  We were told that their most popular item was the Po-Ke Special Bowl. It was a bowl of mixed ingredients that you find in most places, but ruined by canned mandarin oranges, farmed salmon and a bunch of sweet sauces negating any nutritional benefits of an otherwise healthy bowl of ingredients.   We won't be coming back."}
{"text":"This is my family's go to place for poke. Fish has always been fresh and so are the numerous toppings. You could make so many combinations and never eat the same one twice!  I also love their Spam Musubis, one of my favourite foods from Hawaii. I make my own but, this is way easier (when they're not sold out)! I've tried the burritos and they're pretty good, too. Just make sure you eat it there as they don't hold up well after travelling home.   I've tried the others but, Po-ke is the best of the group. Portion size to the price is right on. The most choices for toppings and sauces. Spam musubis.   The only 2 suggestions I have is: 1. I wish they had a kids (kekei) size. I have great difficulty eating a regular size bowl. Thankfully, my daughter loves that as she make a midnight snack out of it.  2. Please add furikake to your toppings! It's used so much in Hawaiian cuisine, makes a Spam musubi taste even better and would take a poke bowl to the next level!"}
{"text":"I ordered the build your own poke bowl with 2 scoops of protein. I've been to other poke places in Calgary and I have to admit that Po-ke is the most generous with their proportions of fish. The spicy tuna is actually spicy, which is the way I like it. There were lots of choices for toppings and sauces.  We also ordered a sushi burrito. The flavors here were not as good as the bowl. Needed a little more salt or sauce. We also tried to order a spam musubi but were told it was sold out. So in order to feed my little one, the staff there, who were super friendly and accommodating, made her a mini rice bowl with hot dog wiener, veggies, and teriyaki sauce.   Overall, it's super clean and trendy looking, staff is friendly and helpful, food is above average so I gave it 4 stars. There isn't a lot of space to sit or stand (when it gets busy) so that's one downside."}
{"text":"I have loved Poke since I first had it in Hawaii, so when I first passed this restaurant it was definitely on my must-visit list! I love the make-your-own-Poke option as I am a picky eater (I hate onions) and I like to try different sauce combinations. They have an abundance of fillings and mixes here; the fish is super fresh and I appreciate the option of seasoned, spicy (with mayo), or sashimi-style fish. My go-to combo is a scoop of special scallops, salmon, and then mandarin oranges, tamago, masago, cucumber, edamame, seaweed salad and crab salad! I mix up the sauces but I really enjoy the truffle ponzu and house sauce, with roasted sesame and wasabi aioli to finish. Service is fast and the servings are big. I come here every chance I get!"}
{"text":"Second time and I must say it was definitely an improvement over the first time I was here, which was literally the second week of its opening so of course there would be some edges that needed smoothing. Now if you've never been to a Poke joint it's essentially like a Quiznos or a Subway except with sushi-like ingredients with rice being your bread. I do recommend making the choice of one of their pre-made/menu Poke items instead of making your own the first time around. Like everyone else it seems, I personally like their Po-Ke Special bowl. Food is great, they keep it cool and there is a staff member right at the beginning of the ordering line washing dishes so you can see they keep cleanliness very important. It's seafood after all. The service was polite and helpful and much quicker than the first couple weeks. My girlfriend got one of the Sushi Burritos and although delicious, it regrettably fell victim to a non-experienced wrap artist and fell apart. So she ended up eating it like one of the bowls after all. I find that Po-ke is moderately priced. If you're-a cravin' you're gonna drop your dime here. It's seafood in Calgary after all so don't expect value meal prices. Compared to my first visit I was happy to see they upped the rice serving, and maybe I was hungry but dare I say the protein game upped as well? Po-ke can respond on that one if they like but even if they didn't, the gratuitous serving of rice was more than enough to keep me happy. And definitely coming back!   Only cons were the staff still seems a bit inexperienced; sushi burrito fiasco didn't instill confidence in the product(s) being sold or suggested. Wish there was more condiments, only seemed to be two sriracha and two bottles of soy sauce when I was there. Maybe they ran out? Should leave some of the finishers in shaker cups around the shop to allow customers to try them if they didn't get the opportunity the first time. Suggestions for DIY bowls/wraps would be helpful along the process (especially for those customers that hold up the line for everyone else). Get the staff more involved and help describe the product's tastes and textures to help customers make decisions.   Besides that, I hope Po-ke keeps up the good work and I can't wait to see what's in store for the future. Perhaps seasonal specialty menu items? Uni Po-ke anyone?  #Yum"}
{"text":"Ah-mazing! After many months of stalking them on social media, waiting for their grand opening, they have finally arrived and it was well worth the wait! The fish is incredibly fresh, the toppings are unlimited and there are just SO many combos to choose from I just had the hardest time picking just one, I wanted to try them all (pokemon reference anyone?).   You have the option of picking a pre-made combo off of from their menu or you can make your own poke bowl. I decided the option in the middle and choose the 'hurricane bowl' as I still got to choose my own toppings and type of fish, but they simply just mixed it with their signature poke sauce. You can select between having brown or white rice, or even spinach as a base (for all you healthy people). They don't skimp out on the protein and serve up a decent size, which is great as fish is the main star of the bowl. My girlfriend tried the salmon bowl and LOVED it. I had  bit of her's as well and agreed it was fantastic.   With other awesome menu items like the sushi burrito and fancy Japanese hot dogs, this place will have something for you! The staff are very pleasant and efficient and the prices are also really reasonable. Heads up there's not a lot of seating, but it's a great grab and go lunch. With the customer loyalty program, I will definitely be returning soon!"}
{"text":"Love this place not only because it was literally the only and first poke place in Calgary at the time but their sauce was good, salmon and scallops tasted fresh and when you ask them for extra fried garlic, onion or seaweed at the end they don't charge extra for that which I was happy about"}
{"text":"I wished that Po-ke would cover their sashimi and the rest of the food.  I'm sure that fly I saw yesterday was the same fly I saw over 2 months ago!  The staff does not even seem phased by that fly!  I had to shoo one away 'cos it was sitting on the counter where they prep the salads near the cashier.  Gross!!   If they come up with covers for their food, when people are not around then the food will be fresher.  And what is with the skimping of the loyalty cards?  If one eats at your restaurant, you'd better have those loyalty cards ready for customers.  Don't say the loyalty cards are still coming.  I heard the same comment over 2 months ago.  I've crossed over to Kona Po-ke.  They are much cleaner."}
{"text":"Soooo damn goooood 4.5 stars  We definitely needed a place like this in the city, the reason for the 4.5 stars is only for lack of seating. I have already been a few times with my husband, even though it is out of the way for us, centre street is still so easy to get to without the fight of down town traffic and parking to deal with.  I went in last week with two of my girls who were dying to try it- as the lunch rush was starting,  we were lucky enough to miss the huge line up to the door and were able to grab 3 of the 5 window seats.  Nice small easy to follow menu, only thing is if you want tuna its an extra $2 charge depending on what you order.  It might be daunting for the first timer but the guys are very friendly and probably get asked repeatedly how to order, were very patient and friendly with the newbies.  I got the poke special bowl and asked for the marinated salmon and tuna and I wasn't nickel and dimed and asked to sub the fish eggs for extra seaweed and wasn't charged extra for that either, LOVE that these owners know that not charging extra for such minor things keeps the customer happy and coming back.  The regular sized bowl was a pretty significant meal, couldn't imagine how much food would be in the large.    For about $14 its well worth every penny.  Also love the loyalty stamp card WHICH I LOST and was 1 stamp away from my freebee :(  WAAAAA  Great place, great guys running it. Thank you thank you thank you thank you thank you, please open a location in the burbs, preferably Northern Hills area, you guys would kill it there!"}
