{"text":"Food is delicious! Establishment is very clean and great customer service. The menu offers great variety, you select the items you like. Atmosphere is not too noisy and music is at the perfect level. Will be coming back again."}
{"text":"I literally created my yelp account so I could leave a review for this place. The food was fresh, tasty and OMG affordable!  I was here during lunch and the place was only moderately visited probably because it is so new... If they keep this up they will be packed every day.  Can't wait to eat lunch here often!!"}
{"text":"So good, so fresh and the price is right! I highly recommend this place and the staff is super friendly! I'm obsessed with poki bowls and decided to give this place a try, I'll definitely be coming back more often!  I got a regular bowl with white rice, spicy tuna, and salmon with the house sauce and house spicy on the side(super good). The toppings I got were avocado, seaweed salad, crab salad, masago, seaweed, and fried onion."}
{"text":"Pokedon just opened across the street from my apartment which is dangerous. I've been there multiple times already so I'm thankful they have stamp cards to earn a free bowl! I always stick with a mix of brown rice and mixed greens with spicy tuna and tuna. They let you try all the sauces and most toppings are free and they don't mind when I ask for a little extra of some of them. It is very clean and sanitary inside and the staff is friendly. I highly recommend giving this place a try if you love poke bowls because they don't disappoint."}
{"text":"Refreshing, light and soooooo flavorful!  I got the fresh tuna with the spicy house sauce and a variety of toppings.  The flavors combinations were amazing!  Anytime I'm in the area, I will definitely be back!  Please put one in North Phoenix!"}
{"text":"How have I not had a Poke Bowl before? Delicious, great price, friendly staff. I think I've found my new regular lunch spot! If you like sushi, you'll love this place."}
{"text":"Delicious,  nutritious.  Great customer service.  Go now.  The brown rice was really tasty under all the great poke toppings.  Lots of savory and spicy sauces to choose. Refreshing green ice tea"}
{"text":"Went to Lunch Monday at Pokedon. Enjoyed it. Great portions, friendly staff.  I highly recommend it for a quick lunch away from the office. I had spicy salmon  with brown rice and it was excellent.    Rich in Tempe"}
{"text":"Best poke ever! My boyfriend got me addicted recentlynand I go in at least once a week (if not more) I crave it all the time. The place is always clean and the people working are always very friendly. It never takes long either! High ratings for Pokedon!"}
{"text":"Spam on my phone about this restaurant. Been there and service was terrible. The ad popped up from yelp stating hot new restaurant.  This tells me that they would rather pay to advertise than pay for good employees."}
{"text":"Food quality is great, place looked clean and well kept. Service was great, very attentive and let us try a few sauces. Love having the choice of jalapenos and mangoes as well.   Everything was great EXCEPT portion sizes. Ordered a large, very disappointing, had way too much rice compared to my protein and toppings. It was also apparent that they try to skimp you when serving you, they are very careful with their scoops.   If they want return customers they need to get their portions right. The amount of money they will save by skimping on portions wont matter when they can't stay in business. If the portion sizes would have been bigger I would have already returned more than once.   Their local competitor is opening down the street, their portions are great, please learn from your competition!! I would really like to see this place succeed as there is only one other competitor in the valley and I work very close to this location."}
{"text":"Went in on a Friday night after seeing some pretty positive Yelp reviews and wanting to try a new place. Learned that this location has only been open about 7 months. (Not a bad thing). We always like to try new places and were excited to see that it was pretty close to home.   I do like that they give you the option for wonton chips here. I got half rice/half chips. They also have the usual fish options, but I did notice that they were not as cold as some of the other places we have tried. They have a good variety of sauces, and the toppings are all included in the price.   I did check out their website, It is a bit confusing to maneuver through it and you have to scroll down a bit to see their menu.   Employees were friendly, and attentive even letting us sample some of the sauces before we committed to them, which was very nice.   Place itself is clean, and well maintained, Employees were cleaning through out the time we were there, when there was no people in line ordering.   We will probably be back since it is so close to home, and we did enjoy the food. Only complaint is the large portion did not fill up my hubby and was slightly on the smaller side. Like I said, I ordered half and half and it seemed like I had more food than he did."}
{"text":"Great fresh fish. Excellent portion size. Great selection of toppings, sauces. House garlic sauce was delicious. My son also enjoyed the steak teriyaki for nonfish lovers."}
{"text":"Favorite poke place! Everyone here is so friendly and helpful, and the food is amazing. Highly recommend this for brunch, lunch and dinner or even just for a snack! The menu offers a variety of other foods besides poke itself, and the toppings for the poke are pretty unique, I especially love the mango:)"}
{"text":"During the soft opening, which ends tomorrow (2/19), they're offering $6 regular bowls and if you check in with yelp you can upgrade to a combo for free which means you get a free drink and soup.   Love that they offer mangoes and jalapeños as sides. That's how true Hawaiian poke bowls are mad. Avocado is the only side that costs extra. They have a lot of different sauces and toppings. Lots of variety all around! All of the ingredients are of good quality. I like that they don't charge extra for yellowtail. I got salmon and spicy scallops in their spicy mayo which has a great kick.  They also have other food options aside from poke. They have appetizers and food from the kitchen such as fried rice and rice bowls.  Cons: portion size. Not sure if it was because they were offering $6 bowls or if this is their normal portion size but  I noticed they were being very careful with how much you were getting, I didn't even get a full scoop of salmon.   Customer service was great. I'll be back"}
{"text":"Delicious and fresh. A great local option, but it would be worth a drive, and it is cheaper than a Hawaiian vacation. Looking forward to returning soon."}
{"text":"Fantastic find! Wish I could take the place home to MN! We got takeout- very fresh, great concept- loved it!"}
{"text":"Love the pokérito. Been here several times. Staff is very keen on helping you right away. Their teas are strong but excellent. Marinated Tuna is my favorite!"}
{"text":"First time I stumbled across this place the service was really slow, but the quality of the food brought me back.  The second time around, they were lightening quick.  Always polite, with generous portion sizes, and plenty of options to make sure you leave happy.... And you will.  Definitely recommend this place is you're into poke."}
{"text":"OH MY GOD!!! This is the very best Poke I have EVER had! I come from LA where sushi style restaurants are on every corner and I have NEVER tasted anything so wonderful! I had the staff surprise me with a bowl of their own design and was BLOWN AWAY. I would give these guys 10 STARS if I could. WELL DONE GUYS!!   I salute you!!!"}
{"text":"So very happy to feel like a piece of home is literally across the street from me! Being from Hawaii and growing up on poke ALL THE TIME, seeing the popularity of it grow here in Arizona is exciting! What's cool about this place versus old school poke ways, is that you can really deluxify your bowl by being specific to toppings,  and sauces. How cool! Its neat to see poke becoming so popular when I already knew it was so delicious! This location does an excellent job. Everything is very fresh and so far seems like my best poke bowl experience yet in AZ!"}
{"text":"Really good poke bowls.  We ordered take out via the app and our order was ready when we got there.  The poke bowls tasted fresh and flavorful with good seasoning throughout without needing extra sauce (we asked for some on the side just in case).  We also ordered the tofu tempera with dipping sauce -- very yummy.  I didn't realize they had ramen until we got there otherwise would have tried that.  The poke trend hasn't really hit Tucson yet, but this place seems unique in that there are plenty of hot foods on the menu as well which is great!  The main reason I can't give 5 stars is the amount of protein seems meager. Otherwise the food, staff, and set up was terrific."}
{"text":"This place just opened and it's amazing! Very friendly staff, fresh food, and delicious. Too much rice, not enough protein. $1 for avocado is a tad much for the amount that you get. Once they figure out the proper portion sizes this will be my go-to spot!"}
{"text":"FRESH! Their fish is fresh and sustainable which I LOVE The portions are great and the staff super friendly. I highly recommend this place to anyone interested in sushi or fresh fish.  The business, although new, is extremely clean and well put together. this is a must try!"}
{"text":"LOVE LOVE LOVE pokedon. To me it satisfies any sushi cravings I may have, but it's basically a bowl of it. Absolutely love everything about this place. Basically build your own bowl. The yuzu vinaigrette is by far my favorite. And the Thai tea is simply delicious!"}
{"text":"My absolute favorite place for poke! And it is a lot better priced than most other poke places around. They are also different because they actually offer wonton chips as a base which totally adds that excellent crunch to go with the poke. Fish is always fresh and cold. Service is always kind and speedy. Plus there's tonssss of topping and sauce options available! Love it here!"}
{"text":"I've tried two other poke establishments in the Phoenix/Tempe/Mesa area and Pokedon is by far my favorite. The protein choices are fresh, they have many choices to pick from. A huge plus is that they serve nice portions!"}
{"text":"This place is awesome!!! Great fish, super nice staff, lots of yummy options. Go here!!!"}
{"text":"Best Poke bowl ever. It tastes better, fresher and more affordable than Ahipoki bowl. The seafood is more quality than what I got from Ahipoki. The whole experience was positive and the food is tasty. You will not be disappointed with this place."}
{"text":"Nice and Casual! My first time visiting the staff was super nice and helpful. I love the healthy choices on the menu and the freshness of the meat. This place is nice and clean and perfect if you're looking to grab a quick lunch."}
{"text":"Came in a few weeks after yelp told me this place was close to my apartment. I love poke so I was super hopeful this place with the cute name (Pokémon? Pokedon! :p ) would be good. It totally was. Nice and clean, the staff was very friendly and helpful when choosing options. The food was wonderful and I loved how flavorful the spicy mayo was. I plan on popping in again!!"}
{"text":"Pokédon!!!!! Fresh fish fresh produce fresh smiles! The large bowl with white rice salmon,albacore, spicy tuna! Yummy combo spicy mayo and house sauces perfect fit for the fish  add spring mix avocado and masago (smelt egg) AMAZING. Came from Phoenix to Tempe to try it worth the traffic. So good! It's like chipotle but for poke bowls !!! Will come back soon!"}
{"text":"Very good. Everything was very fresh and yummy. The salmon with salad was great. The large bowl was way too much for me and I can eat! Egg rolls and dumplings were 5 year old approved. The ace was clean and the staff was really nice. Plus they let you taste the sauces. We will be back."}
{"text":"AMAZING.   Food: everything is fresh and taste soooooo goooood. As for the portions, it's the perfect amount of fish with a generous amount of toppings . I had the regular bowl with half white rice half mixed greens, salmon, yellowtail, crab, house dressing, edamame, cucumber, green onion, pickles (made fresh and my favorite),   Service: the best service I've received in AZ for a poke bowl restaurant. Since it was my first time, the employee helping me was so patient and let me try all of the sauces and reviewed them with me.   The overall experience of the place was great. This will definitely be my go to place for poke"}
{"text":"I like Pokedon. They have good poke bowls with reasonable price. However, save yourself money, and do not eat kudon. It is extremely salty that it almost hurts your lips. The saltiest food I have ever had- no exaggeration."}
{"text":"My sisters and I came here for a light lunch and it was perfect!   Pokedon is the best place in AZ for good poke!   The fish is fresh and they're so generous with their portions! I had the salmon and spicy scallops! Both had a good texture and were a good temperature! Of course the spicy scallop isn't going to stay entirely cold after being on hot rice but it was still good regardless! The spicy scallops are marinated in a spicy mayo sauce that was light and flavorful!  All of the sauces have good flavor! Try the garlic ponzu with some yuzu and a little spicy mayo! The garlic ponzu has a nice kick and is slightly spicy! The yuzu has a citrus taste and is tangy and subtly sweet. Super amazing! Spicy mayo is generally very creamy so it's best when mixed with another sauce! It adds a nice creamy note to the flavor profile!   The service is also so great! Everyone is friendly and they help you through the process all the way instead of passing you to the next person for each step! The owners are so sweet! They really care about their customers' experience!  I'll be back for sure! Definitely hooked!"}
{"text":"So I've been trying to cut meat out of my diet but always resort back because there arent many sushi places in my area. This was my first pokebowl and I have to say I am hooked!! The peoole were AMAZING!! THE FOOD WAS BEYOND MY EXPECTATIONS & I GOT A FREE MISO SOUP FOR CHECKING IN!! My wife is Filipino & Hawaiian so this was very homie to her. Its crazy as I'm typing this I am craving more!!! THANK YOU POKEDON I WILL BE BACK!!"}
{"text":"Fresh ingredients, friendly service. The manager Luis is great and let me sample the octopus because I'd never tried it. I was not disappointed! I enjoy the yellowtail and the spicy tuna. They're totally cool if you want to get tons of toppings which is great if you're indecisive like I am.You really can't go wrong with any of the sauces or toppings. So glad poke is starting to become a trend!"}
{"text":"Found this place via yelp and can see why it has such great reviews. You can see the food as they prepare your bowl. Very fresh. Staff super helpful and nice. Will definitely be back!"}
{"text":"The only reason this place does not get 5 stars is because they don't give you enough poke for the price. Everything is great quality and I love the variety and everything the offer at high quality, but I feel like they do not give enough poke per scoop for the price like other places I've been to do. Overall I'd recommend it still and I'm still for sure gonna go and be a returning customer."}
{"text":"This place is brand new and amazing. The service is phenomenal and the food is very fresh and good. I live 5 min away from here and will be visiting a lot more with my friends."}
{"text":"I am so happy I decided to take my family here for dinner! The setting is very modern and clean. The seating has booths, tables, and high tables. Nothing is too close together or busy.  The food was fresh. The seafood options are really good. I got yellowtail, tuna, and octopus in my bowl. They have a wonderful selection of toppings and sauces. You can ask for a sample of the sauces before you commit to one. I am a fan of their house sauce.  I should have gotten a regular bowl versus a large because I was super stuffed after I ate.  I will be back again!  The staff is friendly and very helpful too!!!"}
{"text":"We've come here quite a few times, my wife gets the poke bowl and I get the yakisoba both are great. You can customize your bowls with different sauces toppings, and the free miso with check in is good too."}
{"text":"Compared to other poke places, Pokedon's portion was definitely a lot more generous. The place was spotless and service was awesome. I will definitely return soon."}
{"text":"Tasty poke bowl with very friendly service.  Sauces are delicious.  Place looks great with clean bathrooms."}
{"text":"This place is one of the best Poke places in town.  The reason I didn't give it 5 stars is because it's not consistent.  I have gone there three time and two were very good, the ingredients were fresh and the taste was high quality.  But the last time I went there it was not as good and the ingredients didn't taste \"as fresh\".  That's why I had to ding it one star.  It is fast, and has a good selection of toppings (the picked cucumbers and spicy tuna and scallops are awesome.)  I put this place ahead of Tokyo Joe's etc.  Definitely worth a visit if the mood strikes you."}
{"text":"This place makes a very unique type of poke bowl.  You first order the size of the bowl, which really only varies as to how many scoops of \"Protein\" you want.  You have a selection of \"Protein,\" from salmon, spicy crab, spicy tuna (a.k.a. spicy ahi as it's usually called in Hawaii), shoyu tuna, etc.  Then you get a scoop of regular shredded crab on your bowl.  You then choose a sauce and other \"toppings\" like edamame, green onions, etc.  I've never had a poke bowl like it in Hawaii, but it was delicious!  It is a bit pricy by mainland standards, but compared to what we pay in Hawaii for poke bowls with much less \"protein\" and without all the toppings, the price seems appropriate.  The staff was very friendly, even though we came a half hour before closing."}
{"text":"I am obsessed with this place! The ingredients are fresh and it tastes amazing every time! I LOVE the spicy mayo sauce! They also have a rewards type program where you get a free bowl every so many that you buy!"}
{"text":"3.5/5 stars but no option for half  Pros: Healthier alternative to your usual take out lunch place. Staff is friendly and helpful. Price is not bad, around $10. Lots of filler things to keep you full (helps to keep costs down too I imagine). Fish quality is not bad for Arizona  Cons: too much filler things and not enough emphasis on the fish. Got the house dressing. It's basically soy sauce with a little bit of chili. Not really good. I don't imagine the other sauces to be much better if their house sauce isn't good."}
{"text":"Incredibly fresh! From the moment we walked in, the staff were friendly and informative. The regular bowl (half spring mix and half brown rice) was very filling- couldn't even finish the rice! Each ingredient was perfect: the avocado was super ripe without any brown spots, the tuna was beautifully cut, and each topping contributed a special texture and flavor that will make your own creation unique! The sauces are amazing!! I mixed ponzu with Spicy mayo and was not disappointed.   Overall, my husband and I can't wait to go back to try more fresh offerings. The owner/manager Jennifer made us feel very welcome and even helped us understand the pairing of sauces with certain fish! Looking forward to our second taste!  Thanks so much, Pokedon!  Update: I am on their mailing list and received a complimentary avocado add on. I went in to redeem and was pleasantly surprised to find that the avocado was literally sliced fresh - see photo! I'm so tired of other restaurants using avocado mash that's been treated with citrus or preservatives- that really changes the flavor! Well not at Pokedon, they do it right!!!"}
{"text":"Small place, fairly new, but poke bowl were okay. I just wish the tuna was served cubed not shredded."}
{"text":"Visited this place on their grand opening week. The food was fresh and delicious. Owner was extremely nice and chatted up a storm with my husband. It's so nice to see that more and more good quality, authentic Asian restaurants are popping up all around us lately.  They had their BUY ONE GET ONE HALF OFF deal going at the time, which was great! Not sure if it's still going, but having that deal would've been the only realistic way for us to able to become frequent customers. I don't think their full price is necessarily unfair (we haven't been to another poke bowl place to compare, and we know sushi grade fish isn't the cheapest), but it's definitely a great place to eat every once in a while on those days when we want to splurge."}
{"text":"This place makes me very happy. It's seriously the best! Everything is always fresh and they have pineapple as a topping, which goes amazing with the fish."}
{"text":"Great food! Quick and healthy! Always a good choice for taste and quality lunch or dinner!"}
{"text":"Pretty good food and service. However I did not know where this restaurant was in this strip mall at first. I called ahead and heard \"phone number disconnected.\" This is a danger that people may think the restaurant has closed down or go to another restaurant....I asked the UPS Store representative where it was and got directed appropriately....I got brown rice and spring greens with cooked octopus, seaweed, pineapple, avocado, roe, and the free miso soup with the Yelp coupon. Excellent taste!"}
{"text":"This place was surprisingly good! The staff was very kind to guide me through the ordering process. It's kind of like a chipotle ordering format but for poke bowls. Wish they had more food options in case your not in the mood for poke. And I wish the green tea had refills."}
{"text":"I have been to poke places all over the country because I used to travel for work. This is on par with places in Seattle, and it is better than most of the rest of the country."}
{"text":"I am definitely looking forward to coming back here soon! The layout of the place makes ordering very easy (Chipotle/Subway like layout) and takes the stress out of ordering. Plus the people seem to be very helpful, at least the girl when I went in was. Ordering was very quick and the girl made sure she explained and offered suggestions on everything. My food was delicious and I was in and out in less than 5. The location is clean, the price was affordable, my food was yummy and the people were helpful. Recommend!"}
{"text":"Omigosh - so delicious.  They let me use steak instead of what was offered on the menu.  I had almost all of the toppings.  The spicy garlic sauce was incredible.  Each bite was different due to the plethora of choices.  My meal was terrific.  It was fresh and wonderful tasting.  I went with salad greens as a base.  The staff were accommodating for someone who had never been there before.  Wish this restaurant was in Northern Illinois because I would be there every day.  I know I didn't go the genuine route - but I left genuinely happy."}
{"text":"First time here.  Ordered ahi and yellowtail with brown rice, salad, cucumber, edamame, pineapple, avocado, crab salad, and seaweed with ponzu garlic and yuzu sauces.  Deliciois."}
{"text":"Super! In Chandler for work and happened across this place.   Had poke bowl over brown rice with spicy tuna, scallops and added shrimp. Topped it off with avocado and a couple of sauces and and a little siracha to top it off and made for a great dinner.  I ordered online and it was ready on time waiting for me.  I would go again."}
{"text":"Nice spacious place with many options of protein and sauces for your poke bowl! I tried spicy scallops and spicy tuna options. They were great. They are not too spicy, but there is sriracha for you to use as well as soy sauce. Their Thai Tea was not the greatest, really watery and sweet. They close at 9pm which I thought it was too early. It also has cooked meat options for the fish dislikers haha ;)"}
{"text":"Love this place! Fresh, quality ingredients. Lots of poke places popping up around town, I use Pokedon as the benchmark for all things poke now. Great value and they have a punch card to boot. Only complaint: there's only one in the valley right now and not close enough to my house."}
{"text":"so many selections, sauces/toppings/bases. I lived on Oahu for three years and spicy ahi is life.  I'm also a former employee of Ahipokibowl and I have to say, this place REALLY impressed me. Personable workers, clean environment and great location. Give Pokedon a shot, you might switch your loyalty too."}
{"text":"This place is awesome! You gotta try it everything and they are super friendly!  5 stars *****"}
{"text":"From what I have had around the area, this is probably the best poke place. Sauces are amazing and I would recommend getting a mix of garlic ponzu, yuzu, and a little spicy mayo. The sauce seeps into the rice making the whole bowl delicious!  I have tried a lot of combinations with the sauce and I am still going back to try new things. They also have other foods from the kitchen to accommodate for people who aren't big fans of raw fish. I really like the gyudon and the steak bowl.  For appetizers I would recommend getting he egg rolls. The sauce with that is also bomb. The owners are very nice and the service is always great. They have amazing customer care!"}
{"text":"Delicious food with great flavor and perfect portions.   Our crew ordered 2 poke bowls with a mix of garlic ponzu & yuzu sauce, chicken bowl, chicken katsu, Yakisoba noodles & Gyundon.  We especially liked the gyundon but everything was delicious.   Check them out, you won't be disappointed."}
{"text":"My husband and I used to order for pick up, the Pokedon bowls but after our recent experience, we have decided not to return to this restaurant. We were disappointed by how little is the quantity of the fish in each scoop and they charge a lot of money for this portion. Not only is the quantity bad, but the quality of the fish is not good either. The tuna definitely had a strong fishy smell and I got sick right after eating it. Restaurants like these should realize how much competition is around them. They can't sustain their business by charging a high price for such a poor quality and small quantities of food."}
{"text":"The food is good. The employee is very nice. She offered to let me try some samples since tbh, I have no idea of how the majority of the toppings taste like. She also asked if I wanted several toppings, no additional charges"}
{"text":"First time at Pokedon. Arrived at 11:30 on a Tuesday and there were five other diners.   I ordered the two scoop bowl, plus a seaweed salad and drink for $11.59.   The scoops were a scant two ounces each but at least they were fresh. I chose Spicy Tuna and Spicy Scallops. There was a good selection of toppings, including fresh seaweed. I added cucumber so she dressed it in sauce and then added it. A scoop of crab came with the cucumber selection. Nice touch there.   They offered five bases, such as white rice. There were seven proteins, seven sauces and 14 toppings. All in all, lots of choices.   The flavors were all bright and pronounced. I just wish they didn't skimp on the proteins so much."}
{"text":"Poke is my new OBSESSION, so I was stoked to give this place a try. I am happy to say our experience was a solid 4.5 out of 5 stars (rounding up to 5) and we'll definitely go back.   So, here's a few stellar things offered at Pokedon: - Menu items other than poke, literally on their menu as \"Not Poke\" (my boyfriend was pumped to order a noodle dish, since he wasn't in theood for poke). - Fruit (pineapple) to add to your poke. OMG. Amazing.  - Fresh jalapeno slices. Yummmmm.  - Garlic ponzu sauce. Need I say more? - Samples of the sauces (before you commit) - Miso with tofu. Yessssssss!!   A suggestion I'd like to see (just one lol): - A sweet sauce of some sort (Ahi Poki Bowl has a sweet citrus that immediately comes to mind)  Also 5/5 - the service here was great. The girl who made my poke was super nice and accommodating! I can't remember your name, but thank you!!   A note on the noodle dish: my boyfriend reported that it was good, 4 out of 5.  See you soon, Pokedon"}
{"text":"This place is phenomenal! The owner and staff are super friendly, ensuring that the quality of our food and our experience is exceptional!   I absolutely loved interacting with Sybil. Her suggestions helped us decide on the perfect dish.   I got the regular poke bowl with half white rice and half spring mix. I added salmon and tuna, seaweed salad, pickled radish, ginger, cucumber and pickled cucumber.   The tenderness of the tuna and salmon were perfect for my taste. The miso soup is delicious, light and savory.   I was also able to try the Thai tea. I recommend going light on the cream if you decide to order the Thai tea.  We will definitely be back next time I'm in Tempe."}
{"text":"The food was okay but I only got a little bit of fish in a giant bowl of rice. Because of that, it is very overpriced."}
{"text":"Great service!! Very clean environment! And the food was really good! Definitely will come back!!"}
{"text":"I really enjoyed this place...could the scoops of protein be larger sure but. The food was fresh and tasty and I enjoy all of the sides so it winds up being more than enough food. The staff was friendly as well. Wish you had one in Gilbert"}
{"text":"Good food, a little pricey. Staff was helpful with my decisions."}
{"text":"Love this place and have returned several times.  My son loves the octopus and scallops and I prefer the spicy tuna. Added crab salad scoop is a nice touch and very filling.  We usually get brown rice and they can go overboard with that portion but we simply usually ask for smaller portion of the rice.  Fresh and tasty and usually not a long wait.  Ordered pot stickers once which took a bit longer but that was no problem to wait for freshly made.  Will return again real soon...  now I'm hungry!!"}
{"text":"Great quality of fish in the Poke, and very friendly employees.  A selection of other options are also available."}
{"text":"Don't bother ordering for pick up through the app. 2 bowls were supposed to be ready 30 minutes ago, but yet here we are and they just started. It shouldn't take an hour to make 2 bowls that don't even require cooking, especially when it's all set up assembly line style."}
{"text":"What a great poke spot!!!! Coming from LA I wasn't expecting anything near the poke we have in LA. Great service and great food!!! Price is great too."}
{"text":"This place is great.  Everything was flavorful and fresh.  They don't charge extra for yellowtail, which is a big plus in my book.  They also have teriyaki beef and chicken so you can take along those friends that are not poke friendly.  We enjoyed the poke and the teriyaki tremendously.  Can't wait to go back."}
{"text":"I had poke one time before and looked it, so we tried this place. The fish was fresh and delicious. You can get two or three scoops of protein, several choices for base like rice, greens, etc. Then the toppings and flavor sauces. Fish was mixed with sauce then put on top of the bowl. Have to say the bowl was bigger then I expected. Crab mixture was free to add as a topping which surprised me.   They have coke  products, green tea, and other drinks. Person behind the counter was very helpful and explained things wellmi will return when I'm in the neighborhood."}
{"text":"First time for Poke and glad I stopped at Pokedon. My server was very helpful (smiling the whole time) helping a first timer. The protein was fresh along with all the toppings. I just found a new favorite spot for lunch. You won't be disappointed at this Pokedon. 5 Stars and 2  up!! Enjoy!!"}
{"text":"The portion Was pretty small for the price, same size w ocean poke co., ahi poke has bigger size tho. Imo they used too much dressing so the veggie seems a bit wet and soaky. Dressings are ok, nothing to stand out. However, I appreciate them having interesting topping such as pineapple, pickle cucumber, and jalapeños. Also, I noticed they were not skim on the fishes. ;) Service also stand out as the girl who prepared the dishes for me was so nice and offered to let me try the sauce first before I decide. Thank you so much.  Serving teriyaki is a plus if your party has ppl who don't eat raw meat. I guess I would come back for this reason. Otherwise, i will go to ahi poke Tempe if I wanna be full or ocean co. in phx for a fresher fishes mixed.   Tips: come check out joe's Italian ice!! It's across the street!"}
{"text":"This was my first time trying poke and I am so glad my first experience was here at Pokedon! The customer service is amazing! My server was very helpful and patient while I was ordering. She went through and explained all the different steps and ingredients that go into preparing the bowl. And yes, the bowl was delicious! I definitely plan on returning to try more!"}
{"text":"This place is so good!  The food is fresh and clean. Green tea is fresh everyday. I try a new bowl combo each time I come but I particularly like the yellow tail, octopus, and spicy scallops. My husband had the chicken yakisoba noodles, very fresh as well. The staff is super friendly.  If you haven't tried this place already you need to!"}
{"text":"Alright this place is super good. So good in fact that I don't even want to write a review saying how good it is because I want to keep it all to myself, but they deserve better than that. The portions are perfect for the price. Compared to other similar style poke bowl spots in town this place kicks butt. Better wasabi, larger portions, smaller price, better seaweed salad, higher quality fish, more options, etc. The staff is really friendly and they even encourage you to try the sauces before you chose one. If they keep this quality and price I think they'll be a huge success. I've only been once, but I can guarantee I'll be back."}
{"text":"Wow!!!! So I have been loving this new Poke Bowl trend because sushi bowls are probably the greatest thing to ever happen. I've been pretty loyal to AhiPoke Bowl, but after visiting Pokedon, I think that's going to change!   First of all, it's not as expensive as the other places, and it's just as good. They don't even charge extra for yellowtail! They also have wonton chips as a base option, which I haven't seen anywhere else. I had a half/half of white rice wonton chips, and then I had the salmon and spicy scallops, crab, cucumbers, onions, roe, green onions, pickled radishes, and sesame seeds. It all tasted so fresh!   The restaurant itself is super clean and streamlined.  The staff was super friendly and helpful as well. I will definitely be back!!"}
{"text":"I've eaten here for a month or two now and have been very lazy about writing a review. I'm not sure if it's because I'm lazy (Totally lazy) or because I just want more of their seafood for myself (It's sold out before if I come later in the day). That being said, I can't stop raving about their poke. I wish I could review their hot food, but I keep coming back to their poke. I have been on a non-stop mission to share this place with friends and co-workers. So far, no one has ever given this place a bad review. Go here and save some for me!"}
{"text":"Impressively fresh and delicious! I did \"Get Hooked!\""}
{"text":"The toppings are good and there are interesting choices, but when comparing the amount of fish that is in a regular sized bowl at other restaurants that offer poke, it didn't really compare. The portion of fish was lacking, but it was good tasting."}
{"text":"Absolutely LOVE this place!!! I usually get a regular bowl with half greens and half wonton chips topped with tuna and salmon. Sauce is 1/2 yuzu and 1/2 spicy house. Add red onions, crab salad, avocado, cucumber salad, green onions, furikake and crunchy onions and call it DELICIOUS!! I eat here way too often but can't help it! Keep up the great work Pokedon!!"}
{"text":"!!!Times are changing and so is Pokedon!!!  Their prices have gone up pretty significantly in the New Year and their protein scoop sizes have gone down. My husband and I have decided the content is not worth the price anymore and will be looking elsewhere for our poke needs. It's sad to say that, because we have loved Pokedon for so long but they've just really let us down on the poke front. $12 is too much, y'all.   The new reward system is not a reward system at all. It's periodic coupons that make the bowls cost the same as they used to. Pretty shady.   The new shoyu tuna is worth a try just for curiosity sake but not worth getting twice.   You may ask: why is your review still 4 stars then? Their new ramen (sat and sun only) is incredible. Like wow, really good. It has the perfect amount of chili oil and is all over just incredible. It also comes with green tea which I swapped with Thai tea and it was totally worth it. This is worth the price. Nothing else is really right now."}
{"text":"Great poke place. So glad it opened where it did because it's right down the street from us. Bright, clean environment, friendly, helpful staff, and the food is so fresh and delicious!"}
{"text":"Great food, great service, and a great environment. I recommend the salmon and spicy tuna!"}
{"text":"Great Customer service and a nice variety of Poke.  7 different sauces.  If you order the Teriyaki Bowl they include macaroni salad which is quite tasty.  Two televisions playing sports and descent music playing. The location is great close to ASU and several freeways (101, 202, 60)"}
{"text":"Honestly, not a fan of the poké trend, but my friends are, so we went here. I was very glad when I got here to find that they had non-Poké items. I decided to try the Katsu and the deep fried Tofu and it was delicious. I would definitely go back for those things."}
{"text":"Love their house sauce, the poke bowl was really good. Also the temperature in the restaurant is perfect."}
{"text":"So I probably should have written this after my first visit but for good measure I've returned about a bakers dozen more times just to be sure. I've gone on various days of the week sometimes multiple times a week just to confirm my suspicions are true that this place is fantastic. After all my research and getting to the point where the staff greets me by name I think it's well established that this place rocks.  I work right down the street and words can't really express how excited I was to have not only a new option for lunch nearby but it be a place to get some poke, which I love. I have tried pretty much all the fish except the octopus, all the sides and a bunch of sauce combos. Every time no matter how I mix it up I always end up full and happy with what I did. My favorite is probably going with the 2 salmon and 1 spicy tuna but will mix in some yellowtail and spicy scallop once in awhile. The scoop size is a bit on the larger size compared to other spots.  The sauces are where I vary the most but almost always include some of the fantastic garlic ponzu which might as well be called crack sauce with how good it is. It pairs really well with the yuzu for a brighter flavor or the house spicy for a flavor burst with a kick.  The best part about the bowls here is that you get so much for the price, the only things that cost extra are additional fish scoops and avocado (a hearty scoop for $1). The fact that a full scoop of crab mix is included is an awesome deal. The seaweed salad is standard fare but a bit bland, and the usually add ons like ginger, wasabi, edamame, masago and green onions are what you expect of them. The side that I love is the pickled cucumber, it really backs a great flavor that goes really well to get a bit of an acid to mix with all the other bright flavors in a bowl. I tried the pickled raddish but it just wasn't my thing. I don't do fruit in my food but they do have mango available.  One extra thing that is nice is the free miso if you check in. if I have any complaint here it's that I think the miso is a little on the watered down side but it's really minor especially when it is free. Also nice is the rewards card which gets you a free bowl after the 10th for somebody like me who is here at least once a week that pays off.  Last thing I want to say is that the staff is super friendly and nice. As established earlier they know me by name which really helps since one day I left my card in the chip reader (I hate chip readers) and they tracked me down on here to send me a message my card was there waiting for me, that's going above and beyond rather than just waiting for me to figure it out."}
{"text":"Everything seemed super fresh and well worth the money. Great service. I would recommend this if you want a health meal and if you want it to be super light get the base as salad instead of rice. They have a decent amount of sauces to top it off at the end too which is really nice."}
{"text":"I was excited to try Pokedon since I'm never in the neighborhood. With a solid almost 5 stars I thought it'd be a slam dunk.  Pros: Great customer service! Very clean inside. Nice To-go packaging. Cons: not a fan of any of the sauces and I tried 3. Kinda taste watered down. Fish was ok, portion about on par for other places. Wasn't impressed by topping options, wish the cucumber salad had looked more appetizing but I already had cucumbers added so I opted out.  I won't be back as I prefer ahipoki more overall. Probably will just tell friends I had it and it's ok but not go out of my way to recommend. Bummer!"}
{"text":"I love poke and my experience here was very pleasant. The ingredients were fresh and the favors just right. I had a salmon salad bowl with an extra scoop of salmon which is only $1 extra. I was disappointed they didn't have a sushirito, what I actually wanted to order. I've seen it every time I've been to Pokinutrition in Chandler and thought I would give it a try. Pokedon does however offer a wonton chips bowl which I haven't seen in any other poke restaurant. My favorite toppings are the seaweed salad, edamame, and masiago. The yuzu dressing goes really great with the salmon. So, all in all, if you're looking for a fresh and presumably healthy option without trading taste for value, this is the place for you. Check it out!"}
{"text":"Very attentive staff. Portion was plenty and lots of variety to choose from. Came here a few times and never had issues with the seating. Wonton Chips, Ponzu sauce and the spicy scallops were awesome. The usual tuna and salmon were my must haves too. Great place for a quick meal or take away."}
{"text":"Great service. Very friendly and helpful. The food is good. The spicy tuna was ground which was a bit unexpected but I will go back."}
{"text":"Let me preface by saying I've been to Hawaii several times.  It's one of my favorite vacation spots.  And every time I go, no matter which island, I want to have some poke at least once (usually more than that).  Poke is everywhere there.  You can get it in the grocery store deli case, there are little restaurants that serve it, etc.  Great stuff.  So I was excited to see a poke place locally at 4.5 stars!  We had the opportunity this afternoon since we were in the area, and so we stopped-in.  I'll cut to the chase and say I was disappointed.  First the positives.   The staff was very friendly and helpful.  The sashimi appeared to be fresh (given that we're about 400 miles from the nearest ocean), as did the other ingredients.  You have a few different ways you can get your sashimi (on rice, greens, and with various other add-ons like cucumber and roe, etc).  And they had other options besides the sashimi.  Now the negatives.   They offer the poke in a rice-bowl format though you do have the option for \"greens\".  So they put the cold sashimi on hot rice.  This makes warm sashimi.  I've never been anyplace that served warm sashimi, from Asia to here.  No one.  And I understand why now, because it seems to trigger something in your taste saying \"this isn't right\".  Warm raw fish could be hazardous to your health, and I think the brain instinctively knows that.  Now I have no doubt this was flown-in fresh and kept refrigerated right up until they put it on my hot rice.  I'm sure it's safe.  My brain knows this.  But the taste buds are saying \"huh?!\".  My wife had it on greens, and did not experience this.  So if you like greens you should probably get the sashimi on the greens ONLY.  Next, notice how I'm calling it \"sashimi\".  Because that's what it was.  It was NOT poke.  Go anywhere in Hawaii and ask for poke, and you get chunks of tuna (usually) that have been marinated in sauce with sesame seeds and julienned onions and maybe some other stuff (seaweed, etc).  Marinated!!  I would guess for a few hours at the minimum.  The sashimi here was not marinated.  They put the sauce on 60 seconds before they give it to you.  It does not penetrate the fish at all.  It doesn't infuse at all.  In fact, it mostly goes down and wets your rice with the sauce (and flavor).  The tuna sits on top with almost none of the flavor.  (Also note that their house sauce is what the poke sauce is supposed to be; I've never had poke before that used the other sauces they offer, and I know this because they were nice enough to let me taste them first...only the house sauce is correct).  If you're thinking \"well just get some rice in the bite with the tuna\", then here's the problem:  the rice soaks up the sauce pretty efficiently.  So the flavor is actually too strong that way and you miss-out on the flavor of the fish..  If you get yours on greens you won't have the soaking-up problem, but the fish is still on top and not pulling much flavor from the sauce which falls to the bottom, so all you taste is fish (and greens).  This is what my wife described to me from her fish, though she did like the other \"stuff\" (she got the cucumber and pineapple and other things, and had basically made it a salad with sashimi in it).  In Hawaii the only flavor from the sauce that you get is that which has soaked into the fish and wet the outside of it during the marination.  It's not a lot, but it's enough to give it a wonderful delicate flavor that does not overpower.  It is not served on rice there, it's just served straight-up.  So you don't get either the heating I mentioned nor the no-sauce fish, nor the extra strong sauce flavor from the soaked rice.  I'm not sure why they do it differently here, but I don't think it works for all the reasons I just explained.  They are a bit expensive.  Really $$ if you get the large poke (the small isn't really much fish).  But I expected that since you can't get fresh raw fish in the desert without flying it in.  I did not try their other offerings, but I won't be getting their sashimi again.  Unless they start marinating the fish properly ahead of time to infuse the flavor. I most definitely have \"experienced better\", and was tempted to go with two stars, but my wife liked hers a little better plus the staff was really nice, so I'll bump it to three."}
{"text":"Fairly new and a letter away from Pokémon, this place had to be checked out.   The employees were friendly, welcoming and helpful. They had fun during the rundown too so that was awesome.   They gave us a rundown on the ordering process. First asking whether we'd like poké or something grilled.  Yes, they have options.   Thai Tea: Not as sweet but still pretty good.   Miso Soup: Typical seaweed & tofu. Not bad, just wish it was hotter. *free when you check in*    Bowl: (Lrg. 3 protein choices)  - Base: 1/2 white 1/2 brown rice  - Protein: Octopus, Shrimp, Spicy Tuna  - Sauce: House Spicy + Garlic Ponzu  - Sides: Red onion, cucumber, crab mix  - Toppings: Pickled radish, green onion, masago, furikake, ginger, fried onion  All in all, everything tasted great. All the ingredients were individually discernible. I personally feel it could've been spicier to be honest.  The price of it all was pretty reasonable ($14~) and they also offer stamp cards (1 for every 10$ spent).  Definitely will be back."}
{"text":"Great service, reasonable price, good quality,and taste.  Nice place to have a good lunch. Overall very clean and comfortable.  No alcohol is served."}
{"text":"I had been wanting to try Poke for awhile now, but they don't yet have it where I live. I came to Tempe to visit a friend and decided this was the time! And man did I make the right choice! The fish at Pokedon was so fresh and flavorful. The sauces were great and toppings were tasty as well. Huge portions left me stuffed. I ordered delivery and it was delivered within 20 minutes and was so good! Can't say enough good stuff. I will definitely be back and I would recommend to anyone looking for poke in Tempe."}
{"text":"Good poke place to go to in Tempe. Just happened to see it while in the area. Good selection. I really liked the shoyu tuna. I think I had spicy tuna as well. I wasn't feeling adventurous enough to try the octopus. But I will come back another time. Staff was friendly  Oh yeah the dumplings and egg rolls were good too."}
{"text":"I am in LOVE with this place!! The fish is so delicious, rich & fatty. There's so many toppings. They're very ingredient-savvy too which is great if you have an allergy. Looking forward to coming here all the time."}
{"text":"Just ate here yesterday and I was very impressed.  I've been to AhiPoki and Pokitrition but Pokedon tops in terms of freshness and variety.  I had yellowtail, salmon and tuna bowl with many of the standard options (seaweed salad, crab salad, edename) but I never had a PokeBowl with pineappple before and it was a great contrast to the other flavors.  I had the garlic ponzu and it was the best sauce I've ever had on a poke bowl, even compared to the bowls I've had in Southern CA where Poke has been a trend for at least 2.5 years now.    I do like that they have grill options.  I didn't try any on my first visit but since my kid doesn't do raw fish it's nice to have options for her.  One thing to note, the online menu at this time has Gyudon (Beef Bowl), which was another reason I trekked from south tempe to this spot, but sadly they don't.  They do have steak teriyaki but Gyudon is completely different.    Great place, looking to try again sometime this week.   Update:  They now have Gyudon and it's excellent.  I love their Poke but sometimes I'll come here just for Gyudon.    Have some with red/pink ginger and it's a great filling meal.  There's only two other places that I know of that serve Gyudon in the local area, one in Tukee which is also very good but a bit pricey and one in the Chinese mall in Mesa which I'm not  fan of.  Also, I've had their Chicken Teriyaki, eggrolls and gyoza, all very good to excellent as well.  Just so you know this isn't a bogus review, I had their Chicken Katsu and I wasn't a fan.  Maybe it was just a bad day in an otherwise consistently great place to eat for Asian dishes."}
{"text":"(Lyrics - Tears For Fears - Break It Down Again)  Pokedon again So those are my base  And these are my toppings Add spice like a man Proteins like with Shrimp  When it's all mixed up Better bite it down Oo, oo. Oo, oo    Not getting enough poke in your diet!?  Pokedon is one of the few Poke Bowl restaurants popping up all around the valley.  It's pretty much a 2017 phenomenon that's swept across the valley and indeed we love it!  Pokedon offers a fresh and modern atmosphere with tv screens hanging from the ceiling walls giving it a sports bar atmosphere.  What I really appreciate about Pokedon is that they don't just offer Poke bowls, but also teriyaki dishes and sides like miso soup and noodles.  I wouldn't know why you would come to a poke place and not order poke, but I gather everyone has that one friend .... yeah I'm talking about you Guy!    Moving on, I started my Poke bowl with the usual split of brown rice and spring salad.  Spicy Tuna and Octopus for my protein along with some jalapeno, pineapples, cucumbers, seaweed salad, and ending with some sesame seeds atop.  I also went with a house spicy since I like a kick to my bowls.  Overall, I love the texture of the ingredients and freshness.  However, I wish my option of spicy tuna came diced instead of mashed.  The octopus help masked my protein mistake.  The option of jalapenos and pineapples was different in my books and both complimented my palates with a sweet and spiciness punch!  The sesame seeds provided a much needed aromatic kick since it has seemed I ordered too much spicy ingredients; spicy tuna, jalapenos, and house spicy sauce....oops my bad!  In the end, Pokedon is much welcomed to the Poke family of the valley!  Providing a much needed option of both culture and variety of food options in the valley.  Let's keep the poke love going! - Enjoy!"}
{"text":"Poke was love at first bite for me. That was in Hawaii many years ago, and Phoenix has been slow to catch up to the growing trend.   Ahipoki Bowl out in Scottsdale is pretty decent, so I was happy to hear they were opening a location directly down the street from me. They were supposed to open their doors earlier this year, but it's almost a third of the way into 2017 and still no Ahipoki Bowl for Tempe.  Still, my roommate and I had a hankering for some poke and checked to see if Ahipoki Bowl was open by searching poke on Yelp. Instead, this place Pokedon pops up, isn't too far from us, and just opened.  Safe to say I'll be skipping on Ahipoki Bowl when it opens and instead I'll just be coming straight here. Pokedon not only has more options, but I think the ingredients are of higher quality. To say I was satisfied was an understatement, I've found a new favorite dig in Tempe.  Also, A+ on the staff. It was a slow Sunday afternoon and they took their time to interact and walk us through all of the different sauces and ingredients. Super chill and very friendly. The food is gonna bring me back, but the staff makes it easy to confirm that."}
{"text":"FOOD IS AWESOME!!  (Priced more than fair**)  MAKE SURE YOU CHECK YOUR TAKE OUT! Ordered pick up and was missing half order - another story. Be sure to double check or order especially for people picking up."}
{"text":"Not a good first impression.  A newly opened restaurant should have a fully stocked inventory.  I was looking forward to the chicken bowl, but no luck.   The staff was quick to respond to my initial review so I changed my rating. Good customer service goes a long way."}
{"text":"Coming from an LA native by far the best, freshest and most flavorful poke place I've found in AZ. Staff is super friendly and prices are decent."}
{"text":"Good poke. I had 1 scoop each of the salmon, tuna, and yellow tail, and the spicy mayo sauce . Lots of toppings all free except the guacamole. Make sure to get the crunchy onions. Miso soup was also good and not too salty."}
{"text":"This was my first Poke experience and it was fantastic! I've been back twice and the service is just as great as when I was a newbie. I highly recommend this for a fresh and fast lunch. Get the green tea, it's really great!"}
{"text":"I saw this place reviewed on Yelp, passed by then decided to go back. What a find, I love  Pokedon!  The staff is very helpful and friendly. The food and number of options is fabulous.  My friend and I decided to share a regular size bowl and were satisfied, plenty of food.  Only one problem it's so delicious you want a whole bowl to yourself.  I'm going back today and have another bowl and no way am I sharing it.  Pokedon is a winner and their prices are very reasonable. A must try"}
{"text":"This place has a similar set-up to Ahipoki Bowl where you order at a counter and you select your items in a conveyor belt style, like one would do at Chipotle or Panda Express. Their menu is actually much easier to read then Ahipoki Bowl so that's a bonus. They have similar food options as well as trendy interior. Specifically for this location, customer service is decent; the employees are friendly and helpful. It's smaller but does have decent amount of seating. The serving size is pretty large and price is more fair than others I've seen."}
{"text":"We love poke, and decided to try out a new place one night for dinner. They have a great array of toppings (pineapple! won ton chips! seaweed salad! so many sauces!) and we experienced great customer service while we were here.   I got a bowl with half brown rice, half salad + tuna + salmon, and most of the toppings. I liked their topping options and the sauces were nice and bright.   The food was good, however, there are other poke places that we prefer in the valley. I'm really glad we tried Pokedon, but I think we'll stick to our usual spots."}
{"text":"I'm so happy I stumbled upon this gem. Poke is fresh and delicious, portions are generous and staff is friendly and welcoming. So many delicious toppings and sauces to choose from. The garlic ponzu sauce is delicious. I will definitely be back"}
{"text":"I have been here several times this place has opened and it's definitely my favorite poke place. When you walk in, you're automatically greeted so it makes the place feel like home. Then, the staff makes sure your needs are filled with the amount of things that are in your bowl. You don't find many places that actually care about how much you want! I absolutely love this place because of the variety of options and how friendly the staff is.. always will be returning :)"}
{"text":"Not bad at all. It's just like any poke bowl place. Reasonably price, reasonably tasty, and the presentation is what tops it off. Also, friendly staff which makes this place even more desirable."}
{"text":"I miss home so much! I'm obsessed with poké and so glad the Valley has so many poke bowl places to offer!!   Food: what I love about this place is they don't just have poke bowls. They offer other Japanese food items such as ramen, gyudon, and grilled meat plates. I literally ate here 3 days in a row last week--tues - thurs lol.   Price: Appropriate  Atmosphere: Cute and clean  Service: Great :)"}
{"text":"This was GREAT!  Loved it.  AND hey better traffic situation than the Poke Bowls in Tempe and Scottsdale.  Same style and taste for the most part.  This place is better as you can get other yummy foods.  Plus Poke bowl in Tempe has been out of TUNA twice when I was planning to eat there.  Which...is WHY you go there.  That is like starbucks running out of coffee??!!!  Poke Bowl lost me a customer and Pokedon is my new drug of choice!"}
{"text":"Really great poke at a reasonable price. Shobyu Tuna was delicious and the portions they give you is a little bigger than other poke places. Staff was friendly and also know what they were doing.  Will definitely come back here again!"}
{"text":"It was my second time at Pokedon as I enjoyed my first experience so much. The wanton chips enhanced the overall texture of the bowl, the ingredients are fresh and the owner and staff are friendly and meticulous as they prepared my bowl. The garlic edamame tasted wonderful too! The restaurant is clean and bright - a perfect place to chit-chat and hangout. It's worth the 30-minute travel to Tempe"}
{"text":"Staff was friendly, insightful and accommodating! (we have two girls that are pretty picky!) Price was fair and food was fresh. LOVE the options with all the toppings!  Ordered the tuna, salmon and spicy salmon protein. All fresh and fabulous. Kid #1 had chicken fried rice - was perfect. Only suggestion - don't be so stingy on the seaweed. ;)"}
{"text":"What a glorious addition to the neighborhood!  I love the sauces and the fact that they will let you try them beforehand.  They suggested mixing the yuzu and garlic ponzu, which tasted amazing on my pile of fish deliciousness.  I like that they offer pineapple for the bowls.  It adds a different flavor and zing to the bowls.  The people who work here are always friendly and accommodating.  This is our new go-to poke establishment."}
{"text":"My wife said she loved her poke bowl. She had the scallops and tuna, said it tasted fresh. The spicy house sauce was defiantly spicy but good. I had the katsu chicken which was good, chicken wasn't to thin like some places can give you when having small fried chicken like this. Friendly staff and good ingredients makes this place worth going to again."}
{"text":"Not very good, maybe if this was the first place you ever tried Poke, then maybe. This place pales in comparison to other places I've tried, not enough options, protein portions very small. Sauces lack depth of flavor... Will not be returning."}
{"text":"The fish is good and the sauces have a really good flavor. Not a lot of options for toppings. The price is high for the tiny amount of fish they give, its a joke.  I'll drive further to go to ahipoki instead."}
{"text":"Ok so I'm from Hawaii so I had my share of good poke bowls, but I gotta say this was probably the best poke bowl I had. What made this one stand out is the add-ins. It's kinda like a subway for poke bowls. I'm actually still eating so I don't wanna write down all the extras you can put in but just check out the menu and give it a try... good stuff!   They also got plates like chicken katsu or salmon There wasn't any cons with this. The workers were nice and the place was clean. I wish I found this a couple days ago"}
{"text":"I love this place. Food are fresh and good flavor. People are friendly. My friend took me there first time but I became a regular customer. I sometimes went there more than twice a week."}
{"text":"Pokedon is a new ahi bowl joint,  that serves up thai iced teas and teriyaki bowls too. The salad was fresh, fish nice and cold, crab mix delishuz.   The owners were super nice and helpful through the ordering process, and their portions were a fair price.  It's located in the middle of where I run my errands, so it's an easy stop for me to grab a bite and then continue my mom chores.   Mom chore on. Moms."}
{"text":"Not too busy, but really good! A better value than other poke bowl spots in Phoenix area."}
{"text":"As a Native Hawaiian, who recently moved to Arizona, Good Poke is definitely something I miss. Until today, I haven't had much luck finding good Poke in the desert. This place is the real deal though! Great Poke, lots of options, and friendly people make Pokedon a must stop poke shop. Mahalo for the awesome grinds."}
{"text":"It's poke, which if you haven't had, and love sushi you should, its mom and pop shop run, and it is clean, the decor modern yet having little hints of Japanese decor, and the customer service is delightful. The proportions of food that is given is plenty for the price. I was very surprised how fresh the fish was, considering that this is Arizona!"}
{"text":"Pretty awesome place! Friendly staff, good food, and very clean! The small poke bowl made me full, which isn't usually the case for \"small\" sizes. My boyfriend ordered the chicken bowl since he's a bit queezy with raw fish. It was also really good! The mac salad that came with it was a little bland though. Overall, a nice place!"}
{"text":"Such fresh delicious food here. What a great surprise to find this place so close to home.  I asked Siri where was the best place to get fish and she told me about this place!! Love it!! Will be back"}
{"text":"First timers,  going to become regulars.  If you like sushi and are looking for a wonderful alternative this is it.  The place is very clean, staff is friendly and very informative.   The price to volume of food is a big surprise,  the quality to cost is amazing.   To all my friends if you are in the area highly recommend you check this place out.  The menu has a lot of tasty alternatives to poke as well."}
{"text":"I absolutely love this place! They don't hold back on the serving size and the flavors are so good. Best poke place I know :)"}
{"text":"This place was quick but delicious. Great for on the go sushi and the kids can enjoy cooked food."}
{"text":"So yumm! Great options, girls are super nice. The whole place is really clean and cute. I will be here again!!!"}
{"text":"Gyudon -- TRY IT! It is so amazingly delicious. It's marinated beef and onions over rice. Try it to believe it.  The poke bowls were really good as well! I went with the garlic ponzu and yuzu sauce that they recommended, and it was a great citrus-y sauce to go with the raw fish. I got shrimp and octopus on mine, and it was delicious. I don't often see octopus as an option, so I loved that.  Service was great, and to top it all off, they had a promotion for a free thai tea if you're following their social media.   Will definitely go back when I'm in Tempe!"}
{"text":"It's hard to ruin a poke experience - and it was delicious! But I was extremely disappointed in the serving size. My husband ordered the large bowl and it actually had less food than my regular bowl. Good poke but we want to get a little more out of our money so we won't order from Pokedon again."}
{"text":"Nice people and great food. The menu is complicated and we were happy with the suggestions of the server."}
{"text":"Pro: flavors of sauces were tasty  Cons: - Ordered online & paid for avocado & no avocado was added (a friend picked it up for me so I wasn't able to check until it was brought to me) - Only 9 small cubes of fish were in my bowl (yes, I counted...) - only ate 5 pieces of fish because my 6th piece of fish was definitely not fresh tasting (it left a bad taste in my mouth, so I ended up throwing away the bowl)  - this was my first poke bowl on the mainland and I was not impressed.."}
{"text":"Pros: The fish is surprisingly fresh, which was a bonus b/c most places like this usually slack off in this area. The service was very good, with friendly, talkative, and accommodating employees. Clean interior  Cons: Unfortunately, it is way overpriced. The amount of actual fish in that they give is kind of a joke. Some of the veggies taste a little off as well. After going to similar places like Samurai in Tucson, this was a bit disappointing and a waste of money."}
{"text":"Too lazy to write a review. But it's really damn good here. Had 3 different meats and all were spot on. Coming back soon."}
{"text":"This place is awesome. Food is fresh and service is great. Price is reasonable and great selection. May have to wait in line a little when they are busy as putting your plate together is labor intensive."}
{"text":"Everything still stands from my previous review. However, several things happened on my most recent visit that leads me to upgrade and update this review once again. I dined in and they now use dinner bowls to reduce their waste, so cool! I remember trying poké for the first time at another establishment and wondered why they didn't do the same. I'm happy about this change!  They had a new protein to choose from: shoyu tuna. When I inquired about it, the kind employee gave me two pieces to sample, so generous. Also he remembered my name from months back, which I was pleasantly surprised about. I got a regular bowl with the shoyu tuna, salmon, half greens and white rice and it was very filling.  This has become my favorite poké spot in the area and I will continue to recommend it to people who are interested in seafood. Though I may have to pass on the spicy mayo next time as it was too mayo-heavy for my liking."}
{"text":"Great service, very clean and the quality was on point.   You can tell pride of ownership exists from the customer experience."}
{"text":"This place is awesome! I love their poke bowls, they're always fresh! I also love the atmosphere, it's very calming and quiet. I go here very often with my boyfriend and it's always our place to go when we feel like eating healthy!"}
{"text":"Gross horrible food bad service cockroaches in the bathroom do not eat here. I cannot believe that they charge a medium rate for the lower than low quality of food. My wife and I ate here and both of us had upside down stomach's for two days"}
{"text":"Pokedon is a stark contrast to ahipoki. I like how generous the portions are and the cost of a regular is $8.95 a whole dollar less. Due to this difference I am happily willing to pay for that extra avocado. Yellowtail is my favorite and it is offered at the same price as every other protein option which I find shockingly pleasant. The sauce options are to my liking. Their house spicy is delicious, not too salty or sweet. The seaweed salad is a refreshing add. They also have a number of other toppings like cucumber, onion and jalepeno. The seasonal fresh fruit, edamame, seaweed, furikake and crispy onion are among the number of dry options that can be added.  Not only is the food delicious and plentiful but the service is so friendly and informative. The free miso soup with the yelp check in is a great way to wash down the flavor without being too overbearing. I hope they keep up the good work because I have been coming on a weekly basis and they are relatively consistent. It's worth the extra drive for me and it's great for students near campus. I love how the servers come up and make conversation to make sure everything is to your liking. Please bring your business here! I have been spoiled by their generosity and flavorful sauces and I would like everyone to experience the same warm welcome."}
{"text":"New poke restaurant in town. Like the mango topping, jalapeño and house dressing. Had regular bowl last time. Will get large bowl nest time."}
{"text":"I'd say 4.5 stars if I could.  We walk here for dinner and are glad it's in our neighborhood.   Pros: teriyaki salmon is great, brown rice is a nice option (not always available), prices are reasonable, healthy/simple/consistent menu, restaurant is clean and staff is great.   Con (only 1): even though there are tables for dining-in, you have to eat on styrofoam take-out containers.  I wish they consider upgrading to a better dining-in experience."}
{"text":"After spending some time in Hawaii last summer, I despaired ever finding poke again, let alone in Phoenix. I had no idea this place was here, and we stopped in due to my to curiosity when the line at the adjacent Ted's Hotdogs was too daunting.  I had tuna with spicy mayo and their house sauce and it was the perfect balance of savory and spicy. The price was excellent as well, considering that the large size is a generous three scoops of fish. I love that they have extras you can get in your bowls, like fresh fruit (today's was pineapple, but I hear they have mango often as well), jalapenos, and masago. They also have yellowtail, shrimp, and octopus for the same price as anything else, which is impressive.   The staff was very friendly and competent, and endlessly patient with my mother's confusion over the cuisine (she doesn't have a very adventurous palate), and let her try all their sauces.  I'll definitely be back!"}
{"text":"So I've never had poke before so take this review for what it is... That said I though this concept and food were great. The girl working behind the counter was super friendly and helpful. Very patient and knowledgeable. With lots of combinations to try, there is plenty of reasons to go back. Thanks!"}
{"text":"Great flavor, portion quality and speed. Business meeting for 2 and we had the place to ourselves and didn't feel to hungry or full afterward and it tasted delicious. Also right next to TEDs Dogs and that is a must for everyone to try as well. I'm new to Phoenix and it's on the list. Thank you!"}
{"text":"Had a great experience at Pokémon. The staff was very friendly. The restaurant was clean. The menu was simple and easy to understand. There are many options to choose from. I opted for the spring mix rather than the rice. I like that they had a starch free option. I was able to check-in and enjoy the free miso soup. It was very tasty and light. The poke bowl 3 scoop is more food than meets the eye as I was not able to eat it all. I will be coming back for more poke!"}
{"text":"I was visiting in town this past summer for the first time and saw there was a \"poke bowl\" place and had to go! I loved it, it was like a chipotle style ordering system and picked out what you liked as you went. It was so delicious and I got tuna and salmon in my bowl along with crab and a lot of other yummy items. I came back into town a second time a few months later and this was the one place I knew I needed to hit! Whenever I am in Tempe, you will always find me here at least once."}
{"text":"Pokedon 1753 E. Broadway Road Tempe, AZ  This review is written after dining at this establishment 2 days in a row. Some of this review reflects excellence, while some of it reflects problems which need to be corrected quickly if they are to stay in business.  Companion and I visited the first time and each ordered the large bowl combo. Lets break this down into actual food portions. You are first given a choice of white rice, brown rice, a spring mix of greens, or Wonton chips. Companion chose white rice and I chose the brown rice. Both were properly cooked and the person waiting on us filled the bowl 3/4 full with rice. Essentially, we were under the impression that they were trying to fill us up on rice.  Next was the protein selection. We were each entitled to 3 scoops. Companion ordered Tuna, Salmon, and Scallop, and I ordered Octopus, Tuna, and Spicy Scallop since I will never eat raw Salmon due to the possibility of parasites. The fish all seemed fresh though the Spicy Scallops did not seem to be very cold and were approaching room temperature.  You can choose from a plethora of sides all of which except Avocado are free. The Avocado is $1 extra. The crab mix was just fair, but the pickled cucumber and the seaweed salad were both excellent.  Next you get to choose a sauce from a group of 7 selections. Companion selected Ponzu mixed with House sauce, and I selected they Yuzu Vinaigrette. All the sauces were excellent and really buoyed up the proteins. It is noted that the fish is kept separate from the hot rice until this point.   Last was the opportunity to have any of 3 sprinkles on top. I chose sesame seeds while companion chose chopped sheet seaweed.  Since we ordered combo bowls ($2.50) we also received small bowls of Miso soup and our drinks.  We also ordered egg rolls ( 4 to a serving), which in reality were spring rolls. The \"egg rolls\" were fair at best, and after eating one, the rest were consigned to the refuse bin.  Portions on the first visit were of a good size and the waitress who served us was cheerful and willing to let us taste anything we asked about.  On the second visit I was alone and had a totally different experience. The fellow who served me skimped on everything including only putting a half scoop of Octopus in the bowl. When it came to the pickled cucumber and the seaweed salad he skimped again and said if I wanted more than he put in the bowl I'd have to pay for an extra scoop. The way he said it was a total turn off to me and  almost had me walking out. I again asked for the sesame seeds on top, and it almost looked like a sesame storm had hit the bowl.  The place is nice and clean, but unless they become consistent with portions they will not be around for long.  3 stars for quality of the proteins, flavor, and cleanliness. Hopefully if they get the portions straightened out I might be able to raise them to 4 stars."}
{"text":"I'm new to Tempe and have stopped at this place 6 times already. The food is fresh and tasty. The service is fantastic. Everyone who walks through the door gets greeted. Definitely recommend if you like poke bowls"}
{"text":"Poke bowls on the mainland???  Seriously???  When you need that raw fish fix, go here!!!  Not bad prices and the buggah is ONO.  I love Poke and nothing will beat what we can get back in the 808 state but this place is close enough.  Weekly lunch spot for sure."}
{"text":"Loved this place.  Super clean, all of the ingredients were fresh.  I had planned to take mine home to eat it, but it looked so good, I had to sit down and take a taste and ended up eating the whole bowl!  I will be back with my husband!"}
{"text":"Awesomeness.  Fresh fantastic.  Great value.  Emily and Jennifer rock the service and help with suggestions on what goes well together. Mom and pop local restaurant .  My Wife and I split a large bowl got extra avocado for A dollar more - so worth it chunks of cado.  Don't think about it - just GO.  Incredible local gem. Super Healthy omega 3s pure protein."}
{"text":"Pokedon is a brand new poke bowl restaurant in Tempe! I was excited to see the sign go up a few weeks ago so when I drove by today and saw the open sign I knew I had to try it out! The menu is similar to Ahipoki Bowl but I think they offer a better deal here since they do not charge extra for yellowtail.  The soft opening special was a great deal, $6 for a regular bowl which includes two scoops of your choice of seafood with a plethora of toppings. For your base, they offer white rice, brown rice, wonton strips, or salad, with a choice to have half and half in your bowl if you'd like. Choices for seafood include tuna, salmon, scallops, shrimp, octopus, and yellowtail.   I decided on a regular bowl with salmon, yellowtail, with a half salad half brown rice base. I had it with the ponzu sauce and overloaded on the toppings (Jalapeno, crab salad, edamame, cucumber, pickled cucumber, red onion, pickled cucumber, picked radish, masago, seaweed strips, sesame seeds, mango, wasabi, green onion and fried onion). They were very generous with the toppings and I loved the freshness of the seafood and mix ins, combination of flavors and the kaleidoscope of colors in my bowl. I especially enjoyed the fresh mango pieces with my bowl.   If you get the combo it's an extra $2.50 and includes a drink and miso soup. The soda fountain has iced tea and Coke products. The miso soup was pretty basic and had a light taste.  This seems like a more independent, family-run business than Ahipoki and service was so friendly and sweet. We even got a free sample of some delicious fried gyoza!   I go to the Smart and Final in the same plaza quite a lot so I foresee being one of their regular customers. Thanks Pokedon, for a great experience!"}
{"text":"So I am currently eating a poke bowl from another restaurant and let me tell you, NOT ALL POKE BOWLS ARE CREATED EQUAL! Pokedon is seriously the BEST! Everything is so amazing from their customer service to the food itself! I added the garlic sauce with the mayo to my poke bowl and it was fantastic!!! I highly recommend this place!!!!"}
{"text":"Best poke experience I've had to date. Came with my co-worker from California. The service is top-notch; Alison explained all the sauces but went the extra step to have is try the top 3 we were considering- and it made all the difference. She also took extra time to explain the other toppings we hadn't tried before. The portions are perfect. We both had the large bowl (3 proteins- highly recommend spicy scallops) for around $11 each. With two bowls, a soda and tip, we left for about $28. They offer non-carb friendly option of spring mix, or you can mix with white or brown rice or wonton chips. If you're not as hungry, a smaller bowl is available with 2 scoops protein for $8. Enjoy!"}
{"text":"Customer service is great and so is the poke. Also really happy that they're right next to my home. I would recommend this place to others. Only reason I'm giving 4 stars is that I tried the Thai tea my first time here and it did not taste good at all. Now, I just stick with the poke."}
{"text":"Quality of the fish was not great nor the portions that they give. I've been to many poke places in CA and often the prices are cheaper and the fish is better prepared. They gave a ton of rice to make up for the lack of other toppings which they gave very small portions of. Questionable if its worth the price for how little fish they give."}
{"text":"I come here sometimes after my classes at ASU. Very clean location. I wish they would make the two scoops of fish actual scoops. Most of the time it feels like they're skimping out a bit on the fish portions. Other than that everything is fantastic! The fish is very fresh and they have many sides that you can add to your poke bowl with no extra cost."}
{"text":"It seems like there's a new poke shop opening every week. This one should definitely be on your list. We came here primarily because they serve non raw fish items... for the boy. I had the tuna and marinated yellowtail. The fish was fresh and the portion is very generous. They have a good selection of toppings for you to load your poke bowl up with. I was definitely very full. The boy really liked his chicken that he got. The price also seemed really reasonable for the amount of food that you get. Check them out!"}
{"text":"Favorite Poke place! The customer service is phenomenal, you'll always be greeted and they will always take the time to explain what the ingredients are or let you try the different sauces. They make sure that they do their best so that you get the best poke bowl you desire. Be sure to use your check in here to redeem some offers going on! You get so much and it's so delicious and nutritious for such an affordable price! Love them!   P.S. try the mango in your bowl"}
{"text":"Great light meal. I had a spicy tuba and salmon poke bowl. Young lady behind the counter walked me through the process and was patience with my selection. Will be back if I'm in the area."}
{"text":"This place was excellent. I really enjoyed their fish bowls. They seem so healthy and was delicious on top of that. How they serve the food is nice and familiar as well. My friend who tagged along described it as \"subway/chipotle for fish bowls.\" Alright, seems pretty accurate to me. That is what it is, afterall.   So this is a nice little quiet place that recently opened up. I have never tried one of these in Arizona, so I tried it. It was really good. I ordered a regular sized bowl, which means they give you two (2) scoops of fish/X-protien-source. I got a base of spring mix (salad). But there was white rice, brown rice and these crispy strips available too. Then you get your two scoops of protein; I got a scoop of tuna and a scoop of salmon. Then you choose your toppings. I got cucumber, red onion, edamame, dried seaweed, ginger, mango and sesame seed topped off with their spicy house sauce.   Overall, the food was good. The restaurant was clean. The location is quiet and convenient. Good first impression to me."}
{"text":"Best poke place so far we found in Arizona. It seems that having a poke place in the continent is becoming a more of a trend style. Poke originated from our Hawaiian islands as a appetizer, to sit around under the sunset and enjoy what you have caught from the ocean... I appreciate the continent wanting to share our culture it is part of our staple dishes and has been around for many many years in our islands.  The cubes of the different varieties of poke fish they offer, yes it's small cubes compare to what we have back at home. We have bigger cubes to offer but, we are not at home and I am happy to have some kind of freshness of what they offer is what makes up for it and the variety of sauces that compliments each dish of poke, it's amazingly good! However, the mango on your poke, I have never had that before with my poke bowls but, it was very sweet and refreshing to have it on the SIDE as a small desert  I love how the new concept offers so many to either be placed on your hot rice or mixed green salads. You have so much to choose from to customize it the way that you want, which is a new for me to indulge and open my mind to try something new.  The owners are very nice and pleasant and will go out of their way to make sure you do get what you want in a brand new restaurant!  We came here twice in one day! Once when we saw the sign as we were passing by saying \"Pokedon\" and 2nd when my son came home from a ski trip he wanted to also taste their spicy ahi poke. It's not the same as back home but, even he said \"it's still good and close to that satisfying taste he longs for when we are away from Hawaii!\" Again, the spicy mayo sauce is delicious...  I've had both today - Salmon/Spicy scallops on mixed greens with spicy mayo, I can literally just live off of this and tonight, for dinner I had the same fish/scallops over hot rice with all my fixing and I left feeling full, content and happy!  My husband being he cannot eat carbs at this moment had (2) delicious meals of teriyaki chicken over mixed salad with spicy mayo and teriyaki beef with the same mixtures he ate both of his plate lunch in one sitting.. hahaha! He must of been super hungry!  I'm sooo happy it's right down the street from us where we can pop in... next time I'm just gonna order the poke mixing and nothing else and eat it with my poi! Can't wait to try that! Yummy..."}
{"text":"All of the food was terrific...an explosion of flavor.!!  The sauce selection was very good and they all had great flavor. (You taste all of them then make a selection. The toppings were fresh, light, and delicious. Nice selection of fish which was also fresh and tasty. We ordered poke bowls and tempura shrimp. The tempura was so light it reminded me of what upscale Japanese restaurants serve.  I would come back to this place again and again."}
{"text":"I love this place. Quick, healthy, fresh food! I haven't really found a good sushi place in Tempe so this is kind of filling the gap for me.   I know Sakebomber and Sushi 101 are close but the portions are super small for the cost and I'm always left hungry or feeling like I spent too much for what I got.   Pokedon is just what I need! I love the raw tuna and salmon"}
{"text":"New to poke.. this place is happy to help you with your first poke adventure (I watched the guy in front of me as they explained how it works) ..   On today's visit I had the 1/2 brown rice, 1/2 salad greens bowl with salmon and ahi tuna .. seaweed salad, loaded up with edamame, mango, radishes, cucumbers & avocado (its extra $), yozu & spicy garlic sauce dressing .. yum!   I always go 1/2 rice, 1/2 salad greens because all rice bowl is too much food!!   This place is clean, plenty of seating .. they also have non-poke options and a chicken teriyaki lunch special! You won't be disappointed with this spot!"}
{"text":"First time at pokedon and it's generally like other poke places. Everything taste really good and they had all the options you'd expect from a poke place. What makes this place a 5 star for me is the service, the moment I went in they asked if I been here before or needed help. While getting my bowl built they offered me extra rice which I appreciate, as other places usually don't take the initiative to offer. All in all best poke place I been too, would recommend because of the service."}
{"text":"Wow! Really great poke place! I ordered \"to-go\" and if you go through yelp, it's really easy to order your poke bowl through the app! However I called to do my order just in case and the customer service is awesome!!!! The guy on the phone was totally cool with all my intricate order specifics for each of my poke bowls! I even asked to try out all the sauces on the side, and when I picked it up, they were all labeled nicely for us to pick and choose!  The poke was delicious! Great portions! Everything tasted fresh and the presentation is great! It looks really cute to take pictures of and it's assembled very neatly which I love!!!!   But they not only have poke bowls. My friend got the gyodan bowl and it was awesome!!!! It's a flavorful beef with egg and carmelized onions! It kinda reminds me of a Hawaiian loco-moco but I will definitely get this for myself for next time!  Pokedon definitely outshines it's competition. Compared to such a place like Ahipoki which is a large Cali-chain, the poke is delicious! The presentation is great and looks very neat and clean! The restaurant itself is very clean and modern looking! And the customer service was a great experience. So 5 STARS to Pokedon!  Tips for ordering poke 1) you DONT need a large bowl. Their portions are pretty much the same. If you want to have a bigger bowl, ask for extra of the sides! Ask for extra rice, ask for more edamame, etc etc 2) if you're unsure of the sauces, ask for them on the side! It's kinda fun to try them all 3) if you ask for wasabi, ask for it on the sauce! The worst thing is to bite into a huge chunk of wasabi. I usually put it in a cup, mix it with soy sauce or one of their sauces, and pour accordingly  Can't wait to come here again!"}
{"text":"I am always looking for a healthy lunch place to go on my short lunch beak. This new Poke place is very close to my office and I can said goodbye to McDonald now lol. No matter if you like Japanese sushi rices or spring salad mix or brown rice, they had all. The toppings they have salmon, tuna  and yellowtail etc... It's definitely a place to try if you want a healthy lunch."}
{"text":"Yummy! I got the salmon teriyaki bowl and my fiancé got the yellow tail poke bowl! Both were delicious. Place was really clean and nice. Pricing was great. Definitely returning!"}
{"text":"Alright. I've heard about Poke, but I literally had no idea. You all need to experience this if you haven't already. Right now. ASAP. Just go. I used the online order option and built my bowl. I combined about 16 ingredients into 1 bowl. Sixteen might be an exaggeration... OK, I just counted. 15 ingredients total. All in one bowl, together, dusted with sesame seeds and furikake and Oh my freakin' goodness.  My taste buds are still high-fiving. This place is the shit. There is no try, just do. You'll thank me later."}
{"text":"There is one blonde girl with a black Adidas cap I see there consistently who is not generous (or even fair) with the toppings. She tried to charge me an extra $1 for asking for more of a topping when she barely put any on. My boyfriend's same \"large\" bowl was filled to the brim compared to mine.  My large bowl ended up just about the same size as my regular.   Had to amend my review to reflect this ONE employee's crappy service."}
{"text":"Visiting ASU and found this great poke place. Service was excellent. Very neat and well organized. Menu has multiple fish choices along with the choosing of multiple toppings (avacodo is $1). Would strongly recommend coming down and trying this place."}
{"text":"My family and I came for the first time and really enjoyed it! We never have had poke before because some of us are not into raw fish so we sort of avoided it. But Pokedon is great because they have several cooked meat options (chicken, (spicy) crab, shrimp) so we were more excited to try the food. (Obviously other Poke places might have cooked options I'm just not sure haha).   I shared a regular poke bowl with my mom and was pretty filled even though we got the spring mix rather than rice! It felt refreshing to eat especially in this heat and I thought there was a good amount of meat to last the whole dish.   Overall, I enjoyed my first poke experience. Nice servers, clean environment, and great food. Definitely would recommend!"}
{"text":"This is a new fave! I wish it were closer to home.  The ingredients are so fresh and tasty.  Total win, especially at this price point."}
{"text":"I'm a fan. I've visited many poke places in town and in other states. This one has been the friendliest and they had a few toppings that other places didn't like a few pickled items and fruit. I will def be back to more poke!"}
{"text":"Stopped by here earlier this afternoon and I am so happy I did. If you like sushi this is the place to chow. All the ingredients are setup similar to that of chipotle, but instead of burritos you receive a sushi bowl. Bowls range $9+ for a solid meal. Great place to go on a little food date with. I will most definitely be telling people about this delicious little place."}
{"text":"I'm a poke snob. This place has great poke. I tend to rotate around the different Poke places in the valley and Pokedon is definitely in the mix (Ahipoke Scottsdale and Pokitrition)  Highlights for this place: -Spicy scallop and yellowtail at no extra cost -Punch card -Free miso soup with Yelp check-in (at time of writing) -Location (close to ASU) -Super friendly staff  Pro-tips: -Scallop is the best fish-for-your-buck choice for one of your scoops -Half salad mix and half rice gives you the best portion ratio -Garlic ponzu + house spicy  but you can sample the sauces if you want -Avocado portion is pretty decent for the extra dollar -Jalapenos are mild so don't be afraid to put some in your bowl -Grab a punch card. They're one of the only ones who do it and you're gonna come back"}
{"text":"This place is awesome. Super fresh. Great service. Great prices. I could eat here every day. Super healthy if you opt for the spring greens rather than rice."}
{"text":"Wow!!!! Such a yummy poke bowl! Seriously the best I've had. I keep coming back. The fish is always fresh. They always do a fruit that is fresh that day as well, so far they've had mango twice and pineapple once. If your looking for something healthy and filling got to try this place!! The sauces have so much favor and every topping is delicious!! They have other food as well like chicken bowl, salmon bowl, steak bowl, yakisoba noodles and fried rice. Can't go wrong with this place, good for everyone!!"}
{"text":"Pretty good quality and great service. Mine was a bit dry, so next time I would ask for more sauce."}
{"text":"It was my first time visitingI never had Poke and wanted to try something new yesterday so I walked into Pokedon and I was not disappointed. The place was very clean and there wasn't a line. The person who was at the front was a male, glasses, and a hat who was super friendly (wish I got his name) but he helped me with the order because I didn't know what I was doing. He also let me try the sauces before committing to them. Poke itself is okay, I think it's a little too much sushi for me, but the fact that the person helping me was so patient and explained the process to me is the reason I'm giving this place five stars! If I was into a whole lot of fish I would have also given this place five stars because it was actually pretty good! It's basically sushi in a bowl. The food tasted fresh and as decently priced for the amount that they give. I only got a two scoop (regular) bowl which was more than filling."}
{"text":"The serving size of the seafood was very small. The protein scoop is so small that you barely even get any seafood!  I ordered the mix salad with salmon and octopus, I believe. It didn't taste bad, but I was a bit disappointed by the portion of it.  I had lots of mixed salad, but only a few bites of seafood along with it."}
{"text":"They posted on FB that they started serving beef bowls topped with egg and I tried it. O-M-G.  I don't really know where to start it was genuinely amazing tasting.  Miles better than Yoshinoya!!  It took like 2 min for it to be served which felt too fast to be quality.  The rice, beef, egg, and spices were 100% on point.  This item is unlisted on the menu so you have to ask them."}
{"text":"Everything is very fresh and tastes very light and healthy! Everyone is so friendly as well! Try mixing the garlic ponzu sauce with the yuzu! It's delicious!"}
{"text":"The food was fresh and delicious and the folks there were anxious to please. They made the entire experience better than I expected it to be."}
{"text":"Amazing poke bowl good food great portion good environment! The staff was so friendly !!!! I would honestly recommend this place! Being in Arizona it's hard to find fresh seafood, the fish was melt in your mouth and no stench!"}
{"text":"Love this place!! Staff is so friendly and the bowls are so amazing! Nice and fresh, full of taste and love the topping options!"}
{"text":"Pretty good poke compared to what I have had lately. Colorful and fun to dig into. The prices are a bit on the ridiculous side so we will continue to search for other options."}
{"text":"Pokedon is filling and delicious!   I've been looking to try this place since I saw them building it a few months ago. Coming here for dinner did not disappoint.   My boyfriend and I split a large bowl with a mix of white and brown rice. The large comes with 3 scoops of protein- we got the spicy tuna, spicy scallop and yellowtail. For the sauce, we had the house spicy and the yuzu mixed together. And then we got all the toppings. It was pretty phenomenal.   For being in the desert, the seafood was pretty good. Coming from the West coast, I can be pretty picky with my fish. That said, I'll be coming back here.   The service was also really good. I appreciate a friendly smile and suggestions so much.   A couple suggestions that would have earned five stars:  1) have the option of actual bowls for people who want to eat in.  2) have the option of mixing the food together instead of just piling it on. It was hard to get a little bit of everything I wanted in one bite. I ended up stirring it together myself, but some of the toppings fell out in the process.    I'm really glad there's an affordable way to get some seafood in this city. Thanks Pokedon!"}
{"text":"I love Pokedon! It's a simple, no frills poke joint that gets the job done - and done well. I used to occasionally wander out to Ahipoki near my old apartment on the weekends, but stopped after moving. Pokedon is a quick drive from my work, and it's pretty much the only thing I get if I happen to not bring my lunch. I like that they don't try too hard to get \"unique\" with what they offer (which can turn into a big weird mess of a meal, in my opinion). Their pickled radishes are my absolute favorite, and it is now my staple in a poke bowl."}
{"text":"This is a great poke spot.  Excellent selection of seafood and toppings.  I mean totally blown away by the quality and selection.  The only thing better than the food was the customer service.  This will be a regular lunch and dinner spot."}
{"text":"Poke bars are my favorite personalized food trend since fro-yo, and Pokedon is a stand-out in its class. While pricier than most fast food options, the fresh ingredients and many yummy options make it worthwhile.   As a 95% vegan, I found Pokedon to be full of great choices for me. I chose a rice and spring mix bowl with tofu and was definitely not disappointed. The service was friendly and they let me try as many sauces as my high-maintenance self wanted.   I'll definitely be going back, because healthy, delicious, fun options are rarely so convenient!"}
{"text":"This is by far the best poke place in Tempe after trying a bunch out. Everything is always so fresh tasting, the restaurant is always super clean, and the staff is so nice and friendly. And it is FREAKING DELICIOUS! I would have posted a pic but I always start inhaling it before I remember!"}
{"text":"I had the 2 scoop bowl with salmon and tuna with brown rice. I added all the toppings with avocado and the garlic sauce. Amazing. They made the bowls at a great rate and they were tasty! Lunch time wasn't super busy either and they had the perfect amount of seats. Thank you!"}
{"text":"POKE! This place is gooood. They are a little stingier with their fish than other places I've been, but the quality is better. Seaweed salad was nice and fresh. I'll be back!"}
{"text":"I'd never tried a Poke' bowl before, but glad I did! The staff was extremely friendly and helpful for a first timer and the food was outstanding! Great place to grab a lunch and go I'd def recommend giving it a try!"}
{"text":"Delicious and fresh! Great spicy tuna and seaweed salad. Crab salad was very good too! Reasonably priced"}
{"text":"I wouldn't go out of my way to come to Pokedon but it's a nice option if you're already in the area. I had a salad bowl with salmon, tuna, and yellowtail, which came out to about $12. It was pretty filling, fresh and healthy, so you can't go wrong here. They also offer hot food options like teriyaki, but I can't opine on those."}
{"text":"Great layout walking in, very clean. Serving portions were optimal. Best protein options and variety. Quick and friendly service. We were served by Sal and he has great customer service and catered to our exact specifications and had great recommendations. If I could I'd give this place 6 stars because of Sal. Go here and enjoy some fresh yummy poke!"}
{"text":"Okay I'm a HUGE poke fan. I'm talking I buy poke bowls like 2-3 times a week. And this place is my new favorite, which is super convenient (and dangerous) cause it's about a 3 minute drive from me. I absolutely love that they offer pineapple as a topping too - it changed the game!! Definitely recommend trying out this place."}
{"text":"Mangoes so juicy, you could probably sell 'em to the tabloids!  Stopped on in after a certain Fish King told me to. It's a cute local business that has much to offer. During their soft opening special (ends Sunday, Feb. 19th), all regular bowls were $6! Pair it with your Yelp check-in offer to upgrade to a combo, which comes with miso soup and a drink, for free. Excellent deals!  Loving: Mangoes, jalapeños, yuzu vinaigrette, oh my! That yuzu pairs very nicely with the mangoes and jalapeños. It's Arizona meets Hawaii. What a duo! I also like how yellowtail doesn't cost extra here. The sauces here in general are all pretty flavorful. They also serve some hot foods if you don't want poke.  Not Loving: Portion sizes. I'm not big eater but their regular left me wanting more. The price point is a little lower though. When comparing them with their east valley competitor, which we'll call \"AP,\" their crab salad and seaweed salad is also pretty vanilla compared to AP. The fish is also cut smaller which sauce-lovers will rejoice.  Overall, I wouldn't mind stopping in if I was in the area. It's clean, the staff is super friendly, and the eats are decent."}
{"text":"Came here with my boyfriend for a quick bite before seeing Beauty and the Beast. We're from New York, so we've had Poke before, but this place is a complete different experience! Hendra walked us through all of the different options, and prompted us to try the sauces before committing to anything. He was super sweet and friendly. Everything was super fresh and delicious. And to top it all off, Hendra came over with some complimentary Miso Soup! Would definitely come back again.   Thanks Hendra!"}
