{"text":"Tried PokeWrap for the first time today and got the Spicy SF Wrap because that was the free choice on MealPass.




Staff was very friendly, the food was too spicy through the overuse of jalapeno and this was my first time trying out Hawaiian food and to be honest it was pretty great.



Will I go in again? Likely - especially for a treat or when I have extra money lying around.



Wasn't expensive if for a dinner, but it seemed mildly overpriced for lunch."}
{"text":"Not sure why this has such great ratings.

I don't see people inside at all whenever I pass by and when I went to try it out, it was my friend, me and 1 other customer. The portion for the salmon was so little and when I went, I had to wait an extra 15 minutes... and for what? Just for someone to chop up little pieces of my salmon? It doesn't take 15 minutes. I was late for work lol.

It's great for when it's your last choice... but save your money and go to rolltation."}
{"text":"Poke Wrap--a brief walk up Yonge from Dundas Sq--gave us a very nice respite from the huge crowds on Canada Day. The first thing we noticed when walking in was how clean and quiet it was. The employees are friendly and will happily walk you through the menu if you want assistance. 

We each got a (very filling) make-your-own bowl. The fish tastes extremely fresh, and you can choose from a good variety of toppings, mix-ins, and sauces. If you order the large bowl, you get double the protein so can choose multiple kinds. 

We'll definitely be back."}
{"text":"I visited on Monday, January 2nd around 8pm and was served two very friendly people! They explained the menu clearly and succinctly. I chose to make my own small bowl for take out (sushi rice, salmon, avocado, mangoes, tobiko, ponzu sauce) and I'm pretty happy with it. Avocado costs an extra $1.  The ingredients are fresh and tasty, even though many of them are out of season. 

The shop itself is very clean and bright, but the service is what really shines."}
{"text":"It's a 2.4.


Ordered the $12.97 Regular Alaskan Bowl.  White tuna was cut into small cubes(too small).  Where is the avocado? Ingredients didn't go too well and wasn't mixed well together.  Value and taste is really really lacking compared to Poke Guys 5-10 minutes away."}
{"text":"While I prefer other places in Toronto for poke bowls, this is my favourite place for wraps. Really nice staff, good location, no wait times, and delicious food."}
{"text":"Simply the best poke place around! The quality is the best and I've been to most of them before. The stuff is super friendly!"}
{"text":"I came after work with my friend and it had a nice modern vibe to it.  The front counter employees were very informative and made plenty of suggestions on what they thought was the best and what was popular.  This was very helpful since I decided to get a custom wrap.  

I had a salmon wrap with avocados, tobiko, ponzu sauce, edamame and red cabbage.  Since I arrived in the evening I was surprised at how fresh the ingredients looked and tastes.  The wrap overall was very delicious.  It probably will be a regular place I drop by to grab a quick lunch or meal on the go.

I definitely recommend going to this place."}
{"text":"Not great. Poke guys is much better, fresher and has bigger portions for the same price. I won't be back"}
{"text":"I decided to try the Alaskan bowl as part of a mealpal lunch promotion. The small portion was a reasonable size, except it contained mostly rice, a decent amount of veggies and a few small morsels of fish. Compared to other poke places nearby, the amount of fish in this dish was pathetic. I had to look for it and barely tasted it as I counted 7 pieces no larger than 1 cm cubed. Considering there are so many other good poke places downtown, I would not go back here."}
{"text":"Service was good, flavors were good. Easy to follow instructions. Fish was fresh and firm with good cuts."}
{"text":"i tried this for lunch and i opted for the make-your-own bowl option, as none of the other menu items spoke to me. 

it was great! the thing i like most about this place is that the portion is smaller, and it's reflected in the price too. oftentimes i find other poke places give WAY too much rice and you have leftovers that you don't know what to do with (if you refrigerate, the rice will get hard). Poke Wrap's portion was just perfect for lunch. 

although i wouldn't add the avocado again for an extra #1. i thought they were going to give more substantial slices of avocado but it was very few little dices- not worth it IMHO."}
{"text":"Delicious and healthy! If you're looking for a healthy alternative on Ryerson campus, this is the place to go. Its quite affordable too."}
{"text":"I tried the Tokyo bowl here about a month ago. Portion size overall was pretty standard however the salmon portion was particularly small. Portion aside, the tastes of the sauces and all of the pre-determined mix ins were not really cohesive. Even though it was a \"signature bowl\", everything overwhelmed the actual salmon which was the most disappointing part.

Decor is cute, minimalist and they do offer some seating. Staff and service was average.

My friends and I had tried Poke Wrap when they were offering the buy one get one for $5 promotion, which averaged to about $10/bowl. Would not recommend, especially at regular price - there are better options that provide better value and taste nearby."}
{"text":"The restaurant is a small narrow strip that is painted a beautiful shade of Tiffany blue! There is some seating space, but very limited as it is only a row of chairs facing a long table that lines the walls.

You can order from the menu, or customize your own poke wrap or bowl. The wrap (burrito) only comes in a regular size, while the bowl can be regular sized or small sized. Regular costs roughly $12, while small costs about $8.

For the regular sized bowl and wrap, you can get the choice of any two proteins. I chose a half-half base of sushi rice and zucchini noodles, with raw salmon and red tuna. I got all the toppings except for jalapeño, and my three mix-ins were nori, tobiko, and seaweed salad. The portions are super generous! Although I only got a tablespoon of each topping, it was more than enough. The seaweed salad was a huge amount, and there were many fish chunks. In fact, I was so stuffed by the end of it all that I couldn't even touch the sushi rice (what a waste). My only complaint was that the zucchini noodles were quite difficult to eat, causing the sauce and whatnot to splash all over my face!

My sister ordered a wrap and said that it was not as good as Corners by Spoon and Fork in Mississauga. Although she didn't get all the toppings, they were still unable to fully wrap her burrito. She got the wasabi sauce, and found the entire burrito too saucy and spicy. In the end, she left most of the fish and half of the burrito untouched.

It's a pretty decent meal, but given my sister's experience, I'd advise getting the sauce on the side!"}
{"text":"5 stars for the best pokè in toronto! That's quite the bold statement but hear me out!

I've tried numerous pokè bowls and consider myself an almost-connoisseur in the pokè game. For me what takes the cake at this establishment is the options! I love that we can choose zucchini noodles as a base. It's healthy and adds a great crunch. I usually get a small (don't be fooled by the size of the bowl.. a little goes a long way) and choose rice and noodles as my base. 

For a couple of their menu sections/toppings you get unlimited options (can you ever reaaaaally have enough edamame??)

The location itself is easy to miss. It's right on Yonge street so if you pay a little attention you'll see pokè wrap tucked among many of the other food stops. It's extremely clean, aesthetically pleasing and great customer service. A win win in my books!"}
{"text":"Best poke wrap in Toronto!!! This is the only place where you can actually customize your own poke and have great portions. I've tried other poke places but none compare to poke wraps' yummy salmon, great portion and unlimited toppings! 5/5 would recommend"}
{"text":"3.5 stars

The difference of this shop is that they mix your ingredients before you eat it, which is nice because usually you get a bowl filled up to the brim and mixing everything is a messy endeavor. The regular bowl was fairly cheap $8 for 1 fish, but that also means you get a small portion of fish. 

Ingredients and toppings are pretty standard. For their crunch, they offer rice puffs which should be consumed asap or else they will be a tasteless soggy thing. They also allow you to mix sauces or grab some extra sauce on the side, which is nice.

Not bad and it's conveniently located on Yonge! Very quiet the two times I went."}
{"text":"Came on a weekday to check this place out for the infamous sushi burritos and the place was empty, with only one person working at the time. The option to customize your own burrito was very convenient, but you can also choose from their different fixed burritos as well. I decided to get the \"Toronto\" salmon wrap with minor adjustments, such as changing the sauce and removing one ingredient. The staff is very friendly and the overall place is clean and had the whole aesthetic, relaxed vibe. The only thing is the wait time took a while just because it was only one person taking orders and making the wraps. While this place seems to be very popular, it is not amazing and the prices are definitely on the pricier side in my opinion."}
{"text":"Came here multiple times and all times were wonderful!! Love the simplicity design of the store and the quality and presentation of the execution. 

I ordered the poke bowl with mixed protein and the serving size was huge. Everything was especially fresh and the sauces were super tasty. 

Definitely worth visiting! Recommended."}
{"text":"Aw yeah right off the bat poke wrap is located conveniently near dundas square which is already a big plus. 

From the menu items I had the Toronto bowl recommended to me, which is a good sized portion of poke, I got the staff recommended mix of ingredients and sauces and especially enjoyed the crunchy rice crisps that really brought the whole dish together. It's really good and the size is just right. 

They also have a selection of drinks that go really well with their poke, including some Japanese beverages. 

It's smack dab down town you'd be crazy not to try it since you probably pass by it on a daily basis"}
{"text":"Feeling like I should tell it like it is, because I'm not sure why this place has such high ratings.

Appeal: 7/10. the place was empty when I came in during what is supposedly the lunch rush. I liked the interior though, it had a 'cute' vibe and felt spacious. 
Taste: 7/10. Average but lacked a Hawaiian feel to the food. The fish wasn't marinated and most ingredients were chopped so tiny it was hard to distinguish everything. The salmon cubes (crumbs, really) fell off my chopsticks a couple of times because they were chopped so fine. 
Price value: 0/10. A poke bowl cost $14.50 after tax.  If you're going to charge an outrageous amount, the least you could do is cut your fish into bigger cubes. 

Tldr; save your money, walk 10 mins north, and go to Poke Guys, or even rolltation. You'll save money and get more food too."}
{"text":"New poke place in the downtown area. Located near dundas station across from one of the ryerson buildings, which is a good spot.

The inside consists of a long, narrow interior with some seats along the side. Order at the back, pickup near the front.

Poke is offered in bowls and wraps.
Bowls are the usual fare: you get a plastic bowl filled with fish, toppings, and sauces. Wraps are basically the same thing, except it's wrapped in seaweed.

Small and large sizes are available. 3 types of bases, 5 types of fish, over 10 different toppings. You can choose to customize your bowl or wrap, or pick one of their signatures. Would recommend customizing

It takes some time to build the bowl or wrap it up, so expect to wait a minute or so after placing your order.

Large wraps are about double the size of a small. Tastes alright, similar to other places. 

They've got a nice selection of beverages such as ramune.

Having fresh vegetables available near Eaton centre is a welcome addition."}
{"text":"Had to review because this was the worst poke bowl I've had. Had the Tokyo bowl and it was drenched in sauce that made for a weird bitter experience. Adding the really sweet tomago pieces definitely didn't mesh together for me. The biggest deal breaker for me was that there was so little fish, it's such a joke when you compare it to other poke places. Watching them scoop one tiny scoop of fish into the bowl was amusing. I get that poke is the new thing but if you're going to open one just to get a piece of the action, at least do it right. If you're looking for more of an authentic experience, this place does not offer it."}
{"text":"Staff:  The staff here are amazing! I came in Tuesday evening with a friend, and the two girls who worked here were hilarious!  Definitely recommended.  

Food:  I had the signature alaskan poke bowl, and they made sure to add in 2 scoops of tuna into the bowl.  You can also ask for extra toppings! (I got extra mango)

Overall a great experience!"}
{"text":"Been to Poke Wrap for lunch a few times now, since it's close to my work place.  I have tried the Toronto bowl, Alaskan bowl and California wrap.  The wrap I had was decent in flavour, but I found the bowls to be on the bland side.  I had always pre-ordered my items for pick up, so I wasn't able to customize my orders.  If I had ordered in person and asked for more dressing, it might have been better.  But overall, I still think there are better poke options in the area."}
{"text":"I ordered the Alaskan regular size ($14 after tax). I asked for half rice and half zucchini noodles as my base. Overall it had good flavours and was filling for the portion. The Alaskan contains white tuna for the protein and it was a tad too fatty/buttery for my liking. The onions was also too pungent to enjoy as a topping. First time trying zucchini noodles and as a carb lover, I'll stick with my rice lol

I should have customized my bowl because my friend customized his, and I enjoyed it more than the Alaskan (sriracha mayo was great)! He ordered the regular size and you get 2 types of protein and lots of toppings choices! Avocados are $1 extra to customized bowls. 

This place is small with only a tiny window sitting area and colours are very vibrant (hipster/cute vibes). There was no line and service was very friendly and accommodating. The prices and portions are good/similar compared to other poke places and ingredients were fresh. It's very close to the mall (great location) but the entrance is quite small and could be hidden. I'd give this place another try if I'm in the area"}
{"text":"Great location and very convenient to grab in between classes! There are also quite a few seats for you to eat there too. 

Been here a few times, and it's usually not too busy so you do not have to wait too long. The workers are very kind and patient with you, therefore customer service is a win. 

They usually stuff my bowl which is nice, and the salmon is very fresh and there is a lot of mix-ins and toppings to choose from. 

The price still seems a bit pricey to me. It's almost $14 for a regular size bowl with $1 extra charge for avocado. And there has been a time when they charged me extra for avocado but never added it into my bowl which I am assuming the worker forgot. 

However, worth going if you're around the Ryerson area and looking for a healthy and quick meal!"}
{"text":"I grabbed my usual poke bowl today and the cashier was very nice. However the girl who usually prepares the food did not seem friendly, she seemed to be a new hire as she didnt give me the same portions I have recieved for the past 5+ times I have eaten here. I was very disappointed in the amount of food I was served for the price. I felt as if I was ripped off. Not quite sure if i will be coming back to this place again."}
{"text":"My 1st poke experience and I love it! I quite enjoy the zucchini noodle base and the fresh ingredient selection. I crave this quite a bit now and I'm kind of sad I no longer live within walking distance of it. It is a little expensive but it's a decent portion (the big bowl). It's one of those indulgences where you don't have to feel too guilty as it's a fairly healthy, yummy meal."}
{"text":"I had the Tokyo wrap on my first visit. It was big, filling, and tasty. For the price you pay ($13) the salmon and topping portions were good. The ingredients also tasted fresh. For an extra $3 you can add protein. 
Service was nice. I asked for cilantro and less sauce and they were nice about the changes. I've tried one other poke-type restaurant a few months ago (Su&Bu) and like Poke wrap better--less gimmicky and tastier imo."}
{"text":"The poke bowl tastes exactly how you would think it would taste. For $13, it's not a terrible price - but for those big eaters who are looking to satisfy their appetite, the portions and general nature of the bowl might not be enough.

However, if I'm craving another fix - I'd definitely go back."}
{"text":"Best poke bowls in Toronto!!
Many variety of ingredients when customizing your own bowl. 
Service was just perfect, they offered some sides of sauces and extra crunch to give the bowl that last touch.
Would recommend to any person coming to this place.
Not as expensive as other poke places and the amount of food served is a lot.
Actually struggled to finish the whole bowl. But totally worth it!!"}
{"text":"4.5/5

Decided to give Poke Wrap another shot after the owner, Steven, invited me back. Needless to say, my experience this time around was completely different.

Upon entering, I was greeted by the people working there. They recommended that I make my own custom bowl and that signature bowls are really just for people who are in a rush and boy were they right! I went with rice, salmon, red tuna, avocado, a bunch of different toppings, and spicy mayo with shoyu sauce. All of the ingredients were incredibly fresh and tasted amazing. Special shoutout to their shitaki mushrooms imported straight from Japan - make sure you get this topping.

Also worth noting is that there is ample seating and a really clean vibe and aesthetic about this place. The marble table is perfect to take nice pics for ig.

Will definitely be back! Poke Wrap is one of the best poke joints in Toronto - their portions are very generous, it's conveniently located, and has a great aesthetic."}
{"text":"Went back again and tried the zucchini base. Not bad. They have bean sprout which is a relatively  unique option. 

Still quite pricey compare to all the nearby ones."}
{"text":"I grabbed a quick poke bowl today before my bus ride. I always see poke wrap walking down the streets and I always wanted to try it. I managed to snap a picture of this bowl (very ugly image though cause I took it at the train station) and I'm too ashamed to post it compared to the instagram worthy images on this Yelp page.

When I came here, no one was waiting in line so I didn't feel like I was rushed at all. The staff members were super friendly and offered to help if I had any questions. When I was ready to order, the Yelp check in was a little glitchy, but the staff was super patient and offered to use their phone to show me how it works.

I ordered the Toronto bowl, and it's $12.18 for this poke bowl if you do the Yelp check in!! Thank you poke wrap for this delicious poke bowl! The staff asked me if I wanted the jalapeno in my poke bowl and how much I wanted cause the Toronto bowl includes that option, which I thought was super thoughtful because a lot of people might not even ask.  

This was a massive bowl to start off with - it was the regular size (I think that's pretty standard for a lot of poke places). The fish was extremely fresh and they came in large pieces, which I enjoyed compared to the small pieces. Poke wrap was really delicious, I think next time I come back, I'll share this massive bowl with a friend!"}
{"text":"Overwhelmed by how much fish I got in my regular sized poke bowl! Toppings and fish amount is just (maybe if not more than) as much as the rice bed.

Great selection of toppings. Fish is cut into large bite sized pieces and pretty fresh.

I would say one of the better places in terms of bang for your buck to grab a poke in Toronto."}
{"text":"I want to live here, but with even stronger AC. The area is a bit small but so clean and tidy. Very quiet but I like that. 

The staff are very nice and they volunteer to go through their ordering procedure with you. He asked if this was our first time there and we had answered yes. 

The food is so. FRESH. The fish was spectacular and the veg are great. I love that you can have unlimited mixins and three toppings. You can even have unlimited sauces. 

They also have their own house seasoning, which is sesame and some other stuff like seaweed. It's great! 

Their portions are huge so if you're hungry, this is the place to stop by. 

For $15 regular bowl, it is extremely filling. I'd love to come back. No wifi but I still love this place."}
{"text":"It's really convenient to get some food in downtown. Taste really good."}
{"text":"Poke Wrap is the first and only place where I've had my poke bowls. The price of small bowl is $7.97 (1 scoop of protein) and regular bowl is $11.97 (2 scoops). Add $1 for avocado. The food was good to my taste and I will definitely go back. The only thing that I didn't like there is how the server scooped back the salmon from my bowl (and put it in the bowl of the person after me) after she accidentally put 2 scoops of salmon in my bowl instead of 1 salmon and 1 red Tuna."}
{"text":"I ordered take out from Poke Wrap and I only realized once back at the office that my owl had a total of 5 pieces of salmon in it, and they were drenched in spicy mayo. The bowl was easily 90% rice , 5-6 pieces of edamame, some lettuce, some red cabbage and rice crispies and the whole thing covered in spicy mayo.

Everything tasted like spicy mayo and sushi rice and I was left halfway through my lunch with a bowl of white rice.

The staff was friendly and offered creamy wasabi (wasabi+mayo) when I asked them if they had wasabi. 

Overall, I would much rather go to north poke in kensington or poke bowl nearby."}
{"text":"I love Poke and this has to be one of the easiest and convenient places to get it! It's also very affordable too so very good for those on a student budget! The location is perfect just north of the Eaton Centre and Ryerson, definitely a great spot for lunch. I have not tried their signature bowls, personally I prefer to build my own. I love the variety of vegetables and bases you can get, including zucchini noodles! I pretty much eat the same thing each time and wouldn't change a thing.

I like all the marble furniture they have as it makes for insta-worthy photos. 

I have to say, the best part about this joint is THE WASHROOM! It's a spacious, super clean single stall! Which is so rare in downtown Toronto! I love not having to walk down some sketchy wooden stairs (as most small restaurants have due to space limitations), instead same floor and also a nice washroom too!"}
{"text":"Was walking around ryerson when i saw this new poke store. Had a nice bright interior, limited seating but seating opened up by the time i recieved my order.

My girlfriend and myself ordered both one large wrap and one large bowl. We had the signature Toronto roll which was a salmon and spicy mayo based poke wrap. The wrap was MUCH bigger than expected and was filling by itself. The bowl i decided to customize it and i chose one scoop red tuna, one scoop salmon, miso, soy, avocado(its a must) and veggies such as jalapenos, corn, seaweed salad, and lettuce. The bowl was by far the best bang for your buck and i'd come back for the bowl in a heartbeat!

I would def recommend this place for a quick bite if youre on the go for lunch."}
{"text":"Vegans take heart, even though they insist you choose a mandatory protein, I left a note asking for avocado instead and they obliged. The only lame part was that I also paid for extra avocado so I think more than one slice was in order. 

That aside, the zucchini noodles, lettuce, carrot, enoki and sweet onion combo I created a as delicious. I topped it at home with coconut vinegar and coconut aminos. And more avocado. 

For the small amount, it is quite expensive (22.04 to deliver one smallish salad called large) but they were attentive and I enjoyed my meal. 

See how I ordered a large and the container was far from full, which it should have been especially since I refused all expensive salmon, crab, ahi and tuna options. Impact Kitchen still way better, but they weren't delivering today."}
{"text":"I really like this place! It's very clean and the service is quick and friendly. Not much else to say other than to keep an eye out for their specials!"}
{"text":"... I kind of love this place. I've been here twice in a week, and both times the food and service was great - I think they are students, but they were so accommodating to my pickiness! Added bonus, they open until 10:30pm, so it's one of my late night healthy eats.

I always get a large custom bowl, with zucchini noodles as the base. Rarely have I seen any other Poke Bowl place that give you the option of a FULL veggie option, often it is halved with rice or some sort of grains, so it is good to have this as an alternative.

As a protein, I try to get a combination of White Tuna and one of the other fishes. The fish has been fresh and a solid portion too, giving me the protein substance I need!. I only ask for a splash of Ponzu soy, given it is pretty salty to begin with, and there are still lots of toppings to boot! However, if you fancy something else, there are about 8 sauces available to suit your needs and wants.

I load up with the toppings available (cucumber, corn, edamame, etc....), and end with seaweed salad, tamago, and sprouts. 
The end product is flavourful, fresh and filling (F3). If you come here often, ask for a stamp card.

From the outside, the storefront looks simplistic, it is sandwiched between two other oddballs on Yonge Street. However, the interior, while simple, is clean and fresh. Don't judge a book by it's cover.

My vote for best Value for a Poke Bowl, hands down."}
{"text":"Really enjoyed the poke bowl from this place! I decided to do the make your own poke bowl rather than the fixed options. I chose rice as my base (obviously), and you could choose 2 fish if you got the regular bowl so I got red tuna and salmon. There were a bunch of toppings you could choose from as well as sauces. The staff were very friendly and helpful in answering our questions since it was our first time there. We were the only ones there when we went so we decided to eat there but it's a very small space with maybe only 5 chairs. Would recommend going at non peak hours if you want a seat!"}
{"text":"I've wanted to come here for quite some time now and I'm glad I've finally did. I was in a hurry to grab something quick and luckily there was no line up (it was around 6pm on a Wednesday). 

Upon entering, no one cared to explain how to order from their menu. Fine, I can read and understand it myself but it would have been nice to have someone quickly explain it as do most places would. 

Their menu included 3 poke wraps/bowl and there was also the option to create my own and it came in small and large. I opted for that. I got to choose the base, 1 protein, sauce, unlimited mix-ins (avocado costs an extra $1) and 3 toppings. It would have also been nice if they explained what type of sauces they had 'cause I had no idea what each sauce would taste like.. When I asked the girl which one she recommended, she said 'I don't know..try _______' (I forgot what the sauce was called LOL) but lucky for her it tasted pretty darn good. 

I order the small bowl which came to $9 (tax included), which was kinda expensive and the protein was the size of an ice cream scoop. But honestly it was still delicious and I'd definitely be back to get the large! 

Edit: came back for the second time time around and this time the servers were much nicer and they explained everything from how to order and what the sauces were. 

I got the large bowl ($14 after tax) and they had I can choose up to 2 types of proteins. I'm not sure if this is only for the large bowl because when I got the smaller bowl the first time I got no explanation and they just asked me what protein I wanted. Then there was unlimited mix-ins and when I asked for extra mangoes, the server was super nice and after putting in some more she asked if that was enough or if I wanted more (most places wouldn't even do that). I chose the same sauce as last time but when the server was putting everything together, she said I can add more sauce or get it on the side. That's when I asked if she could explain what the other sauces were and she did so I added another. 

The only reason why I took one star off is because I felt the taste was a little inconsistent. The first time I was here, there flavours and the sauce was really tasty however this time after adding in both sauce, I felt it was a bit dry...? And the flavour wasn't as strong as my first. 

I'm still interested in knowing how their zucchini noodle taste but I'm kinda skeptical 'cause I don't know if I'll like it and I don't want to pay $9 for a small bowl..kinda expensive. Let me know down below if you've tried it and if it worth getting or not!"}
{"text":"Solid place to get your Poke fix !  

Popped in on a Monday evening.  Not overly busy which was probably a good thing.  The shop is very small.

Ordering is simple, you can choose one of the 3 menu options, or you can customize.  I went for the customize.  The ordering principle is like Chipotle.  You pick your base, you add your protein and then you pick your topping and mix-ins.  I went for Rice, Salmon & Tuna, the wasabi cream sauce, edamame, mango, rice pops and nori.  All solid choices, however watch out for the wasabi cream.  That stuff has a kick !  Decided to get a regular sized bowl and it was really delish.  

As mentioned above, the place is small, just the ordering counter and a counter along a wall with maybe 8 high stools.  

Overall its a really good place, and the ordering process seems simple the layout of the toppings were definitely not thought out as the gal who put my bowl together had to work around another gal and go someone out of order (not the smooth assembly line like Chipotle).  My only gripe is that the Tuna was tough.  Which typically means its not the best quality cut.  Something that is a dangerously thin line when it comes to sushi grade tuna."}
{"text":"Updating the review. They give so much more meat than before. Like huge cubes of fresh tuna.. Have to up the review to 5/5. Nice work!

Just one thing.. why is avocado an extra $1.. it's not even guac there was no real extra labour.. just a slice of avocado, don't think its worth it."}
{"text":"Shared a large Alaskan Wrap ($12.97 for large size) with a friend. It had lots of flavour but the rice wasn't all fully cooked.  My friend threw her wrap in the garbage after a few bites because of the rice and too much wasabi mayo.  Not sure how all these poke stores are going to survive with so many in the area and most being very similar to each other.  Hoping they will start to be more creative and add new options like poke nachos, poke poutine, ...."}
{"text":"Nice spot to have poke!! Location is great abs easy to find.  Nice selection of toppings. Would come back"}
{"text":"I chose to make my own bowl, as it costs the same as their signature bowls. 
I got a regular size with salmon and tuna. The zucchini noodles are raw and crunchy, I'm glad I got rice because I'm not sure if I really enjoyed that zucchini. Also, I got majority of the free add-ins. The difference with this place and other poke places is that they mix the fish and add-ins in a bowl with the sauces you choose. So the fish isn't really marinated in sauces (less salty but also less flavour). The toppings are then put on top, separate from the saucy mixture. 
I got seaweed salad and cabbage as toppings; they take up more volume than things like tamago or tobiko which is why my bowl looks more full. It was alright, I liked all the extras I could add, but I think other places like poke guys tastes better."}
{"text":"Recently visited for a quick bite before running to a TIFF screening at Ryerson Theatre. Their simple yet bold storefront caught my eye as I walked down the street looking for something easy to eat in line. (It was also $8 for their back to school special that week.) This take out venue has limited seating and some bar counters for diners to eat at on the side/by the window. The narrow store encourages organized line up and is kept very clean.

I ordered the Tokyo wrap, which had a couple interesting toppings I have not yet seen elsewhere - enoki mushrooms, tamago (egg), and seaweed salad. I really enjoyed the addition of the seaweed salad as it added a little sweetness and a really satisfying crunch. They were generous with large chunks of salmon and the mixed filling spilled out while they were rolling my wrap. The lady at the counter carefully stuffed it back into the ends to ensure filling in every bite. 

I do like that they mix the filling with your desired sauces so it's uniform and coated. That was one of my major concerns at Poke Guys - their marinated fish was way too salty and felt a little slimy. You can even ask for a small plastic bag to make sure nothing drips or spills while you eat. 

Really good value for the amount of fish/mixings given. Would return if I'm in the area!"}
{"text":"A healthy fast food alternative when you craving something that's good for you, but want a little more than salad. 

Extra star for having zucchini noodles as a base choice, which is a much better option than greens or rice because of the extra crunchy texture. No matter how you assemble your bowl, you end up with something delicious with great texture, flavor and balance. I had the small bowl and found it to be the perfect size for a lunch meal without leaving me in a food coma afterwards. 

I got my bowl to go, but there is a line of chairs against one of the walls that you can sit at."}
{"text":"Really delicious! Disclaimer, I haven't been to many poke places in Toronto so I cant compare to competitors.

Location: convenient, close to the subway.
Space: Clean, love that they serve in reusable bowls if you were to dine in.
Food and Value: Awesome for the price you pay. My boyfriend and I opted to get poke bowls since we were hungry (80%) but not enough to gorge on mounds of sushi at an AYCE. We were both comfortably full! Love the customization option."}
{"text":"Sushi burritos were quite good, and I definitely enjoyed it.  The fish seemed quite fresh, and the sauce was quite nice and had a good amount of heat to balance the sushi burrito, and everything seemed clean and well balanced.  

My only complaint is that it might be a bit expensive for what you're getting.  ~15 bucks for a sushi burrito that isn't even filling is just a bit much for the area.  I get that raw fish is expensive, and for a sushi burrito it's not that small, but I kinda feel like 10-12 bucks is more fair for what you're ultimately getting."}
{"text":"I was super excited to try this place since it's close to work and I've heard good things  but sadly I don't think I'll be returning. 

I really wanted to like this place but the portions are just so small... it's great if it doesn't take much to get you full but it just wasn't worth it for my boyfriend and I. It ended up being $27 for two regular bowls and my boyfriend wasn't even full. 

I ordered the poke bowl and got salmon + crab for protein, sushi rice, wasabi mayo + golden sesame, and a bunch of toppings. I barely tasted any salmon which was disappointing. I mean it didn't taste bad at all but it definitely wasn't amazing either. 

I LOVE the decor of the place and staff we're really nice. I also think it's cool that they offer zucchini noodles as a base but it's not enough to bring me back."}
{"text":"Hi Everyone:
I've decided to make Poke my food of 2017. Overall, I enjoyed the place. The location is easy to get to for me. The speed and quality of the services was goods. The Poke choices were nice and would be happy to go back.
Thanks,"}
{"text":"This is my go-to poke place in Toronto! I love the wide selection of toppings, and that there's the choice of ordering small or large poke bowls. Just wish there was more seating in this little place!"}
{"text":"3.5/5
Stumbled across this place on a rainy Thursday and decided to give it a try. I decided to go with a salmon wrap and my girlfriend went for a red tuna bowl. 
1. They only have small and regulars, no large bowls. That being said, a regular for $12 is still rather filling for a regular eater.
2. They don't charge extra for tuna as a protein- many poke places do.
3. They have a red miso sauce which was good! Not too spicy.
4. There's very limited seating- maybe 10 seats in total.
Overall our experience was satisfactory. The staff did mess up our order twice and my girlfriend ended up picking out edamame from her bowl. 
I would come back if I was in the area for a salmon bowl with red miso. But by no means is this the best poke place in toronto."}
{"text":"Mediocre poke at best. The wasabi sauce didn't really go well with the recommended toppings. They were generous with the amount of toppings you were given. Size of the bowl was larger than other poke places."}
{"text":"First poke place. Excited to check it out. Bowls were tasty and we got a decent amount of fish (it was early in the day). Not cheap for food on the go,or even compared to ayce sushi places, but yummy and great for taking care of sushi cravings when you are short on time. We ate at the counter. It was clean and bright.  Hot green tea would have been nice, esp as it's winter."}
{"text":"Amazing new Poke restaurant!  

The prices are very fair for downtown Toronto and all the ingredients were fresh.

You can customize your own roll/poke bowl or pick off bowls/wraps that have their ingredients firm off the menu.

The staff was friendly and worked diligently. 

The only down part was the wait time which took close to half an hour ):

I'll definitely be returning after the lunch rush from 12-3PM."}
{"text":"The good: the place is clean and inviting, almost reminded me of an ice cream parlour with the bright blue colour. I ordered a salmon poke bowl and added my toppings. I thought it was pretty neat to add what I liked and they made it on the spot. The small bowl was packed and I felt very full after. The service was very friendly too. Altogether, my bowl costed me about $10ish which I thought was decent. 

The bad: Hm more fish? Could always use more poke. Also, had to add $1 for avocado which wasn't included as a choice."}
{"text":"Never tried a Poke Bowl before but after watching many poke bowl muhkbangs (eating shows) the craving got reaaaaal! 

Super glad I lost my poke virginity here! It was amaaazing! Super flavourful and super fresh! I couldn't get enough of it. I also love that their are many varieties such as the zucchini noodles. So for those watching their carbs I definitely recommend you try it! 

Service is great! Very friendly and helpful, they even suggested what went well together as it was my first time.

Would I recommend this place to my friends? Hell yes!! I suggest everyone come here and try it you won't regret it!! I'll definitely be coming back!

Only downfall, wish this place was closer to home as I'd be coming here more often."}
{"text":"Simple and good food! Lots of choices and tasty options."}
{"text":"I tried the Toronto signature poke bowl and it's a bit smaller than what other places offer since they only have one size but the bowl overall wasn't that bad at all, lots of yummy fresh toppings. My friend who is vegetarian also enjoyed her bowl as well."}
{"text":"Yet another Poke restaurant on the scene in Toronto and being a huge poke fan, I had to give it a shot. Of the poke places I've been to in Toronto (Poke Guys and Big Tuna Poke), this one reminded me the most of the types of poke I had when I visited Hawaii in terms of preparation. Lots of ingredients mixed together in a type of paste with the fish, that may not sound appealing reading it here, but it was yummy. The tuna itself was pretty good, but still my personal favourite remains to be Poke Guys for quality of tuna. Poke Wrap does have some negatives, the biggest being the pricing for what you get. Still more generous than Big Tuna Poke but a small is surprisingly expensive considering how much tuna comes with it. Contrary to some reviews here, I received exceptional service from the employees and I played dumb when ordering to see how they would explain the menu and the cashier did a solid job of guiding me through it. Aside from some questionable pricing, a worthy addition to Toronto's growing poke scene."}
{"text":"Fresh food. Cheaper than the competition. Fills up the bowl. What else can you ask for?"}
{"text":"So good! Have a bigger portion of fish than other similarly priced places, good topping options and the staff are very friendly. Delicious!"}
{"text":"Love this place. Lots of options and well-priced. I like that you can choose from two sizes - some other poke restaurants only offer 1 size. You can pick as many sauces as you want but be careful, your food might end up being too saucy and salty. I make sure to ask for less sauce when I want to combine 2 or more."}
{"text":"Been waiting for Poke Wrap to open since the summer.  There isnt much fresh stuff on the strip on Yonge street.  Finally went there for lunch, second day after opening.  It was empty and 2 staff on hand.  Lots of topping choices and choice of rice, salad or zucchini noodles as the base.  Lots of mayo dressings.  Most of the things are tossed in dressing and placed on top of rice with a couple of garnishes like nori on top.  I think i would prefer a vinaigrette dressing and maybe drizzle of the mayo dressing because the fish gets hidden in it all.  But the taste is very good.  Price for the large is around $15."}
