{"text":"Wow! First time here... this place is the BOMB! So delicious! I had a poke bowl with ahi tuna and salmon with their house ginger sauce. I loaded it up with all kinds of veggie toppers, mango and pineapple. Yummo! We will definitely be back. So glad this place is close to home!"}
{"text":"Great place i had a poke bowl with octopus and ahi tuna with eel sauce it was wonderful friendly staff very clean  9.00 buck for a very frll"}
{"text":"This was our poke experience. It was fresh and delicious. Lots of topping options. We are definitely going back."}
{"text":"Great fresh poke! I've tried several places in the valley. I usually get the Ahi Tuna and the house sauce, but feel free to experiment! Their portions are bigger than most places. Even tried their macaron ice cream. Just the right size for a little bit of sweet dessert. Definitely recommend this place if you are in the East Valley."}
{"text":"10/10 would recommend. This place just opened up and it is just amazing!! Very clean and the employees are very friendly. I ordered a poke bowl and sushi burrito and it tasted fresh and good quality! They had a grand opening deal where you got a a macaron ice cream with a purchase of a bowl or burrito and it was delicious. The prices are reasonable and like other poke places. Will be coming back soon.  Keep up the good work!"}
{"text":"Been waiting for a good Poke place near by. Clean new atmosphere and super fresh food that tastes awesome! Great selection of toppings and two big scoops of fish in my \"sushi burrito.\" Will definitely be back!"}
{"text":"Great poke, incredibly fast and friendly service - especially for those who've yet to visit a poke place.  They also have fantastic dessert options like macaroons.   I'll likely regular the place as my obsession with poke is steadily growing.   My only complaint is that the yellow tail doesn't seem to be cut well - but this was a one time experience. On the other hand, great tuna. The best tuna I've had from a poke place."}
{"text":"Awesome place! I'm so glad there's a poke restaurant by me instead of 30 minutes away! Great service!"}
{"text":"O.  M.  G Great freaking sushi burrito!  It's like a sushi style Chiplotle.  Amazing fish quality at a great price.  This is a have to taste place!!!"}
{"text":"Food was amazing. The service was a little disjointed, but what do you expect during a grand opening. They will get it down. The food was so fresh and amazing! Love the atmosphere. 5 stars all round!"}
{"text":"I've had poke at several restaurants in the east valley and this is my clear favorite. The food is delicious and fresh. Everything is very clean. I always get the ahi tuna and spicy tuna with the sweet chili sauce. The coffee ice cream macaroon is delicious."}
{"text":"I had to come check this place out! I'd been seeing the reviews and hearing about it constantly! Excellent food! All the seafood looks and tastes incredibly fresh and clean! A wonderful variety of sauces to choose from and an amazing amount of tasty and ingenious vegetable toppings! Anything anyone from the novice to the most knowledgeable and \"seasoned\" sushi or sashimi goer! You can have it all mixed together or just gently placed atop your of rice, mixed salad, etc! I had the Poké Bowl w Brown rice, Eel & House Ginger sauces. The rest?? Well come on down and check it out! Knowledgeable and very courteous staff, willing to help you along toward your best delicious choices!! Don't forget the Miso soup too!!"}
{"text":"Everything was super fresh. I got the ahi tuna with their house sauce. It was a sesame ginger dressing and it was really good. Portions are generous and a bowl filled up my husband whom has quite the appetite. The veggies and add ons are all complimentary and yummy. Williams definitely be back and I will recommend this place."}
{"text":"Very similar to other poke places, but with more toppings and more sauces available. I got double scoops of the spicy tuna with half lettuce/rice, added spicy crab salad for an additional $.75. Rice was cooked well, lettuce was green and crunchy, and the tuna was cold and tasted good (but almost no spice). Everything inside and in the back was clean, along with the counters, floors and coolers. Checking out took about 2-3 minutes as the employees gathered around the register to figure things out, which I'm not shocked or upset about since it is a new place. Will happily return and recommend for those who like sushi and/or poke bowls."}
{"text":"This place is amazing...I'm an avid poke consumer and Poke Fuzio on par with their quality sushi and fresh toppings. Will be back for sure!"}
{"text":"Super yummy! I didn't get a photo of the food until I devoured most of it but loved the poke bowl. I got both tunas in my bowl with the house sauce. Drink is mango boba and mango and strawberry macaroons for dessert!  Yum"}
{"text":"Wow-yummy!!  My boyfriend and I are always looking for new and healthy spots to eat and this place exceeded our expectations. Fish was very fresh as were all the vegetables. Great choices on sauces and toppings too!  Clean restaurant and friendly staff. Will definitely continue to visit this establishment!"}
{"text":"Yes! Yes! And yes!!!!! Sooo good! It's my new go to place! We just moved here from California where like is pretty popular. We had a craving and decided to check this place out and I'm sooo glad we did. The price for the amount of food you get is perfect. The fish is fresh and so are all of the other ingredients. The staff is friendly, the service is fast and the establishment is very clean. I can't wait to go back!"}
{"text":"The food is good.  Poke bowl with choose your own ingredients.  We had tuna, Spicey tuna and tofu. All of them had good flavor.  The ginger sauce was a good balance of sweet and savory.   The biggest compliment goes to the staff.  We arrived a tad early and pulled on the door and found it locked.  As we were choosing where to go instead the staff opened the doors and invited us in.  The were friendly as asked us to pardon them as the finished setting up so they could serve us even though it was us who was early.  Fantastic customer service!"}
{"text":"This restaurant has a wide variety of food. I recommend the salmon with house sauce and spicy mayo. The food always tastes fresh. Best poke in Mesa! Restaurant is always clean and staff is helpful and friendly!"}
{"text":"One of the best pokes I ever tried. This is my second time here and I love it.  I usually do three proteins n their Albacore Tuna tastes amazing.  The people who work here are also very polite and they provide a very good service. Definitely highly recommend this place to everyone."}
{"text":"When I saw they were opening a poke place right around the corner from me I was beyond excited! And then today when I finally got to go in and try it out I fell in love!  they have so many delicious toppings to choose from and more than just the standard salmon tuna or shrimp proteins... they have octopus - which put me over the moon! The bowl portion is huge and they are generous with the scoops. I got two extra toppings ($.75 each) and it brought the total to $11 which for the amount of food I got I am willing to pay - because I'll have leftovers. Overall this place is amazing and soon they are even going to have boba tea drinks on the menu and loyalty cards!!! I am going to be a regular at this place for sure!"}
{"text":"Really delicious and nutritious spot, that also provides tasty treats  great friendly staff."}
{"text":"This Poke spot is amazing! Delicious, fresh and so many variety of combinations! If you're looking for a good poke place this is definitely a place to go!!!!"}
{"text":"Ok today was the Grand Opening.   It is very clean and crisp.  We ordered the burrito sushi .  Cool concept for sure. You pick the fillings, sauces and fresh veggies.  You also have your choice of sushi rice or brown rice.  Then it is neatly wrapped up in a believe is a seaweed wrap. The shrimp was fresh and the veggie choices were crisp and bright.  They give choices of things like cucumbers, sprouts,  onions, carrots and many other fresh choice veggies.  Then you choose your sauce.  Spicy mayo. Sweet chili sauce, and 3 or four other sauces (can't remember their names).  Then you move to veggies, then fruit toppings like pineapple.  You can add crunch at the end with choice options like sesame seeds, wonton chips, crunchy onion, and a couple other options. It is then packaged in a cardboard (recycle-able) box. The other option is to order the like in what's called a poke bowl. Definitely want to try this out.  If you're not sure of sauce flavors ask to sample to dial in a complimentary flavor with your choice of meat filling. I met Debra who manages.  She is warm and inviting.  She takes great pride in what she does.  I made a suggestion of something like tempura as an option.   She was gracious in listening and wanted to get out feedback on our experience. Definitely coming back.  Next time we're going to try the bowl."}
{"text":"I was not impressed with the food. I got a poke bowl and the rice was hard. The ahi did not taste very fresh. The serving size wasn't as big as I have had at other poke places for the same price. I will not be returning."}
{"text":"Very very disappointed with this place. Ordered through Uber eats and ordered a poke bowl with spicy tuna salmon and yellow tail. All that came on my bowl was about 5 small pieces of yellow tail and no other fish. I also ordered miso soup which they left out. After paying $16 for a poke bowl I expect more than that. Will not be coming back"}
{"text":"New delicious place to get poke in the east valley. Conveniently located off the 60 and stapler. The fish is delicious. I recommend the spicy mayo sauce Yummy. They have a wide variety of topping including watermelon radish and variety of fruits. Nice people and well experienced in the sushi business. It's a good place for lunch."}
{"text":"The smell of rotten fish was so potent when we first walked in that we immediately walked out. A place that serves raw fish should not smell like that."}
{"text":"So excited to have a fresh & delicious Poke place close to home. I literally could eat here every week and there's so many combination s you could make."}
{"text":"This place is clean and everyone was very friendly! Such a unique idea and I dig it. Not to mention their ice cream macaroons are AMAZING!"}
{"text":"We were so excited to finally find the Poke Bowl experience here in Mesa. We had it in California and loved it. Our hopes came true with Poke Fusion. I might need to have my mail forwarded!"}
{"text":"I was really excited to see a local shop that serves fresh poke bowls and I was really impressed with ambience and cleanliness of the place. They have a number of fresh options to choose from and their recommendations for mix-ins are stellar. The owners are really generous with their portions and the price point will meet the needs of any consumer that gives them a try. Do yourself a favor and get a poke bowl or poke burrito as often as possible!"}
{"text":"Items seem to be very fresh the couple times we have been here. Loved all the protein options, bit my favorite is the spicy tuna! Loved the greens and brown rice option as I don't love a ton of rice. Loved all the fresh veggie options and the fresh mangos! Only issue was communicating with a few of the employees. Just didn't seem to understand me. But I will continue to go here! Really loved my bowl. You won't be disappointed!"}
{"text":"Found this place on Yelp on way to Chandler. Great presentation upon entering. Very clean and tidy. Menu is simple and easy to understand how to create your own bowl or sushi burrito. I loved all of the fresh options for add-ins. pineapple and mango adds a sweet touch that I've only seen in Hawaii for their poke bowls. Staff is very helpful and friendly. Very reasonably priced for a poke bowl!!! Tasted amazing! Fish was very fresh as were all of the ingredients.  A plus: the bathroom is extremely clean and has a cool sink that has an automatic soap, water and hand dryer all together.  I would definitely recommend this place and would love to stop by again next time I'm in town. Thank out for making my mouth and tummy very satisfied"}
{"text":"First time Poke visit for me.........  I liked it!!  Bowl or Burrito?  I went with the bowl first time around. Nice choices, the Ahi tuna was good and I LOVE all the veggie choices. Watermelon radish, radish sprouts, fresh green onion.  You write down your order on a slip of paper and they make it for you. It was fresh and delicious. The only slight complaint is that I think they could of filled up my bowl a bit more with brown rice or more veggies. I think that would of been perfect. Non the less, I'll be back!"}
{"text":"Last night I didn't know what I wanted to eat but knew I didn't want to cook. I was searching in Yelp to find some ideas when I saw Pole Fuzion. I love Ahi Poke Bowl but there's no locations close to us. This place also advertised sushi burritos. A burrito is just a large sushi roll that you eat with your hands. No tortillas involved.   Well we went and loved it! Fresh fish, friendly staff and lots of options to choose from to have it your way. We will definitely be going back."}
{"text":"Wow what a place, extremely friendly staff, quality ingredients, and a great eating experience, came with my girlfriend and everyone who works there is so nice and they have such a great selection to customize your poke bowl how you like. Regular customer right here!"}
{"text":"We tried Poke Fuzion this past Thursday evening. I had to run errands and didn't have time to cook. Wanted to pick something up and eat it at home in our pajamas, not spend a ton of money and not feel full of greasy fast food. Poke Fuzion was the perfect choice. I got the Ahi Tuna bowl with House sauce, rice and all kinds of veggies and toppings. It was excellent. The tuna was fresh and yummy. Next time I will ask for a little extra sauce, but that is pretty standard for me lol I'm looking forward to trying the Yellowtail next time and my partner said he is going to try the burrito cause they looked delicious when he picked up our order."}
{"text":"If you like sushi you will love this place. It's like a sushi/ seafood Chipotle. They create a bowl or \"burrito\" for you with ahi tuna, shrimp, octopus, etc and add veggies like cucumber, mango, onion then your sauce. All on top of rice. Really fresh, really delicious. I recommend the ahi tuna, sweet chili sauce with ponzu sauce and spicy mayo is my favorite sauce combo. You gotta try this place.  The guys that work here are nice to. Get it to go or eat in."}
{"text":"Just tried for the first time, and loved it! Got the sushi burrito and was stuffed half way through. I often go to other poke places and I can say their portion sizes here are huge.   It's awesome they also have boba tea and macaroon desserts.   All this place really needs is some enthusiastic college kids working the front to add a little bit more professionalism, like Pokitrition."}
{"text":"Poke Fuzion is the first place I've found in the valley so far that offers tofu that has actually been seasoned. They also have a vast array of toppings, some that I haven't seen at other poke places I've tried, such as pickled radishes. I would definitely recommend Poke Fuzion!"}
{"text":"This is a really nice little strip mall restaurant. The Poke is fresh and tasty, the portions are good and the price is reasonable. The service is friendly, and the restaurant is very clean. If you crave a nice bowl of poke, this this a try."}
{"text":"Wow, totally blown away by this place!! Amazing dinner- we tried a bowl and a burrito and think next time we will both go with the bowl because it's a little easier to eat and there are so many amazing topping options! The ahi and yellowtail were fresh, tasty, and cold. The ginger sauce was the favorite over the house sauce since it was pretty sweet for our tastes. The seaweed salad was outstanding and the portion was generous! Worth the little extra for sure! Seriously can't wait to go back, it's that good!!!"}
{"text":"I order through door dash regularly through work. So yummy! I feel full/satisfied after a bowl but always wish I had another because it was so good! The ponzu sauce is my favorite!"}
{"text":"Tried this place for the first time yesterday after driving by several times and being intrigued. Simple, and great concept. Think of Chipotle but with poke! Hubby tried the burrito while I did the bowl. I was thinking the seaweed would get too over powering but after tasting hubs burrito it was actually delicious and not over powering at all. Fish was fresh and we loved all the add ons! I wasn't overly impressed with the \"house sauce\" so I'll try something else next time. I can honestly say I hope this place sticks around because I'm a big fan!"}
{"text":"I have given this place two tries and both times I end up with horrible, HORRIBLE food poisoning. Writing this review off of my porcelain throne. First time I tried this place my friend and I both got sick, this time it's only me (as far as I know). It's a cute little place, but it does not sit well with me at all. And I've had my fair share of poke. Maybe it's because it's in Arizona. Idk. But I will NEVER eat here again."}
{"text":"Against my better judgment, I found myself at Party City on October 30th trying to scrounge up decorations for the house. I was dealing with heavy hunger pangs while in the checkout line and remembered that there was a Make-Your-Own pizza spot a few yards away. I was initially met with dismay as I walked out of the building to see it no longer existed. My mind seemed to be set on pizza and I threw my come ups in the whip and jumped in.   I was about to throw the xB into reverse when I saw that the pizza joint was now a poke joint. I've seen these spots popping up all over the place since I first had a bowl in Carlsbad, CA called Yoshi's (or Yoshio's? I can't remember). I actually hadn't had one since then, so I decided to call an audible on the pizza and walked over to Poke Fuzion.  First off, the vibe is nice. It's clean, with modern interior and some really cool music going on.   I ordered a sushi burrito and had the thing packed with two different proteins with tons of veggies. It was amazing. THEN, they had to go and hook it up with a macaron as part of their grand opening celebration.  I am very happy I decided to check this spot out, and I'm worried that this suite is cursed since I don't know how many other restaurants didn't make it in its spot. Yelpers, do Poke Fuzion a solid and check it out."}
{"text":"Real talk, I've paid a lot more for a lot less food (when it comes to Poke). The staff were all very friendly and happy to walk my family and I through their \"build-it-yourself\" set up. You can tell all of their ingredients were fresh and their Albacore Tuna was delicious (more so than normal, for some reason. Maybe I was just really hungry?).   In case you didn't notice, they do a discount with Yelp check-ins. Don't forget!"}
{"text":"Yum yum. Reasonably priced. Extremely less than ordering sushi and has salad with sashimi instead of rice. Unlimited toppings. They are able to make sushi burritos here too where most poke places don't. At some point I am going to have their macaroon ice cream sandwich. There is a Yelp coupon too for checking in."}
{"text":"Lived in Southern California for a while and there a bunch of different spots that I would go to for Poke. I would say that this place has more variety than other places that I have been to. Lots and lots of choices from fish,tofu,chicken to many different sauces and toppings. Fish quality is good as well. People were nice and the place was clean. Worth checking out if you're in the east valley."}
{"text":"Poke Fusion is fabulous! Fresh food made just the way YOU want it... great selection of toppings/mix-ins & sauces!  Super heathy too! Friendly employees & clean restaurant!  Been here twice in one week - could eat here every day!"}
{"text":"We had a good poke bowl lunch at this new place.  There is a variety of options and the bowls were customized to each of our tastes.  Everyone enjoyed the experience.  I think there are a few kinks to work out in the operations/process, but once they nail that it will be a terrific place to go."}
{"text":"I came here not ever having poke before..go ahead and gasp, I am shocked it was my first time too! I figured I might as well give in and jump on the poke train...I mean everyone is doing it right?? I am so glad I did follow everyone else and jump on that darn train!!  It was a little overwhelming to me since I was a virgin with the whole poke experience but as most know already, I research the living death out of places so I knew what to expect, just didn't have my mind made up completely on what I wanted. My experience was awesome. I went at an earlier than dinner time so I was, at first the only one there. I was greeted by a super nice lady to be of my assistance. I explained I had never been before. She guided me through and was very helpful. She encouraged some heat and I was glad she did. I got spicy tuna and shrimps. The fish was fresh, all the ingredients I piled on my greens were super fresh too. The sauce was awesome and I seriously had over half left when I was done, yaay!!! Fourth meal it was!!!   I am kicking myself for not taking a photo, I mean this meal of greatness seriously looked like it belonged on a damn magazine cover.  Will I Return? You betcha!! I want to try all the fish and am looking forward to the so many different ways you can change the flavors with the sauces, obviously the proteins, the toppings the veggies, fruits etc...so amazing!!   Restaurant itself is very nice, and sterile, not creepy sterile but the cleanliness you would want knowing the food that is being prepared. They offer macarons too (next visit!)."}
{"text":"Love this place, fast, fresh, tasty and the options are endless!  I've had both the burrito and the bowls.  Been there 4 times now and have tried multiple combinations.  Never disappointed!  Would've given 5 stars but honestly they lack customer service skills.  Staff never smiles nor are they friendly, absolutely no small talk and they don't offer suggestions and seem annoyed if you take too long to decide what you want, even when no one was waiting behind me."}
{"text":"The portions of fish are on the bigger size compared to other poke shops I've seen in the area. As well there was a lot of sauce and toppings to choose from."}
{"text":"Went to this spot for the first time a week ago and fell in love with it!  Upon walking in, the interior was very neat and organized, and there was plenty of seating to be found. We were greeted and helped immediately by the staff, who were incredibly helpful and kind, and I was immensely pleased by the variety (and quality) of toppings they had available for my sushi burrito.  I ended up getting tuna/salmon as my protein, with sushi rice, edamame, radishes, crab salad, and some other goodies. The amount of sauces available was great too; I couldn't decide what I wanted (aside from the spicy sauce) so I requested a couple of sides of sauce and did some burrito sauce dunking to try them out.   I really enjoyed coming here, and will definitely be stopping by again soon!"}
{"text":"I brought my 11 year old son here this evening.   He is no stranger to sushi and fish of all varieties.  He reported that his ahi was mediocre and not really fresh.  I tasted his bowl and have to agree.   Not bad, but not great.  We both had bowls with salad.  I chose spicy tuna and yellow tail.   They were also not too bad.   We tried eel sauce, house ginger, house spicy for the sauces. All of them were spot on.    I love the option of adding the crunchies like roasted seaweed, onion crisps, and sesame seeds.    If it were about the extras and the toppings, this would have scored higher.   Since the fish didn't hold up it's end of the bargain I have to call tonight's dinner a resounding \"meh\"."}
{"text":"So glad this poke place opened up! It's a new spot, but it's definitely becoming a fast favorite for my friends and me. I've tried both the sushi burrito and bowl here - definitely prefer the bowl over the burrito because it's easier to eat and easier for the servers to put in everything you want. I usually get double salmon in my bowl, but their tuna, albacore tuna, and spicy tuna are all good options as well. They have a lot of protein choices but I usually just stick to those four. Everything is pretty fresh, and there are also a ton of toppings that you can put into your bowl. For sauces, I personally like mixing the house sauce and the ponzu for a little tanginess. Service is always good, and the place always looks spotless. I'd definitely recommend coming here to get your poke fix!"}
{"text":"Love this concept! Basically a subway for poke bowls and sushi burritos. Very delicious if you know what you like. Only downside is burritos fall apart way too easily!"}
{"text":"It was yummy and fresh!!!! Love all the choices! I got a bowl with lettuce instead of rice. Put the Ahi tuna and shrimp on it. There were so many choices for the veggies to put on it. Total was just under $10!! Good price and delicious!! I will definitely be back!!!"}
{"text":"All local poke places seem a bit different in their offerings, prices and ambiance.  I had a really great poke bowl here and would come back over some of the other places. Quite often, there is too much rice (I always stick with the white rice base). The proportions between proteins, sauce and toppings were perfect for me.  The rice wasn't dried out (yes, it happens at certain poke bars). I wish yellowtail was a protein option but it wasn't available. I got marinated albacore and salmon. They also offer tofu and chicken! Tofu I get, chicken not so much.  Toppings were extensive (see photos) and I love fresh mango on my poke!  10% off first visit when you check in, its worth a shot and you won't be disappointed."}
{"text":"Seriously this place was so good!! Friendly service and great food the fish was fresh the food was so good we will definitely be going back again and again"}
{"text":"So much variety of choices of protein and selection of toppings! My favorite is their spicy house sauce and the mango topping. And you also get a free macaron ice cream too!!"}
{"text":"Id give this place 3 1/2 stars. It eas really good and had a variety of protein which I liked.  Not as good as Pokitrition and I wish it wasn't extra for the seaweed salad or crab salad."}
{"text":"Ok - I'm a huge fan of Poke and I was really hope no to love this place - as it is much closer then any other Poke restaurants. I did not though - the albacore tuna was in a nice sauce and tasted good but the octopus was a bit on the older side and you could really tell. The salmon was ok - they charge extra for things that come included at most poke places like seaweed salad and crab salad. The presentation is off for me as well. They mix everything together so it looks like a mess in a bowl. - I love pretty food and there is such a missed opportunity here- the decor for the most part is just what you would find in any other Poke place except there is a large Christmas decoration hanging in the middle collecting dust??? -- I am disappointed in this place and will just drive the extra 8 minuets to my favorite poke place-"}
{"text":"Fabulous fresh food, very accommodating for food allergies and vegans! Will certainly come back....the manager was very friendly, the music was not too loud and very clean!!"}
{"text":"Probably the best poke place we've tried!! Everything tasted so fresh. The macaron ice cream sandwiches were amazing and hit the spot. We had family visiting from Portland and they loved it too! We will be back!"}
{"text":"Yum, yum yum! And very reasonably priced as well! Loved it Fish was fresh, they cater to you, and boba tea was good too!"}
{"text":"First Time here after watching a movie and I was pleasantly surprised. The store was clean, staff friendly and the bowls good. I opted for brown/white rice mix and spicy tuna with ponzu and jalapeño sauce. I love poke so this hit the spot. I would definitely recommend suggesting a light hand with the sauces if you are unsure of what they are."}
{"text":"Initially I was overwhelmed by the options (I've only ordered delivery and not in person) however, once I asked other people their go-to orders I placed my order. It was fantastic. The half salad bowl is massive and I've never finished it in one sitting. Love ordering from here when my PB&J just aren't cutting it at work."}
{"text":"Why do I order GrubHub?In ordrr to find gems like this! I have been there five times in 10 days I can't get enough of how perfect and fresh it is delicious to order the first few times of course I ordered from GrubHub and then I realized it's around the corner from me! So now I just drive 3 minutes save 7 Bucks and I get to make sure they make it exactly to order and they never let me down I just got back from California and the sushi perfect everywhere , here in town I usually have to spend hundreds of dollars and hope it's going to be good . now I don't have to spend that much money and I know it's going to be good I don't do all the rice if you do they have options I just have the salad with the Poke and I do the hokey pokey I'm a very happy girl happy happy finally! The spicy tuna is delicious the albacore is incredible I've had the salmon is fresh the yellowtail fresh I didn't care for the scallops only because I like my scallops raw and cook them everything is clean and I get my fill for about 13 bucks that's going to be a lot of savings over the years as a diabetic doing no rice I think God for this place thank you Poke fusion!"}
{"text":"First time here just the smell is great but when you dig it the poke is fresh and the crab salad is awesome!"}
{"text":"We were looking for a light and healthy dinner before hitting a moving. First thing I noticed was several people in front of us in line appeared to be regulars. That's always a good sign. The staff behind the counter were friendly and quick to put together the orders. I tried a bowl and my wife a wrap. Both were very good. We don't live nearby but if we were in the area for lunch or dinner we'd stop back."}
{"text":"Unfortunately, I got very very sick after eating here the other day. All the terrible symptoms that goes along with food poisoning. In looking at all the great reviews, it does not seem to be common with everyone visiting this restaurant. But I included this review in case it happens to others."}
{"text":"fresh! great choices! great prices!  boom - boom - boom!  and every person who works here is very friendly!  what more do you need? go poke!!"}
{"text":"I'm pretty picky when it comes to poke, especially out here in AZ. Took a chance on Poke Fuzion since I happened to be nearby and so happy I did! Generous portions, fresh ingredients, friendly staff, and reasonably priced. I tried the lychee green tea boba too, but it was a little sweet for me and the boba was mushier than I prefer. But will be back for poke again, for sure!"}
{"text":"I had a sushi burrito yesterday it was sooo delicious !! The employees were very friendly and the restaurant was clean and the food very fresh! Must try"}
