{"text":"The place was clean.  They do encourage you to take out. Order was wrong peirogies mislabeled asked for mushroom  was labeled mushroom got meat.  The stuffed cabbage was undercooked  hopefully it was just a bad day for the kitchen."}
{"text":"Someplace on Yelp said they are closed.  They are not closed. What a wonderful place.  I grew up in Chicago, with authentic polish food!  Have never found Polish food as good until Polish Goodies.  I have never had anything that I haven't like. Fortunately, they go to Farmers Markets. Their web page gives the information for when and where. http://www.polish-goodies.com  I bring the frozen \"goodies\" home and put them in my freezer to pull out and heat anytime.  No junk in the food.  No preservaties, color etc.  Just plain good food!!  Look at all the 5 Star reviews!  Well deserved."}
{"text":"Doesn't get more authentic than this. The food is all hand made any you can tell. Great place to try if you want some traditional polish dishes and want to know how pierogi are supposed to taste."}
{"text":"Tried this place out after a co-worker of mine, from PA, was in need of pierogies. The place is easy to find and the 3 A+ inspection reports hung behind the register are inviting.   Initially tried just the potato and cheese pierogies served with bacon and onions. Bomb.com. Soft dough. Chunks of bacon. You could taste the farmers cheese. Delicious.   Went back later that weekend (limited hours so check before heading over there) and expanded my menu to try the sausage and the cabbage rolls and (again) the potato and cheese pierogies. Everything was on point. Sausage had great flavor. The cabbage rolls were cooked perfectly and had a hearty feel to them. And, needless to say, the pierogies were Devine. I was tempted to finish my meal off with a plum butter crepe, but I had to draw the line somewhere. And it gives me something to look forward to the next time I'm there.   The owner is a sweet woman who you can tell takes pride in her perfected craft and genuinely enjoys feeding people. You'll leave with a smile on your face. That's for sure. See you again very soon!"}
{"text":"As close as I've ever gotten to being as good as my Babcias. The Potato and cheese pierogi are so good, served with fried onions and ham, with a side of sour cream. It is a bit far from my place but I will be going back. You can purchase the pierogi frozen to take home. Awesome."}
{"text":"I work around the corner from these guys and considered going in there for months but never got around to it. I wish I'd gone sooner!! The Polish sausage was DELICIOUS and the bun was fresh and wonderful. It was a huge sausage, too! More than worth the $5.50. I also ordered the potato and cheese pierogies (something I'd never had in spite of being Polish by heritage) and they were to die for! I would often look at the menu and consider ordering some but never really felt like spending $7 for what I assumed would be a small order but just like with the sausage, they give you plenty for your money! Wonderful, fresh and healthy food and absolutely worth the price. The woman there was charming as could be and even offered to let me taste the sauerkraut for free (I can't comment on that; she had me taste it because I told her I didn't like sauerkraut and turns out I still don't!). Overall, it was a wonderful experience and I would recommend this place to anyone. Thinking I may try the meat pierogies tomorrow!"}
{"text":"The Artisan at Polish Goodies is not only a sausagesmith but Polish Goodies is a also true craftsman. The smoked kielbasa we got lasted for a couple of weeks. We used it to replace typical breakfast proteins like bacon and ham and we also tested a camp cooking recipe. This item had a long shelf life and multiple recipe uses. They put quality first in everything they make and you can taste the difference. I don't think Batman would win in a battle against this all around champ.. We are going to get another one soon so please don't buy them all, The Pierogis are very flavorful as well. They have a wide variety of items and I'm going to trying more soon"}
{"text":"Polish Goodies is something sort of strange.  When I came here, I had no problem believing that a large part of their business involved \"exporting\" their food to other venues ... the \"restaurant\" looks like a necessary afterthought.  And I put \"restaurant\" in quotes for good reason:  this literal hole in the wall, located around the corner in a non-descript, derelict shopping center looks like it used to be a former Chinese laundry:  the place is as large as my living room and has one of those tall front counters you used to drop your dry cleaning off at long ago.  The fact they don't take credit cards doesn't exactly help to cheer you up either.    But then you run into the owner.  Frankly, a very cheerful and helpful person.  The day we were there, she was running it all herself and I frankly felt sorry for her (though there are literally only a few tables in the place, so she probably can manage it on her own).  It also helps (her), that the selection is pretty limited.  But what they DO have is decently priced and lip-smackingly delicious.  What a difference from, say, pretentious \"A Touch of Europe\" cafe in Glendale, which fools naive Americans into believing that they should pay lots of money for mediocred-sized portions of food, that people in Poland eat everyday and is only special in Arizona, because most Poles who come here don't open restaurants  (try getting away with those prices and attitude in Chicago or New York, where there's real competition!).  Polish Goodies, I wish you had a bigger place, with a larger selection and maybe not serve my meal on paper plates --- a larger selection of beverages would be nice, too.  But for what you are and what you offer -- and for what you charge -- it's pretty hard to complain (even though I ALWAYS find something to complain about).    KUDOS"}
{"text":"This place is open! Don't believe the 10/6/16 review. This place is great, and the food is excellent. If you're from the midwest, like me, then you will really appreciate the menu and what they serve here."}
{"text":"Today I ordered Chopped Cabbage w/sausage and a half pound of sauerkraut, both to go. What I got was a full pound of kraut, which I realized and accepted at checkout, plus an order of cabbage rolls which I only discovered at home.  2 items ordered, zero delivered correctly.   And since the cabbage rolls are my least favorite thing here, I won't be camping in happiness this time, although I'll be back.  Maybe I mumbled my order, or maybe I was upsold and switched out on purpose, I don't know."}
{"text":"Not bad.  The proprietress is very friendly.   Others have already noted the strange location in the Goodwill/Walgreens/RadioShack center.  She mentioned that it's basically her industrial kitchen with a small eat-in and takeout area.  She also explained how you need to call her ahead of time in the morning if you want one of the daily specials like the potato pancakes.  She doesn't have cups for water, so you have to buy a bottle.  As for the pierogi, they could've been warned up more to seem hot and fresh, even though they were frozen earlier, as they were kind of lukewarm.  The inside is more liquidy than what am used to, as if the potatoes were liquified in a food processor as opposed to being mashed.  The dough is also less chewy than I prefer.  I think if she crisped them up in a skillet with the bacon and onion butter they would be better as they'd have more texture.  My grandma's (and great aunt's, and great grandma's) are much better, but these were nice to try as an alternative to the frozen ones at Costco.  It's $7.25 for seven if you want to take a bag of frozen ones home."}
{"text":"Authentic Paczki is really difficult to find in Phoenix.  I'm not Polish, but grew up in the Detroit area where the Fat Tuesday ritual was a trip to Hamtramck for Paczki.  After nearly exhaustive internet searches, I stumbled upon Polish Goodies and can say without hesitation that Polish Goodies makes the best Paczki in The Valley.  I bought plum (yes, prune), and raspberry filled.  They had the rose hip jam filled, as well, and orange.  Don't expect a sugary donut.  Paczki is made from a yeast dough, not too sweet, not at all cake-like.  (More delicious than a donut so don't call them donuts.)  Highly recommend, especially fellow Midwesterners who grew up with a Polish community nearby and need the real deal, not boxed from Safeway or Bosa Donuts.  Even Liberty Market makes them, but they don't use traditional fillings.  Try Polish Goodies -- real Polish people making great Polish delights.  The neighborhood is a little on the sketchy side, but I live in Scottsdale and that can be said of just about anywhere outside of Scottsdale.  So, humor me."}
{"text":"This is a tiny little place that you'd never think to go in to. She was selling her wares at farmers markets and recently opened this location. We ordered pierogies to have for Christmas Day and decided to have lunch there when we went to go pick them up. We had the pork spare ribs with potato, peas and carrots. Yum! It was just like if we had gone to my mother in law's house to eat. There was nothing restauranty about it, just homey comfort food and plenty of it. I'm looking forward to eating the pierogies we brought home, I just hope I can make it until Christmas! If you can't make it to the restaurant you can go to the website and there is a list of farmers markets and times where you can find her food as well."}
{"text":"The Polish sausage sandwich with sauerkraut and brown mustard was delicious! I was hoping to try the potato and cheese pirogies, but unfortunately they were out. I will be going back to get them another time."}
{"text":"Authentic Polish food at this small, family run place. I had the potato & cheese perogis and the stuffed cabbage. Both were hearty and delicious. I'm from Detroit, and haven't been able to find this type of food here in town...problem solved!  This place is the real deal."}
{"text":"There is convenient parking right outside along the building which was nice. Although the place doesn't look like much on the outside or inside, it's the friendly service and delicious food that counts.   Half of the menu (left side) can be ordered when you get there, but the other half (right side = weekly specials) must be ordered with a call ahead of time. I wanted a weekly special since I made the long drive down, but that's okay, now I know. I ordered the potato and cheese pierogies which were freshly made and extremely delicious. They are dumplings stuffed with a potato and cheese mixture topped with sautéed onions and bacon with a side of sour cream.   The place itself is extremely small. There are maybe 4 tables. It's less of a dine in and more of a take-out kind of place. I don't advise large groups to come in. There is no seating outside and even water is $1 because they don't provide tap water, only bottled water.   The owners are a Polish couple who are extremely sweet and kind. They are very friendly and respectful and treat their customers very well. With that being said, the service was excellent.   I really hope they eventually expand into the next store which seems to be vacant and create a restaurant. With some advertisement they would be packed from the food and service alone."}
{"text":"One of the best kept secrets in Sunnyslope! If you're looking for a place with lots of seating,  this place isn't it...but the pierogies are delicious. The cabbage rolls and sauerkraut were excellent as well.   This little operation has limited hours due to it being run by one person,  but not hard to do with seating for only eight. The hours are kind of bad if you don't get off of work before five pm,  but you'll be glad you left work early.   We'll be back soon...and we plan on bringing six more with us."}
{"text":"I left remembering all the wonderful Polish meals my grandma cooked for us.  I had the beef roulade Wednesday special and ordered some cheese and potato pirogies to try.  The beef roulade was tender and delicious, the red cabbage was just like I remembered and the gravy and mush potatoes were excellent.  The pirogies, yeah, who doesn't love pirogies? It's not a fancy place but spotless and clean.  It's also a little hard to find because it is to the east of the barbershop.  IT IS NOT CLOSED as some other Yelp user erroneously posted.  I'm definitely bringing my girls here to let them experience the food my grandma would have made for them."}
{"text":"I have been going to the Polish Festival every year since they held it ar their old church in Sunnyslope. OMG! I dont k ow whether it's because it reminds me og my gma's cooking or what but that food is mighty delicious. In the same respect, to get excellent polish sausage and real sauerkraut head to (Sunnyslope OR) the downtown Phx or Roadrunner's farmers markets for a taste of 'home.' They have stuffed cabbage, pirogues, and many other polish baked goods/sweets.  Finally, like (the homeland) their establishment is owned/operated by a husband/wife team.  Try their wares."}
{"text":"The place is a little hole in the wall with a small menu which I was excited to try out.  I tried to order the specials but was told they didn't have any (....okaaaay). So I selected a smoked sausage with sauerkraut. The nice owner took my order and went to the back where I heard him open/close the microwave and beep in the time. I don't mind microwaved food at home but really am not crazy about paying someone to microwave a sausage for my lunch. While he rang me up, I noticed a thick layer of dust and debris on his counter and calculator, which I hoped was not indicative of how his kitchen was kept.   I really wanted to like the meal because the owner was so nice but it was very bland. I almost never add salt to my food but I found myself adding quite a bit to jazz it up. Will not be coming back :("}
{"text":"I paid a visit to Polish Goodies today to experience this genre of cuisine for the first time of my life!  My meal included both Stuffed Cabbage and Pierogies...both of which were really good.  The couple running the place were quite pleasant.  Don't be put off by the odd location on the side of a strip mall, the small interior, or the call-ahead requirement for the Saturday special...because this place is special and the community should go out of it's way to support this place.  Give Polish Goodies a chance...you won't regret it!"}
{"text":"What s secret treasure this place is. I had the polish and sauerkraut with a cheese crepe. Everything was great. The owner is adorable. The polish was HUGE and full of flavor. The crepes are warm and creamy. They melt in your mouth with goodness. I am so coming back to try one of the weekly specials. Their menu is simple but great"}
{"text":"Richard and Danuta serve up authentic Polish food at reasonable prices. It's small and quaint, but one polish sausage will fill you up. If you're in the area, it's definitely worth a visit."}
{"text":"Authentic comes to mind the moment you take a taste! Tasty smoked polish sausage, sauerkraut like I grew up eating at our family gatherings back in the Chicago area.  They also have a number of other polish sausages; I brought home some garlic sausage that I cannot wait to dig in to! Kolaczki cookies for the sweet tooth... I'm asking myself how I did not try this place earlier?! Will not hesitate to recommend and cannot wait to return for more."}
{"text":"I stopped in for the first time today to try the Polish Sausage and Saurkraut meal.  It was delicious, the best I've tasted since leaving Northwestern corner of Indiana in 1961, bar none.  The owners are true Poles, friendly and concerned I enjoyed my meal, which I truly did.  The hostess explained the menu to me and how to order the daily specials, something I shall do soon.  The owners made me feel right at home.  This is a must try, and a must return, frequently."}
{"text":"So glad we finally made it to Polish Goodies while they're open... Ordered several dishes so my daughters and I could try a lot but of everything. The sausages with sauerkraut is fantastic! The pierogis, especially the potato, we're all delicious... But the crepes definitely took top honors! The girls like the plum butter crepes, but I prefer the cheese. Can't wait to go back and try the goulash."}
{"text":"My friends suggested we come here, and I'm glad they did. The pirogies are delicious and the crepes were a great addition.   It reminded me of growing up and smelling my childhood kitchen."}
{"text":"Ate here today after wanting to try it for quite awhile. Got cabbage rolls. Very tasty- an order comes with 2 huge rolls. Hubby got the polish sausage and kraut. He loved it and then of course had to try the pierogi. Mushroom and kraut topped with bacon and onion. How could you go wrong? We'll be back. Nice owner too!"}
{"text":"Home cooked polish cuisine. The food is delicious and the owners are wonderful. The aesthetics have room for improvement and are very minimal. But what is lacking in amenities is more than made up for in the flavor of the food and warm personality of the owners. Small mom and pop operation."}
{"text":"This is a small, family owned place. If there's something in particular that you definitely want to try, or if you want one of the weekly specials, make sure to call ahead. It takes several days to prepare some of the menu items, so they need advance notice for some things. That being said, the food was yummy & homemade, the service was friendly and prices were reasonable. The owner sells many of the items frozen for you to take home & cook yourself later. We'd definitely go back."}
{"text":"Great little family run authentic Polish restaurant. I had the Polish sausage and sauerkraut.  Both were delicious! Can't wait to come back to try the pierogis. Support this local gem."}
{"text":"Being Polish in Phoenix is a lot like being the Maytag repairman. It gets lonely for us Poles. And unlike \"back East\" we can't just zip over to some local Polish restaurant that's been in business for 100 years. But all is not lost for us, there are actually more than just a few places that specialize in Polish foods around Phoenix, but none of them is a one-stop place to get it all, meats, pastries, canned goods and prepared dinners. And remember we do have an impressive Polish Festival once a year at Our Lady of Czestochowa Parish.  Polish Goodies couldn't be a better name for this place ... they may not have a lot but what they do have are the best of the goodies I know and love from my childhood.  They are owned and operated by a friendly honest Polish couple named Richard and Danuta. Both have old country values and a slight rustiness with English. They either make what they sell from scratch or bring some things in from Chicago (other Polish deli's in town have told me they do the same thing).  I discovered them accidentally when I was writing another Yelp review and their name popped up as a suggestion. I had missed making my Babu's Easter Borscht this year because I couldn't get out to buy the fresh sausage, so I put it off for a week. But I was determined to make it this year. I was happy Polish Goodies had fresh (but frozen) sausage in stock and I also bought some sauerkraut/mushroom pierogis to serve with it. Both were so authentic and good I rate them closely behind my Babu's and my Mateczka's.  THAT'S an extremely high compliment! So far the best tasting Polish food I've found in Phoenix is at Polish Goodies.  That's it ... my 5-star review.  If you're looking to complain how small their store is, don't read my review, don't go there, and don't complain about how small their store is later.  Ditto for how the two owners sometimes get busy, or forget something, or don't speak English with Oxford accents. If you don't like that they're in a Sunnyslope stripmall instead of downtown Scottsdale, don't go and then leave a 1-star review whining about it. If you think they charge too much for real Polish homemade foods with fresh ingredients, save us all your tears and go eat at McDonalds instead. I'm not going to talk about ANY of that stuff in my review!"}
{"text":"My last name ends in \"ski\"... and I have had a hard time finding pierogies like I used to get in the ethnic neighborhoods of Ohio. But this place comes damn close. I bought 3 dozen to take back to family members. We had potato and cheese, and the mushroom and sauerkraut. Omg. Both were amazing. Small hole in the wall. . But that is fine by me. One yelper said they don't take credit cards, but the absolutely do now. . On their ipad. I loved it, and my very unpolish friend who lives here loved it. Richard couldn't have been nicer, asking if we wanted the butter on it, or with his bacon and onion topping, or with sour cream on the side.  (Yes, yes, and yes) if you are nearby. .. stop and try them out!"}
