{"text":"First time eating here with my boyfriend. We decided to take out. Ordered lasagna,  penne pasta with meat sauce and sausages and calamari to share. Food was Ok not the best Italian food we ve eaten. But not worth the $44 dollars we spent. Wuld we go back. Nope."}
{"text":"Tried their Veal Panini for lunch and it was a very good portion. I tried it with Extra meat and it might of actually been too much I was full for the rest of the day. It was good, I will go back and try other stuff for sure."}
{"text":"I visited this place today and the food was not good at all, maybe it was cause I went an hour before closing, I'm not sure. The pizza was old and stale, like it was made a while ago. The panzerotti was terrible, I asked for sauce, pepperoni and cheese but they forgot the sauce and it was absolutely disgusting. Threw it all out. Will never go back. Wish I could give zero stars!"}
{"text":"Loved their eggplant parm pasta dish. Was freshly baked, well seasoned and had a big portion for the price. I always come back here when craving some good pizza too; they have a great selection."}
{"text":"Delicious, authentic Italian food. I have been there now a few times and am a big fan. They make their own sauce from scratch. The pizza dough is also home made.  It is done as a simple kitchen style.  Great place for pizza and a beer. The pasta is also quite excellent.  Owned by the same folks as the one in Brampton"}
{"text":"Wow I wasn't sure what to expect when we went here for my nieces birthday today. I was happy with the look of the place. The menu looked good. I was very pleased with the food I had. I ordered the Mediterranean salad and chicken parmigiana. It was delicious. My husband ordered the chicken wings. They were THE BEST wings we've had. So crispy. So saucy. Yum! My son ordered the pizza slice that was huge! It was soft and cheesy. So good. My other son had a plain spaghetti with butter sauce as some kids enjoy. Everyone in our party of 11 raved about the food they were eating. The staff were very friendly and we noticed quite a few people came to the restaurant. We would for sure be back!"}
{"text":"Was in a hurry so this was a brief takeout experience.  Got a lasagna takeout. Wow. The sauce is amazing. They included a few slices of garlic bread, pizza thin bread and that really soaked up the sauce when I was done with the meaty stuff. The sauce was unbelievable.   Overall place is extremely clean. Everything looks in place and the kitchen is amazingly clean.   Wait time is a bit long so don't expect an express service. I will be back,"}
{"text":"I called in and Placed an order for delivery at 824 pm ... I was told 30 to 45 minutes~ the credit card was run at 829 pm. The Order finally showed up cold at 941 pm. It is only a 15 minute drive from the location. I asked for the pizza to be well done... the deep dish pizza was raw and doughy . And did not resemble a deep dish pizza. the cheese sticks were still cold in the middle. If that wasn't bad enough part of the order was missing . I called to talk to the manager and was only offered 20% off a future order after he argued about what time I placed the order.  If you like cold and undercooked pizza this is the perfect place to call."}
{"text":"The chicken parm was soo good & the eggplant parm was also delicious! Definitely recommend this place."}
{"text":"Worst Gnocchi of my life. I could taste that it was canned.  The sauce was runny. I'm very disappointed."}
{"text":"Have only tried their pizza and salad so take this review with a grain of salt...  Pizza - I mean...it's alright, I've had a lot better but I like their variety.  DO NOT go near the caesar salad (ok,ok...I know you don't go to this place for the salad) but AT LEAST put some effort into it, or perhaps more lettuce? The container fit in one hand, was half full with about 10 pieces of lettuce, 4 croutons, and renee's dressing. My co-workers were astonished when I came back with this $5.65 salad that could feed a starving ant who would continue to starve upon completion of the salad.   Service is meh - but I get it, they're busy during weekday lunches.  Overall, I'd go back only to try the paninis or pasta...but never ever doing a salad or slice again."}
{"text":"We were here a couple of months ago, less than an hour ago before close on a weekday and were turned away as there was no wait staff and were open only for takeout. We went elsewhere. Decided to give it one more try. On a Saturday night just before 9'all the tables were full. Acknowledged a few minutes later, and a table was available in under 10 minutes. A muted TV played the Jays game.   The restaurant is. It fancy, but clean. The two servers were probably not enough and were serving all the tables. A manager type person also came by and was helping around. The lady server was amazing, the male server. Or so much.   Ordered a Fettuccine with rosè sauce, an Eggplant Parmigiana and an Uno Panzarotti. Wanted to order a pizza instead as it looked good on other tables.   Was served Focaccia bread with oil and balsamic vinegar. The bread freshly baked from pizza crust perhaps and has a few freckles of cheese. The oil didn't taste olive or wasn't EV. The balsamic vinegar made up.   The Fettuccine was cooked perfectly ( a notch above al-dente) and sauce seemed too runny to start with. It thickened after a few bites perhaps from the starch from pasta. Slightly under seasoned and needed an extra addition.   The Panzarotti deep to perfection. The crust crisp and just enough quality mozzarella cheese inside. Again I would add a topping (in siding ?) for next time. There is no tomato sauce inside the Panzarotti. Served on a bed of tomato sauce and served with tomato sauce as well. The sauce too runny and less flavoured. But a few dashes of chilli pepper flakes fixed it.   The star was Eggplant Parmigiana. The best I have had in a long time. Fried perfectly with layers of cheese and tomato sauce. I wish they gave something on the side with the EP to cut down on the fat ( a piece of bread?)  The cost for food is quite reasonable for an Italian restaurant, but again it is not a fancy restaurant. You can take your family, but perhaps not your date."}
{"text":"Everyone's positive reviews pretty much align with what I like about Pomadoro. What is left for me to say? They are consistent. They do dishes better than the same Italian dish offered at higher priced Canadian cuisine restaurants.  I recommend their wide assortment of ready to serve pizza slices, and the parm sandwiches. My lasagna was not as tasty as pizzas. I still have to try the pasta.  Thanks for being one of the best options near my work."}
{"text":"We your email sent out a Last time you had a chance you can come over s is the way kJ bnouv"}
{"text":"Pizza is sometimes the most satisfying dish for me and this place serves fresh hot ones with high quality ingredients. It has been pretty hard to find a really good pizza these days. I don't mind driving from anywhere to this place since I know that the taste will be guaranteed without too much of anything."}
{"text":"I like the Matheson location much better than Brampton.  It's bigger, and, there is more room to breath.  Better parking situation too (both are in strip malls).  They're very friendly here.  If you haven't tried their pizza - go!  It's delicious.  The calzones look awesome too.  Like the size of a football!  Legit."}
{"text":"The best go to place when no one can decide what to eat, plus they have a very friendly staff. I can start listing all the things I've ordered at this location but I will only name the best of the best; which are their pizzas. I had their cheese Margherita pizza which was divine however I was expecting the one with the basil leafs and bocconcini. I asked the waiter why it didn't have it and he said I had to mention I want the one with the basil, he did offer to make it into the one I wanted though."}
{"text":"Walked in and no one was there, waited a little bit and was about to walk out when a man finally appeared and said he would be right with me. The man was nice, I noticed he had part of a cotton ball sticking out of his ear.   I went with a split order of wings, 5 garlic parm and 5 honey mustard for $7.99. They were of about average size. Slightly dry, but tasted okay. Nothing really special or bad about them.   This place took over the East of Chicago spot, they just opened so best of luck to them, but with all of the pizza/wing options out there, I probably won't be back."}
{"text":"Good Italian restaurant in Mississauga. Had a nice menu options and was there early evening so there were not many people dining while there. The food was tasty and the service was very good. Would dine there again."}
{"text":"I've been to Pomdoro twice and had their special dish Risotto when it was on the special's menu and I was pleasantly satisfied (hence my return).  They start off with the table bread which they give oil to dip the bread in. If you're lucky enough to get the fresh bread, this tastes delicious with the oil dip given that it is warm and soft to eat from. Perhaps I was hungry during those times but I usually order seconds for these bread!  Then comes the main dish - the Risotto I added with chicken and italian sauage and it was really good. I tried another place that served risotto and this one was on point for sure. The other risotto's i've had in past restaurants had always been too soggy on the rice to the point where it seems like it's just soupy rice.  Would return again obviously, and be wiling to try more things."}
{"text":"This review is based on takeout only.  I've never actually been inside this establishment, although I see it each time I'm at Watan Kabob!  ;)  Our office placed a takeout lunch order here.  The good:  Ordering was easy to do via their website, it was prepared when they said it would be ready, and it arrived piping hot!  I ordered the gnocchi with homemade meat sauce.  Gnocchi was of the frozen variety, sorta looked like Amazonian sized jungle grubs.  So obviously they were rather tasteless and expected texture for a frozen product.  However, meat sauce was obviously freshly prepared!  So that was good.  A coupla coworkers had the lasagna and the adjectives that were used included \"watery\", \"oily\", and \"very salty\".  I rarely order lasagna, unless I *know* they actually prepare it on-site!  Another bonus was that the portions were HUGE.  My pasta easily consisted of 3-4 meals and it came with 2 slices of flat bread!  Lasagna, however, was all devoured in one meal.  I wouldn't be opposed to going back/ordering again, but I'd try something that is more likely made on-site, maybe the pizza, paninis, or panzorattis?  Best not be a pizza pocket either!"}
{"text":"I'm a big connoisseur of non brand pizza. I was searching for such a place near Square one and ended up here. I ordered their large cheese and sauce, half with ground beef, the other half mushroom and Egg plants. I'd recommend extra cheese with eggplant and mushroom, skip the meat. I found mushrooms and eggplants hydrate the pizza well, while the meat half was a bit dry! I also ordered a side of the wings which were just Ok. Might as well stick to their pizza. Oh they take 15 minutes to serve pizza but is worth the wait. The ambience is nice, with wooden table and chairs plus soft lighting. They serve ceramic plays and steel utensils. They also have a patio. Ok for a date too! Large pizza came in 10 slices for $12, plus topping was just under $2 each. Taxes extra.  All good enough for 3 adults. Parking is huge. I'm gong back soon!"}
{"text":"As a visitor to town, I ordered a pizza for pick up.  The pizza was ready fast and was delicious. However it was perhaps a touch on the salty side and the veggie toppings (onion and spinach) were skimpier than I expected (pepperoni was fine). Ordering online I was able to have them add rosemary, basil, and oregano to the pizza and that may be part of why my pizza was so good."}
{"text":"This place feels more like a cafeteria, our dining experience wasn't comfortable and the staff hardly talked.   We ordered the Chicken Parm to share with meat sauce. It was a $15 dish and didn't taste the greatest. The breading on the chicken was soggy with rubbery mozzarella cheese on it. The meat sauced pasta was cooked well but they had it sitting in a pool of water on one of our plates. Further, they charged an extra $2 which I can only assume was because we asked to share the dish.   The decor of this place is old and falling apart with cleaning supplies and other items just out in plain view, very unprofessional."}
{"text":"Lasagna was good and fresh. Seating is a little challenging but pizza choices are plentiful. Mediterranean salad is great."}
