{"text":"Excellent service, good cocktails. And beer selection. Would happily return! BAr decor and space is great!!"}
{"text":"I've only been to Pompette once (for a quick dinner before their monthly comedy show) and I can't wait to go back. The decor is beautiful, classy and kind of upscale without being so fancy that you'd feel out of place. The staff and owners were friendly and efficient. The entire menu looks so delicious that it was hard to settle on just one thing (I had the chicken breast, cooked to perfection and served in a really delicious gravy with some vegetables on the side.) Portion sizes look just right - not huge, but not too small for the price. Plus, they have a side room and a full schedule of entertainment while you eat - movie screenings, live comedy, variety shows, and themed brunches. I loved it."}
{"text":"Friendly attentive service, yummy drinks. We enjoyed the sliders, poutine and mini banana split.  Prices are definitely reasonable."}
{"text":"Was visiting from Boston and came into Pompette for lunch. Amazing pulled pork sliders and great beer selection.  I also noticed they have an impressive cocktail menu. 

The owner was working at the bar and was very friendly."}
{"text":"Fantastic food and amazing drinks! 
We had each of the sliders that are on the menu. We also had the fries, poutine, and garden salad. All of the food was really great. The service was quick and timely. 
The drinks and drink experience were second to none. Mike, the bartender/mixologist, took the time to understand our preferences and made drinks accordingly. Two of us gave him the opportunity to make 4 rounds and drinks and he hit the nail on the head with each try! 
What a phenomenal experience. I really suggest that everyone tries it out! It will quickly become your favourite."}
{"text":"We came here for dinner. The food wasn't bad, but pretty simple and not really unique. We had the eggplant stew, cod and a shrimp appetizer. My man got a simple shot of whiskey and I got a bourbon-based cocktail, which wasn't great. I've had better drinks in the neighborhood (Big in Japan, for example). 

The service though was really good. Our waiter was super nice and despite waiting for the entire restaurant, frequently stopped by the check on us. He was the best part :)

Won't be back."}
{"text":"Been twice and bartenders already know my drink of choice, very Impressive. I really enjoyed the Mac and cheese and romain lettuce on the grill. Its a must try when you're there!"}
{"text":"Fresh and delicious! We ordered a variety of the inexpensive small plates--Outstanding crab cakes, fabulous beet and goat cheese sliders, a perfectly dressed house salad and poutine. Just so yummy!  We ended with the mini banana split and a few Frangelica  and bourbon cocktails. Great service. Couldn't be happier!"}
{"text":"This restaurant has such a good vibe, the food is comfort done right with just the right touches of originality and decadence. I loved the retro cocktails we tried with homemade cordials, such flair! We felt welcome and warm and we will be back, in the bustle on St. Laurent, Montreal, this is a hidden gem."}
{"text":"Très déçu !  Après avoir lu les critiques positives sur yelp, nous avons essayé ce restaurant pour un brunch. Les plats sont insipides, la présentation grossière, c'est donc beaucoup trop cher pour ce que c'est !  C'est la première fois que j'écris une revue car je trouvais ca presque insultant, bref......"}
{"text":"This place is wonderful and I truly recommend it. The cocktails are creative and the bartenders are super excited to recommend their favorites. They will make sure they are perfect. 
We were unlucky the day we went as they ran out of a few items on the menu and a few drinks as well, but it was late. We ended up having the goat cheese sandwiches, sliders, and fries. All really fresh and tasty. 
The staff is super nice and knowledgeable about the menu and will definitely make good recommendations based on your tastes. 
The A/C is super high, so bring a light sweater!"}
