{"text":"I was disappointed with this place. It's a nice, open space with lots of natural sunlight, but the food was just ok and the portions were pitiful. I ordered the chicken pesto panini, and it tasted ok but had to be the world's smallest chicken breast. (This poor chicken probably never got hit on by any of the popular roosters.) The fresh fruit side was pretty flavorless. I understand the fruit is out of season, but I've had fruit recently at many other restaurants in metro Phoenix that was much more flavorful. The servers are friendly but very young and obviously have very little experience.  I will be back only if I'm in Sun Lakes again and Burger King is closed."}
{"text":"Came this morning for breakfast with my aunt and uncle. Server was very forgetful....then my waffle was stone cold, like it came from the fridge. I sent it back and ordered 2 eggs over easy and bacon. They arrived over hard. Had to then ask for toast. They forgot my uncle's sausage. Had to ask for our drinks. Bad experience. Don't know if it was one cook or a new cook."}
{"text":"Was it the corroded toilet seat or the joke they pulled when they put \"quiche\" on the menu that p****d me off more? The \"quiche\" with fruit cup was $8.  Quiche was really a completely dairyless concoction maybe 3/4\" thick with an extremely thin, yet somehow soggy crust, with a layer of scrambled eggs so hard not even my husband could stab it.  A small sliver of the world's thinnest piece of ham curled on the top, I suppose to identify it as Quiche Lorraine...without a trace of onion, cheese, or cream in site.  Tried to content myself with the \"fruit cup\"...previously frozen melon, unripe to begin with, a single chunk of canned pineapple, and long-dead red grapes...again, not even my husband could eat it.  Tried to order a demi-shot Bloody Mary with a bottle of Tabasco on the side at beginning of our meal, only to get a drink already sauced...so hot I couldn't drink it.  Attempts to flag down the many servers running around were futile, so I ended up going to the bar to get it remade.  Oh, and THEN the server, who thought she at a greasy spoon, bawled me out for not finishing my food.  That was when I levitated out of my chair and beat her to a bloody pulp...not that she didn't deserve it, but actually went to the bathroom where I discovered the nasty toilet.  Really folks, thought I was in a gas station bathroom in a bad part of town!!!!!  Just say no.  Enough other places to eat in the area you don't have to endure this!"}
{"text":"We've only been here for breakfast and brunch, and it's what you would expect. It wasn't bad, but nothing outstanding either. The pools are nice, and so is the scenery."}
{"text":"Nice open and comfortable cafe by the pools of Oakwood IronOaks Active Adult community. The food is fine. Its not your fabulous diner but for a quick bite to eat with friendly staff not bad at all. Very reasonable prices. Limited menu. Breakfast and lunch is served. Well worth a try..."}
