{"text":"I stopped here on a Monday night with some friends. The place was hopping by the time we left. The server was friendly and patient. We got some apps to share as we were not very hungry and everything was great except for the gorditas. Chicken wings were delicious and had a different take on the flavour, big fan of the dipping sauce that came with it. I also like the nacho cheese sauce that came with the nachos. I'd say those were the two outstanding dishes of the apps we tried. I'd like to come back here and try the other food. Atmosphere nice and clean."}
{"text":"Come on, really?  People don't love this place? 

Friendliest staff ever, really tasty (REALLY TASTY!) menu, \"lumbersexual\" barkeeps muddling this and that for you while fantastic and eclectic music is being played and tables filled with happy people that are having happy times, I find it hard not to love this place!

Oh...the taps are as you'd expect too, awesome and varied.  Mostly locals, but a few others too."}
{"text":"We. Loved. Poor Romeo!!! We are also fans of Pinkerton's across the street....it's brother restaurant. Where Pinkerton's is awesome as a bar and has incredible food in the form of Asian tapas, basically, Poor Romeo is more \"American\" in food offerings, with sharing plates but also individual meals, and even BIG sharing meals for 3+, like the whole Branzino. The atmosphere is informal, and comfortable, with great music. Service was GREAT, with Grace making our night super fun. We shared the fried green tomatoes, which were great. I then had the burger, which was different than the trend of huge slab of meat on a bun. It is two thin patties, with lots of sauce and lettuce and stuff, between a lovely homemade bun. Loved it, and at $12 with fries, I was full. My husband had one of the other sandwiches, and it was awesome, too. Pork, I think. Drinks are expertly prepared, and there are some nice wine and lots of beer options, too. LOVE this place :)"}
{"text":"As a proud local to the Gerrard & Jones scene, I couldn't have been happier when I heard about Poor Romeo...This review is way overdue as I've now had the pleasure of returning several times.  The short version of my review is: Homerun, just go there...OK, so I had been waiting from across the street at my local fav Pinkerton Snack Bar for what felt like ages as Poor Romeo was being put together over the summer sneaking peaks through the paper that blocked the windows. Fast forward to late September and there I am with good friends celebrating my birthday at their sexy chefs table which is at the back of the joint in a nice pocket in front of the kitchen with lighting right out of Tony Scott film, dig it. First impressions: what a cool spot ; I loved the long bar with the LPs on the shelves towards the back. It feels like the kind of spot that you'd find in NY if you know where to go. The staff seem genuinely happy to be there and set the tone for a great evening. As for the food,  what a surprise....we were presented with a celebration BDay menu that started with a gorgeous platter of oysters and poached shrimp with accompanying homemade sauces , delicious and fresh. Then we had a whole bunch of  snacks / apps that included tasty fried green tomatoes,  warm homemade queso cheese dip with crunchy corn chips, brined and smoked chicken wings - these little guys where a real stand out as I've had many a wing in my day but never like this - so tasty. Then came  mackerel fish fingers with a green goddess type sauce for dipping  - so much flavor. Then 'the mains\": one platter with a sous vide bavette steak sliced up with chimichurri, roasted potatoes and another platter with a whole grilled branzino with, chilis, , greens and more potatoes and sides of rice and peas and wedge salad and I think that was it. As full as we were it was a birthday celebration so we agreed when we offered the made in house key lime pie, awesomely bright and tasty.  All of us were equally blown away by the meal... I've been back and want to mention that their smash burger is highly addictive but I can never leave without having more of those wings, so good; So Poor Romeo is a self described \"rock n roll bar\" but the food that kitchen is putting out punches way higher than that moniker implies. And while it's hard to not compare it to their neighbour across the street (the always amazing Pinkerton Snack Back) since both spots are in the same extended family. Walking in the first time, I was expecting Pinkertons 2 but Poor Romeo really isn't that, it has its own distinct personality that just works...its a destination worthy of folk who are looking for uniquely tasty comfort food, great drinks and killer vibe, very proud to that we have another winner in the hood #GERRONES"}
{"text":"Great restaurant, cool vibe and good food, loves the burger,  however the door man slash host needs a course in customer service etiquette. If management does get working on this dudes attitude I don't forsee much of history for this place. People in our neighborhood are very big on good food and good service. I've lived in this hood for 15 years and I've seen restaurants come and go. I really hope this one can make it work. The same owners own Pinkertons across the street. It's a fantastic bar with very tasty food. Our favorite in the hood."}
{"text":"Checked this place out because as a designer, good branding attracts me. Came here with four other friends and admittedly, it's a cute bar, perfect for hangouts. Beers were good, although, we got the nachos and the cheese dip was okay... we even added the chorizo for an additional $2. Definitely not worth it. Their fries are great though! 

I would come back if I'm ever in the area but I would not go out of the way for it."}
{"text":"EDIT: Thanks to a fellow Yelper who reminded me that Poor Romeo doesn't accept reservations. We were told that it would be a 20-30 minute wait but then the front of house person got mixed up and we ended up having to wait another 1.5 hours which was only acknowledged with a \"sorry\" and a shoulder shrug. I get it - they're new - maybe they'll work out the kinks with front & back of house but until then I'd rather have better service and food elsewhere.

ORIGINAL REVIEW: Poor Romeo...emphasis on the 'poor'. This place is really trying to use a winning format. Obligatory industrial lightbulbs - check. List of artisanal beers - check. Menu choc-a-bloc full of upscale tavern items - check. Unfortunately the front of house was a mess and mismanaged our reservation with only a \"sorry\" and shoulder shrug to comp for the 1.5+ hour wait. The waitress forgot our oysters but it still appeared on our bill. The burger tasted like a sad Big Mac and the gorditas were overly doughy and bland. As we stared longingly across the street at Pinkerton's, which is funnily enough owned by the same people but is actually AWESOME, we discussed how glad we were to get the bill and get out of there."}
{"text":"Food was wonderful, and staff were great. They forgot to charge us for 2 cocktails, and when we brought it to their attention they said \"Sorry, we are new! Let us buy you those drinks!\" Good ownership goes further than a a good meal (although, the burger was great!)"}
{"text":"Menu is small which makes it easy to choose from. This is more of a bar than restaurant. The place is cozy. The food is good. But I do find the portions sizes are on the smaller end. My friend and I had the combo of three apps and it comes with avo toast and two pieces of chicken. It's more worth it if you order three apps separately, you get a bit more food minus the avo toast and chicken but it'll you cost a bit less. As well, there wasn't anything special about the chicken or toast so you're not losing out on anything."}
{"text":"Really fun atmosphere, great playlist, friendly customer service, and fun drinks! I'll definitely be coming back. That said, the food is fine, but not amazing. My friend and I split the appie combo and found the portions to be small and the flavours underwhelming. However, if you're looking for a fun place to hang out and get drinks, this should be a go-to."}
