{"text":"Finding zabiha halal Popeyes in Calgary is a big surprise.
I like the Cajun sandwich the most but fried chicken pieces, tenders and popcorn shrimps are also yummy.
Their pies are a treat. The staff is very friendly and the ambience is neat and clean."}
{"text":"The chicken is nice; crispy and moist. I preferred the spicy over the original. The Cajun fries are nicely seasoned and crispy although a tad greasy. I actually enjoyed the gravy and I'm usually not a fan of fast food gravies. The biscuits were disappointing though. I did not enjoy the fake buttery taste of them so I would pass on those."}
{"text":"My boyfriend took me here today for a late lunch - around 4 PM. It was packed but the 15-20 minute wait in line was doable. It has a nice enough fast food restaurant ambience. I was not sure what to expect in regards to the food. Greasy chicken is not my thing. It was delicious!!! We had the fried chicken with biscuits, mashed potatoes and cajun gravy. It was all super yummy! The chicken was very juicy and flavourful and  the coating was tasty too! I was surprised I liked the cajun gravy and potatoes so much - yummy! The biscuits were light and cake-like. Once we started eating we did not talk or comment because we were right into it. I now owe myself a few workouts before I consider another trip to Popeyes. Again, YUM!

PS, I mispelled Louisiana in the title. I hope yelp fixes that. I can not figure out how."}
{"text":"Service varies from super fast to kinda slow. I've stood in a line and gotten my order less than 5 minutes after ordering and ordered when there was NO line and a handful of people and got my order 20 minutes later. The chicken is fantastic. The sandwiches..not so much. Go for the spicy fried chicken, you won't regret it. Plus it's halal!"}
{"text":"Popeyes is BANGIN'. Chicken be crispy like you never even seen... well, unless you come to this Popeyes. 

The biscuits are always warm, moist and buttery. The first time I tried Popeyes was down in Florida. Young and naive, I asked for one biscuit to share. The lady at the counter just laughed and said, \"I'm gonna go ahead and put in a six-piece order for you, angel. Or else you'll be comin' back real quick.\" Let me tell you, she was an angel and that first biscuit was one of the best things that's ever melted in my mouth. (Answer: there's been A LOT.)

The cajun gravy is bursting with so much flavour that it tastes like it's been cooking all day in someone's mama's (Louisiana, duh) kitchen. There's little bits of meat and a spice blend in the gravy that complements everything on the menu so nicely. Besides their cajun fries, mashed potatoes and coleslaw, Popeyes also offers rice & beans, mac & cheese, and corn as their sides. The corn is a favourite: served on the cob and perfectly cooked and juicy!

For the chicken, you have your option of regular, spicy or half & half. Go to flavour town and get the spicy! Chicken is juicy inside and perfectly crispy outside, EVERY TIME. 

Consistency is the name of their game. Well, fried chicken is probably their game. But they're really consistent with it. Considering how busy they are, the service is surprisingly fast and efficient at Popeyes. The counter staff are really patient and helpful. There's a beehive of people bustling in the kitchen preparing the orders and then before you're given your order, someone else individually checks to ensure everything is correct and that you have sufficient utensils and condiments. What up, quality check! I like that. 

Very limited seating however there are outdoor benches out front. But most people are here for take-out. I too prefer to enjoy my fried chicken from the comforts of home, sparing everyone from the sight of my happy, greasy-fingered, chicken-devouring self. No drive-thru at this location so be prepared to combat the other drivers in the complex.

Five stars because they are all friendly as hell too!"}
{"text":"It has high chairs but no Change Table in the bathroom! So we had to change our baby on top of the garbage bin! My kids don't like the spicy taste in the chicken. They don't fry the pies in a separate oil bin so the apple & strawberry pies will taste spicy too. This place is good for adults and youth; but not a good place to dine for young children and babies."}
{"text":"I had never been to a Popeyes in Canada or anywhere before, and man where the tenders and nuggets amazing! Love the hot sauce too. Sides are meh. But who cares"}
{"text":"I love the chicken from Popeyes, it's definitely one of my favourite fast food places. However at this location in particular they have a great tendency of messing up my order. Not only that, but they're not at all generous with sauce portions. The staff at this location depending on who it is can either be accommodating or petty. I told a girl that she hadn't filled my gravy all the way up, she took it from me and THREW IT OUT. Then she gave me the exact same amount, far less than the portion in a whole new container. As well, I ordered fries with my combo and so did my companion, but I also asked for an extra side of fries. We only got two things of fries. So many screw ups, but I love the chicken."}
{"text":"Helen P said pretty much what I experienced. Pretty sizable lines, but good quality fried chicken. 

Skip KFC and do this for take away if fried chicken is your thing. WOW chicken in Kensington is the best fried chicken I've had, but I thought I'd try here after the attitude the servers always have at WOW. 

Non greasy, spicy was the best option - it's a wet rub under the batter rather than a spiced batter. Nice heat that adds to flavor more than a burn in your mouth. 

Wouldn't recommend the chicken fingers, do WOW for that, but the bucket chicken is about the best for a fast food style. 

Not impressed with the sides. Any BBQ joint in Calgary that does their own thing makes these a disappointment.  Fries were meh, coleslaw was mostly sweet, Mac & Cheese was meh too. 

Maybe I'll try the seafood next time or a sandwich."}
{"text":"I'm not sure what all the hype is about. I will say it tastes better than KFC. The chicken is moist and the batter crispy. That said, the portions and price do not align. You pay $12 for a few chicken strips and you get a tiny little mac n cheese or fries side and a drink. I would much rather have a loaded burger and leave full. 

The locations are not convenient and I regret going out of my way for disappointment."}
{"text":"Great Chicken, very crispy and tasty, moist meat in the middle. I found the original to be tastier that the spicy version but both are good. The coleslaw was very tasty as well unlike many other chicken places. I found the biscuits to be disappointing, and would probably pass next time and stick with just the chicken. Can't wait to try some of the other sides as well.
Would definitely go again!"}
{"text":"If fried chicken is your jam then this is your place.

I'm not big on any fried food and don't care for KFC or Mary Browns or Chicken on the way but this is a pretty decent place. My husband was really interested to see what the hype was about so we ventured in.  

Chicken was very crispy, and not as greasy as the ones mentioned above.  Incredibly fast service, but got asked twice if I'm using debit, I said no twice and showed him my visa.  Insert sidewards glance.  They have a decent assortment sauces to jazz up your chicken but we stuck with Louisiana, felt the chicken was good enough on its own, especially the spicy chicken which was not really all that hot but had a nice little kick that wasn't gonna blow your head off.

Good selection of sides, but they are on the smaller side but will fill the gap.  Although I am trying to cut out bread, and since I was already elbows deep in fried chicken took the plunge and tore into the biscuits, which were delightful pillows of buttery heaven. 

I would come back if I was absolutely craving fried goodness and really want a bad ass cheat day but its just not my jam. 

Solid 3 stars for you Popeye"}
