{"text":"Two words: 
Simply Amazing. 
The food is absolutely fantastic. Purchased a fried chicken, porchetta and a steak to try amongst the family. 
All are exceptional, my personal favourite is the chicken but they're all superb. 
Staff and service was stellar. A bit of a drive to get there but well worth it and one I'd make again without hesitation, tomorrow. 
If you're looking for the best sandwich around, you have to try Porchetta Roll!"}
{"text":"5 stars!?!?  I'll give this place 6 stars if I could!  There is nothing better then fresh home made food with exceptional service and super friendly staff.  These guys should expand to another location so everyone can enjoy fresh daily cooked and prepared food.  The portions are VERY generous.
'Nough said...\"mic drop\"   this is the place!"}
{"text":"Buttermilk Fried Chicken Sandwich - best one I've had! I'd recommend to get it with the garlic sauce. Also, recommend to not wait long to eat it so the bread is still fresh. The wrapping that the sandwiches come in are also handy when you're on the go as it helps keep hold the sauces (and sandwich toppings) from spilling. 

Feel of the restaurant is cozy and the owners are so friendly! 

I have recommended it to a few of my friends and even suggest coming here to eat when we're in the area!"}
{"text":"This place is one of my new favourite ; It's great place to grab a lunch or take out dinner for a family .
I love the atmosphere of the place ; feels very homey and inviting . The Porchetta sandwich is super tasty , loaded on soft and fresh bun is wining combination . Overall I highly recommend this place , can't wait for lunch ...10/10"}
{"text":"I had the porchetta sandwich. Decent sandwich. Clean location. No complaints. Not the best porchetta, not the worst. My sandwich didn't have any cracklings. Not sure if this is the norm but IMO there should be cracklings."}
{"text":"My coworker just brought me back the Spit Roasted Porchetta sandwich, and I've only ate half of it and I needed to come review it because it's SO GOOD. I thought the mix of onions and mustard would be weird, but it works great together in this sandwich. I definitely will come back and try their fried chicken sandwich!"}
{"text":"My boyfriend spotted this new gem one day so we had to try it. The name kinda lures you in especially if you're a foodie. So far, we've tried the cevapi, shrimp po boy & buttermilk fried chicken. ALL AMAZING. We got a poutine with porchetta once which was also good. The owners are lovely and I hope to see them do well in business. Tip: order cevapi in advance so that you don't have to wait the 15 mins!"}
{"text":"Just happened to drive by and noticed something new in my area and thought I'd give it a try. The decor is clean and rustic, more slanted to take out but there are spaces to sit down on stools and eat. The staff were friendly and engaging. We ordered Porchetta sandwich, buttermilk chicken and chevapi sandwich. I had the Porchetta, it was a generous portion with their special toppings, the meat was juicy and nicely flavoured. The other guests of mine were equally happy with their selections, all generous portions and very tasty as well. All of users in agreement we will come again and interested in trying their other sandwiches. I noticed that they did what looks like party platter which would be great for a summer out party meal on the deck"}
{"text":"Amazing quality sandwiches! Generous portion of juicy meat, great flavours. We got the spit fire roasted pork and buttermilk chicken one. Both were wonderful. 

Also lovely service from the smiling lady at the cash. :)"}
{"text":"Wholly deserving of 5 stars. I've been here 3 times in the past 3 days, trying a different sandwich each time, and each sandwich has been outstanding.

Porchetta Roll's interior has a trendy Queen West vibe, while it's outdoor setting is distinctly suburban. There's a fairly large corner counter for those wanting to eat in (I strongly recommend it for the best experience!), but there's room for 8-10 max.

On my first visit, I of course had to try their eponymous spit roasted porchetta roll ($9), which featured roasted pork seasoned with herb and garnished with arugula, sauteed onions, garlic aioli and mustard. It took about 10 minutes to make, and came bagged and wrapped in PleatPak wrapping (similar to Hero Burger's packaging). 

On first bite, I noticed that the sandwich had a good bun/filling ratio (my pet peeve with sandwiches is taking the first bite and tasting nothing but bread). The next thing I noticed was that the porchetta was melt-in-your-mouth good. The pork varied in texture and fattiness throughout the sandwich, but for the most part it was soft and juicy. As for the combination of other ingredients, I think they speak for themselves. Wow.

Of course, since I was in the area all day long, I came back to Porchetta Roll for dinner. This time, I opted for the southern fried buttermilk chicken sandwich ($9), which was topped with romaine lettuce, tomatoes, onions, garlic aioli, and spicy garlic sauce. This time, I ordered it to go and ate it 20 minutes later. While the flavours were still top-notch, I regret taking it to go because the sauce sat with the fried batter for too long, causing it to lose its crisp. I'll have to try this one again next time I have to eat at the restaurant.

Most recently, I had the shrimp poboy ($10). It was topped with a spicy remoulade, romaine lettuce, tomatoes, onions, and mayo. I personally preferred the other two sandwiches, but all three of them were very good.

As of this writing, they have 7 sandwiches available. I've yet to try the steak, chevapi (roll of minced beef and lamb), spicy veal sausage, and pulled pork. With such great variety, I hope to knock those next 4 down as quickly as the first 3!"}
{"text":"YUM! I've had the split roasted porchetta and porchetta salad and it is so good! 

Split roasted porchetta - comes on a delicious crispy on the outside, soft on the inside bun. This is also beautifully packaged! It is the perfect portion size for me and every bite is so flavorful and you do not feel gross after you've eaten this. The meat is so juicy!

Porchetta salad - comes in a big container with large chunks of porchetta. You have the option of garden greek or ceaser salad. I chose garden and the salad was crispy and not overly dressed with dressing (I loved they went light on the dressing). Meat was generous and delicious!

Great service and decor. 

Recommendation: order ahead so you don't have to wait, they can take a bit of time to make."}
{"text":"Pretty amazing sandwhiches !
The buttermilk chicken sandwich is badass !
Great size, great taste ,and great deal .
Price is around $10 and with a pop you know like $11 or so ...
The porcehtta sandwich is amazing aswell obviously ! 
Food quality is fantastic and fresh .
Place is clean and service is friendly.
I definitely recommend you try them out !"}
{"text":"Unbelievable food with generous portions!  This is truly a hidden gem in Mississauga and I would highly recommend it to anyone.  I ordered the split roasted Porchetta sandwich and Parisian potatoes on the side expecting to be hungry after the sandwich.  This was definitely not the case!  The sandwich was filling and the meat was super moist and delicious when combined with the caramelized onions and mustard.  I will definitely be back to try the rest on the menu."}
{"text":"Fantastic sandwich joint. If I'm around I'll comeback for sure. The only bad thing is that the store is very small so not much place to eat inside"}
{"text":"I'm so glad that I tried this restaurant. It was a snowing night and I was so starving after work. So I saw this Porchetta
 Roll restaurant on my way driving home so I decided to give it a try. They prepared food really fast. I didn't wait for long. I ordered chicken sandwich was soooo good and tasty! The staffs are very friendly. I will definitely come back for a second try!!"}
{"text":"Their sandwiches are really good! Tried the southern fried buttermilk chicken sandwich and it's yummy! Would love to go back and try the porchetta or shrimp poyo sandwich. The owner gave us a sample of the porchetta (pork) and it's tender and flavourful."}
{"text":"Great spot for lunch. The food is great, service is great, prices are great. Can't go wrong with this place. You won't be disappointed. I got the buttermilk chicken sandwich - it was delicious. Will definitely revisit!"}
{"text":"So far came here twice. First time tried their butter milk chicken sandwich. It literally was the best chicken sandwich I ever had. So if you think Popeyes sandwich is good you better try this place. Second time had the chicken and potatoes which was really good as well make sure to ask for extra hot sauce on the side."}
{"text":"Delicious!!! The portions are super generous, and it was enough for both me and my boyfriend. I got the Parisian potatoes to go with my meal, and they were very soft and flavorful. I will definitely be coming back to try their other options!"}
{"text":"It is about time Mississauga has a porchetta sandwich place like Toronto.  I ordered Spit Roasted Porchetta sandwich which was tender and very flavorful.  I have only been to this place once, and I would definitely return."}
{"text":"I've been raving about this place to all my friends! The food here is so good & the portions are very generous. I especially like the Parisian potatoes, it's a delicate dish with fragrant herbs like dill and chives & it works so well with the way it's roasted underneath the rotisserie chicken. 

I've tried their large Porchetta meal, with the potatoes and Greek salad. It was fantastic. The pork was quite tender and the sauces worked really well with a tiny kick of spice which was great for my palate. Also really loved the grilled pineapple on top, just made the whole dish so refreshing! I've yet to try the Porchetta sandwich but as some others have mentioned it's without crackling and I would prefer the meal platter over the sandwich if it's without the crackling. 

I've also tried their buttermilk chicken sandwich & holy moley this sandwich is HUGE. The chicken was so crispy and juicy & the sauces were just right. I got the spicy garlic which isn't as spicy as their spicy sauce haha but it was perfect for me. 

I can't wait to try the rest of the menu! Next time I'm going for the chevapi sandwich! Also I'm sure their sandwiches are big enough to split between two, & don't skip out on the potato order on the side you won't regret it!"}
{"text":"Hmm...this one's difficult.

First, I've had a porchetta sandwich once before out East, in Victoria, BC.  I remember it being salty and with the crackling.  So I sorta expected the same thing.

Second, the lady at the counter, as photographed is actually quite friendly!  Not the norm in these primarily take-out type places.

Thirdly, there's maybe about 10 counter-height seats.  So it's primarily grab 'n go!

On to the food, sandwich sizes are GENEROUS, as per the other reviews.  If you're not that hungry and want a snack, you can certainly share!  I ate about 3/4 of my sandwich, was full, and ate the rest later.

I had the namesake, Spit Roasted Porchetta, and the texture of the meat was very soft, very similar to pulled pork as opposed to chunks/slices.  Meat wasn't heavily salted/herbed, but had a nice mustard-based sauce with lovely caramelised onions.  The flavour came primarily from the sauce + onions.  No crackling tho.  :(

I'd definitely go back to try something else!  Don't go super hungry 'cause it's not fast food and can get busy at peak times."}
{"text":"Everything on the menu is amazing. Great hard working team. Great decor. Not a large number of seats so maybe not the best place to have a sit-down lunch/dinner but otherwise this place is perfect."}
{"text":"Love it!!!
I got the shrimp po' boy.. You get a good amount of shrimp and the bun is super soft and fuffy inside.
The spicy remoulade isnt realy spicy at all but is delishhh, definitely complimented the sandwich.
Its right up the street from my house so I'll be back to try the chicken next.
Customer service is awesome as well, they're super friendly and it was quite busy during lunch hour. The good thing is there is almost no waiting because theyre super quick and efficient at the front."}
{"text":"We went to Porchetta because my son wants to have cevapi. The place is clean and the reception she is friendly. The price for cevap is $10 if I'm not mistaken and you will have 6 small pieces of cevap. 
The cevap is small and missing the flavour. We have used to eat cevapi from Serbian place. The normal cevap, normally you can taste beef, lamb and pork because that is the ingredients of cevapi. mix together then you will have good flavour. I thought we will get the same teste but I'm wrong and they are pricey. 6 small pieces for $10 ... I think I have to think couple time to go there because for $10 and getting 10 pieces bigger cevapi go to other place. 
I think is a good idea to get better cevap just go to originally is."}
{"text":"New favourite lunch spot in Mississauga!

Nicely tucked away in a plaza, this rustic and small shop offers great sandwich and meal items with various meats like porchetta, fried buttermilk chicken, rotisserie chicken, etc.

There's no more than ~8 seats along the outer corner of the store so be prepared to take out.

I've gotten their porchetta meal - porchetta, choice of salad, and choice of side. Their Parisian potatoes are heavenly!!! I've also gotten their fried buttermilk chicken sandwich and it was so mouth watering as well - and quite filling! Your food is made fresh and you can see the entire kitchen (and the nice oven of rotating rotisserie chicken like Swiss Chalet) as you're waiting. You're probably looking at spending $10-$15 for a meal here depending if you're getting just a sandwich (which is still quite filling btw) or a full meal. They also offer family meals too.

Will keep coming back and trying all their sandwiches!! Perhaps the shrimp po' boy next!"}
