{"text":"Filling a huge void that this city never even knew that it had.  This place is so good.  It is pub fare, yes, but VERY good, made-from-scratch, creative, and delicious pub food.  Whether you are vegan or not, the food is just amazing.  

Excellent selection of beers.  And yes, all of the beers/wines are vegan too.  I love a good beer and was not disappointed in the amazing selection they have here.  Clearly hand-picked with love by somebody who also loves beer.

Atmosphere is also pretty perfect.  Low-key and candlelit.  Quiet but not too quiet.  Warm, friendly, and inviting.  

I had the potato dumplings with beer gravy and the bbq jackfruit/slaw sandwich both times I went because they were so good I couldn't risk trying anything else.  My husband had the lentil pot pie and it was also excellent.  

Do yourself a favour and get this food (and beer) in your mouth!"}
{"text":"We recently picked Porterhouse as our choice for our daughter's birthday celebration. She is vegetarian and the menu looked interesting. The food was good, that is not the problem here--it's the service and the manager. 

I contacted them in advance as I wanted to bring a cake. They said it was fine but that there would be a $20 plating fee, I agreed to it as this was my daughter's choice of resto and I didn't want to spoil her night. I can understand a plating fee if the party is large and it requires the staff to cut, plate and present a dessert that they aren't providing. I would understand a plating fee if there were a number of desserts on the menu. Our group was 4 people, and in fact only three were having cake. There is only one dessert on the menu and it is far from a birthday celebration type of cake! On top of it, I put the cake on the table behind our table (the restaurant was pretty empty at 8pm when we arrived). The waiter did not ask me if he wanted me to take it to the back, or even to cut and plate it after we did the birthday celebration. All he did was bring 3 plates and a knife to the table. The rest was up to us! As a comparison, we were at a restaurant last weekend and they have a plating fee of $2 per person should you decide to bring a cake. And significant choices on the menu for dessert were on offer as well. 

I think the public should know that this is really not acceptable service and frankly a rip-off. Plus how much of the plating fee actually went to the server, and dishwashing staff? Food for thought?"}
{"text":"Another disappointing vegan joint. It's always an incredibly long wait, and it's never worth it. The menu has very few dishes to choose from. And it doesn't really matter what you order -- everything is bland, bland, bland."}
{"text":"Great place for a vegan pub grub! Excellent customer service and the ambience is relaxing and laid back. The food here is really flavourful."}
{"text":"I was extremely excited to try this place out after patiently awaiting it's opening. It definitely did not disappoint! 

Beer: All four of us were very happy with our beer selections, and the recommendations from our server were spot on. For a place specializing in craft beer, my expectations were high. Luckily my expectations were not only met, they were exceeded!

Food: Our table sampled several different dishes. We had the potato dumplings, which were unique and tasty, as well as the lentil pie, which was very good! The BBQ jackfruit sandwich was the only thing at Porter House that I wasn't crazy about. If you've had the jackfruit tacos at Hot Beans, you'll know why. Lastly, we had the bread pudding for dessert, and it was absolutely delicious. 

Atmosphere: I loved the atmosphere at Porter House. The space is intimate, and it has a great vibe. The servers and bartenders were exceptionally helpful and attentive (but not overly so). Often I find that the servers in places like this can have a kind of \"too cool to be polite\" attitude, which is definitely a turn off for me, but Porter House had a good group of genuine staff."}
{"text":"I'm a meat eater - sorry vegans.  That being said, the Yuba sandwich is sooo damn good. Can't wait to try the bbq jackfruit sammich out!  Great restaurant with unique craft beer selection! A+++"}
{"text":"The bread from the bread and preserves was like day old supermarket ciabata and the cider (the server gushed over it when we ordered) was unpalatably sweet (the server said he actually didnt like it at the end)  the ploughmans dinner was nice, but again with a side of stale bread.  Ive been vegan fot 13 years, and while i really enjoyed some of the mushroomy fermented flavours, a non vegan would likely find them challenging.  The music was loud and confusing too."}
{"text":"I'm always excited to try new vegan spots and this place is definitely a great one. The restaurant is a little on the small side and signage is limited, but don't let the exterior fool you. The food is great and they have an awesome selection of unique craft beer that compliments the food. 

We started with the curry fries which were amazing. The fries themselves were crispy and delicious, the curry was rich and creamy and the cauliflower added a really nice earthy element. 

For mains we had the lentil & ale pie, jackfruit sandwich and yuba sandwich. All of these were so tasty. The best in my opinion was the pie. I could not wrap my head around the fact that the crust was vegan. It was so flakey and rich and buttery. AMAZING. The filling was very meaty and had a very homey vibe. The jackfruit sandwich was great as well. Perfectly tangy and smokey, the texture was spot on and you got a mountain of fries to accompany it. The yuba wasn't quite as good but again, super tasty. The bean curd and horseradish mayo worked really well together. Only thing that seemed a bit out of place was the cranberry sauce. I get the idea of \"thanksgiving dinner\" leftover sandwich but the sweet component could have been left out. 

All in all this place makes great vegan pub food and has an awesome selection of beer to match. I brought two meat eaters along with me and neither had any complaints, so it is definitely somewhere you can bring carnivorous friends. Highly recommend!"}
{"text":"Went with my daughter for dinner last night. We had many questions about the menu and the server did a great job explaining the menu. Food was fantastic. I came from Mississauga for this restaurant and I was well worth the drive."}
{"text":"Any vegan restaurant that opens I am there!  

I was happy with the beer selection...love the local choices.

The food was mixed.  1/2 of what I had was amazing (the curry fries yum!) and 1/2 was just ok (Potato dumplings).  This would certainly not dissuade  me from returning and trying out more fare. 

The place is cozy (read VERY small) and we had to wait 45minutes for a table because it was packed...we did chose to stick it out because we were very excited to try it.  The atmosphere is nice and the staff were amazing!

I will certainly return!"}
{"text":"This was the most amazing dining experience on my visit to Toronto. Seriously, each dish had spectacular flavor and they have a great list of drinks to compliment it all. The textures were spot on. Flaky was flaky, creamy was creamy, chewy was chewy. I did not expect to like vegan British food but this meal proved me wrong. Bread plate was amazing, as was the yuba sandwich and orange shortbread dessert. I have one more night in Toronto and am thinking of going back there for dinner."}
{"text":"This restaurant is a nice cozy place. I liked the atmosphere. There isn't a lot of space in here which is really nice for dining but if it's full you will have to wait.  We called ahead to get an idea of how busy there were.  We enjoyed 3 different Appetizers:  the bread and condiments, curry fries, and potato dumplings.  All appetizers were really good.  The bread came with a variety of preserves and spreads and was really nice.  The curry fries were delicious.  The potato dumplings were very creamy on the inside. For my main course I enjoyed the lentil pie with side of slaw and greens.  The pie was very flaky which was delicious.  It was very hot as well and nicely flavoured.  I would order it again.   Vegan isn't my first choice but my friends are vegan so I happily go along.  I would return and recommend.  The service was very attentive and very nice."}
{"text":"Fantastic! Came here with a vegan friend and she was thrilled. I have no idea what the yuba sandwich was but it was yummy. Interesting beer selection (pricey, but fun). The beer gravy and fries were perfection. Also, the hot sauce on the table = so yummy! Hope this place does well and expands their menu offerings!"}
{"text":"Went with my pescetarian husband and omnivore step-daughter, and we all LOVED it.  The miso cured tofu was shockingly delicious, as were bbq jackfruit sandwich, and the lentil ale pie.  My husband found his yuba sandwich a bit on the greasy side, but wanted to go back again the following weekend, so...colour him impressed.  Step-daughter, who rolls her eyes whenever we head out for vegan fare, couldn't stop raving and said \"we are definitely coming back here!\"

totally unique, and love the fact that that the food is what it is without pretending to be meat."}
{"text":"Excellent food and beer. Always look forward to seeing what beer is in stock, as the taps are constantly rotating."}
{"text":"I'd been wanting to go here for two days, after seeing they had a jackfruit pulled BBQ sandwich... I don't think I've ever been more disappointed with a meal, however.

Let's start with the positives:

Our server was amazing; friendly, engaging, and fast. The ambiance was nice, though it was a little hard to read the menu (I had to use my phone light).

The apple cider was very tasty, and the fries that came with the meal were decent.

But the hero, the BBQ jackfruit, was absolutely disgusting. Hot, flavoured mush with no discernible texture, I wanted to spit it out as soon as I took a bite

Really shame, as I've heard some great things about this place, so I'd be willing to give it another try."}
{"text":"Really eclectic mix of flavors and ingredients.  By the time we got around to eating there we had consumed enough pub food for the week and decided to try some off-the-wall stuff.  It was tasty, but the sandwiches and fries people were eating looked FAR better!  Good beer selection and incredibly cool/friendly staff!"}
{"text":"Food: 7/10 -- Value: 8/10 -- Service: 7/10 -- Ambiance/Décor: 7/10

It wasn't as good as I had hoped it would be. It doesn't really elevate vegetables and instead, kind of gets lost masking them based only on the three things we ordered. But the food isn't bad. It doesn't stand out, but it's good. This average/normal theme extends to its service and speed of food coming out too. 

We sat at the bar where there are four seats, and it wasn't bad because we were the only ones there. It's very dim inside and the noise level is reasonable, so it feels like your conversations are private. 

APPETIZER/SNACK: Onion Bhaji ($8)
---------------------------------------------------
These are basically fritters. They were really good and the sauce was great too. I just wish there were more. I mean, it's just vegetables and batter. But this was kind of a no-brainer. Almost anything fried is great.

MAIN: Yuba Sandwich ($13)
---------------------------------------------------
Mine was not greasy. I'm not even sure where grease so severe that it's all over your fingers would come from, so that wasn't an issue. It was pretty good and it's quite a big portion of food. You'll definitely get full. In terms of transforming something vegan into an imitation meat dish, I think they nailed the presentation, but the taste could have been better. When I started to get too full, I picked the sandwich apart to just eat the insides without the bread and it wasn't not very good this way. It tasted exactly the way you would expect a vegetable-trying-to-be-meat to taste, which is not that great. With the bread and whatever's on the bread, it was much more enjoyable. Fries were averagely good. I didn't really touch the gravy because it was just brown salty water. 

MAIN: Quinoa Polenta ($14)
---------------------------------------------------
I didn't have much of this one, but the one bite that I did have was very salty. It looks like a small bowl, but my friend said there was a lot of kale in it and that it was very filling. They had to pack it up.

SODA: Boylan Cola ($3)
---------------------------------------------------
I don't know why I keep trying these cane sugar. Every time I've tried a cane sugar at the recommendation of someone who claims there is no aftertaste, I'm always disappointed. It tastes weird and there is a stronger aftertaste than regular Coke."}
{"text":"The service is impeccable; not only is the staff knowledgable, they feel empowered to guide you in making your selection by giving you useful information on flavours, portions, pairings, etc. 
We ordered the bread and preserves for a group of three; the portion was suitable and most of the flavours were extraordinary with the exception of the pate. I ordered the lentil and ale pasty for my main. The pasty was well seasoned, flavourful (you have to try the hot sauce) and the texture was perfect. However, their side salad was lack lustre. Additionally, I asked for half to go and they must have assumed I did not want it and thrown it out. Regardless of this, it was a wonderful dining experience and I would encourage you to give it a try - you won't be disappointed."}
{"text":"Porter House is the best! Very heavy and filling top quality pub fare with fancy craft beers, ciders, vino, and liquor. Come hungry because the food will fill you up, but I never find it too greasy. My husband is obsessed with the Chip Butty and I can't choose a favourite because the Yuba Sandwich, BBQ Jackfruit Sandwich, and Lentil & Ale Pasty are such a close tie. Vegan or not, you will enjoy the food as well as the great service!"}
{"text":"Amazing pub style food, even if you're not a vegetarian.  Their Yuba sandwich that I order every time that I pop by, is just finish every crumb delicious.  They also have an extensive selection of beers on tap and by bottle.  I particularly like the dieu du ciels, which you may or may not have seen at the LCBO since it's not always in stock.  The one thing I wish is that there were more changes to the menu, it's embarrassing but I've already tried everything! I need more choice!"}
{"text":"I enjoyed everything about this place, despite a rocky start to the evening. When we arrived they only had a 4-top but my party was for 2 - so they reluctantly sat us asking if we'd mind moving once a 2-top was available. I can't blame them though, the place was suuuuper busy and I'm not surprised - it's a great place with considerate service and delicious, quality food. 
Almost as soon as we sat down, a 2-top outside became available and we moved to the patio, which is small but nice. 
We order the cauliflower poutine to share and it was AMAZING. It was huge and really filling so could also be ordered as a meal for 1. 
I had the jackfruit sandwich and loved every last morsel of it - seriously I did not want it to end. 
My friend had the polenta quinoa thingy and really enjoyed it - and he's not even vegan. 
The service was excellent. 

We need more places like this :)"}
{"text":"Open for lunch now too! Super stoked on this place. Great beer and food. Hours need to be updated on here quick."}
{"text":"I'm not vegan or vegetarian, but I really enjoyed our meal here. Went with someone who was vegan, and loved how there were so many options for her. 

We started with the Curry Cauliflower fries. Great for sharing, lots of flavour. We also shared the beet vegetable salad which was really good. Opted for the Yuba sandwich, not a fan of the miso gravy though. I really like it. None of this food was bland at all, and I wouldn't have cared if it were vegan or not vegan. 

This is a pub, so lots of fries and beers to go around. Tons of wine, beer and cider options. 

Would I come back just for the food itself on my own as a non-vegan? Maybe not. I feel like I've tried everything I wanted here, and the Lentil and Ale pie would be the next thing. But if I had to pick something vegetarian for a meal, I would come here in a heartbeat."}
{"text":"The Brockton General (a meat haven if I recall correctly) is long since dead and rising from its ashes is Toronto's very first all vegan bar, complete with British-style pub food. Thankfully, the beer is served cold! 

We enjoyed some Beau's vanilla porter, beer battered potato dumplings that were more like deep fried mashed potatoes than dumplings, cauliflower curry fries, the yuba sandwich and the lentil and ale pie. 

The food is heavy pub fare but it wasn't greasy in the way that makes me regret my meal like another local vegan comfort food establishment does.

The pot pie crust was tender and flakey. Service was great and the place was completely full of merry makers by the time we left at 11. Just glad a place like this that's completely vegan finally exists."}
{"text":"First off, the food was spectacular. I'm not a vegetarian myself, but wanted to try the food. I was intrigued by the BBQ Jackfruit. Being a BBQ pulled pork sandwich fan, I had to. Now, obviously for the sake of argument, it doesn't carry the smokiness of smoked BBQ (duh?) but the reason for the rating is because the flavours were still oh so delicious. We had started with the Onion Bhaji, a great recommendation from our waiter Jim. It came with three pieces, enough for two. It was also served with a dill, yogurt-type dip. He also made the biased opinion of a 12 yr old scotch he likes to drink. Requested neat, also a great recommendation made by our waiter.
The BBQ jackfruit was super tender, and had a great contrast in texture with the coleslaw, that had some sort of a horseradish mayo served in a bun. It too came with a side of fries. All in all, the experience was amazing; I'd return to try other items on the menu. 
It averaged about $13-$15 for their main courses, approx. $8-$10 from what I can remember about the appetizers, and a great list of drinks ranging in price. I left full, super satisfied, and I forgot room for dessert. Their portions are generous on the main course meals."}
{"text":"The Yuba sandwich is the best thing I have ever stuffed into my food hole."}
{"text":"Really cool place with a nice vibe.  Quite an extensive beer list with special deals.   Split the lentil pie and yuba sandwich with some curry fries.  Got to say it's vegan comfort food at it's best and they seem attentive to culinary details as well such as the side salad.  Our server was a very nice young man who provided detailed explanations of the menu.  If it wasn't for my low carb diet I'd eat there all the time.  But I probably will anyway."}
{"text":"In my efforts of doing new and unconventional activities in 2016, I decided to take my veggie loving friend for dinner at a restaurant that doesn't serve any meat. Truth be told, I'm not even mad.

Porter House is a dimly lit yet casual pub-like atmosphere, that had an impressive scent of curry in the air upon first arrival. We kept it basic with a tasty craft brewed beer and a sandwich of choice, with satisfying results.
I had the jackfruit sandwich, which is accurately described as \"shredded jackfruit, slaw, horseradish mayo on a burger bun with fries\" on their menu. The sandwich was tasty, and bits of jackfruit escaped the sandwich onto my plate, leading me to make \"jackfruit fries\" which were surprisingly delicious. My friend had the Yuba sandwich and was happy with their meal, agreeing on a \"4 star\" experience. 

While my love for meat outweighs my interest in even the most creative of vegetarian meals (read: I won't be coming back anytime soon), I will say that those who are interested in vegan and vegetarian dining should definitely put this on their list of places to go."}
{"text":"I've never heard of a vegan pub before!

I was so excited when I heard that this place had opened a while ago and when I finally got around to going, it definitely surpassed expectations!

Most of the vegan places in Toronto are pretty similar in terms of atmosphere, so it's really nice to come to one that's a little different. It had very trendy and hipster-y decor with dim to the point of almost dark lighting. The lighting added to the atmosphere, although it didn't produce the best quality photos!

As for the food, we started with the curry fries. They were my favorite type of fries - not too thin, not too thick, and not too crispy. The chana masala tasted great, although the full-sized chickpeas were a little awkward to eat with the fries. 

For main course, I ordered the lentil and ale pastry and my mom got the quinoa polenta. I loved mine, although the pastry was slightly thick and I think I liked the polenta marginally better and would order that for myself next time.

My mom ordered one of the craft beers (Porter House has a HUGE beer menu) and whichever one she got, she was obsessed with and was asking the server about where to buy it. 

Overall, I love this place and will try to go back soon, despite the out-of-the-way location!"}
{"text":"Porter House is a vegan restaurant offering appetizers, meals and alcohol  The spacing's a little tight, but the restaurant is accessible and offers gender neutral bathrooms.  Appetizers range from $9-$14 and full plates range from $12-$16.  

The space was cozy, but a little dark for my liking.  My friends and I had a little trouble reading the menus due to the lighting.  I had to use my phone.  Please also keep in mind that the restaurant is a little cold close to the door, so get there early!

When I arrived, I tried to order a coffee.  I guess I shouldn't have been surprised that they didn't have any.  As a whole, I love their menu.  If you're into draft beers, they have a great selection of local offerings.  They also have a bar rail, so you can order mixed drinks.

My table and I split the potato dumplings.  They were excellent, as was the gravy that accompanied it.  One of my friends ordered the Yuba Sandwich, while I split the Plowman's Lunch with my other friend.  I'm glad I split it, because as I observed at other tables and my own, the portions are massive.  I'm a light eater, so my only issue is that it would be nice if their were smaller meals.  I don't always want to carry around left overs.  

Don't let that detract from how amazing the food was!  The stuffed fennel was out of this world!  I plan on returning, and my challenge will be deciding if I want to order the amazing Plowman's lunch again, or try something new."}
{"text":"Excellent find nestled away in Dundas West! I'm not vegan and I think this place would appeal to vegans and non-vegans alike if you can convince your carnivorous friends to join you. The yuba sandwich was delicious, very unique, and paired well with the gravy served alongside. The fries were good, not soggy, and also went well with both the gravy and the house-made hot sauce. Trust me, if they ask you if you want the hot sauce (and you like spice), say yes! If they sold bottles of it I'd buy some. But, I'll just have to make due with coming back here and ordering more food. :) You get a good amount of food for the price. Service is great. Ambiance is nice. It's a small place but it's not overly cramped inside, which was really nice. I'll definitely be back to try the BBQ jackfruit sandwich.

Also, bonus points for being open on Sundays."}
{"text":"I do really enjoy this place. I'm a vegetarian beer enthusiast. This place seems like heaven for me and it delivers. I really enjoyed the yuba sandwich,really nice texture of the yuba, fried bread and miso-gravey,yum!  Excellent beer selection, lots of things I haven't tried. Dieu du ciel on tap,fantastic"}
{"text":"It is so refreshing that there's a vegan pub in Toronto and the food and drinks are so good. The service is excellent - we had a bit of a wait, but they were very accommodating and got us seated quickly.  Everything we ordered was delicious - beer battered potato dumplings, jackfruit sandwich, lentil pot pie and quinoa polenta. Nice selection of beers. Bread pudding was excellent for dessert. Only wish they had more choices. Dinner with drinks for 3 was around 100 dollars including tip."}
{"text":"Quite good. I had the bread and preserves. I was dying to try the miso cured tofu, because I've been toying with making it myself but recipes suggest a two month curing time and I didn't want to commit without trying it and at least know what I was going for. It was great, very creamy. 

Everything was really good, except the hazelnut pate was missing something flavour-wise. My dinning partner and I agreed on this, and thought a bit of smoke and maple flavours would make it amazing...as it is it was more like standard hazelnut butter (maybe a touch more savoury, but not enough to pick out any flavours other than hazelnut)."}
{"text":"If I could give this place zero stars I would. Staff has no knowledge about beer, the service is painfully slow. Ice age. Glacial. 4 tables all had finished eating and paying and we had still not gotten our meal. Avoid this place unless you want to sit in hangry silence for the 45 mins. Food was alright but not worth the wait. On top of it, no compensation for the order mix up, and slow service. Just don't come here."}
{"text":"Staff is super lovely, dishes are either absolutely amazing or just pretty good. The cauliflower curry fries is ammmmmmmazing. Seriously one of the best veg dishes I've had. The beer here, god damn the selection is amazing and usually around 5$ for tallcans (maybe that's just Sunday?)"}
{"text":"My boyfriend took me here for dinner the other day, and I really enjoyed it! 

This place looks cozy and our server was very nice. He seem so genuine and kind, he even took the effort to make recommendations + check up on us, despite the fact that he was the only server working that night. 

The vegan gravy here, tasted incredibly real, to the point where I felt guilty having it. The Onion Bhaji is a must-try item, from the menu!"}
{"text":"The Yuba sandwich is pretty good. My friend had the jackfruit sandwich which was amazing as well. I'm hearing rumours that this place may be shutting down soon as there is a lack of interest for vegan foods. So best to call before you head there."}
{"text":"Great small pub vibe. Came here with a girlfriend. 

She treated me to a yuba sandwich, which I enjoyed, but I think I fell in love with the fries and the lentil pie!! I would love to take the gravy home to drink. Can't wait to come back in the summer."}
{"text":"A new take on an old classic.
Everything about this place was absolutely perfect! 
I can't wait to come back!"}
{"text":"Cool little vegan pub. Very hipstery feel and it fits right in the neighbourhood.

My date and I  both tried the yuba sandwich. Its greasy as hell. Our hands were glistening in the candle light from all the oil. However I still really enjoyed it. The gravy for the fries was a bit watery, too salty and lacking in flavour for me. Drinks were pricey by my standards. Friendly and attentive staff. If I was in the hood I would check this place out again but I won't be making a special trip to go here."}
{"text":"We had been hearing wonderful things about this restaurant, so my two friends and I (both of them are vegetarians, I am not) went to check it out.

We were so, so completely disappointed. We all ordered different things, but our reactions were all the same - our food was bland, overpriced, and uninspiring. The sandwich I ordered was just french fries on fried bread. I had to cover it in ketchup to get any flavour...and I am really not the \"let's douse this in ketchup\" type of gal. My friend had the jackfruit sandwich, which I enjoyed more than my own, but it was still quite soggy, and not overly flavourful. 

The service was EXCELLENT. Our waiter was charming, attentive, and very enthusiastic about providing us with recommendations, which was great. Cheers to the staff! It was freezing in there, though. If you go in the Winter, wait a little while so you can find a seat as far from the door as possible. 

It's also expensive. Beer and cider was above our budget, and although I love craft beer, my lager-loving friends couldn't find a draft on the menu that tempted them. I understand the reputation of this establishment, and the overwhelming praise it's been receiving, may peak your curiousity and by all means, try it if you must, but we will certainly not be returning."}
{"text":"Preface: I don't drink alcohol. This review is about the food, service, and atmosphere. 

Visited with a meater the other night to see what Ross was up to with his new spot. I'm not a pub kind of guy, but I'm a Ross Corder food kind of guy, so I wanted to check it out. And true to history, the food (so far) is fantastic. The Yuba and the jackfruit sandwiches were excellent, the service was unobtrusive and casual, and the atmosphere was conducive to serious chats about our adult problems. Next time I'll try different eats and likely report back. The meater loved her food as well, and is keen to return. 

This will likely be a frequent spot for me even though I don't drink and it's very far from my home in Cabbagetown, but it's worth the drive, bike ride, TTC ride (all depending on who I'm going with). The menu is interesting, the food executed well and prepared by some folks that from my experience, really give a shit. 

Only hope for the future: Thomas Lavers sodas (though Dad's is still a decent choice). Lavers just seems to match the level of beers being carried."}
{"text":"Came here with a couple friends and ordered almost everything on the menu.
The curry fries are perfectly seasoned and fried to a crisp. The bread and preserves were okay, I expected more flavour from the spreads. The potato dumplings but I'm not a fan of the beer gravy, I would've preferred mushroom gravy if there was the option. My friend and I weren't fans of the yuba sandwich - the bread was very hard and the fries were too salty. One thing to note about the yuba sandwich is that it's on the sweet side. I was expecting it to taste salty like meat according to reviews. I got the lentil pie which was okay, but also on the salty side, so I mainly ate the puff pastry. The bread pudding with berries and bourbon was good."}
{"text":"Is this a mirage? Am I dreaming? Is this an actual vegan gastropub? Yes, yes it is!

The vibe is the antithesis to the familiar bright, plant-filled, lime green-accented and wood-furnished type of vegan restaurant that you're used to by now. Formerly a smallish storefront on the eternally hip Dundas Street W, Porter House is dark and cozy. It all but begs you to enter, sit down and swig a craft beer or two and inhale a plate of classy vegan food bursting with flavors you aren't expecting.

Truth is, I don't drink beer, but that list is impressive (three ciders too, if that's your thing). I was initially not feeling that wee wine list of one red (a cab/merlot blend, which I typically avoid) and  one white. I went with the dry Riesling and I'm glad I did because it's quite good. Sure, this is more of a beer place than anything, but it's cool that the wine they do offer is a good one! 

The menu is a creative vegan take on traditional pub food. I saw a lot of people on Yelp going on about the onion Bhaji app, which comes with an incredibly delicious white sauce that you'd swear is dairy. Make sure you get them to bring you hot sauce, too, because it's unlike any hot sauce I've ever had. I enjoyed the Bhaji, but it's a little too oniony and deep fried for me, so next time I'd probably try something else. 

Now, on to the Yuba sandwich. Honestly, seeing this on the menu is what convinced me I needed to cheat on my favorite vegan restaurant in Toronto (Fresh). Yuba is one of my absolute favorite things to eat. It's super chewy and similar to other bean curd preps, takes on the flavor of whatever it's cooked in or accompanied by. Porter House piles it on grilled sourdough bread with Dijon mustard, sautéd onions and lettuce. It's big. It's messy. I was enthralled. I had to start eating it with a knife and fork, lest I run through their entire supply of napkins. The mustard is slightly overpowering in flavor, so if that's not your favorite thing, tell them to go easy on it.

Now about those fries that come with the sandwich. Normally I wouldn't dip fries in gravy because I'm a plain, salty fry kinda girl. But that beer gravy has Chinese 5 spice in it! I broke my no gravy on fries rule and dipped away. 

I really enjoyed my time here. If you're looking for a unique vegan dining experience that pairs well with beer, this is your place. And lentil ale pastry? I'm so coming back for you!"}
{"text":"Had the curry fries and bread & preserves to start....hazelnut butter and mustard is delish! 

Had the jackfruit sandwich which was ok. 

Loved the beer selection.  Try the Trappistes Rochefort 8."}
{"text":"Some of, if not the best vegan dining in Toronto right now. Creative menu, great service, quality and consistency every time. A perfect place to take people who you may be introducing to vegan food for the very first time or people you are trying to redeem vegan food for after they've eaten at a place that cares half as much. 

The whole place is old school in their approach. No gimmicks or pandering, just really good food. Don't sleep on this place, it's a gem that deserves much more recognition than it presently enjoys. This spot is real, genuine, honestly good food that you can tell was made with the intention of holding up over time, not merely for a moment of hype. 

Service is perfection. Drink selection is unparalleled in vegan food in the whole city. Couldn't be a classier or more genuine spot."}
{"text":"Pretty good place. Great ambience and service. The jackfruit sandwich is really excellent, so make sure to try that."}
