{"text":"WHAT. A. DUMP.!!! Came here with the gals, and we are never going back. The atmosphere is intimate and cool but people are not. Crowd, ie guys, is just full of themselves and they think they are the s**t.  

The music is terrible too. It's just boring generic hip hop music, with which DJ did no creative mixing. This music attracts wannabe thugs, and this place was no exception. Like I said this place is filled with guys who want to be perceived as tough expecting such attitude would be accepted as sexy by ladies. The reality is, it's not. We found nothing interesting to talk about with these people. 

But service  and management are what killed our experience. We were supposedly on guestlist, which the club forgot about. So we had to wait outside for 20 minutes! But that's not the end. They also forgot about our bottle service, and we were not given a table. They found out about this after we paid to enter the club. The club was unapologetic and did nothing to compensate us. Our special nightout was ruined. Had they at least tried to work around the issue to satisfy us we would have gone back later as we loved how the interior looked. But they missed the chance so many times, and we won't support this establishment."}
{"text":"This is probably the worst nightclub in Toronto. From the poor music selection to the physically violent staff, it's horrible! Yes,  there's PHYSICAL VIOLENCE going on in this place. The owner physically attacked a female client who was also being held by a security guy. He smacked the woman in her face! She was celebrating her birthday. I never bother writing reviews but this place is outrageous and disgusting. My friend checked in her jacket and never got it back, plus she was blamed for the loss! What?! For some strange reason we were never allowed by the security staff to go to the washroom which was located in the basement. Drinks were poorly made and the clientele was ridiculously rude and nasty. All in all, very negative atmosphere. Wouldn't recommend this club, and we're definitely not going back there. This place should get shut down."}
{"text":"Chic and relaxed atmosphere. The bar was pretty nice, but I wasn't a fan of the careless bartender. In fact he dampened my whole mood + feelings about the place. I thought about giving 3 stars, but decided to complain to management instead.  

I would say they need better management and a staff rotation. 

Many of my friends have had great experiences here; so much so that they even decided to schedule a private party.  I went to said private party, which was fantastic but couldn't shake this terrible guy or his attitude. There were 2 bartenders ( 1 male, 1 female). The female bartender was great!. She was running around taking orders and even cleaning. While  the guy on the other hand was just sitting around.

To be honest it didn't even make sense. He wasn't serving anyone nor helping his coworker. He just stood behind the bar, wiping it down, all night. I guess he is still getting paid so why work harder than you have to : (  Seriously disappointing.      

I would recommend Empire Lounge for a group get together or large party. Prices were avg drinks around $8-10. Food was ok. More of a positive vibe and social place than a great restaurant."}
{"text":"I usually don't bother writing reviews ever .. this is my fist time writing a review.. I just had to for this place...
Worst service, owner is terrible ! Bouncers are extremely unprofessional and rude to all of the WOMEN. even if you're pretty ... sexist to an extreme

Washrooms and dirty, bartenders are lazy... music is good but not worth even paying $15 to get in ... this is the worst club I've ever been to ... highly not recommended!! 

PS. I've never written a review but I've felt a need to WARN you!"}
{"text":"what can i say never been there when it was the restaurant , only when it was party time , and it was some kinda fun let me tell you , you have to go on a night when theres a good DJ if not dont bother lol but its nice . 2 rooms, an outside area for smokers ..... its really nice"}
{"text":"I agree. Going out with the intent of letting loose and having fun to having your night ruined by rude, stuffy assholes, is never fun. In fact, I hate it when I'm having a good time on the dance floor, look up and lock eyes with the most bitter chick you could find in the club, with her back to the wall, giving me the dirtiest looks. \"...Was it the last dance move I did? I thought it was pretty cool... Do they even say cool anymore?... Shhh, act cool\"

However, I have to wonder if there's MORE to the reviews left by the people below when they use descriptors and statements like Wannabe thugs\", \"These people\" and \"The vibe inside is very dark and I'm not just talking about the lighting.\"when referring to the club patrons and the club itself. Hmm...

As for the guy who mentioned the Anti-pot sign. Weed smoking clientele get the bad rep while the designer drug clientele go undetected. Spare me that you've never done any of the above! Would u call yourself problematic? 

-My 5 cents (Rounded up)

PS you said \"Considering how many wonderful people live and work in the area, I'd really like to see Empire permanently closed by next year.\" Thank you for what I'll assume is a compliment unless otherwise noted! I also work in that neighbourhood, but clearly you and I have had different shopping experiences. My experience?Walking past Eton and seeing unpicked cotton and nooses displayed in their store window. What about yours?"}
{"text":"I had visited POSH for the first time on their Saturday Latin Night with my 3 girlfriends. Unfortunately, it may be our last visit as it was not worth the $15 cover. 
The coat check ladies were rude and kawalled the last friend paying (after the rest of us were already inside) into paying for coat check as well saying they won't let her in with her jacket despite the fact that the rest of us were already inside wearing the exact same style jacket. Also, despite their dress code sounding very strict online and in reviews, plenty of people were still wearing sneakers and sweatpants... it's so blatantly clear that they favor certain customers.
The drinks and prices were okay but we did notice that their tequila shots were well watered down.
Another issue we had was with the countless number of couples dancing as they were careless and continuously kept bumping into us so hard that we were knocked over several times. They have absolutely no regard for their surroundings and the limited space. 
However, I must say, between the two floors there was still enough room to breathe and dance without having strangers sweaty arms rub on mine. But even then it was hard for us to dance for long periods of time because a lot of the latin music was more salsa than up beat clubbing latin music. The dj downstairs was awful at mixing the songs. When he played more popular music he would stop and change the song right before the most known part of the song and abruptly too. Very disrespectful especially when you're lost in the song and belting the lyrics. 
Lastly, the club housed a lot of creepy men, both workers and customers. Men were rude, wouldn't take no for answers and even tried to force girls to dance with them by gripping their wrists and not letting go. It was disgusting to see. One of the workers would constantly come out of nowhere and caress my friends arm then try to hold her hand. What is that. 

Honestly. Not worth it. Idek why I'm giving them 2 starts instead of 1. The physical environment was nice though. Maybe that's why."}
{"text":"Review on the Run:

Managed to go on a half price menu night. Had the Antipasto Dish for starters, for the main I wanted the Grilled Marlin but they had ran out, so instead I had the Rib-eye with Parmsen fries. Awesome fries, and the Rib-eye was done perfectly. And to be honest, I'm not sure whether I wasn't that hungry, but I was full, too full to even have ordered one of my favourites: Creme Brule. Small restaurant on Yorkville just east of Yonge. Really awesome value if you catch one of their special nights, although they do have a price fix menu as well.

Conclusion: Eat Here? Yes!"}
{"text":"WOMEN PLEASE BE CAREFUL! My girls and I all arrived separately to posh, and Niko the bouncer harassed us all individually upon arrival. He made us feel so uncomfortable and commented on my friends chest saying she needs more breasts. Once when I was walking past him, he spanked my butt. When reporting this to the rest of the staff, he laughed at us, said he can do whatever he wants, and he told my sister to shut up. He should be fired immediately. He ruined our night, and we'll make sure we never go back to posh unless we know he's gone."}
{"text":"My first time here and overall impression. Since this place hasn't Came gotten a good review In a while I will post allot of pics . A bit of a write up: Came with a group of 10 people ( we made reservations). Place is stylish and has allot of classy touches. Food was ok although some of the group found it blend or undercooked. Service was good. Here is where it gets interesting. We came for dinner at 8 but by 10 pm the place converts into a dance club ( we had Latin music)  when we payed the bill for dinner the tip is included

Keep in mind  this is upscale area everything for dinner cost a bit more . 2 appetizers and 2 drinks plus tip cost us 50$+ 

At the door to come to party after 10pm cost 15$ plus coat check.  Place gets busy busy after 11. They also have a patio and a party room in the basement which is cool . Nice place might come and check it out in the summer."}
{"text":"I've come here twice for their Latin nights on Wednesdays (previously know as Azucar Wednesday and now known as Los).  

In terms of the music, it is 70% Bachata, 30% salsa/other and they'll open another Latin/Top 40 room if the crowd dictates.  The floor is decent to dance on as well.  I genuinely enjoy social dancing at this place.  

In addition, paid parking is close by and it is a 2 minute walk from Bay or Yonge/Bloor station. 

However, I have a few problems with this place:

1. The bar doesn't accept credit cards and cash only.  That's really messed up.  

2. The men's washrooms are terrible.  They are clean but cramped as well.  Both stall doors don't close and the urinals are so tight together, it's awkward.  

3. I understand not opening two rooms because it's not a big enough crowd, but when you advertise a top 40/reggaeton room and a salsa/bachata room, you definitely should open both rooms as it is two different types of crowd. One crowd that enjoys social dancing and less drinking and another crowd that's more there just to party and drink.  

Overall, I would go back to this place, but I just wish they could fix #1 and somehow #2."}
