{"text":"I've been here a couple of times and each time the jerk chicken is great.  Compared to several other restaurants I still like the jerk chicken at Potluck.  It's much more flavourful.  In addition I love the \"gravy\" that is put on the rice - extra for me!  It's a take-out type place so not sure what others are expecting.  It's not fine dining but the food is good and that's why we go."}
{"text":"It was a Curry Chicken roti kind of day, so went there for lunch and got disappointed they were out of curry chicken. Had to settle for jerk chicken. Got the small, and the portion size was pretty small even for a small. Taste was ok. Had better. Wouldn't go out of my way for this food. The only thing I would say is it's a lot cleaner than all the other jerk spots."}
{"text":"The food was very good. The service was even better. Did not get the man behind the counters name but the recommendations he made for food choices especially the coleslaw was spot on. I dint think I have ever seen my five year old eat coleslaw let alone eating it with such vigour.  Highly recommend this place."}
{"text":"How can this place still be open !!!! I order a large ox tail $16. Plus tax .  To start off food was warm looks  like food inspector  hasn't been there for a while . A few pieces  of meat that was very plan tasting.  Worst that I've ever had .  There was no spice bottle around  .  There a great place just on 10  or sure what made me even go there . I blame YELP for my bad decision .  See picture  of my shiny oxtail  ."}
{"text":"Ordered Two Large Jerk Chicken dinners last week and it was enough for three. Food was prepared well and service was quick. The server did ask if I wanted spicy and I said yes, However to my surprise I did not find thr food to be even remotely spicy. I had to add some fire at home :)."}
{"text":"Some people say reviews are only for places that stand out for negative experiences so this is definitely one of them. So far this has been one of the worst place to eat for me and here's why.  I ordered and paid $20 for the curry chicken and rice along with a vegetable Roti.  They said the said would be 15 mins so I said fine.   About 15 mins later they said they don't have any curry chicken and suggested the stewed chicken.  Going by their recommendation, I said okay.  As I was eating the dish, there were several unidentifiable bones and very little taste.  It's pretty hard to mess up chicken w sauce over rice, but I took a few bites and couldn't finishes most if it. I am also questioning the type of meat that was used in the \"stew.\"  The Roti came out another 15 mins later and I couldn't understand why a vegetable dish would take so long (45 mins). The Roti shell was clearly uncooked and the inside has zero taste.   Had one bite and placed the rest of it in the trash.    Severely disappointed in this place and would NEVER return.  The only good thing about this place is the cool looking wood tables and chairs."}
{"text":"A lot of places that serve Jamaican food abroad don't do it well however potluck is the real deal. The jerk chicken is juicy and full of flavor and so is the rice and peas. Would for sure recommend. The festivals are also amazing. Only downside is that it runs on island time for sure."}
{"text":"Small little open door restaurant in the Newin Centre. It only has take out but you can sit in the food court or at the 3 tables in the restaurant.  I've tried the jerk chicken and ox tail so far and those are good choices. Can't go wrong with them. The rice is delicious and the coleslaw is a perfect match.  They're friendly and aren't always too busy. Expect a wait under 5 minutes.   The price for a small 1/4 dark meat jerk chicken with coleslaw and rice comes to 7.65$ with tax.  Well priced food that taste great and is good for on the go!"}
{"text":"We have had take out from here many times over  90 percent of the time we get the curried goat dinner, except when they're out of goat then we get oxtail.  The meals come with rice and peas and coleslaw.  They always pack up the food nicely.  Nothing ever spills oyer despite the amount of gravy.  The curries are good going down.  The goat is well prepared.  However one distinction to make between Jamaican and Trinidadian preparation of curried goat is that the Trinis use the leg of the goat which has less bone than the rest of the goat.  The Jamaicans use the rest of the goat, so you must be conscientious of bones while eating.  Consequently I would refrain from feeding this to my toddler.  I would also never order a goat roti from potluck for the same reason.  Overall we love this place and we go back at least once a month."}
{"text":"Gosh, it took me so long to track down this place's name.  I ate there two years ago during a brief stay in Mississauga, and its still the best jerk chicken I ever had.   Potluck Caribbean Cuisine is a tiny place that serves magical food. The chicken is tender, flavorful, and the gravy soaks the bed of rice and peas perfectly. The coleslaw is milky and mild, with just enough zing to contrast with the richness of the chicken. Portions are generous and prices cheap. I can't wait to try the oxtail and goat curry next time - I could probably eat that stuff forever and ever!  I'm elated to have found the place again, but heartbroken to live so far from it. :("}
{"text":"I wanted to come back here and update this. they cleaned up the place, got rid of the dead plant and service all around got better. I'm glad they stepped it up.   really happy with the improvements! keep it up!"}
{"text":"I had driven by Potluck many times and finally decided to finally give it a try. I thought it would be best to call in my order for pickup before heading over since I wasn't sure how long the wait for food would be if ordering once in the restaurant.  I called at around 8:30 on a Monday and the person answering the phone made it seem like I was inconveniencing them before I even had a chance to speak. I said that I would like to place and order for pick up and was immediately cut off. \"Hold on\" said the lady on the phone as she yelled out \"do we have any rice?\" I guess they didn't because she came back on the phone and said \"no rice.....no food\" and hung up! I was shocked that a business could operate like this. I wasn't even going to order rice! I was going to order a curry chicken roti!   I am bamboozled by the entire thing and for this I have to give potluck 1 star."}
{"text":"Okay so i wrote a review for this Place, but for the meadowvale location, because i didn't know this was the Hurontario/Dundas location.   I always used to come here, even before Yelp came into my life.   its located inside a mall Called Newin Centre, very ghetto mall. I come here for the glorious and yummy Jerk Chicken which is amazing. Make sure you don't come near closing because the Jerk chicken will surely be sold out, and get curry goat sauce with it too.  Basically they have more options than jerk chicken, of course.  its a west-indian restaurant, they serve Oxtail, fish, Roti and so much more yummy food.   if you do get Jerk chicken, you'll get Rice n peas, with the best coleslaw you will eat in your life....*Homer Simpson Drool*"}
{"text":"Small take-out shop in the Newin Centre. Lots of parking outside. The server was talkative and friendly. I had the goat curry, which fell off the bone. Add a side of coleslaw and you're good to go. Yum!"}
{"text":"Just awful. Bland food. Rude staff. Cold restaurant. Dirty.  Just simply awful. Never ever again."}
{"text":"This was my first Caribbean experience. I was not let down! The staff was friendly and efficient. They seemed to know all of their regulars quiet well.  The food was a good portion. The chicken was beautifully prepared. Worth the try!"}
{"text":"For starters this is located across the street from the Newin Centre beside burrito boys off of Dundas. I couldn't find it as someone else suggested it was beside KFC across from burrito Boys which is incorrect, unless they recently moved locations.  Well lets begin by saying I am very disappointed, especially considering the great reviews. then again everyone's review is for jerk chicken of course. So I've attached pictures of the new locations/menu. I ordered the oxtail w rice&peas extra oxtail gravy on the rice of course.  Oxtail portion is small for 16$ that I paid for the large (large means more rice not meat). both the rice and Oxtail lacks flavor/taste, the seasoning is very minimal which suck. I'm also used to having oxtail w the nice thick gravy fall off the bone meat where you'll see little chunks in your rice. no, not here the gravy is quite watery and bland so adds absolutely nothing to your rice/peas. I don't know how hes gotten such raving reviews, but then again I'm used to eating Caribbean food so maybe that has a role in my taste buds. Or maybe his other food is much better, which I do plan on trying this week sometime, but as for the oxtail ...issa no for me dawg *Randy Jackson voice*  On that other hand customer service was great. I called ahead to order he was very pleasant and even asked what time I would be coming by for pick up. When I got there I received the same great customer service he was nice asked about side, you can choose coleslaw or roasted veggies.  Meh 2.5/5 will update after trying other items"}
{"text":"Haven't been here in a year or so but was driving by and jumped at the chance to satisfy my recent oxtail craving and Potluck did not disappoint! Ordered a large oxtail and the portion was very generous, lots of gravy poured on my rice and peas and coleslaw is excellent!  A steady stream of customers coming in and out which is always a good sign!  Staff were very friendly and had a good chat!  Will definitely be back when I'm in the area again!  As for my oxtail craving? Totally satisfied!"}
{"text":"Randomly walked into this place and what a pleasant surprise! The jerk chicken was perfectly tender and the rice and were moist with oxtail sauce :)   Will definitely be back next time to try the curry roti"}
