{"text":"Too bad it's gone. Piano bar, wine by the bottle, they even told you not to rush.....the atmosphere made the place. Wish I could find another place that does complete fondue dinners. Any suggestions?"}
{"text":"My son wanted fondue for his birthday.  Instead of going to overpriced Melting Pot, we drove from the westside to go to Potpourri.  Before we left I checked their website to make sure they were open.  Yep!  Their hours were listed for Monday as 5:00 until close.  We drive 40 minutes to get there,  pull in and find out that they're closed on Mondays.  It said so right on their sign under their sign that says that they're open 7 nights a week.    Needless to say,  we're SO not happy!!!"}
{"text":"i wanted to take my girlfriend somewhere different for valentines dinner this year because we both enjoy trying new things and expiriences together. so i booked a reservation for us at potpurri. admittedly she was nervous about the whole idea but being the adventurer that she was it turned to excitement as the time for our rez approached.  as it turned out we were not disappointed! the food was plentiful and delicious! we got the gallery of fondue which is a four course dinner for two. it was DELICIOUS! it comes with marinated beef tenderloin, chicken, shrimp, scallops, and veggies. as well as your cheese pot first then a salad then for dessert chocolate flambe'. our ervice was great and as the last reviwer stated we were ther past closing time and did not feel rushed in the least! over all a great restaurant with a great atmosphere! i will be back!"}
{"text":"I want to begin this review by letting you all know that I am a fondue affecianado, and have eaten it in many of the finest of places including in France, Austria, Italy and Switzerland. So, my review of this place would probably be slightly biased for a smalltown join in Mentor. The place is decent, but not necessarily a standout joint.   Basically Potpourri is aiming to be an intimate fondue restaurant, and the best I can say for it is that it meets those requirements adequately.   We ordered two fondues - a cheddar and a gruyere. The cheddar was slightly on the thick side with not enough wine to reduce the cheese into a proper fondue consistency. You felt like you needed a fork  to get at the fondue up vs dipping in the bread. For the gruyere, the opposite was true - too much wine and heat turned the gruyere into a hot liquidy fondue that was hard to get onto your bread - you needed a spoon to hold any fondue at all! Decent tastes, but dissapointing experience.   We also ordered a fettucini alfredo, and it, again, was decent at best! It had oodles of butter as a part of the sauce - even the garlic bread seemed to be deep fried in it. Tasted buttery without the inherent creaminess and richness you expect from a good Alfredo.   The one good thing this place has going for it are prices... at $11 for a fondue, or $17 for the fettucini, a visit will not break the bank. All in all a decent place for Mentor, Oh."}
{"text":"This restaurant is closed...the longest running restaurant in Mentor is no more.  I guess frying your own dinner in a Fry-Baby is no longer the cool thing to do.  Humm..."}
{"text":"I used to work here and am trying to remember the recipe to the Chicken Scallopini. Does anyone in God's name know it???"}
{"text":"Potpourri holds a warm place in my heart. This was my celebration restaurant of choice in high school with all my girlfriends. We'd order the gruyere cheese fondue, the salads, the hot oil and of course the chocolate fondue. It was entirely too much food, we'd come away smelling of the hot oil pots and laughing about the fabulous dinner experience we'd all shared.  Fast forward 15 years. The food (luckily) is still the same. Even now writing this I am dreaming about dripping an apple slice into the molten gruyere swiss and twirling it around lavishly. The servers are friendly. The decor? It has changed. Gone are the dark booths and celebration wine bottles - this was a place that really had unique decor and was romantic (no not with my group of girlfriends, but if you wanted a booth this was THE place to go and whisper sweet nothings to your loved one.) Now Potpourri is standard. The space is open and there are generic (and totally random) pictures of the Emerald Isles (really?)  Don't get me wrong I'll still keep coming to Potpourri for my fondue fix, but I'm just sad about the change in the decor which contributed oh so much to the romance of the place."}
{"text":"My husband surprised me by taking me to Potpurri when we were dating (10 years ago).  We loved it immediately.  It felt cozy, if a bit dated (at the time).  The owner came out and greeted us and helped us pick a great bottle of wine.  We ordered the 4 course dinner...cheese fondue, salad, dinner and dessert flambe.  Every part was delicious.  We especially enjoyed the relaxed atmosphere.  I think it took us almost 2 hours to get through dinner.  We just enjoyed eating and talking.  We've been back many times over the last 10 years and the only thing that has really changed is the decor.  it remains one of our favorite places for the atmosphere and most importantly, the food.  Worth the drive to Mentor and a better value than the Melting Pot"}
{"text":"We wanted fondue, and The Melting Pot is out of our price range (plus I have never, ever heard anyone say anything good about it...) so we went here. Plus, we had a coupon!  Don't let the drab exterior keep you away...Potpourri is a nice place. We had plenty of food--to be honest, I think we had more food than we could eat! I know for a fact that I left quite stuffed and almost dozed off in the movie that we saw afterwards. The sauces were exceptional as well and we got a variety of food too. For fondue, the prices were very reasonable...even without a coupon, this place wouldn't have been overly expensive.   The service was decent, but I was really impressed by the fact that we were there past closing time and they did not try to rush us out in the least, especially on a Sunday night.   If you're out in the area, you'll do well to visit Potpourri. It's a nice alternative to the expensive Melting Pot, that's for sure. I wouldn't make a special trip out there from Cleveland to eat there, but since we were in the area on a date, it was a great choice."}
