{"text":"Since taking a trip to Prague last year, we've been hankering for some authentic Czech food (or more specifically, Czech Beer!)

A friend told us about  Praga Cafe, a cool little cafe located across from Chinook Centre Mall. Very clean, beautifully decorated - it's a great looking little place.

And it turns out that it IS an authentic Czech restaurant, owned and operated by authentic Czechs! We've been there 3 times. Each time the service has been amazing, and the owners have been remarkably friendly.

The Cafe serves standard lunch fair, such as sandwiches, paninis, soups and salads. They apparently also serve fancy coffees (Did we mention we went there for the beer?) 

The menu also includes more Czech-ish dishes such as  fried cheese or schnitzel, each served with traditional Czech potato salad. There's nothing on the menu over $10.

We've tried the paninis, the wraps, fried cheese, and the schnitzel and were impressed by all. Portions are perfect - they likely won't leave you hungry, but you won't leave much on your plate, either.

Today we tried out a Czech beer we hadn't had in Prague - Krusovice Imperial. Great stuff. There's another 9 imported beers on their menu so we'll definitely be going back.

Overall, it's the perfect combination of hospitality and great food. We'd highly recommend it if you're looking for something casual and a little different."}
{"text":"What a great find! Thanks to Lindsay for letting the yelp universe know about Praga.

Praga Cafe is very quaint and clean. There are seven tables and a bar. Two dart boards and a small TV. 

The decor is burgundy and gold, which reminded me of some of the concert halls in Europe. The windows are big so it feels airy. When I looked up, way up, I was delighted to see chandeliers - just like the concert halls in Europe! The walls are adorned with artwork featuring scenes of the Czech Republic.

Alas, they were playing playing a local radio station. With decor like that, it would have been nice to have some Czech folk music or at least some music by Smetana, Dvoràk or Janácek. Minor detail.

My friend got lost trying to find the place (hint: go to the strip mall with a purple Le Chateau outlet). Kudos to the server and the patron at the bar for giving her directions.
 
The menu has changed with the new management. I like how everything is listed in Czech first with English subtitles. They still offer a mix of traditional Czech dishes and standard café/deli fare.

We ordered the two most popular dishes. Shortly after placing our order, the plates came out. I'm sure it was less than a 10 minute wait.

My friend had the chicken schnitzel while I ordered the Kureci Kapsa, which is rolled chicken stuffed with asparagus, olives and Brie. The meat in both dishes was tender. We both chose shredded potato with basil and cream as our side dish. What a refreshing combination!

My friend passed on dessert, while I had the crèpe filled with fresh fruit and ice cream. You certainly get your money's worth with this! It was the plumpest crèpe I have ever seen, bursting with fresh apples, oranges and bananas. The vanilla ice cream was a nice complement. On the side was a healthy (or should I say unhealthy?) dollop of freshly made whipped cream. 

One thing we learned from the new owners is that the Praga website is from the previous owner's time period. Unfortunately, the previous owners didn't give them the password to update the website, so the menu with the 10% coupon are outdated. 

We went seeking something \"fun\" and \"different\" when we picked Praga Café. We couldn't have picked a better place!"}
{"text":"Welcome to Praga!  A refreshing cafe based on the traditions of Prague... a little taste of the old country.  Here you'll get a glimpse of what dining is like in the Czech Republic.  It's decorated fairly modern, but has its little twists unique to the country.  The waitress we had was a pleasant Czech lady who actually spoke the language to the people I was dining with... Czech people!

They offer an abundance of Czech beers like, Pilsner Urquell, Litovel and Kruovice Imperial or Cerne - all great beers!   They have your traditional Czech-style dishes as well as some basic cafe/deli favourites.  I ordered the delectable deep-fried cheese.  That's right!  Cheese lightly breaded and fried in oil.  It was the greatest pleasure I've ever indulged in!  They also have other customary Czech dishes like Goulash, Schnitzel and Svíková - tender beef with cream sauce served with Bohemian dumplings.  My party was not disappointed by the meal, its portions or the prices.  

I was, however, slightly disappointed to see that they didn't only offer Czech dishes.  I was hoping to have a full-blown Czech experience, so mush so that I wouldn't even understand the menu.  Even keeping those things in mind, I was extremely pleased with the experience anyways.  If you're a little hesitant about trying Czech food, you can order soup and salad, or panini's, wraps and sandwiches.  They also offer catering and make their venue available to private parties.

Praga is located across from Chinook Mall on MacLeod Trail, so it's the perfect place to dine after a long day of shopping... or if you're just in the mood to try something different.  Branch out from the ordinary Chinese, Vietnamese, Greek or Italian food and give your taste buds a treat with some good ol' Czech traditions."}
