{"text":"I work at Kingsland Farmers' Market so I get to eat here as much as i'd like (BE JEALOUS). Pranzo is probably the BEST all-around place to eat here in the Market. I've never had anything I didn't like but by far the best things are his pizza, Pasta dishes and panini's."}
{"text":"\"A Hidden Gem\" does not even begin to describe Pranzo Italiano.   Pranzo Italian occupies a small kiosk space in the Market on MacLeod. Here, you will find a friendly man in a chef's uniform delivering a small menu of high end restaurant style dishes at incredible prices.   On what will be the first of many visits, I tried the braised lamb shank. With a $15 price tag, my initial thoughts were that this was a little pricey for \"market food\". But, once I started watching the dish being prepared, I knew that I was in for a treat.   Beginning with your choice of mashed potatoes or rice, the base was topped with two well portioned, fall off the bone tender lamb shanks. While plating these ingredients, the chef was sauteeing a mixture of peppers and mushrooms which were served alongside the meat. All of this was then topped with a savory sauce which complemented the meat perfectly. Then, the chef whipped up, on the spot, a fresh garnish of parsley, tomatoes, onions and seasoning.    To watch all this, I forgot that I was standing in front of a cluttered station in a market off MacLeod trail. Thinking, instead, that I was watching a professional chef on tv.  Given that this is a market, the food is served on a tray and eaten in a food court setting. None of that will matter, though, once you taste the dishes. I could easily see myself paying $50 for this food in a \"proper\" sit down restaurant. In the meantime, I am very happy to be able to get this quality Italian from this humble location."}
{"text":"In Kingsland Farmers Market, there's an interesting little Italian spot just next to Primal Eats.  Pranzo Italiano came in just before the holidays, and it's a pretty good addition to the mix.  Let's see, in the period of a few months, I've tried their italian sausage sandwiches, a few pastas and unbelievably, a pretty darn good Osso Bucco for under $20!!!!  All the food is made fresh, the flavours are rich and yet because it's not in a restaurant, the prices are surpringly cheap.  More importantly, the chef actually cares a lot of the diner's experience.  At one time, even though there were already several cooked sausages available for the sandwiches, he was concerned the taste wouldn't be at it's best as they were more than 20 min or so old in the warmer.  So he promptly made me a fresh one.  Must haves? I would say any of their fresh soups.  I've found their take on lentil soups to be simply awesome, thick with lentils, in a dark flavourful broth.  Over this past winter, it was one of my favorite highlights to the cold weekends.  The Lasagna is also quite a good find.  Well worth a stop for lunch weekdays or weekends, I would highly recommend this for a great take out or a quiet lunch in the Kingsland dining area.  #2 of Yelp 100 Challenge"}
