{"text":"I look forward to visiting Primozz when I visit Mentor. If you are in a rush and order a pepperoni roll you will wait a bit. Food is not frozen and baked, but made fresh, the pepperoni roll takes about 25 mins or so...but WELL with it. Portions are big enough to share, we always have to much. GG Roni is my fave pasta penne pasta, italian sausage, and mozzarella all tossed in a tomato cream sauce, rich, delicious decadence. Cannoli here are also homemade and perfect.  During our visit we MUST order a small pizza, their are also fresh made, perfect crust, this is a must go to.  The owner is a sweetheart too, she's definitely got a passion for what she does."}
{"text":"Primozz was originally located right at the end of the street I grew up on... so as you can imagine I was constantly there grabbing slices or pizza or pepperoni rolls with my friends or family.

Speaking of their pepperoni rolls, they have the most fantastic ones ever.  I generally order a mushroom, pepperoni, and cheese roll. They are delicious and usually enough for more than one meal depending on how much you eat!  The price is extremely affordable.  Their pizza is also delicious. 

A few years ago they moved to a new location with a sit down atmosphere, where as they used to be pick up only.  They changed their hours so they are not open til 4 pm on Sundays, which I dislike because who wants to wait til then to eat pizza?  But, it is still a hometown favorite that I will go back to time and time again.  The owner is super nice as well."}
{"text":"Very accommodating, Great prices & spectacular food. Hands down, the best pepperoni/cheese bread in Ohio, and it's only $3.50. Great \"mom & pop\" feel."}
{"text":"Based on the other reviews, I stopped in here during my lunch break to order a pepperoni and cheese pizza roll. The pizza roll is served in bread maybe a foot long.

For $3.50 the food was well worth the price as it was delicious. However, having worked at a pizza place as a kid, I don't know how it took them 25 minutes to make it.

Still, despite the wait, it was well worth my time and left me very full."}
{"text":"Expertly crafted home-style pizza with a tender, buttery crust and absolutely delicious sauce made from high quality tomatoes. One of the best pizza sauces I've had. Worth the drive for those in Painesville looking for great pizza and one of the best I've had in Mentor. Plenty of tables for dine-in and service was quick and accommodating."}
{"text":"I grew up with this place and I have seen it's fame and popularity spread through the years.

A must have are the pepperoni and cheese rolls they are amazing. 

Large pizza's will feed 3-4 people because the pizza is thick and very very delicious. It's not Chicago or New York Style, it is Cleveland style."}
