{"text":"I'd put it in the Top 5 Sushi places in the GTA.  Staff is always super friendly and helpful."}
{"text":"Prince Steakhouse is one of the few Teppanyaki places left in Toronto and a good choice for any west-enders looking for a nice casual dinner/date/family event.  You can do cooking tables or regular tables or booths.  Quality is pretty decent and pretty much exactly the same as Prince Sushi (see my review).  As with Prince Sushi, very reasonable prices for mid-level quality.  Food - Won't review the sashimi/sushi/maki since it is same as Prince Sushi and the Teppanyaki is probably why you are reading this anyway!  Sirloin Teppanyaki - Very tasty and flavourful.  Only issue is sometimes too much fat left on after cooking.  Filet Mignon Teppanyaki - Also tasty and flavourful and also no fat!  Salmon Teppanyaki - Usually done well and good flavour.  Shrimp Teppanyaki - Usually done well with garlic butter flavour.  Scallop Teppanyaki - Turns out nice with garlic butter flavour.  Chicken Teppanyaki - Usually done well with soy garlic flavour.  Service - Very friendly and responsive.  The servers are attentive and come by quite often.  The owner comes by and personally greets most every guest as well.... this guy works hard for the money!  Weekends are busy for Teppanyaki... much less busy on weeknights.  The cooks do the standard Teppanyaki tricks... so nothing new to seasoned Teppanyaki diners... but newbies and kids will love it.  Environment - Nicely appointed, dim lighting and intimate with sectioned off booths, tables and cooking tables.  In a strip-mall on the border of Mississauga and Etobicoke.  I would rank it higher than Yamato in Yorkville at a slightly better price point."}
{"text":"Fantastic!! The food here is really tasty. The service/staff is also excellent. I will be coming back"}
{"text":"This is a great little place. It's tucked away so you have to keep your eyes open, but when you finish the search you will be well rewarded.   The setting is wonderful. The food is fantastic. The staff is amazing.   This has been my favorite spot on this visit to Canada."}
{"text":"I've now been here for lunch and dinner the Teppanaki was so much fun we sat with our own family as well as friends and made friends with the other family this round table seats approx. 20 comfortably so everyone can see dinner being prepared.  Alot of food too much for me so little container went home for next night.  Thanks to Sonny for my anniversary deep fried icecream it was the best as was the service and overall experience.  We are planning another date there very soon, keep in mind you definitely need reservations for this little gem hidden away in the Etobicoke-Mississauga area."}
{"text":"My wife and me made a reservation for 8 pm on Sat.  When we arrived, we were waiting at the front for what felt like 5 min before a waitress came to see us.  Where the maitre'd was, I am not sure but one would think that Prince Japanese would have one by the front.  It was not a good first impression.  Then the waitress took us to the sushi bar where we waited for 40 min before being seated at the Teppanyaki table.  Keep in mind that we had a 8 pm reservation.  During the 40 min. wait, the host did apologize to us but no one asked if we wanted something to drink while we waited for our reservation to become available.  We finally were seated at 8:40 and ordered a couple of Teppanyaki meals.  The miso soup was good.  The seafood entrees were okay but I have had more flavourful entrees at other Japanese restaurants.  The rice and veggies were fine.  On the whole, the food was okay but I feel that Iron Chef in Mississauga has better tasting food and slightly better deals (prices) than Prince Japanese.  Their service is better and the wait is not as long."}
{"text":"I visited this reataurant in January'16 after quite a few years as I live further west of GTA . The Teppan was as  great as it was when I visited last. The service was quick, quantity could have been more but overall a good place to come  back. Lunch is expensive.. for 3 people with pops came to $60.but worth it if you are taking out special people:)"}
{"text":"Based on my job, there are about 4-5 sushi restaurants close by - and I love sushi, so I go out for lunch fairly frequently.  And although Prince is potentially my favourite, based on the price, ambiance, and staff, I don't go that often to be honest.  I think they are definitely pricey for their sushi - and to be honest I would compare it to other sushi restaurants in the area that are much cheaper, and their food is just as good.  I find the restaurant to be a little on the snobby side. Even though my husband loves sushi, he says he feels very ackward when he eats there, as he finds the clientelle to be on the snobby side. The staff is okay, but not as friendly as other places I've been.  The food is great, and very fresh."}
{"text":"Being from out of town, our friend suggested dinner at this place. I was pretty excited when I found out it's a teppanyaki place since I haven't been to one for a while & I was ready to see a show.  I have to say I was sorely disappointed by the \"show\" part.  Other than the opening where the chef spread fire across the grill, he didn't do anything else.  Since we came with a large group I got to try a lot of different things on the menu.  -tempura - good -sushi/sashimi platter (it was ok but not super fresh-wouldn't recommend it) -Teppanyaki (NY sirloin/filet mignon/salmon/scallop-all of this was just buttery & salty)  I would go somewhere else but I heard there aren't a lot of teppanyaki/sushi options in the area."}
{"text":"I worked in Toronto last summer and was a regular customer at this venue.  I've literally tried everything on their menu from sushi to teppanyaki.  I have to say that this is the only consistently good Japanese restaurant in the entire Etobicoke area.  Also, the staff were very friendly as well.  It's true that majority of the staff are Chinese but that does not compromise the authenticity of their cuisine.  In terms of sushi quality, I would rank them a 3...however, ambiance and customer service definitely added to my experience each and every time so I will rank them a 4, overall."}
{"text":"This place is amazing specially if you are seated at the teppanyaki grill and watch your food get cooked! Pretty entertaining. The food is delicious and worth the wait and price! We usually even have some leftovers and are always excited to have them the next day"}
{"text":"I would skip this place unless you're really craving sushi (or teppanyaki) and have no other choice.  We were seated quickly, but because the dining room was empty, as most customers were at the teppanyaki grill. Service was slightly condescending, but not overtly so. They even told us that the restaurant was closed at 10:45, after we'd paid and we're sitting, talking. The thing is, they state that they close at 11:00, and there was another table who were still eating. Not allowed to sit and talk after the meal?!  The food was just okay. Definitely nothing special. I had the sashimi dinner and it was ho-hum. The cuts of fish were not the greatest and the wasabi was not that good. My wife ordered the sushi dinner and we were asking if we could change some of the fish, but the answer was a stern NO.  If you ask me if I want to go back, my answer is also NO."}
{"text":"Is it possible to give a place 0 stars? I arrive at a nearby hotel and they help me make a reservation. After arriving 1 m late, they say they are no longer taking customers. Could they not say that over the phone? Terrible customer service!"}
{"text":"This place is wonderful. Their food is spectacular. I tried the Prince Dinner, which comes with Beef Teriyaki, Chicken Teriyaki, shrimp, a salad, and miso soup. The food was EXTREMELY fresh, EXTREMELY flavorful, and EXTREMELY delicious.  Others at the table got the sushi/sashimi plates, and I was definitely kind of jealous when I saw what came out.  The wait staff was attentive, friendly, and helpful. The beer selection was a bit lacking, but they did have a strong showing of hot and cold sake.  We didn't sit at one of those fancy tables with the flat-top grills in the middle, but we still got quite a show nonetheless.  Awesome stuff!"}
{"text":"I've been here multiple times and have enjoyed their food.   The reason why I'm giving them a 1 star is because after eating this afternoon we saw a cockroach run along the table.   When we mentioned it to the waiter and showed him the bug under a glass we used to trap it.   He made a joke and killed the roach.    We asked to speak to a manager to let them know of the possible roach issue and they weren't available to speak to us.   This was during lunch on a Monday.   Usually when you see 1 cockroach it means there are a lot more hiding.   The fact the roach was crawling from under the cooking surface along the table where we were eating was disgusting.   Included a picture as evidence."}
{"text":"If you're going to try teppanyaki, this is the place for it! Good ambience, affordable, and qualify food. We were given quite a show while the chef prepared our foods (tip: try and request an older chef, they seem to be more experienced and theatrical). I tried the special which included chicken, steak, and shrimp. All was cooked to perfection. I would recommend this place in a heartbeat to anyone in the area looking for a good bite."}
{"text":"A little on the pricey side ...   The sushi is not the most excellent - for the price - but its not bad.  My husband and I shared some sort of sushi combo platter for about $50ish ... we were not stuffed but decently full.    Decor is nice and classy.  Located in a strip mall in the suburbs - there is ample parking."}
{"text":"After we were seated, we waited an hour for someone to come take our order, then another 20mins for someone to come cook our meal. The waitress didn't seem to care that we were waiting so long, until we complained! The food was OK, but who can't make something taste good with a ton of butter and salt? The portions seemed a bit small for the prices you pay ($22 for the set menu). I had NY sirloin and scallops, and both were mediocre. The scallops were salty, probably to hide the fishiness. The only reason they are getting 3 stars instead of 2 is because my husband got free ice cream for his birthday and we got a sorry for the wait on the way out. I don't think I'll be coming back again."}
{"text":"I've been going here from time to time as it's the only decent sushi restaurant close to my office. I went again today and had a fairly unpleasant experience so I thought I needed to share it. The sushi quality is mediocre at best. I ordered the chirashi special which claimed to have a fine selection of fresh fish... But when my meal came out there were mostly pieces of tamago (egg), fake crab and shrimp sitting atop a bed of rice. No salmon, no tuna... Maybe one or two pieces of snapper but that's it. I was disappointed as the price was almost $20.  The service was horrendous. We had to wait at the front for more than 10 Mins before anyone came to help us and the waitress was so rude when we asked for basic items like soy sauce and chopsticks.  I hope another Japanese restaurant opens up so these guys have some competition because people only go here out of convenience and lack of choice."}
{"text":"Not from the area and visited this restaurant based on reviews. The place was clean as a whistle, staff was friendly and the food was just fine. I would recommend this place and I would certainly try it again"}
{"text":"With a suggestion from the nearby hotel I stopped in for a late dinner. The strip mall was a bit off putting but the inside of the restaurant was very nice. They have some intimate rooms with seating, tables in the main dining room and another separate room with seating around the cook top for the 'steak house' portion of the restaurant name.   I opted for a few appetizers for a sample of what they had to offer.  The chicken skewers were very most. Not over powering with sauce, as they put it on the side. The salad was good; iceberg lettuce and some shaved carrots. The tempura veggies were a bit on the greasy side; onions, mushrooms, potato and green beans. I didn't care for the dipping sauce that came with the veggies however they went well with the sauce that came with the chicken.   The service was quick for me. Maybe due to my take away order, I'm not sure. Next time I'm staying at one of the nearby hotels I would come back to Prince."}
{"text":"It would of gotten 4 stars if the chef didn't drop my steak on the table while trying to put it on my plate. Instead of leaving it there he continues to put it back on my plate even though it touched the poorly cleaned table. How was it poorly clean? Well I can see the water marks when it was previously wiped. I just ate it because I didn't want any trouble on my Dad's and Brother's birthday. I also ordered normal rice which it took longer to show up since I was the only one at the table who didn't order fried rice. I really wanted to like the place but eating food that fell on a table killed it. Next time the cook should of used his head and leave it there. They also forced us to pay minimal 15% percent tip.o"}
{"text":"Always end up here when looking for the right place to have a dinner. The food is great and the cooking show is always a great add on to a regular dinner out.  The place is unusually busy even on the weekday nights."}
{"text":"Just ate here and was unfortunately disappointed with the experience. When dining Teppanyaki I believe you are paying for an experience and included in that experience is the \"show\" the chefs do. If the full experience is what you are looking for this is definitely not the place for you. The chefs came out cooked the food with minimal interaction and left. The upgraded fried rice was an absolute rip off and the way the staff pushed you out to get another turn on their table was a bit rude.  Their one saving grace was the food was pretty good.  I would definitely think twice before eating here again"}
{"text":"I use to come here often for lunch and dinner because food, service and price were all good.  Recent visits have been disappointing: Bad service Arrogant & pretentious staff including owner Food not fresh Very expensive (set price minimum)  Sad to see another resturant forget \"you are as good as your last meal\""}
{"text":"I have dined here about 10 times now over the years.  I am finally writing my review but have held off from doing so for so long because of my decision on how I wanted to write it.  Like the book you didn't like but kept on reading it.  This review is not for the Teppanyaki but for the Sushi side of the restaurant.  I've had the Teppanyaki here before and I have to say that they do try to make a show of it and it is decent.  A reason why this place is so popular with those not from Japan.  It's really a westernized form of Japanese food that is entertaining for the customers to dine at.  Sure this is why Teppanyaki or Japanese steak houses do so well.    For me however I prefer the simpler forms of Japanese food and sushi is not it either.  Sure you can be wowed at the variety of sushi rolls and the colours and flavours but is this real Japanese food I ask?  No, not really.  Yet I can't figure out why people love this place so much. Okay Okay, I can be very picky when it comes to this form of food.   Here is why I am not agreeing with most people here. I had the Prince Special which was a mixed grill of meats and veggies panfried with the typical Japanese soya sauce and sugars and it came with a salad.   I didn't take a picture of the salad, it was pretty anemic and sad looking.  However, it did taste good; 2.5 stars.  Presentation I'd give them a 1 star for that.  Sorry for being so harsh.   The meats and veggies did taste quite good. I'll give them that. If I had that unexperienced Japanese pallet I really would have enjoyed it like my friends did.  Sashimi, there wasn't much on the menu. I don't think I found anything and ended up asking for whatever they had to suggest.  I gather the customer base here are not the sashimi type of diners and maybe this is because it's Mississauga and not Toronto and it's near the Airport where you get a lot of tourists...  We got hamachi, toro, salmon and the much well loved \"butter fish\".   I heard stories of butter fish which could result in unwanted \"leakage\" if you consumed too much.  The limit should be 4 slices?  I had 4 slices at least.  Hmmmmm I won't say what happened.  Sushi, is decent.  Lots of special rolls for those who like to eat sushi, but really don't like raw fish and want to disguise it with other things. You'll see those diners dousing their sushi in a lot of soya sauce and wasabi.  Regardless of my review, people will come here and simply love the place.  Moreso for the teppanyaki side than the sushi side.  Still it will be here for years to come as this is a staple for Prince fans who constantly rave about this place.  I really don't understand why to be honest.  One thing I do have to write is this is not Japanese.  I don't think I saw any Japanese people there working and to be honest?  If there was a Japanese cook in the kitchen they wouldn't serve the food the way it looked.  There should be that sense of pride."}
{"text":"My first time in a hibachi grill theme restoraunt for my 18 or birthday. I love this place. The chef was fun and gave a good show. While making delicious food. The staff is friendly and does a good job. Dinner and a show this place awesome I loved it."}
{"text":"I hidden spot along Eglinton in the industrial area  It is a dated decor so you do get the old Asian restaurant feel overall the experience was not bad the food was excellent it was seasoned great they made everybody's steak according to how they wanted it they didn't overdo it or under do it  I will say after going to a couple restaurants like this that the chefs don't really put on which of the show they do half a trick I wouldn't even call it full tricks they're not really into that they're more just cooking your food exactly how you needed to be and it does taste great so I'm not upset at how it tasted but if you're looking for a show that's not what you're going to get here   The restaurant itself was extremely hot everybody at my table was really hot there was a couple of us were wiping our sweat Fanning ourselves it was a really hot day outside it was over 30 degrees but still it was really uncomfortable being in that setting"}
{"text":"Very nice evening dinner. The steak and chicken dishes are great and also the dynamite rolls were very good."}
{"text":"I'd say that this place is more like 2.5 stars but I'm feeling generous at the moment.  I wasn't expecting much from the outside but it's lovely when you walk in. There is a little water feature at the front with fish swimming around. The decor is chic white and black.  We were there for a late afternoon lunch. The staff, while friendly enough, didn't seem too attentive. I realized quickly that it was also their lunch time when all of them sat down around the sushi counter to eat. On the way out we also noticed that they close between lunch and dinner. Whoops.  The food was just ok. I ordered a sushi lunch box ($16.99 if I remember correctly): 8 pieces of sushi and 1 California roll that came with salad and miso soup. The Cali roll wasn't very full or fresh - seemed to be made well in advance. The sushi pieces were alright but nothing special. Not really worth the price they charge.  While this place isn't \"bad\", I don't expect there to be any reason that I would ever give it another shot."}
{"text":"Loved this place! Must go back! Table bbq, sushi, great sizzling steaks and seafood at affordable prices. Customer service was phenomenal, prompt seating and great food. I wish it was closer I could eat here every day."}
{"text":"This place is great. Nice little teppanyaki show and delicious food. The filet and seafood are amazing. The sushi is great as well.  The parking is a little tricky if you go on a busy night but it shouldn't be too much of an issue.  Overall it's a great place and highly recommend. Always fresh and a great atmosphere."}
{"text":"From the outside, this place doesn't look like much and you'd almost miss it in the strip mall if you didn't know about it. Inside, it's pretty large, clean and modern, and accommodates a large amount of people. I came here for a business lunch and it was a great experience.  I'd suggest getting the sashimi vs. the rolls, but that's usually my preference whenever I have sushi. I don't really like too many competing flavors in the rolls, or lots of sauce / mayo. The sashimi lunch platter ($13.95) was a good choice. The fish was fresh, the pieces were not skimpily cut, and overall, delicious.  The roll selection seemed a bit heavy on the sauce, or were fried, and I wasn't overly impressed with the roll that I got. It was good, but nothing that I'd want to get again and again.   All in all, a solid place to get sushi. I would definitely come back."}
{"text":"Food is good, descent portion sizes, good quality and not greasy. Chicken, steak and shrimp are all good options. The service is not good, they rush you right from the beginning, they try to push you off the table to seat the next seating so you constantly feel rushed."}
{"text":"About eight of my colleagues and I had our Christmas lunch at Prince Steakhouse and what a great experience! We sat at one of the Teppanyaki tables and really enjoyed the entertainment. I had the Sukiyaki with Japanese fried rice and it was very enjoyable. The veggies were crisp, hot and cooked to perfection. Even the Miso soup had so much depth and flavour.  The restaurant sees a lot of business so I would really recommend making a reservation. It's also very affordable for the experience/quality received."}
{"text":"Made a reservation for 8 pm. Ended up getting seated at 830. Not cool. Took another 20 minutes for the waiter to come and take our order. Was stuck sitting beside 4 kids aged 1-8 but tried to make the best out of it. I was kind of confused on how these kids are having dinner at 9. Anyway, they forgot the miso soup part of the meal and there were very little veggies. Service was extremely slow and didn't end up eating until 930 a full hour and a half after the reservation. Asked the filet to be cooked medium rare but it was more like medium well. It was still tender though. All in all would never come back here due to the lack of service and poor atmosphere. It's like a poorly run Benihana."}
{"text":"This place looks posh, but you'll find some customers dressed up and some going casual. The decor is mellow and dark and elegant. You could go there dressed up after a special event, or you can mosey in spontaneously like we did. There's a teppan table but we were just there for a quicker dinner.  The menu has lots of options even if you don't like sushi -- there's tonkatsu and teriyaki as well as some creative things done with raw fish.  As a vegetarian I wish there were a few more meatless choices. I went with the vegi maki dinner, which promised tempura sweet potato rolls -- my favourite -- although I wished I could have had that roll a la carte.   I don't find sushi satisfying unless the ingredients are balanced well and the rice is really good. This was good stuff. I was not disappointed by the sweet potato. The veggie futomaki rolls were a bit over-large and needed more fresh ingredients (and fewer slippery mushrooms, oshinko, avocado, etc.). The rolls that I expected to be filler -- plain oyster mushroom, and lettuce-and-tomato (which I wanted to call rabbit-food rolls) -- were great, just because the ingredients were tasty and the rice was very well done. The sushi craving I've been nursing for a few weeks is gone, for now.  The service was efficient, impressive since one waitress (with occasional busser help) was taking care of our twelve-person party. One of us had to send back his beef because it had butter on it and he can't eat dairy (he didn't ask ahead because who expects butter on beef in a Japanese restaurant, anyways?), and they replaced it quickly and without a fuss.   There are a few Japanese beers, a small selection of wines, and when I come back with more money I'll have to choose from the sake or plum wine list, or maybe get one of the sweet fruity house cocktails.  Points off for not having enough veggie selection. Otherwise, these folks know what they're doing, and I'll be back when I'm in the area again."}
{"text":"An Legend in Toronto's west side.  A place that has been serving Japanese food for the longest time.   When you look at this place from the outside you would not give it a second glance. And even if you walk into this place the decor and the layout represents a decade or 2 since it has been updated.   So let that be the faults of this place.  The food is excellent.   From the sushi to the tempura.  The freshness and taste is spot.   I ordered the steak and it was prepared with pure tenderness.   The tea they use here is with full flavour and not out of a bag.   A classic tradition still keeps moving forward.   Recommended if you are in the area."}
{"text":"Came here for the Teppanyaki experience at lunch time with the office. I ordered the salmon (+~$13?) with fried rice (+$3!). We had one entire area of the stoves (party of about 18)... we had a less experienced chef on our side and he did not do any tricks or interact with the guests like the other chef did. Pricing wise, quite expensive as I would've expected egg fried rice to be part of the package...otherwise, the normal lunch comes with a bowl of steamed rice.  Needless to say, the food was pretty good, portions are plenty.  Finished my meal with a nice frothy cappuccino.   My clothes, hair, jacket did smell of oil for the next few days.. could use some better ventilation."}
{"text":"The service here was really good. Our waiter was cheerful and quick when we needed something from him. The chef for the teppanyaki table was fun and definitely entertaining. He made jokes with us when he realized we were taking a few videos of him.   The food was delicious but after awhile, tasted too salty. I had the daily special which was chicken, steak and shrimp. Chicken was awesome. Steak was perfect and I loved how he cooked for 6 ppl at once but didn't forget how each one of us like our steaks and cooked accordingly. 3 pieces of shrimp that weren't over cooked.  Overall, a great experience and free deep fried ice cream for my girl cuz we were celebrating her birthday! Yum!"}
{"text":"Great teppanyaki bar, very entertaining!  Food is amazing, great fried rice and can't go wrong with any of the meat and seafood selections!  Sushi is always fresh, one of the best in the city!"}
{"text":"Had the chicken and shrimp teriyaki and it was great. The show was fantastic and they even involved myself and a few others in some of the grilling.  Will come back for sure"}
{"text":"are you into high class?.. I would say this restaurant was definitely classy/casual, I mean coat check and everything. I was quite impressed with what I saw here.   you see this plaza and you never Imagine. The all time saying is don't judge a book by its cover and for this place that is truth.   to be honest I was eyeing this place for a long time before I actually got to try it. It was great, and It is my favourite. I am so excited to say that my birthday is in June and I am already planning for a teppanyaki dinner with my family here. like really? who plans a birthday dinner 6 months in advance, lol clearly I do.   I have the shrimp, chicken, and beef with rice and veggies and everything was amazing, I finished the whole plate clean, it was that good! my fiancé who I was with was in love as well and he had the sushi platter, with sashimi and rolls and such. The fish was fresh in taste and prepared and presented so elegantly.  I will definitely be back!!!"}
{"text":"My rating is 3.5 stars.  I visited Prince Japanese Steak House a few months ago. I came here with a few of my colleagues for lunch, as it's only a ten-minute drive from the office. My manager made the reservation for the six of us. We had to arrive at 12:15 pm sharp.  I drove a handful of us there. Parking gets busy in this plaza. It doesn't help that there is a Service Ontario in the plaza and nervous drivers are trying to pass their driving tests! I found a spot and we went in.  We went for teppanyaki, so we shared a seated area around the grill with several other people. It's fun to see the chef cook up your food. He did the onion volcano, full of fire and pizazz. My colleagues looked like tourists, recording the action on our phones. Hey, why not?!  I ordered the scallops and sirloin, which comes with salad and miso soup. It was good, but it could have had more meat. It didn't help that a sirloin morsel fell off my plate when the chef placed the food on my plate, and my manager snatched it from the table and ate it. Really? Yes, he did!  The scallops were yummy. They were done to perfection. I am salivating just thinking about them.   I like vegetables, although I wasn't crazy about the zucchini and onions. I need more protein and vegetables that I like. I do live bean sprouts and ate all of them.   It was a good experience shared by everyone on the team. We got to chat and talk. I would go back again, but would order more food.   (26)"}
{"text":"My girlfriends and I went to Prince for the first time this past Friday night, to celebrate my birthday. I was very excited because there isn't, to my knowledge, any other teppanyaki restaurant in Etobicoke and they have good reviews on yelp. The restaurant is very nice inside and has a very pleasant atmosphere. I think it's great for families and for date night. There are about 6-7 teppanyaki tables that can easily seat about 20 people, so very comfortable.   The food was great and the show was excellent, I mean our chef stabbed an egg in mid air and it landed on the hot table perfecty, no mess. That was awesome.   However, we felt rushed. Once we were seated, the food was prepared and served within 20 minutes from start to finish. I've been to other teppanyaki restaurants and it's usually a slower dinner, where you get to enjoy each item one at a time. It makes for a better overall meal in my opinion.   Apart from that, I'm definitely going back with my family."}
{"text":"Compared to other teppanyaki places, the food here was pretty good. The staff was friendly and attentive. The chef was nice and did a couple of tricks, but overall, the \"show\" part of teppanyaki wasn't that great.   Since I was in a group, I had the chance to try a bunch of their foods. Had the beef enoki maki, green dragon roll, miso soup, salad, and the choice of 2 meal (had steak and scallops). The way they cook makes good food without too many complicated flavours :)"}
{"text":"Poor tasting food and even worse service.  I was never asked if I wanted water, I was never asked if I wanted a refill.  Woman just looked at me as she served and offered all those things to the table next o me.   The sushi and sashimi are far from fresh.  I feel like I will be ill tomorrow - though I didn't eat much past the first bite.   I definitely won't be back."}
{"text":"My co-workers have a debate on weather this place or another place in the area is the best place to go for sushi near the office.  My opinion is that this isn't the place.  You can tell that they are set up for the business lunch rush as when I received my sushi platter it was not fresh.  You could tell that they have trays of each type of sushi waiting in the cooler to be put on a plate.  Next!"}
{"text":"This place has never disappointed.  IN a strip mall placed what seems like randomly, it's the attitude, if you build it they will come.  IN fact I think the other resaurants that have popped up in this strip mall are there just to handle the overflow from this place.  The menu us priced very reasonably.  Lunch- even better- recommend the pork tonkatsu bento box!  They offer sushi, table service ro teppanyaki.  Teppanyaki has a nice show feature to it, is a good option for lunch because it is well timed to be in and out under an hour.  Décor is lovely.  Very clean, well maintained, and guest friendly or business meal friendly.  It can get very loud at lunch.  Reservation highly recommended as this place seems to be uber busy all the time."}
{"text":"Great ambience and food quality.  Weekdays the place is busy during lunch time as there are lot of businesses around the area and very popular for office lunches.  Reservations recommended.  Try it out and you won't be dissatisfied.  Cheers."}
{"text":"I've been here a few times for the teppanyaki as well as the regular lunch dining. Teppanyaki was a little underwhelming, but that may be because most people come here for business lunch and aren't paying attention to the chefs. The teppanyaki food was okay. Nothing special. For regular dining, I usually order the chirashi. Although it is tasty, I find it expensive for the portion and quality of food that you get. Given a choice, I'd go somewhere else but there aren't many sushi options in this neighborhood."}
{"text":"This is a wonderful place to bring a group.  I came here with my family for the Teppanyaki and it was great!  We had the rice wine and they also have good cocktail options.  The cooked food options are prepared right in front of the group.  They also have sushi options that are prepared in the back.  I ordered the filet minion and the chicken teriyaki.  It was exciting watching the cook prepare the meal.  The sizzling sound teased our appetite.  First they cook the rice with eggs,  then cook the meats, and then cook some veggies.  The smoke quickly escapes in the big vents in the ceiling.  When they cook the onion they make it into a volcano shape add oil and it creates a big flame!  It's cool to see. The cook was fun to watch as they quickly moved around the spatulas and tossed the food around and eventually into our plates.  They meal was good, not the best but you do get a show as well and the prices are reasonable.  Some ordered the salmon and they were surprised to see they got two big pieces.  This place is worth it for the entertainment for a group.  It isn't a place that everyone in the group can conversation because the chairs are in line around the table and you would just talk to the people beside you, but everyone enjoys the show!"}
{"text":"Recommended by the hotel concierge.  Hibachi was good. We had filet, chicken and shrimp. Vegetables were cooked to perfection. Overall our dinner was good, great for large parties, fun place for family dinner. Great service. Sushi was on the menu. Would like to come back to try other items on the menu."}
