{"text":"You know that feeling when you find out that one of your favourite microbreweries is opening a new pub in your neighbourhood, like, right across the street from where you live? Yeah, it's kinda like that. 

Pit Caribou has only been open for a few months, and already it's become a regular hangout. The tap list is fabulous, with Pit Caribou's regular and rotating seasonal selections often making way for tap takeovers and special events. (Iceland invasion, anyone?) They usually have a selection or two on cask, too. The nautical-style decor is fun and comfy. The pub is pretty much always crowded, with good reason, so come early if you want to get a table. 

The only thing I'd say is that I wish they had a bigger food menu, since after spending a few hours there I usually am hungry for something more substantial than the Gaspesie snacks that they have on offer. But for a 5-a-7, this is basically the perfect pub."}
{"text":"Cette bière, ces gens, ce lieu.

Tout ça c'est OUI.

On était 4, on a eu une banquette, on était heureux. On a pris des bières (stout au café, session brett, blanche), on s'est fait servir vite et bien et sympathiquement, on était heureux.

La musique était bonne, y faisait chaud mais on a fini par ouvrir une fenêtre et on était heureux. 

Allez-y, bref, seigneur, allez-y!"}
{"text":"Beer is almost an afterthought here. Incredible space and layout, extremely unique and comfortable."}
{"text":"Excellente bière!!! Parmi les meilleurs microbrasseries du Québec. Le seul problème c'est que c'est trop plein la fin de semaine. Trop petit pour la qualité du bar."}
{"text":"I was in Montreal for four months in the plateau. If you want a place to just 'doyourthing' this bar is so welcoming most delicious beer"}
{"text":"Pour boire de la bonne bière, c'est la bonne place. 

Le menu est original. On avait déjà soupé, alors on a seulement essayé les chips d'algues. Il y avait des planches qui semblaient intéressantes. C'est aussi pas trop loin de la banquise. 

Les amateurs de bières connaissent déjà la qualité offerte par cette microbrasserie gaspésienne. 

Le service est rapide et agréable. 

Le décor est étrange. Il y a je crois une tentative de reproduire l'effet de la mer et d'un bateau avec les banquettes, les filets et le bois qui donne un effet rustique. La moitié du plafond est par contre non décoré. Il y a aussi un panneau qui affiche la biere comme une casse-croûte qui ne fit pas avec l'effet rustique.

Malheureusement, il n'y a pas de terrasse."}
{"text":"Went there for Icelandic Invasion which brought in some guest beers. They were great and actually enjoyed them more then the house beers. Couldn't comment on the cost because I split before the bill came & left it for my brother to pay. 

Overall the place has a great set up and vibe. Fills up quick so get there early. Will be back."}
{"text":"We really enjoyed our evening!  This was such a chill place for a drink.  

Service was pretty good.  The server did his best to explain some of the menu items since my French is only so-so.  

Nice decor: retro industrial.  Dim lighting, cool fixtures,...  I liked the set up of the bathrooms.  

Plenty of beers on tap.  Variety of alcoholic drinks that aren't beers.  Lots of non-alcoholic choices for those who are deemed designated drivers.  

Although I didn't try the food, this place is definitely worth a return visit.  

I would love to sit in a booth/banquette next time!"}
{"text":"Great place for a few drinks after a nice winter hike (or XC ski adventure). Highly recommend the apres 8 heures and kriek porter. Honey crisp sour was very unique as well. Great atmosphere. Highly recommended!"}
{"text":"Good beer, comfortable layout. Beer isn't cheap and you get what they make. Luckily it's very tasty and there is a variety to choose from!"}
{"text":"Bière bière bière bière bière bière bière bière bière bière bière bière bière bière bière bière Bière bière bière bière bière bière bière bière bière bière bière bière bière bière bière bière Bière bière bière bière bière bière bière bière bière bière bière bière bière bière bière bière. Bière bière bière bière bière bière bière bière bière bière bière bière bière bière bière bière. Bière bière bière bière bière bière bière bière bière bière bière bière bière bière bière bière. C'est la meilleure bière et l'ambiance est excellent!"}
{"text":"This space has had several pretty good bars in it before Pit Caribou arrived. And having enjoyed several drinks in those places, I can say with some authority that Pit Caribou is even better than what came before. We have been here twice and really enjoyed the relaxed vibe here, and the beer is quite tasty as well. During the day the space has a lot of light and if you enjoy a drink during the daytime hours I highly recommend it. The downstairs bathrooms are nicely done and add to the experience. The last time we went, we sat on a raised platform at the back on two rocking chairs which was a high-class way to knock back several pints. 

The only draw back is that we used to live a couple blocks away - and now we live in a different city, so becoming regulars is harder to pull off."}
{"text":"Pub très sympa, cozy, ambiance chaleureuse avec des petites tables en bois ou des espaces arrondis, idéals pour des petits groupes.
Bière très bonne, la blonde goûte vraiment quelque chose, j'ai beaucoup aimé.
Plateau à partager avec saumon, maquereau et bulots très bon, servi avec du pain. Pas super copieux mais comme apéro à grignoter ça va.
Pas assez de choix de bouffe à mon gout, dommage :(
Service très agréable (serveurs très polis et souriants) ms lent au bout d'un moment (nous étions vendredi soir, et nous avons attendu longtemps pour de l'eau et du pain..)
A essayer!"}
{"text":"Big fan of this place! To start, I love the decor. They have an ocean/sea captain theme which I really dig. The darker colours make for a very warm environment, and I think it will feel very cozy in the winter. The lighting is a bit low at night, making the menu hard to read, but that contributes to the warm and fuzzy feeling of the place.

The beer is quite tasty. My absolute favourite so far is the Robust Porter. It is a sweet, chocolatey porter served on nitro - one of the best of this style I have had! I also quite like the Witbier. Some of the special beers have been slightly underwhelming or not exactly what was expected, but it is perhaps typical that the classics are most on point.

I haven't had any food items yet, but I am sure I will at some point and will report back!"}
{"text":"Great bar. They opened a month and a half ago, and I have a feeling I'll be frequenting this fantastic establishment often. I came here for after dinner drinks with my family and got a chance to introduce them to Quebec beer from Gaspisie. The waitress was very kind and patiently explained some of the menu items since our French is not too too good. She was very knowledgeable and made excellent recomendations. My dad and I got Pit Caribou beer on tap (I had a nice and hoppy ale) and my mom and my partner got a couple of ciders. I tried my partner's cider, which was lemony and minty, and a lot of fun to drink.  The place wasn't too packed, so it was nice and quiet, with cool music playing in the background. Great for conversation without any strains! Really, that's as good as it gets for me!"}
{"text":"We came upon this pub quite haphazardly. I have to say that this was some of the best house beers I've had.  We even went to look for bottles to take home. The waiter was so nice and helpful.  I can't wait to go back.  Try the tasting. You can't go wrong."}
{"text":"Belle petite place sympathique.
Décor vintage avec un certain charme.
Bières sont bonnes! 
Une place à trainer un après-midi d'été!"}
{"text":"Here's my unusual experience with Pit Caribou beer - I received a bottle with a custom made label featuring my image as thanks for participating in a recent event called Montreal Swing Riot. It was stunning. Every single participant of this Crossover Battle received with their likeness.

I transported it back to Colorado yesterday and finally sampled it. It was delicious. It was a gorgeous brown color with some caramel and malt tones. Really impressed with the beer and labeling. Cheers!"}
{"text":"Clearly one of my favourite bar in Montreal. They have a great selection of their own beers (regulars and seasonals) plus different lines of other gaspésie breweries. 
Lovely staff, lovely ambiance, sometimes they have a DJ on Saturday night. Otherwise music is good. 
Maybe not the best place for a cocktail fanatic, but they have a decent choice of Quebec liquors."}
{"text":"Pit Caribou, un peu de Gaspésie sur l'ile de Montréal et ce n'est pas pour nous déplaire !

Cela ne sert plus à rien de présenter les bières connues et reconnues dans le milieu. Maintenant il est possible de les déguster dans un pub tranquillement et ca c'est la classe. 
L'endroit est bien agencé, il y a de tout, petites tables, banquettes et canapé d'angle/arrondi pour se poser à plusieurs.
Le choix de leurs bières leur permet de nous proposer différents formats de verre. Ils possèdent aussi bien sur d'autres bières en bouteilles voir en fûts.

Ils possèdent aussi un tout petit peu à manger mais cela semble bien maigres pour y faire un repas. Plus pour éponger vos litres de bières :)
2 planches actuellement, une de la me et un de la terre qui regorgent de produits locaux. Malheureusement pas de végé, d'où l'étoile numéro 5 qui a disparu de ma note.

Au niveau de l'ambiance je dis bravo, passer en musique du Foo Fighters et de l'Arctic Monkeys cela démontre des bons goûts musicaux :)

Enfin bref un très bon endroit pou boire une bonne bière et passer un moment agréable avec des amis ! A conseiller particulièrement aux amateurs de bonnes bières de micro."}
{"text":"Oh this sweet bar! I'm such a fan! I loved this location back when it was Les Pas Sages but this is better in some ways: better list of local delicious beers, beautiful booths by big winds and other comfy seating options, not empty or over crowded, incredibly friendly funny bilingual staff, and the snacks looked tasty too!"}
{"text":"Ah voila encore une bonne microbrasserie de Montreal. 
Je dois avouer qu'à force de faire des microbrasseries je ne cesse de découvrir de nouvelles bières et de nouvelles microbrasseries toutes aussi bien les unes que les autres.
Chez pit Caribou plusieurs choses m'ont intéressé :
- Le cadre est très sympa avec une belle déco.
- Le personnel pro et qui connait bien son sujet donc de bon conseil.
- Le bar est bien situé et facile d'accès 

Le petit bémol c'est pour ce qui et de manger ou grignoter quelques chose car ici c'est compliqué...heureusement il y a pas mal de truc autour. Ca mériterai de proposer des nachos ou autres choses simple.  
Bon il faudra que j'y retourne car je n'ai pas essayé toutes les bières encore."}
{"text":"excellent place for beer, very nice relaxed atmosphere and stellar beer, every city i go to I hope they have a place like this."}
{"text":"Pour avoir déjà été au Pit Caribou Gaspésien, j'avais bien hâte d'aller tester le nouvel emplacement montréalais ! 

Nous étions un petit groupe, et nous avons été facilement assis. Pour ça, c'était super! 

La bière était excellente. Puisque nous étions l'été, il y avait une grande sélection de bière gose et elles étaient excellentes, telles que je les connaissais. Pour les prix, ils étaient élevés et les verres plus petits que ce que je suis habituée à voir dans les microbrasseries. 

Même si le décor était intéressant, j'ai trouvé que c'était un peu 'vide', voir inconfortable. 

Le service était bien, le serveur très gentil et connaissait très bien ses bières. Pour les factures ça a été p'us compliqué, mais pour avoir travaillé longtemps en restauration je sais que ce sont des choses qui arrivent avec les groupes. Et sa gentillesse a tout effacé. 

Ça vaut la peine d'essayer, mais comparativement à d'autres microbrasseries ce n'est ps l'endroit où je retournerais."}
{"text":"Une bonne adresse pour plonger les nouveaux arrivants dans l'ambiance de la ville ! On a trouvé de la place direct alors qu'on était 4 un vendredi soir. J'ai gouté une blanche délicieuse !"}
{"text":"Most of us would hardly find time to travel to Gaspésie and surroundings. Well if you are in Montreal you will get some taste of it in Pit Carribou. 

Delicious beers. I started with a flight of four of the Pit Caribou's classic brews. You have also an option for flight of the five classics and one special, but that was a little bit too much to drink on Sunday at 5pm. Then some of us exhibited interest towards the strawberry visiting beers from Le Naufrageur, A la bourdages won the competition with Strawberry Field in my view although it is a relatively strong one. 

Food wise it gets even better, simple menu offering some delicious options from the same region to snack on and two beautiful platters, one of them sea food based, which is kind of rare and nice.

Friendly and attentive service. Overall comfortable pub that will make every beer lover happy."}
{"text":"Cute place, with delicious microbrews and a super nice service (the waiters will bring you some water before you order anything, just because!). It's a bit loud, a bit dark, very friendly. And apparently if you like beers, it's the place to go.

If you don't like beer however, life will be difficult for you (but it's your fault, since you don't like beer). There are some ciders, but all Quebec-style (= not at all as sugary as in the US) and no proper wine. I don't think cocktails are their specialty either. Drink beer or go thirsty!"}
{"text":"Came here with my boyfriend on a Thursday and it was pretty lively and provided a great vibe for a week day.  

We walked in and stood there for about 5 minutes waiting for someone to seat us. There were 5 people on staff, none of whom said hello or even made eye contact with us. We just sort of gave up and sat at the bar where we were continued to be ignored (seriously, we were laughing because of the ridiculous amount of time that was passing!). Finally we were acknowledged and ordered two blonde de l'anse. 

We came here excited and expecting to learn something new - about Gaspé, about the brews  - but nothing was explained to us and the service was so unfriendly that we just quickly drank our beers and left. 

Their prices are reasonable - even cheap, but I was really disappointed in my overall experience."}
{"text":"Premièrement le pit caribou est ma micro brasserie de prédilection, la rousse est la meilleure que j'ai pris. J'ai été un peu déçu du décor surtout au fond du bar,le logo incroyable. Super ambiance pour un vendredi soir. J'ai passé une belle soirée à conseiller. 8/10"}
{"text":"J'adore cet endroit. J'aime pour l'ambiance et les bonnes bières locales. Les snacks avaient l'air très bien mais je n'ai pas eu la chance d'y gouter."}
{"text":"Nouvelle micro-brasserie gaspésienne qui débarque sur le Plateau ! Assez winner, ça fait du bien de voir des bières de régions débarquer à Montréal. Ils ont plusieurs bières de qualité, de styles IPA, porter, blonde, rousse et blanche. J'ai bien aimé leur Porter Gaspésienne No 13 à 6.2% (7,50$ la pinte). Pour ceux/celles qui n'aiment pas la bière, ils ont quelques cocktails, rhums, whiskys du gin du Québec ainsi que de la vodka québécoise. Au niveau bouffe, ils proposent, 2 planchettes, une ''terre'' et l'autre ''mer''. J'ai pris la planchette du St-Laurent (19$) contenant algues séchées, saumon fumé, tartinade de saumon, bourgot et poisson séché. C'était frais et délicieux, mon amie et moi, sommes régalés. C'était un vendredi soir, bien rempli comme place, même trop, ça débordé et c'était bruyant, on avait de la misère à s'entendre, victime de leur succès. D'ailleurs, ça manquer dans le coin, une bonne micro-brasserie. Clientèle dans la vingtaine. Bien aimé la déco avec le bois. Le personnel était un peu froid et brusque avec les clients mais ça devait être à cause du monde. Je reviendrais un lundi ou mardi quand ça sera plus tranquille pour savourer leurs bières en paix.

4/5 visité en juin 2016"}
{"text":"Lovely service and a good place to have drinks with a group of friends. I like their beer selection and their prices are surprisingly low. I had a cider and it was one of the best ones I've tasted recently. Their bathroom is so cool, I like how they came up with funky decor ideas.  It's definitely a nice local place so if you're in town, you may want to check it out."}
{"text":"Pit Caribou is a fun place for a beer. The vibe is young and lively. The service is fast and friendly.

I was here just for a quick drink to kill some time. I like what they offered and their line up of beers is solid.

Love the different seating options. Great for groups, couple and even single at the bar!

Worth visiting if you are in the area!"}
{"text":"I read some of the 5 stars reviews and I guess I had a different experience. 
The good:
Great location, a little load but cool atmosphere, loved the small booths, loved the toilet surprise (trust me you will go there you will understand) and the beer was also nice (Yes it is a microbrewery but doesnt mean they automatically make amazing beer. it was 4/5 I would say).

The bad:
Beer isnt cheap, if you go to Dieu de ciel or the new Si boire you get an amazing beer for less. The beer as I said is good but not amazing. and finally the food. They have almost no food (especially veggy options), when I asked about food and fries the guy told me there are a lot of places near by so I understood I can bring food there (like they do in other bars), well after bringing a poutine he told me I can eat it there...so annoying.. 

Bottom line, good beer and a nice atmosphere I guess I will come back if I am in the area but most chances I wont...."}
{"text":"Super beer and great food from eastern Quebec."}
