{"text":"This place is great! It's really cheap (money wise) but the food and drinks are on point."}
{"text":"Best dive bar in the area. I've been coming here for years and it's like a family.  It is a DIVE BAR .. Therefore you will get the dive bar experience. All the girls working are amazing beautiful bartenders , prices are unbeatable , food is great!"}
{"text":"Cheap beer decent food. You get what you came for in this place. Can get loud but that's to be expected from a blue collar dive bar"}
{"text":"Came here after golf on a Yelp! recommendation. Really good bar food. Love this dive."}
{"text":"Ok, seriously, talk about a dive.  My dad has been coming to this place religiously for a few years so about a year ago he dragged me along for our weekly dinner. It's the kind of place that you could totally walk right by without noticing it's even there. Walking in is like stepping back to the 80s with the dark atmosphere, old school (legitimately) bar decor, classic rock (if the games aren't on), and the beer flags. They've got an area with tables and booths, the bar seating, and a couple pool tables in the back. You'll see all types in here, too: young 20-something's, biker types, quiet guys at the bar, families in the booths...  This is all great but sadly, I think the last time the bathrooms were cleaned was in 1980, too. It's strange that this is the case because the rest of the bar and kitchen is immaculate.   They only have one small little griddle for cooking all the burgers they bust out but they clearly have a great system down. Every time I've been here the same cook was working and the bar staff consists of maybe three or four women. Fairly often the owner Terry is in and that's always a treat. He's so personable and so on top of things. It's hard to serve a beer as speedily as my dad can drink it, but Terry is always Johnny-on-the-spot and most of the other staff are pretty great, too.  For such a dive you would think the food would be a little lacking but no such thing. They serve up some of the best quesadillas, fish and chips, and burgers (according to my dad- I don't eat beef) that you can find in any bar in Chandler, Mesa, or Tempe.   Definitely one of my favorite spots for a calm and cool night to have some beers and chow down on great food. I totally recommend giving this place a shot, just make sure you hit the bathroom before heading over."}
{"text":"Terrible food..stale bread and fruit was pretty close to rotten. My nine year old wouldn't even eat it. The table next to use was a 25 top..one side were parents, the other young boys who were screaming, running around, and made multiple spills. The parents seemed uninterested even though many patrons were turning to notice the racket. When I mentioned to the waitress it was loud her reply was \"sorry but they made reservations.\"  Not sure what that had to do with anything but needless to say we will never be back."}
{"text":"Love this place, found it through Yelp and the reviews had me interested. Was pleasantly surprised to have such a good time in a place I lived by but had never heard of! Wings are crispy, burgers are delicious! Get the fries seasoned! Ordered out tonight and just as pleased!"}
{"text":"BEST BAR EVER! Service is great drinks are cheap and food is pretty good. Awesome divey atmosphere that cant be fabricated. IF YOU LIKE DIVEY BARS THIS IS THE PLACE FOR YOU! Do yourself a favor and check it."}
{"text":"Since the non-smoking ordinance has made this a smoke-free joint, this place totally rocks!  It's a blue-collar non-pretentious average-joe type neighborhood bar.  The food is good, the drinks are good, the price is great.  $6 Domestic pitchers all the time.  Try the Green Hornet Sandwich... A grilled cheese and ham sandwich with green chiles.  Delicious."}
{"text":"My favorite bar in Mesa. Food is AMAZING, it's cheap, staff is awesome, and the mugs are ice cold. Love this bar!"}
{"text":"This place stole my fiance.   ....At least when he is missing I know where to find him!  (and he brings me home their awesome chicken wings)  hahaha"}
{"text":"I have been going to \"the pub\" for years.  A great little dive in the corner of a small strip mall - near invisible to the naked eye.  Great value - pitchers of beer for $3.75, cheap food, good people.  Allie was my bartender and she fed me awesome Jack & Cokes for $3.50 a piece.  If you are just looking for a small place to go with friends or hold down a bar, this is a cool little joint."}
{"text":"one of my favorate paces in the world...look foward to moving back to az and hanging at the grub"}
{"text":"The best kept secret is this place. Great food at real cheap prices! I recommend the madcow burger it is so delicious! Beer is always cold, staff is great. I recommend this place to everybody!"}
{"text":"OK, disclaimer up front: this is a neighborhood dive bar. One should not expect first class accommodations here. But if you want cheap drinks, cheap eats, and a friendly and laid back atmosphere, this may be a good option for you. The food is prepared \"short order\" style at a grill in plain view behind the bar, and the kitchen is open until midnight, which is great for night owls or a late night snack. There are numerous TV's that will usually have sports broadcasts, but only what is on local cable - no premium sports packages here. So it's not a \"sports bar\". There are motorcycle riders that stop here on occasion, so it is \"biker friendly\" but it is certainly not a \"biker bar\". It's really a blue collar, working class, neighborhood bar and grill. There is a digital juke box if you want to play music, and 2 pool tables and 1 dart machine, if that's your pleasure. The crowd can vary from day to day, but it's usually a decent crowd mixed with a cross section of society. All in all, it's one of my favorite local \"watering holes\"."}
{"text":"Love this place.  If you are even the slightest bit pretentious, you will be offended by something, stay away from our favorite bar.  The drinks are strong, the food is good, prices are down and the crowd is chill.  Microwave pork rinds and a breakfast shot anyone?"}
{"text":"Good  neighborhood spot for a burger and a beer. The patty melt is awesome. Both drink prices and food prices are very reasonable."}
{"text":"Last night was my second visit to the Pub 'n Grub and both times I was shocked at how inexpensive my bill was. The waitstaff are awesome (to include the owner) and the other customers were friendly and jovial. You are treated like family in a clean and casual environment. Needless to say, my wife and I have found our favorite neighborhood bar. If you want to take a load off after a long day or just meet up with a friend(s), this is the spot!"}
{"text":"This place is truly a dive bar. That being said, the beer was extremely cold and was great. I wish I could say the same for the food, though. I ate a burger and fries and it was not the best."}
{"text":"I suppose it's time to update here.  Really a solid place for cold drinks and \"great\" greasy food.  How many places do you go and see the same people working?  That must say something about the Pub'n Grub.  These guys are consistent...  I have been a regular for quite some time and I really enjoy the employees.  So... if you guys see this ... hats off to you!"}
{"text":"Pub n grub is the shit. Cheap beer and awesome food. You can literally have dinner and get hammered for 40 bucks lol"}
{"text":"This bar is a perfect getaway for a late night meal or snack. The prices for the burgers are amazing! The quality is very good and the staff is friendly and accommodating even at busy times. They have a nice bar area and both booth seating and tables. On the opposite side they have a few games and pool. They also have a juke box, so there is always something interesting playing. This is a great place to come to watch football games as well, they have plenty of tv's everywhere."}
{"text":"Great dive bar, I'm always treated well.  The patrons are nice, the food decent, and the beer is cheap."}
{"text":"I haven't been to place in awhile cause I moved out fo the area, I went today and they brought back the fresh wings on their menu, at one time the wings went downhill, but now they are Back ! Great Deals on Food $$, and Bartenders are very Cool !"}
{"text":"By far one of the best dive bars in the east valley. Excellent service with cheap prices on food and drinks. Have been here a couple of times and would highly recommend!! Exactly what I enjoy most about a dive"}
{"text":"The cook is just amazing. He's a cute little older gentleman bouncing all around like an energizer bunny, cooking everything perfectly on time. Great little dive bar to people watch and have some cheap food & drinks. Tip the cook!"}
{"text":"It's a dive bar but it's a GOOD dive bar! $.50 pool and $6 pitchers of Bud Light. This turned out to be a great little venue for guys night out! Rock and roll playing on the jukebox and friendly staff."}
{"text":"i love this place!  cheap drinks and awesome food!  definately should check it out.  the staff is great as well.  see you there at 3pm today!"}
{"text":"What a find. This place is not for everyone. It is a real dive bar. The clientele is a mix of various types of folks. Their claim to fame for a 4 atar rating is the food and prices. The cook is in open view behind the bar and visible to the clientele. The food is bar food, but, is some of the best I've had for the price. My first venture into this establishment was an eye opener. As I sat at the bar I picked up a menu which was available near all of the seats. It looked like it was 20 years old from a diner. When I looked at the prices they were from 20 years ago. Where can you go and get a burger for $3.50.  An order of fries for $1.50. An order of about a dozen of wings for $5.75. Unbelievable in today's market. The food was great. Beer was $2 and a mixed drink $3. Not fancy just a nice stop."}
{"text":"We got some wings to go.  They were ok.  This is not a review on the actual location just an order of to go wings which were small and average."}
{"text":"The food is \"bar food\" however, it is done very well. Chicken wings, sandwiches,  fries, burgers, etc. This is a bit of a dive bar but its cool none the less"}
{"text":"Awesome hole in the wall bar with great food.  If you don't mind an old interior and long wait it's worth a visit.  We have gone twice and the food has been fantastic.  Make sure to get the wings!"}
{"text":"This hidden local gem is low key with a great vibe, great drinks and affordable food. I highly recommend pub n grub as one of the best dive bars in Mesa. Laid back and friendly, you have to visit!"}
{"text":"I have passed this location at least 100 times in the past 4 years, always have seen the neon beer signs in the window and thought to myself......\"odd place for a bar.\"  I finally stopped this weekend.   If you like DIVE BARS this is your place.....Sunday fun day is in full effect now! Beer selection could be better but the greasy burgers coming off the grill where perfect!!!!  Juke Box, pool tables, darts and a whole bar full of old men that look like they've been coming there for 50 years.  The one waitress they had day was nothing short of Super Woman......all by herself and carried a great attitude the whole time.....SHE\"S A KEEPER!!!!  AND SUPER CHEAP!!   PUB N GRUB-------I AM A FAN!!!!!"}
{"text":"Great bar! Dive style in the best of ways. Food is priced like it's 1990 but the quality is exactly what you want from a BAR! Great staff and music has always been in line with the crowd."}
{"text":"This place is a great escape! It is a dive bar. My husband & I go there sometimes. The food is good and the beers are always cold! It can get very busy at times. The prices are very reasonable too."}
{"text":"If you can get over dust balls, spider webs, and curtains from the 80s then you've found yourself a great bar. Cheap drinks, decent food and great service! The inside is a little dingy with ancient furniture and décor. The pool tables give you something to do, but half the time the balls get stuck and the server has to come over and open the door to get the balls. The dart board is horribly placed at the entrance so be very careful no one is walking through before you throw! The place does have a touch tunes system so download the app and pick songs from your phone."}
{"text":"This place had no signage and it was very dark and gloomy. A total dive bar with excellent burger and drink prices. Okay, if you are in hurry and just want a quick lunch during the week. If you are into total dive bars this is your place."}
{"text":"A sweet little dive bar.  I was unsure at first... where's the entrance?  Why is it so dirty in here?  Glorious.  Walking distance from a friend's house.  Seriously cheappp... I ate & drank very well for less than fifteen dollars.  Happy Saturday night.  The wings are great... must try.  Wasn't a fan of the vodka soda but that's what I get for doing well.  The headache was brutal.  I'll be back!"}
{"text":"Good Thursday night bikes welcome and try the Mad Cow best burger ever. Bathrooms are not in good shape can be a little stinky no worse then some of the Tempe Bars. Realy good spot to start out and finish up at on rides."}
{"text":"Bad ass bartenders and always on top of their game and always hustling! Ridiculous prices for cold beer and great pub food!!  These are just a few of the reasons why I keep coming back ! Remember people, you aren't in snobby Scottsdale."}
{"text":"Love the Pub n Grub! Great service and always cold beer! Place will by far beat any price in town as well."}
{"text":"Smoky smoke smoke...that is pretty much all I remember.  I don't care how \"chill\" and laid back this bar is.  I think I lost three years of my life by going here one night.  Mixed crowd, pitchers of beer, oh, and some serious cigarette smoke."}
{"text":"Secluded location cheap drinks hole in wall presence decent food  service fair just nothing sexy to look at male or female. Defiantly depends on regulars to keep a float. I give 4 stars due to the fact it has red velvet jager pool table and the secluded location"}
{"text":"Nasty ass place I used to go here because it's cheap. That being said this place is a dirty af just sitting there drinking a Luke warm beer u tend to get nauseous. Rude employees slow service locals hate newcomers all around  nasty. one night the cook decided to pull up the mats behind bar at 10pm with customers to see how nasty that was and then tells me the mop water was from the morning so I am watching him mop around dirty water on a dirty floor I had to leave I haven't been back since, so disgusting but I did get one picture of one of the mats they had maggots growing in the actual matts I can't even believe this place is still open does anybody know if the health inspector has ever came through there. Ive seen food that's been on the floor for a week because I was a regular customer but I didn't care because The beer was so cheap but after my last experience I'll never go back there yuck"}
{"text":"Best dive bar in town! Mallory is a perfect angel and always remembers what I am drinking."}
{"text":"I love this dive bar... Some bartenders are better than other like anywhere you go. I will be watching football games here when I can. Cheers!!"}
{"text":"Stars matter, I get that, and maybe I don't know the true meaning of \"dive bar\" but this is exactly what comes to mind. The menus were sticky and very very old and beat up. The four of us all ordered something different my fish was slightly under cooked  so I didn't hardly touch it.  Our waitress was short on small talk and smiles not sure why because there was only 2 tables of people, everyone else was ponied up to the bar.  Prices were super super cheap, so that's a plus."}
{"text":"Great dive bar to go hide out in and have a beer. And the food is great! The cook it in front of you which I really like!"}
{"text":"You get what you get here. Nothing fancy but all the classics that are really tasty. Cheap beer. Decently priced food. It's all the bar stuff and done well and inexpensive. I love this place!"}
{"text":"This is the definition of a dive bar! However, it is great! The food is always amazing and it's soooooo cheap! I had the green hornet and it was amazing! Also, the wings are less than 6 bucks for a dozen, how can you beat that?!"}
{"text":"This is a dive bar but worth the trip(don't even have a sign) I was flying solo on this trip so a change from my normal ventures. Regardless this place was great, the bar was full so I grabbed a table. Very nice server came by within 2-3 min. Drinks were quick, food was super affordable and good! This establishment caters to everyone not just bikers. It's like a modern day version of \"Cheers\". Next time I'm in Gilbert I will be back and have already told friends about it. I recommend you try it out."}
{"text":"I walked into this place, sat down and then left after sitting there for about two minutes. The place is small, stuffy and void of any music, just dead quiet. I noticed there were about 10 orders in the window and no one appeared to have food. The menu was ratty and beat up with only a few items on it, none of which sounded great. I never even got a greeting. I'm actually grateful about it because I didn't feel so bad when I made a dash for the front door.   Not for me. Oh, not really sure how the reviews are so good, because I went to this place based on the 4 star rating. An Awkward deception."}
{"text":"Bomb ass dive bar.  Mad cow burger a dozen wings and 3 Stella Artois under $30. Great food and amazing service."}
{"text":"I love this place, but that's because I love dive bars.  If you're looking for a friendly dive bar with dirt cheap prices for amazing bar food this is the place to come!  I love getting the half and half mushroom and zucchini basket and their burgers and sandwiches are delicious.  The only thing I would recommend staying away from is the fish and chips because I got it once and it came out hard and rubbery.  It as way over cooked and I was kind of bummed, but I still love this place and will be back!"}
{"text":"A decent break from the contrived \"ambiance\" and pre-proportioned frozen food of the chain taverns or pubs (e.g. Applebees, TGIF, Red Robin). Had a burger and fries with a cold draft. Not a gourmet burger, but competent and pretty good quality. Fries were no more greasy and much more tasty than the local chains, and were served hot and crispy. Have not tried anything else on the menu yet. Decent selection of tap beer (e.g. Bud Light (yuk), PBR, Kilt Lifter) and it is good and cold. Prices are hard to beat. Burger is $3.75 and a hell of lot better than fast food and most chains.  I like the dark 70's era atmosphere for a change. Service was really good. The barkeep/waitress had a really sweet disposition and was attentive. A few bar flies, but not overwhelming. Just enough to add to the atmosphere with some \"non-pc\" chatter. Downsides; I like dives, but this place could use a good wipe down once a week or so. Not the place for someone that likes the consistency and plastic atmosphere of a chain or that may be sensitive to non-pc bar chatter. Hard as hell to find. No sign on the building and the entrance is not immediately apparent, it is located in a windowless building that looks like it might have housed a pawn shop or tax preparation service at one time. For me, it's a good once in month diversion into the kind of dark bar dive that is disappearing in the metro area."}
{"text":"Best breakfast shots in town! Cheap beer all day. Just wish they had a patio.  Hole in the wall spot so if you don't know where you are going it is impossible to spot from the road."}
{"text":"This is my go-to place for cheap beer and the burgers are very good too. It is a dive bar, so don't mind the layer of dust on the blinds lol"}
{"text":"Good food, price is right, beer is cold, service is very good and drinks are need I say more! Come here from Apache junction and will continue to do so."}
{"text":"Two great things to try here are the Mushroom/Bacon/Cheese burger and the Western Chicken sandwich--add bacon.  The Chicken sandwich is my favorite."}
{"text":"Hands down the best bar! If your looking for great music, great people, great food, and the best drink prices.. the Pub n Grub is the place to be.   I highly recommend this bar if you want to have a few drinks and laughs. It's a very chill environment."}
{"text":"My absolute favorite bar in Arizona! It is the best hole in the wall bar you might miss out on if you don't know it's there."}
{"text":"Great local pub!  Nice staff, quick service, and yummy bar food."}
{"text":"Great dive bar. The basket of Cajun fries for $1.50 is a steal! All the other food is good too. And cheap.   Bathrooms are gross.  Could use more TVs throughout the space.  3 pool tables one dart board. Juke box overly loud.  Friendly service. Fun to see a line cook frying and grilling right in front of you."}
{"text":"Stopped in for a quick drink today and sat at the bar. And that's about it. I sat for almost ten whole minutes without being acknowledged or spoken to once. The two bartenders who were working looked me in the eye more than once but did not utter one word to me. Apparently I was completely invisible. And this only appeared to be the case for me. I'm not one to quickly assume that race was in play but I have a sinking feeling that this might have been one of those cases. I finally got up and left after ten minutes of being blatantly ignored. Not impressed...zero stars if possible."}
{"text":"Fun dive bar cheap food and drinks always have a good time good music cold beer if you can't find the sign that means your in the right place there is no sign"}
{"text":"Went today for the first time. The food is amazing. The service was fantastic also. The guy cooking doesn't have the biggest kitchen to work with but is pumping out some fantastic food. The prices are really good to for the amount of food you get. The wife and I will be back! Also a big plus....bikers are welcome!"}
{"text":"This place is awesome. Total dive bar. My husband said \"best damn burger in town!\" We both got double cheeseburgers for about $6, they come with all the fixings including a big pile of pickles! The beer is cheap and they also have Big Buck Hunter, what more could you ask for?"}
{"text":"The neighborhood bar is disappearing.  I am trying so hard to love this place.  Food is good and very reasonable.  I am not a clean freak, but they really need to give this place a good cleaning.  Dust bunnies are not a big deal when you are having a beer, but they kind of get to you when they are all over the grill area which is right behind the bar. Come on Pub and Grub, have a little more pride.  You can still keep a place clean on a tight budget.  Don't let the employees run the place.  It looks like this is what is happening.  The cooks cook, the servers serve and everybody has memorized the phrase \"NOT MY JOB\""}
{"text":"This is one of the best casual bars I've been to in Chandler thus far, and I've been to my fair share. Pub 'n Grub provides a great, laid back atmosphere to relax and have a drink in. Its a bit divey but the drinks are very affordable, especially at happy hour. Seems like a great place to grab a pitcher and watch a game. They also have pool and some other entertainment options if you're not into the games that are on.  Pub 'n Grub also has a very affordable bar food menu, with plenty of burgers, sandwiches and finger food at reasonable prices. I didn't have the chance to try any while I was there but I definitely intend on coming back to try the food.   Overall, Pub 'n Grub seems like a great little neighborhood hang out, the kind of bar where its easy to become a regular for many reasons. It seemed like many of the people there were frequent customers, which I find a great testament to the atmosphere of the bar. We will be returning."}
{"text":"Terry is an awesome bar owner and makes this place as good as it is.  Great little bat to get a few drinks and have some conversation.  Good for food too if you get here before midnight when they stop food service"}
{"text":"This is my favorite bar.  Theirry (sp?) is amazing.  If you are in on Friday or Saturday night - you will see this guy.  The waitstaff is always awesome.  I recognize most of the waitresses.  This place must have low turnover for waitstaff which is a good sign.  This is basically a biker bar and a dive.  The beer is cold and the crowd is generally fun.  I enjoy this type of bar - and it's easily my favorite place to go.  Beer comes in a frosty mug and it is cheap.  I LOVE the Killian's on draft.  The food is great.  I love me some bar food.  The green hornet is where it's at.  Ham and green chili with Swiss cheese served like a grilled cheese.  Happy Hour drafts = $2.  My tab was $8 on Saturday night.  WOW!  I love this place and can't believe it isn't on Yelp already.  There are some pool tables and darts and jukebox.    Laid back as all hell.    Please enjoy this bar."}
{"text":"It's St Patrick's day, the bar is full, one (1) waitress/server/bartender. Need I say more? Ok, 15 minutes to place a beer order, 10 minutes to get it, 30 minutes to pay for it. Forget food. You'd be here all night."}
{"text":"Dive bars are the best. Adding this place to my    locals only hang out. Great atmosphere, food and of course the frozen mugs of cold beer."}
{"text":"Easily my favorite dive bar, great service and the prices are so low! The wings are my favorite and I'm very picky about wings, the burgers are really good too. The only thing I could say bad is, I think someone else mentioned it too, the ranch is a weird consistency, almost seems watered down but I don't use ranch anyway so no loss for me."}
{"text":"Came here on a busy Friday night and had a great time! Awesome cheap burgers! Super great value at 4$ a burger!Great beer! Great service! Especially for how busy it was. Place was a little dirty and tables were sticky. But all in all it was a great experience."}
{"text":"My wife and I went to Pub'n Grub on the recommendation of my future Nephew-in-law.  He usually has good recommendations so we gave it a try.  We weren't disappointed.  First, I'm not sure how many waitresses they had working this particular evening but on a regular basis 3 would come by and check in on us.  They weren't there too frequent to be annoying, so right off the bat, kudos for amazing customer service.  As an appetizer we ordered Taquitos and they were a good start.  My wife ordered a Patty Melt which is her go to if it is on a menu, she was really happy with her selection.  I ordered the Philly Cheese Hoagie, is was delicious.  We split a large order of fries, seasoned, they were amazing! The food was really good and we will definitely go back but the \"moral\" of this story was their service.  If they are half as good as they were for us when you visit.  I am confident you will go back too!"}
{"text":"Great cheap eats and drinks. The food is surprisingly good and the price can't be beat ($2.00 for a giant basket of fries). The pool tables are $.50! The crowd is really varied and adds to the color of the place. The only downside is the bathroom :( It could stand a refreshening."}
