{"text":"I just came home from BC and wanted to take my best friend out for dinner, needed a pub/bar right near us and decided to give this new one a try. So glad we did!! The food was amazing, I had baby back ribs and shared 3 types of wings. The mashed potatoes with the ribs were divine; they pack so much flavour, had some skin on and green onions oh so good. Usually sides leave a bit to desired but the sides were as tasty as the main part. When you finish that delicious food you really must have their sticky toffee pudding! It's like heaven on a plate! The server was great, she was full of smiles and jokes, offered my friend a free birthday shot and gave us a discount. Amazing food great energy and friendly staff, I've found my new favourite joint."}
{"text":"My 9-years old son, husband and I came in to eat dinner around 6pm. The place was completely empty.  We almost walked out, but decided to give the place a chance on the strength of the Yelp reviews.  We were not disappointed. The beer and food were excellent.  We ordered two different burgers, ribs, fries and a side salad. Everything was well seasoned and delicious.  The keg room  is adjacent to the restaurant separated by a glass wall, so you can see that the beer is being kept at the proper temperature.  The service was good.  As we were eating,  more customers began to arrive. When I remarked about the lack of customers when we arrived,  she said the place does much more business later. I would definitely come back and come early to get fed before the crowds."}
{"text":"Attended Public Beer Market for the first time last night for some beer and wings. Place was about 1/4 (approx 10 tables total) full the entire time, showed up at 5:30. Look 15 minutes for someone to come take our drink order, another 20 minutes for the drinks to show up. Then 5 minutes to place our order. We ordered wings, 3 burgers and a sandwich which took 1 hour to arrive. When the food finally arrived, we were missing orders and the wings we did get were cold. We advised the waitress - she grabbed her manager (whom was sitting at the bar on this phone the entire time) and he got us fresh wings in 5 minutes (don't know how the first orders took 1 hour). The wings and food were mediocre at best, could of gotten the same thing at any pub in half the time (and we have been to almost all the neighborhood pubs in the NE). So after we finished our meal - 2 hours total of sitting around waiting. We spoke to the manager about our concerns how an almost empty pub would take over an 1 hour to serve us cold food, he then proceeded to laugh in our face and finally offered us gift cards, we advised him we would not be returning. He then started to argue with us and providing plenty of different excuses. In the end we got 25% off our bill. To summarize, this was the worst customer service I have ever experience, so much so it made me want to write my first review ever to stop people from experiencing the same. Do not waste your time and money."}
{"text":"Very good selection of beers, over 40. Rotating taps now and then to keep new flavors around. Food is very good and normally priced. David, manager, very nice guy. Kara is very knowledgeable about beer flavors available and helpful to find one you'll like."}
{"text":"Get over the location.  This place is gold.  Great beer, great food, shuffle board, ping pong, and plenty of good times. 

I have been in Alberta for 3 weeks and I have frequented this place more times than I can count.  

I travel for a living and to find a gem like this makes the time away from home a little bit easier. 

Give this place a go, you will not be disappointed."}
{"text":"I spent $27 taking an Uber from the airport to this place because they advertised 48 beers on tap. They had about 18 when I got there. They have a keg room with glass windows that showed that they were missing the vast majority of their kegs compared with the number of tap lines. The place was empty, the menus were torn and disgusting. What a huge disappointment. I imagine the high reviews are from when this place first opened, but it would seem that it has failed miserably since then and they can't afford to keep 48 beers running."}
{"text":"We were driving from the mall, heading to Joeys for lunch, and saw Public Beer Market was open. We decided to change our plans and pulled into the parking lot in front of Public. As others have mentioned, the frontage is not very appealing. They have one open patio door where you can sit and look at the parking lot. Despite all this, we thought we'd give them a try. We were pleasantly greeted. Our drink order was taken quickly but we sat for at least 15 minutes before our server came back to see if we wanted food (there was only about 6 other people in the restaurant ... not busy). It took at least 20+ minutes to get our food. I'd hate to see what they'd do if they had a full house. I ordered they're truffle Mac and cheese which was described as 4 melty cheese with bacon, sundried tomatoes and jalapeño. My first order was moderately warm, which made me think it was precooked and just microwaved. The taste was bland. There was no \"cheesy melt\" nor could you detect truffle oil, sundried tomatoes nor jalapeño. The chef made me a second dish. Other than being hotter, the flavour was no better. They said the subdrieds, jalapeño and truffle oil were mixed in the cheese sauce. It tasted like macaroni with a bland white sauce. My husbands flatbread was less than stellar. If you're a beer fan, this place is for you just don't order the food"}
{"text":"We went for dinner around 5:30 and there were only a couple of tables occupied.  Our waitress was great and was quick to come over and explain the drink menu to us since there was quite a selection. This pub had a nice open concept with an industrial feel.   
Overall the service was great.  The food was good too.  My BF and I both ordered the Public Nuisance burger except he had the fries and I had the garden salad.  We both thought it was good except I didn't care for the maple smoke cheese on the burger.  I felt the cheese was too over powering and covered the flavours of the aioli and red pepper. This hamburger would have been perfect if it had a milder cheese on it. I sampled a few fries and I would say they were just OK.  The side garden salad was yum! 
I would suggest to the Manager to do more advertising around the area.  This pub has the potential to do great and I will be back."}
{"text":"Menus are sticky and torn (both food and beer); have more pride. Food is...meh; not great not horrible. First beer I ordered they were out of. Second beer keg was empty and had to change. To her credit she changed quickly. 
For those that rate 4 and 5 stars, they must have low standards and never been out of Calgary."}
{"text":"Wish there was one near our home!

We were staying in Calgary and were looking for a brew pub. We found this restaurant on Yelp. 48 beers on tap, reasonably priced for a pint. The menu was small, mostly sandwiches and pub grub. Everything we ordered exceeded expectations. Our server was extremely attentive and explained they make almost everything in house including salad dressings!"}
{"text":"This was a total disappointment! We walked in seeing all the beers thought it looked pretty cool. Seen a man wearing a chefs jacket thinking awesome we're going to have great food. I ordered the Little Italy flatbread pizza it was a FROZEN CRUST with wooden tomatoes. It was terrible. We also ordered the moroccan beef skewers really you searched that meat? It was shoe leather tuff and flavourless when is moroccan food have no flavour? It I could give this place \"0\" stars I would!!!! Our waitress was awesome the bartender blond with glasses get off your dam phone and get you waitress our drinks. NEVER AGAIN"}
{"text":"Me and my lady love going here for a quiet lunch, and I love ordering the Big boy grilled cheese! I cant remember what its actually called, but I enjoy a good random beer, shuffle board, and what ever I am cramming in my face hole"}
{"text":"I love this place and hope you all start going there regularly so it will survive it's location!  The servers are casual and friendly, I've eaten there about ten times now and the food is always good, and they have 48 beers on tap!  I am there a couple times a week with friends, and it's always a good experience!  My suggestions if you go to try it for the first time is the tacos or the mac and cheese, and one of the Tool Shed beers!  Oh, and instead of pool, they have a shuffle-board table and a couple of ping-pong tables... fun!"}
{"text":"What are you doing just sitting there reading this? Just GO already.  This is a vibrant new place with innovative menu (we had chili prawns, bacon grilled cheese and one of the many flatbreads) and enjoyed the 48 tap beer selection.  I ordered an IPA and the waitress brought me another IPA sample that she thought I might enjoy.  Of course I ordered a second pint of that one.  And their deserts include gelato.  Did I mention we had along a picky 17-yr old and he thought everything was excellent.  What else do you need to hear?"}
{"text":"Beer: great selection, though not as much as National or Craft or Beer Revolution.
Service: very good, attentive. 
Food: The mac and cheese was, um OK. Another salad was reportedly quite tasty. 
Ambiance: ok-ish. The crowd was sparse, somewhat inappropriately drunk and the DJ might be from 1995 somehow, and also partially deaf maybe. 
If the crowd isn't jamming to your groove,  louder is not the answer."}
{"text":"Visited Public Beer Market during their recent Grand Opening with a crew from work totalling 8. They're located in a strip mall just off 32 Ave next to the Costco on 32 St. We went over during the lunch hour and were surprised to find the restaurant near empty on their Grand Opening. Hopefully not a sign of things to come, but I could see the demographic in the area not being ideal for a Beer Market, especially with little else in the area as an anchor to draw from. 

The exterior of the restaurant is pretty basic and unfortunately does not offer a patio. Getting into the restaurant things really open up, it has a bright and modern industrious feel, there is a lot of seating including your more conventional tables and booths, high tables, benches and of course seating at the bar. It's quite comparable to Craft Beer Market in this respect and definitely has an edge over National for seating. There is also an upstairs area that I imagine is generally for private functions. The roof is left exposed showing the girders and trusses which adds to the industrial look, and what's cool is their beer room is behind a pane of see-through glass so you can see everything hooked up and trace the lines from the kegs all the way to the bar. This complements the rest of the restaurant and also provides a degree of transparency in what they're serving. On the right side of they borrow from National and offer a shuffle board table and two ping pong tables in an enclosed room. I couldn't help but think how they kind of combined the games aspect of national with the better seating options of Craft, sort of a best of both worlds? 

They have a good sized food menu that is primarily your usual pub offerings along with some salads and breakfast. Some items have some ingredients that push them a bit closer to what I'd consider a Gastropub, but overall things are pretty conventional. Although it wasn't clear, they do have gluten free options, we had to ask as one of my colleagues has an allergy. The real draw is the beer selection with 48 beers currently on tap, very impressive. They have a lot of options local to Alberta and B.C. with some international options as well. Food is priced fair, beer a little more expensive but on par with the other beer markets in Calgary.

Our table ordered burgers, salads and there was also a Mac 'N Cheese. Everyone seemed pretty content with the food, but I wouldn't say there were any wows. It was good conventional food at a fair price. I personally had the Public Nuisance burger, good overall but nothing I'll rush back to, fries were good. Where they really fell short was on the service. We had let them know in advance about our larger sized group and despite the notice and emptiness of the restaurant they still seemed unprepared. Some of the plates came out in decent time, but then others were staggered and came out minutes later. There were a number of errors; I ordered the Public Burger and received the Public Nuisance, a colleague ordered the Public Meltdown which came undercooked/pink, another co-worker asked for his dressing on the side and got it on the salad and even when the waitress asked if one of my colleagues wanted a lemon with her water she forgot immediately and brought it absent of the lemon. She also had to confirm with the kitchen about gluten-free options, this should be something well known by all servers in any restaurant with how much this allergy/sensitivity has been rising in recent years.

Decent food, good beer, fair prices and room for improvement on the service side. Despite all the hiccups the server and the manager were very apologetic for the \"growing pains\" in their launch. They did not hesitate to provide a discount for the entire table without having to ask, which was appreciated by everyone. They comped the undercooked meal as well. Public Beer Market has potential to be good, but this visit was average. It'll be interesting to see where they are a few months from now."}
{"text":"After a really crappy first day commuting on a week long trip to Calgary dinner here turned my whole trip around.  Public is a small independant joint that is serving up some FANTASTIC fish and chips (that I recomend) along with a very uniquely touched menu... I can only speak for my dinner but I saw the quality of seveal of the dishes coming from the kitchen as being equally well attended to and thought out.  The fish and chips were a welcome supprise of a light and sweet crispy beer batter with a hint o hops to kick up the bitterness and  make it interesting.  This was a welcome suprise to the soggy cod wrapped in a pancake I've had on several attemps at other bars fish and chips over several trips to Alberta.  So good that I had to go back and order a second round.....  And you  can't beat 40+ craft beers on tap with a full liquor bar (sorry if you only drink molson or bud lite your in the wrong place).  Service was great and Matt was exceptional in making me feel welcome.  It's a bit hidden from the beaten path but well worth checking out and getting to know your local bartender before there's a 30 min wait to get a table. True local and independant gem to the area that's well worth becoming a regular at."}
{"text":"The place has alot of potential if marketed properly.  It is a ghost town tho on a Monday afternoon.   Walked in and had good service for the most part.  48 beer on tap is good thing, what looks like a very expensive setup with the kegs.  Ordered drinks which came quickly.  Beer is cold but could be a cpl degrees colder.  Ordered a big rock and keg was empty but it is a Monday after all.   Ordered buffalo chicken sandwich and a chicken club.  Orders are very small.  Food was decent tho.   Not memoriable,  had a few beers and rolled.   Might come back and give them a shot again.

...off to the next"}
{"text":"A newly opened restaurant that is a hop, skip & jump over the Deerfoot highway from us (it's a good thing). The menu looks fabulous and the 48 beer on tap is definitely a draw.

It's in an interesting spot, tucked behind a couple dealerships off 32nd. There is nothing exciting about the front of the restaurant...rather plain and not obvious. But once inside the place has a great vibe, is warm and inviting. Multiple kegs on tap are visible via a glass wall. Looks like they even have an upstairs possibly for private or corporate events. 

Mini me & I stopped in for lunch one day, for a girls date. We had some flatbread and I had a beer. I'm looking forward to visiting this place again and trying out their menu and of course pondering their beer offering. Nice to have this addition in the North."}
{"text":"Great beer, great location and very nice atmosphere. They have free games!! The Saturday afternoon waitress/bar tender and the cook are both very nice and personable. We don't actually come here for the food because it's good but not great to me and I'd rather spend me few eating out dollars on somewhere great. We come here because the beers on tap are delicious and it's right by Costco and all the little thrift stores I like to look at. After Costco who doesn't need a beer?"}
{"text":"This place has so much potential, it's a shame that it's not being fully realized. Went in at 5 pm on a Tuesday, happy hour should be in full swing, especially since the NE really needed a fun trendy place like this. Intended to drop off a resume and have a beer and a bite to eat. I walked in the door and stood there for 20 minutes because there was not a soul in sight. No customers, no servers, no hostess, no bartender, no manager. Nada. I even left for awhile, checked the hours on the door and came back in, same story. There was a guy working in the open kitchen but he seemed content to ignore me. The times I've been here I've recalled enjoyed the food and the atmosphere, but it's always oddly empty. Hopefully they get some good staff on and maybe do some advertising and make the place what it should be."}
{"text":"Food: had the Buffalo Chicken sandwich with fries. It was average portion and taste, nothing to complain about.

Drinks: did not have any, but they have an extensive list of beers on tap.

Large place, perfect for big groups of 6+ or more. Washroom is clean (1 stall only).

Overall, not bad if you need a venue for parties."}
{"text":"Public Beer Market has been open for a few weeks now and the atmosphere pretty nice.  They have a large open space, a platform area that opens to the outside (perfect for hot days, almost like a patio), a VIP area for private functions upstairs and a games room complete with shuffleboard and two table tennis stations.

They have a wide selection of beers from craft breweries.  The food is excellent here.  The first visit I had the \"PUBLIC NUISANCE\".  It's a great tasty burger.  It had the perfect amount of charring on the outside and cooked perfectly on this inside.  The fixings:  Double Smoked Maple Bacon / Beer Battered Onion Rings / Aged Cheddar / Roasted Garlic Aioli /Red Pepper Relish / Pretzel Bun.  I wasn't sold on the fries though which were too skinny for my preference.  I ended up taking longer to eat my fries than my burger.  The server was friendly and attentive.

On my second visit we went for lunch with a group of 4.  Wednesday is $5/lbs wing day.  The wings were pretty good.  I ordered the truffle mac & cheese.  I'm a huge fan of this dish as I really enjoy REAL mac & cheese (not the runny KD crap that some people might be used to).  The truffle oil really helped the dish and the bits of bacon and sun dried tomatoes gave it pockets of different flavours.  From the cheese, bacon, sun-dried tomatoes, I quite enjoyed the diversity of flavours and textures.  It came with some garlic bread which was a nice accompaniment.  If you're used to KD crap you may not enjoy this dish and it's REAL mac & cheese.

There was only one other party in the entire place and yet our food took about 20-30min to come out.  It gave us time to play some games but most of my companions had to leave early to catch a 1pm meeting.

Great food, atmosphere and friendly and helpful staff.  The only reason for four stars instead of the five is the wait time for the food. However, I'll be back for sure!"}
