{"text":"Coming from Mexico it's one of the most authentic Mexican food in town, they have some authentic dishes. The servers are really nice and very willing to help and serve whatever you ask for.  The chips and salsa are good but if tu like spicy salsa ask for a spicier salsa."}
{"text":"This is a great restaurant but come hungry! The carnitas and al pastor tacos were flavorful and you can add your own toppings at the Taco bar. The glucomole is chunky, fresh, and perfectly seasoned and the chips are hefty enough to hold all that fabulous guacamole without breaking. The margaritas are good but a little sweet for my taste. I asked the bartender to make mine with more lime juice and he made a perfect marg for my taste. I highly recommend this place for good, local Mexican food with an upscale, modern atmosphere. You'll take home leftovers!"}
{"text":"The service was horrible.  Sat at the table for 15 minutes without a waiter stopping by.  Nothing.  It was like we didn't exist.  Went up to the hostess to explain that our waiter (or waitress) was nowhere to be found.  She had no idea who I was and asked me to wait to be seated.  I explained that I had been seated over 15 minutes ago but have yet to receive any service.  She asked who my waiter was.  (?!)  I explained (again) that my waiter had never been by the table so I had no idea who my waiter (or waitress) was.  She finally figured out which table I was sitting at and told me she'd send over the appropriate waitstaff.   Waiter (finally) comes by and takes our order.  I order a margarita, we order queso and entrees.  Waiter gets the drinks, and promptly brings us the queso.  Says he'll bring us chips but never does.  We eat the three tortillas that come with the queso and then we're forced to just look at the queso since we don't have any way to actually eat the stuff.  The waiter comes by after another 10 minutes with our entrees.  We ask for chips.  The waiter doesn't actually say anything, but finally brings chips.  So now we have our entrees and finally are able to eat the appetizer we ordered.  Never an apology.  Never says sorry.  I think he spoke an entire 10 words to us the entire time we are there.  I finished the margarita and the waiter collected the empty glass, but never asked if I wanted another drink or water.  The previous time I had been to this restaurant I had excellent service, but for whatever reason I had terrible service this night.  We ended up leaving less than a 10% tip which is very unusual for us.  That's how terrible the service was this night.  Sigh."}
{"text":"Excellent food and very friendly,  prompt staff. Best margaritas I've had in a long time. Had the tacos and the carnitas was unbelievable. Will definitely be coming back next time we're in town."}
{"text":"Very, very good!  Happy to have discovered this place on an overnight layover.   Had the vegetarian fajitas plate and it was excellent and reasonable!  Will be back!"}
{"text":"Delicious! Had the shredded beef tacos which included their toppings bar. You could choose just one or three - of course I got three. 10 different fillings, hard and soft shells. The topping bar had three different kinds of pico de gallo,fresh vegetables, cheese and many sauces. The rojo sauce was HOT - yum!!! The margarita was a perfect combination. Would definitely go back to try something else from their extensive menu."}
{"text":"Service is top notch really fast and that's the best damn seafood chimichanga I ever had in my life I come back easily hundreds of times."}
{"text":"Excellent service and great food. Definitely recommend trying this place. Great accidental find!"}
{"text":"Great Mexican flare in the heart of downtown Cleveland with a good price point in the heart of the playhouse District. Food is good Margaritas are great a must visit when you're in that region of downtown."}
{"text":"Must taste!!!!  My step dad took me here a few months ago; he was raving about it.  I would have to agree!  I took a group of people there before a show at playhouse.  It's so nice to have another fantastic restaurant in walking distance to all the shows and inner bliss yoga studio right next door.  The food is excellent I can't wait to go back and try another dish.  The service is great which is hard to come by in Cleveland."}
{"text":"Tried happy hour with some friends. You could barely hear any music, overall ambiance was like fine dinning (or should I say boring) but with service that left a lot to be desired. Plenty of sitting available during happy hour but the staff was really disorganized. The lady that was trying to sit us asked the waitresses for help to put two tables together but they just laughed and kept looking so we ended up helping her instead. We sat for 20 minutes before one waitresses stand next to us with a notebook and said Drinks?... \"no happy hour because it is over\". We had to tell her it wasn't 6 pm yet and she acted dumb/surprised.  Margaritas are just average, ambience is boring and combined with a disorganized staff.... I will try my best to not go back."}
{"text":"This restaurant is great.  Service was superb. I ordered number 49.  A chicken dish with melted cheese and spinach and delicious tomatoes. Serves with rice and received beans ($14.50). I couldn't eat half but sooooo good.  We had a queso fundido appetizer.... large portion and delicious. My husband had chimichangas.  He liked it but loved mine Ask for Daniel.  Wonderful server Great before theatre or Indians game.   Very reasonable.  Happy hou til 7pm. Margaritas for $5 or $7"}
{"text":"My wife and I went to a Cavs game for the first time (we're from Western NY) last night, then we went here for dinner afterwards. It was quiet and comfortable. The staff was polite and prompt. Our food was delicious and very reasonably priced. We would 100% eat at Puente Viejo again!"}
{"text":"The service was kind of slow for how empty the place was, but the food was delicious! And I didn't realize this until after our food came, but if you order tacos, there is a self-serve taco bar that I guess is pretty bomb. This place seems kind of off the beaten path, which was perfect when we were trying to get something to eat before a concert at the Q. There was also an Indians game so all the other restaurants around were on hour+ waits, but we were able to walk right in and be seated here."}
{"text":"Beautiful venue with a very convenient location downtown. Really enjoyed the service and care showed toward the customers and the food was wonderful. I can't wait to stop by more often."}
{"text":"I just moved into an apartment complex around the corner from Puente Viejo. My boyfriend and I were walking around to find somewhere to eat and stumbled upon it.   The staff clearly love working there. They're funny, kind, and extremely welcoming! The atmosphere is awesome and classy. The taco bar has incredibly fresh ingredients. I tried 3 different proteins in my tacos and all were amazingly seasoned and cooked.   I can honestly say I cannot wait to bring family and friends there! Also can't wait to try out their happy hour!  Do yourself a favor and eat here! Fast service, hospitable staff, great food."}
{"text":"I was visiting from out of town and in a less than 24 hour period I ate here twice!  Try the bean dip, you won't be sad.  Excellent strawberry margarita.  The only complaint I have is that this place is not located in a city in which I live!!  I will be back."}
{"text":"I'm updating my previous review that painted a mediocre picture of this restaurant. Well, what do we write reviews for? It seems that the restaurant took notice (probably not just of my review) and really amped up their offerings. I visited Puente Viejo with my gf prior to seeing Rent at Playhouse Square and ordered the same dish I ordered the first time: Chile Rellenos, and man was this time different! The poblano pepper was perfectly breaded and fried, while not being too oily, preserving the cheesy goodness inside. The sauce was amazing and flavorful, the beans and rice were fresh and optimally seasoned. Polished off with a huge classic margarita for happy hour, I left feeling thoroughly satisfied. In reference to my previous review, there was a drink list that detailed all their beverage offerings. To make it even better, the prices are reasonable. I think I'll be back next time for the taco bar!   This is an example of a restaurant listening to its customers, highly recommended!"}
{"text":"My first visit.  Very nice modern restaurant.  Staff is friendly and efficient.  My only suggestion is fajitas and fajita burrito need more red peppers; too many green peppers.  Also, serving of charro beans is really small compared to other restaurants for the price.  Fajita Burrito was fresh and delicious.  Would definitely go back."}
{"text":"Just a fantastic jewel of a restaurant.  The staff is attentive and polite. The food is just fantastic. Can't say enough about this place. I'm glad I found it"}
{"text":"Good food. Good margaritas. The service was great. I'm in town for a meeting and was looking for a late lunch option. I was not disappointed."}
{"text":"Updating my review because I finally was able to experience happy hour and it was GREAT.   I definitely recommend the Raspberry Margarita. I'm not a big margarita fan in general usually but this was by far the best margarita I've ever had! My server was so sweet and suggested this to me as her favorite.  I also love their complimentary salsa here. It has the perfect amount of heat and is very flavorful!  For my entree, I got the enchiladas rancheras. This delicious dish comes with three chicken enchiladas all topped with different spectacular sauces. One is topped with their queso which is AMAZING - creamy, cheesy, and made of dreams. Another is topped with their tangy salsa verde. The last is topped with mole. All of this comes with a side of rice and toppings for enchiladas. YUM."}
{"text":"Fabulous! Been to barrio and Bakersfield, which are both yummy, but, omg the flavors Of the meat are absolutely beyond delicious! Bartenders are great, and food is really great!"}
{"text":"Looking for a new Mexican restaurant, we discovered Puente Viego. It's right in the heart of the theatre district so we walked over before seeing Wicked at State theater. I tried the tacos I had the grilled chicken, shredded chicken and shredded beef. You can take a trip to their taco toppings bar, it was adequate for nothing to Rave about. My companion had their enchiladas and enjoyed them immensely. I have to say we both LOVED the bean dip and fried ice cream. The original margarita was delicious as well. We will be back!!!"}
{"text":"Went here with a few girlfriends before a play with high hopes for a new spot in town. The service could not have been better - everyone was prompt and so kind. The food was average. We got fajitas, a few tacos, enchiladas and a side of guac. We also tried a classic margarita and a Paloma. Everything was forgettable and fell flat on taste. The best thing we tried was actually free samples (again awesome service!) of the black bean soup. That was great.  Overall, I really liked the people here and would probably come back for drinks at the bar if we were in need for a quick Mexican fix. With so many great options around downtown, I hope they step up their foodie game quick so they can beat out the competition."}
{"text":"The food is delicious!! And the Paloma cocktail is so yummy!!! Highly recommend this new restaurant!"}
{"text":"Went here for dinner before seeing a show at Playhouse Square. It's a nice location and there aren't a ton of options in the area so we decided to try it out. The interior was very nicely designed, but we sat outside because it was a beautiful summer evening, the patio isn't nearly as nice as the dining room. Food was mediocre American Mexican, I had enchiladas, they were fine. On the plus side, I got a large margarita on the rocks and it was tasty, big, boozy, and reasonably priced. The staff was incredibly friendly and accommodating. I would probably come back here if it was convenient, but wouldn't seek it out."}
{"text":"I very rarely give reviews of places, good or bad, but felt I needed to add a review for Puente Viejo.  I had been there a couple times and had great experiences, so when my friend and 16 of his friends and family came in from New York over the last weekend for the Yankees series, and said they wanted Mexican, I knew where to go.  We had reservations for 24, and as soon as we got here, glasses of water, and chips and salsa started being delivered to the tables.  We all sat down, and the margaritas started flowing.  After an hour or so, we all ordered and as the food started to come out, all I continued to hear was how good the food was.  Service, drinks, food...all for 24 people, was absolutely on point.  Thank you for a great evening Puente Viejo."}
{"text":"Stopped in on a Thursday night before seeing a show at Playhouse Square. The food was fresh, tasty and fast and the portions are huge. I would definitely recommend the steak fajitas.  Unfortunately, the margaritas (I tried the house margarita and then the margarita a step above that) were both very sugary and not very good. The mix says that It is \"homemade\" but It tasted like any other store bought sweet and sour mix.   In short, loved the food but will probably keep exploring other Mexican restaurant options to find a better margarita."}
{"text":"I am so so glad that my friend found this place a few months ago.  Location: Puente Viejo is only a few minutes walk from East 4th street and even from all of the theaters for Cleveland Playhouse. I've frequented Puente Viejo before concerts, musicals, and sports games - it's so close to everything so it's perfect for a dinner or lunch before you head to your event. They have a cool atmosphere inside, with a bar if you want to watch a game, and an outdoor patio in the front for when the weather is nice. Service: Everyone is always so friendly and welcoming. The food comes out pretty quickly, unless you have a large party or it is during a peak hour.  Food: On first glance, their menu can seem pretty overwhelming, but fear not! They serve you standard chips and salsa while you figure it out. Don't forget to see what specials that they have on the boards when you come in!! The first time I ate here, I decided to have one of their specials (included bacon wrapped shrimp) and was so happy I did. Their entree items are sizeable. I'd say you could finish it if you were particularly hungry, but they are easily shareable. They have a pretty good selection for vegetarians as well! Okay, so now the tacos. They have some of the best al pastor tacos I have ever eaten, ever. You have a variety of choices of meats to choose from and you can choose between a hard or soft taco shell. Pro tip: CHOOSE THE SOFT SHELL!! You can stuff more goodies from the salsa bar that they have! Their salsa bar includes things like lettuce, pineapple or corn salsa, pico, shredded cheese, chopped onions, cilantro, beans, green and red (very very spicy!!) salsa, sour cream, lemons, limes, a variety of hot sauces, and even some salad dressings. You can fill up your tacos to your heart's desire. Again, this is where the soft shell comes in handy - all of that wiggle room!! They offer a slight discount if you order three of the same tacos, which I go with the al pastor. I am usually full off of three tacos after loading them up with goodies at the salsa bar. A satisfying meal for under $10.   Giving it a 3 star rating because there was mold on one of the chopped lemons from the salsa bar...when we told the employees, they were equally as disgusted. So, just watch out for that. I'd still go back, but I'll be checking to make sure the things I add in my tacos are fresh.. Plus, they have good deals on their tacos and margs on Taco Tuesdays and they have churros that I want to try."}
{"text":"Lovely and close to Playhouse Square! My son and I adored the taco toppings bar - my chicken taco and my carnitas taco were amazing and just the way I like them- tons of cheese and gallons on sour cream! The owners are lovely and made us feel welcome."}
{"text":"Been back few more times, and did not disappoint.  Taco bar is always great. Burritos are huge. Service is really the best, it's a team effort.. always have 3-4 different people stopping by, taking stuff, refilling.  Their fajita is amazing, and prices are not jacked up! Too bad it's downtown, otherwise we'd be here more."}
{"text":"The food is bland and the service was not friendly. Not even the salsa was good, had to add multiple hot sauces to make it taste good. The taco bar is lacking in every way. I was hugely disappointed given the location and higher rating."}
{"text":"Good tamales. Friendly service. Very nice atmosphere, with large windows from which you can watch Cleveland go by. I'd go back."}
{"text":"I ate at a different restaurant than other folks. Everything I had in my vegetarian combo tasted like it came from a box or jar. The bean burrito and cheese enchilada taste the same: bland. They were swimming in a red sauce with no character or kick at all. The bean tostada was loaded with gray beans and bland guacamole. Even the chips and salsa were boring. It was some of the least interesting Mexican food I've ever had.   The staff was nice and helpful. But the place was designed in a very drab way, with a strip mall feel."}
{"text":"One of my favs. The food, drinks, service and space is a1. I went last night and I'm headed back as we speak. It's off the cut on prospect so ppl don't know about it, but it is def gem. See Oscar! He makes an amazing frozen margarita and is so nice and friendly. They even do complimentary birthday desserts that are so good. We even got free shots of avion"}
{"text":"*Update* Now that I frequent Puente Videjo regularly, I decided to give the full five-stars since I always have a great experience....  I tried lunch for the first time at the newly opened Puente Viejo. I ordered three tacos a la carte from the menu and was pleasantly impressed. The chicken, shrimp, and ground beef were all cooked and seasoned perfectly and the taco toppings bar had fresh ingredients. Our server was very attentive and friendly as well.   If my experience continues to be as good as my first visit, I will be sure to rate this place five stars...I am glad to see this new addition to dining options on Playhouse Square and plan to make this place a regular stop."}
{"text":"We always like to try new restaurants and this is a great addition to the downtown Cleveland scene.  Like many Mexican restaurants, the menu is huge so I'm sure there is something on there for everyone!  I had the chimichanga and my husband had something that gave him a little bit of pretty much everything on the menu!  We both enjoyed our meals.  The portions are so large that we could have easily split a meal.  My husband had a margarita which he said was very good.  I'm not a fan of tequila so I tried a hurricane.  I have to say it went down a little to easily!"}
{"text":"Stopped here before marching in the Sr. Pats parade today. Margaritas and a chicken quesadilla. Amazing, delicious food , beautiful place."}
{"text":"Excellent Mexican food.  Ordered the Camarones Diablo and it was so tasty with the perfect level of heat and large fresh shrimp.  Love the salsa and peppers bar too!"}
{"text":"Delicious food.  Excellent service.  Staff is very attentive and immediately serves you with complementary chips and salsa.  Happy hour before 6pm on weekdays gets a few dollars off on Margaritas and wine.  Tacos are delicious and are customizable at the toppings bar which include various condiments.  The shrimp taco was my favorite.  The shrimp fajitas are also tasty and they give a very generous portion of large fresh tasting shrimp seasoned perfectly.  Prices are very reasonable.  Very happy with my first experience here and will be coming back soon!"}
{"text":"Great food at reasonable prices. Atmosphere was in between upscale and casual - quite comfortable. Came before a show. Seated right away by friendly staff. Will definitely come again"}
{"text":"UNBELIEVABLE!! The food here is so fresh and delicious. I got the steak quesadilla fajita and my dad got #50 (a chicken with Mexican sausage dish). we were both blown away by the quality and price point! The margaritas were an added bonus"}
{"text":"Amazing food, music, and atmosphere. Service was tremendous also. Will definitely be returning in the near future."}
{"text":"Husband and my first time here and everything was absolutely great! I got the lunch portion of the steak chimichanga, as you can see in the picture, it was a nice amount of food! I'm a Mexican food lover so I know good Mexican food over so-so Mexican food and this was gooood, everything was seasoned to perfection, even the guacamole! For dessert, we shared the fried ice cream and it was great! It seemed to have been covered in frosted flakes with chocolate and butterscotch syrups, you definitely need to split this with someone because it's a lot! The employees were really nice too! :-)"}
{"text":"We stopped by this new Mexican restaurant after seeing The King and I with a group of friends.  At 5:00 (it was a Saturday Matinee performance) we were near the first of the dinner crowd.  Margarita's were simply outstanding, with different people in our group choosing different flavors and preparations.  By the time the second round was ordered, our server pushed us to go toward a pitcher of their \"better\" version of the house, Paloma - good move!  We ordered dinners, the combination Fajitas were outstanding, a shrimp scallop special tasted great and everyone else at the table raved about their dinners of traditional Mexican fare.  Good chips and salsa along with great guacamole rounded out a full crowd.  Portions were simple, well spiced, good to eat, and nearly too much to finish.  The best part of the evening - our bill arrived and it was so reasonable!  Our $12 to $16 dinners along with all of the margaritas did not break the bank - a $17 pitcher of drinks went a long way.  Stop in when in the Playhouse square area - or make the walk from downtown - it is worth the effort!  Even with Bario down the street - this place makes a great meal (in my opinion better)and you can talk to your friends without shouting.  The restaurant was packed when we left - and did not even notice the change (or maybe that was the Tequila effect).  Enjoy!"}
{"text":"Four enjoying dinner in downtown Cleveland. Great drinks and good Mexican food.   Nice hot chips. Very friendly waitress (Christy?). Lots of food. Three shared the Molcajete - shrimp, beef, chicken, sausage plus vegetables. Served sizzling hot in the stone container. Very good taste but enough food for four.   Bathroom clean. We ate inside but they offer outdoor seating. Some parking on the street.   Two had their margaritas- said they were excellent.   So it's a 5 worth a try if in Cleveland."}
{"text":"YUM!  Puente Viejo fills a huge Mexican food void in downtown Cleveland.  Food is delicious and portions are very generous.  Had an Irish Mule which was also delish.  This will definitely be our new \"go to\" place."}
{"text":"came to this new restaurant before seeing a show at the Playhouse Square. We did not come with very high expectations, but were very impressed with the service, ambiance and the quality of food. Our waiter Alex (Alexandro) was superb and was attentive and made sure to connect with us on a personal level. The Margaritas were excellent. We ordered a pitcher (for 2) and it was ample and very tasty. The food is reasonably priced and very tasty. My husband had the combo patters and ordered a beef enchilada and a chicken chimichanga. Both were very tasty. I ordered a vegetarian combo (Chile Rellano and Cheese enchilada) and that was very good as well. Alex brought us a special pico de gallo (no charge) which was delicious.  Then the owner David stopped by to chat and ask about our experience. A nice touch. We wish the restaurant all success and will be back with friends and family. Probably would be excellent for a quick lunch hour meal. David tells us it gets packed quickly - so if you plan to have lunch here, make reservations if they take them."}
{"text":"Great new addition to play house square. Warm and friendly atmosphere and staff! Food is great"}
{"text":"Friends and I chose Puente Viejo for dinner while in Cleveland to see Natalie Merchant perform. We liked the fact that they took reservations, first of all. The idea of a taco bar was also very tempting, and it did not disappoint! I chose a soft carnita taco, loaded it up at the bar, and--UNBELIEVABLE! The wait staff was very attentive and friendly as well. The tables were very small for a place that serves Mexican food. Three of us ordered fajitas--multiple plates with no place to set them. It was a challenge. Also, the tables are so close together, it was difficult to maneuver to where you needed to go. The decor was fun and very trendy but not what you'd expect for a Mexican restaurant (zebra, etc). They had a nice outdoor area as well."}
{"text":"Went to Puente Viejo for a friends birthday dinner on Friday and I thoroughly enjoyed myself. Me and my boyfriend both ordered tacos to start which were good! We had shrimp, steak, And chicken. The taco bar is kinda cool but beware there hot sauce is definitely hot asf! I burned my mouth off lol.   I ordered the camarones a la Mexicanas which was really good! The sauce the shrimp comes in I need to recreate. My boyfriend got the chimichangas and the chicken was seasoned to perfection. The bartender had my coronrita strong and convinced me to try a orangecicle margarita which was really good..   I def will be going back. I never even knew this hidden gem existed till Friday and the food and service was worth it"}
{"text":"We stopped in after a show at playhouse. It was ten with the restaurant closing at 11. We were planning just a quick snack and drinks. Unfortunately the kitchen was closed already. We were offered chips and salsa and did a round of drinks. The drinks were awesome, and service was very friendly. I was relieved to see a place downtown that was charging \"Cleveland\" priced cocktails. Affordable, great margaritas would definitely return to try food."}
{"text":"Great new place before going to the show or a ball game.  Food was good and reasonable.  Bartender Sean was great and helps to sell the whole experience."}
{"text":"This is a really good build your own taco bar for the money. My wife and I had 2 tacos each and with the chip and salsa started included it was more than enough to fill us up quickly on the way to a Cavs game. Best part was the Al Pastor taco, it was rich and flavorful. The shredded chicken taco was a little under-seasoned, but the topping bar was full of tasty options.   We will be back and I may well spring for the entire dinner entree of Al Pastor."}
{"text":"First night out on the town in Cleveland & decided to check this fine restaurant out. Glad I did!"}
{"text":"I am from out of town and went here because of the high ratings and extensive menu. They seemed super frazzled and I was worried when the table next to us never even got service and walked. I found the food to be very bland and just run of the mill. It was fine In that I didn't go to bed hungry but I don't think I would go back. I hope it was just an off night?"}
{"text":"The food may be good, but if I needed it in a reasonable amount of time I would starve to death. Slow slow slow. They tell you several times if the food it will be out in a few minutes but they tell you that 10 times so you're waiting 30 minutes longer than you expect. Bad business. Just imagine how much more business she would have if you actually could turn over tables quicker."}
{"text":"So far, I like this place! The chicken fajita is really good... their food actually reminds me of the Cozumel Restaurant in Lakewood. It's nice to have something similar downtown."}
{"text":"Love this place!  Thursday night's shrimp and scallop special is the best. Sean, the bartender, is a genius.  The owner and staff are very friendly and attentive.  They will customize your order to your tastes as requested.  Can't recommend this restaurant highly enough."}
{"text":"Love that there is a Mexican place close to Playhouse Square. Went here recently for lunch before seeing a show.  People must not know about it yet because it was not that full (yay for us, hope that changes for them).  Service was great.  Enjoyed veggie enchiladas. While the menu is very similar to other suburban Mexican restaurants, I appreciate some of the different items.  The veggie enchiladas actually came with grilled veggies on top so I had some nutrition to go along with my beans and cheese.  It is a little more expensive but it's a downtown location so I expect to pay more when I'm downtown or in a trendy neighborhood.  Would definitely return here for lunch or dinner after a show at Playhouse."}
{"text":"Can only comment on the drinks for now, but we had a great time checking this place out! My boyfriend and I were anxiously waiting for this place to open since we moved into the building next door last year. We stopped in on Valentine's day around 5PM. It was pretty empty when we first got there but got packed pretty quickly. We sat at the bar and ordered a margarita for 2. Complimentary chips and salsa were nice to snack on with our drinks. Second round of drinks, we got the strawberry frozen margarita and a Hurricaine. Of note, the drink menu that they gave us in the restaurant was a little more basic than the one on their website, but I'm sure the bartender can customize orders if you asked. The margaritas are SO delicious...I think it's the liquor they splash in at the end that gives it such a nice taste. Also love the big, fancy glasses that all the drinks come in. The bartenders were so friendly...introduced themselves to each person at the bar and tried to remember everyone's names. At the end, we were really surprised at how affordable our check came out to be. Margarita for 2 was only $12 and a lot of the food items looked reasonably priced for what you get. We weren't hungry enough to get food this time, but the dishes looked really delicious with generous portions.  It's hard not to compare this place to Barrio and Zocalo that are so close by. Seems like Puente is a little more chic and trendy than Zocalo, with a focus on more traditional mexican food compared to Barrio. So happy that this place finally opened up!"}
{"text":"Seriously THE best place to get traditional Mexican food!!!! I've been disappointed by the other places downtown, so When I went in I kept my expectations low. Boy was I shocked!!!! I started with a margarita, which was delicious!!! I ordered 2 crunchy grilled chicken tacos. They came out just meat and I was puzzled... the waiter then told me they have a taco bar. My eyes lit up when I got there! They had so many options on how to top it!!! Seriously the best Mexican restaurant downtown!!! Will be back again!!!! (Probably this week)"}
{"text":"Quick late lunch after a long flight. Great wait staff, good Mexican food. Only downside, no Sol in the beer offerings. No harm though, other good beer offered."}
{"text":"Stopped in for a quick bite.  Ambiance: A clean and modern looking restaurant-bar with nothing really hispanic-themed. This place is meant to be a nice place out and not a hole-in-the-wall. The fact they have margarita slushie machines should set the tone for this place. Noise was actually not a problem despite them being at capacity and the staff were friendly enough.  Food: I got a few carne asada and pastor tacos which comes with access to the taco toppings bar in the back of the restaurant. The tacos were served in medium flour tortillas larger than the typical street-style tacos that use corn tortillas. They could have used a light toasting but instead were just served just-warmed so they quickly became soggy in the meat juices. I stayed clear of the toppings bar because it was stocked with cheddar cheese and anemic-looking tomatoes, corns, and black beans. Given it was winter, they probably were using canned or frozen vegetables. It would have been nice to see some more authentic ingredients like cotija or queso fresco. In the end, however, the meat itself was tender and savory although nothing was particularly outstanding.  Overall I'd recommend Puente Viejo for people looking for a nice date spot that happens to serve mexican food. The drinks people around me had looked good but the food itself is americanized and not for those looking for an authentic experience."}
{"text":"I really like the vibe of this place and the food is decent. The beans and rice were a little ball and, but the pork tamale and the chimichanga were really good. The salsa bar is a really nice touch. If you order the appetizer platter, that is an enormous amount of food for a really great price. Would feed two people easily for $10. The location is nice right by playhouse square and the inside is really clean and nicely decorated. Would definitely return."}
{"text":"Visiting Cleveland for a couple of days. After reading the favorable reviews for Puente Viejo, we decided to try it out. We loved it here - very friendly service, good food and prices! Highly recommended! :)"}
{"text":"Brought the hubs here for his birthday back in April.  I don't believe they had been open for too long and unfortunately it showed.  The saturday evening we ventured in, they weren't overly crowded or busy...service was subpar.  Our server was very personable and attentive when he wasn't serving more tables than I thought he should be...so maybe they were short staffed server wise that evening.  Drinks and food were great.  Chicken wings were spicy HOT but tastey.  Salsa was on point.  Its nice to have a mexican food option in downtown."}
{"text":"Oh my god!  That was awful!  The margarita tasted as if tequila had been added to lemonade!  The jalapeño poppers had a metallic taste and the buffalo wings - which were ordered as chimichurri wings - had a grainy sauce!  Ewww!"}
{"text":"Fabulous.  One of the best meals I have ever had.  This will be our go to spot when in Cleveland.  Everyone was friendly and the owner came over to chat and check on us."}
{"text":"This place is a great hole in the wall Mexican place. Their margs are great and the service is awesome. We got our food within 20 minutes of sitting down. Highly recommend the fajitas"}
{"text":"I used to be a \"Mexican-dinner-once-a-month\" kinda person... but Puente Viejo changed everything! We tried it for lunch one day and it was good but service was sub par so weren't sure if we'd go back. THEN we moved into the area and while walking past it, one of the bartenders, Sean, invited us to stop in for a drink. He's an amazing bartender with years of experience in making drinks. If he asks you to trust him, you should- he won't disappoint. And he would make it right if you didn't like your drink.   I am SO glad we gave it another chance! For the first time in my life I ordered something different and was blown away with their chimichangas. They are stuffed full of white meat chicken and their chilli con queso (blanco) is amazing.   Every time we go there the chips come out warm and service is great all the way around. I brought my parents here for lunch and they loved it as well (and they're Mexican snobs!) We sat on their outdoor patio but they have a beautiful dining room. They consider themselves a tequila bar rather than Mexican restaurant, anyways- but you can definitely feel the differences in the decor and ambiance.   Love this spot and it's a welcomed surprise in Playhouse Square."}
{"text":"Always a pleasure coming here. Very close to proximity other bars, hotels, nightlife. All staff is incredibly friendly, knowledgeable, & they have a happy hour that on point! Get the taco's & marg's, you won't be disappointed."}
{"text":"I'm almost afraid to write this review because I don't want to place to get too busy so I can't get in. Tried this for lunch today and despite the fact that the place was very busy the food came out of the kitchen very quickly. My taquitos and my partners taco salad were both very tasty. Didn't try the margaritas because with meetings this afternoon. We will be back soon to try some other entrées. It was also impressive to say the owner hustling around to make sure people were taken care of - really working not one of those guys who just comes to check and see if you got your food. Simple answer -- try it!"}
{"text":"Tex-mex restaurant that is reminiscent of Chi-Chi's to me. I'm not a fan of this type of Americanized Mexican food, but I understand that a lot of people are.   The bar area is light and bright and appeared clean. The service was friendly but a little disorganized.   We were downtown and had a bit of time and stopped in for a drink and some snacks. We sat at the bar and were immediately greeted and provided with a basket of chips and salsa. We ordered a margarita on the rocks and a Modello. We then ordered an app of quac and queso fundido that came with flour tortilla.   When our order arrived, it was the chili con queso. Strangely, when we brought this to the attention of the second guy behind the bar, instead of just apologizing and fixing it, he felt the need to throw the other guy under the bus saying he had been told the wrong thing. The chili con queso left sitting there was very loose and runny. My husband tried it, it didn't look appetizing to me. The guacamole had tomatoes in it and had a strong citrusy bite to it. There was only one quac on the menu. A selection of mix ins would have been appreciated. It wasn't bad, but not great either. The queso fundido, when it arrived, was in the same liquidy queso blanco base with the chorizo. It had good flavor, but was best after we let it sit to cool and thicken up a tad.   Surprisingly, we were never offered silverware/napkins with our food and grabbed cocktail napkins from the bar supply to use. Also, we had to ask for additional chips after our original basket we were offered upon entering ran low and we were only left with tiny crumbs. We didn't have any spoon to put the cheesy chorizo in to our tortilla either... we were left to just dip it with our fingers.  The other patrons seemed to be enjoying their dishes which mostly consisted of puréed beans, tomato sauce mixed in to white rice, and lettuce surrounding different flour tortilla wrapped items covered in melted cheese and a side of sour cream.  The margarita was good, but small. Next time I'll get the margarita for two! Ha!"}
{"text":"So good! I came here for a bite before going to a show over at Playhouse Square. It's a bit hidden, tucked around a corner on Huron, but worth seeking out. Most of the reviews mentioned the taco bar, but I didn't get to sample that. I had a delicious skirt steak with a side of cheese enchilada and refried beans. The steak was salty (in a good way) and delish. It had obviously been marinated for a long time. The cheese enchilada was cheesy and just a bit spicy. The beans were, well, beans. There was also an avocado salad on the side - basically a plate of lettuce with some tomatoes, onions, and a pile of guac. The guac was tasty, but a bit heavy on the onion. It made a good topping for my enchilada. All in all, the combo was exactly what I wanted. The small margarita was plenty, and a great $5 happy hour price. The one forewarning on the margaritas is that they are pre-mixed and come out of a machine, not mixed fresh. Still tasty, though not very strong. I also ordered the flan for dessert. it was good, though not the texture I was expecting - it was more like a bread pudding texture than a custard texture - no jiggle. Still it was flavorful. Overall, I would stop here again for dinner when in the area. There are many other dishes I'd like to try!"}
{"text":"Visited from out of town.... decent food, but great service! If you get the churros ask for both to be caramel..."}
{"text":"We visited Puento Viejo for a friend's birthday last Saturday night. The staff was very friendly and attentive. Good service! When they found out we were celebrating a birthday and an engagement we received a round of tequila shots.  The food is average Mexican food, similar to what you would expect to find in any suburban Mexican joint.  This would be the reason for 4 stars--there was nothing exceptional about the food, but the service goes beyond average. The portion sizes are huge. A friend ordered vegetarian fajitas, which looked and smelled very good.   If you live downtown this is a great spot to get Mexican. WAY better than Nuevo in Voinovich Park (avoid that place at all costs!) If you live in the suburbs it may not be worth going out of your way for unless you are already downtown."}
{"text":"This place is delicious! I highly recommend the Cleveland chicken paired with a pitcher of the cucumber margarita  Everyone is super friendly as well which is a plus!"}
{"text":"Excellent taco place. Good prices, very attentive staff, decent prices, great location downtown, across from the playhouse"}
{"text":"We had very limited time before a Cavs game in the middle of the week and after seeing reviews of this place on trusty Yelp, looked like a great place to get some tacos since we didn't have time for Barrio- and i have ti see the mention of the toppings bar surely got me!  We were seated right away, given the menu and served very quickly after ordering. While waiting for our food we were brought chips and salsa which were like crack in a bowl- some of the best I've had at a Mexican restaurant.  The tacos came out with very little meat in a taco shell  (you have choice of hard corn, soft flour or soft corn shells). The  chicken was just average,  but the best was the al pastor- great flavor (although minimum meat) and I'd get those again.   The topping is for tacos only. There was romaine, shredded iceberg,  shredded cheese, a free different salsas, black beans, corn, and maybe a few others. The black beans where nothing special,  tasted like they came straight from a can- a bit disappointing.   Happy hour specials do not include food but the Margheritas seemed very popular! I'd be willing to come back and order something else off the menu but I wouldn't come back for three tacos (not even the topping bar). Service was excellent and very friendly.  Wish I could have given more stars...maybe next time!"}
{"text":"Just okay. Typical American Mexican place... at least during lunch.  Nothing stood out."}
{"text":"The decor and online descriptions would suggest authentic Mexican cuisine. Instead, Puente Viejo lacks substance as it offers us inauthentic cheese, crunchy Taco Bell-style corn shells instead of corn tortillas, and burnt meat. I can think of a number of Tex-Mex restaurants in the area that do that kind of food better, and a number of taqueria where I can go for a better taco. It is also worth mentioning that I could leave most other places about five dollars richer, although perhaps it is in the spirit of Playhouse Square's efforts to resemble Manhattan that some of its restaurants seem to boast Manhattan prices. The Margarita was the best part of the meal."}
{"text":"I have been to the other Mexican restaurants downtown and this is my new favorite spot. They have a great staff and the food was very delicious. The bill came and was surprised at how fair the total was for my group! We will be back at happy hour to slush down numerous margaritas! Viva México, no Trump!"}
{"text":"Great chips. Get them. And it's a taco and tequila bar. It's a nice place! They also have burritos, which I got! Very good!"}
{"text":"No doubt one of the best Mexican restaurants I've been too and I live in California!! Very modern and has that classy look that makes you think you are eating at a 4 star restaurant but the prices are around the $$ range. Food was flat out incredible! It's definitely a must for everyone seeking a great experience."}
{"text":"We've now been here twice with the family before going to a show in Playhouse Square. It's a nice alternative to the super busy and pricier restaurants right in the Square, but it's only a few minute walk to the theaters and close to some of the cheaper parking lots (shop around for parking in the area; there can be a $10 difference in lots only a few yards away).  Especially with a time crunch before a show, we were pleased that the restaurant took reservations. We had 5:45 reservations and were out by 7:00 to make our way to the theater. The kids loved the build your own taco bar, and the grown-ups loved the margaritas. I've had varying configurations of the combo plate and enjoyed what I had (including the chili relleno)."}
{"text":"Stopped in off a recommendation from a friend, we were in the area to see a show.  It was a Saturday around noon so was not busy at all.  The hostess was great, the other servers I saw were so nice... but ours.  She never spoke to us besides to ask us what we wanted.  She didn't even bring our food or check in with us on refills.  If it wasn't for the fact the food was amazing, this would have been a one star review.  I had the El Tapatio and it was amazing.  HUGE portions, only ate half.  I don't really have anything else to say, my friend talked the place up and the waitress seemed to do everything she could to counteract the review I was previously given."}
{"text":"I've checked out this place a few times for lunch when I worked downtown and most recently I grabbed dinner there after an Indians game. I have to say every time the experience has been great. Service is always fast. The portions are always generous and the food tastes great! For downtown the price is definitely reasonable."}
{"text":"I'm a huge fan of this place.  I live downtown Cleveland, and while wandering down in Playhouse Square, I noticed a little taco shop with a sign out front for Taco Tuesday. Wait!?? it was Tuesday! I obviously went in.  The young lady at the bar (super informative and helpful by the way) let us know of the deals going on for the special day.   $5 Margaritas (frozen or blended) $2 tacos (make your own) Complimentary chips and salsa  WHAT?  I instantly ordered a frozen strawberry margarita, and even though I had dinner earlier, I was so curious about the tacos. I ordered 2 AL PASTOR tacos. They come with just the tortilla and protein, but there is a toppings bar for the tacos, so you can load them up how you please.  The quality was awesome and the toppings bar was neat and organized, not messy as you sometimes see with \"buffet style\" food service.  This restaurant has a beautiful interior design, from the bar to the chairs at the tables. I'm so glad I randomly came across this place, as I look to be back next Taco Tuesday, and the Tuesday after, and on and on."}
{"text":"As a Texan this was great food and great drinks. Management came around and waitress was very good. I will be returning."}
{"text":"Wow! Giant frozen margaritas for $10, and giant plates of food for around $12. The whole waiting staff was courteous and friendly, with excellent recommendations. The unlimited chips and salsa was definitely a plus - the chips were always warm and toasty. I got the chimichangas, and they were toasty and delicious. I had plenty of food left over to take home, and I look forward to enjoying more of this food again :)"}
{"text":"Was a little dissapointed after coming here as the reviews are pretty much positive. On the positive side their portions are very generous and the food tasted Ok. Drinks were not that good. On the bad side, my wife and I did have stomach problems after eating here. Service was Ok. We had the chimichangas and an assorted selection of tacos"}
{"text":"Best drinks and food at the bar. Extremely friendly staff!!!! Love this place!!! Beautiful place, the decor and vibe is fantastic"}
{"text":"We enjoyed the carnitas soft tacos which were outstanding accompanied by the fresh taco toppings bar. Has a delicious drink -- palomas-- which I did not want to be over. Chips and yummy salsa. Perfect after theater dinner.  We will be back!!!!"}
{"text":"Food gets five stars. Probably one of my favorite restaurants in Cleveland. Why the low rating? The hours on here are a pure lie. Was at the door at 8:45 last Tuesday and the doors were closed. Quarter of the restaurant was full. Women came to the door and said they were closed. No problem closing early, but update your website and yelp page. Be aware of the false times."}
{"text":"The food was wonderful! Service outstanding! Very reasonable prices. Great atmosphere.  Will definitely be coming again!"}
{"text":"Great space, great atmosphere and friendly staff. The service was prompt and the food was served within 10 minutes after ordering at lunch. Great lunch spot downtown especially for those that don't want fast food, but in a time crunch.  The prices were reasonable and the flavors were pretty authentic. Maybe could have used a tad more spice, but I've only had one lunch so far and I will say it is promising. I do like that there is a toppings bar to allow you to add to your dish (jalapeños, salsa, pico, cheeses, etc.).  Worth checking out. Need to return for a margarita now."}
{"text":"Lucky for us, we popped in right during their happy hour, the prices were so great we fed all three of us as many tacos as we could possibly eat, chips and salsa/quac, 4 margaritas and a beer for like $50. In Connecticut that's pretty unheard of so I was impressed.  The service was fantastic, super friendly, fast, and on top of things. I tried ground beef, shredded beef, shrimp, and shredded chicken, and I have to say they were all good but the shredded beef was DELICIOUS, super tender and flavorful. I really like their set up where they bring you your tacos with only meat and then you go up to their taco bar and stuff them with any taco topping you could ever possibly need. I left this restaurant with a full stomach and a full wallet, what more could you ask for?"}
{"text":"This is the real deal, the chef hails from central Mexico and knows how to deliver an outstanding meal with portions and flavors that won't disappoint. The servers and owner are down to earth, personable and eager to please. A must try if you're downtown!"}
{"text":"I was excited to try this upscale Mexican place and finally had a chance to do so for a friend's birthday. It is a little off ways from Playhouse Square so it was harder to find than I imagined but once inside I found it surprising contemporary and bright.   I sat at the bar and had a few margaritas, which is on demand from their margarita slushie machine - overall delish. I was waiting for the birthday party to arrive (I was 30 minutes early) but the hostess approached me asking where the party was at least three times. I did not make the reservation and had no idea where the birthday girl and her other friends were so I felt a little uneasy sitting there and actually thought about leaving and coming back later (but it was raining so hard out I sat it out).  When the whole party came we sat and started to order drinks and food. The server was wonderful and entertained us all night with jokes and excellent service. The food was plentiful and very good (and reasonably priced). We had a good time and I'm glad to have tried this place out."}
{"text":"Just went here for lunch with coworkers. Service was unbelievably fast and friendly. Our party of 7 were in and out in about 30 minutes. In my opinion the food was pretty standard Mexican fare, nothing particularly ground breaking, but satisfying and tasty (although I ordered probably the most generic meal on the menu: Speedy Gonzales, which is a taco, enchilada, rice, and refried beans). Portion sizes seem a little on the smaller side, but overall I was impressed and will definitely be returning."}
{"text":"I came here with a friend maybe two weeks after they opened.  While they did have a bit of the new opening disfunction, overall the service was great and the food was delicious.  We sat at the bar and started with lime margaritas.  They were made with fresh juices and tasted great.  They had other flavors to chose from, but stuck with the original lime this time.  I was not super hungry, so I just ordered off of their a la carte menu and got 2 spinach enchiladas.  They were pretty good.  I think one of the best things about this place is that they are conveniently located in the theater district and with the lack of good mexican food downtown, this is a great addition.  I hope to come back during their happy hour and get some more margs!"}
{"text":"I am from Arizona; I am a Mexican food enthusiast. This was very good; I choose this place because the tortilla soup listed chipotle as an ingredient and I must say that it did not disappoint. It was outstanding!!!"}
{"text":"My Popeye's Pollo and Potato soup were delicious. My husband's enchiladas were not that great."}
{"text":"I would have given this a five star, but our server was slow and inattentive.  The food was excellent.  I had the California burrito from their lunch menu, which was delicious.  However,I wish I would have known about the taco bar first.  I'll try that next time."}
{"text":"Decided to make a rainy commute downtown last night to try this place and we were not disappointed. It started out odd, the hostess seemed very frazzled and because of it was a bit short with us. We were however, definitely expecting a longer wait and got seated pretty quickly. I thought the restaurant decor was pretty and very trendy. We started with ordering margaritas for two. Getting our drinks took some time and they never brought chips out- the waiter made it seem like we had to ask for them even though they were free- odd but ok. After that the rest was amazing. My husband ordered the tacos where you can customize them yourself at the taco bar (what a phenomenal idea!). I ordered the quesadilla chipotle. My quesadilla was very unique and had a ton of meat in it. Plus included bacon and cheese sauce- can't go wrong there! The tacos looked amazing even before they were loaded up with toppings. The hot sauce at the taco bar was also delicious! I enjoyed our margaritas that were extremely smooth and perfectly tart. When all was said in done- our bill was under $40 for a couple of drinks and dinner. I will definitely come again!"}
{"text":"True authentic Mexican food! Within downtown Cleveland, this modern/charming scenic environment is a great place to get your favorite Latino classics. Great service, bigger servings and wide selection of menu."}
{"text":"My friends and I checked this place out today for lunch and we all loved it!! The food was delicious, the service was great, and the decor was lovely. Great lunch specials and my friends loved the taco topping bar.  Actually, we were all surprised when we walked in that it looked more Zack Bruell than typical Mexican restaurant.   I'd say that it felt like fancy Taco Bell in the movie Demolition Man, but I was gonna save that line for when the new Taco Bell Cantina opens downtown."}
{"text":"Stumbled upon this gem after an Indians game. Open only 2 month, they are on their game. Service is friendly and on point. Food experience for Mexican style is great. Love the taco bar where you call the toppings. Great new spot in the CLE!"}
{"text":"Being truly Mexican this place isn't abuelas cooking but you know for this area its close enough. Great service and they spoke to me in spanish and English to see what I perfered. Bf got the taco which you dress yourself inside which is great. Then he got the combo plate of red tamale and enchilada which were tasty.  I got the pollo loco which has a kick and ranchers beans which were s little salty but still edible.  Good service"}
{"text":"Just randomly stopped in for lunch based on other reviews and it did not disappoint! Order the guacamole. It was so fresh and flavorful. I had the vegetarian fajitas. It had zucchini, mushroom, bell peppers, onions, and tomatoes. So so delicious. The food coupled with the nice atmosphere and great service earned 5 stars!"}
{"text":"I went here recently with my family for lunch . The parking space isn't easy to find because they isnt a lot of street parking . Depending if you find a spot or not I parked at parking lot and it was $5 to park . The place looks small from the outside and the name is hard to spot but interior is very elegant, nice, and comfortable. We were seated by the hostess and the server came out with water and chips and salsa. We went there during happy hour so the domestic beers were $2.00, small house margaritas $5.00 and large margaritas $8.00. We also went on a Tuesday so they had $2.00 tacos for chicken pork steak and other option as well expect for their tilapia and shrimp which was $2.50 each on Tuesday's ! I ordered the large house margaritas on the rocks with no salt and it is one of the best margaritas I have ever had. It comes in a pretty big cold I mean cold margarita glass! You could taste the alcohol and the flavor is very good . The chips came out warm and salsa was alright! I only say alright because I like more flavor in my salsa . I ordered the grilled chicken with hard tacos and carnitas which is pork with hard taco and al pastor which is pork marinated with pineapple . They bring out the tacos with the preference of hard shell or soft shell and you are able to go their taco bar to add all the other condiments. I love how their taco is only $2 on Tuesday and they have unlimited taco bar which has really good toppings you can add . From their fresh two types of lettuce, to cheese, to three kinds of salsa, beans, jalapeños, picked jalapeños, and many different types of sauce . If you did want to add guacamole it is extra which I  ordered and it was delicious and flavorful. The server was very attentive, nice, and always asking for refills. She told us about all the information on the menu and got us much extra condiments as we needed! Overall this place is very nice, friendly, attentive , and food and drinks are very good. I would definitely come back and try more of their items in the menu! They have an enormous amount of items in their menu from Chicken to steak to vegetarian which I would love to try soon !"}
{"text":"Everything about this place is great. The staff was very courteous and helpful, the food was superb and the portions were generous. The margaritas were great as well. One of the best restaurant experiences I've had in Cleveland."}
{"text":"the sampler appetizer was huge and delicious. my boyfriend did the taco bar while I ordered shrimp enchiladas. My bf loved the taco bar and would def go back again but my shrimp enchiladas were ok  wish I would've gotten something else. Liked the atmosphere it wasn't busy for a Friday night possibly because there was an Indians game going on."}
{"text":"We stopped in after seeing a show at playhouse square. The server was incredibly friendly, the drinks were good and well priced for being downtown. We got some guac and queso just as a snack and both were brought out immediately and were fresh. We will definitely come back on a day we can stay for a full meal!"}
{"text":"The service was off to a slow start, me having been seated then waiting for my drink order and the chips to come. After that, it was good.  The food was really good. I had the Steak a la Mexicana. It was cooked perfectly and juicy. The portions were very good.  I would eat here again."}
{"text":"So good! The food was delicious and the service was great. The food is authentic and very flavorful. The menu is massive, so many options! Our server, Daniel, was very nice, friendly and helpful. He gave great food advice, and he was fast and very efficient. The original Margarita was fairly sweet.  I highly recommend eating here. I had such a great time, loved the food, and enjoyed the environment!"}
{"text":"I'm totally down with these self serve tacos! You pick the basics like meat and flavors and then go add whatever \"fixins\" you want from a salad bar. The tacos were VERY good tasting and definitely will bring me back! The waitress was very kind and friendly. And the margs were strong but tasted good with unique flavors!  Only down fall is the salsa was not particularly good. I kept eating it tho..."}
{"text":"I am so excited for Puente Viejo! I went on their first full day of business, which I usually never do for a new place. But I was very impressed! As I am originally from California, I have basically been on a ten year quest for quality Mexican food in Ohio. The only thing that comes close is Momocho, which while great, isn't \"traditional\" Mexican-American food. I can safely say that PV hit every mark. Warm chips and fresh salsa, and flavorful fresh food that isn't greasy. I can't wait to try more!  And the lunch menu especially is amazingly reasonable. I wish this place all the best. Please try and support this business!"}
{"text":"Went for early dinner midweek and wasn't very busy. They were very friendly and gave some suggestions since menu is huge.   Ashley was our server and she couldn't have been more pleasant. My husband got the shrimp cocktail at her suggestion and said it was great--20 large shrimp swimming in a pool of sauce.   I got the tilapia tacos which were very good. The fish was crispy and flavorful.   Love the urban, modern vibe right on Huron Rd in the heart of downtown.   I will definitely return. The prices are very reasonable for downtown, the staff very friendly and food better than average."}
{"text":"Had a somewhat late dinner on a somewhat slow night. Was greeted with a welcoming smile from all employees. Had a beer a tequila and ordered the steak tampiquena. The food was served hot and boy was it off the hook. Definitely felt better than any other Mexican restaurant in Cleveland. Tasty meal, friendly atmosphere and can't wait to go back. The fact that I am reviewing says a lot!!"}
