{"text":"What a nice little take-out place. Very clean. My friend and I just happened to see it. We were very impressed with the Samosas and bought a few meals to go. We tried a sample of Biryani and it was excellent. We will definitely go back.  The staff was so friendly and welcoming."}
{"text":"The samosas were delicious and pastrylike  definitely not oily or greasy.they had chicken,beef, veggie and spinach and cheese. $1.25 a piece and cheaper if you get more. The owners seem very nice. Very odd place for such a place. If definitely try more."}
{"text":"Its $1.25 including tax per piece for any flavors. I would say beef is the best and the size is something you get for that price. I got three.  The samosa is different in a good way. The pastry is not greasy. The puff is really a puff since its flaky which is not your typical samosa.  Flavor itself is not too strong. For me its just the right curry flavor. Not spicy. Or maybe the flavor I got is not spicy.  If you need a quick snack and happen to be in the area this is a place to go."}
{"text":"Good food in a very odd location. We only tried the Manti and the baked beef samosa. Both tasted great especially the samosa. Manti is an acquired taste due to the spice. We just happened to like the taste and enjoyed it tremendously.   The kebabs weren't available due to the grill not being available. But we were told that a new grill is on-route the next day. We will definitely come back to try the kebabs and grilled chicken.  The owners are really nice people. Even offered my son a free samosa to try.  Coffee is also fresh and very affordable. We were told that in the morning, strudels are baked fresh."}
{"text":"Uzbek Halal Healthy Baked Samosas.  A foreign concept, I have always loved the deep fried loveliness, fresh from the oil at Surati Sweet Mart, who make my favourite samosas, hands down.  But Surati moved to the north east part of Scarborough, and so while sitting waiting for the hubby to buy some jeans at Marks, I realized we were both getting hangry and needed a snack, so looked here on Yelp and saw Puff Samosa and got excited.  In an industrial area near Warden and Eglinton, you will only find this place if you go looking for it but it's worth the search.  Being the end of the day they were out of the chicken samosas, so we got a couple beef along with a few veggie samosas.  Since these are baked and not deep fried, we felt like we were enjoying a healthy snack, which helped since BBQ was planned for dinner!  The baked crust is sturdy and a little bit flaky, more firm than a deep fried samosa, but that is to be expected.    The crust puffs out when baked, so it might seem like there isn't a lot of filling but I'm sure it started full, and when baked the filling cooks down and the crust puffs up, so an air gap is created - same thing happens to me when I bake a pie.  Usually I prefer veggie samosas, but at Puff, I preferred the beef filling, perhaps because the veggie filling was simply different from what I am used to. Both fillings were very mild, not spicy at all but that is what the dipping sauce is for.  The dipping sauce is called chatni sauce, which contains cilantro, chilli peppers, cubanelle peppers, garlic, water, and vinegar.  Hubby loved it so much he took a sip!  Not me, Cilantro is my Kryptonite, can't get near the stuff.  Sometimes Yelp is right to hide reviews, but I'm glad I checked out the hidden reviews for Puff Samosa, they helped.  Their website mentions all the food at Puff is healthy Uzbek Halal, so if you are searching for that, Puff Samosa is your place!  They have other dishes but we were only there for a snack, but if in the area again, we will return."}
