{"text":"There isn't Thai food like this anywhere else in Montreal. Flavorful, original, spicy--Jessie and team do a fantastic job."}
{"text":"Un petit restaurant charmant avec trois tables de quatre personnes et une dizaine de place inviduelle. Le poulet frit et la barbotte sont délicieux. Par contre, je suis moins impressionnée par les caris. Le cari vert est tres piquant mais manquait de saveur. Le cari rouge est un peu mieux mais je trouve que c'est toujours pas goûteux. J'admire, cependant, que la sauce est fait des ingrédients frais.   Il semblerait que le dessert de mangue sur riz collant est nouveau depuis quelques semaines. C'est par contre un peu salé et manque le goût sucré dans le coco. Ayant essayé, le dessert lorsque j'étais en Thailande, je dois avouer qu'il y a un petit goût salé au premier bouché mais il y a le goût sucré du coco par la suite."}
{"text":"A++ all around.  Highly recommend checking this place out if you live in or are just visiting Montreal and into Thai cuisine."}
{"text":"4.5 stars. I had the gaeng hunglay which had chunks of pork flank in a Burmese curry with a bowl of rice ($14.5), a small green papaya salad ($4) and a hot thai tea with condensed milk ($3). The curry was very flavorful and uses fresh herbs. Not sure if other places offer it but I don't believe I've had anything like it before. There were a good number of pieces of pork although one piece was mostly fat. The papaya salad had some small dried shrimp and peanuts to add some different textures to it. Overall it was more subtle in its flavors than what I like but still a solid rendition. In another visit I had the pad phet pla dook tord krob ($17.50, fried catfish in red curry) which was also very flavorful and multi-dimensional with several different herbs. Their meals include rice.  I really enjoyed the Thai tea with condensed milk. It has a distinct orange color. I'm no expert but I think this one was the best Thai milk tea I've ever had. I also tried the Thai coffee which had condensed milk in it. I'm not a coffee drinker but it seemed to taste different than other coffees I've had. This is a small place with only three tables that can fit 4 people each. There are a few high counters where you can stand and eat your food. You order and pay first before receiving your food. They also have some Thai grocery products for sale. I will definitely come back."}
{"text":"The long awaited harbinger of Thai cuisine has landed. I came a day after opening where apparently they pulled in excess of 300 customers which is impressive for such a small place.  The menu is scrawled on sheets above the kitchen counter, prices are attached beside in Sharpie. Prices generally range from $12-16. There's no offer of a menu either on their Facebook or their webpage, and I think you can expect the menu to change regularly.  I ordered a fish curry noodle soup (the name escapes me) for takeout; unfortunately, I couldn't get to it until two hours later by which time the noodles had overcooked, but no fault of theirs.   According to interviews, they're making a point of offering Thai fare aside from the usual standards of pad thai and green curries that you'll find in most Thai establishments. Even after tasting some mind blowing Thai food in San Francisco earlier this year, there were savory, herbaceous flavors in the curry I couldn't even identify (Thai turmeric?). This, friends, is the Thai food you never knew you wanted."}
{"text":"So excited to have this Thai place on st-zotique! Given that their eating area is small (only about 3 booths), I decided to take my food to go. I opted for the papaya salad and pad Thai. The pad Thai was a generous portion and the flavours were amazing. I don't generally like tofu but I have to admit it was delicious in this dish. The papaya salad unfortunately, I had to throw out. The flavours were making me uneasy and the dehydrated shrimp that topped the salad left a lingering taste I just couldn't shake. Otherwise, I absolutely adore this place and can't wait to go back and try some of their curries!"}
{"text":"You have NOT tried Thai food until you've tried Pumpui! This small epicerie and counter-service restaurant has authentic drinks and groceries from Thailand amidst a small seating area. They have 3 countertops which can each seat 4 people and then about 4 booths that seat 4-6 people comfortably. The bathroom is small and clean.  Okay so now about the delicious food. My partner and I ordered the papaya salad to start, which was fresh and a bit spicy with small dried shrimps stirred together (never tried that); it provided a crunchy and flavorful texture but a slightly fishy taste. For our mains, we shared a pad thai and a curry, both with tofu and one with shrimp. They were divine! So extremely flavorful, piping hot, and absolutely delightful for the senses. The aromas were fantastic and after a long day of fasting, their food did not disappoint. They had some Thai style bottled and canned drinks that we decided to try but they definitely did not live up to the quality of the food. I would recommend that they offer some more variety or simply another option for beverages. Overall, an amazing experience and simply a delicious rendition of Thai cuisine."}
{"text":"Just got back from lunch here on their second day open and I'm so pleased to have this truly delicious new lunch spot in the area. There is so much good stuff happening up here, and Pumpui puts me over he moon. There was no wait when I got here today just before noon, and although they are definitely having some opening-week anxiety and mix ups and some menu items weren't available, I was totally delighted with my vegetarian option - a thick and creamy red curry with big chunks of lovely tofu and squash and crispy tart black tomatoes, served with a plate of rice. Service was warm and thoughtful, and the decor is lovely and relaxing and does feel like a loving ode to Thailand. I worry about the cultural appropriation piece, it all feels so full of love for authentic food and culture that I think Pumpui's heart is in the right place, but it will be for Thai people to judge. Meanwhile I'm thankful to be introduced to more authentic tasting and complex Thai dishes and happy to see diversity coming to Little Italy."}
{"text":"The owner/head chef spent years in Thailand learning recipes from local cooks, this is easily reflected in their homemade curry sauce and meat dishes. The green curry special is my favourite, and we will definitely come back for more soon. The friend chicken is sweet and crunchy, a mice twist to traditional fried chicken. All the dishes are very authentic, definitely worth a try :)"}
{"text":"I went to Pumpui at the recommendation of Eater Montreal, and I wasn't really that impressed. As someone who has spent a lot of time in Thailand, I don't believe that a Pad Thai is supposed to be cold and clumped up together into a heaping pile of noodles. Aside from that, there was not enough flavour and was not at all indicative of cuisine in Thailand. We also got something like an eggplant and pumpkin curry. Flavour was good, but either the eggplant skin or the pumpkin rind wasn't cooked for long enough and left an unfavourable texture, and a chew that was not at all pleasurable. On a good side, the Papaya Salad was lovely - crunchy, good texture and good balance of salty, sweet, sour and spicy. The fried chicken was also great. The restaurant itself is cute. It's half a grocery store, so it doesn't seat very many people. But the booths are clean and comfortable."}
{"text":"I finaly went to have lunch here with a couple of friends after a while of hearing so many good things and was not disappointed! The place is small, nice and clean, everyone is friendly and helpful, makes you want to overstay your welcome XD The menu is quite straightforward, you can also just look at the food right behind the glass pane and you'd probably end up doing what I did by ordering almost everything... My friends were late and I didn't even wait for them to order... :P We took quite a few things:  -the papaya salad (wasn't my fav as I'm not a fan of the raw green beans and I think the dried shrimps could have used a bit of smashing) -Pad Thai -fried chicken hmmmmm... -a few curries: pork belly, fish and the jungle one which were all very yummy! Be prepare and brace yourself for some spicy stuff. Bring friends so you can try more stuff LOL!!!!! I wish I could have eaten more, for real so I'm definitely coming back."}
{"text":"Although a great food city, I always though Montreal was lacking in good Thai curries. Until now! This place is hands down the best place to get Thai curry!  Half grocery store selling specialty Thai products, half restaurant. You order at a cafeteria type counter and enjoy your meal in the seating area (big enough for 12-15 people).  I ordered the red curry. It was spicy, rich, flavorful. So good! Can't wait to return!   The Thai tea was also excellent. Much better than the versions they sell at bubble tea places! Hihihi"}
{"text":"The most delicious thai cuisine you could ever find in Montreal by far (take it from me, I'm Asian!)- zero pretention, the chefs are well trained (directly in Thailand), and suuuper friendly/happy staff.  Amazingly delicious and spicy!!"}
{"text":"Although the space is a bit small and the service is a bit slow the time I was there (no offence, but we are in hipsterland :p). I give it 5 stars because I am almost in tears when my tongue detects the authentic Thai flavours with the RIGHT amount of fresh herb in their dishes. The portion is generous and the price is quite a bit lower than other good south East Asian restaurants (Red Tiger, Satay brothers, etc). Of course it's cheaper because it's cafeteria style, but for those days that you just don't want to cook, it's perfect. The vegetarian options are substantial, making it a perfect lunch date option with your vegan friend (I love their fish special tho). It's a true honour for the Thai food theme in Montreal when our streets are saturated with fake business-style Thai restaurants with bland material + 5000% of your recommended daily sodium intake."}
