{"text":"I went to this place during happy hour: The interior was beautiful, the deals were amazing ($6 specialty cocktails, $3 well drinks, $2 drafts!)  and the food and drinks were fabulous. It's confusing to me why it was so empty!

I had two of their special cocktails, the lavender gin fizz and the Pure Vida lemonade and they were both fabulous. I would have a hard time picking between them. I tried their chicken wings (can't remember which kind of sauce, but it was bbq something) the lobster toast and a little quarter of a burger and it was all fabulous. 

I will definitely be back."}
{"text":"I'm from Cincinnati and a group of us went on a Friday night after looking on Yelp for restaurants nearby our hotel. 
We were seated right away, and the atmosphere was very warm and inviting. The open kitchen and lighting were classy with a contemporary twist. Our waiters name was Dave. He was attentive, yet not overbearing, very down to earth, and provided great suggestions. Very friendly guy!

We started with the the Caesar salad and the beet appetizer. Friend said it was the best salad he'd ever had. The beet appetizer was sublime. The beets were simply but flavorfully dressed and paired with goat cheese and duck prosciutto. The combination of flavors was very well balanced and the duck prosciutto had a tasty rub. Having never had duck, I was pleasantly surprised!

I had the grilled chicken with bacon Mac n' cheese and subbed the kale for carrots. The meal arrived and it was a very generous portion. The two chicken breasts and accompanying poblano pepper jam were delicious. The jam was sweet and not at all spicy, and it paired very nicely with the marinated chicken breasts, which were juicy and flavorful. The mac'n cheese was creamy, comforting, and yet completely different from your typical Mac.  Plus, they did not scrimp on the bacon. Against my own better judgement, I finished every bite. The carrots and root vegetable were slightly undercooked, but the flavors were on point, and I actually didn't mind the texture. 

Other friends got the scallops, the 16oz  steak, the Philly cheese steak, and the bolognese. Every single one of us cleaned our plates. We all agreed it was one of the best meals we'd had.

Great service, ambience, and delicious food make for a great combination."}
{"text":"I loved this place.  Food was fresh and flavorful and healthy!  Priced reasonably, great atmosphere- it has everything I'm looking for in a dining experience!  Give it a shot!"}
{"text":"Good food and nice atmosphere to relax with friends.  Price was reasonable for the ambience and quality of the food.  Upscale but casual.  Especially nice if you are a vegetarian or vegan...or just someone who enjoys good vegetarian.  But they also had meat dishes and the guys were equally happy with their fare."}
{"text":"Firstly, the food here is excellent. My friend definitively said the salmon is the 'best she's ever had' and my veggie Big Mac was excellently flavored and had a great sauce. The food cannot get enough praise. 
The only complaint about my experience is the time it took to actually get out food. Out reservation was at 7:30, but we didn't get our food until about 8:20. Of course, the food itself was so good it would have been worth the wait if we hadn't had tickets for a show at 9:00. However, they more than made up for the wait with their fervent apologies and the fact that our meal was COMPLETELY FREE. 
So, despite the wait, the food was astounding and the service was amazing! I defiantly recommend this restaurant, but you might not want to eat here if you're in a hurry."}
{"text":"Food OK or a little better, service not very good.  Surprise was good beer on tap if that's your pleasure"}
{"text":"First time here.  Tried all vegan and vegetarian selections.  Everything was fantastic!  The food was fabulous, the service was excellent.    The vegan chocolate cake was a little disappointing,  but it was taken off the bill without us asking.  Our server, Jen C., was wonderful.  She offered a Tide pen when a utensil was dropped.  What a sweetheart!   We will definitely be back!"}
{"text":"This is my favorite downtown lunch spot.  I've tried quite a few different menu items along with the lunchbox special.  Well prepared, not overly done, just very simple approach to food.  Perfect for lunch.  Service is efficient and nice.  I really enjoy the open space with a minimalist look."}
{"text":"First time to this new restaurant today!  I ordered the special of the day which was beef sliders, which I believe were made of brisket and short ribs?  The server highly recommended them and I was very pleased!  They were delicious!  3 little sliders and a small bucket of their potato chips, absolutely delicious!  I will be back!  We sat outside and watched the busy Euclid avenue happenings!  The service is a little slow, but super friendly, so don't go if you are in a rush!"}
{"text":"Came in with a large party and although the food was fantastic the server could and should have made more effort. Being that I've traveled the world and have eaten at hundreds of places Service is very important to me. Effort mean a lot to me."}
{"text":"Food was great and the restaurant atmosphere is very cool, kind of industrial meets agrarian. 
 One of the better restaurants in Cleveland."}
{"text":"With Pura Vida being on Public Square and walking past numerous times, I've been wanting to try Pura Vida for quite a while, especially with it being highly rated. It was good, but I'm not sure it is high up on my list of restaurants to return to.

The decor is classy and contemporary with good ambience. The ceiling has a neat light installation that slowly changes color. It's subtle and not obnoxious. It's a nice touch.

My partner and I started off with a cup of the African peanut stew and the butternut squash bisque. Both were excellent, but I preferred the peanut stew over the bisque. The butternut squash bisque legit tasted like melted cheese (which you might absolutely love, or absolutely hate).

We then shared the pimento cheese croquettes. These were good, but nothing special. They pair the croquettes with pickled cauliflower.

My partner had the beef tenderloin for his entree and I the roasted Atlantic cod. His dish was definitely better. The tenderloin was served with a smoked onion jam which really gave the tenderloin flavor. The cod was alright, served with a squash risotto. It was very salty, to the point where I couldn't finish it. I didn't really enjoy the squash risotto either. 

For dessert, we had a scoop of marshmallow gelato and a dark chocolate cake peanut butter mousse trifle. Both were excellent, but even better when eaten together."}
{"text":"Picked this restaurant on yelp because we Loved the menu selection. You can tell it was a very good chef. The service started out good but the waitress popped her head outside twice after the food came to see if it was good but never came back to ask if we needed anything after that.  The hostess brought us the check upon request and the waitress never said boo.  Food was very good though."}
{"text":"In town for a concert and we had a vegan in the group. After looking at our hotel restaurants menu, there were no options. A waiter at the hotel restaurant suggested Pura Vida. It was amazing for our vegan and others. Options from vegan to vegetarian to steak. They got us in quickly despite being busy due to the concert and got us out quickly per our request. The food was great! Wait staff was friendly. Location was great...halfway between the Marriott and the Q."}
{"text":"Me and a friend stopped in on a weeknight. I had made reservations, but they weren't needed. (see above) I'm told that it is pretty packed during lunch.    We ate outside, so I can't really comment on the interior.  From what I saw, it has a sleek modern look.  The patio outside is small but the tables are well spaced and you are under an overhang to help keep the sun directly off of you. Which is awesome for those of us who shave their heads. (It's a lifestyle choice, dagnabbit)

I asked the server what they recommended and got a few good recommendations along with the suggestion that I had to try the African Peanut Stew.  Who am I to disagree?  So I got that and their BLT while my friend got their veggie big mac. Which is exactly what it sounds like, a big mac, but totally vegetarian.  

A word before I go on. The server brought an entire bottle of water for our table so we could serve ourselves. For those of you who have had the unique pleasure of dining with me, this was the 2nd best thing that a server could do. (the 1st being \"our meal is on the house\" of course)   

The peanut stew arrived and was delicious.  I found myself scraping the bottom of the bowl wishing for more, when I remembered I had ordered the small version.  Damn my fastidious calorie counting.  The flavor is heavy on peanut, but mixes in curry as well.  My friend and I split our sandwiches, so I had both the BLT and veggie big mac. I loved the presentation of the veggie big mac and thought it was delicious, but overall I thought the BLT was a bit tastier.  The egg and toasted bread being the standouts for me.

Service was quick and attentive, but again as the only ones there, I cannot say it is always like this. In a complete stunner for myself, no alcohol was ordered so I cannot comment. 

I went back and forth between 4 & 5 stars for Pura Vida. But really, the 4 stars would only have been because when I got there at 6:30 on a weeknight ,the place was completely deserted.  That doesn't seem fair, so five stars it is.

 I do have to say to give this place a try, inventive dishes, good service, reasonable prices and a great location in downtown Cleveland."}
{"text":"Dear Pura Vida,

I dig you, but please don't slip again.  Dinner for four, Saturday night.  

Great apps... duck nachos are always a hit and the greenbean salad was nice.

Entrees, not so much.  I made a mistake by asking for my pork chop \"medium,\" but this was Med-Well... my companion's duck was on the dry side.  Two other guests ordered the Salmon stew special (which really looked great) and commented kindly, but I didn't expect them to voice negative opinions since I hosted.

Pura Vida, it was OK but not up to what I experienced before... hoping it was an off-night for the staff and not something else.  I'll be back for lunch, but will think twice before dinner."}
{"text":"This restaurant truly impressed me. I stopped in for a late lunch while staying in Cleveland. 
The waitress quickly seated us offered some suggestions for ordering. The food itself has next level flavor - I could not get enough of my meal, so delicious!
If you're looking for a higher-end meal with true chef inspired flavors then this is a great place to stop."}
{"text":"Wow! Fun, healthy menu.  Outside the box, NOT ho-hum, excellent food.  If healthy is important, if an eclectic, gourmet experience is exciting for you dine here.  They inform us that the menu is changed every quarter.  Try it!    S & J"}
{"text":"We have always thoroughly enjoyed the fantastic food and superior service when dining in the restaurant.  Recently, we used their catering service for a party at our house.  Katie was a pro at organizing the entire event.  She is extremely organized, detail-oriented, and dedicated, and worked with us from beginning to end to ensure that all of our needs and wants for the party were met.  She exceeded our expectations in every way, and the party was a huge success-thanks in great part to Katie and her staff.  Much gratitude and kudos also go out to Chef Scott and his staff for a marvelous menu that received many, many complements from our guests.  He was able to create all the food gluten free at our request, and everything was phenomenal! I have Celiac Disease and am not usually able to eat much at large get-togethers, so it was a great change to be able to relax and eat everything in sight!  The flavors were bright, complex, and memorable.  This was by far the best event we've ever hosted or been to, and I would not hesitate to highly recommend them. We can't wait to use them for our next event-and may have to invent an occasion to do so even sooner! And, oh yeah, they also left our kitchen cleaner than when they started!"}
{"text":"We were the first ones in for a Saturday brunch.  The Bloody Mary's were very tasty, and the Peanut Stew was delightful.  I loved my Kale Salad with Chickpeas and lemony dressing with feta. Everything was incredibly fresh and flavorful . The Vegetable Pot Pie was creative (phyllo crust) serving bubbling hot, filled with roasted root veggies In a thick delicious gravy.  We were awestruck.  Pura Vidal is the perfect model  for a restaurant - lovely spare space, cool bar, creative, unique and perfectly prepared  healthy, clean and incredibly delicious food, and attentive, polite service.  We are sad we don't have Pura Vida in our hometown. 4 very satisfied and impressed out of towner thumbs up. (P.s. bathrooms were super clean and well appointed -good sign)"}
{"text":"Pura Vida is a great addition to downtown and hopefully it's buzz will grow as time goes on. It has terrific atmosphere. The funky lighting and modern interior looks great and is very inviting. The beer list is sorta small but they have great options on it and you can't go wrong with anything on it. 

When it comes to food, try the duck. Doesn't matter how it's served, just get it. Seriously, I try not to eat duck for personal reasons but the duck nachos were out of this world. The duck confit is also terrific and while the tuna was pretty good it couldn't hold a candle to the duck. For dessert, the BKM bar is a heavenly mix of chocolate, hazelnut and marshmallow. 

Brandt Evans is a great chef and like Blue Canyon, Pura Vida didn't disappoint. Virtually everything I've had there was a hit outside of the chilled soup and the Mac and cheese.  Sadly, its been pretty empty each time I've been by it. It deserves a good dinner crowd and I can only hope that it gets it."}
{"text":"David was just great.  Great customer service.

The food was good.

Rather noisy and spartan for decor...which I think ads to the noise level."}
{"text":"A group of coworkers went here for a birthday lunch, and I guess I don't get what all the fuss is about. Maybe it's better for dinner? 

Things started off poorly for me when I ordered a brewed iced tea and a water. The iced tea was raspberry flavored (yuck), and from a fountain/machine (double-yuck). I thought it went without saying that fountain tea is not brewed tea. If I had known they didn't brew their own tea, I wouldn't have ordered it at all. While it's a slight distinction, it really started the meal off on a sour note. I thought the waiter might have mentioned that they don't brew their tea or it was raspberry flavored, but apparently he didn't think that was important. Additionally, the waiter was really annoyed at having to be reminded THREE times to bring me a glass of water even after I barely touched the tea. 

A coworker and I split a turkey sandwich and cubano. The turkey sandwich was a solid turkey sandwich, but I feel like it would be pretty difficult to screw it up. The cubano was beyond disappointing. It didn't have the intricacy I would expect from a cubano, and I didn't detect the pickles at all. Speaking of pickles, the waiter told us that they buy their pickles and chips from a distributor. For a restaurant that seems to tout local/homemade foods, that seemed odd.  I'm going to go out on a limb and assume that the pickled vegetables aren't homemade either, although they were good, and I would recommend them as a side. We also tried the rosemary fries, which were really good, but I don't think as good as the pickled vegetables.

Everyone ate their food, but nobody was really ecstatic about it. The worst part of the experience, however, was when the waiter BERATED me (the birthday girl) for not telling him that someone else was paying my bill, even though the person who paid had combined both tabs in her bill folder. Why is that my fault? I don't think that it's rocket science to realize that when two bills have been combined into one folder that one person is paying both of them. After a bad start and mediocre middle, the lunch ended on a bad note.

The lunch was not a great experience, with all the other options in the area, I doubt I would go back here."}
{"text":"Great place, awesome interior, friendly service and great food. Five of us went for dinner. We had several shared appetizers for the table and all were excellent. As an entree I had a trout special which was also really good. Only downside was that the place was pretty dead. Besides us there was only one other table with 2 people, but maybe it was a slow night for them."}
{"text":"We visited on Tuesday nights get, and there were very surprisingly few patrons.  We sat outside to people-watch, but it was a bit \"buggy\" so we moved inside.  I ordered the specials for tonight of French onion soup and beef short ribs; both were well prepared.  The side of cabbage cooked in beef broth was salty but really good. Wife ordered spring pea fettuccine; very good!  Service was very good but there were not many people here. Overall very good meal and service."}
{"text":"My husband and I had our wedding reception here on Saturday, and everything was absolutely fantastic! We were married a month earlier in a small private ceremony, and were looking for a fun reception venue with two main criteria - good food, and alcohol. I considered almost every available option in the Cleveland area, but settled on Pura Vida due to the aesthetics of the restaurant, food and alcohol options, and the location - close to bars for the after party, and walking distance to a bunch of hotels. The space is great, as the walls of the restaurant retract into the ceiling, opening the space to the Culinary Institute lobby, which allowed us to comfortably fit 105 guests, a Photo Booth, DJ, dance floor and lounge furniture. The lobby had a nice midcentury modern feel, so it fit with the rest of the aesthetics. The restaurant also has a large patio where guests gathered during cocktail hour and following dinner. The location is perfect for a rehearsal dinner, or for receptions up to 115 people. I think more than that would feel a little tight, unless you were not having dancing. The best part was the flexibility, and Pura Vida staff. We basically had our choice of the entire menu for the reception, and Katie and the rest of the staff were great at allowing us to customize things to meet our tastes. This isn't your cookie cutter meat, and chicken place! During cocktail hour we offered a meat and charcuterie board, and 4 different passed appetizers, which our guests could not get enough of. They also accommodated my request for a signature drink to be passed during cocktail hour, and the drink was delicious and visually beautiful. For dinner, we settled on a mixed berry salad to start, then a choice of Beef Tenderloin, Salmon with watermelon cucumber salsa, Scallops with tomato butter, and Gnocchi with roasted tomatoes (vegetarian). The spoon bread served with the entrees was the best thing I've ever tasted - like sweet mushy cornbread and everyone commented on that afterwards. PV also accommodated anyone with dietary issues separately, as well as my gluten free and vegan friends. The alcohol package offered a lot of interesting beers, spirits, and wine, and we chose from an extensive wine list for the wines we passed during dinner. The chef was available during the tasting to discuss the menu and make any special accommodations. The staff was amazing during the reception, making sure that everyone was taken care of, and always making sure my husband and I had everything we needed. Our guests are still emailing my parents and I, to tell us how amazing the food was, and how much they enjoyed the night. I think it is rare to attend a wedding where the food is good enough to talk about several days later. The only negative comment I have is that the lighting was pretty bright inside of the Culinary Institute, and all attempts to turn off or dim the lights were unsuccessful. I hope this can be changed in the future, as it wasn't the most dancing friendly environment. Nevertheless, I would not hesitate to recommend Pura Vida to anyone looking to host an event. It was definitely a pleasant experience working with the staff, the space is unique, and the food is memorable."}
{"text":"Love the atmosphere. The lighting continuously changes colors. The food is excellent. Been here twice in a group of four each time. The service has been great on both occasions. A friend that came to dinner is vegan, and she was delighted with the many vegan options. Try the vegan nachos. I recommend the short rib dinner - amazing! Would be a five star review, but they close at 9pm. We had a late dinner on a Friday and felt rushed to leave before we completely finished."}
{"text":"Food was fantastic and dining on the patio is a great option. No wait. Service was good. I would highly recommend."}
{"text":"Based upon single visit of 1-11-14.  In addition to above average selection of conventional dinner items, PV had an outstanding and broad offering of vegetarian, vegan and GMO free plates in everything from appetizers to salads, soups, entrees and desserts. African Peanut soup, kale salad, Moroccan Eggplant and more were outstanding.  Overall lots of inventive dishes that were lip-smacking good.  Service attentive and informed and above average.  Fast kitchen response got our orders on the table promptly at the appropriate times.  Noise level high due to concrete floor and other hard surfaces. Large groups (12 or more) were seated throughout the evening so no problem accommodating them.  Drink and food prices about 20% less that what you'd expect.  Clientele overwhelmingly in 20-40's range.  Valet parking 100 feet to east on Euclid Ave; in front of House of Blues.  Large outdoor patio under May Co's old marquee.  Looks across to Public Square.  Limited traffic along Euclid at this point.  Will be back here for more."}
{"text":"Our meal here was delightful.  We went at lunch time and ordered the handpicked ohio lettuce salad, portobello gyro and vietnamese flank steak.  

The salad was fresh and the flavors bright - with the brittle a welcome crunch contrast to the strawberries and goat cheese.  Our sandwiches were delicious.  I am vegetarian, but not normally a huge fan of portobello sandwiches and I hate cucumbers.  However, I devoured this sandwich and the yogurt sauce was bright with lime and mint flavors overpowering the cucumber.  When the server brought out our sandwiches, the pot of yogurt tipped over and spilled all over the plate.  He immediately offered to have it replated, and when I refused, he still brought a new pot resting on a cucumber slice on a plate.  I loved the attention to detail.

We will be back again - I certainly want to try the breakfast now!"}
{"text":"Pura Vida is a restaurant that is trying to be high class and trendy however is falling short. The food is good, but not amazing. My friend and I made reservations to eat here prior to an Indians game. He ordered a BBQ burger which tasted O.K. but was not amazing. All burgers are sold A La Carte and any sides are additional. I had the sea scallops which were on special that night. Although I felt that they were a little pricey, I was very pleased with the flavor and sear on the scallops. They were served atop a weird combo of overcooked rice and peas, which I picked at and didn't enjoy to much. In my opinion, I give Pura Vida a 2 out of 5 stars."}
{"text":"Great experience for restaurant week. Three courses for $30! The service was fantastic and the atmosphere was really modern and sleek looking with cool fluorescent lights, which always make me feel more awake. I started with the tomato and fennel soup with cheese crouton. It was awesome and even had a little spicy kick to it. Main course was salmon with jalapeño hush puppies, served atop of a potato and root vegetable stew of some sort. My salmon I ordered medium and it was perfect with a very nice crust. Desert was a mix of their chocolate trifle and an apple spring roll with salted caramel ice cream. I preferred the apple desert but they were both good. I'd definitely check their regular menu out. Great first time experience!"}
{"text":"This place was amazing!  I had the brazed beef short ribs with lobster mashed potato, green beans and black veal demi sauce. I am feeling so euphoric from this meal!  For desert the carot cake was outstanding! Not too sweet, just right!  Our server Kelly did a fantastic job of helping us navigate the menu and introducing us to the highlights of the city, she's a real gem!"}
{"text":"Fabulous view of Public Square from PV's breezy patio, blended with fabulous wine list, unusual starters and mains make it a sure bet in lively beautiful downtown Cleveland.  Definitely give it a try."}
{"text":"Had the chick pea jar and fish tacos.  Best meal I've had in a long time.  Service was great and accommodating to my gf friend.  Will go back soon."}
{"text":"There are some goods and bads about this place.  Luckily one of the goods is the food.  My pork chop was delicious, though I would have liked it to be cooked a few minutes longer.  I ordered it well done and it was medium-ish towards the center.  But, it was a hugely thick chop, so it was probably difficult to gauge.  The banh mi spring roll that came with the chop was absolutely delicious.  It's the best spring roll I've ever had, hands down.  Nice and spicy.  The fingerling potatoes with rosemary were also delicious.

My initial glass of wine was good, if unremarkable (pinot gris), and then we were intrigued by something on the wine list called a Rose Malbec.  It was a sparkling wine made with Malbec.  It was good, and different.  

The two main problems I had were our initial wait for drinks and the atmosphere.  I really don't like the rotating neon light effect.  It's tacky and makes me feel like I'm in a restaurant that wishes they had opened in Miami in the 90's.  The tables are also very spartan, like something from IKEA.  The floor is wood or laminate, so it just looks more like a place where you would have lunch than a place for a nice dinner. 

The hostess initially took our drink order, I think maybe because our server was smoking or something.  That's fine, but it still took forever to get the drinks, upward of ten minutes.  Apart from that, our server was really nice.  Another disappointment was that they did not have Ketel One or Belvedere.  I feel like all bars should have one of those two.

So, I would probably come here again, but I wouldn't hang out very long.  Maybe I would sit at the bar."}
{"text":"This place has a strange looking menu, with all types of food.  The variety is a little odd at first, but the food tastes great and the staff is hilarious.  
We had such a funny waiter who talked us through all of the options, making jokes and sharing personal experiences with the meals on offer. I was happy to see so many veggie and vegan options!
I had a tofu and rice dish- the tofu was fried, which is always a bit strange.. but the flavor was good.  My friend had chicken and waffle sliders-- he loved them."}
{"text":"Let me just say... there was not a darn thing wrong with the food here. It was actually spectacular. There aren't too many great vegan options in NEOhio. I had the vegan potpie and wanted to lick the skillet afterwards. I also had an amazing rosemary margarita - delish! 
HOWEVER.... the service was some of the worst I've ever experienced (I wish I was exaggerating). We waited nearly 15 minutes before our waitress even appeared at our table after we were seated. Waited probably another 20-25 before she came back to take our order (or even ask if our drinks were ok... which took nearly 15 minutes to get to the table). She did not bring our food out and had ignored my earlier requests for a wine list to order a glass of wine with my dinner. The manager eventually brought over the wine list and poured me a glass. Didn't see our waitress at all after that. We eventually flagged her down, put in dessert orders to go, as we knew we'd have to wait for the desserts and even longer for the check. 
I'd go back for the AMAZING food... but would not look forward to the agonizing wait I'll surely endure for that delicious food."}
{"text":"Pros: The food was great. I was with 5 other people and all of us thoroughly enjoyed our meals, appetizers and drinks. The menu had a great variety of options, without being SO varied that I questioned their focus. There's a lovely patio out front for al fresco dining (unfortunately, the weather was not patio-friendly the night we are there, so we sat inside). Terrific meal. 

Cons: Only two cons, and one is so superficial that it's a little silly to count it against Pura Vida. First, the restaurant has a lovely decor, very modern and clean, with a wavy pattern on the ceiling. The ceiling is notable because there are colored lights that illuminate it and change subtly every 10-20 seconds (red to orange to yellow to green to blue to purple), thus changing the overall color of the restaurant, the food and the people. Some of the colors are slightly unappetizing and unattractive and overall, it's  distracting. Second, the service was a little slow. We were heading to a show at Playhouse Square afterwards and had made sure to schedule our reservation on the early end and told our waitress as soon as we sat down that we were trying to make a show time. The dishes came out just slowly enough that we ended up being a bit rushed with our meal and then having to hurry to the show. 

All in all, the pros definitely outweighed the cons and I will definitely be going back to
Pura Vida for lunch and dinner."}
{"text":"This place is pretty disappointing. The fried cauliflower dish was flavorless, the potatoes were over-salted, the biscuit was cardboard, the sauce was bland, dried and crusted. The jerk tofu skewers were laden with or overly dreched in vinegar, as was the slaw - no balance there! Neither of these dishes expressed any creativity beyond a local food truck's offerings. Actually, a local food truck could do better and prices would have been cheaper. One saving grace was the African peanut soup, nicely done. We were put in a corner and had to scream to get the waitress. Don't try this though, only because it doesn't work. 

One star for the ambience."}
{"text":"Delicious!!!!!! Great options on the menu for every dietary needs. Appetizers, Dinner and desserts were all fabulous. Wait staff could have been more attentive, seating is a little odd."}
{"text":"This is my favorite restaurant in Cleveland, however, due to price I only visit about once a month. The food is amazing and it can make even the heaviest meat eater consider going vegan. Although this isn't a vegetarian or vegan restaurant, there are so many options that spark an interest. I was blown away the first time I visited and I continue to be blown away each time I visit."}
{"text":"We hosted our rehearsal dinner here back in June and were so happy with our choice! We chose this restaurant based on recommendations and couldn't have been happier. In love with the modern space and simple, open layout. The staff was very accommodating and helpful. Food was so delicious! Location is perfect; right across from the casino, hotels and super close to East 4th. Must check it out!"}
{"text":"These guys are doing something very cool with food, you should check it out. The African peanut soup was great, creamy, nutty, and a little spicy. The fried green tomatoes are fantastic, flash fried with a yummy sauce on top. The chicken fried cauliflower was stellar, amazing veggie recreation of chicken fried steak. The pepper sauce is a little spicy. The black rice with fried tofu dish (can't remember the name) was also fantastic - a little sweet sauce with it. The chocolate gelato was mind blowingly great. If you like chocolate don't miss it. We'd definitely come back for more!"}
{"text":"We were looking for nice-but-not-too-nice restaurant before a concert, and Pura Vida delivered!

We made a reservation ahead of time, which I would recommend. Our server was very knowledgable about the menu, and had a good sense of humor. 

Appetizers were so-so; would order something different next time: Frog legs, bread slather.

All of the main dishes we ordered were awesome: Barbecue picnic (ribs were fall of the bone), bacon wrapped pork (special), pork shank (corn side was delicious, and I don't even like corn!). Portions are generous for the main dishes.

I will be back for sure."}
{"text":"Great new spot in downtown Cleveland.  Great for a business lunch or happy hour beer."}
{"text":"Bright open airy space with bar seating and then an open kitchen as you head towards the back of the restaurant.  As a self conscious big Mac lover, i wanted to try their veggie version.  It was worth sampling.  It comes in a look-a-like box with the same bun only sturdier; same lettuce only crunchier, same sauce and cheese, just lighter; a thicker slice of pickles and notably, double patties with slightly crisp edges and a wee bit softer chew because, after all, its beans not beef."}
{"text":"Great food and great ambiance!  Was there with my boss and colleague and ordered beef stroganoff, need short ribs, and Korean fried chicken with bamboo rice.  All tasted great and in wonderful presentation as well.  A bit pricey but all worth it!  Would highly recommend.  Make sure you make reservation for weekend even for lunch!!"}
{"text":"4 florets of cauliflower cooked like a limp chicken on a bed of bitter sugarized kale with a single dollop of gravy and to save the day, a few fingerling potatoes: vegan dish for $21!

Two stars because they have a vegan dish.

An embarrassment is the best to be said. On second thought, I have to lower my review to one star for having vegan dish."}
{"text":"I visited on a Sat night in a large party with a wide variety of tastes, ages and dining sophistication.  Despite appearing a bit pretentious from the street, the staff was very warm and welcoming.  Cocktails were yummy and generous.  I got a kick out of people convinced that what looked like shaved cheese was butter.  Of about 4 main dishes that I stole a bite from, the rib eye steak with blue cheese and balsamic was expertly prepared but the smoked chicken was quite dry (although the mac & cheese, kale accompaniments were excellent).  Overall, 4.5 stars for food with an extra 1/2 star debit for parking being a pain in the @ss."}
{"text":"Visiting Cleveland for work and a coworker and I just happened upon Pura Vida for dinner. What a great find! We had the crispy mushrooms- so good that my friend that doesn't eat mushrooms loved them! I had the chicken fried cauliflower and she had the cod with risotto.  Both were perfectly prepared. I ended up eating a completely vegan meal without a second thought and was so satisfied!  The ceiling lighting changes color often and we found that just irritating and distracting but we came for delicious food and were not disappointed. The service was superb as well. We both thought that $40 each for a shared appetizer, meal, alcoholic drink and a shared dessert was a great value especially considering how wonderful the food was."}
{"text":"My daughter and I stopped in at Pura Vida on our way through Cleveland; she had made a reservation the previous night before we left NH for home in Milwaukee. We were greeted with a smile at the hostess stand and offered a choice of outside or inside seating.  We chose to sit inside the simply and beautifully decorated dining room and were seated with menus. There were white fabric sculptured baffles hanging from the ceiling that served to soften the sound and were cleverly and attractively lighted with color changing LED spot lights from both sides--they were subtle and fun to watch too!

Bella, our waitress, arrived promptly to take our drink order; as usual, we were drinking only water, but we had spied a hummus, pesto, olive, and ricotta jar we found intriquing and ordered it for a starter.  Bella soon returned with it and took our orders for entrees.  I had the chick pea sliders and my daughter had the pappardelle with roasted chicken, roasted yellow cherry tomatoes, and crispy garlic. Both were artfully presented and delicious!  My sliders seemed to be missing the bbq sauce they were supposed to have and Bella cheerfully and promptly brought me a side of it.

Altogether a fantastic meal (I'd gush more but my computer is dying!)!  Highly recommend!"}
{"text":"The people were nice, but the food was just ok. Not worth the 4 stars on yelp, that made me go there."}
{"text":"Great menu from top to bottom. My wife and I enjoyed all of the fare, whether it was the martini's, small plates (duck confit nachos), or big plates (medallions with sweet potato puree with street corn), and the dessert (bacon-infused funnel cake with cherries marinated in Coke-seriously?), we appreciated their creativity and quality. The waiter was fantastic. It's casual attire, which we like, and has a light ambience. Reasonably priced, and very empty on a Sat. night. Just meant it's a nice find for the wife and I."}
{"text":"I had the blackened trout po boy. It was a delicious sandwich I almost ordered a second one for tomorrow!"}
{"text":"Came here for restaurant week this past weekend. The service was wonderful and the food was pretty delicious. The chicken dish was huge and got to take half to go. The Short Rib stew was a bit smaller and didn't have much meat in it but still was flavorful. The apple pie caramel dessert pastry with gelato was amazing. We also got the chocolate peanut butter which was tasty as well.  I would come back for the regular menu in the future. I love the modern decor too!"}
{"text":"I just returned from lunch at Pura Vida and it's back to being a favorite!  The turkey cobb salad is even better than before- more of everything good.  And, my friend's sandwich looked delicious.  

I'm so glad the one bad experience was just that- one experience. I look forward to my next visit."}
{"text":"In the heart of public square is Pura Vida! We stopped in at the end of the lunch rush and had the entire restaurant to ourselves, it was awesome! Munch down some great food while enjoying sweeping views of the Cleveland! Their menu is limited, but even the pickiest of people (like myself) was able to find something to eat!"}
{"text":"I was here for an informal lunch with my boss and I had to pick a place so you can see how difficult it can be to make sure everyone likes the food. Well, Pura Vida excelled at their service, location, price and quality of the food. 

We sat outside but there was plenty of room for inside sitting also. Their iced tea was nice. Cold soups was so good that it was rated \"the best cold soup I ever had\"!! We all enjoyed the dishes we had ordered. 

I will be a regular here and will recommend it to anyone who is looking for a good place to eat food with fresh ingredients in Downtown Cleveland area. Just make a reservation!"}
{"text":"Before we even ordered, I asked the waiter if they were open Sunday night so we could come back for a second dinner! Sadly, they are not open on Sunday! Ah! What a dinner we had! I had salmon with spiced chickpeas and spaghetti squash, my daughter had trout over coconut curry vegetables. We shared an almond cake for dessert. Unique preparations in an unfussy atmosphere. Highly recommended."}
{"text":"Went back for lunch with 2 friends.  This time I opted for the African peanut stew.  I have had this soup/stew at other restaurants and dare I say it is one of my favorites.  And this one is excellent.  Hearty, smooth, spicy, and maybe a tad too sweet.  It lines the gut beautifully on a cold day.  The simple salad was...too simple.  Zzzzz.  Service was good."}
{"text":"Right on Public Square. Sparsely decorated, cold, very live (loud) room. Food is inventive, quite tasty, if a little spicy (Chef is from Texas!!). Don't be put off by the vegan reviews, the regular menu has plenty of choices. Very eclectic. Service is a little weak, and they were only half full. We loved the duck with collard greens!!!  Major disappointment was parking. It's street or valet, and there's not much street. Maitre d' would not phone for the car. Valet is several stores down, and quite inconvenient. Bad news when it's cold. They told us to wait for the car in the NoodleCat....."}
{"text":"I finally made it to Pura Vida for dinner and I have to say this place is set up a bit weirdly - especially at the bar in back where TV's are on the wall behind patrons - but the food is really outstanding.  Everything from scratch, the chowder was quite good and their riff on shrimp & grits as an appetizer was spectacular - large grilled shrimp atop a perfectly textured and grilled polenta cube with a dash of BBQ sauce on one side and drizzle of hot sauce on the other.  Wow.  The wine list was pretty good and the cocktail list is fine but nothing to write home about - if you want the best cocktails in Cleveland I would go to Hodge's but for everything else Pura Vida is first class.  And no issues getting a table for a nice dinner - with the slightly out of the way downtown location apparently they're much busier at lunch than dinner."}
{"text":"Not your average \"American food\". The servers are willing to work with dietary restrictions. One thing that I really liked is that there was no rush to leave when we were finished eating. I wish more places encouraged customers to take their time. Enjoy!"}
{"text":"Like other reviews, there's a lot to like. The modern but not overly spare decor, great music that is truly background bound and not overwhelming and, most importantly, interesting and appealing vegetarian fare. I ordered the grilled tofu kabobs, unsure what I was in for and enjoyed the flavor combinations and grilled texture of the tofu. Having read another reviewer's positive pitch for the peanut stew, had that also and it was very good. Unfortunately I wasn't able to sample the beer list, but I'll be back in the near future to indulge. Definitely recommend a visit."}
{"text":"We are fans of Brandt's Blue Canyon in Twinsburg and wanted to try the downtown Pura Vida.  Very contemporary design and layout.  Not crowded for a Saturday evening in December which was surprising.  Nice wine list and the dinner menu, while small(er) in size, had many entrees that were tempting.  I would call the menu comfort food with flare.  I had the \"chicken and biscuits\" that came with a side of mac and cheese.  This place isn't cheap, but if you have a like for chef-owned and chef-inspired restaurants, this is a worthwhile stop.   

This place is right on Cleveland's Public Square, adjacent to the casino and close to many of the hotels."}
{"text":"Visited for a quick lunch with coworkers before the full on snowstorm hit. The lunch traffic had already passed so it was pretty quiet and the server came to us very quickly. The fish tacos were highly recommended by a coworker but unfortunately it was no longer on the menu. 
I ordered the crab cake melt and the rosemary fries. The sandwich was very good. The English muffin was nicely toasted and had a lot of flavor. The rosemary fries were just ok. Quantity wise, great, but didn't have as much flavor as I would have thought. Overall, a very nice meal and fairly reasonably priced. Service was very good as well."}
{"text":"This place is one of the best restaurants in downtown!!! I'm upset at myself for not trying it months ago.  The food is amazing, the decor is very trendy/chic and cool.  I love the vibe there.  Service is great.  I love the happy hours there and the food.  I was there with a big group and everyone was very impressed and happy with their food.  It's a little pricey but definitely worth it.  I have been to a few restaurants on 4th street and Pura Vida is waaay better than any of those restaurants on 4th.  I just wish they would hurry up and open on Saturday and Sundays for brunch."}
{"text":"Service was so-so - took a long time for someone to greet me at the hostess counter, and then it was quite a while before someone came to serve me even though it was half empty on a Wednesday night. Was about ready to leave when the waitress came over. After that service was much better. The peanut stew was excellent."}
{"text":"Had high expectations for the Veggie Big Mac, but found the name misleading. A Big Mac is a very specific variation of burger - it even has a jingle for what comes on it - such that you can't go calling any old run-of-the-mill veggie burger by that name and charging $13 for it."}
{"text":"It was my first time to eat dinner at this restaurant. I very much enjoyed the atmosphere in the food was delicious. I would recommend this restaurant to anyone looking for a classy yet inexpensive meal downtown."}
{"text":"My favorite restaurant in Cleveland. As a business traveler, I come to Cleveland two or three times a year. Often, I find myself eating here twice or three times over the the course of a 2 day trip. It is that good. Fresh ingredients, farm to table sourcing, and an inventive menu. I also like Lola, but if I had to compare the two, I'd pick Pura Vida. Less attitude and better food. I was there for lunch today and I might head over for dinner. Vegetarians and nonvegetarians can both find plenty to eat here. Love their fish. Really, just go."}
{"text":"I think it's weird I'm not able to leave NO stars. Isn't it so crazy that people are PAID to do their job but just act like customers are asking them to do something like totally out of their way? I have been in contact with Joann the catering person, the GM Katie & Daikel the head chef. You would have thought I was asking for a million dollars and a share in the restaurant! I simply was asking for different opinions and options for a huge event I was hosting in downtown Cleveland! (HUGE EVENT, lots of eyes and ears there that could have really brought some traffic in for Pure Vida). 

I simply asked for advice from them and some options because I thought that was their job, I guess they aren't getting paid enough to do their job or they would be eager to get some new clients and be happy to assist.

They are all useless and if they were employees of mine I wouldn't even let them work there for free let alone get paid!!"}
{"text":"This restaurant has good options for vegetarians and carnivores like myself. We had the chick pea appetizer, it was delicious. I had the rack of lamb (on special) and Nick had the veggie Big Mac. Both meals were good."}
{"text":"What an over priced, yuppy, snoody place. Staff was rude, waitress wasnt really around.   Food was NOT worth the $19 price tag for dome soba noodles, mushrooms n kale scraps. Food took way too long to come out for lunch time. Friends meal of rice and dry tofu for $19 was not very flavorful. Other friend tortilla was dry and bland. 

If you're paying for the crappy downtown Cle atmosphere, then go somewhere else. Or save a lot of dollars and go next door to the Flaming Ice Cube where it taste good and they give you good serving sizes, for the price. 

This place should win the lame award. Lame staff, lame food and lame concept of charging too much for food I can make better at home. 

Im actually offeneded at the price of such bad food."}
{"text":"A lot of vegan places treat meat like an ex-boyfriend they've never quite been able to get over - creating this meat-like shrine in the empty place of their menu, constantly mashing tofu and beans into meat-like shapes, drunk-texting meat at three in the morning and asking whether it misses them.  

While Pura Vida is not a vegan restaurant, but it DOES serve a full vegan menu.  And since I went on a wild vegan bender with a visiting friend, rampaging through Cleveland's vegetarian options and devouring lettuce by the bushelful, I can tell you that this is the best vegan place I've found in town....

...simply because it likes vegetables AS vegetables.  

The mushroom ravioli I had was delectable, as it had a chili sauce that gave everything a wonderful tang.  My date had a rice pilaf with asparagus and roasted tomato that had a rich, luscious taste.  Their African peanut stew made kale, peanuts and sweet potato into a soup so satisfying it could have passed as an entree.  

What they do here is say, \"Well, we want to make a bunch of vegetables seem richer than a salad - how can we change the flavor to deepen it?\"  And they ask wise questions, and they discover ways to make it complex without adding the ol' standbys of meat or eggs.  

The only real downside is that their drinks were equally complex.  We had a thai martini and a red pepper drink, both of which had strong flavor profiles.  Delicious in the abstract, but the coconutty flavor of the martini didn't go with anything on our table - in fact, it was SO strong it was at odds, fighting with the peanut stew and the ravioli, and instead we sipped water and left the drinks about two-thirds undrunk.  

But I will go back.  They have vegan nights to introduce people to what vegan cuisine can be, and I trust them to unlock it.  If you're curious, this is a pretty good place to start."}
{"text":"Service was unbelievable. They were overly accommodating when it came to my extensive food allergies. Peanut stew is Amazing!!"}
{"text":"The food, service and atmosphere all contributed to the positive experience we had at Pura Vida. The menu was eclectic; pierogis, chicken & waffles, Chinese rice, African stew and lots of seasonal choices (squash fondue, mmm). The restaurant makes a point of offering a balance of vegan, vegetarian and meat dishes as well. The staff is clearly very knowledgeable about the menu. There was a patron at the table over who spent a lot of time asking questions about the menu. The server knew the answers and was very patient. Our server also asked if we had any allergies or dietary restrictions (heard a different server ask as well, the place wasn't crowded at 6 on a Saturday). Everything was delicious. The slow color changing lights on the ceiling were fun and the chairs were surprisingly comfortable even though they didn't look like they were going to be.I got the sense that this was a very well run operation."}
{"text":"F____ing amazing food. One of maybe 3 times ever I've not added salt or hot sauce to my food. Need the recipe for the veggie Big Mac ! Rosemary fries on point. Great, attentive staff. Did I say the tall dude dat made my burger got skills??!!! Discovered this place on my last day in Cleveland-regretting that but glad I did make it. Forget everyplace else, EAT HERE!!!!"}
{"text":"Service lacked (literally) at the beginning, but significantly warmed up with time. Very good small plate items: bacon (baked with brown sugar and black cracked pepper), chick pea spread more than hummus, lobster and bacon on toast, and much more. Patron margaritas very good, but a little too little. Great small plate restaurant in downtown Cleveland. Recommended by someone who appreciates fun restaurants with tasty-but-not-pretentious food."}
{"text":"My daughter's favorite because of the vegetarian selections. Great food and service!
The bread and butter board is excellent."}
{"text":"My boyfriend and I happened upon this place on a Friday night while searching for a dinner spot after arriving in town.  Everything else was closed, so it was really just happenstance that we ended up here.  We were not disappointed.  He had the pot roast and a salad.  I had the vegan gravy fries.   The food was tasty, good quality, and prepared relatively quickly.  Our server was friendly and helpful.  We arrived about 45 minutes before they closed, but we never felt rushed."}
{"text":"The only thing I can think about while writing this is regret. So much regret that I have lived only a few blocks from Pura Vida for almost a year and this is the first time I've eaten here. 
Our Friday night date night meal was perfect. We started with the fried green tomatoes and they were so fresh and crispy and delicious. For our entrees, I got the tostada and my boyfriend got the chicken fried cauliflower. Both meals were outstanding. We were both ohhhing and ahhhing the whole time. 
For fellow vegans/vegetarians, this is the spot! They have veggie options for every course, and have an entire entree section dedicated to veg options. I seriously wanted to order everything. It's nice knowing we could come here multiple times and get different vegan meals everytime.
Like I said, I only regret that I didn't get here sooner. I will absolutely be back, soon."}
{"text":"Excellent vegetarian and vegan options, all clearly marked. The African peanut stew is excellent: rich, chunky and with a smooth peanut flavor. The amazing vegan \"chicken\" fried cauliflower was decadent, with a delicious crust, a fat biscuit and (slightly soggy) kale ( the fingerling potatoes seemed like a carb overload though). Our server was very friendly and answered all my questions. Highly recommended for vegetarians and vegans."}
{"text":"We had this place on our list while visiting Clevekand and it did not disappoint. We ordered Veggie Big Mac Burger and Vegan Samosa Burritto. There are very few places that make a good veggie burger and it was amazing. The Vegan Samosa Burritto could have been more spicy but the chutney that came along with it was good. A special call out for amazing staff - I haven't come across such 'good hearted' restaurant staff for a long time... !!!"}
{"text":"i love this place! ugh i adore the inside, the decor, the white chairs, and contemporary chic ceilings, the ambience i get when i enter, i feel like im at a vegas resort.

We didnt have to wait as we had a reservation, otherwise i think wait time was between 30-45 minutes. Well worth it though!

The wait staff blew me away, there for our every beck and call, fast, friendly, polite, inviting, warming I was truly floored by how awesome this place is staffed!!

i tried the jamaican jerk tofu kabobs and holy cow they were to die for! im not even a tofu person but the description had my mouth watering and when i finally had these bad boys on my plate i was so thankful i tried them.the black bean puree was some of the best ive ever had. the pineapples were fresh and you could tell they were definitely not canned like ive seen other places do. The presentation was everything!! They have an huge wine selection and their happy hour seems like its the bees knees. Pricing was a little higher than usual but well worth it, the assortment of foods, wines, beers and desserts made this a must have!"}
{"text":"Very impressed by this restaurant. We ate here before our Musical at the Playhouse as it was right down the road.  This restaurant has great ambience and is right across from Public Square. The food here is equally amazing.  Try the Shrimp corn chowder and the Cornbread Crab cakes!"}
{"text":"Say \"Yes\" to the African Peanut Stew, and \"No\" to the Bamboo Rice.  I suppose I was thinking with the wrong side of my brain when I thought that dish would be decent (mushrooms, tofu, rice).

The African Peanut Stew was rich and very flavorful.  It had chunks of carrots and potatoes, and lots of p-nutty flavor.  I wish it were a little spicy, but I managed.

The Bamboo Rice looked like it had green food coloring mixed into it.  It tastes very plain, and I could liken it to the days when I'm scrounging around the house for food and I'm looking to get rid of some stuff in the pantry, so I throw it all together, eat it and say, \"Hmm, that wasn't terrible\".  Don't settle for \"it wasn't terrible\"; you're better than that.

Lastly, prices are very high for portion sizes and lack of taste in food."}
{"text":"I really wanted to love my meal here. I had an sweet potato gnocchi entree with spaghetti squash, pine nuts, some interesting sauces, and thyme. It was such a great combination of rich flavors but my little gnocchis were burnt on one side and hard! Talk about fumbling at the 1 yard line... 

I'll be back to try more dishes that I hope are executed with more care."}
{"text":"We tried Pura Vida on whim while in town for a concert. I'm so glad we decided to dine here! While most restaurants have a carnivore focused menu with a few vegetarian dishes, Pura Vida is the opposite. The majority of the dishes were vegetarian or vegan with a decent selection of meat and seafood based dishes. I was very happy to have such a great selection to choose from. We sat at the bar and ordered drinks and an appetizer from the happy menu. At $5 each, the happy hour cocktails were a great deal. My friend ordered the special... Lobster roll sliders. They weren't your typical lobster role... The lobster was more like a tuna salad consistency than what we expected. They were still good. The blue cheese fries were excellent. They were featured on the happy hour menu and we received a huge serving for $5. The absolute standout was the veggie burger. It was styled like a Big Mac. I've never had an actual Big Mac, but after having this \"burger\" I can see why they are so popular. The veggie patties were perfect. Light and airy and crispy. I loved that they used a classic white bread and sesame seed bun with iceburg lettuce and special sauce. I would return again just for the burger. As a bonus, the ambiance is great and it's very conveniently located to the 4th street area."}
{"text":"Pura Vida had great food and great service! Everyone was so kind and I felt the waiter was honest with me about what was best to get.  We waited very little time to sit and for the food to come out.  I would definitely come dine at Pura Vida again!"}
{"text":"This place could have gotten 5 stars from me if not for the service. 
We stopped in for a late dinner/snack with wine. We ordered the special cheese plate (came with 4 cheeses and toasts, dried cherries, candied pecans) and each got the African Peanut Stew along with a bottle of wine. Everything was fine until it got close to closing time (we're talking like 15 minutes before). There were still other people there eating, and the entire staff was getting tables prepped for the next day. We were hurrying to finish as we knew they were closing. But as we finished eating and she brought our check, we suddenly felt VERY unwelcome between our waitress' attitude change and who I'm assuming the manager coming over and briskly asking us if everything was ok when we hadn't run out the door immediately after getting the check a minute after 9. When we finally left 5 (5!) minutes after closing time, you would have thought that we'd stayed an extra hour. Rude. Would have returned sometime because the food was good, but won't now."}
{"text":"Excellent restaurant serving vegetarian and non vegetarian. Had an excellent blackened Faro salmon followed by berry crumble and gelato, food and service first class. Nice clean modern layout with option of outside dinning."}
{"text":"Enjoyed my meal for the second day at this restaurant.  They have several vegan plant based options which is why I came back. Yesterday I had the samosa burrito which was flavorful if a bit mushy. Today I had the African stew and their vegan Caesar salad. This was delicious. The only thing I would change with the salad would be to add more beans so that hunger could be prevented. They put only ten garbanzo beans on the salad and I was expecting about a half cup so as to increase the protein content of the salad. Oh well. The servers  are quick and polite. I enjoy this and will be back the next time I have jury duty downtown.  The restaurant was clean and inviting. The hostess could not have been more friendly and welcoming. I really appreciated how welcoming she was. She made sure that my server knew I had a time constraint with jury duty."}
{"text":"We really liked this restaurant. We sat inside which had a nice, modern decor. The staff were friendly and helpful. The food selection was great - especially for us as vegetarians. Great place for vegetarians because they have a whole menu for vegetarians (in addition to a separate regular menu). We ordered several vegetarian dishes which were each quite flavorful and nice. The veggie burger was awesome. I don't think we saw any kids in the restaurant except for our two kids. But the restaurant was not unfriendly to kids."}
{"text":"This was my first time having dinner at Pura Vida, and I must say that is was very tasty.   I dined here with a girlfriend before a Cavs game.   I ordered a pomegranate martini, which was delightful. We both started with a cup of the shrimp and corn chowder, topped with oyster crackers, very tasty, as always.   We both chose the Korean fried chicken thighs as an entree.   The chicken arrived crispy, crunch and lightly coated in an asian style sauce, topped with pickled slaw and accompanied with a side of bamboo rice.  I also ordered a side of brussel sprouts and my friend ordered a side of cheese polenta.   The serving size was generous and the entree combination really hit the spot (I would order again and again!).  We also opted for dessert, I had the gluten free almond cake which was moist, fresh and delicious. I would definitely return!"}
{"text":"I like this place.  Reasonably priced and made with local grown food.

I've had the short ribs twice and it was excellent."}
{"text":"My out of town relatives and I were interested in trying pura vida. It always seemed interesting to us we just never went. My cousin has the flu, but she was a trooper and explored downtown with us. We were all having such a blast. We got to pura vida and settled down into our seats. My cousin put her head down because pura vida had a nice, quiet, relaxing vibe to it. As soon as she laid her head down the manager came over and asked my cousin to raise her head since they were \"not that kind of restaurant\". Understandably it is New Years Eve so we assume the manager thought my cousin was drunk. We explained that she was very sick and she just wanted a minute to rest her head. The management didn't care and said we needed to leave now. One waitress called my other cousin a little bitch. I am highly disappointed in this management and staff. Please only go here if you are 100% sober and are silent the entire time. If I could give this place negative stars I would."}
{"text":"The environment here is delightful, and the offerings on the menu for vegetarian, vegan, and omnivore needs are wide-ranging.

We stayed with the vegan bread plate, and both the olive tapenade and the garlic spread were a great start.

I had today's special, the seared Ahi tuna, and it was exquisite. A soft melt-in-the-mouth tuna, wasabi greens, roasted fingerling potatoes added up to a delicious meal.

My wife's vegan, gluten-free meal (vegan Tostada) was the best she's had in Cleveland, hands-down. My daughters were incredibly happy with the Rosemary Fries, Veggie Mac sandwich and veggie sides.

The drinks were different, tasty, and not too pricy. I recommend the Taste of Thailand.

I can't recommend this place highly enough for any vegans or vegetarians that want great food in Cleveland."}
{"text":"Pura Vida was pure bliss. We sat inside but by the window so it was almost as if we were outside, all while still enjoying the modern, yet cozy ambiance of the inside. For a Friday night, the place seemed abandoned, which was strange but no complaints from me on that. Our server (Dave) was outstanding. He had many suggestions and was attentive without being annoying. Probably the best service I have had in Cleveland. 

I started with the African peanut stew and while I thought it could have used a tad more curry for bit more of a kick, it was such a yummy and unique dish. Perfect start to a phenomenal meal. Next, I had the Korean fried chicken served with rice. The rice had a hint of lime and was so moist and light, I loved it. The chicken was out of this world!!! So crispy without being too fried and extremely flavorful. 

I'm not vegan or vegetarian, but if that were to have been the case, there would have been plenty of delicious options for me. This place is truly one of a kind!!! I enjoyed every bit of my experience."}
{"text":"Holy FREAKIN COW! This is a good as it gets Downtown. Plain and simple. 

I highly recommend the Tuna Sandwich Deconstructed. It is a smaller plate, and make sure you know its deconstructed....aka- all pieces are separate. I know that sounds like you should know, but the server said a lot of people didn't. Anyway- its mostly filling (enough that you aren't stuffed, and leave satisfied. I like this! )could use a little more to meet Cleveland's hunger standards... but beyond amazing. If the garlic aioli were human, I would consider marrying it. One of the best meals of my life.

My dining partner in crime had the Vietnamese Flank Steak, she is obsessed with the sriracha mayo. She also got the Hand Picked Ohio Lettuce with goat cheese and sunflower seed brittle. 

Also- if you do not get the fresh Strawberry Lemonade, you are a fool. It is pureed, so part lemonade/part smoothie. 

Odd element: they sometimes play cooking show audio on the speakers... sounds terrible, but I really really enjoyed it. Something that really stuck out to me as unique & enjoyable.

PS- they do have vegan and veg. options!"}
{"text":"This past weekend a friend and I tried this restaurant after spending some time downtown.  I had never been before but she had.  While it is in kind of an odd location (a good walk removed from the activity down at Playhouse Square) I feel it is certainly a worthwhile trip.  The food was good, the service was good, and the ambience was very modern.  The colour-changing ceiling was a bit distracting but unique and interesting.  Overall an asset to the downtown dining scene; I'd definitely recommend it!"}
{"text":"Maybe it's just because I've been out of the country... but everything was very rich. I had the peanut stew - and it was like a peanut sauce (that rich and sweet). Good - but very intense. Same for the hummus bowl - ricotta underneath, pesto on top. Very rich. The bread was done well, good bread crisped up. 
My friend had a blt... and I had a bite of her bacon - covered in a sweet sauce. 
Just all too over done for me. Very sweet and rich, all of it."}
{"text":"Had the African Peanut Soup and it was very good. It's rich but not heavy.  Bamboo rice was a nice side. Braised Kale was just okay, could use some flavor. Ask portion size before ordering dessert, I ordered a vegan cake dessert and it was $9 and the size of two brownie bites."}
{"text":"This place is crowded for lunch, but wide open for dinner.  Take a break from your usual downtown dinner spots and give this place a try--you will not regret it!

I've passed by this place so many times without even thinking of going in.  Wow was that a mistake.  I went to their gluten free dinner with my mom (she can't have gluten at all) and I was thoroughly impressed with the food and service.  This is now on my list of regular dining options when I want to eat out.  

The space is open, clean, and modern.  The floors are bare concrete, polished and stained, and the ceiling masks the industrial elements with vertically hung linens that create a nice pattern.  The decor gives it a slightly fancy feel without getting stuffy.     I wouldn't call the place upscale in terms of decor, more trendy and modern if anything, but the food quality is very upscale.  Service was fast, attentive, and very personable.

The food is chef-driven, from scratch, and brought from local farmers.  The menu rotates seasonally.  Everything I've had looked and tasted very fresh.  All the items were expertly cooked and plated--I felt like I should be paying much more for this food.  While this falls into the Yelp catchall of American (New), the dinner menu is not made up of the standard Cleveland items every restaurant around the town seems to copycat these days.  Finally, a place that's NOT pushing the tired and overdone dishes of mussles, hanger steaks, and pomme frites.  

While I've had great food over the past year in Cleveland, nothing has made me really look at a menu and feel like I got something new, special, or different within the modern American classification of things.  That changed when I hit Pura Vida.  Executive Chef  Scott Coffman displays a lot of skill with his menu, preparation, and plating that sets him, and Pura Vida, apart from the rest of the Cleveland pack.  Pura Vida sits up at the top with the major players in the Cleveland scene for me."}
{"text":"I was in my wonderful hometown of Cleveland for a conference and took some colleagues here for dinner. 

Cons: Our server couldn't describe any of the wines to us and made no effort to find someone who could. I ordered by guessing and ended up with a wine that I recognized from the endcap of my liquor store (in other words, a real cheapie). I ordered the scallops with sweet potato gnocchi (I think it was a special), and while the scallops were good, the gnocchi was very dry & hard to swallow.

Pros: Our server was nice, and we had a couple other very nice people descend upon our wobbly table to fix it and to clear our plates and offer us dessert. The vibe in the place was good, and I loved that they had an old May Co. sign over the bar. Gave me warm childhood fuzzies!

Overall an OK place, but not sure it's worth the price. You're in a fantastic location, Pura Vida, and have the opportunity to impress a lot of out-of-towners. Try a little harder and make Cleveland look like the great place it is!"}
{"text":"Was visiting from out-of-town and decided to try Pura Vida after seeing some good yelp reviews. I thought it was great! I tried the shrimp and corn chowder and the poboy. Both were excellent. I would definitely come back and try more stuff on the menu if I visited again. The vibe was upscale but in a relatively unpretentious fashion. All in all, definitely worth trying!"}
{"text":"Stopped in before a Cavs game and was pleasantly surprised! Great healthier selections on the menu and full bar menu as well. I had the Veggie Big Mac and it was excellent, probably the best veggie burger I've had. The side of rosemary fries was huge and great as well! Very tasty soup of the day and a nice atmosphere, would recommend."}
{"text":"Such professional from a company. (That's sarcasm)

Getting married this coming July, and originally wanted to use Pura Vida to cater my wedding. I had asked the private dining manager to get a quote together for me. She originally cancelled on my first meeting, and we rescheduled. Not a big deal at all, but in in that time frame I ended up booking another wedding venue that had an exclusive catering contract with another company. 

I still wanted to use Pura Vida as a catering, so had asked them to put together a quote for me for my bridal shower. The private dining manager... (who gets paid to put quotes together mind you) responded with a message saying she \"wasted time on my reception shit\". *See Photo*

If you want a more processional company to cater for your big event I'd look elsewhere. I guess it's asking too much to get a quote from the private dining manager."}
{"text":"The blackened trout was divine. The per pirogies were a little thick but still great. The atmosphere is fun and you can watch the cooks from the culinary school next door. Fun experience."}
{"text":"We absolutely loved this restaurant!  We arrived on a Friday night with reservations and were seated right away. 
The bread board with shaved butter and onion bacon marmalade is to die for!  The chickpea jar was really good too with fresh toasted bread.   Do not miss the bacon onion marmalade!!!
The entrees were all great...the salmon with the Mexican creamed corn was fresh and flavorful.   The pork chop was served with spinach and perogies- fabulous.  The chicken fried cauliflower was so good and so was the vegan biscuit!!
For dessert, we split the s'mores hand pie...what a treat.
Highly recommend this restaurant!"}
{"text":"You know how you go to an amusement park and you're all excited to ride rides but then reality sets in and you realize you'll end up spending 90% of your time standing in lines waiting just to get to the excitement? Pura Vida is pretty much the culinary equivalent of Cedar Point.

It was our first visit. It was a Saturday afternoon, 12:45 reservation for 4. After arriving it was clearly evident that the reservation was not necessary. The location of the restaurant is great, right downtown, in the middle of everything, public square, Soldiers and Sailors Monument, Terminal Tower. It's the perfect place to experience old and new Cleveland at the same time. We walked in and waited. I think I see the problem. There was a table of 10 that was clearly the focus of the staff. Eventually a hostess came up to us and unsmilingly asked if we preferred inside or out. Her unhapppiness was palpable. The weather was pleasant enough so we opted for the latter. Mistake #1.

First, I have to recommend against dining outside at this or any other establishment on Euclid Avenue. Between the RTA buses belching exhaust and unloading dozens of people right next to the patio, the rumble of the ventilation fans, honking horns, shouting pedestrians, and general clamor of the city you can't hear yourself think let alone carry on a conversation at anything lower than a shout. Just sit inside, trust me.

Now for our service experience. I think that Pura Vida has inadvertently stumbled upon invisibility cloaking technology. That has to be the only explanation for what we were to experience. It was like our table had vanished. Our dining experience was to be a Master's course in waiting...and waiting...and waiting. From beginning to end it was a two and a half hour marathon lunch. No, I am not exaggerating, and the actual eating portion accounted for roughly 45 minutes of this total. 

It was 20 minutes between drinks and our server taking our order, 40 minutes to get a couple of sandwiches and a salad, 20 minutes after asking for to-go boxes, and another 20 minutes waiting for the check. Members of our party were never asked about more wine/beer, a bottle of water was dropped off at our table so we refilled those on our own, thankfully. Save for the aforementioned table of 10 the place was practically empty. This had to be among the worst service I've ever experienced at a restaurant of this quality. There was, however, a saving grace. The food.

If it weren't for the food I'd have dropped a two-star on this place and been done with it. But the food is actually pretty damn good.

African peanut stew - A cream-based, red curry soup with kale, sweet potatoes and peanuts. I loved this stuff. A thick soup with chunks of sweet potato, it had just the right amount of heat and sweetness. I could have eaten two bowls.

Spinach Salad w/Grilled Chicken - The salad was yummy and I really dug the raspberry lavender vinaigrette (a bit heavy, though). The spinach was fresh and the goat cheese, almonds, red onion and cukes all played well together. Unfortunately, the chicken breast tasted like it had been cooked - twice. Dry, chewy and tough to cut. It was a disappointment.

Pura Vida Burger - My wife loved this burger. Served on a buttery, toasted brioche bun, it came cooked mid-well as she asked, had tons of bacon and pickled onions and the pimiento cheese, c'mon. As an addition, she had the mac and cheese which was also well done - creamy, rich and sprinkled with cheese cracker crumbs. Carbolicious.

Pura Vida Cuban - A high-end take on Cuban comfort food. Served panini pressed it was stuffed with slow-cooked pork shoulder, prosciutto, pickles, stadium mustard and Swiss cheese. It was oozy, salty, crispy and delicious. My father-in-law loved it.

Cast Iron Cleveland Chicken Dip - Want a way to easily blow your healthy eating plans out of the water? Order this beast. It's a cheesy, melted potful of shredded chicken goodness spiced with Sriracha and garlic and topped with chopped scallions served with a trio of soft pretzels. This dish is helping to keep the Cleveland Clinic cardiologists in business.

Pura Vida is hip, way too hip for someone like me, that's for sure. It's decorated with a marble bar, seductively-lit fabrics hanging from the ceiling,  straight lines, concrete, chrome and lots of gray. Cleveland needs places like this if it's to ever shake off the rust. It's also got a chef that knows what the hell he's doing. Creative dishes, locally-sourced ingredients, well-executed. It's too bad our experience was tempered by lackluster and nearly absent service. If I'm paying $15 for a burger I have expectations. The weren't met. If anything draws us back, and this is a maybe, it would be the food. I'll just have to remember to allow for three hours..."}
{"text":"We stopped in for dinner before seeing Coldplay at the Q.  The atmosphere is clean, open, modern, and spacious.  We were impressed by their attention to one of our party's food allergies (dairy).  We ordered their Veggie-version of the Big Mac and fish tacos.  Both were super delicious and tasted for fresh and light.  It was a perfect way to start our night."}
{"text":"I loved this place. Really good atmosphere. Classy, sophisticated feel, but uber chill and nice, easy/going feel. Loved that there were vegan and vegetarian options, and more than your basic Americanized food options on the menu. Interesting combinations, and not too too pricey."}
{"text":"I have actually been putting off my Pura Vida review because it was so good I don't really even know where to begin. It was a bitterly cold valentine's day, so a lot could have gone wrong. The food was so delicious though we didn't even care that our skin almost fell off on the walk over.  

Seriously though it's hard to review something so good. I'm realizing a lot of my reviews lately have only been super positive 4/5 and 5/5 reviews, and people may start to think I'm just lying to help the businesses. I can honesty say this one deserves every star it gets. The peanut stew was probably the most delectable thing I have ever put in my mouth.... But seriously. It was rich and creamy with just a hint of spice. A totally unexpected winner in my book. If you go, just bite the bullet and get some for an appetizer. I can assure you, you wont be disappointed (unless you have a peanut allergy, then you will be seriously disappointed that you can't have any).

The vegan pot pie was better than any meat-filled pie I've ever had. In all seriousness, my boyfriend ordered this and isn't even vegan. He said he would order it again over a meat dish any day. It's that good people!

Their wine selection was pretty spot on, and their beer menu wasn't bad either. Their blood orange cocktail is something I would seriously consider ordering agan. On top of that the ambiance of this place is just out of this world. Literally. Its futuristic modern at it's best.

Starting to think Pura Vida needs to become a valentine's day tradition...."}
{"text":"We stumbled on this after a baseball game.  The front is not very inviting and not a place to find the normal baseball crowd.  But the staff was super friendly.  I got the Vegan Big Mac.  i have sesame allergies and they had a nice non sesame bun, which was very nice.  If i were in Cleveland more, this might end up being one of my 'places'.  Relaxing, polite, fun and great food.  but if you want to watch a game at the bar, go down to E 4th!

:)"}
{"text":"I hardly know what to add here. Ive sampled much of the menu especially the desserts. The bar has a great selection of everything. Its in a great location and very chic."}
{"text":"Excellent for fish, vegetarian, and vegan options. I loved my risotto. Food is beautifully presented.  \"Trifle\" was just cake layered with coconut \"custard\" but was pleasant if unremarkable. Ambience is clean rather than cosy."}
{"text":"We just had an excellent made from scratch lunch!   Our waiter, \"The Food Ambassador\", was truly great with recommendations and attention.  I highly recommend trying Pura Vida!  Enjoy!"}
{"text":"I went to Pura Vida on a Friday night.  I was instantly seated.  The table had a glass bottle of water, always a nice touch.  The waitress, Belle, was extremely attentive. I explained to her that I am striving for a vegan diet and instead of the typically eye roll she jumped into the menu options with enthusiasm explaining the many option that Pura Vida offers for vegetarians and vegans.  

I started with the bread and butter and subbed the butter for garlic hummus.  This dish was also served with radishes, pickled onions and an olive tapenade.  The bread was warm and toasted with burnt edges... Perfection!  

After the bread, I was served the African peanut stew.  After my first bite I was flooded with instant regret! Why did I just order the cup and not the bowl?!  The thick and creamy (rarely obtained when eating vegan) base of the stew was complex and intriguing. Each bite would offer chunks of sweet potatoes and kale.  Rarely is super food this delicious.  I was trying not to lick my cup in public.

Finally, I was served the main course, vegan vegetarian stew. I was really on the fence about ordering this dish as it is not my style. The waitress assured me that it is very popular and actually quite light for a stew.  The stew had beans, peas, mushrooms, carrots and other seasonal veggies in it.  At first I thought I would starve to death but by the time I was halfway through my dish I was extremely full. This stew was hearty, flavorful and extremely fulfilling.  Every aspect of my experience at Pura Vida was amazing."}
{"text":"I really love this place for their vegetarian and vegan options. What I will say is that there aren't a ton of options but the ones that they have are the bomb.com. my favorite thing was the crispy mushrooms and the veg Mac which is the vegetarian version of The Big Mac. And let me tell you they actually have a Mac sauce and it tastes pretty similar... just saying. They also have vegan desserts I personally had the chocolate cake with the vegan caramel sauce and it was so good. Also the atmosphere of the restaurant is really cool it's sort of feels upscale but not in a way that makes you feel out of place if your casually dressed and just walked in off the street but it's a really cool place and I definitely suggest going. order the veggie Mac and the crispy mushrooms"}
{"text":"I returned to Pura Vida on a Friday night, this time as a party of 8.  The quality, attentive service, (Thanks Jen C.!), and atmosphere were completely spot-on, as they were the first time around. 

I have to recommend the Delmonico, which was prepared to a perfect medium and featured a great paprika / onion / butter sauce.  

Keep up the great work, Pura Vida!"}
{"text":"Usually for a high end fancy restaurant, its almost unthinkable to give anything less than 4 stars. Hate to be a trendbreaker, but there's a few good reasons why I might not come back to this place again.

This weekend is graduation weekend (finally done with Med School!) and my family drove over to celebrate. Service was excellent and the waiter was extremely helpful in answering all the questions. Setting was quite elegant and you can also sit outside, but we didn't because it was still a bit too cold.

The reason why the stars are so low is because ultimately, if all the dishes kinda taste like the same oily mess later on. A danger a lot of American resturants have is that there is a lack of a delicate taste. Too much cheese in one, too much oil in another, which is fine if it still tastes good. But in this case, my entire family thought that the food tastes rather insipid after a while.

We ordered 2 appetizers and 5 main courses, which we all shared.  The appetizers (fried duck wings and a cheezy dip with soft taco shells) were really good. But this is because we were also really hungry. 

None of the dishes were bad per se, but the thing is, the less hungry you get, the more easily you realize that all you are tasting is just grease.

So when we got to the main courses (oxtail empenadas, brisket stroganoff, short ribs, a special of fish wrapped in bacon over sweet potato hash, and the burger), it just tasted...really flavorless. Like everything was lost of oil and you get this sick kinda feeling.

The oxtail empenadas probably was the worst dish out of the bunch. The oxtail meat was really stringly and tough and chewy. The empenadas were over a bed of mixed beans that were really tough to chew as well. Ugh. The ribs were OK, and teh stroganoff was pretty good. The burger was mediocre. 

But after sharing these dishes, my family was trying to convince me that the dinner was pretty good. You know its not good when your MOM is trying to sweet talk you into thinking that the restaurant you picked for once is good and worth the price. 

Anyways, you'll probably like the food here. Actually im sure you will like the appetizers, but if you eat too much....well just dont eat too much and you wont get nauseated by the oiliness."}
{"text":"Great food and atmosphere... Just a little bit pricey once you add in any sides. We both got the Big mac look a like with rosemary fries and ice teas. We heard the Big Mac veggie burgers were a good choice. They were wonderful. Food was excellent. Total bill was $38.34 which is a bit more than I am use to paying for lunch downtown but the quality was there and the iced tea was quality too."}
{"text":"When traveling, it's hard to find a restaurant with vegan/vegetarian options. However,  this place combined excellent flavors and ideas together to make a fabulous meal. I was very pleased they had an entire menu devoted to people who don't eat meat. 

I opted for the pot pie which was fantastic.  Basically it was soul food without the heaviness or the guilt. Which allowed me to feel guilt free and order dessert. The smore hand pie is THE BEST. It comes with a marshmallow gellato. Pair that with a coffee and it has me writing a review a day later in New York."}
{"text":"Why is this place empty for dinner - the food is FANTASTIC!  

After walking through the soup that was the weather last night, we decided to not make it to our final destination and popped into Pura Vida for some air conditioning and drinks.  We left three hours later.  The whole experience was so lovely, we didn't want to go!  Reason enough to go visit is to hang with their lovely staff.  Friendly bartender Derek made us some special drinks the kitchen sent us over sample small plates!  They made us feel very welcome and loved.  

In terms of the food, one must try the Wheatberries Salad.  Not only is it delicious and full of edamame, herbs and black beans, but it's an ungodly large portion!  I'm enjoying it again right now as I eat some lunch at my desk :).  

Visit - soon!"}
{"text":"Breakfast doesn't get any better in Cleveland than Pura Vida.  I know... bold statement you say?  Go ahead and try to challenge it.   I know because I've been searching for the best, the freshest, the perfect combination of quality, service and deliciousness.  I hadn't found it until I made the walk to public square to see what Pura Vida was all about.

Walking in on a weekday, I was promptly greeted and ushered to a table of my selection.  The decor is modern, yet comfortable... reminded me of a nice breakfast or lunch place at a 5-star resort in Las Vegas.  Certainly not tacky.  

The menu has something for everyone.  The breakfast staples, and the Pura Vida specials.  I opted to go out on a limb and try what the waiter suggested: the \"house-cured salmon & poached eggs\".  It arrived to the table like a photograph, perfectly prepared and stacked like a work of art.  As I cut into it the freshness was evident with the sound of my knife cutting into the bagel chip \"panzanella\".  It was a perfect blend of flavors with the salmon, poached eggs, the whipped boursin cheese, tomato, and bagel.  A nice, fresh large portion and therefore I was satisfied.  

Now, I know you might not walk into a restaurant for breakfast and want to opt for such an extravagant item.  I agree.  It must be noted I opted to order that knowing my fellow diner would be ordering the french toast with pure ohio maple syrup.  Something that I had my eyes on, when I first looked at the menu.  It arrived three large, thick pieces of french toast stacked on a rectangular plate.  With the side of pure ohio maple syrup and house-made butter.  I immediately, made my interest in my fellow diners french toast, as I requested an extra plate from the accomodating server.  And suddenly, her 3 pieces of french toast were down to two as I acquired another level to my breakfast.  

The french toast is the best classic style french toast I have had.  The maple syrup and butter add some great flavor and it is a very large portion with 3 large thick slices.  

My fellow diner also ordered a side of 2 eggs scrambled and bacon which came in a skillet, prepared perfectly.  The menu said it would be 2 eggs, but it came out more like 4 or 6 eggs.  

Pricing-wise the salmon and poached egg bonanza was $12.25 and for the portion size and the amount of salmon, I think this was appropriately priced.  French toast was a steal at $4.95.  The egg side was about $3 and the bacon is an additional $3:50.  

Overall the pricing is higher than your greasy mom and pop breakfast spot, but in no way unreasonable or too high.  A real winner in the heart of downtown.  There is indoor and outdoor seating.  Next on the list: the pancakes and the egg white omelet.  A tip of the hat to Pura Vida!"}
{"text":"Yay! I'm a fan! 

I've had this place bookmarked for ever so I was very glad when we came here for May supper club so I could finally check it out! Listen, I know coming into the city seems like a hassle for some, but it's worth it! I had no issue with traffic and scored a free parking spot on the street just a two minute walk from the restaurant. I got there around 5:30 which was just in time to enjoy their happy hour specials at the bar (HH is 4-6pm). Right off the bat we had excellent service! I think her name was Lilly or Libby? and she was on top of her game the entire time we were there. She knew about the menu, was friendly to chat with, and kept our orders right even though we moved from the bar to a table and split dishes. 

As for decor, I'd say this place is sleek and modern with an alluring vibe to it. They have a bar, single tables, and a big table off to the side that is partly covered with a chain curtain for a private party/more intimate feel. The high ceilings are draped with fabric and are light up. Just a cool place. Now, yes it's pricey, but you're downtown! Come on, it is what it is just enjoy the experience while you're there. And let's be real, the food is good. You're not going to regret anything. 

Speaking of food:
*Happy Hour Chickpea Jar $6 - Basically a hummus dip that you spread on warm bread. Very tasty and plenty enough to share. 
*Happy Hour Veggie Big Mac $6 - Great flavors, just a little on the mushy side for me. However that might be because we talked a lot and so it sat for a while. 
*Happy Hour Cocktails $8 - For HH you get a dollar off of the cocktails. I thought the strawberry smashers was refreshing and tasty. The blood orange cocktail was just okay.
*S'mores Hand Pie $9 - OMG AMAZING! Seriously really good, the stuff your belly dreams about. 

I would love to come back and try the salmon entree and some of their other dishes. A bit disappointed that they no longer have the bacon jam to go with the bread board, but eh you can't miss what you don't know. I also like how they have plenty of vegetarian friendly dishes so both meat and plant eaters can come here and be satisfied. 

The only weird thing is that they were not busy at all. Like I know it was a Wednesday evening, but just odd that there were only two groups dinning here. I am guessing people are just intimidated by the parking and prices, which is a shame because this place really is great. I know I would definitely come here again for a special occasion. If they pushed HH to 6:30 and added more food options I'd probably jump at meeting friends and lovers here after work."}
{"text":"On my last night in Cleveland after multi-day training, I decided to venture out into town by train. I had hoped to check out a vegetarian-friendly Latin American restaurant in East 4th St, but no go; restaurant was closed between a tequila tasting and the later start of the dinner hour. Bummer! Using my trusty yelp app, I found this nearby vegetarian-friendly restaurant, which also happens to be omnivore-friendly as well. Win win win for all sorts of diners! I was debating between Jamaican jerk tofu kabobs and \"chicken\" fried cauliflower; but once I heard the sweet potato gnocchi special, I was sold. The special did not disappoint; I loved the complements of the roasted tomato and mushroom with goat cheese. Wow! I made some room for dessert, the smore hand pie. Oh my! I think I joyfully overdosed on the sugar, so good! With the marshmallo gelato, salted caramel, and the handmade smore pie. Winner! Very happy to end my Cleveland trip on this gustatory note."}
{"text":"Overall, the experience was very pleasant but not overwhelming. The feeling of Pura Vida is warm and inviting, beautiful photography and lighting. 

The food, mediocre. The butternut squash bisque was reminiscent of Velveeta cheese sauce. The presentation of the veggie Big Mac was the highlight, served in a mcdonalds style box. The shells and cheese were flavorful with the goat cheese giving it a unique twist. 

Service was slow but waitstaff was nice and friendly. The price of the dinner was quite reasonable."}
{"text":"Nothing wrong here but nothing spectacular either.  The atmosphere is cool - nice and lively without appearing to try too hard.  My food ranged from really good to just OK.  Again, there was nothing bad here but nothing that makes Pura Vida a destination for me the next time that I'm in CLE.  I had the queso fundito as an app and it was really good.  My entree was halibut (which was a special) and it was average at best.  One other in my party had the same and we both found it to be a bit \"tough\" in texture."}
{"text":"I had a fantastic experience here recently.

The patio is wonderful, great for people watching. It's literally on Public Square. The inside was lovely too. Classy without being even remotely stuffy or formal. The restrooms were very clean and the open kitchen is a nice touch.

The service was wonderful. Our waiter was friendly, attentive (without being overly so), and helpful. 

There were a lot of affordable options on the wine list and the white that I shred with my dining companion was inexpensive and perfect- neither too sweet or too dry. It was featured under their Interesting Wines section.

The salads that we ordered were fantastic. I would guess that all of their salads would be as such. My friend had the bacon and fixings for her entree, which she really enjoyed. Its presentation was wonderful. I had the duck confit nachos. They were delicious. We shared a side of their jalapeño and caramelized onion man & cheese as well, which was some of the best mac & cheese I've ever had. Everything was extremely affordable, particularly for the high quality. 

Be sure to check out Pura Vida if you get the chance!"}
{"text":"Summary of our experience today: overpriced small lunch portions, average taste and mediocre service. The vegan tostada at $16 should be reclassified as an appetizer or re-priced, not enough substance there even for a light lunch."}
{"text":"My experience at Pura Vida was awesome! The service was attentive and the food was amazing. I highly recommend the s'mores dessert! So yummy! Will definitely be back!"}
{"text":"Awesome cocktails and food that is simple amazing. Come here a few times a year to get my vegetarian on. Peanut stew is a classic"}
{"text":"I was on a first date & we had very limited time (like 30 min to order and eat!) in order to make it on time to Wicked! Our waitress was on top of it! We ordered the PV burger and the Chicken Cavatelli. I'm a omnivore but I'll be honest - I'd order the PV burger over the cavtelli next time! The Cavaatelli needed something ... bacon? Pepper? Idk. But it was a little bland... but the PV burger was loaded with flavor! The collard greens (which I've never tried) were also very good! 

I'd definitely go back and try other items on the menu! A solid choice when dining DT CLE!"}
{"text":"This place is amazing. The walleye fish tacos were fantastic. My vegetarian hubby enjoyed the veggie big mac. Great service & fun people watching out the picture windows."}
{"text":"The food weren't bad, but it didn't meet my expectation. 

We ordered shrimp and corn chowder, blackened walleye tacos, and vegan torta. 

Don't get the shrimp and corn chowder! The chowder looked great. I REALLY wanted to love the chowder because it had all the ingredients I loved, but it just wasn't good. The first couple tastes were alright. But the more I ate, the saltier it got. When I got through half of the bowl, the chowder was so salty that I just gave it to my boyfriend and see if he could finish it. Even though he ended up finishing the chowder, he also said it was a little too salty. 

The vegan torta was alright. The bread was amazingly crunchy, but that's about the only part I loved about this torta. I didn't know exactly what to expect since Tofu was the main ingredient. I was really hoping that they would be able to do something amazing with the tofu and deliver a unique taste. But there weren't a lot of flavor to create any taste for me, so it was kind of bland. But I'd take bland over too salty any time. 

The blackened walleye tacos were good. They weren't amazing, but they were the best out of what we ordered. 

Maybe we are not ordering the right stuff that represent the restaurant's quality. But based on what we ordered and ate, the restaurant seems overrated and we wouldn't purposely come back here to eat again."}
{"text":"Awesome spot for lunch, if a bit spendy for an everyday experience. Great service, nice outdoor seating and very fresh food. Split one of the salads and the lunch box special. Salads are easily a full meal with generous protein contribution and the lunch box gives you a bit of everything you could want! Great french fries as well."}
{"text":"Pura Vida has a strong Vegan/Vegetarian menu with gluten free options as well.  Portion sizes are substantial and prices, reasonable.  Quinoa salad was enough to serve as an entree. We will return to further explore the not so conventional menu."}
{"text":"Lovely chic restaurant with excellent service and food.  A very calm environment with an exciting menu.  I would eat more salmon if it was always cooked like this!  Bravo!"}
{"text":"I don't often eat meals without meat. I make a concerted effort to avoid bad choices like that. My food pyramid is weighted something like 75 percent formerly living, 25 percent other. But recently I've been experimenting. 

Yesterday, I walked into Pura Vida and let my intrigue pick off the menu. I chose a veggie Big Mac and the African peanut stew. The Big Mac, well, it was just fine. There's only so much upside for a veggie burger, even if it's trying to replicate one of science's best discoveries of the 20th century. With most vegetarian food, I've learned, you're not searching for a ceiling but a floor.

The stew, however, was surprisingly delicious. Chock full of peanuts and sweet potatoes, it's probably one of the best dishes I've had lately. It was so vibrant and tasty that I might just get it again before I leave. Like Columbus accidentally finding America, this was truly a great discovery.

I can't say I'll be eating off the vegetarian menu more often, but perhaps it's not the barren wasteland I always assumed it was."}
{"text":"Surprisingly, almost empty on a Saturday night -- baseball championship to blame. African peanut stew, pumpkin risotto and chicken-fried cauliflower were excellent. So was the service. Some of our group had gluten allergy and the staff prepared bread & veg platter accordingly. Classy, modern interior at street level overlooking Public Square and its new fountain."}
{"text":"Been there twice, both times were rather yummy and the service was up there. We eat out in Cleveland often and unfortunately are disappointed often so this is turning out to be an option for possible reliable, good, and consistent food and service."}
{"text":"This was a disappointment, and I have tried it a few times.  Downtown Cleveland has SO many more worthwhile places with creative, memorable cuisine.  I will grant that Pura Vida's items are made with high quality ingredients...but in my experience, Pura Vida's concepts are far better than the actual execution of them.  It is way overpriced for what it is.   The \"big mac\" was a big disappointment - just buns, cheese, and a vegan patty with a smattering of sauce...I couldn't believe it was over ten dollars for a fast-food level sandwich.  And I also found the Nigiri quite dull - you could throw some seaweed on rice yourself for less than a dollar.

I was impressed by the lovely setting, right on the square."}
{"text":"We have now been here several times.  Had our family in from out of state for our pre-wedding dinner this year.  Service, food quality, and attention to detail are always superb.  Our reservation planning was very cordial and cooperative.  These folks are professionals.  Chef Brandt surrounds his efforts with great people, and his approach to taste, from the food to the decor, is inimitable.  This is simply a great place to show off to friends, business associates, or for a nice meal before a show or trip to the casino.  One of the best values in downtown Cleveland for both experience and flavors."}
{"text":"I was the last person in my office to experience Pure Vida....until now!  My boyfriend and I decided to have dinner at Pure Vida before the Indians Game since it was close to the casino (we had been gambling a little).  Just in case, I made reservations for 5:30 PM because I didn't know what to expect since it was a beautiful Saturday evening.  Turns out, I probably didn't even need one, but you never know!  Started off with African Peanut Stew.  I am not a fan of ordering Vegan dishes when I go out because I am a meatatarian, however this stew changed me.  It was a creamy delicious blend of peanut, sweet potato, cumin, greens, and other comforting things.  The perfect combination of sweet and savory.  I only had a cup, but I wish I had ordered the bowl and just ate that for my dinner.  For my main course I ordered The Roasted Chicken Papradelle.  Kudos on making the pasta in house, I always have more respect for places that do that.  Overall I really enjoyed my meal and excited to try the other starters on the menu.  That African Peanut Stew though......can't get it out of my head!"}
{"text":"Pura Vida is so wonderful. This restaurant never disappoints. Simply put, the food is ridiculously good. I feel like people get discouraged by their parking situation-- but don't. Figure it out. This is the city!

The interior is so unique. I'm not even sure how to describe it, but the atmosphere is very sexy. The entire place has a lighted purple hue to it. The ceilings are high and full of artistic drapery. The seating is comfortable, there's always good music playing, and it's quiet and inviting. It's a wonderful place that can be romantic and intimate or an energetic girls night out... it just depends on your company. Someone poured a lot of time and energy into making this place so chic.

Probably the best thing about Pura Vida is that they have vegetarian, vegan and gluten-free options. Everyone in your group can find something delicious on the menu! I'm not even vegan, but I love the Vegan Nachos and the \"Fried\" Cauliflower dishes. They change their menu seasonally and the dishes are always creative and flavorful. At Pura Vida, even a simple salad is packed with punchy flavor. Their chef clearly knows what he or she is doing. The wait staff always go above and beyond and the drinks are always s-t-r-o-n-g. You honestly cannot beat this foodie haven nestled right off Public Square-- stop by and give it a visit ASAP!"}
{"text":"I went for lunch, sat at the bar, and had the blackened walleye tacos.  They were REALLY good and reasonably priced.  The homemade Gelato was off the charts.  Finally, the service was excellent.  Overall, a terrific lunchtime experience."}
{"text":"I was very excited to finally try this place out! It's hard to find a restaurant in the Cleveland area that caters to vegetarians,vegans and carnivores. Definitely was blown away by the separate menu for vegetarians/vegans...so many options!

We started with Butternut squash- smoked Gouda fondue, which any lover of cheese will enjoy. Nothing spectacular, but definitely enjoyed the subtle sweetness from the squash. It did have a slight floury taste...which I'm guessing came from the flour not being cooked out enough during the roux stage. The cranberry-walnut rolls were delicious...just wish there was a little more. The Asian pears were ripe, as well as the apples. But again, more bread would've been spectacular! 

I ordered the gnocchi., which I was hesitant about. There's a restaurant that makes the most unbelievably delicious gnocchi dish, so I'm always afraid of being let down when I order it elsewhere. Unfortunately, Pura Vida's gnocchi confirmed my fear. They were slightly chewy, dense and a little dry. The balsamic glaze was good, just wish there was more of a sauce to take away from the dryness of the gnocchi :/  This definitely isn't going to deter me from coming back and trying something else!

The star of the meal was definitely the Pb&J dessert....so good. The chocolate cake was so moist, and the PB filling was so smooth and delicious, without being too rich and heavy. Definitely ordering that again!!

Service was friendly and helpful. Definitely can't wait to try this place out again!"}
{"text":"EDIT: After writing this review, the owner of the restaurant contacted me himself. He offered to cook me a gluten-free tasting menu... needless to say, I was happy to give the restaurant another chance!

The experience was AMAZING. I have never encountered a restaurant that cared so much about their guests ... especially ones with dietary restrictions! The tasting menu was DELICIOUS and the service was phenomenal. 

If you have celiac disease or a gluten intolerance, just make sure to be clear with the staff (and even ask to speak to the chef)! Pura Vida will not disappoint. :) 

The only hiccup was that our food was served on wooden platters, which are a porous material and can absorb gluten and lead to cross-contamination issues (as silly as that seems). No one got sick after this experience, but the restaurant might want to consider a different surface when serving GF options. :)

----

WARNING: not celiac friendly! 

I was excited to go to Pura Vida, as I was going to be dining with a guest that has celiac disease, which makes eating out bordering on dangerous. However, the restaurant touted its ability to cater to food allergies and special guidelines. Unfortunately, there was a cross contamination issue and my friend became very ill after eating there.

We ordered the Pura Vida Bacon appetizer as \"gluten free\" and without the bread; I told the server to inform the chef that one guest had celiac disease. I mentioned to her this is not just a gluten allergy and much more sensitive. She checked twice and informed me it would be fine. 

The appetizer came out with the vegetables, cheese and bacon on the same platter as normal (gluten) bread. Everything was touching. In at attempt to salvage the situation I pointed it out to the server who assured me they took steps to separate everything. Then, I ordered additional cheese that wasn't contaminated by bread. She also brought out extra gluten-free bread. 

The bacon was superb... but, the damage was done. The bread was put on the same plate as other food items and they must have touched, the other guest became ill from reacting to gluten after eating at the restaurant.

It's a shame because the food was GREAT otherwise; they even had multiple gluten-free beer at the restaurant. I would just love to see Pura Vida be more educated and careful when it comes to eating restrictions. :("}
{"text":"This place is a bit of a hidden gem.  Came here for dinner on a Friday night and the place was practically empty.  I had the Korean style short ribs and my girlfriend had the Bahn mi.  Neither tasted like the Asian dish as was advertised, but both were quite interesting (and tasty) twists.  I also really liked my shrimp chowder.

This is also the first restaurant ever to call me up in advance of my reservation and ask if anyone in my party (of two, mind you) had any food allergies.  I guess it shows that they do care."}
{"text":"I am the pickiest person I know and I must say, Pura Vida is fantastic. My husband and I had our rehearsal dinner there and they did an absolutely wonderful job. The staff was excellent - friendly and on their toes the entire night. The food was fabulous and the night could not have gone smoother. I highly recommend Pura Vida for both a great place to eat and a great place to host a party."}
{"text":"Can't say I've ever had a bad meal here. Pura Vida never disappoints when it comes to flavor and quality! Although the plates can get a little pricy (sandwiches and salads not bad), I would consider that a norm for the area and peer restaurants. 

Great atmosphere inside and the patio overlooking public square in the summer is great. Nice bar area as well! Highly recommend checking this place out if you're looking for some major flavor and all around great food! The lunch box special always seems to be a crowd favorite."}
{"text":"The reviews looked good, but as we got to Pure Vida's front door, we saw that they were closing at 8:00. It was 7:15 PM on a Saturday evening. Why bother? We went elsewhere, in the Tremont neighborhood. What closes so early on a Saturday night? Pure Vida."}
{"text":"We started with the chic pea jar, which is just as fun as it sounds! Layered hummus, ricotta, basil pesto, olive tapenade and yellow tomatoes served in a fabulous mini mason jar alongside crispy grilled bread. 

For our main course I had the pumpkin risotto which was rich and creamy, with asiago cheese, leeks and had a nice balance with crispy Brussels sprouts & a pear/cranberry relish. 

The decor was interesting and fun-- shabby chic curtains alongside rustic mason jars filled with veggies. We had excellent service; our server knew the intimate details of the menu very well, gave us great advice and moved things along at a nice pace so that we could make our 8pm show at playhouse square. (By the way, there is a free trolley that picks up near the restaurant and takes you directly to the theater district). 

We will definitely return!"}
{"text":"Maybe we caught Pura Vida on a bad night? The waitress set the bar high with great service when we first walked in, then decided she didn't feel like continuing that. It took a half hour for each of our rounds of drinks to come--and almost no one else was in the restaurant.

The food was ok. My friend's mother's fish had to be sent back because it was extremely overcooked. I thought the whole \"jar\" concept was just weird, not modern or whatever (they have a selection of foods they serve you in jars). My friend got the barbecued tofu jar and it turned out to be barbecue baby mush looking stuff in a jar. My shrimp fried rice was good, except it had pineapple in it, which I hated. Another friend got risotto, which just tasted like butter.

On top of it all, our waitress was just bad. She stacked our dirty dishes on our clean napkins, she never cleared our plates before adding new ones, everything took forever, and she didn't even really offer us dessert, just seemed to be trying to get us out of there (and again, the place was not packed at all). We were not rude to her and we were also a big group, so it was in her best interests to give us good service and get a good tip. I've done her job for years--she was bad. The whole place was disappointing. Would not come back."}
{"text":"I came here at 5PM to get an early dinner with my coworker before heading off to the airport. We sat at the bar. The bartender was so sweet and accommodating to our time crunch.

The shrimp & corn chowder was very flavorful with a spicy kick. There was a lot of shrimp so the soup was hearty and filling. 

The 3 blackened walleyed tacos were also fantastic. The fish was tender and moist. Seasoning was spot on. The cabbage was pickled just right.

With the recommendation from the bartender, we ordered a side of the corn spoon bread which was so damn good. Moist, sweet, grainy yet buttery... OMG.

I wish I could give more than 5 stars to Pura Vida. Everything we got was so delicious."}
{"text":"Pura Vida is a mostly exemplary + vegan-friendly spot sporting odd (faintly oblong) silverware, attentive if curiously quiet waiters, a classic rock soundtrack (for once (however incongruously): House of the Rising Sun (!)) and--overhead--luminous, nearly lambent, scorched-red kinda taffeta ceiling curtains. The decor alone makes PV a necessary downtown munch point--just a hop, skip, and a jump from the Sailors/Soldiers monument. Indeed, one can practically fall onto it from the casino! The front windows give onto a lavish view of the newly renovated Public Square so get a table that favors people watching. Oh, and yes, the housemade veggie Big Mac feels anachronistic in its faux white box but it is prime time tasty, just soft enough, and layered with cheese, romaine, tangy sauce, and a goodly helping of fried onions. No joke, the sucker isn't even highway robbery at $13 a la carte! It is a masterwork. Ditto, the soup. The mini grilled cheeses sunk in the stuff are the epitome of new wave American outrageousness. Peel and slurp at their buttery goodness. Plenty of crunch there too. Same goes for the salad: a wonder of nuts and carrots. The menu drinks aren't Plum or Society (or naturally Porco) good, but they're tolerable. The mojito, in particular, was a beer glass of ice and some mint sprigs...but it definitely did the trick. Though the drinks aren't perfect, prospective diners will likely be awestruck by PV, a marvel in many other ways. All hail the ersatz Big Mac!"}
{"text":"This place is so delicious, we were sad we could only have one meal at a time.

Their garlic hummus was the best I've had since my favorite in Dearborn, sometimes called the American middle East.

My Caribbean jerk duck wings were crispy and spicy, and the avocado ranch was a great counterpoint. I was surprised the crust was both savory and just a little sweet.

Their rosemary fries beat the pants, socks, and underoos off any I've had before - maybe it's the lack of typically disappointing truffle oil. I finished off mine and some of my friend's because you don't send a plate away with leftovers.

Our pescatarian friend had the seared ahi tuna, and he was in heaven, saying it was tender enough to cut with a gentle fork. Our gluten free vegan friend was treated so kindly - they had vegan alternatives for everything on the menu!

Her daughter got a veggie Mac sandwich (similar to a big Mac), which went over like gangbusters.

I am contemplating a s'mores pie with marshmallow ice cream, if I can possibly make room...

If you're of an alternative lifestyle, you'll find the staff friendly and supportive - they hosted the planning party for the Gay Games at the same time we were there."}
{"text":"Food was fantastic. Loved the Vegan menu.   

Service was mediocre, at best. Was without drinks many times and had to get the waitress's attention to reorder.  

It was loud on the patio because of buses (and general traffic).  But, it was a gorgeous day so still better than being inside."}
{"text":"Not being a huge fan of Mr. Evans' other restaurant (Blue Canyon is OK, but not really my thing), I wasn't too eager to try Pura Vida. That apathy was quickly outweighed by my persistent interest in new downtown lunch spots, and I soon found my way here. Damn, it's good. I've returned several times and introduced a several people to it, and the experiences are uniformly positive. Service at lunch has always been appropriately brisk, and the space is sleek but inviting. Between me and my dining companions, I've tried a couple of tasty salads, the lunch box special, a couple of different sandwiches, and the king of the menu - the beef tongue sandwich. That tongue alone - swaddled between hearty bakery bread and sitting under house-pickled onions, Swiss and horseradish sauce - honestly makes Pura Vida a destination restaurant all by itself, and I have to show a lot of discipline to explore the menu, which I plan to do with future lunches. The dinner menu looks a little pricey (perhaps it's worth it), but I really hope their decision to open for breakfast works out, as the menu looks promising and there's a shameful dearth of good options downtown for breakfast."}
{"text":"Second time here, service was a lot faster than my first visit soon after this place opened. The smoked portabello gyro is AMAZING and what I'd recommend for everyone regardless of whether your a vegetarian or not. Also have nommed on the curried lentil pate, african peanut soup and the veggie burger. Also yummie."}
{"text":"beautifully decorated, very modern, with fabric panel lined ceiling that has color changing lighting spotlighted across it.....large open room, hard to believe it was the old may co. dept. store. cocktail and wine list is extensive, menu is too with lots of selections including an all vegetarian menu for those that want it.....they cure their own meats, make their own pickles, etc.....
we had the bacon appetizer....bruleed house cured bacon with bread, pimento cheese, pickles, etc., the african peanut stew, which was SO good and the cleveland chicken dip, delicious!
dinner......2 of us selected the hanger steak that was on special for the evening, one the scallops and the other the cuban sandwich with an extra side of hash.
the hanger steak, which i had, was perfectly cook, served with roasted fingerling potatoes, mushrooms and savory beignets. the beignets were more like little dough bricks, not light and airy as i has expected, but really solid and more like compacted squares of bread.....neat idea, but not realized.......
for dessert a peanutbutter and jelly bombe and a small dish of ice cream, both OK, but nothing great...........overall everybody liked everything, but we all agreed that we'd come back again if somebody we were with wanted to visit pura vida, but probably wouldn't say \"we have to go back there\".  it's good, but not memorable, it's hip but seems like it would be a better lunch spot than for dinner.....it doesn't have a dinner vibe but more of a luncheon spot.....go, try it.......it is good, but there is a lot of \"just good\" in cleveland......the ones that are great are the the restaurants i return to again and again................."}
{"text":"So I've been here twice, once for a corporate event and the other dinner for two tonight. 

I must say, they have the best caesar salad I have ever had anywhere and I've had a lot of caesar salad. It is amazing.The croutons are out of these world. The cheese is plentiful. The dressing is light but full of flavor. I actually liked the salad more than the main dish. I love pleasant surprises like that!"}
{"text":"We eat here often for lunch, the food is always very good but sometimes the service is slow. The African peanut stew is one of my favorite dishes, especially on a cold or rainy day. Their dill chips are surprisingly tasty and delicious. The fish tacos are always fresh and the fish is flaky. I don't think I've tried anything here that I haven't liked."}
{"text":"Go here if you want over-priced food. I asked if they could do a side Caesar salad to start.  The waitress said yes. When we got the bill, they charged me for a full sized caesar salad ($11). When I asked about it, the response was, \"Oh that's what we charge because of the cheese that's on it.\"  That would've been fine, but she never told me that. Had she told me, I would've gotten something else, and opted to NOT spend $11 on a side salad, on top of my me

My husband and I spent $50 on dinner, which is about what we usually spend on dinner, but we left hungry. 

The food was fine. Not anything spectacular for the price. 
I do not recommend this place."}
{"text":"Oh the menu! This is a gem of a spot. I've had business lunches and brunch here... Never fails to amaze me with the level of attention to detail on each dish. If you have the opportunity to eat in the area, this should be your spot. The Bloody Mary is worth your time. So is all of the food. The price tag here is meant to be."}
{"text":"Last night we ate at Pura Vida by Brandt.  In our group was a vegan, vegan no oil, kosher, and me.  We were asked several times about our dietary restrictions.  They have a full vegan menu.  The food was awesome, from beginning to end.  They made sure to meet all our needs and we left full and happy.  If you have not eaten there, go.  The food is awesome.  The staff friendly and attentive.  I have eaten here before and every time they exceed all expectations!"}
{"text":"Excellent food and great service in an attractively modern setting.  

I started with the African peanut stew ( kale / sweet potato / red curry).  Who cares if this is good for you, my tastebuds did backflips.  Good stuff.  

My friend shared bbq duck confit nachos( pickled chilies / heirloom tomato / aged cheddar queso / sour cream / chives).  Soooo nice... and spicyl  Full of flavor.  We share with the table, and all raved.  

Really enjoyed the fish tacos - today they were blackened Tilapia .  The truffle cream corn - it had some curry that added just the right kick - it was the best veggy.  I really enjoyed the sweet potato corn hash - very unique smoky taste. 

The vegan chocolate cake... not to my taste.  One of my co-workers stated aptly that it needed a stick of butter... see, no vegan here.

Enjoyed a really great Belgian wheat beer (not Blue Moon, and I can't remember the name) with a slice of orange - I had to ask for the slice of orange.  

The toughest part of the evening was finding parking.  I ended up using valet.  

Give it a try, you'll be glad you did!!!"}
{"text":"I went to Pura Vida for one of their events, Vegan Club. It's the first Tuesday of every month. This month was a four course oil free dinner. Delicious!! First course was cold soup and an avocado salad, second course was a stuffed cabbage, third was eggplant with hummus and whipped coconut then dessert was melons. I'm not describing the dishes very well at all, not giving them justice. The dishes were very creative! I will be going to the Vegan Club event again."}
{"text":"Fresh! The PV burger was so yummie! We shared the rosemary fries which were delicious. Servers were friendly and knowledgeable. A lovely atmosphere! Nice wine selection. A must try when in Cleveland!"}
{"text":"Great place to check out. Fresh and local ingredients. Food is very flavorful and well put together."}
{"text":"I am puzzled about all these 4 and 5 star reviews. After seeing the high rating, I dined here for dinner on a Saturday. The menu is priced on the higher side (closer to $$$ than the current $$ rating). The food was ok, but nothing special. The tacos were a little bland and left my taste buds wanting. The duck fries were unfortunately drowned in a sauce that was a little spicy and not particularly delicious. Because the chef had so enthusiastically applied the sauce, it was difficult to extract fries that weren't soggy, effectively writing the dish off for us. On the plus side, the service was good (bordering on over-the-top actually, but that's better than the reverse!).

Overall, I felt it did not live up to its current rating. Cleveland has more interesting restaurants for a similar price (check out the West Side Market area for some great examples)."}
{"text":"I ADORE this place.
My dad came into town so we gave it a try for lunch. I ordered the warm chicken salad sandwich with rosemary sea salt fries. It was the best chicken salad I've ever had, and the fries were divine. Their lunch menu does a creative spin on traditional lunch items. Our server was great and the food arrived quickly.  

The décor is pretty modern, so it's nice if you like that. I didn't find it the most appealing for a midday lunch, but it's perfect for a downtown dinner/drinks place.

I absolutely recommend it! (Get the fries!!)"}
{"text":"My husband and I ate here before seeing a show at Hilarities. There was an Indians game earlier in the day and Ohio State were playing so East 4th was packed! Greenhouse Tavern was a 2.5 hour wait. I'm a vegetarian so I've wanted to try this place for a while and it looked promising because a friend recommended it. 

I was very happy that we were seated right away. The place wasn't jam packed but it was quite full with a few large parties. The decor was pretty cool. I loved the ceiling decor. 

 I got a champagne orange pomegranate drink. It was good. My hubby got a stout which he liked. We like craft beers and drinks and they had a good selection. We ordered the bread appetizer. When we first got it, we were surprised it only 4 pieces of bread but it was really good! It looked underwhelming but it was great. I would have liked at least another couple pieces of bread. We were famished!

I asked the waitress if she would recommend the veggie Big Mac or orzo stew and she said I had to try the Big Mac. I was NOT disappointed. It was great! I really enjoyed it. My hubby got the pork tacos. He wanted to blue cheese fries but the kitchen said no?? That is why I gave this 4 stars because everything was good except this. He asked about this because he didn't want rosemary fries. He hates rosemary. Overall that was small blip on an otherwise great meal. I'll go back!"}
{"text":"Would have loved to try their food...menu looked good. Went on a Friday evening. Downtown bustling due to Indians game and concert.  Walked by sidewalk hawkers trying to get customers for restaurant next door, but ignored them to go to pura vida. Restaurant maybe a third full, we thought we timed this right. We were promptly sat in the outdoor space. We again thought\" awesome we get to people watch. \". We were brought a bottle of water and menus and sat, and sat, and sat. Mind you, they were two thirds empty. After 15 minutes we left. Too bad I was looking forward to trying that blood orange drink. Should have gone with the hawkers next door."}
{"text":"Pura Vida was recommended by a friend in Philly. Little did I know my hotel location would be just steps away. So when my room wasn't available upon my arrival but my stomach was ready for lunch, I did a Yelp search and Pura Vida showed up as one of the closest options. 

The decor is modern and bright. It seemed like there was a lot of business going down, but there were also some more casual lunch dates and solo diners. Everything on the menu looked great but I was in a soup and salad mood so I ordered a cup of the shrimp and corn chowder and the grilled romaine salad. 

The chowder was more like a bisque with some veggies. I thought it could have used a little kick of heat or something, but some black pepper did the trick. The salad was definitely the star. I've had hit or miss experiences with grilled romaine salads but this version was perfect. Served dressed with olive oil, the other components (roasted tomatoes, manchego cheese, olives, some grilled bread and a heaping pile of prosciutto) all made for a big delicious antipasto party in my mouth. 

Everyone on the staff who I encountered was friendly and helpful. And the price was great for a weekday lunch. I would recommend Pura Vida to anyone looking for a tasty meal, and I would definitely return on a future visit to Cleveland."}
{"text":"Wonderful food.  Friendly staff.  Nice ambiance.  As a vegetarian I was most appreciative of the separate vegan/vegetarian menu.  We ordered soup and a couple of dishes and all was terrific. I have a problem eating spicy food and the chef even let me try the peanut soup before ordering it.  It was delicious but, in fact, too spicy for me to tolerate. We had the squash bisque instead and loved it."}
{"text":"The portobello gyro is so good. It is an awesome veggie option. They have an awesome special dietary restriction menu. Their fondue and beet/goat cheese salad are also amazing."}
{"text":"The food was really good, but I think their price point may be a tad too high. When I went with a co-worker for lunch, practically the entire dining room was empty. It's a shame, because the food it delicious. I just think they need to drop their prices a smidge or make the dishes a bit more hearty. When I think of a picnic, I think of a basket stuffed with goodies, rather than a decorative plate. Perhaps I'm not describing it well enough, but something just felt a bit off about the whole experience. 

Anyway, the food was delicious and the staff was outstanding. I'd recommend it to anyone."}
{"text":"I wouldn't give it more than 3 stars for the fact that the soup wasn't that great but the bread and butter board was amazing!

Let's recap. 

Stopped in for lunch with a coworker - positive that it's so close to work. The hostess greeted us right when we walked in. The decor inside was great and the patio outside looked inviting as well. The service came by and just looked wasn't very warm and kind. She was almost like a robot just reciting what she had memorized a few minutes ago. 

We ordered the bread and butter board to share. It was so delicious. The bread was perfectly toasted and cut. The butter was shaved cold butter that just melted on the hot toasted bread. There were a few pickled options to accompany the bread as well. Highly recommend this dish. I ordered the shrimp and corn chowder there is no other word to describe is other than EH. There were maybe 4 small pieces of shrimp and a bunch of veggies. Way over done in seasoning and just lacked other flavor than the shrimp seasoning. 

All in all, I might return because it's so close to work and I would definitely try something else but I will ALWAYS get the butter and bread board :)"}
{"text":"Pura Vida is amazing!  I went for the second time last night, and I tried a new entree.  It was just as good as the first.  Their vegan selection is off the charts compared to any other restaurant in Cleveland.  You absolutely must try the African Peanut Stew.  It's vegan, but I can't imagine anyone not liking it.  For dinner, I had the chicken fried cauliflower.  Talk about vegan comfort food, yum!  The gravy was peppery and flavorful, and the biscuit was delicious.  The cauliflower itself was breaded and fried to a perfect golden brown.  The other diners I was with even commented on how it looked exactly like a chicken fried steak.  Highly, highly recommend this place, especially to groups with different dining preferences.  Plenty of choices for all!"}
{"text":"This place is underrated. More people should go to Pura Vida!

We first tried it during patio week in September, right when it opened. Although I'm not a fan of its location right next to barroom (and a future casino?), it has a very nice seating area outside, which we sat in on the ending of a summer day. The restaurant itself is modern, contemporary, and sleek.. a type of restaurant not normally seen in CLE. 

For appetizers, we started with a fresh salad and a cute little hummus plate, where the hummus came in this cute little small glass jar (yes, it was indeed, cute). Entrees included a ravioli dish and salmon. Both were excellent...and for dessert, we had the trio of housemade gelatos. Mmmm.

I came back probably 4 months later, for lunch with a friend who worked down the street. He ordered the pig n fig...which was very...fig-ish. We couldn't decide if we liked it...yeah, just not a fan of that sandwich. I ordered the smoked salmon BLT which was delish as well. There was a hint of wasabi in it that made it just right.

I think Pura Vida is underrated. It's a cool place to grab lunch or dinner- just location isn't the best (I hate parking around that area). Try it though when you're having a business meeting or wants some fresh ingredients for your meal..I really liked it."}
{"text":"This being their grand opening day the service was better than I expected - none of the typical guffaws I've seen at other opening days.  We were greeted by no less than 5 people when we walked in and about the same number thanked us for coming when we left.

The gazpacho and the broccoli cheddar soup were both tastey.  Our server asked us what size we wanted and we said small but she brought out large.  Not a big deal but make sure that what you intend to order is what you actually receive.  The interior space is wide open to both the kitchen as well as Public Square which makes it feel airy but it does make the place fairly noisy inside.

The portobello gyro was fresh and flavorful.  It could have used a tad more cucumber-mint sauce but that could be just because I'm a fan of more sauce than less.  The maple thyme turkey sandwich was decent, nothing that would have you clamoring for more but no complaints, either.  Their potato chips come in a bag so aren't homemade and the kitchen \"pickes\" are curried dills pickles, cauliflower and carrots.  Both were good but not noteworthy.

The decor is clean modern.  The floor to ceiling glass doors that open up onto the sidewalk on Public Square are a welcome addition to that area.  Our server was exuberent and appeared to be as excited to be serving us as I was to have a new lunch entrant on the market downtown.  She really added a pleasant note to the experience.

Since this place is on the walk from my parking garage to office I may just have to stop in to try one of their morning bruschettas.

I hope this place does well because the downtown area has been lacking in variety of options for breakfast and lunch.  There's only so many times a week a girl can eat at Flaming Ice Cube - a fantastic vegan restaurant right next door to Pura Vida.

Good luck, Pura Vida!  I hope you do well."}
{"text":"Right around the corner from many of the downtown hotels, and a few steps from the House of Blues, this breath of fresh air provides a great alternative to the assorted mall-type restaurants and dive-pizza joints.  

I sampled a number of small plates, including the duck tacos, the crab falafel, the African peanut soup and the spinach salad with sweet bacon and a fried egg.  Everything was good and seemed to be in the $6-$9 range.  Nothing was something I simply have to have again, but I would gladly return and sample other offerings or try these once more.  Entrees seemed to be in the low $20s. 

In short, Pura Vida offers a reasonably-priced good food option downtown.  Note: they also offer take out as an option."}
{"text":"This was the very best meal I've eaten in quite a while. The meal was wonderful, tasty, unique, beautifully balanced. 

My dining companion and I split the wheatberry salad as an appetizer, we ate about half of it because we didn't want to be too full for our entrees. We took it to go and ate it the next day. The salad was mostly wheatberries (think barley), edamame, black beans, and tomatoes all in a nice vinaigrette. It was really nice, the bright acidity of the vinaigrette balanced well against the beans and edamame. 

For an entree my dining companion had a large portion of the crab falafel. It had about 8 pieces over what was probably an entire zucchini with feta and a vinaigrette. She liked it a lot and I tried a couple bites and thought it was very tasty.

I had the special, a black grouper with a purple potato and crab 'slaw.' It was amazing. The grouper was cooked perfectly, it was flaky and flavorful. It was served over a really nice sauce that was like hollandaise, buttery and lemony - perfect for the fish and really rich. The slaw was just unbelievable. It had very finely chopped cabbage, and a light dressing. The crab was tender and the potatoes were a little earthy and cooked just enough. The whole slaw was a little warm, and it was completely incredible. I've been wanting more of it for the last few days now. 

Our waiter was great, although admittedly there were only two other tables there. We ate at about 5pm during a baseball game so he had plenty of time to pay attention to us.  The restaurant was pretty and the view out the window of the soldier and sailors monument was great. Overall a lovely dinner. I'll be back."}
{"text":"This was a perfect find on a 70 degree day in the middle of March. We arrived right at 5 pm (when they open) and saw that they have a large patio out front. There were no tables out there, but we asked the hostess if we could move out. In our desperation we offered our own manual labor. She was super nice though and made it happen. They put out a few tables and next thing you know, they were all full. I had one of their cocktails (blood orange) and it was very tasty. Just the right amount of booze too--not too much, not too little. They've got a decent wine list and even have Chateau Montelena Chard.

We split a bunch of appetizers, and each one was great. Especially at the happy hour price of $5! The nachos were just about 8 tortilla chips, but the yummy duck topping more than made up for the lack of quantity. Cheese board was sizeable. The eggroll was tasty and the sliders were just as good.

Every Thursday they also do a \"cultural\" menu. It was French when we went. The week prior had been Thai. 

Very modern and airy space too. Look forward to going for dinner!"}
{"text":"I went on a weeknight around 7. Restaurant was only 1/3 full so not too busy, but by the time we left around 9, there was almost no one there. The lighting and the inside was very nice and unique, something that you would see in a bigger city, not in Cleveland.

I had the african peanut stew for appetizer and the pure vidan cuban for main course. Peanut stew was amazing. I wanted more of it, reminded of curry. The purva vida cuban was their version of a pulled pork sandwich. Tasted different from just a regular pulled pork, it was actually really good with mustard and pickles in it.

Overall it was a good experience to try once. They also had a separate Vegan menu too."}
{"text":"Went in just after they opened (a bit past 4 p.m. or so) and was the only one in the place. I was STARVING.
They had a great happy hour menu and I got the burger and duck fries for $6 a piece. Portions were huge and the food was really good. Burger came with bacon and pimento cheese and the duck fries were a great mix of savory with a hint of sweet/spicy.

Bartender was super friendly. Great happy hour prices/offerings here!"}
{"text":"Have not had many chances to go here since parking is tough, but every time I have been able to the food has been amazing."}
{"text":"This was a great place to have lunch!  Very fun atmosphere, and lovely dining room.  I went with my parents and they loved it too.  We all had a cup of the Shrimp and Corn Chowder--first of all, the cup was the size of bowls at most places, and second, it was absolutely delicious.  The sadwiched come with pickled vegetables, which are delicious (especially the cauliflower) and I wouldn't recommend skipping them.  I had the lunch box, which is a daily special that comes in an aluminum lunch box--jerked chicken sandwich, which was very good, and because the soup was so filling, I was only able to eat half.  My mom had a salad, which was delicious."}
{"text":"We were prompltly seated, and the service was on their game, and very knowledgeable about the entire menu. All but one in our party got the ribeye special, and they were all exceptional, except one, in which a hair was found. The staff quickly apologized and removed the charge from our bill. Other than that incident, they bent over backwards to make sure we had an enjoyable meal. A little pricier than we had initially expected, but the food was definitely top notch. I, myself, would definitely return!"}
{"text":"I've passed Pura Vida almost on a daily basis for a year and never stopped in for a meal, mostly because if I was that far down Euclid and wanted a nice, light lunch or dinner, I normally was already on my way to Flaming Ice Cube. 

But a work friend had her birthday earlier this week and chose Pura Vida for her celebratory lunch. 

I was in love within minutes!

While not a full-time vegetarian (though married to one), I tend to opt for meatless whenever I can, and so I was delighted to see Pura Vida has an entire separate vegetarian/vegan menu. The only other place I've been that does this is Wild Mango in North Olmsted. This is such a generous practice: it really helps people like my husband not have to read through the entire menu and question every single foreign ingredient or phrase to determine what they are able to order. 

I ended up ordering the vegetarian Big Mac - LOVED IT!! The housemade veggie patties reminded me of the \"falafel\" burger at Nano Brew, except Pura Vida's were more tasty and enjoyable.  

I was seriously coveting my friend's simple salad and chickpea and kale entree the entire time, so that's what I'm going to get next time...

The service was absolutely wonderful as well! This restaurant is a class act all the way! 

It was a little steep for lunch at $15 for just the burger and a small cup of soup (with a drink and tip, it was well over $20), so I probably won't be making this a normal lunch spot, but I definitely will be back for an occasional treat or special occasions!"}
{"text":"Fabulous all the way around. Great service, get food vegetarian or not. Will definitely be back. Server knew all menu items and could describe them percisely as  it seems they have them all try all dishes. Parking accessible with valet, be sure to tell them where you are going as its cheaper if you do. Food was great and well worth going down town for. My new go to place!"}
{"text":"My husband and I had an amazing dinner here on Saturday night.  Everything was excellent from the food & service to the decor & ambiance.  Loved it!"}
{"text":"Excellent service. Impeccably fresh and filling vegan food. I was worried I wouldn't be full after eating here (I'm not fully vegan but eat it when available because of my dairy allergy) I could barely finish everything I ordered! I split the lunchtime Big Mac, vegan burrito and vegan nachos with my lunch buddy and you could've rolled me out of there I was so full (in a good way!) May put this is rotation with my frequent Barrio visits to mix it up every once in a while."}
{"text":"I absolutely love this place!  The vegan options are always amazing.  Sadly, most places in town serve either soggy eggplant or portobello sandwiches OR undercooked/ wet tofu (if you're lucky).  It's disgraceful.  Happily, Pura Vida exists!  You can tell the chef actually cares about special diets and puts a lot of effort in.  Thanks!!!!!"}
{"text":"Four stars is for the burger.  It was amazing.  Oh, and the Buffalo Pig Ears!"}
{"text":"I had a really cool lunch here. The menu is overall pretty healthy and they offer a different stir fry each day. They also have a focus on using local ingredients. They have a large table for groups and even a section of the restaurant that could be curtained off if it was reserved. I also saw an ad for a $5 menu at happy hour. There is a pretty good sized patio and it's good for people watching being right on public square. Try it out - you'll find something uniquely flavoured. 

Also the place didn't fill completely up for lunch, but it was pretty busy. I only mention this because the restaurant was very reservation focused. They called to confirm the one I made on OpenTable and when I arrived the host definitely expected me to have one even though one was not necessary as far as seating goes."}
{"text":"My experience here this past Saturday night was just PERFECT!!  Everything from the setting to the service to the wine list to the food (ahhh....the FOOD) was AMAZING!!!!

The ambiance is serene.  Fabric is draped from the ceiling artfully and soft lights slowly change colors almost in-perceptively. Everything feels RELAXING and ELEGANT. Dave, our waiter was friendly and helpful.  He was the perfect combination of knowledge about the restaurant and a sense of joy about working there.

I'm not much of a meat eater, so a menu with LOTS of veggie choices is great for me. I started with the \"Chic Pea Jar\" :hummus, basil pesto, house made ricotta, chopped olives, and blistered tomato all layered in a mason jar and then served with delicious grilled bread for dipping.  The flavors melded perfectly and everything tasted so fresh! It went wonderfully with the 2009 Chehalem Pinot Gris from Willamette Valley.  

For my entree I had the pasta of the day:  smoked mozzarella ravioli with fava beans, blistered tomatoes, and ramp pesto.  The pasta pockets were made with a bit of red pepper and were perfectly cooked... remaining tender and yet being slightly al dente (very difficult to do with ravioli!).  The veggies and pesto packed a flavorful punch, but did not overpower the pasta.  Chef Brandt balanced the flavors perfectly!

For dessert I had the gelato tasting.  Now, gelato is often good, but not usually memorable.  Not this gelato, my friends.  It was exquisite!  Three different flavors made in house:  goat milk and lavender drizzled with honey, curried carrot, and sea salted caramel.  I don't know which one was best.  Bite of one...bite of another..... bite of the last.... and back again and again... I was in a happy confusion.  And the accompanying glass(s) of Nickel and Nickel Doce just added to the delightful delirium!"}
{"text":"First off the hostess Pamela is such a sweetheart- love her. This was our first time going here and I'm so glad she was the first part of our experience. Our server was Belle and she was also very kind and on point. For an appetizer we got the African Peanut stew and demolished it. It was sooooo good. I practically licked the bowl clean- this is a must get while you're here. Then for dinner we had the veggie big Mac which looked just like a big Mac but tasted 10x better. And my boyfriend had the samosa burrito he is Indian and grew up with Indian food and said that encapsulated the flavors excellently. We didn't even know they had a special tonight and it was BOGO vegetarian meals and we are vegetarians. Excellent spot to go for vegetarians. The lighting and the atmosphere were also on point. If I could give this an A++++ I would"}
{"text":"So much to love about Pura Vida by Brandt Evans. Start with a great, relaxed atmosphere and a contemporary setting, convenient location right on Public Square and outstanding, friendly staff. Chef Scott Coffman should be considered on par with some of Cleveland's better known, all-stars. He keeps it fresh and creative. We like PV's ample vegan offerings and the quarterly / seasonal vegan special dinners. We try to leave room for one of two vegan desserts, including a rich, creamy, dairy-free, salted chocolate gelato.

Some dinner faves: vegan Cuban, African peanut stew, kale salad, quinoa, house pickled vegetables, crispy mushrooms, crispy polenta and chic pea fettuccine. Plenty on the menu for omnivores, too. Chef Scott throws it down with flavor and fun. He's outwardly proud of his creations, always innovating and trying something new. 

The front of the house staff is efficient and knowledgeable. Management is hands on and responsive. Get in and get out if you're in a hurry. Or, linger and relax if you can. 

Valet parking on Euclid is $8. 

Say hi to Kelly at the bar. She and most / all her colleagues are long-timers as restaurant workers go, another solid sign of stability and quality for this fabulous find."}
{"text":"Pura vida was fantastic. We went there for a couple appetizers because we just happened to be walking by after a game & the place looked nice. They were fantastic. We had pig's ears and the duck confit. Dave, our server, was extremely helpful & friendly. One of the best servers we've ever had."}
{"text":"My husband took me to Pura Vida for a Saturday birthday lunch. The lunch crowd was very small (read: we were the second table; there were a couple more by the time we finished), but the atmosphere was romantic. I never knew how nice Pura Vida was just by walking by! 

The restaurant has a modern feeling, with white fabric draped from the ceiling that changes color from lights on the side. They also had a Bloody Mary bar set up, which I assume was a weekend thing, but can't say for sure.

As for the food, I was happy with everything we tried. We started with corn chowder, which had large chunks of carrot, potato, corn and shrimp. It was a nice, big bowl too -- great for sharing. I had the portobello gyro, which had portobello mushrooms, lettuce, tomato, pickled banana peppers, dill havarti and a cucumber mint yogurt sauce. I normally wouldn't order a vegetarian dish, but got this on the recommendation of a friend. It was amazing; I loved the sauce. I want to go back and eat it again, like, now. I upgraded to the rosemary fries as my side. You won't be disappointed. The fries come in a little bucket, and it's overflowing.  

We ended the meal with the PBJ dessert. I would go back for this alone, and I don't have a big sweet tooth. The PBJ is a chocolate genoise cake, topped with peanut butter mousse, all covered with chocolate ganache, and served with a raspberry coulis. We ate it up in about 5 seconds flat. 

Pura Vida was a big hit in my book. I'll definitely be back, and plan to try Brandt Evans' other spot in Twinsburg, Blue Canyon."}
{"text":"Dec 30th we wanted to experience a restaurant we haven't tried yet and all before heading to TSO  so pleased with fiance find.  Our friend is vegan and her husband is meat lover and I am picky.  We were fortunate to go on Wine down Wednesdays. . Bottles for $15. Limited but good selection.  We started with two appetizers  bread and butter board. Wow that was fabulous. .fresh bread and butter. And the bacon onion marmalade is to die for and they ordered chick pea jar..  fiance and friends hubby ordered per waiter Pork chop and spaghetti squash and gouda cheese filled pierpggies  ..my girlfriend ordered butternut squash risotto  and I had the rosemary fries and homemade spicy catsup and wedge salad with bacon and walnuts with cider dressing  woild def recommend and experience again. Great choice"}
{"text":"I am a total omnivore, but this place is amazing and offers very creative and tasty vegan options.  Pura Vida is my favorite restaurant in Cleveland downtown and I dine here as often as I can while I am on business trips in Cleveland.  I eat here about 3-4 times a week for dinner when I'm in town.  If all vegan food tasted like this, I think I can change my diet to a vegan diet permanently!

I never liked veggie burgers, but was convinced by my co-worker to try the vegan burger.  The vegan burger is juicy and intensely flavorful, which is not what I normally see in vegetarian/vegan burgers.  

Desserts are to die for as well!  Most vegan desserts are dry and dusty tasting, but not pura vida's desserts!"}
{"text":"This place deserves every single star I'm giving it! How have I lived downtown for 10 months and never tried it?? Anyways, I FINALLY went there last night and had an absolute flawless experience! I don't think a negative word was said about anything! The decor is kind of contemporary and elegant. We got there around 7pm and the place was empty (kind of made me nervous)! It started getting busier once we got there, though and by the time we left the place was full - it may have had to do with the Indian's game letting out? Or people grabbing food before a night out? 

Our waitress was SO attentive, friendly, and helpful.. The service was wonderful!! No complaints here either!

The food: AMAZING. There are 2 menus, the dinner menu with appetizers, food for herbis and carnis, etc. The second menu is strictly veg/vegan food. Pretty sure I wanted to order everything on the menu. We started with the crispy mushrooms- kind of tangy, kind of sweet, and really delish! One of the girls and I split the Simple Salad and it was really good!! I ordered the Spicy Tofu Bahn Mi with no bread and it was DELISH! Tofu and I don't really always get along, but I was pretty impressed with this one. It WAS spicy, but not unbearable - I just had to make sure I was chasing it with the water glass and not the glass of vodka. The other girls ordered the Vegan tostada, Trout Po Boy, and the filet with a side of the sweet potato and corn hash. They all said their food tasted super fresh! We ended the meal with the vegan chocolate cake. I didn't try it b/c of my new diet of the week :-\ but they all said it was delicious and not what they were expecting from a vegan cake. I had the blackberries on the side. They were no chocolate cake :( 

There's SO much more on the menu that I want to try that I'll probably be frequenting this place. I LOVE the location - on Euclid between east 4th and tower city - AND walking distance from my apartment... takeout every week?? yes please :) I also can't wait till outdoor seating is open! Entree prices range from 10-30 dollars depending on what you're eating. It can get pricey but I think it's totally worth every penny! 

Can't wait to go back! :)"}
{"text":"I went here on a Saturday evening and was initially drawn to Pura Vida by the ambiance and unique menu choices. The posh gray tones and low neon lighting did make for a nice atmosphere, however the food was just okay and a bit overpriced. I had the chicken linguini which was a decent portion and tasted very fresh, but was bland. The menu did not have a whole lot of options either. I see this more as a place to have drinks if anything."}
{"text":"Called for catering order and was turned away as I was told 5 days notice was needed. Seems a little absurd as I was only ordering for 20 people. Bummer. Reviews led me to believe this was a place worth trying. Alas, I will take my business elsewhere."}
{"text":"decor: was quite nice 
service: pleasant waitstaff

food: was aight. i got a chicken dish with salad. nothing crazy good or crazy bad."}
