{"text":"If you like British fish and chips, you may not like this place, the batter is too much. If on the other hand you are from the east coast (NFLD), you will taste home with the first bite. Chips are great with the dark malt vinegar."}
{"text":"I always enjoy having fish and chips here. Its definitely become my go to restaurant when im craving fish and chips. A true comfort food to me.    Always hot and fresh. Good service.   Must try: poutine, wild rice."}
{"text":"Always good always has been!!! The wife and I split a poutine and each have our own halibut. I have been coming here since high school even though it has changed owners a few times the quality has never went down."}
{"text":"Went here on a Saturday evening and we picked up a halibut and chips with coleslaw and a medium poutine.  The fish and batter were delicious and fresh, the coleslaw was average but still tasty and the chips were very nice. The malt vinegar and tartar sauce was a nice addition.   The poutine was a very generous size and the cheese and gravy on it was very tasty. I like how they didn't skimp out on it in the slightest. Coming here from now on when having a craving for poutine or fish!"}
{"text":"My wife and I had a craving for some fish and chips, so we took to Yelp.  Queen's Fish and Chips doesn't look like much from the outside, but the food more than makes up for it.  My wife and I both got the halibut and chips and took it to go... It was the best fish and chips that either of us have had in years.  We'll definitely be going back."}
{"text":"I tried to go there once, then I found out they don't open on Sunday the hard way, so I went back again on Saturday hoping it was worth my time. Parking was easy. There are many free parkings around, plus a big plaza across the street. I arrived around 1:30pm or so. The place was completely empty. I always feel hesitant to go in an empty restaurant. However, I did go in. Inside was a little dark, and there was only person working. I ordered halibut fish and chip. Fish was fresh, batter was light and crispy. I liked their fries a lot, thick but crispy outside, soft inside. Will I go back, probably not. However, if you are around the neighbourhood, and want fish and chip, this is the place to go."}
{"text":"Another reason I feel blessed for living 5 minutes away from Streetsville. Flavorful fish not like other stores Ive tried. Greasy and salty but hella delicious if youre looking for the real deal!   Dont you forget the Vinegar on them chips, you wont regret it!"}
{"text":"This is a simple and humble place serving fish and chips. It is not going to blow your mind but it certainly will satisfy your F&C cravings when you get them. They serve a variety of fishes and prices are fair. Portions are reasonable. Not much more I can comment on. Standard F&C."}
{"text":"This place does not look like much from the outside.  Seating for about 10-12 people.  Looking at the place you would never expect the food would be that good.  The fish Biryani and fish and chips was what we got and both dishes were extremely yummy.  The food was delicious!!!!  The prices are very good. Fish Biryani was the special of the day so $5 only."}
{"text":"My friends and I used to go to this place when we were in high school (nearly 10+ years ago) once a week every week during the school year. We used to get the $5 lunch special (cod or haddock). We went back recently and I'm happy to say that the quality is still as good. We even noticed that they have the same chairs from way back when. Perhaps it was the nostalgia but if you're in the neighbourhood, I would recommend stopping at this place for some good fish and chips. I think their most expensive meal is the halibut and chips meal (about $12). They also had \"Newfie fries\" with the choice of ground beef or stuffing. We didn't get a chance to try it out because we were stuffed from our fish and chips but I'm definitely curious."}
{"text":"First one to admit that I don't like fish but the fish (cod) and chips at Queen's was very good. Greasy yes. Needed salt yes. Fishy no. Good portions of crispy lightly battered fish. Decent portion of fresh cut fries that had no fish taste as was fried separately from fish. Cole slaw was ok. Packaged malt vinegar and vinegar ok, but packaged tartar sauce no. If made their own tartar sauce, add some lemon, could be 5 out of 5."}
{"text":"Awesome fish and chips. Came in here for Good Friday tradition. Line was a bit long due to holiday. We ordered today's special - small haddock + chips. Food was above my expectations.  Would order regular size fish next time though, the small portion is not quite enough."}
{"text":"If you like fish and chips, you must try it .  The quality of the fish is good, they have variety of fishes, like halibut, bass and few others. We order the halibut, its really good, the serving is big, i mean one piece is so big, with fries and coleslaw . Its a family run restaurant. both husband and wife are  nice humble people. There is not much room to dine in , we always take it to go and enjoy it at home."}
{"text":"This is mu first time ordering from them. I ordered over the phone for pick up. I had a family combo with 4 cod pieces, one large french fry and coleslaw. Price is average. The quality was alright. The batter, which is crucial for fish and chip was good. Light and crispy. It was however a little too oily for my liking. There was also a few pieces, specially and the narrower end of the pieces, where the batter was empty without fish.  The fries were very average. Felt like it was refried and not fresh. I was very disappointed with the fact that they had pre-packages of tartar sauce. Overall, not exceptional. Not bad if you are in the area and crave fish and chip. Not worth driving for. My daughter's school is on the same street, I doubt I will order again."}
{"text":"Traditional style fish and chips shop serving fresh fish and fries almost like you'd find in the UK. I had halibut and hubby had haddock. Batter was a bit bready but it was nice and crisp. Fries were crunchy and salty. For an old school style fish and chips dinner, it's a good spot."}
{"text":"Definitely a hole in the wall type place. The food was all fresh made, and pretty good. I had the fried Haddock with fries and it wasn't half bad. The establishment wasn't the cleanest and there weren't a lot of places to sit, but that's to be expected of this type of eatery. Prices were reasonable, and there was plenty different kinds of fish to choose from. Ask for something called Poutine (available at most Canadian eateries). It's French fries with gravy and cheese and is definitely something you want to experience while in Canada. Of all the other options within the vicinity, this one would probably be your best option if you aren't looking to spend an obscene amount on lunch."}
{"text":"3.5 stars... solid little mom & pop shop in Streetsville.  Queen's Fish & Chips has stood the test of time... as in it probably hasnt change in quality OR looks since it was started.  It is dark, old, time worn with furniture to match, but it feels like a family humbly built it from the ground up and kept it that way.    You can find this in a little strip mall in Streetsville.  It's not flashy or modern place but it's homey.  There are about 7 or so tables that people can sit and enjoy their meal.  Menu is listed in front but also there are daily specials hand written on the side wall.    During week day lunch time, there were only 2 other people.  It was quiet at best.  Service here was quick and friendly.  She took our order and immediately set to work.  You can hear the sizzle of the fish and fries being dunked into the fryers.  I saw the fries before hand... they were re-fried. Everything freshly made.  I appreciate that.    Cod lunch special with fries and coleslaw - For $13, i got a 5 oz (decent size) cod battered up and sat on top of the fries.  I would say the frying process was pretty good.  It arrived to our table crispy, hot, and not too thick.  Good amount of batter without overdoing it.  Most of the spots on the cod, it was well cooked... a few spots though it was heavier with oil and the batter was not fully cooked or crispy.  The fries were hot but a little tough as if they were overcooked.  It wasn't a crispy shell filled with soft potato... more like hot hard potato shell over a dense potato.  Coleslaw was decent.  3.5/5  Haddock special with fries and water - This was giant looking compared to the cod but I think the batter made it look like it was on steroids.  Similar to the cod, it arrived hot and crispy. The batter wasnt too overwhelming.  I would say fries are similar to the cod... decent but could have been a bit better.  3.5/5  This is a nice little homey spot that can make for some good fish and chips.  I would say the variety is good as it includes many different types which includes the nice halibut."}
{"text":"Greasy & salty- just the way fish and chips should be.   Decent pricing, you can get a 2 person combo- 2 pieces of halibut, chips and a coleslaw- for $19.99  Interior is not so great. Get your food to-go and walk (or drive- if you're lazy) to the nearby Streetsville Memorial Park where you can enjoy your food on a picnic bench in the sunshine, listening to the credit river rush by."}
