{"text":"I am not sure why there were any negative reviews for this place.
Great Service. ..Great Food..and plenty of it that's for sure.

I highly recommend this place for your next Kamayan Dinner experience."}
{"text":"My boyfriend and I went here yesterday to celebrate Valentine's day! The experience was great!  What I love about it is that the owners made us feel like family and special. We didnt know that the budol (kamayan) is for min. of 4 people and still they accomodate us and set it up. I really like the hospitality as I felt like I when back home already.

BBQ Pork are the best. So tasty. We did not have the chance to eat the Lechon because they only serve it during weekends. As for the dessert, GODIVA Double chocolate cheesecake was the bomb! Sooooo good! It was worth the trip from Scarborough and I will definitely come back."}
{"text":"Customer service sucks big time. And the food is way expensive."}
{"text":"We had dinner during busy Friday night and the place was nearly empty. Couple of people ordered takeouts. The owner seemed busy with catering order, but still nice enough to explain all the food that are completely unknown to us. 
We ordered pork adobo, eggplant and beef with potato. They all were delicious! I would definitely go again to try other menus. 
Place was modest and clean, but their restroom was flooded so we could not use it."}
{"text":"This place is fantastic. Filipino breakfast for the first of what will be many many more visits. Everything cooked to perfection."}
{"text":"Tried out this restaurant recently because of a family recommendation and we had an event in the area and it was quite a novel experience.  I've never eaten 'boodle fight style' before...but eating with your hands among company really brings the culinary experience back to basics and makes it feel so lovely and homely.  We had the $22/person seafood spread and it was quite enjoyable...fried tilapia, shrimps, mussels, squids, meats and okra over rice with side salad dishes of mango and tomatoes.  The tilapia was hands-down everyone's favourite, flavourful, crispy and delicious!  We washed it down with shared halo halo (ask for less shaved ice!).  Service was friendly and prompt, makes sense for a surprisingly smallish-sized location and we happened to dine at an apparently non-peak dinner hour.  Only HUGE HUGE HUGE downside was that we were deceptively misled in double-tipping.  A breakdown receipt was not given, only the total manually punched into a calculator.  Payment by machine meant a tip prompt which we of course added.  Total ended up being significantly overpriced and despite numerous calculations later, we just couldn't figure it out...finally determined that they must have added a 20% gratuity in the total we were given at payment...yet never bothered disclosing to us!  Ended up giving a 35% tip!  Really?!  Does a fine dining establishment even warrant that?!  Nowhere on their website or restaurant chalkboard menu does it mention automatic addition of gratuity for certain party sizes.  Granted, it can be expected but at least feel compelled to clarify with your customer!  Yes, the dining experience was creative and enjoyable but this disgustingly disingenuous double-tipping really left a bad taste in our mouths and as much of a good time that we had and like to support family businesses, this restaurant has lost our patronage and we will NEVER return.  Please beware and check the total before you tip and pay!"}
{"text":"The place to get your Halo halo fix! They also offer the budol fight for or kamayan style (family style, no utensils needed, food neatly laid in banana leaves).

Must try their Lechon kawali and their breakfast specials. 
Tapsilog- tapa (beef tips), fried egg and fried rice.
Halo halo - mixed sweet fruits in shaved ice and milk. 
Pancit- stir fry noodles

Service is pretty decent and friendly staff and owner. 

Tip- they are closed on tuesdays!"}
{"text":"This place suffers from inconsistent quality of food, and poor customer service. I'm not particularly price-sensitive but at this place, I also find the food too expensive. For instance, the large kare-kare is $22!  Large is just slightly bigger than a tub of the large yoghurt container. The taste is fairly good but I think it has gone down in quality. We also had pancit palabok recently and I think the dish is slightly different from the last time we had palabok. This place can't seem to maintain consistency. 

As for customer service, there's nil and this is based on numerous visits. I ordered takeout recently and the gentleman who took the order blotched it. If you order takeout beforehand, make sure you check the stuff you bring home. I only realized when I got home that there was a mistake in the order. I called to let them know and the gentleman at first made this excuse by saying someone called to double the order. Whoever that was, it wasn't me and I didn't double the order. The worst part was that he didn't seem to know how to handle the incident. I'm pretty disappointed with this place. I'm Filipino and there are not many Filipino food places in Mississauga. I was counting on them when we crave certain dishes I can't cook or won't bother cooking. Maybe it's time I bring out the Filipino recipe book so don't have to rely on them."}
{"text":"Loved the unique experience of eating with your hands off a banana leaf. The seafood was fresh and well seasoned and the chicken adobo was super flavourful.  I am pleasantly delighted to discover this well kept secret and will be back soon."}
{"text":"They say they're open at 11am but 11:15 am am they are still closed. The lady let in contractors and asked me what I wanted, I said I'm here to buy. She didn't let me in. Horrible!"}
{"text":"Disclaimer: I've only tried their takeout dishes, more specifically, the kare-kare and the Bicol express. 

They're really good. Filipino food is few and far between in Mississauga, but those few Filipino restaurants make great food. 

QQ doesn't have a detailed menu with prices, so don't hesitate to ask what they're selling for the day. My favourites are the kare-kare (oxtail, peanut sauce, shrimp paste) and the Bicol express (pork, coconut milk, shrimp paste). 

They sell what looks like a small container of food for $8, but trust me, it's a STEAL. When you pour the contents over rice, it actually ends up being quite a sizeable meal, and can arguably even be split between two people. If you don't have rice, you can buy a bowlful for $2. 

They also have a few Filipino snacks for sale, including polvoron, chicharon, and Speculoos peanut butters."}
{"text":"I had my 35th birthday at Quiapo Quiapo. Sunshine and the rest of her team did an outstanding job preparing a budol feast for 28 people. The food was delicious. The service was exceptional. I would not hesitate to recommend this restaurant to anyone."}
{"text":"Love the host and hostess owners. They made you feel like family.

Very succulent Lechon, tasty lumpias, BBQ Meaty Pork Skewers melted in your mouth. I also love the Pork Adobo. Everything served up family still, huge generous portions. 

My cousin's wife Eliza order us Halo Halo a great way to finish off the meal.

Definitely worth the drive."}
{"text":"I ordered the longsalog. ..which comes with rice, longanisa and eggs. They ran out of fried eggs so they had to cook some more, which i was fine with but then they gave my fried eggs to the customer that came after me. I had to wait AGAIN for them to cook my eggs for half an hour only to be notified that they ran out of eggs and they had to go to no frills and buy more eggs. By the time my eggs came my rice was cold and hard. Btw, they microwaved my dish before they served it to me...PET PEEVE! 
The only thing that was cooked were the eggs

The portion of longanisa to fried rice is not proportioned for the cost of 8.99!! I got a ton of rice with 4 small longanisa.

Not to happy with the service here."}
{"text":"Note that I've only had the all-you-can-eat breakfast here, which is what this review is based on. Well, to clarify, a Filipino breakfast (meaning a full-on meal with rice, and all the fixings). We visited around 10:00 AM on a Saturday for their breakfast buffet, for $10.00 each.

Seating is limited, but luckily, we were able to grab a table. Note that although it's a buffet, you don't actually grab a plate yourself and pick and choose from an array of chafing dishes set out for your pleasure. Instead, you order from the front, as many times as you want, and the server will plate your preferences for you. No complaints there. They portion out the perfect amount of rice, beef, sausages, and whatever else you want. (They had a pretty decent selection of chicken afretada, longanisa, fried rice, eggs, beef tapa, eggplant, spring rolls, pieces of lechon, the morning we were there).

The breakfast overall was delicious. The garlic fried rice, the tapsilog (pieces of really crispy beef slices), fried eggs, were all cooked in best way Filipino moms know how - fried and full of oily goodness. Overall, a decent price point for the amount of food we consumed."}
{"text":"I had my first budol experience at Quiapo and talk about a unique eating experience. We were a party of 9 and called in for their seafood special. Generous portions of sweet steamed crabs, juicy spicy shrimps, fried to perfection tilapia, and okra on a bed of rice plus their signature pork adobo and lechon kawali served on banana leaves and we ate with our hands. The food was wonderful and the experience something to remember. My only hiccup is that carrying a key to open the washroom to wash your hands is awkward but definitely something I'm overlooking because of the food. Must try!!"}
{"text":"Food is great especially the spring rolls.  They also have whole suckling pig on the weekends.  The crackling is amazing when just out of the roaster.  However it tends to get a little bit tougher to chew once its a few hours old.  Service is slow but tolerable."}
{"text":"My gf and I both ordered longsilog which is longanisa (Filipino sweet pork sausage), garlic fried rice and a fried egg. They served us the rice and longanisa and advised that the fried eggs would follow. After waiting at least 15 mins, my gf noticed that the fried eggs were served to customers that arrived after us and then we had to wait another 15 mins for new eggs to be cooked. The owner did apologize but by this time the garlic fried rice became very hard and cold (probably because it was microwaved to reheat it). Also for $8.99, the rice to meat ratio was very uneven, 4 small longanisa sausages and a plate full of rice. It's been years since I dined here and it may be another few years if I ever decide to return."}
{"text":"Service was great and the food was great

Only issue was my 8 to 12 year old nephews that took a very small portion was charge adult rate... I find that very expensive $23 per adult for tiny kids...

I paid for the experience....

Will go again... but I will not take any kids.... too pricey."}
