{"text":"When dining here you must sit on the patio that overlooks the 18th green. It is absolutely picturesque. To start your meal have the Navajo corn chowder. It has a little kick to it but it's extremely tasty. For an entree the Sonoran Chicken Pasta or the Southwestern Chicken Wrap are my personal favorites."}
{"text":"My family has met on several occasions at this cafe. It is part of the Grayhawk Golf Club. It is not super busy, which we prefer. What we like is there is always this big table with a gorgeous view of the golf course and Pinnacle Peak Mtn. Our waiter was a nice young man with a good sense of humor, which is needed with our sarcasm. The menu is typical light standard American sandwiches and wraps and salads (lunch). I had the turkey wrap which was okay. We all had desserts which we all remarked were more choices than we usually get at a more formal dining experience. Definitely have the melted cchip cookie with a scoop of vanilla--I would drive there just to have that again! The staff was very courteous too. The prices were reasonable. The bathrooms are also for the golfers so there are some amenities like hairspray, etc. if you need it. I think this place is a great secret in the chaos of Scottsdale. I even like the entry way area while waiting to meet the group. Photo Op: When you get done, venture out to the patio--if you aren't seated there already and walk around the lake they have there. The kids loved seeing the ducks and catfish in the lake which come right up to you. And the golfers on a cart driving by stopped their cart, and took a picture with our cameras of the whole family--now that is friendly! Beautiful desert backdrop for locals or visitors."}
{"text":"Spouse with friends for lunch. As with other blog will not give separate checks & party of nine will not return. Waitress brought checks  with line for tip - questioned & mgr. stated tip was included.  Restaurants in Scottsdale stamp or server informs of included tip. Simply stated Quill Creek should inform diners or simply go out of business."}
{"text":"Love this place and eat here often, you have to try the stuffed chicken with poblano mac and cheese! amazing"}
{"text":"Just recently relocated to the area, thought we would go have a glass of wine someplace local. We sat on the patio, great view on the golf course. I went with the house white which was my fav-pinot gregio $8 a glass which is to be expected for the area. Pleasantly surprised. Hubby went for the bargain brew - PBR 24oz $3 what a deal and he thinks it's old school fun. All in all we will for sure return and ck out the music on wed nights."}
{"text":"I have been a fan of Grayhawk's Quill Creek Cafe since it's inception....although they have the best corn chowder in the world...an ambience that cannot be beat...I must sadly say this restaurant is no longer on my list. We ate there twice last week. We took our friends for dinner, we all had salmon and trout. It was okay, not what I would expect from them. We went back for lunch 2 days later. So sad. Our food was obviously of very low quality. And the service was worse. I had the Grayhawk  salad , a Houston's Peanut Chicken salad wanna-be. It had thinly sliced processed chicken, dried up veggies, and a severely bland peanut sauce. I just quit eating. The waiter came to pick up our plates, and even though he didn't ask how our meal was, I expressed how terrible the salad was. He shrugged his shoulders, 'Sorry, it's one of our best salads'. Okay. Next."}
{"text":"Always great view guaranteed but surely more enjoyable during the fall and winter months with twilight fireplace outdoor seating. Brought an out of town friend here, big Phil M fan so he was ecstatic. Always go with the corn chowder and if you want a more sports bar feel with constant golf channel surround sound, eat next door at Phil's Grill, same menu and compare caddie notes with Greyhawk players."}
{"text":"My two raves about this restaurant are ... ~ The spectacular view - you MUST sit on the patio!  The fireplace there kept us nicely warmed on a cold night the first week of March. ~ The wine list, which includes some unexpected delights.  I tried the Field Recordings \"Fiction\", a small batch handmade red that was delicious and affordably priced.  I would return for another glass of that wine, which is sold out from the vintner.  I was in a social situation where my menu choices had to follow the lead of my hosts, so I wasn't able to sample the dishes I would normally have tried, but the standard American fare we had was good, if uninspired, especially the chowder.  Service was acceptable, but not stellar."}
{"text":"Part of the Grayhawk Golf Club, this restaurant is one of my favorites based on the view and atmosphere alone.  It's a beautiful setting!  In multiple visits, the food generally does not disappoint, though I have seen some inconsistency which is the main reason I cannot give 5-stars.  For example, for my last visit there I had a thick pork chop that was very nicely seasoned and cooked (great!), but the side of mashed potatoes in a bowl was just dead cold.  I had to send it back, which the server handled nicely and I ended up with a nice hot serving to finish the meal.  The one \"can't miss\" item you have to order here is the Navajo Corn Chowder - it is really good!"}
{"text":"the view and atmosphere is so wonderful at the cafe in the Grayhawk Golf Club. The patio has a great fireplace and overlooks the golf course and lake with the mountains in the distance. The food is average prices for a country club; it is really great though. They used to have a southwest chicken wrap that was my favorite but have since taken it off the menu. All the other salads are wonderful as well."}
{"text":"After my first visit I wasn't sure I would be back.  However, we were in the area and decided to give it another shot.  We were in the mood for a good burger so what the heck.  Back in August when we went the place was dead.  There were only like 10 other people in the entire place.  This time however the place was jam packed...both inside and out.  I'm guessing its the snowbirds but I don't know.  We went on a Wednesday and I guess that is the day when they have live music on the patio for a few hours.  They also have some decent drink and appetizer specials if you are interested.  The weather was excellent and the band sounded good so our party of 5 took a table outside.  We shared some chips and salsa, got a few burgers and salads, and listened to the band.  It looks like the same band is there every Wednesday for the rest of the season.  They are an excellent cover band and play some good stuff.  The first time we went here the service was a bit slow.  I thought for sure it would be horrible this time because there were tons more people, but I couldn't have been more wrong.  They had ample wait staff and everything was pretty quick.  I will definitely come again preferably on a Wednesday."}
{"text":"Always a good place to stop in since we live in Grayhawk. Food is good not great. Service is slow since it's always so busy but the food when it arrives is good. Great local spot."}
{"text":"Service is really good! I recommend sitting out on the patio and enjoy the view if weather permits :) I had the grilled cod tacos with fries and I couldn't finish (large portions for lunch). Nice place!"}
{"text":"A favorite place to dine alfresco, catching a glimpse of a beautiful sunset and all the desert has to offer. Quill Creek Cafe offers both inside and outside dining options. Cool evenings you might enjoy the comfort of their giant outside fireplace. Warm evenings are cooled by circulating fans and occasionally the feel of well positioned misters. Prices are reasonable and the selection is robust enough to satisfy most everyone in your party. My favorite selection on the menu would be the wings. They cook them crisp and season with either buffalo or ranch. Can't decide, order them 50/50. Wine prices are excellent and they have a selection of finer wines priced more on the retail side and not the inflated restaurant prices we are all used to seeing. Fish, burgers, steak, whatever you might be craving, Quill Creek Cafe will somehow satisfy that craving."}
{"text":"Love the pastrami on pretzel bread with brie cheese. Next favorite is the steak sandwich."}
{"text":"What a beautiful location over looking the pond and the golf course. We stopped by for lunch, the wraps are wonderful as well as the corn chowder. The service from the hostess to the waitress was excellent. This place is a real gem."}
{"text":"Came at night so can't account for the view.  Food was ok.  Nothing amazing.  Typical club type food.  My mom had the chicken pot pie which was probably the best thing so far - it was very wide in a shallow bowl so deceivingly big looking.  But it was good.  Otherwise, it took so darn long for the food that it was definitely not worth it though."}
{"text":"We had reservations for a birthday luncheon at this restaurant today. There were 9 people and they gave us one bill and we had to figure out what everyone owed. Of course they included the 18per cent tip . What a fiasco to try to figure out tax tip ect. We won't go back as this was such a hassle for us when all they had to do was give everyone their own bill. They said it ties up the cash register to long. Well they aren't even that busy to have it be a problem for them. Poor way to run a restaurant business. They just lost 9 customers but I'm quite sure they don't care."}
{"text":"Been going to this place for about ten years, lunch and dinner.  I am giving it two stars for the reason that last night's experience was poor. Lousy service. 15 minutes for drinks to show up and dinner took nearly an hour to show up. and the place was nearly deserted. The excuse was that there was a big group in the grill. Sorry but that is NO justification for poor service. Management needs a kick in the pants and the wait staff needs better training."}
{"text":"We have never had a bad meal here. We found it by mistake. We're planning to go to Isabellas kitchen across the street but it was too long of a wait so the couple we were with suggested Quill Creek. It is inside the Grayhawk golf club clubhouse. Each time I've gone I've tried something different. The salads are great. The corn chowder is excellent. The service is outstanding. The view outside on the patio is beautiful. I highly recommend taking out of town guests here. It's a little pricey but worth it. But...not for a soda. $3.50 is way too much."}
{"text":"The Quill Cafe has become a family favorite spot for special occasions. It's a bit pricier as it's inside of a country club, but when you're willing to splurge a little it's a great spot to dine. I'm obsessed with their Navajo Corn Chowder, the best corn chowder I've ever had hands down.   For their entrees, I've always stuck to their baby back ribs with are super tasty which come with seasonal veggies and I always choose their garlic mashed potatoes. I'm also a huge fan of their Halibut. It's cooked well and this time I subbed out the seasonal veggies for sautéed mushrooms which were yummy!   They have a very large patio which is awesome during the nice months in AZ that overlooks the golf course. They have yet to fail my family! Always great service and food.   Our waitress tonight, Sabel, which is a super cool name, was spot on, very accommodating, and friendly!"}
{"text":"Was taken here on a date for dinner.and the ambiance is beautiful. Since it was a nice night out, we chose to sit out on the patio (heat lamps are always a plus). I really wish they had lights on the course, so you had somewhat of a pretty view when eating dinner, im sure this would be a great place to have dinner during the sunset.  I hate the corn chowder as an appetizer, and it was PHENOMENAL. Being that my date was a scottsdale resident, thats what he stated was the best on the menu.  I also got one of their wraps, it was a crispy chicken wrap with honey mustard, bacon, lettuce and wrapped in a spinach wrap (if I'm remembering correctly) .  I wasnt 100% satisfied with my meal, to be honest with you.  The chicken was a little dry, the bacon and cheddar were lacking, but the honey mustard sauce and the spinach wrap were great!  I wish I would of tried the new menu that the server told me about. darn.  but if youre a golfer and you come by this course, i would check it out. Take the recommendations given by the servers though.  They know what they are talking about."}
{"text":"Love this place for several reasons.  One is the view  from the patio.  I have attended many celebratory luncheons and dinners and the staff is very attentive- if you have a large group they will have extra staff so everyone can get served at the same time.  I had the Kale Salad with salmon today which is a favorite of mine- although I did notice  the smaller portion size at this visit."}
