{"text":"My girlfriend and I came here for dinner and we were very impressed. The food was amazing and we will definitely come back. 
I suggest trying their sashimi (toro in particular) as well as their deserts. The vanilla ice cream was great."}
{"text":"Worst sushi restaurant in the Yonge Sheppard area.  Food was okay, but the service was terrible.  Menu prices are high for what you get - for those prices, I'd rather go to a really nice place downtown.  My first time at Raa was my last time at Raa."}
{"text":"I purchased a coupon from one of those group-buy sites a while back and finally made my way over here on a Friday night. Not sure how busy it would be, I gave them a call first and they said they had plenty of free tables. Sure enough, the place was nearly empty when I arrived.

The interior was nicer than I expected and I hoped the interior wasn't the only thing this restaurant had going for it... My boyfriend and I could tell the servers were very inexperienced. When I inquired about a few items while ordering, the server had to go to the sushi bar three times in a row to find out what the items were. Not a great start..

We ordered the following items:
- Pork belly $6.50: Not what I was expecting.. didn't seem like the fatty pork belly that I'm used to. Nonetheless, it was an okay dish. Another example of the servers' inexperience: When the dish was dropped off, she stared at it for a moment and told us \"Sorry, I have no clue what this is...\"
- Spicy hotate sushi ($5.50 for two pieces): not the freshest scallop, just okay
- Negi hamachi roll ($5) & dragon roll ($8.50): Meh... nothing special
- Grilled black cod ($9.50): One of the only times I didn't enjoy a black cod dish... mainly because the entire piece of fish was littered with bones! A definite choking hazard... watch out!
- Tempura soba noodles served cold ($12.50): Tempura was decent (not greasy), but didn't enjoy the soba noodles. They were too overcooked for my liking and the sauce just didn't do it for me.

Overall, just a very mediocre experience. Food wasn't particularly enjoyable... nor was the service, so I could see why it was empty on a Friday night."}
{"text":"Unique Sushi experience, good services & music. LOVE their rice. One of the very best choice for late night Sushi.  Back there twice in a week already."}
{"text":"Great atmosphere and decor, nice place for a date.

I rarely complain about food portions but man they are tiny here.  I used a $20 Groupon and felt like I got about $8 worth of food. 

I got a Groupon Now deal another time, just because the place is open relatively late. Got there at 12 (when the deal activated) and only about 10% of the menu was available - not even any sushi. Mainly just fried stuff like gyoza. Just warning anyone who plans to eat there late. 

Pro: Didn't get food poisoning and they often have deals on group-buy websites"}
{"text":"We waited exactly 1 hour to get our chicken wings, and between 30min-1 hour to get each drink we ordered. No, they didn't forget, they are just that slow. Yeah, it's pretty inside, but I would rather be eating or drinking than to stare at the decorations for 1 hour. The waitresses are nice though"}
{"text":"I've been to RAA twice now and both times I was quite happy with both the food and the service.  In particular, the owner took time to tell us about the efforts made to create a specific ambience using restored wood from a barn and a special slab of wood used to make the sushi bar.  

I really enjoyed the Onigiri rice balls - tried both the salmon and the eel. The seaweed was fresh (still crispy) and the rice was delicately flavoured. I also had the Negii Hamachi roll (with green onion) which was both tasty and fresh, as well as reasonably priced.

The Raa-men noodles was a tad on the salty side, but the noodles had a great al-dente consistency to them, along with velvety pieces of pork.  I also enjoyed the Crab Croquette which is very different fare from most of the Japanese restaurants that seem to be popping up everywhere these days.

For ambience, service and taste...I will definitely be back at RAA again!  I'm looking forward to trying other items on the menu."}
{"text":"This place was worst place on Yonge for everything
The service was horrible. It took 20 minutes to finally get water and tea as we asked 3 different waitresses.
The food we ordered took a long time. One item they came back and said they were sold out. The chicken karaage we ordered was still bleeding on the inside...it was the rawest piece of chicken i ever saw. It must have been in the deep fryer for one minute as the meat was pink.
The couple beside else ended up leaving after a 30 minute wait and argument with the waitress.
The waitresses seemed to not know the menu or how to be a waitress. One white guy was there trying to run the show but the others were clueless.
I would never go back as there are places 100 times better
the only positive thing I would say is the decorations are nice."}
{"text":"I first learned about Raa from raving reviews from Yelpers. I have mixed feelings about restaurant radar from Yelp based on previous trials (e.g. new york subs), and here we go again...

Thanks, Yelpers, for pointing it out because:
The store-front signage weakly announces the presence of this restaurant. Raa ain't no Guu and this is a far leap for downtown-based foodie explorations. Still, the venue is convenient. located near Sheppard Station with paid parking options, and close enough to walk from free, side-street parking.
Also, the decor is stylish. with dark/charred wood and stylish lighting throughout, it feels a lot like Guu Izakaya. yet, Raa's seating plan is practical and atmosphere is less rambunctious to allow for extended enjoyment of a meal with conversation.
And yeh, the service staff tries really hard to be attentive and friendly.

No thanks, Yelpers, I won't be taking your specific advice again because:
- Primarily, the food was simply, poorly executed. Cutesy fusion \"ideas\" on the menu showed up at the table greasy, undercooked, un-explained, un-assembled, and/or too literal. E.g.1. \"Takoyaki pizza\" was actually hot takoyaki with luke warm pizza sauce and unmelted cheese on a hot plate of oil that oozed from over- and under-heating the elements to compose this dish. E.g.2. Cold soba noodles came with a myriad of side ingredients to mix-in, but no instructions. The raw egg, barely pliable noodles, and an unhelpful server resulted in an inedible ad-hoc concoction. 
- Servers are untrained in basic hospitality. Smiles and hovering yes, but basics no. E.g. empty wine glasses should be a glaring prompt to ask if guests want refills. more, svp! 

 Another wasted meal due to Yelp :S

Actually, I had to edit down to one-star... because it's a restaurant and I don't really care about the decor if the food and service blow. Kudos to the design team and for people who are attentive and friendly though."}
{"text":"So many small sushi places on Yonge St. in North York, but which one to try?

With a team-buy coupon in hand on Sunday night, we walked into Raa and noticed the modern and romantic decor - dim lighting, urban canvas murals, Japanese pop music in the background....

Portions are a bit smaller than other sushi places but Raa makes up for it in quality. Our group of 4 ordered the Tuna and Tako sashimi ($7), Dragon Roll ($8), Spicy Tuna ($6), Dynamite Roll ($9), and 2 vegetarian rolls.  I was impressed with the selection of vegetarian options, we recommend the 'veggie tempura roll' (asparagus and yam tempura).

Miso soup bowls ($2.50) are very large (and soup/salad is not complimentary).

Service was fine. Our waitress was attentive without being over-bearing (but maybe that was because there were only 2 other tables dining)."}
{"text":"Hubby was impressed - this means we're coming back. Yay! This means a) the food was excellent and b) the portions were sizeable enough that he couldn't complain.  We had a four course teambuy deal with another couple that was definitely worth the buy.

Salad with avocado - good size, with tasty dressing that didn't overpower the salad.  Everyone should add avocado to their salad!  That little touch made an ordinary salad that much better.

Black cod served with miso and broccoli pesto - I hate cooked fish and this dish was awesome!!  So flavourful, and not fishy.  The miso was at first a bit salty for me but then it grew on me.  The broccoli pesto was a very different and delicious bonus touch.

Beef short ribs - a bit ordinary, tasty, but much too salty.

Sashimi/sushi platter - the presentation was beautiful.  The variety and selection was wide.  The sashimi was fresh and so soft.  The quantity was quite sizeable.  It was served a tad warm for my preference, but otherwise it was amazing. 

Dozen oysters - the guys just gobbled it up.  Don't they know that they should save some for their wives to get happy on the supposed aphrodisiac?  They were super fresh and so good.  It was just funny that it was served after all the other dishes previous which kind of threw off the taste balance of the meal.  All the heavier, saltier stuff were eaten first and then having oysters was a bit odd.

Black sesame/green tea ice cream - forget the green tea ice cream.  Go for the black sesame!!  The blackest black sesame ice cream I've ever had, and so so good!!  The presentation was really pretty too.

Overall - YUM!!

Green P at the back and the restaurant is located on the same strip as Joons (recognizable by its bright orange sign).  Raa is curiously not very noticeable from the outside, so look for Pizza Pizza or Joons if you happen to miss it."}
{"text":"RAA makes the best sushi around Yonge & Sheppard.

We have tried pretty much every restaurant in the area - this place has an amazing decor, amazing service, and most of all the best tasting and freshest sushi in the area.

I believe they had some hic-ups at start up when a groupon was released.  We read alot of bad press about the place - but visited anyways because its close to us - and we were absolutely blown away.  We won't go anywhere else now."}
{"text":"2.5

I don't know how to feel about the place. I went in really wanting to like it, but put it this way, would rather wait 2 hours for Guu. 

The decor is very nice. And although small, it seems to fit a lot of people without line up.  A definite plus was how we were able to reserve a table for 14 (and no per set gratuity) on a Saturday night. 

Although service wasn't the best (I ordered 4 things that never came because it was forgot and we ended up canceling it, twice our order was wrong and the waitress not understand what I was saying most times) - she was very nice, gave us separate bills (3 groups) when asked, and when our order was messed up, we got an extra on the house. 

It was only 7pm and about half the things we wanted to order was not available from the menu! (like Gyo Beef Tongue, Pork Belly - and Beef Curry instead of Chicken curry)

We began with takoyaki ($3.50 for 6 pcs - very much on par with Manpuku or Guu, but had a high ball to tako ratio  - but half the price!)

We also had the Dragon Roll and Spice Salmon skin roll. I've had better on Bloor street. There was no flavour in these. 

We had a 20 piece sashimi platter for $22. It was good, small slices and thin - quite fresh, but lots of filler right like Ibi and Surf Clam.

There was also veggie chips ($3.50) an assortment of fried taro, seaweed and shrimp pops.

Black Cod was also very good, and we were disappointed when our 2nd order of it was missed. 

You can skip the Curry - it was nothing special. 

Yakisoba was good - and we also ended up trying the Seafood Yaki udon which was also very good, as she brought that to us by accident. 

Everything we ordered was devoured as it came, except for one - the teriyaki squid - we didn't even finish it.... 

One thing that is odd about the restaurant is that you have so many izakaya and tapas style dishes, but the variety of it doesn't really give anything substantial unless you order a noodles/entree (unlike Guu). The entrees are only plated for one person (big flat plate with rice and salad on it )and very difficult to share - i would suggest that they plate it in a way that is conducive to sharing, as most likely this is what people were doing. 

For dessert there were only two options - mochi ice cream, or ice cream parfait with cornflakes on the bottom. For my fiance's birthday, i said mochi ice cream, but we got the parfait instead. 

Overall: there were many 2 star instances and disappointed faces - but there was also many +1 star moments too. 

(a comment about the website - highly annoying with pdfs for every pag of the menu - can't it be all one file!? and how it opens up in the same window, and I always end up closing it by accident) Also the menu is not up to date or complete on the website."}
{"text":"After a meeting at our Royal Le Page office in the Shops of Don Mills I headed out to inspect a property for a client in north Toronto.  I had heard the reviews on Raa Sushi and they were generally  good so we thought we would venture a wee bit north to Yonge and Sheppard and try it out for lunch.

About an extra 10 minutes from the Yonge and Lawrence house. When you first walk in this place is way too dark and far too loud.  You feel like you are in a Yakuza Club in Japan. It was 1 p.m. in the afternoon on a bright sunny day.

That was the only real fault of this restaurant. We had a great sashimi platter for lunch it was in the roughly $15.00 range.  We also shared some spicy tuna and salmon skin rolls. Everything was fresh with slices a bit on the small side, lots of filler pieces,plenty of ginger and good wasabi.

We shared a small jug of sake just to have a taste and check the quality. It was one of the best sakes in a restaurant in the city.  Not available at the LCBO. The only thing that did not smack of authenticity is that the sashimi came out with romaine lettuce and not shiso leaves.

I had to ask 3 times to get a few of those sent over. The owner came over to speak with us and is clearly concerned with how his restaurant is percieved. That's a good thing. I did tell him to turn up the lights and turn down the music.  He did this immediately... I mean a nightclub is great at night but not in the middle of the day.  The decor is very well done, but I think it was a mistake as it makes the place too dark and unwelcoming.

I believe this is why it was virtually empty except for ourselves and one other group of 4 people.   The food was good and the prices were a bit higher than some of the downtown places however, that is typical of uptown.  Service was a bit spotty as he is trying to train some new people.

But all in all if you are in the Yonge Sheppard area you can get a decent Japanese Meal here.I would not go out of my way to get to this one."}
{"text":"Such a fantastic spot for izakaya style food and sushi.  Really charming spot and vibe when it comes to Japanese in the North York area.. this place can't be beat.

As for the food and service, I found it to be impeccable and delicious.  One minor quibble is that they had a chicken thigh with the bone in, in the karaage which I felt to be kinda weird.

I went there with a deal from TeamBuy to give them a shot and despite that one minor detail (I guess it was the volume of guests they were handling), it was a really fun experience."}
{"text":"Decided to get Izakaya'd in the \"Traditional\" sense.  Round up the Guys(Karl R, Jennifer K) and went to a Sake Bar that had the elements to make Saturday Night good-times friendly.

My Izakaya Equation [SLAC]  =  Snacks  + Laughs + Alcohol + Casual Relax

          -=S=-

Negi Toro Roll($6.00)                    -  Hosomaki lets you taste !
Tartar RAA Style($14.95)               -  Tuna, Salmon, Hamachi, Pricey.
Gyu Tongue Shio($7.50)               -  Tongue has bite !
Yakibuta($6.50)                               -  Taste like plain Charsiu to me?
Takoyaki Pizza($7.50)                    -  Fresh made, score !
Sashimi($22.00/Medium)             -  Raaaaawesome !
Yu Dofu($6.50)                                -  Vegetarian Basics.
Mochi Cake w/Red Bean($4.50)  -  Careful of brain-freeze frozen Berry.
Mini Cheesecake($4.50)               -  1 for me, and 1 for me.

          -=L=-

The atmosphere was conducive for conversations(perfect room volume level), be it you make others laugh or at least a pathetic attempt to.  yeah yeah, it was MY pathetic attempt but so what because at an Izakaya you should be drunk enough to laugh at \"paint drying\".  I was able to hear both you guys loud & clear all night.    :D

          -=A=-

2-sided page Alcohol selection(Sake, Beer, Sake Cocktails, Shochu, etc...)  Much like the Food, it's slightly higher priced($1 or so per) but not enough to be significant considerations.

Calpis Chu-High($6.50)
Tequi-RAA($6.80)
7 Samurai($5.80)
Sapporo(6.50/Pint Tap)

          -=C=-

Design is Top-notch, no expenses spared.  Even the way down to the Washrooms had side-panels.  What hits it home(for me) is the design has that warm-comfort, along with sufficient lighting level, sweet waitresses, good music selection.  Feels like the right place to drink-up."}
{"text":"I came here for a friend's birthday dinner with a Groupon promotion.

You would think that with a special promotion, you would feature your most unique dishes in house. I came to find that it's nothing ordinary than other Japanese restaurant ordering a-la-carte, because anything unique was \"checked-out\" of the menu. It fails as an 'izakaya' restaurant.

The food
The sashimi and rolls were fresh and tasty. 
The fried squid was disappointing since it was over cooked. 
Pork belly, too dry and conventional.
Mixed tempura was disappointing, the batter was too heavy and the sauce taste just like soy sauce.

The decor
It's unique, but very crowded.

The service
Slow... very slow when the tables are filled. The table next to us got absolutely no attention after sitting there for at least 15 minutes waiting to wave down a waitress to place an order. I waited over 15 minutes just to get our cheque.

I'd only come back for the sashimi and rolls... if I had all the time to wait."}
{"text":"An extra star for this place not being packed to the gills Saturday night and the amazing great service. 

Sapporo on tap? I'll take it. Not a huge fan of Sapporo the beer but I loved the city and somehow I always find myself ordering it if found on a menu and tap. Sapporo the city is the Pacific Northwest of East Asia. A beautiful, sane modern city. I guess some guys select beer based on subconscious associations with lingerie bowls or Swedish bikini teams. I choose a beer that reminds me deep down of good urban planning. 

I can't speak for the food as I had padded myself with 3 hot dogs before an impromptu meet up with Jennifer K and Wayne C. Prices, however, did not seem obnoxious and there was a great grand opening discount that ends in at the end of April 2011. (Hurry hurry.)"}
{"text":"When Raa first opened, I gave it a bye, mainly because the trendy vibe Raa was giving off for an Izakaya. But on an off chance last week, I popped over here to sample their sushi lunch specials for a change of pace. 

I was surprised for a couple of reasons, the place is pretty much empty in terms of people for lunch, and their lunch menu isn't too bad either. Granted their lunch menu is limited and they only make what is on that page, so you technically don't really have to waffle around too hard to make a decision.

I decided to go for their roll combo (6.75) , which out of a list of relatively generic 6, you get to choose two. The first time I went, I picked  spicy Tuna and salmon skin.  Overall impression, it had pretty decent flavour and I was full after finishing both, which was supplemented with a Miso soup and a salad. (which apparently I am not supposed to get with the roll combo)

Service wasn't the greatest, as they were winding down for the lunch restaurant closing time of 2:30.  But I'll probably come back, because sometimes I just want some sushi without the extras, and for the quality I got for under $10, taxes in. I really can't find too much to quibble about other than the fact that I wanted to try the dinner takoyaki pizza.. during my lunch.

So, I'd probably show up here for lunch and not dinner."}
{"text":"I haven't been to a Izakaya in toronto, and because this place is only 4 min walk from where I live, I might as well give it a try.

This is the 2nd time I have been to this restaurant because we bought the  coupons. 

my friends and I went there for their appetizer and their side dish.

We went in on a Friday evening. We did not have a reservation but it was surprising to see the restaurant is actually fully packed. First time we came here, they were pretty empty.

And probably because of the high volume of customers, the waitress are extremely disorganized. They have probably 3 different waitress, and they came to serve our table different times. And they are very dis-oriented, seems like they don't know which table order which items.

Another thing about this place is, they have many items on the menu that they 'don't have'. How do you call yourself a 'Izakaya' if half of the items on the menu is 'not available'?

The reason we came back to this restaurant is because we like the seared tuna carpaccio. And they didn't have that when we visited 2nd time. They had a 'today's special' menu, and now they don't have it anymore.

It also took us forever to get our orders, and it also took forever to refill our tea. (Perhaps they should consider just leaving the teapot on the table?)

The takoyaki they have.. meh
The sashimi salad... ok
chicken karaage... it's wierd they have a whole drumstick with bone in there
Yakisoba...ok
Sushi pizza... I like that they put avocado and salmon, but they forget to add the onion to the topping, It felt greasy.
Beef tongue stew... very salty

the portion are small, so at the end we ordered a ramen to fill ourselves up. The ramen is good except it also took forever to get to our table. 

This will be our last time visiting, we will not return again (nor to buy the coupon)"}
{"text":"Wow...what an amazing decor and great atmosphere! Very fresh sushi offered with a wide range of apps. My only complaint is that the chefs were always different which made for some inconsistencies but I am sure I will be just as satisfied the next time I'm there."}
{"text":"I am always \"IN\" when my friends say let's go Izakaya! Especially when I know RAA was having a 15% grand opening specials.. I just could not resist!! 

The lighting inside RAA is dim.. the best lighting for drinks and date.. and your date would  look awesome with more drinks and dim lighting through the evening... and all the silly jokes would get more funnier!

Gyu Tongue Shio (tender, smokey and flavoured!), Takoyaki Pizza (if you love cheese and takoyaki.. you will love it!), Sashimi (great selections and excellent presentations.. great value!) all tasted awesomely good...

Was it the drinks? the lighting? the atmosphere? the companions? the silly jokes?  the pretty waitresses? the 15% off?

RAA is no GUU... I like it here better than GUU!!

Food is much better prepared with good selections of drinks! Services are much more attentive here too!!

I am here at RAA for the food.. but Wayne C and Karl R might be here for the amazing services? :)"}
