{"text":"When I don't feel like cooking, I make my way to Radica's for home cooked food.
It's feel good food for the soul.
Shrimp roti, soup, pholourie, doubles.... yummy."}
{"text":"I just discovered Hot & Spicy, not only was the chicken roti I had for lunch delicious, and large. I purchased two parathas shells to take home made fresh . I also like the ambiance of the restaurant , it up to date , modern and very clean. The music playing was a great vibe. I have already recommended this place to all my family and  friends."}
{"text":"It's great because there aren't any roti shops in the area. The service is great, friendly staff, and the wait time isn't bad. Being straight out of Trinidad I have high expectations for my doubles and it's sad to say that they didn't meet them. My saheena also wasn't cooked properly. I would definitely give it a better rating if the doubles weren't so stiff and the saheena wasn't so undercooked."}
{"text":"Food and service are great. To make this place a four star they seriously need to bring up the portion with the meat. I ate there 3 times to give it the benefit of the doubt. I ordered doubles to go the first time. They were awesome. Second time I stayed in and ordered bone in chicken. A few pieces of chopped up chicken is what I got on top of rice. So I said let me try again. Last week I ordered bone in goat. I received a few pieces again.  I mean prices are good but I've eaten at other west Indian spots. Not my first rodeo, same prices better portions. My meat runs out and I have a bunch of rice. Everything else is wonderful at this establishment."}
{"text":"Wicked!  It was my first time here upon the constant recommendation of a friend.  Got a double, which I never had before and a curry chicken roti.  The double was great and I would get it again in a heart beat.  The roti was amazing.  The perfect amount of potatoes unlike some other places that use it as the main ingredient.  I am whole heartedly looking forward to going back again."}
{"text":"Wow, Very good, if you like Roti's or Double's. Just got back to Toronto, to discover all the Curry dishes that were along Eglington Are Gone! I was here in Brampton & decided to see if I could find a place, wow talk about finding a Great little place.
Seating for 36, watch Cricket on two TV's or music video's. Not licence, but they have all kinds of sodas, ENJOY I HAVE!!!
Only 4 Stars cause they only have plastic utensils, at the moment. 
Note: Restraunt is actually off of Rutherford Rd beside Comfort Inn."}
{"text":"Usually go here for roti and doubles but will have to try some of their other items based on the reviews. I have yet to be disappointed with the dine in or take out. I typically don't ask for peppers as they can be very spicy."}
{"text":"My very first time having roti since all other yelpers were suggesting it. It's probably just me but I'm not the biggest fan of this. The seasoning was done well. The portion was quite large (I ordered a large roti and it filled a 20 year old chubby male). The roti was slightly on the dry side. The staff was very nice and the food came quick. I'm rating a 3/5 simply to show that maybe it's a you-love-it or you're-hungry-and-this-is-okay kind of place (I can't really see someone hating this. Not very enthusiastic sure but there's nothing to hate here).

I'm most likely not coming back due to my own food preference but for those who likes roti, this place is worth a look."}
{"text":"I didn't listen to my instincts and went back there and things haven't changed. Serving portions suck and food was salty!"}
{"text":"The food here is fantastic! Definitely a favourite in my household. The customer service could be better but the food is so good it doesn't matter. We met the owner once and he was nice, seemed to care a lot about the food quality and service. I highly recommend the mango chutney with paratha Roti it's amazing. It's a very busy place but we always order ahead and are happy to wait even if it takes a bit long sometimes because we're so pleased with our meals when we get it."}
{"text":"Went there for the first time and was super impressed with the retro decor and it's super clean! Even the bathrooms are very modern and extremely clean! 
Had the Goat Roti and it was mouth watering yummy and huge! Had to take half home for a second meal:)

Will return for sure! 
I don't know of many roti shops in Mississauga but this would rank somewhere in the top for sure!"}
{"text":"Order 555 with Silva at the counter for a large boneless goat roti and a bottle of guava juice drink was well received with courtesy and friendliness.  When the order was served at the counter, the thoughtful gentleman server placed the drink bottle at other end of counter close to the table I where was sitting so that I can easily retrieve it later as my hands were full with the plate of roti, cutlery for two and an extra plate.  I ordered rotis at other places and they usually came with only the roti.  Here at Radica's, the order came with shredded lettuce and couple slices of cucumber.  A complete meal!  The roti was more than just delicious with tender chunks of goat meat and mouth watering potatoes folded in the crisp firm roti.  My wife and I came to Radica's hungry and after the roti meal we left happy! I wrongly posted this review under the Radica's Winston Churchill location dated 7/9/2016."}
{"text":"As a spicy food fan, when I see a restaurant called Hot & Spicy, I add it to my must try list.

I decided to give Radica's a shot shortly after seeing the title of the restaurant. On first glance, the restaurant was super clean and new. A really nice environment for a fast food style joint! 
 
Between my fiance and I, we ordered two roti's - one spicy chicken and the other a medium goat roti. Oh boy, the roti's were awesome! Fresh, packed with flavor and actually spicy.  Portions were huge as well! 

We also tried a shrimp double. This was my first time trying a double. It was ok, but the real star of the show was the roti's.

If you're looking for genuinely good roti with a kick of spice, I'd say this is the spot!"}
{"text":"If I could give no stars I would. The food was horrible and made my family sick for two whole days after. Firstly too much salt in the doubles and aloo pie. Aloo pies were flat and not stuffed enough. Also we asked for everything on it(chutney,pepper) and barely got any in the doubles. Literally we couldn't see anything of what we asked for was put in. The roti(buss up shut) was a joke and dry and cut from a bigger piece. So we got a piece of a roti. We certainly will not be returning. They have sacrificed quality for quantity."}
{"text":"Leave it to a local friend to guide my taste buds on a trip to the Caribbean. Best part the total trip cost me only about $12.50!! 

Located in Brampton just off of hwy 10 and Queen you'll find this little West Indian gem. 

I don't know much about West Indian food but I know roti and curries and this they had a plenty. Now don't be sad when I tell you that beef and pork have no place on this menu because they have a perfectly acceptable substitute - boneless curried goat.

I had a choice between rice and roti... Guess how hard that choice was? Roti. No questions asked.

My perfectly packed and folded roti envelope came shortly there after literally bursting at the seams. And it wasn't just packed with filler either! Each curry covered bite was filled with succulent, tender, perfectly cooked goat meat. Literally to die for!

When I ordered I'd asked for the roti hot but the kind man at the counter looked at me with distrust, as if to say \"I dun trust this white boi\" and kindly suggested I try medium because he didn't want to be charged with assisted suicide. Fair enough - game on. 

Medium was more than tolerable on the patented Eatcrest Spice Scale. A 2.5/5 at worst. However ill award and extra 0.5 because right at the end there was a patch of roti that was hiding a small forest fire and it caused 3 new chest hairs to grow. True story. 

To wash this all down I went for a bottle of sweetened Solo Gingerbeer which is apparently native to Trinidad. Not too peppery but a perfect accompanyment to my meal. 

Great meal. Neat hidden spot. But consistently packed! Locals advise that weekends are out the door slammed so come prepared to wait... For an amazing meal!!

Eatcrest out."}
{"text":"Yeah they are nice but the food...not impressed. I ordered chickpea roti with no specs and when I got home and ate it, it was so spicy (I eat spicy food daily) it was unbearable. They type of spicy that covers up all the flavour.  Mollys on Chrysler is the BEST!"}
{"text":"Been here quite a few times; get doubles that are really filled; the
Mutton roti is so tasty; beware of the heat; their \"hot\" on a scale of 1-10 is about a 15!

I now order mild or no spice (and its still got kick); great taste and prices are reasonable.

Go there at least twice a week"}
{"text":"Been here many times.  I like their lunch specials.  Usually it's a small bone-in-chicken or boneless roti with prices ranging between $3.99 to $5.00 or so + tax.  Small portions, but then again, it's a small.  I really enjoy their Jerk Chicken.  When I buy this, I usually order a large to get my money's worth.  The large goes for about $12 with tax.  

Their hot sauce does have a kick to it.  Kind of reminds me of Chetty's Hot Sauce, but I've never asked if that is in fact the sauce.  It's really good if you like the hot!  The place is brand new, so it's pretty clean.  The only thing is I try to get there early before the lunch crowd because of the long wait time.  Like many of these Caribbean and West Indian places, they work in slow motion.  It's always 'Island Time' for them kno wa me say?  Other than that, the place is great. 

C.L."}
{"text":"Great food and very friendly and fast service.

The goat roti was finger licking good as were the channa and shrimp doubles

I am certainly going to add this place to my list of 'must visit regularly'"}
{"text":"Wow! Lives up to its name. The most fresh and delicious roti I have ever had. Hot sauces are homemade and out of this world. These guys own jerk chicken. Phenomenal stuff. Don't ask for extra spice though or it will hurt coming out the next morning. Regular is spicy enough."}
{"text":"I've been craving a West Indies chicken roti for a while now, and today after reading some of the reviews of fellow Yelpers, I chose this \"Hot & Spicy\" location. 

Walking in I found myself the only white person in the place... But I often find myself the only white person in Brampton... so nothing changes much here. There are quite a few people sitting at the dine-in tables or standing around the counter waiting for their takeout order. 

The menu is an array of Indian/Caribbean fusion! Some items I cannot pronounce nor do I know what they are... Keep looking... Ah! Boneless Chicken Roti! 

I place my order and I have the option of spicy or no spicy! I obviously pick spicy as I have developed that part of my palette for many years now.

It was a short wait before they called out my takeout order number. I left with the take out package noticing I had some significant weight in my hand. 

Arriving at home, I opened the delicious and HUGE roti onto a plate and sat down to my movie. My first bites were just the nice chewy flat bread wrap, complete with cornmeal confetti! Just the way I like it! As I get to the filling I can feel the spice hit my lips and tongue... YUM! I get my first bite of potato, the next is a morsel of tender chicken breast. The innerds of my roti explode with a beautiful blend of spice hotness and flavors. 

Ok so if I didn't tell you before this is a HUGE roti. I have presently taken a break after eating only half of it to write this review... Debating if I shall leave the rest for later or just continue to feed my taste buds... hmmmmm

This is the first place I have tried Roti since being in Ontario, but I would have to say it would probably be hard to beat!"}
{"text":"I have been coming here for the past couple of years to satisfy my Roti and Doubles cravings while I'm at work. I'm not sure if I'm coming because of the proximity or because of the quality of the food. 

The store is located near the side back of a plaza, right beside another Caribbean restaurant. The place is big enough to accommodate roughly 20 people if you want to eat there but takeout is their main business. You order on the right side, by the cash register and your order comes out on the left. We came on a Thursday afternoon and the place was packed. The drawback of eating there, it's that the place becomes really tight when you have people ordering and waiting for their food, hovering near your table. 

I'm not extremely familiar with West Indian cuisine but I have come enough times here to know that the quality of their Roti and Doubles is decent but inconsistent. Sometimes though there's too much dough on the wrap, and not enough filling or meats. As you can see from the picture, their large size is as described. The level of hotness can vary even for a mild to the spicy side. Also, service for the most part can be slow. I ordered the Large Boneless Goat Roti and was good.

Recommended to at least give them a try and taste it for yourself."}
{"text":"I ordered from this place and they gave me half rice and half chowmein when I order a special fried rice dish...this has happened twice now. I don't know what they're problem is but I'm not ordering from them again, clearly whoever takes the order doesn't understand English. Pay attention to your customers."}
{"text":"Probably a 3.5, but it was better than average, so let's go with the 4.

Service was poor, but I don't come in expecting great customer service in West Indian restaurants. The guy taking the cash (who seemed to be an owner and/or manager) had no idea how to apply the 5% discount with Yelp check-in and didn't try to remedy the situation. I then provided small change with my bill so I'd get only loonies and toonies back. He was really thrown off and said \"you're confusing me\". I won't even let it affect the rating since it's par for the course.

I may try the goat roti another time, but thought I'd go a little more safe with boneless chicken on my first visit. I ordered spicy and I'm glad they made good on it when I was able to taste it for myself. The chicken, gravy, spice and the rest of the filling were delicious. For the roti itself, I've had better, but still pretty good.

I had dine in. Like the service, it's only about being functional, with picking up your own food and having plastic utensils. At least I got a real plate, but a normal knife would be nice when cutting through layers of roti.

Just know that you're here for the food only, and to that end, it's worth coming for sure."}
{"text":"I love their roti, it's sooo good, probably my favourite in town. I wish they put more chicken, there is lots of potato, but, it's super flavourful, so I don't mind that much. Staff is great, too."}
{"text":"My first time Radicas and it was pretty darn good I am West Indian as well as a culinary student so I kno good food and flavours and this was on point ! I order the Shrimp Doubles 4.50 , boneless goat roti I believe was about 10 bucks and the Saturday special fry rice chow me in and fried chicken leg sauced on top ! 8.79 the serving sizes where very good i started with the shrimp double this is my first time trying doubles and it was awesome the shell or dough that the chick pea curry filler with curry shrimp is in is so soft and airy and chewy with the spicy flavour or the shrimp and smooth rich flavour of the chick peas I'm craving one as I speak I was actually full of just one but I had  to move on to the roti the have nailed the perfect roti shell it's so soft and airy I've never experienced anything so heavenly it was like a light pillow in my mouth as soft as a good marshmallow so good The boneless goat roti was very good very nice size of pieces of meat and very tender very fulling great flavour not to salty the doubles are my fav I do prefer jerk chicken roti tho ! The chow mien fry rice special was very authentic it tasted like home cooked Guyanese meal the chicken cooked prefectly the fry was u uniquely flavoured well overall very good will come back the have great lunch specials I did wait quite a bit but I'm guessing it was due to the shrimp double which was freshly made  great job Radicas"}
{"text":"This was my first time at this location.  I was craving curry chicken and got more white rice than curry chicken.  And to my disappointment the chicken was dry and the favour of the curry was bland.  Not a good experience for my first time."}
{"text":"Was in the neighbourhood and wanted a light lunch. Instead of going to Tims near it we went in at Radica's. The restaurant is some tables and is fairly clean and staff making efforts to keep it. 

The ordering was simple as we ordered a large Aloo Channa Roti to be shared between the two of us. We ordered mild and a side of spicy sauce for me. 

The Roti arrived and size is LARGE. Enough if you are super hungry. The Roti soft and stuffed daal. The fillings of Channa (Chickpeas) was packed. Very little Aloo (potatoes) though. The spiciness a bit for her but when I added the extra sauce, it tasted amazing. Even without the sauce, it had great flavour. 

To eat is a bit messy, but nevertheless leaving you to want to eat more!!!

Hopefully we are in the neighbourhood soon."}
{"text":"Have been there a few times and once at the Brampton location. 

This location is much cleaner and a pleasant to sit in. Ordered a large extra spicy Channa Roti in plain. paratha instead of daal stuffed paratha that is usual. Also a regular size Aloo Roti in daal stuffed paratha. 

On a Saturday steady customers are coming in and enjoying their food. 

 By the time I reached home and started eating it wasn't at least 30 minutes. As I bit into the Channa Roti, realized it was still piping hot and how about the taste? Super Hot and flavoured. Amazing taste, flavour. The paratha cooked to perfection with layers. The channa (white peas) cooked perfectly. 5/5

The Aloo paratha was also piping hot but as I had requested no spice for the Mrs, it was still a bit hot and nicely flavoured. The stuffed paratha was good, but I personally prefer the plain. For $11 plus tax amazing deal. The large roti was plenty and satisfying. But still leaves you wanting more."}
{"text":"I really like this place!   The food is great and they have a great variety of food.  I only wished that they had a better dine in option and the food was a little cheaper or it would have 5 stars.  Other than that this is a great place for take out."}
{"text":"FAN-friggin-TASTIC!!!!!!!! I HAVE TO SAY EXCELLENT WEST INDIAN RESTAURANT!
EXCELLENT Service- Fantastic FOOD!
Clean and welcoming! I will definitely be coming back to Radica's thank you so much for a True friendly west Indian Experience!! I had the salt fish Double Terrific! My son had the Goat Roti it  was scrumptious and we tried the boneless Chicken Roti Yummo!
Thanks again Radica's!!!!!"}
{"text":"If you haven't had their doubles you are missing out some amazing, cheap, delicious food.

I was accidentally in this area and I decided to check my bookmarked eateries in the near by area.Radicas was the first to pop up and it got me super excited.

I went in around 2pm and it's absolutely quite just one more customer apart from me.The lady who took my order was friendly and offered to help if I had any questions.

I knew exactly what I wanted and without any hesitation I ordered a goat double.It was fresh warm and delicious.The meat and chickpeas both were super tender and very flavorful.I found their doubles not so greasy.

Though I togoed my food I did use their restroom and it was super super clean.This restaurant itself is very clean and spacious.There is lots of parking spots outside this restaurant."}
{"text":"Yum!! Let me say that I'm only giving a 4 star review because I haven't tried enough of the menu to make it 5. But I WILL! Today I went in there hangry,  so I stuck to basics - doubles and my son had the boneless chicken roti. Fresh, delicious, not too greasy (like some doubles can be) and the perfect amount of spice. I can't wait to go back to try the shrimp doubles and some of the specials. Very friendly service (the owner was very nice to my teenaged son), clean, comfortable decor. We ate in, which we wouldn't have if the decor hadn't been so welcoming. They seem very busy, which is a good sign! I'd been meaning to give the place a try, and I'm very glad I did! We will be back!"}
{"text":"From the old hole In the wall - Shalimar Pakistani Restaurant to this redone Urban Contemporary West Indian Restaurant- Radica's Hot and Spicy.  Chips like it hot and spicy!!!!  It is two o'clock and time for the daily feeding.  Imagine Old School Buju Banton lightly pumpin out of the stereo speakers, \"cause I keep on,, loving you,, and I don't know why,,oh why\".  I can only say that this is one heck of a transformation. Don't get me wrong now. I miss Shalimar's delicious Butter Chicken and Burnt Naan.   Back to Radica.  This is their second location. First one in Brampton now here in my Sauga. This place is clean. Spotless and Halal. Plenty of seating every where. They offer daily special so don't forget to ask bout em. The menu monitors also display the daily specials. Let me tell you what l have eaten here. I have tried the Shark and Bake, Doubles and a Mini Boneless Chicken Roti.   I start with the three orders of the doubles- hot. Nom nom nom. All gone. A Double, in case you don't know, is a chickpea stew wrapped up in between two pieces of fry bread. A chickpea stew sandwich. Beautiful smooth texture with a nice hit of garlic and sweet heat.  I can eat them everyday. The Thursday special that I chose was the Mini Chicken Boneless Roti- hot. Vacuum on and I sucked that roti down. If you haven't eaten a Chicken Roti, it is basically a chicken stew that is wrapped up in flat bread called Roti. It is usually rectangular or square in shape. It was a perfect ratio of chicken to roti. Every bite of chicken was moist and juicy. The curry stew in the background was scrumptious and added to the moisture in the dish. It all melded perfectly and was nice and spicy. The way Chips likes it. Oh ya!   The Shark and Bake was unique.  Deep fried shark in cased between two pieces of bake. (Deep fried bread). The shark had a dehydrated texture to it.  A really good chew to it. Not my style. See my pics. Peace out Yelpers."}
{"text":"I have only had there doubles but I was not disappointed. I went back and second time.  I tried the regular doubles and the goat doubles both were delicious and flavorful and reasonably priced. The goat in my double was tender not chewy at all I would definitely recommend"}
{"text":"Went in here with a buddy to have a quick dinner after reading alot of great reviews. The sizes come in small, regular, or large portions and the price, while more expensive than most carribean places, was definately worth it!

I ordered the regular jerk chicken and it comes with a drum and thigh darkmeat, rice and peas, and coleslaw. The sauce had a big kick and the chicken was perfectly cooked! I wish the coleslaw wasnt minced up, it resembled baby food but it still was decent. Overall i enjoyed the meal and its gonna be one of my regular places to go to."}
{"text":"SKIP THE DISHES ORDER - 
Sent us everything with pepper sauce (Tamarind chutney is a type of pepper infused sauce) then lied to skip the dishes and said everything has spices/pepper already in it. Tamarind sauces and chutney can be made without pepper, your store just chooses not to.
This was our last order with Radicas. I am disappointed with their unethical behaviour.
Service is indeed horrible and they have no problem lieing.
***They deleted their nasty response... so I posted a picture of it (I figured they would delete it after embarrassing themselves). The following was my response to their attack and proof of their stupidity.***
Shiva :- We always put the same message and there is never a problem. Learn to read the message people enter, it's there for a reason. The app from skip the dishes forces you to choose an option. We are forced to choose a chutney type (Stated 'forced' for a reason, as we know it's made from pepper. Guess I need to make things VERY clear to you, as the common sense you want others to have, isn't applicable to you. Lol. Note Feburary 11th order pic. You understood that day. Lol. Or how about the March 25th order from UBER EATS. You understood that day too...Lol) and the 2nd option is No pepper/No sauces. You screwed up, take responsibility for your screw up. That's just common sense and proper business practice. You also lied to skip the dishes and said the items were made with the sauce in it and just lied further on here, so get your story straight.  
Is it common sense to make something WITH pepper and then give the 2nd option to have no pepper or sauces? Maybe to you, but I don't want your level of common sense...
** But since you brought up asking first, isn't it the restaurants responsibility to call the customer and clarify when they don't understand the note 'No pepper please'... Common sense once more for a business, just not you. All attitude and no basic sense. But as you can see from the February 11th and the March 25th orders, you understood just fine. Lol
Bravo on embarassing yourself.
Since you brought this up. High school and middle school are free, you don't need to pay. You would have known that, had you ever attended and would have had a clear ordering menu for skip the dishes and uber to follow... had you had even a middle school education. You wouldn't be so low class (lieing) if you could afford to send yourself to business school, that much is painfully obvious. Lol
And FYI... SKIP THE DISHES noted the issue with their app & the menu and I received a refund a while ago. Lol... The only loss was on your part, looking like a lieing, unprofessional, backside. Lol
OH! SO YOU ADMIT YOUR MENU OPTIONS OF ONLY 'MILD, MEDIUM AND HOT' MAKE NO SENSE. BRAVO! LOL! So fix your stupid messed up options, it's not rocket science... well maybe for you it is.
The food is sitting here because he can't eat it, we even offered to return it to skip the dishes. Again more assumptions and lies.
Only thing 'cheap' about this is you refusing to redeliver the items you screwed up on, we never even asked for a refund. We were giving you the chance to redeliver the items made correctly. How Pathetic... lol. You can't even keep track of your lies (I wanted a refund for a free lunch or redelivery...pick one).
It's proven for everyone to see, your level of customer service and assumptions, as well as your sad intellectual limitations, if you even ADMIT the options you gave Uber eats and Skip the dishes make no sense, but continue to attack customers who have to use it. Lol *applauds* your level of idiocy is astounding, as well as concerning...
And FYI - Just wondering if your the sad lady at the counter? My friends were just saying you screw up orders even when they place the order at the counter. LOL! You should focus on your customers, multitasking is CLEARLY not your strong suit. Thanks for the entertainment. Laterz and good luck. You should check out a business degree, or in your case middle school... it might make you happier not to be so simple. :)"}
{"text":"This is a mixed review based on 2 visits so far.

I went in today and had the buffet for 9.99. All though the price is great. I was not a big fan of the food. The chicken was little under cooked and lacked any true flavour. The Goat was tough and the rest of the stuff(veggie dishes) I did not like at all. Mind you I am not sure how the other stuff should taste.

The first visit was few weeks back and I would say wait time was very long. The food was 8.5 out of 10. I had Fish curry and rice and dahl. The only thing is I thought it was little pricey for the size of fish I received. 

I will go back one more time next week to try the roti! I sure hope it is the best in Town. Because that is the real reason I actually ever stopped here, but got distracted both times with other meals.

 Size and Quality rotti's is what I am looking for."}
{"text":"The level of pride is evident in everything they do. Service was friendly and helpful. Place was spotless and had a nice open feel to it. Food was legit. Have already placed an order for a large gathering this weekend. This has ended my long search for a go-to West Indian spot."}
{"text":"RIPOFF ALERT

Sunday Sept 24 order 331: two doubles and a boneless chicken roti.

Get all the way home and cut into it, and it's a small goat roti. I don't even eat goat! Immediately called the restaurant and the girl actually had the nerve to say she has to to assume we are trying to get free food, and wants me to literally drive it over to show proof?

Are you guys insane? You absolutely ripped me off and will not even Honor the credit. Buyer beware, this is what you'll look forward to when your order is inevitably wrong

Look at my post history. I'm not a liar, lol..  how stupid is this restaurant that they'd even risk saying something like this to somebody over what must cost them literally a dollar max to replace in the future. Hope it was worth it...

LATE EDIT: another Yelper just sent me a message. They screwed up her order and put hot pepper sauce on everything, then literally used the exact same line about trying to get a free meal.  This is truly unbelievable, rofl.."}
{"text":"I came here craving roti and ended up getting both boneless chicken roti and jerk chicken on rice at $20.90 for the pair.

Their roti was okay, it didn't hit the spot where I feel satiated from the flavours and textures of a good eat. The boneless chicken was large 1\"X1\" chunks that didn't carry much flavour and I had 4 or 5 pieces in mine. I don't think the chicken is marinated. The curry wasn't memorable either. The way it was wrapped was too loose which made it hard to handle. It was a hot.. & spicy mess. 

The jerk chicken was sweeter than most places which I didn't like. The rice and peas were standard. The coleslaw that came with it was decent. It was finely minced veg with a light dressing of mayo. 

The service was very friendly though and I hope the best for them. Also the place is very clean and well kept."}
{"text":"This use to be my favourite roti and doubles spot but the quality has gone down a lot! I payed $9 plus tax for a small boneless chicken roti. There was big pieces of Bayleaf,onion skin and thyme stems in my one roti! The prices have all gone up but the quality has gone down! The shell of the doubles is so thin it can't hold up the contents inside. I won't be returning."}
{"text":"I've really enjoyed this place the last few times I visited, and it's become my favourite spot to pick up West Indian food in Mississauga! We've only ordered \"doubles\" here so far (generally speaking, it's basically a type of street food made up of flat bread stuffed with curried chick peas), and we've had a positive experience each time. 

Doubles here are, in short, made quite well. The filling is incredibly flavourful. The flatbread isn't totally the perfect blend of chewy and crispy that I usually like, but the filling makes up for it. Wonderful kick, and a great blend of flavours. 

The place itself is very clean (it looks newly renovated), the counters are spotless, a good diverse menu, and service is always friendly. It's located just north of Winston Churchill and Dundas (if you're driving going north, it's just before the Longo's plaza). There's also lots of seating, so there's space if you want to eat in with family or a bigger group. We'll definitely be back!"}
{"text":"Very nice. We ordered a little of everything.  Everything was good.  Everything got eaten.  The goat curry sauce was eaten even after no pieces remained.  Chopped up the rest of the roti a day later and mixed it with the chicken and lentils in a fry pan and YUM.  Yay! I'm a fan."}
{"text":"Had a chance to visit this restaurant for the first time with one of my clients. In a strip plaza. Was delighted by the terrific service and great tasting food. If your looking for a different variety of flavors - strongly suggest visiting for lunch! Awesome service"}
{"text":"Came here for the first time with a takeout order and I was not disappointed!  I got the vegetarian special and did a roti with the squash and the spinach.  The roti shell was AMAZING, and the the squash and spinach was properly seasoned. I'm super excited to go again!"}
{"text":"Added 0.5-1* for value, cheap/fast eats!

I didn't meet Radica, but she was sure hot AND spicy!  I ordered a bone-in goat roti with a medium spice and it did have quite a tears-comin'-out-of-eyes kick to it.  Goat had a lot of flavour to it and wasn't salt ladened...as I find most West Indian places.

There was an electronic board with daily specials on it.  And by specials, I mean $4.99/$5.99 prices and options that you actually wanna eat.  My bone-in goat was $4.99 AND it came with either a canned pop/bottle of water.  

I wasn't able to go to a Burger Binge today, but the prices were in-line with what I would've spent there, so I was happy.  ;)

I do feel a bit bad that Allspice, who shares the same parking lot, and offers the same type of food, BUT is slightly outdated will be experiencing some unfair competition.  :(  

Restaurant is new and so is the interior.  Staff was friendly and upbeat!"}
{"text":"They really need to work on their customer service and food quality. One order will have an edible level of spicy, the next order will be inedible because they decided slight pepper meant something else. There is no consistent threshold for spice level even if you choose the appropriate one, it's pretty much how they feel that day. As others have pointed out, they are really cheap with the meat, and channa and aloo. Ordered doubles and one aloo pie with channa, my aloo pie was flat and barely any 'chickpeas'/channa to be seen. Don't get me started on the roti and chicken, you might as well just order roti and potato because they are CHEAP when it comes to giving you meat, you get about 2 very small pieces. Not worth it."}
{"text":"Soooooooo good. Decided to try because its nearby my work and I ordered through ubereats. It came pretty hot still. Max 30 mins.  Got the boneless chicken roti. It was a lot for what I paid!!! I was able to have leftovers and brought some to my sis and she said it was one of the best rotis shes ever tried. I didnt agree but its still up there. Will def try going there next time Im craving"}
{"text":"Went there with a buddy, ordered a Goat Roti Wrap it was outstanding. Went back again the next week with four other friends. This time I tried an Aloo Pie for appetiezer and boneless Goat over fried rice. Everyone else tried the shrimp fried rice & chow mien with chicken. It was a chinese dish with a west indian flare. You have to try this place out. (Just go easy on the pepper sauce :)"}
{"text":"This is a Halal restaurant.

I had the aloo pie. It was good.
You can choose to put chickpeas in also, but they don't put in a lot.

The size is enough to fill one persons belly."}
{"text":"I love this place! Absolutely delicious roti and doubles! Amazing spice level that you feel deep in your gut."}
{"text":"Was waiting for this spot to open up and it was worth the wait. Ordered their Tuesday special, a boneless Chicken Roti for only $3.32! Great price, great taste. Can't say the same for the 2 doubles I ordered though, they were average, only thing keeping it from 5 stars tbh. Nice clean restaurant, cool staff, coming back again"}
{"text":"Portion was large.  But not enough chicken.  Mostly potatos and curry sauce.  

The curry tasted good.. but couple of pokes in with the fork.. You realize theres no more chicken and your literally just eating roti bread with curry sauce.  which is pretty much pure carbs and filler.  :(     i still give it 3/5 because the curry tasted good.  TIP:  sign into facebook to get 10% off  they no longer accept YELP."}
{"text":"Amazing roti love their Tuesday specials!! Great flavours in the curries and other sauces and their roti is simply the best. Customer service can he improved but nonetheless a great place to grab something fast."}
