{"text":"So disappointed. As a south end resident, I was so excited to see a new restaurant pop up in my neighborhood! After much anticipation, it finally opened and I checked it out about 4 weeks after it opened. I sat at the bar and the bartenders were attentive right away. Unfortunately they took my order wrong and when it arrived incorrectly, they acted as if what I ordered was not on the menu. And by acted I mean that they told me what I ordered didn't exist. .When I physically showed them that it was listed on the menu, they got defensive and then eventually said the kitchen could remake it and start over, but by then I was ok to just try what I had. It was flavorless and overpriced. While the staff was nice, and the atmosphere has potential, I'd recommend to walk a few more blocks and just go to Thai taste. It's so much better, and if they messed up your order (which to date has never happened), they would not make you eat it or feel badly about having it corrected.  I wish them luck but will not be returning."}
{"text":"Great authentic Thai food! 

Food: They bring a different style of Thai food that doesn't exist here in Charlotte, it's a mixture of street style/modern Thai cuisine. So it sets them apart from any other Thai restaurant here in Charlotte. 

We ordered the Larb Ped -#1 favorite, pad thai, crab fried rice, papaya salad (Laos style), pla duck fu -2nd favorite, and thai fried beef jerky. Great presentation. 

Service: We were kindly greeted upon arrival. Our servers Pooh and Noy were amazing, we liked every dish that they recommended.

Location: Off South Blvd. very centralized to uptown residents. 

The only reason why I didn't give them 5star is because the portion was very small. 

Overall great food and service!!"}
{"text":"Went on a Friday night. Got seated immediately, server was friendly and prompt. Ordered pad Thai and basil chicken. Food was piping hot and so delicious. Our server also brought out more hot sauce before we even requested it. This may be our new Thai takeout place. I love Thai taste, but the basil chicken was incredible. My boyfriend thought the pad Thai was better than Thai taste. I don't, but it was still amazing. We will frequent this place."}
{"text":"Been to Thailand many times and I can say, this place is the real deal! Service and food both!"}
{"text":"So happy there's a Thai place in the Southend. And it was so good. We got Pad Thai, it was a little 'saucey' compared to Thai Taste in Dilworth. Both good in different ways. We also tried the basil chicken with white rice. So good. Inside is small and contemporary. The music was a bit trendy, kinda EDM, but it worked. Waitstaff was friendly and prompt. We'll be back."}
{"text":"Rai Lay...home to one of my favorite dishes in Charlotte! I had tried a curried noodle soup up in Raleigh that I couldn't forget and my search for the dish here led me to try Rai Lay's Kao Soy. Incredible! As far as noodle soups go, Kao Soy is such a flavorful dish that I will now always choose it over any ramen or pho in town (and Futo Buta is about 30 meters around the corner)!"}
{"text":"I felt like getting some take out the other night while on my commute home.  I was driving so I couldn't look at the menu, and Ivy, who answered the phone,  was so kind to entertain my questions and tell me about some dishes.  I ordered the Pad Thai with Shrimp only and she suggested the Shaking Beef for my boyfriend.  Both dishes were excellent.  We had a great first impression that left us wanting to go back."}
{"text":"I come to Rai Lay, and order the same thing Lad Nar thanks to Pooh who is amazing. I'm giving a one star because there was a piece of hair in my food distinctly different from my hair in my take out. The manager only offered me a comp on my next meal if I came to pick it up. I don't have a car so needless to say, I went my without food for the night."}
{"text":"The crab fried rice is amazing! Also it has such an eclectic atmosphere that's warm and inviting to match! I will make it again for more deliciousness!"}
{"text":"A co-worker and I ordered Rai Lay through Postmates and couldn't have been happier! She ordered the shrimp pad Thai and I had the drunken noodles. Both were great - I tried some of the pad Thai too. I asked for spicy and it sure was spicy but I loved it. Definitely going to try this out in person."}
{"text":"The food is always great. My new favorite dish is sweet and sour w/ chicken. Amazing. Their Basil chicken is also great."}
{"text":"We had a great time last night and Pooh made the difference. We have a lot of Asian food being from the NYC area this ranked up with the best of them. Clean crisp food prepared quickly and not to spicy. 

Only need the saki portion to be much bigger."}
{"text":"The shaking beef is great and great value. Loss of one star is due to policy of closing kitchen at 9:50 which is dumb and inconvenient for customers.,"}
{"text":"Delicious!!!! Kao soy was awesome! Will be going back for this again! Great service too"}
{"text":"Unexpected find!!! I go to school by this place and it has become my favorite lunch place. Great food!! Decent prices!!"}
{"text":"I had such a wonderful meal here. The Beef Jerky was delish, as well as the Thai Sausage. My partner and I shared the Oyster Omelet and the Shaking Beef. I'd def recommend both of these entrees. Our server, Howdy, was a pleasure and helpful in telling us about the menu. Looking forward to coming back."}
{"text":"We were headed to the 'Ole Faithful' Thai spot on East Blvd.  But this little gem caught my eye.  We made a quick U-turn and headed back to Rai Lay.  The inside is small and cozy, it was pretty steady for a Sunday evening.  The aromas leading up to the walkway were tantalizing!  We were NOT disappointed!  Our order: Thai Wings (6), Drunken Noodles (Shrimp), Chicken Pad See Ew (not on the menu), Thai tea...all were absolutely DELISH!!!  The portions were good, the food came out pipping hot and the taste explosion...WOW, we'll be back for sure.  You won't be disappointed, PLEASE, PLEASE don't change chefs and/or recipes (like most new restaurants end up doing).  Keep everything AS IS and I'll be a forever loyal customer!"}
{"text":"I was blessed with the opportunity to live in Thailand for 6 months and I have missed the food ever since. Rai Lay fills that void with authentic, amazing Thai food. I have tried Thai in LA, Chicago, New York and Philly and this place is by far the best Thai food I have had in the US. Get the Khao Soi, you will leave happy and full."}
{"text":"Don't be fooled by the somewhat generic atmosphere (its nice, but looks and sounds like it could be any new Southend bar or tapas joint), this is top notch authentic Thai food and unlike anything else we have in town. I have heard it billed as fusion, which is a little misleading. This is not americanized at all really, its just that there are a couple of dishes that steer a little more Malaysian and Laotian, and they do have sushi which is obviously not Thai. I didn't try the sushi, but it does seem like its there only for broader appeal, and I wish they didn't feel obligated to do it. I'd much rather see the core Thai menu expanded!

We shared a lot of appetizers and sampled eachother's entrees, and several dishes immediately clicked as being VERY true to what I had in Thailand. Really bright, complex flavors. Everything was great. I love some of the other Thai restaurants we have nearby (don't worry TT, I'll never abandon you), but they tend to have similar menus and shy away from ballsier dishes. This is the first that I've seen really attempt, and nail, some of the lesser-known dishes. Nothing is repetitive about the menu, each dish is wildly different from the other.

The cocktail list didn't look that appealing (very simple and sweet sounding) so we went with sake, which is very reasonably priced. Of course there is Singha and Chang beer, which is pretty nostalgic for me too. Service was very friendly and prompt. 

I hope Charlotte is ready to embrace this place. I know I'll be going back as often as I can!"}
{"text":"By far the best Thai I've ever had in Charlotte. The complexity of flavors are breathtakingly delicious. I ordered the Kao Soy and I'm already planning my next order.  I will definitely be sharing my experience to everyone I know!"}
{"text":"Have gone twice so far, not a bad little spot. I have gone for dinner and lunch, both times the manager, Emily, is working incredibly hard. She really makes sure the customers are welcomed and everything is up to par. 
Today at lunch they were short staffed and people were waiting a little while for a table. A host for lunch and dinner should be present, instead of the manager and servers finding the time to seat them. 
Overall, good experience but they certainly need to do something about putting more employees on the floor."}
{"text":"My husband and I tried this spot for lunch. We had the Panther roll, along with pad Thai and the kao soy. Get the kao soy! It was delicious - savory and hearty, and 100% satisfying, especially on a chilly winter day. The pad Thai was outstanding too - well balanced with sauce and flavor. We'll definitely be back."}
{"text":"Very good flavors in the food, not to spicy and it had a great authenticity to it. The drinks were killed and I loved the environment. Will be back every time I'm in Charlotte!"}
{"text":"DELICIOUS! We listened to our waitress and got the Lad Nar & Kao Soy. We also ordered spring rolls & the sashimi/nigiri sushi platter.
My boyfriend really liked the Sriracha rimmed cocktail! 
Great part of town & walkable to other fun spots!
GREAT FOOD & wonderful portions."}
{"text":"Amazing, authentic Thai! Chef Peter and the staff go above and beyond to ensure you are happy!!"}
{"text":"I had very high hopes for Rai Lay. So many southend people told me it was awesome. I got takeout the other night and there was some good and some not so good, which is why I'm giving them a 3 star rating.

Shaking beef-awesome. Just yummy. Good portion size. 

Larb -tofu (like lettuce wraps) very odd flavor that wasn't enjoyed by my husband or I. And holy onions! Even if you love onions which my husband does, the whole darn dish was onions. Complete overkill. 

Curry- they don't have specific dishes on the menu it's just curry of the day. When I called in the order I was told it came with mixed vegetables. Ok there was probably 2 red peppers sliced up and sautéed in there. I like peppers. But I'm used to and wanted something besides that in my curry dish. Where's the eggplant? The green beans? The potatoes? Skimpy on the chicken as well.

All in all it was a cute place. I'd maybe go back for the shaking beef. The staff at the register is very young and be cautious when they hand you your takeout bag because I got the wrong one and and am glad I caught it prior to leaving."}
{"text":"Such an exciting addition to South End! Wonderful food and good drink specials. Definitely recommend the basil chicken if you like spice!"}
{"text":"We finally got to check out Rai Lay Saturday night while out with dinner with some friends.

Super cute location in South End. We arrived around 8pm and were able to snag a table for our group. Most of us stuck with a Sapporo to drink.

I ordered the spicy tuna roll and the edamame and my husband got the drunken noodles. The drunken noodles were delish! I know my husband likes it a bit spicier but I thought the spice level was perfect for me. My spicy tuna roll was about average but the edamame was fantastic. They put this seasoning on top that gave it an awesome flavor and kick. 

Service was great throughout the whole evening. Great meal and cute spot."}
{"text":"Very good sushi. Service is great as well- pretty fast! Enter portion sizes are comparable to other Thai places in the area- enough for two servings. The prices are a dollar or so more than other Thai places in the area but the location, atmosphere and service is worth it."}
{"text":"Good service. Moved pretty quickly during lunch time today. I had the Tsunami Roll which was a sizeable portion and was really tasty."}
{"text":"Awesome Thai food, amazing service and good atmosphere. We've been here four times and it's always good."}
{"text":"Really loved all of the food I tried here! It was one of the best fried rice dishes I've ever had! They put lovely garnishes on it as well. My friend ordered a spicy  dish and the waiter warned about how spicy it was. However, it came out with no spice at all. The dish was still good but a little disappointing. The prices are a little steep but my fried rice easily made two meals! They also had great happy hour specials (half off!). Can't wait to go back."}
{"text":"Really enjoyed going here with my wife! She got the drunken noodles and I had the Kao Soy which was really good! The spicy oil on the side was great and gave me the chance to determine how spicy I really wanted it. It's a pretty small spot so I would recommend going in the early evening or seeing if you can snag a spot at the bar."}
{"text":"The food is very good, don't get me wrong for my giving it 3 stars. What docked the points were how long I had to wait to receive my to-go order, and there was no flatware or napkins in the bag. We had intended to eat at a park, but there was no way we could with no flatware. 

The biggest reason for the 3 stars is how it was prepared. We ordered shrimp fried rice, simple right? Well they left all of the tales on the shrimp, so you had to dig around in the hot rice (which was blissfully hot even though I had to wait a long time to get it) and find every last piece of shrimp in order to remove the takes ourselves. This was incredibly irritating."}
{"text":"Came here right after being picked up from CLT (15 mins from the airport). 
Before we decided what to order, the server offered us to taste the coconut soup. I loved it! The flavor was exactly what I wanted.
So, My friend and I shared the Pad Thai with Chicken & Shrimp (level 1/5 spiciness); it was saucy, tangy, the chicken was tender and juicy. The shrimp was not over cooked. I could eat that every-other-day happily. 
And we also got the Tempura Shrimp Roll, the roll it-self was small in size (it had 8pcs, just not overloaded with rice, which is good), but the quality of the rice and tobiko was super.
I would've gotten more rolls with sashimi, but my friend isn't a fan, and honestly, we shared the two lunch dishes and it was plenty. 
Perfect portions. Would go again next time I'm in town."}
{"text":"So delicious! One of the best meals I've had in a long time. The Kao soy was absolutely unbelievable. I highly recommend. Great happy hour specials until 7, great apps and great food! One of my favorite restaurants in Charlotte!!!"}
{"text":"So I went in and the place was extremely busy. The wait was over an hour so we decided to just order to go. The hostess was very accommodating while we waited for our order, constantly checking on us to ensure we were doing ok and giving us updates on the food. I ordered the Shrimp Pad Thai and I must say it was absolutely amazing."}
{"text":"This place is so great!! I had the Kao Soy and my friend has the Basil Chicken. Both sauces blew our minds. Really flavorful. Worth every penny. Also ordered the papaya salad and loved the sauce and spice!"}
{"text":"Really interesting menu with a Thai slant.  All the usuals and some more unusuals well; like, oyster pancakes.  Everything is delicious.  We've tried most of the menu and enjoyed it all.  Very attentive and friendly bartenders."}
{"text":"I love this spot! I've been three times now and have always left happy. I've had their drunken noodles and the veggie lover and everything is delicious. Their portions are generous and their prices match. The wait staff is very nice. It's been a little slow at times, but nothing crazy. Their drinks are very good - I recommend the sweet tea vodka drink - the sangria is very weird and not what you'd expect. 

It's a relatively small spot so if you come in at a busy time you may have to wait. But there's almost always a few tables open.

They have tons of vegetarian options so I'm sure I'll be back again soon!"}
{"text":"Great new spot in south end! I had the kao soy with added veggies and it was amazing. Sooo good!!! Portions are also very big. My friend had sashimi salad which wasn't too impressive at all but everything else I saw come out looked amazing. Wil definitely come back for more!"}
{"text":"Stopped in here for lunch one day after reading all the great reviews and prior experience at their sister restaurant, Deejai Thai in Myers Park. I had the Kao Soy, which I'd never had before and was absolutely delicious. It's a curry noodle dish that comes in a bowl with rich broth. My wife had the Pad Thai which was excellent, particularly since it was not \"over-sauced\" like it is at so many other Thai restaurants. Will be back!"}
{"text":"I'm just going to assume this post was for show. Almost a month and I haven't received not one response from anyone. And I'm sure Howdy is still there giving customer service based on customer's race. The food is still good, I just wish the care for there customer's and their experience was better. Sad."}
{"text":"The ambiance was fun blending metal and wood!!

Our waitress was really nice,  super informative,  and really good! 

We Ordered the..

Fried Spring Rolls $6
Cabbage, carrots, & noodles served with sweet chili sauce & ground peanuts

Whole Snapper
Fried whole snapper served with steamed rice & our spicy dipping sauce

Veggie Lover ( Pad Pak) $14
Seasonal veggies mixed in stir-fry sauce, served with steamed rice

Gin- a- tonic 


The spring rolls were not that good & the sauce was spicy and not for my taste. They had a spicy mayonnaise that wasn't spicy, but made them slightly better.  My friend said the snapper was incredible! I got the Veggie Lover with only zucchini and onion.  The sauce was nice and it was decent. The rice was cooked perfectly. The prices here are high for the quality of what you get.  This won't become a regular."}
{"text":"My absolute favorite Thai spot in Charlotte! 
Kao Soy and drunken noodle are ridiculous... the edamame with chili is addictive and the drinks are perfect. Staff is super friendly... great ambiance... nice place for a date!"}
{"text":"Not worth coming unless Pooh is working.
First experience...awesome. Second...won't be coming back.

I ordered an Basil Chicken, which is supposed to come with edamame while you wait for your meal to be prepared. about 20 minutes after I ordered, a lady who wasn't my server came to my table with the meal. Confused, I asked why my edamame didn't come out before the meal. She shrugged it off and didn't ask if I needed anything else. (a spoon for the rice and soy sauce would have been my answer.) 10-15 minutes or so later my server comes back to check on me. Everything was fine...except for the nearly empty glass of water that needed to be refilled. I'm eating a very spicy dish...why wouldn't you refill my water? It takes literally 6 seconds.
About 20 minutes before I needed to be back for work I was looking around the restaurant for my server to bring the check. I waited 15 minutes before some other man came to ask if everything was OK. I told him I had been waiting too long for my check so he went to get it. My server eventually came to my table but by then the other man had already taken my card for payment. The now-empty glass of water was still in plain sight to her. 
HORRIBLE service, no offer to make me a happy guest regarding the wait time or edamame. NEVER COMING BACK!"}
{"text":"A favorite lunch spot for me & hubby. Excellent food & service! Don't underestimate the spice levels though. #TeamLevel0"}
{"text":"Wonderful selection of Thai dishes and sushi, including Kai Soy, which is hard to find in the US"}
{"text":"Really nice well run place. Creative drinks, great service, and the best basil chicken ever. 

I always hate when Thai restaurants skimp you on the chicken/rice, this is not the case with Rai Lay. Also, instead of sliced chicken they use ground up chicken. In my opinion I like it a lot more when it's ground up. 

Warning: do not ask for the hottest spice level. It was more painful than enjoyable."}
{"text":"Arggh. They close earlier than their 3:00 posted time during the week (pet peeve #1 of mine) and they seem proud about it. 
Food is very good. Service is average. If you arrive :15 bf their posted close time they will roll their eyes and ask you to place a to go order. This is the treatment I received as well as the customer 2 mins behind me. But food is very good ;)"}
{"text":"The line for Futo Buta was incredibly long, so our plan B was Rai Lay which turned out to be a pleasant surprise. The wife and I were joined by a friend for some hopefully spicy Thai dishes, well in my case anyway.
We were greeted and seated immediately and we soon had drink on the table. They have craft beers, wine and a full bar to include cocktails and sakes. I wanted to try the larb appetizer which came with ground duck and I ordered it Thai spicy hot. Per our server, they offer spice levels of 1-5 and Thai spicy if you want to bump it up a big more. Overall, the larb was a nice appetizer and the size was certainly generous. It could have been spicier for my tastes but it did have some heat. The crab fried rice was calling my name as soon and I saw it on the menu. Others chose the pad Thai and some sushi as their mains. I did not try the pad Thai, but I can vouch for the sushi being fresh and flavorful. Nothing extraordinary, just basic good sushi. The group also shared the rice pudding dessert which was nice, but probably would not have ordered this on my own since I rarely order dessert. Plus I was full on the generous portion of crab fried rice. I even had some leftover for breakfast the next day and I incorporated some eggs to make a hearty breakfast. Easily, the crab fried rice elevated Rai Lay to a 4 star experience. I will return as long as the crab fried rice is present on the menu."}
{"text":"I normally try to stay clear from writing bad reviews and debated on writing this. But I really did enjoy this place at one point and hope that they improve based on my experience that I encountered recently. I came in to eat on Friday the 13th (coincidence much ?) well my experience wasn't pleasant. Don't get me wrong the food was good. This isn't my first time at Rai Lay, as I do enjoy their spicy basil chicken and always find myself coming in when I'm craving Thai food. But this review is mainly for the staff. The host and waitstaff is friendly and sweet but my problem is with the sushi guy, bartender, management/ownership. I saw with my own eyes the sushi guy drinking alcohol on the job and seeing that just killed my whole experience. I know other people saw it as well and the workers were acting as if it was normal and as if they do this often. I mean is it normal to be drinking while working in the food industry ? If so then maybe it's just me who doesn't want to see it. I don't know if the whole staff is drinking on the job but seeing that really had me worried. I personally don't want to be served food by employees who are drunk or have been drinking on the job. The bartender is suppose to be in control of the alcohol so shame on her for giving her coworkers alcohol to drink. Also shame on the management and owners for not keeping an eye on their employees and allowing them to do this. I honestly used to love this place but after seeing that, it's changed my perspective completely. I do know that no restaurant is perfect as well and hopefully I'll find myself coming back once the problem is fixed. I don't want to give up on them just yet which is a good thing."}
{"text":"I've been here a few times now and I have really enjoyed every meal, including bites of my friends' dishes. My dining group always gets into a debate about whether this or Basil Thai is our favorite. I always either order for myself or convince someone else to order the Kao Soy and of course the table always had a pas thai dish. I would recommend both to anyone. There's also a fun Thai iced tea cocktail which I enjoyed. 

The seating is very limited, but I have never felt like it got too loud which I appreciate."}
{"text":"This place is small & a little crammed. My boyfriend and I managed to grab a booth in the back and it was comfortable. Our waitress came over and immediately spilled water all over the table while trying to pour water in my glass. I don't get upset about things like that since I work in a restaurant, but she said she'd be right back to clean it up and never returned to clean it as the water was seeping all over the table. I had to use my napkin and then when she brought my food over, even though my soaking wet napkin was crinkled up at the end of the table didn't ask if she could get me a new one. She was lacking personality and didn't seem to care about us at all. The food was mediocre. I had sushi which was decent. My boyfriend got crab cake fried rice & the beef jerky. He didn't enjoy the fried rice, but did enjoy the beef jerky despite it being really thick and chewy."}
{"text":"Ordered the basil chicken but substituted shrimp. Was really good! Also ordered a glass of 'New Age White Blend' that 4 friends and I enjoyed very much!"}
{"text":"Had an really nice time here tonight enjoyed the Drunken noodles with the 3 star spice and it had a delicious kick that left me wanting more! I ended off the meal with the lava cake and the ice cream on top gave me the sweet relief I need to top of the meal! Service was quick and friendly and Victoria was so helpful with deciding what to have this time! Defiantly great place to try something new each time!"}
{"text":"Rai Lay is a nice little spot off South Blvd which we dropped in with friends for dinner on Saturday night. Overall the place was busy, but we had no problem grabbing a seat. Kudos to them for creating a menu that was expansive but not overwhelming. I ended up ordering the drunken noodles with a starter of spring rolls. Both were delicious. The noodles had a ton of fresh veggies mixed in and the flavor was on point. I would have liked a bit more spice in mine, but that is something you can adjust at the time of order. Overall the experience exceeded my expectations and the service was phenomenal. I will say the price point does feel a bit high, but the servings are very generous which offsets this in my book."}
{"text":"The FLAVOR is really there, don't get me wrong. However, the SALT is also there and there's way too much of it. I know it wasn't only my dish because I came with a big party, and when 6/8 dishes are oversalted, there is a slight issue. The dishes are genuinely good though, but it's hard to continue eating a dish with too much salt without becoming full from drinking too much water. 

Good news though is that the portions are HUGE. I got the the Drunken Noodles and I loved the fact that they loaded that thing with vegetables and large leaves of basil. It really gave it that extra kick of flavor. We also ordered a ton of sushi, which was all very good too. For dessert, we got mango sticky rice. I believe the rice was sweetened, which made the dessert way too sweet with the addition of ice cream on top of coconut sauce. The rice was cooked really well though, chewy and gooey! 

We waited for over an hour since the place was way smaller than we expected! If you're with a large party, I wouldn't come on busy weekends."}
{"text":"The food was amazing and our server, Catherine, was delightful. We will definitely be back again!"}
{"text":"I finally made it over to Rai Lay after work for a somewhat early dinner.  They're located right on South Blvd, so the parking can be tricky if you don't find a spot in the front strip of parking spaces.  I ended up finding a spot about a block away(and it was pretty cold and windy).  I had already called my order of crab fried rice in and was very eager to try this very tasty sounding entree.  The inside of the restaurant seemed to be kind of small but cozy.  The crab fried rice was delicious, filled with just the right amount of crab, onions, and scallions, with slices of cucumber and tomato on top(minus the egg) and like a spicy fish sauce.  It was definitely worth the $16 price tag, and the portion size was massive.  I will become a regular here."}
{"text":"My boyfriend and I just tried this place. Our expectations were pretty high and let me tell you they were definitely met! I got the pad Thai and poke salad. It was delicious! The pad Thai wasn't to sweet or to spicy it was just right! The poke was fresh and tasted amazing! We also got a sake flight and the lychee sake was the best! I definitely reccomend it and ask for lay! She was our server and was great describing everything on the menu and giving great input on what we'd like!"}
{"text":"A nice ambience asian fusion place that offers Thai, Vietnamese, and sushi! Have good drinks specials and a varieties of mixed drinks! I guess the night I came which is last Wednesday, they finalized their menu from the time they opened. 
Greet by the hostess. Our server Noy was tentative, sweet and informative! My friend and I were excited to try a new Thai restaurant since our go to is Thai Taste! 
Our dishes for the night: Shaking Beef(Vietnamese dish) very sweet saucy and meaty. Bestie likes it a lot. Chicken fried rice was really good. Tastes very fresh and light yet comforting! Then fried ground catfish with papaya salad. The salad was yummy but I'm very confused with the fried catfish. Very bland and dry.. Even mixing with the salad didn't help. I'll leave that alone even for next time for sure! Then the Panther Sushi. Nothing special about it at all.. I'm not impressed! Very pricey for what it is! 
Now desert.. The lava chocolate cake. It's sooo good.. Tasted like the same cake from Lebowski's! We're sooo stuffed but we have to finish the cake! 

Overall I think the items a little over priced. Especially the sushi when compared to soo many good sushi places around them. I'll save my money to go to Nikko's instead! But the other food are good. I wouldn't mind coming back for the fried rice, shaking beef and try other things on the menu!"}
{"text":"Was very good, and the pricing was perfect! Dinner portions were enough to share depending on appetite. Happy hour also on weekend. (Apps and rolls only) was a great stop for a short weekend in Charlotte!"}
{"text":"A must eat in downtown Charlotte. The food is so well seasoned! It has been a long tim since the i had food  with such good flavor. It's a small little restaurant with a powerful flavor. Will come back for sure"}
{"text":"Food is most definitely great! Menu is a little small and it can get a little spicy but just ask your server for the best recommended item! Already tried the fried rice, and drunken noodles as well as spicy basil and shaking beef almost the entire menu and all delicious! For a Thai restaurant they do offer sushi which is pretty fresh. Been going here for awhile and definitely a plus! Drinks about average price and definitely well lit for the atmosphere whether it's lunch or dinner!"}
{"text":"shrimp tempura roll was soooo bad, shrimp was over cooked and there was barely any rice on the roll."}
{"text":"Gave them another chance today and they screwed up the To Go order again. Horrible service and don't trust the person who supposedly checks the order.  She repeated it to me and looked in the bag (pretended to look). No extra sauce again. What a shame because the food is good but the service is just terrible."}
{"text":"We ordered Basil Chicken ,Shaking Beef and Spring Rolls To Go everything was great   If takeout is this good I can only imagine how amazing the food is dining in.  Welcome to the neighborhood!"}
{"text":"Some of the best thai food I've had ANYWHERE. We came for dinner and had such a perfect meal we came back for lunch the next day and have been back several times since.  I usually steer clear of Asian fusion restaraunts because I feel that the dishes lose authenticity when there's combinations of different  influences, but this place is an exception. The thai dishes taste authentic and so flavorful, portions are totally satisfying, and the prices are reasonable. I love the pad kee mao with just vegetables. My boyfriend always orders the pad grapow with chicken and loves it. I've also ordered the sake flight and loved it, the perfect way to try sake if you haven't had it before! The atmosphere is nice and service has never been a problem. 

My only critique of this place is that the spice levels can be inconsistent depending on who's cooking that day. I always order 3-star spice level and have gotten really mild and really hot with the same dish. Now I just order it mild and ask for chili sauce so I can adjust it myself."}
{"text":"Whoa! This place is amazing!! 
My original goal was to go to Futo Buta but the line was crazy so my friend suggested Rai Lay and oh man, what a great place it way! First, no wait. At all! 

And the food...wow! I got basil chicken, spicy! And it was everything I every wanted. 

Also, definitely get their chili edamame. Service and atmosphere was great. Will be going back!"}
{"text":"5pm on a Friday. Got a small booth. 3 orders of wings, edamame, Pho, and green curry. Everything on point including our server. 1/2 price bottle of wine and total cost $ in my opinion. $62 yes please!!!"}
{"text":"Some reviewers mentioned the Basil chicken as $10 but the menu shows $14 or something. Have they increased prices already. But anyway just looking at the menu it's looks a little overpriced for a Thai restaurant. Just my opinion"}
{"text":"Was pretty surprised by this place. Small but nicely designed interior, cool bar, kind of an open kitchen deal. Was almost full when we got there at 7:30 on a Wednesday night. Waitress was awesome and they had a number of local brews on tap that I appreciated. 

The food was great. I order chicken larb at every Thai restaurant I go to. This was the best I've ever had. Great fresh taste with the lime juice and fresh cilantro, some slices of fresh and tasty yellow tomato and cucumbers. A little salty but I ate the entire appetizer myself. We also ordered the spring rolls that I'm told were good but I was busy double fisting larb lettuce wraps and couldn't be bothered with them. 

A previous review mentioned they had pad see yew even though it wasn't listed on the menu. We ordered that to split and it was equally delicious. Had a spicy/sweet combo that was nice, and veggies were still a little crisp and quite fresh. Entire meal was $40 with two beers. Great date night!

New favorite Thai restaurant in town. Highly recommend!"}
{"text":"Rai Lay offers dishes you won't find at your typical Thai spot. Spice levels are also spicier than you'd expect. For the papaya salad, we got a spicy 1 on a scale of 1 to 5 and it left our tongues tingling and our mouths thirsting for water. The Tom Yum noodles veered on the salty side, as with other dishes, but this place is still great for real Thai fare."}
{"text":"My family went here for dinner. It's a small cute restaurant. This is my second time here. The food is good. The only complaint is that they use a bit too much salt. If they cut back on the salt I would come here a lot more often."}
{"text":"Excellent meal.  You must try the sausage appetizer.  Truly delicious.  The Pho was phenomenal and Shaken Beef just wonderful.  Atmosphere was great and service was friendly and prompt.  Good choice for dinner!  If you like cocktails we recommend the cucumber crush."}
{"text":"Terrible experience. I ordered a MILD drunken noodles, through post mates, which everyone knows typically is not spicy at all but I was given a crazy spicy dish. I actually enjoy spicy food and order Thai frequently but on the advice from someone who had previously ordered from this place that this dish is inappropriately spicy I went with MILD instead of medium which is what I typically enjoy. When I called to speak with someone I was told by the girl that answered that the manager would call me back. I never got a call back. When I called again 30 minutes later I was told that it is not their fault that the food is extremely spicy rather it was postmates fault and that I would have to talk directly to postmates as if they were the ones who prepared the food. Very rude. BEWARE of ordering from this place!"}
{"text":"I wish I could remember my waitress name, but the service was EXCELLENT! We ordered everything she recommended, from the Kao soy, spicy wings, and the same. The food was really good. She said to make Ray Lai my Sunday spot and I will definitely do that...sake bottles are $7.50 then. Definitely recommend this place for delicious food and GREAT customer service!"}
{"text":"The Kao Soy was on my radar from fellow Yelp reviewers, and it did not disappoint! 4 of 7 of our dinner party had it and well all loved it. The flavors are complex and and the texture creamy. I enjoyed it with shrimp and lots of the chili served on the side. The portion was huge and I took half of it home, it reheated well and was just as good left over. We also had several of the appetizers during happy hour from 5 to 7, when they're all half off. We loved the spicy mu pork, edamame, crispy spring rolls, and beef jerky. Our server Howdy was also fabulous!"}
{"text":"This is my new favorite Thai place and one of the best Thai meals I've had to date.

The places is a little small but did not bother me at all. They also have very cool and unique light fixtures, loved the ambiance. The service was also very attentive. I have now tried the Kao Soy, Palo, Moo Ping, Shaking Beef, and the Whole Snapper. They are all very delicious. This place is different than your normal Thai place but that's why I love it.

Venture outside of your box and try something you haven't had or may have never even heard of before. One of my good friends taught English in Thailand and Kao Soy was his favorite dish there. I was very excited to try it when I heard this place had it, it did not disappoint, and now one of my favorite Thai dishes that I have ever had. 

I am looking forward to going back and trying more options on their menu."}
{"text":"This place makes the best Thai food and has really wonderful service! Four of us ate dinner there and had a great experience. 

Service was excellent, our waitress even noted which dishes had fish/oyster sauce for our vegetarian guests. She explained their 1-5 stars rating system and asked how spicy we wanted our meals. After she took our order and brought our food, she checked on us often and was available for extra napkins, water or whatever we needed. 

I ordered the tofu drunken noodles but only ate about half since the portion was huge. It made for awesome leftovers, didn't even need to be reheated and tasted great! Our guests loved their meals as well, although I don't remember what everyone had. I would go back in a heartbeat if I were in the area."}
{"text":"Great spot. Small and discrete. Crab fried rice I didn't eat but my friend said she didn't get crab meat vibes, I think it's because of the presentation of the crab. We ordered pork scewers (great), bon mi which was good but not served on a sticky bun but a toasted roll (totally cheated), to California rolls were fresh, I had the pad Thai (delicious). I enjoyed it. Good service. Rated 4 because they shouldn't call the pork sandwich bon mi if it's not on a traditional sticky bun."}
{"text":"Found this place on yelp and decided to try it for a date night. We walked in around 7:15 and were seated right away although the place is not huge. Tables are ver close to each other so we could hear people talking the whole time. Food and service is the highlight of this place. Our server Lei was so funny and great. I had thaitini ( hard thai tea) and tasted yummy. We got Basil thai chicken to share and it was just the right hot to hit the spot. Sushi was amazing, we had a shrimp tempura roll. I recommend if you go here for food and great service."}
{"text":"My husband and I found this place on Yelp looking for a good date night spot on short notice. This place was exactly what we were looking for! It's in Southend (which we had never visited) and we really loved the area with locals walking around and tons of stuff going on. It was a really nice atmosphere. 

It is a small place but only half the tables were full at 7pm on a Saturday night. We were seated immediately and all of the staff we encountered were very friendly. The service was excellent. 

We started out with the Larb Ped - ground duck with tons of spice and flavor. Just a tiny bit gamey but that's duck ;-)

I had the super-sweet Thai Tea to drink which I loved. They mentioned a sake flight for $5 which was not for us but sounded cool.

My husband ordered the Basil Chicken with a 3 star spice level and it was perfect for him, a tad too spicy for me. I had the Kao Soy, spice level 2. It was served in a metal bowl was the most beautiful and flavorful dish. I couldn't stop smelling it! These were both huge portions and we had enough left over for another meal.

We also ordered the Fire Cracker sushi roll which was huge, fresh, and excellent. 

It's not cheap but a great little place to take a date or a small group of friends. They also were doing a booming take out business.

Overall it is now on our list of date night options. We will be back!"}
{"text":"In a very rare case, the consistently good reviews for Rai Lay are well-earned. I'm giving four stars solely based on my carry-out experience. I'm sure if I had chosen to dine in, I would've given five.

Whenever it's rainy/dreary outside, an intense Asian food craving kicks in for me. Such was the case the week before Christmas when I found myself in the area after a dentist appointment. I'd bookmarked Rai due to the reviews and was very much looking forward to trying it out. 

Rai Lay is in a shopping center with various shops and businesses which is connected to a parking garage in the back. I parked and then made the short walk over. I walked in and was immediately greeted. I let the hostess know that I wanted to place an order to-go. I briefly looked over the menu and then placed my lunch order for drunken noodles with chicken. To note, the hostess told me that the drunken noodles has a set heat level of 3 and that I could request to adjust if I wanted. I decided to keep it at 3 because, in my experience, the heat level has never been that hot. 

They have a lunch menu which consists of the same things on their dinner menu just a little cheaper. The inside boats a wall of TVs that were playing a sports game of some sort and cable news coverage.

After about 10ish minutes, my food was delivered right to me and I could feel the heat from the container right through the bag. Once I got home (about 20 minutes later), my food was still piping hot. Major plus! And? HOLY HEAT. ACTUAL HEAT, HALLELUJAH. I was so pleasantly surprised that their heat level actually meant/means something. I enjoy spicy food so let this be a warning to you if you don't: Order a low heat level or you will feel it. The heat level cleared out my sinuses! The flavors of the dish were so flavorful and fresh-tasting thanks to the abundance of vegetables. 

I look forward to going back to dine inside and try out their other dishes. I'm a big fan, Rai Lay!"}
{"text":"I cannot sing the praises of the kao soy highly enough. I've been back to Rai Lay a dozen times since my first review, and every time I tell myself to branch out... and every time, the kao soy pulls me back in. Pro tip that I had to learn the hard way: don't wear white if you're gonna order it. It has wound up on my shirt and in my hair so many times that I now wear the \"camouflage kao soy dress\" when I go, and I bring a ponytail holder. I'd bring a bathing suit if there was a chance they'd let me dunk myself in it.

Service is still a little iffy (last night our waitress asked if we wanted dessert right after we asked for the check), my silverware had some schmutz on it, and seating is a little tight, but none of these things will deter me from my love."}
{"text":"I've been hearing about rai lay for some time now, all positive reviews but after trying it out for myself I was shockingly disappointed. Our first mistake was coming in with a big group, I thought the space was bigger so MAKE A RESERVATION if you have a large party. We arrived on a Sunday night and they were packed! We waited for about an hour before they were able to fit us in. I ordered the Thai ice tea, and shrimp kao soy. The Thai ice tea was fairly good, but it was a little sweet for my taste. Omg where do I even start with the food. It was SO salty, the broth was so salty I couldn't even drink it. But it wasn't even my dish, the whole group complained that all their dishes were way overly salted. I even tried the drunken noodles, and the snapper both were salty as well. So disappointing because the salt really overtake the flavorful dishes! I don't know if the chef had an off night or are the dishes suppose to taste like this but for $16 a dish I expected a lot better."}
{"text":"I enjoy Thai and have gone to a couple other Thai restaurants in Charlotte. I brought my family to this restaurant which is down the street from where I live. I got the pad see ew (not featured on the menu) and my family got a couple sushi rolls and the Thai chicken wings. The consensus was that the sushi rolls were fine but that the Thai chicken wings were over cooked. Even the tempura shrimp in the sushi rolls was over cooked. Additionally they had a number of people working, we were one of two tables in the restaurant, and the service was rather slow. I enjoyed my dish all else aside!"}
{"text":"Deduction for some slow service but the food was exceptional. The 3 star heat was plenty for me and I enjoy spicy food. Healthy portion sizes and good prices on Sake."}
{"text":"Full disclosure: I have only had the crab fried rice (no onions) from here- but OMG it is one of my favorite dishes in all of charlotte. I have been probably 12-15 times now and the rest of the menu looks amazing- but I cannot bring myself to try anything else. 

They do not skimp on the crab and it is full of flavor!The first time I got it 4 (out of 5) spicy and it was a little too much for me.  I am a big fan of spicy too.  I would say go at least 1 star less than you think just to be on the safe side.  Also, be prepared to eat it for days b/c they give you about 5 lbs in your order (my go to carryout for when the wife is out of town and I just eat it all weekend).   They do not skimp on the crab and it is full of flavor!"}
{"text":"Very disappointing. I never ever give bad reviews but the staff really handled my issue very poorly. I clearly didn't like my dish. It was supposed to be \"sort of like an oyster omelette\" as the waitress tried to describe the dish to me. She said \"I like it\". As the staff could see me picking at it, I was asked by 3 servers if everything was ok, I finally told the 3rd person it wasn't and that i would have appreciated it if the waitress advised me that the dish was oily and deep fried. She responded that it is not deep fried and she asked if I would return, I said not. She offered to give me a discount. I only ate the mung beans in the dish and had to return to work hungry. She took off 10% so i got off $1.20. That was insulting and not a proper corrective action. I will not return. When my waitress gave me change she noticed my dish picked at and said nothing...My stomach hurts now."}
{"text":"This is one of my favorite places to eat in Charlotte. We going down the road and passed the sign and said let's try this place. Best decision we ever made. We have been going here nearly weekly every since. The staff is excellent and will help you if have any questions about anything. The drinks are out of this world. My husband loves the shrimp fried rice and let me tell you it's real shrimp and it will change your life. The sushi will melt in your mouth like butter. Give this place a try so you to can fill the joy I do every time I go there"}
{"text":"Excellent place!! My friend and I came here on a Saturday for a pretty early dinner. We got the moo ping as a appetizer which was really really good! It was flavorful and the sticky rice compliment it well. Then we got the classic Kao Soy and pad see ew which was really good as well. The portion sizes were big and we even had leftovers to take home. Thai ice tea was authentic and you could tell it was made in house. 

We didn't know that there was happy hour from 5-7pm until our host came and told us but by that time we were already full. The appetizers were half off so I'll definitely be back for that! 
 
Overall a great place for some Thai food! The place was clean, food was good, and service was fast!"}
{"text":"I've been here several times for lunch with coworkers in the last 6 months. Although the food is good in terms of taste,  the portion is inconsistent and staff are not helpful, lame excuses ie the cook is different,  the owner changed the portion size, but it's never the same so go figure!  
Also although the place is clean, it's very tight in there, not comfortable.  
I put up with it because I really like their basil chicken!"}
{"text":"I'm in town for work and have had really great luck with food in Charlotte, but unfortunately this place fell flat for me. I ordered the pad Thai for a comfort food treat, and if I didn't place the order I probably wouldn't have recognized that's what it was. Maybe it was my mistake to add veggies instead of tofu, but there was definitely an absence of sprouts, peanuts, and the green onions looked extremely dark and wilted."}
{"text":"Sushi is amazing!! Have been around charlotte to find great sushi and this is by far the best. I am a whiskey fanatic and I always try to find the best drinks. Shannon was the bar tender and her old fashions and manhattans where one of the best I have had! Also the manager Emily was very nice and helped me better understand the menu, she was so nice! This place is perfect and I would suggest this place to everyone!"}
{"text":"I've been going past this restaurant for the past four months as it was getting ready to open. I was really excited to get another Asian option in Southend. 

The room is bright and modern. We went for lunch and it got pretty busy. The service was good and everyone was friendly. 

The food selections were good, there were some different dishes that I haven't seen in many places around Charlotte so that was exciting. Their curry dish was also better than average. Value wise I found it a little overpriced, especially their sushi... but I guess that's the upcharge for being in Southend. They do have specials daily to be sure to check those out."}
{"text":"Came here for the first time last night and the food was amazing! Started off with the medium spicy papaya salad with the fermented baby crabs added on and it was delicious! It wasn't too sweet or too spicy. My dinner entree was the chicken/tofu kao soy which had depths of flavor! If you're looking for some good Thai food around the area then definitely give this place a try! Great service, reasonable prices with considerable portions!"}
{"text":"I just sat down for dinner and waited more than ten minutes for a server to come. After that wait I asked the host if there was actually a server that was working with the table she sat us at and she said yeah. However after waiting a couple more minutes without being acknowledged we decided to go somewhere else. I understand waiting if they were busy however they weren't just poor service overall."}
{"text":"Thai food is certainly one of my guilty pleasures.  I really only trust the Thai restaurants where the decorations look like they were shipped straight from Thailand and the owner's mom is in the back making spring rolls.  It's not typically someplace I would go on a Friday with friends before heading out for a night on the town, but you can always trust it for a casual dine-in or take-out dinner any day of the week.

Rai Lay completely takes that concept and tosses it out the window.  I walked in on a Sunday night with a friend thinking \"ok, let's try something new.  If it's bad, we'll go for pizza after.\"  Well, no need for pizza.  We walked in and the place had a cool vibe/atmosphere to it.  Definitely a place I would go with friends before going out or on a date.  The place is small and doesn't have a ton of tables, so I can only imagine the wait when this place starts getting busy.

The drinks were hit and miss...I think they are still working on some recipes.  The Sweet Tea Mojito was a big fail, while the Sakerita was a huge hit.  Tasted awesome and you can get it with either a sugar or salt rim dusted with sriracha.  Also, good to know that they have $3 Mimosas on Sunday...I would expect nothing less than a mimosa special on a weekend.

Saving the best for last...the food.  First, they came around with a little sushi sample.  I didn't try it because I don't like fish, but it looked beautify.  We ordered the Fried Spring Rolls, which were good and not greasy at all.  We also destroyed the Basil Chicken and Pad Thai.  Both were excellent and the restaurant accommodated our request for ingredient substitutions.  Warning though on the basil chicken...it's ground chicken and not chunks.  If you haven't tried it with ground chicken, it was great and flavorful.

So yeah, I'll be back.  I went there less than 24 hours ago and have already recommended it to two people.  Staff is very friendly and wants your feedback, so if you love/hate something, let them know!"}
{"text":"I ordered a chicken fried rice. I added extra egg and was charged close to $17. When I got home and began to eat it is literally chicken and rice! No veggies! This seems extremely over priced for chicken and rice in a bowl."}
{"text":"Been hearing about this restaurant in the trendy SouthEnd and wanted to check it out.  I am a huge fan of Thai food.  What I found is a tight, trendy, urban space that features a glitzy bar, and a smattering of tables for dining. The bar stands out as the highlight of the joint!  Not saying the food wasn't good, because it was.   The space was so tight that every time the door opened, a little blast of cool air could be felt.  And it was s bit noisy when it was fully occupied.   It's funny how tight can feel both cozy and annoying at the same time. This spot  is within walking distance of a lot of the Southend condos and a great option.  If I were a young hot shot, I'd enjoy stopping in here for just a drink at the bar.  The bar and the tightness of the space are
the things I'll remember most.   As far as Thai food in Charlotte, I will continue to patronize The Thai House in Pineville, based on the quality of food and the more relaxed and quieter atmosphere there.  Oh, the service that I get at The Thai House also cannot be beat."}
{"text":"First ever Thai food so I can't compare it to others but ILOVED it. Quick, friendly service. Enormous portions. Absolutely delicious."}
{"text":"Waiting for this Thai Fusion place to open. Service was outstanding..we had so many servers come and check on us and make sure we had everything we needed. We started out with a couple of rolls  and some Thai Fried Beef Jerky.
The Fire Cracker roll was really good..Nice size for sharing and delicious! The Beef Jerky was  well flavored but some of the pieces were inedible..way to tough and chewy. Then we ordered the Panther roll...Soft shell crab - which I adore - but alas it was fishy. 
We had the Basil Chicken and let me tell you ..it was spicy..only a 2 on a 5 scale but I am a hot eating person and it was very hot..Very delicious..needed perhaps lettuce to wrap it in. Nice size portion also. Our last item was Crab Fried rice. Not fishy but nothing special. I think they will fine tune everything..I would go back and have that Basil Chicken again and try a few other things..that sounded really interesting. The Service- Like I said..especially a great Waitress named Howdy, was fantastic!!"}
{"text":"I had the special Bang Bang Shrimp for $8.00. It was supposed to come with crispy rice noodles in a lettuce bed. My shrimp was overly cooked and tasted like rubber. The rice noodles was NOT crispy they where soggy. I did not enjoy at all 

The inside is really. They have outside seating"}
{"text":"Very great customer service!! Ordered the kao soy but something else was placed so had to wait on my order but it was worth it and she comp my order which she didn't have to but a very sweet gesture.  My husband had the lad nar and it was the best we ever had.  Thai chicken wings were delicious and the Thai tea was the best I ever had.  The Thai here is very different it's more authentic than most place I go too and it's very worth the wait."}
{"text":"Good Thai for charlotte. All standbys represented (pad Thai, kee mow etc) and some interesting less common curry dishes."}
{"text":"This is some of the best (and I assume most authentic) Thai food I've ever had! The waitress we had was very good and helped us with our orders since there were a lot of great options. I ordered the drunken noodles with tofu and my boyfriend got the Kao Soy which he was nice enough to let me taste. The Kao Soy was on the sweeter side and very mild.. a good dish to try if you like pad thai but want something a little less main-stream. My dish came as a level 3 (out of 5 spice), but I lowered it to a level 2 since I can't handle a lot of spice. It turned out to be just right... spicy enough to get a kick, but not to need to chug a glass of water with every bite. Overall, I recommend!"}
{"text":"I seriously enjoy every experience I have here. I've been for lunch and dinner only on weekdays, though. I have ordered the Thai Basil with chicken almost every time I've been here, it's delicious. Today I discovered they have a Monday-Friday happy hour that had really yummy deals on it!! My service was great as well, Lei was a really great host/server. She even shared some cultural things about her family with my friend and I."}
{"text":"I found it was able to stop in and tried his place. I decided to go with something light so I went with edamame appetizer and firecracker sushi roll.  The waiters was amazing and gave me great recommendations from the menu.  The edamame with a side of hot chili sauce be warned it is very hot, but good.  The sushi roll was very feeling and I was very pleased with the size.  I just suggested the Thai dishes were amazing in that I should return and I will be returning to give it a try."}
{"text":"Felt like i was cheating on my first love \"Thai Taste\", which is right around the corner, but i was pleasantly surprised by this new Thai restaurant.

First the food!  We got the spring roll app, which was really good.  Great sweet Thai chili dipping sauce.  For the main course, i had to get the Pad Thai.  It was one of the better one's i've had.  One thing that stuck out to me was they give you chicken and shrimp, instead of making you choose between the two.  

My only knock was with our seating. This place is very small and when it's at full capacity, you feel a little crammed in.  Not a huge deal!  I will definitely go back and next time try a noodle bowl and their sushi."}
{"text":"Ordered the basil tofu. Very tasty, great flavor! Would definitely go back. Great service. Casual Asian comfort food.
Love it."}
{"text":"I love this place! The food tastes great and the service is excellent. You cannot go wrong with the Drunken Noodles, it's my favorite."}
{"text":"Big things come in small packages. This small restaurant serves amazingly flavorful dishes. Reasonable prices and large portions make this a must stop."}
{"text":"Absolutely loved Rai Lay!! Quaint little place with a fun atmosphere, excellent service, and the food was absolutely delicious!  We had the Thai Sausage for an appetizer (as recommended by our server). The sausage was so flavorful and juicy. Served with peanuts...delish!! My husband order Chicken Pad Thai and he loved it and I ordered Pad See Ew (not on the menu) and it was one of the best that I have ever had. My Mom was lucky enough to enjoy my take home leftovers and even she said it was one of the best Asian noodles dishes she has had.  

The service was outstanding, Our server was the so friendly and attentive. I could have chatted with her for hours! We were also impressed that the chef make out to check on us to ensure that we were enjoying our meals. Good stuff!!

Rai Lay will surely be our Thai go-to spot when we're in the South Blvd area."}
{"text":"WOW! Kao Soy is the way to go and is beyond deliciousness (a huge portion too). I was also able to try the Basil Chicken and Pad Thai and this was by far the winner in my eyes. The coconut broth soup they give you as a starter was tasty as well. Some of the best Thai I've had in Charlotte for sure! It does get a little busy so our lunch service was on the slower side, but go early and you'll be fine."}
{"text":"Normally if I'm in the area, I'll head to Thai Taste, but I figured it's a new year, so let's try something new: Enter Rai Lay (and, yes, I know they aren't exactly new any longer).

The first challenge is finding a place to park. Sure, they have spots right in front, but there are like three of them. Usually there are a couple open spots, but they are there for electric cars, and I don't drive one of those. So after figuring out this issue, we headed inside.

Rai Lay is definitely a change from most Thai places - to start, it's a bit more modern. Nothing wrong with that, of course, but it's different. No bamboo or other wooden accents. It's also on the small side, so be prepared. And no book of menu items, it's very short. You also have sushi and some Vietnamese selections - so there are not too many Thai selections.

What you will find are some well-presented items, and they are fresh and tasty. Service is good and the staff is friendly. They are perhaps a tad slower than other places, but it's not horrible. Worth a visit, but not quite sure if they would be in my regular rotation just yet."}
{"text":"I love thai food!! I stumbled across this place. I came in to order some food to go for lunch. I got the drunken noodles aka pad kee mao. I got the lunch portion with chicken. It was labeled a spice level 3. I told the girl I love spicy food and asked if I should get it into a 4 or 5 and she told me no since it was so spicy. It was not spicy enough for me. The noodles were cooked ok but they were all sticking together. I'm taking about 3 big clumps of noodles. It was really hard to separate and since they were all sticking together, there wasn't enough sauce. Most of the onions in the dish were good but they forgot to cut the outer layer of the onion so it was super chewy. Overall, the place was good. I'm gonna try their sushi next time."}
{"text":"Rai Lay is going to be a regular for me. I had the Thai basil chicken, which is hard to find on lunch menus at Thai joints in Charlotte - it is usually only offered at dinner (I am guessing because 95% of people in Charlotte order Pad Thai for lunch when going to a Thai restaurant). But Basil Chicken is my favorite Thai dish (well, maybe except for seafood Tom Yum soup). And Rai Lay does an outstanding job at it.

I am a lover of spicy food, but their default of 3/5 stars is perfect. Not too hot, but not too mild. Just enough to get you nose running when you leave, but it was delicious! The guests beside us ordered Kao Soy and it looked equally delicious (I'll get that next time). 

And because I love Thai Tea, I decided to have a Thaitini even though it was a work day lunch. I just couldn't resist. It was quite tasty - very similar to the traditional Thai Tea...but with booze included.

I am very happy to have new Thai joint in SouthEnd. I love Thai Taste, but I can only do Pad Thai chicken every so often (their menu is pretty limited at lunch). 

Rai Lay is Awesome! Though this spot has seen quite the turnover of restaurants throughout the past 10 years or so, I can't imagine that this place will be going anywhere any time soon."}
{"text":"Really great pad Thai, fried rice was delish as well. I would Most definitely come back again. The young lady I was dining with is a complete train wreck but I didn't have any choice in the matter"}
{"text":"I tried Rai Lay based on an intriguing article about it in a weekly, Charlotte events publication.  Although I'll give it another try, with friends, I was absolutely not impressed.  However, do not let my review discourage you from trying it out.  Rai Lay calls it's cuisine \"Thai Street Food,\" but from what I can tell, it has more sushi items than actual food you eat on the street in Thailand.  I've been to Thailand a few times, and sushi just isn't something I remember eating off the street.  I also don't remember eating edamame either, although Rai Lay's lunch dishes serve it as a complimentary side (like French Fries, I guess).  That would have been fine, but the edamame was so tough that it took both of my hands to squeeze the peas out.  And, the server tried to take my edamame away before I was even halfway finished trying to ply the peas away from the pods.

Just because it was a chore to eat didn't mean I wanted to give up on it.  

In addition, I noted that a simple glass of house Chardonnay is a whopping $9!!  Yikes!  

The article I read about Rai Lay characterized it as a place where servers explain the \"street food\" dishes with diners and work with diners on degrees of heat.  Not so during my experience.  I asked my server if the grilled pork salad was hot and spicy, and he said, \"I don't think so.\"   I replied, \"Good, I'll take it if it isn't spicy.\"

When the dish (which was actually quite pretty to look at) arrived, it had a full pepper jetting out from it, and it was littered with pepper flakes.  While the pork was really good, it was so hot that tears were rolling down my cheeks.  The star of the show (something you don't see in everyday Thai restaurants), is sticky rice served in a basket.  Granted, the rice was surrounded in plastic wrap to keep it piping hot (as opposed to a banana leaf), but the concept was nice and different.  

The \"Thai Street Food\" concept seems like a gimmick to me in order to get people in the door.  It worked because I went.  But if the menu or the servers don't really indicate the difference between \"Thai Street Food\" and food from other Thai restaurants, then the gimmick could just as well be \"Free Parking.\"  When I visited, it was at a time when only a few other diners were there, so there was no excuse for an experience which I expected would be educational but, instead, was just a little less than ordinary."}
{"text":"Super cute inside and very cozy for a nice date! The veggie lovers was really great and I added some plump shrimp for some healthy protein. Great stop to check out!"}
{"text":"Tried Lad Nar it was delicious, like a stew. Very flavorful sweet and salty.cocktails are small though and pricey."}
{"text":"This is a great find in the South End area.  Love the staff here and the food.  Atmosphere is cool but tables are very close together.  A little too close for what I prefer because you feel like you are actually eating dinner with the table right next to you. My 9 yo daughter and I go here on date nights because she loves the Pad Thai..as do I.  Although the Drunken Noodles are one of my favorite."}
{"text":"Thought this place was pretty average. There were certain dishes that were good, and others that was a bit off. On the appetizers the thai sausage was really delicious. The thai wings and the spring rolls were ok. The thai wings tasted more like regular spicy honey bbq wings. The Paleo dish was very good. It was pork belly braised in a sweet soy sauce braising liquid along with a hard boiled egg. The sauce was great over some rice. We also ordered the shrimp drunken noodles. It was definitely way too salty and hard to swallow after a few bites. Portions were decent. Apps are expensive but entrees are average price. All bottles of wine were $20 saturday which was not too bad. This place was ok there are better thai reataurants in the area. Just need to tweak their sauces a bit."}
{"text":"Got the Spicy Basil Chicken and Kao Soy... one word, awesome. Great food, great service, and easy to find parking. Totally recommend."}
{"text":"We love this place. My wife and I try to get out to Rai Lay at least a couple times a month. I'm in love with their crab fried rice but they have so many delicious offerings on the menu.

They also have great happy hour deals like half priced sushi and apps if you come at the right time. But any time is the right time for Rai Lay. The staff is friendly and welcoming. The inside is a bit small but it just lends it self to an intimate atmosphere. Intimate enough that you can sometimes hear what the table next to you is talking about. Including a woman who was walking her friend through his divorce by snitching to him about what his estranged wife had been up to. That was a pretty good day.

I always get the Cucumber Crush cocktail. You'd think \"cucumber? why would I drink that?\" but honestly, it's tasty and refreshing. I don't know what white privilege feels like but I'd imagine the refreshing taste of a Cucumber Crush sliding down my throat is the closest I'll ever come to it.

Then menu is one double sided page. Much of it is appetizers and sushi and as of yet I haven't had anything on the menu that wasn't delicious. Be careful with the drunken noodle as they are spicy. You will be coughing a bit if you go anything above a 2 on the spice. But see me? I likes it spicy. Spice me up baby! I need to clear up these sinuses anyway.

There is convenient parking in the garage behind Rai Lay and there are also spaces on the street right in front of the building. I don't know how I hadn't heard of this place before but it is worth a trip. 

The only down side I can think of is that they don't take the tails of the shrimp when they serve them. I tried to request it but they were like \"That's just how it is cuz.\" And I respect their honesty. I just don't get the shrimp any more but all the food is still worth it.

PS. Learning to love yourself is difficult. But it is rewarding. Don't be too hard on yourself. Learn to accept your flaws and realize that no one should be judged by their worst day. I love you."}
{"text":"You KNOW I love a good new food discovery. Rai Lay delivered. I came here for the first time with a friend who is new to town. I ordered the Pad Thai. She ordered the Pad Cha. Pad cha is not on the menu, but thanks to Yelp, we saw a picture and ordered based on looks alone. Rai Lay is thus far the best Thai food I've had in Charlotte. They have an extensive off menu list...... pretty much anything you want, just ask for it.

The pad cha was spicy, made with what tasted like peppercorn, but much stronger. The pad Thai was delicious with generous portions of chicken. Our meals were served piping hot. Had to wait a little bit before actually eating. Our waitress, \"Pooh\" was so very kind and down to Earth. Water was filled by someone else and they did a great job keeping our glasses full. The food was spicy, so I couldn't get enough. I like the pad cha even better than the pad Thai. Highly recommended."}
{"text":"Omg so good!! Quiet on a Saturday afternoon. Got a table right by the door. We ordered drinks and I found a new favorite, Moscow mule! The server talked a little too much, but she was friendly and excited about telling us what's good on the menu. We ordered an app of Moo Ping. Holy shit!! 
Marinated pieces of tender pork shoulder on skewer and it comes with sticky rice and a dipping sauce that's sweet , salty, and savory. The sticky rice comes in a cool little  woven basket type thing and you break open the cellophane to get it out. You roll some rice into a ball, grab a piece of pork and dip into the sauce. That shit knocked me out!! Should've ordered ten of em!  I ordered Kao Soy because of what I heard. However, I'm not a curry lover and should've ordered something else. But, it was beautifully presented, came with a hot chili oil you can pour over and lime. I ordered mine with shrimp. It had such depth of flavor, but can only be enjoyed if you like curry. My friend had the chicken lo mein and that was delicious. Noodles perfectly cooked, great flavor, so good. Order the sticky rice dessert with mango and vanilla ice cream. Very interesting and delicious. They have places in 2 other locations. I'm definitely going back for the pork skewers. Yummo!!"}
{"text":"This hot new Thai food spot in an amazing location did not let us down. Howdy was the best and ask for the Pad Thai extra saucy!!!"}
{"text":"This is by far the best Thai food restaurant I've ever had. Their ingredients are locally grown and everything is so fresh! Oliver was our server and he was great and very attentive. Highly recommend this place."}
{"text":"Love this place!! Solid food, solid Thai Iced Teas, solid service. 6/5 stars!!"}
{"text":"Love, love, love, this place. Always exceptionally tasteful, although the kitchen was backed up and we waited about 30 minutes for our food it was still enjoyable and once the food arrived it was delicious. Fortunately for them but unfortunately for us the secret is out."}
{"text":"Delicious. Yummy. Fabulous. You must try the Kao Soy noodles. Coconut curry broth with egg noodles, protein and all kinds of savory goodness. A meal you'll remember and return to eat again and again. Just be sure to ask for a bib - your shirt will thank you as you slurp the noodles!"}
{"text":"Stay away from the Pad Thai! 

So I came into this place with high expectations and was severely let down ! The food was way below my expectations.

I had the waiter who was nice but extremely slow. So slow that the couple next to me got up and just left because they still had not got their drinks after 10 minutes of waiting.

I order the stereotypical  Pad Thai and  I ask for Thai HOT on it. If you know anything about Thai food this should make you boarder-line sweat! 

Well they must have read the ticket wrong because after sending it back and getting it again the food still wasn't spicy at all. 

The sushi (spicy tuna roll) I wanted to try to give this restaurant the overall benefit of doubt and it was awful. The flavor and texture was inconsistent. I have had store sushi that was better than this sushi :/

I tried the drunken noodles and it did have good flavor . It was a level 3 on scale of 5 as 5 equals the Thai Hot and the drunken noodles were spicer than the Thai Hot Pad Thai. 

I may have just went on a bad night or got a inexperience cook , but I really want to like this intimate Thai place.

Overall, with the combination of slow service and bland food I will not be rushing back here. 

 I recommend a skip and go to Basil or Deejay Thai which far exceed this place and are around the same price point ."}
{"text":"Awesome! Awesome! Awesome!  The atmosphere is quaint.  You can either tuck away or watch the the street.  The customer service was out of.this world! Our server was.very down to earth and provided excellent suggestions.    She provided superb service. Lychee Martini.  Yes!! The appetizers were amazing (beef jerky and sausage). I'm not a huge fan of beef but the beef entree melted in our mouths. The sweet and sour chicken/shrimp was a tad.too spicy for me (I have a baby mouth) but I could not stop eating it.  I cannot wait to visit again and try other items."}
{"text":"Great Thai restaurant in South Blvd of Charlotte; nice chill spot to eat good food and hang with friends and family.

For my first visit, I tried the traditional Pad Thai, which was delicious. 

There was 15 minute wait time but The service was great; no complaints here.


I plan to visit again."}
{"text":"More expensive that I thought. Was going to get shrimp pad Thai but saw the abng bang shrimp special with crispy noodles and orders that instead. I also ordered a order of California rolls( 8pcs) they have daily drink specials and Happy Hour 5-7pm with food and drink specials that I really liked . Good  flavors and portion sizes ."}
{"text":"Great new Thai spot in south end! Tried the spring rolls, wings (ahmazing!!), and chicken pad Thai - hands down great Thai food! Can't wait to stop back and try more items on this eclectic spot!"}
{"text":"Went here Tuesday night for dinner. 

Tuesdays they have $6 cocktails, so I tried the sakerita and the lychee martini. Both were quite good. 

For an appetizer we had the papaya salad which was very authentic, spicy, and yummy.

My husband ordered the kao soy, and I ordered a special. Red curry with roast duck and pineapple. The kao soy is basically their signature dish and was voted \"best noodle dish in Charlotte\". It really is fantastic. I don't think we can come here again without getting it. My special was good too. The roast duck was nicely cooked and the curry had good spice level.

I can never leave without mango sticky rice, and of course there's is fantastic. I love that is comes with ice cream. 

Did you know this is a sister restaurant to Deejai Thai? Now I understand why it was so good."}
{"text":"At the end of the meal, as I was pouring the rest of my noodles into the to-go container, I became sad. Sad because the amount of leftovers was far smaller than I wanted it to be. This was the only negative part of my experience at Rai Lay.
This was our first time here, and we lucked out, arriving at 6:30 on a Sunday and there were still a few tables available. Rai Lay is small, and I can imagine that on a night other than Sunday when it's popular, the space would fill up very fast.
The ambiance is dark but relatively casual! Flowers are on the table and waters are served in mason jars.

Thanks to Yelp, I ordered the Kao Soy, and The Lady ordered the Drunken Noodles (spice level adjusted to 2). The waitress had warned me that if I was going out after, I should put a napkin in my shirt because of all the slurping I was getting ready to do. I should've listened (shirt is currently sitting in the wash with spot treatment).

Rai Lay prides itself on serving truly authentic Thai dishes, served the way they would be in Thailand. The Kao Soy came out in a metal bowl with a side of spiced chili oil, and our waitress told me to squeeze the lime and mix it all together. The result was this awesomely sweet, slightly spicy dish that had crispy shallots, an amazing broth, noodles, and marinated chicken. I could not. stop. eating this stuff. Apparently it's almost impossible to find in NC, let alone the US. 
The lady's drunken noodles were ordered with Tofu, which soaked up the flavors perfectly. Hers was more savory than mine, with a more soy type taste to it. The Lady was much better about saving her food for leftovers than I was....

I also ordered a Thai Iced Tea, which is a very sweet Chai tea on steroids. Such a great compliment to our dinners. There's a lack of reviews on a lot of the menu items, and I think it's my personal duty to find out just how delicious they are. So, Rai Lay, I'll be back soon."}
{"text":"Checked the good review here and wanted to give it a try. Ordered their signature noodle called kao soy. This curry noodle is awesome! Very rich curry broth and fried &regular noodle balances perfectly. The other dish we ordered was basil chicken with shrimp. The spicy level was 2. The server brought extra spicy sauce in case but we didn't need it! Spicy enough! The basil dish was great as well. If you love basil and spicy food, go for it. The service was good and food was great. This is my favorite thai restaurant so far."}
{"text":"I recently heard about the opening of a new Thai food restaurant in the Southend area and was excited to give this place a try. Needless to say, I'm going to be a frequent customer at this new restaurant!

A friend and I came in around 8:30PM on a Friday night and the restaurant wasn't too crowded at this point. The greeters were friendly and promptly sat my friend and I down immediately. The atmosphere was very relaxing and could easily be a great place for a date night. 

I tried the Kao Soy based off a recommendations and I was very impressed! The curry and spices mixed well together and the dish was very filling. My friend had the California Rolls, which were just as good as the entree I was having. We had special cocktails and Chinese beers to go along with our meals with the Ruam-Mit for dessert. Altogether, the entire meal was well worth the wait.

Overall, the Thai food and atmosphere made this a great experience for the both of us and I'm excited to come back to try out more dishes in the future!"}
{"text":"This place is a hidden gem in Charlotte. Such a hip, quaint and delicious place to dine. The food was awesome! I had the Kao Soy and and lots of mimosas, which were on special for $4. I love the atmosphere because its classy yet lounge-ish is that makes sense. I recommend this place to anyone who can appreciate great Asian food."}
{"text":"This is a very good Thai restaurant but average Sushi bar. I really like their beer selection; draft and bottle choices were excellent. I would stick with the rolls if you're coming out for sushi. My Salmon Sashimi was a little tough compared to what I was used to. The Drunken Noodles dish was excellent. Watch out if you can't handle spicy food. Overall, I'd recommend it for good Thai Food."}
{"text":"Ok. At this moment this might be my new favorite place.
Generous portions and half price sake on Sunday didn't hurt.
Thai basil beef fantastic. I asked for 4 out of 5 spice, and they delivered.
Snapper trio could feed three. And nice spice too.
Try it out."}
{"text":"I want to like this place. It's cute inside and ofter alot of traditional dishes. I order a drunken noodles with shrimp 4 level spicy. Yes it's spicy. The favor of the dish is off the noodles are not the thick fresh noodles they used the dry noodles so the favor aren't soaking in.  It's salty and sweet even weird. I'm sure shrimp cost more but for 14+tax you would think you will get more than five shrimps. Well im sorry but the drunken noodle was so confusing."}
{"text":"I have driven past this restaurant many times and was very happy to see it finally open. I am a big fan of Thai food, so I had some high expectations. Ordered the Pad Thai for dinner and got the Mango Sticky rice for dessert, both were great. I got the Pad Thai on level 3 spice and it had the perfect amount of heat and spice. The Mango Sticky rice was a great way to finish after the spice from the Pad Thai. The only downside is the place is on the small side so it was a little tight between tables."}
{"text":"Came here for happy hour and I will definitely be back. We got there as soon as they opened back up at 5p so no one was there but we were greeted and sat at the bar. All of the staff was really friendly and we talked to most of them our entire time there. 
The food specials were great. I got the $4 wings, $3 spring rolls, and the $7.50 tsunami roll. Everything was delicious and regular portion sizes!! If I wasn't full I would have ordered another tsunami roll! I have no complaints about this place and can't wait to come back to try their other menu items."}
{"text":"I've been waiting for this place to open! FINALLY! We walked in today for lunch to find a packed Rai Lay. It's much smaller than I expected, a little cramped as far as seating goes. It's a very trendy/modern place, the EDM never stopped and the decor was not average of a Thai place. Our server was quick to pour us water and take out order. The salted edamame was nice to munch on while we waited. I ordered the Kao Soy because who doesn't love curry noodles and the bf ordered the basil chicken spice level 3. It can get a little pricey for lunch, my noodle dish was $14 but fairly large for a lunch portion. 

We found the basil chicken had good flavor but it was extremely spicy for a level 3! I feel like Rai Lay's level 3 is a 4-5 in reality. Order a Thai iced tea if you order anything over a spice level 2. This is the first time I've seen ground chicken in this dish also. The Kao Soy was da bomb! I loved the curry gravy here, the coconut based curry was both sweet and spicy. The fried noodles on top gave nice crunch and the overall presentation was beautiful. I would definitely get the Kao Soy again. At our neighboring table, a fellow dinee got the oyster pancakes, that will be my next victim.. It smelled heavenly. 

I couldn't finish the Kao Soy so I had to take it home. A suggestion for soupy dishes, please consider closed plastic containers in stead of the styrofoam box... I had to drive home slow to make sure the car wasn't detailed with my leftovers."}
{"text":"Best Thai in Charlotte! Make sure you ask for Howdy too as your server. She's sure to guide you through menu and I've always left extremely full and happy. I recommend it to anyone that comes to Charlotte that wants Thai!"}
{"text":"Wow! I was so impressed by this place and I just ordered takeout! I feel like all the Pad Thai I've ever had has either been good or bland but still good because it's pretty hard to mess up noodles. This place has CHANGED the way I think. I know that sounds dramatic but this is easily the best Thai I've ever had. Service seemed a little behind but everyone was super friendly and the atmosphere seemed really nice from what I could observe waiting for my food.

10/10 recommend. It did seem a little on the pricier side for noodles, but definitely a \"must visit\". Bookmark now. 

Must try specials (specifically the Bang Bang Shrimp app which is AMAZING). Must try Pad Thai. Also great as leftovers if you're into that kind of thing."}
{"text":"I'm from out of town and decided to try this for a quick bite. I had the Kao Soy and my Mother had the chicken drunken noodles. We loved it! I ordered to go but the staff was wonderful while I waited. Definitely planning to come back. Thanks guys!"}
{"text":"After several recommendations and an evening of driving around SouthEnd, looking for something different to eat, I ended up here. I found a parking space right on the street.

Note the door facing the street is not the entrance door. There's a small sign pointing you to the right door but I didn't see that until I was actually inside. Go to the courtyard to the left and you'll see the entrance door.

Inside, it's a small place, similar in size to their sister restaurant Dee Jai on Providence Rd. There's a bar with about 8 seats and that's where I ended up. 

The drink menu is on the back of the food menu. I opted for a local beer and a glass of water. For food, I opted for the Tom Kha soup and the Basil Chicken, the latter being my usual dish to test out a Thai restaurant. The Basil Chicken was mentioned to already be ordered at spice level 3 which is supposed to be Hot. I'll be the judge on that.

The soup was flavorful. Loved the coconut lime flavor. There was plenty of chicken. My only complaints is it needed more veggies and it was a tad bit salty.

The Basil chicken was a good sized portion and served with a bowl of rice. I added a little rice to my meal. I'm not a huge rice fan so I appreciate being to add it at my own pace. Stirring around my bowl, there was tons of basil which at many places you get a spring or two. There were a few pepper slices here and there and lots of onion mixed into the ground chicken. Flavors were good and the spice level was on point. My only complaint with this dish was like the soup, it was a bit salty. 

So both items had salt issues. Also an IPA did not go well with these two options but that was on me. The service was good. I think it's worth coming back to to try other things on the menu and also to see if the salt issue appears again."}
