{"text":"We decided to go back.  They sill struggle when it gets really busy but never as bad as that night."}
{"text":"The staff is running around drunk, acting like a fool. Do I need say more? Yelp tells me I need to say more, so, if you're 18 this is the bar for you"}
{"text":"It was good until Hargrave was sold.  Now it's bunch of very rude people, horrible service and nobody cares about your as customers.  Will NEVER visit ever again.  Don't go there unless you want to be treated as dirt."}
{"text":"So we're renoing our kitchen right now so we (my husband and I) went out for dinner last Saturday with our contractor (my husband's cousin) and my brother-in-law. We walked in expecting a complete dive bar, based only on our impressions from when we've walked past. We were all pleasantly surprised. The decor is actually quite nice inside, everything looks clean and well maintained. The server was amazing, I think her name was Sidney and she seems to know everyone. I ordered the banquet burger with spicy fries and all three guys ordered wings. The burger was AMAZING, it was MUCH better than I was expecting. The guys all enjoyed their wings, I think they tried hot, chili thai and cajin, and they all got suicide on the side. The Cajin were my favourite. I should also mention the guys said the beer was really fresh, the Guinness had the rings when drinking and Sidney also makes sure it's a good pour, I watched her tip a little out etc to make sure there wasn't too much head. 

We went back this Saturday and Sidney remembered us, which was really nice. I asked her what her favourites on the menu were and she said the Philly Cheese and the Roast Beef sandwich, I got the Roast Beef and she was right, it was delicious; the meat was super tender. My husband and his cousin both ordered the cajin wings with suicide on the side but when they came out they were hot with suicide on the side. Sidney was really apologetic, she had input them as the wrong type. Within seconds she told us to just enjoy the wings and she would bring out two more sets of cajin with suicide and again apologized. This place is great, we will definitely be back."}
{"text":"Rails and Ales is my go-to place. I love it there.

The best part is definitely their service - the waitresses & chefs are the epitome of good customer service. When they get busy it's a little slow on the service, but hey they only have one server (two on a big sports night) so you can't expect it to be that rapid. They're friendly, they take care of you and they make the effort to remember you. I love that.

The pricing is fabulous. As a broke university student, cheap food and alcohol is always great. Some of their food is about average but if you're looking for recommendations:
POUTINE - we're talking like 5.50 for a plate as big as your head. Love it.
HOME BURGER - this is also about 5.50 or 6$ and the buns don't hold up too well, but that's because the patty is thick, and juicy. Great find.
Garlic/Cheese Bread and the Greek fries are also other appetizers I turn to when I'm low on cash, but they're sure as hell filling.

10/10 WOULD RECOMMEND."}
{"text":"Imagine a Firkin pub. Imagine it less tacky. Imagine it grimier. Imagine it smaller. You are imagining Rails & Ales."}
{"text":"This place is awesome.  The guy who runs the place is great and so are the staff.  The food and drink are fantastic as are the prices.  To top it all off the regulars who frequent \"Rails\" are just as friendly as the people who run the place.  If you're ever on the danforth you should definitely stop in to say hello."}
{"text":"Stellar staff! Great beer selection, wings, nachos, and the best pork chop special in town. Vast improvement over the previous two establishments here. When the bathrooms become cleaner and better smelling I'll gladly revise to 5 stars."}
{"text":"I've heard a lot of locals talk the place up so we figured we would check it out. It seems to be kind of a dark hole. No lights, no music, no laughter. It was about 1 am on a Friday and as soon as we walked through the door the bartender informed us she was closing. She gave us a beer and I asked when was a better time to check the place out. She didn't really have an answer. I asked if they have bands or karaoke or dancing or any kind of entertainment. They don't. I'm sure some people would dig this place but it's not my scene."}
{"text":"This was stop #5 out of 6 on a recent Danforth pub crawl I led.  Compared to our other stops (Helen's, Sportsters, Eastenders, Tommy's), this place was a paradise of good lighting, nice beer selection and patrons with all of their teeth remaining.

Rails and Ales is one of those totally fine, regular, normal pub-ish bars in Toronto similar to a Firkin.  They have a fine beer selection but nothing that would truly impress a beer snob.  Lots of TVs for all of your sports watching needs and what I assume is standard pub fare.  Service at the bar was great.

It is in an interesting spot on the Danforth and I have always wondered if this hurts or helps it.  About a block or two east of Donlands, there is not much else around.  You almost have to know about it which adds to its charm.

It has a nice patio.  If you live around here and need a place to drink, and watch the game, this place totally works."}
{"text":"Rails and Ales has a good atmosphere and pretty great service. I went here with a big group for game six of the Stanley Cup and I can report that the beers are frosty and the food is dirt cheap. Sadly, the grub is only average, but it's still worth it for the cost!"}
