{"text":"Authentic is the first word that comes to mind when describing Rain Tree. An expensive local gem, the Rain Tree has been in Chagrin Falls for what feels like an eternity; it was a favorite of my late grandmother's. She passed away in 1987.

Entering the restaurant you are first greeted with by the great double doors with their brass handles; it is worth checking out the restaurant for its decor alone. It is beautiful; with English collectible glass and ceramics adorning cabinets inside; oil paintings on the wall; curious lamps and marble tables.

The atmosphere is dark and rich, much like the food. The signature menu item is the Dublin Lawyer, a thick soup of cream and whiskey with large chunks of lobster served over rice pilaf. Also good is the grilled salmon.

There are plenty of pictures of their beautiful interior on my blog (http://whatsincleveland.blogspot.com/2011/05/rain-tree-restaurant-chagrin-falls.html)."}
{"text":"Such a disappointment. This was one of my favorite restaurants but after this last visit I will never go again. The service was horrible. We were ignored for 10 minutes when we first walked in and when we were finally seated we were ignored for another 15 minutes. When the server finally came over she made us feel like we were bothering her. There were many \"regulars\" there and the wait staff bent over backwards for them so I guess if you are not a regular you are a bother. It took 30 minutes for our waitress to take our order - Dublin Lawyer which is our favorite, or used to be. When the meal came out it looked good but within minutes it started cooling off and a puddle of grease started pooling on the top of both our entrees. It was terrible. The waiteress never came back to ask us how our meal was or offer to refill our drink but she had plenty of time to sit and talk to the table next to us. If Janet is working there - do not sit in her section. So, 2 hours later and $83.00 poorer we were finally able to leave with nothing but disappointment."}
{"text":"This restaurant came highly recommended...what a disappointment.  The prices were higher than expected, and the food didn't live up to it.  We had a 5:30 reservation and arrived shortly before that time.  There was no one there to meet us at the door.  Someone took us to a table and left us, pointing out the specials printed in the center of the table.  Shortly afterwards, a server came to take our order.  We ordered iced tea and one of the specials described as a tenderloin medallion with asparagus and potatoes to share.  We also accepted the Caesar salad offered by the server.  The tea was good; the salad, asparagus and potatoes were very good.  The steak, instead of being served in medallions, was a long piece of meat.  We asked that the steak be cooked medium well and it was well done (no pink), and had a slightly burned taste.  There was also a good deal of fat running through the meat.  What a disappointment for $20.  
Service was ok; my husband had to wait several times for a refill on tea although the tea itself was good.  When we received the check, we were surprised to see an upcharge for an extra plate because it had not been mentioned when we ordered.
This restaurant had more of a bar atmosphere, trying to pass for upscale dining.  Its decor and ambiance was wonderful, but the food didn't live up to the promise.  It was not as good as many bars.
We may return for a sandwich at lunch, but will not return for dinner."}
