{"text":"Very friendly service and great foods. The prices are very cheap for the vast amount and variety of food you're getting!"}
{"text":"Above average punjabi vegetarian food. Service was good and courteous. As the restaurant is vegetarian so had limited selection but still did not miss any popular dishes. I ordered vegetarian biryani and thali ( platter with bread, rice, vegetables and sweet). Most of the restaurants have sweet and yogurt in thali but Rajdhani gives you only one to choose. The price of thali is same as most of the restaurants in Brampton ( $5.99 + Tax ). The place has seats where you can eat your food but not a full service restaurant. The food is not very spicy so my kids could eat it. If you are a fan of 'gajar ka halwa' ( carrot dessert ) then dont forget to add to your meal as they are really good in that. If you like punjabi food then also try their makki roti ( corn dough bread ) saag (spinach and mustard puree) with lassi ( yogurt drink ) on Tuesday's.
At the end, I will go again only if in the area and will try to have their Saturday breakfast special."}
{"text":"Food is awesome here.  Tip: for takeout, call ahead so they can get the naan ready."}
{"text":"I work int he plaza right beside this place....the service is a little slow during lunch hours but other than its good indian food for the right price and a good filling lunch.. food has always been on point....I have tried their choley bhaturay and vege thali...Price wise its a much better bang for your buck than any other fast food chain like subway and pizzanova......if you enjoy indian food its a place to check out..."}
{"text":"Great tasting vegetarian food prepared from good quality ingredients. Servings are not too generous if you dine in. However they are more generous with the take out orders. The place is a bit too crowded and the servers are a bit too rushed in their service.But at least they are not rude like some other places I have been to.For a thriving business such as this place, they sure need a bigger place or at least a separate lineup for the sweets. They have a great variety of items but most of them come with the same chickpea with gravy called channa. After eating at this place don't miss going next door for some delicious paan."}
{"text":"Place itself is conjugated and not very spacious. But man do they make good chaat paapri. 5 starts for chaat papri- everything else is pretty average. 
If you want chaat papri and you are in brampton, go to rajdhani!"}
{"text":"This is my go to place every weekend. I always order their thali which is $6. I feel so full after. I haven't seen such cheap and yummy food anywhere else in GTA. Their shahi paneer is the best. I love their chana bhatura as well which is $4.50 I think. Trust me this place is a gem. All the food items are really really tasty and cheap, that's why the place get crowded quickly. 

For some, service could be a turn off as it's all self service place. But I go there to enjoy food without worrying about the price/service. The only reason I am not giving them 5 star is the servers limit the amount paneer they're serving in the platter. This started happing recently and has happened couple of time with me. They will only put 1 or 2 pieces of paneer which is a big turn off for me. One time, I even saw the girl taking out the extra paneer that she put accidently which I think is not a great service. Rest is all good."}
{"text":"One of the cheapest good quality indian thali available in brampton. Sweets are decent, other snacks are good and reasonably priced too. Not many options in the menu but whatever is available is great for the price."}
{"text":"This is the only place we come for Chaat!!!! Mouth watering....you will keep going back for more :-)"}
{"text":"Came to Rajdhani for dinner today. Their prices are super cheap. The food is okay. We got the naan and Palak paneer and also a veg thali for $6.49. The veg thali came with rice, onions, choice of 3 veg curries and a desert item.

The naan is warm, soft and delicious. The curries are buffet style so it is a bit of that bulk cooking with no real flavor and soggy veggies. 

Also there were fruit flies buzzing everywhere...kinda gross.

Overall...it was just not memorable...2.5 rating."}
{"text":"I'm not a vegetarian but it's inevitable to avoid veggie Indian food especially if your friends prefer veggie restaurants. A friend and I visited this place for a quick thali for lunch.  Price was on point at $6.99 for a thali with big helping of naan or two good sized whole wheat roti.  We also had rice, salad, Dahl, chick peas, eggplant dish, and yogurt, with a desert.  Well damn I was full and the food was super fresh and super good. Not too spicy but very flavourful and great quality! The cons: it was a single file line past a counter full of the sweets assortments but because you are kind of rushed past the sweets to the ordering spot it's hard to even think of making a thoughtful selection of the sweets to take home. The. You order and pay and are given a number. We weren't told what to do next so we kind of wandered around until someone yelled a number and we noticed someone else going to the buffet counter to pick their items.  The lady behind the food counter was rude and rushed like a drill sergeant.  When we were called up we ordered and basically we're shouted one word commands from the lady. \"Veg, sweet, next, naan!?\"  It was weird. Then we sat with our food and without our breads and waited. They gave the naan but not the roti and we had to ask the rude lady for the roti. So, be ready to order and be shuffled. The food was really good because I forgot about the feeling of basic training after I stuffed myself with their great feast of a thali!!"}
{"text":"Good food. Long wait times, rude service. Avoid if your really hungry.
Bread pakoras were oily.
All the sweet meats were stale.
Never again"}
{"text":"Amazing food and always ready for pick up on time. A great spot for vegetarian Indian food to either dine in or for catering services. Totally worth it!"}
{"text":"Was in the neighbourhood and wanted to pick up some food for dinner and we have had some of the dishes at one of our friends place. 

Picked up 4 Thalis. Lately many restaurants will refuse to combine the 3 or 4 dishes that come with the thali. Rajdhani let us combine the four dishes that we wanted (we replaced the dessert with an extra dish/curry - most  Indian restaurants will let you do this). 

We picked up a Palak Paneer (Spinach with Cottage Cheese) - amazing dish, a must try, Malai Kofta (creamed Paneer ball in a sweet gravy) - too sweet gravy for some reason. The Chole (chickpea) hit the spot right on. Not too spicy overly seasoned and not greasy as well. And then there was Mushrooms and Paneer not seen in many Punjabi restaurants, but liked by all in the family. 

The quantity provided was plenty to eat 6 if we had enough naans, which were soft and fluffy. Ordered Rotis as well, but opening of package found that they were griddle rotis and not tandoor oven baked as they are my preferred option. Nevertheless the rotis were perfect. 

Lots of rice, salad and yogurt raita provided as well. 

As and extra thinks for appetizers we picked a few samosas and Paneer pakoras/fritters. All in all they turned out to be good as well. 

Only wish that this closer to where we live or was in an area we frequently visit."}
{"text":"I have been a regular of this place but over last year or so, I have seen a decline in the taste and quality of food served here. 
The prices are very nominal and the quantity isn't bad either. Waiting time over here has always been high just because of number of customers coming here to eat. Food quality has gone from great to pretty mediocre and inconsistent. I wish they would shift from using disposable cutlery ( spoons/forks/cups) to actual one. Overall a good place but really need to tighten their belts to compete with newer restaurants opening in the area."}
{"text":"I don't know if it's because I'm relatively new to Indian cuisine, or that I don't eat in Brampton very often, but I freakin loved this place.  Not only is everything vegetarian, but the prices are ridiculously low and the food ridiculously good.  

(Food:)
The VEG. THALI was a plate of 6 different curries and sauces that came with rice and roti on the side.  Each curry was unique in its own way and some greek yogurt on the side gave a good balance to the dish.  The portions were so large for what I paid, and I felt quite full especially with the rice and roti on the side.

The PAV BHAJI was my favourite.  It's also a curry dish but with these sweet, beautifully toasted pieces of bread on the side.  I was in love.  I would 100% recommend trying this dish!  You just tear off a couple pieces of bread and dip it in the sauce and oh my goodness, it's heavenly.

(Price:)
VEG. THALI: $7.99 ridiculously cheap

PAV BHAJI: $5.99

(Ambience:) 
Nothing to write home about, almost like a fast-food vibe to it.

(Overall:)
Definitely not a fancy restaurant, but if you want cheap Indian food that also tastes BOMB; this is the place to go!  Truly 5/5 stars on the food alone.  I think I blacked-out a couple times from the taste :O"}
{"text":"Good sweets, samosas Are okay, sometimes a bit dry. Service is so so,
Sometimes Amazing and sometimes barely satisfactory. Smells like a typical
Indian place with deters you from going cause even if you step inside for a
Few
Minutes, you will walk out smelling like the place"}
{"text":"So i was @ this restaurant with my mom waited in line to get takeout.  3 ladies behind counter. Not serving to customers just laughing about somthing   Plus  when my turn came to give order  girl behind counter took order frm coustmer behind me.   So i just walked out frm there.   Never ever  going back there again"}
{"text":"Extremely poor service whatever way you order it. Over the phone, they tell to come in 15 mons but when you come your order was not even punched in. When in the resturant you wait for long period till the ladies behind the counter stop talking with themselves and ask for your order. On top of this they are rude."}
{"text":"Not sure why the ratings are so low?? Our experience here was positive but we did only order takeout.

We stopped in here on our way to a family Thanksgiving dinner in Kingston as we were delegated to bring appetizers so we decided on samosas :)

Grabbed the large pack of 27 (I think!) samosas for just over $9!! This also included containers of tamarind and mint chutney dipping sauces.

We split one fresh samosa in the car on the way down and it was delicious. Flaky and light pastry and the filling wasn't too spicy.

Our family loved them too which was awesome."}
{"text":"I came here for a visit today not knowing this location is also owned by the same owners of the Etobicoke location (http://www.yelp.ca/biz/rajdhani-sweets-and-restaurant-etobicoke). 

While the variety in the meal offering is pretty much the same (all vegetarian), this location is much nicer than the other. Presentation is the focus here, the service was not as good, but I'm going to overlook it as it was Diwali and they were inundated with customers. 

They offer thalis here which are very delicious, though a little rich. The rice was flavoured with raisins and almonds, but I know they have plain rice as well. I had a delicious dish with sliced fresh ginger and mixed vegetables. Rajdhani is worth a visit for vegetarian lunch or an inexpensive, casual dinner. 

I look forward to a return visit here."}
{"text":"Service is definitely bad. When you go to dine in, no one arrives to give you the menu or take your order. You must go in line and place your order and wait for your number. They forgot to update the order numbers on the screen so many people were confused. 

We ordered two mango shakes and three thalis. Our turn came to pick our food and we went. There is no dahi (yogurt) to start off with like at other Indian restaurants. They put the salad, onions, and cucumbers under the rice which makes no sense. The naan came way later and the mango shakes by the time we were done our meal. No one informed us that they were ready, we had to go about four times ourselves. The staff doesn't even ask or care. The naans were mostly very crisp and oily, not appealing at all. Most were burnt. The channa had no spices, lacking severe taste. The mango SHAKE was garbage, it was just mango juice. 

The staff doesn't even ask if you need anything else. There were unprofessional foam cups in the corner with some open straws for people to take if they were dining in. Again, had to ask and find them. We just ended up leaving without finishing our entire meals, as food and service was bad. 

BOTTOM LINE: Extremely poor service and food. Pick another restaurant."}
{"text":"We ordered food for 50 people but at the last minute had to increase it to 65 people. There was no issue in getting more food but we just had to wait a little bit while they freshly cooked extra rotis.
The kadhi, bhindi, and aloo ghobi were all hot but the rice was room temp when we got it home, requiring reheating the rice in batches in the microwave (a bit of a hassle as everyone was hungry).
The food was excellent! Not spicy at all....but the bhindi has way too many onions in it. I did not try the bundi raita as I don't eat dairy but everyone enjoyed it. I also didn't eat the rotis but the were warm and soft and enjoyed by others. The tray of salad also had the pickled carrots in it and there was plenty. There was plenty of food except the pakoras in the kadhi seemed less.
The Gajjar halwa was enjoyed by all but some people said it was too sweet.
Overall good food, reasonable price and great service."}
{"text":"Chollé Bhaturé - hahaha i really love this place than any herbivorous(vegetarian) restaurants. Their is lot parking space, good place the best part is royal paan is his neighbour.  Yes we indians eat a lot of spices and fried food this one of them. A fermented rolled fried traditional bread is famous in north INDIAN dish known as BHATURA. Its been served with many accompaniments like chickpeas curry, sweet pudding prepared with semolina known as HALWA. This place is good for kids, family.

Rest you will know when you discover by yourself it good family place. Don forget to try gulab jamun"}
{"text":"Love it for what it is!  Fast, hot, tasty cheap, friendly, and bustling.   Punjabi folks won't be crowding this place if it wasn't all that."}
{"text":"Amazing food and taste. Had been to both locations in Etobicoke and Brampton. Though the food taste is good at both places, the ambience and presentation is much better in Brampton location. Nice staff and good service. Sometimes it gets crowded and service is slow but that's acceptable for busy place."}
{"text":"I hate to write negative reviews but this time I will my stop myself. We have been at this restaurant several times. This is a self serve restaurant. You stand in a line to place your order, get a table, pick up disposable cutlery, foam glass and a water jug, and wait for your number to be called when your food item is ready. 

Prices at the self serve restaurants are usually less when compared with other restaurants with full service. You can get Thali for $6.49 which consists of 3 veggies, a dessert, salad, rice and a nan bread or two rotis (whole wheat bread). It's a decent price and food tastes okay.

However today July 16, 2015 we had made a visit to this restaurant with two other families for a quick meal. In my order I had found a plastic stripe in rice which was about 6-7cm long (pictures have been posted in the picture gallery section). While chewing my food I felts something wasn't right and when I took the stuff out of my mouth that is when I found this plastic stripe. I was disgusted and so as others on the table. Imagine how unhealthy and unhygienic it Paul's have been if I would have digested that plastic.

Sad part is when I showed the plastic found in my food to the girls at the front they called the one of their senior girl who just said it could have been from their plastic bags outside and said she could give me extra rice if I want. She didn't even apologize. I declined her offer of free rice and said thank you to her. 

At that point 6 people on the table had lost their appetite and we decided to leave the place. All 6 of them, regular customers of this restaurant, said they will never visit this unhygienic restaurant again. 

I really hope they take the cleanliness and hygiene seriously."}
{"text":"For the price you cannot go wrong.  The food is usually superb, however wait times can be lengthy and their service is spotty at best but this is a given, they are always busy."}
