{"text":"If you're looking for some authentic cowboys, the best country music there is, and a night you'll NEVER forget, head to Ranchman's! It doesn't get much better - two-stepping, line dancing, mechanical bull riding (watch out - you'll be sore the day after...or the week after - personal experience from my most recent birthday!). The best time to go is during Stampede, but Ranchman's never disappoints, regardless of the time of year."}
{"text":"It's a rip off and poor management, very unimpressed. It was my first time there and I will NEVER go back again. The manager has no respect for customers, very rude and unprofessional."}
{"text":"I went there a couple of times with friends with failed attempts at line dancing. Good crowd, friendly staff, decent priced menu. Girls are pretty, if country is your thing, this is your place."}
{"text":"You'd probably prefer a place like cowboys to this place. Its a cheap rip off of Cowboys and the music isn't good"}
{"text":"I'm wouldn't recommend eating here, but it's fun if you like country music (and multigenerational bars) and it's at its peak during stampede. Biggest perk: McDonalds is right next door, perfect after a night out!"}
{"text":"Ask anyone in Calgary where the \"real cowboys\" are and they'll tell you Ranchmans.  During The Calgary Stampede this becomes the unofficial HQ for anyone with a giant belt buckle.

However, during the rest of the year, Ranchmans becomes the place to have a really good time with your friends, whether you have cowboy boots or not. 

The best thing about the bar is that everyone is there to have a good time.  I've never been much of a square-dance person, but it is sorta like that, only with a lot more alcohol.  And if dancing isn't your thing, there are also lots of tables far enough away from the dance floor to still have a great conversation about chinooks or mini-donuts. 

For the brave at heart (or very drunk) they also have a mechanical bucking bull.  So if you want to impress your date, then you should give it a try.  My record?  3.5 seconds.

One thing to note: Ranchmans is quite the distance from the downtown core, so you if you are going to go, get ready to commit for the night, but once you get there, you aren't going to want to leave anyway!"}
{"text":"A vastly overrated bar with an unnecessary cover charge that's very high. In addition, for a bar that's supposed to be fun, they sure have a lot of tight-ass management, security and policies. Also, the selection of beer is quite laughable - Bud or Coors, none of the local greats like pale ale etc. This was my experience during Stampede anyway."}
{"text":"I wish I had a better review of this place but I just don't. It has really gone downhill since it got popular which is such a shame because this is where tons of people want to go on the weekend however I just can't seem to justify going there anymore...

The service there is horrible. The bouncers and staff are extremely rude, and after waiting over an hour to get in to the place, the last thing you want to do is be greeted by some grumpy bouncer.

The last time I went there, I had asked for a guestlist (no line, no cover) and had been told that it lasted till 9:30. We all got there before 9 and were told that my guest list wasn't actually on the list...So we waited for an hour in the regular line. After getting in, the staff were extremely rude and tried to kick out some of my friends that I had gone down with. Which makes NO sense considering we weren't being obnoxious or anything. They claimed my friends were using fake ID's, even though they are 25 years old, and look their age. Near the end of the night, another rude female worker came up to my friend who was sober, and told her that if she had one more drink she would be banned from the bar and kicked out. It was completely ridiculous. After when we decided to leave around 12:30 the bouncer at the door rudely took a beer from one of my friend's hands (who had forgotten that you can't leave the bar with alcohol, but would have willingly gave it up if someone had nicely reminded her), and said some snarly remark to her.  I would have expected something more along the lines of \"Sorry, you can't take this beer out with you. Have a good night guys.\" 

The whole experience was awful, and it seems to just get worse everytime. I can't wait till the new Cowboys opens so I can try out a new country bar. As I remember, the old Cowboys was a blast and the staff were pretty nice. Hopefully they can top Ranchmans."}
{"text":"This place gets 1 stars for live country music.  They get a minus -10 for everything else.  This is supposed to be a calgary favourite for bars but every night I have been here in the past it's drunk drunk drunk.  There are slutty waitresses and the bar staff always seems depressed.  If you are over 25 this bar is not right for you as this place has gotten 100% worse.  There are a million minors walking around.  I have to also add how dirty this place is and of course their closed in smoking area doesn't help with the nasty smell.  I think they need a makeover from john taffer of \" bar rescue\".  I know the money is coming in which is why you won't call but it's starting to look old and run down.  Sorry ranchmans but the truth hurts."}
{"text":"I really don't know how to sum up my feelings about Ranchman's in words, but I'll do my best.

First, a disclaimer: I don't like country music. I don't like country fashions. I don't like anything country at all, nor do I like nightclubs (this place doesn't identify as one, but if you have that many bartenders, beer tubs, doormen and a dance floor... sorry... you're a nightclub). I'm about as far as humanly possible from the target audience as you can get, so if you ARE the type this place targets, you may want to take my review with a grain of salt.

Right from the moment I walked up, even besides the obvious mentioned already, there was something about this place I didn't like. I think it started at the door - where 3 attractive (much younger than me) girls walked right in with only passing glances at their IDs, same thing for my friend who was right in front of me... but the door guy decided to actually take mine, inspect it for what seemed like an eternity, and run it under some kind of scanner to verify it. I guess somehow, to this guy, I look like the type to use a fake ID - despite being over the 25 they pride themself on \"IDing under\". Whatever.

We get inside and this place reeks of \"enemy territory\". I was subconsciously scanning for exits immediately, despite knowing I'd probably be there until damn near closing time (Oh the obligations involved with being a good friend). It also had all the trappings of typical nightclub culture: the music was so loud somebody had to scream five inches or less from my ear to be heard, drunken patrons were stumbling around at all awkward angles, and getting up to any bar was like trying to board a bus in China town: strictly a game of fitting yourself in gaps too small for your body and defending yourself from stray elbows. Not exactly my idea of a good night.

But as the night wore on, despite all the signs of everything I didn't want to be doing that night... the place kinda grew on me a little. While they were playing music I generally can't stand, the band on stage were pretty good at it, and it was an interesting twist having live music in a nightclub without it being a special show of some kind. The staff (while still selling grossly over-priced drinks, as is the norm) were very friendly and super efficient, and the crowd was great for a session of people watching - everything from guys in their fourties with handlebar moustaches singing their hearts out in the most animated way possible, to the typical \"club girls\" who I would never dream of actually engaging in anything resembling a conversation, much less show any further interest in, but provide some pleasent scenery for the evening. This place really attracts all kinds.... well, mostly country folks... but all kinds of country folks.

I've heard a few too many stories from former employees about kitchen practices and the like to ever risk ordering the food here, and I probably won't be back any time soon, based on my own personally preferences... but I guess if you're the country type and want a place to let loose your inner cowboy (or cowgirl) you could probably do worse. Plus, they apparently don't charge cover before 8:00 (though I got in free because I have friends who are sort of considered VIPs there anyway).

So yeah... not my kinda place, but it could have been a whole lot worse.

Oh, and did I mention beautiful ladies on a mechanical bull? ....That's certainly not a downside. Haha

(#6 of 100 for the Yelp 100 Challenge!)"}
{"text":"Ranchman's is a \"straight from the movie set\" country bar. mediocre band, really loud music, and overly imbibed people in plaid shirts. In this case, a lot of people in plaid shirts. The place was packed, with a 25 minute wait to get in the door. Yup, a mechanical bull.

You will love it or hate it, depending on your taste...."}
{"text":"Went to see Gary Martin's band and have to say I was pleasantly surprised with how much I didnt hate the place.  Yes, that doesn't sound like a great compliment, but given I no longer go to clubs, not an avid country fan, and have heard far too many racial discrimination stories from the Ranchmen's growing up, I really had lowered my standards as I was walking in. That all said, the waiters/resses were all very friendly, they had 4-8pm happy hour everyday, and the free pork on the buns were done quite well, especially since they were of no charge! Overall, pleasantly surprised and I actually think I'll come back and bring out of town guests for a good ol country live music night! Ps Gary's band was awesome as always (blues, soul, rock and a bit of country) and definitely worth following around the city...and the Ranchmen's is a great venue for some of that plus a bit of dancing!"}
{"text":"A #yyc staple. Best cowboy bar in the city, great for live music and special events, weekend \"hot spot\", and the food is good too. Great food specials duing the week, and on the weekend it can get packed. Stampede is a madhouse there and even with the outdoor patio it gets packed."}
{"text":"If you really like country this is the place to go. Two-stepping, line dancing and great live music. Good for all ages as well. My favourite club in Calgary for sure."}
{"text":"I was there for a work event... I know right?!?   Anyways, we were served the Beef on a Bun buffet and some drinks. I ordered a Caesar but they didn't have any garnish on the Caesar.  The Beef on a Bun buffet was okay.  The beef brisket was not dry but not fatty and had a lot of flavour.  It came with coleslaw and a bun that you'd find at McDs next door.  Lol. 

The atmosphere is what gives this place some stars.  There is a giant dance floor surround by tables and a cowboy taught us a few line dances which was great fun! A great way to experience Cowtown outside of the Stampede."}
{"text":"This is definitely the place to go to if you like your country music loud while drinking beer in a large crowded bar. We were visiting Canada for the first time to attend the 2012 Stampede. Unfortunately, for our first dinner in Calgary we picked this place out of a local magazine highlighting local dining establishments. I have no idea why it was listed in there, and the description was entirely misleading. I was expecting something akin to a German beer hall, where we could sit and have food brought to us as we listened to the music and enjoyed the atmosphere. However, after a long taxi ride from downtown and a $15 cover charge (each), we walked into a large bar where we had to fend for ourselves. There are actually several bars in connected rooms of various sizes and layouts, with two right off the dance floor. The food is sold solely at different buffet set-ups tucked away in different corners, so once you track down the correct person at the correct bar in the correct room to buy food tickets, you can get through a pantomime with her (the loud music never stops) and she will direct you to the correct buffet to get the food you want. The most annoying factor is that the seating is woefully inadequate for the crowd they attract, and we had a devil of a time finding an unclaimed surface large enough to set our plates in order to try to eat the food we bought. We finally claimed the corner of a table that was only vacant because one of their party had stepped away, so we promised to eat fast. I have no idea what I ate, it was barbecue something. I think it was tasty but I was unable to really enjoy eating it. We did make the best of things and enjoyed several beers. I would have expected a place like this to have a larger selection, but being from another country we found Kokanee and Pilsner to be sufficiently exotic. Between the multiple TV screens, the mechanical bull, the loud music, and the large crowd, it is a perfect atmosphere for enjoying a few beers. And after such a disappointing ordeal just to get dinner, I needed a drink or two."}
