{"text":"Working in the Yorkville area, I've come here regularly for lunch. I love the location and the interior. It's a nice break from the everyday, and it's automatically relaxing. Calm, ignorable, music fills the restaurant, interspersed with the occasional loud whirring of a blender.

I like that there is always a bottle of water on the table, because I end up getting a couple litres of my H2O intake for the day while I'm there.

I've ordered a bunch of different things, but the Pad Thai was easily (and most expensively)  my favourite. Nice filling serving, with a fresh rich flavour.

The nacho plate is pretty delicious too, but as some other reviewers have mentioned, don't expect a giant nacho plate portion here. It's not huge, but paired with a meal it's a nice snack.

Smoothies are always thinner than I expect them to be (and after ordering it several times you'd think I'd be used to it by now, but I'm not) so that's something to be aware of and set less thick mouthfeel expectations. 

Overall I like it here. I do find it feels expensive, especially since there is no guarantee of organic ingredients, but service is always good and not intrusive.

p.s. Get a macaroon (or three) they're delicious."}
{"text":"Love this restaurant   I like the natural ingredients they use and I know that they are good for me.   I cannot wait for them to reopen"}
{"text":"I got the Rawitch and it was surprisingly good. Ive never had vegan food so i really didnt know what to expect. The onion bread that sandwiches the Rawitch tastes AMAZING but the cole slaw on the side was a little underwhelming with little to no taste. The service was also great, the person who served us had a very sweet personality :)"}
{"text":"Some dishes are great, ike the pizza, some are just very unwhelming. Like the spring rolls and some of the appetizers. For the price, you kind want to get something that you couldn't easily make at home. 
Service was a bit slow and the atmosphere lacked a bit of privacy."}
{"text":"I am such a fan of this restaurant because I am a strong believer in the health benefits of eating clean, live, raw, and organic. Although I am not vegetarian or vegan I do appreciate these types of foods as I find them to be a healthier option. The food at Rawlicious is flavourful and satisfying although slightly overpriced by just a few dollars. If the entrées were a bit cheaper or came with a side salad I would eat here all of the time."}
{"text":"Nice restaurant those who are looking for something health and fresh! I'd ordered a classical burger with a lemonade and it was delicious!"}
{"text":"If you're reading this I assume you already know that Rawlicious is a raw-vegan restaurant so I'll leave it at that and get on with talking about the food.

The dishes are very creative. I loved my \"pasta\" with bolognese sauce and my \"cheesecake\" dessert. I tried the lemonade which they sweeten with agave and liked it and my wife enjoyed her fresh juice. We also enjoyed the eclectic decor and the homey feel. The local artists' art on the walls was also nice. 

I have 2 complaints... First of all I found it a bit pricey. I understand and appreciate the fact that it's all organic but even so, I wish it was a tad cheaper. Secondly, the location. It might be great for people who live around High Park, and there's ample parking right outside on Dundas, but it's a bit of a hike for a downtowner, especially if you're taking the TTC."}
{"text":"I've been to the Markham location and was quite impressed! I believe they're under new management now but the old management was great. They were always so friendly and the ingredients were always fresh, I often saw one of the three main workers walking in with arms full of Whole Foods bags, filled to the brim with organic greens and vegetables.

I've tried the raw pizza, pad thai, collard wrap, and rawitch and they were all great. Food is prepared right when you order. Desserts here are also very good- notably the cheesecake and the coconut/chocolate balls.

Definitely worth a try if you're in the area! I don't know how it is now, but when I went it was not that busy so service was always top notch, which I've heard is sometimes compromised at the busier Yorkville location. Ambience is pretty and cozy, decorated with art from local artists. Juice/smoothie menu also offers a lot of choice."}
{"text":"BEST zucchini pad Thai and soft taco I've had! The ingredients are very fresh and has a lot of flavour! Zucchini pad Thai is creamy and nutty. The soft taco has a bit of a kick to it but not too spicy. Highly recommend this place! Super cute atmosphere, waitress were professional and friendly."}
{"text":"Remember that episode of Sex and the City where Samantha convinces the girls to try out the newest Manhattan raw restaurant? Well, aside from Samantha meeting Smith on that night, it's a huge disappointment. Rawlicious proves otherwise with its surprisingly quaint and delicious take on raw cuisine.  

The 'Creamsicle' smoothie is to die for and will leave you wondering if there are minions in the back room blending up actual creamsicles. The flavour is shockingly authentic. It's hard to believe this is a drink that's kind to the body.

The nacho platter is a refreshing departure from the boring fare found at most eateries. Corn tortilla chips? Not here. Instead, you're presented with handmade, raw flax seed and sun-dried tomato triangles, which lack crunch but provide a stable bed for the fresh tomato salsa, guacamole, and refried 'beans' (they taste like beans, look like beans, and yet there's no beans in the recipe). I'm actually eating walnuts with a tasty dose of turmeric, cumin, and other spices. Can I get the recipe please?

The BLT is great if you love fresh tomatoes. Personally, I don't, and as such, I found it clever but heavy. The raw onion bread is tasty but dense and in place of bacon, they've added 'eggplant bacon', a novel idea which makes it hard to get a clean bite. And I hope you're not planning to kiss anyone because this sandwich will leave you with roast onion breath.

Never fear, there's a three layer cheesecake on the menu today: vanilla, chocolate, and mint. I don't dislike it but I'm not crazy about it either. I can see the chocolate layer but it doesn't even register on my palette. I'm happy because I love mint but I'm also disappointed because I LOVE mint with chocolate. Personally, I'd fold in some dark chocolate (crust and layer), but I'm not in charge and all I can do is pass on my feedback, which our server Adam is happy to hear.

Raw food is not conventional food, so head here with an open mind and some extra dollars. Worth trying."}
{"text":"A Great raw vegan joint! Amazing tea selections and entrees! Also the desserts are very tasty! Amazing customer service that is always on point! The seating is well spaced out and the ambiance is relaxing. Definitely coming back!"}
{"text":"This place has more of a cafe feel to it and so my recco would be a solid lunch option vs. dinner. The food is good although be prepared to wait, not necessarily for a table, but for the servers to make the food as it does take a while. I ordered the pad thai with kelp and zucchini noodles as a main and the cheesecake for dessert. Both were delicious and I left feeling comfortable and not too full. I only have a few teeny comments with this place; dimmers for the dining area to set the mood and a little bit of music playing in the background would also go down a treat."}
{"text":"This place is my oasis in Yorkville.  I always come back to have Bolognese.  It is light and refreshing.  I cannot believe this salad (it is not on pasta) can taste so good.  I am a light eater and this meal is just perfect for my dinner.  The waiter is very friendly too."}
{"text":"Incredible food with impeccable service. The chef found out I was there for my birthday and brought us samples of desserts he was preparing. He also took the time to talk to us about what was in everything we ordered, and made recommendations based on what we said we enjoyed. 
Everything was vegan, gluten free, AND soy free! Not only that, but the alcoholic beverages were splendidly made.

My favourite dish was the nachos- an amazing blend of flavors and surprisingly filling! Can't wait to return."}
{"text":"Rawlicious repeat-offender here: Did I do the dirty deed yet again? This time with the deliciousless noodleless Pad Thai and yes, it was a zucchini-licious flavourtime in my mouth. At $15.00, it isn't the cheapest entree you're going to have, but well worth it for the flavour, size and vegetable amount.

 My only quibble would be for more nutty and lemony pad-thai-like flavours, but when it tastes this good, I find it hard to care too much.

Thank you Rawlicious for another tasty dish! A perfect way to stay fueled for our bike trail ride in Sunnybrook park that followed!"}
{"text":"The Bloor-West Rawlicious? Hah, save your money for some where else, anywhere would be x100 better. 

The food was terrible. I'm not talking about, oh because it's unfamiliar food, I'm a vegetarian my self and was very excited to try it out... I'm talking about basic cooking 101 skills. How does a chef not know how to season? Everything was over sweet, over sour, over everything. One of the dishes had a lemon relish sauce and it was just SO unedible. Worst part is they spread it all over your dish so your whole dish is super sour. Lemon is strong. If you're not going to dilute it and soften the sourness with something to compliment it, don't make it so over powering and 'raw'. Another dish had sweet walnuts. It was like someone poured a pound of sugar, coated it in caramel, then dipped it in more sugar. Was nothing tasted before coming out of the kitchen? Not just the type of food but it was just so unedible because of the level of sugar and lemon that was comprised in all the dishes. After my meal, I just felt sick and my palettes were shattered and numb. 

Waitressing was lousy and terrible too, there were empty glasses all over the floor, no one was reflilling, no one was interacting with the customers. It acted like a fast food joint, bringing food in and out in a rush without a care about the customers needs. Took half an hour to get my bill. Took an hour to get a waitresses attention in which she took another 20 minutes to actually remember to bring me the extra water refill I needed. And mind you, these requests: good food and good service, are not hard things to ask. You would think it comes with the food industry trade. Staff focused more on having fun with each other, popping champagne and drinks with each other rather than paying any attention to paying customers. It wasn't like they were understaffed, there were about 7 people on the floor including the chef and what looked to be the owner/hostess of the shop yet they were too busy with their 'own friends' in clear view and only one girl was serving and cashing out customers at the same time, no wonder we couldn't get a hold of a waitress for attention..This shop fails on so many levels in serving the proper etiquette in order to run a successful business. But most of it starts with the staff. Uneducated, uncaring, unprofessional and totally unskilled, it was the worst place I went to share a meal. I kind of felt ripped off of my money, vegan food isn't cheap. 

Hope my relayed experience can help others make smart decisions when thinking of ever going to Rawlicious. I really wanted it to be a good night, but it just wasnt."}
{"text":"Went here on a weekday night. It wasn't very busy,  which created an intimate atmosphere. The food itself was okay, but slightly expensive.  We had the pad Thai and the falafel wrap. Our main qualm was with the service. There were two people on staff that night.  The first waitress that greeted us was wonderful. She took our orders, and then brought us our food and drinks. The other staff member seemed to be working in the kitchen. They appeared to have switched halfway. The second waitress was not attentive at all, and spent about 20 minutes talking to her friends that walked in. We would've loved to have tried dessert but the latter half of out experience was off putting."}
{"text":"I went to this restaurant for the first time this morning. We went around 10:45 a.m. and we wanted to get dessert (specifically cheesecake) and the girl at the front said there is an orange slice (1 piece available) but there were 2 of us. She said if we wanted 2 slices she can give us a slice of the lemon slice which is their next available flavor. My friend and I both love lemon so we said we will both take a slice of the lemon cheesecake and the girl said that we could only have a lemon slice if we take the last orange slice. We told her that we wanted the lemon slice and she said she won't give us a lemon slice if we don't take the orange slice. We drove about 25 mins out to get to this place and we walked out without buying anything. I have never felt so disgusted by an employee's ethics. Why should I have to pay $9 for a  slice of cheesecake that I don't want and pay another $9 for a slice I wanted. We were extremely pleasant to her and said thanks we don't want anything and walked out. I am absolutely apalled and give this place 0 stars. Never have I ever been denied a slice/food item when the item was available for purchase and the most absurd part is she said  \"Just get the last of the orange, atleast it has chocolate?\""}
{"text":"Everytime I come to this place I'm in love. Yesterday I got the nori rolls, rice paper spring rolls and the chocolate ice cream for dessert. Everything about this place (ambience, staff, food and clean energy) is really refreshing when your coming in from a neighborhood full of air pollution and traffic.  I also got a super generous amount of icecream in the end. Stoked to keep comin back for more :)"}
{"text":"was delicious i enjoyed the evening special raw lasagne and vegan chocolate raw cheese cake mmm. My vegan friends were impressed service was prompt food was fresh and bueattiful. Cozy space nice atmosphere. Would mos def go back again."}
{"text":"It's great to find these vegan places. I can satisfy my sweet tooth without feeling guilty."}
{"text":"Came in on a Sunday, I got the Pad Thai. It was delicious but very watery and super cold. Everything here is cold dishes. I would suggest coming here on a hot day. 

I also had a watermelon slushy, that's was pretty yummy too!"}
{"text":"I'm really torn.

The smoothies and drinks are generally delicious. The desserts are often great. The salads are simple, but yummy. And it's really nice to have more raw, vegan restaurants in the city.

But there are lots and lots of problems here. The apps and entrees are boring, underwhelming and often poorly seasoned. The prices are extremely high. And the service is often terrible.

It's too bad, because a few small tweaks could turn Rawlicious into a total winner. But for now it is only so-so."}
{"text":"This restaurant is amazing for vegetarians and meat -eaters. A great selection of salads, wraps, sandwiches + raw pad thai and zucchinni pasta. I tried a currant, hemp, pumpkin seed, black olive salad and tasted a friend's taco wrap that had nut nut loaf, guacamole, salsa, wrapped in a collard green. Both were amazing and full of flavour. I also recommend trying their tea. It's not listed on their usual menu as they have a tea menu that changes all the time, but all great/interesting flavours - I had a berry-flavoured white tea called beautiful follishness. Friendly staff and beautifully-decorated with paintings for sale. A wide variety of seating options - bar stools, tables, comfy chairs, pillows on the floor + a nice back patio. Overall, an excellent spot for a healthy lunch."}
{"text":"Awesome raw vegan food and a comfortable atmosphere. I've been here twice and I am definitely going again. The food is delicious and fresh and the customer service is great! I just wish they had a wider range of food to choose from and more desserts."}
{"text":"The food is decent at best but what reduces the review from a positive experience is the service. Its so damn slow. What's worse is its slow when its not even busy. There were only a couple tables occupied when I went to get a smoothie. This means the establishment and staff are unorganized. I had to wait 20 minutes for a smoothie when there was no lineup nor was the place busy. Being slow is a deterrant for coming here for sure."}
{"text":"One of my favorite raw restaurants! Their Phad Thai and raw tacos are amazing! I'd also recommend anything with the onion bread."}
{"text":"I went to this restaurant on a weekday afternoon. It seats about 15-20 people and on that day it was quite empty. I had to wait for about 20 minutes before my order was taken. After another half hour, I got a portion of food that was appetizing to look at but hardly enough quantity for a 4-year old. Each entree was priced at $13-15 which was not worth the wait and quantity served."}
{"text":"I've been here twice. Once for winterlicious with friends, once with my family as a goodbye lunch (for me!). 
Beautiful space - nice decor, great atmosphere, full of light, beautiful bathrooms that are super clean, lovely art
Friendly service - very nice and helpful
THE FOOD. SO SO GOOD. I'm the only gluten-free vegan in my family. But we all appreciate great food. And we all loved the food here. For raw food newbies - if you get a dish that's very dense, it's going to be a smaller portion. However, it will be just as filling, as it will be all nuts/seeds. If you're going for quantity - get a \"pasta\" dish. I had the burger today and it was amazing - and not something I'd ever make at home. We all split the cheesecake and pumpkin pie - yums all around.

The only thing that could be better was the service speed. We were the only ones in the restaurant eating when I went with my family and it took forever to get the food. It seemed that the two servers were also making all the food, instead of a chef in the back. I'm not sure whether this is standard for them - I don't remember it taking as long during the winterlicious dinner, so maybe not. On the plus side, more time for conversation (just don't come starving)."}
{"text":"I have never written an online review before as it is timely and I never had a justification for it. Now I do. 
This is not based off a one-time experience but multiple. I will share my most recent story:
I called and asked to order for pick up and the item I ordered was not on their summer menu. I asked what was new. Answer: would like to tell up but I'm too busy, sorry. Click. 
I called back - asked for the ginger juice without beets. Answer: there will be an extra charge. Why? Answer: any changes have a cost (logic: I am asking for an item to be removed not added on) 
I ordered a collard wrap. Answer: ready In 20 minutes. Ok. 
So I get there in 20 minutes and they hadn't even started making it. I asked to pay in advance. Answer: you're going to have to wait we are too swamped.
I finally pay and notice the bill is significantly more expensive (I have a gluten allergy so I come here often as an only-option scenario). 
I go to the cash and ask why it's so expensive. She said well you asked for the wrap without \"cheese\" and that's a modification so we charged you extra. My manager ( beside her) said \"sorry\" (logic: I asked for 1 less item, I should've charged same or less!). I confronted the manager and he said ok we will give you the cost back (meanwhile never looked at me when he talked). The girl at the cash asked: how much do I give back? Manager response: $1.50. I said, no no. It's more than that. Your juices are $9 alone. I said (logic) do a fake order and do a substitution. $2.75!!!  He tried to take advantage of it not being highlighted on the menu!  I got my $2.75 told the manager I was not an idiot and to not treat me like one and said I would write a review about my experience online. So I did. Never going back!!
Enjoy!"}
{"text":"I know I shouldn't have high expectations for \"raw vegan\" food, but you know, I've actually had amazing raw vegan food. I'm also not a picky eater at all, so you can count on me really enjoying vegetables (raw ones too!) when they're done well. 

Here though, their \"nachos\" with their weird dehydrated chips and their \"sliders\" with their funky-tasting vegan patties are just lacking. There's not enough flavour in anything and you leave feeling kinda full, but mostly like there's a brick of undigested food sitting in your gut. A heavy kind of feeling that's unexpected after having dined at a raw vegan place. 

The service is good and the neighbourhood is nice, but it's also ridiculously pricey for the portions you get.  Go to Fresh or Live Organic Food Bar if you're craving something really healthy."}
{"text":"I had a great experience during my visit. The interior was clean and simple. The staff were all courteous and friendly. I got the Don't Be a Chicken sandwich and it was delicious, the onion bread was amazing! I also got a blonde macaroon which was delicious as well. Would definitely visit again!"}
{"text":"I've been here multiple times, and I've ordered many dishes. Can I just say, raw vegan pizza is the BEST! This restaurant has fueled my need for cooking and experimenting, and without them I never would have tried \"cashew cheese\" and rice rolls. They're food is very eclectic, sharing one thing in common, it's all raw, vegan, gluten free and cold. 
So yeah, it's a bit weird the first couple times you go. but the coconut macaroons and banana cream pies will win you over in the end. The food is absolutely delicious, and fairly fresh, and filling enough so you're not full or bloated. It's a bit pricy, but that's what you get when you pay for real food. I recommend it to other fellow vegans/vegetarians and raw food eaters. !"}
{"text":"I absolutely love this place ! The food is beyond amazing! I will be back and cannot wait! A++++"}
{"text":"We pretty much were the only people in the place when we got there which was pretty nice. I loved their raw deserts & smoothies but I had a plate of nachos that I wasn't really pleased with. 

Overall the place was nice but I doubt I'll be stopping by anytime soon unless I'm in the area & craving one of their yummy deserts or juices!"}
{"text":"Had largely good experiences here. Service is generally decent, though sometimes a bit slow.

Food is pretty tasty, and the products are pretty high quality. In terms of how the vegetables are chopped, and portion sizes, things are sometimes inconsistent.

Still, I'm usually pretty happy after eating at Rawlicious."}
{"text":"Amazing food and drinks, and the staff is extremley nice. The Taco salad is my Favorite!"}
{"text":"This place has a elegant rustic feel. The service was great, the server explained to us what the dishes had when we weren't sure. 

We don't normally eat vegan, or raw. 

The Bolognese is served cold, which we were not expecting.  I would have liked it more if it were room temperature. But, I guess that is hard to do when all of the ingredients are raw. 

We also had the sweet potato fritters, which were delicious. The hot chocolate was made with homemade almond milk and real mint. The Thai coconut zucchini curry soup was nice, warm and delicious. I was a bit sick which made it great."}
{"text":"Was my first time in raw restaurant. My family is vegetarian and we went for my birthday lunch. I was so pleased with the size of entre portions, they were really big and I would say nicely priced, like $16. Appetizers were all very good too. I was so full, didn't even finish my dish. Everything tasted great! Stuff was friendly and attentive. Very happy that we have such place up north."}
{"text":"I'll start by saying I enjoyed my food and  I'd go back again...that being said I'll make the following notes:
1. The lettuce in the Spring Roll filling was browning (maybe day old)
2. No service between bringing plates and removing them.  Never came and asked how the meal was or was available if I happened to need a napkin etc.  Everyone seemed to disappear.
3.  Windows are dirty and so was the area out front the door.
4.  The Angus Burger was delicious and the Spring Rolls were good...quality of ingredients aside.  I especially liked the dip provided.

This place would go from okay to great with just a few small tweaks."}
{"text":"Like Fabio, I am also not vegetarian or vegan but I had wanted to try Rawlicious for quite some time due to the great things I had heard about it.  I was introduced to raw foods about 2 years ago and just love trying new things, so I also brought a friend along with me and we were both very impressed - can't wait to come here again the next time I am in Toronto!

We started off with the Nacho Platter, which was very tasty and we just loved the special Rawlicious nacho chips.  For our meals, I had the taco wrap and my friend had the special of the day which was lasagna.  Both of our meals were so fresh and tasty, we were blown away.  Since my friend and I are both lactose and gluten intolerant, we just loved the options and how things are made here.  We also finished off with the raw cheesecake, which is super delicious - I like it more than regular cheesecake (I know, shocking!).  

We also had great service and didn't wait long for any of our food, so we were really happy with our experience.  All of the other food we saw going out to other customers also looked great, so I can't wait to come here again and try something new!"}
{"text":"SO many years ago I saw this restaurant in Yorkville and was interested in trying the food. I ordered zucchini noodles as take out and at the point I wasn't impressed maybe I just wasn't into this sort of food at that point.
Fast forward may years later, my sister one day brought their raw healthy vegan no refined sugar blonde macaroon and I was hooked. So we decided to go there one day and actually try the food. We decided to go to the one in Markham Ontario.
Entering into the space its nice and bright, the tables and the decor are quite lovely. With an open kitchen in the back, tables lining each side, and a little seating area with two cozy chairs in the front window. Paintings by local artists decorate the walls, and though this location is more upscale in appearance. Upon entry, we were greeted and sat at a table. I was interested in the fireplace and the couch, thought it was quaint. 
The food: the menu, the smoothie caught my eye and I decided to try the Tropical Green
Banana, mango, pineapple, spinach, kale smoothie, I was quite impressed it was big and delicious!!!
decided to try their Pad Thai
Zucchini & kelp noodles, shredded romaine lettuce, carrots & bell peppers mixed in a tangy Thai sauce topped with green onions & crumbled cashews. I was impressed it was good and not heavy, flavourful and it drew me to return and try so of their other dishes. The dish is served cold - as are all the items on the menu - which is different from the usual steaming hot, fried noodles I'm used to, but it really doesn't matter, this is great dish, it's just a lighter, fresher version. 
THe next time I decided to visit I tried their he pasta bolognese ($13 - top photo), a raw vegan spin on the classic dish that may have Italian cuisine traditionalists cringing at the thought, but trust me, it's good. The same spiraled zucchini serves as the pasta, sauced with a mix of garlicky pesto and fresh tomato marinara sauce and topped with crumbled 'neat balls,' a sort of seasoned, nut-based creation that replaces the usual meat in such a recipe. The zucchini really transforms quite well into a pasta substitute, and the generous dish is definitely not lacking in flavour. The unfortunate thing is they changed their menu to a summer and have removed these two dishes, but they still have other choices if you are interested in trying new not what most people are use to menu."}
{"text":"Love it! Kale and apple shake was yummy and their salads were fresh and reasonably priced. Service a little slow, you can't be in a rush. I will definitely return"}
{"text":"I need to continue forming an opinion on this one. 

We were there mid afternoon & it was empty. Probably location & time reasons. We wanted to know what it felt like in the evenings because in the light of day the vibe that was attempting to be sleek & minimal but ended up a bit sterile. 

The pad thai was pretty good & big, but expensive for what it was. The Caesar collard wrap had a cool flavour and was also a good size. 

More things need to be tested, but location, price, and atmosphere might get in the way."}
{"text":"Not sure how I feel about this place. The smoothie was delicious, and I enjoyed my alfalfa nori rolls, but I feel a bit cheated paying six dollars for something that could barely be considered a side salad if it were deconstructed. There are very few nut-free options for people with allergies such as myself.

The waitresses are also the chefs, I think, and they are very friendly. If you like, you can get a delicious treat at the bakery section. I recommend the Creamsicle flavour of smoothie."}
{"text":"If I eat too much zucchini, will I turn green?

That pretty much describes my meal experience at Rawlicious. It was my first go at a raw, vegan restaurant and it was pleasant enough, but let's just say I won't be going there for my birthday. **BUT, keep in mind, this is a review coming from a part-time vegetarian! I am no expert in vegan dining by any means.**

An immediate obvious downfall at lunch time was its small dine-in layout.  but I guess that's what you get when you pay rent in upscale Yorkville.

I ordered the Zucchetti wwith \"Neat\" balls. I must admit that reading the menu was really confusing to me because when I read \"lasagna\", I imagine the cheesey, hot casserole. Perhaps this added to the mediocre satisfaction of my meal. In the raw, vegan world, PASTA = ZUCCHINI STRINGS. I guess it was cool that it was my favourite colour, but my good friend Mr. Flavour was absent in this meal. Good thing I added their neatmalls too, otherwise I'd have just been eating a huge bowl of green strings. I don't even think rabbits eat raw zucchini like that. The Neat balls were really tasty, made of a collection of nuts. This is something I'd want to make at home but would take too much effort. They could've given me one more neat ball to pair with the mountain of zucchini I had left...

The pasta portion was good but personally, I had gotten full about 3/4 of the way through and had to waste the remaining raw, organic zucchini (emipod fact: I never like wasting food!!). But due to the nature of eating a bowl of raw vegetable, you become hungry pretty soon after - and being hungry sucks for me.

I guess I'll go back eventually someday... maybe in a caterpillar costume."}
{"text":"A little pricey for what you're getting, but good food!  I loved the meatloaf and garlic mash potatoes. The smoothie was quite filling and I enjoyed the little desserts."}
{"text":"Juices were great. I had the green one, and it was delicious! It would be a staple in my diet if the price tag wasn't $10+. Eek. I get it though, it's likely that they're using pricey Organic Veg. Time for me to invest in a juicer!

The \"Nacho\" platter was tasty, but sparse. More like an App for 1 than 2.

I had the Raw Pad Thai as my main, and was disappointed. The dish was devoid of flavour. I believe nut butter was the base for the sauce, but there was no seasoning to be found. Thai Food is characterized by the combination of Spicy, Salty, Sweet, Sour and Bitter flavours, and this had none of that. It's more of a tossed Zucchini salad than a Pad Thai.

Had the Vegan Cheesecake for dessert. Small portion, but boy was it rich. Great alternative for those who don't consume dairy, though I do prefer the real thing.

Interesting experience, though I'm not certain I'd return."}
{"text":"Food was very good, but service was terrible.  

Raw and vegan isn't my normal dining style, but I was surprised at how much I enjoyed everything I ate.  From what I could see the food was pretty much all prepared in advance, and and just plated as you order it, but it all tasted fresh.

Our cutlery was placed on the table with the server holding the end of the fork that's destined for your mouth, and then later served food using her thumb to keep food on the plate as she shuttled it to our table (and I'm usually so pleased with the fact that human beings have opposable thumbs).

Food was enjoyable, but service was poor enough to dissuade me from another visit."}
{"text":"I am not a vegetarian at all but when I ate here I want to stop eating meat now. =)

We went here just to try and I ordered their Taco that was nutloaf, salsa , avocado wrap in romaine lettuce. The servings were small but it was DELICIOUS!.

The service is great and they prepare your food ( nothing is pre-made )"}
{"text":"Being a vegan vegetarian I'm so pleased with all the foods they have so close to my work. Love it!"}
{"text":"This place makes great, healthy food. They clearly put a lot of time and effort into making sure their food is of the highest quality. They don't use an excess of sugars or salt, so it might not be for everyone, but the food feels and tastes good. I recommend their smoothie bowls."}
{"text":"Went here for dinner with a non-vegetarian friend. He ruined the experience as I could tell he wasn't enjoying the food but I wouldn't say I was overly impressed. We ordered the pad Thai, nachos with refried beans, spring rolls, pot of tea, alcoholic drink and strawberry milkshake (all to share). The smoothie was unnecessarily huge and tasted alright. The spring rolls were served as a pair for $6!!! $3 each for lettuce wrapped in rice paper...so not worth it. The pad Thai was OK but for $15 ... I don't know. I'd rather just make it myself. The best food option was the nachos but they were $16 for a small portion.

Service was great. Food was OK. After a $70 meal we were both still hungry though. Not worth it to go back in my opinion."}
{"text":"Went out with family to try our first vegan lunch. The ambience was fantastic, the restaurant was clean and bright. Our male server (forgot his name, had a fantastic accent!) was superb! Friendly, gave great input about the menu options and was really passionate about the food. 

The menu had a lot of options. We ordered 3 different salads and a zucchini pesto bowl. My husband ordered a delicious green smoothie too (well-balanced). I tasted everyones and was pleasantly surprised how flavorful everything was! The dressings were killer, the combination of ingredients were creative and I could feel how happy my tummy was eating something so fresh. I'll definitely be back and am considering buying the recipe book after such a great experience!"}
{"text":"Good and the staff is charming. I am trying to eat more healthy and the food was more flavourful than I expected."}
{"text":"This place is just ok. Nothing special. 
I found it over-priced. Something like 7 bucks for a tiny juice. 
Had the nachos, which were tasty. Again, not great, but still tasty. Serving size was tiny! LIke seriously tiny. 
Next, had a sandwich and salad with ginger date dressing. Loved the dressing, enjoyed sandwich okay. But again, way too much money. I don't know what they're thinking. 
I hear and read a lot of defence for raw food and vegan prices because they use organic ingredients, and lots of prep time. The prep time claim is bullshit. All cooking takes time. Raw and vegan food does not take that much, if any, more time. 
On the organics claim, consider this: I have a friend who lives and worked at the No Frills out at the Junction, and she would OFTEN see the staff in there buying some of their produce, especially zucchini, lettuce, and tomatoes.
They claim to use organics when they can. This seems seriously deceitful to me. I will not be going back."}
{"text":"SOOOOOOOOO GOOD!!!
I've literally had every food item on the menu at least once, and i've had most of their daily specials! Great place, nice and cozy, great service!!"}
{"text":"Recently visited this restaurant.  Had the Mediterranean wrap. Very good, however incredibly dry.  Will be sure to return to this place, just will order something else.  Loved the atmosphere and the art.  Just don't go there if you are in a hurry. Slow service."}
{"text":"A buddy and I were visiting the Toronto area and met up with some friends at Rawlicious in Markham for dinner. Let me first state that I am a MEAT eater and have always considered vegan food as nothing more than a side dish for a grilled steak. I, therefore, wasn't expecting a memorable meal of raw food. We had a sampling of several dishes, shared with the table: Spring rolls, Caesar salad, pizza, tacos and a couple of hamburgers (there were 8 of us). Every dish was excellent, especially the tacos. I reluctantly shared the last piece of pizza and was more than a little annoyed that there was only one taco per person as I could have eaten the entire plate. This restaurant totally changed my view of eating at a raw restaurant. Go for the tacos and stay for the rest of the offerings. I just wish I lived closer to the restaurant, as I would happily dine there on a regular basis."}
{"text":"So TODAY I went to Rawlicious up in the Junction. Felt it necessary for a detox meal after a weekend of ethanol-overkill. It was fucking sweet. I had some sort of fake chicken salad sandwich and a kale/spinach/mango/pinapple/banana green smoothie. Go there! And if you want to try it out- there's lots of people out there with 50% off coupons from GrouponTO...find one."}
{"text":"I visited here on a Sunday afternoon after lunch for something sweet and was not disappointed by the desserts on offer. All desserts are on display at the counter in the back of the restaurant where at least 6-8 options are on offer from chocolate dipped macaroons, cinnamon balls, apple tarts, cheesecake and salted caramel slice. I bought the salted caramel slice and was delighted by the crunchy texture of the base combined with the smooth and creamy centre. So delicious that I can see myself coming here regularly. If you're someone bored by the usual dessert fare at restaurants that looks like it could have been bought at M&M Meats, then this is the place for you. This combined with a beautiful gallery like interior, Rawlicious is perfect for first dates, catch ups with girlfriends or moments when you want to treat yourself to coffee and something sweet!"}
{"text":"I stumbled upon this place today and have to write a review. Although I am not a vegan, a vegetarian or a \"raw\" food eater (is there a name for that?), I do have a restrictive diet; I try to avoid eating wheat, gluten and dairy. Raw food tends to accommodate these dietary restrictions naturally so I decided to give this place a try. The smoothies looked very enticing so I went for a Tropical Green smoothie, which was delicious. I was eying the pizza and nacho platter, but the pizza needed more time to prepare than I had time for, so I went with the nacho platter. I was expecting tortilla-like chips for some odd reason and was definitely surprised to see the strange looking chips that came out with the guac and salsa. I was delightfully surprised though! The chips were actually one of my favorite aspects of the platter - very tasty! It definitely wasn't a replacement for the nachos you can find at most restaurants; I would consider them completely different foods. I think that this is something one must think about before going to a raw foods restaurant; the food will not be a carbon copy of your favorite food, even if the name is the same. 

Since I was in a rush, I got dessert to-go - a brownie and two macaroons. They were also very good! The brownie was very sweet, which I like, but will definitely be dessert for a few meals. I was quite impressed, and happy, to finally find a place that was wheat and dairy free, not to mention yummy!

The restaurant is fairly casual, more like a cafe, with the size, feel and music of one. The service was friendly. They had a cozy waiting area in the front by the window. The space is small, with only a handful of tables. You can get take-out here and I think that it would be a good place for coffee/tea and dessert some time.

One caveat, like a few others have mentioned in the Junction location reviews, raw food can do a number on some people's stomach. As a friend once said, \"it feels like I have compost in my stomach\". So, probably not the best place to take a first date unless (s)he eats only raw."}
{"text":"We love this place.  I had been here several times in the past few years, but in this past year, I have almost lived there - specifically when I was on a candida cleanse and my diet was so restrictive that other restaurants had no options for me.  But I loved all the food!  My favourites:  Raw-witch, Quesedillas, Taco Wrap, onion bread, and zucchini flat bread.  Trevor is super friendly.  I don't get tired of going here.  Now if only people could remember to close the damn door all the way so the cold doesn't get in...or out."}
{"text":"I'm the first to admit that I don't really look like I belong in any type of vegan-y, vegetarian-y venue.  When I hurled my hulking carcass and freshly buzzed head into Rawlicious this evening the waitstaff looked a tad uneasy.  Just as one was about to inform me that despite name, they did NOT serve steak tartare, nor were they a professional wrestling fan-bar, my BVF (best vegan friend) from Montreal came in to join me for dinner.  Since she looks the part, this quickly assuaged their collective fears and we set to ordering.

The food featured universally high quality ingredients, but the ultimate effort was a bit of a mixed bag.

The staff appeared to be well meaning and have the absolute best intentions but somehow simply did not seem wired to be serving people.  Not a case of attitude or indifference - just had the feeling they were going to pull up a chair and join us at any moment...

The food.  Okay - not great. Nothing here that is going to cause a mass conversion to the raw food movement.  The pizza was a nice effort, the zucchini pasta was also pretty good.  Most things suffered from a rather monolithic seasoning.  

The desserts were actually quite good; good enough to make it an official stop on the tour when the BVF is in town.  But only for desert!"}
{"text":"I generally don't enjoy visiting raw restaurants because I find the portions a bit small and sometimes 'it's the place to be'. But Rawlicious is filling and the atmosphere is very relaxed. I enjoy coming here!

The food is wonderful, colourful and very tasty. I can't recall anything that I've had there that I would not have have again. There is a large selection of smoothies, fantastic desserts and the best raw sandwich; the 'rawich' ever!

If you want to experience great raw food, go to Rawlicious! The owner is also one of the nicest people you'll meet - she puts her love into the food and it shows!"}
{"text":"Wonderful place, not like other smelly raw food restaurants. 

Very delicious and nice atmosphere."}
{"text":"Food: 7/10
Atmosphere: 8/10 
Service: 8/10
Overall experience: 7/10

This place is nice and quaint, located on Main Street Markham. I've never seen it too busy, which is always a plus as other restaurants in the area tend to be.

I never had a bad experience, the reason it is only getting 3 stars, is my comparison of it to the Fresh chain downtown. The menu is typical vegan, but I find other establishments have more variety to their menu, which makes the ordering process less stressful if you're not a full-time vegan.

THE BOTTOM LINE: food is fine, but you'll find greater vegan variety elsewhere."}
{"text":"Went there on New Year's Eve anticipating an eye-opening and enjoyable evening and left with regret and anger for wasting such an important night at such a poorly operated restaurant. This is their first year doing New Year's Eve dinner and should be their last, and I have sincere doubts of their level of performance on a regular basis too.

First of all, the most important element of a prix fixe menu is..the MENU, I mean we all want to know what kind of food we're getting for the hefty price they are charging us right? Called 2 weeks before and was told that it would be posted shortly on their website, yet somehow that did not happen at all before NYE.

Arrived at the restaurant that night and let's just say they treated their customers as part of an assembly line. We were seated after receiving a less than warming welcome, and from then on it was dish after dish being plopped down on our table with no attempt by anyone at interacting with us or explaining the various dishes. Being a restaurant that specializes in foods different from your regular pasta and salad, this was quite surprising and discomforting. Unfortunately, my discomfort proved to be right as I was disappointed by every dish I had that evening. I am normally an adventurous eater and generally can stand foods that don't taste the best, but I found myself literally shivering to how sour the lemon relish tomato nut dumplings were and forcing the food down my throat just to get my money's worth of food. That was of course another problem with the meal, I mean how do you justify charging $55 per person by offering literally tomatoes and nuts? 

It's sad to say that Rawlicious completely fails at changing the views of those who are skeptical about vegan food. If anything, they only reinforce the stereotype that vegan food is expensive and unfulfilling. I'm a vegetarian myself and am truly disheartened by how disappointing my first vegan experience was and how the vegan image is portrayed by such a horribly run restaurant. 

The level of attention paid by the waitresses immediately plunged to zero after the dessert plate was taken away. I was left for the remaining 1.5 hours of the evening with a parched throat while watching the owner and his employees mingle with their friends, popping open bottles of champagne, posing for pictures and celebrating their New Year's Eve, which ironically, I PAID to do the same. 

Can the evening get any worse? The free alcoholic beverage that was promised to us was never offered or asked by any of the servers. That evening being NYE, the natural assumption was that the drink would probably be offered closer to midnight for the champagne toast. So when I wanted to inquire because the clock was ticking closer and closer to midnight and there were still no signs of beverages being offered, the servers were of course already too busy sitting down with their glass of champagne in hand. So my 2012 came with an empty stomach, a lame count down, no New Year's toast, all the while watching those who were too busy to serve me have the time of their lives. 

To sum it up, they are unprofessional, unprepared, unskilled and severely lack passion for what they do. The customers are not their priority at all, they give you your food and leave you at that. My advice? Don't go to this restaurant unless you are seeking employment there, then I'm sure you won't be disappointed."}
{"text":"I've been to several rawlicious locations but this review is specific to the Yorkville location.

I went for the first time on Saturday and had a tea and lemon cheesecake for dessert. They use a high quality tea called 'tea of the sahara'. The cheesecake was delicious. Most of all, the staff was friendly and laid back. They were fine that my friend and I we're taking our time - never rushing us out the door. The atmosphere is casual and cozy.

I recommend rawlicious if you're looking for somewhere casual and laid back - nothing fancy -  and you are willing to eat food that's raw and vegan. It's also a good spot to grab a coffee/dessert after dinner. I recommend the pecan pie if you have a sweet tooth."}
{"text":"I came back again to eat recently having just turned vegan but a cheating one, and discovered that I really liked the Thai Spring Rolls and the Blonde Macaroons (no, not MACARONS, macarOOns).

Anyway, if I had to eat another meal there, I'd just make it all spring rolls and macaroons. I wouldn't bother with their sandwiches and all that, dehydrated onion bread is gross."}
{"text":"This was only the second time I ever ventured into a totally vegan restaurant.   I looked at some of the folks there and realized I must not have been starving due to my larger frame compared to the rail thin people that were in the restaurant at the time.  My gf had suggested upon my return to Toronto that we try this place out as a venture towards more natural foods, as opposed to the processed crap we as a society are usually used to. 

Anyway I tried the Pad Thai  which was somewhat of a venture.  It just seemed like a lot of sauce and a mish mash of noodles and veggies.  It kind of left me with a bit of heartburn in the end.  My gf had tried the tacos which were tastier than my pad thai and was not dripping in sauce.  The dessert were a key-lime tart (me) and chocolate banana cheesecake.  When they mean tart, they do mean tart.  I wasn't a big fan.  But the cheesecake was deelish and definitely would have that again.

Venturing on the vegan side is a change from the burger joint and definitely I could see myself doing on a more regular basis.   But I'll stay away for a while and try again another time in the future."}
{"text":"I met the first Vegan who I can respect, and talk to like a normal human being. He has an Queensland accent, and presides over this restaurant of shocking meticulous and strict standards. Didn't get his name though..

I came here for an intimate evening with a group of people so outside of my 'category' that it would have equated to hyenas on the Serengeti sitting down for a coffee with a couple of impalas. Although, I'd always imagine myself being a mandrill if I were ever a African game.....okay, whatever, what I'm trying to say is that this place is a vegan restaurant... 

Rawlicious is housed in a historical building on Main Street. When I say historical building I mean that I had to close the door behind me upon entry as it didn't close itself. A lovely intimate space with seating for approximately forty patrons with a kitchen sized to cater to no more than that number. Raw food? You know, I was just joking about the whole Serengeti thing. 
This was a learning experience for me, and what I learned was that zucchini could be diced as an alternative to traditional dough noodles. Nuts and other mysterious ingredients can be manipulated to taste like--and in this case better than--meat. 
I have always imagined a vegan lifestyle as a constant compromise, but Rawlicious proved it is not always necessarily so. But so it is often as described by the Aussie gentleman. At least sometimes. 

Nothing is what it seems. I had little idea what I was putting into my mouth, all I knew was each bite registered positively with my palate. I love vegetables, and despite coming from a Country of limitless culinary possibilities, I was not expecting the level of creativity with these so called 'raw organics'. I ordered the bolognese, my neighbours got the burger, pad Thai, and nachos. Everything was very sophisticated. Somehow my soil based appetizer in the shape of sushi tasted like sushi. The satisfaction of the ocean taste without the mercury or Japanese radiation. This was no alternative restaurant, this was the adopted lifestyle of some very 'proud to be' experimenting with food with a level of competence so rarely exemplified in this specific culture. The man who ran the place offered insightful information towards this obvious passion of his. He could have my talked ears off if not for the interest I had for his words. Same goes for me as I vainly went on and on about myself throughout the night. Thank goodness I am also very interesting. 

As with all meals where I am given the opportunity to express myself, I found myself defending my perspicacity of politics and history. This could have been avoided if only Rawlicious was licensed to serve wine. In this case, instead of a well constructed debate, the conversation went all over the place, which is just as well because I might as well be talking as if I were drunk. There was no blood with my meal, and that is the factor to which I place blame upon for my surmised conjecture. 
Liquor license expected in March!

I have a dream, where hyena mandrills like myself, and impalas can dine in civility for maybe a couple of days out of the year. Let the predator within me be impartial to the dietary preferences of those of whom I share this land, as long as they are willing to consider the benefits of consuming themselves. 

One thing is undeniable; the coffee pairs excellently with the pumpkin pie."}
{"text":"I pick up some juices here from time to time. I have to say the juices are very delicious, but very pricy. (I think I'm paying about $8 for a juice).

Good from time to time, but I'd go broke here if I visited them regularly.

-----
Update Sept 26, 2013
Went in to get a juice 40 minutes before closing.  \"Sorry, we've already cleaned the juicer for the evening.\"


Update Oct 12,2013
Went in today and ordered a juice to go.  After 20 minutes and no juice I left.  20 minutes.

-----

I think I may be done with this place. Dropping my 2 star review to 1"}
{"text":"This is my first time making a visit to a vegan raw diet restaurant.  The place was clean and the staffs were very helpful to explain the dishes.  I would say their dishes were very creative considering it is raw and vegan.  It is a but overpriced tho but I guess thats what it is when you go to a niche diet restaurant."}
{"text":"Excellent. Creative and tasteful use of ingredients. Well presented. The banana cream pie may have been the best banana cream pie I have eaten anywhere ever. Definitely on my list or restaurants to eat at again."}
{"text":"I've been meaning to try raw food for a while now, but been a bit nervous. I came to the Paint Lounge beside Rawlicious last year and have been eyeing this place since. Finally decided to bite the bullet and it was an eye-opening experience. Rawlicious taught me that delicious food doesn't necessarily equal cooked/processed food. What nature gives us can be just as delicious if prepared properly. 

For starters we had the Nori Rolls and all the ingredients were so fresh, which I would think is a huge factor as to why it tasted so good. It came with a dipping sauce made with Coconut Aminos that was sweet and tangy and hit all the right tastebuds. 

I had the Pad Thai while my friend had the BBQ burger. We didn't really know what to expect of these traditionally cooked food items to be raw, but it tasted so good that we forgot we were eating raw food. For dessert we got a chocolate chip cookie dough ball and a brownie and again were blown away! 

The ambiance was light and airy with paintings on the walls, and if I were to describe Rawlicious in 2 words - Fresh & Delicious."}
{"text":"After coming here several more times I'm knocking stars off.

The quality of food has been vastly different every time. Sometimes the portions are way off - like I get way less food than worth it.  A few times already the food was overloaded with salt, not like \"oooo a little too salty for my taste\", more like I just bit into a huge chunk of salt and I'm not sure whether I should spit it out or try to swallow it immediately because I cannot have this in my mouth one second longer.

Overall the portions are a too small to justify the amount of money I spend here. Food is still pretty good when they get it right but I definitely have to ask myself I reaaaally want to spend around $25 for just a drink and a single collard green wrap that may or may not be entirely edible."}
{"text":"Went with a dear friend who lives a few blocks away not long after they opened up  last winter. Let me just say they made my visit to Toronto the bomb! We had amazing soup that warmed us up followed by some blissful zucchini and kelp noodles! It was meal to remember! Will definitely be back on my next visit!"}
{"text":"Not unlike the young child who looks at all vegetables as \"icky,\" I too for the longest time was guilty of prejudging Rawlicious as \"just another hippie health nut place.\" However, I think we all know the saying about what happens when you ASS-U-ME things, am I right?

Let's call this as it is, I, ever the overzealous carnivore, would not make this place my regular lunch spot, but that's not because the food was bad or I hate vegetables or Raw cuisine, I just generally enjoy the taste and texture of meat. On the contrary this was a flavourful meal that not only filled me past the point of wanting to POP, but made me feel actually good for days to come - literally my insides were whistling dixie! SO call me a converted because I can totally see the benefits of eating a raw/vegan or raw/vegetarian lifestyle.

Being that I've been doing my best at being on a health kick as of late (and yes I've had my stumbling blocks along the way), but I was so happy to know that all items are void of gluten, dairy and refined sugar on their menu. However, that in NO WAY implies that they are void of nutrients, flavour or YUM! Plenty of that to go around!

I asked what their most popular item on the menu and the staff informed me to go for their Pad Thai option which was made of zucchini & kelp noodles, shredded romaine lettuce, carrots & bell peppers mixed in a Thai sauce for about $15. I knew my body would go into shock without a little protein so I paired that with their Chocolate Protein Power Shake  $9 - almond milk, banana, cacao, goji berries, maca, hemp protein, spinach, sunflower sprouts.

The Pad Thai was very surprising, certainly not a traditional PT in my opinion, more creamy in sauce but the flavours were there for the most part. Again, wouldn't be my regular menu item (sometimes you just cannot beat the real deal) but this was a delicious substitute. The smoothie on the other hand was excellent and I really enjoyed the dark chocolate tartness of this, would definitely switch to vegetarian protein shakes if they were more easily available. 

The space here is really cool, they have an amazing backyard patio (for summer) and the whole restaurant is set up in an amazing historic home on Markham Main Street. I get that Rawlicious is an expanding Raw food chain of restaurants but I think for the occasional healthy change I would definitely return.

Eatcrest Out!"}
{"text":"Rawlicious is one of those places that shows you how awesome being creative with food can be - and how tasty! I was in for lunch, so didn't want something too overwhelming like one of their pasta dishes. I ended up choosing the Ceasar wrap.

With the collard green wrap for freshness, and the fantastic creamy dressing coating everything inside, it was a definite flavour and texture winner. The seasoned nut loaf bites were bursting with flavour and were a nice combination with the greenness/creaminess of the rest of the wrap. Lovely! I then opted to try the raw pumpkin pie (it was Thanksgiving weekend, why not?) - a small slice, but it packed quite a flavour punch. Heavily based on coconut and cashew, but still with the rich blend of spices you'd expect from a pumpkin pie.

Service here was friendly and helpful, and they're very welcoming to people who've not been before, helping them with menu info and decisions. The decor gives off a real vibe of homey warmth, almost like you've gone to a friend's for a meal. The location (bit of a hike from downtown for me) and price (my two items came to just shy of $20) knock this down to 4 stars, but otherwise colour me impressed!"}
{"text":"Great organic restaurant that caters to those with a taste for real food and none of that gmo and pesticide-infected garbaj. I just ordered a smoothie this time, however even after a full cup, my hunger stayed at bay and it didn't feel similar to the \"guilty\" type of feeling when you over-eat at any other restaurant. I definitely want to try their chicken mock sandwich next and some dessert options! Great place and great staff at this location!"}
{"text":"Stopped in here after a sunny walk in High Park. Nice little place, quiet with eclectic decor, paintings, charming fixtures and so on in a relaxed atmosphere. I'd never eaten at a restaurant dedicated to raw food before.

We ordered the nori rolls, the pizza special with mango, pineapple, pesto and cilantro, and pad Thai. The food is very creative and refreshing (I quite liked the nori rolls as an appetizer, they really clean your palate nicely.) The pizza was not spectacular, though like the nori, it struck a nice balance between crisp/clean feel and stronger sweet and salty flavours. I thought it was a little too heavy on the cilantro, and it was a pretty small portion.

I stole a bite or two of pad Thai, which was very good: the \"twist,\" something that many of the dishes here seem to have, is that the cold \"noodles\" are made from zucchini, which gives them a crisp, light, salad-like texture that works well with the peanut dressing and peppers in the dish while still feeling satisfying. It's really a hybrid between a noodle dish and a salad, which is surprisingly impressive.

If you're looking for a light lunch someplace that might surprise you, check this out. Just keep an open mind!"}
{"text":"My boyfriend and I went there for lunch today. We shared a pot of jasmine green tea, and we shared 2 entrees: the zucchetti pasta with tomato marinara and pesto sauce with \"neat\" balls, and a taco. After that we had the cheesecake. Not one bit of exaggeration, our food was mind-blowing! Everything was so delicious, I will absolutely be a returning customer. The staff were incredibly friendly and knowledgeable about the ingredients and the process that goes into every dish. The atmosphere was so comfortable, we found it hard to leave. Absolutely beautiful, I cannot wait to return!"}
{"text":"I'm not vegan but I'm definitely thinking of becoming vegan after eating here.  It really opened my eyes as to how there are alternative nutritional options we can eat and enjoy.  The service here goes beyond my expectations - friendly, informative, funny and accommodating! Highly recommend this location!"}
{"text":"Time for get outside of that comfort zone. It's vegan time! 

I'd heard about Rawlicious when I worked in Markham; a co-worker found it and become addicted. I mean 'need to try everything on the menu' addicted, so I was pretty excited to hear one opened in Whitby. 

We were nervous, being meatatarians, we were worried we wouldn't be full or that we wouldn't like it. It calmed us to see that in the first 15 minutes we were there, the place filled up. It went from 1 table to full that fast; something's got to be good.  

I don't think they expected it to be busy that day; there was only 1 server. It took longer to order the food than it did to get it. At least you can count on getting the food faster since they don't have to cook it!  

We started with the Spring Rolls because they were familiar to us from our many sushi adventures. They were good, but the sauce that came with it had no flavour. 

The main courses were a different story. I chose the Taco Wrap and my mom selected the Angus Burger. I know, I know, I went with the safe bet, but it was delicious and surprisingly filling. The guacamole was fresh and delicious and the greens were tasty. I wasn't sure what I would think of the almond nut cheese or the seasoned nut loaf; they were subtle, but went perfectly with the salsa. My mom was a little more confused by her dish. It came with a nut and seed burger on a buckwheat bun. We couldn't figure out the seeds; they tasted familiar, but didn't. She enjoyed the sauce that topped it; it had kick! The sweet potato chips were dehydrated sweet potatoes, not bad! 

At the end we were full. It was a good experience and I definitely see vegan food differently. I understand why my co-worker wanted to try everything! 

I hope they get more staff in there; they've got a good thing going."}
{"text":"Great food! Everything was fresh, flavorful and yummy! Don't let the idea of raw vegan turn you away - you'll be missing out on a healthy satisfying experience! 
Meatloaf and mashed potatoes was divine! I also had with a creamsicle smoothie which actually tastes like its name however made with natural ingredients! 
Ambiance is calming, puts you in relax mode. nothing is done quickly at this restaurant, staff do take their time, but adds to the whole vibe. 
It is a bit pricey, but from time to time It's totally worth it. I look forward to going back soon!"}
{"text":"I've been to this restaurant like 20 times in the past few months, and I have not been disappointed once. I am not vegan, but love eating organic, raw delicious foods from time to time. This place is gluten free, soy free, dairy free, so this is amazing. I usually get the strawberry milkshake to go (my fave). I have tried other smoothie flavours, and they are all great. I often get the banana cream pie which is delish, like all the desserts. Everything I have ordered from the menu was a hit, which is not the case from me when I go to Live Organic Food bar which is based on the same premise. Last time I got the red pepper quesadilla, which was so amazing I had to order two. I also got the onion bread sandwich, which was also amazing. I love coming to this particular location because the staff is super sweet and welcoming, and I feel so comfortable here. I have brought my momma bear here a bunch of times and she loves it as well. Even if you are not vegan, this place has something for everyone - food, dessert, coffee, alcohol, juices."}
{"text":"On a quiet weekend, we stepped into what looked like someone's living room. It felt cozy and I was glad it was nearly empty because this place is probably a hipster lightning rod. The only other customers were two middle-aged ladies.

\"Nutritious\" is how you politely describe something that tastes exactly like you should've expected it to taste, and that's how my friend described her Superfood Smoothie, which came with almond milk, banana, sunflower sprouts, spinach, goji berries, cacao, maca, hemp protein.

I, on the other hand, had the least healthy smoothie I could find. Something that resembled an Oreo shake, but I can't seem to find it on their online menu. It was delicious. 

My friend had the salad, which was a salad and that's really all that needs to be said. I had the Rawitch, a sandwich with guacamole, tomatoes, cucumbers, alfalfa sprouts and balsamic vinaigrette. I don't know how they make the onion bread, but it was not exactly bonded together. It fell apart quickly and things got messy.  However, the taste was pretty good.

In the spirit of trying as much as I could, we got the banana cream pie. The flavour is not very complex. It tasted like a bunch of mashed bananas frozen into shape. I enjoyed it though, and if you like bananas, you'll probably like this too.

This place is a nice change of pace if you're looking for something different."}
{"text":"Pretty good specialized RAW-staurant, I went for lunch and had zoodles with tomato, nut loaf, pine nut Parmesan for lunch. Taste very good. service was decent too. You have to like this type food, no animal products and no heated cooking."}
{"text":"Really loved the food here. Their smoothies are amazing too. Don't even get me started on the desserts... YUMM!!"}
{"text":"i had high hopes coming here and I gotta say that i was disappointed.  First of all their cups were DIRTY.  Definitely not washed properly.

Tried their soup of the day - cheesy cauliflower.  It was okayyyy, just not for me. You can REALLY taste the cauliflower in it.  For the main I had the Pasta Bolognese and the portion is quite large.  It was cool because of the zucchini noodles and i felt super healthy eating it, but it just wasn't that good.  Also,  the pasta is cold which I found weird (but I already expected this). 

The desserts were all displayed and I really wanted to get one but they all pretty much looked gross n stale.  not impressed. Don't know what all the hype is about for this place."}
{"text":"A small little shop near Bathurst station. It was cute and seemed great for early dinners with a friend or two. I ordered one of the wraps to go and I thoroughly enjoyed it. However, the price was not cheap and the portions are very small. I was still pretty hungry after my wrap. As a vegan I love supporting cruelty free restaurants but I'm not sure my wallet could handle it."}
{"text":"I'm not vegan or vegetarian but I wanted something fresh and light for lunch. I ordered the zuchetti bowl and it hit the spot. There was a lot of flavour and I especially liked the pine nut parmesan topping. The service was quick and friendly. Overall, a really refreshing meal and atmosphere."}
{"text":"I've been here a few times and have loved the food and the service every time! The staff are awesome and the plates are always a lot more filling than you'd expect. Even the almond milk is made fresh every morning! For a vegan/raw/organic restaurant the dishes are very well priced in my opinion. Absolutely love this place!"}
{"text":"I was so excited to try this place. It's got a similar menu to the place where I used to work, at THRIVE in Miami. However, the service was very poor, our server was rude, and although the customer area was clean, the kitchen area was not. They kept wiping their dirty hands on their aprons, and it just did not peak my appetite. I loved the salad I got (hemp seeds, olives, I can't remember what else was in it), but they gave me a tough time about the juice I ordered. Didn't bother with dessert, despite the fact that my mother and I were on vacation. It was pretty quiet. We wound up leaving after paying the bill rather hastily and went to the Pilot next door."}
{"text":"This place was delicious! I had never eaten at a \"raw food\" restaraunt before, but it was great. Almost everything was completely raw, everything was vegan. I was with a group of four and all of us loved what we got. The servings were healthy and filling.

Also, the staff was ridiculously sweet and I wanted to hug them all and ask them to come live with me.

The atmosphere was great... and oh man! The DESSERT... Yes, apparently raw vegan desserts do exist and  they were so delicious I can't even conceptualize how you can make raw vegan brownies and pecan pies but they are incredible.

Unless you like super busy/ or meat filled food it's a great experience, even for a non-veggie like me."}
{"text":"It's a hot Friday evening and I feel like raw food so I find myself trying Rawlicious in Bloor West.  

Ordered the vitamin see and pad Thai.  The juice was a delicious and fresh mix of carrot and ginger.  Pad Thai was a generous mound of zucchini noodles but not very much kelp.  It was okay but I prefer the version at Raw  Aura in Mississauga.

The chocolate banana cheesecake looked gooood... Next time ...."}
{"text":"The staff was very nice! And you MUST try the green salad and the pad thai! Especially the pad thai. 
The hot chocolate was pretty good too. I also like how it's so close to High Park!"}
{"text":"The food is uncooked at Rawlicious, but I think the restaurant is actually named after its service, as well as the condition your feelings will be in after you experience it. As noted by others, the servers are consistently suuuuuper cold and rude for no apparent reason. I guess I would be too if the only pasta I ate was made of zucchini.

I kid! Sorta. A hippie at heart, I love raw cuisine done well. TIP #1: Live Organic knows how to make it tasty, hearty, and creative - go there. Sadly, the food here is blandlicious at best. No excitement, no inventiveness, and above all, no flavour. On top of that, it's all served with a permafrown. The prices are about the same at Live, yet I always leave Rawlicious feeling raw-bbed.

I've gone a few times because of proximity + an assumption that I'd caught the staff on a bad day, but no. My last lunch there (half the menu unavailable, a snippy server as usual, and the world's grossest, wateriest $10 \"Superfood Smoothie\") will be my LAST last. TIP #2: Fresh knows how to make smoothies tasty, hearty, and creative - go there."}
{"text":"Great place! I had no idea how delicious vegan food could be, I loved the quesadillas! Really good place."}
{"text":"I couldn't tell that it was a vegan restaurant! Really amazing!! I loved the Green Apple juice. The quesadilla was my choice for lunch and it was delicious! Great atmosphere and nice waiters."}
{"text":"The bolognese was delicious and incredibly filling!  For only one employee preparing and serving, the service was prompt!  I was impressed!  The chocolate cheesecake was divine as well."}
{"text":"I went to Rawlicious because I like trying new types of cuisine, I was curious about the whole 'raw food' thing, and I have a dairy allergy that vegan/vegetarian places are usually really good about. Although I won't be going back regularly, it was a great experience and I had a pretty good meal there.

I had the zucchini pasta, which was surprisingly filling; I could barely get through it all. My friend had one of the sandwiches, and from the taste test she gave me, I liked her meal more. We both had smoothies and enjoyed them.

The desserts however, were worth going back for!!! Especially because they were dairy free! My friend and I shared a cheesecake (not real cheese so I could eat it with my milk allergy!), and a chocolate brownie. YUUUMM"}
{"text":"Very friendly staff and really delicious food! Enjoyed my experience trying raw dishes, and I felt great afterwards. Definitely coming back to try everything else on the menu."}
{"text":"The decor was very calming and the space was nice and open. It wasn't a big place but it was perfect, I felt very cozy and I loved the art all along the walls. Our server was a very nice Australian man who gave us excellent reccomendations and service! 
The food was DELICIOUS. It  was my first time ever eating at a raw restaurant and I have to say It inspired me to incorporate more raw into my diet.  Overall awesome place, good vibes, great food."}
{"text":"I'm not a vegetarian or vegan but this place looked really cute and interesting that I wanted to give it a go. Their pad thai wasn't all that amazing as I thought it would be from other reviews. But the sushi was delicious and the taco lettuce wraps? I can't recall the name of it, was so good! Not a bad option to have for those wanting this kind of food but it was quite pricey."}
{"text":"The portions here are pretty small, I love the idea aof vegan and raw food. Overall decent, the waiters know what they're talking about, the food is okay, it's quite expensive though and you'll be hungry an hour after."}
{"text":"Recommend the open face burger the date and ginger salad dressing is amazing. 
This is a great vegan place and gluten free the setting is cool   The price point is better than what u would find in downtown toronto.  

Negatives: The servers do not wear hair nets. But there was no hair in our food. The place looks very clean 

My number 2 vegan place in canada next to live in downtown Toronto. My number 1 place in the east of of toronto. 

I will be back !"}
{"text":"Couldn't be better. The food is super fresh and organic. The pairings are creative, desserts are amazing. Juices are fresh and made while you wait. I could eat here everyday!"}
{"text":"I came here as part of my \"I feel like being vegetarian for a few days\" kick that I get every month or so.  Everything is supposedly raw here, so I think that's great.  

Good:  Pad Thai was tasty and it was a fairly big portion and the presentation was very good. Ambiance is very homey, but in a good way.  Tables are cute.  They have a very limited selection of spices too.  

Bad: While the Pad Thai was tasty, I felt like I could have made this at home.  It was just kelp noodles, zucchini, some mayo and sauces.  It tasted like a salad and $15 is too pricey for a salad.  

Verdict:  I was hoping this raw food experience would open my eyes to new things, but it didn't feel like much of an experience.  It was \"meh\".  I was hoping a) To be blown out of my seat or b) To be totally disgusted.  I was neither.  Would I visit again? Maybe...not sure."}
{"text":"Finally hit the High Park Rawalicious location.  Beautiful interior with a grand piano tucked in the back.  I had the soft taco with a side salad and some yummy warm tomato soup which was delicious!"}
{"text":"The location of this restaurant is absolutely stunning and the interior of the place itself is beautiful. The staff are extremely friendly and helpful, and the food is delicious. After going to Apiecalypse Now! on Yonge and Bloor in Toronto the day before, my boyfriend and I wanted a healthier vegan meal option and this place delivered. The portions might seem small, especially if you're used to eating bigger meals, but they are hearty and will fill you up just fine. We had the nachos, the \"chicken\" sandwich with kaleslaw and the raw burrito, and they all had amazing flavour to them. The cherry on top of it all was the so delicious salted caramel brownie, which I could eat every.single.day. Prices are a bit high, but that's what you get for eating raw, organic food that's worth it."}
{"text":"Wonderful, real food place! A big choice of main courses, salads, desserts. A happy place for a conscious eater, where you don't have to be asking questions and think about ingredients, as everything is organic and fresh."}
{"text":"It was my first time here - and I've eaten at their previous Bloor West Village location years back.  Great raw cuisine!
Today was a first peak to meet the owners and meet a community networker.  Great French press coffee, and a great vibe for a quaint spot.
I'll have to get back for a proper meal!  Angus and Chelsea (the owners) are delightful, be sure to say hi."}
{"text":"My experiences (yes, more than one) of Rawlicious have been nothing but pleasurable!
The second I walk through the door I am hit by this amazing aroma that lingers with me, I am greeted warmly by the staff, and my needs are met immediately.

I love the open design of the \"kitchen\" just behind the counter and the food is prepared and made right in front of you, so you know it's good!!

The meatloaf with cauliflower mash on the winter menu is absolutely amazing! There are no words for it. The nori rolls are high on my list of favourite foods.

And, my god,  how can I possibly forget the chocolate dipped macaroons (vegan of course). My favourite of all the food in there. I could eat a hundred of them and be content with my macaroon filled belly!

I always find the servers to be super friendly and often up for a bit of banter which is great fun and really adds to the atmosphere of the place.

By the way, I am a proud omnivore but I would happily eat here again and again!"}
{"text":"My husband and I decided to check this place out on the basis of the reviews, and we went on a Sunday night.  The place was packed and the overloaded staff was running around; visibly stressed out.  There wasn't even a system in place for a wait list.  We thought that if the place was that overloaded, they should have put a sign on the door to that effect.  They seemed understaffed as well.  I once worked in a raw place in Chicago, and raw prep is always demanding.  It seemed like they had two people doing prep!  Raw clients are always forgiving.  If the food costs this much, they should hire more people for the busy nights.  The place needs a system for busy nights;  and reservations should be allowed for smaller parties.  This gives me even more disdain for raw restaurants, because the management takes advantage of the novelty of raw foods, as well as the assumed patience of the clientele.  My husband was going to write a harsher review, but there it is."}
{"text":"My wife and I ate at Rawlicious (Junction) today.  So impressed!

Starters:
- spring rolls
- Olive-Currant-Nut and Seed salad
  - balsamic and ginger date dressings on the side

Entrees:
- Rawitch
- Pad Thai

Desert:
- cheesecake
- chocolate brownie

Everything was raw (perhaps dehydrated), organic and unbelievably tasty.  Really, so good!!!

The spring rolls, while still good, were perhaps the weakest point of the meal.  They were kinda ordinary, tho the marinated veg interior was flavourful, they just didn't stand up to the rest of the meal.

The salad was a mixed greens base with a very flavourful topping. Both dressings were very good, tho I preferred the slight sweetness and bite of the ginger-date.

The Rawitch is build upon dehydrated onion \"bread\" and is very generous. The Pad Thai is on kelp noodles (0 calories) and has a nice balance of flavours. The kelp noodles, if you haven't had them, are a little crunchy, a nice texture.

The cheesecake was very light and had a wonderful lemony zing and a raspberry coulis.  

The chocolate brownie was intense!!!  So rich. So good.  Could easily have been 3 or 4 deserts :)

Will definitely, definitely be back."}
{"text":"The special pasta bolognese was huge and fabulous. Marinara, pesto and neatballs on pasta made for a delicious meal. 
The salads are pretty decent but I would get them with the pasta bolognese as the salads are very large and so is the pasta. 

I can't rave enough about the strawberry tarte. Absolutely sumptuous.  It tasted so perfect that I could not believe it was raw. I would get that dessert over any other non-raw desserts in a heartbeat, that's how good it was. 

Avoid the lasagna special at all costs. It's mostly salad with a small square of raw lasagna which is by no means filling.

They also have this great winged armchair in the window that is really comfortable if you're just there for a snack and a drink. People bring books and lounge there as they nibble away."}
{"text":"Move over Fresh, this is my new go-to! 

Yesterday my father and I hit Rawlicious for the first time and we shared the most sensational, vibrant, flavourful meal possible. We hit the Junction location and it was so cozy and inviting. Really charming. The food - sensational! 

We started with the nacho platter to share which was a generous sized platter of raw \"chips\" served with a fresh tomato salsa, guacamole and an amazing coconut sour cream. We loved it! I wasn't sure how much I wanted to eat for my entrée since I intended leave room for the raw desserts I'd been craving, so we each ordered a wrap. My father had the taco wrap and I had the caesar wrap. I secretly wanted the taco wrap too but thought I should order something different and boy was the caesar wrap good! It came wrapped in a collard green which was super cool and the nut loaf and dressing inside the wrap were so flavourful. I'll be hard pressed to try something different on the menu the next time because I'm looking forward to having that wrap again. 

Finally dessert... this is what desserts are meant to be. I follow several raw dessert blogs online so this is the part I was really looking forward to. I had the cheesecake which was a chocolate mint, and my father had the pecan pie. Wow. They were both incredible. The cheesecake was so smooth, velvety, rich yet light at the same time. Absolutely fantastic. And the pecan pie was rich and sweet on the bottom with the wonderful crunch of the pecans on top. A very generous portion and completely yummy and satisfying. 

What really floored me was the price. All this plus my beverage for $54! It was a real feast, and could easily have been priced higher and been worth it. I can't usually get out to the Junction so I'll be hitting the Yorkville location next time, and regularly I'm sure. Go check it out!"}
{"text":"I think my experience going here as a non-vegan and a vegan is very different. As a non-vegan, it's a 'healthy' meal that I am splurging on and to take cute little pics of and then brag to all my friends that it is sooo cool and cute and that I might think of becoming vegan because of rawlicious. As a vegan, I shake my head at the high prices and the small portions. I still think this place is so cute! Main street is my favourite and rawlicious is like a tiny home. 

Now before you come here, you must remember- this is not just vegan food. These are meals for raw vegans - as definition claims: \"Raw veganism is a diet that combines the concepts of veganism and raw foodism. It excludes all food and products of animal origin, as well as food cooked at a temperature above 48 °C (118 °F)\". Even some vegans cannot commit to the raw life because of the lack of food you can eat. I go here now as a committed vegan and I'm not as about it as I was. 

1. The portions are tiny, and you know if you are vegan, you need to eat more to be full, stay full and not end up binging on something after. (Which is exactly what the carnivorous bf did as he practically sprinted down the rd to pizza pizza shortly after). Eating a vegan meal does not mean I eat like a bunny. I carb the f up, which is hard to do when the portions are tiny and real pasta is replaced with spiralized cucumber, which can only pass as an app. (carbs are your friends, no matter what your magazines tell you!) 
2. No matter what the claim is about how expensive the ingredients are, and how organic and local they are- it is so not worth the price! I make food like this every. single. day., probably double- sometimes triple, the portions with organic ingredients and I stay full for probably 4-6hrs after? After finishing their wraps and other shenanigans, I became hungry an hour later.. 

I'm not saying raw veganism is bad, it's not for me. Not being able to cook real pasta instead of replacing it with a veggie? Not for me. CARBS ARE LIFE. Go on youtube and search up 'what I eat in a day: raw vegan' and you will literally see a girl that ate 10lbs of romaine lettuce wrapped with some dates. Even raw vegans know carbs are life.

I left here feeling undercarbed and unsatisfied. (with the food, not the service - the servers here are amazing) The problem is, rawlicious is a chain made to commercialize vegan food to non-vegans, and that's how they get away with charging them oh so much. If you charge people that much, please consider giving them more for their money.

Will I come back here? Maybe if a friend drags me for a 'detox'. But I'll definitely eat beforehand."}
{"text":"I love Rawlicious! When I used to work in Yorkville, I would always have lunch at Rawlicious at least twice a week. There service is genuine and friendly, the food is as good as raw vegan gets, and the aesthetics is always perfect from location to location. 

The only negative I have is that it is on the pricier side, and although it is a smaller franchise, during busier times it does take longer to get the attention of staff, or receive food. But, if you are in a hurry they do usually try to help you as quickly as they can, especially since they have to make the food on the spot! 

Other than that, it is an amazing restaurant, and my meat-loving friends did like the options here too!"}
{"text":"I have been wanting to go to Rawlicious ever since their sign first went up. Can you believe that was 5 years ago?! Yes, it took that long, well because i like meat in my meals and it's not somewhere i can take my kids because my oldest has a nut allergy.  It is so close to where i live and i love trying out new restaurants in my area. I am not vegan nor am i a vegetarian, i love meat, but I also enjoy days where meals are meat-less. I read a lot of great reviews and i have never been to a vegan restaurant, so i wanted to try it out. I made a lunch date with my niece who is vegan. I had no expectations about having a perfect vegan meal or even a horrible one. We arrived just before 12, the only ones there. Upon walking in, I Immediately i fell in love with the warm cozy decor & seating. Rustic, very inviting and set up in a way that i knew that my time there wasn't going to be short. There were 2 women in the kitchen busy prepping.  As soon as we walked in, they made a point of stopping, saying hello and welcoming us in to choose a table wherever we wanted to sit. We started off with smoothies. I had the Creamsicle (Nutmilk, banana, avocado, orange, vanilla, agave) OMG - it was so good, if not for the $8.50 price, i would've grabbed a 2nd or maybe even a 3rd lol! But, i wanted to leave room for my apps & entree. For my appetizer i ordered the sweet potato fritters ($7.50). It comes with a delish chiptole mayo. I liked the fritters, but i didn't love them, simply because they were hard and very dry. The chipotle mayo helped, but the fritters crumbled apart in so many small pieces each time i took a bite. By the time we had finished our apps, i noticed that the restaurant had filled up and several people had walked in to order take out (smoothies and/or food). As busy as it was, our server was excellent and checked on us a few times to see how everything was and asked it we wanted to order anything else.

For my main, i had a really hard time deciding because everything sounded so good! I finally decided on the Pad Thai ($15). Our server asked me if i was a fan of spicy or mild and offered to put the hot sauce on the side. Not a traditional Pad Thai by any means, but if i was ever going to have a vegan pad thai - Rawlcious would be THE place to have it! Zucchini & kelp noodles, shredded romaine lettuce, carrots & bell peppers with a tangy Thai sauce garnished with green onions & crumbled cashews (i did add the hot sauce and it gave the meal a perfect little kick!) After the smoothie, appetizer & entree, i wasn't hungry at all - vegan food done right!  i can't wait to go back to try out more of their menu."}
{"text":"It's often been my experience that any name ending in 'licious', usually isn't.  But in the spirit of keeping an open mind, and upon the recommendations of friends, I went for lunch at Rawlicious.

I wanted to like it - I really did. The little restaurant itself is delightful. Thoughtful, airy, intimate, with lots of  jewel-like pillows on the floor, And the patio is even better - truly a beautiful little oasis in the Junction. Even our waitress was lovely - and made it clear that we could take all the time in the world, and that we were most welcome to sit forever.

I order the Zucchetti, and it was so beautiful. Green zucchini noodles in a big white bowl, tossed with basil and Parmesan. My friend ordered a Taco Salad, a gorgeous array of vegetables, avocado, and refried beans all lovingly presented.  After the first bite I was impressed by the freshness, but after three more bites I was bored. I missed the warm savory deliciousness I associate with pesto. This was bland. Texture outweighed taste. And my friend's dish - though gorgeous -  didn't have the variety of flavours I like in a salad. The beans weren't bean-a-licious at all! They were dull and nutty.

Let  me point out that I'm not a vegetarian. I dabble in chicken and fish, but I do love vegetables, and I've been to vegetarian restaurants that were completely satisfying. Unfortunately Rawlicious just isn't for me. Well presented? Certainly. And beautiful, without a doubt. 

In fact everything looked lovely, but not necessarily delicious. Perhaps they should just call it Raw-eautiful instead."}
{"text":"This is the first time i ever went to a pure vegan restaurant.  As a person who loves to eat meat, I wasn't too sure if i can handle vegan food, but since a good friend wanted me to try, I decided to go.

Rawlicious Markham is located on markham main street and on a Wednesday night (Day after Canada Day), the street was really dead, so I managed to find a parking spot just on the street, otherwise, there are lots of parking behind the restaurant.

The moment I walked in, i felt very comfortable because the setting of the restaurant reminds me of a coffee shop and the waitress immediately greeted me with a big smile.  Tables are all made of wood to create a very natural and relaxing environment.

We ordered Green Apple Juice, Nori Rolls, Taco Wrap, Soft Taco with Side Salad, Mint Chocolate Ice Cream and Cheesecake.  They all tasted great, but I especially loved the Nori Rolls and the Taco Wrap as I really enjoyed them although I have never ate this much vegetables in one meal!!  The Mint Chocolate Ice Cream was delicious and special, because the owner said they do not use milk or regular sugar, everything is made with \"health\" in mind and I was quite surprised with how good the ice cream was!

The Taco Wrap is actually wrapped in a BIG collard leaf, with seasoned nut loaf, guacamole, romaine lettuce, salsa & almond nut cheese.

If you don't mind the slight premium on vegan food, this is a place you MUST visit, even for a person like me that likes his meat, I still don't mind coming here for a meal twice or three times a week!"}
{"text":"Very cozy and clean little restaurant. Came here on a late Saturday afternoon and there was a lot to choose from on the menu. They are a bit slow when it comes to serving the food but the taste made up for it."}
{"text":"Came here with my mother for a light lunch. We were the only patrons there until around the end of our meal. I ordered a coffee and the nori rolls, while my mother ordered a wrap (I can't remember which one to be honest). The coffee was fantastic. It's been a while since I've had coffee that had such coffee-ish integrity. The nori rolls were excellent as well. I imagine rolling sprouts and thinly chopped veggies cannot be easy but they were well done, delicious and served with a simple but yummy sauce. My mother's wrap was rather unwieldy, however, as it was wrapped in a giant collard leaf. The plate it came on wasn't very big, and as the wrap sort of fell apart when my mom tried to eat it the wrap's contents were going everywhere. She enjoyed it though, and she definitely got her daily vegetables! Our server was very sweet. It's hard to serve a table when it's the only one in the place sometimes (can make it awkward) but she seemed very genuine and helpful, more than willing to get us whatever we wanted. The decor is very nice-it feels a bit like a living room, almost too nice to be a restaurant. I got the superfood cookie to go for dessert which I did like, although I forget it on the table! Doh, haha. The food was good value and very enjoyable, but a couple points on ease of eating and flavour brought the rating down ever so slightly. I would totally come back for extremely healthy food in a cute setting."}
{"text":"I loved their vegan Cesar salad I think it is by far my favourite thing I've eaten here. I also recommend any of their drinks they're fresh and made to order and quite filling. I wish they had some better dessert options but perhaps it was just that there wasn't much left when I arrived. I think I will be back many many times for that Cesar though! Man was that good! Also a little on the pricey side :( healthy stuff usually is."}
{"text":"I wasn't as wow-ed by this place as I hoped to be. Maybe I had high expectations for someone who already enjoys vegan food from time to time. Other than that possibility I'd recommend Fresh http://www.yelp.ca/biz/fresh-toronto-6 over Rawlicious in a heartbeat. 

I had the warm pizza and my dining partner had the Pad Thai. The warm pizza was highly acidic, and granted the acidity of the toppings would typically be non-existent in a typical h-eatery maybe they should have skimped on a few of the stronger vegetables for the sake of my esophagus. The Pad Thai was pretty awesome, however. 

While we were here there were several other full tables and all of them were looking around frantically for waitstaff, who both appeared to be wholly disgruntled to be working there that evening."}
{"text":"I love this spot. It has a very positive, uplifting ambiance and is a great joint at which to conduct business meetings and catch-up sessions. Very quiet and peaceful place. Food is delicious (small portions and pricey though). You have to go in here knowing you're going to be eating whole foods that are raw and interestingly prepared. Their desserts are amazing! My favorite is the Key Lime Pie slice, as well as the Salted Caramel Square (made with dates and it's absolutely delicious)! The owner at this location is very friendly, answers any and all questions you might have about the preparation of the foods, and just generally sets a great tone for the place. I just left out one star because of the cost and the portions are relatively small (although to be expected with high quality raw foods)"}
{"text":"While I was going through a strict vegan and grain free diet (due to health reasons), Rawlicious was the only restaurant I discovered which served vegan AND grain free meals. Everything I had was delicious and the server was so friendly. Furthermore, when me and my friends asked him what kind of ingredients were used in certain dishes, he went into detail to explain exactly what the foods contained. Had such a wonderful experience."}
{"text":"Great menu,  friendly staff and even though part of a chain they are unique. Only a few items with soy otherwise everything is fantastic. Best raw restaurant in Durham!"}
{"text":"Was here earlier tonight.  Super fantastic!  Ordered the salad with currants and he \"pad thai\".  The decor was fantastic and the service was excellent.  
Since I'm mostly dairy free I had to try their ice cream.  Smooth and creamy like the real thing.  Definitely a must-try!"}
{"text":"Incredibly fresh and flavourful olive-currant-nut & seed salad with creamy ranch dressing! I go for 1 1/2 with a side of spring rolls and call it dinner! YUM!!"}
{"text":"I've dined here a few times, and my favourites are definitely the pizza and the \"pad thai\".  We've also tried their \"spaghetti\" - which was ok, and the wraps.  It's pretty good, and they make good smoothies."}
{"text":"The best thing about this restaurant is their pizza. Even though it's \"raw\" it's still really tasty and filling. The BLT is pretty good too, but messy to eat--definitely not a good first date food. 

I think you have to keep an open mind when you go to places like this, because the rawness makes it harder to fool your average carnivore. I've seen children at nearby tables take one bite, make a face and push the plate away, whereas in places where they cook the vegan food kids will have no idea that they're not eating chicken fingers or whatever the item is. 

The service here is slow. And when I say slow I mean I aged considerably while waiting for my food. I wish I could say this only happened once, but it's happened every time I've been there. I think it's because they make everything from scratch and there are only one or two people working in the restaurant at all times. If you have three or four tables, you do the math. It isn't pretty.

I'm happy to have this place open as an option, but it does not get my highest recommendation."}
{"text":"Very small space but very clean and simple looking. When I walked in, I was greeted by a really nice happy looking gentleman. He asked me how my day was and it was such a delight talking to him. He was so friendly and it made my day!

He explained the specials of the day and showed me how their favorite dish looked like. I'm saving the pizza for next time when I eat in. 

I got the cannelloni (made with zucchini strips) with side salad (garlic and lemon dressing) and the soup of the day (celery soup with crackers) ."}
{"text":"Beh! Another place I really want to like, but the prices are exorbitant for the miniscule amount of food. $10 for 2 little samosas? Sigh. Tried the tacos (ok, not great) and everything has a slightly bitter taste. Loved the chutney. 

Love the concept. Should try other things but prohibitive prices..."}
{"text":"Reminds me a lot of Naked Sprout in Burlington (which is one of my favs)
We both had the tacos wityh the side salad.

The salad was nothing special (just your usual mixed greens with a simple dressing)
the tacos on the other had had great flavor and were way better than I expected.
I just wish they had more options to their menu

had a nice time though"}
{"text":"I ordered a smoothie bowl to be picked up and it was amazing! The staff accommodated my specification of no avocado and it was quick and easy. Good price too."}
{"text":"I'm vegetarian and this is my first time at a raw restaurant. I had the Bolognese ($15) and the daily soup which consisted of zucchini coconut milk and curry ($6). The soup was amazing!!! I would go back just it. The Bolognese was just ok. The portion size was pretty big and i couldnt finish it. The dish was cold and a little bland, which I expected. However what I didn't like was that there was a little puddle at the bottom of my bowl which made the zucchini noodles in the Bolognese kind of soggy and not very appetizing. I enjoyed the first half of the meal before the sogginess. I tried some of my friend's chocominty smoothie ($7) which tasted delicious and I highly recommend it. He said the green goodness salad was just okay, and just tasted like a standard very leafy salad."}
{"text":"My friend and I were looking for a \"detox\" meal with less meats and came across Rawlicious at Markham main street. Service was good. We ordered two entrees for our visit and were still fairly hungry when we left hahaha. 

PAD THAI (2/5)
(Zucchini & kelp noodles, shredded romaine lettuce, carrots & bell peppers mixed in a tangy Thai sauce topped with green onions & crumbled cashews.)

More Thai sauce would make this dish much better! There wasn't much taste to this entree. If you like the original taste of zucchini and kelp, then this entree is for you. There isn't much sauce, so you're tasting the raw ingredients itself.

QUESADILLAS (3/5)
(Cashew cheddar cheese, crumbled nut loaf, salsa, avocado, & romaine lettuce in a red pepper wrap. Served with kaleslaw.)

This had a lot more flavour than the pad thai. I actually liked this dish in comparison. I'm a big fan of avocado and they added a lot of it within the quesadilla. The portion is very small though, the size seems to be for an appetizer instead of an entree."}
{"text":"Very unique restaurant with some fantastic food offered! It's a beautifully decorated Restaurant. Very rustic with the wooden floors and white walls and ceiling. It's open and spacious, very comfortable, and very homey. 

The server and staff are very knowledgeable about what they offer and the details of how it's all made. This is great for people with allergies or who are just plain curious. 

We ordered the taco wrap which was absolutely delicious! It's like a tomatoes salsa with avocados and lettuce wrapped up in a giant leaf. And inside they have a nut loaf made with peppers too to give it a huge hit of flavor much like a meat protein would normally do in a salad wrap. 

I had the pad Thai zucchini noodles! I love the zucchini noodles. It was more like a giant salad with nuts and a peanut dressing or sauce though. Not very pad Thai at all so it was not what I expected. Still good anyway and wonderfully balanced.

We had a very nice fresh juice which had beets, apple, carrots, and a lot of ginger. Really delicious but I really really would have loved it more if it was colder. Perhaps a smoothie next time then. 

And Ofcourse we ordered the banana cream pie which is recommended by other Yelper's! Really really good dessert. Lovely cream pie with coconut all through the pie. Crust made of almonds and dates which was actually very well complimented to the filling. We loved it!"}
{"text":"I came here with my boyfriend for a date night. We had a really nice time!

Good: atmosphere- it is cozy and comfortable. It feels like you are walking into someone's house. Service- very friendly. Shake- we shared the \"chocolate milkshake\" made with almond milk and avocado- super yummy!

To start we ordered the Nacho platter. It was good-fresh and not too heavy. 

For our mains my boyfriend ordered the Pad Thai and I ordered the special- a vegan \"meatloaf\" with BBQ sauce.  I felt that the Pad Thai, while looking beautiful, lacked the flavour punch that I was expecting ( I was envisioning more of the \"tangled Thai\" salad from Fresh, which is so tasty).  We were arguing about who should order it at first ,since we both wanted to, but I wanted to sample as much as I could, so instead opted for the special and I was glad that I did.  As for the meatloaf, it was tasty (mostly due to the BBQ sauce), but I was surprised to see that my plate was 75% salad. Luckily, the salad was delicious (the ginger-date dressing is awesome) so I was happy. 

For dessert, we had the brownie and the raspberry cheesecake. The brownie was the winner hands down- it had a coconut vanilla frosting that was rich and creamy. The cheesecake however was pretty disappointing and bland (they have an awesome vegan raw raspberry cheesecake at The Beet down the street that I am partial to I suppose). 

Overall, I like the feeling of this place. It is pricey however, which I am fine with, due to the high quality of ingredients, but the food itself was hit and miss. Perhaps by patronizing Rawlicious a few times we can figure out what the clear winners are stick to those- that way when the bill comes it won't hurt as much."}
{"text":"I liked the idea that everything here is raw and vegan. It's not for everyone though, I'll admit, and eating raw foods takes getting used to. I think it really depends on what you order! 
I had a \"pizza\" and it was really good! It's not hot and there's no cheese on it, but it was really flavourful and it was still salty enough from the sea salt they used. My friend on the other hand ordered a tortilla wrap and she wasn't a fan of how it was wrapped in collard greens, but she said she liked the sauce. 
Then we ordered a pumpkin pie to share. It had too much cinnamon in my opinion, so I would've probably ordered another kind of dessert."}
{"text":"Arrived at this small \"boutique\" restaurant with my dc around 7:30 on a Friday night. They did a nice job with this tiny place to make it homey. There were a couple other patrons when we arrived but it only took a couple more small parties to fill the restaurant to capacity.

The SERVICE was slow. It seemed to be a 2 person operation and though it's a wee tiny joint this clearly was not working as efficiently as expected. It took half an hour for our food to arrive and it was difficult to flag down the overly busy waitress for some water. As well when I asked to add a side salad to the entree (which as the menu denoted is +$4) I was informed they only could add a Caesar. I agreed to this, however they billed us $9 for a full Caesar salad.... Ok whatever.

The FOOD: we ordered the Angus burger with sweet potato fries, a Caesar salad, and the Pad Thai. 
The burger ($14) was served on a comically tiny, narrow rectangular plate with an equally small open faced \"burger\" on a nut/seed based bun. Yes it was dense, but the size of it all actually made us both laugh out loud. The coldness of the patty also detracted from the otherwise flavorful and unique burger. The side sweet potato fries however, were slightly chewy/sauggy chips with an uncomplementary, bizarre flavour, topped with a sprinkling of dill. No thanks.

The Caesar salad ($10) was the best dish of the evening and tasted perfectly flavorful with fresh romaine and a not too creamy tahini-ish dressing with just the right amount of tang. It included some salty textured bits (sundried veg?) that enhanxed the overall crunchiness and flavor of the salad.

The Pad Thai ($15) was a moderate sized bowl of raw veg. It wasn't bad, but it lacked any sort of zing, tang or even subtle spice. The Thai sauce was watery and the zucchini/kelp lacked any evidence of flavour. I think the cashews were a good start toward adding some much needed texture variety in this dish.

Overall I was not overly impressed with my experience here, however I enjoyed the guilt free food and respect the concept and inventiveness of vegan/raw meals. I certainly value the the merit in food purity and clean preparation and it just feels \"good\" to consume this sort of food. It was more pricey than it should have been however, I'd come back again for lunch. Toronto needs more of this kind of food."}
{"text":"Food was bad and service was even worse. Overpriced  for tasteless food. Will not come  back"}
{"text":"I went into Rawlicious today for the first time. The soup was good but should have been called  gazpacho. It was stone cold. The service was pretty slow but with good company it didn't bother me much. I ordered the pad Thai, which I have had at my other raw food restaurants. (it's actually my go to) I never send back food ever!!  I wish I took a picture of how sad it was. 3 cashews on top and maybe I saw 2 pieces of red pepper. Regardless of how it looked it tasted like nothing. Like honestly NOTHING. No seasoning ? No sauce? No veggies? Not impressed with my first visit. Feel Good Guru blows this place out of the water. Their pad Thai is incredible!!"}
{"text":"100% raw vegan.  Service was good, prices reasonable.

Taco Wrap -- 4 stars:
Seasoned nut loaf, guacamole, romaine lettuce, salsa & almond nut cheese wrapped in a collard leaf.
Unlike most raw wraps, this was easy to pick up and eat.  Mess free.

Ginger Love (juice) -- 4 stars:
Beet, apple, carrot, ginger.
Just the right amount of ginger.

My niece, who hates almost everything vegan, finally settled on the Nori Rolls:
Alfalfa sprouts, marinated mushrooms, avocado & fresh vegetables, with a dipping sauce.
She surprised me and finished the whole thing."}
{"text":"This Junction restaurant is one of the most interesting on the Dundas west strip. Funky art, big comfy chairs, a wicked middle eastern themed back room - basically, the vibe is West Coast chill. And this is obviously a huge draw. Here's the thing. I've been back a total of three times now. I love the staff. They're super friendly. And as mentioned I like the feel of the place. But I'm not organic bananas about the taste or price of the food. 

I had the Cesar wrap the other day and the green shake. The wrap was fun to eat; a giant cabbage leaf surrounding a raw-style-bean-and-tahini preparation. It was healthy. But the strength of the raw garlic and lemon, combined with the low seasoning made the dish somewhat hard to eat. Actually, I had to stop eating it. Though, the spring rolls were yum, with fresh tasting veg and herbs, and a nice peanut dipping sauce. My partner loved her wrap...

The genesis of this review comes down the fact I recently lunched at another raw spot in town. The feel of the place and the staff are great, as mentioned. But In the end, when I'm hungering for Raw food, I think I'll head to another spot."}
{"text":"Extremely disappointed with this place and unlikely to go back. My husband and I were looking for a healthy lunch option in our neighbourhood and had been wanting to try Rawlicious for some time. When we arrived the place was about half full and as we waited for our meal the place started to fill up. The two girls who were working were friendly enough and seemed to be doing it all but with very little success... hosting, serving and even cooking. We sat there for 15 minutes before one of the girls even came by our table to take our order. It then took at least another 10 minutes for us to get a simple glass of water. We had both ordered cold drinks from the menu... a lemonade and a fresh juice. Neither of which ever arrived. As we waited people kept coming in and we noticed that the take-out patrons were getting priority. We quickly became very frustrated as we watched patrons who arrived much after us being served. The steady stream of take-out customers pretty much occupied the two girls entirely which left us, among several other tables, just waiting and wondering if we were ever going to get our drinks or our meal. Finally after 45 minutes of sitting there and having only a small glass of water, we got up and left. We told the girls that we couldn't wait any longer. We got a simple \"sorry\" from one of them as we left and that was that. I wish I could rate this place for the food but we never even had the chance to try it. It is too bad because it seems like they have a unique place and obviously there is a big demand in the area, but they have a terrible service model that just doesn't deliver. We will not be back."}
{"text":"First of all, let me recommend Rawlicious. The Whitby location is more aesthetically pleasing and in fact comfortable and quite lovely for downtown Whitby which suffers from the shabbiness of many establishments that either have to go or be upgraded (to be more like Fergus, Stratford or Port Perry). Rawlicious is a welcome addition.

A new menu just started yesterday so a few new items and some replacements. The Angus burger is gone, replaced with a smaller version served with jicama chips and homemade catsup. Very good. More filing than it looks.

My wife enjoyed the Pad Thai, a staple. We were mixed on the samosas. I really enjoyed them and the mint sauce, my wife thought them a bit boring. I will here point I am not a vegetarian but she is.

One suggestion and I got the sense it would be better to post it here to see if other diners feel the same way. If the management changes or thinks I'm wrong please post here and I'm happy to change my review. Suggestions if you will, for them to improve. 

The woman preparing our food has long blonde hair and it was not tied up in a bun or did she use a hair net. Unfortunately she also touched her hair quite frequently while preparing a meal. This is unhygienic and unacceptable.

That said, we will be back. We hope to see more hygienic practices as we enjoyed the food and the service."}
{"text":"I liked their Junction location the best before they moved. Their food just seemed more fresh especially the Rawitch crackers before they turned into a franchising store which they're  now in New York. The sandwich just seems to keep getting sweeter too- oversaucing it.  I like this place but  it's over priced and I never really feel satisfied. I do enjoy they're smoothies. What kind of raw vegan restuarant  offers iceberg lettuce? It has no nutritional value in it. Overall it's okay, I do end up coming back."}
{"text":"To be honest, I can't believe I'm the first person reviewing this place! It's such a great veggie restaurant in a great neighbourhood!

I was a bit weary ahead of time (I'm a lover of meat) but went in with a bit of a cold looking for some veggies to boost my immune system. I was instantly comforted by the laid back decor, and incredibly friendly staff (no hippy-diva attitude here!). 

I ordered a basic salad, which was HUGE and filled with beautiful fresh avocado, tomatoes, red peppers, cucumbers and various greens topped with poppy seed dressing.

They also sell a variety of smoothies, although their tea selection is a little lacking (I really felt like a tea to go, but they didn't have many caffeine free options). But, all in all, I'd highly recommend this place to anyone (meat eater or not)."}
{"text":"LOVED the Nachos and the corn chowder, happy to know they serve warm soup in the winter months. Also ordered the Pad Thai, loved the zoodles, but wasn't a fan of the sauce/dressing, had to ask for hot sauce which is pure habanero peppers, lots of heat and flavor. For all raw Vegan, it's not bad."}
{"text":"I've never had vegan food before but a friend and I decided we'd venture out and check out Rawlicious. 

The atmosphere was light and inviting. There was a man (with a pretty sweet accent) who greeted us immediately upon entering. We sat down right in front of the kitchen so we could get a better view of what goes on in there. 

He gave us two menus and came back 2-3 minutes later asking if we had any questions. Points for that considering we were pretty lost. My friend has peanut allergies and our waiter took extra care in explaining what nuts were in what and what she could have that they would be able to omit nuts from. We decided to order the Tropical Green smoothie and the Strawberry milkshake. We also ordered the nachos to share. 

The food was prepped by a young woman and the waiter made our smoothies. We received our drinks and food about 8 minutes after we placed our order. 

The Food:

The smoothies were delicious. Only downside was that they were pretty room temperature. Not sure if that's normal but it was still delicious. 

The nachos came with sour cream (friend did not eat this since our waiter said it had nuts in it), salsa and guacamole. The three dips were really good. The nachos were interesting. The taste kind of reminded me of South Indian dosas, except baked. Kind of odd, right?  

Pricing is not the cheapest but worth a lunch out here and there. The atmosphere was again, really nice and inviting and the staff were super friendly. Regulars walked in and out throughout our meal and they all seemed to have a pleasant relationship with the staff at Rawlicious. 

Although I don't suspect I'll be turning complete vegan anytime soon, I'm definitely looking forward to going back and checking out other things on their menu."}
{"text":"Best vegan restaurant! 

Must try the Nori rolls, Pad Thai and taco wrap. These are always my go too! You must try their salted Carmel square dessert. It's to die for!"}
{"text":"I love dense, walkable old Toronto neighborhoods and the Junction area of Keele and Dundas is a hidden gem I've just discovered. There are many old shops and up and coming original restaurants.

I selected Rawlicious for my birthday dinner because I thought it would be original and healthy, and it had good reviews on yelp.ca. However, I declined to read the reviews carefully, and really think about what the title implied.

Rawlicious is truly a restaurant for people with open minds.  It possessed a clean, modern and casual decor.  For example, there is one table near the window with cushions instead of chairs to sit on.  Cool! 

But it's not until you have a good look at the menus that you realize you're not in Kansas anymore. It all begins with a smoothie section with many interesting flavors.  I ordered chocolate mint, and my wife had raspberry.  They were fantastic!  We saw several couples pop in and order smoothies to take away.  

The rest of the menu contained a subtle central theme.  No meat, no cheese, and though I didn't see it explicitly stated anywhere, everything is RAW!  

Yes, a disclaimer might have been helpful to stupid people such as myself who can't put 2+2 together.

The menu consisted of things like salads, but then there was an entrees section containing meals such as Pad Thai, and Pizza; foods that tend to be customarily warm.

I ordered the pad thai and my wife ordered the pizza.  The food arrived a very short period later, far more quickly than usual.  Hmmmm...

The pad thai contained diced up yellow bell peppers, noodles, and other diced up veggies all covered in a bizarre yellow sauce, and sprinkled with a few cashews.  My wife's 'pizza' was more of a flatbread covered with salsa with some random raw vegetables on top.

At first glance, everything seemed... fairly normal.  It did look like pad thai afterall.  But the realization that everything was cold hit me like a bucket of icy water in the face. 

The best I can describe it is that it was like eating last night's left-over pad thai straight from the refrigerator the next morning after covering it with a salad dressing.

I took one bite of my 'pad thai' and felt nauseous.  It wasn't because it tasted repugnant exactly, but rather it was just such an odd sensation.  Pad Thai is hot, or at least warm! This was... something else...

I must have squirmed around, making all sorts of funny faces, like a little kid forced to eat Brussels sprouts for the first time.  

But hey, I'm an adult now.  This is my choice, so I had to live with it.  I took a few more bites thinking \"This isn't so bad... I guess I can handle it.\"  After all,  I'm cultured.  I'm a renaissance man!  Look at me in this Raw restaurant!  I was proud.  

But somehow the nauseous feeling would not abate.  I pushed the plate away, leaving about 85% of the entrée untouched.  I couldn't do it.

My wife finished her pizza undoubtedly thinking I was a spoiled brat.  Considering it was my choice of restaurant and she wasn't enjoying it either. 

I will justify my behavior as follows: I'm of the opinion that we should be selective about what we put into our bodies.  Once upon a time, I used to be ignorant of nutrition and saw the gut as a type of void.  I honestly thought you could put just about any food in any quantity into it, and it didn't influence too much how I looked or felt. 

 But about 5 years ago I underwent a dietary revolution, and have come to believe in eating nutritious, tasty and fresh foods whenever possible.  I won't force myself to eat things that are excessively unhealthy, or taste very bad just because it's there.  I'm an adult now.  If I don't like how things taste or make me feel, I'm not eating them.  

The server came to take the plates away, and asked \"how everything was\" with a cautious look after she felt the heft of my uneaten food still remaining on the plate.

I was honest with her. I said \"we'd never tried raw food before, and weren't prepared for it at all.\"  She was polite and seemed like she'd seen similar reactions before.  We paid the bill and left.

  After grabbing a Mars bar from an adjacent convenience store, and my blood sugar level began to normalize I reflected on the meal with my wife, who was by now complaining of indigestion.  

The whole experience reminded me of going to church.  Not because the restaurant was trying to convince you of anything in particular. But it occurred to me that some people must eat this type of food all the time. They must have strong beliefs, and a tendency for self-deprivation.  Plus, the whole experience left me with a bitter taste in my mouth.  

Yes, just like church.

What struck me as most odd was the poor nutritional composition of the meal.  No proteins, no fats.  As we all know, this is a health-conscious age we're living in.  Fads like this are popping up all over the place under the guise of good health.  We must be careful to examine if something is actually healthy or just claims to be."}
{"text":"Love the healthy food selection here!  When I'm feeling like a super healthy meal I come to Rawlicious.  Everything is made fresh, organic.  Smoothies, juices, salads .. all nutritious stuff.  They change their menu according to season.  Staff is super friendly and helpful.  Plenty of parking at the back."}
{"text":"We hoped to get a great breakfast at Rawlicious. We ended up with a huge bag of take out food which was awesome. So the 5 stars are for the awesome food I want you to try. The service at Rawlicious wouldn't get a star from me at all. 2 people couldn't put our food together in under 2,5h even I told them we need to be at the airport soon & would love to take nice pictures for the review. 
For review with a video please go to http://rawismyreligion.com/gourmet-raw-day-in-toronto

We had the unbelievably good Taco Wrap ($9.50). I never had such a delicious collard leave wrap before. Usually, once you have a leaf wrapped around and greens inside, it's hard to make it taste like something else than a salad. But here, the taco meat was so awesome, and the cheese rich and creamy, it was as far from as salad as it could possibly be! If i didn't know it was raw vegan, I would assumed it's real meat and couldn't eat it :) It's by far the best collard leaf wrap I've had so far. And even better than the taco wrap I had later that day at the other place.

This pizza ($10) was a special, so glad I saw it smiling at me from the dehydrator. We ate the pizza on the plane, I know, things taste better on the plane, and this pizza tasted so good. Definitely something I would get the next time and will try to recreate at home. Such an amazing idea to use pesto as a pizza sauce.

We had to eat these Herb & Onion Flatbreads ($10) right in the car. They smelled so good and tasted even better! I could swear they tasted like the best Tarte flambée I've ever had.The crust was great, the nut cheese creamy. The Onion, OMG! Maybe the dill was a little too much. And I love dill, but not a whole bunch on a tiny piece of pizza.

Quesadilla ($15), not a fan. It was pudding like, the wrap gave up on me completely 2h it was prepared. The coleslaw was between fresh and pickled, not how I like it."}
{"text":"They have amazing smoothies and the place is great for intimate date-style encounters. Nice staff, clean, quiet, trendy, seldom busy and all vegan healthy food."}
{"text":"I finally checked out Rawlicious! It's such a cute location with a homey vibe inside. Actually, it feels like you're in someone's house... and I sat out on their patio. I'm a vegan but not a raw vegan. I do enjoy experiencing raw food especially at specialty raw-restos. I can't make the dehydrated crackers and \"breads\" at home so I enjoy eating them at places like this.

The highlight of my four course meal was the special. It was curry crackers with cashew cheese and a mango current chutney! It was so good and I think they should just add this to the regular menu. I even over heard another table tell the waiter this. 

The disappointment of my meal was the sushi rolls we had next. They didn't come with any of the ingredients it said were in it on the menu... no mushrooms, no avocado, and the worst part is there was like a teaspoon of WASABI in each piece! UGH. Wasabi was not mentioned anywhere in the description.We returned them and the waiter gave us the cold rolls instead. SO I guess that means I really had a five course meal! The cold rolls were pretty standard but the tangy peanut sauce they came with was delish. I could have eaten it all on it's own. 

I also tried the zucchini bolognese with neatballs. It's a pretty large main course and I only ate about a 1/4 of it and took the rest home... to heat up in the microwave :/ I know! I am not a strict raw foodie so I didn't technically break MY rules. But I'm sure the staff at Rawlicious would be disappointed with me. There's just something wrong with eating really COLD \"pasta\". It's not palatable at all. The neatballs, however, are very good, warm or cold. I think they're made of almonds mostly but they have a meaty texture and great seasoning. 

I also HAD to try dessert and so I took home a chocolate brownie with vanilla icing. It was $8 so I was pleased to see how big it was. Kind of like a piece of cake. But MUCH too rich and sweet. It was almost like fudge. Of course I ate it over the course of 2 days, but I wouldn't eat it again. I have to say, having tried some other raw desserts in the past, they're just not the same as baked desserts. I find they often have too much coconut or agave in them to make up for the lack of decadence. 

Rawlicious is an experience and for anyone who is vegan or enjoys eating this kind of food every so often, this would be the place to go for sure. But I find the raw food really takes a toll on my tummy. It's hard to digest. I won't go into details but I had my share of problems that night! I also had a shit ton of energy and was like hyper sensitive to sounds... rather weird. That's the power of LIVE FOOD, I suppose. But maybe I just ate too much of it... perhaps I should scale back next time!"}
{"text":"Tropical green smoothy and a coconut macaroon to start the day. Soft tacos and a Ginger Love juice for lunch.. I feel clean and healthy."}
{"text":"If it's your first visit, share a few dishes just to experience different menu options as we found some much better than others (as a non vegan group that was dining in.) 
The soup of the day: celery (was surprisingly flavourful and a generous serving) 
Nachos: good, I guess as far as vegan, raw nachos. They went fast between 3 ppl so I guess everyone enjoyed them.
Nori Rolls: good flavour, decent size. I feel like they did need a bit of rice in them as the sprouts didn't cut it for me. 
Pad Thai: Delicious!! The flavour, texture etc. 5 star! A day later I'm still having cravings again. I would highly recommend (vegan or not)"}
{"text":"Healthy and delicious. I'm not even a vegetarian, but I can appreciate a good salad with ingredients that compliment each other. The salty olives and sweet dry currants made my non-meat salad very tasty. Kudos for not over-using olives as they are quite salty. The dressing is also not overpowering and yet make the bitterness of greens almost non-existing.
The cherry smoothie was exceptionally delicious, I was having doubts it was all vegan. It hit the spot with sweetness. I'm used to meat and carbs but I was full after my meal for good 3 hours.
Not sure why everyone complains about prices. $8 - 9 for a fresh smoothy is a norm, I was really full on the pint filled to the rim. $11 for a salad is how much you'd pay anywhere. I could only agree on the size of the salad, I would increase it."}
{"text":"I was expecting great things from this place because of the great ratings it had on Yelp. I was extremely disappointed by the food here. I ordered the Rawitch and it was delicious on the first bite. A few more bites in and I found it hard to stomach. That seems to be the consensus with my coworkers as well. There was something about the \"bread\" that made it difficult to eat more than several bites. Next, I had the pumpkin pie and I was really excited for it because it looked really good! I was let down again because the flavour just wasn't there. I understand it's vegan food, but it doesn't mean it has to lack flavour! I have to say that the staff here was very friendly and I wish I enjoyed the food because I really wanted to like this restaurant but my taste bud is telling me no!"}
{"text":"At first, looking at the menu, I thought \"oh my god I'm in a trap\". 

Vegan raw food? This can't be any good. 

Incredibly, everything is AWESOME. Even the \"pasta\" my husband asked. 
You see, I'm NOT a vegetarian - neither my husband. But we really enjoyed our night there and all the food we had. It's vegetarian food done RIGHT."}
{"text":"Went there for lunch. Interesting concept. I ordered the \"meatloaf with mashed potatoes\". There is no meat of course in the meatloaf and no real potatoes in the mashed potatoes. The meatloaf appears to be made from some crushed nuts, veggies, and beans. Texture was close. Taste wasn't really there, but it was good nonetheless. Interesting mashed potatoes --- appears to be made from some nuts, but it had a bit too much of a ginger kick to it for my palate."}
{"text":"After reading reviews about the Zucchini Pad Thai, I traveled from all across the Galaxy to make it to this place and try it out.

Staff were friendly, the setting has a home vibe too it with the rugs and wooden floor panels and the kitchen is right in front of you, so you can actually watch your dish being made with no shady things going on in the back. ;)

Would I make the journey again? Possibly. I haven't tried everything on the menu yet."}
{"text":"As a non vegan, non gf person, this place was not a good place to start the healthy experience. Menu was limited and prices were extremely high considering whatever you order will not remotely fill you. The flavours aren't bad, but when you are charging almost steakhouse prices, you won't be trying much items."}
{"text":"Not bad for a carnivore.

I visited this restaurant in June 2014 with some friends from work. Although I do prefer meals with meat bi/products, I was thoroughly pleased with my meal. 

I ordered the spring rolls, BLT, ceaser salad and blueberry cheesecake. The sauce given with the spring rolls were amazing and although the rolls are served cold, it was still very tasty. The BLT was also good. It was on an onion bread which I am dying to know if it's house made or if I can buy it in store. The BLT is served with kale chips which had a good taste - better than the store bought ones I've tried. Beware, the kale chips do get stuck in your teeth and the onion bread makes for a strong onion breath! 

The cheesecake was alright but nothing to die for.

However, my absolute favourite part of the meal was the ceaser salad. It was so freaking good. I don't know how they do it since it isn't made with eggs/mayo/anchovies but man; it is so strong in flavour. I am a fan of what I call a \"spicy ceaser salad\" and this one knocked it out of the park!

Regardless of the price (my bill came to $36), I'd return mainly for the BLT sandwich and the ceaser salad... and a millstreet beer."}
{"text":"It's good if you are a vegan/vegetarian. But if you're looking for \"meat\" don't come here."}
{"text":"After writing an email to the owners of Rawlicious, I was pleasantly surprised to  be invited back to a much-improved dining experience here.  The staff working during my visit yesterday were clearly quite focused and they did everything they could to ensure customer satisfaction.

I know that making raw food requires a lot of skill and time, so I don't mind paying a bit more for it when it tastes this good!  I had the raw samosas, pad Thai, and mint chocolate ice cream. Everything was superb!  The samosas were amazing; I could easily have eaten another 5 or 6 of them as a meal!

I will be back here again :)"}
{"text":"If you like food that tastes good, ignore the hippy/Vegan stereotypes you may or may not hold and check this place out. It's definitely my best Rawlicious experience yet! 

Service was superb and the food was exceptional. Presentation, quality, and taste hit 5/5 on all levels. It can get pricey - true - but you might find it well worth your while. Most of the food is labour intensive and requires a lot of preparation and skill (and magic)! The pumpkin pie is a transformative experience. The \"healthy food as punishment\" rule has no bearing here.

Quaint, simple decor makes for cozy dining. I hope I'll make it back in the summertime!"}
{"text":"I've only been here once, but I really liked it! I had the pad thai, and it was delicious and a pretty solid serving, especially for a raw restaurant."}
{"text":"I live near Detroit, Michigan and EVERY TIME I visit my friend in Toronto, he takes me to Rawlicious!
I LOVE this restaurant. The food is always wonderful, the people who work here are super friendly and the desserts are to die for! And the smoothies are awesome too! Especially the ChocoMinty.  
I have never been disappointed here and I will be back the next time I am in town.
Go for lunch/dinner and take home some dessert for the rest of the week while you are there!"}
{"text":"Enjoyed our time here. I wanted to try this the day of the Elite Holiday Paintlounge event. But due to traffic, we missed it. So long story short... here we are !

It was so interesting to see the blend of ingredients. This is really a wonderful place for vegans, health conscious, vegetarians. We came on a friday evening it wasn't very busy at all. So we had a nice quiet date night. Waitress was nice. 

We tried...
ChocoMinty - Contains nutmilk, banana, cacao, agave & peppermint. Had a nice taste to this and I liked that we weren't taking in too much calories whilst drinking this. 
Sweet Potato Fritters - interesting dish. The fritters were crunchy and a little hard to chew at first. It was definitely better with the chipotle sauce! 
Pad Thai - this is a popular dish at Rawlicious, but imho something was lacking...at least in the beginning, as we needed to mix the sauce more with the zucchini & kelp noodles better. This was a nice dish though but don't except it to be the traditional pad thai. 
Bolognese - loved the zucchini noodles with tomato marinara. I could definitely taste the pesto in there. Loved it! It was odd at first cuz this dish is normally cooked and I was eating this raw. Very convincing. I am definitely ordering this again next time

Can't wait to be back again! Would love to try their other drinks! Wish there was a location closer to us though."}
{"text":"One has to admire the chefs craftsmanship n culinary innovation
The food here came as a fresh awakening
The chef here ( who i think is Aussie)took the time out to explain what went in the food.
The quesadillas were made of mixed veggies dried overnight and served with an amazing cheese dip made out of cashews(never thought it was possible) all washed down with tall glasses of fresh juices.
The ambience is quite homely with an open kitchen
Never thought to see the day when a hardcore carnivore walked into a vegan joint only to come out satisfied n enlightened. This place has earned a new respect for vegan foods"}
{"text":"I LOVE the idea of this and don't get me wrong the food is good but if you are only serving raw vegetables combined in all awesome ways, the portion sizes simply must be larger!! I am a smallish woman under 120lbs and I'm sorry the entrees come nowhere near to filling me up!!

The food and flavours are great, I've been there before and I was just there on Sunday. I had the caesar wrap with side salad and my friend had the pasta bolognese. Both tasted great. However we ended up at  Not Just Noodles on Yonge street less than an hour later and split their veggie pad thai!! 

I wish there were more appetizer options at this place so perhaps an appetizer and a main might come close to filling me?

p.s the raw brownie = delicious!"}
{"text":"Cute little Vegan spot in main street with a relaxing vibe. I came with my sister today at about 230 pm and the place was pretty quiet. 
The lady working here was absolutely amazing, she was so so sweet, asking about how swet we liked our tea, offering to swap our plates and was just genuinely informative and happy to talk to us.
I really enjoyed my visit here and the food was quite delicious as well.
I'm not a vegan, but I do like to eat healthy when I can. Plus my sister is a huge gym junkie, so this was a good spot for her.
For lunch, we had:
The Revitalizer smoothie bowl 
This was not very sweet and was not too thick. I tend to like mild tasting smoothies, so this definitely suited my taste.  This is not a very thick and flamboyant smoothie, such as the berry booster juice ones. 

Nori Roll
This was super fresh, it is  pretty light appetizer, so maybe not if you are super hungry. 

Quessadilla 
bomb affff, this was the highlight. it was so so flavourful. The kale slaw was also really really good. I'm a huge fan of the cashew cheese that they make. this was so so so yummy.

Lemon Ginger Detox Tea
The lady was so sweet and adjusted the sweetness to our liking. The ginger was not too strng and the lemon was able to cut the sweetness well. 

Overall, i had a really really good time here. i would definitely be back to try the pad thai and the energizer smoothie bowl.

**they serve hot soup in the winter time**
**Minus 1 star because it is a slightly expensive place, for what many people may think is a small portion**"}
{"text":"I adore the owner, and go there each time I'm in town. I always get the zucchini pasta and the dessert Square with salted chocolate. I just wished they took American Express."}
{"text":"Hands down one of the best raw/vegan/gluten free/no refined sugar restaurants I've EVER been too. Not only is it a couple who owns it, but they are present EVERY DAY. These people eat and breathe what they create and are so caring and approachable. 

I visit every time I'm in for a work trip. I love the Zucchini Pesto Pasta; so much flavor and yet such a simple dish. You have to also try the Carmel sea Salt Square, not too rich, and always worth getting again. 

HIGHLY RECOMMEND."}
{"text":"I'm not vegan, vegetarian or a raw foodie bit I do try to have 2-3 days a week where I don't eat meat. 

I enjoyed dinner at Rawlicious last night. The service was efficient and friendly and the food tasty. I loved that as a Celiac i could order anything on the menu (restaurant eating can sometimes be a nightmare) We shared the beet dill ravioli, pizza of the day and the raw-wich. The ravioli was rich and flavorful as was the pizza. The onion bread on the raw-wich was a bit overpowering for my taste especially after the red onion on the pizza. I love the decor here. Most vegan/raw Resto's are either cafeteria style or just feel like a cheap diner with expensive prices. At Raw-licious I felt like I was out on a nice dinner date. I will definitely be returning!"}
{"text":"An inspired and unassuming spot, this raw trip went down well. Rawlicious may be more geared towards the Green Party of palates, but come on, carrot-on-a-plate stereotypes are hardly the case. 

The purpose of this outing was to catch up with a gal-pal, and so the small and cosy quarters were suiting. Pops of colour filled the space-- vibrant and with art. The resto's Victorian framework played on plush modern accents and tasteful upkeep. 

I was advised to skip the spring rolls (Kent P), and so the Zucchetti Pasta was my mission. Swirls of zucch dressed in fine basil pesto for $9? Absolute steal. My only hesitancy is that the wine (I ordered the house) was a little pricy for the weight of it. Perhaps this is the reality of organic wine? And maybe I'm just used to my own fishbowl glass at home. Le sigh.

Our server was a precious young lad who did a fine job-- attentive, endearing, and helpful in menu selections. This meal was an overall success, and I've told my friends. I will be heading back for raw dessert. I'll probably try the spring rolls too."}
{"text":"Perhaps lunch was the wrong time to visit, but despite the good food, this cavernous and surprisingly lavish place was dead when I popped in. The green apple juice (for $7.50!) was a nice refreshing starter. The zucharetti rose, which arrived as a big massive pile of zucchini \"noodles\" coated in a rose dressing and dried tomatoes were incredibly filling. 

Only being able to pay up at the till was strange in consideration of the fine art on the walls and the surrounding high end furniture. I also found that the \"As seen on TV!\" boxed vegetable peelers displayed in a pyramid at the entrance  conflicting as well. If I ever returned, it would have to be in the evening."}
{"text":"Great location, incredible vegan foods, and amazing service in a very casual yet elegant setting. Everything here is freshly made (from smoothies to pizzas dairy free deserts) Even if you are not a vegan, you are going to love this place!"}
{"text":"Love this place. It's delicious, the owner is friendly and the food is so healthy but still tastes good! The only down side is that the food is pricey, but other than that it is worth trying."}
{"text":"Located next to the Pilot on Cumberland street, Rawlicious is an adorably cozy little resto that also offers its raw foods to go.

Admittedly this in my first raw take-out meal I've ever ordered, but boy was it good.
If you'd asked me 20 years ago, if I'd eat raw food, I would have wrinkled my nose, told you to go eff off and eat your rabbit food while I chowed down on my Filet Mignon and duck fat fried potatoes...now that I'm much more careful about how I eat, I owe a great apology to all the health food enthusiasts I've dissed over the years as this here raw food is amazing!

I order the Taco Wrap which is Seasoned Nut-Loaf, Guacamole, chopped Tomatoes,  Salsa and Nut Cheese (it sounds funny, but trust, it's sooo good!) all wrapped in a big romaine lettuce leaf it was a little heavy on onion, but flavour wise it is excellent and surprisingly filling.

The best part is dessert as I order the pumpkin pie with ice cream to go.  I am told to freeze the ice cream upon reaching my destination, but the place I'm working that day has no fridge so the ice cream just sat there room temperature, but being a raw ice cream it lasted a pretty longtime without melting and retained it's vanilla frozen goodness, also the pumpkin pie is the BEST pumpkin pie I've ever had.

Sure it is a little pricier than your average take-out lunch, but for the quality of the food, and the fact that it is especially prepped to raw food standards, I think it's well worth it. The staff here are super nice and kudos to them for keeeping a down to earth, homestylish eatery within this most pretentious hood. 

 Yay Rawlicious!  You make healthy dining delicious."}
{"text":"I I had this restaurant on my radar for a while and was looking forward to trying it out. The pictures look so tempting. 

I finally got a chance to try it out. I had the pad thai and my friend had the flat bread. Both tasted very earthy and bitter. We didn't like it at all. We didn't even end up finishing the meal.

I had the creamsicle. It didn't taste like a creamsicle. But it was still tasty.

I have been to a vegan place out in Banff and it was spectacular. So it's not that I'm opposed to vegan tastes. The pad thai did not taste like Pad Thai at all. It was just bitter.  

When we tried to return the dish and the store owner asked us to take it home and still tried to charge us. We weren't having it. She took it off the bill and gave us a free macaroon.

I personally won't be returning."}
{"text":"I ordered takeout from Rawlicious last night and was unimpressed by the food. We ordered the wrap, Pad Thai and the spring rolls as an appetizer. The food was very bland and had a weird taste to it. The rice paper on the spring rolls also had a bad smell, like mouldy paper/dirty towel. I wouldn't recommend eating here."}
{"text":"I can't say enough good things about Rawlicious. I just wish they were more profitable to be able to open up more locations or start franchising their venture.

The food is absolutely amazing. It tastes great. It's freshly made. It gives you a boost of energy and doesn't make you sleepy unlike a typical trip to a Chinese restaurant.

The ambiance at the Markham location was calming and relaxing. The decor is minimalistic, classy and welcoming. The service is prompt and courteous. The girls working there are super friendly.

I'm not sure what one could find wrong with their food. The taco wrap, specifically, is my all time favourite. I could eat them every day and I wouldn't get tired.

Oh, and you've gotta try their cheesecake. It's dairy-free and tastes great. I'm a picky guy when it comes to desserts. I don't appreciate when restaurants skimp on quality ingredients and feed you crap. Rawlicious' cheesecake uses healthy ingredients that won't add to your waistline ;)"}
{"text":"How can you not love this place? The food is amazing and healthy. The staff is super friendly and nice. The decor is great. Even their washroom is better than mine. The owner must have put some thought into decorating the washrooms and having a proper hardwood floor in there. Ok, coming back to food. Seriously, this place is amazing. Their menu consists of only 2 pages, but they're packed with solid options. My all-time-favourite is the Taco Wrap. It's divine. A perfect meal on a hot summer day. Oh and don't forget to check out their vegan desserts...mmm

Now, stop reading the reviews and go have some food at Rawlicious if you're in the area. Even if you're not vegan / vegetarian, I doubt you will regret eating freshly made raw food. It not only tastes great but also carries a high nutritional value.

TIP: If you feel like having some quality tea afterwards, Bampot Tea House (201 Harbord St) is 5 min away by foot. You're welcome ;)"}
{"text":"Had a lunch that was amazing. Trevor the owner was most hospitable. So glad that it's a franchise. Have been looking for this type of a restaurant for a while. Well priced, awesome, healthy food that made me happy. I'll be making Rawlicious my lunch spot. 7 locations in the GTA will make that possible. Great concept, wishing Trevor and all the Rawlicious franchisees the best."}
{"text":"Over the last year or so, I have read a ton of articles, blog posts, and reviews about Rawlicious: a beacon of raw vegan dining in a mostly (and proudly) carnivore Toronto landscape. 

I finally managed to get to the Bloorwest Location today, and, as it wasn't really meal time, had to stick to a juice (beet, apple, carrot, ginger) and some vegan raw power cookies. The juice was great- it was clear the vegetables were fresh (and cold) and that the proportions were deliberate. I often find that ordering a similar juice from Booster Juice or Java Juice will yield a disproportionate (cost-based) recipe, rather than one created for health, taste, and \"texture\". 

The cookies were also great: not too sweet, and definitely chalk full of good-for you deliciousness. 

The interior was designed and furnished beautifully. You would never \"guess\" it's a raw vegan restaurant (being that the assumption is that nice fancy well designed and modern restaurants appeal to the masses and therefore serve meat or fish of some sort) 

I am excited to go back for a real meal ASAP."}
{"text":"[Good]
Clean food - Lives up to its name.  There's no cooking of any food here and everything on the menu is raw.  It doesn't mean taste is sacrificed though as everything is flavourful.  Without the added oils of cooking, the food here should be healthier.  I particularly like the taco wrap and caesar wraps as taste like they could have meat in it but actually don't.  I actually don't mind the food here even though I'm a meat lover.

[Bad]
Price - Items are priced ridiculously high considering there is no cooking involved and you are being served raw ingredients put together in a nice way.  The aforementioned wraps above are a few bites and cost just under $10.  Zucchini noodles are $16.50 and a plate of \"Pad Thai\" will set you back $16.  Add a drink or smoothie and you have yourself close to a $30 meal.

[Worth it?]
Nope.  Can't say it is.  I guess they charge high prices because it's vegan food?  It is tasty though and I will come here every now and then for a cleanse of sorts, but it definitely hurts my wallet each time I come.  I'd say try it once if you're curious but otherwise, feel free to pass on this place."}
{"text":"Every dish we ordered had their own unique twist in making typically non-vegan items, vegan. Everything tasted ok, but never did I really think anything tasted better than the non-vegan dishes. I prefer to eat healthy and love salads, so I didn't really mind the \"raw\" feeling of eating these dishes, but it's not really somewhere I would crave coming to have a meal. We ordered about $30 worth of food per person and I left satisfied, but definitely not full. The smoothies are good, but pricey in my opinion. All the servers were really pleasant!"}
{"text":"I got bombed on a Monday!! I got up at 7am, drank for 12 hours straight, did countless shots ate wings, hot dogs and chips and went to bed at 1am... I am a wreck! Borrowing from the pages of Pat B. I needed a detox and decided I would be nice to my body for one day and try Rawlicious.

I am currently sitting in this adorable place and feeling like I have just left Toronto's hot and sometimes hectic streets for a serene oasis far from stress (honestly I want to put on yoga pants right now, listen to Sigur Ros and just chill!

I ordered the special of the day: \"Taco\" Salad (which had a nice spicy kick) and the Tropical Green smoothie; both arrived within 5 minutes of my order. Both items were fresh and tasty leaving me (and my liver) feeling like we did the right thing! I like that they have tons of dessert options to choose from. The strawberry cheesecake was delicious without being overly sweet. I am NOT a vegetarian or vegan and like Renata R. I would agree that this is veggie done right!

The service was great. In addition to being super fast, my waitress was super sweet and cheerful (maybe Fressen should take note!) 

Honestly my only complaint would be that they play the radio instead of music... hearing the traffic report between songs isn't particularly soothing but I am honestly grasping at straws to find something negative to say because this place was awesome."}
{"text":"So glad to have stumbled upon this organic, vegan, and raw restaurant during my day trip to High Park. Rawlicious is a cute and sophisticated restaurant that is strategically located. Makes a great place for lunch for individuals or with a close friend.

 I ordered the \"chocolate milk\" (made of almond milk, cacao, agave, and vanilla), a taco wrap, and a superfood cookie. The meal was satisfying, filling, and delicious! Everything was extremely fresh. The waitress was super attentive and cool, which was a bonus! 

I definitely recommend eating at this place if you're looking for a healthy and unique meal in one of Toronto's best neighbourhoods. Keep it up, Rawlicious! Love love love."}
{"text":"Yaaaaaaaaaaaaaaaaaaayyyyyyy!! REAL FOOD! FINALLY!
I got to have dinner at Rawlicious yesterday and I am thrilled. From filtered water to organic everything I can eat at this place with total peace of mind. I don't have to ask if the juice is from the 'gun', I don't have to drink water that reeks like chlorine and I can indulge in a sweet treat without any guilt.

I shared a smoothie and appetizer salad with a friend, had a main and still had room for dessert. I do wish they had a little more variety on the menu; I appreciate them being gluten-free but if they used wheat they could have a few more options. Also I'd love to see them serving alkaline water, that would really earn them a full 5 stars.

Their decor is so cozy and nice, I felt like I was in the home of a good friend. I will definitely be going back to support this local restaurant."}
{"text":"Nearly inedible. We should have followed the other patrons and just ordered dessert. Sadly, we ordered the zucchini noodle pesto pasta and a taco wrap. What a disappointment! Everything was smothered in lemon juice. What little flavour was under that tasted like an amalgam of sewage and raw vegetables. Somehow they charged us nearly $30 for the experience.

We love raw foods and vegetarian/vegan food but Rawlicious was the worst food we've had in a long while. Foodies beware!"}
{"text":"\"Accidentally\" came across this one day when I was hungry.  I was not disappointed.   I especially liked the spring rolls and the tamarind sauce.  The staff was very friendly, the atmosphere warm and inviting, in fact it was the cosy space in the window that got me inside and it is a very comfy place to relax and eat.
Even if you don't normally eat raw food (I don't) I'm sure you will really enjoy it."}
{"text":"I went there with my friend. I got the Lean Green juice with extra lemon while she had the cannelloni. I quite liked the juice, it was tart enough for me. For dessert, I got a hemp seed bar, since I was looking for something low-sugar - I loved it! It was nutty and mildly sweet, just perfect. I will definitely swing by for another hemp bar with my friend soon!"}
{"text":"I dropped by Rawlicious for a taste of their infamous pad thai and bolognese. The service was impeccable, and we were welcomed promptly by the owner of the establishment. He explained the menu briefly and served us drinks. Heres what we got: 

Pad Thai: It tasted like a fresh salad. I enjoyed it, but I don't think it's for everyone. Very interesting approach, would not recommend if you want something with a stronger flavor.
Bolognese: This was absolutely delicious. Instead of meat, it used pieces of nut loaf (I think) and portobello mushrooms as its substitutes. It had an amazing flavor and honestly tasted like what you'd expect from a bolognese dish. I loved it, highly recommend this.
Creamy Celery Soup: This was fantastic, very hearty and full of celery bits. Loved it. 
Noki Rolls (I think, forgot name): This dish looked like sushi; it was avocado, fresh greens and other vegetables wrapped in seaweed with a soy sauce dip. I enjoyed it, very fresh and clean. 

Overall I enjoyed my experience at Rawlicious and would come back. The owner was very pleasant and we had a good conversation. Great place to hangout and eat a healthy meal."}
{"text":"Happened upon here while wandering around Toronto.  Had one of the sandwiches (forget the name, the one with sprouts) which was delicious (though not that big of a portion) and the Mill St organic beer.  Both were very tasty!  Definitely a bit pricey, but it's Yorkville and vegan food so to be expected!  Atmosphere was nice and wait staff was friendly.  Overall a good experience and would definitely come back again."}
{"text":"The food is incredibly healthy, and the staff are very nice. Ultimately, the experience was very pleasant but I found myself still hungry after a $15 meal, which may or may not be appealing depending on how you set your dining priorities. 

Pros? Good service, healthy, light, flexible hours
Cons? Small portion sizes, limited choices for protein, expensive

I ordered the nori rolls and almond chocolate smoothie which were both refreshing."}
{"text":"Came to check it out since there's not too many vegan places in Markham.

Food is nothing special but a little overpriced for me.  I got the vegan taco and it cost $9.50 and it's something you can make at home for a fraction of the price.

Even the other items on the menu were pricy.  Probably wouldn't come back."}
{"text":"Very tasty, but expensive. Considering this is a raw food restaurant, the flavours were amazing without need of \"heat\"."}
{"text":"Excellent raw food. Friendly service. I  can  recommend."}
{"text":"stopped by for lunch.  place wasn't that busy but owner and server looked like they had better things to do.  Had the falafel salad.  Had a strange taste but salad was reasonably fresh.  With a tea and tip the bill was over $22.  I was still hungry though so didn't feel this was very good value.  Likely won't go back because they weren't that friendly."}
{"text":"Great options! Excellent raw goodies and a handy addition to the 'hood."}
{"text":"I came here for the smoothies or juices.  The service was.... odd.  The girl was loud and a tad aggressive -- I can't think of any other way to put it.  The place was pretty busy but the atmosphere was relaxed, and people seemed to be enjoying their food.  It's a very small cafe and the menu is small but interesting, and they were advertising a new menu roll-out next month.  The smoothies are pretty good and are definitely healthy.  I'll come back as it's close to my work and I like the smoothies."}
{"text":"We had these groupons, and off a group of us went.  Pretty generous, given that they were letting us use 1 coupon per every 2 ppl and some coupons out there say 1 per group of 5 or what not.

I wish the location was closer, since I'd like to come here more often.

I ordered the tropical pizza special, with mango and pineapple, on a bed of pesto and \"cheeze\"/nut-based spread.  Side salad.  Ordered ginger date dressing but server couldn't tell the dressings apart.

Others at the table ordered the pad Thai (which looked amazing and was wolfed down before not too long), more pizzas, rawitch (a raw sandwich), and smoothies.  We left FULL.  We also ordered (between the group) raw nachos (they were actually pretty filling), and semi-raw rice noodle rolls and raw sushi.  

If I could go back, I'd go for the pad Thai.  Prob. I'd do w/out the nacho appetizer b/c after eating half of that, I was starting to feel full!

The smoothies that everyone ordered, all looked so tasty.  I didn't want to be even more filled up (sometimes it doesn't take that much)... so avoided one.

~~~
ambiance: very comfortable.  Although if you're over 5'7\" you might mind having to crouch down for the duration of the meal - we were in a back table, and sat on pillows rather than chairs.

We went to a nearby place for some tasty ice cream, partly b/c we all pretty much felt full after the meal.  Only one friend, did not feel full.
She doesn't eat garlic or onion, and we all learned that garlic and onion is in EVERY salad dressing, every pizza and sandwich crust, and nachos, there is.  She could only order an appetizer and smoothie."}
{"text":"I had been dying to try this place out for months! It's difficult finding vegan options at most restaurants so I wanted to try a place where I wouldn't be left hungry.
Our waiter seemed perpetually confused and was also constantly apologizing, but he was still very kind! 
We actually went through a couple menu items with the waiter but they told us that they had run out of those items. 
We ordered a pizza, side salad, and a dessert square. The taste was nothing amazing and I wasn't blown away. My friend actually hated the food, so I ended up eating most of it. The teeny tiny 2 slices of pizza were very forgettable and extremely overpriced. Those smallest two slices I have ever seen in my life were $12 if I remember correctly. The little square was extremely salty (just like me, writing this review) and I wouldn't have finished it if it wasn't so darned expensive.
Overall, I'm glad I tried this place because I have learned my lesson. No matter where I go, I will still leave hungry, stomach and wallet."}
{"text":"This is my second time to Rawlicious and the first time on this branch.  Being a card carrying meatatarian places like this are rare feat for me. I only have on single vegan friend. 

Though I won't be sold on the vegan band wagon since I love my meats as well. This place is the bees knees for making veggies taste good.

This place is not like those Chinese vegetarians where you get non-meat products  that tastes like meat or other vegetarian restaurant that put spices to infinitum which is just an exercise of masking the flavours. 

Warning: do not come here hungry. Your wallet would regret it. However, if you 

The food in this place brings out the natural flavour of the ingredients which alone would be blah. However when you combine it together, the ingredients dance around your taste buds giving a much more fulfilling experience. 

The staff here is more attentive  than the Newmarket location. So that's a welcome bonus. They were considerate enough to even split our drink into two cups so we can share a relatively pricy compared to other places  cherry berry shake. 

One other nice thing about this place is they have their recipe book on display which they allowed us to read.  It was quite fun to look at how they make their stuff while savouring it.

Perusing through it on the work that is needed to make their food and then comparing it to the prices you are paying, I find that it is well worth it. It is a lot of effort and prep work to get their base ingredients which have a limited shelf life. 

So what did we have today. 

Cherry berry shake. A mix of cherries, bananas, avocado, goji berry, maple syrup, vanilla and almond extract  in an almond milk base.  Their shakes feel satisfying you need to have one in order to feel full in the end along with their main entree...

In which case we had the Pad Thai and Quessadillas. For those, do not expect more than the relative shape to match the name.  They taste unique.  You know they're veggies and there isn't a hint of meat in the flavor at all.  The portion of each entree is good only for one person so it's good we ordered two entrees.

We also had the watermelon salad.  Unfortunately that was a major miss for us.  The arugula was just way too strong that the rest of the watermelon couldn't counteract it.  However, I am not factoring it n this review, because the first time I went we had the Nori maki which was a very tasty appetizer.

Shortly after eating the food here, I do feel a bit cleansed.

Also considering I ate the food 3 hours ago, at the end I didn't feel *full*, but I am not hungry at this time.

Also since this location is a bit closer to home and has ample free parking nearby I think this is my go-to branch of Rawlicious as well."}
{"text":"Customer service was nice, decor was top shelf, food tasted okay, but it was a bit pricey. I've tasted wonderful vegan food before but this food was alright. Everyone has different tastes."}
{"text":"Its rather expensive. Meh tasting food. I went and now I can say I went and I don't have to go back.


I got a creamcycle smoothie and it tasted like just a banana smoothie. Got the pad Thai. It was predominately the \"noodles\", a couple of pieces of red and green pepper, a tablespoon or so of grated carrot and maybe two chopped up cashews. And some green sprouts on top. Not what I expected. There was a rather tasty sauce but when you got more towards the bottom of the bowl, the more watery it was. When you got to the bottom it was pretty unpalatable. I had to leave some behind. I had the raw pad Thai at canteen and loved it. I was so disappointed here. 

This was too bad because its in great location, the restaurant is comfortable, the staff really nice. I want to tell people to come but I just can't. Not from what i got. Maybe it was just an off night?"}
{"text":"Ha!! So I took my Chinese-food-and-meat-loving family to a Vegan restaurant with $10 drinks. How am I still alive??

My dad enjoyed the Strawberry Milkshake $8 (almond milk, strawberries, avocado, agave, vanilla) which was surprisingly more sweet than creamy.

I had the Creamsicle $8.50 (almond milk, banana, avocado, orange, vanilla, agave), which is the right amount of delicious creamy banana and avocado plus only a ting of vanilla sweet. It was perfect.

My brother had the Green Apple $10 for the big size (celery, spinach, apple, ginger, parsley) which tasted exactly as you think.

We shared the pad thai because we weren't hungry. We only visited for the drinks, but we were curious with their food. The pad thai was nice, it tastes like a cool, refreshing salad.

The little restaurant itself looks like a shop. It's adorable, it has several date-size tables, about three big tables. Easily full. Awkward wait if it's full, I mean where do you stand without disrupting the peaceful restaurant? We almost walked out."}
