{"text":"Best Kabob around...tastes homemade! We use them all the time when we cater large parties and everyone loves it!"}
{"text":"The food here is delicious and the atmosphere is extremely friendly.  The koobideh is on point and so good it makes u wanna slap ur momma!"}
{"text":"Great kebab they have and it is really not fat at all what I recommend for you would be to call ahead and they will prepare it for you"}
{"text":"Food taste excellent!  Order ahead!  Friendly and humble service! Koobideh is my favorite!"}
{"text":"-By far the best Persian restaurant in the area 
-Great service 
-Friendly staff 
- Very clean and affordable:)"}
{"text":"The kebobs in this place are unbelievable. It's hard not to stop by here every time I am in the neighbourhood. Hands down best!"}
{"text":"Good koobideh, moist and fresh. Salad is one of the better for these kind of places, and the rice is on par. Overall a good find, close to work, and well priced. Staff are friendly and there is room to sit in and eat."}
{"text":"theres always this fantastic smell that is emanatng from this place, they have quite possibly the best Soltani I have ever tried. If you are into grill and meat and grilled meat, this one is right for you."}
{"text":"Just ordered take out from there. First off, we called asking for food for a family of 7, they were honest and said ordering for a family of 5 would suffice (was enough food and saved us some money). The koobideh and rice was excellent. The salad was fresh. Inexpensive and great food, will definately bring going back."}
{"text":"One of the best persian kabab. They offer veal tenderloin kabab at decent price. The other dishes are good too."}
{"text":"I've been coming to this place for yeeeeeeaaaaars - I can't believe I'm only reviewing it now. 

Located in a strip plaza off of Yonge, close to Bernard, is Rayhon Kebab. They seriously have some of the best koobideh and Persian dishes in town. 

The store is definitely more of a takeout place, although they do have some seating. Don't be fooled by their appearance - the food is awesome. Definitely call in advance to get your order made as there's usually a wait though. 

As I mentioned, the koobideh here is amazing. So flavourful and fresh. The chicken here is also pretty good. Very juicy and not dry at all. Everything is grilled to perfection. 

They also have this unique Persian dish called 'tahdig' which combines some of the hardened rice found at the bottom of the pot with a stew like gourmeh sabzhi or lentil stew on top. It's amazing and they run of it fast! 

The service is also efficient and friendly. 

In all a solid spot, definitely one of my go to's for weekday takeout!"}
