{"text":"We have been in Montreal now for 3 days and this was the best food and service we have had!  I love this place!"}
{"text":"Worst service ever! One friend ordered a salad and it took an hour to get it, after 3 of us got and finished our burgers. Then they forgot 3 other friends orders!"}
{"text":"We came for dinner with our kids last week. The street had many restaurants but this one had a nice French bistro menu. We ordered shrimp bouquet, naan with sour cream and truffle oil, duck breast main course, beef and salmon tartare, beef short rib linguini. Everything was so good. The only improvement could be with the shrimp bouquet. It came in a fake plant in a pot, with long skewers of breaded shrimp on it. The shrimp tasted fine, but the presentation in the pot was a bit dusty. The pot container felt a bit oily and sticky. Not sure how many other bouquets came out in this pot and whether they clean it between customers. The naan was also a bit heavy and oily. Overall, it was a great meal. Friendly service and nice atmosphere."}
{"text":"Service agréable, ambiance plaisante, menu varié... Excellent choix pour une soirée réussie!"}
{"text":"This meal was one if the best that I have had. I had the duck risotto which was not on the menu, but was the special of the night. I was NOT disappointed.  The service was good and the menu had English notes for us non-French diners.  I would also highly recommend the beef tart-tar! Fantastic! The only reason I removed a star is because after we paid our bill, the waitress let us know that the service was not included in the bill. We had already left her tip on the table, so it rubbed me wrong that the waitress felt she should ( and could?) ASK for a tip. A small thing at the end of a great meal but it left a sour taste in my mouth."}
{"text":"Bonjour la terrasse était sympathique alors nous avons décider avec mes collègues de dîner à cet endroit . Un service exécrable. On commandé des bières. Ils oublient de nous amener nos bières avant de recevoir l'entrée . Il a fallu leurs rappeler . D'ailleurs il n'y avait aucune bière de microbrasserie juste des bières standard ... Et ils osent s'appellera brasserie ...Les commandes étaient toute mélangés ... Ils repartent avec pour corriger la situation ... On attend . Finalement on mange . La bouffe était très ordinaire . Un de mes collègues à commander seulement une petite soupe d'entrée . 6 $ pour le petit bol de soupe au carotte cheap !!!!!! Alors que la table d'hôte la moins cher coûtait 13 $ Non mais je rêve ! C'est du vol ! Bref , à éviter et bonne chance si vous avez la serveuse de merde qui nous as servie . Pour un groupe de 6 personnes elle est parti avec un beau 0$ de pourboire"}
{"text":"There's not enough alcohol in Montreal to excuse the absolute negligence and systemic failure of this food establishment. Not sure where to begin as my party of 10 wanted only to rid themselves of this experience. Incredibly poor service, blatant disregard for patrons, and a complete lack of food organization, management or anything close. Ultimately only 4 of us actually ended up with meals. This place gives food and Montreal a bad name. And that's a shame in a city of French. DO NOT UNDER ANY CIRCUMSTANCE WALK, WANDER OR STUMBLE INTO THIS PLACE. YOU WILL REGRET IT!!!"}
{"text":"Waitress is very mindful. The food is well priced but I've had cheaper. Air conditioner could be colder. The only downside is they were not fans of me smoking a cigar, but they were polite about it"}
{"text":"I'm not a big fan of restaurants of  the village since they always end up trying to hard to be trendy and forget to focus on the actual food but I was pleasantly surprised by the atmosphere, food and service. Highly recommend it! Salmon tartar was excellent and so was the Beef Carpaccio....And the DESSERT POUTINE IS A MUST."}
{"text":"Great place for sangrias on the Terrace. They have several sangria flavours and all of them are great. Their menu is also pretty strong - though some items are a little pricey."}
{"text":"The menu was exceptionally extravagant - the server was nice how ever didn't speak any English and definitely didn't try - the appetizer was great, the shrimp, however it did come out cold - got the burger with bacon not bad, don't get it with spinach, it will wilt! Dessert - chocolate leave cake, great! Sat out side great - for a $100's including drinks I give it a B-"}
{"text":"The Rebel Brasserie Urbaine is part of the gay Skye entertainment comlex, but the restaurant clientele seemed to be mixed when I was there for lunch recently. For those with long memories, this place used to be called \"Food.\" It's been completely redone and the menu has been upgraded, although I miss Food's sushi bar. The new room is sleek and modern. There's copious outdoor dining as well. For lunch I had a delicious salmon tartare, a filling burger de poulet et canard, and an excellent cup of coffee. As befitting a gay venue, the wait staff ranges from pretty to gorgeous. But, unlike their New York and Los Angeles counterparts, the boys are without snotty attitudes. My waiter Laurence was not only fetching, but attentive and courteous. Perfectly bilingual and a student at McGill, he was intelligent and friendly. Laurence added to the ambiance of the whole experience."}
{"text":"Ok food, terrible washrooms, and when my partner asked for an egg on his Croque Monsieur the kitchen refused, saying they had no eggs! Not sure where the other reviewers were eating, but if this place was one of the best meals of their lives, then I worry!"}
{"text":"Excellent beer selection.  Very pleasant service.  Relaxed atmosphere.  My group ordered the beef tartar, I did not try it but it looked splendid"}
{"text":"This is a tough one...  We were kindly greeted by a friendly, handsome gentleman whom also was our server. We took a nice window table inside the warm wooden and beautiful brick interior. Jazz was playing in the background. This all gave Rebel and delightful upscale atmosphere...  Unfortunately, while the food was good, it wasn't extraordinary. This is probably just fine if you're a local seeking some comfort food in an enticing atmosphere, but if you're a foodie tourist like me, you're probably seeking some a bit more...  $15 half dozen oysters...these were fresh and ginormous! $23 Grilled Seabass...cooked well with a thick rich gravy, but nothing complex. The steamed veggies and mashed potatoes...bland. $28 Steak Frites...cooked nicely at medium. Good, but not thrilling.  As were the accompanying frites.   $35 Bottle of good red wine, Parallele 45.   Montreal's gayborhood has few elegant sit down eateries, but Rebel makes a decent meal in a lovely setting."}
{"text":"The food here was excellent. Great flavor combinations, imaginative spins on classic cuisine, and appropriately priced. If I lived in Montreal, I'd go back again and again. Very friendly staff!"}
{"text":"This my third time at this restaurant. The drinks are very original and tasty. Well described.  Had the lamb shank this time and the duck confit sandwich the first time.  My server, Thomas, was welcoming and spoke excellent fluent English which was helpful."}
{"text":"Inattentive service, rude servers, SLOW arrival of food in an empty restaurant, plates arriving an HOUR after others....stay away."}
{"text":"Amazing brunch! Love their mimosas and the souffle omelette was simply outstanding.  Highly recommend!"}
{"text":"I recommend this place for dinner before 6 as it gets a little busy during the later hours. Good place for cocktails as the evening develops. Located in the middle of the action on St Catherine, it's got a great outdoor seating area."}
{"text":"One of the best meals of my life.  The salmon was perfectly prepared.  One friend has the burger with homemade friend, and the other a French version  of a ham and cheese sandwich.  The pomme frites were the absolute best I've ever had!!!  You MUST eat here!!!"}
{"text":"It took them over an hour to bring our food and the restaurant was empty. The food and drink was ok nothing special. Getting attention of our server was difficult. They had to replace my spoon twice since the first two were dirty."}
{"text":"La nourriture est très bonne, belle présentation. Par contre une lacune de service, manque d'eau durant la soirée. Et vers la fin, lorsqu'on voulait commander un dessert, on ce fait dire \"cuisine est fermée\".  They don't speak english!"}
{"text":"What a fantastic place to have brunch or any meal for that matter. I was very impressed with my maiden visit to Rebel and the wonderful late afternoon brunch that we had this past weekend. This place came on tops in every aspect.   Ambiance: What can beat sitting outside on a balmy summer afternoon, under the shade of the umbrella, watching the world go by (in this case the very mixed and yet very interesting crowd one gets to watch on Rue Saint Catherine)? That is exactly what we did. Although, they have an equally impressive indoor space with a very modern design and definitely a very cool vibe. The tables outside are placed for couples' seating but can be quickly combined for a bigger group.  Food: The menu is quite extensive. And the brunch omelets being served in cast iron dishes seemed really appealing. So we went for the same, And some mimosas to begin the afternoon. The french bread served with butter in a small covered bottle was really good.  And the omelet was definitely the best part. Right out of the oven, the hot cast iron dish kept the omelet warm for a long long time. Fluffy and perfectly done, all the ingredients were cooked to perfection. The potatoes on the side were done right as well. Couldn't have asked for a better meal. I had to gulp down my mimosa rather quickly as it all of a sudden became sweltering hot mid way through our already warm meal. No complains though :)  Service: Top notch. Everyone was very nice and polite and there wasn't a time when we felt there was either too little or too much attention being given - to us or to any of the guests. It was just the right balance. Our waiter was sure to check upon us that everything was good and up to the mark. Really nice set of people working here.  Overall, this place is one of the best places that I ate at during our very short but so much fun long weekend here in Montreal. These guys know how to run a good show and hope they keep up the excellent gig going till we visit again!"}
{"text":"J'allais à ce restaurant un peu à reculons, plusieurs établissements fades ayant eu leur adresse à cet endroit dans les dernières années.  Premier constat, le restaurant demeure un grand local rectiligne, l'ambiance n'est pas tout à fait au rendez-vous.  Passé cette première impression cependant le restaurant s'en tire très bien. Les plats proposés sont effectivement ceux d'une brasserie: poissons grillés, viandes de différentes coupes, légumes racine (leur purée de pommes de terre est exquise!), charcuterie, etc. Les assiettes sont bien faites et généreuses, mais ce n'est pas de la cuisine à la mode moléculaire néofusion sous vide, et c'est bien correct ainsi.  Le service est sympathique mais un peu gauche parfois. Par exemple, les suiteurs ne savaient jamais quelle assiette allait à qui, le service de vin était déficient, etc. Mais l'intention était bien là.  Donc, ambiance artificielle et service correct et très sympathqiue, mais nourriture très bonne pour le prix. L'établissement ne se perd pas en prenant plusieurs directions."}
{"text":"En lisant les autres commentaires, je vois que nous ne sommes pas les seuls à avoir trouvé le service tout pourri! Il faut dire ce qui est.  Nous voulions aller au Sky, fermé le lundi, un peu par dépit nous nous sommes assis en terrasse au Rebel, un bar plutôt immense autant dehors que dedans.  Nous avons commandé un cocktail margarita à partager, au Gin et Cointreau mais pas vraiment alcoolisé finalement. Puis des nachos, qui nous sont parvenus en bonne quantité mais brûlés sur les côtés. Le serveur vient nous encaisser car il quitte son service. Du coup, il part avec l'argent mais ne débarrasse pas la table. Après 20 mins nous sommes obligés d'appeler la serveuse qui a pris la relève mais ne daigne pas venir voir si tout va bien, alors qu'on souhaite commander une bière. Elle prend la commande et revient 10 mins plus tard pour me dire qu'elle n'est pas sûre de la commande. Voyons, j'ai pris 1 Stella, imprime!  Autre chose, l'établissement n'accepte pas les cartes de crédit prépayées (sans puce) ce n'est pas cool du tout ça :("}
{"text":"J'etais client depuis l'ouverture et recommander des dizaines de clients mais dernièrement la qualité de la nourriture laisse à désirer.  Le staff est charmant et donne un bon service et malheureusement la semaine dernière le patron a refusé d'échanger un verre de bière \"flat\". Pour 4,50$, really? Juste une question de principes"}
{"text":"Worst meal of the trip.  YELPERS let me down once again.  Service is super slow, even non existent.  We waited 1 hour for our meal.. burger, chicken and mash, veg burger, fish and chips and tuna tartare.   Was about to leave and ask for the check, but the food unfortunately showed up.  Everyone was disappointed in the food, except the wife who liked the tuna.    While we waited no one came around and asked if we wanted more drinks or to check on us.  Only thing that came quickly was the check.  We thought the decor looked nice, but that's about it.  Hope this place goes out of business or burns down."}
{"text":"I feel like the general consensus for me for this restaurant is sort just not amazing but not bad. They had some good points : nice well made sangria (a few different types) , their outdoor patio was spacious and comfortable and perfect for a warm summer night (but no umbrellas in case of too much sun or in case of rain though). Service was quick and attentive and our waitress was so friendly and funny and made sure we were taken care of. Buttttt the food itself was just ok and actually pretty overpriced for what you get. I had a turkey/chicken burger and fries and while the fries were actually pretty perfect the burger was not bad but was just ok and really not memorable or special in any way. My friend friend had the tuna steak which was actually pretty well spiced and had a good cook on it but her sides fell very short in flavour. Overall I probably wouldn't go out of my way to come back or to recommend this place but I also wouldn't discourage anyone from coming here and trying it for themselves. I would probably only come back to sit outside and share a pitcher of Sangria and maybe an appetizer."}
{"text":"Vraiment bon la tartare de bison! Je reviendrai c'est certain! Service courtois et aussi drôle! Un peu dispendieux mais on en a pour notre argent."}
{"text":"I find that this place serves ok food, ok cocktails, ok service... All in all ok. A bit on the pricey side. I am not so keen on recommending this restaurant."}
