{"text":"Some of the best wings in lakewood and they generally serve decently later than most other bars in Lakewood which is good if you work weird hours and are hungry at 12am and don't want to go to barrio... Always have good drinks and food specials going."}
{"text":"Cheap beer, cheap food, and bowling for a quarter. Life doesn't get much better."}
{"text":"A decent bar I like to hit up in the wee hours of the night."}
{"text":"the new bartender is horrible watery drinks, bad listening skills giving me the wrong drink rushing to nothing he didn't back the bar properly leaving beer bottles and shot glasses galore until the other bar tender came and cleaned it looking dismayed. He is kinda cute but no thanks the ladies here make good drinks stay away fron this guy I've been coming here as I'm here now for 3 years this is the first time I'll be leaving after my 1st cocktail."}
{"text":"I didn't know much about this bar coming in but I'm impressed. If your skeptical, give it a chance. I'm impressed and you will be too. Ambiguous and I informative? Maybe. You just have to try it for yourself."}
{"text":"My friends and I stopped in here to grab a beer before going to dinner. This was my first time being here and I was pleasantly surprised. It was clean and the service was fast. I love divey bars because they always have great food and drink specials. I got a Sam Adams Oktoberfest for under $4! They have different food specials everyday of the week and specials during game days.

Can't wait to stop in again and try some food!"}
{"text":"My wife was looking for a little \"adventure\" last Saturday night, so I thought we'd give this spot a try to see what the vibe was like...so glad we did!

This place has an old-school, neighborhood bar atmosphere with very friendly servers / people throughout.  We had heard such good things about their wings, it was time to finally give them a try.

We ordered a dozen of their buffalo garlic parmesan wings ($0.45 all-day, everyday!) and they were outstanding...not overly \"wet\" and super-crispy on the outside, flavored with a slight heat from the buffalo and pungent garlic flavor.  Their blue cheese dressing was very tangy and the first serving is on the house.

Their Saturday night special (they have multiple meal and drink specials every night of the week) was a 1/2 pound cheeseburger and fries, which we split.  The burger was pretty good, but the meat patty could have used more seasoning.  It was cooked perfectly medium, just how my wife asked for it.

The bar has tons of super-cheap beers and shots (and a full selection of liquors), so there are plenty of drink options to choose from.

But the coolest feature of this establishment?...they have an old bowling machine that costs $0.25 per person to play!  The game worked flawlessly and was a ton of fun to mess around with.  Nostalgia rules!

Fun place, kick-ass wings and cheap drinks...we will most certainly return!!!"}
{"text":"Great place for a quick drink and some wings. They have wings a dozen for $6 daily and food specials every night, so it's worth checking out. Also the bartender was great. It's very convenient, and for $14 I got a dozen wings and 2 Captain and Cokes. You can thank me later, just go there"}
{"text":"I've been meaning to stop into this place since I saw them revamp the exterior. While the interior didn't get the same attention as the front facade this little dive bar is worth a visit.  A few friends and I stopped in for a drink after work and for 4 o'clock on a Tuesday there was quite the crowded counter, which only means that is a hidden gem. It's a small establishment with great and friendly service. They have an old school bowling machine and some of your usual suspects on tap, but you can also get some great seasonal drafts for under 4 bucks. With food and drink specials every night of the week this small dive is worth a swim.

I know I'll be back to try out some of the nightly specials."}
{"text":"Let me start off by saying that I love this place. The layout is pretty narrow and there's seating for maybe 30 people within the bar. Both the back and front have small patios which is perfect for summer beer drinkin! The drinks are super cheap, and they offer $2 fireball and 49c wings everyday. I've eaten the wings (buffalo garlic parm) and the cheeseburger with fries ($6.50). I was surprised with the quality of food, it was a lot better than I expected! Beer was served super cold and our bartender Melanie was fantastic. This place is very unassuming which I really like about it. It seems like most of the people there are regulars but didn't make me feel unwelcome when I arrived. I believe there's free bar bowling on Sunday and free jukebox on Monday (those days might be switched around, sorry!). Overall I would definitely recommend this place!"}
{"text":"Took me 6 years of living in Lakewood to stop in this place and I'm shooting myself in the foot for it...

To start, best wings in LAKEWOOD! 45 cents all day/everyday dine in only. No place around here can beat that or even come close. Next, they let up mix favors for free. For instance I'll mix buffalo, garlic parm, and ranch. And the wings are DE-FRIGGIN-LICIOUS. I literally crave them. They have a perfect crispness to them. Always cooked and coated perfectly...

Their daily specials are hard to beat. Under $6 for a chicken Philly or burger and fries? Chicken Philly damn good esp w the peppers and onions on top. Also love their $7 nachos. Totally loaded w/ everything people love. And on Sunday, only $5.50, talk about a steal.

Cheap beer and liquor (can't pass up a $3 Bacardi/Coke), friendly bartenders and owner, easy parking, and delicious food makes this a can't miss."}
{"text":"Rose makes a mean g&t. Food is always outstanding. Have yet to have a bad experience here and having been showing up here for years. Staff takes excellent care of all customers.  I proudly call The Red Rose Cafe my home bar!"}
{"text":"Don't get trapped in the men's room stall! 
So, men room etiquette is, if someone is at a urinal, and only two urinals, you go in the stall. Well don't do that at the Red Rose. The bathroom is kind of tight and the stall door opens out, causing the person using the urinal next to the stall to block the door from opening. The man using the urinal was a large man so I don't know if that had anything to do with it. The door most likely opens out for it to be handicap accessible. Still, kind of bad planning/design. 
Food is good and drinks are cheap. I will be back."}
{"text":"This is a good local bar.It had bottles of Pabst Blue Ribbon and that's I needed!!!!I"}
{"text":"After second time trying Red Rose, I'll pass. They charge extra for the mix in vodka.  Who does that?
First experience there when Nadia behind the bar. Perfect."}
{"text":"Hot Garlic Parm wings are the best in the city. 45 cents all day everyday. 25 cent bowling machine. Dive/homey  feel with a small porch. Should make any top 5 bar in cleveland area list."}
{"text":"Easily the best wings in Lakewood & Cleveland (buffalo garlic Parmesan .. Seriously amazing!) The bartenders are great & the drinks are cheap. Usually a low key, laid back, atmosphere .. Always a good time :)"}
{"text":"One of my favorite bars. All of the food specials have been great, the chicken philly is my favorite. The wings are the best in Cleveland. Can't explain why but they are. The bowling machine is worth a stop alone. 50 cents for a game. Get a couple friends together and get in the league"}
{"text":"great bar with lots to do.  they have a full size bowling machine, darts, keno, and a full menu. enough to keep even the heavier drinkers busy for a few hours"}
{"text":"Great place to watch the game on a Sunday afternoon. They have a large menu for a bar. Our party of 4 had wings, sausage and peppers, cole slaw, a chicken wrap,a hot dog, and jalapeño poppers.  Everything tasted good.  I want to try the chili on my next visit."}
{"text":"This is my second time here and each time I've been amazed by the poor service I've received. It doesn't matter how good the food is, crappy service just leaves an unpleasant taste in the mouth. The first time the server forgot to put our food in and 3 order of wings took over 45 minutes. We then tried to order their dessert of deep fried Oreos and were told that the kitchen was closed early that night, even though the reason it was so late was their fault. This time we came during a Cavs playoff game and struggled getting refills of our beers as well as having the Cavs game turned to the Pittsburg Penguins game at the TV by us. 

With that being said, the wings are perfectly crispy but order extra sauce because there is never enough on. The nightly specials also leave a reason to come in, but it all depends on the experience you want to have when you go out to eat"}
{"text":"Great bar, great food and an awesome bartender with a electric personality on Saturday night.  Check it out!"}
{"text":"Old school but good!  Great prices and good food.  Not much, so keep those expectations low, but check it out!"}
{"text":"Love this little bar.  I'll be mad when it becomes popular for real because it'll mean less space for me.  The bartenders are all wonderful & the wings are on point!"}
{"text":"Tried to come here yesterday and got the Tri-fecta.

-a/c wasn't on and it was 86 out.  Some of us work for a living and sweat all day at work.  Don't need it at Happy Hour. 
-you could smell the fryer grease from Malleys a few doors down.  Clean the hoods.
-pop country on.  I would rather listen to baby seals being clubbed that that crap.  Soulless drivel.  

Just go to Kelly's 3 minutes away.  Same working class feel with good food and your ears wont hurt from the garbage music and you wont have to burn your fresh dip gear...."}
{"text":"Cheap drinks & food. No frills. Cool dugout in the back and vintage bowling machine.  Good place to have a dive night."}
{"text":"Good \"dive\" bar.  Cheap beer, easy place to hang out for a few drinks.  Stop in and enjoy a few in a small, easy going bar.

I didn't get anything to eat, but several other people that the bar said the food was decent."}
{"text":"One of my favorite spots in Lakewood. The Red Rose Cafe has .45 cent wing night every night of the week. And to top that off, their wings are amazing! Their drink menu isn't as robust as some other places but you won't be complaining when you get your bill."}
{"text":"Great neighborhood/dive bar.  We stopped here after the Cleveland Auto Show and were pleasantly surprised.  Great selection of beer with 4-5 dailey specials.  The food was wonderful except the french fries which were fairly average.  The staff was friendly and attentive and it was a wonderful experience!   We will definitely be back"}
{"text":"A dozen chicken wings for 6$. I repeat 12 chicken wings for 6 doll-hairs. And they're gosh dang flippity dippity delicious! I'm offended that no one told me about this place sooner because finding 50 cent wings in Cleveland has been a daunting task. Sure this place is a total dive bar, but that's exactly how I want my wing establishments to be! No one was judging me while my face was literally covered in sauce. The domestic beer was dirt cheap too! All 3 of us ate, drank, and played the jukebox for under 25$. Your wallet and your tummy will thank you!"}
{"text":"Wonderful local bar! Now the great, the good, and the could be improved. 

The great -- chicken wings were to die for. Both my boyfriend and my friend agreed that they were one of the best wings they had in a while. The best part? It was 1 dozen for $6. The best wings we have had; $0.50 a wing. They have daily specials as well, which are a great price as well. 

The good -- the atmosphere was a typical sports bar. If you've ever seen How I Met Your Mother, it reminds me of MacLaren bar IRY. They have old school games. Drinks were also a great price (we got 3 beers - one draught and two bottles - for less than $12). 

Improve -- food took a while to come out. We waited a solid 35 minutes for our food, and it wasn't crazy busy. There  was also at one point only one waitress working, but then another came a little later. 

Wonderful experience. Will be back!"}
{"text":"I love this place. Their wings are excellent and well priced. Drinks are cheap. Atmosphere and crowd is great. If you're looking for a no fuss bar with dependably good bar food, cheap beer, and friendly staff, this is your place."}
{"text":"This is a nice hillbilly bar in Lakewood. A friend celebrated his 30th birthday here last night. Last year for his 29th he tried fighting most of his friends amidst a black out. This year, he wanted to gracefully enter his 30's at the Red Rose Cafe. The name makes it sound more exotic and fascinating than it really is. The music is terrible. Mostly new rap/pop stuff like Little Wayne. A guy had a Wu Tang \"C.R.E.A.M.\" shirt on last night in there. I guess the owner team is a husband and wife duo. Her name is Rose. That is the most romantic thing I have heard in a long time."}
{"text":"I absolutely love this place. The staff is so nice, the atmosphere is very cozy, and the food is phenomenal. I'm a wing but and this dive bar has the best wings I've ever had. The beer prices are extremely reasonable. My girlfriend and I come here often and we've never had a bad experience. They have daily specials on food depending on the day. They even have free Wi-Fi (not that free Wi-Fi is impressive, but the fact that a bar has Wi-Fi is pretty nice)."}
