{"text":"I order take out food often and this was the worst experience ever. I ordered multiple dishes and everything was oversalted with a terrible after taste. The chicken pakora was very disappointing. Everything was just horrible. I highly recommend to save your time and money. There are way better options for Hakka food."}
{"text":"I decided to pre order a dinner of six for my colleagues and I during lunch for take out. Little did I know that the food was likely made the day before. Everything tasted awful! From the chicken wings to the fried rice. I almost broke a tooth biting into the sweet and sour chicken balls. I also ordered a few other dishes off the fixed dinner for six which were inedible! If I could give them less than one star, I would. I spent over 100 hundred dollars on my order and they should be giving me money for my experience. My advice, STAY AWAY FROM RED ROSE GARDEN!!!"}
{"text":"This place has been around for a long time. I'm in my fifties now, but our family used to get take out from here in the 80's. I recently moved back to Markham from living in Montreal, Thornhill and Mississauga. I was delighted to see they were still in business. We enjoyed food delivery and eat in dining for a year. We had Red Rose once a week! When my daughter was in from university she always wanted to order. The food was so good. Fresh. Big helpings. My wife liked the Chinese Broccoli in Garlic sauce and my favourites the Chicken in black bean sauce with snow peas and the manchurian beef was a spicy delight! Then our world came tumbling down! Change of Management. We've ordered again 3 times since the change and it hasn't been the same. Wrong dishes sent. Slow delivery. Trouble communicating the order on the phone. The Manchurian beef was tough to chew, not soft like previous times. It used to melt in your mouth. Asked for a veggie spring roll, but there was shrimp in it. My wife wanted to try the Satay chicken but they sent spicy chicken. Another one of our chicken dishes was beef and not chicken. The consommé soup wasn't the same. We asked for sweet n sour chicken not breaded, but it came breaded. The chicken seemed over cooked and was hard to chew. The Chinese Broccoli was still great though. We asked if the restaurant was under new management but they said no, that the guy and his wife went to start a Mississauga location. We missed him! The food was always on point! I'm sure they have a new kitchen staff there and the food will get better. Maybe it'll take them some time to learn the menu. We will go back, probably to dine in, the food will probably be better. I hope they get things going, because this place has been in business serving Markham for over 45 years. A lot of good memories when my dad would come home with Red Rose food for dinner when we were teens. We probably won't be visiting any time soon, to give them a chance to work things out. I still recommend this restaurant. The new people there seem to be very nice, maybe a little overwhelmed. Good luck! Thanks Red Rose! Cheers to another 45 years!"}
{"text":"I'm going to call it like I see it. Mixed reviews on Yelp but this place was located right across the street from me - so I'd forever have regrets if I didn't visit. 

Order:
- Chicken corn soup. 
- Pork fried rice
- Chilli chicken (had to try their Hakka)
- beef chow mein. 

This is certainly Canadian style Chinese food. There is a Hakka twist if you want to explore the option. 

Generally speaking, all of the food is good. All of the proportions of meat to rice to noodles to soup were all in balance. 

They even threw in a free order of wontons as well as three fortune cookies. 



Good and easy to understand customer service. 

I'll definitely order from them again!"}
{"text":"A friend brought me to this place and ever since then I have being picking up food for the family when we want Chinese food.   Even my parent come to this place now. 

It's a family run business,  the owners are very nice and friendly and do remember you when you retune!  

I do more take out but the food is always hot to the point it melts your fingers.  But it worth the drive to Markham for this food.  



I do come back when I'm in Markham and I don't want to cook or give my mom a meal off."}
{"text":"We have been ordering from Red Rose for 20 years. The food is delicious, fresh and perfectly seasoned
 I think that the ownership may have changed and the menu has increased to include newer fusion type items.  We have tried other Markham chinese take out places which are good but Red Rose is still the best!"}
{"text":"My go to for Canadian Chinese food. Every time I've ordered from here my food has been fresh and delicious. The Chicken balls and pork fried rice are on point! 

If you pay cash, there is also no tax. They have yet to disappoint and will continue to get my business!"}
