{"text":"First and last time at this restaurant.  Had to recook the deep fried pork ordered for take out because it was still white, but wife refused to eat it."}
{"text":"Like Bashu, this is another excellent restaurant to eat authentic Sichuan food in Mississauga.  We always have to make a hard decision to choose between Bashu and Red Lotus because they are just equally good."}
{"text":"This place is deceptively bad. On surface, everything looks good. The decor is clean and modern, the service is nice, and the food looks quite good. Don't fall for it. Every dish we got was oversalted or with too much sauce. It was also all made with poor quality food. Vegetables lacked freshness, meats were cheap fatty cuts, etc.  Two stars because everything else is done well, but if the food isn't good none of that matters."}
{"text":"Fish in a pot, Kung pao chicken and bamboo chicken. You just can't go wrong with the taste and authenticity!! Highly recommended"}
{"text":"The food here is extremely authentic and SOO delicious. My family and I eat here almost every time we visit Mississauga, which is often!   This restaurant is more suited for Chinese people as the staff speak Mandarin and Cantonese with broken English, but I would still recommend this to anyone who enjoys Chinese food.   Every time we come, we order the fried green beans, beef slices and frog legs. We recently tried the Peking duck. While delicious, my only complaint is about the duck, as the fat is not rendered properly, but the portion size makes up for it!    Overall this is one of my go to spots to eat for authentic Chinese food. If you love orange chicken and fried rice, definitely give this place a shot for some REAL Chinese food."}
{"text":"Came here for the first time today, for Christmas Eve dinner! It was delicious, but we made the wrong decision of ordering too many spicy plates... all at once. For a family that doesn't eat spices very often, this was a very bad (but very good and tasty) choice.   We ordered the famous spicy chicken bamboo, Sichuan dan dan noodles, stir fried green beans, 'husband and wife lung slices' (fuqi feipian). The tripe/beef shank came first ('husband and wife lung slices'), drowned in crimson red chili oil. My family, for the most part, were not great fans of it as they found it overly oily. It was still okay though!  The dan dan noodles came next, and they were not what I was expecting at all! It was my first time trying them, and I thought that there'd be a more prominent sesame/peanut flavour. But there was none of that! Overall, like the other dish, it was decent.  The spicy chicken bamboo, however, really stole the show! It had so much 'wok air' - and so, was quite 'hot air' (if you're Chinese, you'll understand what I mean haha). I couldn't help it though, and kept eating more and more and more. The peanuts were fried so deliciously, and the chicken was crispy and fragrant. Absolutely loved it, even though my mouth was dying from the spices!  Will come again for delivery, and try their other specialties (lamb skewers, beef roll, hot pot)!!"}
{"text":"Used to be really good but totally went downhill in terms of quality and service. Found strands of hair in our food. Not coming back."}
{"text":"The last time that I was here several years ago, and at that time the food was too spicy to eat  and the decor was in serious need of a update from the tacky 1980s setup they had going. This place makes northern Chinese dishes, which are far more spicy than what most of us are used too. On this visit, I was surprised that I was able to eat the food without breaking a sweat and also that they had redone the interior. Apparently they can still make overly spicy food on request, but have toned it down for everyone else. The noodles, house made dumplings, and roast pork were excellent. I suggest trying the home made dumplings with the, of course, spicy dipping sauce. The food is not expensive."}
{"text":"Only one word, Dirty.  Tea pot coming with some chemical taste. Plate not clean well. Grease table etc..... They should hire a professional sanitation company  and deep clean this place. Will never come back."}
{"text":"food is great here, very authentic chinese food. BUT SERVICE is terrable! the waittess, who might be around 40, does smile to you, and request tips though she doesnt really.being helpful. that is the only reason makes me visit here very unfrequently."}
{"text":"We brought our little one here and she needed a change, and we found ourselves in the uncomfortable situation of a baby with poo and no change table. The staff was super nice and let us use one of their VIP rooms (they have about 3, and they were all empty) to change her. They didn't seem to keen about it and watched us closely when we came back (perhaps to see if we'd dump the poo diaper in the bathroom? I took it home with me so they had nothing to worry about), but it's nice that they gave us the room.  Lunch specials are available, but you have to ask for them. They have a pretty decent selection, all around $8 - $9, and each comes with a spring roll and a drink. The lunch menus have a variety of food options, but the main menu is mostly northern food. Their XLBs are pretty good though the skin is a bit thicker than I'd like, and their shanghai stirfry noodles are well flavoured. Overall, it's a good food option and at $10 per person (average), it's a good contender in this plaza!"}
{"text":"For some reason, I always expect restaurants with relatively nice interior to have good service paired with it. However, the server that day could speak minimal English, to say the least. My family and I basically communicated with her with hand motions (what a sight to see!).  We just wanted some recommendations, but that clearly wasn't possible. The worst part was that the English  on the menu was in font size 8 and was so hard to read. Like Mom could barely make out the words.   Aside from our bad first impression, the food was relatively decent! We got beef fried rice, stir fry Shanghai noodles, Beijing style eggplant and beef stir fry with broccoli (shared it family style to have a taste of all the food).  Our favourite was the beef fried rice. Perfectly seasoned in my honest opinion. The beef was so tender and the rice was fluffy and not dry.  If you follow my other reviews, you know how much I LOVE noodles. This one's biased but I thought it was seasoned well too. The price is really good for how much you get ($11)  The eggplant dish, on the other hand, was too salty. I love eggplant but not when I have to eat copious amounts of rice with every bite of this dish. Definitely would want more of a steamed veggie dish next time.  Beef stir fry with broccoli looked really good when it came out! But in all honesty, it was everyone's least favourite dish. It was way too bland. The broccoli was boiled, rather than steamed. What would've made it better is if they lightly tossed the broccoli in the sauce as well. The highlight of this dish was it's presentation over its taste, unfortunately. Also not worth the price ($14).  By the end, we were all so full and had to get a take out box for the rest of the food. We came as a family of four, so we thought four dishes would suffice. I think we would've even been okay with just three dishes! It's definitely a place for family style meals (having all the dishes in the middle to share).  Overall, the food was decent. I quite enjoyed it but I do wish that there wasn't such a huge language barrier, which ruined my experience a bit."}
{"text":"Despite all the other so-so reviews I must say it is my favorite Szechuan restaurant in Mississauga.  Seriously, if you wan to eat szechuan then you better be prepared for spicy. If you can't eat spicy don't bother, because that is how it is suppose to be eaten.  I haven't got the chance to try everything yet, but here are  few dishes I lovee!  - Cold trio dish in spicy peanut sauce (it has beef, tripe etc.)  - Spicy hot pot fish (white fish cooked in oil and lots of chillies with some numbing peppers and beansprouts)  -Cumin stir fried kidney  -Fried chicken with spices (forgot the name but its wrapped in a bamboo net contraption)  -Hot and sour cabbage ( sooo good, brings out the flavors and the spiceyness)  -Hot and Sour Soup ( it is pretty good here and the key is not to use red vinegar but black vinegar to pull out the real flavors)  Their noodles and dumplings are...meh so just stick to ordering dishes to share"}
{"text":"This place is not as busy as the others in the plaza primarily I think because it costs more to eat here.  The quality of the food more than makes up for that differential.  Cheap and cheerful is nice but flavourful is hugely important too people!!  Cumin pork ribs, chive and beef dumpling, Shanghai noodles, and ma Po tofu.  Huge portions, nice spicy tofu and the pork ribs are to die for!!  Toasted cumin seeds really make the dish along with the chillies.  Dumplings were boiled and that's about it.  Probably my least favourite dish although stuffed with fresh pork and veggies.  I have to eat here more and try everything on the menu!!  Service is what you expect  in an Asian resto."}
{"text":"Not a bad place to eat. We ordered 4 dishes for 3 people. Beef noodle soup, dumplings, chicken and vege dish plus 2 white rice. Price came to $50. Not cheap but not too expensive either. The portion size is not bad. The dumplings are big and the beef noodle soup was really good. Most of the food is spicy but there are a lot of non spicy options."}
{"text":"Probably the best Sichuan restaurant in Mississauga (but again there isn't much Sichuan restaurants in Mississauga any way). My go to place whenever I am craving for spicy food. Most of the time, the food quality is good (don't go on Monday, they seems only fail me on Mondays. Maybe the head chef is not there?). Don't expect much service (typical Chinese restaurant). My favorite dishes: spicy fish pot, Kungpao chicken, bamboo shrimp and the spicy whole fish. If you are in the area and love spicy food, give it a try!"}
{"text":"Red Lotus is located close to some of my most visited restaurants in Mississauga - Wonton Chai Noodle and Chilli Chicken House. I was in the neighbourhood looking for a late lunch and decided to try something new. If you like spicy food, this is right up your alley! Here are my thoughts:  THE BEST - Spicy Chicken Bamboo is delicious and I highly recommend it. It is really flavourful with a spicy kick. The dish includes red and green peppers, celery, peanuts, green beans and chillies. You might want to order a bowl of steamed rice to help temper the spiciness of the dish.   NOTEWORTHY - Beef Rolls is a good option but I prefer the Rolled Onion Pancake with Sliced Beef at Asian Legend. They are comparable but the flavours in the latter meld together much more beautifully.   THE WORST - Dumplings (of any kind). I was intrigued because it specified that they are house-made. They are steamed and to my dismay, it was flavourless. I was curious to know if pan-frying them at home would help the cause. I did bring them home but I should have left them at the restaurant - they were far from being salvageable.   As for the service, it is subpar in Chinese standards. Each table has a device with options to call the server, request the bill, etc. It was not working. It was hard to get the servers' attention even though it was not very busy. The inattentiveness was not a major issue. I got irritated when I asked the server for a take-out container for the dumplings. She nodded her head and immediately said, \"How would you like to pay? Debit or Cash?\" I incredulously asked her to repeat herself. It was discourteous to say the least.  All in all, I do find their Spicy Chicken Bamboo tasty and unlike anything I've ever tried. Red Lotus is better reserved for take-out than dine-in."}
{"text":"GTA is well known for their Asian cuisine and places like Red Lotus only reaffirm that there's great Asian dishes to be had in the GTA.    While I've had a variety of different Chinese cuisines, Sichuan is right up there simply because I love the taste, the spice and the style overall.    I ended up dining with a couple that really know this place since they are regulars and have a list of approved staples for sampling.  We ordered a good mix of dishes from two types of dumplings, Dongpo pork joint, spicy chicken bamboo and beef roll, and beans, family style.  The pork was tender and broken up into smaller pieces, small enough so that we'd be able to pick them up.  the entire dish was glazed in a tasty and tangy sauce.  The chicken bamboo was basically a stir fry with bite sized chicken pieces and a mix of vegetables and hot peppers.  While the presentation was nice it was sort of hard to get the food out of this cone shaped container.  The peppers while hot added a nice crisp and texture to the dish.  For me they weren't too hot to eat by themselves although I could see my wife not being able to eat them with or without the other items in the dish.    The beef rolls were in a flat bread rolled almost looking like a burrito but it was cut into pieces like a sushi roll.  The beef had a sweet taste but the wrap was really good.  It looked grilled on a pan, warm and slightly toasted.  The taste sort of reminded me of siopao but the bread wasn't soft and fluffy but rather flatter and dense.  The dumplings were good, pork one with bok choy and the other with green onions.  The beans were amazing.  Crumbled meat mixed with fresh veggies... a bit salty but I loved the taste.  Overall Red Lotus has a very large menu with selections for just about everybody.  Not everything is going to be spicy peppery hot as not every dish is like that, some yes but not all.  We had a good choice of meats and flavors to try and between the 4 of us that had dinner we ordered appropriately for us (6 dishes, individual bowls of rice).    Red Lotus is good Sichuan in central Mississauga."}
{"text":"I love the food but not the service.  Can't really be picky about the service though i guess.  Typical Chinese service.  :/ i would give this place a 5 otherwise.  The food though is amazing.  Definitely go for the bamboo chicken and the cumin mushrooms are mouth watering.  Pricing is a bit higher than average for Chinese but kind of on par for schezuan."}
{"text":"If I ever find myself in Mississauga, this will always be my #1 choice for food.  The spicy fried chicken is to die for. This hotness level of this dish will challenge even the most hardcore spice aficianado. The seafood dumplings are also a favorite of mine. They are plentiful, juicy, and very flavourful. I also recommend the fish eggplant dish. I haven't had a meal here that wasn't fulfilling on every level.  I wish Red Lotus existed in Toronto! I'll just have to settle for going there whenever I'm with a friend with a car or just happen to be in Mississauga."}
{"text":"Got take out. Food was good. Tried dumplings, beef rolls, eggplant, spicy sour soup, cumin ribs, stir fried green beans + rice. $70 total.  They take plastic so they get 5 star! I Will have to try other stuff next time!"}
{"text":"My family has been coming here for years and while the food is fantastic and authentically Sichuan, the service needs a lot of improvement.   I used to think this place was pretty good, though the food did take a while to get to the table and some of the dishes were more peanuts and spices as opposed to meat, except my most recent visit really ticked me off.  I came here with my boyfriend who is incidentally white and suddenly the service went from maybe 3.5 to a flat 1. The waitress smirked at us the whole time and refused to speak in English even though she clearly understood it when we came in. There were maybe 3 other couples there and I was the only one with my hand up and she took forever getting to us, but when she walked by us she'd just roll her eyes.   Needless to say her tip was practically nonexistent. While I would've loved to leave nothing because seriously, it was crap service, I'm too wimpy to do that. I haven't been back since on principle.   So yeah, if your party is all Asian, bon appetit."}
{"text":"The service was horrible, we waited for a fresh pot of tea anf it took 15 minutes. We ordered  dishes and it all came in less than 10minutes. But the food was .pretty bad, they drench most foods in oyster sauce and the taste isnt fresh. Not worth the money, I won't be going there again"}
{"text":"This place has excellent food.  Our go to is usually the bamboo chicken, beef noodle soup, sautéed green beans, fried pork and chive dumplings and steamed pork and bok choy dumplings and sweet potato pancake.  They've also done a great job with their recent reno.   Great northern Chinese restaurant."}
{"text":"Excellent authentic mainland Chinese food.  Has quite a good variety dishes, so you won't be bored coming back."}
{"text":"found a bug in the dish. poor service and ask for tips. the worst restaurant I ever been."}
{"text":"Good place for a quick bite at a reasonable price.  Service leaves much to be desired which is why I awarded 3 stars. Ordered a lunch special which included a soup which never came till I asked for it.  The Soup finally arrived 10 minutes after the main course,  as a result,  my food was cold. Asked for tomato sauce, was given hot sauce instead which ruined the taste of my soup.  I think there exists a linguistic barrier so for mandarin speaking people,  this would be a great place to dine. Food was delicious in taste and quantity was sufficient.   Decor was simple and the place is clean.  For ketchup fanatics like myself, I recommend that you carry your own bottle. Abundant free parking available."}
{"text":"Very packed restaurant when we arrived so we figured the food must be great. Wait time for food was not bad considering how busy it was. The food was just OK, nothing great. I still prefer the taste of other Chinese restaurants with northern style food. I would try it again to see if any other dishes are good but there are better offerings if you don't mind a drive."}
{"text":"A nice spot located in the same plaza as B Trust, Owl of Minerva, and other popular go-to Asian restaurants in the west end (around Burnhamthorpe Road and Central Parkway, not too far away from Square One). We visited on a Saturday evening and it was quite busy - if you are visiting at peak meal times, consider making a reservation.  First, atmosphere. This isn't Tremendous (Mississauga-ites know what I'm talking about!). The decor is fairly modern, it's quite clean, and there's a good amount of tables. They also have private rooms for large groups (but the private rooms don't have windows, which is the downside).  Second, the food. If you're not careful, you could be eating something very, very, very spicy (and I can usually take a fair amount of spice!). We ordered the Green Beans (with Ground Pork), and the Bamboo Fried Chicken. We also got a bowl of plain white rice. Tip - we initially thought we didn't want any rice (I know, shocker), but the beans were so spicy that we needed the rice to balance it out. Overall, pretty tasty, and we would get both dishes again. Lots of flavour, a variety of spices mixed in, and well-cooked.   Not a bad choice in the west end, and what we had was quite delicious. We will be back."}
{"text":"Surprised this place has so little reviews and with such a bad rating o_o My wife and I come here as often as we can, but it is a little far away from our house.  We used to go to the Mississauga location quite often before this one opened so we're happy this is at least closer to us.  Food quality is very good and their ??? is one of the best you can find in town. It's considered a more pricey chinese restaurant, but it's worth it in my opinion since you can really taste the difference with most of their dishes.   I have not their their noodles or anything.. but all of their actual dinner items have always been good imo."}
{"text":"Happy to have a great Sichuan restaurant in Mississauga. I've made multiple visits here and the go-to's are the spicy bamboo chicken, deep fried chicken, mapo tofu and stir fried green beans. The spicy bamboo chicken is flavourful and the spice level isn't too bad, although I feel my spice tolerance is higher than most, I feel that it is at a decent level. The deep fried chicken is also very tasty, with its abundance of Sichuan red peppers, it is not mouth-numbing like others I've tried at different restaurants.   Their mapo tofu is a Sichuan staple and a must order. The tofu is pretty spicy but there's something about it that keeps you wanting more. Good flavours and a very large portion make it the perfect accompaniment to any of their entrees. The stir fried green beans are very crispy and the little pieces of fried ground pork add a nice salty flavour to the dish. You'll be needing this to counter the spiciness of Sichuan cuisine.   The house special fried rice also goes well with any of the entrees, my gf and I felt that even though it was spicy, it was very tolerable considering the first time we ordered it, we asked for it to be mild which was unnecessary. Also, the beef roll comes in a large portion and the sweetness is a great counter to the heat of the dishes.   Overall, I'm happy that I don't have to travel all the way to the east end when I'm craving Sichuan and I recommend this place to anybody that likes spicy food."}
{"text":"Two words Pork Hock!  Probably one of my favourite dishes of the night. I went with six other friends and we ordered a total of 14 different dishes. Yes, 14 different dishes. Nothing was left. The food was really good. Spicy when it needed to be and sweet when it needed to be.   The only challenge we were faced with is, no one at the table spoke Chinese and it was hard to communicate to the staff what it is we wanted. Maybe they just didn't believe that we were going to eat as much as we were ordering.  Fooled them :)"}
{"text":"I used to dislike this place because of the poorly maintained store. However they recently renovated the place and I am shocked by how much it has improved. The place is now well kept, nicely decorated, and the owners are more professional looking :)  They have very authentic Si-Chuan food, most are spicy. I usually don't eat spicy food so the dishes here are way too spicy for my tastes. But they are delicious if you can handle it. It might be hard to order here if you don't understand Chinese. They are pretty smart and put a lot of pictures in their menu. All their nice dishes are on there so it's safe to go by the pictures."}
{"text":"If you like spicy food, then you should definitely try this place out. They have a huge variety of spicy Chinese food.    Love the service here. Once you place an order in the food comes out really fast. The waitresses are really friendly and are always available if you need anything.    The lamb skewers are really good!"}
{"text":"Authentic great tasting Chinese. Very nice decor, we'll be back!"}
{"text":"Came here for my friend's birthday and they served a party of 8 at one of their larger round tables. Although I've been here plenty of times before I've never actually noticed how terrible their service is.   We ordered 8 dishes in total including various pork, chicken and fish dishes. Their food was absolutely delicious, I'm a big fan of spicy food so I really loved their authentic SiChuan cuisine. If you can't handle spice then this is definitely not the place for you. The food on the menu was the only enjoyable part of my experience at Red Lotus ().  The waitress spoke in Chinese through out the entire dinner despite only about 4 people at the table were Mandarin, and one guy was clearly white but that was the least of my complaints. Our bill came to a total of $107 which was paid by the birthday girl, however she only had $100 cash on her so I pitched threw in whatever cash I had left in my wallet which was approximately $12, we realize this isn't enough for tips so everyone else was in the process of looking through their wallets for change. As soon as the waitress saw that we had money placed on the bill ($112), she rushed over and took the bill from my hand, then she proceeded to count the money and gave our table a strange stare, she said (in Chinese): \"this isn't enough, you guys only have $5 for tips, this is not enough, you need more. -eye roll-\" While she was complaining about the amount of tip she got despite the less-than-satisfactory service we have received all night long, my friend who sat beside her has already taken out her cash and was waiting to put it on the bill, after hearing her complaints she slowly placed $10 on the menu....and our waitress said: \"yep, now it's enough\" and turned to walk away without another word.   After this incident our table was slightly put off by their request for more tips, but as I was complaining, some of my friends who eat here more frequently than I do told me that this is definitely not the first time this has happened, apparently when the tip is anywhere around 10% or lower then they will say you have not paid \"enough\". To me, this is outrageous...I've worked in the service industry throughout high school and being a waitress I expect tips when I deserved it (by having a good service attitude). So upon reading some other reviews which showed complaints in their service as well I feel that the restaurant should really consider training their waitresses properly or hire some new ones which actually have the courtesy to speak english to a table that is CLEARLY not all Chinese."}
{"text":"We came here for dinner and ordered spicy beef noodle soup, sweet and sour fish and Homestyle Tofu dish. The fish was not that sweet and it was good. The noodle was nice and spicy and the tofu dish was great. Service was VERY slow. I think that they had one chef cooking that night because there was a large table who ordered alot of entrees and kept having plate after plate being delivered to them. We were a table of 3 and waited for about 30 mins before our food came. Waitress wasn't too friendly. Even though the food was ok, I don't think I will be returning because of the service."}
{"text":"Would recommend food under the Best of the Best section. If you're a spicy food lover, this place is one of the best options in Mississauga. It does get pretty busy during weekend dinner times. Food portions have decreased in size over the past few months but tastes have not changed."}
{"text":"This is the last place I would expect to have a Northern Chinese Restaurant.... But here I found Red Lotus!  Red lotus has quite a standard menu one can expected from a Szechuen restaurant. In fact the menu is quite nicely done with a lot of nice photos! I wish the food would have tasted as good as the photos...  Lunch Specials till 3:00 pm for $8.99 which includes a drink and spring roll but nothing interested me there since most of the choices are rice based with just 2 stir fried noodles.  Spicy Beef Noodle Soup ($8.99) is huge and just like bottomless...... I wish the noodle was better but it was just regular noodles and a little under cooked! The broth does have a nice beef aroma but lack any spiciness. The beef chunks were dry and chewy and have a texture and taste of beef jerky.....  The deco though is really nice, similar to Asian Legend with use of a lot of dark wooden colour.  If you are in the area, give Red Lotus a try ...but I would not suggest a special trip for the experience.  They do accept credit cards!"}
{"text":"It's located in Golden Square, which are surrounded by so many restaurants. Obviously, it's a Sichuan cuisine. Yujie and I ordered the Spicy Dry Pot, super yummy. Full of locus roots, pork, mushrooms and vegetables.  The cumin mushrooms in aluminum foil, hmm, below the average. Not worth the money. Highly recommend this Chinese restaurant, if you are a spicy teeth lol"}
{"text":"Good dishes here so far:   Beef with spicy noodles Spicy fried lamb Steamed or pan fried dumplings Chef special fried rice (I think that's the name?) Delicious Pot Noodles (nice bland chicken soupy taste)  Mediocre: Beef and broccoli Mushroom mix with broccoli Beef and egg soup? Dan dan noodles (way too spicy and salty the last few times I got this)  Not a bad record so far! The best part is the food tastes authentic and not americanized. The food does come out a bit slow though. The young servers like to chat a lot rather than work."}
{"text":"Was pretty good.  The food was pretty salty and spicy.  Just make sure to ask to make it less spicy"}
