{"text":"Love love love this place.

Great prices, service, food and always so clean!

I've gone 3 times and can't wait to go again."}
{"text":"Not bad at all! Will be back to try other food items, solid 4/5! Price is good also. For a pho noodles is 7, curry rice 8, lunch prices"}
{"text":"My family frequented Red House in Pickering and was pleasantly surprised to find the owner at this (not so new) joint in Ajax. Apparently they have relocated and are dishing out the consistent homecooked style thai dishes we love! 

The apps and thai curries beat your average spring rolls entrees hands down! But dont expect to be impressed by their Pho. Go to an authentic Pho joint for some soup, but come here and get what the cook is excels at...decilious authentic thai grub. 

Wishing RED KITCHEN much success in your not so new home!"}
{"text":"Tasty food! Very fresh.  Portions could be bigger though.  Friendly service and very nice decor."}
{"text":"Staff are really nice and polite..... food is great (best Thai in Ajax)..... love the chef's curry and the pad Thai.... cashew nut chicken is awesome!!!!!"}
{"text":"Love this place, tasty food and fast. The lunch specials are also perfect. Tropical spicy beef is my current favourite. Staff is very nice and helpful."}
{"text":"Friendly service and the pho was pretty good! It's a little pricey than I'm used to paying for a bowl of pho. But the portions are a good size and a large bowl is more than enough for me. All I had was the pho, but I will definitely come back to try more of their menu. This place is still quite new and I hope they stay for a long time. They are just walking distance from where I live and I love Thai and pho!!"}
{"text":"We dined here with great expectations based on the review, but was disappointed with the flavour and taste of the food. We've had Thai in other places like SukhoThai, GoldenThai, etc and the taste and quality of food here was the lowest ever. All the curries were 'watery', and were not at all thick, and had very few pieces in it. There was no flavour or spice in the curries, and overall experience wasn't great."}
{"text":"One of my favourite lunch places. The lunch combos are a great deal.
Check it out!"}
{"text":"Food is fresh and delicious, staff is friendly, attentive and helpful and the prices are great! 
What more can you ask for?  This was my first visit but certainly won't be my last!"}
{"text":"While I've done take out from here at least ten times, I can really only comment on the red curry. It's so good I never want to try anything else! That perfect blend of just a little spice and creamy coconut base. Made with fresh veggies and tender chicken (not that usual rubbery Asian food meat). 
One of these days I'll try something else, it all looks and smells delicious, but you can't go wrong with the red curry!"}
{"text":"I go here on a semi-regular basis. The food is quite good and reasonably-priced. My only complaint is that I seem to have trouble getting my bill at the end of the meal. Once I have finished eating, the servers tend to avoid the table. Other than that small complaint, service, comfort, food and price are good.
Update: Jan 2017
The issue of the servers avoiding tables has become too much to bear. One server obviously looks the other way and runs past our table to avoid eye contact. I just want my bill! Or maybe a drink refill!
But the last straw was recently when my wife was ignored for half an hour. Then, with an Uber waiting, eventually paid a bill with cash, and waited for change. Server disappeared. Change never came. Server knew she had to leave and basically kept the $12 change as a tip. Not cool, Red Kitchen. Bad Karma on you."}
{"text":"The food + service was great, price same, it was the best meal in ajax that we have had in a very long time."}
{"text":"It's my go-to Thai spot in the east. Food is fresh and stays hot as take out even after a 15 min drive home. The Coconut Rice is da bomb"}
{"text":"Excellent Thai food. I love the roti canai. Also the cashew chicken is fantastic. Very nice and friendly people."}
{"text":"Had a coffee and a pho and I thought it was rather bland.  Gave it a stir and BAM! Flavour town.  Restaurant is a little whitewashed, doesn't have the charm of a mom and pop shop but sometimes that is what you want"}
{"text":"OMG the cashew nut chicken is sooo delish!!! It's the tastiest Thai cashew nut chicken I have ever come across! 
I actually tried to make it at home the next day but :( I'll just get my cashew nut chicken from the Red Kitchen! 
Both times hubby and I came here, the food and service has been superb. The lady (owner?) at the counter was very friendly and pleasant. Service is fast and prices are reasonable :)"}
{"text":"My go to for Thai food. Best Green curry, Thai chicken soup, and even the Pho is outstanding!"}
{"text":"Great food agreeably served with polite service.  This consistently delivers good Thai food at a great price"}
{"text":"Great Thia/Vietnamese restaurant - excellent value for a diner or a group. Tasty fresh home made ingredients, great portions & presentation, friendly attentive service, plenty of parking and definitely worth the drive, if you live outside of Ajax.

The Chef knows how to COOK!

Definitely worth a return visit."}
{"text":"Was here for the lunch special. 8.25 for a green Curry chicken two spring rolls and a drink not a bad deal. 

Green curry could use a little bit more love. By love I mean coconut milk. 

My guest very much enjoyed the pad Thai"}
{"text":"Love the food.  Mango salad is the best I've ever had.  The restaurant is small so seating is limited.  Definitely need reservations."}
{"text":"Whenever I see a 3+ star Vietnamese place pop up in my search in Durham region, my heart skips a beat.  I'm such a huge noodle soup lover and always on the lookout for a new joint to call my new go-to place for Pho.  After reading reviews for the Red Kitchen, I thought maybe this could be the one.  Sigh...

We ordered a rare beef pho lunch special which comes with 2 mini (they're really mini) and a choice of coffee or tea and a bowl of bun bo hue.  I've been a fan of bun bo hue ever since I first tasted it in Pho Metro (scarborough) and have tried this delectable soup in many other Vietnamese joints and I'm sad to say, this one was the most dumbed down version of this glorious soup I love so much. 

The broth for the rare beef pho was so bland and lacked beefiness umami.  The meat was ok, I think.  I was too busy digging into my own bowl of spicy (well, it was supposed to be) bun bo hue.  As far as the lunch special rare beef pho is concerned, I don't think I'd order it again.  

Bun bo hue suffered similar fate as the rare beef pho but with more transgressions made against such a signature dish.  First of all, they had the wrong noodles for this soup.  They served the same rice noodles that was in the pho, not the thick round noodles bun bo hue is supposed to have.  From there on, it was a lack of a whole bunch of ingredients (shredded red cabbage, onion, Vietnamese bologna, blood jello...etc) that made this dish so disappointing.  The broth didn't taste enough of the lemongrass or the sweet/salty/sour balance or even the beef.  There was a good amount of brisket and rare beef but asides from that, there was nothing else.  Literally....

I'm sad to say that the Red Kitchen did not impress me.  I'm willing to give it another shot and try something else but it won't be any time soon.  

Next stop, the Pho Metro in Ajax!"}
{"text":"Must have dishes - Roti canai and Shrimp in sambal sauce. 
The service was great and we got our order within a few minutes after ordering. 
Everything on the menu looked delicious. 
This place is certainly not rated as it should be. 
A must try place if you are looking for some yummy Malaysian or Thai food."}
{"text":"Their pho & other soups are great. Really enjoyed the bon bo hu. Rice dishes were alright. 

Service is fantastic. Staff were very welcoming & attentive.

Would definitely come here again."}
{"text":"My hubby and I are big fans of this place! Its our go-to place to order in Ajax. The pad thai is amazing!  The red and green curries are also really good, full of flavor, just a bit too spicy for me. Definitely recommend!"}
