{"text":"This was my first time at this location. The set up was decent. Service was trash. I was treating my friend out for his birthday. I waited at the register due to the tables were crowded and seating wasn't available. After waiting 20 minutes Jordyn (curly hair, fair skin, medium height female) asked why didn't I sit at a table for service. I explained that the tables were occupied but I was ready to order. I could not place my order until I was seated. After being seated I waited another 15 minutes. The icing on the cake was when my PHOTO IDENTIFICATION WAS HELD DURING MY ENTIRE VISIT. This never occurred when I visited the location in Noda. New rules for new guest I guess. I will make sure I tell my friends to not waste their time nor money!"}
{"text":"I have been to many hookah bars/lounges and none of them compare to Red @28th. My first visit was January 2012 and from the first moment of being greeted by the staff I felt right at home. They treated me like they've known me for years. The atmosphere is laid back during the early evenings where you can bring your laptop and do homework, read and even take a nap. At night this is one of THE places to be, great music, incredible drink specials and if you are into it amazing games of pool. If you have never been here before you are seriously missing out on a great time. DON'T FORGET if it is your birthday let the staff know and you get one of the best collaborative \"Happy Birthday\" songs sang to you. Last but not least every night has a different theme night. With all if that said I definitely give this place a 5 ratings."}
{"text":"This place use to be awesome , however they have hired some little woman who is mean, nasty, and rude... and as the saying goes one apple
Spoils the batch... my friends and I left after this little woman yelled insults from behind the bar . You are NOT valued as a consumer here it's like they are doing you a favor by taking your money!!! There is a waiter name Ken there who is the only upside to that place. Other than him... the whole place sucks! Do yourself a favor and go to the stache house!"}
{"text":"Yo! Dis place be needin' mo' couches, you know what I'm saaaaayin? I mean like its cool n all, but dayum these chairs be maaaaad uncomfy yo.

Hook me up with some comfy couches and I'm all over this joint. They got some mad good books up in here, like the biography of Danica Patrick - that dope NASCAR girl. Yeah man, this place tight.

But bring a cushion, cuz those chairs be hella no good. And don't bring a large group... they'll make you squish."}
{"text":"Whether you are a hipster, an intellectual, or a sophisticate, this is a very cool, eclectic, chic place to visit-the vibe is wonderful! I contacted the owner with a few baseline questions before coming, and the response was friendly and fast. They do have a dessert menu, along with drinks, but I didn't try any of them. Lots of books to read while you hang out, or bring your own! I am not a fan of hookah bars, but here is an exception. While I was there hanging out for casual chat with a group, we asked them if they could adjust the volume of the music for us, and they did so graciously. Once we were mostly done with our conversation and I did tune in to the music, I noticed that they were playing a very nice mix of jams that reminded me of high school/early college days, with some early adulthood groove thrown in. The medley of mismatched furniture, reminiscent of a comfy living room from the 70's, is a perfect blend for the overall theme of the place. This, along with the pleasant atmosphere and easygoing vibe made for a super-cool place to spend a pleasantly casual, lazy weekend afternoon."}
{"text":"I've been to Red@28 and every time I've gone there its always busy there. The staff is cool and very knowledgeable about the recommendations of the hookah to try. They have security there and you always feel safe there. A lot of times it's hard to find a place to sit do to it being packed but over all a good spot. I never knew there was a spot you can goto and really enjoy yourself without doing the club scene. I've been to other hookah spots and and there no way close to the vibe you feel here"}
{"text":"Been coming here for over a year. And the place is always great when bringing your friends or family here. Servers are great at what they do. A lot of times I've come in at its been packed but still able to get my order in at a reasonable time. Would definitely recommend this for everyone."}
{"text":"We had a fun time here last night. Going early is a good idea - we got a great spot at 9:30, and when we left at 11 or so it was packed. The staff was good about replacing coals and keeping our drinks going. They had a $4 special on vodka cocktails - pretty weak, but you sort of expect that. Nice casual vibe. The music was good, mostly mainstream hip hop, but GET SPOTIFY PREMIUM! Listening to Spotify Free ads was pretty ridiculous"}
{"text":"A nice little hidden treasure, I will definitely be returning back. The drinks were awesome, the environment is laid back, low key, mellow, and reserved. Hippie vibe, overall great experience. Would be a nice date for a hookah and some drinks!!"}
{"text":"This has been one of my favorite hookah bars in Charlotte for the past couple years. During the day it is laid back with nice hookahs, a good TV and a nice selection of books. Around 6 the music picks up and by the end of the night it is a different world. 
Sadly they got rid of the pool table but it makes sense with the increased popularity. So does the added bar, expansion and even a food truck service. I'll be back."}
{"text":"Hookah is the best in the Clt. Seems to be a student hang out nothing wrong with that. I came here for the hookah and my experience and drinking experience was great. Prices are cheap too compared to Crave. Definitely will be back"}
{"text":"This place is across from Amelies.. stopped by Amelies first and got some snackies to take with me. The hookah was real good, fruity flavor. When I was there, it was kinda empty. This place needs to find it's image. It looks cross between a library, someone's den, and someone's man cave. There is also a really strange red room in the back that was dimly lit that had some glassy-eyed drunkies.....scurred me. 
Overall I had a good time smoking some hookah and watching a game on the tv. The only drawback is that the only music that plays is from a jukebox ($1 for 2 songs). They have a house stereo but it's kinda shitty and doesn't play loud. I would definitely come here again with some friends to shoot the shit and smoke some hookah"}
{"text":"This place is ghetto as f*uck, hood people, bad service. They serve drinks to people who are underage. There is no cut off for drinks so you can find people puking outside, starting fights ect....ALE needs to shut this place down"}
{"text":"Ratchet with a capital R.

This place actually used to be pretty chill.
When I was in college, they had cheaper hookah, cheap drinks, board games, and the owner was friendly. 

It was never super crowded, but not dead either.
The back room was a private and semi-peaceful place to smoke and converse with friends.

But then summer of 2012 happened. I don't know how it happened, but this place had an underaged ghetto revival.

Anybody who was anybody and under age 20, decided that reds was the place to be, even though they weren't old enough to purchase the alcohol. But they could smoke hookah, and oh, the hookah did they smoke. 

Reds was no longer a chill place for a 20-something to have a relaxing night with friends, but it became a hotspot for the hyper, rowdy, and jobless late teenaged punk.

So, if you're into craziness sans liquor, reds is for you. I need a few shots before going here.

I've moved on to bigger and better hookah bars. I suggest crave if you're looking for upscale, and casablanca cafe in university if you're looking for a quieter, more mature crowd."}
{"text":"Use to be one of my favorites but I recieve poor service and I am one of the regular I would recommend university location"}
{"text":"My favorite place to come chill and smoke hookah. They have a great selection of flavors and an awesome bar. The staff is welcoming and don't make you feel like you're just another customer. I honestly don't even need to pick a flavor most of the time, because Lillie will always make a great recommendation. The environment is very relaxed and just feels like a place for you and your friends to come hang out and enjoy your night! I wish I lived closer so I could come hang out all the time!"}
{"text":"My cousin and I were visiting from NY and decided to try Red after the concierge at our hotel recommended it. 

Great spot. Laid back, chill atmosphere. Everyone was super nice especially our bartendar Kesha. She was so friendly, funny and super sweet. Our drinks and the service was awesome. We even tried and enjoyed our very first Hookah.

We will def visit if we are ever in Charlotte again."}
{"text":"This place is such a chill spot. It looks like it's just a coffee shop but they also serve drinks and hookah. The night I went had a very eclectic crowd but it somehow all meshed together. The DJ was great which helped a lot. Our waitress was real cool and very attentive. Definitely my new cool spot."}
{"text":"Worst service I had in years in any lounge I visited before, these guys are lazy, and an order to eat took them about 2 hrs to make. Imagine how bad the cheeseburger was..."}
{"text":"Nice spot, a little small but vibes were all good. Hookah was tasty, waiter was very attentive. Tried everything but the food and no complaints!!"}
{"text":"Used to be one of my favorite hookah spots in charlotte. Service has gone way down in the past 6 months. The bar tenders refuse to serve you if you've ordered drinks with a server at any point in the evening. The issue with that, is the sever takes 25 minutes to reappear and you have to flag them down to make another order. I won't be visiting anytime soon, there are other hookah bars in charlotte that will gladly accept new business."}
{"text":"Love coming here even when wait staff attentive and Santana is always on time to bring life back into your hookah. Will definitely keep coming back!"}
{"text":"I came here to write and enjoy a coffee.

Everyone else seems to come to smoke hookah.

I will say, don't come for the coffee. I don't think it's something people come there for. I say this because when I said I was there for a coffee I received a look of disbelief. And then when my coffee arrived, it was in a cup with a lid that had so much dust on it, I knew it must've been sitting for a while. 

Other than that, I liked the relaxed atmosphere and it seemed as if people knew each other and sat around chatting and hookah'ing. I liked the seating, as it was comfortable and I felt that I could camp out there all day and write."}
{"text":"Standard hookah bar. Crowded. Looked like they had picked up random pieces of furniture from Goodwill that I was afraid of getting bedbugs from."}
{"text":"This place has horrible costumer service. I've been waiting 2 HOURS for a burger with fries. And our waiter is chilling smoking hookah. DO NOT GO TO THIS PLACE."}
{"text":"Being from NY. I used to like this spot because they played good music but it's a Saturday night.. there no DJ, only a juke box which no one is paying for so it's playing old school R&B music. I asked for a corona with grenadine & they didn't have any so I got a $8 drink with no ice & they gave me the drink posted in a small cup. I used to like this place & come a lot but after tonight, it through me all the way off and I probably will find another hookah lounge. It was TERRIBLE!!"}
{"text":"This is an unusual place which is good and bad. It's part bar / bookstore / hookah / whatever else happens to be going on. I went there just to hang out and it's a good thing I wasn't too hungry. I bought one of the pre-packaged sandwiches and it was quite old. The beer and wine selections are quite limited. The hookah is the draw.
If you're in the area, this isn't a bad place to drop by and see what (if anything) is happening. Otherwise, it's not worth the drive."}
{"text":"I've been there and enjoyed the place, I wanna tr t an get there when there's not so many people I hear it's hard it's always packed. I'll definitely recommend this spot to others because my husband and I really enjoyed the place"}
{"text":"This place was great !! If you are looking for a chill simple atmosphere with great Hookah this is your spot !! They have books and the place is cleary for all cultures!!

My boyfriend and sister-in-law threw my father -in-law a birthday party here !! It was a simple party where we could bring our own food. The staff was amazing and treated us very kindly !! They helped the details, payment, and everything else go very smoothly !! Cory hooked up the details for us to reserve the extra room and our waiter, she was an african american female, I hate I didn't get her name but both of them were spectacular !!!

We had the Ron Burgandy, Holy Grail, and Rick Ross Hookah and they were amazing !! I surely do recommend this place"}
{"text":"This place is TRASH!! All servers are sub par. I watched my server give an underage girl multiple drinks without checking her ID and when I confronted him he just laughed and walked away...needless to say I've already reported them to ALE, just thought I'd post this review to warn people of what kind of \"business\" this is."}
{"text":"My wife and I went to checkout this place last night to try their hookah(despite the poor reviews).  Interesting concept, but poorly executed.  Young, college-aged crowd, terrible service, cheap decor and furniture....and a serious I don't give a F$@%k attitude from all the people who worked there.  We stayed about 20 mins waiting for service and finally walked out.

Not a place I'd revisit or recommend."}
{"text":"The new location is quiet and has lots of comfy couches. The hookah prep was timely and well executed. I was surprised by how good the coffee there was. I'm pretty critical of cappuccinos, but there wasn't much to complain about. The baked goods were rather mediocre, but everything else made up for that. 
It's also stocked with interesting books you can just pick up and read while you smoke or drink coffee or whatever. 
It would be a great place to study or do homework."}
{"text":"There Are very few times when I have a hookah that is absolutely perfect!!!! And this place is a key place u can say is a perfect spot all the round and really make u feel welcome!!!  I love bringing my girl here!!!"}
{"text":"I am the bar manager here at the university location of red@28th and Everyone leaves as friends or knows you by name which is the part I really like! It's always a great time every night of the week! Come hang out on d.j. night Monday and Fridays and I'll take care of you! We're connected to the wild wings on mallard creek!"}
{"text":"I went here for my birthday and the bartender got me super drunk. I love the crowed everyone was supper nice. I went on a busy night so it took forever for our Hookah to get to us but I was able to drink and enjoy the night with my friend and the people around us so I didn't care."}
{"text":"I was surprised that this location serves food now! Hookah is always great but it's a musttttttt to get their early cause it gets packed easily and you'll end up cramped in a corner somewhere. I hate the fact that they started charging a cover but understandable with the business they've been getting lately. The bar is not my favorite because depending on whose back there it could take days to get your drink and might not even be what you ordered but I've also experienced some good bartenders here as well. For my first time, I ordered the loaded wedges, which were good but way too salty like first bite may cause high blood pressure. I am interested in trying more foods though"}
{"text":"I don't come to this location much because it is always packed, which results in waits for drinks and hookahs. So usually the service is pretty bad, especially compared to the other location in  the university area. BUT tonight we had Jamal, and despite having to wait for a hookah (not his fault) we had good service from him. No wait for our drinks, and he actually checked up on us relatively frequently despite being so busy. Some of the best service I've received here!"}
{"text":"I like Red's. Really chill atmosphere and daily specials. I usually go for karaoke on Thursday's or Soulful Sunday's, which most times is a hit. Eclectic & mixed crowd, can't complain. Will be back. They have plates fresh to order too and their website shows the daily specials"}
{"text":"I was recommended to Red by a friend who knows how much I love hookah. I moved here recently and so far I've only found 1 solid spot prior to this, so I was pretty skeptical coming in. However, after sitting down and having some hookah, I was pleasantly surprised. 

-  The Venue is fantastic. It may be a little cramped with too many tables but once you have a seat everything is fine. There are also couches available if that's your cup of tea. It's pretty loud but not at the club or EDM concert loud. A nice buzz where you can still have a good conversation with friends which (for me) is perfect. There are TVs everywhere which makes it perfect to come for a game.

- The hookah is on point. They pack the bowl very well and have the coals burning hot by the time it reaches your table. The biggest secret is that they have Al Fakher as their lower priced hookah selection which is AWESOMEEEE. It's definitely my favorite brand of shisha and the fact that they carry it makes it a winner in my book.

- Drink Specials - They have daily (or on most days) drink specials which usually include a beer (awesome). Well played

Overall, I'll come back over and over while I'm here. Great spot."}
{"text":"There are a few places that i come for hookah.  

This place is very convenient for hookah because its right outside of amilie's french bakery! I have not seen this place where it is not crowded.  I say the hookah prices here are very reasonable for the amount of choices you can get.  Don' be sketched out by this place as it is a little older than others but this place is still very friendly.

This place has a dim setting with pool tables and tables.  Its a nice place to chill with your friends in a chill environment.  I believe there are special ddays where hookahs are discounted but i do not remember which days.  The employees are fairly nice as they are very helpful.  There isn't much space in this place so do come here first to grab your table.  If you do end up waiting, it won't be for too long as it clears up pretty quickly.

I probably come to this hookah place the most because it is very convenient and on the cheaper side of things."}
{"text":"The prices are ok. The service sucks. We ordered a beer and never got it. But I see the server running around taking care of other tables or having personal conversations. Not a good experience for the first time. Plus there is no food. They couldn't even make a liquid marijuana because the bartender didnt arrive yet. Just sad."}
{"text":"Did not appreciate the service nor customer service. I came Here last month for birthday and my waiter (who was one of the managers) had something very important to do so he didn't take our drink orders nor did he recommend any other staff to come to takeover my table. Me and my friend waited 35 mins for someone to come over and then had to wait another 35/45 mins to get our food. I got there at 9pm didn't leave until a bit after 11 ...smh 
I enjoy the atmosphere but the service has to be better and hospitality .."}
{"text":"Great spot to enjoy a moving Sunday morning worship experience ...every Sunday @10:30am...great word, great music brought by the Movement."}
{"text":"If I could put a lower rating I would, they took 45 minutes to get to our table and had nothing but terrible attitude the whole time...not including they don't except out of state identification cards even if your over 21....the waitress claimed that's a law in North Carolina but I have yet to find any proof."}
{"text":"Hoookahhhhhh. I've been here twice, and what can I say? It's mostly a dense smokey aroma of hookahs and people hanging out. Great if you have a table, not so great if you dont. So I'll break down my visits.

First time:
Got a table. Not bad. Relaxing. Played some UNO with my friends and just chilled out. Hookah is definitely relaxing, and I have to say it's a guilty pleasure of mine. There's plenty of things to do here. I saw people reading. People talking. People playing pool. People doing homework. So, possibilities are endless. Definitely a place to chill out though.

Second time:
Didn't get a table. A little sucky. However, we sat at a bar and ordered a Hookah. Staff is really nice and we got serviced really well. Started messing with the Jukebox that they have. I think the best part of messing with the jukebox, which you can request songs on your phone, that you have the ability to get everyone going crazy about a song. And yes. I'm going to brag and say that I did that very thing. It's funny because I played one of my childhood songs and well, the rest is history.

In conclusion. This place, is pretty awesome. Drinks, are a little meh. But if I were to go for drinks then I would be disappointed. However, the atmosphere, the hookah, and just relaxing. Yes. I'll most likely be back if my guilty pleasure arises when I'm in town."}
{"text":"This was my first time going to reds and I absolutely loved it. The atmosphere is amazing and it's a great place to go chill. The only thing that I would say is that they need some more chairs and maybe some up to date music"}
{"text":"First time here a couple months ago. Really enjoyed my time and thankfully they serve alcohol which is a plus. Good music and atmosphere would definitely go back when I visit home again"}
{"text":"Red @ 28th recently opened a new location a few months back in University and I have absolutely fell in love with it. It has the same artsy and relaxing feel as Amelie's but... theres alcohol and hookah! This is a great place to go with friends or even just by yourself to relax and study. They offer a variety of hookah flavors and offer re-packs for only $10. The thing that I love about this place is that it provides a great atmosphere to just lay back and enjoy conversing with your friends without the overpowering music that most bars and lounges have. I feel like I'm just lounging in my friend's living room with a full service bar staff. I would definitely recommend this place to others, especially UNCC Students."}
{"text":"Nice spot to relax and socialize with friends. Good prices, great service, chill atmosphere."}
{"text":"I'm very impressed with the sincere hospitality shown in this hookah lounge clubs . This lounge shows a very Zen and chill environment. I was very please with the employees named Avi and Zacharee. They gave great suggestions and the music was good. Chill during the day Poppin at night. Definitely coming again new favorite hookah place in charlotte"}
{"text":"Good hookah & great atmosphere. Definitely a good spot to hit up after work."}
{"text":"Fun atmosphere. Gets packed on the weekends. Good music. Good drinks and tasty hookah flavors. Love this place. Visit often."}
{"text":"First off, if you are using an iphone to find this place you might miss it. Its not on 33rd, but rather on 28th (as the name suggest).

This place is very cool, free flowing, chill joint with a feel that is opposite of Crave. Crave is not bad, but its very \"chic\" if you can call it that, and Red at 28 is more like a relaxed local coffee joint. 

The service was not bad, but it was difficult to identify who was actually working there. I went there on a Tuesday night and stayed there until 12AM. I was happy with the service and hookah. I wish I could go there again, it brings something different to Charlotte."}
{"text":"Great Vibe and Atmosphere! They always have different events going on different nights and very diverse crowd! Friends and I love the mixed selection of daily drink specials and hookah menu! Have to check out this location and the other 2 as well."}
{"text":"Def a great place to chill and smoke a hookah!  Tuesday nights is ladies night and a good chill spot! Met some great people here"}
{"text":"I guess it might be unfair to describe Red@28th shisha as the worst I've had since I've moved to the U.S, and many of you wouldn't agree with me. I'm sorry but it was-for me. and I wouldn't come back. Also, if the spot is categorized under Coffee & Tea and I ask for coffee, I wouldn't expect them to suggest that I get it from Amélie's! Just sayin'.
Anyway, the shisha cost $15 and $10.75 before  8 o'clock.

Two Yelps."}
{"text":"Red@28th bills itself as a multicultural literary lounge, and that's an awkward mouthful, but it's true. There aren't too many places in Charlotte where I've seen such an eclectic crowd, from 20 yo tattoo kids to 60 yo dreadlocked artist types. Swing jazz to alt rock gets play on the speakers, and the hookah is a nice draw, especially in the back room, which is tricked out a bit like an opium den. 
The place is big enough to host a game of pool while the chess club meets, and patrons can still curl up with a book undisturbed.
They've got a decent wine and beer selection, priced just right, and cupcakes if you don't feel like walking across the hall to Amelie's. Check the flatscreens for events like book signings, film screenings, after parties and other fun stuff. I think I've found my CLT hangout."}
{"text":"I went here in the afternoon with some girlfriends for my first hookah experience. And it was amazing, the worker was very kind and friendly and gave me a few tips and recommendations.
I was even talked in to buying a cupcake which was the best thing I'll regret later. 
The environment is a divey theme, Though the place could appear more well kept, I would still recommend to a friend!"}
{"text":"Came in for coffee, was told renovations were happening in their kitchen and they won't be serving coffee again until completed.  I may come back and try their coffee then.  I like the chill vibe of the place, but I don't think I would appreciate the hookah smell on an early Sunday afternoon coffee date.  I'll try it again when I know what to expect and they are actually serving coffee or espresso."}
{"text":"I went to Red at 28th one afternoon for a hookah.  I've only been once, but I will be back.  The hookah was probably the best I've had in Charlotte.  I had the double apple flavor, which is my go-to, standard flavor.  The woman running the counter said it was al fakhar shisha, which in my experience is one of the best brands.  The hookah was just the right temperature and the hose pulled absolutely effortlessly. 

I can't say what the night crowd is like, but during the day it was exactly what a good hookah hookah bar should be.  Lots of old men playing chess, music playing in the background, relaxing furniture, and a lot of books around.  The drinks were basically self service during the day and not too bad of a price; domestic beers were $3 and imports $4.50, but the hookah was only $13 which is pretty reasonable."}
{"text":"It's a nice cozy place. They are supposed to have food, but every time I go... they are either out of propane... or somebody shut them down(the food). Please don't say that you have food, when you really don't."}
{"text":"Red @ 28th gets dope once they start playing music! Wish it was bigger but you end up socializing amongst others and the food is good and the drinks are strong!"}
{"text":"If I didn't have to I wouldn't even give one star. HORRIBLE SERVICE! I've never left a review but I'm sitting her for the past hour waiting for a coal. This is my second time here and we came back because we had a good experience the first time. Our waitress hasn't checked up on us even though we went up to her asking for a coal after mean mugging her for 20 mins. Pathetic. After waiting an hour we got up to pay and didn't even finish our hookah. Confronted the waitress and she has the audacity to say \"I'm sorry I didn't know!\" Asked to talk to the manager and he wouldn't even talk to us and chose to talk to the waitress instead. No compensation for the poor service or not being able to smoke what we paid for. Manager was a guy named Vince or Vincent. Let's just say if you're expecting to be respected and to receive the service you're paying for DO NOT GO HERE! I can pay the same price or lower and receive higher quality hookah and service at many other locations in the Charlotte area."}
{"text":"Great bar. Great drink specials. All the people who come here are so nice and I always feel welcomed! If youre looking for a good drink and a good time come to this place."}
{"text":"To be fair, I went to Red at 28th for a special event, not a regular visit.   Just the same, I was not impressed with what I saw.

Tucked behind Amelie's French Bakery, Red at 28th is a hookah lounge and bar.  They advertise themselves as a \"multicultural literary lounge,\" and I'm left wondering what that means.  You can find a selection of well-read books throughout the interior, but nothing that really screamed \"multicultural\" (though, I wasn't probing).  But it was brightly decorated, had a small stage, spacious bar, and plenty of tables and sofas for hanging out.  The whole place had a trendy feel, without trying too hard to be trendy.  I could see it as a place with a lot of \"regulars.\"

But really, it's a hookah lounge and bar.  I know nothing of hookah, so I'll stick to the bar.  It was mediocre.  All their beers were bottled, and all their wines generic.  The snacks they had on the menu (which was a challenge to read) seemed to either be packaged foods you can get at any convenience store, or a few treats possibly from Amelie's next door (I could be wrong on that one, though).

The staff seemed hit-or-miss.  I encountered three people working.  The first was pretty nice and conversational.  The second seemed busy at work preparing a hookah.  The third, well, let's just say I've encountered nicer people.

All in all, it seemed fairly okay for what it was.  If I end up there again with a friend, fine, but since I don't live on that side of town, I'm not really going to go out of my way to visit Red at 28th."}
{"text":"I've been part of this company for over 2 years, starting in our NoDa location before working primarily at this university location. I absolutely love being here; everything is spacious and it's still just as homey. My co-workers and I do our best to give customized service to the variety of customers who find their way into our establishment. We have daily hookah specials before 8 pm and daily drink specials every night; come in on Wednesday to get $10 hookah before midnight. Come see me Thursday to Sunday and request a superman, great way to start your night and get you in flight. Remember, great service deserves great tips, whoever you have take care of you; remember to return the favor and take care of them. We have karaoke on Tuesday, Trivia on Thursday, DJ Yasmin young from power 98 (4-7pm) and DJ Daddy D (9pm-1am) on Sunday, and DJ beezie beatz on Monday and Friday. If you haven't been here yet you're missing out! We're looking pretty amazing but we'll only get better; come be part of the family while we're still growing."}
{"text":"It's a Wednesday night. They were slightly crowded but that still doesnt excuse our server for never showing their face to us.   Been a while since we had been here so therefore, we waited for service at the counter. Eventually we were told to take a menu and sit anywhere. 

And there we continued to sit. 
We won't be returning anytime soon. 

Surrounding charlotte has some amazing places to hookah. Make sure to check them all out before using this last resort"}
{"text":"We have been to Red several times and the only word to describe this place is \"eclectic\".  Now this word cannot be thrown around on a whim as there can be both a positive and negative version...as for Red...it is definitely positive.

Unlike most hookah bars in and around the Queen City, Red is absolutely the type of atmosphere that provides a place for everyone to feel comfortable to hookah.  There is a sketchy back room that I've peeked into a few times only to find very intoxicated individuals that may have indulged in more than tobacco. To each their own. 

Moving on to the fantastic parts of Red: the quality of the hookah, incredible wine specials, a jukebox that accepts credit cards (dangerous), and great design.  Almost every night I've been we have been able to get a bottle of red wine for $15.  Is it the fanciest wine you will ever drink?  No, it's actually probably one of the cheapest you will drink. But that's neither here nor there...it's cheap wine and perfect for hookah.  

The next huge plus (and perhaps the most important) is the quality of the actual hookah.  They have a huge variety of different flavors, and if you know the right people you can partake in some of the coolest combinations I've ever had.  There is constant coal service and the hookah lasts forever...without losing flavor or intensity.  The quality is one of the best in Charlotte (and I've searched far and wide).  If you have not smoked hookah before or are bringing along a beginner, Red is the perfect place to get great flavor for the newbies and high quality for the more experienced. 

Lastly, one of the best parts of Red is the actual design and decoration of the facility.  Some may view it as a confused or cluttered look...and I would think they are crazy.  It is mix between retro, hipster (yes I said it), and stoner.  There is tons of antique furniture and different styles of seating from retro 1950's kitchen tables to french antique sofas and chairs.  Another incredible part is the massive amount of books featured throughout Red.  Old books, new books, fiction, non-fiction, and beyond.  Throw in the board games scattered about the place and you have everything you need for a long, entertaining evening with friends in a relaxed atmosphere. 

Is this the ritzy, trendy hookah bar common of Uptown?  No...and that is probably my favorite part.  If you need a comfortable night out wth friends or even care to venture out alone to partake in hookah and catch up on your reading...Red is hands down the place you need to go."}
{"text":"Tucked in the corner of this plaza, Red at 28th is a hidden bar/hookah lounge where you can have a drink, relax, and people watch. The drinks are reasonably priced and it isn't very loud. There are televisions that are visible if you're sitting at the bar, but this is far from a sports bar.

There are several flavors of hookah, $10 before 8:00. No more than $20 afterwards. The waitresses are attentive. The problem is figuring out who works there, as there is no uniform, name tag, or commonality that signifies an employee. I understand the hipster vibe they're going for, but a wristband or something would be very helpful.

There are no fancy drinks here with foam or puréed anything, mostly just juice and liquor. Nothing wrong with keeping it simple. Just managing your expectations. Last, but not least, they do not serve food here, but you can bring it in from the diner next door or Amelie's. Because I like low key spots where you can come as you are, I enjoy Red at 28th."}
{"text":"Its a Really a Excellent place to Hangout. And the Happy hours are amazing. I feel like just as home."}
{"text":"Red 28 is a hidden gem in NODA, I don't think I've visited a spot since New York that is this cool, quiet, chill and laid back spot in the day then turns into this soulful and eclectic spot by night where you can smoke Hookah, have a cocktail and listen to live music while hanging out with friends.

I've visited Red 28 twice to read, chat with friends and have a cocktail. We played a few of their board games which some are missing pieces or no batteries but I'm assuming you lend them out so much that pieces tend to not find their way back but regardless very cool spot.

Last trip was for hookah, drinks & live music and I can't express how awesome the night was and the live music was everything.

My only critique is it took so long to get a server that received quicker service by going up to the bar. We eventually got to order hookah which took forever to come and more friends showed up so we ordered another that never came. The server was trying to charge us for drinks that we purchased from the bar so the billing process was very messy, time consuming & frustrating. 

Outside of that, this is a very chill spot and I highly recommend it to all, Very Diverse"}
{"text":"I happened upon this place after waiting at Amelie's for a friend who had to cancel.  I saw the sign \"Red\" and descriptive words, such as literary and food.  I was intrigued, not only as a person who was starving, but one who has appreciation for books.  The entrance was not welcoming.  For one, there was a sign that screamed \"surveillance camera.\"  The folding chairs jammed together at the front entrance gave the impression that this place was either closed or not ready for business.  But, the door was unlocked, and I entered.  The room was empty except for a lone woman working the bar.  Me, being the friendly person that I am, called out, \"hello!  What is this place?\"  The woman, who had less personality than a lug nut with heavy eyeliner said, \"it's a bar.\"  As if I didn't know that.  After all, there was a bar in the place.  There were book cases against the wall with books that appeared to be for decoration.  And, shockers!  In a place that touted itself as literary, there was a huge TV.  Reading with Jerry Springer blaring in the foreground?  I think not.  But, back to being hungry.  The sign said \"food\", but our anti sparkle barmaid said there was none.  I proceeded to chat with her (why, I don't know.....oh yeah, I am friendly) regarding a similar concept bar in Asheville.  It was a monologue actually.  She probably wanted to get back to that book she reading on the sly.....no, that's a stretch.  Well, I thought the name \"Red\" had to do with books.  Now, I am sure that it has to do with necks."}
{"text":"This is my first experience at this place and it was a good one. I came on a Sunday evening, the wait staff was charming, the live band was dope and the DJ was on point. I'm a NY'er and coming to Charlotte to chill for the first time has been a great experience. I will definitely come back and get that slamming pink lemonade hookah!"}
{"text":"This place is awesome. We came here for a low key night during the Thanksgiving weekend and I was thoroughly impressed. We ordered drinks and hookah and the drinks were perfectly mixed, not too strong and not too watered down. The service was great and the atmosphere was just the right vibe. Our server Corey, who is also the bar manager, recommended the hookah flavor and it was right on point. He was so attentive and he alone would guarantee another visit from me. I am out of town from the DC metro area, and I wish we had a venue like this. Thank you Red 28 and Corey for making this night just what we were looking for"}
{"text":"Hookah lounges aren't really my favorite, but the other evening I was out celebrating with a bunch of people who love it, so we ended up at Red.. for me, mixed feelings overall.

We arrived and there was already a wait for hookahs, and since there is a maximum of three people per (without paying an additional charge) we ordered two. After about fifteen minutes the first one arrived and my first thought was wow, this is tiny compared to any other one I've seen (but what do I know). So, we were left with one hookah and three tips at a table of seven for about thirty minutes. Finally we could grab someones attention and she mentioned there was still a wait for the second, well great - mind if we get at least a few more tips in the process? It's not like we're trying to be cheap here, but this isn't really fair. We eventually did, and after receiving the second one eventually got someone to bring us new coals (I believe two or three are included the initial fee). A fairly constant stream of comments regarding the lack of potency, hookah size, coals, etc continued from those that are big fans of the activity, but I have very little to compare it to.

At the bar area there were two girls. One was there to take/make drink orders, and the other was there for hookah orders, and even though they kept crossing over each other behind the bar they made it abundantly clear they knew nothing about the other person's job (so why do you keep switching places??) The woman knew her hookah, no doubt, and if she had the time I'm sure she would have loved to go into detail about all the products they offer... but the bartender was a little green. (I believe they just added the liquor part) She not only was unsure if they carried a beer that is clearly listed on the board behind her, and happened to be pictured on every table's specials sign (one of the guys had to describe the color and the writing on the can so she could find it in their fridge... yes, a normal household fridge) and then made it very obvious she was hoping we wouldn't want ice in our mixed drinks... um, is it really too much to ask? Also, I haven't seen anyone measure a pour in a long time, but she did. 

There's a jukebox, a pool table, an assortment of books, lots of seating (apparently really nice set-ups with tapestries in the back), some table games, and apparently they have DJs stop in weekly... but overall its a little too college-y and a little too not my thing. But if you're looking for okay hookah in Charlotte, give it a whirl! (I was just happy I could pick up some breakfast from Amelie's on the way out)"}
{"text":"Visited here again and had a much better experience. Hookah was reasonably priced in comparison to competitors but remember that you get what you pay for. We got pineapple and it was good but nothing special.
 
Pros: 
-Lillie, our server was very attentive 
-Cool, Hipster Atmosphere/Diverse 
-Daily drink specials 

Cons:
-Little walking space in main/front room
-poor ventilation in front room 
-some patrons loud and obnoxious"}
{"text":"Red @28th is decent spot in the University area that's open late. Parking is kind of funky but they are easy to get to. They have a million different specials going on such as $10 hookah before $8PM in addition to drink specials. I believe that they are going to be moving toward memberships. 

I haven't ordered food here so I can't judge the options. The drinks are not properly made at all. You can tell the bartender free pours everything. As a true adult- I like my drinks made the proper way but I'm sure the younger crowd doesn't mind since all I tasted was pure alcohol. The drinks are served in plastic cups, which is a huge turn off for me. They are the cheap water cups that one gets from restaurants... I'm sure they can afford to go down to Ikea and get some cheap, nice looking glasses.

The hookah is pretty good though! I have come here strictly for the hookah multiple times and have never had complaints. Staff tends to the coal and shisha appropriately without asking most of the time. 

The main downfalls are that service is hit or miss and the drinks aren't well made. I will definitely return for the hookah though since it is a good price and they have a variety of options. They also have outdoor seating which is a great option when the weather permits."}
{"text":"Good cupcakes. But only plain coffee. No cappuccino or latte or anything, unlike their menu. I was hoping it was a good coffee place. It's not. More a bar and hookah joint for the UNCC area. And the music is not what I'd call relaxing. Next."}
{"text":"I'd just moved to Charlotte and we stumbled on this place while walking the plaza. It has an eclectic and chill vibe fit for intellectual conversation or casual socializing with friends. 

They have a nice size library if you want to read, a like box for music, and plenty of couches/chairs to hang. 

I believe we may have chosen a slow night or came too early because there was only a few people there. As we were leaving a small group of friends gathered for a game of cornhole. 

Oh - and I think they had a book signing event prior to our arrival. I'll certainly be back on another night!"}
{"text":"Came to visit from out of state. I am a hookah fanatic and have been to many hookah bars/lounges. We had a party of three (cover charge $7 each) we sat on the outside patio and waited for 20 minutes to be greeted. The server couldn't believe that we weren't helped, took our order and told us that she would see if there were any available hookahs that were clean since they were busy and that she would be right back to let us know. She also told us that the wait for a hookah would be 30 mins max. We said that was fine and she told us she'd be right back to let us know about the availability...We waited for 40 minutes without seeing her or being helped by anyone else. Granted we visited on a Friday night , it took us an hour and a half to get our money back that we payed for our cover charge. The only thing the manager did was hand us our money and say \"sorry for the inconvenience\" ....I don't ever take time out of my life to write Yelp reviews.... but I definitely wasted my Friday night here and was really disappointed. Don't want the same to happen to you."}
{"text":"We came in yesterday around 11 and found the place PACKED! We were able to find seating in the back, but it was the very last table that only fit two. We sat for a while, the server took a little to come over. When he did come over, I like the fact that he was honest with me and told me we are expecting about a 30 minute wait on hookah..there were more customers than hookahs. We got up and went to Istanbul in Brevard Court. 

Come early to ensure you get a hookah! We will be back here at an earlier time so we can actually enjoy the hookah...and get Amelie's afterwards too. Though, I did see a cupcake stand near the cash register at Red@28th. The daily drink specials weren't that bad either."}
{"text":"This place is attractive. I like how roomy it is amd the crowd was a fair amount. The hookah is pretty good and the layout is clustered. The customer service was a little less than average but the place is still ok. I was traveling through and stumbled upon this place. All in all i would recommend this place to try to someone looking for a chill spot to watch the games"}
