{"text":"Really standard diner food. Their grits are amazing. So creamy and delicious. The waiter gossiped to us about past clientele which I thought was a bit off color. I really enjoy the food and it's located in the EpiCenter, so it's very convenient."}
{"text":"Stopped in briefly at the recommendation of some colleagues. Lindsey and Fab provided top of the line service. We would go back just for the pleasure of interacting with them again. I cannot stress enough that this is was one of the best customer service experiences that I've ever had. 5 Stars with no hesitation. Give these two a raise!!!!"}
{"text":"Food was decent but the service was horrible. Appetizer came after the entrees were served. People's drinks were not kept refilled. The waitress cleared our table after we sat there with empty plates for at least 10 minutes, then disappeared and didn't bring us the check. We had to flag her down to get the check. We won't be back."}
{"text":"Walked into this place last night and was amazed to see it was packed, yes they do get very busy but have a bit of patience and stop complaining. I was expecting a wait but we were quickly seated by the hostess. Me and my buddy just wanted some good dessert so I went with the Ultimate Brownie and our waitress Shelby recommended their special Chocolate cake so we got that too. The desserts hit the spot and they were amazing BUT the best part of the experience was our waitress Shelby who was SUPER friendly and made sure we enjoyed our visit...you won't be disappointed if she is serving you (she is so genuine). I was so impressed by her service that I got her name tattooed across my chest :-P.

Thank you Shelby!!

This place has earned a spot in my list and I will definitely return to try their food next time (It did look gooood)."}
{"text":"Pros: 
Food was good
Cons:
Staff on their phone taking selfies, fixing their hair or makeup, Music that had cuss words in it, only rap music plays, not a diverse working staff, they don't serve milkshakes after 9, the man that sat us threw our menus on the table and wasn't friendly, no public bathrooms"}
{"text":"Have tried the new Diner twice this week. For only being opened 1 week it is pretty good. The staff seem anxious to please. Got the shrimp and grits. The grits are delicious and creamy. The shrimp were very tiny and not many of them but what was there was tasty.  The music was up way too loud and it was blaring a very distasteful nightclub type music- not appropriate for a family friendly diner atmosphere. Came back and tried breakfast food. Had the grits again, which were wonderful. We were seated near the kitchen and the cooks and expediter were communicating loudly- they need to be quieter to maintain a relaxed environment. This place can be a real gem if they work out the kinks in making the diners feel comfortable."}
{"text":"Good food at the price point.  This place just opened and the staff seemed well trained and there were none of the rough spots id expect to see during the first couple of weeks a place is open. Very clean.  Only gripe was the steady stream of hip hop ballads blaring from the jukebox monopolized by the staff."}
{"text":"This is some of the best comfort food in Charlotte. The staff are really friendly and the atmosphere is sort of \"sports bar-meets- 1950s soda shop.\" 
They serve a great breakfast. The French Toast is massive thick-cut challah bread and some of the best we've found in Charlotte.
The pancakes taste like they're made with cake batter! Soooo good.
The grits are the best in town. Ridiculously creamy!!
Leaving fat & happy!"}
{"text":"I love that you can get breakfast all day here.  So far it is the only place in Uptown open at lunch that does this.  The service was excellent with Sherrod and I love the atmosphere.  There are a ton of options and although I've only tried a few dishes so far, I have liked each one.  For Uptown, the prices are very reasonable especially considering the amount of food you get."}
{"text":"We go to their sister restaurant at Southend a lot.  Gets busy at lunch but service was good and food was as good as the other location.  Similar price point too if I remembered correctly.  Overall a very welcome addition to the choice of restaurants uptown."}
{"text":"Food was good until my wife but on an egg shell.  This is so disappointing that I wish it had not had happen. Got the delivery from Postmates and the food was hot and good just the egg shell.  Might give them one more try in the distant future.."}
{"text":"Terrible management - late night arrival and restaurant is not crowded. Guest had to stand outside for more than an hour to be told the kitchen is closed? Are you serious? Employees walk in front of customers order food and leave. Security advise us that employees has first choice  for service. My party left and was never served. I would rate no stars if I could. Sad sad sad.... Management has no experience with a 24 hour establishment - employees over customers. Awful !!!!!"}
{"text":"Redeye is amazing!!!! Great food and great music!!! The staff are amazing!!! This place is evolving into becoming the number one diner in Charlotte. People don't miss out on the diner food and friendly service. Come in and hang out with the diner crew. See you there with smiling faces and our doors are always open."}
{"text":"I loved this place!  Kamiya was an amazing waitress.  Very kind and helpful.  Always pleasant and accommodating.  Actually one of the best waitresses I've ever had.  Thank you so much for a wonderful breakfast!!"}
{"text":"Me and two friends went here because we heard good things about it and wanted a semi-quick good meal. We ordered our meals and about a half hour later our food came out, in which we were each missing one thing off what we ordered. We told our waitress who apologized and swore she would fix the issue. Within another half hour we reminded the waitress about 3 times of our missing meals, we eventually paid for what we did get and never saw the rest of our order. And no, we did not tip her generously. I still hear people say the food is good but the service was so terrible that I will most likely never go again. I do not recommend."}
{"text":"First diner experience and loved it! The ribeye steak dinner and service were 5 stars"}
{"text":"The best fried chicken in Charlotte!  The burgers are excellent as well. Great flavor and their fries are hand cut and whatever they are seasoned with makes them even better. Everything I've had here has been outstanding. They hand bread their chicken tenders and you can tell. I don't use sauce when I eat chicken tenders so I normally have to add salt and pepper but it's not needed. It was tender and juicy with plenty of flavor. The firecracker chicken sandwich taste like orange or sesame (minus the sesame seeds) chicken but on a bun. Even the spaghetti was awesome. It's meaty and not tomato tasting. Definitely homemade."}
{"text":"The manager Jordan Chaffin treats us like family.The servers especially Toni and Mike are fantastic. The food is always delicious. We recommend this diner to everyone who wants to well. The cheesecake is the best I ever tasted!!! Thanks Red Eye Diner for great service!!!!!!!"}
{"text":"If I could leave less than a star I would. Tonight I lost all hope in humanity. There was a homeless guy in front of us and he shows the guy who was sitting everyone that he had enough to buy himself a meal they turned him away and said they had no room they couldn't seat him inside but he could sit outside if needed be but they had a booth for our 4 top that was behind him in line and plenty seats at the bar area. Our seat or those could of easily been his... the guy that was seating people said it was what management tells him to do... good job management this is the first and only time I'll be here."}
{"text":"I'm standing in line waiting to be seated while there are 6 tables open. Why you ask? The kitchen is backed up because they have too many orders coming in at one time. Well, it's easy. You hold open the tables until the kitchen can catch up. Then you seat those open tables all at one time. They then put in orders all at one time guess what? The kitchen gets overwhelmed again. One would think this obvious. Listening to the apparent manager lecture the hostess not to seat anyone, it's VERY clear he doesn't understand. Came for the crunchy French toast. Left because of the inept manager and whacked out system of seating."}
{"text":"The food was horrible the waitress was even worse. So I ordered a caesar salad that came without any caesar dressing. When I tasted it I quickly asked did they put Italian dressing on it. The waitress goes to the kitchen comes back out and said no it doesn't have any dressing I have to get it for you. After giving me the dressing she asked if it tasted better. I told her no. She goes to the kitchen again and comes back and says it was tossed with oil and vinegar which I couldn't understand why. Anyway Manager comes out apologies for food agrees with me that the taste was not right and explains the mistake made by the kitchen (it was tossed with Italian dressing). He agrees to comp my semi eaten salad. As I go to leave the waitress has the audacity to say so I don't get a tip. I continued walking, but then decided she was right. I went back in and gave the manager a dollar and said tell her great job she just bought a customer. By the way the honey cheesy bread tasted amazing too bad I won't be eating it anymore. Sidenote: This isn't my first complaint with the diner just the one I felt needed to be heard."}
{"text":"What a disappointment! The diner was not busy and we sat for at least 15 minutes waiting for a server to come to our table before we got up and left. We were seated next to the server station, multiple servers stood around and talked to each other. We had been seated for about 10 minutes when the manager walked over to the sever station and asked who was going to pick up our table. They all walked away from her. Multiple servers continued to walk right passed us."}
{"text":"This place was recommended to us by our hotel staff after they first recommended Buffalo Wild Wings and we let them know we could get that at home.  We ordered four different dishes so we could share and sample. Everything was great. This is the FIRST place outside of home that has really good biscuits and gravy.  The shrimp and grits was excellent as was the fried chicken. I really don't understand their rating not being a little higher."}
{"text":"I thought my grandma made the best grits - but this place is unstoppable (sorry grandma!). Food was delicious on all accounts - a great place to stop in if you visit NC."}
{"text":"Wonderful experience. Great people, fast service and nice to have breakfast food at any time in Uptown."}
{"text":"The previous reviews red the waitress standing around, while customer, waiting to be seated in a near empty diner, are TRUE. Not only that, as soon as I was seated, Andrea, my server asked if I knew what I would like. No, it's my first and last. I asked for water with lime, I got water with lemon. She came back at least 2x asking if I had decided. Finally, I chose BLT and \"Homemade Onion Rings\" with secret sauce.  From my point of view, these were the thinnest slices of onion with hardly any breading, instead of being wonderful slice of heaven, they were hard, chewy. Took only 1 bite of one. Put it back, The portion sandwich was ok, thankfully it wasn't on large bread. It was served in two halves, lots of lettuce, nice slice tomatoes and thick bacon."}
{"text":"Easy E, or so he calls himself, is charming enough to be a server at any restaurant. Including high end steakhouses. At these type of places the food is always good. Why? Because how is it possible to mess up American classics? I ordered the fried chicken a waffles. The wife got the bacon cheeseburger. Both were satisfactory. Not the best we've ever had, but good. What stood out here is that we arrived after midnight and easy E was lively and welcoming. I wish I could put in a call and get this guy a the best gig available."}
{"text":"I tried so hard to like this place. It's definitely a less-greasy and super delicious duplicate of Midnight Diner but the service is TERRIBLE. I've come here 3 separate times now and each time I've waited over an hour for food. The second time I came, our waitress didn't come back to our table with the check we asked for 3 times for 30 minutes. I just ordered takeout an hour ago to avoid the service (because the food really is good) and when I arrived to pick it up, no one had given the order to the kitchen and, yet again, I waited for my food for 45 minutes."}
{"text":"It started shaky. We were seated but our server was not informed about us.  Then she came by and took our drink order and I asked if they had the eggs Benedict. She went back to check if they did and promptly came back to tell me that they did. The poached egg was perfectly creamy. I love that."}
{"text":"I checked this spot out earlier this month and definitely said I would be back seeing the full bar wasn't opened yet. My second trip was well worth coming back for. This place is massive folks! The host could have been a little more friendlier but I went straight to the bar anyways. I am not sure where they found their bartender Mich but she is utterly breath taking and definitely made my second trip worth while. Very personable, food came out super quick, she was running circles around some of the other staff! Ive had friends say service is hit or miss here but I cant complain! 

I will be back to try the infamous Shrimp and Grits for sure as well as the scenery behind their bar!"}
{"text":"Service for Sunday breakfast was prompt and attentive. Had a great experience and would definitely recommend Redeye as a great place to start the day."}
{"text":"So the coconut french toast was the best french toast I've ever had! Like really, I've had good stuff other places, but it's crunchy and sweet and the challah bread is so good. Perfect. Obviously I am still dreaming of it...everything else was fine. The service was great and friendly, my sides were good/average, the coffee was strong and the place was super clean. I think we got there before the Sunday rush, so maybe the bad service reviews are when they're super busy or something? Overall I would for sure go back."}
{"text":"We LOVED the Redeye Diner.  Customer service was superb, food was great and the prices were very reasonable.  If I ever return to Charlotte, I will definitely return to the Redeye!"}
{"text":"Breakfast today. 10:00 am not crowded. Asked to sit in front in empty space, told no we had to sit in back. Started badly wanted to order special , chicken and waffles but was told would take 30 min. Just got short stack, just fair not fully cooked. Other dinner had eggs over.      easy  were over cooked. Toast were two soggy not toasted slabs of bread. Sorry food here simply is not good. Service eas just ok. Can not recommend this place starting with bad seating. Too bad."}
{"text":"Food cooked to order.  Ron was spot on with his recommendations for us being first-time customers.  Good service and the food was great!"}
{"text":"Ms.Patty was awesome. We really appreciated her patience with our table and that she was able to accommodate us accordingly."}
{"text":"The Redeye Diner was a nice surprise. Last night, before going to the theater, my family  and I was looking for something in walking distance, on a cold dreary evening, from the BofA parking garage. We walked over to Epicenter and saw the Redeye Diner. I was a little hesitant because I was looking for a higher end restaurant, but my family agreed on the diner. The service was fast and great. Everyone there was very friendly and helpful. My wife ordered the shrimp and grits and loved it. I got a club sandwich on rye with waffle fries and loved mine as well. Mother in law got a fried chicken dinner and said it was very good. They even have a good selection for the kids. They both cleaned their plates. I thought the prices were very fair. My only complaint would be my unsweetened iced tea tasted a little funny, probably because it was old due to the fact \"northern\" tea doesn't get drank as fast as sweet tea in NC. All in all it was a very good experience. We will definitely visit again."}
{"text":"Best place ever a lot of the waitresses are amazing but my favorite by far is Uriah she's extremely friendly and attended us constantly. We love her and she's amazing!!! Definitely going back the food is really so good it makes my mouth just water looking at it"}
{"text":"Good food served hot and fast. We were a party of 4 and were seated quickly. Fried chicken like Momma's. Shrimp and grits are tasty but a bit spicy. Shrimp tacos were good. The chicken noodle soup was very good with large pieces of chicken in it. Overall definitely a good place for homestyle food. We will definitely be back when we are in the area."}
{"text":"Five star rating, guys! We're long-time regulars from the Midnight Diner and are just as happy here as we are there. The food is absolutely fantastic, it's given in filling portions for reasonable prices,  the atmosphere is relaxed and styled like a throw-back from the 50's (complete with jukebox!) Add the amazing staff who work here (shout out to Shelly, Shannon, and Dave!!) and Ernie who likes to get to know people as they come in, a couple times here will have you making the Red Eye Diner a regular dining experience in your life. Keep it up, you guys, what you have is something spectacular and I make a point to tell anyone and everyone who asks me."}
{"text":"Same exact menu as the midnight dinner which is a bummer. Would be nice for them to have added something new to the menu. Th foods good but nothing special"}
{"text":"I've had chemo treatments that were more enjoyable than my experience here. Food was alright, service was far and away the worst I've ever had."}
{"text":"Clean and friendly atmosphere. Instantly transported back to the 60's. The food is fresh, well cooked and the plates are generous. With reasonable prices and really friendly service (Patty was the sweetest!), you can skip the pricey hotel meal and stop by the Red Eye. Their breakfast menu is available all day and I saw a few folks partaking in the chicken and waffles! Stuck to my norm and ordered 2 eggs with hashbrowns and sausage links (which were some of the best I've had)."}
{"text":"Well the 'diner' appeal aesthetically is pretty much the only thing this place has going for it. We went on a Thursday night and there wasn't a long wait at all. Our server came over promptly and brought waters but after that she got really, really slack with her job. Her name tag says she was the shift manager and I'm not entirely sure how she actually got that position, because she certainly is not a pillar of management I would look up to. The food was less than stellar and, at best, just edible. I got the spaghetti with meat sauce and you could tell it was definitely straight out of the jar or can. Got to pick on pie for dessert and it was OK, but again, less than stellar. Basically, if you want great service and a really great tasting meal, don't go to this place. It's terrible and I will not be back. There are many more better options in the Epicentre."}
{"text":"Love this place. Went 2 days in a row for breakfast and have been here numerous times. Th wait staff is excellent as are the hostesses. The mgr stopped by our table to check on us-Shelly is super!  Love love love the food. Would go there for every meal if I could. Not sure why so many negative reviews. This is hands down one of my fav places to eat."}
{"text":"We loved our server E! From the start E made us feel comfortable and excited to EAT. His recommendation on the Coconut French Toast made my mouth water, he talked me into it and I LOVED IT! This was our anniversary weekend and E and the other staff certainly made this part memorable. I love that everyone seemed to be friends and had one another's back. It felt free in this Diner, and super happy. I loved everyone's energy"}
{"text":"Odin was a great server.  He had great recommendations for breakfast. We ordered off his recommendation the French toast which was to die for and the pecan waffle with whipped honey butter. Great place and great atmosphere."}
{"text":"Ordered To Go food. Not only did it take almost triple the time I was quoted, it was slow and all of the employees were playing around. The yelp pricing shows to be inexpensive, that is definitely not true. My order was way more expensive than I was expecting. My food was cold and mushy by the time I got it. 

Update! 
I wish I could give no stars, because this place is ridiculous. First of all. I was hung up on, while ordering food. The place wasn't busy. Maybe 5 customers split between three tables. I ordered the buffalo chicken sandwich as a wrap and was given the chicken ranch wrap, with buffalo sauce. I was told they couldn't do a buffalo wrap after a certain time.... which is insane."}
{"text":"Good food. Reasonable prices. Good atmosphere. I will be back.  I had night time breakfast and the food came out quick and just as I ordered. The entire staff was cleaning the whole time I was very impressed. Good attention to details."}
{"text":"A great diner and fun atmosphere was taking care of by Shakira and their manager Shelly.  They made it fun with smiles and great food, gave the feel of the diners in NY were people welcomed you as a regular."}
{"text":"Miss Patty is freaking awesome!!! We love the atmosphere!!! Obviously, you all don't pay Miss Patty enough!!! Definitely the spot after hours!!!"}
{"text":"Service was horrible.  We were a party of 2 with 8 employees at the front counting money one advised they were all on break.  The very timid manager seated us. But noun until after I stated there are 15 other restaurants in the Epicenter that will not make is wait.  The food was ok.....the manager gave us $1.00 of of our order...... I assured her that I would Yelp this visit.....  WOW!"}
{"text":"The food is okay if you're looking for late night eats after a night out on the town. But you could get the same from another diner with better customer service. Tonight, my friends and I were harassed by an overzealous security guard, even though he received no prompting from Mgmt to act in such a manner. In fact, mgmt was on our side, but the guy was still power tripping off a badge, and was extremely disrespectful. I made a formal complaint, but am unsure if much will be done in regards to this manner. If you want to patron an establishment that supports a security team that treats its customers like criminals, this is the place for you."}
{"text":"The Red Eye Diner is a near miss. I have eaten there 3 times in 2 weeks and each time the service was poor. The wait staff wears  scarfs, that hang into the food (in prep and in service).
The cooks in the kitchen can't tell a hamburger from a turkey burger. The food is at best is just average. The desert prices are ridiculous for a diner environment. A small slice of cake is over $6 and they don't have basic apple or cherry pie."}
{"text":"Service is extremely slow. Food was cold and bad. Hard the mess up breakfast food but they did. First and last time coming here"}
{"text":"I came here at 1:20 AM. We had a group of 8. We all ordered like normal. However, it is now 2:12AM and our food was delivered as promised except for mine. I had the corn beef hash plate. 

It seemed like there was a commotion going on so our food was delayed, but the service has been terrible since my drink is still empty the entire time I have been waiting for my food. 

This is inexcusable service for any restaurant. They have offered to comp my dinner but I cannot let terrible service such as this go. The waitress did not know what I had ordered and we have had no refills on our drinks.

I will never come back to this establishment again. Mark my words."}
{"text":"I had a terrible experience here last night due to your over zealous bouncer at the door who refused to allow us entry because I mentioned having to use the restroom. We were actually going to eat and do eat here late nights. He straight up profiled me, probably assuming I left Bubble, and treated me like my business wasn't welcomed when it is every other time and when my and guests money are being spent. You should really address him (the one who choked someone out last week) about being more customer friendly. He is the reason I gave this place a 1 star and I will be very sure to tell ALL my guests to stay away."}
{"text":"Hey Melanie H,

Are you serious?

You went on Thanksgiving day?  Why are you surprised?

If I went on Thanksgiving, i'd be more surprised if they DIDN'T spit in my food.

'I went to get my haircut and my hairdresser's water broke.  All that girl could talk about was how excited she was about her baby.   I was like, 'Girl.....  Finish my haircut.  Ain't nobody care 'bout your baby,' said heartless Yelp reviewer."}
{"text":"We had breakfast here during early afternoon. Good thing we had a lot of time;, eggs took at least 15-20 minutes to be served yet the diner wasn't busy.  Having said that, the food met expectations, our server was very friendly, and the diner was clean and bright. TVs visible everywhere and continuous oldies play in the background.  It's open 24/7."}
{"text":"1st time visiting Redeye Diner. Very friendly staff that provided great service!! The shrimp and grits were amazing!! The food was price right. The music and atmosphere were great too! I recommend it for families also. My daughters love it!"}
{"text":"My wife and I have come here for breakfast, lunch, dinner and late night. This diner stays open 24hrs a day and while having sticky tables and slow servers at times it is consistently cheap, open, and tastes ok. This is not a place to go if you are a complainer about little things. The servers are alway super nice but it's hard to get ahold of them after you order and get your food. I've never had a table that didn't have some syrup on it somewhere lol, but yet I go back time and time again because the food is good and this spot is open all the time. Go here but understand this is a classic hole in the wall type of situation. Because this review is so conflicted I will plainly say that yes I like this place."}
{"text":"This place should have better reviews.  I thought the breakfast was good and the people were SUPER friendly. Cute diner with good prices"}
{"text":"Visited this restaurant on a whim. Great decor, reminds you of a old school dinner. The waitress staff was really personable and made great recommendations. Tried the chicken and French toast. Chicken wings were JUMBO sized, had 3 but could have had only 2. French toast was flavorful as well. Pricing was reasonable. Downside they don't validate parking. They are also open 24 hours which is great for late night craves."}
{"text":"Very very Slow. Security wouldn't let my boyfriend out the establishment w/o showing he paid for his meal. He ordered his food (something simple) when an hour had passed and he still didn't recieve his food.. he left the waitress a Tip and attempted to leave. Security got into an argument with him because he didn't have a receipt.. This place is horrible. If you must eat here order to go..it will take about 2 hours for them to make your food."}
{"text":"READ PLEASE.

After going to a number of restaurants for breakfast and being told the wait would be 30-40 minutes around the 11 o'clock hour, we ended up here and were pleasantly surprised.

Customer Service: We were seated immediately. Our server CASSANDRA was on top of things the entire time. She took our drink and food orders right after being seated, and checked our drinks very consistently. GREAT SERVICE! 

Food: We ordered the Bubba and the Greek omelette. Everything was warm and cooked well. The food was good, but not great. 

For being a diner, it's definitely worth a try!"}
{"text":"My wife and my first time here on Christmas Eve!  Service was amazing, Joshua was hilarious! Best grits in Charlotte...hands down!!!  #We'llBeBack #Browns1stChristmas"}
{"text":"This is a really well-made (great interior decorating done, great design) 50's-style diner.  The have good grilled cheese sandwiches, and the prices are very reasonable (especially with the Yelp discount!).  The staff is kind and pleasant (and competent).

On this trip I had the fried chicken, with macaroni and cheese and a salad.  It was some of the best (most crispy) fried chicken I had had in my life.  Juicy and tender too!

On my first ever trip to Charlotte, this place was a great find!"}
{"text":"We went here for brunch on Thanksgiving Day during the parade in Uptown. The staff were all checked out talking about partying, going out, etc. very loudly across the restaurant. Some of the staff were complaining about having to be there. On top of all their yelling, the music in the restaurant was incredibly loud to the point where we had to ask the manager to turn it down.

The food was okay. Nothing special, even with all of the many options on the menu. You can't really mess up breakfast. I can imagine this is a good place for all the drunk people out on the weekends."}
{"text":"Our first time here and we had an incredible Christmas Eve experience. Our red headed waitress, Emma, was awesome! The food was well prepared and the portions were amazing. I have to say however, our waitress made the whole experience! She was funny, personable and made us feel right at home! My wife had chicken and waffles and I had breakfast (at night) we both loved our meals.. If you stop here to eat, YOU MUST ask for Emma. She will put a smile on your face with her bubbly personality."}
{"text":"Staff was quick and got my family seated quickly. It had only been open a week, so I couldn't order any alcohol. That's fine, though. My waitress was fun and personable and interacted with my children, which is a plus considering how nerve wracking taking small kids out can be. The food I ordered was great. I had the firecracker shrimp, which I liked a lot. I also ordered a hotdog on a whim, which was good, too. My wife was very happy, which is the only part of this that matters. We'll be back. And maybe when I'm partying in Uptown, I'll drag my friends over for a bite to eat."}
{"text":"Wow!  We unexpectedly had to stay overnight in Charlotte due to a flight cancellation. This place was recommended to us for breakfast. It was fantastic!  The service was extremely friendly. Our food was delicious. The biscuits and gravy, French toast, and grits were our favorites."}
{"text":"I was in town for CIAA weekend and this was the closet 24/7 place to eat from my hotel. My waiter Adrien was very good and showed great customer service. I was going between the shrimp and grits and the French Toast, and I ended up getting the Coconut Crunch French Toast with strawberry topping, egg whites, hash browns and, turkey sausage. The sausage was a bit dry while the rest of my food was somewhat cold, and I think the strawberries should of been on top instead of the side. The hash browns was a bit greasy but edible. I enjoyed it and was fulfilling before my flight back to NY. I'm sure after the clubs that they have in the area it's a great place to eat. I can say it's better then Denny's but not better than IHOP but they have a better selection."}
{"text":"Horrible service.  Walked in, overlooked by servers to be seated.  Then hostess came in from outside, got sat in the corner.  Waited 5 minutes, no server until a guy came over and asked if I was helped.  Wrong drink brought over.  Seeing plenty of staff talking and on their phones.  Food and greasy.  Hashbrowns was dripping in grease.
To top it off...the hostess then got into a fist fight and hair pulling match with two other girls.  All of a sudden, screaming and hitting.  Shockingly, the hostess wasn't told to go home, where was the manager!!"}
{"text":"I have frequented the epicenter often for several years, had a great time at the rooftop 210. Friends went to the diner to wait in line and get a table around 2am. Understandably this is a busy time, I asked the doorman if I could sit with my friends and he stated parties are only sat when everyone is there. Understandable. My party had already been sat for 4 of 7 people... I pointed to their table (from standing in line) the door man shrugged then stated \"you're not getting in tonight\" confused I asked why? \"He stated tables are only sat when the entire party are present\" which is understandable but my party was seated clearly. I asked if I could join my party at their table which was greeted with \"you're not getting in tonight\" my entire party ended up leaving because we could not meet. I understand the policy of seating a party once all are present but denying a patron after seating his party when it was clearly expressed more people would join isn't the patrons fault. Allowing someone to join their seated party can't possibly be such a hassle?"}
{"text":"Ok...so I'm literally sitting here and came the bar area...no one, for about 10-15 mins, asked us did we need any help. Finally, someone came over and addressed us but they acted as if they were doing me a favor. They have too much staff and they still suck!

So...I just only wanted to grab something quick so I could go to work. Not only were they inattentive, but she didn't relay the same service to me (as the others...I notice a lot) and I passive aggressively conveyed that to her. The service was so horrid, I didn't even order food.  

All in all, if you want to be unattended to and deal with shitty service, come to Red Eye Diner! They'll definitely deliver on that!!"}
{"text":"What an amazing place, Aisha was the absolute best!  The firecracker chicken sandwich is a must have, not to mention those desserts!!!"}
{"text":"This is not a review for the food, as their computers were down and unable to process our food order.
This review should be read by management as tips to help their business going forward.

1. If your computers are down, advise customers at the door, so we can make a decision on whether we wish to sit and wait or not.

2. If your computers are down, that should NEVER stop the ordering or paying for food!! Servers can write the order and get a manager to walk it back to the kitchen. Advise customers you can only accept cash at that time (I doubt any one will leave their cc information with staff in this day and age).

3. If you have customers in the restaurant when the computers go down, and the wait is more than 5 minutes, have the manager go to each table and apologize for the inconvenience. That simple act goes a long way (unless you don't care about repeat customers). Maybe even offer a free beverage.

There are other things I could mention, but this is a start. Hopefully, it's helpful."}
{"text":"Hanging in Charlotte for a girls weekend.  
Was looking for a place to grab from grub and a mimosa this morning.   We had fresh fruit, bacon and eggs and chicken and waffles.  Everything was delicious. Served HOT and pleasant staff."}
{"text":"I love this diner, I've never dined in but every takeout order I've had they've nailed 
it, breakfast or lunch it doesn't matter, call in or walk in to order, same great food.  Many times I've ordered grits with sautéed spinach, mushrooms and tomatoes, not on the menu but they accommodated with no problem.  Chocolate chip pancakes or waffles no problem, hamburger steak with collard greens and mashed potatoes....legit!  Now, has service been slow a few times, definitely but the food makes up for it and it won't stop me from going back."}
{"text":"My go to late night spot! love that it has the same menu as midnight diner, as Midnight is usually a little bit more packed. This place has a great ambiance of a classic 50's diner. Even on packed Saturday night they usually seat my group pretty quickly. Service sometimes is a hit or miss, pray for a friendly and attentive waiter. Instead of chicken and waffles', I usually get buffalo chicken and French toast. It is EVERYTHING! They always make it perfect every time. I have to have anybody really have a disappointing meal here, they usually do it right."}
{"text":"have to start that I love midnight diner so was excited to see this place open up.  turns out that this place has the same menu but definitely not the same execution or service.  sat at bar and ignored for almost 15 min until I finally got up to get a menu from an uncleaned table and asked the manager if I could place an order.  yes the manager!  she got someone to take my order but that's all they did.   long of it short.  parts of food cold n parts warm like it sat in window because their timing is off, service was non existent, and I saw several managers around but not trying to help with customers or staff.  unless ur absolutely desperate go somewhere/anywhere else!"}
{"text":"GREAT comfort food. The chicken & waffles/ French toast was AMAZING.  Chicken tenders were delicious. Four cheese Mac & cheese was \"just like Mom makes\".  So many menu choices....definitely have to visit again!"}
{"text":"The Spagetti was really liquidy and the side salad was just lettuce,cucumber, carrots, and cheese. I'm sure this place is good but don't get the spaghetti"}
{"text":"We came to Charlotte, NC to get away from Hurricane Irma .  We want to thank Shelly and Ateka and her Staff at Redeye Diner.  After a very unpleasant experience at Strike City we came to eat here . Awesome Staff, Awesome Food !! BEST BANANA SPLITS made by Shelly the manager . 
Great place to eat .. Thank you for such an AWESOME SERVICE and EXPERIENCE !!!"}
{"text":"Classic American diner. Even have good 50s rock n' roll playing. Came here for breakfast - filling portions. Eggs are moist, bacon cooked to perfection, good coffee, and good marble rye toast. Courteous staff. Located in the center of uptown. Walking distance to all hotels. 

Went later for dinner and tried their Nathan's hot dog. Cooked perfectly. Have all the condiments you can choose. Saw the deserts they offer. Variety and all look very good.

Will return when I am in Charlotte."}
{"text":"Good place to go late at night if you're drunk. This afternoon it was filthy and I waited for 20 minutes for a waiter to show up. It didn't happen and I left."}
{"text":"Came into the restaurant after the Heart Walk because we were already in Uptown and super hungry from the walk. We ordered quickly and soon saw our food coming but they gave it to the table behind us. We noticed this and the service staff didn't. We waited and waited and no one came to say Sorry there was a mistake and it will take a little longer for your food. Instead they tried to cover the mistake like the food just took a little longer. I watched the manager get informed about the situation and I think it's really poor customer service that she didn't come apologize to our table. Needless to say we were charged for both and never offer an apology for it taking so long. The food is subpar, basic diner food."}
{"text":"Midnight Diner's red headed step child. Same menu pretty much so idk why the name is different. I order from midnight diner all the time with no issues. Even with lines out the door around the corner. Come here once my order is completely messed up. And of course I ordered it to go and didn't realize until I got home. 

Ordered a veggie burger, got fried chicken. Bf ordered 2 egg breakfast with cheese and with country ham and hashbrowns all the way. He got eggs without cheese but covered in gravy. No country ham. Hashbrowns didn't have ham or onions, just cheese. Literally none of the food was correct."}
{"text":"Great home cooking. Shannon pointed us toward the fried chicken and she was right. I don't usually eat fried food, but the chicken was freshly fried with terrific batter and very tender. The mac & cheese was great and the ranch dressing was very good, too. Shannon was a great server: knowledgeable and attentive. Very good place to eat."}
{"text":"Great diner.  Atmosphere is fun 50s type diner. Service is great. Breakfast was really good at reasonable prices. Had their breakfast special of two pancakes eggs bacon and hash brown.  A lot of good food. Brought home leftover pancakes for the grand kids and they loved them too."}
{"text":"The service and food are very good! I ate the shrimp & grits, which was spicy(+1) and a bit heavy on the cayenne. The biscuit was amazing and everyone else at the table loved their meals. Our waitress was pleasant and made good recommendations.

I was disappointment that they closed for the snow and I could not go again to try more!"}
{"text":"I have to say I was looking for a place to have dinner close to my hotel, and happened upon this cute little diner. I had the fried chicken, greens and mac n cheese. I also had the banana pudding for dessert. OMG the fried chicken was sssoo good.. yes it's a little greasy but come on they just made it it's going to be. The mac and cheese was perfect just like I was craving.. and the greens had a really good flavor and not over cooked. I was looking for a small meal and ended up over eating it was so good. 
I did like the banana pudding too."}
{"text":"I ordered the shrimp & grits and requested them with no spice, now I can understand if your Creole gravy is pre-made by the batch, not an issue but SAY THAT!!  Admit that the gravy is what it is and don't just say \"no spice, you got it\" and when I come to get my call in order and ASK if it was made with no spice, don't say \"no spice, just like you asked\". For the love of Mike, I could hardly eat the blasted thing!!  If the sauce is unchangeable SAY THAT, I would have ordered something else.
Also I ordered a slice of chocolate cake, last time I got it the cake itself had been sliced at some earlier point, so one side was all crunchy crumbs...same thing this time, it's a pretty pricey slice of cake COVER THE CUT EDGE and please give me my whole slice next time. *see photo"}
{"text":"this place was really cute , I like the old school vide . i went there on a whim before I met my friends because I was Hungary . I had a cheese bugar and fries . the bugar was really good , the fries could of been  a tad longer there where a bit raw but I like the season on it . the waitress was also very sweet . I hope to eat there again."}
{"text":"The food was good. However, the service was terrible! I waited over 20 minutes to get my beer. Then over an hour for my food to come out. I asked for honey mustard I didn't get it until I was done with me food. I asked for my check as soon as I got my food expecting it to take a while and had to wait about another 20 minutes after I finished my food. I would understand if they were busy but the place was almost empty. I will not be coming back!"}
{"text":"Stopped here for breakfast, great experience! Extremely friendly staff, great service, and the food was delicious. For a show time (10:30 on a Monday) I would have thought it could have come out a bit quicker. Maybe the kitchen was show considering the time and day, maybe I'm just being too picky!
Either way, still highly recommend it here!"}
{"text":"Came here for lunch with coworkers. It was
During their busy time, but they got us seated quickly. We had plenty of time to review the menu and our food was served in a timely manner. Everything was so good, especially the Asian tacos."}
{"text":"Went here for breakfast.  Short distance from the hotel.  Great food! Very busy for a Thursday. Service was ok, large selection for breakfast. I had biscuits and gravy, and a side of grits. Everything was great."}
{"text":"Ambiance: classic American dinner with R&B and hip hop music (at least the day I went)

I got the fried chicken platter--chicken was tender and great! You must try the fire shrimp! It was amazing! I'm giving the restaurant three stars because the service was lacking."}
{"text":"Breakfast at Red Eye this morning was perfect. Hit the spot! Met my friend for a late Saturday breakfast and opted to sit at the bar. After reading so many reviews about slow/poor service I had my doubts but Sonny took excellent care of us and we got out food in less than 10 minutes. 

The pancakes were cooked to perfection and everything we ordered came out to our expectation. 

Loved the interior and thought the place was super cute!"}
{"text":"I really liked this place enough to eat there twice on my visit. Everytime Ms Fab was my server...she was a sweetheart and provided valuable suggestions. The grits are a must have! The waffle fries were better than chick fil a's which is almost impossible to beat. The fried chicken was good and reheated nice. Skip the french toast, greens, and wings(they're ok at best). So many other things to choose from"}
{"text":"Redeye Diner has done it again! Another incredible meal, recommended by another friendly and attentive server. As I was waffling (teeheehee) between chicken & waffles and the special, I asked our server Braxton what he would recommend. He suggested chicken & french toast, a tasty and delightful (off-menu) combination that tickled my tastebuds and was super satisfying. 

Redeye Diner's servers really are dedicated to serving their customers. I am always warmly greeted upon entrance, and the servers personalities are allowed to shine.

The only issue with Redeye Diner is that EpiCenter parking is so expensive that I don't get to hang out and drink bottomless coffee as long as I would like. I wish EpiCenter had some sort of ticket validation program.

Regardless, I will be back...the chicken & waffles (or french toast) are some of the best the Queen City has to offer!"}
{"text":"This was a great experience. I love a good Diner and I am adding this to my list. The service was good. There weren't many people in the restaurant when we got there which was good. The chicken and waffles was very good. I had 2 wings and a waffle. Their coconut dipped French toast though....OMG....loved it. Tip: the hash browns are way overpriced for the itty bitty portion they give. I will not order those again. But overall this was a winner."}
{"text":"Why in God's name would you bring something so ratchet and tacky at this place to the heart of our beautiful city this is the epicenter a very respected place Management brought the same Midnight Diner mentality the security at the door is ridiculous and has no business dealing with customers I thought I was getting ready to research to go in a club but my service was awesome Tee great the food was awesome the place is spotless and clean it made me forget the bull crap at the door until it was time to leave my survey wrote paid and signed my check that wasn't good enough for the two big guys at the door they sent me back to get a red stamp as if there were going to force me to stay because they had other people to run off on the check I say again you brought that ratchet mentality to the heart of our beautiful city it would have been better for you increase your food prices to offset some of your losses"}
{"text":"This place is better than the one up the street. The grits are amazing along with the bacon. Had French toast and it was the smaller order and I'm stuffed. The staff was super friendly. We will back."}
{"text":"Really good after spot. The double cheeseburger with bacon and fries I had was amazing. The morning after for breakfast was just ok (don't order the omlets like I did). Instead be like my wife- who had the waffles with eggs and extra bacon. Keeping it simple will take you further here."}
{"text":"AMAZING ! There will be a line but it's worth it ! Shrimp and Grits are a must ! Also the chicken and waffles are delicious with a sweet tea . This place is the real deal!! 5 stars all day"}
{"text":"I don't know where to start the shrimp and grits or the coconut French toast with the jumbo wings  it was delicious.Not to mention the prices was reasonable and it's located in the epic center and the jukebox was lit. I didn't have room for desert but I be back wonderful service ."}
{"text":"I was enchanted with this restaurant! It was in a group of restaurants that when I went at \"late night \" the second time was well guarded by a well noticed security guard for the whole area which seemed was not really needed. I had a wonderful \"diner \" style breakfast, and a great bowl of chicken noodle soup for late night when I was late night hungry. I was alone on business and felt wonderfully safe using Uber on the street to go back. The diner was decorated with platinum records of oldie goldie stars and fantastic food! Please consider this place because the menu has standards and contemporary cuisine and culture to enjoy!"}
{"text":"The food at Red Eye was outstanding but the service sets it apart for me. Shannon was our server and she treated us like we were family, guiding us through the huge menu and advising us on how to get the best deal for our money. The fried chicken we had was perfectly tender and not greasy. The biscuits were great, and my salad had the best ranch dressing ever! It blows my mind that this restaurant is 24 hours. SUCH a great experience."}
{"text":"I ordered chicken and waffles.  The waffle was too crispy.  I could not pick it up with a fork.  I was told by Kaely that once you pour the syrup on the waffle, it is hard to pick up.  Really?  I had her to replace it with french toast which was good.  The chicken came to the table sitting in grease.  The second picture is one of chicken wings which had a broken bone while cooking so that is the bone marrow.  I had to use a napkin to drain it and it had feathers on it.....gross!  Kaely, our server, clearly did not want to be here.  UPDATE:  Because Kaely felt the need to scold me thru Yelp, I am now giving this place a 1!"}
{"text":"Finally made it to Midnight diner sister restaurant. 
This place is just like midnight diner but bigger. 
I got the fried chicken and waffles. The waffle is a lil crispy for my liking and you have to use the butter from the packets that on the table. The menu is identified to midnight dinner for those who have been there.
They also offer southern staples like collard greens and macaroni and cheese which my fiend got. 
I normally stick to the breakfast when I go try the chicken and waffles or the shrimp and grits which is their most popular dishes!"}
{"text":"WHAT!!!!!!! This was the best breakfast I have ever had. The biscuits and gravy are so unbelievably amazing. I was just passing through Charlotte on my way back to Florida and decided to grab a lil breakfast before heading out. Having no idea where to go, I just started walking down the st, when I came accross Redeye diner and let me tell you, this was the best breakfast I have ever had, and my wife agrees. You have to try the biscuits and gravy and french toast."}
{"text":"If you order online be sure to place the order at the time you want the food to begin being cooked, not the time you want to pick up. Food was sub par, especially for a diner. Service was nice but wouldn't give it another shot unless it was 3am."}
{"text":"omo. 
I have never in my life been to a diner like this. It looked like something out of a museum (there's nothing like this in East Cobb for sure!). Diner girls in skater dress, red booths, mirrors on the walls, old school jukeboxes, all in the Epicentre! 
Some people on this page have reviewed this place as too expensive and I'm just like WAT. Everything here is basically less than $10. The drinks are amazing btw, come here not for the food but for the drink specials. 
I never thought I'd go to a diner and sit at their bar, but their two $5 drink specials are ones you can't miss. A tall glass of a cocktail of spirits that usually tastes fruity but alcoholic, and delicious. Order a platter of diner food or chicken and waffles at 1AM and you'll be ready for the rest of the night."}
{"text":"I'm a little late with my review, but who cares! So, this was my first time at the Redeye Diner and I have to say I loved it! From the decor to the music... Everything about this place screams family and late night/early afternoon lunch with friends. 
Just a few things that I would like to point out, not sure if this is the normal for this restaurant, but business was slow and my waitress was a little slow with assistance. Placed my order and my food was ready within a few minutes of me placing my order. My burger was great but I wasn't really digging my fries much because a lot of them were to crispy or hard to eat... And I don't like crispy ass fries! But needless to say, it was a good deal and I enjoyed every minute of it.
I would recommend anyone to come and be apart of the Redeye Diner experience and get a feel for the blast from the past. Tell your friends or relatives and make a trip to an epic night at the Epicenter's Redeye Diner."}
{"text":"The Redeye Diner food quality and portions size versus cost is unbelievable. I enjoyed the 1/2 fried chicken meal which included a drumstick, wing, thigh, and breast (hence the 1/2 chicken labeling) which also included two nicely sized portions sides. My meal was 12.99 excluding drinks. The dine is a throwback to a 50's diner with hot rods, rock n roll records, and other 50's memorabilia.  This restaurant is a great stop for those looking for great food at value prices."}
{"text":"The notion of \"24 hours\" and \"food\" just sounds like it's made to go together. Kinda like my other two favorite, \"pay\" and \"day.\" Seriously, this diner did not disappoint. 
The ambiance was unreal due to the game, so it just made for a cool atmosphere (5/5). The service was great still (5/5).  We weren't planning to eat a lot so we stuck with appetizers which were all great (5/5).  These included a cheeseburger slider with fries, chicken noodle soup,  and a side of fries. 
We will definitely come again for lunch or supper!"}
{"text":"It started out great with our server but fell quickly. Food was not very good and as stated the service fell by the wayside."}
{"text":"Food was awesome! Customer service though, not so much. You walk in and are ignored by the host on their phones. Waitress was MIA for almost the entire experience and when we asked another server for some mayo & ranch, there was no answer. Would be back for the food but not staff."}
{"text":"Our server Dustyn was super nice and pleasant. We had breakfast and it was amazing. The French toast was the best I've ever had!  Service was quick and the quality was great!"}
{"text":"Can't review the food because we never were seated.  My husband and I are in town for the Belk Bowl and this place was next to our hotel.  We got in around 11 pm and not many places were still serving food so we walked over to the Redeye Diner. There was a sign that said wait to be seated so we stood there about 10-15 min without anyone acknowledging our presence. Finally got fed up and left. Went to the bar at the hotel and had more luck ordering from a limited menu.  We're here for another night but we're definitely not going back."}
{"text":"I had an amazing time.
Shakia provides a great customer experience and as a visitor from out of the area I would not hesitate to come back.
She is AMAZING!!!!"}
{"text":"Great place to stop for a bite. I was on a road trip and stopped in North Carolina. Found this diner and decided to go. Food was great. Had the pancakes and they were delicious!!! The grits were very delicious also. I'm a music lover and I really enjoyed their ambiance. They have frames of music icons all over the walls. I appreciate that from a place. I had a great waiter and had a great experience in North Carolina!"}
{"text":"I've only been here once and I ordered the shrimp and grits with a strawberry milkshake. Place was clean and the waitress seated me immediately but then seemed to forget about me after I told her it was my first time and I needed more time with the menu. Honestly, it's a larger, commercial style diner so they probably go through a lot of different servers frequently so I would take any service ratings with a grain of salt as it is likely to change month to month. She was friendly though.

Food came out promptly. I've never had shrimp and grits before but it was very flavor and delicious. The milkshake though tasted extremely bland and almost more like butter or cream than actually being sweet. I've had a lot of different milkshakes from different places but I would say that this was definitely the worst milkshake I've ever had, I didn't even finish it, and I always finish my drinks as a matter of principle. It's a shame cause it comes in a glass than a refill tin. 

Milkshake aside I would definitely try this place again.

Milkshake aside I say the food was worth trying."}
{"text":"If you're looking for a lot of options, this is the place to go. There is breakfast food, seafood, steaks, beer, and everything in between. Everything my friends and I ordered was great excluding the mediocre egg salad sandwich. Definitely recommend the brownie dessert option. 
The atmosphere is also appealing."}
{"text":"Staff is rude and unhelpful, but the food was delicious. The fried chicken dinner reminded me of home, and there are lots of sides to choose from. Great meal, I just wish the staff was more....well, more animated. They just seemed completely uninterested in being there. Too bad, because they would have gotten five stars if I had seen just ONE smile."}
{"text":"It's okay place, food is okay and service was not great. i went Sunday morning, it was busy, but we got seated in 10 mins. We wanted to sit outside b/c the weather was nice but they didn't have enough servers. It took them 35 mins to get the food to our table, server spilled the drink, didn't even come back to clean it up. Orange juice was warm, didn't even put ice in it, to keep it cold. Probably will not go there again."}
{"text":"Menu is a trap! If you order the redeye special, know that it is a choice between grits, hash browns, or fruit. It isn't a choice between grits and fruit in addition to hash browns. Because of the poor use of semantics, I was tricked into being under the impression that I was getting my choice of grits or fruit in addition to hash browns and the rest of the food that come with the special. I thought i was getting a good deal. I wasn't. When I brought it to the attention of our server she did nothing to fix the wrong and rarely returned to our table. Finally, while we were paying the manager (I think) came to our table and asked us how the meal was. I also brought to her attention the ambiguity in the menu and was met with the same lack of help as our sever. I was dumbfounded by the utter lack of customer service. I attached the description of the meal that was so unclear (the redeye special). Two members of our party were under the same impression as I was. This restaurant was recommended by our concierge and will let him know not to recommend this restaurant to anyone else as it was so disappointing. I will not be returning."}
{"text":"Pretty nice diner. The location makes it great for an after hours I'm drunk and need something on my stomach spot. They have a ton of fried or heavier foods just for that. It's at the epi center where all the late night spots are. Upon entering we were greeted and seated. We came because the person I was with raved about there shrimp and grits. The shrimp and grits were okay. I had the fried chicken wings and French toast (substitute to the waffle). I though it was good. The server was nice. You can keep the party going after tour late night here because they have alcoholic beverages.  The prices are reasonable. They give a check in offer for yelp, but I couldn't get the WiFi working right with my phone. Maybe you will have better luck. So if your looking for comfort food this is your spot."}
{"text":"Wonderful and fun diner experience! Food was good and very affordable! Fried chicken and collard greens side were the highlights. Recommend coming for a quick, indulgent, and low cost bite."}
{"text":"Me and friend usually go here after the club the food is always good and hot no complaints there the firecracker shrimp is good the crowd can be a lil weird at that time and wait can be long too I prefer them over midnight diner all day every day"}
{"text":"Visiting from the ATL and someone recommended the Redeye Restaurant.  Servers were friendly, but service was lacking and the food was bland.  The feeling of the restaurant is that of a 50's diner with 50's R&B & Rock playing. FYI: waitress didn't know the difference between large wings and whole wings (large wings does not mean whole wings, they are actually whole wings cut up making them large) and the hot flavor is just hot sauce.  Their chicken is ok, but is to bland for my taste.  The just assume the customer knows the menu not taking into account that visitor's come into their place.  When I return to Charlotte I will not go to this restaurant."}
{"text":"The biggest waste of time and $. Bad food bad service. Everyone looks fresh out of jail and or high! No one was intrested in working. If the hotel staff did not recommend them being kid friendly I would not have eaten there!!! Do yourself a favor and eat at one of the other many options around there."}
{"text":"This was my first experience at this restaurant and it was absolutely amazing! I ordered French toast eggs grits and bacon and the grits reminded you of the shrimp and grits. Our server was very prompt and courteous and our food came out relatively fast. This location offered a 10% discount if you checked in via yelp, however we forgot to use the discount, lol The food came out hot. The eggs could've been a little better in my opinion, as it tasted more like liquid eggs. Nevertheless it was a great experience and I would go back again."}
{"text":"Very reasonably priced, the Redeye diner caught us off guard. Tucked away in the restaurant/bar scene of the EpiCentre was the chrome and red neon diner. We went twice once for breakfast and the lunch. Excellent biscuits and grits. Very good service and it was clear staff was a well led tight knit group."}
{"text":"First , the decor is everything !!! Authentic Old school diner vibes ! After a great time at a hornets gene my boyfriend and I were beyond hungry but wanted to go somewhere in walking distance for obvious reasons ! We came across Redeye and boy are we happy we did ! We were greeted throughout our visit by the very friendly and knowledgeable Uriah and E. We shared high fives with manger Jordan after the first bite of the most delicious fluffy perfectly toasted French toast in the World!!!! Then the grits !!! Ohhhh myyyyy gahhhhh! The most creamy amazing grits , better than your granny's ! Lol, seriously ! Eat the chicken and French toast today !"}
{"text":"Great food and really cute atmosphere, but the service has been consistently sub-par. I've been a few times for lunch, each time has been before the rush, yet we still felt like we were \"forgotten\" a few times throughout the meal. The brain freezes are delicious though, if you're looking for a sweet treat!"}
{"text":"It's pretty predictable. The best part of a drinking night is the eating that follows. Also, the worst part of a drinking night is the eating that follows. 

Well, we came here for some drunk food, and we ordered different things. From omelettes, biscuits, pancakes and hamburgers. 
- Good food - considering!
- Good service. 
- Good prices.

Three Yelps"}
{"text":"This place is okay I like that they have a wide array of options on their menu but the service in my opinion is just lacking I don't like the pay on your way out option and I feel like you should be able to give your method of payment to your waitress or your waiter but if they like it I love it."}
{"text":"We came late night when the line was out the door and wrapped around. Really wanted to try so convinced my husband to stay and surprisingly enough the line moved quick! Maybe 10 mins max! Sat at the bar area - super fast service and cheap awesome diner food. Everyone was ordering the chicken and waffles or the shrimp and grits looked great must be the hits on the menu/ 
Hit the spot for greasy diner food! Will be back and a plus they serve Breakfast all day. I love breakfast anytime!"}
{"text":"The waffles are really good but the chicken is not good and the pancakes are good but taste super artificial"}
{"text":"Absolutely amazing shrimp and grits and lovely service from the waitresses. Very big portion"}
{"text":"I went to the red eye diner for the first time last night and rita was my server and she was one of the best servers in my whole life! She suggested i get the firecracker shrimp and it was so good!! Thanks for the good experience rita! We will be back"}
{"text":"We had a great lunch here, the shrimp and grits surpassed my expectations. Being from out of town, we had a little trouble finding it, not realizing it was inside the Epicenter. Service was great, kudos to Shelby our server (see I did remember). Fun place with friendly staff. I'm knocking off one star because they try to game the system by insisting on a favorable review to get the check in discount. Jokes on them since there wasn't a signal connection there anyway."}
{"text":"Great to see a place uptown give 24/7 hours. Food and service is nearly identical to midnight diner so you know what to expect. 

Decor is awesome and they have a great patio. Food isn't mind blowing but it's simple and easy diner food."}
{"text":"I want back to this restaurant and the manager greeted me respectfully and gave me a great table with a view he appreciated our business, they must have changed the cook because  the food was phenomenal I recommended you to this place..
 I wouldn't recommend going at night because you get a lot of thugs and large crowds .. waiting you're probably get Prison Shank after 12 a.m. so be on guard and don't drop the hand sanitizer.."}
{"text":"I went with the BFF during Hoshicon weekend.  I am not one that needs pleasantries from the waitstaff - just get my order right, don't make me wait too long (without acknowledgement), ask me if I need anything once or twice, and give me an accurate bill!  In short, the waitress/manager met my requirements.

We both ordered the shrimp and grits...  OMG, I don't think I ever had grits that good in my life!!!  Very creamy!  The shrimp was plump and not overcooked.  Sadly, I could not eat the biscuit that went along with it - too full from the grits - lol.

I visit Charlotte often so I will definitely come back (if only to try the fried chicken and waffles or the shakes, which I scoped while waiting for my order).  

I am surprised by all the bad reviews, but I have a pragmatists view when it comes to 24 hour diners in general, the quality (sadly) is sometimes contingent on time that you go (we went in the late afternoon when it was not too crowded)."}
{"text":"I love the idea of this place so much! It is exactly what the Epicentre needs if only the execution of this place was decent.

We stopped by to a half empty establishment around 7pm on a Saturday night. There was no one around to seat anyone so we had an awkward wait right up front trying to decide if we wanted to stay or go somewhere else. An unhappy hostess asked how many and showed us to a large booth to the back where we proceeded to wait almost ten minutes until a manager asked if we had been served. She went and found us a waiter and we promptly ordered.

The best dish of the night was the appetizer of firecracker shrimp. Not spicy as anticipated but delicious sauce. I ordered the California Burger \"well done\" to which the waiter told me all the burgers are cooked well done. Great! He disappeared for a bit and came back with our burgers and then later with our appetizer. 

Now my burger was okay until I got to the middle and found pink. Esh. Waiter was nowhere in sight to point this out to so I ate my waffle fries and continued enjoying the company I was out with. Getting the check was a task. 

All said the three of us were there over an hour and a half when it was not busy for mediocre food. I will say the prices were cheap considering we were in the Epicentre but it's definitely not somewhere I would seek to eat at again."}
{"text":"The Red Eye Diner is an upscale version of The Midnight Diner located on Carson Boulevard in the South End of Charlotte.

This Diner has the same menu and same great service. The interior decor is similar to a Johnny Rockets meets retro Diner.

We had the signature coconut French toast with bacon, grits. Everything came out hot and tasty. Our waiter was fabulous and extremely attentive. The manager checked on us twice. I did not see one dissatisfied expression in the house this place is wonderful for breakfast lunch and dinner. It is conveniently located in and out door Area mall with great parking.

Once again if you like the Midnight Diner you will love the Red Eye Diner."}
{"text":"Come check us out.  The best spot in uptown.Great food.  Fantastic desserts and great service."}
{"text":"Good food! Great ambiance and great location! I heard about Midnight Diner and never went while we lived here in Charlotte. This was a great breakfast spot to end a great night away for my husband and I. The chicken was good- needed some hot sauce!
The creole sauce was delicious!!!! I loved it with the grits."}
{"text":"Hands down the worst service I have had in Charlotte!!! I gave it 2 chances and the service was god awful. The second time my friends and I (party of 4) walked out after waiting for over a hour AFTER we placed our order. I wanted to like it since the diner was at the Epicenter and the same menu as Midnight Diner, but unfortunately this is the biggest let down. I highly recommend not wasting your time."}
{"text":"If you are looking for gourmet breakfast pass this place on by. However, if you are looking for great biscuits and gravy or the aforementioned wings and waffles, well this is your place here."}
{"text":"So i love this restaurant, I usually go in after a night on the town. This particular time i went early on a Wednesday morning to get my favorite dish... shrimp and grits !
Service is regularly competent, but on this Wednesday morning, i was fortunate enough to be taken care of by a charming young server, Braxton. 
He brought me my favorite dish but unfortunately it was served under temp. I simply told him what was wrong and he shortly came back with a delicious hot bowl of shrimp and grits.
He was very genuine with ensuring that i enjoyed everything. And held great conversation. I will definitely be coming back, and ask for his service;)"}
{"text":"Checked this breakfast joint out in downtown Charlotte.  The best I can do is call this place \"average at best\".  The food was just \"ok\" as was the service. Pretty disappointing.  The prices weren't crazy but the food could be better for the prices they charge."}
{"text":"I love a good diner experience, I don't know what it is but breakfast at a diner is just yummy . Now , Red eye did not disappoint . My style of eating constantly changes, extreme foodie here so sometimes it gets difficult to eat out . I want real butter on my food , none of that clarified stuff , but I didn't come to Red eye to feast on decadent bacon or buttery waffles .  

First impression , BUSY ... I'm assuming due to the location. We were seated in a nice size booth and our waitress , she was phenomenal.  I can't remember how much I asked her to do , do you have heavy whipping cream , can we get extra straws, do you have splenda I don't like equal , etc. but she kept such a pleasant and joyful attitude . 

On to the food , that's what we are mainly here for right? Mmmmmm , anything with eggs and avacodo is a win for me . The San Bernadarino  omelet with chicken was just the right size and no hidden pancake mix in the preparation to make it super fluffy , for my carb conscious eaters .  I got my order with a side of fruit, which was fresh and plentiful.  We got our lil one the kids breakfast special, pancake ( it was massive) with one egg and a meat of your choice .  $6 for that kids plate, I'll probably get that myself one day . 

What made me give 4stars is there were no compliments about the food from anyone in my family , the service was fast and friendly , the atmosphere was a great mixture, and I saw more menu items I would love to try ."}
{"text":"We eat twice here, in the evening and the following morning. 
If just based on the evening I would have given it 4 stars but the breakfast let it down.
The RedEye Is in the EpiCenter which makes it very convenient to the Spectrum and many of the downtown hotels.  Prices are very reasonable considering the location.  My wife had a really nice Greek Salad with Grilled chicken added I had the Philly Chesesteak with fries.  Both were very good, prepared quickly and our server was attentive with drink refills etc.  We were pleased and decided to go back for breakfast. 

Just fruit for my wife, I had the Eggs and Corn-beef hash.  I wasn't asked how I wanted my egg so they can scrambled, I guess that was sort of my fault, hash browns were not included, the waitress didn't ask either, I ordered the muffin and had to remind the waitress as it didn't come with my rather plain looking breakfast plate.  No real milk or half and half only liquid Coffee Mate was available.  Coffee refills were adequate.  

The place is clean, the 50-60s music is fun.  Being a Jersey guy I'm really spoiled by great diners.  We would go again.  I'd try the pancakes next time."}
{"text":"We only went in for dessert and it was perfect it hit the spot. We got a strawberry cheese cake cake and a M&M milkshake. They were quick fast and friendly and the desert was amazing. Perfect sweet treat after lunch."}
{"text":"Decided to try Redeye, since I had been to Midnight Diner twice and wanted to see how they compared. The similarities were obvious--as were the differences. I will say upfront that Midnight is the winner of the coin toss, however I can't fail to mention what the Redeye staff did to meet my special request about my biscuit (read on). Oh, and after walking in it took me about 2 minutes after I was seated to go to Google to find out if the two were related through ownership. The answer: Yes, they are.

First, the decor: this is a different place. It is a relatively new in-city space: larger, more modern and without some of the \"diner\" feel of Midnight. That's OK: it couldn't be the same given it's location and new construction. However, if you want more of the true diner experience, then Midnight wins in that regard.

Now, the food: I did a bit more reaching for the unusual at Midnight, and got the Bubba (more about that on the review I posted with pictures). I was more restrained here, if you can call this restrained: a veggie omelette (hold the cheese), the livermush (my new favorite Southern version of scrapple), hash browns (a large serving, however very much (literally) within the lines of a rectangle, not the kind you get at Waffle House which is free form on the griddle), and a homemade biscuit. (By the way, we like to taste foods, not consume large quantities so we order what we want, eat a bit of the heavier stuff, and take the to-go box. It seems to work--at least most of the time).

Ah, the biscuit: I didn't want butter. OK... at most places, they take the biscuit, put some butter on it and hit the grill for a short time to warm it up. At Redeye, they apparently are home made from scratch, then have butter put on them at the time of cooking, so getting a biscuit without butter is a challenge. Their response? They put an entire pan of biscuits in the oven for me--without the butter--to serve me my delicious, crumbly home made biscuit. And, to boot, one of the managers came out to let me know they were working on my request. I was floored--and maybe a bit embarrassed to have them go through all of that trouble. Duly noted!!!

Now, the service: Cameron was great. However, this was the morning of the Komen race, so it probably is an unfair comparison: it seemed like the place was a bit overwhelmed. I suspect today is not a fair comparison, however coffee was late at several tables who shared their experience with each other. Like I said, they were busy, busy, busy--and this is probably not a typical Saturday morning.

All in all: good food, great menu, reasonable prices and variety to fit almost anyone's palate. Recommended, and I'd go again without hesitation."}
{"text":"Great atmosphere, our server Uriah was amazing! Came for drinks and desserts and all of her recommendations were on point!"}
{"text":"You've downed a couple of drinks at the Epicenter and you're ready to end the night with some drunk food.  At this point, everything is going to be delicious whether you remember it or not.  One item that I did thoroughly enjoy was their garlic teriyaki wings because they're not dunked in the sauce like your typical wings but drizzled, which left the wings quite crispy.  

Overall, this place isn't going to disappoint you after a late night of partying but I would definitely recommend trying to beat the 2am rush."}
{"text":"This is the worst place to ever eat at ! Especially after hours . They literally choose and pick people to get inside . And the SECURITY guards are so disrespectful.. The worst customer service I've ever received in life . Didn't even eat here .. They said wait was 15-20mins , but let people who were way behind us in before us . Just doesn't make sense. I would recommend NOT TO COME Here AT NIGHT. They don't even deserve 1 star . ZERO STARS if you ask me ... Red eye sucks . Better off going home to make your own breakfast ."}
{"text":"GREAT food , service is a little slow but bare with it. 
The fried chicken is amazing it's not greasy. It's full of juicy meat great flavor. 

The French toast was great as well. We ate here twice , the price of items.  We're very economical. 

Again be patient with the wait staff. (Hate to say it )

ASK FOR FABIOLA (she's super quick and will serve you with a huge smile. )"}
{"text":"Great breakfast!! So glad uptown FINALLY has breakfast 24 hours a day. I'm a creature of habit so it's nice to have a good all American breakfast place I can walk to."}
{"text":"We came here because it was late at night and the lady at the front desk of our hotel recommended it. It was Friday night in the epicenter so things were kind of crazy. I've never been to a diner that needed a bouncer before. The bouncer, Bubba, kicked some people out, stopped some fights and overall kept the whole place calm. All of the waitstaff was really nice. Great food and they kept the coffee refills coming!"}
{"text":"The shrimp and grits was excellent in cost and flavor 10/10 $10.99

One slice of French toast cut in half is considered two slices and they charge $6.00 no sides with it.

The omelette as good in taste and cost as well comes with hash browns and biscuit $8.99

Large cup of OJ $4.00

Bill for two for breakfast $34.06"}
{"text":"Pros: 
Food was good and our waitress was awesome!
Cons: 
Not family friendly
Staff cursing throughout the restaurant
Music being played had cursing

I went to the diner because my children thought is had a \"cool look.\" We were promptly seated by the host,  but I thought it was odd that it was the only restaurant in the EpiCenter not crowded.  Our waitress was very attentive and made good suggestions, which were spot on.
HOWEVER, we had to listen to one of the employees complain and curse about someone who we believe works there.  He just kept walking around the entire restaurant talking about this person.  Management said nothing.  The music was not a problem until several songs about sex and curse words were playing..nothing done by management. 
Not a family friendly establishment and won't be coming back."}
{"text":"Fast service great food chicken is so good onion rings mac and cheese plus a biscuit I didn't ask for I will Def return"}
{"text":"I will not return. Been looking for a Brunch place, found it online so went on Sunday Morning. When you walk in the music is so loud and is all Gansta Rap. You would think the Jukebox would have oldies or something since it is suppose to be a 50's diner. Nope, loud Rap music the entire time I'm trying to relax and have brunch. Burger came out quick but it was cold cause the tomatoes on it were ice cold. Staff was good thou but the music drives people away.."}
{"text":"Great diner with great food and great service!  I had the \"Bubba\"... an open faced biscuit topped with cheesy scrambled eggs and sausage gravy.... it was amazing!  
Even though it was a busy morning the service was fast and friendly.  I can't wait to return!!"}
{"text":"Waffle is awful dry can't even swallow.  The eggs didn't have enough cheese.  Turkey sandwich on plain white toast. Gross. Bummer.  Not enough staff."}
{"text":"So have you ever gone into a place and expected not to like it but been pleasantly surprised? That's what happened to me with this place. I don't know what it was that made me think it wouldn't be good but I was wrong. We started with drinks - mimosa for me (they were out of Blue Moon) and an Angry Orchard for my guy. For lunch, I went with breakfast food (half order of coconut crunchy french toast and hashed browns with mushrooms and onions) and my fella went with lunch (1/4 fried chicken, mac and cheese and mashed potatoes and gravy). Mine was awesome in pretty much every way. I doused the hashed browns with Texas Pete (naturally) and they were perfect! I was a little nervous about the french toast because I don't love coconut but it was delicious!
My guy loved his macaroni and cheese, liked his fried chicken (just wished it was better seasoned) and thought the mashed potatoes were just okay (\"they kinda taste like mashed potatoes from a fast food place\"). He said he would definitely come back again and would try something else (but get the mac and cheese, for sure). 
The service was great and fast. Our waitress was super helpful because I had countless questions about items on the menu (shout out to Mercedes!). A win all the way around!"}
{"text":"We went two days ago and I must say it is one of the best places in Charlotte, the food is very good, the service great, our waiter was Stafford, he was very friendly and nice, he gave us very good service, I recommend eating the onion rings, the best !!!!"}
{"text":"Redeye is a good quick stop for a delicious, greasy-spoon meal. My husband had a good sausage, egg, and cheese biscuit. He really enjoyed it. My plain turkey burger with provolone was good, but a bit overly greasy. It still tasted good, so I didn't grade down much. Our server was nice but not friendly. We would go back to try the biscuits & gravy!"}
{"text":"Late night meal here after some \"festivities\".  The place was packed and there was a line.  

My order was never brought to the table and eventually our server realized this and went to the kitchen.  She returned without the food and said that the kitchen threw it out because it sat there so long.  She asked me if I still wanted it... no thanks - everyone else was finished eating.  She just turned around and walked off. No apology."}
{"text":"\"Never understood why a diner in the heart of the epicentre was always empty. Now I do. Never again... driest burger that I've ever had in 34 years. Took way too long to get seated. Pure trash, don't go."}
{"text":"We ordered delivery and was blown away by the food! The Fried Chicken was seasoned perfectly and went well with the pecan waffles. Will definitely order from them again!"}
{"text":"I ordered a California burger with a side salad and asked for the sauce to be on the side for my burger. No salad was given to me until after my food was delivered and I had to ask for it. My burger had sauce on it. When I asked for a new burger the shift manager said they usually don't give the option to order a burger with out sauce???? What??? Does the mean burger buns come premade with an infused special sauce on the bun??? And why not tell me this as I am ordering??? We ended up taking the top bun off my wife's burger and swapping it for the side with sauce of mine...didn't want to deal with the wait of new food and the fact the manager made me feel like it was my fault.. management is horrible.. food was sub par.... will never eat here again."}
{"text":"I walked in to a manager on the phone (at the greeters stand) with someone who was sick or something (she says I DON'T KNOW WHAT TO TELL YOU BUT I'M NOT COVERING YOUR SHIFT); didn't speak to me but got off the phone and said someone would be with me.  Eventually someone ask if I was dining in or carrying out. 

I was sent to a register(a full staff and still none of them spoke); Tye finally acknowledges my presence. Then she tells me someone will be with me shortly, she then proceeded to take the order of the couple that came in after me. 

Really unfortunate experience, the only person that seemed to be concerned with presentation was Ashley, I've been recommending this location to guest staying at my hotel, I'm no longer comfortable doing so.

Very disappointing,"}
{"text":"The food was great. The breading on the fish and shrimp dish was amazing! Just the right amount of food so that I don't need to go home with a doggie bag. I agree that the service is slow and our service was okay. We had 4 different servers, one for drinks, one to take our order, one bring our food, and one to check on us.  It was not busy and our food came out fast. Try the fried fish."}
{"text":"From the moment I walked in, I knew I walked into a diner. Not just any diner but the diner I was searching for, with that classic juke box feel. I loved the records on the wall and the playlist was great. The mood was perfect and the food was tasty... enjoyably good. As a matter of a fact so good I went the next day for more. When you check out this spot, be sure to order the FRENCH TOAST.. oh my lord... the best French toast I have had, and I was visiting all the way from Orlando. Everyone greeted me with a smile and I knew I came to the right spot. MALCOLM was my server on both days and I truly enjoyed his energy. He made sure we were well taken care of and carried a great convo. He also directed me to a local souvenir shop where I can buy some things to take back home to Orlando. Thank you for the great service and amazing breakfast. I will be sure to visit again. Btw can you deliver French toast to Orlando ? lol"}
{"text":"Being from New Jersey, I know what eating at a diner entails... Gotta say this might me the best diner I've been too. Had a chicken tender biscuit sandwich and its was perfect. Great Service, Great Prices and Great atmosphere. Enough said."}
{"text":"We liked it! The service definitely needs to improve. The food was great, fries and onion rings came out hot and fresh out of the fryer. Enjoyed the burgers and the chicken sandwiches. We will definitely be back when we're out watching a movie there."}
{"text":"Came in for some dessert and coffee . The service was very friendly and speedy . There was a good variety of cakes and shakes . I decided on the strawberry shortcake cheese cake and it hit the spot . Definitely the perfect spot for late night dining . Will come back on another night out and hopefully have the same experience! Thanks ."}
{"text":"This review is long overdue, as I was here back in October for my cousin's wedding. I think the reason I hesistated in writing a review is because I wasn't sure how to eloquently describe just how excellent the chicken and waffles are at this restuarant. 

Imagine dying. Not to sound morbid or anything, but just imagine it. Imagine your life, flashing before your eyes. All the beautiful memories, the laughter, all the friends you had, a life full of enjoyment. And that's just the first bite.

Seriously, if you live in Charlotte and haven't been here yet, you're doing yourself a serious diservice. Everything looks fantastic and it is c-h-e-a-p! The waitstaff is friendly as can be, and the service is pretty quick, even at odd hours of the night. Definite A+"}
{"text":"Service was alright. We waited by the \"please wait to be seated \"sign for a couple minutes. The staff saw us but did not even acknowledge us until someone emerged from the back to seat us. My husband ordered a BLT he said it was alright. The fresh fruit he ordered as a side was fresh and good. I went with a waffle which was pretty awful. The \"compote\" that you pay a dollar extra is pretty much canned pie filling. Overall it's overpriced diner food catered to drunk people. I would rather eat at Moe's on the second floor."}
{"text":"Parking not validated. Trap music a plenty. Chicken and grits are a reason to return just be prepared for shenanigans!"}
{"text":"a group of us from San Diego,  CA had a layover and were recommended to go here for some good food and \"good\" is an understatement! this place was GREAT from their food,  to their drinks,  but most of all for their GREAT customer service! when we flew back in to Charlotte for or 2nd layover this was or first stop and ove again we were greeted like one big family.  The must is their shrimp (cheesey) grits! Thank u to the manager, Tee, Andrea, Dashon, Joshua, and so many others who work there who are some AMAZING fills and the food is DEEEELICIOUS, thanks to Oscar!!!!!"}
{"text":"The place is pretty average. It's built to look like an old school diner. It's a slight step up from a Steak and Shake. The service was great but the food was average. If you're visiting Charlotte find somewhere else. If you're really hungry it's an average place that'll meet your needs."}
{"text":"Definitely had an interesting experience while dining at Redeye Diner for Brunch on a Monday morning. I will note that it was definitely strange to be there on a Monday around 10am - we had seen a concert in town the night before.

The menu is huge and had lots of selection, all reasonably priced and better yet (one of my FAVORITE things on a menu) they marked Redeye Diner recommendations! So I don't have to ask the waiter! I ended up with the Biscuits and Gravy special which was two huge biscuits covered with scrambled eggs, cheddar cheese, and so much sausage gravy!! I cannot explain how delicious it was, I don't normally go for a breakfast this large but it was definitely worth it. 

The staff and space was interesting, decked out in 50s decor and definitely kept up with the diner theme. I definetly wouldn't go back for the service, staff, or enviornemnt but I would go back for the food!"}
{"text":"Late on a Tuesday night (10pm) = good luck finding food in Uptown. I didn't get to eat before going to the show at Blumenthal, and headed toward EpiCenter to find food afterward. Hopping Epi looked more like a ghost town on a Tuesday night. Redeye Diner was open, so diner I went.

I ended up with a cup of the chicken noodles ($1.99) - which amazingly did taste like homemade! I also had a chili dog ($$4.24), but make sure you tell the server you also want everything else on it with the chili or you will only get chili and the dog (they did get me chopped onions & relish upon my request). 

Overall it was better than I expected. Not cheap, but I couldn't expect anything less simply from a \"supply & demand\" standpoint."}
{"text":"We were there at 9pm and I asked the waitress what she recommends she said the fried chicken. I ordered it and it was dry and tasteless! I didn't eat any of it after just a couple of bites. Waitress never refilled our drinks and we were obviously a detraction  from her flirting with regulars! Service horrible! My friends that got the BLT had two pieces of bacon. Just not enjoyable! Staff was there to just have fun and not serve their clients. Bad attitudes! I will not go back!"}
{"text":"My friends and I stumbled upon this place after a hornets game. I'd like to say we hit a jackpot. This place was amazing. The food was great and the service was so friendly. You just get this good vibe once you step foot in the diner. Plus the food came out quickly. Will definitely be eating here more often."}
{"text":"Really bad service!! The food could have tasted better had it been served as soon as it was prepared. I got cold food instead! 

I reached the restaurant at about 2:45pm on a Sunday. The restaurant did not seem too busy at the time, and there was one person ahead of me waiting to be seated. There are open tables and seating available at the bar, but the waiter came to me only after 5 minutes, which is still fine. I sat at a small table and waited for 10 more minutes for somebody to take my order. Finally, a server came by to clean the adjacent table, and asked if I've been assisted already. I said no, so he took my order. He was short with me, but I didn't bother that either. After more than 20 minutes of waiting (all I ordered was two eggs, two buttermilk pancakes and grits), I noticed that other guests who had come after I did, and placed their orders later, got their food. I asked a waitress if she could check on my food as it had been a while. She shrugged and asked, \"Well, who's your server?\" I described to her, and in the meantime my server brought my food. I was happy finally I got my food, but the waiter again was short perhaps because I asked for my food, and asked, \"Want me to get your check if you are in a hurry?\" I was surprised, and said sure. As the waiter left, the elderly man sitting opposite me on a different table, frowned and shook his head. I enjoyed my cold food because I was hungry, but I wouldn't go back. The waiter came by later to pick-up my card and said, \"Sorry for the delay in bringing your food, man. There is shift change happening now.\""}
{"text":"Staying at the Omni and had a late dinner here. Benjamin was hands down one of the best waiters we've had at any restaurant during our travels. Friendly, attentive, and charming. A real gem of a waiter. The food was fresh and amazing. Definitely will come back!"}
{"text":"Went to the restaurant and was seated. No one came to our table for 15 minutes to take our order.  Yet, there were 10 waiters sitting around talking. This was a Wednesday night and the restaurant was not in the least busy. As the guy who sat us down was sitting down another couple (15 mins later) he saw that we had still not been seen by a waiter so he requested one. The waiter went straight to the couple that had just walked in. So I left the restaurant. I've been all over this country and this is by far the worst customer service I have ever witnessed. Maybe they should hire Waffle House employees to get better service."}
{"text":"What a nice experience. Friendly staff, great food, fun atmosphere. I firmly believe any of the negative reviews are coming from intoxicated individuals causing trouble after hours. We went there at 7:00pm on a Friday night and everything was fine. We even complimented the manager and he admitted, the after hours crowd was a lot to deal with. I guess it's a matter of when you go, by the dinner shift was fine."}
{"text":"Great food, great service. It was so hard to me to decide what to eat, but Ms, Patty guided me to an omelette egg supreme which sound so good to me; I gave it a try,  I love it so much that I will come back for a different suggestion."}
{"text":"Fantastic breakfast!  The coconut crunchy French toast was deeee-lish, service gets 4 stars"}
{"text":"I really wanted to like the diner because I was so excited to get breakfast during my lunch break.  The pros are the place is nice and the service was pretty fast. I was hoping for food as good as that at the original pancake house. My meal was simple just their tall stack of pancakes with a side of sausage and orange juice. Sadly the pancakes were flat, thin and dense, while the orange juice was watered down.  I won't give up hope and may try again.  But this was my first impression."}
{"text":"Not the place to go if you like your burgers cooked anything less than well, but our meals were tasty (firecracker shrimp, palls pecan blue cheese salad, chicken noodle soup, and hash and eggs ). Wait staff was very attentive   We were seated quickly and food seemed to magically appear."}
{"text":"The atmosphere of this 'diner' was what appealed to me and located in a great location. The atmosphere was ok but mainly superficial with its look.
It was busy with a short wait but it is a Saturday night. 
The service was ok but nothing worth raving about and most staff seemed to look past you. I sat at the counter and the young female server was friendly and helpful but also filling drink orders as they came in. 
The food.. well.. disappointing. The house salad was well and truely pre-prepared and average in taste and presentation served on a really cold plate giving away it's prepared earlier in the day and sitting in the fridge status. I had the Lee's Special fried chicken and fries too. The fries were 'fresh' cut and relatively tasteless along with the chicken. Whilst the chicken was fresh tasting the coating was average and nothing new. 
Overall I would certainly try alternatives around the city before here.I was definitely looking forward to eating here after hearing good things about it but sadly was ordinary."}
{"text":"So I will never frequent this establishment and will definitely discourage friends and family from eating here.  Probably one of the most horrible customer experiences in my life at a restaurant and we didn't even stay for the food.  Went there on a Weekday around 6pm - only two other booths had customers.  Sat down, ordered 4 drinks.  Husband and I ordered jack and diets and our friends ordered two beers.  Waitress comes back and says they don't have jack and diets so I suggest makers but she says they don't have that either.  Then another lady comes and says oh yea, we have makers, so then they bring us our drinks.  Immediately upon sipping, I knew the liquor was not whiskey.  My husband figures out its rum because he hates rum so we ask to send it back and order something else.  Waitress disappears, comes back, says its policy that once the drink is poured, it's charged.  My husband and I both immediately are like, lemme speak to the manager.  Manager comes over and gives us the same fkn spiel.  We're livid at this point and demand they close out the tab so she's like.. Ok I'll make an exception and repair the drinks.  We go to the bar to see what liquors they have.  Turns out they don't have ANY whiskey so there's no way they could have served us what we ordered.  At that point we closed out cuz we had made enough of a scene that I was convinced if we stayed, they'd spit in our food (or worse).  Upon leaving one of our friends said they brought him the wrong beer.  I'm convinced that bc there used to serving drunk people out on the town in epicenter that they thought they could pull one over on us by serving us some gut-lining-remover rum and charge us for makers.  That or they're extraordinarily liquor dumb.

So in summary, 3/4 drink orders were wrong and apparently their customer policy is to charge the customer for the business's mistakes.   Shittiest. Customer service.  Ever.  Don't support this business."}
{"text":"First time here with family. The food was great I ordered a burger. Everyone else had breakfast food. The grits were made with cream, they were so good. Also service was great! The waitress was so friendly and helpful. If I'm in the area again I will definitely go back."}
