{"text":"Really like this place, I just wish it was closer to my home (no knock on them, obviously).  It is clean and bright and great for kids.  It's less organized than other kid cafes such as Smock, but  that's fine, it makes it a bit rowdier and thus better for kids of all ages (toddlers too).   Coffee is good, and the food was healthy (fruit trays, cheese trays, etc). They also had a selection of vegan treats.  They have really nice toys to purchase, as well.   I will definitely return even though it's a bit of a trek for me."}
{"text":"What a true disappointment. Went with my son after I bigged it up to him and got him excited to go craft.there was nothing to craft WITH. Construction paper. Dried out markers. One bottle of white glue and scissors. Totally lame. The floors were flilthy. Yes.. i know its winter, but if little kids are there at least try to keep on top of it. Teas were tiny cups .no paper towels at the craft area sink.all in all,a really sad let down for my son and I.had i known, i would have at least brought our own glitter and popcicle sticks, you know?"}
{"text":"First things first, this is a kid-Cafe. You must know what you're getting into, otherwise, you'll end up sitting at a table by yourself looking like a totally creepy weirdo adult (like I am right now). 

I don't have miniature human noise makers of my own (yet), but if I did, I think this would be a really, really cool place to hang out. And, I would have loved it if my parents would have brought me here as a little person. They have a great space designed for parents and kids to spend some nice quality time together out of the house.

It seems that they have lots of activities for the little people. Books & games. Kid accessories like a change table in the washroom, a toddler toilet seat, low coat hooks for little person accessibility. The WiFi network is named Green Eggs and Ham (oh so clever!)

The owners have clearly zeroed in on a very unique little niche, and done a great job. Kudos!

Last but not least, the service was exceptionally friendly, and my vanilla almond milk latte was lovely. Can't wait to find a genetic contributor so that I can come again."}
{"text":"Came here on the PayPal offer. Great friendly service enjoyed a nice americano and muffin. Will be back again."}
{"text":"3 Stars.

This place is truly fantastic. Upstairs there is activities for kids throughout the week. Downstairs coffee and chill music for those who aren't kids.

When I heard the name I thought it would be pretty much exactly what it was: a clean, simple, and nice place who asks for creative people to come and be creative. The simplicity of the place is what is so creative. Having a table in the back with markers and crayons as well as many other things for the kids makes this place even better.

The coffee was good and the roaster, Detour, made it better than an average coffee. Basic food options as well as some healthy alternatives (carrots and hummus...I know!) were a nice thing to see.

This place deserves 4 stars, but I have to say I was a little bit disappointed. I was thinking it would have a big massive table with all kinds of thing to play with while a group of people were brainstorming over something epic. Maybe it was a little far fetched, but it was what I was hoping for.

Anyways, a great spot.

That's it!"}
{"text":"Love, love, love this place!

So I've been here a few times. The atmosphere is fantastic - relaxed yet fun. There are always lots of children running around playing board games. The staff is REALLY careful about food allergies, which is something I really respect. I once ordered a peanut butter sandwich and the barista said \"Hey, that little girl over there is allergic to peanuts, so would you mind being a bit extra careful?\" Of course I don't mind - I love that the staff cares so much about that. I've also had a conversation with the owner about the difficulties of food allergies and how she was trying so hard to make the place as allergy-friendly as possible. Also, the vegan chocolate chip cookies are fantastic. I get one every time I go - they're incredible! My favorite one in Toronto. It's so friendly, and so wonderful. I hope this place is around for a long, long time."}
{"text":"My partner and I don't have kids.  Hopefully my partner and I don't want kids (if I can't speak for both of us on that one then there are problems coming in the future).  We came into redfish bluefish creative café because it was a stop on the coffee passport, we were in the area, and we both needed to do some reading before jumping on a flight.  We weren't really sure what to expect and had both agreed that we would reserve the option to drink our coffee fast and head out if it wasn't the right ambiance for us.  When we came in there were two families with kids, and ourselves.  We took the table to the front that was sheltered from the door (wet cold, snowy kind of a day), but not in the main space so we were also a bit sheltered from the kids.  (Basically we could see them with minimal interaction).  The baristas were both incredibly friendly and kind.  I'm not a coffee snob (I generally don't drink it), but my espresso was enjoyable, the tables were comfortable and there might even have been wifi if we had asked.  If you want to view kids without having one of your own, it's definitely a great place to do that as well.  We don't really have this concept where in the states, but I think it's really a nice idea, and I think the owners pulled it off well."}
{"text":"This place is lovely whether you bring kids or not. We came with our baby and a friends and it was a great experience. The adults were able to have coffee and catch up. The kids had lots of things to play with and keep them entertained. The whole upstairs is a great play area. 
They have great coffee and ice cream. Also they have sandwiches and salads. For the babies they have a menu of small items that they can enjoy. My only complaint is that it's not closer to me so I can go more!"}
{"text":"finally got a chance to visit the café. This is such a great concept that I can't believe it is the last one standing in Toronto. Got to the café and it is a cozy sized place with a rows of seating against each wall. One wall has power outlets beside the tables. That is great for laptop users combined with the WiFi. There is a library of children's book to choose from. I finally got a peak at the Darth Vader's Little Princess book :P As far as the food is concerned, I had a coffee, there are a number of pastries to choose from (muffins, cookies, etc). Vendors sourced include 'sweets from the earth' which is one of my favourites. There are two sets of chairs, white and brown. Watch out for the brown chairs which are weighted towards the back, I put my jacket on the chair and it was ready to fall over. Keep that in mind so your toddlers don't horse around in those chairs. There are plenty of high chairs if you need. The crafts (construction paper, markers, crayons, pencil crayons) are in the back. You can bring them over to your table (you don't have to work at the bench). Upstairs there are different functions going on depending on the week (updates on their facebook page or website). The time I went there were a few toys around for children to play with. Also upstairs, is the washroom which has a toddler sized toilet. 
Overall- I'll be back!!!"}
{"text":"Redfish BlueFish Creative Cafe is near Spadina Station and is popular among parents and their children and mothers-to-be! Of course, everyone is welcome to enjoy their stay here. Luckily, I arrived when it wasn't too busy. Every week, there are different programs being offered for both children and adults. They have events such as drama, crafts, and yoga. You can see what events are happening during the month on their website. The cafe provides toys, crafts, and books for the children to use during their stay.

One of their specialty drinks is the Fluffy, which is steamed milk that you can add a flavour shot to if you wish. They also have nut-free snacks available for children who have nut allergies. Most of the food available is delivered in fresh everyday by Foodbenders. Some of the salads and sandwiches are made in-house by the cafe.

Overall, the cafe is a great space to bring children and it provides parents with something new to do. It gives both the parents and children the opportunity to interact with others and create new friendships! As well, the cafe no longer uses stamp cards but if you have one from the past, they will honour it."}
{"text":"I didn't realise this was a cafe catering more towards young parents and their offspring when I walked in. But boy was I glad that such a place exists despite not having children! Why? 

Well you see I decided to wear boots that cut up the back of my ankle BADLY. I somehow made it to Spadina and Harbord without succumbing to my injuries. I walked into this place and said \"can I please have a latte and a bandage?\" What did I get? A yummy latte, SEVERAL super cute bandages and concern from the two lovely ladies behind the counter.

I didn't feel creepy taking off my boots and plastering on the bandages in the back of the bright cafe. I loved the energy in the place and the way the staff interacted with the children (and me and my boo boos).

I also heard talk of a mommy and me type yoga class happening upstairs!"}
{"text":"Love it. Friendly service, delicious and healthy food (lots of vegan friendly options), and great craft space. J and I enjoyed our lunch in this clean and bright cafe. After lunch we headed to the back to do some crafts. They weren't very well stocked for craft supplies when we went but it was sufficient, J enjoyed it, and staff came to check in on us every so often to see if we needed anything. I would definitely recommend this place and visit again."}
{"text":"Visited Redfish Bluefish for the first time this morning with my 4-year-old. It was somewhat quiet when we entered at 11am but within 15 minutes was almost packed. The staff said this volume of business was unusual for a Sunday. Good for them, though, attracting all those people!

As we waited for our friends (another mom and her 4-year-old), we found the staff to be friendly and patient, apologizing for any delays, and the other patrons working together (figuring out how to share tables and chairs). There was a great sense of community, totally befitting the space that used to house the Women's Bookstore.

I really appreciate that the crafts table is free of charge to use (though I understand why other places charge for their supplies); I also like that there's kid-friendly food and all menu items are very reasonably priced. Plus there's a nice selection of kids' books and a large bathroom with some free diapers for those who have emergency situations. I also saw a staff member looking up ingredient listings for the assorted muffins, helping another patron avoid any items with corn (one of her daughter's allergies). Lots of thoughtful touches here. Some fun 90s R&B playing today, too!

My food order included a small bites plate (three little bowls filled with snacks of my kid's choosing, from a list of available options), a muffin, a Kiju juice box, two Americanos, a bowl of soup and some toasted challah -- all for $20 after tax. Not bad at all. I have a feeling that you could just order some coffee and not be rushed out. We felt very much at ease, very welcome to stay as long as we liked.

We were there for almost three hours and had a lovely time. It's as enjoyable as Smock, and closer to our house to boot. We will definitely be back! (Can't wait to return in the warmer months, when we don't have our bulky outerwear taking up so much space, and the outdoor area in the back is open for use.)

Thanks, Redfish Bluefish!

(P.S. My friend ordered a small bites plate with two bowls of strawberries and a bowl of watermelon. She received two bowls of watermelon and one bowl of strawberries instead and was told that they'd run out of strawberries. It was really busy at the time and maybe it would have been better if the staff had informed her of the need to substitute before bringing out the plate -- in case she'd wanted something other than a second bowl of watermelon -- but I'm sure if she'd asked for something different they would have taken the watermelon away and brought out what she wanted instead.)"}
