{"text":"food is okay. We have eaten here a few times, never really impressed with the service or the way the place was operated.  Our Last time in, we sat ourselves at a bar table, without help - big mistake. Note: no one was at the door to greet us, no sign stating \"wait to be seated\"... and we sat down in a not very busy bar area.  A waiter came over, greeted us and smacked the back of her hand into the palm of her other hand while shaking her head ~ letting us know we were wrong to have seated ourselves. A few minute later she dropped off menus and said \"welcome to your first time eating at a restaurant\"   The first expression would have been \"okay\". The second was way over the top. On past visits the service has also appeared understaffed and not afraid to express their frustration.  We explained the poor service to the manager as we left, without eating. He appeared as interested in the details as we are in ever returning - not very!  Okay food. Consistently poor service."}
{"text":"What a pleasant surpise.  We were in town to go to a horse show at Lake Erie College.  The first meal was so great we came back for a second round the second night.  all four meals were very good.  The chocolate chip brownie dessert thing.... get that."}
{"text":"I love the food here. I live in Columbus and travel to Buffalo frequently and try to stop for a meal any time I can. Always go for the daily features."}
{"text":"If you love great food and a good time this is the place to go. I cannot say enough good things about Redhawk. This place is a must try!!! Their ranch should be bottled and sold in stores. HA"}
{"text":"All I can say is HUNGARIAN HOTS!!! your stuffed peppers are the best!! Actually everything is amazing!! The Mac-n-Cheese - that is a big OMG!  I could go on and on but just go yourself, you will not be disappointed, I promise!!"}
{"text":"Excellent food and service.  Six of us were there and everything was prompt and professional.  We did have one issue with one of the meals, but the manager came out and jumped on getting it corrected.  They earn my respect for how quickly and courteously they handled it."}
{"text":"What can I say...I just thoroughly enjoyed my burger!  It was the best burger I've had in a long time, cooked perfectly and mouthwatering!  I will be back:)"}
{"text":"The French onion soup is awesome. Frisco melt is wounderful. The waiters are awsome, great atmosphere!"}
{"text":"I am always disappointed when I go to a restaurant, order a dish, and upon tasting it realize it is frozen food.  I went there for a casual lunch and found the food to be average to below average.  If you like reheated frozen food or burned burgers, this is your place."}
{"text":"We love Redhawk!!!! Been here several times throughout the years. Great food. Great atmosphere."}
{"text":"Like this place. Service has been okay to good depending on person. Food is usually very good. We are able to take our 2 and 2 yr olds, but it's nice for date night too. Outdoor patio is great. Just like this place. Kids love the dumplings."}
{"text":"Over priced and small portions! They have a nice atmosphere and menu but not worth the anount they charge for what you get. The most I will go here for is drinks and then dinner else where."}
{"text":"Stopped in with the family after doing the covered bridge tour. We had a couple burgers with fries, mac and cheese with a goldfish topping and potato skins.  Burgers were very food as were the potato skins, 15 y/o daughter said the mac and cheese could have done without the goldfish but otherwise good.  Service was very good.  They had an outdoor patio which we were told was beautiful by our server but the hostess didn't give us the option and we had never been there so we didn't know about it.  We rarely get out that way but we would stop in again if we are"}
{"text":"Terrible service!  Had to flag bartenders down several times just to get a drink, remind her we asked for menus, then no one came back to take our order despite having 2 empty glasses in front of us (no one asked if we wanted another). When we complained and asked for our bill, all we got was attitude from the young server.  Spoke to the manager (who happened to be standing right behind us) and we were just blown off. Will NOT be back.  Bad service is one thing. Rude comments and attitude from staff is just uncalled for. (And it wasn't just us she was being rude to or that were complaining.)  The whole experience was just unreal."}
{"text":"Great place for a monte Cristo sandwich. Would definitely come back to this restaurant."}
{"text":"First time there on Sunday evening. Waited in the front lobby for almost 5 minutes until someone greeted us to seat us. We sat in the dining room which wasn't at all busy - since the patio seemed very busy. Our server didn't seem happy to be there. She tried to be nice but the constant frown on her face said it all. We ordered a couple of steak entrees; we both ordered coleslaw as a side and one entree came out with peas. (Even our receipt showed we ordered the coleslaw).  The dining room had two large tv's in which channel 8 news was playing - as much as I like the news , I didn't want to see the latest murder trial information while I'm trying to eat a relaxing dinner. Other than that - The food was tasty and our steaks were cooked perfect. Probably will try it again in the future, but will rather sit on the patio next time."}
{"text":"We ate outside and really like their outdoor patio. The first thing we did was order drinks, the alcoholic drink was good, the sodas came out watery. The waiter changed the syrup and brought us new ones. The saerkraut balls app was very good and we were all looking forward to the signature hamburger special for lunch. Unfortunately they didn't cook it to the temperature we wanted. We asked for medium rare and didn't even get pink in the center, what a shame to overcook such a nice blend of meat. The waiter asked about the burgers and we told him they were overdone but being on a tight schedule we didn't send them back."}
{"text":"I haven't tried much at RedHawk, but I have heard great things from friends, especially on Mussel Monday's (not a seafood eater myself). The boneless mild wings are God's gift to Painesville. For $10 you get a ton and they won't skimp on the sauce/dressings.   However...  I didn't mind being told a 10 minute wait and then promptly ignored for 43 minutes, but my wife wasn't exactly thrilled to sit in a bar parking lot waiting forever for food I ordered well in advance.I flagged down a busser (not hostess) to check on the wings I ordered almost an hour ago. He runs back in 10 seconds and - whaddaya know!!! - my wings were done.   ....But they are some darn good wings!"}
{"text":"I am definitely coming back!! I came here for a quick lunch but they took more than 30 mins for my delicious Airline Chicken plate. I told them I needed to go since I had an appointment and when the food finally came out they apologized for the long wait and comped my food!!! Great service and food was perfect :)"}
{"text":"Great outside patio. Normally great food. We had the jambalaya and scallop angel hair pasta. Large portions but not much taste to either dish. Will be back but will order differently next time."}
{"text":"Perfect location, amazing food, awesome staff. I had my wedding reception here during Labor Day weekend with about 150 guests. The manager Chris was always available to talk or answer questions, and he did an amazing job accommodating all our requests and putting everything together. Red Hawk is the perfect place if you want an outdoor event but are worried about inclement weather. It was a less formal feel compared to your typical mundane reception hall, which was a huge plus. It was a relaxed yet elegant atmosphere that accommodated older guests, kids, and everyone in between. We had the entire patio as well as the inside of the restaurant in case of rain (no need though, the weather was great!) The staff handled all the set-up and provided the tables, chairs, linens, pretty much anything we needed. The patio looked beautiful at night with the lights strung across the dance floor area. I am still getting comments about how much our guests loved the atmosphere, food (buffet style with TONS of options- even had a wide vegetarian selection...YUM), and bar (open bar with just about everything).  The staff was super friendly, and the servers were courteous and kept the night running along smoothly. I might be biased, but it was the best wedding reception I've been to, and many of our guests agreed :)"}
{"text":"Although the patio is fantastic (as long as no smokers come in -for some reason this place must be above the OH law that states smoking is illegal on patios with food) - the food and drinks leave a lot to be desired. It is similar to Panini's food but more expensive. It should be listed as $$$$ not $$ as it is extremely overpriced for the quality of food - especially considering the lesser priced options next door such as Pub Frato where the food and drinks are far superior. In fact- for an equal priced option nearby - check out John Palmers where the prices are the same as Red Hawk however the food matches the price (gourmet quality).  The service is also most often slow."}
{"text":"Poor food quality and way overpriced for what it is... used to be great 4+ years ago... now just average bar food, even In The restaurant"}
{"text":"We love this restaurant.   We ordered through the Yelp app which worked great and was very convenient.   Red Hawk has the best mussels anywhere.  We had that for an appetizer and our dinners were equally delicious.  Chicken marsala with risotto and grilled apple pork chops with mashed potatoes.   Both the chicken and pork were tender.  Portions were generous and we ended up having it for dinner again the next day.   We will definitely order through the app again and we will also visit Red Hawk again."}
{"text":"We had lunch as we were passing through. The restaurant is conveniently located right off of the freeway.  We arrived after 5pm and the parking lot was packed. I had the pulled pork sandwich with fries. The food was good and very hot, just how I like it! I highly recommend the fries, very crispy!  I noticed the ketchup bottle was dirty. Also,  the service was not that great. I think the staff is pretty young,  maybe that's why. Our waitress was not very attentive. She dropped our food off and didn't come back to check if we needed anything until we made eye contact with her while she was having a conversation. The service is what kept me from giving this 5 stars, and the dirty ketchup bottle. Great place to stop if you're not in a hurry."}
{"text":"Very average food. Not bad, not good. First time, had the fish and chips. Fish was pretty good, chips were ok. Second time, I ordered the Mac and cheese. Um, not good. The mac and cheese would have been a lot better without the goldfish cracker crumbs, which gives it a horrible artificial cheese flavor. Ugh! Revisit this idea, chef, es no bueno. Service was fine, no complaints. Just kinda uninspiring overall. I'd give it an extra half star, were that available."}
{"text":"Although they are well thought of by our friends in the area I think they suck.Slow cold servers,short pour drinks so-so room temp food."}
{"text":"We love RedHawk Grille.  Happy New Year all!"}
{"text":"My family and I have been coming to Redhawk grill for quite a few years, we come from California to visit family a few times a year. With each trip, I have enjoyed dining at the 'Hawk. A few weeks ago we were in town and of course we made a visit to the Hawk, we actually went twice on this visit and this was the first time ever that I was disappointed, I chalked it up to a bad night, it happens and we went back a few days later before returning home.  My family and I sat in the bar as we often do, where we were treated poorly by the bartender, I believe her name was Vanessa, or Melissa? She was very rude to us. I tend to tip $20 cash when I sit down to a new bartender expecting good service but this had the opposite effect on her. We waited a half hour for appetizers and even longer for our dinner.I had the Mediterranean wraps which were inedible, and my husband ordered a rare steak that came out well done, but he ate it as we were so hungry by then. Overall, no one in my family was happy with the food or the service. The Redhawk grill has always been a top-shelf establishment where we could always count on good food and excellent service and meet up with family for some great memories, drinks and enjoy an excellent meal and service. I'm hesitant to do this review after years of reliable service, I don't know what changed, but we won't be going back, very disappointed! I only wish I could give it less than 1 star, I won't be spending my money there next visit."}
{"text":"My wife and I just got done with a round of golf and wanted a nice quick dinner outside to enjoy the wonderful weather we are experiencing in Lake county Ohio.  We decided to go to the Redhawk Grille and eat on their patio.  We got seated promptly outside on their patio which is really nice.  It provides shade from the sun and yet lets you experience al fresco dining in comfort. We started off with some cocktails, and the ordered our dinners.  My wife ordered the P.E.I Mussels appetizer.  They were huge and prepared just exquisitely.  The order came with some bread which perfectly complimented the broth.  The mussels were huge and more than enough for one person for an entire evening. I had ordered an ordered the appetizer of dry Cajun wings, which was accompanied with celery sticks and blue cheese.  I probably got a dozen wings as an appetizer which I took over half of them home.  I have never been disappointed with their wings. There was a lot of activity on a Friday night, but the service was excellent, and the atmosphere was great and very lively.  The place was slammed, but still provided great service.  Sorry for no pictures of our appetizers."}
{"text":"1 Stars for the bar side 0 stars for the restaurant side, I've been here many times and always enjoyed drinks with friends and had a few appetizers it is typical bar food but you know what to expect when ordering, however my disappointment comes from the restaurant side.  Came here with a party of four sat in the restaurant and ordered a few drinks before dinner. The service was slow but she managed to get back in time for us to order dinner before they closed unfortunately. We all ordered the special fried lake perch baskets now since we live so close to Lake Erie we all understand what lake perch are. When the dinners arrived all of our mouths fell open the baskets were filled with something that looked like fish sticks formed in exact triangles every piece was identical to the other. Before our serve ran off I asked \"is this lake perch\" she rudely replied yes  I quickly but politely disagreed so she left and came back a few moments later and told us the Chef (no chef would serve this crap so I assumed she meant the short order cook) told her it was some type of white fish they call perch that must have come out of a lake somewhere. I immediately told her we thought it was Lake Erie Perch because of the price (it wasn't fish stick prices.) and the way it was written up she told us everyone says that.   I told her we would not be eating this and wanted to change our order she replied that since we started eating she could not take it back I showed her no one had eaten any we simple broke a few pieces in half to expose the silver and black meat under the greasy crust at this point she told us well they won't take it back and hopefully next time we come we order better.   There was no offer to remove our meals from the ticket and it was clear the manager wasn't going to attempt to make this right so I paid the $80.00 and now I'm telling my story to you honestly we were deceived and never would have ordered this imported crap if we weren't lead to believe this was fresh local fish.  Buyer Beware!"}
{"text":"Have been here a few times in the past and the décor still is a bit outdated and drab.  I would think they would do a redesign to make the place a bit more cheery and modern looking.  However, the food was pretty good and the country fried steak was excellent and quite large.  We did order an appetizer of calamari, but it was bit under cooked and the sweet and sour sauce they use with it isn't that great so I would not recommend that.  The service overall was great and I have no complaints there.  So if you have a bit of an appetite I would recommend Redhawk Grille as a possible destination."}
{"text":"Was on the 17th hole at Quail Hollow resort when we could smell the grill and see the patio.   The amazing aroma brought us to the wonderful place.   Great food,  great selection of whisky  and friendly staff.   Michael and Chris made our experience exceptional.  Highly recommend if you are in the area.   This is a can't miss place."}
{"text":"Right off the highway, Redhawk Grill seems to be a pretty popular hangout. Their outside patio is glorious with a full service bar, water feature, and plenty of tables. We opted for takeout, but had a drink while we waited. The bartender and patrons were all extremely friendly, offering us tips for the area during our short visit. I had an awesome chocolate martini while waiting for my meal. They were able to let me order from the kids menu since I'm a vegetarian. I went with the kids macaroni and cheese with a side of vegetables and another side of sweet potato fries (vacation means extra food right?). The macaroni was great, but the sweet potato fries could have used some more salt or ketchup, don't forget to ask for condiments if you order take out! Next time I'll try the dessert too, I think I see cheesecake in my future!"}
{"text":"Killer happy hour. $.01 for a double shot in your drinks and great happy hour food offerings. Shrimp and grits are great. Def worth the cash."}
{"text":"Always my go to when I am on the far East side for work. Really cool hang out place and the food is really good for more of a bar scene. Chipotle crunch burger and Cuban are really solid. They also got some good beers on tap."}
{"text":"Best thing about Redhawk is their outside patio. Patio is spacious n charming. Frequent Entertainment on patio during summer months. Food is good. Specials daily. Not too many chicken choices. Salads r good. Pizzas are good."}
{"text":"The food here is always consistent and tasty - the service is usually what is hit or miss.   They have delicious risotto and the filet is tender as all get out! It's my favorite dish by far - the gumbo is very good though as are the burgers.   The back patio is the best in the area and they generally have live entertainment - the cheap pints of craft beer on Wednesday are also a huge plus of this local find."}
{"text":"Actually make that 2.5 stars. They have a nice patio with plenty of seating which was the main reason we chose to come here for a late dinner. The menu is your typical, run of the mill bar and grille menu with burgers, salads, appetizers, etc. The mediocrity was apparent when the food arrived at the table. I chose the Harvest Salad which was described as having \"crisp field greens, goat cheese...\" , the dish I was served had iceberg lettuce (yuck!!) and was quite small for the $10 price tag. My dining partner had the tilapia with mango salsa which was very tasty. The service was attentive and prompt as well. If your looking for drinks and some appetizers this place will work, but if your looking for anything more I'd skip it."}
{"text":"Good game day deals on food and a nice selection of craft beers on tap. I've heard this place is even better in the summer when the patio area is opened up.  The $5 game day wings were a good value and the Great Lakes beers went down smooth."}
{"text":"The Redhawk is a good option during the summer in Concord. It has the nicest patio area that I've seen on the east side. It's large with a fountain, Koi pond, beautiful landscaping, comfortable chairs, bocce ball courts, and a good sized outdoor bar. It even offers views of the picturesque Quail Hollow golf course next door. The menu is large and diverse, and they have a decent amount of gluten-free choices. I'm not normally a salad-as-an-entree person but the salads are amazing there. They're huge too so they can definitely be a meal for most. Why am I not giving the Redhawk 5 stars? First the service isn't the friendliest. The servers often seem like they have better things to do. Second the food comes out staggered many times and sometimes takes too long. Also, while they have a decent sized dining room, it's nothing special, especially compared to the amazing patio area. If it's a nice day, eating outside at the Redhawk is a good idea. If not, there might be better places."}
{"text":"My wife and I had our rehearsal dinner at Redhawk Grille and it was fantastic. The GM was very accommodating and the staff the day of the event was great. Everyone loved the outside atmosphere, the food was really, really good and overall the experience was exactly what we wanted. Highly recommend Redhawk to anyone looking for a new place to check out."}
{"text":"Tried it again after a year. Still not good.  Concord area just doesn't have that pretty looking ambiance fun feeling.  I guess we just came from having a glass of wine in Madison and it was so pretty.  Then you went to concord. I felt bad our food was tasteless.  Redhawk you need to get a new menu and go to places like Downtown Willoughby and reinvent yourselves.  Your menu lacks imagination and taste."}
{"text":"Great place with amazing food and amazing bartenders. The atmosphere and local music top off one of the best places in the Concord!"}
{"text":"This was our first visit & a very good experience! We arrived on a beautiful Sunday evening so decided to take advantage of the patio. The patio was about 2/3 full. The hostess accommodated our request to be seated next to the koi pond. I'm probably showing my age but I really liked that, from where we were sitting, the background music was just that - BACKGROUND music! We could actually enjoy dinner conversation!  Our server promptly greeted us, was pleasant, took our drink orders, & quickly returned with our beverages. Dinner orders were taken then served within a reasonable time with no issues and several follow-ups to check on us.   I had the jambalaya which was very good. It was a large serving and hot temperature wise. The price points are average.   In my opinion, Red Hawk Grille is a very good choice. If you've read this review & agree, please indicate you found it useful."}
{"text":"Came for lunch today, wanted the cheese board and the server informed us they only had 3 boards and would not serve us one, even though we said we didn't care that it was on a plate. Seriously? Love the patio, service was mediocre at best. Disappointed that the server didn't really care about the customer."}
{"text":"If you like big food, you are gonna love the Red Hawk. The portions are huge, and the food has always come out hot and tasty! The service is very good and the place is clean. They have a full service bar, with seating in the bar and the main dining room, so if you want a quiet meal, sit in the main dining room. The bar is a vibrant and busy spot, so if you like it a little noisier, the bar is for you! All in all, it is a pretty great place for a meal. You will most likely be going home with leftovers!"}
{"text":"Very friendly and knowledgeable staff. Great music and wonderful outside patio. Love the fact that it had bocci ball near the patio. Lots of great seating and good food. Great service . Kids burger was overdone and it quickly was replaced with a yummy replacement. Great place, and will for surely be back."}
{"text":"We had a great lunch here. It was crowded in the patio and slightly filled inside. Service was great. The hamburger was a large portion size. The fries have a coating on them that I didn't care for. The fish and chips was great. The fish batter is different. It is slightly sweet. Great location to have conversation. Sinning room is not loud."}
{"text":"Definitely a great place to sit outside and eat at! The chicken wings are the best around crispy and the favors are perfect and the jambalaya is as well"}
{"text":"The service was good (better than other reviews state) and the food was tasty. Typical pub fare."}
{"text":"We recently were in and got a soup, two salad a with chicken and two diet cokes. Are total was 42 for lunch. I cannot believe a lunch is this expensive. We can eat at high end restaurant for this price. We love the patio but the pricing is slightly high !"}
{"text":"There are other places.  Food is mediocre. Service is awful.  Prices are higher than they should.  Go somewhere else"}
{"text":"The Red Hawk Grille has not ceased to amaze me. They added the awesome new bar in the back bar made out of a shipping container. When it gets chilly there a fireplace outside you can cozy up to. What's really cool as I found out all of their sauces, all of the dressings, all of those desserts, are all home made. I suppose it is cheaper to make your own ranch in house but man it taste a whole lot better. They make their own butter. I suppose it's only a matter of time before they make their own beer LOL. Anyway the kitchen also never ceases to amaze me is anytime I want to special order something if they have it, they will make it. Is there something on the adult menu that you want cut in half and call it a kid's portion? Yeah they'll do it. If there's something that you want whip together and they happen to have all the ingredients? Yeah that'll do it. I love this place and have become very fond of the manager and the owner and the service. It is a solid reliable place to go to and it is kept clean and repaired. The owners always seem to be willing to improve something cosmetically and it shows. Way to go Redhawk"}
{"text":"Great service! (we sat in the bar). Great food!  (Caesar salad with salmon/egg plant parmesan) Huge portions! I rarely leave food behind but I couldn't eat it all!"}
{"text":"4$ long islands on Saturday, I had one that was phenomenal. For appetizers we had our complimentary bread with our meal that had a sweet butter to go with it and some jalapeño pretzel bites which were also very delicious. I also had their clam chowder and a sandwhich with portabello mushrooms on it. This was my first trip to this restaurant and will not be my last ! I haven't been this pleased with a new food spot in a long time !"}
{"text":"I don't get some of the negative comments. We showed up for lunch with about 20 relatives. Management was friendly, wait staff was friendly and efficient, and the food was pretty good. They handled our large table with grace."}
{"text":"Hosted a wedding shower yesterday and the service was above and beyond!  Doug and co. were so attentive to our party and did not miss a beat.  The food was great, the set up they gave us looked awesome and the general atmosphere was so inviting and fun.  After being there late Saturday night, I was pleasantly surprised Sunday morning when our whole area was cleaned and ready (I truly expected to have to ask them to sweep and wipe tables based on how busy it was Saturday night).  Definitely recommend, especially if you are comparing to other available dining options in the immediate area!!"}
{"text":"We booked my grandaughter's Baby shower there last week-end and when we arrived another group of people told us they had booked the whole building for a fundraiser and it had been booked since March, We replied and noted our event had been booked since January, but the other party said they had just came in and spoke with the manager 2 days previous and they were going to set up acoustics etc. in our room we booked, there was not a manager or anyone there to help sort out the mess and my granddaughter who came in from North Carolina was so upset as she thought we were not going to be able to have the shower. We also had guests coming from Florida, and was highly upset with the non help we were receiving and so we started setting up our tables etc. We put the tables in the set up we wanted and asked for tablecloths and we were brought out a bag of tablecloths with no help to set up. We were doing balloons etc. and setting up the cake etc. in the back of the room, when someone finally came out and said they would get this all sorted out and yes we had the room and they would help accomodate our order. We were going to leave and go home to change and get ready for the shower and we were afraid to leave, fearing that we would be moved out of our room. When we were leaving to go change, the red hat ladies group showed up and said they had our room booked too!  We had to stand our ground again....with no help from the establishment! We ordered a Mimosa bar, the champagne and juices was brought out and set on a table with ice, we had discussed fruit to be set up such as raspberries and strawberries etc. we did not get any fruit. When the food came out it was salads and cressant sandwhiches, with no chips, bread etc. There was a little girl sent out to do drink orders etc, and she was running around getting things we needed. She was our only help and was great by the way. We thought the Red Hawk would be a great place to create a baby shower for all of our granddaughters family and friends and we were poorly mistaken! We were not compensated anything for all of our troubles and heartaches!! Not only was the baby shower in the main room, but we had all the men, grandfathers, great grandfathers, friends of the baby's father etc. in the bar area, and paid for food and drinks over there. All of the men pitched in for the fund raiser that was going on...and we were all happy that at least the fund raiser was going well...and one would have thought that we would have received more respect and some kind of compensation! We were Sorry that things turned out this way and that all of our guests had to experience the headache we were going through! Annette B./Christina J.-Painesville Twsp."}
{"text":"Excellent food but rather leisurely service.  Their \"High End Burger\" special, made with beef from multiple expensive cuts, is wonderful.  The grilled Portobello sandwich was also great, and you can get grilled veggies instead of fries as a side.  Salads fresh and tasty."}
{"text":"Pleasantly disappointed!  The place is nice and I was really looking forward to dinner with my family.  We were celebrating our wedding and while the service was lacking - could be because it was a Sunday - my meal New Orleans Jambalaya was superb! My wife had a big old hair down her Jack Daniels Strip! Sure they took it off the bill - but the old waitress did not offer a substitute meal - and quite frankly my wife had lost her appetite."}
{"text":"After four visits to Redhawk, I guess it's about time to try someplace else. Each time I was served something other that what I ordered. Tonight, once again, I ordered a simple sandwich with chips and 45 minutes later was served hot fish and french fries. When I told the server that it wasn't what I ordered, she disappeared into the kitchen for another 7 minutes and returned to tell me that they were out of what I had ordered. Meantime my guest was sitting there with his meal. Why would someone wait until the other party was served to tell me that they didn't have what I ordered? Stupidity, perhaps. And what is wrong with the kitchen staff that four times out of four they cannot produce a basic sandwich, which by the way IS ON THE MENU!!! We asked for the check for our drinks and were made to wait another 9 minutes while the waitress hashed it out with Dennis, the manager. When we spoke to Dennis on the way out, he was quite miffed at us and arrogant. Guess what folks? WE WON'T BE BACK and we will tell everyone we know. Perhaps if the manager had been gracious or pretensiously apologetic, we might have considered coming back in the future. But arrogance and ignorance just don't go well in a service business. Bye, Bye Redhawk."}
{"text":"Always satisfied with my food at Redhawk. This is a great summer dining location as the patio is large and gorgeous with a full outdoor bar as well with TVs. I do not dine inside here, the atmosphere doesn't appear as pleasant. This rating is for patio dining.   The service is made up of non professional servers. Do not expect a top notch experience and you should be satisfied. The servers are mostly young outside and seem to be made up of college students. Things will be missed, but they try hard and make up their mistakes. I know they probably have a large need for seasonal staff as the patio gets busy and is large. I believe they regularly have Thursday Friday Saturday entertainment outside as well. These can get loud if you're sitting close, which is set up on the prettier open side of the patio.   The food is upscale bar food and the ingredients always appear fresh. I also enjoy the variety on their menu and it's uniqueness. The salads are far from boring and loaded with a variety of ingredients. The fries are flour coated for that extra crisp and flavor which a lot of people tend to like... I'd prefer fresh cuts, but that's me.   I'd recommend a nice lunch or a casual dinner outside on Redhawk's patio. Hoping for good weather!!!"}
{"text":"We were hoping that with the new menu we could add the Redhawke to our dining rotation but we will have to leave them out of our loop. Food is just so-so. We'll stop by when the weather warms as we do enjoy a good patio. After all, how badly can you screw up a beer? :)"}
{"text":"Usually my favorite place to go while in the area. Hawk provolone is simple but solid as is the pierogi and sausage. This time though tried the shrimp chorizo which was not as expected. Didn't have any chorizo however the rest of the entree was as expected again minus the taste of chorizo in the Cajun cream sauce.  Wife got chicken chicken sandwich which is typically good but they forgot the mayo. Might have just been a carry out issue. Disappointed this time around though."}
{"text":"Great place to go and unwind with friends. The atmosphere is inviting and all of the staff I encountered were great! Super fast and friendly service, especially for a very busy Friday night.    I ordered the Cuban and it was really good. The meat was delicious and everything was put together perfectly. Our wait time was much shorter than I expected and our waitress was fantastic with making sure we were doing well and had plenty to drink.   I would definitely recommend this restaurant and plan on going back again soon."}
{"text":"This place has a lot going for itself.  The family and I stopped in there for dinner last night.  It was our second visit.  We sat outside.  The patio has a great atmosphere--lively, but not too loud, until the live music comes on.    The menu offers up a wide variety of homestyle comfort foods and there's something on it for everyone.  The food is made fresh to order and the flavors are pretty good.  I started off with the clam chowder, which was very good.  For my entree, I chose a special, which was a soft-shell crab sandwich.  It was cooked well, but it didn't come with any type of sauce, which was disappointing.  I'd have given 4 stars had it been served with a spicy remoulade or something to liven it up.    The portions were, in my opinion, a little out of control.  I can't blame the restaurant when it comes to portions though.  So many diners want pounds of leftovers to take home, but it's not my cup of tea.  I personally find large portions to be a bit obscene, to the point where a huge plate of food can ruin my appetite.  That said, if you're a big fan of large portions, then by all means, you're gonna love this place.    Overall, I enjoyed this place.  It wasn't pretentious.  The prices were reasonable.  The food was fresh and flavorful and the atmosphere was pleasant.  I would eat here again.  Very kid friendly with good service."}
{"text":"Great patio!  However, they water down their alcohol! Seriously.  You're fine if you stick with wine or beer. Food is ok.  Over-priced."}
{"text":"The Red Hawk is a great place to grab a bite if you're in the area. We were passing through on our way to NY for a ski trip and we stopped off here.   First, it's like two places in one, the bar/lounge area is separated from a quaint dining room. We opted for the quieter dining room option. The place had a good ambiance, or vibe to it.  The food and service were both outstanding for the price. I had the spicy burger which wasn't overly spicy, but had a little kick. The burger itself was excellent. There were also pierogies, which were home made and also excellent.  Overall a very positive experience and I would definitely stop here again."}
{"text":"Haven't been here in a while, pretty good food, servers very personable, apps came out fast, slow on the bar drinks, very slow on main course, fairly nice atmosphere, crab cakes a little different, but good, although 3 cakes for 2 people, c'mon, for $14 dollars, not that good, $3 bucks of crab? Steak was flavorful, but undercooked for what I ordered, ok though. Overall good experience kinda pricey"}
{"text":"The place was spectacular the service was great the food was great the and belly dancers were great too great entertainment"}
{"text":"Every time I go here the service has been okay...last night I had the worst service I have ever had at a restaurant. The little blonde waitress never told us her name, the specials, or offered to refill our drinks at any point of the night. My boyfriend had to go to the bar multiple times to get us drinks because the server never offered! We arrived a little later than the other 4 there and put an order in for sweet potato fries right away. About 15 mins went by and we got our drinks...still no fries. Then about a half hour and still no fries...then our food arrives. And we said to the lady who brought it...who happened to be the manager- that we never got our appetizer. She was in shock and said she would make sure to take it off the bill. We ate our food and still no server to offer us another drink. We became very angry and asked another server to get the manager. The manager apologized to us very sincerely which was nice. However the entire lack of service was unbelievable to me. I was a server and worked in the food business for 10 years and this girl with apparently no name will never be able to cut it in the restaurant world. I hope she learned her lesson. $0.00 tip on a $130.00 bill. You have to earn your tip sweetie. Sorry! If you go to the red hawk make sure you do not get a very short blonde because it will ruin your time! I am giving 3 stars because I have had decent service in the past. I will return, but will not get the no name server again."}
{"text":"Pretty good joint here. The service was great. Very pleased with the Harvest Salad I ordered - Great size serving for the money and the salad was delightful. Love when I order goat cheese on the salad that they break it up for me, I hate when it's a huge chunk. I had the honey-lime dressing on the side and was happy with that as well."}
{"text":"This place is huge and is very popular among the local community. We found this place on a sunday when everywhere else was closed. They have a full bar and wide selection of food. Don't sit outside unless you want to lose a pint of blood due to all the bugs sucking you dry."}
{"text":"Literally have been wanting to come here for years because the dudes I work with have been raving about it.  I guess for Painstucky this place is dope but for anyone that has ever been to a bar in any city of any size It's kinda wack.  The 2 stars are for the dranks and patio only.  We got there about 6pm on a Friday.  Now, normally I think people who HAVE to sit on the patio are obnoxious twats but this place does have a really, extensive and amazing outdoor seating area.  We asked and the wait was 2hrs or something.  No biggie.  I get it.   We opted to sit inside.  The chick finally came over to us and was either pissed she got the inside shift (to make less money) or she didn't take her happy pills today.  They had Long Islands for 4.00 which is amazing.  They were actually made with REAL BOOZE!  What a novel idea.  The menu either had moderately priced apps, burgers or overpriced entrees.  Wasn't feeling a burger so I got a friggin quesadilla like a putz but that's all I was feelin'.  Asked for no onions and I was told that they cant do that and still have the peppers.  Sure sign of frozen, bagged veg to me.  Everything was OK but literally tasted like GFS or Sysco stuff heated up.  The server chick was a total Nazi about stuff.  Judging buy how uppity and self-important the table next to us was, I can see how she had to be sometimes.  In our case, it kinda sucked...."}
{"text":"We dropped in a little bit earlier for dinner and found a patio to be very inviting. Our waitress was very nice and knowledgeable about the menu. The food was delicious."}
{"text":"Realized it's been awhile since I've updated my review. New management, revised menu, too-notch service. Huge difference from years ago! Whether you're looking for a \"quiet\" dinner experience in the dining room, a bar seat/booth in the bar area or a relaxed evening on the patio - they have it all. Definitely a gem in Concord."}
{"text":"Wonderful experience!! We stopped here on our drive from Dayton, OH to Rochester, NY and it did not disappoint. The manager Mike was phenomenal: took the time to show us back to the patio and seat us, told us a little about the place and made some excellent recommendations. Our waitress Cassie was great as well! This will now be a regular dinner stop during our travels.   I had the Hazelnut Chicken and loved every bite! My boyfriend had the Chicken Gorgonzola and it was phenomenal!   Overall a fabulous experience :)"}
{"text":"We dined here last night July 5, 2014, and the meal was delightful. We have eaten here before, mostly sandwiches and their chili, which us worth the trip by itself.  We have been impressed in the past with the freshness and quality ingredients they use. Last night we were there for dinner and I was looking at the Jambalaya on the regular menu when my wife pointed out the Chicken Romano on the daily specials menu. The description was \" lightly breaded chicken on a bed of risotto, with creamy Parmesan sauce and fresh vegetable\". Both my wife and I ordered the Chicken Romano, even though I'm not generally a big cream sauce fan. It was excellent! The seasoned breading on the chicken was light and tasty, and though the chicken looked to be a bit overdone, it was not, and was moist and tasty. The risotto was a treat all on its own, perfectly done, and with the remnants of the Parmesan sauce and the spices from the breading mixed in, it was exceptional. The fresh veggies were three spears of broccoli, properly steamed, and had just the right amount of crunch left in them. All of this was served on an oversized plate, which made the portion size appear smaller than it was, and we were both stuffed by the end of dinner.  The bill, for the two of us, with a few drinks each, came to $57. Oh, and that included the cup of chili I had as an appetizer and the quart of chili we took \"to go\", to have another day.  So, if you are in the area, or looking for great, fresh, food, give Redhawks a try, and always check out the daily specials. It is located just off I-90, at the Rt 44 exit, just a few hundred yards south of the interstate.  BTW-We live in the North Ridgeville area, west of Cleveland, and try to find reasons to be out east just in order to eat there."}
{"text":"Not many wedge salads I would take a pic of, but the Redhawk version is great! It says it's a wedge, but it's not, it's half a head and it's a blue cheese lovers dream!! Our whole party was completely satisfied with our dining. Outside is really a delightful place to dine. There were several large parties and all were handled well by the staff and were enjoying their time. Really a diverse menu and all items looked good. This was our first time here while visiting our family, but won't be our last. Good food, comfortable surroundings and good service. Thanks Bailey for serving our dining experience!"}
{"text":"Great service, mediocre food.  My business team of 6 was visiting from Georgia to look at a piece of production equipment.  The steaks that 2 of us ordered paled in comparison to what was they ate at TGI Fridays chain last night...The well done steak NY strip was tender at TGI Fridays and tough at Red Hawk.  The Cajun praline pecan crusted orange roughy tasted very bland and was not crusted...simply had toasted pecan pieces on top that did not seem pralined to me...big let down.  The wine was good and the I enjoyed the butternut squash soup even though it was very thick.  Won't repeat this outing.  Perhaps our palates are just used to more flavor in the south?  Waitress was very pleasant and attentive and that was a plus."}
{"text":"Good stuff all around! Everyone that worked there was very friendly and the food was amazing! Nice atmosphere at the bar and a good time on general"}
{"text":"The Redhawk Grille is notoriously snobby. It's a place for tourists in the area to eat or for extended family get-togethers. The food is average and the only thing truly great about it are the portion sizes. Everything there is average at best but it's up played like crazy."}
{"text":"We just had our family reunion on the patio, 37 of us!  Sam and the entire staff did a phenomenal job!  Thanks for taking such great care of us!"}
{"text":"Really good food and service!  My sister and I split the Maytag chips appitizer and the smoked brisket melt.  Both were outstanding! I could have eaten the maytag chips all by myself!  The staff was very friendly. The patio was gorgeous!!!  It is now probably my favorite patio in Cleveland.  Beautifully landscaped with a waterfall/pond and fireplace for chilly nights.  We will be back very soon!!"}
{"text":"I went here for lunch with my mom. We both had a salad. The salad was small. I added salmon to mine, it was extremely dry. The salmon tasted like it was cooked the day before and reheated. It ended up being a very expensive salad! Not worth the money at all."}
{"text":"I still like it, (see previous review), but not impressed with the fish and chips. They looked suspiciously like the fish I get in the frozen section of Giant Eagle."}
{"text":"I have gone here quite a few times. I still haven't decided if it's been worth my money. Sometimes we go and the experience is great. Other times it's a complete disaster, and the staff never does anything to remedy the situation.   I haven't been back for around two months because the last time I went they forgot my side of broccoli. Then tried to give it to me well over a half hour later. I left annoyed, hungry, and they barely even apologized. Also, I suggest passing on their desserts.   If you do go try the artichoke dip, it's fantastic. I enjoy like the salmon, and they have great fish and chips.  UPDATE They changed the amazing fish and chips. It's not horrible but it's not what it used to be."}
{"text":"Spend Fat Tuesday at the Red Hawk with friends. The Gumbo and Jambalaya were out standing. You will not leave hungry! We all took home plenty of leftovers.  We were early and our waitress Kelly was friendly and attentive..she even ran after me when I left my scarf!"}
{"text":"Food is decent. Nothing special. Prices are a bit steep for bar food. No happy hour food specials. It is ok for the options in the area, but if you can drive further for better options - I would."}
{"text":"Can I give  0 stars? Came at 7:00 was told 40 minute wait and at 8:30 had still not been sat.  Complained to the manager who then kicked us out - no apology whatsoever.  He said. (Vince) the manager said that the hostess who is only 17 started crying - all I asked was if our table was ready or not and told her how long we had been waiting.  Not only did we not get an apology or even an explanation  - we were asked to leave by an arrogant manager."}
{"text":"really redhawk take a full menu and chop out all the good thing's on it, not a good idea. This place was a once a week for my wife and I now it's a not at all. Also for 8 plus dollars plus a tip, the burgers have to be better then a 5 guys or don't put them on the menu, this has a typical off the shelf pattie taste. Sorry I can't say I'll be returning"}
{"text":"Fantastic spot! The food was not only delicious, but will be feeding me for the next two days because there was so much on my plate. 12$ for three days of lunch; awesome. We ate in the dining room, which was nice, and there was also a nice sports bar room and also an outside seating /bar area. Our server, Alexa, even ran out to us as we were walking to the car because we forgot our left-overs box. Great service and great food. A +"}
