{"text":"If you are looking for a refresher this place has your solution. My wife and I stopped here and got a couple of 12oz juice smoothies, mine included kale, berries and a banana. They were absolutely delicious, made fresh on the spot and a total uplift to our energy levels. You can also get a scoop of protein added added as well, which is what my wife did. We are going to start taking our kids here, for the 3.99 smoothie of the day, which would be enough to share.  Kid friendly and healthier than a milkshake. We were also very pleased with the service, our server let us try numerous samples of juice, all fresh, delicious and incredibly flavourful.  I hope this place thrives and stays in our community for a long time!"}
{"text":"On an effort to be a healthier person I came across this great little juice bar. First impressions are clean, fresh and creative. They make a variety of different juices that look really good. I really enjoy their veggie juices. What I like the most is that they use what's called a cold press to make their juices. Apparently you get more nutrients from the fruit and veggies when made this way.  They also have a salad bar but I haven't tried it yet. Definitely worth a try."}
{"text":"When I first saw this place, I sighed and thought to myself, oh, another business that will close in 6 - 12 months.  Most nearby residents would agree that Bayview has been struggling and that the commercial streetscape has sadly changed as often as the seasons.  

Then it happened one day on my usual dog walks.  I set aside my jaded blinders and noticed on their store window: cold pressed juices (ya, I thought it was simply a smoothie bar and who doesn't own a Vitamix or Blendtec, etc?).  Now, for those who haven't had a cold pressed juice ever, I won't say it's life changing, unless of course, you've never had glow-ey skin, because that's really the thrilling benefit of drinking these expensive organic concoctions.  I cannot see how it's purifying my blood or detoxing my liver, but there is definitely a perceptible glow that compliments my BB cream and SPF 70 sunscreen.  I really take glow seriously.

The service is both friendly and competent.  I was immediately offered a tasting flight and left with 3 bottles instead of my intended 1.  I enjoyed most of them and especially love Kale Kraze and another formulation made with beets and grapefruit.

I've tried cold pressed juices from BR and Greenhouse and though Refuel lacks their sophistication, I continue to return for their exceptional service and prices.  A daily cleanse can be had for $50 a day delivered!  I suspect they always ask, but just in case, they have a no cost loyalty program whereby a .50 discount is accrued for every bottle purchased and of course, there is also a .50 credit for every bottle returned. 

Final word/chant: 

Please stay open, please stay open..."}
{"text":"I really like their juices. It's really fresh and delicious. I go by often quite often but unfortunately, had to deal with some rude customers the past two times I went there. The place is small and it's fine, but when the place is sometimes crowded with obnoxious people (like women with strollers) who think for some mysterious reasons that no one but themselves matters.. They won't move out of people's way while loudly talking to the staff... I have to say that kind of ruins my experience there!"}
{"text":"Came here after a Pilates class at North Movement Studio. The instructor sampled a few of their delicious juices for us to try and I absolutely loved the kale kraze! They had a few juices pre-made and available for purchase in the fridge. So I end up purchasing a 500ml Kale kraze and 250ml green magic. Both were great. I asked for samples for a few other ones I wanted to try. The sour shower gets an honorable mention. The beets were nice but I found it a bit sour from the lemon and grapefruit. But if you don't mind slight sourness I would definitely recommend it!

If I lived in the area I would come back more often however the kind owner did say that they deliver anywhere in Toronto so that is pretty cool and id consider it next time. Ps. The juices are a little pricey but they were so good!"}
