{"text":"Que dire, que dire ! L'essayer c'est l'adopter... LITTÉRALEMENT.

Ayant découvert cet endroit magique il y a quelques mois à peine je suis déjà une habituée. Du genre que la serveuse replace moi et ma soeur et sait quand on est venues la dernière fois et qu'est-ce qu'on a mangé. BON elle a une mémoire exceptionnelle aussi mais quand même !

Petit resto asiatique sur la promenade St-Hubert promettant plusieurs régals de l'orient. Les plats à partager sont ÉNORMES comptez au moins 3 personnes pour manger dessus. Les rouleaux de printemps sont ultra bons et frais, comme tout le reste d'ailleurs, mais tâchez de goûter ceux au poulet et saumon fumé. Comme ma soeur a des allergies aux fruits de mer, cette destination est A1 puisqu'ils n'utilisent pas de sauce aux huitres dans plusieurs plats.

+1 pour la soupe repas au cari et poulet !!"}
{"text":"La qualité de la nouriture est excellente, les portions de protéines sont parfaite, la soupe est bonne.

Franchement une belle découverte"}
{"text":"Un menu résoluement au plus simple de l'imaginaire commun. Des mets que l'on attachent à tort et à travers à la corde de la cuisine d'asie. En fait, c'est plutôt réconfortant. Dans cette instance, ce qui est familier sacrifie des ingredients essentiels du folklore cambodgien; la pâte de poisson et crevette fermentée. L'odeur de ceux-ci est assez difficile à apprivoiser. Nos plats étaient bien assaisonnés et la présentation du service était habillée de costume traditionnel."}
{"text":"Hands down the best pad thai I've ever had. Can't comment on service as we ordered take away. Would definitely recommend!"}
{"text":"Maybe not exceptionally authentic Cambodian and Vietnamese food, but this place was packed at lunch on a weekday for a reason. You know when you eat something and you can tell that all the vegetables are fresh, the meat is quality and well cooked, and things generally taste like they were prepared with care? You get that feeling from the food here, plus there are like 30 items on a $9 lunch menu. Voici crowds. 

I was seated and served with kindness and in a prompt but not overly speedy manner, never felt rushed, and the rate food came out at made it seem clear that each meal was being cooked to order. I had a bowl of Tom Yam soup, the vegetarian one, it was like $4 and big and perfectly flavourful and full of fresh veggies. I also had the spicy beef and rice - incredibly tender beef, not all that spicy, but very nice. 

It's a nice looking room, cosy, and the business is run by what seems like a family. All in all I think the Regal on St Hubert deserves the loyal local lunch crowd it's earned, and I suspect I'll be back, especially to take advantage of the BYO on some cold winter night sometime soon."}
{"text":"Very run of the mill Asian food with stinky waiter. A world of meh, enough meh that I won't bother doing a full on review."}
{"text":"So good!! Gotta try it..

There is a package for 2 people that has entrée,  rice, chicken , beef , soups & desert.. it is the go to place for dinner w wife!"}
{"text":"Petit restaurant sur la plaza St.Hubert qui vaut le détour. Carte très précise qui offre une excellente qualité au produits. Service rapide et chaleureux et le prix est très très correct pour manger de la sorte (moins de 15$ par personne). Je recommande vivement, surtout pour leur poulet cacahuète !"}
{"text":"J'y suis allée pour le lunch un jour de semaine. Beaucoup de gens sont installés pour manger et plusieurs autres attendent leurs mets pour apporter. J'ai de grandes attentes vu l'achalandage pour un lundi de novembre. J'ai commandé le plat du jour à 17,95$, le boeuf cambodgien. Je m'attend à des saveurs qui éclatent en bouche. Lorsque l'assiette arrive, je suis surprise par sa générosité, c'est gros! La présentation est très bien, ça donne l'eau à la bouche! Malheureusement, les saveurs ne sont pas au rendez-vous. La nourriture est peu goûteuse, j'ajoute du sel et une bonne dose de sriracha. Somme toute, les ingrédients sont d'une grande qualité. Le resto est propre, bien décoré et les serveurs en habits traditionnels cambodgien. Les lieux sont chaleureux et invitants. Mais, je suis déçue! Mes attentes étaient-elles disproportionnée? Peut-être bien. Je ne sais pas si j'y retournerai. Tout était parfait, sauf la saveur, triste!"}
