{"text":"tried this place for dinner, ordered fish maw soup...szechuan shrimp and general tso chicken.....fish maw soup was bland and i found something sandy texture inside the soup not sure what it was,and its 18 dollars for that soup....szechuan shrimp and general tso chicken were okay just like another chinese restaurant, the portion was just enough for two,nothing special about the foods...but the price was more expensive here...i think for average foods like that its overpriced....i probably will try their dim sum since so many good reviews about it but wont come back for dinner for sure..."}
{"text":"The dim sum is alright. I found it to be a slightly pricier version than ambassador, but not necessarily better. Pretty long lineup as we went on a weekend morning and then we missed our number when the hostess called it, making our wait even longer =(. The shark fin soup is served in a gold ball thing and it's pretty good. Aside form that, most things were pretty standard."}
{"text":"Eventually make up my mind to go to this restaurant.  Unlike other restaurants in the chain, this one is of a smaller size and not as glamour as the others.  It is a standalone building structure with private lot.  There are not that many spots in the L shape parking lot.  The restaurant has advised that customers can park to an adjacent lot.

There is a big sign for 20% with any patrons coming in with a senior.  So I can see most of the tables have seniors.  The dim sum is average.  The best being the steamed beef balls which are fresh, soft and moist.  The steamed chicken feet is not that fresh.  The vegetarian rolls with bean curd wrap unexpectedly is a large dish with at least 4 or 5 rolls each cut into 4 pieces.  The steam bun with running yolk is very good.

The service is good with our tea pots always filled up.  Even with the 20% discount, you can still pay by credit card."}
{"text":"The dim sum menu is extensive offering the standards (siu mai, har gow) plus some unique house specialties. 

The interior is a banquet hall style with Chinese influences (dragon & phoenix)

The food taste and preparation time is very good. Nothing was not overly salty or oily. Our group had visted during peak time,Saturday afternoon lunch. 

We ordered 16 dim sum dishes trying a little of everything from the menu. 


disappointments:

-The long wait time to get seated
-Slow table service. The plates were not cleared until we asked them to. You can imagine the mountain of empty containers that can accumulate if order as much as we did. 
-They charge for tea here. 


Regal Palace is an ok choice for dimsum. Nothing here I had was outstanding but nothing was terrible either. 

I prefer the Yonge St Regal Palace location. Although it gives up a little bit of menu selection (the Hwy 7 location has a more extensive menu) it has a nicer classy modern interior."}
{"text":"Black balls, white balls, bending over and some mention of crawling what the.. ?? 

All of the above was taken out of context from the conversations at the table of course. :p

Kidding aside -- I'm referring to the dishes we ordered (dumpling and dessert  balls), yoga talk, and planning of a future foodie crawl. :)


Jennifer K and Wayne C - can't thank you enough for quickly organizing this dim sum lunch. You guys are funny. Lot of laughs. :)



Regal Palace is a clean and tastefully decorated Chinese restauarant located in Richmond Hill beside the infamous London Pub. It's theme I would say is modern and classy. Large chandeliers grace the high ceilings. Tall windows surround the perimeter bringing in natural sunlight. In combination this gives a nice 'open' feel. 

Interior colors are white and gold and the uphostered chairs were most comfortable too!

Now for about the food - authentic and fresh. All dishes tasted good and weren't overly oily or salty. So a good choice for those watching their waist lines.


We had:

Har Gow (shrimp dumplings)
Siu Mai (shrimp and pork dumplings) - edit * ordered but we didn't end up getting this after all. :p 
Steamed chicken buns
Bean curd stuffed with mushrooms
Beef Rice Roll 
Deep Fried Taro Dumplings
Black Sesame Rice balls


Regal Palace made a great dim sum restaurant choice.  To start it's one of the classier dim sum places around, food was prepared fresh and the price of our lunch quite reasonable at $12 per person ."}
{"text":"Very fresh dim sum (menu, not cart-ordered). Pretty good, all told, though we didn't try a huge variety. Ambiance was ok, but I prefer the bustling chaos of other places we tend to frequent for dim sum."}
{"text":"To my Asian friends, both Yelp and un-yelp alike, before I continue with this review I want to clarify that I do not pretend to be a great aficionado in the Dim Sum category. In fact as I clearly discovered today... I can't even say I know what the heck I am doing without supervision - please make sure I never enter a place like this without a special helmet on and someone holding my hand.

I was sooooooo lost today. Like,.....sooooo lost!

I haven't been for proper Dim Sum in probably 5-6 years, and the last time I can remember having it, I was with a Dim Sum vet who ordered for us and I just sat there happily filling my gullet with tray after tray of steamed dumpling goodness. 

But darn it, I'm an adventurous kinda fella, so when my good buddy asked me to brunch today, I said...sheeeettttttt, I'm a Yelp CM, I know what I'm talking about...\"Let's go for Dim Sum, YO!\".......NAY NAY.....I soon realized I know.....NOTHING!

We entered into Regal Palace amidst a literal sea of people waiting for their fix, you need to be aggressive here and push to the front to ensure your spot in the queue is secure otherwise you may never get a seat. We had a solid 20-25 minute wait for a seat but other patrons took the time to explain the numbered seating process and what number in the queue we were - thanks friend!

Upon being seated we were presented with the menu, and for my fellow white brethren, don't be confused while viewing their menu... each item comes with a S, M or L before the writing and each of those letter denote a different price per dish

S =  $2.95
M = $4.20
L= $5.XX (Can't remember exact price)

Going back to my inexperience, I honest couldn't remember what I liked at Dim Sum, I was trying to order from meal descriptions and from memory (and by looking at what those around us were ordering) \"OH, that looks good, I'll have one of those!\" FAIL.

I felt like the kid who couldn't read in a grade 2 class and I seriously would have benefited from a picture book to order. However, after many broken English Q&A's with my server (who I have to give so much love to for being patient with me and walking me through the menu) my friend and I pulled together a Dim Sum meal for the White and DUM (aka me) ha ha ha ha.

While I can't remember the names of what we had here is a brief description of the items and my thoughts:

1) Pork and Shrimp Dumpling 
- UNREAL (ordered it twice b/c it was so nice) **CAUTION: HOT**

2) Pork Dumpling
- Loved it

3) Deep fried Pork Dumpling
- Didn't like these as much as they dough was kind of sticky and chewy

4) BBQ Pork Bun
- Deadly, so delicious

5) Vegetarian Spring Roll
- Nicely cooked

6) Sticky rice with pork and some sweet seasoning in it all wrapped in a banana leaf
- This was a huge mound on our plate and we cut at it and liked the sweet break

7) We also had what I can only describe as long flat wide noodles with folded over 3 times with shrimp on the inside (2-3 shrimp) served with Soy sauce on the side - Yummy

I apologize for my ignorant descriptions in advance folks, I'm trying! I seriously need to put my Dim Sum training wheels back on and have others come with me to show me the ropes.

All that being said, the busy spot bread slightly longer waits between courses but at the end of the meal we were both satisfied and enjoyed our excursion into the Dum Sum World WAA (Without Asian Assistance). 

Next time I go Im bringing experienced Dim Summers along for the ride. 

Can't wait!!

8/30"}
{"text":"I came here with the family for dim sum because they said it's a quiet place and it's never too crowded and you can sit forever. But we got there and the place was PACKED. like people waiting around outside, parking lot has absolutely no space kind of packed.

Ten minutes of waiting with a reservation and we finally got a seat. They seriously need some chairs in their waiting area, the elderly who love dim sum looked really uncomfortable when people who shuffle in and out of the doors and need to get by them constantly. Especially since this place has a seniors discount (20% off I think)...

Overall the food was good. They have the best squid tentacles I've ever had in Toronto! Love! It totally met expectations (and expectations were high, seeing how the dish was $7). The rest of the food was decent, and was just like a regular dim sum joint. 

Overall an okay experience, but there are tons of dim sum in the city, so I'm not sure if I'll return here on my next trip back. Although those squid tentacles still have my mouth watering.... mmmm"}
{"text":"One of the best dim sum place in the Yonge and Hwy 7 area.  Friendly staff and quality food.  I love their grilled tentacles, shrimp dumpling and deep fry tofu in steam rice roll *drooling*.  I think I'm going to go again tomorrow :)"}
{"text":"It's entertaining to oversee business deals happening over a meal.  At Regal, I saw a Female try to entice a Male to join an upcoming Yoga UYE.  I wonder what the success rate of getting an average JOE to join any Yoga Class would be, even when it's free?  I'm telling the Female now, better keep your day job(sales).  She's better at that anyways.    :P

As for the Food.

Regal quality food, what that means is that it's the same as the one at Scarborough region.  Probably same as the other 6 or so Regal brand Chinese restaurants as well.  Still curious as to why they didn't have Sui Mai available.  Dim Sum without Sui Mai is like my Friend without Lunch Specials.  Lost & Confused.

As for the Service.

I think we got lousy service from one of the Managers because we're younger(ME) and rowdier(name starts with \"J\").  That's my theory for now but the rest of you can test that hypothesis.  Either that or I'm not Girly voice enough because my Friend got a response after just one try.  At least I got some friendly chatter from the serving ladies.   :D

I'm going back to the less ghetto branch, Scarborough one."}
{"text":"This place has all the dim sum I like.  The barbecue pork pastry is almost perfect.  I deducted one star because I experienced that this barbecue pork pastry made differently and below average once the day before first day of Chinese New Year.  The next day, I went there again, it turned to be the same as delicious again.  I guess it might be becasue the chief dim sum chef was on vacation that day?!  Lol....

Generally, I enjoyed eating at this restaurant.  Especially, it offers 20% off the whole bill for seniors!"}
{"text":"the food was delicious and the service was excellent. the waitresses were always present to make sure that our table was clear and to bring more food.

i really enjoyed the food, and will be coming back."}
{"text":"A little update to this place.

Rating remains the same, and I tried some new food along with old ones such as Peking Duck. This time I was a little disappointed with the skin as it was too thick...and not hot enough. By the time I was in the last piece, it was cold. But I saw others were delivered steaming hot, so I assume we were that one off...oh well.

The crab meat soup is good, though a little lacking in taste. The reasoning I got was they're trying to promote healthiness by using less oil/fatty stuff, so the taste was probably brought down a bit. Legitimate reason I guess.

Their oysters are tasty as well. Not too oily, but still has a lot of taste to it. It even comes with sweet peanuts on the side, which is pretty awesome.

Their bitter melon with beef had about twice the bitter melon compared to beef, which my grandma likes. Some places just give wayyyyy too much beef...

Service remains excellent, though I suppose since they're rarely ever crowded. Food arrives quite promptly, give about 10-15 minutes."}
{"text":"I loved this restaurant up until the time they closed. no idea why as the food was great and for a reasonable price."}
{"text":"While driving nearby I went into the plaza to check on this restaurant again to see how it was doing.  I noticed it was closed this evening with a red closed sign due to health issues  by the Toronto Health Department.  This makes me worried if this isn't going to become like Ruby that the Scarborough location took over."}
{"text":"One day when you are tired of visiting  those $1.80 per order for S/M/L dim sum restaurant. You want a nice, quiet, classy place to have some excellent dim sum. Regal Palace is the place to go!!

The inside is really nicely decorated. All the tables are set with crisp white table cloths, chairs with clean white satin like seat covers. Tables not closely packed together, high ceilings you don't feel like you are cramped in.

I have to say the dim sums are more pricer than my usual dim sum joint. However, I have to say you always get what you pay for!

We ordered the ginseng seafood dumpling as recommended by Suzan K. Yes it is really good with real ginseng inside! The seafood are fresh and tasty and they are a lot bigger than the normal dumplings I have. The BBQ pork rice noodle wraps are really good too.

I have to say Regal Palace has one of the best deep fried seasame balls I have. (even my sister said that it is better than the ones that she had in Hong Kong) The seasame balls are freshly made to order, the fillings are of goose egg yolk and egg yolk and it is oozing out with this intense flavour! 

The services is excellent  and friendly!

We ended up paying $26 including tips for our lunch! and I have to say it is money well spent!

I can't wait to try out other dim sum desserts on their menu!

BTW, right now they have a Senior Specials.. No, you don't need to be a Seniors to get that! You just need to bring a senior along and the whole table will get 20% off and no charge for tea! This special even applies when you pay by credit cards!

They accepts all credit cards! YAY!"}
{"text":"Shooting photos of Black Balls, White Balls, trying to get the best angle... and talking about Buns... bending over... (Am I  at a Dirty Chinese Place talking Dirty?)

Too bad no (chicken) feet sucking (as our guest of honour is not into that!)... or something more kinky... as the menu here at Regal Palace is quite basic and limit in selections..

How can one even think the above words can be used during a traditional dim sum restaurant that has 20%off Senior Specials!!

Edwin A even forgot what's he ate... or taste.. since we never have the Siu Mai..... 

I wish the food were served more steaming hot, service can be more attentive and the watered down tea ($1.20/person) could be stronger.

The dim sums were ok.. but I definitely have better ones... and now some will argue because since those are \"healthier\" version.. and they will never be as good as the \"REAL\" ones!

Regal Palace is a nice and quiet place for dim sum lunch as long as you don't mind paying the price..... no discount for us yet since we are still a few years before we consider as Seniors...."}
{"text":"Regal Palace's dim sum is just okay -- some of it is solid, while some is disappointing.  A lot of the dim sum is undercooked -- not necessarily a health hazard, but just not good.

THE GOOD NEWS:
- Glutinous rice \"dumpling\" w/ meat wrapped in lotus leaf - not bad, tasty, savoury
- Egg tarts - 4 small, very flaky, good pastry
- Rice rolls w/ pork - okay, not great, but not bad

THE BAD NEWS:
- Pan-fried radish cake - undercooked, inside is a bit raw + outside isn't crispy
- Chicken feet - undercooked, not stewed long enough to soften & let flavours in
- Pig feet in sweet vinegar - ok, but not cooked long enough to sweeten, too sour
- Deep-fried Taro & Pork \"dumpling\" - tastes all right, but not fried right.  undercooked again.

AMBIANCE:
Dining room is attractive and classy with tablecloths, covered chairs, etc.  

SERVICE:
However, the service is not great.  Our table was set in a very rough/noisy way -- not what I'd expect from how the dining room is appointed.  We didn't finish all our food & the server argued with me about how many boxes I could use to bring the leftovers home.  Not really the kind of detailed discussion I want to have at the end of my meal.

SUMMARY:  2 stars
Regal Palace seems pricey for the quality you get, but if you want a nice-looking place to sit in, with borderline service and non-descript flavourless dim sum, you'll find all of that here.

I was deciding between 2 and 2.5 stars (rounded up to 3) and settled on 2, because just too many dishes were undercooked.  I would cut some slack if the food was cooked properly, but it's not A-OK for the kitchen to rush all that food out uncooked.  There's better dim sum around."}
