{"text":"We have been here multiple times- once for dim sum and 4-5 times for dinner. But we have stopped going now- it's just too pricey. I balked when I saw a snow pea and mushroom dish we ordered was $17!! Food is good though and I don't mind paying for the tiger prawns etc- but some times it's just not worth it."}
{"text":"Came here on a weekend evening and the place was nearly empty. This is never a good sign but I'm glad i stayed. Service was fairly fast and the food was delicious. The meats were juicy and tender. The flavour was authentic. I'll definitely have to come back again."}
{"text":"I went to this place for the first time this past Sunday with my husband.  It wasn't super packed as it would've been had we gone to Emerald.  We were seated immediately.  This isn't a place with carts. You order off of a list of dishes - you note down the quantity beside each item you choose.  We ordered about 10 items.  

I was shocked when the food came. We clearly over-ordered because the serving sizes were huge. The servings were significantly larger from what we would've gotten at other places, so 10 items were a lot.

The food quality was excellent. I'd say it's better than Emerald's (I've always liked Emerald).  The food wasn't greasy; it was flavourful and fresh.  I also noticed that they have a number of vegetarian items available which is a plus for those who aren't fans of meat.

Like most people here have said, the price is more expensive than most other places. Our bill came to $54 and change (included tax).

We'll definitely return to Regal."}
{"text":"4 stars for decent dim sum in Mississauga, but 3.5 overall? It's not cheap dim sum, but right now if you have a senior citizen in your party, it's a 20% discount and free tea, which makes it worth it.  Truthfully, I don't even think they check ID to verify age. Even if you don't, it's better than spending the gas to drive up to Markham to places like Yang's or Crown Prince.  Anyway, be good to your parents or grandparents and take them for a nice meal! :)

The decor is nice; adding an option for a chinese dinner banquet restaurant in the suburbs - modern decoration, wood floors (no ugly Chinese restaurant carpeting).  Large space, lots of tables and chairs with chair covers ready for a party.  Actually, now the only Chinese restaurant in 'sauga that is set up to compete as a banquet hall serving proper Chinese food.  The Grand at Doubletree by Pearson is the next closest option. They take reservations for weekend dim sum.  Services and staff who are polite and responsive to requests.  

All the dim sum staples are tasty, not greasy.  Particular mention for the pan fried short ribs, siew mai, and beef rice rolls."}
{"text":"Clean and very good food. Service was excellent. Authentic Chinese food without the regular snooti-ness. Only knock is that it's a little on the pricey side."}
{"text":"MUST try for Chinese cuisine in Mississauga.

I ate dinner at this restaurant for the first time and I was surprised at how good the food was.  Prices were reasonable (it may be considered a bit more expensive compared to other restaurants in the area, but if you have a senior citizen with you, you get 20% off for lunch or dinner).  

Food and service was really good.  They changed our plates two separate times and was attentive to our needs.  Quality of dishes were above expectations - beef was very tender and scallops were fresh, the vegetables wasn't too salty and we had a shrimp dish that was really creative and unique.  Portions were generous.  

Dim sum was also really good and creative when i tried it recently.  

Compared to other Chinese restaurants, I think this is one of my favs."}
{"text":"After reading the rave reviews here, my wife and I decided to try this restaurant today. We were initially seated near the front door. We felt cold and noticed that other customers were moving themselves to warmer areas. Yes, the heating system needs some work. We requested a waitress for a warmer location and were duly obliged. However, the manager lady was giving us odd looks and appeared annoyed.

We ticked off the Dim Sum items in the sheet and handed it off to a waitress (had to flag them down, as they don't make eye contact and whiz around). The waitress took a look at the sheet, nodded and went away. 10 minutes later, the manager approaches us and asks us if we placed an order. We said \"yes\" and upon asking, pointed out the waitress who took our order. The manager comes back to us and apologizes for the confusion and then accuses us of not filling in the table # (this # is pre filled in all other dim sum places we've been to). She then walks away clutching other sheets which had no tables #s, hunting down customers. Beware: The sheet doesn't outline the prices, so we had no idea how much they cost. Not impressed at this point.

We ordered 6 items (all pics posted here by me, including a snapshot of the bill). 

Beef brisket and Bok Choy in beef broth - Very good. I've never tried this elsewhere, and it was actually quite tasty. Big portion too.

Deep fried pork dumplings - 4 small pieces, tasted bland. Didn't like them. Not warm, might have been sitting for a while.

Deep fried squid tentacles - Bland, no spices whatsoever. 

Pork puff pastries - Good, but didn't have the flavour infusion present in other Dim Sum restaurants. Not warm, might have been sitting for a while.

Beef short ribs in maggie sauce - Good, but could have been warmer.

They forgot to bring us the 6th item, but we were glad, as the other food was below par, compared to the likes of Sam Woo and Emerald.

Asking the waiters for things was a chore. Had to literally wave to them and flag them down: Didn't expect this from a place which charges $35 for 5 Dim Sum items. One more thing: We are of Eastern Indian persuasion. We noticed that a Caucasian couple who gave the order 1/2 hour after us, got similar food served first. Just saying.

I might give this place one more try, in about a couple of months to report back and address the following issues:
- Heating bad.
- Service atrocious compared to the price.
- Meals need to be warmer.
- Attitude of management."}
{"text":"Came here for dinner tonight and must say that service is excellent, the food taste is really good, but the portions are a bit smaller than other Chinese restaurants - but not comparable to those that have excellent service.

The price is a bit high for what you get also, but the decor and atmosphere is real nice, considering this place used to be The Keg.

A tip though, is that though the original prices are high (not sure if it is on purpose), but if have one person over the age of 65, you get a % off your bill.  Then if you order off a special menu, there's 50%, etc.  So you kind of have to look out for these deals.

Other than that, excellent Chinese restaurant in Mississauga, and would return on more special occasions."}
{"text":"Expensive small dishes. This place is waiting for bankruptcy. I'm here on sat 6pm to 9pm. Empty!!!! only one other large party no one else there. and this is a massive restaurant - fine chinese dining. Everything stingy. Dishes are half the size of standard dish. and twice the price. i admit though, it is gd quality, but def not worth the price for what you get. 
they also forgot a dish, which came after our large meal, which didn't fit. it's like getting the appetizer after dessert.
also b/c we were in the small party rooms, it was freezing. no heat in there at all. (except for a small fan heater)"}
{"text":"Figuring dim-sum would be a relatively quick, filling and cheap lunch option for my visit to Mississauga, I found Regal Palace Chinese Cuisine online and drove over to eat.  

My server sat me and asked if I knew how it worked.  I asked for an explanation and he explained that I mark down how many of which item I wanted.  Sounded simple, but to avoid overordering, I asked how big the portions were.  He gestured bite-size and said \"small!  very small!!\"  

Perfect, I thought.  

There were no prices on the first few pages of the menu, but there were some entrees at $10-18 on the last page.  There was also a flyer on the table for Regal Chinese Restaurant which stated \"$10.99 for lunch buffet // $16.00 for dinner buffet\".  All of these details pointed me to thinking that this was similar to all of the all-you-can-eat buffets I'd ever been to.  

I then proceeded to order about 10 items.  

Those items started coming.  

Those items were entree sized.  

I wouldn't have been terribly upset, except that the staff were giggling and pointing at me as more and more dishes were piling up.  I tried to cancel what hadn't been brought out yet, but it was too late.  

At this point, my server mentioned that I could take some things home.  This worried me, as most All You Can Eat places don't let you take home, or charge extra for things you fail to eat.  I declined, as I found most of the dishes to be bland, greasy, slimy or worse.  Onwards I ate.  

When I had sufficiently finished most of the food that had been laid before me, I went up to pay.  While my server was printing my bill, I said \"hey man, must have miscommunicated somewhere, and I ordered WAY too much.  If you want to charge me for the dinner buffet instead of the lunch, I'd happily pay it\" and he said \"yes sir!  thank you!\" and hands me the bill, then quickly fucked off somewhere in the kitchen.  

SIXTY SEVEN DOLLARS?!  

HOW IN THE FUCK!

Well you SEE. 
That flyer on the table for Regal Chinese Restaurant?  
That was actually for a DIFFERENT restaurant.  This is Regal PALACE Chinese CUISINE.  

Oh, and the menu?  Yeah, no prices for the dim-sum / carte items.  They're actually marked S, M, L, but not in english.  Those roughly translate to $3.50, $4.50, $5.50.  

I called for a manager and explained the confusion, and suggested that they:
A) DONT PUT A FLYER FOR A DIFFERENT RESTAURANT WITH AN ALMOST EXACT SAME NAME ON THE TABLE
B) Try putting PRICES on the ACTUAL menu
C) Don't say things are small when they're actually a buttload of food

She offered a 5% discount, and I said that wasn't good enough, so she offered a 20% discount.  I accepted that."}
{"text":"My parents are dim sum snobs.  When they visit from out of town once in a blue moon, they demand to try a new dim sum place every time.

Using Yelp and the search words \"dim sum\" and \"Mississauga\", I came across Regal.   It was a bit of a trek for us but we figured it was worth it if the food was good.

Regal is located in a converted Keg Steakhouse location.  The fire place was a dead giveaway.  How many Chinese restaurants have fire places?  Plus we looked up the address on Google Street View which showed a Keg there.  There's a huge patio attached so I wonder if they would ever do dim sum on the patio - what a novelty!

We arrived early on a Saturday morning, just before the rush so no wait for a table.  I was impressed with the classy decor.  Nice white linens on the tables and chair covers to boot!  

No carts for dim sum, just a check off menu.  No pricing on the menu either but we found out when the bill came - small ($3.30), medium ($4.30) and large ($5.30).  We did get the senior's discount of 20% off the total bill.  

We ordered an assortment of dim sum favourites totalling 10 items between the four of us.  Food came out fresh and hot, and had my mom raving \"Ooh, this is just like Hong Kong!\".  Now that's a compliment that translates into a 5-star rating.

Need to mention the service.  Good service, or just service in general, in Chinese restaurants is as rare as a sober Lindsey Lohan.  But I found the service at Regal quite excellent.  Servers were very attentive - never let an empty dish sit for very long, refilled tea pots quickly,  nearly hovering over us as we ate.  The restaurant wasn't very full so that might explain the super service.  Servers were friendly and polite with no attitude.  My mom is a walking attitude detector and easily offended so she would have sensed something right away.

At the end of the meal, my dad proclaimed \"Is it just me or does even the tea taste better here?\".  Wow, my parents are capable of compliments...I never knew that."}
{"text":"This place just opened up a week ago, so keep that in mind when you read this review because things could have changed since this was written. 

Frist thing is that this place is expensive.  I went here during the week for dim sum, and the large items were roughly around $5.50 each, and mediums around $4.50.  I'm guessing small dishes are about $3.50.  We also ordered a plate of noodles which cost $17, and tasted nothing special, quite mediocre actually. 

The decor is nice, they are going with a \"palace\" theme, with golden colours.  The tables are large, with proper golden table cloths, and the seating area is spacious.  There is extra space off to the sides where they add more tables if need be.  

The service is great.  They bring the dishes out to you when ready (there are no carts here), and they say hello and present it to you.  The tea was poured for me when I sat down initially, and again at a random time later.  The service was prompt and courteus.  When we asked for our food to be taken \"to go\", we expected them to pack it into containers for us, but this wasn't done.  No biggie.

I would recommend this place for people who are treating others to lunch and want a nice place to go to.  If you are just looking for some good dim sum, I would skip this place since it is expensive.  

Derek"}
{"text":"this is a pretty decent yum cha place in Mississauga between the cross roads of Erin mills and Mississauga Road its more of 3.5 then 4 star

service was typical dim sum. sometimes you need to raise your voice a bit to get attention. 

dishes to get here:

-baak wan fung zhao (white chicken feet mixed in vinegar and fish sauce) these were def the best dish for me and they de-bone it as well  

-Lo mai gai (sticky rice in lotus leaf) this place makes it well i hate it when it comes out soggy and wet

- all the gao (dumpling) dishes were great ( i dislike the thick skin ones) 

- dan taat (egg tarts) fresh, perfect for dessert and tea

- jook was ok nothing out of the norm

this place is huge can prob hold 200 people and it packed up around 12:30 on sunday so i suggest getting there earlier."}
{"text":"The food here is decent. Nothing to rave about  but the ingredients are  fresh and the restaurant is modern and clean. Avoid the egg rolls and fritters rice rolls though. Those weren't very good."}
