{"text":"Was my all-time favorite for breakfast on the weekends.  I loved \"the boss\", and my fiance always got the \"skillet\".  Best food ever, huge portions, great price.  Too bad we went there today and it was closed down... wanted to cry!!!"}
{"text":"This place is no longer in business. It has been closed for at least 4 months. At first sign said closed for remodel been has since been taken down."}
{"text":"I used to like Reggies, and was a regular customer, but have found the quality to really become erratic recently, which is a shame.  On it's good days, the best items to try are their comfort foods and breakfasts (all day).    First, when pulling in, beware, as the parking lot is VERY rough, with MAJOR pot holes.  For your car's sake, GO SLOW!  One item that I've liked here is the \"old fashioned,\" which is a couple potato pancakes (served with sour cream and cheese), couple eggs, breakfast meat, and toast.   Another few that I've liked are their ruben, their Philly Cheese steak, their ciabatta club sandwich, the hot roast beef sandwich (served open face) and their chicken enchilada soup (spicy).  Also, on the weekends, in the morning, they have a \"breakfast bar\", a buffet of typical breakfast items, including eggs, sausage, bacon, potatoes, pancakes, waffles, corned beef hash and an assortment of fruit.  Their NY Strip steaks seem to be very hit or miss.  I've gotten some excellent steaks, cooked quite well before, but have also gotten a number that felt like half gristle.  It felt like about a 30% chance of getting a bad steak.  Talking more of the erratic quality, an example, one time when I ordered the ciabatta turkey club, I got a sandwich with soggy ciabatta bread and RAW bacon (not just undercooked, it looked like it hadn't been cooked AT ALL!).  I've also gotten eggs burned at random times, bacon burned, hashbrowns burned, etc.  Again, this is not a 100% thing, but it is enough recently to make it not worth my while coming back anytime soon unfortunately."}
{"text":"Besides being dirty, rundown and plain grungy.  The food was gross.  We had the Brunch Buffet on Sunday afternoon.    Everything was cold, stale and not worth eating.  The OJ was good."}
{"text":"I had to move to cleveland so i only get chances to go to reggies when im in town visiting. This is very depressing. I miss this place alot it is BY FAR LEAPS AND BOUNDS ABOVE THE BAR of restaurant excellence. Stow is full of garbage restaurants but reggies is the diamond in the rough. It was a little rough going there during renovations but now (as of 2012) it's pretty cool cause they have an outdoor patio and the insides a bit nicer. The breakfast buffet was always fairly decent and the staff was excellent (especially the veterans). I see 3 negative comments but one is from a racist and another is from akron (enough said). To each his or her own but the only negative thing i have to say about reggies is PUT SOME BLACKTOP DOWN ON YOUR PARKING LOT!!!!! LOL"}
{"text":"Like one of the other reviewers I had found Reggies adequate but not recommendable from past very irregular visits, (the last has to have been a year or more ago). but we happened there on a Saturday 11 A.M.ish, and were seated promptly by the sixteen year old who was our host.   He asked what beverages we would like and forgot one and had to get a \"refresh\" in order to fulfill, and then we waited for a waitress.  We were told our waitress's name by our host and as always unless it's one of those un-names that just blows your socks off, like Kashikeewandamoo, it went in one ear and out the other.  Unfortunate, because we NEVER got the opportunity to make her acquaintance.  We waited and waited. And after a bit, decided the breakfast buffet would beat the alternative of nothing, so up we went.  Never realizing how wrong we were! I have become over the years a less than enthusiastic buffet attendee.  They tend to be harbingers of germs, old tired food, and some sadist is always trying to set up food far enough on the far side of the sneeze shield so as to require modified limbo dancing or monkey-arms that drag on the floor in order to get what one wants!   So what did we have? Absolutely the worst scrambled eggs ever!  So dry and crumbly they virtually refused to be manuvered by a fork as the sand-sized particles lacked the moisture to bind together.  It was like trying to eat flour!   No waitress from whom to beg ketchup or hot sauce or beverage refills. Eggs are delicate, don't cook a couple gallons at a throw so you never have to replenish,  cook small batches so the steam table doesn't dehydrate them over time,!  Also whenever possible  try to use real god^amn eggs and not the re-hydrated powdered used-to-be-eggs.  The country potatoes or whatever they were supposed to be were equally dry, as well as burnt, and did I mention dry?  And man were they dry.   I ended up putting sausage gravy on them hoping to find something to choke them down with and even that didn't work!   The bacon was fine, but one does feel just a little silly filling a plate with bacon in order to flesh out one's plate!   The owner is a very nice guy, (thin as a rail...I can see where eating here exclusively would be a weight-watcher's dream!) and when he walked by I told him we hadn't seen a waitress (we were finished dining at this point), and he said he would take care of us, refreshed our drinks and took them off the bill, so kudos to him for an attempt at a fix, but I would have been much happier had they just set off a bomb at the buffet station to blow it elsewhere, in deference to the well-being of the next hapless diner!  If you come order off the menu!!  Unless you are a real bacon FREAK!"}
