{"text":"I should give a disclaimer before I start. I lived in Thailand for a couple of years way back when so I know Thai food pretty well, from the awesome street food you can get EVERYWHERE to the upscale fusion type places that cost a pretty penny (frankly not worth it except for air conditioning and ambience since the small shop/street food is so damn good).  That makes me picky.  So to my review: if you want Thai food that is anywhere close to authentic do not bother with this place. You will get better for cheaper at just about any Thai Express.  We ordered to go the Tom Yum Keung (shrimp), Kaeng Phet Gai (chicken in red coconut curry), and some Pat See Ewe (flat noodles in brown sauce with beef).  Granted I did not specify how spicy these should be. I forgot. But they did not ask! In that case the default should be Thai medium which is western pretty damn spicy but not intolerable except for the faint of palate.   The Tom Yum was quite literally the worst I have ever tasted. It tasted like lightly used dishwater infused with an insipid thin tomato soup (like they took a teaspoon of Campbell's tomato soup and added it to a pint of cloudy water. NOTHING like the explosion of exquisite spices and flavors wrapped around a galanga / lemon grass base with a ton of shrimp chilli paste. It is not actually supposed to be eaten like a soup but rather eaten with rice as you would any other curry. This seems odd to the uninitiated because it is so thin, but trust me that is how it is....just like Filipino 'soups'. Even the mild is pretty spicy, or should be. That's why you need the rice.  The red curry was a nice enough base but there was not ONE traditionally thai vege in there. It should be loaded with these mini little eggplants and a few other things like basil leaves, onions etc. Instead it was bulked out with green bell pepper. This is not even a traditional Thai vegetable, but rather an import that is grown in the mountains up in the North of Thailand. I never saw one bell pepper in Bangkok in 2 years of living there except in western restaurants. Worse...I HATE bell peppers. Love chillis of any variety....go figure. The chicken was dried out too. Waste of calories.  Last but not least, the Pat See Ewe: this was passable at best. Or it would have been had they used the right noodles and made it a tad more moist. The noodles were too narrow and for whatever reason they mashed it all up like they were feeding it to a five year old. Also not enough egg in there and barely any beef.  I would have given it one star but I reserve that honour for only the truly terrible in terms of service as well as food. In fact I have only ever given one star and that was to that idiot down in the Old Port who thankfully i can't remember any more.  In short if you are looking for Thai food, don't waste your time or money. If however you are looking for ok tasting NOT-Thai food, maybe you will like it as some other reviewers obviously did."}
{"text":"I was craving for pad thai and this is the nearest thai restaurant in the neighbourhood here in Montreal. I got pad thai and its good. And the place you would feel the asian ambience. Its nice to come if you would go at night. Staff was really nice and friendly."}
{"text":"This used to be a really good thai restaurant when the elderly lady who put this restaurant on the map was still the main chef. It's been a few years now that she's no longer there, and the quality has noticeably gone down. It's still significantly better than most fast food thai restaurants like thai express."}
{"text":"You like Thai? What's the best Thai restaurant in the city, Chao Phraya? Phaya Thai? Thai Grill? WRONG!!! It's THIS little hole in the wall on Cote des Neiges and Cote St. Catherine.  I've dragged dozens of people in there, daring them to NOT call it the best Thai they've had in the city, and they universally come out agreeing with me. It's f---g delicious. Go try it."}
{"text":"I have been going there for years and have rarely, if ever, been disappointed. The staff is always really kind, and the food is AMAZING. I love their mango salad and their chicken Tom Yum soup, very tasty. I also wasn't sure about something on the menu once and they brought me a spoon with the sauce in that dish for me to taste. Really, I can't find anything bad to say about it. I love it and will keep going :)"}
{"text":"Meh... Food quality and preparation are just average for above average price. Nothing outstanding but it's fresh and well prepared and the family is Thai as well. Better than food court and chain Thai restaurants.   Can't say much for the decor- tables and chairs are rickety and the decor bland. They don't heat very much during winter."}
{"text":"The food was very nice and the portion was just right. The waiter only spoke French. The restaurant was very cold which was disappointing."}
{"text":"Delicious food, poor service  I came for lunch, and this place was packed!! I ordered lunch special #1- chicken red curry, which was delicious! The curry was great, lots of flavour, the mango salad was awesome and tangy and the spring roll was great.   However, the service was horrible. There were 4 ppl in our group but they brought out the food for 3 while the 4th had to wait about 20 mins before their food came out. If you are not in a rush, this is a great place to eat, otherwise be warned."}
{"text":"When I was living in Montreal for slightly over a year, this restaurant was my go-to restaurant to get my South East Asian fix. I say \"south east asian\" because I grew up in Malaysia and could not find any Malaysian or Singaporean restaurants in Montreal.  This place is pure awesomeness. Serving size is huge. I often get the pad thai. I have had takeaways and eat-ins. Service is great. I miss this place."}
{"text":"Amazing service!!! Amazing food!!! A must for all Thai food lovers!!!"}
{"text":"I came here a few years ago, sat outside and ate a wonderful meal. But last night was not so great. It was VERY disappointing. We had the \"table d'hôte\" with soup, mango salad, spring roll, rice and our main dish. It cost 45$ for 2 and was not worth the price.   The soup (Tom Yum) was good; good flavours, but the ingredients inside it where cheap compared to the amazing soup I had years ago. It contained coarsely chopped tomatoes and mushrooms with frozen not fresh shrimp.  The mango salad was OK; mangos where not ready to be eaten yet, but it's hard to ripen mangos to the point where they aren't too mushy.  The roll was good; crispy and fresh but the dipping sauce had a strong after taste that wasn't very pleasing... you'll see why soon  My main dish was #2. Marinated garlic chicken with thai sauce served with peppers and onions. The chicken was good, a little dry, but good. It's plain chicken on a bed of iceberg lettuce. Was not expecting that from the menu's description. Here's where it gets DISGUSTING : the thai sauce was made with minced garlic you can get in jars, the taste was absolutely repulsive. It was in the spring roll dipping sauce too, but the taste was way less imposing than the garlic thai sauce. The \"peppers and onions\" where 2 tiny pieces on top of the chicken.  My spouse had the pad thai with was VERY good.  All and all, the food is OK, the price you pay is not worth what you get on your plate, the ingredients are cheap, I will not be going back to this restaurant."}
{"text":"Used to go here sometimes during my high school days. Overpriced food and really small portions (especially the rice). Some dishes just taste weird and totally not authentic.  My friend, who is allergic to mangoes, requested to have a mango-free dish but he was still served the mango salad because the server was not paying attention. Overall, there are many better options in the cote-des-neiges area."}
{"text":"This place is rather overpriced, the mediocre food isn't bad but only marginally better than say Thai express. Friendly waiter though, respectful and pleasant. Decor is nice enough."}
{"text":"Very polite and nice service. My first time thai foods experience so can't judge too much but ok."}
{"text":"The service is just fine, but food is too expensive and not good as expected, Thai Express is better, don't waste your time or money in this restaurant."}
{"text":"I really love their tom yum soup here. I always come to eat jere with my mother (who let me tell you, dislikes to eat at restaurants that has MSG) because this place has none. Which is great. We really like the fried rice with cashew and pineapple. Best thai resto ive come accross in mtl. Definitely recommend this place!"}
{"text":"You've got to be kidding me \"Best Thai...\"  The pad thai - that is the staple dish to judge a good Thai place from a bad thai place - it tasted like yucky tomato-y ketchup grossness. I had this chicken dish there too and it tasted like old foot cheese.   Ventilation is so bad in here that all the steamy fry smell was permanently ingrained into my clothes and hair. I had to visit the dry cleaner's to de-toxify my clothing.   I can make better Thai food out of a dry-mix box from the local 7-11.   I'm giving 2 stars because the mango salad was okay. I mean, how can you go wrong with sliced raw mango on a dish, really."}
{"text":"Very good beef salad and sticky rice. I tend to order those two the most and of course together. Their beef with white wine sauce is very good too. My boyfriend loves their curry. I think it's pretty good but I just don't like curry. Service is fast and sometimes friendly. But Iits not an expensive resto so I don't expect fancy service. I care a lot more abou the food and I think this place is great."}
{"text":"Nothing special,ordinary decor, with some standard Eastern statuary thrown in.  Service is VERY slow, mainly due to the fact that there is only ONE server! As for the food, I'm not an expert, but, overall, it was OK, not great. The tum yum had a very distinct under taste of Heinz ketchup, and the mango, in the mango salad, was sour. As for the main dish, shrimp in coconut milk, it was more soup than  main course. Jasmine tea was served afterwards, and this was all part of a table d'hote for $17.95, before tax & tip. Not bad, but do not come here for a gourmet or expedient service , especially during busy lunch times or weekends."}
{"text":"As a lover of Asian cuisine, I was delighted by the authenticity of this restaurant.  The server was incredibly kind and very polite. He recommended the aneng curry w/ fried spring roll as I had expressed that I wanted a dish that was unlike the commonly popular Thai dishes. The meal consisted of red cury pastes, lime leaves, coconut milk, green beans, ground peanuts and chicken breast.   The entree that was brought was delicious, with portions that were sizeable enough to enjoy but small enough to leave room for the main course. The aneng curry arrived just in time and was nothing short of pleasant. The flavours blended very well together and went well with what was left of the entree.   My vegan friend enjoyed his Pad Thai and noted that it was some of the best thai food he has tried.   The restaurant has a nice Asian ambience and I really enjoyed seeing one of the ladies on staff hand rolling the egg rolls at one of the tables behind us, it gave off a very authentic feel."}
{"text":"Très bons plats, produits frais et saveurs. Un bon thaï sur Montréal. Le carri rouge crevettes est délicieux. Grande salle, bien agencée"}
{"text":"Had their pad si ew and loved it. My boyfriend had the red curry dish and he enjoyed this place as well. I would definitely go back here."}
{"text":"I fully agree with D D.  FAR FAR FAR from best Thai in Montreal..  We ate there a while ago, we each had a basic main dish, it came with a soup that was too salty and tasted kinda old. The main dish didn't taste that good, wasn't impressed at all.  The service was OK, felt a bit forced.  The price was TOO MUCH, for 2 people I paid close to $40 without ordering drinks or dessert. Too bad for them Pho Lien is right down stairs, there's absolutely no reason for us to return to Talay Thai.  However I have to say the decorations are pretty cool."}
{"text":"My girlfriend and I went to try their noodles. We chose two different dishes. Both dishes tasted the same. The noodles were far too salty and greasy for any flavor other than soy sauce to stand out.   The staff was great and very friendly. The ambience is cozy and laid back. The noise level was perfect for a good conversation.  I would need to try other dishes before passing a good judgement. I would suggest this restaurant to others. At least try it out."}
{"text":"I tried the Kluay Tod, or deep fried bananas, with honey.  This is the second time I've had fried bananas, so I wouldn't consider myself an expert by any means, but I will say they were delectable! The waiter was very polite and helped me to pick this delicious dessert."}
{"text":"After reading the reviews on this page, I decided to try out this place: what a bust.  They had one waiter on the floor and three or four people in the kitchen, which meant that everything came very slowly and sometimes even came cold. Why they would need four people in the kitchen is beyond me because the place was only half full.  I ordered the green curry off the table' d'hote menu and, though it was passable, it was nothing very special; the eggroll that came with was flavorless and the Tom Yum (which seemed like it had been sitting in a heating platter for hours) came with two pieces of raw tomato plopped non-chalantly into its brownish wateriness - as if that would somehow help with its appearance.   That being said, the mango salad was lovely - but, for god sakes people just go buy yourselves some mango, peanuts and some fish sauce and you can make it at home for a fraction of the price!  All in all, the next time you find yourself in front of this place, take a left and go for pho."}
{"text":"I came to Talay Thai on a Thursday night. There was only one server who was efficient and polite. Theres not much to really talk about the decor. They have only one big room that seats not more then a 100 people even. And they a have left some thai touches on the decor here and there. There were mostly couples seated that day so I guess the place does have a warm initimate feel to it. However the air was really damp and humid. I belive its probably not as big of a problem when in the summer they have windows and doors open. Anyway you should be a bit careful if your nose is congested. Anywhooo...  Heres the main part. The Food: Average! I had fried chicken with veggies and Red curry. Werent as spicy they quality just average. The mango salad was my first try so I was quite delighted. It was soury and sweet and I liked it.   They seemed to have beer and wine and a full bar too. Didnt try any of the drinks so cant comment.   Definitely not THE BEST Thai restaurant in Montreal."}
{"text":"The plan tonight was to go to Pho Lien a good Vietnamese place which is right next door, but it was packed and my sister in law had a bit of a look of panic that she was only going to have soup to choose from.  We took a chance and went to Talay Thai and WOW very good.  Having been to Thailand recently I must say the recipe's used tasted traditional and very flavorful.  We ordered about 5 dishes in total that we shared family style, and I only have great things to say about each of them.  The decor wasn't that authentic, but in the end we're there for the food right.  A definite  repeat visit the next time I want to get my Thai on."}
