{"text":"I ordered the chicken tikka masala with rice and naan. It was a delicious meal! Prices are VERY reasonable too. I would definitely order from Makkah again!"}
{"text":"For the price, this place can't be beat. The naan at Maison Indian Curry is better, but the prices here are lower and the staff are always so friendly! They have 11 different lamb dishes for $11 or less, make a great Afghan rice and the lentils are perfectly done. Now to the lunch specials - a different one every day! It's a good sized portion for $5-6! (weekdays). I bring my own takeout container and they have no problems filling it up with the day's special."}
{"text":"Ce resto est vraiment un petit trésor que nous avons découvert lors de notre séjour à Montréal. Nous y sommes déjà allés trois fois et y retournerons certainement encore avant notre départ. Tout ce que nous avons mangé a été excellent et se compare positivement aux bons restos indiens de Londres. Le service est également de première classe. Highly recommended!"}
{"text":"Relatively new small restaurant. When I ate here, it gave me a very homely type of feeling with the friendly service and the food. To dine in this place is small but if you don't mind, it's always best to eat the food fresh here rather than taking it home. The portions are small but the quality of the food and the taste does make up for it. Therefore, you wouldn't mind spending on a second portion.   You can make the food from mild to as spicy as you'd like. Check out the pictures if you'd like to get an overall idea of what it's like to eat here."}
{"text":"I wished I lived in Montreal this would be my favorite Indian/afghan spot to eat. They have a a variety of dishes in there  menu with affordable prices. The quantity of the items can't be eaten with 2 people. The staff are very friendly unfortunately they don't speak English they had a hard time understanding me. But in the end it all worked out we enjoyed our meals food prep and order take was quickly we didn't had to sit for a every long time. If you love Indian and afghani this place is a must go see. You won't regret it."}
{"text":"This is easily the best (and only) Pakistani/Afghan restaurant near Jean-Talon station. The fresh ginger lamb curry is a bit sour but yummy, with large pieces of, yes, actual fresh ginger! It's served with a delicious mint yoghurt sauce. Actually, I go there mostly for the sauce, but don't tell them or they might start charging for it. The friendly staff contributes to making it a pleasant place for a nice meal with friends. Lunch special is cheap, but note that they close on Fridays between 1 and 2 pm."}
{"text":"The food is great and so is the service ! We were a big group of 11 but the management made sure that we all sit together. Thanks guys!"}
{"text":"Would definitely be a regular if I lived in the area but would absolutely recommend people to come here!!!   Have never been a huge fan of Pakistani/Indian food (even though I'm Pakistani) due to several factors. One being that I've grown up on this food so it's not very exciting. Second being that most Indian/Pakistani restaurants are usually not very tasty. In the sense that you can't taste the meal you're ordering. Also majority of the places will add a ton of seasoning, salt, and meat tenderizer that all the food tastes the same (different restaurants, different cities... Crazy right???).   However, this place has given me one of the best experiences of my life. The whole tandoori chicken aka Lahori Charga was excellent. Seasoning, chewiness, juiciness, serving size, and price were all perfect.   The server spoke Urdu and English, not sure about French since none of the party I was with spoke it either. Very hard working guy and was very helpful even after working alone!   Without hesitation I would recommend people to come here."}
{"text":"An authentic Afghan/Pakistani/Indian restaurant just by the Jean Talon Market with a homy atmosphere and cheerful, friendly service. The place also delivers. A popular spot for families to enjoy a meal, hence the restaurant's delicious menu is best enjoyed family style with a few shared plates and some naan or kabuli rice on the side.   My main dishes were the baigan masala, a great veggie dish with large chunks of eggplant in a spiced tomato sauce, the palak paneer, a classic creamy spinach and cheese cube dish, done well, and the afghan chicken karahi which was tender and full of flavour. Overall an outstanding meal.  The plates aren't very large, but fairly priced and quickly prepared. A must try to sample some of the best of south Asian recipes in Montreal."}
{"text":"Absolutely delicious! We came here for dinner and will definitely be coming back.  Very authentic afghan and Indian food, with plenty of vegetarian options. We had the classic butter chicken, it tasted more subdued than normal Indian butter chicken. I really liked the flavour. The paneer in spinach was great and filling.  Staff was friendly and conversational.   Highly recommend this place and they have great takeout options!"}
