{"text":"Great spot to pick up a French-style breakfast in Montreal. Prices are reasonable and the waitress was very nice! Full of locals and hospital employees from across the street. Will definitely be coming back on my next visit to Montreal!"}
{"text":"Was staying at the hotel next door when I moved to Montreal.  I had just got in from Australia and was jet lagged as all else. Started going there right early. Great breakfast and the women who works there is really nice. By the second day she knew what we wanted to drink and had it on the table. I still walk twice as far to go there even though I live in Old Montreal."}
{"text":"Un déli comme tout les autres, serveuses d'expériences à l'air presque bête pour cacher leur tendresse inconditionnelle du métier... huhuhu...

Livraison de junk (sous-marin juteux) idéal pour fin de semaine \"movie party\".

Déjeuner dès 5 a.m. la semaine avec des patates carré BBQ vraiment bonne et smoked meat (d'où la 3e étoile) ^_^

Ce 3 étoiles-là est un 3 étoiles de déli service rapide, ne pas confondre avec un tapas 3 étoiles svp!! ;-)"}
{"text":"This place doesn't look like much from the outside.
Heck, it doesn't look like much from the inside either.

But the food wasn't half bad!
I ordered the Steak Hache, which came with:
   Salad -- bland lettuce, nothing to write home about.
   Bread roll -- prewarmed :)
   Steak -- FANTASTIC.  Onions were grilled just right, the brown sauce was the right amount of unhealthy and umami, and the steak was cooked perfectly.  Also, their potatoes -- SO GOOOOOOOOOOOD.  I was so full, and that much meat (8 oz I think!) for just $8 at a sit-down restaurant ... heck yeah man.

They also have weird 'Chinese' dishes, like smoked meat fried rice.  My dad always wanted me to marry a Jew lol.

Apparently it's a Greek place, and kebobs are their specialties.  Take advantage of their dinner and weekend deals -- cheaper meals during special hours =]

And the waitstaff speak English AND French!  I know it's Montreal, and this isn't anything special, but it's really refreshing.  My waitress also didn't switch to English even though my accent is pretty severe.  Extra points =]"}
{"text":"Great place for breakfast!
Friendly waitresses 
Free coffee refills unlike the trendy place down the street."}
{"text":"We try this restaurant as it is only accross the street from our building. The pizza was loaded with all kind of meat, generous topping but somewhat its dry. The picture of the smoke meat looks better than the food itself... But the waiter was super friendly."}
{"text":"Very good food for a very good price. Diner style food and excellent service. One of the best diner style restaurants in Montreal"}
{"text":"Good Food,Rude staff.Specially When u Ask to Pay with US $"}
{"text":"The owners are fresh-obsessed, so you will find that reflected in the ingredients and taste.  A full menu provides something for everyone.  Popular for a reason."}
{"text":"Lorsque ma conjointe se trouvait hospitalisée à l'hôpital St-Luc (juste en face) suite à la naissance de notre fille, je suis venu ici à quelques reprises pour me désennuyer de la bouffe plutôt fade de l'hôpital. À chaque fois, j'ai été servi par le propriétaire qui était très sympathique et qui me faisait la discussion alors que j'attendais ma commande. 

Le service est rapide, et la bouffe est très correcte dans son ensemble. J'ai d'ailleurs mangé ici un excellent sandwich Smoke Meat. Les frites sont délicieuses. En bref, ce resto est un \" dinner \" classique avec ses banquettes, son comptoir en similis bois et ses vieilles serveuses gentilles. On ne vient pas ici pour s'offrir un grand repas gastronomique, mais dans le genre, j'aime bien. Je vous suggère le Club Sandwich."}
{"text":"Good lunch deals: $9-$13 for main course with coffee, dessert and soup.
But food was less than average.
Despite that the place was packed with locals."}
{"text":"The food is ok. Nothing out of this world but the portions are quite generous! They open quite early during weekdays and if you're thinking of having lunch there (weekdays) expect the place to be loud and full. With all the construction workers! Service is...BLAH. They could use an upgrade in that department. As for the prices, i would say it's fair. My husband really enjoy their smoked meat poutine. Breakfast is cheap... Like i mentioned. This place is an OK place :)"}
