{"text":"Been there a few times and loved it every time. The first time I was taken back because it is a club and restaurant in one but it also looks like a reception hall. Once you go in the server comes to your table and take your name and puts it on a bill so like that you can pay that bill at the end of the night.  Its a fix cost for the food and entertainment like the belly dancer, arabic singer and DJ. The food starts with a lot of little entrees and at the end they have the meat (grillade)    You can smoke the shisha there they have men walking around and you pay him and he sets you up  The ambiance is great but very loud so if your looking for a quiet place that isn't it. It is a bit pricey and if you add alcohol as well it's even more but if you go once in a while it is worth the price"}
{"text":"This place is terrible on soooo many levels....  At first glance, the restaurant looks okay.. Nothing fancy.. A little tacky.. But overall fine.  Once you're seated, it's a set menu of hot and cold mezzes (appetizers) followed by a main course two hours later... The food is absolutely terrible....... Nothing authentic here.. Flavor lacking every which way possible.. And as someone on our table mentioned, everything was in dire need of olive oil. Plain bad.. Appetizers include everything from tabbouleh to humus to  cheeses to some weird calamari salad, and the only thing I found good was the store bought cheese. Next, hot mezzes include a bunch of fried pastries and kebbe.. Not bad ...but then again you can't really mess up anything deep fried...two hours later you get your 'main' dish which is a plate with six skewers in total (4 people share a plate). The meat is dry and chewy.. Food court Lebanese food tastes better!  Finally, the DJ may be one of the worst I've ever seen.. Terrible at picking good songs to get people to dance to.. Just a mess  Overall, try to stay away.. There are places with much better Lebanese options all around Montreal. For about $40 per person, you can find much more satisfying places to eat. Meh..."}
{"text":"Food is good, music is ok, ambiance is fine. You can have a good time. However you have to put up with second hand smoke cause the owner allows customer to smoke, apparently, even though it is illegal in Quebec to smoke inside. We complained but he did little to rectify the situation or make us feel appreciated. Would not recommend going there."}
{"text":"If you are looking for a night of fun, this is it!! Although this restaurant is more of a huge reception hall it filled up around 10:30pm and the ambiance was pretty decent.  If you go early be prepared to be sitting in a near empty room.  This place gets busy after 10:30pm as that is when the DJ or band startup (oh yeah, and the belly dancer).  The food was quite good for a restaurant with a fixed menu,  (one price and they bring you lots of food). All the meats were well prepared and juicy and the kibbe nayeh (steak tartar) was very fresh and tasty.  As a non-lebanese I was a little out of my element as music was in arabic but dancing and eating and drinking was a lot of fun."}
