{"text":"Will never call to order for delivery again at this restaurant. From the moment I called until I received it toke 1 hour and a 45 min!!!! Can't believe it until it really happen. Even if it was supposed to be good the food was cold and mushi."}
{"text":"This Amir is absolutely horrible! I used to like this place a while ago, but I went there with my gf for the first time in a year or so, the management seems to have changed, I didnt recognize the people there. Anyways, the customer service was awful, they were incredibly stingy and rude. The older lady there especially had some serious attitude! The food is way overpriced now for the amount they give and the taste was mediocre at best. I really don't recommend this place at all, especially when you have other options nearby. My experience with the new staff there was so bad we'll never be going back there again, even though I live in the area. I'll probably go to Boustan from now on or some other place nearby. I literally signed up to yelp just to comment on this place, I never post reviews, but thats how strongly I dislike this place now. I hope they clean up theyre act soon."}
{"text":"A healthier alternative to greasy pizza after a night out!

Atmosphere: The place is often crowded after 1am; not the ideal place to go for dinner unless you're starving after clubbing.  In the afternoons though, the place is much quieter, arabic music is often on, and you can really enjoy a meal outside (weather permitting) and bask in the sunshine.

Service: I have gotten to know the family that owns this franchise; 3 (of 6!) sisters. The ladies run the place in various shifts, but have always been very pleasant and courteous.  They know that the restaurant is their livelihood, and thus work very hard to keep their customers happy.

Food: The Amir menu + some surprise dishes cooked up by the franchises depending on the mood.  Given the heavy footfalls in this area, the chicken and beef shawarma racks are constantly fresh.  In the evening, just before the clubs unleash their patrons out onto the streets (3ish) is the best time to grab some grub.  At that time, it's fresh (in anticipation of the onslaught of inebriated people), so it's the best time to grab some :O)

Food is good, the people are even better"}
{"text":"DO NOT ORDER FROM THIS LOCATION! It is run by rude, unhelpful and generally terrible people.

My boyfriend and I placed an order for delivery earlier tonight. When the meal arrived, not only were we disgusted at the state of the food, but it was the wrong order as well. To clarify, our fries and salad were put in the same container together, so the salad got limp from the hot fries while the fries got wet and soggy from the salad dressing. My boyfriend also asked for no garlic sauce on the fries, which they ignored and put on anyway. Plus, it wasn't even the right kind of salad that we had ordered, not to mention the portions were minuscule (if two orders of fries and two orders of salad can fit in one average styrofoam container then you're probably not getting good value for money). 

I called them immediately and explained the situation. I was not rude or accusatory at all, and was really just looking for some kind of apology. Instead, the man on the phone told me very rudely and defensively that they send out lots of orders every day and that I shouldn't complain, because everyone gets the same treatment. He told me that if I didn't want my fries and salad mixed together, I should have specified upon ordering (what?). Finally, he told me that they couldn't possibly have gotten the order wrong, and that I must have thought in my head that I ordered one thing but actually said another. I tried to reason that I was positive I ordered exactly what I wanted and it was THEIR fault that they messed up the order, but the man on the phone refused to apologize or offer any sort of compensation. He even began to yell at me, for DARING to call and complain about receiving the wrong order! 

Save yourself the trouble and do not order from this place. The portions are small, the quality is terrible, and the people are disgusting."}
{"text":"2 stars for their low prices. Though, i had a much better Lebanese food for the same price. It was my first time at this restaurant. The food was so so and the restaurant did look so clean. 

I guess they cater more for late night crowd, where quality is less of an issue. Anything taste good at 5 in the morning I guess. Unfortunately In my case I was not quite there yet as I went there early in the evening. I do not think I am going back again."}
{"text":"Very good Lebanese food, among the best I've eaten so far. The service wasn't that great, the guy at the register was as friendly as a Taliban with American journalists. And they don't do refill for the pop drinks, which is horrible because Lebanese food make you thirsty like you haven't drink the whole day. Come on, it costs you nothing, especially the glass is the smallest I've seen in restaurants, I don't even how to call that size? Tiny? Sample?"}
{"text":"The service here was awesome, very friendly folks. I went here with my family to have some awesome shawarma plate. 

There is decent amount of space to sit up and down. Service was quick and we were eating in no time.

I got their chicken and beef Shawarma plate.. the plate came with salad, rice, sauce, potatoes and lot of meat! The meat was good well cooked no cheap stuff... 

All in All its great place if you are feeling for a Shawarma and the food was fresh and not microwaved.

For my Muslim folks - they serve halal meat here."}
{"text":"Un amir comme un autre ! SAUF

La seule crémerie sur l'île en été ! yééé ! petits et grands raffolent des cornets de crème molle de chez Amir. Aussi, ils ont un petit freezer avec des popsicles et des tablettes du genre hagen daaz.. Merci de sauver mon été !"}
{"text":"I was not really happy with the food there. I know Lebanese food well, the food at this place is more of a fast-food. The restaurant did not look so clean either. Even though the price was cheap, still had the same price for similar food elsewhere and the quality was so much better."}
{"text":"http://everythingmtl.com/index.php/2016/04/06/amir-hummus-may-not-be-up-to-standards/

Food stored outdoors, in the open, in an alley"}
{"text":"I ordered take out from here and it took 1h30 mins until delivery when estimated time was -45 mins! Way past dinner time at this point. The food was cold by the time I got it, with soggy sandwiches and potatoes overly greasy. Safe bet delivery is not their strong point!"}
{"text":"Je déteste faire de mauvaises critiques mais cette fois... Pour la livraison, on repassera..1h30 plus tard, j'attends encore...J'ose croire, naïvement, que c'est plus rapide d'aller le chercher soi-même..."}
{"text":"We just visited Amir yesterday, and I don't understand all of these bad reviews!  The food was great and the garlic sauce on the Shawarma and potatoes was out of this world! 

We ordered 2 Shawarma combos and then got some coffee and delicious baklawa with pistachio!  I had no trouble ordering with my VERY limited French, and the lady at the counter rounded my bill, which came to 20.67 down to 20, because I only had two 20's. I felt terrible and later went up and ordered the coffee and baklawa so I could get some change to pay her back. 

Great food, run by a very nice family and an excellent location. Don't believe the bad reviews and come check it out!"}
{"text":"Vancouver could take a hint from these guys, they sure know how to do Lebanese food. For under $5 you can get a hearty wrap or for under $10 you can choose up to 5 items from their delicious array of grilled eggplant, sauteed cauliflower, falafel, garlic potatoes and many meaty delights.
No matter how broke you are this place will treat you right and keep you coming back for more."}
{"text":"It was recommended to check out this place for some fast food Mediterranean food so we headed in here for lunch. Like any fast food place it's a chain and apparently some locations are 24hrs.

The menu is all in French but there are pictures so I don't know the names of the plates I ordered, but at least I can describe it! I ordered a plate with 2 beef skewers (~$10) and it came with rice, 1 pita bread, hummus, salad and a boiled tomato. The rice was yellow and well flavored. I think you were supposed to make your own type of falafel-thing with the pita, but I ended up eating everything and eating the pita with the hummus. The beef skewer was tender and juicy, but needed more marination.

We also ordered a mixed plate (~$10) which consisted of shavings from the beef and chicken . It also came with rice, 1 pita, bread, hummus, salad and some darn, tasty white sauce. The meat was tender as well and tasted better when you added that white sauce to it. I wish I had some of that on my plate!

Overall, typical Mediterranean food. The majority of the people that came in just ordered a falafel to go. The place was clean and there's plenty of chairs and tables for diners."}
{"text":"I got the chicken pita and it was pretty good! Very messy but I was expecting it. The restaurant is small but clean and the man working was very nice. The prices are fair, and considering there isn't an abundance of middle eastern food places on Nuns, this hits the spot."}
{"text":"I LOVE AMIR!!!! OH HOW I MISS U WHEN I COME BACK TO CALIFORNIA :(.

THE OWNER AT THIS PLACE IS SO NICE! HE REMEMBERS ME EVERYTIME I GO BACK & ALWAYS GIVE ME AN EXTRA SIDE OF RADDISH FOR FREE :)

chicken shish taouk
I want one now :(..."}
{"text":"Amir is great! The food is always good, and they always stuff your take-a-way box really well. Staff are really nice, and restaurant is really clean! Amir is a great food if you want a full stomach on the go."}
{"text":"I love pita sandwich and Amir made them just right! 

I decided to order some food at this place online. The price was 14.25$ for two pita sandwiches, a garlic potatoes side dish and a ginger ale soda. The second sandwich will be great for another meal. The food was AMAZING. I always love their sandwich version and the price is unbeatable. 

Overall, the delivery service was 45 minutes long as stated and it was delivered very quickly."}
{"text":"Hmm.... this is a tough one to review. On one hand I like that it provides better food than pizza at 2AM but on the other hand the food is quite sub par and pricey.

Four of us went their on new years and the place was sufficiently busy but not over crowded by any standard. We easily found a table and waited in line for about 5 minutes to get food. Not bad given it was new years. The restaurant itself is a bit run down, probably more so than most shawarma joints I frequent in Ottawa. Maybe someone can sell that as rustic? But I am not a designer......

Having said that there are a few things that really disappointed me. I ordered a mix shawarma plate a can of pop and the meal came out to $18. The portion size was sufficient for me but was definitely smaller than what you get at other places. On top of the high price the rice and potatoes were microwaved in front of me. That was the real deal breaker for me. I simply cannot accept microwaved food at a restaurant. I do not like it at subway and I do not like it at a shawarma joint.

In fairness I will say this, I discussed this review with my friends and they thought I was being harsh. They argued that it was new years eve and so it was okay. In response, here is what I think. Yes, It was new years, but the place was not packed. If you open a late night restaurant, be good at serving food late at night. Situated in a busy area, I have to assume they are busy like that every weekend so they should be prepared. 

I think that the target audience for the restaurant are people who have already compromised their taste buds with a myriad of beverages over the night and hence won't mind the sub par food. I wasn't one of those people hence the realistic expectation of quality."}
{"text":"I loved this place. I personally like it more than Boustan or any other similar Lebanese places, which I think is a matter of personal taste, but the chicken schwarma / shisk taouk is wonderful by itself or as a combo plate. The aioli is also great on rice; I would skip the potatoes for the most part. It is one of the things that I still have the greatest hankering for after leaving Montreal."}
{"text":"The food is meh...  Their delivery prices are really high, especially when there is a better middle eastern restaurant next door called Boustans, and they have free delivery.

You're better off just going next door to Boustans, or if you want to order in, order from Boustans.  They deliver later too."}
{"text":"Bad customer service and rude employees. Unfriendly atmosphere. The young girl serving me looked disgusted to work there and was purely throwing the food on the plate! Not going back"}
{"text":"You'd think with a franchise like Amir, you couldn't go wrong. If you believe this, you're an idiot. This has to have been my WORST Amir experience ever, and I've easily been to at least seven different locations in Montreal.

First off, the portions were terrible. Normally, you should leave Amir feeling satisfied. Here, I felt like I had just been punched in the gut with shitty garlic sauce. Add to the fact that I spent $10 on a crappy plate that didn't even come with potatoes (a staple on nearly ALL shish taouk plates in Montreal), the ingredients tasted like they had been mixed together with cat food. Such a waste... anyway, if I were running the company, I would burn this franchise down and cut my losses. 

So if you're thinking of visiting this location, I'd recommend walking up to the Amir at St Denis and Mont-Royal instead, where you'll actually get a decent meal, as opposed to the crap they serve at this one."}
{"text":"Sure, Amir is Amir, but I always find myself leaving this location slightly happier than any of the others - the staff are always wonderful and super accommodating, and there's just something about the place that makes you smile.  

The food is pretty average (to be expected), but for whatever reason, I'm kind of addicted to their garlic sauce. Not sure what they do differently here, but it's definitely a bangin' sauce. 

Oh, and they also have a great deal on daily specials. Plate, soup and a drink for something like 10 bucks. 

So in conclusion: if you need to go to any Amir, go to this one."}
{"text":"Searching for a burrito (my first burrito in months!) in this snowy northeastern French-Canadian city, I walked furiously towards my target, Burritoville, only to find that it was closed. (What's up with that, restful Canadians? Why do you have so much more vacation time than your southern neighbor? Why are Americans so overworked and unhappy? But I digress...)

Hungry and growing ravenous, I turned the corner onto Maisonneuve, dejected but still going at a restless pace.

I walk by countless restaurants but none of them appeal.

Suddenly, I pass one called Amir. Huh, I think to myself. I see a photographic rendition of not one but two vegetarian options. I'm intrigued.

I'm about to keep on walking to search for a Commensal (where I've eaten almost every single time when I'm searching for food downtown) because I'm confused as to the entrance. I see the window, I don't know if they're even open, but-- a-ha! A glass door lurks from a few steps down.

I enter and I'm greeted warmly with a \"hello\" and English. I ask about the vegetarian options and choose to get the house plate. As one worker helps prepare my plate, another rings me up and asks-- \"Do you need a fork?\"

I say no, I have one. She looks at my tray and sees there's no fork. \"But I don't see one...\"

\"I bring my own.\"

\"Everywhere? Why?\"

\"To save plastic.\"

She looked at me and said, \"Wow! You're the best!\" She turns to her coworker: \"Did you hear that?\"

\"Yeah,\" he replies, \"there was one guy who brought in his own plate, too, once.\"

The plates are plastic. If I come back, I'll bring my own as well. She rings me up-- 8.88$, three lucky numbers in Chinese culture-- and I sit down with a smile.

I begin my plate and it's delicious. I try to eat slowly, but I'm also hungry and it's delicious. Falafel, hummus, salad, eggplant, cauliflower, and roast potatoes in a way I'd never experienced before.

Delicious.

Wonderful service and wonderful food. (Apparently it's Lebanese, so that's the first time I've tried it!)

Recommended."}
{"text":"Always good, Nevers let you down. Friendly staff. I've been in different Amyr's and this one is always consistent and clean."}
{"text":"No complaints.  The combo plate had everything I was looking for. Great food any time of day. If you're only getting one meat, try the beef as it's got a much more unique flavour."}
