{"text":"Soy is truly an exceptional restaurant. We have been many times now and each time is an amazing meal and experience. I was most impressed by the quality of ingredients - everything from the chicken to the shrimps is quite possibly the best-tasting meat available. The service is excellent and they have a good list of wines.

I highly recommend the dégustation menu, as well as the duck dumplings and garlic pan-roasted shrimp."}
{"text":"Petit restaurant charmant, la nourriture est délicieuse, on est dans l'ordre du chinois haut de gamme, pour un prix plus que raisonnable (table d'hote pour $25) ..
Un endroit a recommander, si on veut un petit souper décontracté."}
{"text":"My boyfriend and I came here on a Saturday night, and really enjoyed ourselves.

The atmosphere was very nice; simple decor, but with some quiet jazz playing in the background. We both agreed that the combination of the music and the cuisine made us feel like we were in a film noir (or The Legend of Korra).

I ordered the Mojito Asiatique, which was good and very simple, though not particularly strong in either taste or alcohol content. BF was pleased to see they had Tsingtao beer.

The food was very, very good. BF had the salad to start, which was served with a nice, fresh sesame/ginger vinaigrette. I had the won ton soup, which I thoroughly enjoyed- the broth had more umami than the won-ton soups I'm used to, almost in the style of a miso broth. But the dumplings were tender and tasty.

What really blew us away were the xiao long bao. They were UNREAL. I had never tried this style of dumpling before, and I don't know which I enjoyed more- the rich, meaty flavour with the zing of the lemongrass broth and the ginger sauce they were served with, or the ritual of gently piercing each dumpling to drain their piping-hot broth. It was so good, I drank the broth-sauce mixture when I was done.

We both ordered the General Tao as a main, which was well-done but not exceptional. The portions were generous, and I struggled to finish mine after the soup and dumplings the meal had started with (BF had no such issues). When (not if!) we go back, I'd definitely try one of their house specialties as a main, and try something more traditionally Chinese.

We took our desert to go-- a very simple cake with a chocolate sauce. Again, good but not exceptional.

Soy lost one star for service. We arrived on a Saturday evening at about 6 o'clock, without a reservation. We waited five or ten minutes to be seated, not because there were others waiting, but because all three servers were with customers (although each walked past us and asked if we had a reservation, had we been served, etc.) Finally, we were told, somewhat brusquely, that there was a table available, but only until 8 o'clock. We could have easily eaten and left within that time frame had he not mentioned the next reservation, but instead our otherwise pleasant meal had a shadow of anxiety cast over it. We did not enjoy being rushed. Ironically, we waited over twenty minutes to get the bill at the end of our meal, even as we were trying to leave. During our meal, however, the servers were attentive and helpful. Next time, we'll know to make a reservation!"}
{"text":"Amazing food, great prices. As a whole it's a great restaurant but TERRIBLE service. The man who was serving was not only slow but unpleasant. Spoke to the table next to us for a good 15 minutes. We sat with dirty plates in front of us waiting for the bill for about 25 minutes. He said very little to us, for example after waiting 20 minutes for drink orders to be taken, he just stood at our table waiting for us to say what we want. Not even a hello. It's such a shame because its a cute place with great food."}
{"text":"Ma toute première expérience à cet établissement, recommandé plusieurs fois par des copines qui y avaient été impressionnées dans le passé, fut la dernière à coup sûr. Et je suis repartie très amère de mon expérience: ni les lieux (table et verres malpropres) ni la cuisine n'étaient de loin ce dont on m'avait vanté de ce restaurant.  Nous avons choisi mon amie et moi une demie bouteille de Bordeaux, qui s'avéra être de qualité ''piquette'' de tabagie.  L'entrée de salade de ma comparse était fade et ordinaire (laitue iceberg!) et mon entrée de rouleaux aux avocats avaient le goût de morceaux d'avocat dans une pâte file frite. Exactement, sans être exotique ou particulière.  Quelle misérable manière d'entrer en matière.  
Le boeuf de ''style coréen'' n'avait rien de tel, je m'y connais.  Tout simplement apprêté avec une énorme quantité de sucre.  Le mijoté de fruits de mer étaient un n'importe quoi rempli de morceaux de tomates de boîte de conserve, et les rondelles de calmar de texture caoutchouc étaient enrobés d'un ''filament servant à l'emballage'' indigeste et ragoûtant.  Les prix sont terriblement élevés pour des plats si mal fignolés.  Je leur donne une étoile car le service était tout de même souriant quoique détaché.  
Le restaurant Soy a malheureusement déjà connu ses belles années (selon les recommandations passées) et maintenant se laisse doucement bercer dans la médiocrité."}
{"text":"Delicious yet simple! Been dying to try the scallop tartar but everytime I go its sold out! Not giving up just yet!"}
{"text":"Pour une belle table d'hôte à faible coût. J'ai vraiment aimé les crevettes sautées 

Trèsbon service!"}
{"text":"Très très bon. Un des rare bon resto chinois qui fait dans la qualité plys que la quantité.

Petit resto. Compter 120$ avec une bouteille pour 2. Bon et on en sort super plein! Déco un peu basic."}
{"text":"I'm sorry other reviewers, but this is the worst fusion/western \"asian\" food I've ever had in my life.

I see a lot of positive reviews in the past, so something must have changed staff wise.

I may be a bit of an asian food snob, as I've had a lot of it, and I think Montrealers haven't been exposed to really good stuff so their standards are skewed.

Now, it's not inedible, but it's NOT good for the price of what you're getting. This tastes like the kind of stuff you make at home with a president's choice jarred sauce to use up the veggies you have in the fridge/save some money.

We had the Pan fried BBQ duck dumplings, General Tao's chicken, Grilled chicken in sesame-peanut sauce noodle thing, and the fried peppercorn shrimp.

The dumplings were so bland and seemingly not fried on top of limp sprouts/cucumber, and a nice sloppy sploop of peanut sauce around the bottom. And they were VERY VERY tiny. I would've taken a photo but the restaurant is VERY dark. 

Like not romantic dark (get some candles!!) like, so dark you can't see your food well.

General Tao's was slightly dry fried white meat chunks in a tangy sauce - not amazing. Tastes like the kind of thing you can make at home. 

The Chicken/Peanut Sauce noodle was the worst for me. Their menu emphasizes sharing/family style chinese, but you literally get one chicken breast sliced in half horizontally, so essentially two thin pieces, ontop of a giant pile of egg noodles, literally drowning in peanut sauce.

Along with a giant messy pile of julienned peppers, cucumber and green apple thrown on top.

How do you share that? Everybody takes one bite out of a whole chicken breast?

The combination of eggy noodle and peanut sauce soup makes it a VERY heavy dish as well.

The shrimp was average and a very small portion with a little icecream scoop of white rice on the side, and some broccoli rabe. 

Just not good for how expensive it was. 

We went on a Thursday night and it seems that there is only one server there, and took quite a while to get our bill.


Sorry, I wont be back because I can make better at home for cheaper!"}
{"text":"Très bon chinois, avec un bon choix de plats à prix très corrects
Table d'hôte le menu avec entrée et café et petit biscuit en dessert pour 14-16$
Pas mal de monde le midi en semaine, car pas mal de bureaux dans le coin et capacité de 30 personnes max peut etre?
Bouffe très bonne et pas trop grasse
A tester!"}
{"text":"I dined here Friday, Oct 21st with 3 friends. We trenched all the way to try their «Xiao long bao» Steamed pork dumplings. We were giddy with excitement. 

At 7ish PM on a Friday night, we were asked if we had reservations which we hadn't. The girl consulted a humongous reservation book and arranged us in a corner spot. Not a huge place but pretty comfortable and clean. Our waiter explained that they were out of the Xiao long bao, the main reason we came there. Damn. Was it really 7pm, how could they be out of steamed pork dumplings?!

Well that is not going to deter us from getting a great dinner. The waiter confided that in order to get the dumplings, it's better to make a reservation ahead of time to guarantee us having some next time. Good to know fellow yelpers!! See if that works for you. 
 
Onto the food...
We all decided to do their $35 tasting menu. It was something like an 11 course meal. First 6 are appetizers. Not going to list the full menu but we all agreed as a group that the soup (fish broth soup) was excellent, and almost all of the appetizers were superb. The main dishes were not as glamorous or anything special to mention. It was pretty average, although their General Tao chicken was different from all the other's I tried (which I usually dislike) but this one was actually great. 

I think if we had stopped at the appetizers this would've been a 4 star review. 
The service and staff were excellent, and attentive. The restaurant filled up pretty nicely during our meal and there was only one waiter, one runner and the reservation girl also helped bringing in dishes. It seemed a harmonious working order and they covered all the tables quite well. 

End of story, I would def recommend this restaurant. Bon appetite!!"}
{"text":"One word.  AMAZING!

Another word.  GO!

A final few words.  Ask what the house special is that day and try it...it's always a nice surprise to me and I discover food I've never heard of."}
{"text":"C'est bien mais il ne faut pas prendre le menu dégustation ça coûte trop chère pour ce que c'est, 40$ et j'avais faim encore après?  Les nouilles croustillantes en foam  je n'aime pas désolé, ça rempli l'assiette pour rien et ça fait cheap je trouve de mettre ça dans une assiette. Sinon le poulet du général tao est dans les meilleurs que j'ai mangé et les prix sont quand même bien."}
{"text":"The go-to Asian restaurant for any occasion.

Soy is always there, and it's always special. It is the shining example of what a neighborhood restaurant should be.  

While the à la carte is great, the real experience starts with their super-affordable tasting menu. Pair it with a bottle of riesling and the night is set. 

Casual first date? Soy. Fun double date? Soy."}
{"text":"Seems to be a mixture if various Asian dishes. The food was tasty but not out of this world heavenly! Service was ok. Overall, not wow-d by the experience unfortunately."}
{"text":"Mon restaurant favori du coin!

J'adore leur poulet Général Tao. Je n'ai pas trouvé aucun autre restaurant jusqu'à maintenant qui peut rivaliser sur ce plat. Leurs rouleaux de printemps sont excellents aussi.

Les portions sont raisonnables et tout cela à très bon prix.

De plus, vous pouvez prendre vos plats pour emporter!

À essayer absolument si vous êtes dans le coin!"}
{"text":"It was after 8PM when my colleague and I arrived to this restaurant. It wasn't crowded so we got seated right away. The server was attentive and took his time to explain their specials and respond to our questions. 

I really liked the atmosphere and the food. The tartare I had was delicious, unusual but an excellent way to prepare and serve it.

I could see this place being perfect for dinner with friends or a date. I'm definitely a fan now."}
{"text":"Pearson, Represent.

        A great, quaint eatery with authentic cuisine, inexpensive and a little off the beaten path. I went for lunch and had duck dumplings with green beans and some perfectly cooked rice. Delicious. 
 
   The presentation was appetite igniting and the food was spot on, tastewise. My only issues were with the server, who wasn't the most welcoming and put my plate down backwards. The chef works hard for it to look good....common!

 The word on the street is the General Tao is 'coup d'etat' good. I shall return, Soy.

waka waka"}
