{"text":"Great bring your own wine. It's a great place for a simple night out with a good experience.  Sometimes they get overwhelmed when there are too many patrons but you'll enjoy your time if you're in good company as the ambiance is warm and comfortable.  It's never empty a good bet if you don't want to spend your last dollar. Especially compared to the other restaurants in the area."}
{"text":"Loved my experience at Bitoque from start to finish! It is a place to sit linger and enjoy the event that dinner should be some nights!  I ordered the lamb shank off of the table d'hote and it was fall-off-the bone delicious! I also tasted the piri-piri shrimp for the hors d'oeuvres and loved it!  The staff was lovely, the owner came and spent time with us and refilled our glasses of water. He took us around to the special events room as well!  Don't go here if you are in a rush, because its all about the experience here and it's not super quick.   Last but not least I had the cheesecake for dessert which was incredible!"}
{"text":"Service très bon malgré que nous avions attendu longtemps pour notre plat principal. La qualité y était, très bon au goût mais j'avais encore faim après les 4 services et pourtant je n'ai pas de grande appétit."}
{"text":"Got an amazing assortment of Portuguese tapas for a very reasonable price. The atmosphere was inviting and though the place was packed, the service was excellent. The seafood was out of this world."}
{"text":"So this is what I like to call, your mom and pop's idea of a cool restaurant.   It's not trying to be anything else but a place that is enjoyable and serves good food. I like to think of it as the upscale Saint Henri resto for the regular folk.  The portion's are generous, the food is good and feels like its something I would get at my mom's house, you know, not to fancy. Is this making any sense?   If your in between Atwater avenue and De Courcelle street and you don't have a reservation for the cool places go to Bitoque. Don't forget to bring your own wine! Have a nice meal and remember the wine can break or make the meal so pick wisely!  This is a meat and seafood heavy menu!"}
{"text":"This place was yummy.   Had the sardines and fried calamari for appies - both were good.   The scallops and prawn dish for dinner was amazing! Mmm still thinking about the delicious risotto that came with it.   Dessert was the key lime pie which was just good.   Overall a solid restaurant, nice ambiance, good food, ok prices. This place will not disappoint."}
{"text":"Second visit for me in 4 years, now as a pescatarian. So I had the fish tapas : \"sardines\" and \"croquettes de morue\" (which I unfortunately had to return because it was wayyyy too salty). An Even-with-beer-too-salty kind of taste.  Our waiter was very nice about it though, and offered me to replace it : I opted for the grilled squids - and my taste buds were very pleased. $11 for two medium-sized \"mollusques\", perfectly grilled with spices and a delicious white, light sauce, a lot of it. Sadly, my friend had the steak (surlonge), and struggled with it the whole time. Lots of nerves/tendons, but the cooking was good. Overall we had a good experience. Bitoque is a good value and ideal to share plates and try a bunch of different things. They serve generous portions. Oh, and bring some gum or fruity Ice Breakers lol Lots of garlic and spices but so worth it :)"}
{"text":"Great for groups! Very nice atmosphere!  Good service! Tasty food and great selections for all tastes. Not too pricey."}
{"text":"Dedication to Detail The restaurant itself is full of charm. The 80-person dining room is decorated in white with exposed brick and old-fashioned iron decoration. The art aesthetic from the basement also migrates upstairs, with pieces for sale displayed and highlighted by spotlights. Day or night, floor-to-ceiling windows offer patrons a great view.   Traditional Food With a Fresh Taste  Much of Bitoque's menu offers combinations of well-known tapas favourites, such as fried calamari or garlic shrimp, combined with staples of Portuguese and Spanish cuisines with dishes such as grilled sausage with an omelette. Bitoque's specialty, not surprisingly, is the bitoque--grilled steak with a poached egg on top, accompanied by fries and vegetables. Sticking to its mission of experimenting with tradition, Bitoque also offers port and wine tastings."}
{"text":"I probably would have given Bitoque four stars, but under the circumstances I had to dock them one. I'll go back to find out if they deserve that fourth one, though, because it was pretty tasty.  I had a traditional striploin steak and fries with mushroom sauce. It was good, although I asked for it rare and it was definitely medium. My cousin sitting next to me asked for it medium and it was definitely well done. Tasted good, though. To start I had the sardine paté which was tasty as well.  This place is BYOB only, which is cool with me 'cus we drank top-notch wines without paying the keystone vino markup.  Where they fell short was on the service and overall experience. To give them credit, it was an incredibly busy night, but I'm of the opinion that a top level restaurant should staff properly and accommodate the guests it seats without compromising any aspect. Anyway, we went here with a party of 10 on December 22nd and it was packed full of other parties just like ours. Considering how crowded it was, the staff did ok, but they were definitely understaffed - like 3 servers for about 100 diners. They became flustered and service started to falter. For example, one of the young kids at our table spilled a glass of water and the waiter didn't re-set the table until we requested he do so. When he did 're-set' it, he only replaced the paper on top of the linen table cloth, so it immediately soaked through and was wet again. Other details were missed consistently throughout the night as well.  Good food, decent service, unable to handle the busy holiday season, worth and try and another try."}
{"text":"Worthwhile byob. Food was okay. Service wasn't great. But overall good experience. Slightly older crowd, but good for birthdays!"}
{"text":"Wôw ! et re-wow! Je suis allé qu'une fois au Bitoque et j'ai été franchement épaté. Ce trésor caché de St-Henri n'a pas fini de m'y voir. J'ai essayé le Borrego ao vinho do Porto (Jarret d'agneau braisé garni d'une sauce au Porto, servi avec pommes de terre rôties et légumes). J'en ai été renversé. Juste à y penser, j'en salive encore. Comme dessert : les pastéis de nata, ces merveilleux petits flans aux ufs servis en duo. Juste trop, trop bon. C'était un samedi soir et le resto était bondé, alors pensez réserver."}
{"text":"I really enjoy Bitoque. The food is quite decent. The ambiance is nice. The restaurant itself is lovely. The prices are very fair. And best of all... Bring your own wine! Add all this up and you have a pleasant evening that doesn't break the bank."}
{"text":"I had my first experience at Bitoque last night and as Clare L. said below I have to agree. Its a great looking place, the staff is very nice and welcoming but the food is sub par. I mean the food was good but nothing really original or that I hadn't already had better somewhere else.    I'm aware that I might be jumping the gun and that I should give it another chance and I will. This is just my first impression of the place."}
{"text":"This surprisingly upscale BYOB is more than worth the trip to St-Henri. The young owner who runs this amazing restaurant is one of the nicest people on the planet. The food is consistently excellent and their new chef is preparing wonders. The ambiance is warm yet cosmopolitan chic. Reservations are a must as this place is busy!"}
{"text":"I've been here three times, and the staff has been great. Service is great. It's BYOW, so what's my problem??? I really want to like it, and I really want to support the St-Henri businesses, but unfortunately, all 3 times that I have been here, I found the food subpar.    The food has been more or less bland, and considering the prices, I wanted my seafood to be phenomenal, but it's always lacked pizazz. I've tried the Cod Balls, the Calamari, Grilled Salmon, Frittata, and the Piri-piri Chicken on my visits. The salmon was overdone, the frittata was ok, and the chicken was a bit dry.   It was recommended to me originally by a couple that raved about the service and particularly the food, so I had to go and see what it was all about. They were right about the service, they were kind and courteous. The interior was very large, and the few times I have been there, it had been only partially full, so it was really noticeable how large the space was. It was because of that, that I didn't find the ambiance to be particularly warm or inviting.   I'm sad to say it wasn't a hit for me."}
{"text":"Un excellent \"Apportez votre vin\"! La nourriture est très bonne et le service sympatique...mais beaucoup trop lent! Nous avons même quitter avant le dessert et le café puisqu'il y avait plus de 2h30 que nous étions là! C'était un mercredi soir, et le restaurant n'était pas plein. Je n'ose imaginer un soir de week-end! Mais nous y retournerons sûrement...pour la bouffe!"}
{"text":"Soooooo good!!! A BYOB Portuguese restaurant but on a higher scale.  The waiter was extremely friendly and helpful. The appetizer sardine pate is wonderful. My boyfriend took the lamb dish (I HATE lamb.. I am not in love). I took the flank steak with frites. Melt in your mouth. I can't wait to go back!!!"}
{"text":"I didn't set my expectations too high as BYOW restaurants don't always have the best food but I was blown away with the service and the flavor. I had the chef's paella and my girlfriend had the flank steak. Both dishes were unique in flavor and were perfect portions. I will definitely go back."}
{"text":"LOVED this place ! Great quality food at a reasonable price and attentive friendly servers/staff, BYOW, warm and inviting ambiance. We tried the grilled octopus as well as a seafood stew, both were delicious. Definitely coming back !"}
{"text":"Stars for the service and the bring your own wine. Otherwise terrible.  We came as a group of 12 and were well accommodated. The server was super nice and the atmosphere was also pleasant.   The food was so disappointing. Most of us ordered the group menu that came with a soup or salad, a main and a dessert for 37$.  The highlight was the soup which was actually pretty tasty. The main and dessert were so salty and just unappetizing. Even the wine couldn't salvage the experience. Way overpriced for the quality we received.  The service truly was great so 2 stars for that.  Service:5/5 Food:0.5/5  Atmosphere: 3.5/5 Value:1/5"}
{"text":"Terrible restaurant, I don't understand how it even received a single positive review. The food is amateurish at best, and overpriced considering the low-quality. This service is just OK enough for you to not complain, and the restaurant itself is dark and dingy. There are literally dozens of better alternatives in that area. I will not be going back!"}
{"text":"Nice atmosphere, service was good, food was average though. Not bad, but nothing special."}
{"text":"A good BYOW is a hard thing to find and certainly something you cherish once you find one. Especially in Montreal where outside of a few well-known ones, it is a somewhat barren wasteland - mostly in terms of the quality of the meal itself. It is nice to save on the alcohol cost but if the meal is not up to standards, I would rather pay the premium elsewhere. After a long weekend course, I was invited to a dinner with my family at a portuguese BYOW near the Atwater market that I had never noticed before, Bitoque.  From a visual point of view, the space is nice and functional. Thankfully Bitoque stays away from the kitschy look can see in some \"traditional\" Portuguese restaurants. Cream-colored walls with nice artwork all around the room, banquets, wooden chairs and honest-to-goodness white tablecloths. On a busy Saturday as it was, the room was rather noisy but not overbearing. My one issues was that the tables were rather close together so when the room is fully occupied as it was, there really isn't much room to move or even sit slightly away from your table.  Bitoque offers both a standard \"a la carte\" menu as well as a tapas menu. For this particular evening, we stuck to the tapas offering. First up, pastéis de bacalhau - fresh cod croquettes on wakame salad and cilantro aïoli. I could leave the salad underneath but the cod croquettes had the right exterior crunch to pair with the flaky fish inside. The aioli brought some nice freshness and creaminess to the dish as well. Not the best I've ever had but a solid starting point.   Next up, we had the chouriço grelhado - grilled chorizo on coleslaw. The coleslaw here was rich and cool which was very important because dear god, their chorizo was hot! Hot in the spicy sense of course.... note that I am a bit of a wuss in terms of spiciness so the rest of you may laugh at me here when you order this dish. Given my previous experiences with chorizo, I wasn't expected that so the coleslaw helped soften the blow so to speak. Regardless, the chorizo was nicely grilled up and very flavourful.  Our third dish was lulas grelhadas - grilled calamari with lemon vinaigrette. As one would expect from a solid Portuguese restaurant, the calamari was nicely fresh and perfectly grilled. The unique touch here was that lemon vinaigrette - creamy and acidic, it was a nice change to the usual squeeze of lemon we usually do. Note that there was still a wedge of lemon present if you wanted to but frankly that would have made the dish too lemony and not really enjoyable.   The special of the night was a portuguese poutine. Funny how I have had two Portuguese plays of poutine in such a short time apart! This one was quite good if not as rich as the previous one I'd had at Taverne F. A nice mix of flaky cod, cheese and crispy matchstick fries.  Finally, to finish off the meal, we went with a staple and a family favourite - the pasteis de Nata. Served with some cinnamon, this lovely little egg tarts were the perfect end as they always are! At this rate, I should just learn to make them... I would save me some money although likely hurt the waistline somewhat!  All in all, Bitoque was a solid tapas experience from beginning to end. While perhaps nothing really stood out, the quality was consistent across every dish and we left our table stuffed food wise and having gotten to enjoy a few excellent bottles of wine without gasping at the bill at the end of the night. I would call that a win-win. Bitoque, you have officially entered my rotation of BYOWs.   Cheers!"}
