{"text":"came to montreal for vaca.

My flight landed got to Montreal at 1am.  got hungry.  don't know my way around on first night and nothing were open except this chinese restaurant and Couche-Tard (just 7-11 store).  

food is terrible.  only one waitress and she is very rude."}
{"text":"Mediocre food, Expensive, and Bad service

We were visiting Montreal and wanted to try a local Chinese restaurant.  We went here based on the menu posted outside.  The staff who seated us and took our order was rude and impatient.  We were in the mood for dumplings, but they did not have the dish we requested; I then asked if they had any other dumpling dish, to which he responded: \"Didn't I tell you we don't have dumplings?\"  Okay.... We then inquired about a few other dishes, which he rushed us through.  Our bill for two turned out to be $40, which is a lot for Chinatown and commands excellent food; the latter was definitely not the case here.  All of our dishes were average or below, including Porridge With Pork and Preserved Eggs, Beef Tripes, and Water Spinach.  Overall, we didn't enjoy our dinner.

The next night, we had a nice dinner at another Chinatown restaurant,  
Delicieux Xiang, with better service and a smaller bill.  So I can say there are better options in Montreal Chinatown than the bad service and overpriced mediocre food at this restaurant.

Not recommended."}
{"text":"OK... so I went to Restaurant Cuisine Cantonaise based on the one review on Yelp; I was not disappointed. Being from LA, we have a great Chinatown, Thai town, Korea Town, Philippino town, etc etc so I'm no stranger to great Asian food. This place was exactly like I thought it would be, bright, thin on ambiance and kick ass food. 

The Wonton soup was the best I've ever had. The pork dumplings (which were actually sui mei) were good but not the best and the chef special could also have been one of the better dishes I've had but they deep fried the shrimp. That is the only reason I gave this place 4 instead of 5 stars. 

This is a great restaurant in a great city!"}
{"text":"Not having Yelp or internet access during a trip is like a Superman without his super strength-flying abilities, Spiderman without his spidey-sense + webs, Batman without his... [crickets] he's just Batman.

Since my father was in the mood for a family-style cantonese dinner, I resorted to figuring it out the old-fashioned way: gauge the clientele and volume from the window. I was a little hesitant about Restaurant Cuisine Cantonaise since they seemed to cater to a lot of fried-rice-kung-pao-chicken types. I was reassured to find their walls covered in handwritten \"authentic\" offerings. Everything was decent from the garlic sauteed gai lan veggie, pork 'n lotus, and cantonese-style steamed oysters. 

For Montreal Chinatown visitors, this was a solid choice for an old school dining experience. Come in and get your fill on familiar favorites and leave satisfied.  Although I was a little taken aback that they gave us fortune cookies at the end of the meal. No sweet soup or fruit?"}
{"text":"Down an alley in Chinatown, with not great ambiance, and the only way this place could have been worse-named was if it was called \"Chinese Restaurant\".
I had salt and pepper squid. Not fab, not horrible. Waiter was personable.
This place was just about as boring as my write-up here..."}
{"text":"I only come here for the lunch specials. They taste great, portions are fair, and the price is just too low.

Oh, and the waiters are very friendly and the service is pretty hasty."}
{"text":"My regular spot in chinatown was full the night I went because of the car show so I decided to stop there. It was pretty dead at first but it filled up fast. The concept of this place is you place your own order on a bill so you at the menu and right down the number of the item you want and the quantity. Its pretty fun if you ho as a group so you order a lot of different items and share them. They also combo already created that you can also pick from. We had the wonton soup and I can tell you this was far from the best I tried. The general tao was actually pretty good. I had the shrimp fried rice and that was also pretty good. The egg rolls and spring rolls were not that great either. The place looks a bit dirty and outdated, the dishes are very simple, the forks and knives don't match and to top it iff we received a glass that was cracked with also a huge chunk of it missing on the side. It wasn't awful but I am not sure I will come back."}
{"text":"Went here last week and got terrible service. There was only one waiter and they were terribly rude. After waiting 30 minutes before even being greeted, 5 tables were ignored and left without getting any service. Waiters forgot about us and a few other tables a couple times. Waiter forgot to serve tea to people and so one table took a teapot from a table who had already got up and left because of the service. Absolute nightmare, definitely will never be going back. Much better places to eat Chinese food in Montreal. Save yourselves!! :("}
{"text":"Excellent value, bad decor, and the food is good."}
{"text":"I was at this restaurant when I visited Montreal a couple weeks ago. We went fairly late for dinner (around 1am) and decided to try out this place. The atmosphere was pretty dirty and the location was a bit sketch. 

The food however was pretty good! I got the hot and sour soup as well as the chili chicken and was pleasantly surprised with the taste. Everything was well made and tasted good. The service was average, nothing too special but not bad either. 

Overall, I would recommend this location to a friend however beware of the sketchy area!"}
{"text":"I was glad to find this place. It was great service, folks were attentive, it was ok size place and good amount of tables.
The food is better than I have had in recent days, keep trying to compare it to West Coast experiences in San Francisco and Vancouver. 
West side keeps winning hands down.
Best experience thus far, Great service but just ok food.
Good Luck."}
{"text":"Yes, a comparable alternative to the legendary Beijing spot next door, very good traditional dishes and fast service. Open later than Beijing which is how we stumbled on this gem. Staff is super chill and helpful with suggestions. One dish we tried once was breaded shrimp smothered in a creamy mayo type sauce that was a bit heavy but very delicious."}
{"text":"I only went to eat there because it was open after 10pm. Asked the waiter what soup was popular and he suggested the monk fish soup. (Didn't realize it was a whopping $16 as it was one of the most expensive soup on the menu,but that's my fault for not checking) However, the soup did not match up to the price. It had just a few measly pieces of fish and the consistency was overpowered by corn starch. The service was terrible and the server that cashed me out was super rude. I tipped 18% on the bill which also included my takeout. For a second, I thought I had done something wrong because he looked away and just rudely mumbled \"OK\" and threw the receipt at me and walked away. Nope, it was just him and his pompous attitude."}
{"text":"I go to this place one time per month....the food is ok..it's not the best in Chinatown,they offer the soup and the Chinese sweet soup free,this is the point I comme here...they make the Chinese dessert red bean soup,it's my favorite!!!"}
{"text":"Went there on Sept 3,2016.
Ordered the twin ginger and onion lobsters. It tasted fishy and it was not fresh. 
The Peking duck was the worst. It had a very nice pictured on the wall of a Peking dick at $36.99 + taxes. Do not expect a full duck. They give us a half a duck but charges for a full duck.
Nothing compares to the Chinese restaurants in Toronto. In Toronto the restaurants would show you the live lobsters and they sliced the Peking duck right in front of you. Over here, everything is done behind the closed kitchen. I would not be surprised they keep the goods parts for them shelves to eat.

Also, the white rice was very mushy. 

I would give them no stars because they should not be in business."}
{"text":"Late night eats. When everything else is closed this place is open so you can fill up. On our first night in Montreal, we stumbled upon this restaurant and jumped right in since we haven't eaten for the day. The menu is full of Cantonese favorites. We ordered some noodle soups and clams in black bean sauce. The wonton noodle soup was lackluster unfortunately, but the clams were fresh and flavorful. There's a full menu including hot pot, so there's something for everyone."}
{"text":"After a relatively late night and quite a few drinks I wanted to have some type of soup noodle before going to bed.  It was around 1:45AM by the time my cousin and I got back to Chinatown, which was where our hotel is located.

We tried to go to Keung which was nearby but that closes at 1:00AM.  Lucky for us Cuisine Cantonaise opened till 4:00AM.

We walked in and were seated immediately.  I was surprised to find it pretty busy but then again it was the only place open this late.

The menu has a few pages in English and French and then several pages at the end in Chinese.  Too bad my Chinese isn't good enough to order from that menu and the English/French list for soup noodles had maybe 5 options.

My cousin in his broken Cantonese asked the waiter what options of soup noodles they had.  He ordered a wonton noodle soup with wide flat noodles and I ordered the beef stew noodles.

I thought my dish was decent, of course full of MSG and the beef didn't have the chewy and skin parts that most beef stews have so that was slightly disappointing.  My cousin thought his wontons were too small.  And of course I responded with \"That's what she said.\"

Anyways, now to the real draw of the place.  It's an awesome people watching place at night apparently.  After sitting down for a bit and waiting for our food, 3 middle aged Chinese prostitutes came in with their pimp.  They had hot pot, so if you're craving late night hot pot you can get it here.

I watched the table of prostitutes closely cause it was really interesting.  2 guys came in to talk to them within a 10-15 minute span of time.  With the first guy, I had no idea what was going on and second well he talked to them and also the guy at the counter.  The guy at the counter apparently lost a lot of money on a race...

I know I totally went on a tangent but to sum it up.  The food is decent, there's a huge menu you can choose from if you can read Chinese, and there's awesome people watching at night!"}
{"text":"I brought a friend of mine here for his birthday, since he had never had a proper chinese food experience. I have come here twice before, and they were always so accommodating to my orders.  It is Cantonese in terms of styles of food, and like many chinese restaurants, they serve fast. 

The restaurant had many large round tables and is located upstairs, so if you blink you might miss it.  The decor looks like they could use some refreshing, for some reason when I go in there, I always feel like Im in the 90's.

We ordered 4 dishes to try and brought the rest home.  It was a bit different of an experience because I had a guest there that didn't like shrimp or tofu, and a few other things that were specified.

In the end we ordered a dish that was more newbie friendly such as their spring roll (imperial roll for the Montrèalais) and mixed veggies, then we got a Singapore Vermicelli, and a curry dish. It was tasty and delicious, but I would have liked to order stuff that was a bit more traditional. 

So till the next time!"}
{"text":"Hello again food lover, this time we will talk about Chinese Restaurant. Well The people that give this restaurant one star and two stars they do not show there face, I was wondering about that so, i said i will take the serious ones. 
The noise level is high but tolerable. 
I ordered Tilapia fish Cantonese style. Let me tell, it fresh out of the tank so equitant. Every one who complain agree on one thing food is good. I say excellent you will not forget it, provided I do not eat enough Chinese food. I really, impressed with food afraid to say in \"love with it\".
If you looking for change some time try it and let me know. You will not regret that one.
Hope you let me know was the food nice, Hot, Clean or not, despite the noise. very, very affordable, too."}
{"text":"2 and half stars

The decor was ugly, but that's usually a good sign when it comes to authentic Chinese food, right? I tried the dumpling soup, and while the broth was tasty, the dumplings were way too doughy. Pea sprouts were all right, a little tasteless. We also got the congee. Maybe it was our food selection but this place is definitely medicore at best. Suddenly the ugly decor didn't look so promising, it just looked drab. I think I'll just try the beijing restaurant next door next time I am in the area."}
{"text":"In NYC Chinatown we have a good ole tried and true restaurant called 69 (Bayard street) to go to for tasty post partying Chinese food. 

Based on a recent late night experience in Montréal, it sadly seems to be that their equivalent of 69 is a place with horrible service and bland food. 

The waiters here are very weird. Never mind that they were ridiculously (size 24 waist) skinny. They provide unfriendly service.  
I saw they have a separate menu for Vietnamese food.  I inquired about this to the waiter asking if they really served Vietnamese food and he tapped the menu in my hand in an annoyed way like some guy flicking an ant off his picnic table as if to say \"duh idiot. What's so weird about a Cantonese restaurant having a separate Viet food menu\"? 

The seafood pan fried noodle dish here tasted bland with mediocre seafood and noodles that were not very crispy but at least it came with a lot of veggies."}
{"text":"This i restaurant is ok when you are looking for chinese food after 10pm. Some stuff we ordered was ok most of it wasn't. I wouldn't go here if other options present itselves."}
{"text":"This is definitely a solid spot for dinner. Came on a weekend without reservations and was seated right away. 

The restaurant has an authentic Asian vibe to it. They have a really extensive menu - there's definitely something here for everyone. 

My group decided to get a couple of dishes and share - amongst them included shrimp chow mein, Bok Choi, sautéed shrimp, a fish dish and some others that were meat/chicken (so I couldn't try those). 

All the dishes were prepared quite swiftly and came to the table piping hot and sizzling. The shrimp was well cooked and the sauce was a nice. The noodles were a bit crunchy for my liking - this was the first time I've ever had crunchy noodles but it was an interesting experience. 

The ambience for this restaurant was very chill - everyone in my group enjoyed their experience here!"}
{"text":"I came here really often, mostly while being drunk or really tired after an 8-9 hour shift. They have hotpot at the restaurant, which comes in 3 different sizes I believe (small, medium, large). I usually went there with 2 other people, so we would always take the medium one, which was plenty for 3. For the hotpot, you can decide which meats or seafood you want, and it comes with tofu, veggies, noodles, and fish balls I believe. They have a really spicy sauce which I love, and the hotpot is feels really hearty, which is perfect for winter nights and for cleaning myself of the fatigue accumulated at work. In short, I really love their hotpot.
When I would be with more people, we would order from the main menu. I let my cantonese friends order for me, they never picked anything that was not good, and knew the waiters. So the waiters were really nice with us, and gave us an efficient service. 
Place is good for hanging out with friends, satisfy a 2-3AM craving for chinese food, or even have a meal with your family. Well deserved 4 star!"}
{"text":"I don't know if it was because that I am from Boston, and we have larger portions? But everything was definitely mediocre. Portions were probably HALF of what we would have got based off of Boston. Food took ages for it to come out. With the portions, definitely overpriced than what I was expecting. I've also never really seen several layers of plastic table covers before. When we sat down, the previously one seem rather dirty. Mistake for us to try this location, either that, or I am not used to the culture here."}
{"text":"Montreal Chinatown is mostly Toi-San cantonese people (my people!) and so when we went here at 1:30 in the morning and this was one of maybe 3 restaurants that was open.  Now...i'm from NYC.  I've been going to Chinatown's and eating late night dinners over and over again since the early 2000's, this is the food i remember from then.  

OK so i admit i was a little tipsy hanging out with my buddies grabbing a late night bite.  I got, the ever-so-important beef chow fun and it was cooked exactly as i remembered from my youth.  It wasn't revolutionary, actually it was only ok - but it was very nostalgic.

It's somewhere that everyone goes to at night if they're around chinatown and looking for a relatively cheap eat at night...so it's also a good place to look around and watch people (as someone else said).  If i'm partying kinda late and we were hungry we'd detour here to get some pretty good canto food.

Oh and if you want something off menu and you speak canto - they'll probably do it for you."}
{"text":"This place is located in the heart of Chinatown, the reason we decided to try it out was because we were asking around for a good chinese place and we happened to stubble upon the owner's daughter along with her friends. She told us the restaurant is good, and we believed her, simple as that!

The decor was bad and next to our table were the electrical wires that lit up the street sign, it was a little scary, because one move and you turn into the fried duck they were serving the table next to us.

Anyway, we were blown away by the food. seriously!! I got the beef and chinese broccoli and my friend got the spicy shrimp and scallops, and we got the fried rice. 
It was one the best chinese meals I had in a while now.

I will definitely come back when/if i am back in the beautiful city of Montréal."}
{"text":"Bonnes assiettes , free tea, busy place, my friend took poulet general tao and this classic dish its really good here."}
