{"text":"Let me summarize my review. I live in the building and I would rather drive somewhere than go to this place. I've eaten here twice. Once when I was so hung over I couldn't get anywhere and the other the day I moved in. The coffee is outright undrinkable. The only thing they have going for them is the fresh fruit is quite good. But I just don't understand why people eat here. St viateurs on monkland, grand cafe, shaika all super close and much much better. For the same price or less."}
{"text":"Decent breakfast place but a bit expensive. You get better value at Cora and you get better food at Cafe Orange. Still, if you're in the area and want to eat, it's not a bad choice."}
{"text":"I have been going to this place for about 4 years now, maybe around 2 times a month. I don't understand why there are bad yelp reviews because my experience with the place has always been pleasant. I love the decorations and the paintings there, it makes you feel warm and at home (a nice home kitchen feel). The waitresses do seem to change often but they are very nice and try to help as best they can. They owners; Gity and Moe are very kind, specially since they know me now as a regular client. My favorite plate, and one that I highly recommend, is the Eggs Benedict. They have the best hollandaise sauce you will ever taste in the Montreal area, maybe even ever. It's a good place for brunch."}
{"text":"I hate this joint. The only reason I continued to go when I lived above it was because the man who owns the restaurant was very sweet and personable. The woman is terrifying. She is short and aggressive and extremely unpleasant to deal with. The food is so gross and overpriced which is difficult for breakfast. I once ordered the chicken noodle soup and was so put off my the colour and smell that I didn't even taste it. A friend of mine waitressed there briefly and the woman who owns it withheld all the servers tips and gave them the portion she felt they deserved. I boycotted it after hearing that."}
{"text":"Ordered a bagel & cream cheese with coffee. The bagel crumbled when I took a bite and they charged me for a second cu of coffee. This tells me that the bagel isn't fresh and what happened to bottomless cup of coffee?"}
{"text":"Alright, so we came here because it was in my old neighborhood and I always saw the place packed with hipsters on weekends. And if hipsters know anything about anything, it's brunch.

My husband and I went in on a Tuesday, late morning. Our waitress was brand spankin' new, so she didn't have the answer to a lot of our questions right off the bat, but that's okay. She checked to see if they had soy or almond milk (they had neither) and she didn't make it a big deal when we moved ourselves inside, since our spot on the patio was a little breezy.

The coffee was decent enough that I drank it black (though it takes a really bad cup of coffee to keep me from drinking it altogether), but the real deal-maker was The Elvis - French toast, slathered with peanut butter, and topped with sliced banana and five pieces of perfectly-cooked bacon. The owner (I think?) took our food order and joked that if we didn't want to pay, we could sing some Elvis tunes instead (lucky for him it was an exhausting couple of days and I couldn't think of any Elvis lyrics that early in the day). We also got the fruit plate, which was huge and had a good variety of ripe fruit - melons, berries, grapes, citrus, etc. - but it was topped with powdered sugar, which I would definitely skip next time.

The decor was kitschy, with pages from an Elvis cookbook framed and hung on the walls, and when you're finished you just walk up to the cash and pay. Oh, and no credit cards - debit and cash only!"}
{"text":"My boyfriend bought me here. Told me that it was his old hangout place. Got in, and the lady was nice, pancake was amazing too."}
{"text":"I love the character of this breakfast spot!  Right at the corner of Sherbrooke and Oxford.  To me I can't compare a restaurant like this to large chains, I much prefer a small independent.  I agree that portions size at some of the chains is bigger, but I know personally, I could use a smaller portion size anyways!!  

I didn't have anything fancy here, just a cheese omelet, but I was cooked just right!  Real cheddar melted in nicely and the eggs not over cooked, (as a lot of places do in my opinion).

I sort of wished I had ordered the fruit filled pancakes after I was someone else with them, (and they sure seemed to love them!)...next time!    

I will definitely be back as I love to support the places that have been around for so long and keep ticking!  I know in the summer you can sit outside as well..."}
{"text":"I agree with what others have said: it's a shame it's not better because it's such a cute place.  Sadly it's also expensive with less-than-alright food, and slow service. Went once, but never again."}
{"text":"I've been living in Toronto for the past two years which means, I've been desperately craving Oxford Cafe's pancakes for the last TWO YEARS. It's been tough, but the time I've spent apart from this cute little breakfast spot, made my brunch date there SO much better.

If you plan on going in there to have anything but their pancakes, you're wasting your time. I'm going to be an angel and let you know exactly what you have to do should you venture out to NDG one lovely morning or afternoon. Walk in, wait to be seated, don't take anything personally because the owners can be a little aggressive, and kindly order one chocolate chip pancake with a side of your choice. My best friend and I used to go religiously so we finally found the key to the perfect order. One pancake and a side of your choice is enough to keep you going until dinner while not feeling disgusting. 

Please remember, you are NOT going there for the service. They are pretty slow, rude to their staff and very abrupt with customers. Is it weird that I desperately want them to love me? Don't judge.

Anyway, I highly suggest giving this little cafe a try if you're in the area or REALLY craving a solid pancake. 

Oh! And, I dare you to try and ask the owner if she'll share her recipe. You'll definitely get an entertaining answer."}
{"text":"I didn't find it that bad, but it certainly wasn't good. It's a shame this place doesn't live up, because it's a neat-looking little diner in a great location. Service was typical Montreal aloof, food was not worth the time. Do yourself a favor and go to Cosmos down the street, or anywhere else at all really."}
{"text":"The man-friend brought me here telling me to keep my expectations low. The menu was reasonable in offerings and price. The food itself was ok, minus the fact that my eggs benedict's hollandaise was less hollandaise and more spiced nacho sauce. Had I been in a lesser mood it would have been sent back but I wasn't hangry yet. The owner herself somewhat won me over. My tea might have been about $5 but I got a pot to myself that was delicious and had fresh raspberries in it. Our meals also came with a mini heartshaped pancake each as they were gearing up for valentine's day."}
{"text":"This is by far the best breakfast place in Montreal. The service was great, the portions big and the food was amazing. I had first ordered from here on foodora and it was so good I decided to stop by. I was not disappointed! We had breakfast for supper to treat my 5 year old's good report card, and she loved it, plus the kids meal is only 5$. I think we found our new favourite place!"}
{"text":"I tried this NDG joint for the first time not too long ago and was very disappointed. First off, it's about 45 degrees celsius in there and feels cramped, not very comfortable. Between the young waitress and the two running the place, no one could get our orders right. My boyfriend asked for his english muffins on the side. They came completely soaked in the egg Benedict he ordered. The waitress asked me what kind of toast I wanted with my breakfast, it never came. I asked for a side of a fruit salad. The owner came over to my table twice to scold me about my menu choices and figure out my order. The breakfast potatoes were flavourless and the maple syrup (to go with my pancake) was an extra charge...really? We won't be going back."}
{"text":"Aside from the dirt, dust, grease and overall sticky feel in the place, the food, which used to be half decent, was despicable.  Even the one pancake my 8 year old daughter ordered, wasn't good.  It arrived ice cold.  When returned, they heated it up and sent it back to us all cut up, as it was sent to them.  How about remaking a fresh, hot pancake, which costs all of .25 cents worth of batter?  The special pork chop lunch, which I was foolish enough to order, was revolting.  And that's being kind.  Two, 1/8-inch thick pork chops, which together didn't equal one normal one, were pathetic.  I have no idea how they were not embarrassed to serve them.  3/4 of the chop was fat, the other 1/4 was inedible.  Stringy, tough and previously frozen, my dog would have turned them away.  Actually, I wouldn't have been cruel enough to serve them to my dog.  Worse still, was that I asked if the french fries were fresh or frozen, as I always do prior to ordering frites, and when told fresh cut, I ordered them.  Straight out lie.  Not only were they frozen, they were frozen and reheated.  Worst ever.  No kidding.  And the most disgraceful part of all, is that when I truthfully let the owner know upon checkout, since he asked, he had nothing to say, nothing to offer, nothing to do and nothing to redeem himself with.  He just acted so surprised and dumbfounded.  Said he would check the pork now.  I told him it was too late.  He should have checked it before he served it.  I would have provided ZERO stars if there were such an option.  Please do yourself a favor, and stay away.  Save your money.  And your stomach!"}
{"text":"Le service était très désagréable. Nous étions 4 dont une amie en retard de 20 minutes est le restaurant a voulu nous virer car on commandait pas à manger. Si la file d'attente aurait été grande ce jour là nous aurions pu comprendre mais c'était pas du tout le cas. Finalement, nous avons quand même manger chez eux, heureusement que les plats étaient tout de même bons."}
{"text":"Decent breakfast, terrible ownership.  I've eaten here a few times and there is always some 'issue' with the owners (myself or neighbouring tables) This morning it was about false advertising of 'coffee included'. A group near me argued they were charged for coffee when the sign outside clearly says it's included. The owner proceeded to say she can do anything she wants and that they were cheap.  GREAT customer service.  Too bad.  This place could be good.  Too much drama to be coming back here."}
{"text":"I just had the best Egg Benedict with Salmon ever, and I really regret not coming here everyday since I had arrived in Montréal. It's a cozy place with friendly waitress and guaranteed excellent breakfasts."}
{"text":"Nous avons eu exellent service et la bouffe tres bonne, j'aime la petite terrasse incliné en avant les étés avec arbres et soleil. Les prix correct sauf que le special salade poulet cesar à 7,95$ est une entrée et ne pas un plat principal, c'etait pas clair ;)"}
