{"text":"Food: 4/5
Service: 4/5
Atmosphere: 4.5/5
Cleanliness: 4.5/5
Price: $$$$

The words 'affordable' and 'tasting menu' don't really go together, but I think Restaurant Bonaparte in Old Montréal is one that fits the description! It's one of the highest rated restaurants for French cuisine in the city, and rightfully so. Hubby and I visited the restaurant last year, but I think our tasting menu experience is worth reading because the menu doesn't seem to have changed much on their website.

I ordered a glass of white wine to have along with my tasting menu, though I don't remember which one I ordered.
A complimentary bread was given also, filled with an assortment baguettes and other French breads.

 I decided to try their lobster bisque for my first course while my husband decided to try the salad. The soup was delicious, and I would've loved to order it separately on another occasion upon available. Portion sizes were also pretty good, not too small but not so large leaving me with no room for the next course.

For our second course, I chose the duck foie gras creme brûlée while my husband chose the smoked salmon dish. Both were equally good, but I thought that my dish was more creative therefore more unique. I love trying unique dishes whenever I try a tasting menu; trying duck foie gras was unique to begin with because usually foie gras is from geese, not duck. To be honest, I couldn't tell a big difference, especially because it was made into a creme brûlée. I guess using duck foie gras kept the price of the tasting menu in check, bringing down the price overall and making it more affordable.
Hubby's smoked salmon was great, but he preferred my dish over his. The truffle oil was a nice touch, but if you know truffle, you'd know that there isn't actually any truffle in truffle oil, just the scent. Anyway, it was still good nonetheless, especially with the smoked salmon, but we would prefer to order the duck foie gras creme brûlée over the smoked salmon if you eat foie gras.

Our next course was nice, but to be honest not the most memorable. It was good - definitely not bad, but nothing particular really stood out to us in either of the dishes.

Our fourth course was a breather, one where our palates were refreshed and reset for the upcoming main course. The sorbet was really light and  delicious! Though I haven't had much tarragon before, the herb was well balanced with the sweetness of the pear.

The real highlight of the night was the rack of lamb presented for our fifth and main course. Hubby chose to have the beef filet mignon which was just as good, but the roasted rack of lamb that I had was so much better. The port wine 'jus' was so incredibly delicious! We highly recommend that you order the rack of lamb as well if you like lamb. The gamey smell of lamb is nonexistent and the meat was so tender and juicy. The portions of the lamb weren't too bad for a tasting meal either.

To end off our tasting menu and date night, we were served an assortment of desserts for our last course. We were also offered some tea or coffee which we delightedly enjoyed. I always get peppermint tea whenever I can after a large meal which I think helps soothe me and my bloated stomach. The desserts weren't too creative but delicious nonetheless.

If you're looking for a place to take your significant other on a romantic dinner, I highly recommend Bonaparte and their tasting menu! Though there are numerous romantic restaurants in Old Montreal, Bonaparte outdone themselves with the quality of their tasting menu while keeping the price tag relatively affordable for a tasting menu. A quick google search of Bonaparte gives you endless 5 star ratings of the restaurant, and for good reason! I would revisit Bonaparte in a heartbeat and order their tasting menu again because I enjoyed it that much."}
{"text":"Great choice for a French restaurant in the old town - was recommended to us and did not disappoint.
Service was top notch - great wine recommendations as well as appetizer choices.
We started off with the French Onion Soup and Mushroom Ravioli.  The soup tasted very fresh with loads of onions.  The hit was the Ravioli - the pasta was extremely delicate and the mushroom flavor was awesome.....great combination!
For dinner - we ordered the Seafood Linguine with a Lobster Creme Sauce (very nice lobster sauce with large shrimp and chunks of salmon and white fish) and Filet (cooked perfectly and extremely tender).
For desert - blueberry cheesecake which was a great way to close out the meal.
Very enjoyable evening with the meal not rushed at all."}
{"text":"This place is simply not worth the price. One of us had the tuna steak from the a la carte menu while the other had the prix fixe menu. The prix fixe was vegetable soup, steak and chocolate mousse. The food just isn't good. The steak is average at best, while the tuna tasted cheap and poorly prepared. 

The worst part is that both entrees - one prix fixe, the other a la carte, both came with the same exact sides (see images). Grilled vegetables and squash. Where is the creativity? Or even the simple acknowledgement that different entrees (meat vs fish) need different accompaniments? Ultimately feels like lazy, bad food for $45+ without even getting a drink. 

Cocktails on the menu, while not tried, looked very standard. Why even put an Old Fashioned that follows the basic recipe to a tee on the menu? Again, why pay a premium for basics?

The service was the silver lining, which was fantastic. The waitstaff are attentive and hospitable. The decor is nice in the classic restaurant (read: not trendy) sense. 

Do better, support a harder working chef, get what you pay for. Go elsewhere."}
{"text":"Very good option for a higher end fare and atmosphere, and if you want something a bit romantic, but not overly stuffy, and not great but decent sized portions.  Excellent wine menu and service was fairly fast."}
{"text":"This is French cooking by the numbers. It's ordinary, predictable, unremarkable, and uninteresting. At half the price I would not complain, but for the prices they charge, I expected at least \"very good\"."}
{"text":"Real deal indeed. Great food and especially atmo. Very subdued and relaxing air and lighting. The premium seats are right near the large above the street windows where you can observe occasional passers-by, a weirdo parking their car right in middle of street or a couple stopping having decided to kiss

Food is amazing. I had a tasty plate of scallops - very minimalistic, but perfect for late night not to over eat."}
{"text":"I have been to Restaurant Bonaparte several times, but as I am new to Yelp I am now writing a review of this, one of my favorite restaurants in Montreal, for the first time. My recent visit was on July 17th, when a small group of 9 of us went there to celebrate a birthday.  In fact, all of us had been there before, most often to celebrate the birthday of the same person we were celebrating this time. We were not looking for surprises, just for good food and a lovely evening, and we were not disappointed.

I have given the Bonaparte five stars because everybody in our party was very happy with their meals and with the wine.  However, I do hesitate about the five stars for one reason: this menu has almost nothing for vegetarians.  There are just a few choices among the starters that have no meat, and nothing is appropriate for vegans. I ordered their salad of mixed greens despite the grated parmesan on it, and it was excellent.  For my main dish I had a dinner-sized portion of their one vegetarian appetizer, the mushroom ravioli. They also gave me some vegetables with it to make it into a main dish.  This is in fact what I have every time I go to the Bonaparte, and knowing that it is the only thing on the menu for me does not stop me from going back.  It is delicious.  Most of the rest of the people in my party had the rack of lamb, again knowing in advance from past experience that they would like it (we must not be an adventurous lot).

The other thing I look forward to when I go to the Bonaparte is their lime meringue pie.  I order it right away because I do not want to take any chances that there be none left when I am ready for dessert, although they always assure me that they will not run out.  Most of the rest of our party also indulged in the lime pie.  Yum!

The atmosphere at the Bonaparte is very pleasant, the waiters are attentive, and the noise level is about average.  Some little corners or nooks in the restaurant are especially pleasant for a party of two or three.  Now, if they would just add some vegetarian options to their menu, they would be perfect!"}
{"text":"We went here for the dinner after our small wedding.  The food was excellent quality - not quite what you can get in France but as good as it gets in North America.  The service was topnotch, our wine glasses were always full, courses were well timed so there was no rush to get through the dinner and we could enjoy the beautiful atmosphere and each other's company.  

I will say that we had no success in communicating with the restaurant in advance of our wedding.  We went in person once to discuss our options at which time the manager was very helpful and offered us several ways to customize the experience for our guests.  However, when we tried to follow up by phone and email we never managed to catch a person and no one returned our messages.  There was a mishap with our cake delivery, which we ordered from a local patisserie and which was never delivered.  The Bonaparte was informed to expect our cake delivery and didn't notify us in the morning that it never arrived.  While this is primarily the fault of the patisserie, the Bonaparte acknowledged their own small responsibility in this and made it up to us by serving one of their own cakes at no charge.

Overall, an excellent fine dining experience with exemplary service."}
{"text":"For this level of dining, we were quite impressed with the quality of the food but certainly not with the service. From beginning to end, it seemed to get worse. We ordered 3 Table D'Hote meals and one seafood linguine and wine. Portions were a good size, well plated, and flavorful.  I would certainly recommend visiting for the food; we didn't have one bad bite. 

As for service, they never cleared our bread plates, my husband asked for water refills 3 times after waiting to see if it would be refilled, our food was delivered to the wrong person at the table with every single course-- we had to call that out and wait for someone to go back to the to get a towel to move our entree plates because they were too warm. We were never offered the coffee or tea with dessert (I had to flag someone down to explicitly ask after our dessert was already delivered).  I asked our server which of two wines he would recommend with my meal and he completely did not know. I ended up picking myself based only on the type of wine itself. Our dessert was delivered almost 30 minutes after our last plates were cleared. And this was just the basics and not what we expected for this level of dining (didn't clear crumbs from table, clear the silverware properly with courses, etc.).  A table behind us was left waiting for a long time and were delivered the wrong bottle of wine, which had to be sent back. 

Our meal took well over 2 hours. I left a tip representative of the service I felt we received, and the server saw and gave us a  complete cold shoulder as we left. Not a single staff member acknowledged us as we left the restaurant.  Great meal, really underwhelming service."}
{"text":"Great meal - rack of lamb, peppercorn and cognac filet, mushroom ravioli, scallops, amazing vanilla cream lobster. Great service..."}
{"text":"So many options.  In addition to the a la carte option, there are also 3 different price fix options.  3 course ($33), 5 course ($52), and 6 course ($68).   The whole party does not need to choose the same thing so 2 of us did the 3 course and the other 2 did the 5 course.

The 5 course.  I started off with the vegetable soup which looked more like split pea soup?  It was very refreshing, tasty, w/o being too salty or creamy. Next up was shrimp ravioli which was pretty tasty and definitely unique in flavor.  After that was a palate cleanser (pear sorbet?).  Then the filet mignon which I thought was super delicious.  It was cooked perfectly to my liking and the sauce was just right.. not too overpowering.  Dessert was a trio of cakes and a mini creme brulee.

Overall, I enjoyed my meal.  It wasn't the best french food I've ever had but I certainly wasn't disappointed either?  That being said, with the many food options in Montreal I probably wouldn't return."}
{"text":"Went here with a group of 16 and found the food and service very good, despite our numbers! Everyone enjoyed what they  ordered and prices don't need to be expensive if you order from the table d'hôte which had some great selections. Would plan a return visit if in the area or reccomend it others looking for great dining experience."}
{"text":"Excellent service, bonne cuisine (bien que le canard soit un peu coriace, mais le filet mignon est incroyable!). Clientèle un peu âgée, mais ça n'enlève rien au restaurant.  Si vous aimez la cuisine française classique, vous ne pouvez pas vous tromper avec le Bonaparre."}
{"text":"One look at the menu was all we needed to give Bonaparte a try. We didn't look at Yelp before going, rather we trusted a couple walking past on the sidewalk who told us they had been in town for 1 week and had already eaten at Bonaparte twice. Sounded like a ringing endorsement.

I expected excellent service and got it. I expected delicious food and got that too. What I did not expect -- and was pleasantly surprised by -- was the satisfactory portion sizes. We did not leave hungry.  The soup, the duck, the foie gras, and the deserts were all delicious.

I don't know when I'll be back in Montreal, but the Bonaparte will certainly be on my itinerary when I am."}
{"text":"Great looking place, great ambience but food very disappointing. Read all the reviews raving about the food, for a top restaurant the food is not more then OK minus. Had the fois gras to start meh pretty dull taste. main was the scallops it was fresh but again very dull taste pretty boring meals. presentation is nice though. truth is, i will not go there for dinner again."}
{"text":"We had an extraordinary meal at Bonaparte. The menu for their 30th anniversary included two degustation alternatives. We tried both. Chef paid homage to Napoleon by recreating a 1809 dinner, richly prepared for the emperor. A brilliant idea and delicious too.  The event of these great meals was well paced and the pairing of wine were delightful. If you time and budget, be sure to try Bonaparte."}
{"text":"I went here to finish off my Montreal trip and it certainly finished with a bang at Bonaparte! I felt like I was enjoying authentic French cuisine in a high class environment. Mushroom ravioli, the duck, my friend's sirloin steak, and cheesecake are the things I had that I would say are worth the price of admission. Some people may consider it to be pricey but for what you get and comparing to restaurants of this calibre, it's worth it and right in line.

Our service was prompt and on top of things. The waiter was even there to clean up the mess I had made with the pepper shaker.

Overall, I would definitely recommend this place to people especially those looking to enjoy a fancy, classy dining experience and feel pampered."}
{"text":"Tres tres bon restaurant dans le Vieux Montreal. Service tres profesionnel. Decor tres agreable. Menu degustation de 5 et 7 services super bon qualite/prix. Tout ce que j'ai manger etait vraiment bon. Le meilleur filet mignon que j'ai manger a Montreal. Attention particuliere pour les desserts incroyables.. Je retournerai definitivement dans un avenir raproche."}
{"text":"Auberge Bonaparte is an inn that houses a cosy, upscale French restaurant in the heart of Old Montreal.  I don't remember the specifics of who ordered what but the entire experience was subpar.  We had 9 people in our party and they must have created a large table in the back hallway that led to the kitchen.  It was totally uncomfortable with the traffic of the waitstaff rushing back and forth, brushing against the backs of our chairs.

My sometimes-foodie father hated his dish and the way it was prepared and overcooked.  There was not much thought put into the presentation or the plating of each dish.  For the money that this meal cost, we were all expecting a whole lot more."}
{"text":"Great staff. I was taken aback by their friendliness. It's amazing what a few simple get-to-know-you questions do to make you feel comfortable. The food was above and beyond, and the seat by the window was the best. Unfortunately, a loud couple of college girls came and sat next to us, derailing an otherwise quiet and perfect evening. But we just laughed it off, and figure they must be from the USA...like us."}
{"text":"We were here for the 2nd time. As before, the service was fantastic and the food terrific. This time however, we were seated in a room with an office holiday gathering and 2 large groups. It was so damn loud in there my wife and I literally had to to ask each other \"What?\" repeatedly because we could not hear one another. That's fine at a happy hour in a local bistro, but not at this kind of place. 

Frankly, it ruined our evening. I know the restaurant is between a rock and a hard place - it's tough to \"shush\" patrons, but they could have moved us or bought us an aperitif or two to help promote forgetfulness of the experience!

Oh well, maybe it's time to try another fine dining establishment on our next visit."}
{"text":"I can't say enough good things about both the hotel and the restaurant parts of Bonaparte. My parents and I walked into the hotel without a reservation on a Sunday evening. The staff was extremely friendly and accomodating, and was able to provide us with a beautiful room for slightly less than other hotels that are rated $$ on yelp. We didn't spend much time in the room, but it was absolutely lovely -- a double and a queen bed, double jacuzzi tub, clean, quiet, and with a view of the back of the Notre-Dame Basilica! The room rate also included breakfast at Bonaparte Restaurant -- the French Toast, made with French bread from the previous night's dinner service was out of this world. There was also parking available for a small fee ($10?), free wi-fi, and a computer and printer for guests in the lounge.

We also ate dinner at Bonaparte restaurant, and loved it. My dad and I are big foodies, while my mom has pretty simple tastes, and we all agreed it was one of the best meals we'd ever had. Recommendations: The lobster special w/ vanilla-muscat sauce sounded like it would be too sweet, but was perfect. The mushroom ravioli was exquisite, with paper-thin pasta encasing an amazingly complex mushroom filling. And the fois gras duo was perfect fois... need I say more? The steak tartare was huge, and in my opinion a little overseasoned, but that may just have been because it was my third course, and I was approaching saturation by that point. 

By far the best feature of both the hotel and restaurant was the service, which was unobtrusive but amazingly considerate. Examples: my dad mentioned that we were celebrating my graduation from grad school, and the server brought me a complementary little bottle of ice cider that paired perfectly with my fois. (And a pen from the restaurant, which was a cute touch.) Even better, I went down to the lounge to read at about 11:30 pm. I was worried that since it was so late, they might be closing up. But I sat down in the empty lounge and started reading... within 5 minutes, the music had been changed to a soft instrumental track, candles were lit on all the tables, the fireplace was turned on, and the waiter from dinner appeared to offer me \"something to help me read.\" Amazing, and totally exemplary of the entire experience at Bonaparte -- the staff didn't just make sure we had a nice time, but obviously enjoyed our enjoyment of the whole weekend. I could live there."}
{"text":"If I was forced to complain about Auberge Bonaparte I would be hard pressed to come up with something. 

My friend and I were staying at the hotel and breakfast is included with the room. I have stayed in many hotels that include breakfast and have come to expect free breakfast = mediocre food at best. Not here! To start we each had the fruit cup....which was lovely. Then I had the French toast. Outstanding in every respect. The crusty French bread, the hint of orange (Grand Marnier?), tiny side of whipped cream, real maple syrup, all cooked to perfection. But wait! There's more! As part of the breakfast menu you can opt for a croissant or other bread. I don't remember the other bread options, once they said croissant I was sold. Also in the bread basket are two mini muffins. I did not have the muffin as I was totally full. My friend ate one and she reports the muffin was excellent. Just to round things out, the breakfast includes orange juice and coffee/tea. 

I hope I have conveyed my appreciation of the food. (So good I ordered the same thing on back-to-back days.). I would also like to mention the setting is lovely. It didn't hurt sitting at the window overlooking the street and quaint older buildings. And finally, the wait staff was truly outstanding. I am sorry not to call out specific people but everyone was great. 

As I mentioned breakfast was included with the hotel room. However, for walk-ins it is $15. Easily worth that if I were staying elsewhere. Overall a great dining experience."}
{"text":"Excellent meal, excellent service, I highly recommend as the entire experience was terrific. My only complaint is they don't serve fresh whipped cream with their soufflés, but easily remedied by requesting it."}
{"text":"with reservations we were immediately ushered to a window seat overlooking the quaint street, best seat in the house, IMO. service was impeccable; dim lighting, exotic flower floating in a votive, quite chit-chat makes this an A+ date spot if you're looking to impress someone or celebrating a special occasion. we had the 5-course, autumn menu tasting & it was very good; I'd have enjoyed 1 or 2  more main-dish options (i struggled w/ my selection b/c i wasn't thrilled with anything), that said, everything was very good. we were there for 2+ hours, not that they were slow, it was just a very relaxed pace & we enjoyed a bottle of wine. 

We had a lovely time!"}
{"text":"Boutique Hotel in Vieux-Montreal - We love staying in Vieux-Montreal and this hotel is in an excellent location, close to the Vieux-Port (wonderful waterfront park/promenade) and about a 10 minute walk to Place Jacques-Cartier (cafes and street performers).  The room was large and beautifully decorated but the highlight was the delicious gourmet breakfast (included in the room rate) served in their charming restaurant."}
{"text":"Our meal was the highlight of our weekend trip to Montreal. Our server was amazing, as was the food quality and presentation. Wonderful atmosphere. We opted for the tasting menu which we thoroughly enjoyed. We last visited this restaurant 13 years ago and it was good as we remembered!"}
{"text":"I had the opportunity to try this restaurant because of it's excellent location. 
Situated in the old port, we decided to stop in for dinner one night as we were in the area. Although we did not have a reservation, they were very kind to accommodate us.  
The service was above par as the staff was kind and professional and provided excellent recommendations. 
The food was exquisite, cooked to perfection. Save room for desert. The best creme brûlée I have ever had was at this restaurant. 

Definitely a must try if you are visiting Montreal or if you just happen to be in the area. I will definitely be coming back!"}
{"text":"My husband and I honeymooned in Montreal and saved this for our one fancy dinner of the week because of the recommendations we received on Yelp.  

First off- the food was amazing.  We are not foodies but everything on our plates was just excellent.  Their menu is extensive and their prices are not ridiculous and I felt like we really got our monies worth. We were seated the moment we walked in the door, even early for our reservation, and the service was great until...

...the power went out.  Totally not their fault- the entire city grid was out due to some unknown problem.  But that was when their service pretty much ended.  They left us in the dark (literally) for at least 30 minutes.  While the restaurant across the street already put candles on all the tables, we went without.  We had no idea what was happening or what that would mean for the rest of our meal (we were halfway through our entree at the time of the outage).  When they did come back to our table, they acted like nothing that happened.  I can appreciate the stress they were under and know that it is not easy to deal with that, but it would have been nice to be checked on a little more and explained what was happening while we were sitting in almost pitched darkness. The manager brought over a candle and even mentioned the fact that it was our honeymoon, but never offered anything to help with the fact that our dinner was cut short and we were left sitting in an un-air conditioned building in 80 degree weather.  There were a few additional missteps along the way (our bill was incorrect but was fixed, etc), but even with all that, it still was the best meal we've ever had.  I'd give it 4.5 stars if I could."}
{"text":"It was an anniversary dinner. We came all the way from NYC to celebrate in Montreal. Old Montreal is an amazing place. The food was excellent. We loved every dish. If you want to have a special dinner or nice date , it's a place to go to."}
{"text":"We have been coming to the Bonaparte Restaurant from Vancouver for over 20 years.  We recently had an amazing evening there.  The service was impeccable and the servers were very friendly.  The filet mignon was cooked to perfection and melted in our mouths.  The cheese plate and chocolate mousse were both excellent!  Will be back again!"}
{"text":"Bonaparte gave us a wonderful dining experience in Old Montreal."}
{"text":"Firstly, as a generic tip, I think it's always wise to take reviews from tourists with a grain of salt (as opposed to reviews by locals). Tourists from countries that lack the French charm that Montreal has to offer are so starry-eyed by the restaurants near the old port that pretty much every restaurant gets a five-star (I'm sure the wine, and the fact that one is on vacation also add to the feel-good all around). 

Montrealers, on the other hand, are used to good food, and consider anything that doesn't match up to the high standards not worth it, especially if you're spending a fortune for your food. In this regard, we really didn't think that Bonaparte deserves more than one star. The food was average, our server kept forgetting our request for a wine list, and for menus, and was, on the whole, most unhelpful (although profoundly apologetic for her clumsiness). The ambience is good, but if your looking for a delicious French meal, there are many better options in the city (Try Entrepont, an exponentially better experience, or Le P'tit Plateau, or Toroli if you like to try fusion French food).

Overall, not worth the price at all."}
{"text":"This is my first 5-star review of a restaurant, but it's well deserved.  My wife and I planned to be in town.  So I did some research in advance to decide which 2 places we were going to try.  We picked Bonaparte and Europea, which I just reviewed.  The reservation was easily made online, and it was for a Friday evening sitting.  Remarkably, the place was not full.  But perhaps that was because Canadians were celebrating Canada Day the day before and extending into the weekend.

We were placed by a window looking out onto the street.  It was a great spot.  The staff were also very attentive, which always goes a long way with me.

To start, I had the duck foie gras creme brulee, which I completely devoured and cleaned my ramekin using morsels of bread.  Despite it being duck foie gras, it still tasted great and I enjoyed every bit.  My wife had the lobster salad, which also tasted great.  The lobster was cooked to perfection.

For the entrees, I had the lobster stew which I admittedly also devoured completely.  Perhaps I was hungrier than usual that evening, but the lobster was again cooked to perfection.  There was also a lot of lobster.  But my favorite part was the sauce that had the vanilla and muscat wine.  Like the creme brulee, I used morsels of bread to clean the plate.

My wife had the sauteed scallops with truffle oil and mushrooms.  My couple of bites of the dish had me wanting more.

Overall, this was a fantastic place to try and I'm glad we did.  Similar to my comment in my review of Europea, we skipped the prix fixe menus in order to try some of the dishes that we absolutely wanted."}
{"text":"This restaurant was recommended by the concierge at my hotel.

Had the 30.95 prie fixe menu and I must say this is the best deal in town for what you get.

This was a 3 coarse meal, included coffee.

And then I added wine by the glass.

The food was amazing.  For the appetizer I had the rabbit tarte, entree was the trout, and dessert was the chocolate moose.

The sauces were amazing.

I will be back to try one of the larger prie fixe menus."}
{"text":"We were in town for one Saturday night and walked around the area hoping to find a place for dinner. We stepped in Bonaparte and felt embarrassed by being underdressed. However they still accommodated us for a table for 2 in this busy evening. 

When we were looking at the menu prices, we thought it was all about the nice decor. Once we started our meal, we immediately realized knew that the quality & presentation worth such prices.

I had soup of the day (red vegetable soup) and a lobster salad. The soup was great, though I would appreciate a tiny tad more of flavor enhancement (maybe some herb?). The lobster salad with hazelnut oil and maple syrup was delicious! Every element on the plate tasted so fresh and harmonious with each other. Nothing is overpowering another. The oil and syrup were lightly but thoroughly applied, leaving no greasy texture but beautiful scent in your mouth. The lobster meat was also nicely poached with nice fresh texture.

My husband ordered the 3 courses meal with brushetta, milk-fed calf steak, and chocolate mousse. The brushetta was nicely plated. The milk-fed calf steak was excellent. It was tender and juicy. You can really taste the milky diet when tasting the meat. However my husband would appreciate the intensity of peppercorn sauce was too much and not necessary. It would be perfect if the pepper was reduced. We ended the evening with delicious chocolate mousse and a cup of tea. 

We enjoyed our meals and the overall experience."}
{"text":"We stopped by and though we have not had a reservation a friendly maitre, promptly seated us. The food is truly delicious. Incredible cocktails, fresh bread and most importantly the dishes, executed impeccably. Our duck was delicious. Scallops though only 3 of them on the plate, were really good. The soup , the salad tasted fresh, prepared and presented really nice. Dessert and foie gras reminded us that we are indeed in Montreal.
The service on the other hand was a total disaster. Our waitress did not bother to explain menu to us at all. After she took our orders, she disappeared completely. Even though my wife mentioned that we would like some wine with our main courses, she did not even bothered for once to stop by and ask if we like our food or if we need anything. She was running around like maniac without stopping. I guess she just did not like us. This restaurant serves souffles. Is does require 18 minutes of wait and in our humble experience, in restaurants that do serve souffle, waiters tell about it, so people can preorder instead of waiting, especially with two tired children. So no souffle for us. No questions about after dinner drinks. One would think that if tip is calculated based on the check, the waiter would at least try to offer some options even if not make our experience more pleasant but to make the  tip bigger. I guess that waiter was working for fun.
We really enjoyed our food. It was great and the chef should be  kissed nightly. But if you take a great picture and hang it on the meat hooks instead of the frame, the perception is really mixed."}
{"text":"Options , options , options... many options.  ...la carte option, ...different or fixed price options.  Try their veggie soup very savory.  My friend had the shrimp ravioli which I snuck in my mouth when she wasn't looking.  Try a cow...Then the filet mignon which I thought was super delicious.  Overall, I enjoyed my meal.  Will return."}
{"text":"Very solid restaurant but could use improvement in meal execution of a couple of dishes, coffee brewing, and especially service. Wait time between courses sometimes seemed forever. Although after one lengthy period the wait was redeemed by the best execution of the entire evening. The rack of lamb accompanied by ratatouille was a difficult to dish to execute, requiring multiple cooking techniques and times, but it came out near perfect. Each element seemed to be at the perfect temperature and taste. The mushroom ravioli was a great dish as well. Would like to go back again to better service though."}
{"text":"Elegant restaurant with superb service.  We each had the $78 (Can) tasting meal. 6 courses. One of the appetizers, foie gras creme brûlée was a little weird. Look like a little cup of regular crème brûlée, with the sweet crusted topping. However, The creamy interior had a very very faint taste of liver. Did not care for the dish. It was accompanied by a brown sweet ginger bread. My partner, however, did like this dish. The other appetizer parenthesis one scallop) was tasty, but not outstanding. My partner had the shrimp, and was blessed with two pieces parenthesis (LOL). My partner had the duck entrée and I had the fillet mignon. Both were OK but not outstanding. For dessert, they gave us a tray of assorted cakes. The wine was reasonable for the restaurant: $39 (Can) for French Chardonnay. On balance, it was a lovely experience for both of us. A romantic place for a special dinner. But, I've had better French food."}
{"text":"??????????????????????????????????41.95/???????115?????????

??????????????????????????????????????????????????????????????????????????????????????????"}
{"text":"In the middle of Old Montreal, this place has wonderful French food. I had a 7-course meal (from what I remember) and each dish was delicious. Dishes were plated really nicely. Each dish did not contain huge portions, but was perfect to be able to taste everything and yet be very filling. A bit on the expensive side ($70) but the small quiet place with excellent service made it a worthwhile eat."}
{"text":"A perfectly lovely space!  We had dinner at the small bar because we were too late to get a table reservation, and it was beyond delicious and so much fun!!!  Bartender Max was a cocktail master and extremely charming, as was all of the staff who treated us with smiles and warmth as they scurried through a very busy Saturday night.  The menu was filled with unique and appealing options--neither boringly \"old school\" nor unnecessarily adventurous--and we had the best time trying various dishes at a leisurely pace, and meeting some lovely people.  Will most definitely return next time we're in Montreal."}
{"text":"The meal was excellent. Unfortunately the service was not. Let me explain... I ordered a glass of Pinot noir with my duck. When it arrived I took a sip and noticed a small bug/fly floating in it. I picked it out but upon closer inspection realized there were about 5 more floating in the wine. I called the waiter over and there was no apology though he did bring another glass of wine and he opened this bottle in front me me before he poured it. Nothing else was said and I wondered whether the restaurant would charge me. It turned out that when the bill came ($202) I was charged for the $11 glass of wine. Honestly I thought this was poor customer service from a yelp 4 star restaurant. I would not go back again."}
{"text":"Before I went to Montreal with friends, I did some research on the restaurants there and Bonaparte came up as one of the top choices. After having our dinner there, i can see why that is the case. 

The food there was amazing. All four of us ordered the Table d'Hote, as this perhaps is the most value-for-money choices in any Monteal restaurants. For only 30.95 dollars, the food and service beats the so-called Restaurant Week menus to dirt. 

I had venison terrine as an appetizer. They were very well seasoned and richly flavored. I had steak for my entree, it was quite nicely done. Although I have had better ones, I have also paid twice more for the steak. For this price, it's unbeatable. 

Will definitely recommend it to my friends if they  are going to visit Montreal!"}
{"text":"We dined at Bonapart on August 12. The street the restaurant is located at is torn up for re-construction, which gives us visitors from California a slight negative initial impression. But we persevered due to great Yelp reviews, and I am delighted we did. Bonapart was first class in every way. The interior is warm and eplegant without being overdone. The food was truly excellent. My wife and I each chose from  their 3 course offering both Fish and Veal were first rate in quality and preparation. The sauce reminded me of the best I have had in France. The service was extremely professional. There is no possible critique I can remotely level against Bonapart"}
{"text":"Bonaparte is located in a beautiful section of old Montreal.

We went on a quiet and drizzly Sunday night; our waiter was very good and had an excellent knowledge of wine. I had one of the prix fixe options.

The food was prepared well, but for the price, I expected more of a spark or passion. Mine was an unenthusiastic steak. Everything was technically and skillfully prepared, but there just seemed to be something missing - an inventiveness, perhaps.

The ambience was great. Sat by the fireplace in the dining room and enjoyed a lovely meal.

Our experience was good, but not great. I think Montreal has more to offer."}
{"text":"Firstly, Id like to dispel previous reviewers that mention this as a tourist trap.  This is not at all that.  It is a very nice, classic french cuisine restaurant.  You will find certain dishes in the menu that are modern creations, and others that are very classic.  The decor is sort of French Rococo.  The service was very good.  Our waiter was very attentive and helpful.  Of note our first language is spanish, and he spoke perfect spanish and english (also french).  For app had the pate, very very good, and my wife had the salad which was also very fresh and savory.  For dinner my wife had the chicken, which she loved and I had the veal chop, cooked perfectly.  For dessert had an assortment of cheeses with a glass of port, very good as well.  In general it was a very nice experience and delicious dinner.  Don't expect weird combinations by the chef, they offer classic fare, which is also nice from time to time.  I fully recommend it."}
{"text":"Wonderful food. Very friendly and helpful wait staff. Ambience was lovely and romantic. Just a great experience for all the senses."}
{"text":"This is not a bad restaurant, actually a very good one. Our Concierge has been recommending it for years. We finally decided to try it while we stayed at the hotel. Staff are okay, nothing special. The food was well prepared and the plates arrived scorching hot!! However, the rice, potatoes, vegetables were only slightly warm. When I looked in the kitchen window, there was the answer. All the sides re plated well in advance and they are counting on the heating of the plate to warm them up. That's okay , if you don't bill yourself as an excellent restaurant. If you are cutting corners, don't have an open window to the kitchen. We may go back but there are so many other restaurants in Montreal!!"}
{"text":"Decent food. The waiter Yannick made the evening memorable. Very old school, proper, very knowledgeable young man who excels at what he does. The food was good. Not outstanding, but good. Would definitely return."}
{"text":"Yes! My husband and I agreed this was in the top 20 restaurants we have been to in our entire lives. We were there celebrating our anniversary. We were in the area and showed up maybe 30 minutes early, and they seated us right away. The cocktail I got was one of the best cocktails I have ever had in my entire life. So that started things off on the right foot! The complementary bread was good, too. I ordered from the table d'hote menu with three courses for $40 Canadian -- I had a basic salad (good,) rockfish (wonderful,) and chocolate mousse (wonderful.) The husband ordered the chicken with brie entree, and he thought it was delicious and that the brie was a very good quality. We also ordered profiteroles, which were amazing! They even brought out our two desserts with sparklers! 

The service was spectacular. The servers were very kind and appreciative. They regularly refilled our water, answered any questions, etc. Five stars for this place! Would highly recommend and would return if we're ever in Montreal again!!"}
{"text":"I highly recommend this restaurant.  I had the foie gras creme brulee, filet mignon, lobster bisque, and a capuccino at the end.  It was a 7-course French meal.  All these dishes were exquisite, and service was attentive, polite, and warm.  I loved it and will go again on my next trip to Montreal!"}
{"text":"Wonderful restaurant in Old Montreal. I was looking for a semi-formal venue for a business meeting and this did not disappoint. Traditional French cuisine but not overly expensive. They offer a la carte, a 3-course prix fixe, and an 8-course prix fixe. I went with seared Foie Gras appetizer (shared with my guest and the filet mignon. Delicious! Service was attentive."}
{"text":"My son (14 year old) at there last night very late at 9:45pm.   I was tired and was leery of spending that much money for such a late night meal but boy was i wrong.   The food was great!!   we had the portabella ravioli, filet mignon, & crème Brule.    Everything was really good and the wait staff was super busy but did a good job.    I would highly recommend."}
{"text":"This is my second time here. The first time I loved this place and now the food was not as good. Perhaps its just my taste buds.
Service  was good but as good. Prices are reasonable for this type of restaurant.
I would come back."}
{"text":"To die for! Portions are small but you savor every bit of the delicious goodness! Our waiter was very knowledgeable, answered all our questions, and gave great suggestions. No wonder this place is so popular. We'll be back!"}
{"text":"Let me tell you something about this place. I had the tasting menu and in the beginning you get a mere salad, but soon after you are rewarded with some good food. Nothing is overly ambitious, but cooked correctly and served professionally. I was a nice meal but not priced correctly for the tasting. Restaurant ambiance was nice and the wait staff is superb. Very patient, helpful, playful, and full of character. 4 Stars for food and staff yet overpriced tasting. My advise is to give a main meal a try, such as the delicious salmon as it was cooked perfectly and matched with a wonderful sauce and complimentary sides. It was more worth the price."}
{"text":"On my vacation in Montreal I wanted to try a classic French restaurant. 
The hotel recommended Bonaparte and made the reservations.

The decor is classical and pleasant.
The service was warm and attentive.

We had the tasting menu and I was pleased that it was priced under $100 per person. I was not amazed or blown away by the food but everything was good. I would go back as it's reasonably priced, the food was good and the service was excellent."}
{"text":"I have to admit that the reason we stopped in Bonaparte was because the other places we tried beforehand all told us they were reserved for the night.  Bonaparte told us the same, but they had space for us to sit at the bar.

The bartender was friendly; I ordered a glass of wine while my coworkers had some beer.  After that I was in for a long wait for my dinner since my coworkers decided to order 5 course meals where I was only interested in an entree.  Each of their appetizers looked amazing but the bread while I waited was tasty.  I ordered the lamb and ratatouille which was absolutely amazing.  Both of my coworkers ordered the same and we all loved it.

Overall I'm giving them four stars because the price was a little high, though that is understandable given the location and the atmosphere.  I was also a little unsatisfied with the service.  I had asked for a glass of wine when my dinner came out but the bartender forgot.  When he asked if I still wanted it I said yes but he still didn't bring it.  The food quality here was excellent though.  I would likely come back, but there are so many good restaurants in old Montreal that I would probably try a few others before returning."}
{"text":"I went with the menu degustation which was their top tasting menu.
Everything was okay but nothing spectacular.

Mixed greens salad with pine nuts and parmesan cheese - Good, but just a salad.

Duck foie gras crème brulée, sautéed apples and toasts - Interesting. Had a creme brulee top and the foie gras was really creamy. I liked it, but the toasts were more like pound cake.

Snails in parsley fricassee and Provençale style vegetables - A little dissapointed. The escargot was not very flavorful. Was overpowered by the sauce.

Pear and tarragon sorbet (intermezzo) - Very refreshing

Breast of duck flavored with maple syrup and berries - Dissapointed. The breast was very chewy. Probably the worst course of the night and it is suppose to be the main entree. I had a taste of the filet mignon and it was better than my dish but not awesome.

Symphonie of desserts - Desserts were good

tea or coffee - I opted for tea and they give you a teapot. You get to choose your teabag from a box.

Sorry Bonaparte, but you were just meh."}
{"text":"Bonaparte is one of the classiest, ritziest, most fantastical restaurants I have ever been to. The food, the atmosphere, and the service are fantastic. You will pay for it, but it is an experience and worth it. The Dover entree is amazing and easily top 5 fish dish I have ever eaten. Foie gras creme brûlée is fantastic and I am almost sure everything served at Bonaparte is as well. 

The menu can be a bit confusing but basically you can order a la carte or choose a 5 course tasting menu."}
{"text":"Without a doubt, I have to say that this is one of the best hotels I've ever stayed at.  No hyperbole.  This was effing fantastic.

When I got to the hotel, I was pretty exhausted from trying to navigate my way around the city to get there on public transit.  Walked in, and they greeted me warmly, checked me in fairly quickly, and gave me a glass of champagne to help me settle in.  I was floored (in a good way).

The room itself was a fantastic blend of old and new - exposed brick, mixed with hardwood floors and a modern take on classic furniture.  Classy, simple, and tasteful - and at a price that was pretty sweet to boot.

The room also came with a morning breakfast - and we're talking about a made to order selection here - all done in their restaurant, and all ridiculously good with a great choice of breads to go along with it.

This isn't your typical Hilton or Marriott - this is some place really special.  And I can't wait to stay there again."}
{"text":"I can describe this place in one word..wonderful. from the atmosphere to the wait staff to of course the delicious food."}
{"text":"Nice boutique hotel option right in the heart of Old Montreal.  Our suite was very comfortable with high ceilings and wood floors.  The private balcony overlooking Notre Dame Cathedral was a nice plus.

Friendly service and a nice breakfast.  Although we did not make it into the restaurant on this visit."}
{"text":"Great food Great service. I had veal steak, and lobster salad, very refreshing taste. I will definitely go again."}
{"text":"The food is excellent. They have a pre fix menu which is the best choice. Every time I have been here the service, food and ambiance has been outstanding. Not a place for kids and when I am in Montreal with my kids my only regret is not being able to dine here. Everything is cooked to perfection and the food melts in your mouth. A little on the expensive side but worth every dollar."}
{"text":"My boyfriend decided to take me here for my birthday, because we had a very good experience with another french restaurand and adored it! And so we did! The food was delicious and fresh, and the service impecable! Beautiful restaurant and deliciousssssssss drinks! Definetely recommend!"}
{"text":"Amazing food!
Appetisers were excellent. Seafood puffed pastry and mushroom ravioli.
Couldn't get enough of the lobster stew!
My husband had the pork belly and lamb shank and loved it.
Dessert was also amazing... Chocolate mousse so airy, light and delicious.
I had the creme caramel and it was delectable too."}
{"text":"I was in old port vicinity and read the reviews and decided to go there on a rainy day. Once we checked in they  had the prix fix menu for the restaurant week. We choose 4 course meal for the night. Myself and hubby ordered the lobster bisque which we loved, the next course was foie gras mousse which we both thought was average, for main course I ordered Sole fish which knocked everything out of the park. The fish was juicy, buttery, flaky and the sides of veggies and mash was just right. Hubby ordered the rack of lamb which was meaty and the sides complimented the meat appropriately. The dessert was a symphony of cakes - cheescake, choclate and orange cake. I enjoyed the dessert very much and would recommend in a heartbeat. The wine choices were fantastic and ordered the Prosecco which was fantastic and complimented well with the fish. The ambiance and service was excellent. It had been a fantastic and memorable night."}
{"text":"It was my partners birthday so I decided I wanted to reserve a table during our stay in Montreal. I stumbled upon Bonaparte after an online search and decided to reserve a table for 6:45. Everything from the start to the finish was perfect. It had a very intimate a cozy feel to it, I would suggest asking for a window seat if it's just two of you. They have a great wine list, we went with the waiters suggestion and it was great. We both got the table d'hôte. I think the only thing that we didn't like was we felt the main course which we both got beef in red wine sauce was a little under seasoned. I would recommend this to anybody who is looking for an intimate evening."}
{"text":"Food ***** Excellent
Wine ***** Very nice
Service ***** Great
Ambiance *****  The Restaurant Bonaparte is a wonderful establishment.  We were fortunate to be seated at one of their front window tables.  I felt like we were in France, with horse drawn carriages passing by.  It was a great first class dining experience."}
{"text":"Good restaurant in Old Montreal.I should tell you Old Montreal is really torn up right now and the street Bonaparte is on is completely torn up .Don't even consider driving!Went here for what amounted to Thanksgiving dinner.We  had the Table D hote, which is reasonably priced.I had the venison terrine and beef filet , both of which were excellent.My wife had a soup - a cream of leek with another vegetable in it and haddock with lobster sauce.Unusually , because we were early , we had a cocktail  at the bar.I had something called an ephmerie  - maybe- which had a number of ingredients including elder flower liqueur and chartreuse, which was very good.Service was good  and it was a pleasnt evening."}
{"text":"A lovely and beautiful place to enjoy food. A find In the old heart of the city. The food was elegantly served. The waitstaff was on pointe and charming. Dessert luscious I'd highly suggest a stop here."}
{"text":"We were disappointed - not worth the cost. Many better places around. 
Ambiance : Crowd was over 45, calm peaceful ritzy. 
Food: steak was incredible, best my brother in law has had. Other meals failed, including seafood Rigatoni, chicken with Brie. Do not recommend either of them."}
{"text":"Any place as nice as this that offers a three course pre fixe menu for $31 deserves 4 stars! Especially if they serve you the bison steak in that red wine sauce....Mmmmmm That steak alone would make me want to come back to place. It was so tender and juicy and just paired so so well with that red wine sauce. And it was perfectly cooked to the medium rare that I like too! 

And it is a good thing that the steak was so incredible, because the seafood linguini I got as my first dish was just okay. It was supposed to be in this saffron sauce but I think they must have forgotten the saffron, because it didn't taste like much and that is such a strong flavor normally! But at least the seafood itself in the pasta was pretty tasty. 

And the chocolate mouse....Wow. I love chocolate. I am close to being an addict I think since whenever I see a dessert menu anything with the word chocolate in it directly grasps my visual attention, so I couldn't pass up this option either! And I am really glad that I didn't! It was so light and rich at the same time and with that mint leaf it was the perfect way to end my meal!

The wine here is pricey though...But Montreal in general is pricey, so just be prepared to throw down a bit of money if you come here, but I promise the food is really good! Everyone else in our party loved their food as well! So bring money and don't be in a rush, since they also took a little bit of time getting to our food order heh"}
{"text":"Incredible food, amazing service!!! Upscale and delicious. The tasting menu is fantastic and the sommelier is wonderful!"}
{"text":"This is a lovely old world French hotel. High ceilings, exposed brick, HUGE windows. The bath is generous with both a soaking tub and shower. Two sinks, one outside the bathroom-nice extra. It is very quite while being centrally located. About a 8-15 minute walk to McGill Street, Viex Port, Viex Montreal, Place d'Armes, Notre-Dame Basilica,  Montreal Science Centre and more. The staff is friendly and helpful. A full breakfast is included-you chose 3 courses off a menu including-fresh fruit juice, coffee, tea, hot chocolate, fresh fruit salad (great & freshly made with mango, pineapple, grapes, apples, etc), yogurt (would have been MUCH better if poured out if the carton), fresh bread, muffins and croissants (but of course!).  The main dish was crepes, French toast, eggs with sausage and bacon or a choice of several omelets. Everything was very nice. 
The photos online are exactly what you get-good to know. We reserved thru a hotel search engine and were not sure what we would be getting-we could not be more pleased!"}
{"text":"Preface:  Autumn 2008

This hotel is the kind of place you could go and pretend you lived here.  From the inside, the rooms are gorgeous: high ceilings and hardwood floors.  Views overlook cobblestone and storefront-lined streets.  Walls are thick and sound does not carry, so if you tend to sleep soundly in a different bed, you might find yourself well-rested for  days of adventure in your 'new neighborhood.'    

The hotel was a two-minute walk to the Notre Dame basilica.  As a tourist, walking through the church felt peripherally spiritual.  The walking tour included Rue St. Laurent which is home to top-shelf shopping, cafes, and restaurants.  This area is in close proximity to China town.  Taxi rides are minutes from fine adult entertainment and art museums.  If you want to plan ahead, you can, but it's not necessary.

Although googling my trip helped, I would say that it wasn't necessary.  The spots I wanted to go overlapped the places I just discovered on my own, and the hotel staff will help you find what it is that you're looking for."}
{"text":"Came here for the first time for MTL à table. This place has amazing ratings online so my expectations were really high. The food was good, but not great. Everything lacked a bit of flavor and tasted a bit plain. Nothing was impressive and made me want to go back. 

On the other hand, the service was impeccable. We were served by friendly and nice staff who make great recommendations. They always have a smile on their face and came by our table a few times to make sure everything was ok. The restaurant itself has a nice quiet ambiance and is clean. 

It was a nice experience and we got to try a new restaurant. However, I don't think I would go back as it's not the kind of food that makes you suddenly have a craving for."}
{"text":"Walking by and saw this restaurant and decided to give it a try.  It's very cute and the setting is cozy. Food is excellent and this is what I expect French restaurant the standard should be."}
{"text":"If you wish an excellent meal and I mean CLASSIC French meal you will be delighted - outstanding in every way and you CAN bring well behaved children there!  Lobster - fois gras c'mon..."}
{"text":"Overall, the food and the service were excellent! My friends and I went to Bonaparte for MTL à Table. The restaurant was pretty much booked out. The waiters were nice, but they were very busy so they could not really serve us as soon as we called them. I chose the lobster bisque and smoked salmon, and they were both very good. Especially the bisque, it was very delicate. I ordered beef filet mignon for my main. It was not as good as I had expected. It was average, compared to the bisque and the smoked salmon. My friends ordered duck and they thought it was average too. The final dessert was very good. We had three kinds of small cakes and a creme brûlée. By the way, they served lots of bread....lol."}
{"text":"Wonderful service, we had no reservations but we got seated right away nonetheless. We ordered the multiple course meal and were not disappointed. The lobster bisque was creamy and full bodied. We had the warm goat cheese in phyllo dough, it was creamy, tart, and buttery crisp. The escargot was the perfect texture and the contrast of the soft escargot and the phyllo shell was highly enjoyable. The duck was tender and sweet, the tartness of the berries didn't let the maple flavor overpower the dish. As for dessert, although the sampling was quite enjoyable, the creme brûlée was the star, the sugar was caramelized just right, and the custard itself was smooth and creamy, sweet, yet light. It was the best meal ever and I'm so happy we splurged."}
{"text":"This place deserves 3.5 stars (and since my sig other is reading over my shoulder and he wants to give it 4, I'm giving it 4).  I want to give it 3 because after having dinner the night before at Europea, I was less impressed with this place.  

We were here for NYE 2011.  There was a 7-course prix-fixe menu for $96.  The atmosphere was a bit stuffy and the service a bit slow (they were clearly overwhelmed- the entire restaurant was packed at 9:30pm when we came in for our reservation).  The 7 courses started out fantastic and sort of declined as the night went on.  They could've gotten away with serving us about 1/2 to 3/4 of the amount of food per plate than they did.  The 4-6 oz. of veal for the 6th course was just too much (and reminded me of very fancy wedding food- you know that kind that comes out with basic sides and feels like it's been in the oven/warmer waiting for you?).  They did give us all glasses of bubbly to greet the new year and the warmth from all the staff was really lovely.  I may go here again for a small dinner, but I will survey the other Montreal eateries first.  

It was a comfortable and delicious was to ring in the new year, I just wasn't overly impressed."}
{"text":"The service was excellent (really attentive - and the waiter was brave - my wife was first trimester pregnant and he wished us congratulations on the pregnancy - that could have gone very wrong for him if he assumed incorrectly.)  :)

The lobster bisque was bowl-licking good (normally I don't care much for the flavor of ginger, but it was just right for the bisque.)  The steak was very good and cooked perfectly.

This place was our romantic dinner splurge for the city and we'd go back again in a heartbeat - it's a great date restaurant."}
{"text":"Service was wonderful, but a little slow to the table. Food did come out promptly though. Tasting menu was well balanced and offered a great selection. Wine selection was diverse and paired wonderfully with the meal. Environment/setting was perfect as well. Price point was very fair."}
{"text":"Delicious meal with top notch service. We enjoyed every bite of the tasting menu and a nice bottle of wine! Highlights were the goat cheese in puff pastry, the shrimp and scallops in vanilla sauce (not something I would have thought went together but was very nice) and dessert sampler. Very reasonably priced for the great quality."}
{"text":"\"Restaurant\" isn't the first word you think of when you see \"Bonaparte\". You probably think \"Napoleon\" like I do, the French Revolution military leader we all learned about in 7th grade History class. However, due to the ratings on Yelp, I decided to give it a try with my Account Executive for dinner on a Thursday evening (9PM res) while in one of my favorite cities in North America to travel to. It was also closely located to the Le Westin Montreal (my GO TO hotel every time I'm in Montreal) giving it an edge over the other locations I was contemplating (within a quick 4 minute walk of the Westin). 

We saw their multitude of menus but quickly settled on the $32.95CAD \"TABLE D'HOTE\" prixe fixe that had a very large selection of items which were spread across 3 courses + coffee/tea would make almost all diners happy for a relatively low price. Here's how it went down:

+ Venison terrine with cranberries and herbs. It was quite good, very meatloafy in consistency which is what most terrines should be. It was quite meaty, herby, perfectly salted and great to be spread on some carbs like WE did.
+ Lamb Rack with brussel sprouts and onions. It was very juicy, done perfectly medium-rare and lollipop style/Frenched as it should be. After all, you ARE in a French restaurant right?
+ Buffalo Flank with green peppercorn. My AE had ordered this and it was \"pretty good\" according to him. I had a piece of it and it was definitely good. Not the best buffalo flank I've had but not the worst either. 
+ Cheese Plate. We had a goat's cheese, a sheep's milk and a cow cheese that were equally yummy. The firm sheep's milk cheese was quite yummy and creamy while the others were very good too. They paired quite well with our Cab Sav that we had.
+ Chocolate Mousse. One of the best chocolate mousses I've ever had...it was done to perfectly, firm yet creamy, consistent and damn smooth. Probably one of the best items of the evening.

Overall? It was a very good experience...it was definitely quite busy and filled with Americans (tourists like me) and the service was fine and efficient. I will definitely return, however there are many other Frenchy spots in Montreal that I'd love to try.

THIS has been a review by Gaurav"}
{"text":"The service was excellent and so was the food. Good wine list. The place gives an old school feel for ambiance."}
{"text":"Had dinner here for my bachelorette party. The atmosphere is fancy and every staff member will greet you which I liked. The food was good and very timely, prices fair. Overall good experience."}
{"text":"If you're looking for a French restaurant with the ambiance of a loud Canadian lodge from the late 80's to early 90's...this isn't the place (try L'Original). This is a white table cloth high-service French restaurant. We had the tasting menu and the food was very good. It is a 3 to 4 $ place. And I can recommend a visit. It will be worth your time. Bon appetite."}
{"text":"Pros: Great food! And great service! I got the Lamb shank and pork belly, although I preferred my dinner mate's sirloin steak (butchers choice). We went early- around 5:30pm, when they just open- so it not too loud. 
The dessert was excellent. Chocolate mousse was good, as it usually is. 

Con: They touch the bread with their hands when cutting it. Most people don't see this, but we had a clear view of the bread-cutting zone.
It also wasn't great bread, regardless. Very chewy and they don't warm it up."}
{"text":"Excellent food, attentive service, enjoyable atmosphere.

If the hundreds of thousands of parochial reviewers on Yelp could experience restaurants of the quality of Bonaparte, the number of desolate, greasy spoons getting five star reviews on Yelp would drop to zero."}
{"text":"I was lucky enough to be in Montreal during the week of MTLatable, and upon recommendation from my friend, we decided to try this restaurant for my first dinner here. Restaurant Bonaparte is located within hotel Bonaparte in old Montreal... a very walkable distance from where I was staying, and features some delicious French cuisine.  I really enjoyed my experience here!

Atmosphere: 4.5/5  Great ambience, soft lighting, and great decor with stone walls.  Very classy setting to enjoy a great meal

Food: 4.5/5  We ended up choosing from the MTLatable set menu.  I had the salad to start, homemade game terrine, duck breast with maple syrup and berries, and lemon meringue pie for dessert.  Everything was delicious!  It was my first time having game terrine, which was an interesting experience but I liked the texture.  The duck breast was cooked well, and I especially liked the sweet freshness from the berries, which went well w the meat.  The lemon meringue pie was delicious as well - I normally don't like too much cream but this was not too heavy or sweet.  Overall great experience - only thing was the bread was not warm but everything else made up for it!

Service: 4.5/5 Great service; attentive and friendly without being overbearing; good explanation of menu

Price: 3.5/5  Overall $41 for delicious cuisine and excellent service in a great environment - I would say this is extremely reasonable

Overall: 4.5/5  I loved my experience at bonaparte restaurant - great atmosphere to enjoy a meal while catching up with my friend; I would definitely recommend this restaurant to visitors!"}
{"text":"I chose this restaurant specifically for the  Soufflé.  I'm a huge fan and I search out to find places that make this rare dessert.  This restaurant was nothing short of the sort. I was not disappointed!  In fact I feel I'm a Soufflé connoisseur and this is by far the best I have ever had.  It was chocolate chip and so delightful and lots of it!  Now it doesn't go to say that the other five courses before dessert wasn't shy of deliciousness!  Overall, I WILL be back! Wonderful place for couples, anniversaries or whatever your occasion maybe."}
{"text":"My husband and I don't go out for fancy meals often. Maybe once or twice a year. This was worth every penny!

We came to Montreal (and Nova Scotia) for our honeymoon and needed a nice place for dinner before a show. On a recommendation from the concierge at out hotel, we chose Restaurant Bonaparte. We made a reservation, even though I'm pretty sure we were the first ones in the door for dinner service. 

Oh em gee- one of the best meals EVER. I started with the lobster salad (still thinking about it. A SALAD.), we had french bread, a bottle of wine. To drive the point home about the salad, it was a bit of lettuce and some shredded veggies with huge chunks of lobster meat and a hazlenut vinagrette. Seriously, I can still taste it if I close my eyes...

For an entree, I had the Scallop Delight- scallops in truffle oil, and Gordon enjoyed the Dover Sole in pine nuts and butter. Delish. Creme brulee and Creme caramel for dessert. 

We were seated in the window which was a great spot to be in Old Montreal. The service was top notch and the waiter helped me choose a nice wine.

A great meal and a highlight of our trip."}
{"text":"We made a special trip from our hotel to this restaurant as it came highly recommended by my local friend.  This restaurant completely reminds us of our trip to Paris and brought back lot of good memories we had over there with the good food and Parisian ambience.  The quality of the lunch menu was superb and the price reasonable.  The service was surprisingly good, as we usually don't expect too much from a French restaurant serving non-French speakers.

We were extremely happy with everything we saw (the fresh flowers, the decor, the tableware, the food portion...), we tasted, and our final bill.  

Will definitely go there again and again when I visit."}
{"text":"Good cuisine give me a chance for new experience!
There is a saying that a good meal may give one a chance to taste her past and welcome the future. I chose this French restaurant to finish my \"past and future\" thinking, they did a pretty good job with the food and service and I really have a good time.
But I think people may agree that one will become more sensitive when she is asked about was she eating alone when she is exactly eating alone; and more sensitive when she is asked about \"is that price ok with you\" after she totally read and understood what was the menu trying to told the customers. 
A better service may be giving a proper silence on certain issues."}
{"text":"For a high end restaurant, I had high expectations. I had dinner here a year ago and was thoroughly impressed. However this year, staying at the hotel, we had several opportunities to stay here.

With a nearly empty restaurant at breakfast, it will still take 15 minutes to sit 5 people and 40 minutes to get your breakfast and the server will almost never be around. 

At dinner, we ordered a bottle of wine, the server broke the cork, and pushed the broken piece down into the bottle. She did not offer to get us a new bottle, instead just poured it for us. We had broken pieces of cork we had to fish out of our wine glasses. For a $500 check, we expected we could at least get a fresh bottle of wine.


That being said, the restrooms were exquisite and the kitchen did an absolutely wonderful job. It's just the service that needs improvement."}
{"text":"We had the 7-course tasting menu. Portions were large for tasting menu, which surprised us. Taste  was not delicate and presentation was mediocre. Too much butter. We expected their soufflé, but it was not part of the tasting menu. Service was good, especially the manager was very nice and professional."}
{"text":"We had the $78 tasting menu with the rack of lamb as the main, while my wife chose the prix fixe with the steak. 

Tasting menu portions were much larger than I expected, so there was certainly good value for the price while dessert was a struggle to finish. The hits were the shrimp and scallop in vanilla, the mushroom ravioli and the lamb. The rest, lobster bisque, foie gras creme brûlée and dessert were fine. 

Service was great (it was a weeknight, quite late, and a big party), and in particular they were very patient in letting us close the place down."}
{"text":"A perfect evening at Bonaparte for our wedding anniversary!  We had a wonderful table right by the window.  We decided on the tasting menu and were not disappointed.  Every course was amazing, although our favorite was the homemade smoked salmon with truffle oil.  After this meal, you will not leave hungry.  Our server Yannic helped make this a memorable evening.  I can truly say after many fine dining experiences that he is one of the best in the business.  For a romantic evening, Bonaparte is worth the trip."}
{"text":"This place was exceptional. I went here celebrating my honey's birthday and it was the exact right place. The ambiance is very classy and confident without being stuffy. We did the 7 course tasting menu which was delicious and for only $68 a person total. Maybe I'm used to NYC prices too much, but it seemed entirely reasonable for a romantic French restaurant's nicest possible option. I had the escargot (yes, snails --- but yes, delicious!) filet migon, and they brought a mini array of desserts. Also, we had our hotel make our reservations, and told them about the birthday. They reserved the nicest table on a raised platform over a window, secluded from the restaurant with a nice view of the little street in Old Montreal. Perfect evening, delicious food, excellent service."}
{"text":"Resto français classique un peu (beaucoup ?) vielle façon comme je les aimes à l'occasion :service professionnel, grande table, nappe blanche. Cuisine sans surprise mais sans faute. La bisque de homard était renversante."}
{"text":"Was a great romantic evening with exceptional service. My wife had the mushroom ravioli and it was very good. She had them turn it into a main as it was only a starter which was nice. Great presentation and flavor. I had the rack of lamb which was also good but not memorable. The lamb was not \"melt in your mouth tender.\" Wine list was very strong! One suggestion would be to not have the plates come out so hot.  It was literally was cooking the meat!"}
{"text":"I've never been to Montreal, so this weekend we went over New Years and celebrated my birthday at Bonaparte. It was amazing! I had the filet mignon and it was perfect and melted right in my mouth, and my boyfriend had the duck confit. I'm not a fan of duck but Bonaparte's was to die for! Both meals came with pureed carrots (I didn't know that was a thing, but it was delicious). For my birthday dessert they put a little sparkler on my chocolate mousse (equally delicious) which was a nice gesture to my birthday. It was very classy, the waiters were attentive but not overly so, and we had a table facing the beautiful cobblestone streets of old Montreal. If you're ever in Montreal and would like a lovely French dining experience, definitely come here. We really loved it!"}
{"text":"What a spectacular evening we had!  We arrived promptly at 7 :30 to find them waiting for us, our table ready.  Our waiter, François was attentive, helpful and very accurate in assisting us through their wonderful menu.  We chose the 5 course dinner.   We found a wonderful  and reasonably priced St. Emillion Bordeaux and ended up drinking another through the evening.  Standouts were the Fois Gras Creme Brulee with sauteed apples on the side, the most dainty ravioli with mushrooms I have ever had, and wonderful main courses of Sole and Rack of Lamb.  All in all a fabulous evening in a lovely setting."}
{"text":"Tonight's waiter was excellent. I let him order for me after a brief discussion of what I like and dislike. Salad, roasted rack of lamb (done medium), and dessert sampler with coffee. All were fantastic and I would order again when back in Montreal.

As a wine snob, I scoff at the high price their French Red Wines and recognize that their selection could not be purchased retail here even if I wanted. Pick their 2013 Pinot Noir French Bourgogne by glass for $15 CAN, 500 mL $45,  or bottle $70. One glass is not enough. Pair it with lamb or pork. It's probably the best value for a semi-mature French Bordeaux on their selection.  Impress your date and order it!"}
{"text":"The service and the food here is above the rest in Montreal. The quality of the ingredients and the preparation of the dishes are exceptional. The plating and the presentation is very good. I would definitely return the next time I'm in Montreal."}
{"text":"Excellent food, impeccable service. Maybe a bit too formal for my liking.  Price was a bit on the high side for lunch.  There are many comparable options for cheaper."}
{"text":"I consider Restaurant Bonaparte's food quality average to very good. Service is excellent but for the value I believe it could be improved. We decided to go to this restaurant for dinner because of the great reviews on various websites and magazines. I would only recommend it if it is convenient for the location, in a hotel. But since Montreal has so many great restaurants I would try other places."}
{"text":"Had an excellent dinner on the evening of Sat 05/28/16. The lobster bisque was rich and delicious. Appetizers were Mushroom Ravioli and Fois Gras Creme Brulee. Both excellent.
Sliced, Roasted Duck breast with a maple syrup-flavored sauce and Sesame-crusted Red Tuna entrees. Awesome. Chocolate Mousse and \"assorted dessert plate\" finished a very, very nice meal. Caroline was a delightful waitress. Attentive, but not overly-so and really helpful in recommending some wonderful wines to pair with our food (and within our budget parameters we conveyed). Great place."}
{"text":"Very romantic dinner spot if you're willing to splurge a little bit. Restaurant: beautiful. Food: delicious. Service: excellent."}
{"text":"4.5 but I am rounding up because it really was a special experience. While an la carte menu is an option, pricing encourages you to order the seasonal or tasting menu. A foodie friend of my always said, you can gage the quality of the food to come by the bread in the basket. When the PERFECT baguette and multi grain arrived I knew I was in for some thing special. 
   My tasting menu included, Lobster Bisque, Frois Gras Brûlée, shrimp and scallop and finally the dick breast. I finished with the Creme brûlée and a trio of cakes. Coffe and tea were also included. Everything was wonderful, if I had one complaint a little salt was needed for nearly every dish to make it shine."}
{"text":"This hotel has the best location in all of Old Montreal. Easy walk to anywhere is Old Montreal as well as to downtown if you are ambitious. Close to the best sites, good restaurants, fun shopping, and a little convenience store.

I would choose this hotel again if returning to Vieux-Montreal.

Our room was a good size (complimentary upgrade from queen to king!), was very clean and pretty well appointed. The bathroom was good size, though no real counter space so a bit of a challenge with hair dryer, make-up, etc., but only a slight inconvenience. Only other downside (which could be an upside for some people), the mattress was very soft.

The staff was very friendly and helpful. Took time talking with guests.

The breakfast that comes with the room was OK, nothing special, but got the job done."}
{"text":"We've spent the weekend in Montreal, and I really wanted to try a well regarded French restaurant while we are here.  I narrowed it down to Bonaparte and Montreal Plaza, we ended up going to the former because we were staying near Old Montreal.  We decided to try the tasting menu as it contained most of the dishes we wanted to try and the price was relatively reasonable for a 6 course menu (CAD 78).  See below for the dishes we tried:

Lobster bisque enhanced with Ginger - my guy really liked this dish, I thought it was too creamy, but it was flavorful

Salad of mixed greens with pine nuts and parmesan cheese - I actually loved this dish, as weird as it might sound.  It was a simple salad dish, but I loved the different type of greens and how well they complimented each other.  Also, I appreciate how lightly they dressed the salad, as some places tend to get heavy-handed with the dressing.  It goes to show a delicious tasting dish does not need to be complicated.

Duck foie gras crème brulée, sautéed apples - we were mixed on this dish.  I loved it, he didn't.  I am a huge fan of foie gras, and the technique of brulee-ing anything.  Who doesn't love the crackle of caramelized sugar?  I wasn't crazy about the cake-y type of bread that accompanied the dish, but the foie gras went well with the bread basket.

Shrimp and scallop harmony flavoured with vanilla - I thought this dish was just ok, it came with two pieces of shrimp and a piece of scallop.  I thought the shrimps were a tad overcooked.

Mushroom raviolis perfumed with fresh sage - my favorite dish of the evening.  The sage provided a wonderful flavor that pushed the dish from good to great.  I loved how well the raviolis were cooked and the sauce had the perfect amount of creaminess.

Pear and tarragon sorbet - I could eat a whole tub of the sorbet, it was light yet flavorful.  It was definitely a great palate cleanser

Duck breast flavoured with maple syrup and wild berries - I thought the duck was well flavored and perfectly medium rare, just like I asked for.  

Roasted rack of lamb and port wine 'jus' - I normally love lamb, but was not a big fan of this one.  The flavor was lacking.  I thought it was interesting that they give you the same vegetables for all of the main courses.

Homemade Desserts - they had a trio of cakes (chocolate mousse, raspberry and cheesecake), as well as creme brulee.  The only standout was the cheesecake, which was heavenly, if I had room, I would've ordered a whole slice of it.

I hate to say it, but the service was lackluster for this caliber of restaurant.  I had to track down the waiter a few times just to refill my water glass, yet he was pretty fast in offering me another glass of wine.  Also, I really wanted coffee with my dessert, but had to track down someone again to inquire about the coffee after I've already finished my dessert.  To be fair, it was a packed dining room the night I was there, but I have a different expectation for a formal sit down place like this one.  Overall, I think it was a great experience, I've enjoyed most of the dishes in the tasting menu, and it was definitely worth it to try it once.  I definitely recommend it if you are in town."}
{"text":"This place is simply \"fantastic\", basically one of the best confit de canard I've ever eaten if not the best!!!  The service is also exceptional, a must go place if you are in Montreal..."}
{"text":"Very very good food, consistent, simple and flavorful, did the set menu, great sample of each dish with a pallet clearing dessert. Duck, and foie gras to die for =) Definitely made an excellent evening simply brilliant. Waitress and general staff was excellent,  be sure to know how to tip in Canada as its much different to USA when looking at the bill. Our waitress was pleasant, cheerful and simply splendid. She made our time fun, elegant and most importantly a special dinner. Attire was a mixed bag, some were dressed some were more business casual or casual."}
{"text":"This place is a gem, and even with a touch of attitude, I'm still giving this restaurant 5 stars, and here's why...

The food, ambiance, and service is stellar. I went with my family for a celebratory dinner when I was back home and I'm thinking about this meal months later. Two of us had the table d'hote, one a la carte, and my sister had the tasting menu (we all got to try her dishes to help her out). Every single dish was prepared as requested, seasoned well, and came at a leisurely, yet not too drawn-out pace. My parents had been here several times before but I had always declined because I assumed it would be stuffy, but the location in the Auberge means that the clientele is of all ages - some clearly younger than myself so I didn't feel out of place. If you love dessert soufflé you should make sure to get it here, it is divine, I only wished that I had ordered it myself and wasn't limited to tasting my dad's! He got the Grand Mariner one, but there is also one flavored with Calvados, or a chocolate chip one if you don't like the taste of alcohol.

I'm going to try very hard to visit again when I am back in town next."}
{"text":"My four colleagues and I enjoyed the tasting menu of classic French cuisine. Every part of the six course was amazing. Starting with the lobster bisque that was tasty to the mushroom ravioli that was sweet with an earthy taste to the perfectly cooked lamb to the dessert combination of creme brûlée and four mini cakes, the meal was amazing. Our server was knowledgable and provided amazing service.

If you are looking for a classic, French meal and have the time, go for the full tasting menu, sit back with good friends and conversation and enjoy this wonderful meal."}
{"text":"Excellent service. Tasty food. Good selection of cocktails. Disappointing bread. Do call for reservations."}
{"text":"We had the tasting menu and it was a wonderful experience.  Waiter was very helpful in choosing a wine.  Beautiful inside.  Make reservations as it fills up on weekends.  A definite must if you are a foodie."}
{"text":"Bonaparte was an very nice. A nice restaurant on a small street in Montreal and just a few blocks away from Notre Dame. 

I wouldn't say the food is the greatest but was very tastefully handled. My husband and I ordered their Seasonal Tasting Menu. Not too overwelhming with food. Good portions. Not too heavy. Very delightful. 

The service was very nice. The waiter was very nice and patient with us and he spoke fluent english (with a french accent though). 

I would definately recommend anyone who wants a simple but well executed dinner in a friendly atmosphere, then this is a good choice."}
{"text":"Best tuna and supreme Dover sole. Everything from the Old Fashioned at the bar to the table service, wine list, side dishes---over-the-top!"}
{"text":"We're traveling from NYC, we're both serious cooks and huge foodies. We don't mind spending a lot of money if the food is happening. Bonaparte is a well intentioned place. Nice vibe, varied menu. Honestly the food is basically what you get from a decent caterer at an event. We both had the tasting menu and the flavors were so muted they cried out for acid and salt. It was ok, we didn't leave hungry but we did wish we spent our money somewhere more adventurous. I always say, in this day and age, where the level of the average eater has become so much more aware, you have to bring the food to life. This place did not. La bummer."}
{"text":"Wow, Orgasmic!!! One of the Best French restaurant in Montreal. The service is impressive. The staff makes sure that all your needs are met. I started out with a warm goat cheese in a Phyllo with almonds. Was light and tasty. As the main meal I had the Baby Calf liver served in a Porto sauce, this was cooked to perfection Moist and Tender. Yes it's an expensive place to eat but when the food is delicious price does not matter. You leave feeling fully satisfied... what better feeling than that!! ;))"}
{"text":"The weather was warm this Christmas, making a trip to Old Montreal a pleasure. It was too dark for window shopping but we were able to enjoy the many Christmas decorations and lights that adorned cafes and tourist venues.

Bonaparte is a quaint and charming restaurant adjoining an auberge. We were seated by the window, in an intimate room with rough brick walls, a curved archway, and a lovely, decorated tree.

As we reviewed the large menu, we took in the street life, including romantic calèche rides that rolled slowly by. While I could not make out the drivers' patter, I would like to imagine tales of adventure and romance. It is Montreal, of course.

The restaurant offers several different dining options: à la carte, table d'hôte, and tasting menu. We did not have the energy for the longer tasting menu option and instead went with the à la carte option.

We shared the mushroom and sage ravioli. The filling was wrapped in a delicately thin pasta that melted with every bite. It is a wonderful way to start the meal. Other apps on the menu include snails in garlic sauce, shrimps and scallops in a cheese sauce, and foie gras, two ways.

As entrée, I enjoyed duck breast roasted medium rare, with vegetables, in a savory maple syrup, berry sauce. So delicious.

However, it was the soufflé dessert that earned the most praise at our table. Available with chocolate crumbs, calvados brandy (the chef's favorite), and Grand Marnier, the impossibly light and airy soufflé was a welcomed treat. Note, since it takes a while to prepare, the restaurant recommended that we order it mid-entree - which we did.

Service was warm and professional. The server made good recommendations, although I think there isn't a bad meal to be had here. With such an extensive menu, we think that a subsequent visit is definitely in order. With the soufflé, of course."}
{"text":"A great place for a celebration. 
The service was absolutely phenomenal and the food was very interesting with the kitchen trying some interesting combinations like the lobster stew with vanilla. An adventurous risk with maybe just a dash too much vanilla but delicious nonetheless. The wine is fantastic here but on the pricier end. 
The food also could have been hotter, not sure who to blame for that. 
Overall expect to spend about $100 per person with wine for a three course meal. I would say it's worth the money for a special occasion."}
{"text":"While I didn't hit up the restaurant portion, my girlfriend and I did stay for a weekend (circa November 2006) at the inn due to a recommendation from a friend who had lived in Montreal for a bit. The inn can definitely be described as a place for older couples. We were definitely the youngest ones around, which didn't bother us at all but might have bothered others around us. We weren't going to be loud or obnoxious, so please, stop giving us dirty looks.

Perfectly situated in the older section of Montreal, the inn is within walking distance of many of the sites within old Montreal. We were also able to easily access any place outside of the older section while never being that far away from our hotel. 

More on the actual inn.

We went during the off season (November) and spend $165/ night for the most basic room; a room with a queen sized bed and a complete bathroom. The room had views of a cathedral and its gardens, which probably would have been beautiful in the spring, but was not very impressive in the fall (obviously not the fault of the garden). Now, I'm not really accustomed to nice hotels, so I was quite impressed with the elegant hardwood floors, the wall sconce equipped with dimmers, the comfortable bed, the clean bathroom...etc etc. Perhaps I'm not the best one to say this, but it's definitely one of the nicest hotel rooms I have ever had the pleasure of staying in. Breakfast the next morning was excellent, if a bit less filling than my usual morning meal.  Overall, the vibe was cozy, classy, intertwined with a bit of old school charm."}
{"text":"I had the tasting menu, which was incredible, ranging from the unique and creative foie gras creme brule to the familiar steak. The filet mignon might have been the best steak I've ever had.

Service and atmosphere was also excellent.

Prices were reasonable considering the quality."}
{"text":"We were recommended this restaurant as a fine dining french restaurant while visiting Montreal with family.  The choice was right. We had an excellent meal with a superb service in an extremely elegant setting.  The foie gras creme brûlée, mushroom ravioli and magret du canard were delicious.  Staff was very attentive and were very courteous to our children.  Definitely would recommend this restaurant to Old Montreal visitors."}
{"text":"Great food and very generous portion. The service was great. Was a great experience.

Would have been better if they post the wine list on the website. It's doable to find decent wine with affordable price."}
{"text":"This was the best French restaurant I've ever been to. The service is amazing and the ambience was so relaxing and inviting. 

We had the taste menu. The froi gras was so delicious I wanted to lick to plate. Had the scallops and shrimp which was to die for and the rack of lamb so moist and tender. 

Definitely recommend this restaurant if your looking for a French inspired meal. Must try."}
{"text":"This place is too good to be true. Beautifully renovated lobby with  very modern aesthetic. Think... White on white on white with lots and lots of chandeliers. Every girl's dream. The check in process was quick and the staff were all very helpful and personable. You can tell that they take service very seriously. The room itself was lovely with an exposed brick wall and beautiful French windows overlooking the street. 

Parking was a bit of an issue as it is in old Montreal, but there is an unloading zone in front of the hotel and then parking is an additional $30 at a lot across the street. 

The included breakfast was something dreams are made of. I've never had such a gourmet breakfast that was included with a hotel. White tablecloth service. And every dish that my group tried was amazing. 

Highly recommend this place. I only wish I had a longer stay. But I'm definitely coming back."}
{"text":"Simply magical!

Walked in off the street, hoping for a chance to sit down, as this was on a Friday night, during the Montreal restaurant week with fixed price menus. 

Was told there are no seats, as we didn't have a reservation, however after a second the manager said that he may have a table for us, if we will take it. 

Expecting something in the crawl space above the attic or under the basement stairs, we were led to a cozy table by the fireplace. 

If you think this was amazing, then the food was triple amazing, the waiters were very nice and nearly invisible yet always there when you needed them, and happy to provide advice on food pairings and etc. 

The place is not cheap, but worth every penny. 

A definite repeat."}
{"text":"We went to Bonaparte during Mtl a table week. I would say it was one of the best experience that I've ever had so far. The menu for Mtl a table was 41$. I ordered the veggie soup and the mushrooms raviolis to start off with. They are both amazing especially the raviolis knocked me off. For the main course, I ordered the Magret de canard and my friend Jarret d'agneau. Both medium cooked. They are both amazing, well seasoned, the meat have multiple levels of taste: the lamb was braised in wine  so the fruity flavor of the wine was there, and the duck was crispy outside on the skin with a little fat left in the middle but it doesn't feel greasy as all. For the dessert, I got the lemon pie and my friend the chocolate mousse. The lemon pie was good but compared to the chocolate mousse, the later definitely won. The chocolate mousse was a bit bitter and it matches perfectly with the light mousse texture. I can't help myself but stole the half of it from my friend although we were all really stuffed. Last but not least, the service was impeccable. I was there 20minutes earlier. As I was waiting at the bar area, the waiter offers me the water to drink although I said it was ok to simply wait for my friend to arrive. When my table was ready, the manager pulled out the chair for me. I really felt to be treated like a queen. Our waiter Yannick was super friendly and attentive. The dishes came quickly and he mentioned not to touch the plates as they were very hot when served. As for 41$ plus taxes and tips, it was a worthwhile experience and I am willing to return back to try other dishes. I have paid the same restaurant at Mtl a table at a restaurant for some mediocre dishes, but Bonaparte did a good advertisement for themselves. Good job! I highly recommend this restaurant to anyone to try it out."}
{"text":"Simply awesome.  Workers....amazing
Service...amazing
Food....amazing

I had the mushroom raviolis and filet for dinner.  Fantastic

If you are in Montreal traveling and want a nice French meal, go here. 

Great wine selection as well."}
{"text":"Went to Bonaparte to celebrate our anniversary. Pure excellence is the best way to describe it. 5 star service with exquisite cuisine. Perfect for a special occasion or if you're just in the mood for some fine dining."}
{"text":"Classical French cuisine. Located in the Hotel Bonaparte. A very charming restaurant where we sat in an alcove between the 2 main dining areas.

I would give it  4  1/2 stars. Excellent wait staff and a talented French chef.

Started with 'Provençale' style tartlet with parsley flavored snails, great, French onion soup, and vanilla flavored shrimp and scallop harmony and leek fondue, superb.

For entrees, we had the roasted duck breast flavored with maple syrup and wild berries , amazing and a very good chicken breast served with melted brie and sage cream sauce .

The grand finale, a superb, Chocolate chip soufflé.  

They have a great wine list.

Truly a very enjoyable evening and our best dining experience in Montreal."}
{"text":"Ordered appetizer: Soupa a loignon, toast gratine au vieux cheddar with glass of white wine
Entree: Harmoine de petoncles et crevettes a la vanilla, fondue de poireaux
$42.50"}
{"text":"The food was outstanding and classically French. We didn't care for the rose' wine offering they had available so they brought out a rose' from downstairs that wasn't listed on the menu yet. The wine was excellent and we appreciated the accommodation. Beautiful and romantic ambiance - perfect for an anniversary dinner or other special occasion."}
{"text":"It is as lovely and delicious as the reviews say. 

We arrived in Montreal, checked into our hotel, freshened up, and walked to dinner.  

We were warmly greeted and seated at our table. Our group of 6 had an array... Three people ordered from the prix fix - terrific selections and a great value. Three ordered a la carte.

Started with champagne, then two lovely red wines. 

Dinner started with the foie gras, mushroom ravioli - both as good as the other reviews say. Others in our group had onion soup (bowl and grated cheese - not the heavy cheese out in a broiler type) so delish, soup (vegetable with ginger) and salad.  All apps were enthusiastically enjoyed. 

Main  meal included: rack of lamb cooked perfectly, veal chop (spectacular!), filet, and sole. All were great!  

The service was wonderful. Couldn't have imagined a better way to start our vacation. (Thank you!)"}
{"text":"My girlfriend and I are visiting from Tampa and decided to try Restaurant Bonaparte.  Both the service and food were excellent.  My girlfriend's favorite dish was the mushroom ravioli and my favorite was the rack of lamb.  Definitely a place we would visit again."}
{"text":"When I walked in every staff member that walked by was very welcoming. I wa offered a choice of seating in the quieter area or the main room. The decor in both  was lovely.  I can't count how many staff members came over to help and make sure everything was okay. They were all friendly and warm. 
For a starter I has a mixed salad which was a good size and simple yet tasty. 
I was saving room for my main, chicken with a Brie and sage sauce. Words cannot describe how good this was. The chicken was very tender and came with the freshest carrots as well as yellow zucchini and potatoes. The portion size was good as well.  I had the viognier which was just average, but the food was so good I didn't mind.  I would definitely recommend this restaurant."}
{"text":"This was a most pleasant experience.  The food was superb.  My wife had the salmon and I duck.  Both were cooked to our specifications and both were fantastic.  The service was very good.  Ala in all, it was a most enjoyable dining experience in Old Montreal."}
{"text":"I could've just said that it is a posh restaurant with unique delicious food and calm pleasant atmosphere, but it was too good to spare details.

So I start with what was is bad:
- Latte is served in a tall glass without a handle. Yes, it looks great and they give a towel to hold the glass, but I would prefer a simple cup.
- Tea bag. C'mon guys, you have cotton towels in the restroom, and can't brew tea from normal leafs?

That is pretty much everything I can complain about:
- Onion soup was unusually tasty. I have tried it couple of times before and couldn't understand what's all the fuss about. Now I've finally ate a soup, not a mix of onions and salty water.
- Mushroom ravioli were done right - not oversalted and without any aggressive sauce.
- Duck with berries was quite a discovery
- Deserts were perfect. I've ordered two :)

Service consort the dishes: cloakroom attendant was quick and accurate, waiter recommended great wine to match our ducks, all the courses were served on time."}
{"text":"This place was probably very good at some point. So good in fact that it went to their heads and its been downhill ever since. 

I've eaten at some rather fantastic French restaurants in Paris, Lyon, Beaune and throughout the South of France in my life, not to mention restaurants in many of the other great cities of the world. None of them had the arrogance in their manner of service and treatment of clients that this place had. I've seen it a few times before to a lesser degree at those pretend French restaurants (the type where the waiters speak with a French accent, but actually can't speak French -- happened to me in Beverly Hills, California) where they try to bluff their way through, and on rare occasion at restaurants that had once been great and had lost it and were left simply to trade on their former reputation. 

I noticed it the first time we tried to eat at Bonaparte and they sent us away because the kitchen had just closed. Its not that I don't understand the kitchen being closed and thus the inability for them to serve us, but rather it's the manner in which it was done. 

I noticed it the second time on the amazed face of our concierge when she tried to make a dinner reservation. She was astonished at how they treated her, the concierge of one of Old Montreal's top hotels. 

And we experienced it in such full force when we arrived for dinner that we had to leave, never having ordered. It was just such an unwelcoming dismissive arrogance that comes from the restaurant staff thinking the customer is not a customer but a mark who should count himself lucky to be in their presence, totally forgetting that actually they are there to welcome, serve, and make us, the customer, feel special. 

The crowning moment was when the waitress told us how we should not speak French because if we did she would then answer in French and we of course could not understand French. Quelle surprise, given that my family is French and I speak fluent French having lived and gone to school in France, and my wife speaks more than passable French. It just blew us away and was the final straw that popped the bubble of high hopes for dinner at Bonaparte. 

The sad truth is the motto of this restaurant has become \"Bonaparte, where the customer is always wrong.\""}
{"text":"Excelente comida y atención. 
Nos cambiaron el vino sin dudarlo al mencionar que había algo raro con el."}
{"text":"The food was great, beautiful presentation, amazing service. My boyfriend and I are in our mid 20s and we found this place to be for more older crowds. If you are looking for something modern and trendy, this is not the place to go."}
{"text":"Decor: nice and cozy. A bit dark with a beautiful flower on the table. I would not classify the place as casual and was happy I wore a dress to go there. The restaurant is decorated in a Classic French style and we got lucky to get a spot by a window facing a small stone paved street.

Service: people working there take their jobs seriously. They were all men, all dressed to impress and ALL good looking. My boyfriend made a comment to me after a few waiters stopped by asking: \"are they all models here?\"

Food: the food was good. I must say that we got spoiled on our first night in Montreal because we dined in one of the top restaurants which was hard to match after.  The food here provided classic options that were well executed and presented. The soup was great and I liked the take on the smoked salmon. I was especially a fan of the  seafood main course. We had a big selection of courses from a pre-fix menu in a classy atmosphere and at a fair value. Can't beat that..."}
{"text":"If you're having one of those early 7pm nights you know and it's been a day with you craving some fine French dining and cuisine with qualite' then go to Bonaparte on 443 Saint Francois Xavier in Ville Marie not too far from the Basilique Du Notre Dame of Montreal. The food is good especially when it's hard to find good French food these days and if you're talking about price this place is well worth it. The ambience setting is a solid 4.5 out of 5 because the decor is awesome for that formal classic look but yeah the space isn't huge nor is it suppose to be as its situated in a hotel. 
The food now that's where it gets interesting, when walking the streets of old Montreal I was surprised that the restaurant is like one of its kind local hole in the wall joint. The terrine was flavorful, the braised lamb was definitely rich and dense in taste, yet for escargot I guess this is subjective since I like my escargot in shells on tin plate. But all in all this place was solid so for the place and the food, it's one of a kind. Because of the unique qualite, I give it a five. Au revoir."}
{"text":"We had a wonderful meal here.  Service was exceptional. Starter of salmon mousse was delicious, the fish dish was perfectly cooked, and dessert of lime meringue pie was perfect end to the meal.  Recommend!"}
{"text":"Came here for a business dinner. I ordered. The lobster stew which wasn't much of a stew but certainly delicious. It was flavored with vanilla. Very delightful. Finished my meal with a grand marnier soufflé.  It was huge but I consumed every last bit of it. Service was a bit slow but it's expected. The ambiance was traditional and cozy."}
{"text":"On the day of our 20th anniversary, we headed to a traditional quiet French restaurant which did not disappoint.  We lucked out with a quiet table by the window.  Katrine took good care of us throughout the night.

The bread was good to start and butter nice and soft.  We toasted with some Ayala rose champagne before digging into our starters of lobster salad and mixed greens.  Vicki liked the lobster salad and said the maple did a nice job of counteracting the bitterness of hazelnut.  My mixed greens were nicely dressed and fresh.

We both had meat for our mains--venison medallions for me and veal cutlet for her.  Both were good.  Will say that the cutlet was really a chop but that didnt cause a problem.  

To drink we had a 2000 Leoville Poyferre that was terrific.  Just a touch of tannin

For dessert we went souffle and were not disappointed.  These were amazing.  The chocolate souffle was more of a chocolate chip one and while not what I was expecting, the chips were evenly dispersed and created a tremendous flavor burst.  Vicki loved her grand marnier version of the same.  We washed them down with Graham's 20 year old port which seemed appropriate."}
{"text":"Le Bonaparte offre une cuisine française, toujours simple et toujours bien réalisée. En entrée, il faut absolument essayer les ravioli aux champignons, qui sont une spécialité de la maison. Pour le plat principal, j'ai un faible pour le tartare, que je mange relevé, et qui est accompagnée de frites croustillantes et d'une généreuse portion de mayonnaise. La cuisse de canard et le suprême de volaille sont aussi excellents, tout comme le foie gras, qui vaut à lui seul le détour. Si Le Bonaparte n'est pas le seul restaurant montréalais à offrir une excellente cuisine d'inspiration française, il est à mon sens celui où le service est le meilleur. Les serveurs, tous des hommes, comme en France, sont à la fois courtois et effacés. Vraiment, on y retrouve le meilleurs service qui soit à Montréal."}
{"text":"I was a tourist to Montreal, so I wanted to experience the finest dining that Montreal had to offer. This restaurant was good but could not possibly be one of the very best restaurants in the city. The location in Old Montreal and the ambiance of the building made my dinner feel very upscale and romantic. The waiters, who were bilingual by the way, were friendly and prompt. The taste of the food, however, was just OK, especially for the high price. I am still on the lookout for the finest dining in Montreal. Does anyone know?"}
{"text":"I went here with four friends for a night out during a girls weekend. We all agreed that was undoubtedly our favorite meal of our trip. I had the fois gras creme brulee which was phenomenal and exactly what one would desire from a duck fois gras creme brulee. The service was great, although it took about an hour from the time we arrived to get our first course. After that it was fairly consistent.  My friends also raved about their food. High recommendations for the goat cheese appetizer, sage butter sauce, mushroom ravioli, and the soufflé. We all agreed we would go back there the next time we travel to Montreal."}
{"text":"We had the seasonal menu. It never fails to impress when you are started with fresh baguette to accompany your soup.  I had the classic onion soup, which came a with tasty both that wasn't too salty, with a small piece of baguette and cheese that didn't overpower the soup.  

The homemade game terrine came with the perfect combination of condiments that brought out the flavours.  

Filet mignon was done just right-even better than the one I had at Mortons last month. 

The Grand Marnier souffle was a disappointment,  though -- the alcohol was too overwhelming,  and the batter want even mixed properly-- I could taste the sugar crystals! Not impressed. 
Overall however,  it was an outstanding dinner,  with fanatic service.  Classic French cuisine exactly as I've always imaged it to be."}
{"text":"Fantastic, romantic ambiance. Attentive service. Wonderful food. Bonaparte was a great choice for a date with my husband."}
{"text":"Tip: go for 6 course. 

1. Lobster bisque: 4/5. Strong lobster/ocean aroma;
2. Foie gras creme brûlée: 5/5. THE perfect combination of caramelized crust and creamy foie gras content.
3. Mixed green salad: 3.5/5. Fresh, taste not too strong, better than most of salad in town. But it's still a salad, so meh.
4. Shrimp & scallop with vanilla blahblah: 4.5/5. The sauce for this dish is key. The shrimp tastes like it's cooked by the chef one by one - best I've ever had. Scallop is average.
5. Smoked salmon: 4.5/5. Not much of a salmon person but this salmon is smoked to the right extent.
6. Snail: 4/5. No surprise here. 
7. Dover sole fillet: 4.5/5. Also the side rice soaked in oil is gold.
8. Beef mignon: 3.5/5. Sauce too thick and steak a bit too meaty - but some people might like it. 
9. Sorbet in sparkly wine: 4/5 refreshing. Love it.
10. Dessert symphony:3.25/5 (should be less than 3 but cheesecake helped) 
10.1. Creme brûlée: 2/5. Hm....
10.2. Chocolate something: 3.5/5. Meh
10.3. Cheese cake: 4.5/5. I hate cheesecake but this one has a little salty touch that balances the heaviness.
10.4. Cranberry mousse cake: 3/5. More sour than sweet. Some might find it takes out the heaviness from other dessert."}
{"text":"I wanted to try everything so I opted for the 5 course tasting menu which offers their best dishes. The entire meal was delicious and I highly recommend the mushroom raviolis which was seasoned and cooked to perfection."}
{"text":"The service was very good.  I wasn't sure about the two wine I'd like to order so I asked the waitress if I can try both and decide.  She gladly brought me both to try and I am glad I asked and was very happy with the service.

The food was good and beautifully plated. However there was no surprises.  For the price you would expect the food to be at least this good.  In fact, my duck confit was a little on the dry side, and the sauce was a little too salty."}
{"text":"Bonaparte is exactly what I picture when I think of a French restaurant:  very upscale, very conservative, maybe even a little bit stuffy.

But the food is oh-so good!

As was mentioned by another Yelper, this is definitely the kind of establishment that attracts the more experienced generations.  I think we were the youngest patrons by at least a decade.  And be sure to dress appropriately; this is definitely a skirt & blazer kind of establishment.

But unlike many French restaurants you find in the States, conservative does not equal pretentious at Bonaparte.  Our server was happy to engage us in French, instead of forcing the conversation to English as many French speakers will do.  He was friendly and engaging and enthusiastically gave recommendations throughout the meal.  He was everything you could hope for in restaurant service.

And the food was excellent - some of the best traditional French I've ever had.  I'd highly recommend the Duck Confit, the Escargot and the House Foie Gras.

The wine list was also awesome.  I could have spent the day just talking wine with the waiter.  Even if you don't usually drink wine at a restaurant, I'd recommend you indulge here.

My only regret:  in hindsight we should have chosen the tasting menu.  I can only imagine."}
{"text":"The ambience of this restaurant was fantastic. We had a very romantic candlelit table next to the fireplace and the service was great. However, we dined there last evening and ordered from the tasting menu. My meal was fantastic - I ordered the salad to start, the goat cheese tartine, escargot and the filet. My boyfriend ordered the lobster bisque, fois gras creme brûlée, and the Duck. He's been violently ill with food poisoning since last night. I would use caution when ordering and make sure that everything is done at least medium well to try to avoid this. I would hope this restaurant pays more attention in the future to the temperature of its food and the freshness of its food. This would have been a five star review had the meal not caused him to be sick."}
{"text":"It was our first wedding anniversary. My wife and I were visiting Montreal for the first time. Our server was so professional and courteous. She even surprised us by putting sparklers in our dessert order to celebrate our anniversary. The atmosphere was very sophisticated. The food was wonderful as well. The flavors were complex and the presentation was beautiful."}
{"text":"Bonaparte is by far our favorite restaurant we have been to since we have been together! To start, the staff is wonderful! They are absolutely lovely, attentive, knowledgeable, polite, and friendly.
The good is outstanding. We started with the lobster bisque and the escargot. Wow! Delightful!
The main course... I can't stop talking about it! The lobster linguini was just incredible. I thought I was getting bits of lobster with a full plate of linguini... was I wrong!  I had a full lobster with a small side of linguini and vegetables! We can't say enough about this restaurant! It is an absolute must if you visit Old Montreal!"}
{"text":"Loved this place! Came to Montreal for a visit and tried a bunch of places in my short stay but this is by far my favorite. The ambiance is romantic but not too quiet. The food is delicious. A little pricy but not too bad when converted to American dollars. I got the lobster bisque which is AMAZING! And the duck as my main course and it was FANTASTIC. My friends loved their onion soups and the goat cheese appetizer (which I tried and I conquer!). The dessert is good. I'd definitely skip the soufflé it was way too eggy. But then again I was never a fan of soufflé. The cheese cake and chocolate cake were delicious though. I highly recommend this place."}
{"text":"First off, based on other reviews it's possible we had a unique experience at Bonaparte, or just that our server simply did not like us.  It was Christmas Eve and maybe the place was more busy than usual, but everyone included the manager and host seemed to be running around like chickens with their heads cut off.  That made it a bit difficult to relax and enjoy the ambiance in this beautifully decorated restaurant in the heart of Old Montreal.

The goat cheese, ravioli and escargot appetizers were amazing, as was the Onion soup (not too filling!).  The bread was excellent and they kept it coming.  But the service aside from that was continually disappointing. He did not take our drink orders before attempting to get our food orders. He was reluctant to answer questions and seemed distracted and irritated, often not making eye contact and watching other tables while speaking to us. He also walked away before we finished ordering and seemed angry with us when we grabbed him to complete our order! This gentlemen didn't just seem to be busy but rather just seemed to be an unpleasant person. Given the expense of our final bill ($275!) I would expect to be treated at least as nicely as I had been in the basic irish pub we dined in the night before."}
{"text":"Had an amazing meal here with friends on our last night in Montreal. The five of us were there at opening and were quite lucky that another table canceled earlier in the day and we were able to get seats on an otherwise fully booked night. Before even entering, the menu posted outside caught our eye. 

In our group of five, four of us ordered the tasting menu. One had special gluten-free dietary restrictions and they were happy to alter every dish for her as needed. One was a vegetarian and ordered off the ala carte menu. They were even so kind to bring our friend gluten free bread and a separate butter just for her.

The first course on my tasting menu was the lobster bisque. It was smooth and creamy with good lobster flavor. The second course was foie gras creme brulee. This dish was fantastic. The creamy foie gras with the caramelized crispy top served with bread and a bit of apple was a fantastic combination of flavors. Third course was escargot on cripsy filo dough. The escargot was the most tender escargot I have ever had although normally I like a little bit of chew in my escargot. Fourth course was a simple pear sorbet palate cleanser in champagne. Simple but refreshing. I was fully ready for my main course by then. For my fifth and main course, I had the lamb chops. They were cooked to a perfect medium rare and served with a red wine reduction sauce. It was the most tender lamb chops I have ever had. I would go back again just for those lamb chops. The sixth and final course was an array of desserts including creme brulee, cheesecake, chocolate cake, and raspberry jelly cake. All were very good although I was not a big fan of the raspberry jelly cake.

The entire tasting menu was also a great value at $78. Coming from New York City, this was a steal. We were all incredibly happy at the end of our meal that we just happened to run into this gem of a restaurant. To top it off, the service was also impeccable and our waitress happily catered to our group's dietary restrictions. I highly recommend this restaurant and would definitely come back again on my next trip to Montreal."}
{"text":"Lovely restaurant, excellent service, and beautiful delicious food. Had a wonderful evening and a fabulous dinner."}
{"text":"The type of classic French restaurant that's largely disappeared from the DC area.  Our table afforded a view of an Old Montreal cobblestone street. The interior is OK but come for the food and service.

Service was superb - warm, gracious, attentive, informed, enthused in a low-key manner, but never intrusive.

We started with a vegetable soup and a mushroom ravioli.  After so many ravioli where you're not quite sure what the filling is, here were half a dozen exquisite ravioli with a distinct mushroom taste.

Seconds: perfect duck confit and scallops, both served with mushroom fricassee on beautifully arranged plates. 

To conclude, a very nice Armagnac.

We ended the meal feeling that we ate very well and were served very well."}
{"text":"I went back to Bonaparte this evening after a 17-year hiatus, and this time took my husband as we were celebrating our wedding anniversary. So often in this life, when you've had a memorable experience and then foolishly seek to repeat it, it fails to equal your memory... but here the second visit didn't disappoint. The meal, the classy ambiance, the completely professional service, were all just as I remembered. 

Being a somewhat ADD eater, I chose the $72 tasting menu (degustation) as I don't enjoy coming face to face with a whole plate of anything; I'm bored by the 4th or 5th bite.

First course (lobster bisque) was beautifully balanced; so often chefs gild the lily where lobster is concerned, piling on the richness, but here, the star ingredient spoke for itself. 

Second course - goat cheese in phyllo - was nice but didn't \"send\" me - perhaps the weakest point in the menu - next time I'll take the home-cured salmon. 

But the third course, the mushroom ravioli, alone were worth the price of admission. It is the surest proof of my love for my husband that I generously gave him one whole ravioli of the four, for I could have gone on forever experiencing that particular combination of taste and texture - translucent pasta enveloping intense but not overbearing mushroom filling, the whole lightly bathed in butter. 

Again, the sense of balance, of not overdoing anything, of honoring tradition in French cuisine rather than grasping at the latest trend, was apparent on the plate. I doubt there's any liquid nitrogen or yuzu foam in that kitchen, and that's a good thing, for there ought to be places that don't chase food fads, yet remain worth your time and money - because what they do is both classic and superb. 

Then a palate-clearing pear sorbet, a perfectly timed pause, and the main course. Mine, the sole meuniere with pine nuts, was a beautifully cooked sampler in which the vegetables actually managed to outshine the protein, no insult intended to the protein. There was a mere half of cherry tomato perched atop a small phyllo coupe of spaghetti squash. Inconsequential, you would think. Yet when I bit into the tomato, the flavor sang out like the 7000-pipe organ at Notre Dame up the street. Every tiny thing on that plate was a finely carved jewel. My husband (who was eating a la carte) said his filet mignon was one of the 5 best he'd ever had - and this is a man who's been eating that particular cut at the top steakhouses of DC and other major metropolises for decades. He even ate his vegetables - unheard of! :-)

Another welcome pause, with a sense of leisure for digesting all the above and enjoying conversation, ended when dessert arrived. My husband ordered the chocolate souffle and was rewarded with a gorgeously light yet substantial creation. I judged this to be the right moment to cash in my IOU from the mushroom ravioli I'd given him - I got several bites. So often I find chocolate desserts disappointing: either they're not sufficiently vivid in their chocolate-ness, or they go too far and become heavy and gummy.  Not here - the ganache was perfectly vivid without weighing anything down.

My own plate, the \"dessert symphony,\" was a mini-version of the memorable plate I'd had 17 years earlier. The intense strawberry mousse, the chocolate hazelnut tower with its little crunchy bits, the creme brulee with its deliciously bitter burnt sugar crust, were all superb -- and again, the attention to tiny details rewards those who don't assume that little slice of hard-to-identify fruit atop the creme chantilly is just a decoration - it's not - it rewards with a burst of flavor all its own. My one \"whine\" is the cheesecake, which was OK but not top of the heap in the dessert universe - a bit bland when juxtaposed with its companions on the plate. 

We passed a lovely two-plus hours, eating and chatting in a lovely quiet alcove near the window, never feeling rushed, never having to wave franticallly for attention, never drumming our fingers and wondering when the food might appear... all these experiences, so common at other establishments, are not part of our experience with Bonaparte.  We came away replete, fulfilled, happy. Merci de tout coeur to Gerard Fort and to all the staff at Bonaparte."}
{"text":"Don't even get me started because I will just rave and rave. A group of six and we all ordered different entrees and tried one anothers. The lamb, the duck, the lobster stew and the chicken were so dang amazing. But listen to me when I say get the chicken. It had melted Brie cheese and my goodness it was THE best thing I have ever tasted. The presentation was beautiful and the price was so worth it! Service wasn't bad but that was because they were super packed on a saturday night. Creme Brûlée was the best I have ever had! Thank you Bonaparte and we will definitely be coming back with every trip to Montreal!"}
{"text":"Went here with my girlfriend on Dec 30th. It was excellent. One of the best restaurants I have ever been to. 

Interior of the restaurant was nice, clean, new. 
I ordered the salmon and it was cooked perfectly. The vegetables were also cooked perfect and everything tasted great. I was expecting the portion sizes to be smaller but they actually were decent. 

I also ordered a dessert which was essentially samples of multiple desserts. All were great! The chocolate fudge cake and cheesecake might've been the top 2 but even the sorbets were very tasty. 

My only critique was that the beer menu was very small and that some of the workers seemed a bit smug. But enjoyed Bonaparte very much. Would absolutely recommend and return if visiting Montreal."}
{"text":"Excellent food and very satisfying. I am a picky and big eater and was afraid of the portion sizes being too small. It was exactly the right size, yet giving me a small craving for more. The pre fixed menu made decisions easier, and the service was excellent. Just be ready to drop $135 per person."}
{"text":"We were there as a big group of 16 people, so we had a pre-fixe menu. I did request to get their Foie Gras creme brûlée, and they were kind enough to accommodate. It was truly delicious. The salmon was cooked just right, and was one of the best salmon dishes I have had. Dessert was OK."}
{"text":"It is a OK place. The staff is slow though the service is OK. Food is not as good as we expected. Price is reasonable."}
{"text":"I was in Montreal for my birthday and we went to dinner to celebrate at this french restaurant. The foie gras creme brulee was amazing. I am from france and I was baffled. Duck confit and filet mignon were really good too. The one complain I have would be the sides - In my world, duck confit always goes with sauteed potatoes and steamed veggies just won't cut it. Still 5 stars for my foie gras creme brulee hands down!"}
{"text":"Everything about this hotel was fabulous. We stayed here for a romantic night and were greeted with \"Hellos\" and champagne. Our room was spacious and they upgraded us to a room with a spa jacuzzi! The service was great and they also helped us figure out nice attractions to see during our visit. This is probably the best part, because this hotel is within walking distance of plenty of restaurants, stores and main square. Plus the hotel is easy to find and there's parking right across the street for about $15/day."}
{"text":"Charming restaurant with an European feel. The general mood of the place - its dim light, pictures and wood panels / rich colored decor - is relaxed and has a certain timelessness about it. 

Don't expect very fast service. You're here for an un-rushed time.   Take your time to order your food... and it'll be many moments before your food arrives; many moments between courses. But who's keeping time?

Service staff are pleasant. It's a weekday night but the place is full so they are constantly on the move. Still, they are composed and unruffled. 

The menu has a good selection of dishes. I had the lobster bisque and lobster as main course. Excellent choices! 

Overall a lovely evening!"}
{"text":"Best French restaurant in Montreal. Classic decor in a hotel and very classy ambience. Don't get deterred by the construction going on around rhe neighborhood. Food is cooked in a very sophisticated way with a variety of fancy ingredients to offer. Must go place in Montreal for a classic and high-end French experience! Totally overlooked other 3-4 star French places we have been so far in Montreal and Quebec City."}
{"text":"I cam here to try something new, since the reviews were great. It was kinda of disappointing. The food is good no objection there, however the price is way over the norm. Minimum of 40$ per person just for the main dish. 16$ salads? really? We were a group of 4, and the final bill did really shock us. 

The service is average, nothing extraordinary and in need of some improvement, waiters do need to be polite to their customers and not give attitude when you ask questions about items on the menu.

The restaurant is a nice decor. It has the vision of the Old Montreal area.

If you have the wallet, I do suggest you try it. However I shall not return for a average quality meal at the price they are charging.

https://www.tripadvisor.ca/ShowUserReviews-g155032-d777728-r356102317-Bonaparte-Montreal_Quebec.html#"}
{"text":"Loved, loved, loved this place!  We only stayed one night here as we extended our stay in Montreal last minute and already had reservations elsewhere.  I wish we could have stayed here longer as this was my favorite of the three that we stayed at.  We were able to check in early and walked into a beautiful room with tall ceilings, wooden floors, and a lovely brick wall.  It's in a perfect location for exploring--everything is close by.  The included breakfast was fantastic!  Service was top notch at the restaurant (we had the tasting menu for dinner and it was our favorite meal of the trip) and at the front desk.  When we return to Montreal, we will definitely stay here again."}
{"text":"we had the foie gras brulee, terrine, duck leg, lobster stew and the veal cutlet.  our desserts were the creme brulee and chocolate souffle.
it was quite busy for a monday night...so, the service was a bit slow and unattentive.
the foie gras brulee was more brulee than foie. couldnt really taste the foie since it was too close to the creaminess of the custard.  The terrine was ok.
Lobster stew is very good...the presentation and the sauce.  I would recommend it. Duck leg was a bit over cooked and dry on the edges. My veal was also overcooked from medium rare...no pinkish center at all. But fortunately, the quality of the meat was good, so it was tender still....but i would have prefered it a bit rarer.

dessert was very good.
souffle was big! i dont know how they got it to be so fluffly and perfect! it was injected with yummy chocolate which worked wonderfully. It was unusualy airey but not cakey.....and the ramekin was lined with sugar which gave it a nice sweet bite. im very happy with this order.
 The creme brulee was very light with a nice crisp carmelize crust. above average."}
{"text":"Everything was great.

We made reservations through OpenTable a couple nights ahead. We arrived a bit early but our table was ready. 

The restaurant is a part of a hotel and it is fancy and quiet. I had to talk in my \"library voice\".

The waiter brought over our menus and water. They gave us some time to look over the menu and asked if we had any questions. 

We ordered a half bottle of the riesling and started with the lobster bisque and Duck foie gras crème brulée. Everybody LOVED the duck foie gras and said it was delicious. The lobster bisque was OK. Its not New England lobster bisque (obviously), it tasted more like shrimp soup, but it was still good.

For an entree, I had the duck breast. My friends got the duck confit and the rack of lamb. All the entrees were delicious. I was most surprised by the lamb. It was so tender and not gamy. Both duck entrees were really good as well. The duck confit was really flavorful and tender. The meat just fell right off the bone and melted in my mouth.

For dessert, we shared the profiterole and a grand marnier souffle. As stated on the menu, these dessert requires 18 minutes to prepare. The profiteroles were amazing. The puffs tasted really fresh and had a slight crunchy layer on the outside. They were filled with very delicious vanilla ice cream topped with chocolate sauce. The souffle was really good as well. I think this is the first time I've had \"real\" souffle. It was really light and fluffy. NomNomNommmm A bit heavy on the grand marnier, but hey, no one's complaining about that.

I would definitely recommend this place. Again, the food was excellent,  the service was great. They called me Madame every time i spoke and it made me giggle - Yes, I'm five."}
{"text":"Beautiful restaurant in a nice hotel. Like the decor and lighting. Great service overall. Tasting menu provides balanced experience with a couple of impressive highlights. I will definitely go back again in my next visit to Montreal."}
{"text":"On our recent trip to Montreal, we decided to try French cuisine. After reading several reviews, we decided to have our last dinner in Montreal in this wonderful restaurant. This restaurant is situated in the beautiful Old Montreal, but the entrance to restaurant is torn apart due to construction of the road. The sight is not at all inviting but don't let that deter you from dining in this fine restaurant. Luckily we were there on the last day of the restaurant tasting week and hence got amazing 4 course meal at a very discounted price.. thanks to the server for providing us with the information. I ordered for fresh salad, smoked salmon as my appetizer. The smoked salmon was delicious. We also had the duck foie gras creme brûlée and it was fantastic. For the entree I chose the catch of the day and it was tilapia... the dish was made perfect and blended very well with my wine. The fabulous dinner ended with mouth watering dessert- it was amazing. The ambience was perfect and cozy. The service was top notch and attentive yet not intruding. This was a wonderful dining experience with excellent food & service and thus made our last day of the trip memorable. Thank you Bonaparte :)"}
{"text":"This may have been the best dining experience I've ever had. I got the 8 course tasting menu and each course was perfect. The demi-glace with the duck for the main entree was nothing short of incredible. The wine selection was superb and we picked a wonderful Bordeaux but the best part of the evening was the service. The staff there is incredible and very knowledgable and treated us very well. We would return in a heartbeat."}
{"text":"I dined here with my bf and we did the full tasting menu. It is not to be missed! The food was wonderfully French but not too out there (I find certain foods too refined for my palate such as escargot and foie gras). Between the two of us, we tried almost everything and not a single thing were we not impressed with. The lamb deserves special mention as it made me a convert. Give yourself plenty of time (our dinner was 3 hours), order a bottle of wine, sit back and enjoy the night. The pace was perfect and made for a truly memorable meal."}
{"text":"This is a five star French restaurant. From your entry off the street in Old Montreal until your final sip of coffee after dessert, we had a most memorable meal. The presentations of all items was very visually enticing and the flavors mouth watering. Colors, textures were attentively managed. My wife and I sampled the Table d'Hote while our son feasted on the Lobster stew. Terrine de gibier maison starter, Bison hanger steak, and Creme caramel dessert. The serving staff was super friendly and on the mark, too. Great way for us to end our first evening in Montreal!"}
{"text":"+.5 for service

This is the 4th French restaurant I tried in Montreal, and I do think it's the best one, at least out of the 4 I tried. I really like the ambience and setting of this restaurant, given the location in Old Montreal. It really does give the French-style dining feel that's quite common in these kinds of restaurants. 

There are three types of menus here: A la carte, table d'hote, and the tasting menu. Unlike many reviews here, I actually went with a la carte...not a fan of the whole tasting menu concept, and I do have an okay idea of what to expect for French cuisine.

My family ordered the french onion soup, lobster bisque, smoked duck breast, escargots, vanilla flavoured shrimp, rack of lamb, and the veal chop. We finished off with a chocolate chip soufflé and a cheesecake.

Where do I start...for the soups, the lobster bisque is definitely strong in the lobster fragrance category. I felt the taste was a bit light, but nothing too terrible about it. The french onion soup isn't the type with baked cheese on top, so do keep that in mind. I'd stick with the lobster bisque next time. Smoked duck breast, escargots, and vanilla flavoured shrimp were all uniquely presented and equally delicious. The rack of lamb was grilled perfectly, while the veal chop was a little bit more rare than what we requested (medium rare vs. medium).

The desserts are a must here. Both the cheesecake and soufflé were some of the best I had; I definitely recommend the soufflé at the very least, even if it's a 15 minute wait.

Service is excellent, all servers are bilingual. Of course, as common courtesy, do attempt to at least speak a bit of French.

Will definitely recommend to my friends!"}
{"text":"Fancy but boring food. Nothing innovative or new. I ordered the filet minon and asked for medium rare and they served me a well done gray piece of meat. The server offered to take it back, but then my wife's food would have gotten cold while I was waiting for a new plate. For $40 piece of meat, I expect it to be cooked properly the first time. Way over priced when there are such better restaurants in Old Montreal for much less."}
{"text":"I have to say thank you to the staff. Not only was this the best service I received while I was in Canada but they also knew their menu and made outstanding recommendations. My fiancée and I both tried their table d'hote. Very reasonably priced and left me walking away wishing I had restaurants in Las Vegas. The lamb and duck sausage was simple amazing and cooked to perfection. The pork tenderloin was on point. A little sweet for my tastes but was exactly as the menu described. I promise if you eat here you shall not be disappointed."}
{"text":"Had the most delicious meal here with a group of 16! We had our own room off to one side which was cozy (and a little too warm!) but the food was superb and the service outstanding. Very French type cuisine with prices that weren't too bad if you ordered from the table d'hote which we found reasonable. Would dfefinitely recommend this establishment to anyone visiting Old Montreal!"}
{"text":"After what seemed to be a 10 year walk in 15ºF temps, our group finally found our reservation spot for the night. The restaurant was very well appointed, warm and cozy. We were nicely greeted with 2 gentlemen that took all our coats. 

For starters, I ordered the lobster bisque enhanced with ginger. Loved it. Then I had the rack of lamb with port wine sauce and Niçoise style ratatouille. The presenation of the dish was spectacular. I didn't even want to eat it anymore! The lamb itself was cooked perfectly.

I can't remember what else the group ordered but everyone left very pleased. Maybe it was because of the 2 bottles of wine we ordered? I'm sure we all needed to warm up inside before the walk back to the hotel.

Oh and when you walk out, they actually get your coats and help you put it on! Excellent service."}
{"text":"Just checking out and had a wonderful stay here at the Bonaparte! Room was beautiful and comfortable with hard wood floors, large windows and high ceilings. The bathroom was huge with a large modern shower. The staff was eager to please and pleasant. They have a parking lot across the cobble stone street for an extra $20 a day which was very convenient since parking is tough and a car is absolutely not needed since everything is in walking distance. Highly recommended!"}
{"text":"Looked like a nice place, but overall I'd rate this more of a tourist spot.  I noticed many of the clients were not locals but Americans like us.  The service was pretty good but the food was ok at best.  I tried the 7 course menu and the dishes were hit or miss.  

The prices aren't bad which helped make the situation a bit better.  I'm glad they were able to take in a group of 16 people which was nice."}
{"text":"Alright but not great!

Was really excited to see them on thrust of restaurants for Montreal a Table menu at $41.

Started with the vegetable soup which was decent, not too salty. You can taste the ginger, tomato and carrots and probably some squash or pumpkin.

Then followed by the creme brûlée au foie gras. I want to say that they chef did a horrible pairing with the bread. The cinnamon raisin bread definitely  overpowered and you can't taste the foie gras. I had to spread my foie gras on the table bread and it was much better. The texture was silky and the sugar coat added a nice texture and taste to the foie gras.

Took the magret de canard with maple syrup and wild fruit sauce. I have to say that the duck was cooked perfectly...medium rare. However, the sauce was lacking substance...almost not enough flavour.

Dessert was a combination of small pieces of cakes and creme brûlée...alright but not mind blowing.

I'm really disappointed from this first experience given the good reviews on Yelp!"}
{"text":"Nous avons mangé  : 

-Entrée pétoncles, crevettes salade de poireaux sauce vanille : Excellent
-Thon bleu sauce balsamique : Pièce de poisson généreuse et très bonne. Un peu déçue par l'accompagnement (mix patates douces avec le poisson )
- Dessert : Crème brûlée à la mandarine : Absolument décadent, portion très généreuse (à partager)"}
{"text":"One of my favourite restaurants in Montreal. As a Montrealer I am proud that we have some excellent restaurants in the touristy Old Town and this definitely is one of them. The interior is beautiful and you can choose from 3 different atmospheres. The staff and service is friendly and courteous which makes for a relaxed yet classy dining experience. The food is very good and with different set menu options you can indulge with ,in my opinion fair pricing. I love their mushroom ravioli appetizer ( the lightest I have ever had ), their fois gras esp the fois gras creme brule which not often found on Montreal menus. I also like their meat and Dover sole which is delicious and beautifully presented."}
{"text":"My wife and I had dinner here our last night in Montreal. It was perfect. We chose the Table d'hote menu. My wife had the mixed green salad, the beef with garden vegetables, and chocolate mousse. I had marinated scallops with cucumbers, rock fish with garden vegetables, and creme brulee. Each dish was prepared flawlessly. 

The service was also flawless. We were greeted graciously, and taken care of all through the evening with friendly professionalism. 

You should eat here if you are in Montreal."}
{"text":"Tried it, and moving on..

::Pros::
Restaurant Bonaparte is a excellent date restaurant.
Nice ambiance with the fancy waiter get up
Good Service.
Decent price for the dishes

xx-CONS-xx
I ordered the Peppercorn, Filet Mignon w/ a Cognac sauce. The meat was \"soft\", and that is about it. The peppercorn gave it the mild kick, but the cognac sauce didn't do much but sit there looking brown...

Some of my buddies got the 6 - 8 course meals. Each of the dishes looked tasty (duck foie creme brulee,  snails, duck breast, and such).. At the end they all looked unsatisfied with the meal. 

It is a nice spot, but the food is mediocre to say the best."}
{"text":"Fabulous French cuisine.  We enjoyed the six course sampling menu. Each dish was amazing. The mushroom ravioli may be the best we've ever tasted. A top five restaurant all time for us. Service was attentive and the pacing of the different courses was perfect."}
{"text":"Some of the Yelp reviews mentioned lackluster service, so I had low expectations coming here. However, the waitstaff was very attentive - no problem whatsoever!

Now on to the food. The $78 tasting menu is a good deal. Go for it!

As many have already said, the creme brûlée style foie gras is imaginative. However, like others, I can't understand why they chose to pair it with cake-y bread. It's like a bad VP running mate (think Sarah Palin). Why? Just why?!

The mushroom ravioli dish tasted super buttery - not a bad thing in my book. 

The duck was a little tougher than medium rare calls for, but tasty nonetheless.

They went overboard with the dessert. No one needs chocolate cake, raspberry cake, cheese cake, AND creme brûlée all at the same time, however small the portions. Two would've been perfect.

The ambience was average, neither too casual nor too formal or romantic. 

Overall, a solid choice."}
{"text":"I went with my fiance for a short getaway from it all.. and so we escaped here.  This was probably the BEST recommendation we had in all of Montreal.  We went here for lunch.. it was a nicer restaurant than we expected... and it was delicious.  We went for the prix fixe lunch.. delicious!  Lots of choices and all very good.  I really liked my duck confit (with the duck leg) and my fiance enjoyed his pork tenderloin.  Very tender!  Delicious wine list as well.. very nice.. not snobby.. I would go again."}
{"text":"You will begin by being courteously greeted by the host. A gentleman with very good taste in attire and who possesses fine manners. After being seated an explanation if the dishes is underway. Thorough wine pairing suggestions also follows. The food was absolutely delicious and you're treated like a king/queen. They have their dining etiquette down as a chic restaurant should have. A must try."}
{"text":"This is an absolutely spectacular restaurant.  I had a lovely solo visit recently where I was treated like a king, both in one of the lovely intimate dining spaces (there are several, all gorgeous) and at the bar.  The food was outstanding (I had the tasting menu), with probably the best duck I've ever had in my life.  The servers were incredibly friendly, yet not overbearing, and they knew when to chat and when not to.  The bartender who served my after-meal cognac was fantastic.  He let me bombard him with my bad French and he didn't flinch.  He was a superstar!  And, he gave me two cognacs for the price of one, since the one I ordered was the last in the bottle and didn't quite make up one serving.  Everyone here was having the time of their lives, and it was a Sunday night!  Make sure you get a reservation (or are willing to sit at the bar) because I observed numerous walk-ins who were sadly turned away for lack of available seating.  This is a very popular spot, as well it should be, since food and atmosphere are first rate.  I cannot wait to return!"}
{"text":"Went in to celebrate a special occasion and had an amazing experience. Our water was attentive without being obtrusive. I'm not really a wine drinker, and I anticipated static for just having water with our meals, but that went over wonderfully.

We had the Menu Estival, and it was really great. It an added plus that it didn't really break the bank either. 

The next time I find myself in Montreal, I'll be finding myself in Restaurant Bonaparte as well."}
{"text":"Went for an 8pm dinner with some friend after watch Alegria.  Everything started off well enough, the food was good and service was fine. after the appetizer for  the Table d'hote, we didn't see our waiter again at our table until we had to flag him down at the end of the night.  In his place was what seemed to be the bus boy or something.  This guy did not replace the steak knife that he had removed with the appetizer, he did not refill water until dessert, he took forever to take our dessert order, he didn't bring sugar/cream with the coffee or tea and took forever to get us our bill.  Overall, we spent close to 3 hours for dinner when it should have taken only 2.  I was not pleased with this as we still had to drive back to Ottawa and work the next morning.

The food was definitely worth it, but the service was severely lack from what I thought was a nice establishment"}
{"text":"What a treat! Go here if you are looking for an intimate,beautiful Restuarant with fantastic food. With a pre-fixed menu,  for $41 you can get an appetizer, dinner & desert. There are a ton of options with a quite extensive and lavish food and wine list. My favorite part was the peppercorn steak which was cooked perfectly. Wait staff was extremely friendly and attentive. Can't wait to go back!  Pictured is my delicious dessert (key lime/lemon meringue pie and tea) included in the pre-fixed menu."}
{"text":"This is a fantastic gem. Boutique hotel that is reasonable, comfortable, superbly clean and the staff are fantastic. They did everything a hotel should do and so much more. They helped me plan my way to the hotel from the airport. They had my room ready very early. They gave me an umbrella for a rainy day. They exchanged money for me. They helped me plan my days. The restaurant breakfast that is included with the room is 5 star, like on a cruise. The dinner we had in the restaurant was magnificent with top notch service.  I would go there again and again only because I enjoyed my hotel stay. Merci beaucoup, Auberge Bonaparte. A bientot!"}
{"text":"I rarely give 5 stars, but this restaurant deserves it! Our hotel concierge recommended Bonaparte for our 10th anniversary dinner, and we are so glad he did! The dining space is classic French elegance. Expect a 2 to 3 hour meal. We had a table for two by the front window-perfectly intimate. We did the tasting menu, approximately $75 Canadian dollars per person, which had 7 courses. Portion sizes were great and the plates were almost too beautiful to eat. Everything we had was wonderful, done in traditional French style. The best part for me personally was that our concierge had informed them of my gluten allergy and they not only catered my whole meal to that, they made gluten free bread for me! I almost cried. We ended the meal with sparklers in our dessert course. A truly wonderful dining experience!"}
{"text":"This is a cute little place attached to a hotel. It's in old town and on a cobblestone street. The service was superb - our waitress was very nice and very helpful. The food was also excellent - I tried their fish. The salad before the main course was slightly strange...apparently in Montreal (or all of Canada?) they have this oil-based dressing that they call \"house\" dressing everywhere and by the time I had this salad, I'd already had 3 at other places and I was honestly tired of the same dressing. But, overall the food was wonderful and the chocolate mousse (of course!) was my favorite! Amazing time!"}
{"text":"Talk about a huge screw up, wow. Such a disappointment, after all the expectations I had. Order Med rare lamb chops, after two hours I received a Med well order. Wow did I have an issue with that. After half my order was messed up and after the manager comping my meal, it still does not justify the disappointment and the ability for them to ruin my wife's birthday. This place messed up big time and I would never recommend them to anyone. My preset tasting menu turned out to be such a huge failure, you guys really need to get it together. The filet mignon, wasn't filet mignon, they used a much cheaper cut of meat"}
{"text":"This is a great place for a night out. Make sure you reserve ahead online ( I did it via OpenTable).
The ambience is great, noise level is just right. The environment is semi-formal ish (just a dress shit for guys would do it).

The tasting menu is great; good amount of food and great selections. The service was also excellent. Overall a great dining experience."}
{"text":"Came here a second time because I loved their mushroom ravioli the first time around.

Same quality, and pretty much almost the same menu. You have several options in each course, so if you're craving one type of meat/vegetable over the other, than you can choose that and not be restrained to a typical fixed menu.

Wine list is great, and their sommelier can give their best recommendation.

Dressy atmosphere, and you can do reservations, but I'm pretty sure you can walk in as well.

Very nice date place."}
{"text":"We return to Bonaparte every year when we come to Montreal for the jazz festival.  It is our major indulgence and never disappoints.  Highly recommend making a reservation.

They had renovated the interior since 2015 and it looks even better.  We started with a drink at the bar.  The bartender was friendly and helpful.  After making an excellent Manhattan he then spent quite a bit of time helping a customer from the day before identify the liquor he drank with a previous dinner.  I was impressed by the bartender's patience and professionalism (don't know why the customer didn't take a photo of the liquor bottle at the time he drank it.)

We splurge on the tasting menu and enjoy a leisurely meal.  As others have written, the portions are not small so you need to pace yourself.  This year my husband had the duck and it was delicious.  I had the filet mignon - yum!  

The staff is always excellent and I like how the managers will pitch in to deliver food or even help to clear a table.

We will return in July 2017."}
{"text":"I'm from Toronto and was in Montréal twice in a span of 2 weeks.
On my second trip I was checking out the Notre Dame Basilica and was determined to find a great place to eat before my ride back to Toronto. Thank you yelpers.

You absolutely need a reservation or get ready to sit at the bar-I sat at the bar and had superb service.

To drink I had a tasty well presented Caesar(lemon, celery, 3 quality olives).

The presentation/taste of the bread was lovely, two options baguette or a dense nutty option.

I started with a Lobster bisque soup-good.

Mushroom Ravioli in a sage cream sauce- melt in your mouth excellence, the pasta was light which I liked

For dessert I went with the chocolate mousse-it had a bit of a coffee flavor-just enough and tasty.

I noticed one of the yelpers stated the servers look like models-I picked up on that as well lol.

A great experience in Old Montréal
Older crowd"}
{"text":"Solid meal, and actually not as pricy as I anticipated.

Atmosphere: Fancy, proper, clean. Spacious. I was scared I wasn't dressed fancy enough but people were in there with jeans and bags and everything, so they won't turn you away at least, haha.

Food: Ordered a la carte. For starters, got the provencale style tartlet with parsley flavoured snails. Quite delightful! The snails had a good texture, and were heavily flavoured with what almost tasted like pesto. They were complimented by a yummy layer of puff pastry and the small salad-like accompaniment was delicious and tangy and tart. For my main, I ordered the Roasted duck breast flavored with maple syrup and wild berries. It was filling, the meat was tender, and the dish was very, very sweet. My partner ordered the Seafood and dish linguini with lobster sauce, and that was amazing. It looks like a little dish but it is packed with seafood and flavor. For dessert, we ordered the grand marnier souffle. I must admit, this tasted TOO much like gran marnier. If you don't want your dessert to taste like straight up alcohol, don't get this. 

Service: Quick, friendly, attentive.

Overall, good dining experience and would recommend."}
{"text":"I realistically rate this a 3.5 but I went to Restaurant Bonaparte with the SO on a Saturday night. Initially, we had a reservation at 6 PM but had a MUCH too full lunch so we ended up pushing our dinner way later at 10 PM. Even at 9:30, there was a half hour wait for dinner. Man, we knew this place would be good. The ambiance is definitely romantic and the dim lighting sets the mood for a good night on the town. The service was so-so. Our waiter was quite busy and didn't attend to us too much but that was okay. I ordered the Escargot in a puff pastry while the SO got onion soup. The escargot was pretty good and the fact that it was in a puff pastry and no tin the typical trays for escargot was a little sad for me but it definitely screamed snail for me. The onion soup was oniony. Not the two best highlights for me that night. However, when I got duck confit, it was absolute heaven. I never had duck that was so soft with a skin that was borderline crunchy and too tough (depending on what you like). I loved that duck along with the sauce that the duck was cooked in. It was also quite juicy and delicious as well! However, my SO's salmon was not the best and the portion size he got was smaller than we had thought. However, that makes sense since it is a French restaurant so meat is king. After the appetizer and entree, we were totally stuffed to the brim. NO MORE, NO MORE, we were screaming. I would probably not go back again unless we were going to get the prix fixe menus."}
{"text":"I came here for Christmas Eve dinner and it was absolutely wonderful from start to finish. I was seated at a table by the window, which was on  a lovely narrow cobbled lane. I started with the salad, which was lovely and dressed perfectly. Then came the salmon tartare, delicious.  Next was an intermezzo (palate cleansing sorbet). My entree was barramundi, which may one of the best fish dishes I have ever eaten in my life; simply prepared, but bursting with fresh flavor. I would have licked my plate clean if I didn't hope to return there someday. For dessert I chose a creme caramel, which was the only part of the meal which, while fine, did not wow me.  My glass of pinot grigio was pretty good and only $7, very reasonable for a restaurant of that caliber. Service was perfectly balanced between attentiveness and allowing me to dine in peace and eat a my leisurely pace.
I absolutely intend to go back when I visit Montreal again.
c;est magnifique!"}
{"text":"We celebrated our one year wedding anniversary at Bonaparte and the food was simply to die for. If you are planning to go I would highly suggest the tasting menu/prix fixe menu. You have got to to try as much as you possibly can. My husband and I did disagree on some of the dishes (e.g. The bisque which I felt was fantastic)"}
{"text":"I had a great time here. The entrance for this restaurant is through the hotels lobby. The beer selection at the bar was okay with their typical Canadian beer. Anyway, we were here for tasting menu and some wine. 

Our waitress was really attentive. She recommended us some good white wine to go with out tasting menu. It was a 6-course tasting menu. 

We first started with a lobster bisque. It was pretty good. Then came the foie gras crème brûlée was alright with the easy-to-crumble bread. The third course which were escargots was to die for. The there was an intermission with sorbet. It was very refreshing and good for cleansing your palate for my next entrée which was a medium rare rack of lamb. Omfg, you need to get this! 

We ended the dinner with another Crème Brûlée and some cheese cake. 

Overall, it was a great tasting menu. We spent three hours there with three bottle of white wine.

We will be back again for sure!

PS your wifi did not work!"}
{"text":"Service took forever
The maitre d' was rude when we first got there. He didn't sit us as soon as we got there although our table was ready. He sat others before us although we had a reservation. The food was really good though. The price fixe was very worth it. All the food was delicious. The price came out to just under $100US after everything and the tip."}
{"text":"We went to Bonaparte on a weekend getaway to see fall colors.  We were staying at the Westin in Old Montreal so it was just a five minute walk.  We arrived around 8:15p and the reservation was at 9p.  It was busy so it took a while for them to acknowledge us while we waited at the bar.  This place is busy and they seemed a little short staffed.  Anyway we eventually got drinks while we waited.  The place has a nice ambience, mood and music--I liked that.  They took us to our table promptly at 9p and took our drinks for us.  

Once at the table the waiter took our drink order which was fine.  He asked if we wanted water but never actually brought it.  We both ordered the Tasting Menu which seemed a bit pricey at $74 but YOLO.  The Lobster Bisque came first.  For some reason the waiter didn't offer fresh pepper so I asked.  He also brought a half bottle of Malbec which was fine but he never poured it.  The bisque was okay but a little bland so I added salt and pepper.  I had the Duck Foie Gras Creme Brûlée.  Meh (2/5).   The next course was Shrimp and Scallop \"Harmony\" and Mushroom Ravioli. Both were excellent - (5/5)!  The Pear and Tarragon Sorbet with champagne was okay but no spoons were provided - (3/5).  For mains we had the filet mignon and rack of lamb both pink - (4/5).  The desert course was excellent (5/5).  This was followed by coffee or tea.  

The bottom line is the atmosphere was excellent (5/5).  Presentation was excellent (5/5).  Food taste was good (4/5).  Food value was average (3/5).  Service was poor (2/5).  In conclusion I think this place is a bit touristy and you can get a better bang for your buck elsewhere."}
{"text":"What an amazing and pleasant experience!
It was my birthday so my wife reserved ahead... But she made an error to reserve the restaurant at 7:45AM instead of 7:45PM LoL!!! The manager was very kind and offered us a table despite being on busy Friday night!

We ordered the table d'hôte - great varieties of choices Btw! It's a 6 courses meal, soup/ 2 entrées/ sorbet to clean our tongue/ main course/ dessert, coffee or tea.

Lobster soup, shrimp and scallop, foie gras crème brûlée, smoked salmon salad, filer mignon, duck breast are the one we chose from the menu and it was yummmmmy!

We enjoyed every single dishes, everything were very top norch.

Service wise, please ask for Jason! He will take care of you. It's been awhile that I've received such A++ service from waiters. He did an incredible job.

I think their price is just right, not over priced at all. I really got a perfect meal, service and overall experience.

Not only I will go back, I'll also recommend my friends!!!"}
{"text":"The more things change, the more they stay the same...

Highly styled and attractive food.  Attentive, effervescent service.
Unfortunately, bland and ordinary flavors.

The standout was the duck. 

Absent that, it was ordinary with a pretty dress.

The wines were short on fruit and a poor choice as the modest end of the menu.

It confirms my feeling that they missed it on New Year's Eve. 
They missed it in June too."}
{"text":"SOUFFLE' SOUFFLE' SOUFFLE', everything else was good but the soufflé was magnificent. Dont leave without ordering it."}
{"text":"I wish I could have enjoyed this place more. We made a reservation here for our first year wedding anniversary dinner. The reviews made the place sound amazing. We got there at 9pm and the waiter seemed a little cold and impatient. Fine. I read that the waiters are French and beautiful, so sure maybe they can be cold. However, I noticed that he was really warm to this other party of older couples. He was joking with them and everything. Then these other tables got brought celebratory candles and cake for their anniversaries from other waiters. We got nothing. Not even a congratulations. And yes I did mention this when booking the reservation that we were celebrating a special occasion. I don't expect restaurants to care or bring us anything or even say anything but it does hurt when other people get something special and we get neglected. 

We ordered a bottle of wine and I think the waiter was looking down on us because we wanted a full body but then didn't want to shell out 70$ for what he recommended. Oh well. 

On to the food, it was average. Small portions for the tasting menu. We got soup, smoked salmon, foies gras, scallops, and ravioli for the starters. The scallops and ravioli were delicious. Pear sorbet for palate cleanser before the main dishes. I got the fish which was refreshing and hubby got the duck breast which was good. Both entrees were yummy but nothing memorable. Dessert was some small cakes and creme brulee which was also good but not memorable. Expensive meal - around 250$ for mediocre. 

While meal ended at 12am. Service was really really slow!"}
{"text":"Came here for my birthday. Great service and I really enjoyed the ambiance. The food was well cooked and came out fast even though the restaurant was filled. 
Enjoyed the fra gras."}
{"text":"I came here with my girlfriends as I had my bachelorette dinner here. They had a nice table for us set up in the corner. It was nice and dim and the food was good. We were able to make reservations to sit a fairly large group. It was definitely a nice restaurant."}
{"text":"After seeing many amazing reviews for this place, I decided to try. I was honestly disappointed. The service was good (but not amazing) and the food was just not amazing enough to me (not worth the price). I got the tasting menu and asked for the fillet mignon medium rare but it was brought to me rare. The other plates were good but not spectacular. I would go back but not for the tasting menu. The desserts were my favorite part; they were very good!"}
{"text":"Amazing! Can't wait to plan our next trip to Montreal and have another spectacular dinner experience at Bonaparte!"}
{"text":"My wife and I ordered the tasting menu and ordered an appetizer and entree separately. The food was phenomenal! Definitely order the mushroom ravioli, foie gras creme brûlée, and their salad. The highlight was definitely the appetizers. For entrees we ordered duck breast and rack of lamb, which were nicely cooked. You should definitely go check this place out if you are in Montreal!"}
{"text":"One of the nicer dining experiences of my life.  The food is excellent, the decor (and location) is unbeatable, and my waiter was both knowledgeable and an absolute gentleman.

I think locals will tell you this place is, um, touristy, and there is better French cuisine elsewhere in the city (probably true), but I think it's impossible to leave this place feeling disappointed.  To me, that's worthy of five stars."}
{"text":"I was here last weekend with a group of 6 women (bachelorette party) for a fancy night out.  We all ordered off of the 5 course pre fixe menu and it was fantastic.  The food was great, the service was outstanding... all around a wonderful experience.  The pre fixe menu was $46 a person I think.  There was another pre fixe menu slightly less and one a bit more.  I had the soup du jour (red vegetable puree), goat cheese tartin, pear sorbet in prosecco as a palate cleanser, filet mignon and then a chef's sampling of desserts.  It was all fantastic.  Friends also tried the lobster bisque, smoked salmon, duck, seafood pasta... can't remember what else.  No one had anything negative to say.  It's also located in a very charming part of town, close to Notre Dame and art galleries.  Would highly recommend."}
{"text":"The four stars is mostly because of the impeccable service and I'd be giving 3 if I was only reviewing the food. Service really can make or break a meal and here the service made the meal. We got the 6 course tasting menu and it seemed that the dishes went from great to just good. The mixed green salad was nice but nothing special as it was a few simple ingredients. The lobster bisque was good but not anything special either. The goat cheese pastry was fabulous and the foie gras creme brulee was an interesting twist on a classic. I loved the mushroom ravioli it was fantastic. The duck was too tough and not enjoyable. The sauce on the steak was too rich and also not something we liked. We were able to swap one of the desserts for the chocolate souffle but it seemed undercooked and extremely eggy compared to other souffles that I've had. The sampler of desserts was nice particularly the creme brulee, cheesecake and the chocolate one."}
{"text":"Excellent French cuisine in old Montreal. Very elegant and classy atmosphere with excellent service from the staff and tasty food. I ordered the foie gras as an appetizer and lamb as my entree. You can literally feel the love poured into every dish by the chef and I was very impressed. 

Also, a plus is there's some good looking workers at the restaurant. ;)"}
{"text":"Yes it is that good - We asked for a quiet table and got one - I wish this restaurant was in San Francisco - would go there often.  Really was perfect from ambience service music - we had a hard time finding it because the street wasn't on our map"}
{"text":"I went here about six months ago with a friend when he visited.  We didn't have a restaurant to eat at so we asked the people at the casino and they said try Bonaparte. I am so glade we did.  
 The service was great as the server perfectly paired the wines with our courses. Onto the food, my friend and I loved every course. My favorite course had to be the foie gras creme burlee with brioche and apples it had to be my favorite foie gras preparation I have had.  

Another interesting note is the kitchen doors use sensors to open kind of like a grocery store door. It was really neat.

When I return to Montreal I will deff stop and eat here! One of my top 5 places I have eaten at."}
{"text":"Excellent service. Be careful the sparkling water is $8 a bottle. It was good though. Knowing that the tasting menu can be quite a lot of food, we opted for the table d'hote which was appetizer, entrée, dessert and coffee or tea and a la carte of lobster bisque appetizer and duck breast entree.

The lobster bisque was amazing, flavourful and fresh. The venison terrine was outstanding; the pickled vegetables were perfectly complimentary to the savory meat. Duck breast entree was lean and therefore best cooked to medium rare. Very delicious. The lamb shank entree was good, but it wasn't fall off the bone tender, the flavor was alright. The pork belly that came with it was also a bit tougher than I expected although it had good flavor. All the vegetables were delicious and cooked to their own degree of perfection. 

The lime pie dessert was to die for; great flavor and crust.  Paired with the strong coffee, it was a great way to end the evening. Highly recommended!"}
{"text":"We stayed at Auberge Bonaparte in the heart of Old Montreal during the last days of April and had breakfast at its restaurant of the same name included in our stay.  Boy, was that a treat!  This was no ordinary hotel breakfast, but a complete breakfast of the highest quality a high-end French restaurant could prepare and serve in an elegant but warm setting.   The number of non-hotel guests dining next to us, many looking like local business people, attested to the quality and value.  Right off the same menu, we ordered fresh squeezed orange juice, fresh fruit or yogurt, warm, flaky croissants or muffins, and a delicious entrée ranging from poached eggs to French toast tastefully made with slices of French bread that was extraordinary.  The presentation was simple and the portions, while not huge, were perfect to start the day.  The service was friendly and professional. Highly recommend."}
{"text":"The Imperatrice room can be curtained off to make a beautiful private room for a family dinner of 22 people. The group menu was fantastic and well priced. The vegetable soup was creamy and rich, the escargots were just right and the duck magret was very tasty. The dessert platter with a mix of different desserts (mousse, creme brulee, etc) was a perfect way to finish the meal. Service was friendly and speedy. I would be happy to recommend this place to friends who are coming from out of town."}
{"text":"After several years, we returned to Montreal and We planned to revisit this wonderful experience. I requested the concierge to reserve a table near the window of this upscale French restaurant overlooking the cobblestone street with horse carriages trotting past. I had felt I was taken back to the time of Napoleon our previous visit and I was not disappointed this time. We ordered the six course meal with lobster bisque, salmon, escargot, pear teragon sorbet, dover sole and symphony desert sampler(cream brûlée, chocolate mousse and other delicacies). 
This was truly a classic event with outstanding service and wonderful ambiance. $74 Canadian each plus tax and tip. 
This is a \"must do\" each time I come to this city."}
{"text":"So happy we stayed here. This hotel is in the heart of old Montreal, just steps from Notre Dame Basilica, and was a top notch accommodation. The staff were friendly and very helpful with area information and had maps on the ready to share directions. The room was gorgeous-- hardwood floors with tall ceilings and exposed brick. The bathroom had an enormous whirlpool tub that we didn't have time to use but for a longer stay, a nice soak after a long day of walking would have been awesome. Comfortable beds are a big deal to me and these did not disappoint! Heavy room darkening drapes let us sleep in a tad when we wanted to. Free wifi connection in the hotel. There is a tiny rooftop terrace with some seats, perfect if you wanted to grab a bottle of wine somewhere and take up to enjoy the night air and view. The complimentary breakfast was also above expectation- I had the fruit cup (Apple, grape, mango, strawberry), croissant, and crepes with maple syrup one day and other days the poached egg with sage butter/ potatoes/sausage/bacon. They had many other choices but these were delicious. Comes with good strong coffee and oj.
We took the 747 bus from the airport and it was a quick 15 minute walk from the stop to the hotel. (We'd rather spend $10 on a bus ride than $40 plus tip on a taxi and use the savings to get another dessert, beer or glass of wine somewhere - and there are plenty places nearby for that!)
Loved this place! Would absolutely stay again!! Only regret is not having time to dine in the restaurant downstairs."}
{"text":"There's no breakfast menu posted outside but we stopped here anyway. Really excellent food, they really spent time with care and presentation of the food although I guess less portion wise. I was still full by the end of the meal as you get many items in small quantity. The fruit salad was so yummy and cut into really small pieces. We sat at a window over looking the street, really nice ambiance."}
{"text":"Our favorite restaurant in Montreal. Both food and service are exceptional!

We selected the large 7 course meal.  Each course was the perfect size and the time between courses was just right.  Our waiter said we would feel satisfied at the end of the meal without feeling too full. He was right. 

Each course was was presented perfectly. I've included some of our selections.   

If you are in or near old Montreal and are in search of a n exceptional meal this is the place."}
{"text":"Quintessential romantic restaurant with great atmosphere, view and food.  My beautiful wife started with an excellent mushroom ravioli appetizer and I really enjoyed the foie gras.  It was my first time trying foie gras but it went great with the gingerbread toast and creme brulee.  For the main course, both the duck confit and chicken with melted brie were cooked to perfection.  Ended the meal with a delicately whipped mousse and a decadent chocolate chip souffle.  Would come back in a heartbeat."}
{"text":"Women plan ahead, they do research before going a on trip, men don't. So a woman was seriously needed when 3 guys from Boston in Montréal, in a nice and old neighborhood hungry as hell and didn't know where to go. But thanks to the Yelp App, our problem faded away and a woman was no longer needed solely for this particular situation. 

So we came in and were seated right away in this upscale French Restaurant, and I am glad that one of my friends decided to change his shorts at the last minute or else they probably wouldn't have let us in, because the crowd we saw were dressed to the nines and somewhat older.

So I started off with the house salad and then got the filet mignon for my main course, then ended it with the creme brulée. The food presentation was beautiful and so was the food, but if it wasn't for the bread and butter that they served we would have left hungry because their portions were really small!."}
{"text":"Venison medallion with mushroom ravioli was added to their 34 year old menu so I had to give it a try.  Wow...and wow.  Delicious!"}
{"text":"Beautiful space.  Attentive service.  Excellent 5-course meal.  Wine list was extensive."}
{"text":"The wine list is massive and full of delightful selections. The French onion soup was a deeply flavorful broth without the typical massive glop of greasy cheese. Escargot fricassee was a garlic delight on top of a delicate phyllo crust. My duck breast was perfectly cooked, tender and with just enough duck fat to round out the flavor without interrupting the texture. My companion's pork tenderloin (so often dried out during cooking) was juicy and delicious. A lime pie for dessert was the perfect ending to a warm day in Montreal. The servers were all friendly and quite personable. Overall a fantastic experience. Highly recommended."}
{"text":"Fantastically French. We went here for our usual \"one really nice dinner while we're here\" and Bonaparte did not disappoint! We scarfed down the bread and butter and our cocktails like disgusting heathens and loved every second of it. Our wait staff was fantastic in both English and French, and having spent some time in France, Bonaparte is, so far, the closest resemblance to a great French Restaurant I've been to since. My only criticism for this restaurant, and this is a common trend, is that the beer selection could be vastly improved for a restaurant of this caliber. Now, as a French restaurant it's all about the wine, and my Graham's desert wine (my favorite) did not disappoint, but it would be nice to see more attention paid to the beer selection just to make sure the restaurant is firing on absolutely all cylinders.

If you're a vegetarian, please keep in mind that the menu is quite limited. I don't allow this fact to influence my reviews, as I don't try to impose my diet on others, but this is something to consider (maybe have a snack beforehand). I enjoyed the mushroom ravioli from the starters menu, and then really delved into the soufflé and  crème brûlée. The soufflé was crazy. 

Make a reservation."}
{"text":"Great French food in super nice fancy setting. Great place for date, celebration, get together, business dinner.  We got the $79 tasting menu and it was worth it- you also get the prix fixe meal or order a la carte.  The highlights were the duck breast, vanilla shrimp and scallops.  This place provides a fantastic french dining experience with super attentive wait staff who offers excellent service. Delicious cocktails and superb wine choices. Enjoy!"}
{"text":"One of if not the best dining experiences we had in Montreal. Excellent service as well as excellent food. No detail spared. We both felt reasonably priced for what we got. All in a beautiful setting. Don't pass this one up."}
{"text":"Le mignon de porc à la sauce dijonnaise est super bon, excellente cuisson, avec ses petits légumes. Pour les gourmands, la tarte au citron et meringue est également délicieuse. Le service est bon, rien à reprocher."}
