{"text":"Die Bedienung brauchte eine halbe Stunde (obwohl wenig los war) um uns mitzuteilen, dass der bestellte Flammkuchen heute aus wäre. Da der bestellte Federweiser auch noch nicht da war, sind wir dann gegangen."}
{"text":"Durchschnittliche Gastronomie, wenig flexibel. Obwohl Flammkuchen in kleinen Stücken angeboten worden ist war es nicht möglich einen kompletten Flammkuchen zu bestellen. Bzw. würde dann dieser ca. 15,- EUR kosten. Ein Witz."}
{"text":"Auch hier SEHR schade  nicht nur der zerkochteste Spargel meines Lebens, sondern auch noch Null Verständnis von Seiten der Bedienung. 2x Müll = nie wieder!"}
{"text":"Schönes Ambiente, freundliche Bedienung, gute Preise, normale Wartezeit, Essen schmeckt sehr gut!"}
{"text":"Hier kann man hingehen - die schlechten Bewertungen von 2012 kann ich so nicht bestätigen. 

Der erste Eindruck beim Reinkommen ist sehr positiv: schöne Einrichtung und schöner Blick nach draussen auf den Fluss und ins Grüne. Der Biergarten ist auch sehr angenehm gestaltet, u.a. mit Pavillions und schön dekorierten Tischen. Der Service war freundlich, und auch Sonderwünsche (andere Beilagen) waren unproblematisch möglich. Das Essen war insgesamt gut: Spargel, Kartoffeln und Sauce Hollandaise waren frisch und lecker, nur das Fleisch recht zäh, und das leider bei beiden Fleischgerichten die wir bestellt hatten. 

Weintrinker sollten übrigens die regionalen Weine probieren, von denen die Weinkarte eine gute Auswahl bietet."}
{"text":"Vielleicht war 2012 problematisch, aber ich gebe Ines A. Recht, jetzt ist das Restaurant in Ordnung. Weiterhin schließe ich mich der Empfehlung an, die Weine der Region zu bestellen, wenn man denn Wein trinkt. Mit z.B.  4,90 für 0,2l angemessen berechnet. Wir nahmen auf der Terrasse Platz mit schönem Blick auf die Unstrut. Der Service war freundlich und aufmerksam. Das Schnitzel mit Würzfleisch und Käse überbacken war zart und sehr reichlich. Den Preis von 9,90 empfand ich als günstig. 
Merkwürdig fand ich den Hinweis auf einer Kreidetafel, der Gast möge nett zum Personal sein, da gutes Personal schwieriger zu finden sei, als Gäste. Vielleicht haben wir den Humor nicht verstanden oder der Wirt hat hier ein ungelöstes Problem. Da unsere Kellnerin sehr freundlich war und wir es grundsätzlich immer sind, wenn man uns nicht reizt, haben wir es nicht auf uns bezogen."}
{"text":"Das Essen war lieblos angerichtet und die qualitativ guten Zutaten (Pfifferlinge) durch eher mäßige Kochkunst leider komplett zu Nichte gemacht. Zudem haben wir mehr als eine Stunde auf das Essen warten müssen, obwohl das Restaurant nicht ausgelastet war. Der Service hat sich aber Mühe gegeben und die Kritik sehr gut aufgenommen."}
