{"text":"Ce n'est jamais agréable d'être assis sur une table collante (pas nettoyée, on voyait les traces des anciens clients). Pourtant nous sommes venus un dimanche et le personnel était plutôt désoeuvré... 
Comme un malheur n'arrive jamais seul, les boissons sont servies dans des verres en plastique. Compte tenu du prix, ils pourraient faire un effort.
Les plats sont peu copieux et chers, mal présentés (la pizza ressemble à celle qu'on peut faire chez soi avec une pâte surgelée). La pizza Domino's que j'ai mangé la veille était assurément meilleure. Je suis parti en ayant encore faim... Idem pour mon amie qui a eu une assiette de pâtes microscopique et mon ami qui a eu un panini qui aurait pu être une entrée... 

Bref, ce restaurant est un attrape touriste, à éviter, il y a de nombreux restaurants bien meilleurs et à tarif équivalent dans les environs.

PS: j'oubliais, quand ils enlèvent le papier qui protège la table, ils versent la moitié des miettes sur les jambes des clients... services 4 étoiles..."}
{"text":"The food was borderline OK, the grilled chicken was microwaved, the salad was not very well washed, won't return."}
{"text":"I admit this wasn't my first choice.  Wife wanted Poutine, and tempted me with the Kobe burger. Both of them were mediocre at best. The waiter forgot to give us water, although he was quick to bring our alcoholic drinks. And it took forever for us to pay and leave. 

Oh and their sign said $16.99 for Kobe burger, or so we thought. The cheque came with a $30 charge for the burger. When I inquired, I was told the price was for a classic burger and there is a line that separates the entries in the sign. I wonder how many other were duped by it. I'm uploading the picture for your benefit. 

All in all, believe in fellow Yelpers. There are better places around, and don't let the temptation of a Kobe burger dupe you."}
{"text":"Big deception. I took the steak and fries but I only ate the fries with ketchup. I ordered a medium-medium but she gave me a rare. Plus, the taste was badddd. To composante, she gave me the option of a free desert... It's my first and unfortunately my last time there."}
{"text":"Went here on a whim and didn't expect much. I knew it was pricey because all the restaurants in the area are similarly priced. Anyways, I had a good meal, the service was quick and attentative, the meal (chicken panini) was good and the dessert was delicious. Overall I had a good experience. I didn't give five stars because I feel that it could be better, it certainly has the potential."}
{"text":"Greasy pizza and over priced salad. Drinks were weak and most of all, service was pushy, slow and rude. Flies on our table."}
{"text":"I went there for lunch with my family, restaurant was very touristy, and only had 2 waitresses for about 20 tables. So don't expect any service, but the service charge is already included automatically. 
The food is so so, the only thing good is the convenient location but there are a lot of other options too."}
{"text":"Great dinner at Jaques Cartier Restaurant in Vieux Montreal. We had the filet and prawns and the seafood pasta. The steak was a little over cooked, but the prawns were tender and sweet. The seafood pasta was the best. The sauce was spicy and flavorful. The pasta was cooked perfectly and overflowing with shrimp, scallops, and mussels. Definitely a clean plate dish!"}
{"text":"My sister and I were looking for dinner and saw that Restaurant Jacques-Cartier had a special for Moules Frites. We kind of shrugged and went with it. We got a nice table right at the edge of the patio and were able to people watch and enjoy live music. 

We got: 
Escargot: These were not cooked in shell and were not as good as I remembered them. Decent enough but not buttery/garlicky enough.

Garlic bread: by far the best part of our meal. Their garlic bread was really good, and we ended up ordering another portion to dip into the Moules Frites sauce.

Caesar salad: because we had not been eating enough greens. Straightforward. 

Moules Frites: Decent- the sauce/soup didn't really stand out and the amount of fries they served the mussels with was small. Definitely needed more. It was a decent size but there were approximately 10 mussels that did not open, so that was a bit disappointing. 

I'd say 3/5."}
{"text":"Je suis tellement surprise de lire le seul commentaire sur ce restaurant qui je juge un peu sévère. Nous allons régulièrement dans ce restaurant avec ma famille. Situé au coeur de la place Jacques Cartier on pourrait mal juger ce restaurant croyant qu'ils servent une nourriture quelconque. Mais c'est loin d'être le cas. La pizza est délicieuse bien garnie et une portion généreuse (voir la photo de mon plat). Les pâtes sont aussi très bonnes et j'adore le goût des frites croustillantes. Essayez les elles ont un goût particulier et pas trop grasses (cuites au four!!). En effet, le décor laisse à désirer mais on vient pour profiter de la nourriture et de la terrasse spacieuse donnant sur la place et les spectacles. À tester entre amis ou en famille."}
{"text":"Came here on a Sunday afternoon after walking around the old port. This place seemed to be good a lot of people sitting on the outside patio. 

The service was good a bit slow. I ordered the fettuccine Alfredo with chicken which lacked salt and taste and my bf got the pepperoni pizza which was good."}
{"text":"What a nice surprise. We had just walked a mile or so from our apartment to Vieux de Montréal and had tickets to see Cirque du Soleil. We had just discovered that our car had been towed, and were really afraid we wouldn't get dinner before the show. We wandered up to the patio and asked how long dinner might take. The hostess and waitress assured us that they could serve us quickly, and they did not disappoint! We also wanted to make sure there were gluten and dairy free items on the menu for one in our party. Now to our meal - The grilled chicken salad was great, and the goat cheese and dried tomato pizza was outstanding! The crust was thin and tasty, with just the right amount of good tomato sauce for my daughter and I. The wait staff was friendly and fast. I'm not sure if my five stars are for the outstanding service or that amazing pizza!"}
{"text":"I do not know why this place has only three star review. My children and I had pizza which was excellent. My wife had the lobster bisque and chicken Caesar salad. Everything was amazing. They make mixed drinks/cocktails.

They have a outdoor seating area with heaters.

I am happy we went here despite the yelp reviews."}
{"text":"Not at all sure how this place has gotten good reviews. Stopped by for lunch and shouldn't have. Not crowded (only a few tables full on the patio, no one inside), but the service was still slow and terrible. Asked for waters, never got them. Glasses for our other drinks were dirty with lip marks still on them from prior use. We got a panini and poutine- not difficult items to make delicious, but they were both terrible. Poutine tasted disgusting g and the panini was incredibly bland. Bathroom was dirty with flickering lights, crayon marks on the walls, and a sink that didn't work."}
