{"text":"Great, local old time diner.   All local clientel, enjoying their meals.  Friendly, efficient service.  They are even kind to foreigners who do not speak French (our party).  Delicious club sandwiches with fries and gravy."}
{"text":"Ive been eating there since I was a kid and nothing has changed. Still the best club sandwiches I've ever had, made right in front of you, the place is clean and the service is quick. Definitely worth a try."}
{"text":"BEST FREAKING DINER in the greater Montreal area. Sure St-Jerome is out of the way for Montrealers but completely worth it. Been going there for about 30 years and the place hasn't changed a bit and yet looks bran spanking new its so clean. The fries are the best kind, the old-timey burgers to die for and the service is always fast & friendly."}
{"text":"This is a old-school diner that serves a very fixed menu. In the morning they have the standard fare of breakfast and the rest of the day it's a fixed menu of items similar to what you find at Belle Province but... not sucking.  I went with a cheeseburger, a Michigan hot dog and fries. Honestly, as comfort food goes, this is the best. Cheeseburger is good and cheap! Perfect value. The Michigan hot dog was GREAT. That sauce is on-point. The fries are PERFECT. Literally perfect. Good portion size vs value.   Really nice discovery thanks to Yelp. Will definitely be back even though it's a little off the highway to find... it's so worth it though! My personal thing about this place will be a nice stop between going to Tremblant to Montreal. Kid friendly."}
{"text":"C'était le Release de Dieu du Ciel! Et tout beer geek va comprendre en lisant ceci que la foule, ou même se commandé un lunch durant un release c'est long! Donc, j'ai fait un détour pour aller manger au Dinner chez Johnny à cause des bons reviews sur Yelp. Je ne savais pas mais j'ai rencontré un ami beer geek que j'avais vu à d'autres releases qui vient du coin qui m'a expliqué que cet endroit est une Institution à St-Jérôme. Dans le genre \"Dinner américain\" c'est sans contredit un des meilleurs à vie. Authentique de l'extérieur et à l'intérieur. Cet endroit est remplis ou occupé en tout temps.. C'est un endroit qui roule beaucoup donc n'ayez aucune crainte niveau fraicheur. Comptez comme tout bon Dinner authentique à avoir une facture en bas de 20$ par personne.   J'ai pris une poutine et un Cheeseburger, Très \"beau-bon-pas cher\"   Si j'retourne et j'ai une fringale, je vais y retourner!"}
{"text":"Encore un autre snack bar comme il y en des milliers au Québec .j'ai pris un hamburger steak avec une portion très généreuse de fret mais un sauce insipide et sans personnalité."}
