{"text":"Went out to Moomba's for a girls night out of dinner and dancing. I must say that I was pleasantly surprised with the quality of the food. 4 of the girls shared a grilled meat platter that came complete with 4 dipping sauces, a variety of grilled meats and vegetables with garlic mashed potatoes. It looked and smelled wonderful! They all agreed that it was simply delicious! I had the tagliatelle with crab and rapini which was tasty but a bit too rich for my liking, nevertheless worth mentioning. And one of the girls had the salmon which was grilled nice and crispy on the outside yet still  moist in the inside with grilled veggies and glazed with maple syrup. We washed it down with a couple of bottles of wine and really enjoyed our meals.  At close to 11, the waitress came to our table to tell us that unless we take part in bottle service, we needed to leave the table so that they could set up the VIP section. That was definitely a turnoff! We won't be going back to Moomba's for the nightlife, cause it is quite a young crowd but I would go back for dinner anytime. They're food was yummy!"}
{"text":"Un peu cher mais les mercredi lentrer est gratuite pour les filles alors sa vaut vrm la peine. Le dj etait tres bon et tout le monde dansait. Pour un mercredi il y avait du monde. Le mojito a la framboise etait delicieux!"}
{"text":"Went there last Thursday for an early Valentine's day dinner with another couple. Been in Laval many years and this was my first time here as I was under the impression it was a nightclub. This is a resto lounge and its is very nice inside. Very polite staff, the decor and ambience is great. I wasn't aware of this but found out they have a promotion on Thursdays and all plates are on for 10$. The drink menu is very nice and complete and the food menu is small but everything in it sounds amazing the only downfall is that they don't have English menu just French. We ordered a couple of beer and something called a Requin Bleu and it was very good and big that is always a plus. I had a carpaccio as an entree and my friends had the salmon tartar both dishes were beautiful and so tasty. Main dish I took the salmon and it was cooked to perfection. I also tried the filet mignon it was served with potatoes and veggies and that was also very good. I didn't give 5 stars because of the menu issues the desserts they had are not great and they only take cash and credit not debit. I will for sure go again very soon to try the other dish"}
{"text":"Came here for the dancing. This place is absolutely beautiful and the dancing and the music was phenomenal. Seriously, Montreal is the best for dancing!"}
{"text":"I like this place... (a) If you come for food, you won't be disappointed, (b) prices are reasonable, (c) If you come here to dance, it's gorgeous, clean, NOT filled with little barely-legal children, and always has good music. Only pitfall is that it is in Laval, which makes is a little bit out of the way (and makes it necessary to drive to.. hence the lack of children). Otherwise, one of my favorite clubs in the city!"}
{"text":"Toujours une ambiance de feux! Le mercredi ça coûte 6$ pour les filles et les jeudis 10$ incluant le filet mignon!! On aime ça :) sur réservation"}
{"text":"Being in my forties I wasn't sure about going to a restaurant / club type of place.  I was wrong.  The food was excellent , a great atmosphere, great music,  and the crowd was in their 30's and 40's...translation no one was looking down at their phones.  However, be warned...at 11 pm the place transforms into a young crowd..really young.  I recommend it if you are planning to leave at that time."}
{"text":"If I were to try to properly describe this place I would have to completely give up on political correctness. All I can say is stay away! People get shot here. Yes. More than once."}
{"text":"I really enjoyed this place. The food was good, very tasty. I had the steak-fries. The cocktails were good, expensive but you get a free drink upon entering. I stuck to rye and ginger for $7 after my free Miami Ice.  The band was awesome and the music was great. I went on a Wednesday Latin music night. Ladies ate for $6. Ladies night. We got here early and left about 12:30am. It was really getting busy. We danced all evening, salsa, merengue, bachata, popular dance music (reggae, house, etc..)"}
{"text":"Moomba Club is pretty good. Overall, the place is jammed with people from Thursday to Sunday. It's a pretty good place to party out.   It's a little out of the way - and there's a lot of the 'suburbia crowd', which is quite fine. Nice girls. Fun times :)   http://www.moombaclub.com/"}
{"text":"I had a horrible experience at Moomba due to our extremely rude waiter named James. We asked James for clarifications of our French menu and he rudely and abruptly answered in French although we spoke to him in English.  I ordered a drink and he brought the wrong thing. When I mentioned that it was the wrong order James stormed off and when he came back slammed another wrong drink in front of me. At that point I didn't bother to clarify because he was so unpleasant to interact with.  It took a very long time to get our food. Finally James brought me a tiny appetizer as my meal. Because of his abrupt and unclear behavior with us I was under the impression that I had ordered a full sized meal. When I told him that, he rudely said he couldn't do anything about it. He didn't even offer any solutions. So I had to eat the bread from my friends plate not to starve.  Then when we got our bills, James announced loudly that he expects a tip. Finally he was very clear about something.  This guy should get fired.  Sorry Moomba we're not coming back! ... Funny enough Moomba just called me to apologize."}
