{"text":"This is a very popular local place in Lasalle on Newman.    The location alone should tell you that you aren't exactly wandering into fine dining territory.     Sure, it's a little dark and dingy and outdated in there. Service is always great, prices are ok, the food is dependable.....it's just a comforting sort of place to sit.   Nobody will bother you if you stay for 2 hours over breakfast, the smell of the kitchen is everywhere but somehow you don't mind, the noise of the families is somehow mesmerizing.     You won't spend a fortune, you'll get a totally fine breakfast or club sandwich, you'll be treated well.   Not too shabby at all!"}
{"text":"When I walked through the door I was not impressed, the place is a little grungy. The food however was good. I had the London steak with two eggs over easy ($ 12.99) and shared a plate of French toast ($ 6.50 for three slices, you can have it topped with fruit). The steak was well done, and very tender and tasty. The French toast was not the normal every day recipe, they actually added spices to the mix, which gave it an extremely good taste. They also give you refills on the coffee, which was not bad (4/5 *'s). Our waitress was pleasant, and we did have to wait, but mainly because the place was packed."}
{"text":"A cute little house-looking building on the outside, but the inside is a completely different vibe. Although it's pretty dated, it's cozy and private. The seating isn't crammed and the waitresses are friendly and bilingual.   The thing I was most impressed with was the TIME. Two of us were in and out of there in 15-20 minutes! I was quite astonished with how quickly we were seated and our orders were taken. It must not have been more than 5 minutes when our plates of food came out! I've never had such quick service! I'm not sure if it was an order made by accident minutes before or if they're just that quick, but the food was hot and looked appetizing so I didn't complain.  A tip if you're eating breakfast, eat your eggs before your hash browns. For some reason the hashbrowns weren't very good until I ate my eggs and then gave them another chance (weird, I know). :)"}
{"text":"**The service was great, no issues there. We were seated quickly and had coffee within 10 seconds of sitting and they were busy.   The menu choice is typical, there's not really anything overly creative or different about their choices. They are lacking an option that includes poached eggs, fruit salad, and cottage cheese or yogurt. They do have a yogurt and fruit option but there's no eggs included and was a little disappointed with that.  I chose the Traditional Eggs Benedict at an affordable price. It was okay. The Hollandaise sauce, which I asked for and received on the side, was too watery... I think it is generally supposed to be a 'thick-ish' sauce. The Traditional Benedict meal came with ham and swiss cheese, that's it, so it was a little plain. The fruits that came with the meal weren't so generous.   The woman's washroom needs A LOT of work. I was extremely unimpressed. Two of the three toilets were out-of-order and they were, um...... full, which was disgusting to see right after eating breakfast. There was only one toilet working and another lady had to wait for me to go, then she went in right away after because she was waiting for me to finish...... Awkward!!!  The entire bathroom looked grungy too.  The service was good but the facility and menu choice, not so much. I'm undecided if I will go back. If I do go back, I'd like to know if all three toilets are functioning beforehand. LOL.   The parking lot entrance is ridiculously small and VERY easy to miss so look out if you're driving there for the first time.   Thanks for reading! Emmalee :-)"}
