{"text":"Oh my god, this place.  I think it's going to be a regular hangout--the vibe is chill and loungy, with muted house music and dim lighting, and the food is incredible.  Like \"Please don't talk to me while I'm eating\" incredible.  We shared a number of small plates, but the menu also has the traditional souvlaki and steak dinners--it was borderline too much food, with five starters between three people, so I'm glad we saved the full plates for another visit!  This place is a good date spot, but if you are dining with someone you want to impress, make sure that you both share the hummus platter because you don't want to be the only one smelling like garlic at the end of your meal!  (Don't think you can get out of ordering it, though--it's phenomenal, studded with whole chickpeas and olives. You don't want to miss it!)  The waiters (owners?) are friendly and flirty, happy to linger and talk with you if you seem open to it but willing to back off when they see you're in the middle of an intense discussion.  Plus the one guy fronted us shots of ouzo--definitely a palate cleanser!  A wonderful meal in a wonderful restaurant--who could ask for more?"}
{"text":"Thanks, Yelp, once again! I will definitely be coming back here.  I, of course, consult the All-Knowing Yelp every time I need to go out to eat (which is rather often); so, of course, I invest some extra research time for date nights to see what the Yelp Crystal Ball suggests. Last week, it led us to Retsina.  Located in not the elitest of neighbourhoods, Retsina was dark and empty when we walked by making me worry for an instant that it was closed. But so glad we went through with it anyway!  Rainbow flag on the door, check. Immediate friendly greeting, check. Menu with tasty sounding items (Greek works that I didn't know), check! The server was a bit surprised that it was our first time there because it was a \"regulars' spot\" kind of place, but hey, I think this will be the start of our Regulardom. Perhaps owing to being the only table there, he was super attentive, super nice. Food that he recommended were great: the ouzo-fried cheese and the meatballs for appetizer and the lamb dinner to share. I would definitely say the two appetizers were better than the main. But knowing we were going to split the main, the chef split it onto two plates and gave us a bigger portion as well. That's service!  One star off for not having our first choice beer and wine items (even though they were listed on the menu), and he disclosed that the kitchen does slow down when there are more tables so he was glad that our food was fast.  And complimentary shots of ouzo to send us on our way!  Atmosphere - 3 Service - 5 Food - 5 Price - 4"}
{"text":"Great food, good ambience but....  It took 50-60 minutes (for essentially a chicken pita and chicken skewers) after ordering to get our food. A table of three next to us, had two plates served and finished their meal before the third plate made it out of the kitchen, the patron sat there and watched her dining companions eat and finish for 30 mins until her food came out. There were only two tables that ordered food, maybe they ran out of food and had to go shopping? While we were waiting for our food, we watched an employee eat their quickly prepared food, the bartender ( who was also our server) sat at the bar watching baseball, never apologized for the wait or offered an appetizer while we waited for an unacceptable amount of time. When food finally came, it was delivered without apology from a guy in a t-shirt and sweats... Customers checks are not printed but instead are shown to patrons via smart tablet, so that the server doesn't let the customer handle the tablet, so customers, feeling awkward, are forced to pay immediately and feel rushed to finish up. When we got tired of waiting for our check, we went to counter and were charged $14 & $18 for what was priced at $12 & $16 on the menu... Maybe they gave us the lunch menu by accident? At the end of our meal, the guy in sweats (no idea what his role at restaurant was) finally did apologize for the wait on the food and said that his kitchen employees had decided not to show up for work that day... Um ok... Bartender knew very little about the beers they offered and though having what appeared to be 6-8 taps at the bar, only two were available, no bottled beer was in stock. However the beer delivery (brought in by the guy in sweats) came in during the middle of service. If the service staff and kitchen can get it together this could be a great little gem, because the food tasted spectacular."}
{"text":"Everything tastes great. OMG I can still taste the homemade baklava ..... Love it!"}
{"text":"RETSINA, a really good reason to actually travel east of Yonge St!   Upon discovering there was a new Greek food place in the city, I suggested to my friends that we venture to Retsina on a Tuesday night.   The first to arrive, I was greeted with a blast of lovely warm air and a very friendly server. I snuggled into one of the comfy booths at the front to await my friends. The decor is just lovely, dark colours with a few tasteful pictures hung. Nice bar and perfect table set up for both dining and boozing perhaps later in the evening.   The ambiance is modern though - no bouzouki music to be heard - just some soft loungy house tunes. Great place for a date.  The food menu is primarily Greek but they have a few items geared towards regular pub fare eaters (a Smashburger, wings, fries).  We were there for the home cooked yiayia style Greek food though and we ordered accordingly: a saganaki (fried cheese), a horiatiki (Greek village salad), gigantes (giant white beans cooked in tomato sauce), keftedakia (little meat balls) and an order of hummus.   Every single dish was a real treat. A lot of thought clearly put into the presentation of each dish, but more importantly - everything tasted amaze-balls! Gigantes were a top recommendation (I am a little biased as they have always been a favourite dish), but they were served with a side of roasted red peppers which made them even more delicious than usual. The hummus was amazing too and nearly a meal in itself.  The cute waiter really completed our evening perfectly by comping us free shots of OUZO, the Greek aperitif that tastes like liquorice . It warmed me up enough to head out into the cold again.  Bill only came to $50 + tip for the 3 of us (we had no drinks), but for that amount of food it was definitely easy on the wallet. I will definitely visit again!"}
