{"text":"When i ordered on the phone they told me 30mins and it was 15.00 for 2 hamburgers that come with fries... well it took an hour and a half. when it gets here its 20.98. So i called and they told me it was 20.98 bc the hamburgers are 6.99ea and the fries are 1.99ea. I informed him i was told fries were included and i wouldnt have ordered them if i knew they werent (we hate fries) he said well the new guy got it wrong..... wouldnt offer a partial refund or anything. wont order there again!"}
{"text":"I remember when Mr. Laconi ran Laconi's.  It was an absolute gem.  You couldn't get bad food there.  That's gone.  This place uses the Laconi's name, but Mr. Laconi and his exceptional food are gone.  The prices are fair, yes, but food is mediocre to poor, and the service is just OK or slightly less than OK.   If the only kind of food you do is Italian food, at a minimum it should come out hot and you should be able to get the pasta done al dente.  The only real notable high point is the bar.  Bob the bartender knows his stuff and is friendly and helpful.  Still it's mostly a beer and shot kind of bar (maybe a glass of wine, but their selection is not the best) so there's a limit to how much this can contribute"}
{"text":"Let's break this down:  1.) Service - You will get good service from Laconi's. Wait staff is great and friendly. Kitchen staff is competent and they get food out in a reasonable amount of time.   2.) Atmosphere - Good atmosphere, a little too dark though. On a busy night, like Friday or Saturday, expect a wait and the bar area gets very crowded. Lots of regulars who like to walk around and mingle with each other. When there is a big game on, it gets crowded also. So go early to get a good table before it gets to crowded  3.) Food - NOT what it used to be. Laconi's has a very rich history in Cuyahoga Falls. It was originally owned by Sam Laconi and all the food was authentic and delicious. When he retired, he sold the restaurant to new owners and since they took over the food is fair but not nearly as good as it used to be. The pizza is not the same any more, because a woman who used to make the pizzas there was from Sicily and retired, her name was Pizza Mary and from what I hear told, she was incredible. Regardless, the food is good, but not excellent. DO NOT order a side salad, you will be disappointed. The bread is pretty good. The soup is good and homemade. Some of the pasta dishes are very good. The alfredo sauce is very tasty. The cannolis are good as is the tiramasu.   4.) Pricing - I think the food is way overpriced. You get a decent amount of food but not worth what they charge in my opinion. Pizza is very expensive as well.   5.) Exterior Appearance - From the outside, the restaurant is not much to look at. The parking lot is a little run down. The sign outside has letters missing and misspelled. Not a great first impression.   If you are in the area, not a bad place to stop for lunch or dinner. But again, not my first choice."}
{"text":"The atmosphere is super lame and te servers are all super weird but the crazy sticks and pizza are good enough to make up for it. Oh and it's way overpriced. 4 Stars Hahahaha"}
{"text":"Thank goodness for great local places like Retz. They are our go to for pizza at our house parties. They also have great dine in hours, by being open more often and later than most other restaurants. I've enjoyed everything I've had there from burgers to appetizers. I highly recommend Retz if you're looking for a local, causal dinner."}
{"text":"Poor service! Waited forever for the pasta and when it finally arrived it tasted like it came right out of a can. Won't be back!!!!"}
{"text":"We have been to this restaurant twice in the past few weeks.  We love the food, the excellent, friendly service and the prices.  I plan to try their pizza next.  I love the wedding soup and the wings are awesome.  We will be back soon!"}
{"text":"Went to dinner on a Friday night for the all you can eat beer battered fish. 4 adults 1 toddler. First thing I noticed was how friendly the staff was. Seemed like they were very happy to see us. The Italian atmosphere in the dining room was fine though the heat was far too high and there were no windows. The menu was expansive and seemed to have something for everyone in a large party. The prices looked reasonable and the all you can eat fish was less expensive than the 2 piece perch dinner. All four of us ordered the all you can eat fish and I enjoyed it. Fish was good and the batter had a good crunch not soggy like some fried fish. The potato options for sides was good as well. The service was good and the cannolis were great as well. I would definitely go back again to try something a little more Italian."}
{"text":"Bet pizza in town and a toss up between here and Luigi's for best in Akron area. The eggplant and tri colored tortellini are amazing as we'll."}
{"text":"I've love love loved laconi's all my life... i've had big parties there, and many many 'lunch for 2' visits. ... i love just about everything on their menu... Mmmmmmm..."}
{"text":"Dive bar meets old school Italian joint. If you've ever been drinking a bud light draft while playing keno, and thought to yourself that the only thing missing is a plate of mid tier lasagna, then you will probably find this place more remarkable than I did."}
{"text":"Italian restaurant meets hole in the wall bar. Grab a draft beer and enjoy an episode of Family Feud. You won't hear crickets due to lack of customers, but you might overhear other tables conversations. Not the largest, aesthetically pleasing restaurant, but the food is a 10 on the Chef Gordon Ramsa scale.   I ordered a grilled chicken salad....can't really mess that order up. No complaints. My husband ordered a meatball sub and he basically devoured the entire thing in two bites. A server passed by with a large pizza and both our eyes exploded. Boy did we mess that ordered up. Will be back about 10 beers deep so I can get my hands on that pizza.   I was happy to find out they deliver all over the Falls. Total game changer."}
{"text":"Absolute worst service ever. Having lived in the Falls for over 15 years decided to try it out. First off had to walk in the bar to enter the restaurant. Stood by the entryway to be ignored.. then  a server tells us to go seat ourselves and she would be right over. We sat there at the table for at least 20 minutes without anyone acknowledging us. Its not it was busy 3 tables of which 2 were eating. We eventually left. We will not return!! Tried keeping the private owners of small business alive with our patronage. Not quite sure how you have remained open with this type of service."}
{"text":"Laconi's is Great Authentic Italian.  Went with a group of 8 and had a table in the dining room. Our waitress was outstanding and so was the food. Pizza was just as I remember it as a kid , and the cheese ravioli  and spaghetti and meatballs was excellent as well as we all sampled a little bit of each. With a carafe of house chianti, as good as it gets.. Will definitely be back!"}
{"text":"Stopped here to try out a new place.  I ordered the pasta and sauce while my wife got the tortellini with tomato sauce.  The pasta and sauce tasted \"generic\".  The tortellini, though was very good.  The service was poor and my knife was not clean.  I turned around to signal our waitress and the place was empty.   The bartender was gone, the waitress was gone, all the patrons had left, and the room was completely empty.  (Someone showed up about 20 minutes later.)  Food is a bit pricy for what you get. Watch out for the \"nickel and dime\" extras.  Place could be improved by providing better quality control (dirty silverware?) and keep an eye on the customers' needs.  It would also be nice to feel that I was getting a better value (or experience) in paying $15 for a pasta dish."}
{"text":"Laconi's is a decent local fare. The prices aren't expensive (they're better than corporate restaurants of similar quality). I enjoy their red sauces (and meat sauce) for pasta, but can't say much about the pizza. If you are looking to support a local business and have food that shows promise, then Laconi's is a good choice. I wouldn't take out-of-town family there if you're trying to impress.  Chef Ramsey would have a few critical things to say.  The eggplant was surprisingly good."}
{"text":"We decided to have pizza tonight so we ordered one from Laconi's. Extra large with ham and sausage. Best pizza we have had in a long time. Highly recommend them."}
{"text":"My family and I ordered take out..waited FOREVER! Finally called and the lady said the cook left so it was taking longer than usual..whatever that means? Finally received our food and it was COLD. On top of that it was all wrong, no bacon on my sandwich (Turkey Bacon Avocado Ranch Melt)...i love bacon so that sucked. One dab of guac..i had to search for it..Just not good at all. And i payed 9 bucks alone for the sandwich. Wont be ordering or eating there again."}
{"text":"Don't let the old sign out front turn you away. Sure, the restaurant could have a better sign--but as long as their food is good, then I don't care. I would describe this place as a hideaway restaurant that isn't your typical place to eat. There's a lot of history in this place--it's situated in a neighborhood. Good place to grab chicken, jo-jos, and pizza! My wife and I like to split a pizza and a chicken dinner. Fun place to go on a Friday night."}
{"text":"I have been here on a few locations for dinner with my boyfriend.  The interior is old & dated, but the food we always ordered (from the restaurant) was good. I always ordered the eggplant & he ordered the lasagna.    One night, I sat at the bar to have a few drinks and dinner.  I quickly struck up a conversation with a businessman at the bar.  My friend joined me for drinks & our service went completely downhill.  Her kids sat at a table on the bar side & they were never waited on!  My friend at the bar gave them his bread because it was obvious they were being ignored.  The bartender, that is known for his rude jokes, never came back to us!  I ordered the chicken marsala and it was awful!  I would have sent it back otherwise but didn't want to stay any longer.  The business tried two or three times to pick up our tab (which was very generous), but the bartender would not let him. I couldn't believe it!  He told the guy \"no\" twice.  It was rude beyond belief.  I wasn't looking for a handout, but he offered, I think, because my best friend and her children were treated so poorly.   I will never return."}
{"text":"A new low in restaurants. Our party of six ordered and waited--and waited--and waited--while others, including a table of eight, were seated, ordered and served. My husband got up, found our server, and asked about our food. She brought it out soon after, but it was cold and not as ordered. The server was apologetic and offered to replace the food, but after waiting so long, we were unwilling to wait another hour. Others in our party just ate cold food. All of us agreed that we wouldn't recommend it or go back. Lots of other local restaurants from which to choose!"}
{"text":"This was my first time at the restaurant. I Ordered the spaghetti and meat sauce with meatballs and it was to die for!! All of the staff was super friendly and very attentive. If you're looking for authentic Italian I recommend this place to the fullest !! It's a hidden gem in Cuyahoga Falls, off 6th street!!"}
{"text":"I gave this place a bad review a few years ago so I revisited it and my impression this time is better.  The place looked terrible from the outside before but they've spiffed it up a bit.  More importantly, the pizza is better than I remember.  It's pretty good and I would definitely get it again.  There are lot of sandwiches on the menu too and I'd like to try them.  But this time the only other item I tried was the jo jo potatoes and they were first rate - crispy on the outside, fluffy inside and not greasy at all.    The beer selection is good, with a couple crafts offered.  I wish more of the inexpensive places around here would follow suit.   Atmosphere is probably the weak link here.  It's pretty cramped and worn inside.  But they are a neighborhood joint and they don't try  to be something else.  Give them a shot."}
{"text":"Great food and service.  Very friendly and reasonable pricing.  Love the pizza, fried chicken and mussels the most."}
{"text":"Great place. Came as a kid in 1970's. Now come every time I'm up from Nashville. Friendly people, great food, great price."}
{"text":"Waitress last night with the slicked back hair needs to go and get some training on how to waitress. She was one of the rudest waitresses I have EVER encountered. Will not go back"}
{"text":"Retz Laconi II makes solid pizza, end of story.   We often order from there for parties and small get togethers. Given we don't at the restaurant alot, the food has always been good both takeout and when we're there.  Feel is part dive bar and part pizza place. Not a place to impress but good food and comfortable.  It's sad that a few slow orders means that they are receiving such rough reviews."}
{"text":"Called in for take out,  lasagna and salad.  It was very good,  tons of cheese and the sauce is tangy tomato instead of that sweet sugary style.  Lots of food and not much deniro.  Not sure why so many bad reviews?  Updated : tried the fried chicken and jojos and they are amazing also!!!"}
{"text":"Love their pizza and burgers!  Sauerkraut balls and Jojo's are freaking awesome!  No delivery is no problem, their food is worth going there to pick it up.  The staff is also very friendly.  The dine in experience is of the family friendly neighborhood bar type."}
{"text":"This review is based on around a dozen visits in the last three years. We have a group that dines together every Friday night and this is where we end up sometimes if our first choice in the area  is too crowded.  Service is generally as enthusiastic as it is ditzy. Young girls who are very attentive telling you that your food is coming soon. You can bank on the fact that they will forget to bring part of your order. You hate to criticize them, but really you have one job to do.  The owner is an amiable fellow, who you will meet when he comes over to tell you to be patient, that all their food is made to order. It. Takes. Time. Really. What a concept. Made to order food. Brought to your table. Eventually. Warm. Sorta.  The food quality has slipped sorrowfully since the old days. The sauce has all the charm of straight tomato paste. I could go on but why? If you find yourself here for whatever reason, just order a pizza and move on.  You want to love places like this. Unfortunately, you're looking for love in the wrong place."}
{"text":"Love the bartender. Go see Bob and listen to a few of his thousands of jokes."}
{"text":"First things first. This is a neighborhood bar. This isn't advertising itself as a five star establishment. So everyone who is knocking it for its decor and the fact that it doesn't remind them of some snobs knob need a reality check. That being said; this place has some of the best Italian food I have ever eaten, and I was raised by Italians who lived in their kitchens. I come here all the time and have yet to have a bad meal."}
