{"text":"We were recommended this place by a tour guide as the husband wanted to try the smoked meat but regret taking his advice. Yes the sandwiches were huge but that doesn't negate the fact that they were incredibly dry and plain. Also, while I understand the fact that Montreal is in the midst of an English/French language battle, our waitress clearly despised us for not speaking French and we practically had to beg her for drinks and our check."}
{"text":"If you want a tourist's smoked meat sandwich this is the place to go. Nothing too fancy, reminiscent of a NY diner with decent service. Had the super combo sandwich with a slice of Swiss cheese (not sure when two slices of cheese started costing $1.29) but well worth it. All in all a place to hit up if you want to partake in a Montreal food must but don't go in thinking you be light on the wallet, it's a tourist trap on a tourist street, so be prepared."}
{"text":"This restaurant is truly (1) a Montreal experience, (2) tourist worthy, (3) a local favourite.

Having been here many many times, I come back to the restaurant when I really crave a classic Western menu with a twist of Montreal French cuisine.

Southern Crisp Chicken Tender Salad:
This salad is by far my FAVOURITE, and I always order this ever time I go to this restaurant. The chicken tenders are so crispy on the outside yet soft on the inside, the abundant vegetables are so fresh and goes well with their barbecue ranch dressing. It also comes with some three cheese garlic bread. The salad is actually big enough to be a full entrée, at least I think so. I strongly recommend this salad.

Rocky Top chicken:
It comes with two grilled chicken breasts cooked just right, with mashed potatoes, barbecue sauce, bacon, tomatoes, cheese, corn, and black beans on top. Because the dish has two fillets instead of one, it is very filling, and almost enough food for two! Ken and I usually get the salad and chicken, and share both between the two of us. I don't know Reuben's does it, but their chicken fillets in this dish are cooked fully through yet they are not dry, as chicken breasts can be at times.

Smoked Meat Sandwich: 
My husband recommended the smoked meat sandwich to me when we first visited the restaurant on our first date. Obviously, Montréal is very famous for their smoked meat, and Reuben's may not be the best place to try them. However, now that I've tried smoked meat sandwiches at all of the top rated places, I must say that my husband was right when he said Reuben's smoked meat sandwich tastes pretty good. It is not a bad choice!

Strawberry cheesecake:
By the restaurant's bar, you can see their dangerously good desserts luring you in!
We tried their cheesecake on one of our visits, and I'll say that it is one of the better places you can go for cheesecake. Of course, I have my favourites, but Reuben's cheesecakes come quite close!

The restaurant usually has long lineups during dinner peak times, so make sure to reserve a table before you go if you don't like waiting. Their service can be on and off, usually depends on how busy they are, which can be understandable. I've had pleasant and mediocre experiences throughout the numerous times I've visited, so service averages out to 3/5."}
{"text":"I chose this place because the reviews on Yelp were decent and it was close to my hotel.  I must say that I was overwhelmingly disappointed with this restaurant.  I consider myself an amateur foodie and I'm always looking for a gem and this place was not even close.  The first problem I had with this place is that it was located in a dreary basement 2 stories below ground level.  On first entrance you feel like you've walked into a cheap diner from the 50's.  We were greeted by a friendly hostess and that was where the niceties stopped.  Our waiter was quite unfriendly and he took 10 minutes to come and take our order even though the restaurant was basically empty on a Monday night.

My friend and I ordered the smoked meat sandwich hoping the food was better than the service.  Whoever said in their review that this was on par with Montreal's best smoked meat must be in the twilight zone or has had no experience tasting smoked meat in Montreal.  I realize that comparing any place to Schwartz's seems rather cliche but the truth is there is no comparison.  There are plenty of other places that don't serve overcooked smoked meat on terrible bread with tasteless mustard like Reuben's does.

The last point I will make is the fact that I ordered a garden salad instead of fries and they charged me $2.99 for the replacement.  Normally I wouldn't complain about this, though I think any restaurant should offer a replacement of fries with other side dishes at no charge, but the garden salad was absolutely horrendous.  It came in a cereal bowel and it was like I ordered 'ranch dressing with some romaine lettuce on the side'.  

They don't have any beer on tap so I ordered a heineken and my meal ended up costing almost $30 with tip.  This was one of the worst dining experiences I've ever had and I would not recommend eating here.  The only reason they get 2 stars is because they do serve you enough food to fill you up if you can stomach it."}
{"text":"They claim to have made the first reuben sandwich, but there are tastier ones out there. It wasn't bad, but it just that it didn't live up to the hype."}
{"text":"I was so disappointed with this restaurant. I am not sure why it got so many good reviews from other reviewers.

First off, if a restaurant has about 200 different items to chose from on their menu, you already know food is not going to be of good quality. 
I decided to go for the smoke meat sandwich, as it is \"their specialty\". The meat was poorly seasoned, over salted, and whey over cooked.

The service was the worse I have experienced in a long time. The staff working that day all looked like they wanted to shoot themselves, and our waiter was really unpleasant, taping his pencil on his pad when we were making decisions about what to take...and it's not like he was in a rush, cause the place was basically empty...

The food was way overpriced for what it was as well.

The only reason I am giving this place 1 star is because I can't give 0.5 star....

If you're thinking of going to this place, your money would be better invested in a big mac..."}
{"text":"Great portions, good service. Classic delicatessen with all the fixens'! Made a mistake coming here thinking it was the Reuben's located at 1116 Rue St. Catherine's. Pleasantly surprised. The two are not related with this location very reminiscent of Carnegie's in NewYork City. Get the smoked meat poutine, a small is good for 2-3 people and is a perfect balance of succulent in-house smoked meat on a bed of skinny pomme frites accompanied by warm Swiss cheese curds and a hug of savoury gravy. It's the perfect balance of ingredients without being too salty.

Would definitely come back to this classic!"}
{"text":"I look forward to Reuben's every time I'm in Montreal; I'm a huge fan of this place!

Reuben is located on St. Catherine's amidst all the shopping and fun. This place seems like a little hole in the wall when you see it on the street (don't confuse this place to the other restaurant called 'Rueben's Deli'). Once you open the door, your right on top of a long flight of narrow stairs going down. The dark red walls and carpet give you a cozy feel and the pictures of all their food framed up really make me hungry!

When you've finally gone down all those stairs you're greeted by a friendly worker who seats you in a booth. Almost all the seating in this restaurant are booths, which makes your dining experience more comfortable and private since you're not crowded around tables of other people. This restaurant is a basement restaurant and is all done up in a dark and warm red color. The place is pretty big, somewhat stuffy during warm seasons and has no windows; I slightly feel claustrophobic in here. The entire aura of this place is like a diner. I can see the back counter that consists of all the tempting desserts, a man making food and a little bar right next to it.

The menu comes and it's hard to choose anything since everything seems tempting. There is a great variety of everything and the prices are very reasonable too. From what I can remember, the menu consisted of appetizers, soups, salads, breakfast, variety of sandwiches, burgers, entrées that consisted of steak, seafood etc; poutine, dessert, cocktails and much more. Overtime, I had the opportunity to try the turkey club sandwich, smoked meat sandwich, French onion soup, grilled chicken caesar salad, brownie, smoked meat poutine, cocktails etc. Each order of mine was gigantic, especially the smoked meat sandwich- it's impossible to put your mouth around that sandwich, it's so big! The food was made well and tasted really good too. Their brownie dessert I won't forget, it's the best brownie I've ever had- warm brownie topped off with vanilla ice-cream and warm chocolate sauce. 

The staff is friendly at Rueben's but the service can be a little slow sometimes. However, this didn't stop me from coming back; the food is just too yummy!

Overall, Reuben's Restaurant offers great food in terms of quality and quantity at reasonable prices. The service can suffer sometimes, and so can their décor. In the end, I recommend this place!"}
{"text":"We had to try it and b'y Jesus this was the best sandwich I've ever had. The only problem is I will never be satisfied with any other smoked meat. The bar was raised. First stop next time in Montreal."}
{"text":"Smoked meat spaghetti holy moly!  I wanted a sandwich but this platter just sounded really good...and really filling.  I will try and make this one day."}
{"text":"We got into Montreal late in the evening and stopped by Reuben's to get a smoked meat sandwich for dinner. The portions are huge and the sandwiches are delicious. I got the Reuben's sandwich and my husband ordered the roast beef super melt and a hefty slice of cheesecake for dessert. The food was great, but the service was kind of slow for an empty restaurant."}
{"text":"My daughter and I ate here for dinner on a trip to Montreal. Being from New Jersey I immediately felt like I was at home in a traditional Jersey diner.

 I had never had Poutine so my daughter insisted we get an order. It was delicious. If this is how all Poutine tastes I would gladly eat it everyday. Our meals were very good. I had the traditional reuben sandwich and my daughter had salmon. We were both very happy with our meal choices. 

We had 2 complaints. First, our waitress was very rude to us as well as her other tables. None of the other waitresses were rude. My second complaint was that they didn't have a very good selection of specialty drinks and the margarita I had was very salty."}
{"text":"Down a long flight of dimly lit stairs on Montreal's main street. Lighting inside could be better and more helpful for diners to read the menu. Waitress insisted on continuing to ask us questions (ready to order, refills?) despite us answering in English. She did speak English, too. The super smoked meat sandwich ($16) was decent and the fries more like McDonald's which was fine. It also comes with a vinegar-based cole slaw. The hamburger ($12) was of the frozen variety and just a bit too salty for my liking but a good half-pound and also served with fries. We ordered a side of gravy it was watery but okay in flavour."}
{"text":"We visited Montreal and looked for food places around the area. We ordered spaghetti smoked meat and it was good and big serving. Comment on French Onion soup though was it was too salty for me. Overall we don't regret eating in this restaurant."}
{"text":"Passamos três noites em Montreal e fomos jantar duas delas no Reuben's. O sanduíche de carne defumada é sen-sa-cio-nal. As sobremesas também não deixam a desejar. Desejo agora só o de voltar lá."}
{"text":"Pretty standard diner fare and we had a waitress that seemed completely indifferent."}
{"text":"Stopped in for lunch with my wife's cousins who were visiting from England.  I had the super smoked meat sandwich.  One word,  delicious. Thick stack of perfectly smoked meat on fresh rye bread.  Accompanied by generous helping of crispy (frozen) fries, dill pickle and cole slaw. Server was Greg who was very accommodating with my wife's request.  Huge sliced turkey on rye with mixed green salad.  Cousins had Asian salad and omelet. Would be a five star except for the frozen fries."}
{"text":"Generous portions, feed is very good. We had the Reuben, and fries with gravy. The Reuben was moist and flavorful!  This is a must stop if you are walking on St. Catherine's Road."}
{"text":"Brunch très bon et vraiment pas cher du tout !! (8$ hors taxe en moyenne pour une belle assiette), le personnel est très agréable.
Le seul petit hic c'est que c'est assez gras mais c'est quand même très bon !

Je recommande vraiment !"}
{"text":"We went there at the suggestion of our hotel receptionist who said they had the \"famous Montreal smoked meat\".  The smoked meat was a lightly smoked beef brisket which was the most delicious and tender I have ever eaten. The sandwich comes open face piled high with lots of meat. Accompanying it were fries and coleslaw. All were delicious as was the cheescake for desert. My wife had a Caesar salad and I had more than enough brisket to share with her. Definitely recommended for lunch."}
{"text":"I wish I could write a full review of Reuben's, unfortunately I can't comment on the food as I was never seated. I can, however, comment on the service. 

My wife was off eating with friends, and I was on my own for dinner. Since Reuben's was close to my hotel and well-reviewed, that was where I'd planned on eating.

After arriving, I informed the hostess that I wanted a table for one, and that I would be happy to sit at the bar since they were busy. She took my name, told me it would be 20 minutes, and directed me to the waiting area. I waited. After she began seating people who came in after me at the bar, I asked why I'd been passed over. She looked at her sheet and said I had accidentally been overlooked. She told me they would have me seated within 15 minutes. 

What?! I asked her if she was serious and she nodded dismissively.

Having no backup plan for dinner, I decided to wait it out. 20 minutes later, it happened again. A group that came in after me was seated. I asked if I'd been skipped again and her response was, \"It appears so.\"

After standing there for over 40 minutes, I walked out. I'm still not sure why it happened, but all I got out of Reuben's was a terrible customer service experience."}
{"text":"Reuben's was recommended by a co-worker. My friends and I visited on two separate occasions-once for dinner and once for dessert. On the occasion of dinner, I enjoyed the smoked-meat sandwich. It was juicy and flavorful. As others suggest, go for medium in regards to fat, not \"lean.\" The decor is attractive (dark wood, wine bottles, art on walls). The server during dinner service was excellent. On another evening, we went back for dessert. The carrot cake is massive! All desserts consumed were delicious! The server on this occasion was surly. In regards to price, Reuben's appears to be a little pricey. Regardless, we enjoyed Reuben's."}
{"text":"Delicious melt in your mouth Meat Sandwich. Beyond enough to fill you ! Each sandwich comes with your option of coleslaw or fries. Remember to order a drink on the side to toast to the excellent sandwich. Great venue inside, excellent servers and great vibe !"}
{"text":"Looks good on the surface, but food is gross. I got very sick after eating here. I had a well done burger and was violently ill within hours. All the food at our table was subpar.  Don't fall for the smoked meat.  This place is low quality meat dressed up. The service was slow and seemed like they were trying to upsell every order."}
{"text":"Much like its sister restaurant which is above ground - Rubens offers great food and service. This Rubens reminds me of the late 80's/Early 90's in terms of decor but prices are less dear than the other location. Portions are not as generous and the meat that I had was almost as good as the other location. Judging by the lack of reviews, this location does not deserve to be treated as the red headed step child of smoked meat locations in Montreal."}
{"text":"This is my go to place for Smoked Meat as I really like their Reuben Special Sandwich. I actually prefer it over the perennial favorite Schwartz. The place can get really busy but has family restaurant feel. Their steaks are surprisingly good. The service is usually good but on occasion has been spotty (being overloaded). Wine is reasonably priced. Their desserts look good but I have never tried as there are so many choices for good dessert in this city."}
{"text":"Staffs are friendly even though they are Working on Christmas Eve. Very good smoke meats (beef & turkey) sandwiches! Pouting is also good stuff."}
{"text":"Love their dessert options and deserts, the meal was good and the waiter was ok! Friendly staff!"}
{"text":"Generous potion. Had to pack up half the sandwich and after 2 hrs I just have to eat it cause I can't resist it. It was my first time to be here, but definitely not the last. I would probably just try to eat half of the fries next time and get the cheesecake"}
{"text":"The food at Reuben's is out of this world! Not only is almost everything they serve huge and relatively inexpensive, but it's also delicious. I have had a number of things here ranging from omelettes to sandwiches, and I have never been disappointed. My personal favourite is the super smoked meat sandwich with Swiss cheese that comes with fries and an amazing dish of coleslaw with a fair slice of a pickle. Furthermore, I was surprised at how even simple deserts like a brownie - which they top with vanilla ice cream and drown in hot chocolate sauce - can be brought to a new level of awesome by them. I honestly can't wait to eat here whenever I'm in Montreal.

The seating at Reuben's is also pretty good, since most (if not all) of their seats are booths. The decor is unremarkable, but who cares, when you get to stare at the beauty of your massive sandwich. Furthermore, they tend to be understaffed so the service their can somewhat suffer, but don't worry because you have a massive plate of smoked meat in front of you to comfort you and make everything right!"}
{"text":"As a semi-vegan I only go there when friends insist on going here but I always like the ambiance and their salad. They have some good sea-food options and also their fries is always very good. You can find a good variety of drinks on the menu. Most of the time there is queue and you have to wait to get a seat."}
{"text":"I had the lunch special smoked meat sandwich with fries and coleslaw really everything was perfect. Atmosphere Service pricing taste everything perfect"}
{"text":"I think there's a lot of confusion here.  There is this restaurant called Reuben's, and another one, opened by the same person but managed entirely differently.  Reading these reviews, be warned because they may be for the wrong restaurant.  

This Reuben's is very similar to a diner.  Diner fare with the price of a decent restaurant, too.  We had a nice server, but the food wasn't to any of my family's expectations, considering we were planning on going to a different restaurant.  My dad even got food poisoning from the steak he ordered.

Definitely would never have gone in the first place yet again go back."}
{"text":"Location: 888 Rue Sainte-Catherine O (Montreal)
Service: Good
Price: $$

This is a neat place and you definitely get a lot of food for the amount that you pay for. It is really spacious but the lighting is really dim... The portions are large enough for two people and the drinks are good as well. The fries are shoe string and it is very similar to McDonalds' fries (not as grease which is a bonus). The meat to sandwich ratio was uneven but I wasn't complaining (there's a lot of meat!!). I believe I ordered a drink similar to \"sex on the beach\"- don't remember the name exactly... However, the ratio of alcohol to juice was on par, since they did not drowned out the alcohol with juice! 

Verdict: MUST GO"}
{"text":"Very disappointing smoked meat sandwich.  Greasy and tasted boiled not smoked. They put mustard on the sandwich which I found weird and no gourmet mustards.  Fries are shoestring style and weren't bad. Coleslaw was really good. 

Not to be confused with the \"real\" rubens across the street...this place is all show no go."}
{"text":"Cette place est un classique personnel. Pour un montréalais manger une smoked meat est comme un rituel. Bref je trouve cette place rassurante et confortable."}
{"text":"Horrible.   This is a tourist trap and the fact that there are 2 restaurants named Reubens on the same street a few blocks from each other is ridiculous.  The other Reubens at 1116 seems to be a better place....although I will never know for sure since we found this one first and mistakenly went in thinking the reviews we read on that place applied here.    Many people mistakenly post pictures and write reviews for the OTHER Reubens on this businesses Yelp site which makes it even more confusing. We should have turned and walked out based on the gross dirty and dated red carpeted stairs taking you downstairs into a space with a creepy outdated decor.....but we stuck it out....and I can say that it was one of the worst decisions we made while visiting.   Food was horrible, service was horrible...... Just stay away from any restaurant called Reubens.   If the owners at 1116 are stupid enough to let this dump take their customers....they deserve their fate.    I would hope these places have 2 different owners.....but their menus are very similar....."}
{"text":"After being gone from Montréal for a month I was craving comfort food a la max.

Reuben's delivered.

Friday night 5:30 pm
Service was fast and very professional.

I've eaten here more then I can count and I've yet to have a waiter as professional and friendly as the man I had. He was from around lac saquaye area I believe tall man with brown hair. Opened our napkin sticker and removed the sticker from the table. He went that extra mile and we really noticed. We shared our meal and he brought us plates for the salad the poutine and sandwich. Most the time they just put it in the middle and you both have to try to lean over the table to enjoy your meal.
At the end of our meal he said happy holidays have a good night and thank you for coming. This guy deserves employee of the month. 

5 stars to our waiter
4 stars for the food,smoked meat isn't my favourite in Montréal but all around tastey!
 Bravo"}
{"text":"I'm still dreaming about their Smoked meat sandwich. Their service sucked but the food was freakn amazing!"}
{"text":"Wow, I can't believe I still haven't finished my Montreal reviews.  Reuben's makes a great breakfast.  I had eggs with potatoes and fruit and it came with toast.  The service was poor though even though the restaurant (which is really more of a diner than anything else) was far from being busy.  It took an eternity to get menus, our beverages, the food, the check, etc.  I have mixed feelings about this place."}
{"text":"Excellent Montreal rib eye. I'm from San Francisco and was blown away from the 28 day aged steak. Great service too."}
{"text":"I find that their smoked meat is very good, I recommend checking it out if it's your first time in Montreal and you would like to try some local food. 

During my last visit, I ordered one of their steaks. I think it's called Hamburger Steak (I might be wrong). It is served with sauteed onions on top and comes with a side of French fries, veggies, a pickle and some gravy. 

Portions are pretty big and food quality was also pretty awesome. Service was also good (the waitress was very nice to us). 

The only thing that I didn't like was that it was very dark inside."}
{"text":"My smokes meat was perfect and the pasta dish I tried was also good but the service is so bad!"}
{"text":"Visited Montreal this week and stopped in here. Some of the best people working there. Great atmosphere, great staff (even though I was wearing Oilers attire in Habs country), great food. Try the Original Strawberry Cheesecake. Fantastic, and the crust will blow your balls off."}
{"text":"The Greek salad with tzaziki type dressing was really good. The garlic cheese bread wasn't very flavorful though. Free WiFi and friendly staff"}
{"text":"Since coming across Reuben's on one of my visits to Montreal almost a year ago, it's become a regular spot for me for a fantastic meal. It never disappoints. The staff is friendly and attentive. The ambiance is casual yet still you can still find a romantic table. I've never had a bad meal here"}
{"text":"My husband was in Pastrami Heaven great menu.. there was a line, but the wait was fairly short.. great service... fabulous menu.  I had a luncheon special Cesar salad... dressing was delicious. Great spot for lunch"}
{"text":"This was my first Montreal smoked meat sandwich, and I think its just not the type of meat I get excited about. 

I'm a pork guy and this just seemed like a lot of meat for not a lot of satisfaction. A credit to the fact that it was a giant pile of food including a mountain of french fries and even a bowl of coleslaw with a 1/4 of a sliced pickle atop it. 
I certainly did not leave feeling underwhelmed by the amount of food for the $15 it came to after tax before tip, but flavour wise just didn't leave me wowed like the hype calls for."}
{"text":"Started as a 2 then ended with a 4 rating.  Server was unfriendly at first and didn't seem to want to help us.  He couldn't give us any suggestions and appeared bothered when we asked him questions.  It may have been that our party of 4 told him we weren't very hungry and wanted to share.  We ended up getting their signature beef sandwich (1 lb option), short rib poutine, and several beers and wine.  The server's demeanor changed in the second half of our visit.  He became talkative and shared personal fun stories with us.  The food was very good especially the poutine for me."}
{"text":"it's pretty much a diner with their own deli on the premises.

the smoked meat (think somewhere between pastrami and corned beef) was great, and probably the best part of my breakfast. hot and tender, it mixed well with the scrambled eggs, crispy home fries, and toast. coffee was pretty good too. big, filling portions, and this whole thing costs just around 6 bucks (with coffee/tea included)!

service was...eh. there only one waitress at 10:30 AM, and only a few tables with customers. took us forever to just get a menu, get coffee refills, and get the check. we were kinda in a need to get on our way for sightseeing, so that's really my only issue.

a filling breakfast for 2 set us back just 12 bucks. and the guy behind the deli counter was from Astoria! NYC represent!"}
{"text":"Restaurant looks nice. 
The famous super sandwich $19.53
Includes fries, coleslaw, pickle & smoked meat sandwich
Fries are really good. On par with McDonalds.
Coleslaw and pickles cut through the richness of the sandwich.
The smoked meat: smooth, buttery, dark"}
{"text":"This place is always a safe bet when you're hungry and are looking for reasonably priced food in this touristy Montreal area.  

The wait staff are friendly and helpful.  Their smoked meat sandwiches are delicious, tasty and juicy.  My favourite is the Tuna Melt - OMFG!!  Their fries are kinda meh, but the coleslaw is light and not too sweet and I love me them dill pickles.  Avoid the roast beef, it's a little dry.  Also, changing your side of fries to a salad tacks on an extra $4.50 to the combo price.

This place is always busy and for good reason."}
{"text":"We come here a few times a year to get our smoked meat fix. We tried all the other smoked meat restaurants in Montreal but this one is the best in terms of consistency and keeping true to the tradition and great overall food experience. 
This time I had the Super smoked meat platter with a poutine and coke. It hit the spot and we will be back...."}
{"text":"First of all, there are two restaurants named Reuben's on Sainte-Catherine. This one is across the street from Place Montreal Trust and you have to descend a flight of stairs to get to the dining area. The dinning room is dark, the booths are cramped and narrow. The waitstaff are inhospitable although from what I could tell, if you speak french (I do not) the service suddenly gets better. After establishing that we did not speak french with our waitress, she continued to only speak to us in french even though we heard her speaking english to other employees. 

The food was below average and pricey for what it was."}
{"text":"Rueben's Rocks!!
I have been there three times now and every single time it has exceeded my expectations. If you read my other reviews you'll know that I am more discerning than the average person. I'll just state for the record that I have more than a little experience in the food and bev industry. 
One of the hardest things to pull off in the restaurant industry is consistently good service. Servers have been gracious and attentive every time. Also, the place is clean. 
The Smoked meat is on a par with the best in Montreal. The sandwich is too big for most people to finish. But the real surprise was breakfast! IMHO, the best breakfast in Montreal. For less than $10 you will get  a great breakfast and not walk away hungry. 
The smoked meat skillet has eggs, swiss, smoked meat and fresh grilled potatoes - awesome!  Bacon here is also really good. Also you can get a side plate of Smoked Meat; they grill it lightly and plate it, nicely done!!
We haven't managed to do dessert yet; I'll update when we do. I think we're going to have to go for just dessert since food here is so good I can't save room.
Dinner is not cheap but well worth it. You'll spend about $50-75 for 2. Depending on beers and dessert. 
Btw, it is not far from the rue Stanley exit of Peel Metro station."}
{"text":"I knew it from the minute I walked in that we were in for a below average meal. The place had a funny smell to it and was a little dingy.

We sat in a booth and hoped for the best. Had to try the smoked meat and the poutine.  The smoked meat was tough and didnt have much flavor. It was also rubbery.

The poutine was better but not the best. Gravy was too runny and had no flavor. 

The service was good so I hate to give them a bad rating but this place was not good. 

This is a tourist trap and unfortunately I fell into the trap."}
{"text":"Really good smoked meat sandwich.

Here's my dilemma when it comes to delis...

the sandwiches are made with a ridiculous amount of meat. seriously, who eats like that? so, i always have to take some out just so i can wrap my mouth around it. but then i have a pile of useless sandwich meat begging to be eaten. 
Can i should i ask for more bread and eat the equivalent of 2 sandwiches? or do i just leave the sad pile of meat? 

i usually do the former followed by a trip to the drugstore for some alka-seltzer."}
{"text":"There's not much that I can say about this restaurant that hasn't been covered in other reviews.  I've eaten breakfast and dinner several times over the years and have always been impressed.  Service is usually good and, as others stated, portions are large.  Food is not extremely high quality but it's good and predictable (that's actually a compliment).  As others stated, it's kind of a dark place - it's in the basement level and has a lot of dark-stained wood, so it would take a lot of lighting to make it look sunny.  It's a nice atmosphere for dinner, but a little gloomy early in the morning.

Overall, I would recommend Reuben's."}
{"text":"We came here for a night cap after we had dinner.. OMG!  The smoked meat poutine had a mound of smoked meats on top.   The 18$ sandwich was well worth it.  The meat melted into your mouth.  

The speciality drinks were great!  There was one with raspberry puree that was decadent.  

On top of that we had an amazing waitress, Julie?  (sorry!  its been a while and i did not have wifi while i was in CA).  She rolled with all our jokes and even contributed to the hilarity that was our table."}
{"text":"well if you feel like the \"north american\" fare, smoked meat, I guess this place is o.k.
But I know much better places on St-Catherine's a bit further west.  This restaurant is dark and dated, our waitress quite rough and as I said, the food o.k.- no frills.....
I won't go back... (no beer on tap...)"}
{"text":"Montreal Smoked Meat Sandwich was what I was after since I was in Montreal.  Recommendations from the hotel staff were Schwartz or Reuben's.  I chose Reuben's cause it was closer to the hotel.  Sandwich was delicious, nothing spectacular about it though.  All in all was happy with the meal, and the service was excellent."}
{"text":"this place was ok. 

I was in town for work and a friend suggested this place saying their smoked meat sandwiches were really good and this place was well known in Montreal. 

so I went and ordered some smoked ham on a hero and it wasn't bad but it was nothing special. if you wanna stop by just because it's reubens, hey great! if you miss it? no big deal."}
{"text":"Awww man, there's two Reuben's and I went to the slightly lower rated one? What was I thinking? I knew something was off on this visit. That being said, my food was pretty good, and the portions were generous. But the prices were pretty high for what you get. And the service... well, it was a typical deli experience, I'll say that. Not bad service, but not amazing. I guess it's all part of the experience."}
{"text":"Super Smoked Meat Sandwich. 
Succulent, juicy, and full of meat! I almost wish there had been a littttttle bit more bread and mustard maybe....Portions were HUGE! I only ate half my sandwich, took the rest with me. 
Club sandwich was amazing as well! 
Service was decent."}
{"text":"C'est vraiment un incontournable pour le smoke meat! Je me dis souvent que je devrais essayer autre chose sur le menu... Impossible!

Pour moi c'est toujours le super smoke meat ou le spaghetti smoke meat... Miammm!!

J'adore aller au Ruben's pour la bouffe, mais aussi pour le feeling d'être dans un VRAI delicatessen et l'excellent service. À chaque fois, les serveurs sont juste trop sympathiques et rapides!!!"}
{"text":"I LOVE Montreal smoked meat, so when I finally got to Montreal I had to try the top 2; Schwartz's and Reuben's. When I get smoked meat (I think another poster pointed out that it's not smoked; it's brined; semantics; I don't care but maybe this should be clarified) I don't like lean meat it has to be medium because the taste is in the fat. You are already ingesting a ton of calories, what's a few more. Schwartz's is way too dry. Reuben's is buttery smooth and delicious and probably worse for you but Oh so good. The portions are huge. I always get the Jumbo Smoked meat. You have a hard time holding it in your hands.Today I ordered the large smoked meat poutine for 2 of my kids to share and I don't think I touched my own fries because I was always eating thier poutine. That large smoked meat poutine is huge. Look at pictures on you-tube and see for yourself; Heaven. Service is fast and friendly although every time I am there I always get a francophone waitress that has difficulty with English (but I'm the tourist so not a problem) and I never have any issues; they are still incredible. There is no better place to have this delicious meat in the world. Thanks Reubens. You are a staple food of Montreal."}
{"text":"I went to Reuben's recently to celebrate a friend's birthday. I don't go here often but it is the closest sit down smoke meat restaurant to where I work (~15 minute walk) so when I'm in the mood for some smoke meat (when I am at work for lunch), I usually wind up here.

I had just had some smoke meat at Chenoy's a few weeks earlier but my friend wanted to go here and since it was his birthday, it wasn't really my decision and I do enjoy good smoke meat.

When we went, it was somewhat crowded. We entered and went downstairs and were seated ~2 minutes. We both took a look at the menu and didn't see any smoke meat lunch special advertised on their menu. When the waitress showed up and asked us if we had decided what to order, I asked if they still have the smoke meat lunch special. She confirmed that they did so I ordered that and my friend did like-wise. I'm not sure if there is a choice of the type of smoke meat (regular or old-fashioned) but we weren't asked nor were we asked what type of cut we wanted (fatty/regular/lean). The smoke meat lunch special comes with what I would describe as a small smoke meat sandwich, coleslaw, pickle, fries, a small soft drink. After placing our orders, one of the servers brought us each one small glass of water. A few minutes later, we received our plates which was the small smoke meat sandwich, coleslaw, pickle, fries and followed that up with our soft drinks.

I felt that the smoke meat sandwich was okay and similar in taste (but smaller since it was also a few dollars less expensive) to what I had at Chenoy's a few weeks earlier. The fries were shoestring type fries similar to what you would see at McDonald's. The coleslaw was very good for coleslaw.

After finishing my smoke meat sandwich and my coleslaw, I also finished my water but was never asked or offered a refill. I finished off my fries and waited for my friend to finish.

The server passed by and asked if everything was good and I answered that it was. He gathered our plates and then asked if it would be two bills or one bill and I mentioned one. Although neither of us wanted coffee or dessert and were in somewhat of a rush to get back to work, he didn't ask if we wanted anything else. He then asked if I would be paying by card and I said yes. He brought back a portable credit card reader.

I would rank this place as 3 stars (similar to what I ranked Chenoy's) mainly due to not advertising the smoke meat lunch special and not refilling our glasses of water automatically. The smoke meat was okay but as mentioned, I prefer the drier shredded smoke meat style of a Schwartz's. The smoke meat I had here was what I would term \"ham-cut\"."}
{"text":"Classic Montreal smoked meat! Personally this is my favorite smoked meat in Montreal. The menu offers many options, most of which come in large portions. The food is simple but delicious. The smoked meat is perfect to my taste, not too salty or greasy. The pickles are awesome! I've also had their salads and they come in the size of 2 regular salads but for the price of one (yay!).
While I enjoy the classic old-timey vibe of Reuben's,  I think the restaurant could use a makeover to make it look more polished and give it a nicer finish (but that might just be my inner hipster talking). It seems like it's all over the place with the retro furniture, the different color palettes, and the multiple big screen TVs that are dispersed randomly. The service was also slow on different occasions when I was there. 
Overall, an uncomplicated and generous diner for some smoked meat."}
{"text":"This place was OK. I have no real complaints, but it was sort of middle of the road. We came here the day I moved all my junk into the new apartment and we were completely tired of walking. It kind of looks like if your neighborhood deli was magically whisked away to Times Square and had some weird murals painted inside.

It is in a really convenient location if you're in the middle of the big shopping district and they have some nice basic things.  Their beer is quite reasonable if I remember correctly, but I think their food is a little pricey.

I recommend their roasted veggie sandwich and chips. I was amazed that some little kid at the next table ate an entire plate of poutine as his dinner (and his mother was congratulating him!!).

The servers here are really nice and quick."}
{"text":"Good food, nice for a quick lunch or an informal dinner with a friend...the waitress was a bit bitchy...not good  for seniors citizens since they have to walk downstairs and then climb back . I will go back if I have no other choice."}
{"text":"Service is average but not amazing. 

Food was really good. I do not recall what it was called but it was a baguette with smoked meat and Dijon mustard. It was delicious. A friend had the French onion soup and it was average but nothing special about it. 

The price was decent for the quality of food we had. I would go again for the smoked meat when I visit Montreal."}
{"text":"This slightly over priced deli serves enormous platters and sandwiches of smoked meats in classic Montreal fashion.  Desserts are huge.  Avoid around Habs games if you want to eat in a prompt fashion."}
{"text":"Classic old style Jewish deli.when I say old style it's circa 1970's Joe Pesci Goodfellas kinda place. These are a dying breed in Montreal. This Reuben's is the location downstairs Just around the corner from Place Ville Marie. Keep in mind if you are a newbie to MTL. The other location is between Stanley and Peel W of this location (and much bigger) As you enter downstairs it's a bit more dimly lit than the other location. It also screams 1970's decor. Known for their smoked meat, burgers, sandwich, cheesecake it's a menu that should please most. On my visit I decided to go with a club sandwich and my wife ordered a smoked meat. The smoked meat is piled pretty high but my club sandwich was a bit dry and I needed to spread extra mayo to get it down the hatch. Overall it was a decent meal with fries coleslaw and garlic dill pickle. Not overly amazing but on the better side of okay. One small annoyance was little flies pestering us around while we were eating. I'm not a fan of bugs in a restaurant however a strip of fly tape can usually help this issue. Overall it's a 3.5 star experience. I prefer the larger location but this one is decor-riffic."}
{"text":"I wasn't as impressed with smoked meat as i thought i'd be."}
{"text":"The best smoke meat Sandwich I have ever ate.... I definitely recommend who ever is visiting Montreal to go there and give it a shot... amazing people and even the owner came to check that we enjoyed our meal.."}
{"text":"That smoked meat made me roll my eyes it's too damn good. Very cozy atmosphere, no loud music and comfort food. Really nice. Great value. Got the small poutine and it was huge, enough for me and my husband. The smoked meat omelet is great and the sandwich everyone is talking about holds up to its fame"}
{"text":"We stopped here for dinner. The waiter was very friendly and talkative. The portions are huge so good thing we were hungry. My daughter and I split the turkey club. My 9 yr. old ordered the kids burger and my hubby had the super smoked meat sandwich. All of our meals came with tons of fries and coleslaw. So if you aren't a big eater, sharing is definitely an option. We mentioned we were sharing the turkey club so the waiter split it and gave us an extra plate with fries and cole slaw for $2.99. Everyone was very happy with their meals but it is a heavy one. So go for a nice long walk after."}
{"text":"Excelling smoke meat sandwich, and great dining ambience ( a bit more on the loud side)."}
{"text":"Old school Montreal. It looks like 1977 in there.  The meat, though, is timeless. Jumbo smoked meat sandwich with slaw and a pickle equals lunch time happiness."}
{"text":"Downstairs on ste-catherines street I found a Reuben's.
It is 10:38 am
They are only serving breakfast at the moment
I am by myself 
I was seated within a minute in a booth next to the bar
The booths are extremely tight im a thin girl and i felt a little closterphobic not going to lie
The cutlery is on the table already 
I was served water immediately
I requested a bagel with salmon and cream cheese which is priced at around 9.50 canadian. They call this bagel and lox ibe learned that after seeing a few menus.
I also asked for a coffee with sugar and a slice of smoked meat (hehe i said i wanted to try it) i thought the smoked meat would come with my meal but the waitress immediately broight me a slice on a plate it wqs very cool
Absolutely delicious smoked meat..i seriously tried this smoked meat in edmonton and could barely eat it at our best restaurant. Montreals smoked meat is something completely different. Similiar flabiur but super juicy!!! I was a little worried to try a sandwhich this was a great option!
Coffee came out shortly after the meat obviously the meat was more important which is good haha !!

Just noticed how funny this little restaurent is ..its ALL booths mazed together! No wonder they are so tight. There is also bar seating. 

10:55 no food yet.
Waitress is very sweet older lady doesnt speak alot of english but shes great.

10:59 food is here looks delicious
Was told to enjoy and offered peanut butter and jam coffee was filled up!


Very tasty
Build it yourself concept
Smoked Salmon comes in 4 huge chunks 
Smaller sized capers
Comes with onion thank goodness because i love it with onion
Cucumber lettuce and tomato are also on the plate
Bagel is massive
I used the lemon on the plate for my water haha

Just realized how many people eat here alone wow
Also just noticed how well this waitress speaks english 

Large dessert menu (didnt try it i was full but cheesecake is made in house) they wrap the slices and put them in the fridge but there are cakee in the fridge to cut fresh not sure why they would wrap pieces ready to go.

Coffee is free before 11 am!!! Nice surprise!!

Downfalls
Tight booths
There is sooo much lettuce on the plate which is a huge waste of food. 
SALMON doesnt taste as smoked as other places i have tried 
One sharp salmon bone in my salmon 
Price id a tad higher than grab and go spots but it is a restaurant so its okay.
Washroom is outside of the restaurant in the building kind of not nice looking."}
{"text":"Literally avoid. The one further down the road is better. This one being underground is kinda odd and our waitress...ok nice older lady but gave you that odd feeling to run. As we spoke English to her she kept speaking to us in French. I understand French from france but Montreal French has some things I don't  get. Besides the poutine tasting off, she dropped some food on the food picked it up by hand and didn't wash her hand. She also rushed the table to grab the cash while we were getting up. It was like seriously lady."}
{"text":"Tout le monde qui me connait bien sait que je ne puis pas impressionné à ce point là par un smoked meat. Pour moi, c'est pas dans les top 10 de Junk-food idéal ou que je préfère. Sacrilège! De ce fait, je ne vais pas souvent dans les délis. Je revenais du Chapter-Indigo et j'ai avait faim et peu de temps pour manger avant la fin de mon lunch, et j'suis arrêté au Reuben. Je me suis rappelé que c'était celui-là l'authentique Reuben, le meilleur! J'y suis allé et j'ai vraiment aimé mon lunch. J'ai pris le Royal medium (pas le maigre) et c'était très bon et un peu cher pour la bouffe de Délis.

C'est quand même pas mal cool le côté vieillot de la place, tu sens que ça a une âme."}
{"text":"Classic Montreal Experience, We had lunch there. One of the only places we could find open on Canada Day. They apparently never close except for Christmas Day. Thoroughly enjoyed my Reuben smoked meat sandwich. I got one that came as a platter with fries and salad. Many options for the same dish were available plus others. Portions were huge at a very reasonable price. This location is in a basement but the seating area is very pleasant with nice wood paneling, bench seating laid out booths and lots of nice stained glass lighting fixtures.Classic north american Craftsman interior from the turn of the 20th century, very enjoyable.  It is a tight squeeze so don't go to the bathroom too often. They also have deli services there so you can buy the smoked meat in bulk if you want. Good Montreal experience."}
{"text":"went for the Montreal smoked meat experience, the sandwich was very good, the choices on the menu were a bit confusing because there was the super size and the jumbo size. we decided to get the super size and it was large! it is a very difficult sandwich to eat and not loose it all, but we managed. 

Our waitress, was so incredibly nice and welcoming. my only compliant was the fries you get with the meal are frozen shoe string fries for sure. but your there for the sandwich!"}
{"text":"Decent place for lunch.

Huge obscenely large portions, big enough to share. Prices are reasonable considering the enormous portion.

French dip sandwich was $13. Skip this, roast beef was very dry. 

The Rueben melt ($14) is a much tastier option. 

Sambos come with fries (exactly like McDonalds fries), a huge pickle and a side of coleslaw. 

 Service was very fast but probably because they want you to clear out - there's bound to be a line up for tables here."}
{"text":"I heard that Reuben's was a place I had to go to for Smoked Meat.
I had high expectations but was disappointed. The smoked meat sandwiches were not as delicious as i expected them to be.
I found out the next day that Reuben's is more known for their steak and that they don't make their own smoked meats. Whether this is true or not, I don't know.
But if you are looking for smoked meat sandwiches, there are a few better options."}
{"text":"This was the first bar i had ever been to!! Which was a big deal for me when i was 19 years old.  In montreal, they dont even card you, because you can legally drink at 18.  We took the subway (my first subway too!) to the opposite side of town, to hang out, and look around at the pricey high end stores and shopping. I saw a lotus and a lamborghini in the same day down here!! We stopped here at Reubens for a drink and lunch, because it looked american!! And at this point, i was welcome to some english speaking residents. Stellar stellar service, and the bartender was from Jersey!! We sat at the bar, I drank beer and ate a pizza, excellent food by the way. Apparently they have a lot of celebrities that visit this location, there is tons of memorabilia and autographs that line the wall, from Yankee baseball players, to Marilyn Manson.  A cool place to come for lunch if you are a tourist."}
{"text":"We were greeted by the most lovable and kind waitress. She had the enthusiasm of a Disney Character. She was moving around with plates in her hand like a ballerina and always asking us if we needed something else.

As for the food, it was average at best. The fries were just there to fill up the plate. My old fashioned, medium smoked meat sandwich had less meat than I expected. After a few bites I was left with just two bits of bread held together by mustard. The flavors were nothing out of the ordinary. Try elsewhere if you're looking for a good smoked meat."}
{"text":"What a disappointment! Located in the heart of Montreal and claiming that they have the best ribs of the city, Reuben's didn't live up its reputation despite being a popular food destination. I am particularly picky about ribs, so I found their homemade ribs quite bad. My friend took their club sandwich and liked it, but I didn't enjoy my meal and would look elsewhere if I need to dine out in downtown. The price is fair and portion is big, but quality is below average standards."}
{"text":"We tried the famous smoked meat sandwich. The dish is a bit pricey, but it's very well served, so you can share. It comes with fries, a small salad and a quarter of a pickled cucumber. The smoked meat and the fries were very good. We particularly liked the salad that was slightly sweet and helped balance the dish as a whole."}
{"text":"i sometimes prefer going to reubens over scwartz's - no long lines here, comfortable booths, and a lot of the times i prefer the smoked meat here - over that of schwartz's. the last few times i've been back to montreal i've noticed schwartz's smoked meat was a little dry. i think schwartz's might be a little overrated. reubens is a good deli on it's own and it's in a great location."}
{"text":"Stopped here for a quick lunch on one of our last days in Montreal. As soon as we stepped in the door, a waitress (literally) ran over to seat us. The overall feel we got from here was a traditional diner with stained glass accented lights, booths, and a dessert carousel behind the little island bar.  

What drew us in was the selection of sandwiches we had. Although we started with the French onion soup (which is a delicious, absolute must try) we ordered & were promptly served a crispy, fresh club sandwich served with fries, as well as a ham and cheese melt served with the same. 

The menu and food definitely give off the feel of a diner, and the food is fresh yet prepared quickly. The service was great and we were overall satisfied."}
{"text":"This is the first place I got to eat at when I arrived in Montreal.
They seated us quickly when we arrived at the restaurant.

The decor is a little dated and seems as though not much may have changed from it's original state from the 80's? The server was very helpful when we ordered our food, as it was him that suggested our meals.

I ordered a cold cut sandwich, and my friend ordered the Montreal smoked meat sandwich.  His was far better by leaps and bounds. I wish my sandwich was made with his meat but my tomato and lettuce - it would have been so good. The fries for some reason reminded me of McDonalds fries. We for dessert got the carrot cake to share - it's so big! - and it was good."}
{"text":"It was our last day in Montreal and we realized we hadn't yet eaten any smoked meat. Quelle horreur!

We arrived around lunchtime on a weekday and the place was already pretty busy. The ambivalent, almost rude hostess initially tried to seat us at a table that was literally three inches away from a table of loud businessmen, so we requested the more quiet table that was just a few feet behind it (which apparently annoyed our hostess, since she quite literally threw our menus down on that table). Not the best start.

Anyway, neither of us was terribly hungry and I wanted a beer, so we decided to share one of the lunch specials: Smoked Meat and Ale Combo (\"Our famous 10 oz. Super Smoked Meat Sandwich served on rye with mustard, fries, coleslaw and a pickle spear paired with our very own Reuben's Pale Ale Beer (14 oz)!\") We were asked if we also wanted a slice of mozzarella on the sandwich, and I said sure, thinking it would be melted. It was not.

The food arrived shortly after and any concerns I had instantly vanished. It's a really good 'wich. The meat is plentiful and juicy, while the rye was fresh and very tasty. The fries were also quite above average, and I sure did enjoy the house beer.

Would Schwartz's have been better? Probably, but who has time for that lineup?"}
{"text":"I was expecting something completely different after hearing so much about Reuben's. The outdoor sign pukes imagery of 1950s era diner. The inside looks like a Keg restaurant. 

However, my reuben sandwich was one the best I have had. Smoked meat poutine was good as was our 7 layer carrot cake. The rest of the group enjoyed their food, but nothing was extraordinary. My Caesar salad was not good. 

$16 double Caesars, meals all around expensive. Bill was $280 for 6 of us. All casual sandwiches and salads and one drink each. I though that was too pricey."}
{"text":"The attitude of their staff and their service was excellent.  In a 5-day period of our stay in Montreal, we returned there a second time, with no regrets.  Their onion soup was one of the best that my wife and I had had for a long time.  Their smoked meat plate and their hamburger were delicious and plenty (a bit too much food though!).  We enjoyed their special cheese cake very much; delicious and hearty.  I strongly recommend this.  Watch out! there is another restaurant with the same name a few blocks away which is more expensive.  This one is more original, and is located in the basement of a building."}
{"text":"They said it couldn't be done, but I did it. I ate a whole plate of poutine (french fries covered in cheese, gravy, and sometimes meat) by myself. It was good, but I was really full. Service, I remember was decent. 

review 8/7/2008"}
{"text":"Premier essai de cuisine montréalaise, on part avec des amis manger chez Reuben's, institution montréalaise de la smoked meat.

J'avais vraiment envie de goûter de la smoked meat. Je m'attendais à un bon goût fumé, de la viande délicate. 
La smoked meat, c'est pas vraiment ça en fait. C'est pas mauvais, mais quand même plutôt gras et sucré, et le côté fumé franchement, il ne m'a pas marquée.

J'en ai goûté encore ailleurs, et c'est pas Reuben's le problème, c'est que je n'en suis pas plus fan que ça, c'est un peu écoeurant à force.

Je mets 2 étoiles seulement car c'était pour moi trop moyen. Mon burger au Smoked Meat et au fromage suisse pas fondu (le classique je crois) n'était pas vraiment affriolant en terme de goût. 
Ceux des copains semblaient plus sympas mais malgré tout très classiques. Beaucoup de pain, manquant un peu pour moi de gourmandise.

Les frites, du pur surgelé, aucun intérêt. Les bières, des références vraiment basiques.
Un service sympa sans plus, et tout ça pour un prix pas si modique que ça.

Bref, je n'ai pas mal mangé chez Reuben's, mais pour moi, il y a beaucoup mieux à Montréal, vraiment."}
