{"text":"Great clean restaurant with delicious food. Generous portions. Will definitely go back."}
{"text":"Food was good but service was really pathetic this time and guy on the counter was very bad and don't know how to deal with customers. Probably I will not visit again and he really disappointed me."}
{"text":"I am visiting Montreal from San Diego, CA.  I walked to Riaz Kabab Restaurant, as it was very close by.  I had the Chapli and Sultani Kabab platter.  It was excellent.  Service was great.  Will be back here next time.  Highly recommend."}
{"text":"BELOW AVERAGE FOOD   So after reading the \"GOOD\" reviews here I decided to try this place and I was shocked.  - SALAD was horrible it was probably sitting in the fridge for days before serving it and the lettuce was turning brown tomatoes going bad topped with nasty salad dressing (probably noname brand ranch dressing) .  - The bread was microwaved so 3 mins on the table and it became hard to eat (  what's wrong with serving fresh bread???)   The kabobs were below average over seasoned so I didn't get the Afghani experience.  I already had Afghani food in Montreal I won't say the name of the restaurant and it was amazing, but the key of Afghan food is freshness and u won't find it at Riaz Kaba   Service ok/normal   I understand that it's not a 5 star resto but it seems that they are lazy and not creative if u can't make fresh salad with fresh ingredients then  I wonder about the freshness of the meats!!! sorry I won't go back.  Not recommended."}
{"text":"Great top notch Afghani cuisine, everything was fresh and so delicious...the portions are very generous...I had the Qablai Palao, it's a delicious rice and meat dish with 3 kinds of meat. It was excellent. I cannot give this place less than 5 stars, my only complaint would be the service which was a bit slow with only one server running from one table to the next trying to keep up., other than that it was a wonderful experience...I'll definitely be back."}
{"text":"Delicious food and welcoming staff. The meat tastes excellent and melts in your mouth. The portions are very generous too."}
{"text":"Great food ! Menu was very similar to any other middle eastern restaurant and not a lot of authentic Afghani options except for 2,3 dishes but overall food/meat tasted great ! Quantity of the food may not be enough for the price you pay depending on your appetite. I don't eat a lot so I didn't have any problem but the people I went with kept complaining about how the quantity of the food wasn't satisfying."}
{"text":"Was looking forward to trying this restaurant that only opened 2 weeks ago as it is a cuisine that Laval didn't yet have. The service was great, tried a bunch of dishes as we were several people including the qabuli palao, mantoo,  shami kabab, sultani kabab, murgh palao, and shish kabab. The prices were very reasonable and included a salad to start with. My personal favorites were the mantoo and the murgh palao, the mantoo had a bit of a spicy kick to it that was incredibly flavorful. The decor hasn't changed much as far as the seating since this used to be a breakfast place. Already looking forward to my next visit!"}
{"text":"Best kebabs I have had in a long time. The chicken and kebabs were very juicy. The rice was also full of flavor. I would recommend getting the \"wazery kebab\". You get a mix of both worlds with the chicken and beef. Service was very good as our waiter was attentive and kind. You can order takeout or sit and enjoy the meal in the spaceous resto."}
{"text":"This place has amazing food! The chicken shaming kabab is amazing and not dry! The fresh bread is awesome with their green slightly spicy sauce. The Ashak and mantoo are amazing! So far everything I've ordered are amazing in taste and portions are great with even reasonable prices. Definitely a place to try!"}
{"text":"Finally, Laval has been graced with authentic Afghan cuisine! Been looking at this place for some time since it opened and I'm very happy to have experienced what they can bring. I went with the Sultan Kebab and Mint Cucumber Yogurt.  Pros :  - My Sultan Kebab was out of this world good. The filet Mignon was perfect... just perfect. Succulent and moist beyond comparison! The minced meat had a nice flavor of spices and I enjoyed it a lot. The rice was so good! Huge plate, great portion! - Fresh flat bread was a very nice touch. - Mint cucumber yogurt drink was delicious and truly complimented my main meal! - Service was friendly and efficient, this place is ideal to lunch at. No lost time with quality food! - Price tag was very fair.  Cons  - There isn't any!  In conclusion, a total 5 star experience and somewhere I'll come visit on a regular basis! Hidden gem... in Laval!"}
{"text":"Meilleur nourriture afghane que j'ai mangé de ma vie!!!!! Délicieux! Le filet de kebab (viande haché) et le filet mignon étais cuit à la perfection avec juste assez d'assaisonnements. Je recommande à tous d'essayer se restaurant et le plus beau dans tout ça est que les prix sont vraiment abordable, 14$ pour entré de salade et une assiette de deux brochettes (filet mignon et kebab) avec riz. Juste parfait."}
{"text":"Superbe découverte! J'ai vécu au Kazakhstan, donc je me demandais à quel point il pourrait avoir des similitudes avec l'Afghanistan. J'ai finalement fait le test hier et je n'ai pas été déçue. Il y en en effet beaucoup de ressemblances, ce qui me plait car je suis loin d'être une cuisinière qui pourrait facile recréer les recettes de la maison. Première impression à mon arrivé; le personnel est authentiquement chaleureux. Deuxième chose que tu ressens est l'odeur délicieuse des plats qui se propagent dans le restaurant et t'ouvre l'appétit.   J'ai commandé des mantoo, en pensant au mantii que je mangeais étant petite. Ce sont des dumpling à la viande et oignons. Mon deuxième plat : des aubergines avec yogurt accompagnées de riz. Les deux plats étaient frais, chauds, et bien gras comme ils doivent l'être. Si vous recherchez du confort food différent, c'est une expérience que je vous recommande.  Les filet de kebab avaient l'air excellents, mais ça sera pour une prochaine fois. Le seul petit point négatif est le pain qui était très sec.  Mon conseil: partez à l'aventure et essayez ce resto. Si vous hésitez, les kebabs sont un choix facile."}
{"text":"Excellent Afghan cuisine,  The staff is jovial with lots of smiles. Plates are pretty full for the price . The meat is a good. The lamb chops a bit chewy. But I will definitely be back, overall experience is worthy"}
{"text":"We ordered from Riaz Kebab several times the shami kebab with rice and salad and I have to say it was always delicious and quality was a 11 on 10. One time the delivery driver did not have any change for 50$ so he just said that the nect time we ordered we could pay. The bread that also comes with their meals is amazing. Highly recommend this place."}
{"text":"Wow.... Totally blown away by this place.  In the city of Laval it's \"chain restaurant\" central according to my Yelp amigo Jason. Some of you out there may love the predictability of Boston Pizza, the Keg, Jack Astors or other mal ordinare places as such. I prefer to avoid chain restaurants where possible. There is a selection of some small business restos but on the whole I'd tend to agree that the selection in Laval has room for improvement. Please don't build more chains and if I was a kingpin mayor of Laval I'd encourage small business restaurants with tax incentives. Think \"field of Dreams\" if you build it they will come.   This place opened up this summer in the plaza across from Adonis. Damm...it is the real deal for Afghan food. I've eaten at Kyper Pass downtown and I'd declare this place better. Afghan food for those who have not tried it is somewhat similar to flavours of Indian but different. Also taking similarities to Lebanese or even Moroccan. For those who like to check out something different ethnically it's a refreshing change. Many meals are met and rice based.   On my visit I had selected the Chicken tandoori with rice that came with a salad as a starter plus a nice flatbread.  The salad was fresh and had nice crispy lettuce with a mild creamy dressing. The flat bread (complimentary) was fluffy and light. Now to my tandoori chicken it was moist a bit oily but oivee mes Amis.....this was outstanding in flavour. With a heaping portion of rice I decided to not finish it. Or my boss would have found me sleeping on my desk in the afternoon. Dammmm..... Thinking about this food makes my mouth water like a Pavlovian dog. To wash it down I had selected a mint yoghurt drink which was different but fresh and tasty none the less.   Two things. - 1)  I hope their portion size doesn't shrink over time as they get more popular  2) I hope this place does not get too crazy popular as we enjoy it a lot!   Fantastic food. If middle eastern is in your wheelhouse you will like Afghan food.   Restaurant was clean and service was very cordial. Thank you as Apu on TV from the Simpsons said \"come again\" definitely I will ."}
{"text":"So I have had Riaz kabab food 3 times already. (Everytime was take-out). It was very good.  Let's start with the appetizers, there yogurt is very good, they had a eggplant dish which is a must try. It was truly tasty, it had tomato sauce and a yogurt sauce and was served with homemade afghani bread. No joking you gotta try it.  The house salad is good too, nothing really special but a decent house salad with a refreshing sauce.  They also have a yogurt drink called doogh, which is basically like Lebanese Laban or Aryan but with mint and cucumber. For those who like this type of drink. They will enjoy this drink a lot.  So let's get to the real stuff. Their kababs. So a have a variety of kababs, from chicken either shish kabab which is pieces of chicken or thigh chicken. In my opinion the thigh chicken is much more juicier and tastier.  As for meat they have koobideh which is ground meet with mixed with onions and  afghani spices. (Very good)  Then they have pieces of filet mignon good too but sometimes it is dry.  On their me u they also have \"bard\" which is flattened filet mignon but every time we have ordered it they said they ran out. Honestly I don't think they have any at all, or maybe just on special occasions. I have been 3 times and my brother 2 times and every time they   Have said they ran out.   Overall the restaurant is nice. Good for families. But if you you want a romantic place maybe skip this one for now."}
{"text":"We stopped in this place on a whim because we were shopping for hockey gear at the nearby Pro Hockey Life/Sports Rousseau shop (which is itself phenomenal).  We saw this strip mall with Subway and various other mall-y food places, and saw Riaz Kabab, and thought we'd give it a shot.  It was delicious Afghan food, though it was the first time I've had Afghan food, so I don't exactly have much context.  The food is similar to the Lebanese and Greek souvlaki places you see all over New York City, with the spinning meat, etc.  At our table, we had a variety of kabobs - chicken, beef, and lamb, and also some stewed beef.  I would stay away from the stewed beef (can't recall its proper name), but I highly recommend the Waziri Kabob.    We were in a bit of a rush, and the \"diner\" subtitle on the outdoor sign appealed to us....alas, it took a long time for our food to come out, and the place was not busy.  So, speediness was the only downfall.  Worth trying out."}
{"text":"Great afghani food finally in Laval! Tried the sultani and the kabab plate.  Very clean and spacious and very friendly staff.  Very reasonable prices! We paid $50 for a dinner of four people which is way below than other similar places in the area.  Would for sure come back again.  I asked about delivery and they said it's not available yet. I think they're gonna have delivery once people have come and tried the food in person and once they have established their client base. Anyway, the place is near Adonis and it is very accessbile on cure labelle with plenty of parking."}
