{"text":"I had a great time here on my 40th bday. Great service and food. I had the half rack of lamb and it was great. I had some food issues like no milk products and they had no problem with that and changed my dish to help out."}
{"text":"Quite impressed!  Went to Ric's for a birthday dinner - the waitress was unobtrusive, but around when we needed something.  

Took advantage of the summer deal - $39 for an appie, meal, and dessert.  The appetizers were great - crisp spinach, fresh fruit, and tons of seafood on the mango salad, and the wasabi lime shrimp were excellent!  

My husband's steak was overcooked, but they immediately took it back and offered to bring him something while we waited.  The recook was fast, the chef personally came out to apologize, and the waitress was instantly there to check on the second steak, which my husband said was awesome!  And no problem bumping up the level of spice on the creole prawns.  

Dessert was wonderful, recommended by the server, as was the wine.  All in all, a great experience, with responsive staff, excellent food, and great value for such high quality.  We'll definitely be back!"}
{"text":"Great service! Our waitress was really fun and joked around with us and helped us with any requests we had.  The food was fantastic and would definitely go there again!"}
{"text":"Ric's offers a first-rate filet mignon and a good atmosphere to enjoy it in. We chose to sit outside, but the inside is nice and not over-the-top steaky....

The filet mignons we all had were cooked to perfection and juicy and tender. The server seemed to leave us alone (not sure if that's good or not, but we never went dry) and enjoyed the whole experience. Even when it started to rain and everyone else packed up and took shelter, we stayed outside, simply sliding the table under the eavestrough of the entrance to the condos next door. Some of the tenants looked concerned, but most didn't mine that we  were eating steaks in their main entrance and the waitress didn't either. She understood the customer is always right and why would she want to start trouble?

Anyway, very good place to grab a good steak downtown. A little pricey, though...."}
{"text":"Apparently the restaurant has changed names and is now XS Grill. I'm guessing the same people work here as it seems to be just the same place as described in previous reviews. Drinks are limited and expensive. I had the XS burger and it was a heaping mess. The sauce (not sure if it was BBQ or ketchup) was extremely sweet and overall was not worth the price. I've eaten breakfast here a couple of morning in a row and literally sat down, ate, and left before anyone came out to check on the customers. Definitely not worth the money."}
{"text":"Besides being left a bit awkardly at the front for a while before being seated, Ric's was fantastic. Helpful service, great food and a lovely evening. I highly recommend this place for a nice night out."}
{"text":"Ric's is my standby steakhouse when I want a consistent delicious steak but don't want to try anything new.

I always opt for the ribeye and stuffed potato. My steak is always cooked perfect to order and somehow they get a lot of flavour in to that potato.

There isn't anything amazing about this place, but there isn't anything bad either. Just good and consistent when you want a predictable meal.

The pricing is very standard with other steakhouses."}
{"text":"If I could give it zero stars, I would.  Took my friend here for her birthday and she didn't even get to eat her steak because they had cooked it wrong, TWICE.  Once is excusable but twice is not, especially if they are charging a minimum of $30 for it and calling themselves a steakhouse.  She had ordered it medium rare - the first was really well done, they took it back and brought out another for her and it was so rare that she couldn't even eat it.  The waitress didn't come back to check on us to see how the 2nd steak was and by the time she did, we had already finished our meals.  They also cooked my boyfriend's steak wrong and my fish was dry and bland.

Service was so slow, food was mediocre, and our entire dinner took us 3 hours!  

I wrote a private email to Ric's and never heard back from them.  They obviously don't care about getting customers back.  This is the first time I've been there and the last."}
{"text":"After many good meals here, we were ready to go back and when my wife tried to make reservations, we discovered they have shut down. In looking at the Ric's family online, a number of their restaurants have closed so not sure what's up. They used to serve a great steak and were as good as The Keg. Too bad."}
{"text":"We ate here in June and were told the hotel was dropping the Ric's affiliation. While they still had the Ric's menu, the steak was far from tasty and not up to the Ric's standards we had at other locations. Here it is, August and the hotel is still displaying the Ric's sign so not sure what's going on. Either way, we won't be back."}
{"text":"We were trying this one out for dinner. The atmosphere was appealing and we got a table on Friday night without any reservation, but with the time it was getting busy. We had a steak and a shrimp/scallop pasta dish. All over we paid a lot for a mediocre steak and pasta. It was definitely not worse the money we paid."}
{"text":"It was a Friday night around 9:30 or 10.  We were staying at the hotel and a $50 voucher for the restaurant was included in the package we purchased.  We had eaten prior to getting there, so we weren't interested in food and sadly were informed that we couldn't use it for drinks.  That's okay, we would use it for breakfast instead.

The service was awful.  The place was empty when we got there, but 3 other tables came in while we were sitting there.  None of the candles on the tables were lit.  The drinks were not too bad, but we had to flag down our server when we needed something, and then flag her down when we wanted to pay.

The breakfast buffet on Saturday morning was just ok.  But the service was WAY better.

For the prices here, you definitely expect top notch service."}
{"text":"Great steaks, nice atmosphere, perfect for a business lunch!"}
{"text":"Appetizer - Ginger Chili Chicken: was great. chicken was not overdone or fried and really enjoyed compared to other restaurant versions such as boston pizza / original joes / earls.

after that it was all down hill

Main - New york with Boursin:
The steak was good but it was nothing amazing that made me think this was an entree worth eating again or letting someone know about it. The potatoes served with the main dish were boring and bland and tasted like a dry potato.
Then the sauce used on the main dish was good but the entire entrée was covered in it and made the dish appear to almost be a soup. 

Finally had the oreo cheesecake for dessert and this was easily the worst part. The texture was that of a rubber puck. Not soft or crumble-like but rather when trying to grab a bite with my spoon it was like pushing a spoon through a rubber puck you buy from Canadian tire.

Comparing it to dessert cheesecake at the keg or olive garden I would rate this 0/10

There was no taste/ no crust and the chocolate topping drizzle was pathetic.

A meal that started off with great promise with the appetizer faded with a boring entrée for the price (and comparison to other up scale restaurants [keg, milestones] and even Canada wide chains such as boston pizza and pub food style original joes).

After tasting the desert it guaranteed I would not try ric's grill again, reccomend it to a friend, and if friends were trying to decide where to go for dinner I would instantly reject an idea about going to Rics Grill.

I dont know if I can reiterate enough how disappointing this meal was and how unsatisfying it was (specially for the price)"}
{"text":"Ric's Grill has been one of my favourite chain of restaurants to go to but what I find is that they lack consistency. I generally go to the one in the NE in the 4 Points Sheraton and probably go to the 8St SW location 1 for every 4 visits. The food is not up to the standards that I have come to expect from Ric's. I had the 7oz NY with a lobster tail. The lobster was cooked to perfection but lacked flavour. My steak (i asked for medium well) was really well done. The outside was seared so much it tasted burnt. The chef potatoes were also burnt around all the edges. The dessert was the highlight of my meal. I had the vanilla bean creme brulee and it was very tastefully presented. The chocolate sauce that decorated the plate was delicious. I will continue to go to Ric's Grill but maybe not this location so much."}
{"text":"The decor is pretty standard for a steakhouse with the dark rich textures abundant all over the restaurant.

What was the best experience was our waitress.  During her outlining of the various cuts, she correlated which part of the body they came from by pointing them out on herself.  We all thought that was hilarious.

Although food is pricey, in general steakhouses are pricey and by no means is Ric's more expensive than any other place you'd go to expecting a good steak dinner.

Overall I had a great tasting steak cooked perfectly to my request, impeccable (and humourous) service all in a comfortable environment."}
{"text":"What a difference a few months make. Service was professional cold. Steaks were smaller and less juicy/tender. Bill is higher. This place gets a downgrade. Based on this I-can't-believe-it experience, Ric's is not recommended. There is better elsewhere in town."}
{"text":"Waiting 50 minutes for a crappy meal is unacceptable. Especially for a restaurant that caters to the office lunch crowd. I have been here 4 times and never had good service or good food."}
{"text":"I ate here.  I didn't know it existed but BAM it does.  Am I reviewing it? Yes.  Will I do it soon? Yes.

I'm hoping I kept it down and my streaking didn't get witnessed.  I wasn't streaking later.  Tricked you all hehehehe.  The waitress was great, the wine kicked the libido into overdrive and I am the only man in history that turned down sex to go home, watch TV and play video games.  

I win.  I went against the normal steak house and went pastaville.  Italian sausage penne? WEEEEEEEEEEEEEEEEEEE.  It has chorizo in it.  Oooooo....I think it moved.  

Overall, the food was great.  Pasta kicked ass.  Waitress was great.  Setup sucked.  When I'm in a booth talking to one of the millions of gorgeous women that worship me, I don't like being a small piece of wood away from another booth.  The prudes kept giving us looks until I let one go in their direction.  Don't mess with the Blake."}
{"text":"The food at Rics is expensive but for the cost there is great value.  All the entrees come with a salad or soup as a starter.  They also provide bread, to snack on till the starters arrive.   

It's a great place for a nice romantic date."}
{"text":"Ric's Grill is a wonderful place to enjoy a great meal with business colleagues or friends.  I like the seating with the booths and that it's fairly private for conversations.  The server was great and not overbearing, and knowledgeable about the food specials of the day.

The menu has a variety of seafood, steaks, and dishes to meet most palates.  I decided to get the crab cakes ($17) from the appetizer list and side Caesar salad with dressing on the side.  There were 3 crab cakes and they were good and not too greasy.  The salad was good but I was not a fan of the dressing as it was too thick and goopy.

There's also a holiday menu as well and we ordered the pumpkin tiramisu from it.  It was a large piece served with whipping cream and chocolate sauce.  It was yummy but if you like pumpkin flavour as it could be a little strong.

Lovely meal and atmosphere in this restaurant!"}
{"text":"The wine is good.. And the appetizers are good too.. The service is definitely something to improve... I liked it, but I didn't love it... I would go back, if I don't have a better place to go.."}
