{"text":"The best Jerk Chicken I have had outside of the Caribbean.  The drinks were excellent but unfortunately the hostess and the service at the bar was horrible.  The service at the tables was great and that coupled with the amazing food changed my earlier opinions of this place.  Highly recommend the jerk chicken, Maui short rib and the old Cuban(the drink not some old Cuban guy)."}
{"text":"went there for my friend's bday dinner, we were 6, the place is not too big but we were able to get our space, it wasn't that busy for Saturday night, not sure it it was because of major construction on 17th ave SW. the food menu was not that long, they have a long list of rum. i got the banana daiquiri, I was expecting blended but it wasn't , it was good. we ordered plaintain chips, scallops, maui ribs, cheese empanadas, mac and cheese, chorizo/shrimp, jerk chicken, no leftovers but I think maui ribs and jerk chicken stood out."}
{"text":"Love Ricardo's!!! We are there on a weekly basis and are treated like family. The food is amazing with  something for everyone. Love the cheese empanadas, beef patties and jerk chicken to name a few. We always sit at the bar and service is great, with all the bartenders being chatty and attentive."}
{"text":"We finally made it to Ricardo's! My boyfriend and I arrived just before the evening rush although the patio was already full. We didn't mind sitting inside since the interior was pretty nice. We ordered jerk chicken, cheese empanadas and roti to munch on. First round of drinks was mojito for me and dark and stormy for him. The drinks were pretty good as we hoped for since it is a rum bar after all. I had the Tiki bomb as my second drink which I did not like on the first sip but it kinda grew on you after a while.   On to the food review: the cheese empanadas were very good. Hard shell on the outside and gooey cheese inside. The sweet vinegar dipping sauce also helped balance the saltiness of the empanadas. I was pretty excited about the jerk chicken but it turned out to be just ok. We were a bit disappointed since it was on the sweet side and had to ask for the hot sauce (which was the bomb) to make it taste better. The chicken though was very moist and juicy. I think they forgot our roti order so I had to follow it up. Not sure if it was hurriedly made or it was supposed to cook that way but the roti was fried instead of grilled. It was very oily so the accompanying butter was useless to put on it.   Service was good at first before the rush but I feel as if they could be better organized with who should serve which area of the restaurant. Our server was everywhere and had to wait for a little while when it was time to pay. I have no problem with waiting but if we had paid faster then they would have a faster seating turnover.  Overall, it was a good experience and we would definitely come back and try more cocktails."}
{"text":"Great decor and vibe! Finally something different for Calgary! The pineapple chandelier at the entrance is fabulous. The drinks were tasty and reasonable. We had a few bar snacks and they were all great. Service was good too! We will be back. Thank you for not opening yet another tv sports bar with waitresses in black dresses. Calgary needed you, Ricardo's."}
{"text":"With what seems like a never ending winter in Calgary, getting to enjoy some rummy cocktails in a lively atmosphere *almost* makes you feel like you're on a tropical getaway.  Whether you're a pina colada, daiquiri or a tiki drink lover, you'll find those and so much more at Ricardo's.  HH on Thursdays and Fridays from 5-8pm ($8 for pinas or daiquiris and $2 bar snacks) gives you the perfect excuse to find this hideaway!"}
{"text":"Nice vibe with seriously idiotic workers! From the dumb ass waitress to the moron of a manger, I don't think I'll be going there again  The waitress was inexperienced & the manager should not even be a manager. He needs to go back & be a waiter"}
{"text":"Located off the ubiquitous 17th Ave restaurant/bar row, Ricardo's has the best rum selection I have ever experienced.  Wow! I flipped out being a rum lover.  I started with a rum flight for $25.00, discounted to $11.00 because I have a nice smile. Four glasses with two ounce shots of premium rum were placed in front of me, and I knew the evening was going to be one hell of an adventure.   The entire staff at Ricardo's was accommodating and friendly.  Calgary has some of the friendliest people I have ever met.  It is a surprisingly hip and progressive city.  The cow town moniker is unfair and totally off. Ricardo's was a fun and wonderful time."}
{"text":"This little joint is tucked away and I almost missed it but am I ever glad I stepped in! Lovely little atmosphere for a relaxed hangout with some lovely cocktails! Staff are very friendly and accommodating and are always happy to recommend something new."}
{"text":"A new cocktail place? Count me in! Ricardo's is quickly becoming my new favourite Havana-style oasis in the city. The staff is lovely and accommodating, with just enough sass to keep you entertained all night.   Ricardo's indoor space is intimate, well composed and beautifully simple. This theme carries out onto the patio with comfortable seating and a tall privacy wall that closes off the patio on one side.   Overall, the food was great aside from the underripe avocados that accompanied my ceviche. The goat roti, key lime pie and vegetarian (vegan?) chicharron are absolutely to die for.   I'm so excited to watch this place grow and improve!"}
{"text":"Girl hold my earrings, I got a yelp to write!  Raining cold night in Calgary. But destination was trying Ricardo's.  We showed and put our name on a list to be texted when table was ready in 30-45 min.  We went next door for a lovely cocktail and were texted at 8:48pm. We cleared up our bill and walked back to Ricardo's into rain and waited through the people being processed at their door only to be told they gave our table up BC we didn't show at 9:05pm.  We waited at the door for 2 minutes and were 2 min after the 15 min they gave us. Terrible customer service. Sadly that was the 2nd chance we were giving them."}
{"text":"I considered not writing a review because I don't want Ricardo's to get any busier than it is. I dig the ambience - it's fun and casual but different from the usual rotation of bars, breweries and restaurants on 17th Ave.   My favourite drink is the pina colada. Damn - this took me back to when I was 20, except Ricardo's version was way better than the budget resort I stayed at in my youth. Creamy, boozy and easy sipping. Love the beer options too - Banded Peak plus a tropical IPA. I tried a delicious rum as well.  The jerk chicken here is amazing! I've only tried jerk chicken three times in my life, so I have no idea if this is a fusion or traditional rub/sauce. All I know is this is high quality chicken, moist with a crunchy skin and a wonderful heat to it. The rice and beans and grilled roti were perfect side dishes too. The jerk crab was fantastic, grilled and smoky with butter sauce. The cashews reminded me of Christmas.   Can't wait to return."}
{"text":"Awesome rum bar! Super fun setting. The patio is perfect. Sad that we don't have patio weather anymore but the vibe inside is still great! I have been twice (once on the patio and once at the bar). Service was great both times! First time, tried the jerk chicken, didn't find it spicy enough but they gave me habenero hot sauce so that made up for it! Tried a double (chickpea snack wrap situation), it was good but I don't need to have that again. Drinks here are great, I've tried a few but the Key Lime Crush with the frothy deliciousness on top was my highlight. Can't wait to go back!"}
{"text":"Nice patio and good drinks, but the service was terrible. The service was really slow, and they weren't serving any food. Then, without any warning, the host sat two other people at our table (which sat four cozily), just saying \"I brought you some friends.\" At no point were we warned this would happen. My friend and I were in the middle of a rather private conversation, so this was really not appreciated.  I don't mind sharing tables, but I want to be warned that it might happen so I know what I'm getting into. Reasonable?"}
{"text":"So, I only give this place a four mostly because of my allergy issues. They are very nut-friendly, which means their drinks and food have a high risk of cross contamination.  Yes, their drinks, too... Because my allergies are fairly severe to some nuts, I chose to stay safe and enjoy just rum, neat, which was delicious! :) i also chose not to eat anything. I appreciated the staff being oh so very honest about their nut-friendliness and I felt taken care of. However, I think it is important that they advertise this more clearly beyond being on their menus when I'm already there as I was the one to push to check this place out (perhaps on the website?). Imagine my disappointment!!! If I had known it was that unsafe, we would have gone somewhere else. That said, my husband and friend enjoyed the cheese empanadas, doubles, and jerk chicken.  They enjoyed it, but as a person of Trinidadian descent who knows real Caribbean food, I will say the jerk is not real jerk, but jerk inspired - purely based on smell and looks of course (trust me, real jerk chicken, you can smell the spice)... I'm told the drinks are amazing though!!Wonderful ambiance and friendly staff! But fellow nut-allergy sufferers, please do be careful with this place!!! It's not worth the hospital trip ;)"}
{"text":"Went here for an early dinner after about one year of talking about going!! So glad we did and will be regulars from here on out. The decor is awesome....like I want my house decorated by the same person type awesome, definitely makes u feel like your on vacation so we will be back in winter also lol! Our server was pleasant and attentive as well....onto the food......we got a bit of everything, the jerk crab cluster (one each as I love crab), the plantain chips, Maui ribs (which is actually 1 large short rib) and the rice and peas. Crab seasoning was awesome but EXTREMELY MESSY, fairly difficult to get meat out and were kind of thin but very flavourful....chips, rib meat and rice were awesome (although not spicy, still great). The rice isn't seasoned but it's ok cause everything else was. Oh and we had the piña coladas which kick u in the pants and are fabulous, well done!!!"}
{"text":"The concept of Ricardo's is great and the decor is definitely inspired and on trend.  I particularly loved the flamingo wallpaper in the bathroom. Unfortunately the service was beyond brutal.  We had four different people helping us albeit one was in training but still, four people!?  My party of four ordered drinks and some food and on a not so busy Wednesday night the food and drinks took forever.  I understand that nice artisan cocktails take time so that is understandable.  However I ordered a pineapple shrimp skewer and a cheese empanada. . One of the servers definitely forgot about my skewer so it came out after all my friends were finished eating, and the empanada was also forgotten and came out basically when we were ready to leave.  The bill also had an item we hadn't even ordered.  Service was scattered and forgetful and unfortunately on 17 Ave if you don't stand out or have impeccable service you are not surviving long.  While I enjoyed the flavours of the food and the tasty beverages I won't be returning when there are so many phenomenal restaurants in the area who CAN get a simple food order correct."}
