{"text":"Excellent food at a reasonable price.  Friendly staff.  We will definitely be going back over and over again.  Just wish they would be open in the evenings."}
{"text":"This place went downhill after new management / ownership took over a couple months ago, out of almost everything when I stop in late mornings on Saturdays.  No bacon or ham for sandwiches, bagels are old on display and they just throw them away and won't serve you.  Under staffed too...."}
{"text":"Came in at noon on a Sunday. All out of bagels, asked for a panini. Out of bread for paninis too. Cashier said they only sliced bread, because they close in 90 minutes."}
{"text":"Definitely a NY style bagel and a damn good one at that! Wow. I WILL be back. ... regularly."}
{"text":"Couldn't wait for this place to open, read the mixed reviews, had to try for myself . Went on a Sunday at 9am, out of everything bagels onion bagels and bialys, literally everything I wanted to get! Got a pre packaged black n white cookie which was good but was hoping for in store made. Ordered a bagel toasted with cream cheese, waited 16 minutes watched a person that was behind me get a egg sandwich bagel get their order 5 minutes before me , finally got my bagel which was cold and seemed Untoasted but I'm sure that was due to it sitting there for 5 minutes after it was slightly toasted. Bottom line is go to Dunkin donuts for exact same quality with better choices for half the price! Totally bummed"}
{"text":"First visit for lunch.  The Reuben sandwich was overpriced at $9 and honestly not that great, pretty skimpy.  Slow service with only 1 order in front of me.  Included a small cup of potato salad, but no drink.  Will get my next Reuben from McAllister's or Arby's or Bellacino's."}
{"text":"Quite a few people have complained about the service...which is definitely important, but in the end are the bagels worth waiting for is what it all boils down to. Unfortunately the answer is no...not really. The bagels are certainly fresh and good, but certainly not great like some of the reviews would lead one to believe. For example, they are certainly better than Dunkin Donuts - but not any better than you can get at Publix or HT bakery...and not nearly as good as can be had at the General Store in Belmont. In the end I would call these perfectly adequate bagels that are frankly priced slightly on the high side. That area could definitely use a good bagel sandwich shop, but but going with the expectation that you will have a \"true NY bagel\" experience will like just set you up for a letdown."}
{"text":"Came here on their grand opening.  I have never been much of a bagel person, but I could totally see myself coming here once a week.  Great service, great food, and great atmosphere!  You've gotta try it."}
{"text":"I was surprised with this place. The bagels are fresh , the cream cheese is very good and the coffee is pretty decent."}
{"text":"I was so excited to try this place as I love lox bagels and am always having to prepare my own. The first sign of trouble came when I pulled up to the drive-thru during normal hours with no unusual signs. I waited for someone to speak to me on the intercom for about two minutes, thinking they were probably just busy, when a staff member walked out of the restaurant to yell at me that the drive-thru was closed. At lunch time. Alright, so I went inside. Still craving a bagel. The service was sub-par, and they seemed more focused on personal conversations. All that is fine, they were closing in an hour and I was the only one waiting on my food.   The ultimate nail in the coffin was the bagel itself. It was not a New York bagel. It was difficult to bite into and had no tenderness. I really wish I could give this place a better review, but I just don't think it's going to work out between us..."}
{"text":"So happy to find a piece of home on my trip to NC. Stopped here and had the best Cuban sandwich. It's new and still it was running on all cylinders ! The owner seems like he's been in the business forever ! Can't wait to go back!"}
{"text":"Perhaps it's because I just came back from NYC where I ate a bagel every single day on the way to the beach. I think I need to forget what the real New York bagel taste like before I critique anybody else's bagel.  I walked in, looked at the bagels and stood directly opposite the guy behind the counter \"patiently\" waiting for him to stop talking to his co-worker about nothing to take my order.  Then we just stared at each other until I asked if he could help me.  Sigh.  Now to the bagels:  I spoke with the owner who said that the bagels were made and boiled in New York and then baked off at his location.  Perhaps it got lost in transition. My bagels were dense and had no give to them.  The bialys looked right but tasted wrong.  The \"everything\" part of the everything bagels were missing everything.  Sigh  This place is new so I will give them a chance to get their sea legs and will go back.  I want them to succeed because I love a hood NY bagel"}
{"text":"Now in its place is JAVA HOUSE CAFE. Totally different place. I will eat there soon and Yelp back."}
{"text":"From what I understand, this place is under new (very new, like 2 weeks ago) management. So maybe they're still getting their footing. This was our first visit, and it looked a little sparse in there: empty shelves, etc. That said, my best recommendation for this place is to get a bag of bagels to bring home, and then prepare the bagels yourself.   The bagels themselves are good. What they PUT on the bagels, however, is disappointing. Movie theater squirt \"butter\" is not OK for a bagel! Who does that? The eggs on the bagel sandwich were so oily we threw them away (this might be the movie theater popcorn butter again).  Also, be prepared to wait. The service was very slow, even though there were only a few customers there. I know there are a lot of fellow New Yorkers in the Charlotte area these days, so if you stop here, don't expect the speed you'd get from a bagel shop in NY.   The coffee was good, and they appear to have a lot of flavored coffee syrups available, if that's your thing."}
{"text":"Let me be concise: This place is not going to make it. Please, My Brother's Bagels, consider a Gastonia location. Please."}
{"text":"This place comes as close to authentic NY as you'll get in this area. The food is good and the people are extremely nice. I ordered a bacon, egg & cheese on an everything bagel but I'm pregnant, so asked the girl if the egg was cooked through. I'm not sure she knew what I meant, so I got a sandwich with egg not cooked through. However, they were so sweet and remade it quickly for me, apologized and told me they understood. Great customer service is hard to get around here, so I'd go back for that alone! The bagel was good and I'm excited to try some other options."}
{"text":"Went through the drive through this morning. Ordered an everything bagel with bacon egg and cheese. The sandwich was expensive but decent size with 2 eggs on it. The menu says add a 12 oz coffee to any sandwich for a dollar. I asked for it iced. No you can't do that. Why is it full price with ice being the only difference? That's weird to me... also please add syrups to your coffee drinks. How is the sugar supposed to dissolve in an iced drink?"}
