{"text":"Recommended by my husband's co-worker, and I am very happy with the suggestion!  My husband gets something different every time, but I always get the shrimp w/snow peas.  Love it!

Friendly service, clean restaurant, large portions -- and it's fun to watch the chefs prepare the food.  We will go back again and again."}
{"text":"Reasonable prices. Delicious food. Clean.

My girlfriend and I eat \"Rice n Noodle\" pretty often. Most of the time it's delivery. We usually get the Dinner special that includes egg rolls, rangoon, soup, rice and 2 entrées with a delivery fee of $2(i think) it all comes out to be about $26 or $27. Their generous portions take us 3 meals to finish. The math . . 
 $27 / 2 people =  $13.50 per person
$13.50 / 3meals = $4.50 per meal!!! Thats pretty decent if you ask me.
btw I'm a big boy. I can eat a good amount.

Lunch specials are awesome too. Delicious food, huge portions . $8

The service isn't too personable. They won't small talk with you while you wait for your food but they aren't rude by all means. 

Dining-in can be a little off putting at first because all their food is served in \"to-go\" containers. I've come to realize it's more practical as a consumer and economically as a restaurant manager. They give you so much food that your'e gonna take the rest home anyway and it saves them time and labor cost by not having to bus so much off the tables and the only things they have to wash are the pots pans and cookware the cooks use.

I love this place. If I every move away, I would consider Rice n Noodle one of the neighborhood institutions that I would miss and return to."}
{"text":"This place is the words Chinese food around South West las vegas  the portions are miserable and so grease  they  serve in paper plates  the two little Chinese midgets to attend and take orders Don t have any kind of education and respect for people to eat there is no manager no owner to place a complaint  so be careful everybody in the neighborhood"}
{"text":"I don't usually like to leave bad reviews but I witnessed something so disgusting that I had to share it. I watched in horror as one of the cooks, in plain sight, walked from the wok to the garbage and blew snot into the trash, then blew his nose several more times and turned right back around and back to start cooking again! I couldn't believe my eyes and I'm kicking myself now for not recording it so you could all see yourself. I mean damn man the sink is right next to the towel dispenser! SNHD should come and do and undercover visit and I'm sure they will not be happy. Such as shame  and a blessing at the same time as I used to come here every so often because the food WAS decent but more really for the convenience since it was right around the corner. However, after seeing that I will never visit this place again! GROSS!!"}
{"text":"Friendly, fast service. We walked in on a Saturday evening. I expected a long wait for a to-go order but that wasn't the case. The guy who helped us was patient and helpful. Food was piping hot and was fairly fast. Food quality was good. Would definitely come back and recommend."}
{"text":"Poor service, spent $30+ for carry out during dinner time and they won't give me plates or utensils. She explained that they only give disposable plates and utensils for dine in customers. Do they expect me to eat the food on the containers with my hands??? Other place would give you extra stuff if you spend more than $25. Never going back."}
{"text":"1) quick
2) good variety deals
3)reasonably priced 
4) orange chicken is great
5) lo mein rice is great 
6) orange beef was not cooked right"}
{"text":"The egg roles were actually spring rolls and the noodles I ordered were just lacking in flavor..."}
{"text":"Our household eats @ RAN often, often enough that I can say we have probably had everything on  the menu so far. We tend to favor shrimp dishes in which you get  about  10 LARGE shrimp. If you like things spicy  the curry chicken is great as well as the house chicken-general tso. My roommate is actually Chinese  & has only praise for the food, ,portion-size and reasonable pricing."}
{"text":"Great service, good price and excellent food recommend you go here especially if you live close to this location. I go at least, 3 times a week and have never been disappointed."}
{"text":"I asked them if I could sample the chicken and the lady said no. Walked over to next door and she didn't stop me so I thought they were confident about their own quality. So I ordered the rice noodles, bourbon chicken and pepper chicken. Only the pepper chicken was edible barely although hardly any chicken pieces. 

Noodles extremely dry and bland, bourbon chicken might have had spoiled meat. Learned my lesson. If a place like this doesn't allow sampling (as is standard for this type of Chinese place) run away!!"}
{"text":"Yummy!  Great prices, LOTS of food per order."}
{"text":"Such a nice surprise when we found out the each menu item we ordered came with a big box of rice!!
Portions size great for the price.  Service was good and the place was clean.

We ordered Walnut Shrimp which I expected to only have about 12 shrimps inside.  I was wrong. Fried and coated perfectly!
Salt and Pepper Shrimp again more than the expected 12 shrimps in the order.  Good seasoning and just the right amount of heat.
Mongolian Beef was average but good.
Corn Egg Flower Soup was perfect for my hangover!!
Crab Rangoons had too much cream cheese.  I would have liked more crab inside.
Mango and Honeydew Boba was refreshing but the boba seemed over cooked.

Overall I was glad I found this little gem.  And thank you for curing my hangover!!"}
{"text":"I can't get passed how dirty and cluttered this place looks once you go inside.. definitely won't be coming back."}
{"text":"One of my favorite Asian inspired places in the Valley!  Now I know that this is just fast food Asian but they do it so well!!!  They have the best fried rice that is not that mushy stuff you usually get from fast food Asian.  I highly recommend to try the lunch specials!  They have great portions (I'm a big guy (round not tall, haha)) and I had a problem trying to finish it.  The ingredients are always fresh and you can tell...  The atmosphere is chill and VERY clean, not like some places you walk into around the valley...  And did I mention it's down the street from me :) Just another reason why I wanna hug this place, haha"}
{"text":"Service is excellent.  The Mongolian Beef was very good, the shrimp fried rice is excellent and the noodles are great as well.  Excellent price for the lunch time specials, only $5.95 for healthy portions.  This is my new go to place for Chinese Food, I highly recommend."}
{"text":"Just ordered delivery from RnN for the first time ever, having saved a door flyer I got from them months ago. I didn't really realize they were considered \"fast food\". I was just starving & Chinese sounded good. They were fast to answer the phone & were professional & speedy in taking my order. But more importantly, I cannot believe how quickly they were at my door step with piping hot food!! Lightning speed. Also impressive, the delivery was well put together & they didn't miss a thing as far as napkins, sauces, side noodles, utensils & fortune cookies. (I've had deliveries where things are sloppy, thrown together from other restaurants). The food itself was delicious. A little too greasy for me, Nonetheless, definitely great - especially for the price. Now that I know about them, I'm sure I'll be ordering again soon."}
{"text":"First time here and pleasantly surprised, they have great service, good food and decent prices I think this is my new take out spot"}
{"text":"This place is by far the best Chinese take out place that I gave eaten in. I lived in NY and been to California several times and this place is just as good or better!! You get a lot if food for little money!! They are quick with their deliveries or pick up order as well!! Keep up the good job guys!!!"}
{"text":"Good and cheap for on the go Chinese food. Polite workers. Nice find. I got one entree meal combo (General Tso chicken w fried rice & hot sour soup) with soda for under $10."}
{"text":"Great food, reasonable prices, very clean and the owners and staff are very nice. Highly recommend. My top 3 are the eggrolls, pepper steak and paper wrapped chicken."}
{"text":"I've had delivery from here once. Food is good BUT the delivery driver was rude and they ended up charging me more than the price on their printed menu! When I asked the driver about it - he shrugged his soldiers and said \"I don't know\" Whatever, I wasn't going to waste my time so I just paid and took the food. 

About 20 min later, the same driver returns with a second order that I never ordered! He had been told back at the restaurant that we had ordered a second time and to have it delivered. Uhhhh I don't think so.

I will not be ordering from them again."}
{"text":"Delicious!!  We ordered delivery.. arrived super hot and on time.  Delicious spring rolls, crispy and yummy.  The sweet and sour sauce that came was for the sweet and sour chicken but was SUPER good on the spring rolls.  I wish they had included extra, but that was my only \"complaint\".  The sweet and sour chicken came separate from its sauce which made the dish crispy like it should be.  Nicely done. The Szechuan eggplant and tofu was cooked to perfection, the shrimp chow mein was fantastic, and the Mongolian beef was perfectly spicy and fabulous.  Well worth the money!!!  We will be back!"}
{"text":"My favorite Chinese place around.  Service is always excellent and so is the food."}
{"text":"GREAT SERVICE & FOOD! My kids are picky and they LOVE this place!!! Their Delivery service is FANTASTIC and our food always arrives quickly,  fresh & hot!!!"}
{"text":"I live in the SW part of town so we decided to give this place a try. Me and the family were very hungry so I ordered a family dinner meal. I called in the order as the lady on the phone said delivery would be 45 minutes. I was like ok I guess it is worth the rate and assuming it was a busy night. Within 5 minutes the delivery guy was at my doorbell with the food. I misunderstood the lady in the phone in which she must have said the food would be there between 4-5 mins instead of 45 mins. Not only was food delivery fast hot and fresh, it was delicious!  Awesome place!"}
{"text":"This ain't no Panda Express! Yes it's hard to find quality Chinese fast food outside of Chinatown that won't break the bank but I will say that I have truly been impressed by Rice N Noodle. I think their food taste much better than Baidu. I will admit their lunch specials are huge. A couple things that might be a big factor: no individual dinner specials, no brown rice and no tofu/vegetarian options on the lunch specials. Food is made to order so you can ask them for more or less sauce. I highly recommend the hot garlic beef or chicken and veggie chow mein."}
{"text":"Consistently good Chinese take out or delivery, not amazing or eventful by any means.

What does any connoisseur of take out Chinese/Vietnamese/Thai expect...tasty, simple, fast, and cost effective.  Bonus = I ask them to use as little soy sauce and oil as possible and they actually do it!!!

You cant go wrong with Rice n Noodle vs. the other available options if you live in 89113, 89139, 89141, or 89178.

Enough said."}
{"text":"I order from here because it's pretty good food for a decent price. I also live next door so it's super convenient. 

When I get my food, it's always hot and fresh. 

I get the feeling they know my order when I call! Not sure if I'm proud or not...haha!"}
{"text":"First time trying Rice N Noodles and perhaps would be the last. Customer service was good, the food taste too plain and the boba was too sweet.  The only reason I gave one star is because the customer service."}
{"text":"It's a very great and tasty place to eat at. All the food is fresh and the portions are huge! My favorite place for Chinese!"}
{"text":"Come here for their lunch specials! & they deliver  love it! I got the Hot Garlic Chicken lunch special with crab Ragoons & a Thai Tea! Nomnomnom I always come for takeout & I love how their Ragoons aren't greasy & they don't forget to give me sweet & sour sauce! The Thai tea is extremely good not too thick not too watery & just enough sweetness!"}
{"text":"First of all i don't get why people complaining about food & mostly the service on this awesome takeout, this make me think it is because this people maybe don't really appreciate the service. This is a \"Fast Food/Take Out\" place but they're much different than Panda Express and they have a fresh food made to order & great attitude servicing their customer, very attentive and they even pack the food for you when you're done. I've been customer for 7 years here in Rice N noodles and imho the service here rocks, they're not fine dining or anything but comparing to the fine dining service i've been to in strip has the same attentiveness minus the luxurious Diner ware. They remember your food order & drink most of the time, heck i just arrived and sit down..lol. Don't let the paper plates & plastic fork fool you. The reason i can tell why most of people that complaining about them not getting their service is because they never appreciate this awesome guys by giving them few bucks maybe and this guys probably think that you refused a service and if you do that of course they will leave you by since you asked for it. For me they always deserved my good tips nonetheless. Now the food, man.. i can tell you that almost everything in the menu is tasty & fresh, don't forgot to try Hongkong Noodle, Mongolian Beef, Honey Walnut Shrimp & General Tso Chicken. Hope this help guys (^_^)."}
{"text":"Best Chinese food in my neighborhood. Fast Friendly service, and they have some free appetizer if you spend a certain amount of money."}
{"text":"Wow this place is amazing I only had take out and delivery so far. The food is  hot and the quality is amazing. I ordered delivery the other night and the food came within 10-20 minutes and the food was pipping hot. The portion size is great too. They include a lot of veggies in the dishes. A lot of Chinese restaurant I've been too the quality is subpar. I will probably dine in sometime soon. Thank you guys so much (:"}
{"text":"Excellent food! Staff was so great, too. Stopped here for lunch during our day in west Las Vegas. The lunch portions are huge. We had everything from beef to chicken to pork and it was all great. Will definitely come back when we are out in LV, again!"}
{"text":"First time ordering from this place and we will definitely be going back, They were quick with our delivery and got everything correctly. The food was delicious and the vegetables were fresh. My children are picky eaters and they finished all of their food and came back for seconds. 

Their Thai iced tea is delicious and so happy they have boba!"}
{"text":"I've been looking for a good place to get Chinese food besides Chinatown so i stopped by this place since it was close to my house. The menu had a lot of the usual items you would see at a Chinese place. I decided to go with the lunch special since i just wanted a quick bite to eat. The place was empty and all of the workers were sitting down eating lunch. 

When my food was done the worker handed me my food... he didn't even say \"thank you\" or \"come again\" he just sat back down and continued eating his lunch. I wanted ask for extra sauce but he sat down before i could get a word out. When i got home i opened my bag of food and they forgot to put the soup that was supposed to be included with the lunch special and no fork or any utensils. The worker was so focused on getting back to his lunch, i didn't even want to bother. 

Usually when i experience bad service it doesn't bother me as much, as long as the food is good. But at least give me everything i paid for!! Unfortunately the food was alright but not good enough to come back.

Also, if i can make a suggestion: having ALL of your workers have lunch at the same time is a horrible idea. Might as well close down for an hour because the service was pretty much nonexistent."}
{"text":"My wife, kids and I were craving Chinese food and our go to spot for years has always been X.O on Blue Diamond. I read all the great reviews for this place and  figured let's try it out. 

Unfortunately we were dissapointed!! We ordered the salt and pepper pork chops and what we got were little inch size pieces of pork deep fried. What a joke!! Not only were the portions ridiculous but they tasted like crap. They were tough,rubbery and bland. 

You only get one shot at making 1st impressions and we will never go to this place again!! 

X.O on Blue Diamond will always be the right choice for us."}
{"text":"Food isn't bad but the service is awful. If you can get past the consent (4x's) order screw -ups go for it. I will never recommend this place."}
{"text":"We've ordered from here a few times for dinner at work, and they have not disappointed. The food is delicious, the service is fast, and the prices are decent. Their sweet and sour sauce is to die for!!!"}
{"text":"Best Chinese food, hands down. They have a fast delivery. Everyone is so nice 


No matter what side of town I live I still go to them."}
{"text":"My and Hubby's fav go to Chinese.  Everyone is always helpful, kind and delivery is fast and food is super hot!  Crab ragoons, wonton soup, house special chicken,!and salt and pepper shrimp are great!"}
{"text":"Their salt and pepper chicken wings and Thai teas are great, but their Hong Kong crispy noodles are mediocre. 

Proximity to my house and speedy service are big plusses."}
{"text":"Still my go to place for Chinese takeout or delivery...

Ordered some salt and pepper shrimp for a potluck at work, and it was a big hit. Everyone who tried it absolutely loved it and almost begged me to bring it again for the next potluck."}
{"text":"Great food. My boyfriend and I got the Family A dinner offer, which was more than enough food for 2 people. We got the hot and sour soup (we didn't like this though - just not our style), crab rangoon - awesome, egg rolls - great (although they were more like spring rolls), fried rice - delicious, sesame chicken - wonderful, and sweet and sour chicken - yummy! This will definitely be our go to place for chinese food!"}
{"text":"Love the crab Rangoon! Chicken pad Thai is ok. The Mongolian beef lunch special is a lot for a good price but the beef was too spicy and the chow main was kind of sucky. Although they do have fast service and are very friendly. I still go back though."}
{"text":"Place is legit. Food is always nice and hot when delivered didn't really appreciate the delivery guy smoking cigarettes in his car while pulling up to my door. Definitely not a good look lol"}
{"text":"Food is served up quickly.  Staff is friendly.  Most dishes are pretty tasty.  Love the chicken and broccoli.  Most times the won ton soup is on point but not my last visit.  Shrimp dishes are hit and miss.  Would give more stars but food tasted good only after I had a few drinks."}
{"text":"Decided to try lunch as it was close to my home.  Went in and was surprised to get both fried rice and chow mein, instead of having to choose one.  Also, went there for dinner, it was good.  My complaint was I ordered the large party trays for my sons b-day party.  I spent almost $200 and was not given anything extra such as crab puffs, egg rolls, etc.  NOTHING!!  When I ordered party trays from Jacky Chan, they gave me crab puffs, which are my favorites.  We haven't been to Rice n noodle, since and never will.  We aren't asking for hand-outs, but when we spend a couple hundred, include something extra, even a fortune cookie would have sufficed, but nothing gets you NO MORE OF OUR BUSINESS!!!!!!!!!!!!"}
{"text":"The best Chinese spot in town !!! My recommendations are (1) Salt and pepper chicken wings (2) Singapore noodle (3) Honey walnut chicken but other items are also great ! Shrimps are cleaned, fat and juicy. The delivery fee is 2.00 which is extremely reasonable. Go to their website before you order, many discounts are available (we got chicken wings for free)."}
{"text":"Hard to rate it.  Food was good but cold cuz delivery guy said he was not familiar with our area.  GPS says we r only 2.9 miles from store so am assuming delivery folks doesn't know about Google Maps or is just ......distracted? ... Understaffed?  It is a shame cuz food was tasty.  Will give them another shot to see if this is the norm or not"}
{"text":"This place is good. To be honest it is no different than any other Chinese Restaurant.  The place was clean and the service was pretty good."}
{"text":"Very good and inexpensive. Very tasty pork fried rice. The Mongolian Beef is a huge portion, although some of the beef was a little grisly. Be forwarned, it is HOT!!! I will definitely be back, great for a quick takeout meal."}
{"text":"Best lunch specials. Orange chicken here, smashes on panda express. Pretty much everything here does."}
{"text":"I was kind of excited about this place...but I'm pretty sure it must have been a China a Go Go, because everything was almost exactly the same.  I guess if you like fast food Chinese that is over fried and bland fried rice maybe, but I was thinking it was more of a locally run place with the type of food where they have good recipes & lots of flavorful items, well cooked...but its not.  However the crab rangoon was fine."}
{"text":"The food is terrible and I will never go back or have anything good to say about here.. Chow mein was dry, the garlic chicken drenched in sauce and to top off my dine in experience, I couldn't sub the soup even if I agreed to pay extra so I was stuck with warm egg drop -_-  no no no bueno"}
{"text":"Ordered take out from here through yelp's eat24 for the first time. First off I ordered spicy garlic chicken & sweet and sour chicken lunch special. The spicy garlic which i asked for 10/10 spice was perfect! Good balance between the chicken and veggies. The sweet and sour chicken though was pretty oily but it's Chinese takeout what do you expect. The fried rice and chow mein that came with the combo tasted super bland. Delivery was fast.....REALLY REALLY fast so that was a ++++ Even though he like knocked and rung my doorbell like 4 times back to back to back to back within a 30 second span. Will order again for sure to try other items and with hope the fried rice and chow mein taste better."}
{"text":"Flavor was great.  Next time will order sauce on the side as the meat and vegetables were mushy."}
{"text":"Wanted some Hot and Sour soup to combat my cold and saw this place was nearby and mostly got good reviews...

As soon as I stepped in I was immediately greeted by the lady at the counter and a middle-aged gentleman in glasses who was very cheerful and attentive. In fact, he had an energy and enthusiasm that made me EXCITED about the act of eating Chinese food, like when you first start going to these places as a child. I felt like a young Steve Simeone at The China Palace.

Store was clean and had a nice ambiance. Lucky cat, Chinese music and Christmas decorations in April which is both hilarious and charming. A pleasant and reassuring surprise is how the kitchen was in full view.

Since it was my first time, I just stuck with a simple order of the soup and some egg rolls. As the great Joey 'Coco' Diaz says \"If you screw up the pork fried rice, we got nothing to talk about.\"

In less than five minutes, the man who took my order was thrilled to present it to me.

Once I got the food home, I first tried the egg rolls (with sweet and sour sauce). You could tell they were very freshly made and had a nice texture. Not much else to say, since these were just skinny appetizer egg rolls, not the potentially epic New York style egg rolls.

The Hot and Sour soup was even better than I expected! From the first tastes I was worried it wasn't spicy enough, but then it quickly started kicking my ass! Taking me half an hour to finish, it was joy eating the abundant freshly cooked, still firm vegetables, tofu and occasional eggs, shrimp and imitation crab as I sweated and blew my nose. Finished with the crispy noodles and fortune cookie.

Very good first impression. Will likely be back before I get another cold."}
{"text":"We placed a pick up order and immediately upon walking in I knew the food would be yummy. There were people dining in and looking happy. The place was clean and didn't smell funky. 

We ordered the Family B Dinner Special w Sweet n Sour Chicken, Kung Pao Combination, War Wonton and fried rice. We also ordered the Pad Thai and Hunan Beef.  When I was setting everything up I was super super impressed at the fact that they packed the sauce for our sweet and sour chicken separately- because who wants soggy food? That right there lets me know Rice n Noodle is up on their customer service. I snuck a piece of the chicken and found it to be crispy- yet light and not greasy!  The Hunan beef was so yummy! Perfect combination of spicy sweet. Kung Pao combo was my fave! Veggies were fresh and the sauce was super tasty. Everything else was also yummy and I wasn't pouring soy sauce or anything else on it! Their cooks obviously know what they're doing.

Conclusion- glad we ventured out and found delicious not greasy and clean tasting Chinese take out!"}
{"text":"I keep coming back here.  The food has always been excellent quality.  The value for the lunch specials is second to none.  You can get a huge lunch portion for under $6 and it is really good.  It's actually enough food for an entire second meal.  Definitely try this if you haven't yet."}
{"text":"Flavors and portions were spot on but customer service is lacking. While the service leaves much to be desired it wouldn't prevent me from frequenting the restaurant."}
{"text":"Nothing special here. You might as well go to Panda Express or pick another type of food to eat."}
{"text":"What I like about this place are the HUGE portions of food. I ordered the curry chicken, which came on a full plate and the rice came on another plate. For $8.95, this was a deal! The serving is enough for two people, or for one person to have leftovers for later. I had a sit down meal, so I'm not sure if the to-go orders would have the same portion size.

I give Rice N Noodle 3/5 stars because it is a fast food Chinese restaurant and it is exactly that. Everything is fried in a pan, with quick service.

I ordered the curry chicken and it did not come out as I expected. The dish is marked with a chili pepper for its spiciness, seasoned with chopped up bell peppers and onions. The dish was more of a quick stir fried chicken curry instead of the saucy Asian curry I was expecting.

Located in a grocery store plaza, many come by for takeout. You can also sit and eat there as well, as it seats up to 30 people. I'd recommend this place only for a quick takeout order because of the portion size, but the flavor and taste are just average for Chinese food."}
{"text":"rice n noodle is like an extension of my kitchen. i get food here if i dont have time to cook. orders come out really fast. customer service is tops. my daughter loves their honey walnut prawns, its not like what we're used to coming from san francisco but its the closest!"}
{"text":"Your run of the mill Chinese restaurant. I've had several items here but nothing was really stellar. There's nothing on the menu that I've had that would make me remark \"that's the best I've ever had\".

At one point they had some of the best beef chow fun and it was at a decent price. However, the last couple of times I went here the beef chow fun was sub-par. They cover a lot of their food in either oil or some type of stir fry sauce. Everything seems to be bowled up and thrown into a wok.

The staff is nice so I'll give them points for that.

I can only compare them to other Chinese restaurants to give you some perspective. So far China a Go Go has the best Shrimp and Chicken pad thai and no one has beat them on that. Jacky Chan has the best bbq pork... Rice n Noodle is about neck to neck with Jacky Chan but their items taste very different. They are BETTER than Baidu Bistro and Buffet Asia in terms of quality of ingredients. Larger menu than Panda Express and more authentic.

So,....

Rice n Noodle vs. China a Go Go -- China A Go Go (winner)
Rice n Noodle vs. Jacky Chan -- TIE
Rice n Noodle vs. Panda Express -- Rice n Noodle (winner)
Rice n Noodle vs. Baidu Bistro -- Rice n Noodle (winner)
Rice n Noodle vs. Buffet Asia -- Rice n Noodle (winner)

Note: the number of people going here has increased dramatically due to the huge number of people moving to the southwest side of Las Vegas and it's summer 2017. There used to be a day when I'd come in here and I'd be the only one there or maybe one other personat any given time. The other day I went in there and every table was taken."}
{"text":"Went here with my mother and son to get dinner. Never had it before thought I'd give it a shot. First and my biggest damn issue noone I mean NOONE was wearing gloves. One man licked his fingers and put his hand in the food he was getting ready to hand out. I sure in the hell said something. WTF. I'm assuming the one other man that kept looking at me smiling and shaking his head was manager idk. But really WOW. I know this guy didn't touch my food cause I was watching. So I went home with the food. 60 dollars worth. I got orange chicken it was horable. I threw it out after the first bite. Idc that is wasn't good I took that chance to try it. But when. The man licked his fucking fingers and touch alot of other peoples food that I have an issue with. Big time. Never will I go here again and I advise noone else either. I don't use Yelp but sure the shit imma download it to say that about this place."}
{"text":"I have been there for lunch once and it was decent.  Decent price, decent portion.   So I decided to get dinner take out.   Hands down the worst food I've had since being in Vegas.   It was like it had been sitting around for a while or something.  It was gross.   The Orange Chicken is not orange...it was like frozen chicken nuggets in sweet n' sour sauce.  The breading was soggy.     The fried rice was good, I will give them that.   But the Mongolian Beef was inedible.  It had jalapenos in it...???  I actually tossed it down the garbage disposal; we couldn't eat it.   

I might as well have taken $30 and ripped it up and tossed it in the air.   I will just go to Panda next time for half the price you get fresher, better food.   

Sorry Rice & Noodle.... maybe you had an off night."}
{"text":"Love the peoples behind the counter, i came this restaurant since they open , the Singapore style noodle so good"}
{"text":"If your looking for some \"good\" Chinese food in the Southwest area, then I'd recommend Rice n Noodle. Good authentic chinese restaurants in Las Vegas is hard to come by; Panda Express is at times more appetizing to go to. But hey, it is what it is. Were not in Cali. 

My family and I's favorite dishes are: Hong Kong Style Crispy Noodle, Salt & Pepper Chicken Wings, FIsh Fillet with Black Bean Sauce, and Combo Fried rice. Sooooo delicious! Service is always fast whether you dine in or take out; we do take out since we live nearby. Price is reasonable anywhere from $8-$11 a dish."}
{"text":"I've eaten here once and I won't go back. The egg drop soup had no flavor and the consistency of motor oil. Corn Starch anyone??!!!
 There are plenty of rice and noodle places in town- don't give this one your money!"}
{"text":"\"LUNCH SPECIAL\" --- you should come and check it out, I highly recommend it!  ( Maybe it's not close to main area, kind of far but still easy to find out.... )

Actually by accidently I walk in cuz I just want the yogurt next door. BUT it looks like a nice place, clean environment, and you can see how they cook in front of you.... they don't hide their \"skills\".... however, I still don't know how to cook   :)  

There are 9 tables, delicious dishes pictures on the wall (plz take a look of my local pictures). Lunch special starts $5.75..... so much food, much better than P.E. and other fast food places! ---- btw, they provide 'fresh' cook! I mean they cook each dishes after you order it right away instead of cook alot at once and spoon it out, like other fast food...... u got what I mean? NO? it's ok... you go & check it out! hehehe~~~~"}
{"text":"It is unfortunate that my husband and I won't be ordering from there again, since we got excited when we discover another Chinese restaurant that is around our neighborhood. We ordered the spicy garlic chicken; curry beef; seafood hot and sour soup and garden vegetable with fried rice and the complimentary white rice for take-out one night and we both got sick the next day with diarrhea!!! The food was not fresh and super salty, which was so gross."}
{"text":"Entire family loves this place. incredible value great food !"}
{"text":"Wow this place has some delicious food, only problem is they have a piss poor dine in area. I want to go to the dollar store or daiso and buy these guys some decent plates to have a better dine in experience. These guys should be getting a 3 or 4 star from me but my family had every intention to eat out and have a \"dining in\" experience. I should have read the fine print and realized that this place is take out and take out only. Huge suggestion....call and place ur order only. Do not dine in there or you will eat on styrofoam plates, food served in styrofoam plates as well. We will not be returning"}
{"text":"I got their lunch special and came out to be a little over $6 for an one item combo. Tell you the truth it wasn't worth it. I ordered 4 combos anc asked for some hot sauce abd they only gave me one hot suace. Can you say stingy? I won't be coming back for more. I guess back to Panda Express."}
{"text":"My wife and I love this place. it is great food at reasonable prices. I recommend this place highly."}
{"text":"I've been ordering food at this place for several years now and they've always delivered quality food. The price of the ranges around $7 to $15 which is nice abs affordable. I love this eggplant and chow mein dishes. This is definitely a good place to go to if you looking for some fast Chinese food."}
{"text":"Out of town... Came here from google that had a 4.4 star at the time. Overall great, food good, water got to the bottom, great service and great food. I wasn't excepting much ... Good price and good food."}
{"text":"We ordered for delivery. The service was quick. 
The food sadly was not good.
The sesame beef was OK. On the sweet side. The beef chow mien was just not edible. It had a very odd taste to it. The egg rolls had the taste of oil gone bad. My husband ordered some shrimp dish and the look of it was scary. It was a brown box of mush. 
Never again."}
{"text":"Coming from San Francisco where Chinese restaurants come a dime a dozen, their food is the closest I can get to the d home town.  Fast , good and  plenty. I can always order an old favorite dish they might not have on the menu and they'll know whay it is! I'm so glad they are here in the southwest close to my house so I don't have to hunt for good Chinese food!"}
{"text":"Great food, super fast, friendly servers. One of the things we order isn't even on the menu but they remember & make it special evey time."}
{"text":"This food was surprisingly great. The price is really good from where I'm normally used to going for Chinese. Portions were very large I'll definitely be back."}
{"text":"Come here usually after my orthodontist appointments to enjoy a nice combo lunch special . Mongolian beef is a go crab wontons r a go . Decently priced as well clean establishment would indulge when in area"}
{"text":"I asked my fiance to get me some chinese food, for some late night studying night I was going to have. And I knew there was one right next to Patty's closet (since I shop there all the time). 

I would have to say that it was a bit pricey for chinese take out. The food was honestly good. I ordered crispy noodles with seafood. Basically, it was like pan fried seafood chow mein. But the noodles and seafood were in separate containers. I am assuming that this has to do with keeping the noodles crispy till the seafood is poured in. We also got garlic beef and honey shrimp. 

All in all, it was a good place to just get quick chinese take food on the spot. The establishment is actually very pristine, but I think it has alot to do with it not feeling like an authentic chinese food place. 

I will have to see my next visit, since this was only my first time."}
{"text":"Hands down the worst chinese food I've had in years. I ordered the chicken chop suey, the combination fried rice, and the fried wontons. The chicken for both the entree and the rice was undercooked and chewy, and the wontons were extremely greasy and mushy. The worst part is how expensive it was! I will not be returning to this place."}
{"text":"This is my fave to go Chinese Restaurant it's very convenient and the prices are not that bad either. Close to our house and everything else. Employees are also friendly never had an issue with this place and my order is always on time.. yeah!! So if your in this area and craving for little Chinese food this is the place."}
{"text":"This place is right down the street from my house but I never thought to give it a try until one day I was at tanning 2 doors down around lunch time and the amazing smell drew me in. Their food is good - not the best ever but consistently good. The lunch specials are a great deal. The portions are huge for the price and they are fast and friendly. Way more food for a lower price thank the big chains."}
{"text":"This place is not bad.  Even my picky five year old loved it.  The lunch special is awesome! $5.95 for lunch special and the portions are huge.  The food was cooked to order and the food arrived piping hot which is great! I got the filet fish with black bean sauce with green peppers and scallions and black beans.  The fish tasted fresh and tender. My son had the orange chicken with chow mein and fried rice and he loved it.  We couldn't finish it though cus like I said..the portions for us was plenty!"}
{"text":"The best cream cheese wontons I've had in years! The lunch special is a pretty good deal...entree, rice, noodles, and soup. I love a good chinese place that delivers!"}
{"text":"This place is amazing. That's all that is really needed to be said. 

I usually get the salt and pepper squid or shrimp! The only fast Chinese joint I will go to or have truly enjoyed. Enough to write a Yelp review :]"}
{"text":"Best Chinese Food To Go.. Ever ! I have tried many Chinese take out around the Rainbow and Robindale area and this place is Da Best In the SW.  They are very fast, I swear, 2 items or 7 items, they will tell you 10 to 15 minutes.  If the kitchen were not in the open then I would say they are nuking their premade food but they are cooking it for sure.  The beef chow fuun is awesome and the hot and sour soup is the bomb.  I have never had a bad order from there.  Keep up the good work Mr Rice & Ms Noodle.  You Rock"}
{"text":"We were looking for good Chinese food on vacation and came across Rice n Noodle on Yelp. We had the Potstickers, Chicken Chow Fun and the Orange Chicken lunch special. Overall the food was good. Good flavor, good quality and nice size portions. Service staff was very friendly and helpful! Restaurant was very clean and cozy. If your looking for high quality Chinese cuisine, go elsewhere. But I found Rice n Noodle to be a great option for a quick, tasty meal on any given day or night."}
{"text":"Not a fan!  Greasy, cheap (not in a good way) Chinese food.  Came here for lunch with a few co-workers.  Ordered a lunch combo came with egg drop soup and crunch things (which we had to share).  For the combo, I had mongolian beef, which came with fried rice and noodles (hence the name).  I ate it because I was hungry, but it was completely unsatisfying.  It was a waste of calories!

The food overall just had a generic taste.  Not worth coming back to.  I'd rather go to Panda Express for greasy, Americanized Chinese food next time."}
{"text":"work lunch. Food was decent enough but waiter arguing w/ one of the people at our table was a complete turn off. Probably won't return - don't want to be argued w/ over my lunch."}
{"text":"This place need to be shut down permanently.  The company sign should be shipped back to China.  The name should be permanently abolished from the business license.  Here are the reason why:
1.  Reuse returned food item.  Customer's return food items were stored top shelf behind cook and reuse on another to go order.
2.  Left over rice was placed back into the rice warmer for another order. 
3.  Customer did not like their soup, they took it back and dump back to the soup warmer.  
4.  Everybody is in on it from cashier to cook.  

IF you really like their food:
1.  Watch the cook prepare your food in person.
2.  Never order deliver.
3.  Go over there during busy hours.  If there are less than 3 people order, dont order. 
4.  Dont read this review after ordering food there."}
{"text":"A solid Chinese restaurant...I grew up on Chinese food and love it, so this works. My fiance does not enjoy Chinese, but their lettuce wraps is something she really likes, so it works for us. Not amazing by any stretch, but definitely quite good! Delivery sometimes takes a long time, but the order has always been correct."}
{"text":"Great, fast service! Fire time ordered from them everything was great!! Showed up in 20 minutes hot and you can tell it was made today! Not reheated from a Week ago! Will def be ordering again"}
{"text":"The restaurant itself is very small and unassuming but don't let that deter you from trying some of the best Chinese food in this part of town. Their lunch specials are reasonably priced and their titular noodles are absolutely to die for. Their orange chicken is great and their fried tofu is flavorful compared to most tofu offerings at other places. Definitely give it a try if you're in the area."}
{"text":"Food is great! Ordered for pick-up. They said it would be ready in 10 mins. I got there in 9 mins, and it was already sitting on the counter ready for me. =)"}
{"text":"Lunch special was great, fried rice is quite authentic (I'm from hk so I know lol). HUGE portion for 6.55 and great taste, very good value. Will definitely return and recommend for quick lunch with good price."}
{"text":"Love the rice and noodle. It's our go to place for neighborhood Chinese. Take out at dinner or awesome lunch special. So much good hot food! The staff is friendly and helpful and the guys in the back are cooking up a storm. We have our favorites here Kung Pao, Cashew Chicken, Mongolian Beef, Egg Rolls & Hot n Sour Soup. Order some on your way home from work. Easy Dinner!"}
{"text":"Travel far for the lunch special L3 !! The fried rice melts in your mouth. The Mongolia is just the perfect price."}
{"text":"I had the lunch special, general chicken. It's as good as any other American-Chinese restaurant I had in the U.S. I know this kind of food is greasy, but when I came home and saw the puddle of red, oily substance collecting at the bottom of the rice I decided I had enough. Food was flavorful but never again, they should make you sign a release form for food this greasy."}
{"text":"Food was good. Takeout took an hr to get here but it was hot and fresh. Would order again."}
{"text":"Stopped by for lunch. I would say its on the top for fast inexpensive chinese food. Taste was great and service fast."}
{"text":"The best in Las Vegas. Customer service is amazing too. They are always friendly and have a smile. 
Would highly recommend Rice n Noodle!!!!!!
AMAZING PLACE!!!!!"}
{"text":"The appetizers were good, but the food was just blah. I really wanted to like this place cause the reviews were great, but our dishes were not the greatest."}
{"text":"I really enjoy eating here for a price friendly yet still tasty and appetizing quick fix for Chinese food. The food is well seasoned. Surprisingly haven't had anything too salty. And their service here is spot on. They are attentive and super friendly. And this place isn't really a \"Chinatown sit down restaurant\" it's a delivery lunch special plaza Chinese joint but they serve you as if you're eating in Chinatown. If anything their service here is better than your typical Chinese dining restaurants. Everything is well priced and the beef chow fun is particularly my favorite. Keep up the good work Rice n Noodle. Hands down my favorite quicky Chinese joint"}
{"text":"We've been going here for years and we have always been happy!  We think they are nice and SUPER fast.  It's just easy to call in and pick up for a quick, and easy lunch or dinner!!"}
{"text":"Love the spicy garlic chicken, and orange chicken. The hot and sour soup is decent. I would recommend them changing the pot stickers back to the old version that were twice the size and contained chicken. Those were great!"}
{"text":"Highly recommended !! They are always fresh,fast and friendly. Our favorite dishes are the combination fried rice, orange chicken the best in town and the won ton soup is bomb!"}
{"text":"everything we ordered was so good! and i called to place an order and it was so speedy for pick up on a saturday night..only 10 minutes!!!"}
{"text":"Great as always! Very good and fresh ingredients food always is consistent in flavor and friendly staff! Love this place"}
{"text":"YUM! I rolled in here after reading some great reviews and getting tired of the same few Chinese places close to my house. 

I like the open kitchen, where you can watch the chefs and cooks whip up your food as soon as you order it. Ordering take-out took just a few minutes and the staff was very attentive. 

The menu here is great--everything you'd expect to be there is available. I got the fried tofu with vegetables, which comes in a dark sauce! Most places I've tried make it with a white sauce, so this was a delicious surprise. There is a small vegetarian/\"healthy\" menu with about five options. I like when there's a separate section for veggie stuff because I'm lazy.

Dinner for four came out to $32--not bad!"}
{"text":"Disappointed! Been getting take out from here for abt 2 months...they are not consistent. Sometimes the food is good and sometimes it tastes like a 10 year old made it. Don't know what is going on with the staff. Same thing with delivery. Sometimes they have eveything and sometimes they are missing items. Not worth the trouble. Rather order from somewhere else and spend my money elsewhere."}
{"text":"I love this gem! I've dined in and ordered food to go and always enjoy it. The lunch special is great and has a ton of options. I love that I can order through yelp and just pick up. The staff is super friendly and the food is great. It's Americanized Chinese food but still flavorful!"}
{"text":"I've had Rice & Noodle bookmarked for a while and finally tried it out the other night. I ordered the family meal A for the family with the sesame chicken, orange chicken, pork fried rice and added the pork chow mein. I placed the order online and pickup it up for shorter wait time. 

It is located in the north end of the Smith's shopping center on Rainbow in the corner next to Serenade. The store is very clean and is very open with lots of seating. It is not stuffy inside either, like lots of fast food Chinese places are. 

Everything we ordered was delicious and very fresh. Nothing felt heavy and it didn't make you feel sluggish after eating it. The fried rice is amazing, very light and fluffy, not smooshed down or mushy. I will be getting extra fried rice next time because it was gone so fast. 

This is going to be our new go to Chinese."}
{"text":"Lunch specials are great and the price is cheap. The food here is awesome, I often buy it for my whole family and my friends often come here after work and they enjoy the smoothies and boba as well. I would recommend this place highly."}
{"text":"This place has some of the best chinese food in the valley. Their hot garlic chicken is one of the best item I've eaten from a chinese restaurant in a while. Really good quality food, affordable prices, and no msg. Check this place out!! It is really good!!!"}
{"text":"Ok so since I've been on a \"Chinese Fast Food\" yelping kick today I will end with the one I think is worthy. If you are in the SW area and is craving delicious, fast, and fairly priced Chinese food, then Rice and Noodle fast food on Rainbow and Windmill in the Smiths shopping center is the place to go. 

Here are the places to avoid (Trust me I've tried all the Chinese fast food places in this area and I've done my research) 
For those of you who are near the
Sunset and Fort Apache don't go to Chung Fai it sucks!
If you are near Blue Diamond and Durango Jacky Chan is ok, but not too much better then Chung Fai.
If you are near Blue Diamond and Buffalo area and is anywhere by XO Chinese food drive pass it and drive fast!
If you are in the Southern Highland area China A Go Go is pretty go just don't be offended if the counter service is far from friendly. I don't remember how the service is at their Durango and Warm Springs location was but the food is the same.

So just skip all those places if you can and save yourself from a bad night of unsatisfying dinner and go straight to Rice and Noodles because there I am never disappointed. 

Everyone has their own favorite and they are mine. Pork chow fun is amazing, Mongolia beef is done right with the crispy white thin noodles on the bottom, Kung Pow chicken is perfectly spicy and flavorful with the right amount of \"cooked\" peanuts (I hate when some places just throw nasty raw unsalted peanut on top) and their apps are all so good. Everything else on their menu is so good. So please try it for yourself and you will see that I didn't not go through all those trial and errors for nothing and just to lie to you. Why would I?"}
{"text":"quick.. and fresh.

the place is welcoming..
bright and clean! kitchen is kept clean as well.. 
waitresses are very friendly and attentive..

the prices are off the hook and they hook it up with the portions.
we had the family combo which was only 29 bucks or something.. 
came with two choice entrees.. 
we had orange chicken & peppered steak
also included: appetizers & won ton soup

was totally enough for 4.. and some. 
had it the next day for lunch.. 
and it was just as awesome as the night before..

we're definitely going to switch up our delivery choice.

double plus: 
1. they sell boba
2. tutti bella is right next door!"}
{"text":"Food was delicious and the customer service was excellent. We found our new Chinese food spot for awhile."}
{"text":"This is my go to for quick and yummy Chinese food!  They have my phone # saved and always know what I want.  They have awesome lunch specials and also family dinner meals that you can customize.  Everyone working here is so nice and friendly.  They also Always have coupons for free items if you spend over a certain amount.  I have never had anything bad here.  Thank you rice and noodle for being the best Chinese restaurant in the southwest."}
{"text":"Boba tea is good. Restaurant is clean. Service is attentive. It was made fresh/fast. But the phad Thai I ordered was terribly sweet. Tasted like a spoon of sugar at every bit. I know it is supposed to be sweet but not like that. The worse I had so far. the portion and ingredients tasted fresh..."}
{"text":"Found my new go-to spot for chinese takeout! Service was fast & friendly; restaurant was clean. Food is decently priced. Other than the veggie fried rice, which was somewhat bland, everything I ordered was flavorful & had just the right amount of spice. No oil/grease flavor at all! Definitely will be back!"}
{"text":"I read the reviews and decided on the orange chicken and the mongolian beef. Both lunch specials. The taste of the orange chicken and mongolian beef was really good. On the bad side there were more onions and peppers than beef. Also the rice was way under cooked which was very surprising. I hate wasting food buy the rice was not editable."}
{"text":"Quick, tasty, and fresh. Nice, friendly employees. 

I just got a 1 item combo to go. The veggies were very fresh and al dente, just the way I like them.

The nice thing was that the food looked as if it wasn't sitting around all day, which is how I usually see these Asian airport places.

I'd eat here again. Not bad prices, either.

Enjoy!"}
{"text":"Limited but good vegetarian options.  I had the tofu and eggplant. It was sweet and spicy really good.  They do delivery up to 4 miles which is always nice"}
{"text":"Always amazing food, and swift friendly service. I like that the kitchen is in open view. Inspires confidence in what is happening to my food."}
{"text":"This is definitely my go to spot for Chinese. Awesome service, tasty food, and great portions. I've been going here for over 9 years and they are consistent. I hate going for Chinese and no mater what you order the dishes all taste the same. Rice N Noodle is not one of those places. Oh and try the Honey Walnut Shrimp!!"}
{"text":"Super average (basic) Chinese food joint. We just wanted some takeout and it happened to be nearby. I'm not sure why it's so highly rated. The interior was a little on the dirty side for me (it was 8p on a Sunday, so it's not like it was about to close). Definitely not a place I'd like to sit and eat. 

We ordered the Happy Family and an order of egg rolls. The beef was a little greasy, but other than that, it was fine. I appreciated the side of sweet and sour sauce, but only one packet of soy sauce? C'mon..

There are definitely better Chinese takeout restaurants around. If you're nearby and eat here, it's fine, but if you can possibly  drive another mile, I'd pass."}
{"text":"GREAT place to eat delicious food for the cheaps."}
{"text":"Best Chinese food I ha e found in Vegas. And their speedy delivery is worth another star"}
{"text":"We decided to dine in front of the TV and order in...what to eat? My wife went to yelp and type in delivery...So we decided to try this place 
Great reviews and they were right!...we ordered hot n sour soup, combo fried rice, salt n pepper pork chops and the best was the combo pan fried noodles"}
{"text":"I am only a couple block away from this small place.  Usually order lunch, price is very reasonable and the portion is huge.  Kung pao chicken and Singapore noodle  is my favorite and it taste great.  The staff is nice.  Would definitely go back again and again."}
{"text":"This location is not in Chinatown and I love it! Sometimes I crave for authentic Chinese food and driving out to Chinatown can be a hot mess: no parking, etc.. etc. Lol! This place is affordable and my boyfriend and I go there for lunch!"}
{"text":"I like the chicken pad tai the best but the chicken this time was mixed. Some was the thin, shaved type, and the rest was chopped like from chicken teriyaki. I don't care for the inconsistency. The flavor overall was good. We have wontons, Mongolian beef, and pork fried rice. Overall the food is good, whether you eat in or take out. The staff at the counter is always helpful, though some of the cooks behind them will stare at you like they are angry you're there. Adds to the character of the place."}
{"text":"You know what? 
   I'm going to rate this fast paced restaurant, 5 stars. They are friendly, the food is excellent for the price (especially lunch) & the amount of food is great! Really can't beat those qualities of a restaurant. Oh the delivery is always 45min to an hour but they usually arrive within 30, pleasant surprise :)
   I like to order the orange chicken and broccoli and beef for lunch specials and they give 2 free ragoons or 2 free egg rolls after u spend $10 or more. They have dinner specials as well, we order what ever entrees were in the mood for plus an order of the Hong Kong Noodles, MY FAVORITE! I believe after a $35 purchase you get free chicken wings, they have other free items you can see on their website. 
   If you decide to dine in they treat you to an egg drop soup with won ton chips while you wait for your appetizer and/or entree. Their just hands down one of my favorite casual dine in and take out joints here in Las Vegas."}
{"text":"We found this place by accident. After trying to order Soul food and being treated rudely, we drove around and found this place. Customer's were picking up their orders and it's not your typical Chinese Food place, they cook your food when you order. We grabbed a menu and took our food home. All i can say is wow! Food was hot and tasted great! Especially after the ordeal we had just went through we will definately be back!"}
{"text":"Love this place good portions the soups are the best in town and very reasonable prices definitely my favorite strip mall Chinese restaurant and the staff is always very friendly and helpful and it's a very clean restaurant"}
{"text":"I highly recommend Rice N Noodle for Asian cuisine. They are reasonably priced, have excellent customer service, and efficiently filled my order. For a busy Friday evening, the restaurant had minimum wait time. The dishes are excellent and I look forward to ordering from them again."}
{"text":"Pretty much the only local spot if you're in the mood for oriental food in my mind. I've been coming here for years and only now got around to reviewing this spot. I have experienced several different dishes and can honestly say that I have not had anything I didn't like.   The staff are very friendly and welcoming.  Food comes to you fast and delicious. Definitely give them a try!"}
{"text":"do not go here! i was a fan for this place before last night...ordered bbq pork and now have food poisoning.  seemed like a great place before this happened. will never go back"}
{"text":"I went to rice and noodle and saw they did not open to 11 Am and since it was 20 minutes until open so I started to walk away when an employee rushed out and said I could come in and order. My service was great, my food was amazing and I will definitely go back."}
{"text":"Ordered take-out two nights ago and the food was pretty good. It didn't give you that heavy, bloated feeling you usually get after eating Chinese fast food. I called around 9:25 PM to place the order for take-out and asked what time they close. The lady who answered told me they close in 20 min. so I asked if it was still okay to place an order. She said it was fine so I went ahead and ordered.

I usually get the family special at any Chinese place, and decided to get the Family deal #2 with the Wonton soup, 4 egg rolls, 2 shrimp tempura, Kung Pao combination, Shrimp Chow mein, and the combination fried rice. Also, added two Thai teas. Everything was fresh and tasty, not so heavy, and was enough to feed 4, and came out to under $40.

My only gripe is really about their service. At 9:50 a lady called me to tell me that they were about to close. I told her that we were just about 5 min. away and when we arrived (at 9:52) the two bothered ladies kept staring at us then the owner or manager passive aggressively asked if I had just gotten out of work. I said that I had not, then looked over at the door to check their hours. They close at 10, and we were only there to pick up. By the time I had placed the order it was around 9:30 and she said it would take 15-20 min. which would have put us at 9:45-9:50. It wasn't necessary to call, rush us and then again make her passive aggressive comment to make us feel bad when we were there before they closed. We still left a standard tip even though we were just there for take out.

Overall, I'd give them a 4 star for the food and a 3  star because of poor customer service. The food was good and they didn't forget anything in our order. I'd order from here again, but my advice is to not order past 9:00 PM."}
{"text":"This is honestly the best Chinese food I have had from a take out place since living in Las Vegas. Compared to what I grew up with in the Northeast, the Chinese food here just doesn't compare. This place, though, was awesome. I haven't gone in, but I honestly don't think the lack of decorations or the styrofoam plates would have bothered me. The delivery for 8 people was extremely quick, the food was SO good, and the prices are less than the other Chinese restaurants in the area. The three kids couldn't get enough (and one of them didn't like Chinese food all the much before this meal). Everything we ordered was really good. We can't wait to order again!!"}
{"text":"My friends/co workers come here for the lunch specials.  You get complementary egg drop soup and won ton chips.  I've tried most of the lunch specials and have nothing bad to say on any of them. The portions are good and the food is pretty good for \"fast\" Chinese food. For example, the sweet and sour sauce is just right and not overpowering the other flavors.  One of my favorite dishes are the Chinese chicken wings.  The prices are reasonable and the soda and water is bottomless.  The wait staff/cashiers are nice and friendly.  The back room staff (cooks etc.) stare at us like a Kung Fu fight movie scene is about to break out when we walk in and they are eating their lunch.. Sorry for interrupting your lunch, but we're hungry too! You guys cook fast and cook good. So, don't be mad!  HA!.  I would recommend this restaurant if you are on the west side of town.!"}
{"text":"I ordered the sauteed veggie lunch special and requested it spicy,  it was delicious!  They give you tons of food and sides which were fried rice and noodles.  It  also came with a small soup and what looked like fried rice crackers.  It was all tasty n hit the spot all for a little ovrr 5 bucks!  Matthew ordered the Mongolian beef which he said he loved.   I think we found a favorite lunch place.  The service was great they were very attentive."}
{"text":"Stopped by for an order of Moo Goo Gai Pan to go for lunch this week.  Had been a year since my last order, which had been a delivery, and it was good: this trip it was awful.  No sauce or spice; the zucchini was tool old and undercooked, and the offering was generally wanting.  In addition, the price had seemed to have increased, while the portion decreased.  Definitely a disappointment and I will not go back, not willing to take that pricey gamble."}
{"text":"Fast, friendly service and wonderful food! The portion you get for the low prices are incredible! Our food came within three minutes of ordering. Highly recommend this place. Greattttt value!!!!"}
{"text":"In the Southwest part of town-the Chinese is not good....UNTIL NOW!
I love this place-the service, the piping hot fresh food-and I'm so glad to see they deliver to Mountain's Edge-cuz the others around here are not up to par."}
{"text":"This is the only Chinese food I'll order from in my neighborhood. There are three other Chinese restaurants that are closer but they are awful. I'm not sure how they are still in business. Chinatown is far for me so I usually end up here to satisfy my Chinese food craving.

Mabo tofu, honey walnut shrimp, Mongolian beef, wor wonton soup, & the salt and pepper squid are my favorites from this place. They give a huge portion. I can never finish in one sitting and they give plenty of rice. 

I like how the kitchen is out in the open so you can see them cook your food. Pick up is fast, usually ready in  5-10 minutes. No complaints about the service."}
{"text":"Love this place, especially for delivery in the evenings.  I do live about a mile away but several times I had my $20+ orders delivered and on my plate within 30 minutes.

The food tastes great as well.  I typically stick to shrimp entrees which have never disappointed as well as the Orange Chicken, all of the Chow Mein's, and even the Chicken Fried Rice. 

Great food, decent prices, and very quick delivery times.  A+ in my book."}
{"text":"Good Chinese food for Cheap Price. I went in with 2 other colleagues .
Service is good. 
Good Portions.
Quick Service.
Doesnt take American Express.
Probably i will go there once every two months, because there are so many restaurants in town which serve similar kind of chinese food for the same price. so nothing special hence giving 3 stars."}
{"text":"Just found my new Chinese restaurant in the neighborhood. I got the combo chow mein and hot garlic chicken. Both delicious!! Quick and good service. At reasonable prices. So happy it's in my neck of the woods! Highly recommend!"}
{"text":"I love this place because it's a good price and it is nice and fresh. I love their Crab Rangoon and their chicken chow mien. I always order here because it's so cheap and good."}
{"text":"Delivery is always very fast, also the chow mein they have is better then normal, I love it and so does my GF. Have not been disappointed yet."}
{"text":"Overall Rice n Noodle has been good until I tried today. I called at 3:45 pm, they told me it was too late for the lunch special that ends at 4pm. I was shocked at the arrogance in how he said it so I questioned him about it & he told me they can't be expected to give away food. WHAT!! I was even more shocked. If there gonna pull things like this, who knows what else they do. Food is ok but not as good as Baidu, or even China a Go Go. Honestly don't trust this place."}
{"text":"Came here for dinner with the hubby. Saw all the Yelp reviews and decided to try it out. 

My husband judged this place by the decor. He wasn't impressed with the way the place looked but when he took a bite of the food. He admitted he judged the book by its cover.  

The staff was friendly and attentive, we ate in instead of doing take out. There weren't any patrons eating in but they did have a handful of people picking up take out. They also deliver. 

We had shrimp fried rice, sweet & sour shrimp, & shrimp egg foo young."}
{"text":"Went by because I was working down the street.  Small place.  Clean and you can see into the kitchen.  I had the mangolian lunch special.  The egg flower soup was pretty plain.  The fried rice a bit on the dry side and chow mein was a little soft.the entre wasn't bad but it wasn't really mongolian beef.  The veggies were fresh, nice and crunchy.   The place is really about bang for the buck.  Big portions.  Considering the portions and price I would give it a 3.5 stars."}
{"text":"We order from here time and time again because of the great tasting food, menu options, and delivery time. They always say 45 minutes but are always faster than that when we order here! By far the best Chinese take out around this side of town!"}
{"text":"It's hard to find a Chinese take-out restaurant that I like... I don't know if it's because I'm expecting restaurant food or if it's because I'm just tired of eating Chinese food.

I've been to this place several times, for both take-out and dining it. The experience has always been splendid. On the way home from work, a 30 minute drive, I call in an order and pick it up in about 15 minutes. It was quite convenient.

PROS
Order the teriyaki chicken & salt and pepper pork
Cheap lunch specials w/ lots of food
Tasty boba, I like honeydew & taro
Delivery and pick-up

CONS
No privacy, there's always customers here
They aren't open 24 hours, I wish they were

Overall, I am super pleased w/ this place. I am definitely a loyal customer.

Note: They have coupons on their website. I have used them by just mentioning them via a phone order and never had to print 'em out."}
{"text":"There are a lot of these hole-in-the-wall Chinese \"longer-than-fast-food-but-not-quite-a-restaurant\" places all over Vegas- pretty much one in every grocery shopping center.  This one is a cut above most places because their food seems fresher than the other places and the prices are competitive too.  They have friendlier and faster service compared to some other places.  The menu is the same as you would find anywhere.  Although you could say its the best in its class, I'm giving it four stars because its still that generic fast-food-but-not-a-restaurant."}
{"text":"Theres nothing i don't like about this place. Their food is sooo good! Best of all they dont have a minimum for delivery! Their chow mein is my favorite! Actually everything is good"}
{"text":"Wow! It went from 5 stars to 1 in a matter of just a few months! We are so disappointed! We ordered the Mongolian beef, chicken fried rice, pot stickers, egg rolls and crab Rangoon. 

Let's start with the Mongolian beef... I never had so much grease leaking from a container sticking to my lips as if I just bought the shiniest lip gloss at Mac. I can't tell you about the flavor because all the grease covered it up if there was any. 

The chicken fried rice was so bland soy sauce didn't help not to mention the gummy chicken pieces. I pray it was chicken (yes that bad) 

Crab Rangoon has no color as if they fried it for 5 seconds. It wasn't even crispy. Soggy. 

Egg rolls were basic and the pot stickers were ok. 

Basically, the white rice had more flavor then all of the above."}
{"text":"I came to this place looking for a cheap, quick lunch special expecting more of a sit-down style restaurant. Little did I know that this was more of a hot-table place that served everything in to go boxes. Was I complaining? Not really since it just saved me from boxing everything to go anyway. I'm not that fancy, so I didn't mind the hot-table setting, but I could see how that would bother someone looking for a bit more... ambiance. 

The place almost felt like a mom 'n pop version of Panda Express, except that their food is actually made by people with love, as opposed to a cook following corporate recipes. Not to sound like a Chinese food snob--I actually don't mind Panda Express--but this place seemed like it could be a legit chinese restaurant, but just didn't want to invest in real plates and utensils. 

Anyway, I ordered the kung pao shrimp lunch special ($5.95) which came with some egg drop soup, and fried wonton skins with a sweet dipping sauce. Yum! It was way more food than I was expecting, and I could have easily split it with my perpetually hungry little brother and I would have been okay. The veggies were super fresh and super freshly stir-fried, and the chicken was delicious and just the right amount of spicy. I'm kind of curious as to what their dinners are like. 

I just realized during the writing of this review that Rice N Noodle must have mostly take-out and delivery orders. That would explain their hot-table style of restaurant, because this is some decent food to be had, especially for the location of the surrounding area. I certainly would consider ordering take out if I didn't want to drive all the way to Chinatown for some decent Chinese food. 

...

Ohhhhhhhhhhhhhhhhhhh..... Heh."}
{"text":"If you're looking for a fast cheap lunch this is the place. Lunch special is under $7 bucks and our food came out in minutes. Giant portions too. Of course, the food is greasy and heavy but you get what you pay for. Flavors were on point."}
{"text":"I can say that this is the best Chinese food I've had in Las Vegas so far. To this point, I've gotten the Sesame Chicken (it's perfect. Not too sweet), the Kung Pao, the teriyaki bowl, and the pad Thai. All of them have been on point. Their crab ragoons are perfect and the egg rolls are too. 
For the price, this spot is excellent. They've got specials on their website which I've taken advantage of. The free upgrade to fried rice is always useful. 
We order out from here often but they do also deliver which is nice when you're at home and don't want to to leave. They always 30 minutes but are at my door in about 15. Fantastic place with bang for the buck"}
{"text":"Was craving Chinese food so decided to try this place out. From looking at the menu it seemed like one of those typical Chinese restaurant places. Everything on their menu seems fairly priced compared to similar Chinese restaurants. 

I ordered the Orange Chicken Lunch Special. The orange chicken came with fried rice, chow mein, and a side of wonton soup. My favorite orange chicken is the one from Panda Express, but I'd say Rice n Noodle's orange chicken is second. The orange sauce isn't too sweet, tangy, or has a heavy texture.

The restaurant was clean and the service staff there was friendly. Went around 2pm on Saturday and it wasn't busy. 

Looking to try another lunch special next time I go."}
{"text":"My family will only go here when we want good Chinese food. It really is one of the best in town. Tucked away in a corner shopping center that has to compete with the likes of Filipino cuisine and fast food favorites, however, location is everything and they have been a staple in the southwest for years! Their recipes are the reason why! One tip to tell the owner. Don't charge your customers for paper plates!! Especially when I order almost $100 worth do your food! Why would you charge for 8 paper plates! It probably cost no more than 50 cents. Other than that- keep using your recipes.."}
{"text":"AMAZING!! Thai tea is my favorite, and I always come here to get it. My boyfriend and I always get to go and it's super quick, and delicious every time!"}
{"text":"Glad Rice N Noodle opened in SW area.
You can order or just enjoy your meal there. Room is nice, clean and spacious. You can view them cook while waiting. They are very nice!
Your meal is freshly cook as you order it. We love the Chicken Khamphao, the kids the lemon chicken, the dragon Rangoon, the chow mein noodles, egg drop soup. They also can deliver it to you.
Its like a home made food! I enjoy looking at the cook prepare your food! Wish i knew how to cook like them!
It happens we order our lunch there or some nights when I don't feel like cooking, I just call and pick up my order :-)
Price is decent and food is delicious!"}
{"text":"I know most of the reviews seem to be about lunch specials for the \"American-Chinese\" restaurants, but you have to stop by here for the real Chinese food.

I came here knowing exactly what I wanted: A \"Family Dinner B\" with Wonton Soup, Combination Fried Rice (Shrimp + Beef + Chicken), an additional two egg rolls, sauteed calamari with salt and pepper, and salt and pepper pork. 

I ended up with MUCH more food than I anticipated as it came with enough food to feed six! I started with the egg roll which was too greasy (reason why I gave it four stars). The wonton soup was also mediocre, but better in terms of other Chinese restaurants. However, the calamari and pork were outstanding! The portions were amazing in terms of the fried rice and entrees. I believe that $32 for the amount, let alone taste can cover anyone's dinner plan.

The only downfall(s) to these types of restaurants is you do NOT get any type of REAL customization.

I also prefer brown rice, but I understand that most oriental cultures are not a fan of brown rice due to the nature of their origin."}
{"text":"Loooooove it! Food is plentiful unlike other place..Fast cooking too but very delicious. Very good customer services too...yup everybody wrlcome you with a friendly smile and I am happy! My fave is almost all on their menu for real :))"}
{"text":"Never again. This shithole is nothing but a mistake. First, the customer service was horrible. We came in and I greeted them \"good morning!\" like a moron, the lady just stared at me with a scowl on her face. So we sat down. She came up and asked what we would like to drink. I said \"2 Cokes and 2 Waters please\"... she looked at me and said \"that's it water?\". Umm, woman, I said 2 Cokes and 2 Water. Wtf. Second, we ordered and she just walked away, not a single word. Third, the food was okay. Nothing spectacular. I should of went to Panda Express. They are happier there. I left and said thank you. They just stared with a resting scowl on their face."}
{"text":"Great for takeout. One of the best Chinese take out plsces I've tried. Delicious fried rice and the hunan beef is to die for."}
{"text":"The BEST paper wrapped chicken I've ever had! And the honey walnut shrimp is delicious too! Eaten here twice and we haven't been disappointed with any of the food."}
{"text":"It's okay, there's defiantly better in my opinion. delivery is always quick but chicken is usually soggy and made with d"}
{"text":"Can I give it ZERO? Service was fine, didn't get sick, but food is awful. I had potstickers, egg drop soup, chow mien, and crab Rangoon. I should have just burned the $25 dollars I spent, that would have given me more satisfaction. If you're from the east coast please don't go to this place. Idk what kind of Chinese food this is. #EW #Yuck #ThrewMostOfItAway"}
{"text":"I like this place! Friendly service and very affordable lunch special I believe 11-4pm. choose fried rice or fried noodle over one of the listed entree. My favorite was beef and broccoli. Love the crunchiness of the broccoli and the flavorful marinated beef. Lunch special comes with a side soup as well."}
{"text":"New in town & I was craving Chinese food .. Seen this new place close by to our apartment & wanted to check it out.
Cashier/ host guy wasnt so welcoming. As I decided to see what to order, I observed him cleaning up a table. All he did was wipe the mess onto the floor ?! He had no smile or not even an advice on what's good to order. I guess Im use to some kind of \" Aloha \" since I just moved here fr Oahu which he sure didnt have haha & it wasnt busy @ all so some friendliness wouldve been nice. I did  like that it was an open kitchen so I could see my order being made. 
Well .. now on to my food .. I was ordering for my family & didnt want to cook .. I had this craving for Honey Walnut Shrimp .. I wasnt pleased with theirs. The flavor had more of a sweet tart taste .. not the creamy sweet taste Im use too coz the sauce was more watery. Walnuts couldve been more.
Chicken Broccoli .. My son's fav .. Ummm but where the hell is the broccoli ??? .. More like alot of veggies n chicken breast pieces. 
Eggrolls .. another bummer .. excuse me where is the meat ?! STRICTLY CABBAGE !! I paid for egg rolls wrapped with cabbage deep fried !! Really & paid 2/$1.75 so not worth it ( my family never ate it coz it had no flavor or MEAT ! my mom makes better lumpia :) ) 
Beef with onion & ginger .. They sure overloaded this dish with green.onions & ginger. I mean Again Where's The Beef ?! SMH !! 
Combination Chow Mein .. Noodles sure wasnt chow mein but a different type. Combination meant Beef, Chicken & Shrimp .. Well I think there was maybe 2 pieces of shrimp n I dont know how many pieces of beef & chicken. But they got the dish wrong coz WHERE IS THE VEGGIES ?! NONE was in this dish ?! I dont know of any noodle dish esp chow mein where there isnt vegetables.. maybe they stuffed them all.in them eggrolls coz the noodles needed it. 
I spent a total of $ 41 for take out dinner which to me I thought I was bringing home a great Chinese dinner meal. But, fr my experience Id rather take a drive to Chinatown & experience a good sit down Chinese dinner for the price I paid. I was very disappointed. I felt I paid for freakin VEGETABLES !! & Im not eating in Hawaii lol its Vegas .. So I dont think Id be coming back here even if I had another craving. I still have leftovers and this is 4 days after. Im not one to write reviews like this coz I have a love affair with food haha but Im just being honest here and looking out for my other yelpers here in Vegas :)"}
{"text":"This place has amazing food. Their portions are amazing, 2 plates can probably feed up to 4 people. The pricing is great, is choose to come here vs Panda Express any day. The food is made to order so you can add or take off ingredients if you like. Service is very friendly as well. Wish they had a location up North, but whenever I'm on this side of town. I'm definitely coming here (:"}
{"text":"Ordered take out and was impressed with the quality, quanity and overall taste of food.  Looking forward to returning. You won't be disappointed."}
{"text":"I stopped by Rice n Noodle after getting my haircut next door, and I might as well have saved my money and gone hungry for lunch.  I ordered General Tso's chicken expecting crispy-fried, battered chicken chunks with a tasty sauce and veggies.  I'm giving 2 stars for the friendly service and cooked to order food, but they didn't have the common sense to leave the styrofoam container open even though they knew I was eating in?!  The hot steam inside, of course, caused the chicken to become soggy and gross and that was only minutes after they brought it to me.  So basically, I just nibbled on some of the veggies and dumped the rest... What a waste!"}
{"text":"This is one of our favorite places to go eat near our home. They have a great variety of Chinese food with generous portions on their menu with reasonable prices. The service is always quick whether you eat in or order to go. We love the lunch time specials there as well. If there are nights you just don't want to cook, try this place out!"}
{"text":"Ordered the lunch special, I had planned to eat in the restaurant. Lunch arrived in a Styrofoam to go box, so I took it and left. The lunch tasted like the styrofoam box, tasteless. To many good Asian restaurants around to waste your time here."}
{"text":"First time customer here...I ordered to go a few days ago. Only now eating half of my hot n sour soup. Guess what came with my order?! A piece of inedible item. I bit it, felt like cardboard, I thought it was a Chinese dried herb of some sort. I pulled it a part a little and it's quite fiber-y. Haha secret ingredient? Still not sure what it is, but definitely not coming back."}
{"text":"Not bad for a GOOD chinese restaurant. Me and my cousin were craving for chinese and since we were around the area, we might as well eat here. This restaurant is small but we decided to eat in and there was someone serving us. 

They had many different varieties of chicken, seafood, noodles, and more. The food was GOOD and was MADE TO ORDER which means fresh food.

If you are around the area and want to try new restaurants, I RECOMMEND coming here. The server/manager was good and comes around to make sure we were satisfied."}
{"text":"2 visits are 1 too many for this place. I previously believed that it is difficult to mess up Americanized Chinese food; Rice and Noodle changed that for me.
I do occasionally visit the popular chain during my lunch hour or whenever else I need to grab something fairly quick. I find that popular chain ok. That popular chain is better than Rice and Noodle.

The last time my guy and I went to Rice and Noodle was in early 2013. My guy made note of the dirty light switch and the dirt smudges surrounding that light switch. Spring forward to 2015 and the same dirty light switch. We verified with the picture he had taken in 2013. We had already ordered when we noticed it and decided to stay. My guy wanted to go but I insisted we stay so that we could take advantage of the lunch special and then have dessert at the new hot spot next door.
My guy ordered orange chicken and I ordered... whatever chicken. It was tasteless and forgettable. The rice was soy sauce flavored and the noodles were mushy. We added an order of 2 piece egg roll and that was also forgettable. Whoever prepared it is a fan of black pepper and used way too much. 
I apologized to my guy a few times and I had to treat him to a large dessert next door.

Lesson learned."}
{"text":"This place is by far the best chinese of Las Vegas. The rangoons are creamy and filled full, the sesame chicken isn't over fried or drowning in sauce - it's perfect, and the chow mein has great flavor. I've had this place twice now, just in case, and both times have been perfect."}
{"text":"Hands down best Chinese food I've ever had the noodles and house chicken is the best !"}
{"text":"just okay food. cheaply priced, so no complaints when comparing quality to that. you get what you pay for.
i've been back a couple of times."}
{"text":"What makes a good Chinese restaurant? Chinese cooks. Great foodcand service. Love it here"}
{"text":"We were looking for something quick to eat last night for Christmas dinner. I found Rice n Noodle on yelp and decided to order straight from the app. I ordered and choose cash as payment method, but when we arrived at the restaurant, my boyfriend decided to grab the tab and pay with his credit card. He was yelled at and told that they won't make any money from this meal because I choose to pay cash via the app. The experience of getting yelled at because we choose different from of payment was very disappointing. Otherwise I thought the food was great... but we probably won't be back due to way they handled the payment incident."}
{"text":"I hate this place. The manager who spoke to me on the phone was very rude and bad customer service. The way he spoke to me seem like he did not care if I spend money or not. Bad manager."}
{"text":"Worst place ever. The first time I went was good and this last time I went was the worst experience ever. I called back to tell them that they were serving old food the meat was so hard I can't even eat it. When I call them tell them that they gave me old food they were like it's not Panda Express and I told them I don't eat Panda Express I'm just letting you know that you gave me told me that was hard and I had to throw away the food. I am Chinese and I know my food and my parents own a Chinese restaurant so I know what to expect coming from a Chinese restaurant and this was disgusting. The place is close to my home and I'm never going back. I guess China Town it is."}
{"text":"I have been to this place countless times now and all I can say is wow, yessss, delicious, consistent!!!! The chow mien is ALWAYS sooooo good!!!!!!!!!! The employees are so nice and their customer service is ON POINT!!! I've had some other things and they have all been good as well... especially the Crab Rangoon  I'll continue to go here and recommend to other as well!"}
{"text":"I always order over the phone and pick up food after work. I love their salt n pepper pork chop n squid. I tried the different entrees and so Far everything just taste great. And they give a big box of rice for each entree which I find very convenient for me I don't have to cook rice when I get home.the portions of the entrees are more than enough"}
{"text":"This place is awesome. I really enjoy coming here for some quick Chinese food. If you need something fast and tasty I highly recommend this place. Whenever I need to pick up a mask for the family I just come here to pick stuff up. This place also delivers which is amazing at a charge of two bucks. 

The only reason for four stars is because the food here can sometimes be slightly oily at times."}
{"text":"This is my favorite Chinese food place! We used to go to another place but they closed down so we've been looking for an authentic good Chinese place and we finally found it! The food is so good! Or favorite is the general tso chicken! Only bad side is they serve everything on paper plates but hey the food is still good!"}
{"text":"Why is it is SO HARD to find good quality Chinese Food?!   Some people at work recommended this place, so we decided to order from there.  I wanted to try something simple just in case I didn't care for it.  It is very hard to screw up Chicken Fried Rice, so that's what I ordered.  It took about 45 minutes for delivery.  When it arrived, I opened it and immediately I was disappointed.  The chicken was probably the worst cuts of chicken I've ever seen.  Not to mention the rice was extremely bland and was very greasy.  Even adding soy sauce did nothing to enhance it.  I will not be back."}
{"text":"I've ordered several items from here and all are on par with other places in town, that being said, this place has good food and nice free items with the more you spend.

One item that is a standout is the kung pao chicken! Phenomenal and the best I've had in town!"}
{"text":"Without a doubt THE BEST Chinese food in Las Vegas. I've ordered Food from them 5 or 6 times and every time is phenomenal. The portions are huge, the prices are low and the food is absolutely fantastic. The only advice I would give is that the food runs a little on the spicy side so if you don't like spicy make sure to specify."}
{"text":"Not impressed. I ordered pick up and when I went to pick up my order they explained it never got made. The chicken was hard, over cooked and had was to much sauce on it. It was made in front of me but did not taste fresh"}
{"text":"Believe it! Chinese food with flavor! I did not know General Tso's was so good, or that egg rolls didn't have to be grease sponges. These were crispy and tasty. Bravo, Rice n Noodle and thanks for the speedy delivery. We will call again."}
{"text":"This review is for take-out only, as I have never dined at their physical location.

Fresh food, good size portions, inexpensive, and flavorful sans MSG. It isn't gourmet, it is cheap Chinese take-out at its finest.

Their delivery drivers are consistently early, which is huge plus! A good go-to when you're craving Chinese, but are too lazy to leave home!"}
{"text":"Close to my house, delivery is quick, food is always tasty! They have a big variety on the menu! Ive ordered here a few time snow and have not had a bad experience yet! They are super friendly and always on top of things!"}
{"text":"Rice n Noodle is around the corner from my work, so I go there a lot for lunch. Their food is delicious & the service is quick."}
{"text":"We ordered the family dinner A for $30 and I would say it feeds 4 people easy.

You pick two meat entrees, one type of soup, steamed or fried rice, and it comes with 2 egg rolls and 2 crab Rangoon's. Everything that we ordered was amazing and we were really happy with it.  Their sesame chicken and chicken lo mein is highly recommended. 

They made everything pretty quickly and it was nice and hot even when we arrived home to eat it."}
{"text":"Use Eat24 to make your order!!  I've dined in, ordered delivery and now tried take-out via Eat24. The staff is so friendly. The food is good, the portions are very generous. I like the Rice Noodles, the cashew chicken, and the potstickers. Enjoy!"}
{"text":"So I just left this place and I must say that service is almost nonexistent here. Didn't get ask if I wanted a refill, didn't get checked on, and I had to go up the counter and pay while the two women were having a conversation and looking at a phone. I found this to be extremely rude; plus I didn't get a fortune cookie :-(. Anyway I had the lunch special which was the chefs special, no spice. Wasn't bad, but the chow mien was sorta dry. The lunch special is from 11-4pm, so that's not bad. I don't know if I'll be back though. Cheers! Hope this helps"}
{"text":"You know when you get that Chinese food craving that just won't go away until you give in? Well, I held out for a few days, then we ordered Rice n Noodle. I've been hoping for a better option than our normal go-to's, something with more flavor and less grease. Well, I think we found it and now I'm in real trouble because now I want MORE!

Ordered...
*Combo Chow Mein - Okay, yum, just yum. I'm calling them as soon as they open to order more ... this could become a real problem!
*Shrimp with Snow Peas - Exactly what our group wanted, full of juicy shrimp and veggies galore, dosed in a flavorful broth/sauce, which makes me happy because you gotta have the sauce for the rice, right?!
*Mongolian Beef - Their Mongolian beef does pack a punch with what I'm guessing were dried thai chilis? That was a welcome kick of spice. The dish overall was a 3.5 for me, solid, spiced but lacking something.
*Orange Chicken -  The crowd fave - again - this orange chicken is a bit different than any other recipes that I've tried from other chinese-fast food tyoe locations. Thought it was a bit closer to a sweet n sour, and very yummy. Complete with a mix of broccoli soaking up the sauce on the bottom. Yum!

All orders come with rice, and this is where they lost a star. The rice was dry and kind of blech. Luckily we ordered in, and I was able to make some organic jasmine rice quickly that was fluffy and delish. Their rice game needs work.

I must say, though the rice disappointed, I was doubly impressed that not one container had that stomach turning grease slick, you know, the one you don't see until you've finished your meal and ruins it. 
Their phone service was awesome - I ordered food an hour early and asked them to make everything closer to when we would arrive for pick up- and they did! Food was piping hot and FRESH, veggies still had a slight crunch and the shrimp was cooked to tender. Prices were reasonable, they do offer the family dinner options, also. Overall, it was a happy meal... and with that said, I have to go order another round of chow mein..."}
{"text":"Best Chinese food around town so far.
Love the spicy garlic chicken lunch special. 
The peppers and onion aren't over cooked they have a nice crunch to them and the sauce isn't overly thick.

I highly recommend you order this item! 
I mainly order for pick up and delivery, I haven't eaten here yet inside but I will soon!"}
{"text":"The crab ragoons & honey walnut shrimp is bomb and the shrimps are pretty big. I recently tried the string bean chicken which was ok but way to many string beans and not enough chicken. Overall they seem to have good options and flavor so i will be trying diff things"}
{"text":"Last minute dinner choice for our group of 10. Had plenty of room and nicely decorated. Believe it is also grand opening recently. $20 gets you all you can eat for 90 minutes. Good deal for teenagers on up. My group have 5 kids under 11 and had to pay full price. Our group 6 kids and for adults came out to $241. Little pricey for a strip mall place to eat. Food was very good and flavored well. Your basic Korean BBQ where they bring you your choices of meat and shrimp and you do the grilling at your table."}
{"text":"I'm never disappointed with this spot. Food is always hot and fresh. Lord my order of bbq pork fried rice and salt n pepper wings minus the peppers are so damn good. China a go go eat your eyes out."}
{"text":"Love this place because (1)  person was understandable and polite when I called in the order - even when I had special requests like little oil and sauce on the side she was polite about it; (2) our rather large pit bull busted in when the delivery man was at the door.  He was so calm and cool.  As a result, dog was calm too.  Super impressive.
Food was great as always and they didn't even charge for delivery.  Maybe it was a mistake, but nice anyway!"}
{"text":"Decided to try to see if it's improved...first bist back was great.  But 2nd visit the lady that takes orders was kind of snippy and rude.  Where they had been generous w cashews in cashew chicken ..she now wanted to charge extra and we counted about 4 in the entire dish.  That dish was good.  Not a fan of their fried rice..it's kind of wet, like they didn't drain off the water before cooking it.  Weird."}
{"text":"Super quick delivery and their food is pretty great! Someone being from the east coast it's hard to find decent Chinese but really enjoy their food!!! Definitely my Chinese place of choice and it is just a plus that it is near where I live!"}
{"text":"Great place very affordable Ordered wor wonton soup and Thai tea everything was so delicious"}
{"text":"After reading some good reviews we placed an order for delivery at 7:54 pm. The online confirmation was to be delivered 1 hour later at 8:54.  After two phone calls where the person answering gave little information as to how long it would be before the driver arrived. The food finally arrived at 9:18 pm. The actual price of our meal was $27.36. The driver showed up with no apology. Rang and knocked on the door repeatedly as we were trying to get to the door. He looked at the receipt and said \"it's $28\" 

In regards to the food it was good but not good enough to erase to odd experience we had. We may eat there again but never delivery."}
{"text":"Food was really good, very fast, friendly works. Great take out business.  I will be back."}
{"text":"We ordered the kung pao chicken, it had a bit of heat to it. The chow mien tasted mild and the flavor was good. The rice was OK. The fish with black bean sauce was really good. The sodas were huge and refillable. 
     We went at lunch time. Keep your eye out for coupons in the mail. 
Be  prepared to get some delicious bargains!"}
{"text":"Good dishes at a very inexpensive price.  Very good New York style pork potstickers.  I think they also have a terrific mapo tofu.  Surprised at some of the negative reviews.  Maybe we have just been lucky!"}
{"text":"American style Chinese, but with no MSG. The staff is super friendly and nice. Food is good if you like Chinese food catered to American appetite. You can't beat the lunch special prices either, lot better than Panda Express."}
{"text":"General Tso's chicken spicy extra veggies... AMAZING best I've ever had. Ordered through yelp, said it would take 45 minutes, took 22 min from order to arrival. Great food, good price, fast service. What more can you ask for? No need to try any place else."}
{"text":"Ordered delivery. Food is ok. Nothing out of ordinary. But two stars are for lady answering phones. Speaks so fast don't let you finish your order. Constantly saying ok aha ok aha LOL. Didn't even finish my whole order wanted to add some soup. She said ok bye bye. Had to call again and add. Just funny LOL"}
{"text":"Absolutely loved it ! The portions are big ! We got Kung pao , sesame chicken and Chow mein everything was delicious ! Definitely recommend this place !"}
{"text":"Very average chinese food. Both the mongolian beef and fried rice were sub par. I asked to have green beans added to the entree and they weren't. Won't eat here again."}
{"text":"Broke the mold with Wor Wan Ton today. Sometimes a bit heavy-handed with seasoning, but the nicest people. Lunch specials cannot be beat. Enough to take home the remainder. Great on a budget."}
{"text":"For what it is (Chinese Fast food), it is hands down the best!  Everything we have gotten  there in the past four years since we moved to this side of town is super delicious.  Many times we have gone to other chinese fast food places and there is always a miss, something that doesnt taste quite right. Or at best, its mediocre Panda Express level.  Not this place!! Everything is tasty but our all-time faves are the Singapore noodles with plenty variety of meat/seafood and the crab ragoons.  These are best crab ragoons we've tasted anywhere.  they're big, golden crispy with creamy savory insides. Do not forget to try them, you will not regret it! Also love their beef and broccoli, very fresh broccoli  with super tender beef.   one of our fave things to do is order singapore noodles for dinner.  As its so plentiful, we sometimes end up with leftovers but they dont go to waste because they're still delicious the next day. Hubby discovered that if you mix them in your egg scramble you will end up with the most delicious scramble/omelette breakfast meal ever.   My mouth is watering, just thinking of it. I Cant wait for our next pick up order!"}
{"text":"Food is great! Fresh and delicious, they give a generous amount of food.They have an amazing customer service. The store is very clean and very organize. The only down side on this restaurant is the table. Only 9 tables but other than that its very nice in here."}
{"text":"Good price, good timing, good taste, but made us sick each night we ate it. Very disappointing bc everything else was good."}
{"text":"Great food, good prices and fastest delivery service we've ever had!   Portions are very generous and the chef also takes special requests.   I order steamed wonton in a spicy brown garlic sauce, a NYC favorite from my old hometown, and they make it amazingly!!!  They are never chintzy on the quality of products or the amounts used, it's always fresh.  Their Mongolian Beef is so awesome, I actually now ask for less meat!"}
{"text":"Greasy, fast Chinese food when you're hungry. Service was fast if not particularly friendly. But you can watch your food being made to order, which is nice. I got chicken chow mein and asked that they add some GREEN vegetables in addition to the usual carrots, beansprouts, green onions, and onions. What I got was 2 extra pieces of Chinese broccoli and one piece of regular broccoli. Oh well, you get what you pay for, and this cost me $8.60. Portion size was large. The noodles were a bit on the soupy side, but they still hit the spot."}
{"text":"Absolutely amazing!!!! Have ordered from here a bunch of times and never ever a disappointment. Always big portions whether lunch or dinner. I would definetly recommend if looking for a GREAT Chinese spot in the southwest."}
{"text":"I am not even a local to Las Vegas but when I visit i make it a point to get Rice N Noodle at least one day i am there.  I find their food to be quite tasty, respectfully priced and all in all it is an enjoyable experience each time.  I feel like the folks here work hard to give you fresh foods and they have made a customer out of me."}
{"text":"Best Chinese in town. We live in Centennial and nothing compares to it. Always fresh and everyone is always very nice."}
{"text":"Saw the signage and I was curious.....rice n noodle?

Upon entry it was clean and bright with a little southwest touch with bricks/stone design, like it was supposed to be something else when made.....I spat some Mandarin to the counter person to break the ice and ordered the Mongolian Beef over rice.  A safe bet but will show the cook's skills if really tasty and beef should be slightly charred.  And it waaaas good, nice portion too.  Enough for lunch tomorrow.  will have to go back and try some other dishes.

The lady came by 4 times:
1 asked how everything was
2 asked to refill my soda from the fountain 
3 asked again how was everything
4 asked to pack my leftovers w/ some extra rice too

Those of you who know....this is very unusual for asian food service..... granted there wasn't a ton o people there.....they usually don't care....

They must have smelled a Yelper in their midst......til next time, good eating!"}
{"text":"I believe we have found our new go to! Ordered fried rice, kung pao chicken, and chicken with broccoli. ....all very delicious ....we will be ordering from there again"}
{"text":"For airport Chinese, those was surprisingly good.  I had vegetables with spivey noodles and, with a bottle of water, it cost $6.73.  You can't buy a magazine in an airport for that cheap.  Not greasy, not overly browned like most chain Chinese, relatively fresh, nicely spiced noodles.  And nice people working there.  It's all relative in an airport, and, in that context, this was great."}
{"text":"Amazingly quick delivery, .5hrs sooner than expected. Great food, all hot & absolutely delicious. Rice & Noodle is my #1 spot for Chinese food in Vegas."}
{"text":"Superior customer service and surprisingly quick is the best way to describe this restaurant. 

I sat down, and was served my food in literally 3 minutes. The server spoke clear English and was friendly to everyone. I can see the staff is hard working because Tables were cleared and cleaned right away. 

For 6 dollars, I was given a huge portion that I was not able to finish, and this is one of the cleanest Chinese establishments I have seen in a long time.

I'm Chinese, so my taste doesn't match the food of this restaurant. Most Chinese restaurants in Las Vegas have to adapt to a mostly non-chinese population in Las Vegas, but the food here is definitely better then most. 

I have to hand it to this place. Keep it up!"}
{"text":"Such a friendly staff. I don't know his name, but I was carrying my food and my 8 month child in his car seat and I usually can open doors myself, but he rushed from the register to help me and offered to carry the food to my car... I didn't need all of that assistance, but I thought that was very helpful of him!! The food is also good and still fresh and hot by the time I get home, which is like 6 miles away..."}
{"text":"Rice n Noodle meets the greasy, delicious, Chinese food fix. 

I love that within 5 minutes of calling my order is ready for pick-up. The service is good and there are always discounts in my local mailer for free entrees, free appetizers, etc. 

Also the Wonton soup is super great when you are feeling under the weather. The Chow Fun is yum yum yummy!!

Do not go here expecting high end, authentic Chinese food. However, do come here if you want some quick, good Chinese \"fast food.\""}
{"text":"The lady at the counter was horrible. Got a to go order left to get coffee next door at serenade and came back. I sat there for good 10 mins or so waiting for my food and finally the guy calls me hands me the food and the lady stops him and says no that's not hers and she hands me the food that was already been seating on the side of the counter. If my food was already ready when I got there why didn't she say anything to me as soon as I walked back in the restaurant l. She made me wait. When was she planning on letting me know that my food was ready the whole time. That's so pathetic."}
{"text":"Quick service. Food was served fresh and hot..We're still looking for that perfect chinese Loved the BBQ pork and pot stickers."}
{"text":"Great service, GREAT FOOD, FANTASTIC proportions for what you pay, and just overall amazing. 

Me and my boyfriend are very picky with our Chinese food and how much we have to spend. This place is fantastic and will custom your orders if you need (I dont like veggies in my lowmain) and the service is always friendly and there for you if you need. 

Nothing can make this place better."}
{"text":"My favorite Asian quick eats in Vegas. They have a great lunch special that is so worth the price. 
You can choose to dine in with waiter service that's always been friendly. Or you can take out. 
If i'm in the mood for spicy noodles I get their  Singapore noodles with chicken. 
If I'm there for their lunch special that ends at 4pm I usually get their Hot Garlic chicken. Most of the lunch specials come with fried rice, chow mien and a cup of their egg drop soup. I usually dr the soup with some pepper and spice. Hey I like it hot :) 
Every time I've gone the place is ALWAYS CLEAN! I've never had a bad expierince with the food or the staff."}
{"text":"It's always good food and fast take out. Hard to beat this place on quality and price. 

My favs are the BBQ pork, chicken curry, and all the soups are great.

Service is fantastic as well if you decide to eat in!"}
{"text":"Not friendly. The food was just okay. Overpriced in my opinion. Probably won't go back."}
{"text":"This is my usual go to for Chinese food delivery in my area. It is pretty decent. The fried wontons are my fav everything else is standard. Delivery is very fast though!"}
{"text":"The Hong Kong style crispy noodles and wor wonton soup is THE BEST and my all time favorite!  The staff is always nice and the restaurant is always clean."}
{"text":"Will never order from them again. After ordering from them for three years they told me they would only fill the container up half way from now on. Horrible customer service and cost cutting."}
{"text":"Perhaps worst Chinese
In the genre's history.
Avoid at all costs."}
{"text":"I'm new to Las Vegas, but I found Rice And Noodle to be my new favorite Chinese restaurant,bi have only been there a few times, but every time was a wonderful experience,  the food is always fresh & the restaurant is clean.
The Hong Kong Crispy Noodles was one of the best Chinese meals I have ever had, I also love the Pot Stickers, can't wait to try more of there selections!  I highly recommend Rice and Noodle!"}
{"text":"These guys can't get their order right they forgot my drinks with last delivery and driver wouldn't go back to get it. Then when I call restaurant they won't do anything about it I had to scream and yell at these imbuciles, and still no results so I had to resort to my bank and cancel all transaction fees with this restaurant. So I ended up getting reimbursed for the whole purchase from my bank since the order was incomplete and driver refused to make it right. I tried  Never going back to a place that can't make a sacrifice for their customer when it's their fault"}
{"text":"RnN used(!) to be my go-to place.   Great Hot & Sour soup.   FANTASTIC moo shu.   That was until yesterday when I stopped to pick up an order and saw one of the food prep guys pick something up off the floor and (what looked like) throw it back into one of the food bowls.   Even if it didnt go back into the bowl, he had clearly touched the floor before resuming his food prep.

\"Gross\" isn't a normal word in my vernacular; but that made me throw up in my mouth a little.

Very saddened by this."}
{"text":"Small and friendly.  The lunch specials are a great deal.  Mongolian beef is the best thing to get here."}
{"text":"This place is great. Flavors are a little different than your traditional Chinese but still very good. So much so, we've been twice in under a week!"}
{"text":"I found this place by mistake. I was kinda just looking for Chinese food one day because I was craving it so badly. So I stumbled upon this place. It's kind of like a hole in the wall atmosphere. It's not all fancy or anything like that. And when you dine in and eat there they actually use paper plates actually styrofoam plates and bowls. I was somewhat a little weary about that and not a fan of eating in a restaurant that serves food on styrofoam. Which is the only reason I didn't give this place 5 stars. 

As for the food. Yummy! While eating my Wor Won Ton and my Combination Chow mein out of my styrofoam bowl and and plate I was very impressed with the flavor of everything. Also my daughter loves the shrimp chow mein. I think this will officially be my go to Chinese spot due to its close location to my house and also the fact that it's delicious. But I have come to the conclusion that I will just always get it to go until they get some better plates etc..."}
{"text":"Not only did I think the food was great but my slightly snobby Halmoni (grandmother) and mom thought so too. They are incredibly discerning when it comes to anything Asian. So I was thrilled when I saw them so happy with it! Our delivery order came within 25 minutes and was very fresh. We got the Hong Kong style noodles, Szechuan beef and the salt and pepper wings. Everything was delicious and not too sweet, like most Chinese take out, we will most definitely be coming back there again."}
{"text":"Finally found a Chinese food place that we like! Good and great price for the portion! Even reheated the next day it's still good and fresh. And we like the hours too, it's open later than other places. Good and fast service when we went around 9:30pm."}
{"text":"Best Chinese in Vegas! And the lunch special can't be beat!!! I got the General Tso, awesome mix of flavors and just the right amount of spicy. My boyfriend got the Mongolian beef and it certainly did not skimp on flavor. Delicious! 
Only problem I had was everything is served in styrofoam, I wish it was at least paper..."}
{"text":"I trusted my friend who referred me to try Rice n Noodle. There's only certain spot of Chinese food that I like to come & eat in the neighborhood but I told my friend I would try this place. Well... Not to happy how it turned out. My food didn't taste so good. My chicken tasted like fish! My noodles were really dry & not enough sauce. I will not come back to this place again. I should've went to China Bistro across the street."}
{"text":"I've ordered from here twice now, both times I selected delivery. It is good Chinese food and the price is fair. Fried rice and Kung Pao chicken are among my favorites. Their tofu is ok, when I asked if they could make it crispy they told me that was not something they could do."}
{"text":"I ordered fried tofu with vegetables.  The order came and my vegetables had no tofu in them.  They also tasted disgusting.

My husband ordered the General Tso's chicken.  It was all bone and gristle.  He almost choked a couple of times. 

The eggrolls were passable, but we threw everything else away without finishing it.

What a waste of 30 bucks.  I wish I hadn't tipped 20%.  It might not be the driver's fault the food was awful, but we got the impression the driver was trying to cook while delivering it."}
{"text":"This place use to be one of my favorite Chinese Restaurant in town...Deliver service was great, under 20 Min every time...food was fantastic, as well as the food...but something has happened....delivery times now an hour and sometimes more...Customer Service has definitely decline...Today I ordered and my order was wrong...I even asked her and she said all was good...When I  called them to have my order fixed, she gave me an \"Oh Well\" attitude..I can stand anything but bad service...now is 50 minutes since I called them and still have not gotten my food...Thank you Rice n Noddles"}
{"text":"First time here,  everything was amazing.  Denny was the cashier/waiter/manager and was super nice!"}
{"text":"Horrible service. Never go here for any food. They are too cheap and want to charge for  chili sauce. Very unfriendly and rude."}
{"text":"We just ordered delivery for the first time after receiving a promotional menu and coupons in the mail. The order was accurate and arrived on time. We ordered a family meal which I found to be a great value. It offered a good choice of entree items along with appetizers and soup that easily fed our family of 3, with leftovers, for a little over $25. They accepted my coupon for a free appetizer without any problems which made the deal even sweeter. I really appreciate that they included soy sauce and other condiments because it's always a bummer when a restaurant forgets. I look forward to trying other items on their menu. Thank you for the great service and meal!"}
{"text":"Good Chinese take-out food. Always fast. Friendly service is appreciated greatly. While the food is not anything exceptional, it is very adequate and affordable. Pair that with the friendly service and you get my go-to spot for Chinese take out."}
{"text":"Everytime I come here I have great service and excellent food. I love spicy so I always ask for exrra spicy. Still not spicy enough but its ok. The lunch special deals are amazing. $7 for a huge meal. I've never been dissappointed and I'm not afraid to try anything new because everything I've had so far has been delicious. One of my favorite places since I've moved here."}
{"text":"Solid food, great service for a Chinese restaurant. The cashier actually took the time of day to check on us a few times and make sure everything was up to par. The dine in layout is pretty basic and small, however, it gets the job done."}
{"text":"This hidden restaurant is great. I'm used to eating at Panda Express and needed something different. Comparing Rice n Noodle to Panda Express Rice n Noodle  taste more authentic, in my opinion taste a lot better, and gives you more food on your platter, they deliver, they sell Boba, and their lunch special is the same as Panda Express. Definitely will visit often when ever I feel Chinese food."}
{"text":"My husband liked it thats all that matters lol he is happy that it didnt have the bone."}
{"text":"I can't believe the high ratings this place got.  My sis brought home some food from there.  Teriyaki chicken was watery sauce and quite too sweet, the chow mein looked strange...very orange and did not taste like chow mein, the salt & pepper pork was very spicy and she even asked for mild/no spice and the tofu veggie tasted very mediocre.  I would rather eat at Panda Express or China Go Go."}
{"text":"I have eaten both lunch and dinner at this place over a dozen times.  The lunch specials are cheap and the portions are large.  The same goes for their dinner specials as well.  Every time I go there the employees are friendly and the service is good.  I have had a couple of misses including the shrimp with snow peas, but 98% of what i have eaten has been delicious.  Unlike some other places in town that give you large portions of flavorless food, they deliver the flavor!  The Cashew Chicken and Wor Wonton Soup are my favorites!  Enjoy!"}
{"text":"This place kills exactly what they are trying to do. Decedent decor, plastic forks, paper plates, and GREAT food. All the meats and vegetables are freshly prepared, and the food is quick and hot. Basic Chinese food done very well! The crab rangoons, garlic chicken, and combo chow mien were top notch."}
{"text":"I love this place. We generally order delivery and it comes fresh and in a timely manner each time. Great food, worth the price. I hope it never changes."}
{"text":"I was hungry after my hair appointment and was asking if anyone knew of any good Chinese places in the area. They mentioned this place had good food and big portions so we wanted to check it out. It was a chilly night so I started off with the Hot and Sour Soup( $6.25). It was made with bamboo shoots, seafood , tofu and mushrooms. It tasted good but I would suggest eating it all there. It doesn't taste as good reheated. 

My brother ordered the Orange Chicken ($8.25) and I ordered the Sesame Chicken ($8.25). I'm glad that steamed rice automatically came with these dishes.  I'm not a fan of ordering everything a la carte. The food was good and the portions were big enough to last a couple of days!"}
{"text":"Since moving here we have been on a mission to find some good Chinese food. So far this has been the best place we have tried. The menu has many options to choose from but we ordered a few of the basics to give it a try. Everything was delicious and good sized portions for the prices. Worth the try!"}
{"text":"The Mongolian Beef was pretty good and spicy. Everything else was okay as well. A little on the pricey side."}
{"text":"It's ok if you don't eat the kung pao chicken. The chicken tastes like McDonalds chicken McNuggets. Gross."}
{"text":"The honey walnut shrimp is awesome! The same goes for the shrimp chow mein I am definitely going here from now on for my Chinese food fix."}
{"text":"Just came in here for a quick lunch since i was in that part of town..I ordered the shrimp kung pao and my friend ordered the sauteed veggies..their chili oil has a lil kick which I like.
All the flavor was mostly in the main food and not the rice and noodles,in which in the lunch special it's more rice than anything,which I think it should be half rice and noodles. The food is decent yet I think the soup and food should be steaming hot when it comes to the table since its cooked to order and in a Styrofoam container."}
{"text":"One of my favorite take out places. Orange chicken is awesome. Staff is always friendly and attentive."}
{"text":"This place is just next door to my orthodontist and my favorite tanning salon, it's very convenient that's why I always come here before or after my treatment the food is good nothing special but the prices are competitive specially their lunch specials. I love their eggplant with tofu it's sooo good lol and shrimp chop suey! And I buy a lot of their fortune cookie  it's 5 pieces a dollar not bad..."}
{"text":"Portions were huge, food was fast, affordable and pretty good.
Not spectacular, not horrible. But good.
I would come here on a work day for a quick lunch.
Did I mention how affordable this place was?"}
{"text":"I like it :] fast n tasty asian food been wanting to find a spot like this for a while now ... only thing I'd complain about is ...I wish they had option for two combo lunch special ...instead of one ... but other then that it was great !"}
{"text":"Don't ask for delivery when they open.  My meal comes with steamed rice, but the rice was hard and cold.  This means it was old rice.  You can judge how good an Asian restaurant is by how good their rice is.  This was a cheap and lazy move on their part."}
{"text":"There is a lot of bad Chinese food in Vegas. Rice n noodle is a pleasant surprise. Their Wonton soup is really good and is more than enough for 2 people. 
The 5 stars are because they deliver!"}
{"text":"My go to spot for quick Chinese food because it's close to home and the food always comes out rocket fast. Portion size is large compared to the price. My usual order is the Hong Kong style crispy noodle or the combination chow fun."}
{"text":"This is really more like 3.5 stars, but I wanted to give them more of the benefit than the doubt.  Overall the food is decent, by far, one of the better non-chain's out there.  The pot stickers were so-so, but everything else was decent.  The place got busy and noisy and all of the cool air rushed out.  I would go again."}
{"text":"FOOD-Average Chinese food. I have yet to find a Chinese spot that wowed me. Good food for hangovers. Sauce was great on orange and general tso's chicken!!!!l Fried rice is also very good!!! Lunch specials are available. 

I did get food delivered through BiteSquad so I can not comment on drinks, service, parking or atmosphere."}
{"text":"We came in looking for lunch. I was excited they had cashew chicken. We ordered their lunch specials, and got wonton soup. Their wonton soup had a nice twist with shrimp in it. Location has ample seating and easy to find. Staff was courteous"}
{"text":"Oh man if you're cravin some good Chinese food this is the spot it's a little cheaper then some places I've been *gone to many Chinese places through out the years* went with my friends got the combination chow mein, orange chicken, salt and pepper tofu and mapo tofu. TOTALLY hits the spot for your cravings only thing is I've never been served Chinese food on plastic plates which to me is weird *oh from San Jose* but yeah other then that customer service was great and would come again"}
{"text":"Very good Chinese food it's Almost close to what we're used to back in Michigan before we moved here very hot and it helps we're around the corner this is our 2nd or 3rd time having take out from them and was not disappointed at all! I recommend this restaurant!"}
{"text":"Delivery...took the 60 minutes but i ordered during Sunday night football so I'll let that go. One of my containers was open and spilling in the bag. So presentation was lacking. With that said, i ordered the Wor Wonton soup. Full of veggies, chicken,beef and shrimp and plenty of wontons. It was hot, yummy and very flavorful. I also ordered the House special. Beef,shrimp and chicken stir-fried in a light sauce. So good. It was all very good and i dare say worth the wait. I would definitely order from them again. If i was rating just the food,it would be a 4. The delivery presentation dropped the rating to a 3."}
{"text":"Excellent flavor and portions for the price. Wonderfully sweet ladies working front. Much better than the other day at a different place. Great deal."}
{"text":"Excellent service. You can tell they have a hard working staff. Prices are reasonable especially their lunch specials! Great portions... 
My husband loves their pepper steak and I usually get their kung pao chicken or salt and pepper shrimp. 
We've never been disappointed."}
{"text":"I have had couple dishes from the Rice n Noodles.  Combo fried rice was okay.  I have had better.  The chow fun was pretty good except it was little too much soy sauce for my taste.  I need to make sure they put less soy sauce next time I order.  They are very friendly and they make it very quick."}
{"text":"GREAT food; speedy delivery. Large helpings. Leftovers will be lunch tomorrow. An added local favorite, I'll be ordering from here again."}
{"text":"It's soooooo good and quick... I Eder the same thing EVERYTIME. Singapore noodle extra extra spicy. Get it & thank me!"}
{"text":"the best potstickers ever!!!  service was great, just had take out.  super friendly and helpfu."}
{"text":"I have eaten at quite a few Chinese restaurants in Las Vegas.   By far the best we have found.   Kung poa chicken is excellent."}
{"text":"I was on a search for catering services & found that Chinese food was the best priced. Rice n Noodle offers party trays averaging $30-35.

I called in advance asking how much notice they need for a party order, which they said was at least 30 min. prior to when we need it.

My sister's baby shower was on a Sunday at noon & they open at 11 a.m. I tried ordering in advance the night before through Yelp because I thought it'd be easier to put my order in, give delivery address directions, etc. & it'd be one less thing I had to do in the morning.

With orders over $30, $35, $45, they have offers such as \"free entree,\" etc., however, you have to order directly with Rice n Noodle to get the offers they list on their website. I had to cancel my Yelp order & I called them directly to place an order. Apparently, I misunderstood what their offers meant because I thought I got an additional free party entree, but at that point I didn't care anymore & just ordered 3 party trays. I ordered \"Combination Fried Rice\" ($30), \"Salt & Pepper Chicken Wings\" ($30) & Beef Vegetables ($32), with a delivery ($2).

You can either pay with card over the phone & tip when you sign it or you can pay with cash in-person. Although they said it will be delivered in 45-55 min., it came in what seemed to be 20 min. (the location was not far from Rice n Noodle) & I was surprised by that.

They are very quick with making their food & delivering it!

The food was alright! I wanted to take advantage of their website offers, which is why I chose them for catering over other restaurants. I would opt for a different catering service next time."}
{"text":"Their food is really good!  We LOVE their Mogolian beef, eggplant tofu, and fried rice.  But, their service usually sucks! They aren't very friendly and are attitudey!  But, that won't stop us from ordering from them since they're only 2 mins away from home. The only nice person there was Walter(but we haven't seen him in awhile). Because of their lack of service and friendliness, they always missed out on a nice tip! Their loss cuz we're good tippers!"}
{"text":"Really good, fast Chinese food. Wish they had couple things that other Chinese restaurant have but none the less awesome food."}
{"text":"Huge lunch at a great price.  This is my top pick for fast Chinese food."}
{"text":"I'll just start by saying I order a lot of take out Chinese food. From the appetizers to the my fav egg foo young I have never been disappointed. Always On time and hot."}
{"text":"One of my worst food experience's ever.  I'm a lean clean eater that enjoys a wide variety of healthy quinine. Chicken and broccoli is a simple fairly healthy dish. That's unless the chicken tastes like $.. $. Absolutely disgusting.  The broccoli was great, tossed the so called chicken. Yuk"}
{"text":"This place is a semi fast food, even when you eat there, they serve  it  in a to go styrofoam boxes.
Service was good, the food is ok.
Lots of people call in advance to  pick up to go orders."}
{"text":"I gave Rice n Noodle a 5-star rating because of the overall experience I had there. I was working the Smith's Fanfest for Nascar on Rainbow, and for lunch me and a co-worker decided to give it a try. It was quick, cheap and great quality service and food wise. I got the orange chicken lunch special and it came with wonton soup and some cracker things for only $8. The staff was great and the atmosphere had a good vibe to it. I will definitely come back here when I am in the south Las Vegas again."}
{"text":"So I was trying to find a new spot to eat at. When I arrived, it was a full house. So I thought to myself, their food must be good if they got a full house of customers. Anyway, as a new customer, the cashier was very friendly, and offered me some of their afternoon specials. AWESOME! I liked the fact that they had specials!!! 

It took awhile for me to decide, but I ended up buying the pepper beef plate. Thought it would be just a few scoops of rice, but no! It was a plate full of delicious noodles AND rice! So on point! 

I'd give it 5 stars, but i have yet to try more things out on their menu. Best believe I WILL be back. Good food, and friendly service."}
{"text":"Cheap and pretty darned good! I've been coming here since it opened. When I was a poor college student living in a 5 bedroom house with 7 other people. We would get so much food from here and not break the bank. 


All very delicious too!! 


Salt and pepper pork chop. Ugh, Yum!
Lemon chicken, orange chicken, curry chicken, sweet, sour pork and honey walnut shrimp. Etc etc! I've tried so many entrees and all have been delicious. If you eat in, they will keep giving you rice once you're out. Carb overload, but hell yeah! I see why business seems to always seem great there. 

Oh, and they're all very hospitable.  I loved the service.  They're very attentive.  :)

Chinese take out seems to always be sketchy here in Vegas, but this place is clean and super yummy. So I suggest to give the spot a chance!!


Also,  it's in a corner in the back of the plaza.  Next to serenade and gelatology."}
{"text":"if you want something fresh, quick and tasty, this is the place, try their green bean beef, it is good.."}
{"text":"For the price this place is 5 star all the way it satisfies both at lunch , Togo or dine in .. came to this side of town to try ice cream for some reason I always drive for sweets but this Chinese spot is fast , affordable and the few times I've been here has always been friendly and food made fresh and fast 

We got 
Fried wontons 
Egg rolls 
Combo fried rice 
Orange chicken (photos coming when I locate whose phone I took pics on mine died )
Moo shu Pork
Mongolian beef 

It was all delicious totaled like $50 and we have left overs for days"}
{"text":"Been wanting to give this place a try and finally went in for their lunch specials. My husband got a chicken teriyaki bowl which was a decent size & pretty good, I got noodles with beef & broccoli that were really good but couldn't finish because of the portion, my daughter got the shrimp & snow peas special with fried rice, which I thought the rice was amazing compared to the noodles. We ate inside so they serve you & bring you the soup of the day which my kid & husband enjoyed. We also had a coupon that gave us free egg rolls if we spent more than $10 dollars & those were my favorite. Boba tea was a bit too sweet but next time I'd like to try the fruit slush boba drinks since those looked better. Overall the fried rice & egg rolls were my favorite."}
{"text":"The salt and pepper chicken wings are my fav. Close to my home and clean environment. The food is served pretty quickly as well."}
{"text":"I was craving pad Thai noodles and thought I would try this restaurant since it was close to my house and reasonably priced.
The delivery was on time and prompt which I appreciated.
I ordered my noodles medium instead of mild, hoping for a bit of spice. While they didn't taste bad, they were pretty bland and flavorless and didn't have any spice. I worry what they would have been had I ordered the mild. 
While the food wasn't \"bad,\" I won't go out of my way to order again."}
{"text":"Order take out here. Delivery time ~40mins

Food is pretty good. It is rare to be able to find decent take out Chinese food. I will definitely be coming back again. My overall experience of the food was pretty decent."}
{"text":"***YELP 100 CHALLENGE 93/100***

This review is based on my one time visit, a to go order made last Saturday. We were running errands and was famished by 2 pm. My daughter wanted to visit Desyree (Gelatology is next door) so we decided to grab lunch here first since we've never been. I ordered Orange chicken ($5.95) lunch special to share with her, within 5 minutes our food was ready and we were on our merry way. When we got home, I first tried the fried rice then the chow mein, it was promising. Food was not too oily and tasted okay. Next was the chicken. I'm sorry, but that had to be the worst orange chicken I've ever tasted. I don't know if I was given the wrong order or what but I was not used to eating chicken with soggy breading and doused with super sweet, artificial, non orange tasting red sauce. I wasn't sure if it was meant to be an entrée or dessert. I'm not one to waste food but after a couple of bites I gave up, I settled for the rice and chow mein. My daughter wouldn't even touch it and she LOVES orange chicken.

 I want to give this place another chance in the future and will update then because a few of my Yelp friends seem to like this place and I trust their tastes but honestly, not in a hurry as that monstrosity of an orange chicken still haunts me."}
{"text":"Fast, friendly,  cheap. They give large portions, and I was actually surprised at how much food was given. This was my first time here and I liked it."}
{"text":"Terrifically fast delivery! Food was hot and tasty. The chow mein is perfect late night food and the prices are all very affordable, including a small delivery fee in comparison to most other businesses."}
{"text":"We have Been coming here for years. Will not be coming here anymore. We ordered fried rice, string bean chicken and mushu shrimp. The reason we usually love this place so much is they use to give you your money's worth! We ordered the same thing we have been for years. Today the chicken fried rice was basically just fried rice with a few scraps of chicken and the same with the green bean chicken it was a huge container of string beans with scraps of chicken. The mushu shrimp had a fowl stench so we didn't even touch it. However we started eating the green bean chicken until we both realized there was hardly any chicken! Lol. So we never are one to call and complain but we figured since we are such loyal customers they would help us out. 

All we asked for was for them to credit are account. We didn't even want our money back. We just wanted a credit and we were loyal to them and figured maybe they were just having an off day and figured if we hit a credit we could give them another chance. They told us they would send a driver to come pick up the food. So the driver gets here and opens up the food and inspects the food and then calls his manager. The manager didn't want to credit us because he said we ate some of the string bean chicken.... well of course we did we were searching for the chicken!!  

Anyways they told us we could keep the food but we insisted they take it and we will never be ordering from them. 

So sad to see a place you love and get greedy and change the quality of their food. We will def be on the look out for a new Chinese food place."}
{"text":"Since moving here last year, we have been looking for good restaurants. The Chinese food places we have tried were over-priced, served small portions, and didn't even taste all that well!  We then tried Rice N Noodles and they serve excellent food with perfect portions and the are priced right! Not to mention quick service and friendly!"}
{"text":"Omg!! Everything here is amazing! The fried rice is amazing and the chow mein is sooo good!! If you order 1 meal for dinner you can split it for 2 people to enjoy! The portions are great.  You have to pay $2 more for fried rice or chow mein, but it is worth it. They have an awesome lunch special during the week."}
{"text":"I was impressed. Delivery was fast and I really liked everything (besides the potstickers) yummy boba and tasty walnut shrimp. Sauteed veggies Were awsome. All u can say is YUM!"}
{"text":"Food is good for the price.  Delivery time estimate was 45 minutes.  Surprise, it only took 15 minutes.  We were happy.  Thanks!"}
{"text":"Their food is always delicious, I've been there for lunch and ordered for delivery. Never had a problem with anything. Their food is on point. Definitely recommend this place."}
{"text":"Fresh sushi from a nice fella that works there. Best airport sushi I've had! Didn't try the hot bar though."}
{"text":"By far the best \"American\" chinese food in Vegas. Clean, fast and friendly service. Reasonable prices and nice area. Very solid!"}
{"text":"Very few restaurants were open Christmas evening, aside from fast food spots, and this was one of them. I was craving Chinese food and so I set out to try this place. Chinese food happens to be very popular for Christmas meals and this was evident through the many people waiting for their orders as I walked in. There were no other options so I buckled down to wait and I'm glad I did.

The food prices seemed a bit high to me for your basic take-out Chinese food, but is was no Panda Express. As I waited for almost a half hour, I watched the bustling kitchen in an almost choreographed precision of constant kitchen activity. The chefs never stopped moving, 2-3 of them cooked non stop and the woman at the front answered phones, took orders from inside and out and helped to fill the take out orders. They all did this while still being very kind and courteous to those who waited so long for huge orders of food to feed families, no doubt. No one seemed angry to be waiting for their food, they too were patient and understanding.

So, I was impressed with how hard they worked Christmas night, but how was the food? Honestly I had low expectations for such a busy night but damn if it wasn't perfect! Decent portion of fluffy shrimp fried rice (they apologized for running out of egg) with plenty of good-sized, fresh shrimp! The General Tso chicken was also delicious with fresh, colorful vegetables, a nice kick of spice with the dried red peppers and high quality lean chicken meat. They included free steamed rice and handed it to me with a smile. Needless to say, I'm incredibly impressed and they will get my business over Panda Express any day from now on."}
{"text":"Why did I even go here?..I feel sick..I really would much rather have Panda Express and that's saying a lot!..never again"}
{"text":"The Rice n I got off to a bad start. The first three things I encountered were disappointments:

1. They do not have a lunch special that comes with tofu. I asked just to see if maybe they could do tofu for a lunch special, and the answer was no. The $6 price tag on the mixed veggie special was higher than I have seen elsewhere where you do get tofu.
2. They do not have brown rice. 
3. The egg drop soup was thickened with so much cornstarch that it was more like a porridge than a soup. 

Given these three things, recovery into the 3-star zone was going to be a tough thing to accomplish, and sadly, the mixed veggies in a light garlic sauce did not earn the third star. For my personal taste, there was simply too much sauce, and the sauce was salty. Maybe I was in a \"mood,\" but I couldn't bring myself to eat more than a couple of bites.

On a positive note or two, there was definitely garlic, which was nice because sometimes garlic sauce is just a white sauce with little to no flavor. The vegetables were fresh. The staff was young and friendly. The place was clean with an open kitchen allowing you to witness the woking up of your order.

Still, I was disheartened by my tofu free, saucy lunchtime experience."}
{"text":"This is a good place for lunch. I took the family here for dinner once and it seems like the dinner portions are twice the cost for the same amount of food you get in the lunch plate.

The food is cooked fresh instead of sitting on a steam table for hours, and they will customize (light sauce, extra garlic, no green peppers, etc) without adding $1 for every change you make."}
{"text":"Chow mein here is the best you'll ever try! Ever! 

This place is a quick Chinese takeout place kind of like a hybrid between Panda Express and a traditional Chinese restaurant. But it's so much more tasty! I order here and drive past three other fast food Chinese places before I get my food there.

They don't even compare. It's not even a contest. Best Chinese in its genre. Hands down. 

The only very slight negative thing I will mention is their Thai tea is too sweet. But other than that- the food is amazing."}
{"text":"First time ordering take out here and food was hot and ready on time and my kids and husband were pleased with pork fried rice -colorful and yummy, sesame beef -great taste and texture, wonton soup with good variety of veggies and colors as well.  The Orange chicken very good for kids and adults.  All was fresh tasting and prices not bad.  Will be visiting again surely"}
{"text":"I went to this place today... The service was good although I didn't expect to be eating out of a styrofoam box with plastic utensils.  The food was good and although I wouldn't eat there again I would rate it a 4 for take out .  I will order from this place again but this time take out or delivery only."}
{"text":"I honestly do not know how this place has 4 Stars I wish I could give this place a zero. I ordered the teriyaki chicken and vegetable fried rice and it was utterly disgusting. I DO NOT know why  they call this chicken  but this is in no way shape or form chicken. I love chicken and I know for a fact that this is not all white meat chicken Breast I'm just so disappointed and the egg in the fried rice is not regular eggs maybe they use that crap in the box I had to throw all this food out, what a shame and a total waste of money. I'm done with these so called Chinese food restaurants."}
{"text":"Prices are good, menu is average, delivery was on time. Potstickers were fantastic but the noodles tasted kind of stale."}
{"text":"My husband is a regular here and the food is great! The lunch specials are a good price and the portions are huge. We definitely love coming here as a family and we are never disappointed. We recommend this place to everyone we know and they love it too! I give it 4 stars instead of 5 only because a couple of the staff are not as friendly as they should be. I wish I knew the one lady name that is very nice every time we come but she is the only one that is always so friendly to us."}
{"text":"Tried this place last weekend with my boyfriend we saw a circular for their menu and looked good. I loved the Crab Rangoon mus say A+. We ordered the appetizer sampler and pork strips and crab Rangoon was great but not a huge fan of any of the other items. We also ordered the KungPow combo dish, very hot to me but also very tasty. My boyfriend loved it, he doesn't eat left overs but he said it was even better then next day reheated. I do look forward to trying other dishes here as I do believe this place may be our new local Chinese food take out. We dined in but its small and can get crowded, also dining was with paper goods so may as well take out nothing special for dine in. 

Recommend for take out"}
{"text":"This place is the worst with disgusting food. We ordered chow mein, crab rangoons, egg drop soup, and potstickers. Rangoons were good but that was it. The egg drop soup was watery and tasteless. The chow mein had a chemical flavor. The potstickers were meh. We threw most of it away. We only ate some of it because we paid money and didn't want it to be a complete waste. NEVER EVER AGAIN. Save your time and money. Too many other options around here."}
{"text":"Great place in a nice atmosphere. Service was great they brought me food and refills!"}
{"text":"I had the orange chicken lunch special on a thursday for lunch for 6.50

- Hard to find. it's in the back. I had to go around Smiths just to find it. lol 
- Get the lunch for here to get the egg soup. small portion but satisfying
- comes with fried wanton + sweet and sour sauce.
- large portion of orange chicken, fried rice and chow mein!
- orange chicken made fresh. i saw them make it on the wok! 
- orange chicken tasted almost like sweet and sour chicken. i'm pretty sure they didn't mess up though bc sweet and sour chicken usually has pineapples. orange chicken is just orange chicken.
- Random pieces of big broccoli with my orange chicken??? bonus?? hmm...
- overall, it wasn't the best, but such a good deal that i'd come back and try other things"}
{"text":"Food is good and came out quick, but that's about it. Customer service here is nonexistent. Lunch special ends at 4pm. My boyfriend and I came in around 3:55pm (I know, I know... really close to 4pm), and tried putting in our order for the special. The waitress tried telling us only before 4pm. My boyfriend showed his watch to her that we still had a couple minutes. She spoke to the man sitting to the table next to us who was eating, I'm assuming the boss, manager, or owner (someone along those lines) to see if we could still order the special. The waitress said, \"Just this once he said it's okay.\" She then went on to say they didn't have any fried rice or noodles, just steamed rice. How can you run a business called Rice n Noodle, but not have it? Also, their employees eat in plain view of the customers. Definitely won't be coming back."}
{"text":"I am always satisfied when coming here. The food is always cooked fresh and hot and never disappoints. I have so many favorites here and I like trying something different every time. Can't go wrong here for some fast Chinese take out. Staff is always friendly also and portions are large."}
{"text":"Ordered the orange chicken lunch for delivery. Came with noodles and fried rice.
Also ordered a side of pot stickers. Had my order within 30 minutes.
The food was very good. Id definitely like to order again and see what else they have thats good. Thank you"}
{"text":"My husband and I passed through Las Vegas this week coming back from vacation and I found this place on Yelp. This place is a gem! The customer service was excellent!!! All four girls were very nice. Greeted us, refilled our drinks, got our order right, and even put our food in to-go boxes for us. Now the food, wow! It was sooo delicious. I had the coconut shrimp and it tasted amazing! The sauce didn't overpower the shrimp and the fried rice and chow mein was tasty and delicious. My husband ordered the teriyaki chicken and that was also very tasty! All of the food was made fresh and served hot. The food is affordable. The ladies that worked there were very quick and made sure that all of the tables were cleaned and ready for customers. I was very impressed with my experience at this restaurant and highly recommend that you try it!"}
{"text":"This is probably my favorite \"fast food\" Chinese. They're a little on the expensive side when you order with their regular prices but that's normal for Chinese. However, if you go on their lunch special which is like 12-4 or something like that. It's a great deal. It's like $6 and you to choose an entree and it comes with both fried rice and noodles. If you eat in you also get the soup of the day. It's a LOT of food. I usually get the orange chicken and it's very good cooked perfectly. I haven't had anything bad from this place so far. I only give it 4 stars because eating in is kind of awkward because they all just kind of watch you but overall love the food and you still get the same deal with take out just minus the soup."}
{"text":"This restaurant is so close to home and been telling myself to try it, every time I would pass by. Finally tired of the last couple horrible meals at my usual Chinese joint I gave it a try.
I got the General Tso's Chicken, order of Spring Rolls, and Singapore Rice Noodle.
The prices are about the same as other Chinese places around. Your food is woked fresh in front of you. The staff was friendly, service was fast. The restaurant was clean.
The General Chicken was delicious, best I've had in a while. The Singapore Noodles were a bit dry as well as the shrimp and pork seemed over cooked but it had nice heat and was tasty. The Spring rolls were very good, not greasy, nice thick sweet and sour sauce. 
I will go back again especially for some General Chicken and Spring Rolls."}
{"text":"Ordered delivery last night. Food got here exactly when the lady told me it'd get here (30min). Ordered the family deal, Mongolian beef & General's chicken. Both were delicious and the portions were plentiful. The soup, however, corn egg flower drop soup, was very unimpressive. All in all, a good experience, will recommend it I'm looking forward to trying the lunch specials."}
{"text":"First time here, I was hungry and have been wanting to try this place. Food was good, cheap and fast service.  I will be coming back."}
{"text":"Love this spot! Get their fish with black bean sauce and tofu eggplant!!!! So good! Service is fast and prompt!"}
{"text":"I have ordered from here numerous times and the food has always been good. I like the General Tso's Chicken, Hunan Beef and the Mongolian Beef. It's quick, hot, and fairly cheap."}
{"text":"Well, most Chinese restaurants taste the same, but not this one!  I had their Wings ( salt and pepper I like 'em extra crispy...) .. they were flavourful and tasty.  

I had the orange chicken for dinner which was spectacular and mom had the singapore rice noodles, which she seemed to enjoy. 

Well, she ate it in four minutes!  ( Without chopsticks of course haha) So must be good.  Momma!  please slow down! Use the chopsticks!

I finished with an elegant cup of green tea  with honey and the owner came over to ask me how the food was.. nice touch!  Worth the drive over here and very close to my fave yogurt stand which had a line out the door this particular evening..."}
{"text":"Tried it for the first time over the weekend. Ordered 2 lunch specials & the portions were awesome. The food tasted decent but I felt that the sauces were a little too sweet in flavor. I'll order different dishes next time."}
{"text":"Very good chinese food I had since I moved out here. I love their big portions and that they deliver all the time and on time! I love the shrimp with lobster sauce, shrimp walnut, and there egg soup! The family sets are good!"}
{"text":"My husband apparently has come here many times for work. He said he loves it and is his favorite. 

He took me here. I was skeptical when I first walked in. I was even more skeptical when I saw everything was served in styrofoam and plastic. 

I ordered the hot garlic chicken in a lunch special. It came with soup, and two sides: rice and noodle, hence their name. ;) 

It was so good and so spicy which is why I loved it! They also put pieces of fungus!!!! You never see that in an Americanized place. Loved it and love this place!"}
{"text":"The preferred Chinese delivery for this area for me.

The good - Hunan Beef, Salt and Pepper Pork, Fried Rice, Walnut Shrimp.  There's others but I can't think of them.

Just okay - Shrimp with Snow Peas, this is more like shrimp with vegetables.  I love shrimp with vegetables, but when I order shrimp with snow peas, I'd rather have much more snow peas.

Not so hot - Orange Chicken.  Baidu down the street does an incredible orange chicken that puts this version to shame.  No brown rice - in this day and age where most of us are trying to eat healthy, I'm surprised they won't carry any brown rice.

I want to point out  that they really cook shrimp dishes well, as most Chinese take out really cook the crap out of their shrimp and it comes out mushy.  Not only are they larger than most places I have had in town, they are really tasty."}
{"text":"The food was excellent , great selection and generous portions . The staff was friendly, the restaurant was clean .. We will definite come back here. Great place"}
{"text":"Found my new favorite Chinese restaurant! Food is Amazing! They arrived 20min early and my food was Hot! I will definitely order from them again."}
{"text":"i don't like a lot of chinese food but this is very good. great service and a very clean place."}
{"text":"Merry Christmas!  Thank you for being so generous in allowing us to place a last minute order and cooking our food fresh!  As always your food was delicious!  Your kindness was appreciated and warm welcome as we arrived as you were closing up shop."}
{"text":"We finally found a great Chinese food place that we really like. We ordered a party tray of salt and pepper pork chop and chicken fried rice. Everyone fm our party was asking where we got them cuz it was so good. Definitely going back for more for our parties."}
{"text":"I simply love this place. The lunch specials are a great deal as well as the family dinner pricing ."}
{"text":"This is probably my favorite Chinese takeout around our area. 
Everything is light not to heavy and clean. I don't feel like utter poo after inhaling all the delicious food we purchase. 

Tonight menu 
 Spicy garlic chicken 
Cashew chicken 
Green beans 
Vegetable soup \"no mushrooms\"

We usually get mapo tofu, beef dish and seafood but since we've been eating a lot of red meat it was time for some chicken.  

Some of the dishes can be a little to sweet so i recommend getting the spicy. It's still kinda sweet lol but the spicy evens it out. Real Chinese food isn't heavy nor greasy. This place is up to par for my picky self. 

Customer service has always been really awesome too. Always older man dropping off and never rushes me. I've even didn't hear the door bell a few times and they call me. Haha thank for that."}
{"text":"Not impressed! The food was was not good, and was overpriced. I would rather go to Panda Express or China Go Go since the food is better and cheaper. The food didn't have much taste and very greasy. My wife and I ate there and then both got horrible gut rot all night. Yeah, it's one of those kind of places. Have not plans of going back there."}
{"text":"Looked at yelp and chose this place.  I had Mongolian beef with steamed rice and a couple egg rolls. My wife had chicken chow mein over fried noodles spicy. Both were super hot temperature wise and fairly spicy the way we like it. If you are looking for bland food do not come here. Very good IMO."}
{"text":"Food is ok. I placed an order for pick up via the Yelp App, selected the pay with cash option, and was promptly lectured upon arrival for wanting to use my debit card, not cash. You either want my money or you don't. I DO NOT feel comfortable putting my banking information in a third party app as payment for ANYTHING. My noodles had clearly been sitting in a warmer for quite some time. Today I reheated my leftovers for lunch and discovered, not one but TWO thick black hairs mixed in. I'm a proud ginger. Two stars for having Honey Walnut Shrimp. Will not return."}
{"text":"I always forget this place is so close to me. The staff are very friendly and accommodating. Their rice and noodles are indeed very tasty. I recently walked in and ordered a beef teriyaki bowl and a chicken teriyaki bowl. I was greeted by a older gentleman as soon as I walked in and he took my order while another young lady was collecting payment from another customer. I believe this gentleman may be the owner. Food came out quick. It was priced very well, and tasted great."}
{"text":"This is our go-to place for Chinese food. The food is always good and delivery is super fast. Sometimes I feel like theyre already ringing my doorbell as I'm hanging up the phone from placing my order. LOL. I don't think we've ever had a bad meal here and we've been eating their food for years."}
{"text":"We have ordered from here a few times now and we will continue to do so. 

1 - they are always friendly and helpful. 
2- food arrives so quickly. 
3- Food is always fantastic!! So good. 

Best wonton soup for a takeout place!"}
{"text":"This is the best Chinese take out in south west Las Vegas that I've had over the last 4 years. Having lived in the tristate area and also California for most of my life, I've been fortunate to have great Chinese take out, and Rice n Noodle does not disappoint. 

I've tried a few of the other Chinese take out spots around the area, and this is definitely the best in terms of taste, quality, and consistency. 

Some of the tasty standout dishes:

1) All of the soups including the Wonton, Hot and Sour, and Egg drop are good.
2) Shrimp with lobster sauce
3) Mu Shu Pork
4) Bbq pork fried rice
5) Chicken Lo mein

Tip: The dinner deals are great, and you can always use some coupons online to get a few free items like an appetizer, upgrade to chicken fried rice, and others."}
{"text":"My son was craving rice so we decided to try this new restaurant and they deliver to mountains edge.  My son loved the chicken fried rice and I had the lettuce wraps which were very good also. The portions are very large we had lots of leftovers we couldn't even finish which is a good thing nobody wants to be done eating and still be hungry. The Delivery was fast it took them about 20 minutes when they gave me an estimate of 45... when my son is craving Chinese food again we will definitely order again!"}
{"text":"i am an east coast nyc chinese fan. i wanted to try some las vegas chinese and i was pleasantly surprised. i had the gen tso chicken. some really good heat out of it. i had the appetizer of sliced bbq pork. delicious. reminded me of ny/nj. the friend rice could have been a little crispier but had a good almost buttery taste and seemed to be a different type of rice than the east coast. egg rolls were alright. but I'm spoiled and nothing compares to a nyc egg roll. all in althea were polite fast and eager to answer any questions i had. id def go back!"}
{"text":"The food here is sooo good.  I haven't ordered a plate that I wasn't happy with.  I've ordered pepper steak, garlic chicken, sweet and sour chicken, wonton soup, crab Rangoon's, chicken wontons, shrimp tempura, and shrimp fried rice.  All very good food.  I don't have anything to compare it to but I don't really want to."}
{"text":"Very good, we have a new Chinese place. Food was excellent and a bit cheaper than the one that we usually order from."}
{"text":"I ordered the general tso house special chicken and it's really good. Nice portion size and good spice. And I like mild to spicy dishes. I also orders the beef chow fun. Also a good portion size. There lunch specials is really good for the price that you get for it  if you want something other than Panda Express but better portion size and better price get the lunch specials. They are worth it."}
{"text":"First time ordering and we will be back! Food was at my door in 20 minutes, everything was hot. The quality of the food is MUCH better than the place we normally order from. The food is extremely flavorful. It was money worth spending! Yay for great Chinese food in Vegas!"}
{"text":"I walked into rice n noodle one day because it's conveniently located next to my neighborhood and wasn't really expecting anything spectacular. However, I was pleasantly surprised to find that their food was actually super yummy! The food comes out really quick, like probably less than 10 mins every time. 

My absolute favorite dish here is the HOT GARLIC CHICKEN. YAS, it is sooo satisfying and the best thing is that the lunch special is only about $7. I've also tried the eggplant with tofu and orange chicken which is pretty good as well. I'd definitely recommend giving this place a try if you're in the area!"}
{"text":"This is our go to Chinese.  We order at least 3 times a month.  They are always fast and super fresh!  The house special chicken is my fav and the husband loves the won ton soup.  The fried rice and pad Thai is excellent as well."}
{"text":"Love the eggplant tofu here inexpensive and satisfying lol"}
{"text":"Great little place to get takeout or delivery. 

As we walked up at 9:30pm last night, I noticed the sign on the door that clearly states that they close at 9:30. We were about to turn around when the workers waved us in. I'm already impressed. 

The portions are enormous for the price and pretty tasty. My fella wasn't a fan of the overuse of onions in his pad thai, but as an onion fiend I ate all of his and mine as well. 

I had the chow fun with chicken. Good flavors and not too greasy. I had plenty left over for lunch the next day.

I'll definitely be back or heck, I might order delivery next time. The lunch specials look cheap as well."}
{"text":"Just moved here and saw this place had good ratings on grubhub. Amazing!!!!!! Ordered at 6:45 and my food was here by 7! Food was fresh.......my son, who is a picky eater, LOVED IT! Definitely ordering from here again."}
{"text":"Awesome Kung pau chicken and great service"}
