{"text":"Loved the proteins, needs more tuning in the service department.

I went there soon after it opened and was first impressed by the airy layout of the restaurant. You don't find many restaurants with what seemingly is 30 ft high ceilings.

We had the prix fixe menu which consisted of a decent soup, a really good protein and a good dessert. The duck that i had was cooked very well and was sizeable. The only wish I had was for it to have more sauce.

The service was very hit and miss. It is obvious that the wait staff were unfamiliar with the menu and couldn't find a good rhythm to get the dishes out promptly. Also, they weren't attentive in filling our glasses with water. As this restaurant is very new, I chalked it up to growing pains.

4 stars is mainly for the food and ambiance, and the assumption that the service will improve the next time I go back."}
{"text":"It is very spacious inside. However, its \"karaoke-like\" flashy light on the ceiling and the European walls are not match at all. The \"soup du jour\" and the scallop were too salty.  The steak I had was alright. Overall, I think the food was just very overpriced. I would say if they take 50% off of everything on the menu, I would give them a 2-3 stars."}
{"text":"With bad reviews from before, I was pleasantly surprised with with the quality of the food.

Came with family for lunch and ordered off the lunch menu. We had the Duck Confit, Pork Medallion, and Chicken Carbonara.
Duck Confit and Pork Medallion were quite good. My brother said the Carbonara was 'okay'.

Although the food was good, the service wasn't all that great. Food took about 20 min to get to the table, though there wasn't anyone in the restaurant. The server also did not mention that adding 2 dollars would get us soup, coffee/tea, AND a dessert. That would have been a great deal, EXCEPT he didn't tell us... Not. Cool."}
{"text":"Quite frankly, I feel sorry for the restaurant. It's a really nice location, and the price is fair for what you get. It's 6:30, and there are only three tables, and it's Father's Day. 
Their service is good, the server could be a little more confident, but she is friendly and did well. The food is above average, as their chef definitely got skill. 
Here's their problem: their beef. Most of my party got a really nice cut cooked to perfection. But, then there is my wife's. It has no colour and no taste. I asked them about it, they quickly rectify by refiring one.
Anything duck they made are really good, and I love the sea bass I had.
Then, there's their desert. Their cake looks good, but it was dense and not fresh at all.
I'm impressed but not sure impressed enough to come back."}
{"text":"This restaurant is by far the worst I've came across in Markham. The price is just ridiculous, the food was whatever. The steak and lobster TAIL combo... Ugh I don't even want to look at it. The lobster tail was there but the meat was not attached to the tail and it was a few random lobster pieces! How do I know this? Because I'm a manager of a Chinese seafood restaurant and right away I can see that the lobster chunks came from different parts of the lobster. The chicken leg that I got tasted like rubber and the gravy? Tasted like package powder gravy. Honestly this is not the place you want to go if you want to have steak or lobster. The service was okay and that's why I'm giving it 1 star besides that I don't fine anything nice"}
{"text":"Rich II looked like it is in their preparation stage when I came for lunch today. Mind you they do have a sign in the front saying they were doing a trial run giving customers 10% off.

The interior is roomy and spacious. The tables are set around a fountain giving the feel of a European courtyard. 

The price of  lunch menu which is a la carte is a lot more than anyone in area would have wanted to pay, with a main salad at $14! Or you can opt for the set at $35. Lunch set for $35? I

I really don't mind if the food is good.  A prime rib sandwich ($17) was meh.  A lot of chewy tendon. The best part was the extra spicy pickle. The so called truffle chips were overcooked...

The table setting is of dollar store quality.. I have not seen a plastic bread basket pretend to be wicker as yet in any restaurant at this price point. The side plate was dirty. Everything reminds me of trying to look classy by using inferior material.

I have nothing against Chinese people opening high end steakhouse. But in order to be successful a lot of work and attention to little details is needed. Hiring a manager that has real high end restaurant experience training the waitstaff for sure would help.

And don't serve your customers hot water in a cup if they don't request that. I just hate drinking plain hot water nor I speak or understand Mandarin much."}
