{"text":"In 2 weeks in Toronto this is the only place I've chosen to go to twice. Literally stumbled on it after a wander in the market - it looked welcoming, but I had no idea how much. Rick should REALLY write his own travel books - he loves an explorer chat, and is attentive to just how you like your eats and drinks. Best bacon I've tasted in Toronto. Lush Early Grey tea blend. Best chat and service too. Keep doing what you do Rick!"}
{"text":"This has become my favourite haunt to do freelance work. The staff are always friendly, the cookies and brownies delicious and they do a wicked range of smoothies. Importantly for freelance work - the WiFi is reliable and there are usually tables available near power sockets if you need to charge your laptop. The front is opened up in warm weather so it comes pretty close to working on a terasse, plus you get all the theatre of Kensington. ;)"}
{"text":"This is not a one-time experience review as I actually live in Lake Las Vegas. Hands down the Worst service I have ever had anywhere. (Food is pretty gross too)  They used to have a Creme Brûlée oatmeal that was amazing (no longer available), so I used to suck it up just to get it. Going on a regular basis, one would think the guy would know you by now, especially ordering the same thing! Instead, you get canned questions and responses.   Just horrible. No other words to describe."}
{"text":"Pricy - but I expected that from a hotel restaurant. They have an omelette station you can order from during the breakfast buffet, but I haven't tried it. Their food is below par for the price."}
{"text":"Cozy / relaxing spot, friendly staff, delicious smoothies, bold coffees and love that tax is already included (easy to break change)!"}
{"text":"The food is delicious and the service is quick. Rick is amazing! He is so personable & patient with long decision makers. I ordered the veggie pesto sandwich which is simple but full of flavor and was very filling! Five stars are not enough to give for our great experience here. Thanks Rick!"}
{"text":"The food is good as well as the service, but the prices can set one back. We mostly eat the buffet and felt that for the price a bigger selection should have been displayed, yet it could be that our timing was off as the hotel was not too busy. There was even enough time to talk to one of the cooks and get to learn something about the kitchen.   I would recommend this restaurant while staying at the hotel, but be aware of the pricing."}
{"text":"I was a bit skittish after reading some of the reviews, but the location cannot be beat. Plus, one of the more negative reviews involved someone ordering a well-done ribeye, LOL, so I decided to test this on my own.   This restaurant exceeded my expectations. The chef's special was a halibut dish, and it was cooked to perfection. Better than food we have gotten at much higher regarded restaurants. Service was amazing, and I would highly recommend dining here."}
{"text":"Breakfast buffet is very recommended with $16 a person. Not too many options. But really good enough. Bacon was great. They made omelet on your demands."}
{"text":"I had the breakfast buffet. The food wasn't amazing, but pretty good. They have an omelette bar, fresh waffles, the sausage was so good, yummy pastries, orange juice and coffee include. Our server, Ellie was so sweet.   The reason this place isn't getting more stars.. The hostesses weren't very friendly, certainly not very professional. It was a very simple place, very casual."}
{"text":"Started going in here during the summer. My girlfriend stopped in there for a quick coffee by chance a few days before hand and spotted a drink on the menu that had peanut butter, banana, maple syrup, soy milk, a sprinkle of cinnamon, a shot of espresso, all blended up with ice. I really fancied a drink like that for quite a while. I had something similar from Kupfert & Kim that was absolutely dismal, which took three people to make and another five looking at them do it while there was about another five standing around the corner chatting away. It was terrible, I waited I don't know how long for that many people to make an expensive tasteless cup of over hyped dribble.  While in Rick's (This drink is called 'The Doug,' here.) it took a few minutes to make, by one person and it was amazing. So good in fact, I go there a few times a week to get this ever since. Every time I go in it's a pleasant experience. Great, friendly staff who know how to do their jobs and like doing their jobs, great atmosphere and ambiance. If I don't go there at least once a week, I get withdrawal.  Just go there and treat yourself to a Doug and a peanut butter brownie. You'll feel like you have just achieved a life goal you never knew you had afterwards."}
{"text":"Great Breakfast, a bit pricey. I had the \"steak and eggs\", braised short ribs topped with perfectly fried eggs and served with a side of perfect hollandaise sauce. My wife had the smoked salmon with poached eggs,. very nice!  Loved the breakfast potato waffle. The server was a bit overwhelmed, but he was good. This is my second visit, I will be back!"}
{"text":"The only thing I didn't absolutely hate was the bread. Ordered chicken tacos and grilled salmon. Both were awful. Couldn't tell you which was harder, the tortilla or the chicken. Also, who serves celery and carrots on the side of tacos?! The side on the salmon was sliced potatoes, corn, and bacon and mashed potatoes-- what?! This is supposed to be a \"fancy\" restaurant. I would have rather had a microwavable tv dinner."}
{"text":"The food was great and they give large portions! We had the carved turkey sandwich and the bleu cheese burger with sweet potato fries. We just got the food to go but as much contact as we had, everyone seemed really nice and friendly. Ate the breakfast buffet and it was delicious but too expensive. There's no way I could eat anything close to $20 worth of breakfast food by myself. Thankfully my daughter ate free."}
{"text":"id say this place has the best coffee in kensington market (and ive tried most coffee shops in kensington multiple times)hands down ricks is so far the best! friendly staff,prices are reasonable as well,clean and they have a outdoor seating area. they also have gluten free options"}
{"text":"Front of the house doesn't have a clue.  Walked out on my second visit, room wasn't half full, waited 15 minutes for water.  Back of the house so-so at best.  Marsala must come out of a jar, seriously.  French dip just okay.  Less than a mile away, Bernard's Bistro & Luna Rosa are most excellent!"}
{"text":"The atmosphere and food is really good. The  staff is friendly. It's lovely to sit by the window and look out over the grounds. I had the breakfast buffet each morning during my stay and it was really nice. A good array of fresh fruits and a friendly cook nearby to cook waffles and made to order Omelets. It's a nice perk if you can have it added to your stay, otherwise, quite pricey at $19.95 per person. Only thing I'd add is bottomless mimosas to make it better!"}
{"text":"I live three or four houses down from Rick's and it's my go-to spot for cheap coffee. When I mean by cheap, I mean that it's affordable but great quality every time!  I especially love their breakfast bagel combo (with coffee) for $5. Rick is always so friendly and genuinely curious about your day and how you're doing. He always puts every effort to provide great service to all of his customers.   He also has loyalty cards where after the 10th (not positively sure) coffee you purchase, you can get either a free coffee or any of their specialty drinks!  I've brought so many of my friends here and they've always had great experiences every time. Thanks Rick!"}
{"text":"Not sure why this place doesn't have more decent reviews, but being stuck in this resort for three days for a conference, Rick's Cafe is the only place to eat. There's nothing around the resort that's walking distance, so this is your best bet if you're staying at the Westin.   The breakfast buffet has plenty of options for the price - there's an omelette (made to order) and waffle station, various pastries, scrambled eggs, sausages, fresh fruit, oatmeal and more. I've also tried their a la carte breakfast and my favorite is their breakfast burrito - it kept me full all day, the portions are enormous!   For dinner, my absolute favorite is their burger - it's gonna get messy, but it's so delicious! The buns are lightly toasted, and the the patty is soft and full of flavor. For appetizer, I recommend their potato chip nachos - they are like Ms. Vicky's chips drizzled with cheese and ground beef sprinkles.. my mouth waters just thinking about them.   The service was very attentive and our server got to know us after three days - They have a good sense of humor and checks on our table constantly to make sure everything was smooth sailing.   Too bad Rick's Cafe is located in the Westin resort, otherwise I would definitely return!"}
{"text":"Food was excellent! We ordered the NY Strip steak and it was perfectly flavored. As were the sautéed vegetables and mashed potatoes. Everything was great and well worth it. Would definitely eat here again."}
{"text":"We used to love driving out to Lake Las Vegas for breakfast, so when family came to town we made sure to bring the out, bragging about the wonderful food. But then we had to apologize once we found out that there were so many changes made to this place. The eggs are not fresh from the shell, basically the same eggs they serve at Holiday Inn for FREE!!! And the toast was served before we even received out plates. The butter was frozen, so we couldn't spread it on the toast & then we had to hurry to eat the toast before it got cold. 100%  Disappointed and will NOT be back because the manager didn't care & basically told us if we don't like it, we don't have to eat here. AWESOME CUSTOMER SERVICE SKILLS!"}
{"text":"Food was better than I expected.  Wasn't terrible but wasn't mind blowing either.  A bit pricey for what you get but nice experience non the less.  Our server was excellent but the service in general at the hotel was terrible."}
{"text":"Fantastic $5 coffee and breakfast bagel special. The coffee is freshly made with good quality beans and the bagel comes with ham, cheese, and egg. A low-key, cute spot in the Market for an affordable breakfast."}
{"text":"Since we stayed at Westin Lake Las Vegas using the Nevada Rate, American Breakfast Buffet for two people was included during our stay. I believe there are other packages that offered this special so check the website and Groupon. We were seated promptly, which we loved cause we were starving! :) As we sat down, our server immediately offered orange juice and coffee and then brought us ice cold waters. Lovely first impression!  The buffet itself was a simple set-up. I know some people here said it was underwhelming or disappointing and I completely disagree. I prefer quality over quantity so I appreciated having just the right amount of breakfast essentials rather than a huge array of food, which I won't have room to eat anyway. I opted for scrambled eggs, breakfast potatoes, bacon, sausage, french toast, buttered croissant, cereal, waffle (made to order) and fresh fruits. Other items I didn't eat because I was stuffed were bread and bagels to toast, a variety of pastries, oatmeal, cream of wheat, hard boiled egg, ham and cheese scramble and omelettes (made to order).   It's comparable to other breakfast/brunch buffets I've been to and it's pretty decent for the amount of food available. Of course it isn't like Las Vegas strip buffets so don't expect that at all. But my overall experience was great! The price would be around $20/person if it's not included in your hotel stay but this place has other items on their menu besides the buffet.Other than the food, I also loved the service. All the servers were so kind and sweet. Definitely made my morning!"}
{"text":"We stopped in Rick's just because we all were thirsty, and needed something to drink. It was probably the best place we stopped on our trip! We all got a smoothie, which we watched them make with fresh fruits and other ingredients. They were delicious! We sat at the bar facing the windowless pane (which was awesome) and watched the buzz of the street!"}
{"text":"Well! It's a hotel restaurant! We came for lunch and had chicken and waffles. Ruined by the herbs that were put in the waffles! Blech. They are so good normally because they are sweet and savory. The herbs make it too savory and it's not a good combo.   The tuna salad sandwich was okay, just dry.  Mediocre for sure. And disappointing since Marssa is so fantastic."}
{"text":"Great variety of fruit and pastries! Yummy omelettes and good service. Enjoying our last minute getaway at Westin."}
{"text":"I had a good experience here. By hotel standards it was reasonable and the food was good. I had the salmon tacos. The setting is nice."}
{"text":"My daughter & I really enjoyed a peaceful mommy/daughter date here.  The decorations are lovely, in the Moroccan theme of the hotel, the service was great.  They made my daughter feel like a princess, she wanted to leave the review so I am writing this on her behalf.  The food was fresh & good; I'm not sure what people would have to complain about.  It was open, it was clean and we got good service.  This is a heck of a lot more than what you typically get from a hotel restaurant. My daughter says - \"This place is good, fancy and yummy!\""}
{"text":"Prime rib on buffet was excellent. Traveling on business, so by myself.  With Westin always have high expectations.  Disappointed for first time with Westin.  I never saw a server the entire time of my meal...seriously.  Host sat me.  I went to buffet (twice).  Never did a server address me to offer a beverage or anything else.  I had to ask who the server was in order to pay the bill. Really felt like dashing but of course didn't.  Food was a 3. Service a 0.  So rating a 2.  Westin GM and restaurant manager/chef have work to do."}
{"text":"Wonderful buffet and excellent service. The omlette cook to order chef could have been a bit more thrilled to be at work but the server made our experience much better."}
{"text":"We ordered takeout from here yesterday while staying at the Westin and absolutely LOVED the food! The only reason I am giving this a 4 and not a 5 is because the restaurant seemed very empty, yet it still took about 10 minutes for anyone to help us at the front. We ordered the calamari appetizer, a Chinese chicken salad, and the double cheese bacon burger. The calamari was not chewy like it can be if prepared incorrectly. They serve it with fried banana peppers, which was something different that we both loved. The salad was very fresh and the dressing was great. My husband ate the burger within 30 seconds and said that it was fantastic. All in all this was a great place to order dinner for the room without sacrificing quality. Also, the person who put together our order was super helpful!"}
{"text":"I really enjoyed my coffee here. It has an incredibly welcoming atmosphere And very friendly owner and service. The coffee was a very good flavour and the set up is quite nice where you can either enjoy a view of the street in kensington market or sit in the back of the shop for more privacy. If recommend the drip coffee or Americano which both have a bold taste which I enjoy!"}
{"text":"Every thing was amazing.  We had a large group, the service was friendly and fast.  I tried 3 different items and all of them were really good.  Michael the chef was on the floor visiting with guest to ensure everything was great."}
{"text":"I was hoping they had a yelp. Wow oh wow this place is bad. I stayed at the Westin for 4 days. I ate at this place 3 times. All 3 times I regret spending my money and eating at this place. This place is horrible I mean horrible. The food is disgusting the workers seemed like they wanna kill them selves.... No lie.. This is probably the worst experience I've had with food. At least the chicken tenders were okay. So sad seeing such a beautiful hotel but such a bad restaurant. Don't spend your money here. Just go find somewhere else to eat even tho everything is far."}
{"text":"Came in to have brunch with my family. Place was not busy for a Saturday, maybe 4 tables were filled. Maitre D was nice but not so attentive. There was a kid with us, so she give her a coloring menu but no crayons. We had to ask for it. Our waitress came 5minutes after we sat down to ask for our drinks then never returned. After another almost 10 minutes of waiting we stood up and left. We told the maitre d we're leaving seems like everyone is so busy. Too bad, we really wanted to try their food"}
{"text":"My party of 8 tried a variety of things which were all pretty average.   Salmon, scallops, wings, hummus, Reuben & turkey sandwiches. All pretty average, nothing special. I tried 3 glasses of wine before finding something good at $22 a glass. Service was average as well. Would have had Marssa's next door, but menu was too sophisticated for our younger guests. Part of our group had breakfast earlier today which was also very average, which seems to be the overriding theme here. Even the specialty drink list was unsatisfying. Not sure what is needed to get this place to the next level."}
{"text":"We are locals and we were very excited to try this place. We were given a gift card for the Westin for Christmas, so my husband and I decided to take the kids there.  Before going to the restaurant we asked the front desk staff if we could use the gift card at the restaurants there and they said yes. Only thing was it was a one time use and we would not get any credit back if there was any left. We agreed to this.  So we get to the restaurant and present our server with the gift card after which she tells us she has to check with her manager to see if it okay to use it. 15 minutes later She comes back and says the same thing the front desk staff told us. In the 15 minutes she offered no bread and was lazy on refilling our water (they should invest in larger water glasses as they are only a 5 oz glass) It felt as of our server (Ruth) was inconvenienced by my family having dinner there. Although the food was not great, it wasn't bad either but we will not go back because of the service. Service makes all the difference. I also oreded a 17$ glass of red wine which was served to me cold fresh out of the rerefriger so I had to ask for another. My husband ordered Blantons on the rocks in which the bar tender put too much ice and was served to my husband watered down.  I honestly would give this place a 0 if it was an option. The dinner total was 175 and the gift card was for 250... So the Un-enthused server (Ruth) received a 75$ tip."}
{"text":"Loves this place. It was really delicious and the service was wonderful. We went here twice during our stay, one night we ordered food off the menu and we also did the breakfast buffet. The buffet choice is just enough, however I do believe it's overpriced because of the small selection of items for the buffet. I can understand that price for a big buffet but not a little room of food. But it was delicious. The salads were the only part of our meal we didn't like.:: they put way too much dressing. None of us ate our salads and the salad is my favorite part. We got the buffalo wings as an appetizer for us... They r a must and very delicious! The salmon was good and the bacon crusted ribs are amazing!!!! Very expensive but worth it for the food(not the buffet) took some pics!"}
{"text":"Middle Eastern meets Southwestern is the best way to describe the food here.  I found most of the food here to be pretty bland and overpriced but it seemed to mostly be healthy.  I ate many lunches here over the course of over a month when I was attending a training in the hotel so I ate nearly everything on the menu.  There aren't many options in the area so this is your best lunch spot unless you want to go to the village."}
{"text":"We had lunch here on our day of arrival and the food was delicious. I had Ricks Salad, which was packed full of blueberries, avocado, strawberries, spinach, and candied nuts. The dressing was one of the best I have ever had. It was like a cilantro vinaigrette with mint or something; really good. My table mates got the crab cake sandwich and one of the wraps and everyone thought the food was really good. It was pricey, around $16 per person for lunch, but well done."}
{"text":"We've eaten here a few times during our Westin stays.  Great breakfast buffet, (abt $20 per person) includes a custom omelette station, lots of fruit and yogurt choices, and of course the good old American breakfast favs; eggs, biscuit and egg sandwiches, French toast, bacon and potatoes.  Of course there are the tiny little donuts & cupcakes disguised as muffins too ;)  Breakfast buffet goes until 12 noon- yay!  The hostess and servers here are always super friendly and helpful.  Our latest waiter was from Hawaii and probably the most personable server we've ever had.  Such a sweetheart and never let our glasses go empty or let the plates pile up- definitely on top of everything!  A very nice, elegant cafe with stylish touches.  The atmosphere is lively but not loud.  Lots of seating available so there's very little wait, if any.  Love the view with all the French doors looking out over the landscaped pool area.  There's also outdoor seating for when the weather is suitable."}
{"text":"The Westin hotel is close to where I live and my wife and I go here often. Were married at The Westin as well and Rick's also provided the catering for our wedding. Although no one knew that, the food was a hit as we knew it would be.   I'd say Rick's is best for breakfast or brunch. We typically order off the menu vs the breakfast buffet although we've had the buffet and it's fine. I've found the service to be best for breakfast and lunch and not so much for dinner.   Dinner service has honestly disappointed us and it's not a one time thing. I'm not sure why it would be different but the level of service and attention for dinner is close to awful.  The food is very good across the board and reasonably priced. Great atmosphere and semi view as well."}
{"text":"Again like others, not sure why the negative reviews. I ate here three times while staying at the Weston and the place was busy and I couldn't have asked for a better experience. Staff, very helpful and polite. Food was really good overall. Every restaurant has its bad days and such.  In two of the three cases the manager was running about helping his staff, greeting guests and making sure it was all good. Perhaps a while back they had a bad run but fixed things?!   I think you are safe to give this a try.  Breakfast is great! For lunch/dinner...finally...someone that knows how to make a Ruben!!!"}
{"text":"We received free breakfast at Rick's Cafe since I am a Platinum member with Starwood.  The staff was super friendly and quickly brought us our drinks as we visited the breakfast buffet.  The buffet was nothing special, but had all of the basics.  Luckily our breakfast was complimentary as the buffet was pretty pricey for what you actually get."}
{"text":"Hair in food and it wasn't mine...., enough said!!!!!!service was at a snails pace. Here for 4 days and will have to avoid this place!!"}
{"text":"Cool coffee shop with a great view of the street. Outside seating is available too now that it's summer.   Had the hottest (literally) cortado ever here and it was great. No fancy milk designs but the coffee was decent and so was the price ($3.50). The baristas were friendly too, and that's always a plus.  Not much of a selection for pastries or baked goods (just banana bread and brownies) but they do do sandwiches (as well as shakes and iced blends).  I'd come again."}
{"text":"So bit of a back story here, we stayed at the Westin in the new year, had a great time except at Ricks for dinner was less than perfect.  A manager reached out to me via email and apologized and asked for a chance to make it right, this was unexpected but nice. We have been planning this return weekend for a few months, emailed the manager to advise our dates and he confirmed the date.  The duty manager was told to expect us. The manager on duty David was on the host station, asked for my name, which I thought might prompt a response, but nothing.  He sat us and walked away.  We asked our server to get the duty manager, David appears again.  I said who we had been dealing with and that you should be expecting us, he said yes I'm aware, which was a little odd. I ordered the soup of the day which sounded nicer than reality, it had a swirl of oil, I think olive oil on the soup, over powered the soup for sure, I'm not a fan of oily soup so I only ate a few spoons of it.  Server asked if I did t like it, I said no it was really oily, he just nodded, smiled and walked away.  My partner had the calamari which was nice, crispy and lightly coated. Next we were served a side salad that was drenched in balsamic dressing, mine also had a piece of chicken and skin in it, when I bought it to the servers attention he said it happens sometimes.  Well I'm lucky I'm not a vegetarian. We both ordered rib eyes, mine well done and Johan's med well, as soon as they were delivered I said to the server oh that's not a rib eye that's a NY Strip, he went to get the manager, mine was a rib eye, round in shape, well marbled fat content, Johan's was long and thin with the thick fat cap running along the edge.  They tasted totally different as well.  Manager appeared, arms folded already defensive, he said that he spoke to the chef and he said it was a rib eye.  I asked him if he knew the difference? I said this is clearly a strip, they both look totally different.  Could not believe he stood there arguing over something clearly he knew nothing about.  He asked if Johan wanted another rib eye, \"although that's what you have\" we just left it. Meal was served with mushy veges and dry mashed, needed a gravy or butter.  My well done was dry and not juicy.  Texas Roadhouse cooks a well done rib eye that's juicy and half the price.  Johan's NY Strip was rare, not med well like ordered, his steak was sitting in blood like the photo shows. Not once did the server check in on us, not during the apps or the entrees.  Manager David was nowhere to be seen for most of the night. Realizing the meal would be comped I needed to leave cash as a tip, so I excused myself to go find and atm.  When I returned Johan was sitting at the table looking livid.  I asked what was wrong, he explained that David had come over to the table with 2 cuts of raw meat, to show us the difference between the cuts.  Had our steaks still been there it would have only proven he was wrong. I've been a server, chef and restaurant manager and know my cuts of meat, both visually and by taste, what's more, David's clear lack of professionalism, not checking on any tables was outrageous.  The photos clearly show the wrong cut of meat, don't argue with your guests in front of other customers. I'm leaving angry and disappointed again. Given this 2nd chance and they screw it up this badly, very disappointed."}
{"text":"The tea smells wonderful and there's something about a shop that includes tax in its prices. Really quite simple, also LOVE the books up front. Quite quiet on a friday afternoon, granted that it is raining and bloody cold outside. There are tons of quirky little artworks, and if youre like me who likes to stare at them or draw, its perfect. The music is nice and relaxing, perfect to study too. Owner is also really friendly and tend to sing along (which I dont mind, its nice seeing people have fun)  Got the after eight tea, which was heavenly aromatic.  Though they do have a nutella milk shaKe which Im for sure going to try next time!"}
{"text":"First, this is a really beautiful hotel with a difficult history only because of its location. For a very reasonable price, I highly recommend staying here for the recreational activities, pool, beach and restaurants. Room rates are amazingly reasonable. Rick ' s is the more casual restaurant in the hotel and the menu is affordable. The buffalo wings and fries were plentiful and tasty. The fresh fish sandwich was indeed really fresh fish and delicious. Chinese chicken salad was very good but the beet salad could use more beets. Total for 4 with drinks with tax and tip was under $100. We would go again."}
{"text":"Staying at the Westin you would expect this place to be a bit pricey. Had to send the chicken back since it was undercooked. But my burger was pretty good. Tomato soup was pretty damn good though. We decided to take dessert up to our room so ordered the chocolate lava cake. Waiter came out with a big box, how disappointing when we opened up the box. MAYBE a serving for one. How underwhelming. Don't think I'll be back again for the prices and what I was given. Waiter Alejandro was really nice though."}
{"text":"Ate at Rick Cafe over Veterans weekend. We tried their breakfast buffet. So good. We had an awesome server...I want to say Matt. I hate that I can't be confident on his name. I had gotten married the night before at the resort so we were definitely hungry. Let me say...all my guest that ate at Ricks left more than full but happy. Omelette lady did a great job of not overcooking the eggs. Southwestern omelette was delish. However need to over tortillas and not just bread items. Sorry only slight complaint. However would return and absolutely love Ricks."}
{"text":"The 2 stars is only for the great service.  The workers are very nice and friendly.  I was staying at the resort for Memorial Day weekend, and ate here for the breakfast buffet.  For 4 people we had to wait for 30 minutes.  The place was packed.  We all had the breakfast buffet and it was terrible.  Everything did not taste fresh accept for the omelette bar.  I would definitely not do the breakfast buffet again"}
{"text":"Just got back to my room after breakfast at Ricks. I expected the food to be ok, it is pretty hard to screw up breakfast. John was my server, was super sweet.  I ordered the three egg omelet with spinach,tomatoes and cheese, and fruit. The menu also says it comes with toast. John did not write my order down, I almost called him out on that, but I didn't so this is probably my fault. I was brought an omelet with spinach, cheese and mushrooms. Again, I like mushrooms, so I guess it wasn't *that* big of a deal. When I asked John about the toast, he told me \"When you ordered the omelet, the system did not prompt me to inquire about toast.\" I also was not about to pay extra for toast, so needless to say, I never got my toast.  Servers should KNOW their menu, and write down the orders for accuracy :("}
{"text":"Looking for some quick dinner, my sister and I decided to just ask for a to-go order from Rick's. I ordered a flat bread pizza, and she had the tacos. We were told 15 minutes by the hostess. She took my last name down and room number. We didn't really wander because we didn't want to miss our food in the short 15 minutes. So we sat on the benches in the hallway, IN CLEAR VIEW of the hostess.   20 minutes pass, 30 minutes... 35. She hadn't called us yet. So I got up to ask. \"How much longer for our food?\"  \"OH, I was wondering where you guys went...\" as she grabbed our food from a table right next to the entrance.  I wanted to scream. Are you kidding me?! We were sitting in front of her the entire time. Not ONCE did she even TRY calling out our name. I was SO frustrated, but being in a upscale resort, I kept my cool. Instead, I just didn't tip because waiting 40 minutes is UNACCEPTABLE when we were told 15. Putting forth ZERO effort in attempting to find your customers is UNACCEPTABLE.  The food wasn't even that great either. AND it's expensive. I had much higher expectations for at least the service."}
{"text":"We're staying in west in for the weekend. Was looking for a place to have dinner with the kids. Ordered the ultimate burger, Cesar salad with chicken, chicken soup and mac and cheese for kids.  The burger is huge, 3 or 4 patties, all of them were overcooked and it was very dry. The salad was okay, nothing special. Mac and cheese was somewhat plain too. The soup was not that great either.  Definitely would not be going back again."}
{"text":"The Thanksgiving Brunch was excellent.  Wonderful service and high quality food.  The brunch included: delicious sushi, seafood, other Asian dishes, prime rib, lamb, turkey, ham, and all the fixings, salad bar, full breakfast buffet and an amazing spread of desserts.  Our waiter was prompt and friendly.  Overall, I highly recommend Rick's at the Westin at Lake Las Vegas."}
{"text":"The pizza is amazing! The breakfast Buffett is good too. They have an omelette and waffle station that could get backed up sometimes but is definately worth getting. The Dominican server, we believe his name is Jose.. He served us both in the restaurant and out by the pool later too! He was friendly, provided exceptional service and he always had a warm smile on his face! This guy certainly deserves a raise! I know I yelped the hotel and mentioned this but we really enjoyed our food. We had a turkey sandwich by the pool which was refreshing to have by the pool after being in the sun and some chicken strips which were good as well. The fries are crinkle style.. One day when we were by the pool we waited a while for our food so when we went to get it they gave us the wrong pizza but they let us keep it and made us a new one correctly! ;) thanks! Prices are up there but it's a resort so you'd expect that. Anyway thanks for the service!"}
{"text":"No wait, friendly staff, good food, nice décor.  What is not to like.  For a hotel restaurant, this place is good."}
{"text":"Be it breakfast or dinner you will love Rick's. It is located in the Westin and is just so good.  If they have the breakfast buffet while you are there, have that first. The service is great and all the items are perfectly prepared. Rick's is also great for dinner. We had some fresh fish, a burger and a steak. All was wonderful. The burger was cooked perfectly and the bun was great. I was not in love with the home made chips and will ask for something different next time.  The staff is great and if you are the hotel, get the room service too. You will love it."}
{"text":"Pretty nice and cozy café. The staff is nice and welcoming, not a lot of choices of food ( 4 sandwiches and 5 \"bites\") but everything is really good.  If you're fan of literature you can borrow or buy the one displayed in the entrance."}
{"text":"ICED NUTELLA LATTE.  So what if we already had a caffeine buzz from Jimmy's down the street?  Rick's iced Nutella latte really hit the spot on a hot day.  The employees are super friendly too.  This coffee shop is pretty small, but we perched ourselves on two stools by the window.  The window looks out onto the street, perfect for people watching.    And trust me, with that sedan flower planter parked in the street, you will see some interesting passersby.  Most will stop and take photos by the car, but I was entertained by the two dudes who looked like Biggie standing on the car and rapping."}
{"text":"Come on people... I just finished reading all of your reviews. You are at a mid-range hotel, so set your expectations accordingly. Admittedly I came on a slow night, but the food and service were absolutely terrific. Very fresh Ingredients and everything came out perfectly. The chicken sandwich was tasty (Excellent focaccia) and the french fries had a McDonald'sesque level of perfection. Come here with low expectations and enjoy the ride."}
{"text":"The restaurant and staff were wonderful. If it wasnt for a huge time wait for one sandwich and some chicken strips I would have given 5 stars. The food was a little pricy but the food was excellent. My wife and I split there gobble gobble sandwich (their take on a turkey club) very good as I am a huge turkey club fan. We also had the breakfast buffet which was awesome with an omelet bar and a ridiculous amount of choices."}
{"text":"We stayed 5 nights at the Westin and had the breakfast buffet included. I will give the hotel 5 stars but the food was terrible. Only the omelet was fresh, everything else was of poor quality. Asking $21 regular for the breakfast is a joke. The pastries were old  and from Costco, no sliced meets or cheese, overcooked and badly seasoned hot dishes and no selection of bread (only dry toast or two kind of bagels). The one star is for the friendly staff and the nice ambiance.   I can just recommend to book your stay w/o breakfast. It's not worth the money. If you want a decent breakfast go to the hilton next door. It's the same price and 5 star quality."}
{"text":"Solid espresso, friendly staff, great views & people watching if Kensington, free fast wifi. What else would one want from a coffee shop?"}
{"text":"Came for dinner last night, not expecting much. The food was decent but nothing special. What made the meal good was the service. From the extra helpful hostess to our server, they all seemed hospitable and friendly."}
{"text":"Visited Rick's Cafe a couple Saturday ago for brunch with the girls. I was at first skeptical from reading the Yelp reviews. What a huge investment to take the time to drive out there for a small breakfast buffet when I could easily have hundreds more options on the Strip!   I am happy to report I was pleasantly surprised. Here goes!   Upon entering the Westin Resort grounds, head toward the left hand side and you will start seeing signs for Rick's Cafe.   Go through some tunnel and down the stairs and viola!   Beautiful grounds and beautiful relaxing restaurant. The buffet area is inside this little dome/cave room. You will find fresh fruits ranging from strawberries to pineapples to various melons. Your typical canned peach accompanied with cottage cheese.   Moving down the aisle, you will find oatmeal and various toppings with your oatmeal. Cold cuts are next.   An assortment of pastries and toasts are available for your choosing.   You cannot miss the omelet/egg/waffle station. They even have egg whites only omelet - talk about fancy!!! They will do their best to accommodate to preparing your eggs. You can get waffles from them too.   Then there are your typical hot plates: bacon, sausages, corn beef hash, and a couple other things I can't remember right now, so it shall be a surprise to you.   Albeit the choices are limited, the quality was above average and enjoyable. It's all about the quality and not quantity here at the Westin.   The service was great; our coffee cups and water glasses were never empty. The beautiful ceiling to floor white Mediterranean curtains are absolutely beautiful.   If you are skeptical like I was about making the drive out to Rick's, then just take the plunge and do it. The drive out is scenic and once you get to Lake Las Vegas, the scenery gets better and better as you drive further in to the Westin.   One thing to keep in mind is that they do hold private events from time to time, so best to call ahead and make reservations. And don't be surprise if you have to call a couple times or wait for longer-than-usual for someone to answer the phone..."}
{"text":"We ate lunch here at the last minute. We split the wedge salad and a turkey blt. They split the two for us before bringing it out. The food was fresh and flavorful. We got champagne and margaritas. Margaritas were strong. Very good!"}
{"text":"We were very underwhelmed with Rick's.  It's a cool setting, very nice hotel, mediocre food, and decent service.  Altogether, it's 2 stars.  We ate a late breakfast on a weekday.  There were only 2 other tables in the joint, and one of those was finishing up.  We still had to wait a bit for water at the beginning, although I will say refills got better as the meal went on.  I had the breakfast wrap, which was a wheat tortilla filled with eggs, ham, onions, a little crema, and cheese.  It was served with salsa, which had to come out of a jar from the store, and pico.  The pico was homemade and a nice blend of tomato, onion and cilantro.  No heat, but good flavor.  I ate all of it and only had one bite of the salsa, which I imagine comes from New York City.  This comes with a side of potatoes.  They thinly slice potatoes, season them with a few herbs, and fry them.  But, it seemed as though the oil was not hot enough.  Some potatoes were fried very well, others were limp and oily.  Also, all lacked seasoning, I didn't detect any salt or pepper, and potatoes need salt.  This dish, if executed, would be solid.  But, it wasn't, so they weren't great.  The wife had ham and eggs.  It's a huge meal, very large piece of ham with eggs, 2 pieces of toast, and the aforementioned potatoes.  This was what you would expect.  Nothing to write home about, just a large average breakfast.  The prices are a little high for what you are getting, but you are in the Westin and it's a nice setting.  We had to sit there for some time to get our bill, that was an annoying end to the meal.  My 2 star review is not based on the prices, it's based on the food and service.  We may return, but I think it'll be awhile."}
{"text":"Attempted to have lunch here on a Saturday afternoon in August. It was just me and I waited a few to get seated. I was asked if I had a preference to indoors or outdoors and I said whichever is available first. I was sat outside with some interesting guests. About 10 or so BIRDS that were eating food off tables that had not been cleared yet. Yes Rick's, that's where I want to sit... with BIRDS. Not sure how long the tables had been sitting and honestly didn't want to find out. I got up and left. I'd rather starve.  That is completely disgusting and there is no excuse for sitting someone in the middle of all that. Shame, I was looking forward to trying out their brunch that I had heard was pretty good."}
{"text":"Decent food when other options are scarce. Stayed one night at the Westin (Sunday-Monday). I was really looking forward to trying Marssa, their Asian fusion / Seafood restaurant, but it's closed on Sundays and Mondays. Just my luck right? Started out my staycation a little peeved. My first meal at Rick's was during dinner time.  After looking at the menu, which is conveniently outside the entrance, I still had no idea what I wanted. It was basic. Salads, soups, sandwiches, burgers, flatbreads, and some other entrees. I was not in the mood to leave the property either and venture into Hendertucky. The hostess was super sweet and helpful and suggested the flatbread with mushrooms and beef tenderloin. It was yummy! Tender beef, lots and lots of mushrooms. Great sauce.   My second meal was the breakfast buffet, which was included in my stay. Normally, it's priced ~$20. A bit pricey and not worth it unless it's included in your stay. I honestly enjoyed the breakfast buffet. It's not gourmet or anything special, but I liked the variety of food offered. There's an omelette station, scrambled eggs, bacon, sausage, potatoes, pancakes, cereals, oatmeal, fruits, pastries, yogurt, and cottage cheese. The cooks at the omelette station can make you over easy eggs, which is what I got. I found out 2.5 plates later that they make waffles! I totally missed out on the waffles. Instead I had pancakes with boysenberry syrup. Yummy syrup, but sucky pancakes.   This is not one of those places you make a special trip out here for."}
{"text":"Nice lil coffee shop. Free wifi. There's stool seating infront the window to see the Kensington Market streetlife, and seating towards the back.   Customer service is good. They take credit cards, fyi.  I had the Nutella Latte. Tasted good, but not really like Nutella.  Its just a latte with a big scoop of Nutell mixed in."}
{"text":"Rick's cafe..... After a bad experience on our first visit here the Food & Beverages manager invited us back to give them a 2nd chance to make things right..... The manager on duty \"David\" had been emailed to expect our arrival.  With a last name that is not \"Smith\" there was no acknowledgement of our expected arrival simply a \"last name?\" \"room number?\" And an almost I'm bored with my job \"this way...\"   We were seated at a small table in the middle of the dining room at an adequately sized table for 2...  After confirming our arrival enquiring about the particulars of the \"Meal on us invitation\" there was still a lack of engagement. I mean not that I was expecting a red carpet and 20 wait staff. But nothing.... But a welcome back, if there's anything we can do.... Simply a \"Yes, I received an emailed that you'd be coming.  We ordered our meals and drinks...  James had a cauliflower soup starter, we didn't really get the olive oil swirl on top, other than looking cool it seemingly served no purpose. James had a couple of spoons, he didn't personally care for it, or finish the starter.  I had the Salt & Pepper Calamari with was tender and soft with a nice crispy light fried batter, artichoke, baby octopus, and peppers.  It would be better served with a couple of slices of lemon. The tangy calamari dip was ok, neither great nor bad, adequate.  Even though I enjoyed it, I did not finish the whole starter as I was eagerly awaiting our main meals. Ribeye steaks, one ordered well done, one ordered med well.  Our 2x Ribeye's arrived... 1 well done ribeye and one med rare NY Strip, yes a NY STRIP... Pointing out the clear difference to the waiter between the two cuts of meat, one rounded marbled  steak with fat throughout and mine the med rare fat strip like steak with no fat content other that to thick lining of fat running along one edge of the steak. Our waiter quickly disappeared into the kitchen.   David the manager came out after a short time with waiter, arms folded, ready for battle, proclaiming that he spoke with the chef and the chef assured him that he cooked the same two cuts. In-spite of David standing at the table and able to see the VERY CLEAR DIFFERENCE  between the two cuts of meat, David sided with the chef...  Are we not looking at the same plates here right now!? Are you seriously describing the differences between Ribeye's and NY Strips, describing perfectly the 2 different cuts of meat that were sitting in the two plates on the table in front of you and siding with the chef that stated he cooked the same 2 cuts?  Are you kidding me right now!? David just described what's on our plates.... Our two plates should look identical in every way other than the cook on the steak.  David dismissively asked me if I'd like my steak re-done. No, I don't... especially not after you side with the chef and argued the differences yet what your describing is what's in front of you on our plates...  I'm not even hungry at this point, just in total disbelief...  David then proceeded to come out to the kitchen to show me the 2 prices of meat in their raw farm proudly pointing out the strip of fat along the side of the NY strip and the marbling throughout the Ribeye... AGAIN YES as was on my plate and James' plate, only in cooked form...  What are we arguing here? I'm absolutely freaking beside myself in awe... What are you arguing here? Other than proving that we got 2 different steaks when we were suppose to get the same.............  What manager brings out raw steak to the dining room to argue HIS POINT IN THE DINING ROOM IN FRONT OF OTHER DINERS????????  I'm speechless....  Not even interested In going into the med rare cook with blood pooling on my plate when it was suppose to be Med Well, there would be no point.....   A dining experience I'd rather forget...  As for the redemption dinner to make things right from a bad dining experience on a previous stay....  FLUNKED THIS ONE BIG TIME....  Last point? What's with the hotel pool guests wondering aimlessly back and forth through the restaurant as if it is a hotel lobby?"}
{"text":"Thank YOU Kori Campbell for going above & beyond as the Westin Recreation, Food & Beverage Manager!!! You are a LIFE SAVER!! My husband is a disabled US ARMY veteran who needed to eat a hearty protein meal immediately so that he could take his meds while laying in bed. I tried to order a to-go meal by phone however since the Resort is so busy with multiple conferences -- such as Family Life's Weekend to Remember --  I could not even get through the phone line. So I walked to Ricks Cafe desperate to order food for my hubby. KORI took the time to personally walk me to 2 restaurants and order the burger for me to take to my hubby so he could regain his strength by eating in time for the next conference session. KORI, I pray God's abundant blessings upon you & your family. You are truly an answered prayer. Thank YOU!!"}
{"text":"Had a great experience for breakfast. The buffet was complimentary with our room which was fabulous. Our server John & busser Chris went above and beyond to make our meal that much better. Thank you!"}
{"text":"Love the ambience and the food!  We had the potato leek soup, chicken Paillard with a lemon caper sauce, lobster salad, and a side of lobster Mac and cheese.  My favorite was definitely the Chicken Paillard.  The service was horrible, though and our waiter seemed irritated with young kids, even though it is a family resort.  We chose not to dine here again the rest of our trip because of the service we received.  My 12 year old actually got up and had to refill her water TWICE!   So, work on improving the service because everything else was really good."}
{"text":"The breakfast buffet is decent if included with the room. They always burn the omlettes. Go early or everything will be overcooked. The layout of the restaurant is horrendous. The buffet burns you every time you open the lid. They gave away our table while we were at the buffet the first morning. We waived down a waiter and explained. He said okay and walked way. He didnt bus the table we were at (it was very crowded and we sat at a half dirty table :-/). We had to pour our own drinks.  The second time the hostess asked the manager if she could open the buffet a little longer for us. We had just returned from the toughest mudder. That was very nice of her. Then the waitress accused us of using the platinum buffet card from the table before us. She quizzed us on our last name. She then got upset when we asked if we could order food togo. After she assumed we meant take a togo box from the buffet, we explained we meant a separately ordered pizza. They brought the check and never took it back for the card. We had to waive someone down after 10 min. We also had to ask the hostess to get the pizza after another 10 min. It was ready and not hot.   Other things happened. Bottom line, be prepared to be treated poorly. I have never been treated like a criminal or poorly in vegas ever. One star for extending the buffet. We didnt use it and the waitress ugh. I dont want to talk about this anymore."}
{"text":"A-Okay.    Granted that I can only speak for the buffet in which they had had an all you can eat pasta/pizza deal going on during my stay.  It was primarily thin crust pizza, 2 types of pasta, salad bar and dessert area for $14.99.  mind you this was not gourmet anything but it was definitely good enough to go back for seconds and maybe even thirds.  Part of me now wishes that I would have opted for the regular menu but I'm a sucker for a selection and trying everything.  They offered a beer option for an additional up-charge ($5 if I remember Correctly) but it was limited to only one Sam Adams beer.  So I passed.  The Arabesque Lounge had a better beer selection and was only a few feet away anyway.  The actual buffet area was rather small but the dining room was fairly large, clean and had a very nice atmosphere to it.  The staff was fairly friendly too which always makes things easier.  Rick's probably wouldn't be my first pick for dining if it wasn't practically the only option but it is good enough when in a pinch.  I wasn't disappointed with my stay but I definitely wasn't blown away by the value or options of the place. You kind of have to expect these kinds of things from hotel dining option.  So it's A-Okay.  I'd probably do it again if in the same situation."}
{"text":"If you're looking for a great location out of the city the Westin has it going on. Ricks food is amazing we had the shrimp tacos and the bleu burger. Totally amazing some of the best we had! Our server Dominique and he was spectacular. We will return the drive to lake Las Vegas is very short and well worth the trip."}
