{"text":"I grew up in Pittsburgh eating at Rico's even before he was at his current location off McKnight Rd.  2 years ago Rico gave me a private room to have my wedding dinner party in.  When I was 18, he catered my high school graduation party at my house. The food is delicious and comforting, the bartenders are great and really know how to make a nice, big Pittsburgh cocktail, and it really does not get any better for authentic Italian food, considering Rico has lived in the country for \"I don't know how many years\" and still has retained his accent!  I love his entire family  - they are all talented, beautiful, caring and you can taste the love in the food - which is the best kind.  I miss you, Rico!"}
{"text":"I grew up in Pittsburgh eating at Rico's, and it's still the place I want to go to when I go to visit my parents. They have the Pittsburgh zucchini appetizer - I've never seen it anywhere else - of zucchini cut length-wise, very thin, lightly battered and fried, and it's perfect with just a little bit of lemon (although my mom and dad like it with marinara sauce and grated Parmesan cheese). The calamari are just as good and I dare you to eat just one!

Pastas are great, and classic - alfredos, marinara, tomato basil, and pink sauces, all of which are wonderful. Rico's has amazing seafood - strange for a restaurant so far from the ocean, but I would put the softshell crabs I've had here up against any I've ever had. Chicken and veal are also great here.

The one negative (and this is true of many otherwise wonderful Pittsburgh restaurants) is the quality of the dessert. Most Pittsburgh restaurants haven't bought into the idea of a pastry chef, and Rico's is no different. Skip the frozen Mississippi mud cake, cheesecake, and tiramisu, and head to Squirrel Hill (or home) for dessert."}
{"text":"The decor and the wait staff are extremely outdated. 

The food is mediocre at best. Small portions and not creative."}
{"text":"We just had our North Hills Newcomers and Friends luncheon at Rico's.  Everything was just wonderful.   The food and service were exceptional.  We chose Chicken Fontinella or Poached Salmon for our 53 members.  The compliments kept coming from those that chose either entree.  The potatoes were just yummy and great vegetable medley. and the Biscuit Tortoni!   David, one of the owners helped us in our time of great need, for that we will be forever grateful. (Ask him how he went above and beyond for us,  what a guy!)  As newcomers, it is so nice to find and support a family owned restaurant, especially one that has been so successful all these years.
Great job, Rico's!   Many members said they would be returning."}
{"text":"Great passion for the culinary business and Rico is a great person.  Take Don's photo off making the Caesar Salad - he doesn't know how to do it with the same passion. Put him in the banquet room serving water.   LOL :)"}
{"text":"Just ... meh.

The last time I was at Rico's was close to 20 years ago, and I can confirm other reviewers' comments that it hasn't been updated (ever?).  Really, that's too bad, because if the atmosphere matched up with the surroundings, it'd make a nice restaurant with a good reputation even better.

We started with the zucchini - yes, you've got to have it if you go to Rico's!  For my main plate, I had a special, swordfish, with spinach on the side - the markup for the spinach side was insane -- another $7?  That's like a whole box of spinach at Restaurant Depot!  And with the prices, the fact that salad is not included borders on unacceptable.  I had creme caramel for dessert - which was not very good, also outdated, and saturated with caramel like someone had too much fun with their squeeze bottle back in the kitchen.

Service was very attentive, even as it filled up over the course of the evening - I'd either show up kind of early or make reservations to make sure to get a table with views of the trees and not the internal room with no views.

Overall, I think that Rico's is coasting on its reputation instead of doing anything innovative, creative or interesting.  Updated food with slightly more reasonable prices would make me go back, and keep coming back, but for the time being, I wouldn't."}
{"text":"Food was adequate, menu very strange, limited and lot of seafood. I'm allergic so it was limited for me. Service was very poor. We waited until someone dressed in a suit finally brought some bread to the table. He never said a word to us. Waitress seemed very disinterested and not attentive.Only pleasant person was the hostess. Appeared to be a place for men and I think the owner came out and kissed some of them? Fish was good, but didn't have any garlic flavor. They must have run out. Potatoes were hash browns (with peas) but they never got browned. Salad was okay and the crazy part was blue cheese dressing would cost $3.95 extra. Are they nuts? Our first visit and the last one."}
{"text":"Great spot to treat your date to with awesome food an great wines an of course valet parking!"}
{"text":"Great local restaurant, owned by Rico Lorenzini, who used to be a chef for the now-closed Louis Tambellini's on Rte 51 and previously Mount Washington.  Sort of pricy, in my opinion, so go for lunch when it's cheaper or reserve this place for a special occasion dinner.  I really love the salad here, and try the fried zucchini as an appetizer.  Seafood ala Rico, the Virginia spots, and the scallops have always been good."}
{"text":"Amazing food and and the service was great! The front Blonde hostess was so sweet. I believe her name was rose something. She was so kind and got us in so fast. The food was excellent!!"}
{"text":"It has been years since I last dined at Rico's Restaurant. While visiting from FL over the holidays, I returned to my old favorite after my nephew's HS Basketball game. 
The appetizers were amazing! French Fried Zucchini, Signature Angel Hair Pasta. And Jumbo Lump Crabmeat were flawlessly executed. Owner David Lorenzini was warm and very friendly. The legendary Rico was eating dinner with David. I got to meet and speak with him. Exciting! 
Salads and entrees were also first class. Finished with Pittsburgh classic Pecan Ball with Hot Fudge. 
A great time in a Pittsburgh institution. 
I look forward to returning!"}
{"text":"Tuesday night I want to rico's with my  Family and I have a bad experience the waitress was so mean  The food was mediocre would never go back       Thank you waitress"}
{"text":"Update:  Unfortunately, I had to return due to family obligations.  I had hopes that maybe, this year would be different.  I could literally copy and paste my review from last year.  We had the same miserable server and the same issues were had.  My favorite part of the evening is when she brought us 3 orders (which aren't cheap) of escargot and when we told her we didn't order it, she proceeded to argue with us.  She informed us that we had to have ordered it since she \"wrote it down\".  Another favorite was when, in the middle of taking our table's orders, she abruptly left.  We didn't know where she went until we saw her bringing salads to an adjacent table.  What?  Again, the food is too expensive to maintain staff on the payroll that clearly don't give a care about service quality.  I pray that I'm not stuck coming back here next Christmas.  

My family and I made reservations here for Christmas Eve.  I have worked many holidays and can appreciate that it can be challenging to be \"all in\" when others are able to be at home.  With that being said, it helps nothing to be miserable and acting as if engaging with customers is a huge burden.  Any questions that we asked of our waitress was met with attitude.  Someone in our party asked if they served an item and her response was \"you'll have to look at the menu\".  Upon arrival of our meals, someone in my group received something that he didn't order.  The waitress proceeded to argue with him about it to the point that he just went with it.  For a more expensive restaurant, I would have definitely expected a better quality of service.  I will not be returning."}
{"text":"Best wedding soup that I have ever eaten.  Even during construction the kitchen was producing delicious meals.

Great for special occasions ....

I would be wary of going there on a snowy day ... very steep twisted driveway."}
{"text":"I love old school, nostalgic restaurants.  In fact, I get a little teary-eyed when I walk into places like Rico's because it reminds me of having dinner with my Dad.  My fiance and I started off with a drink in the bar since it was Valentine's Day.  Bar service was slow in terms of acknowledging us at the bar as well as bringing us our drinks.  There were only 2 other people seated at the bar.  We were seated for dinner.  Service was very attentive--probably the highlight of the night aside from my glass of Nebbiolo.  We opted for table side Caesar to start.  Hellloooo garlic.  Yowza.  I love a good Caesar but I still tasted the garlic 7 hours later when I brushed my teeth.  We ordered the Roquefort filet and the Chicken Piccata.  The filet was good, not great.  The Chicken Piccata was the most disappointing thing I have ordered in a restaurant in years, and I LOVE chicken Piccata.  The chicken is poached and STARK WHITE in color.  Not appetizing-looking at all and it was extremely bland.  Had the capers not been on the plate it would have had no taste at all.  The saddest part was 1/3 of my fiance's baked potato had a huge black section on it.  He grew up on a farm, and he recognized it as a big block of mold in the potato.  How could that happen?  The side of pasta with pink sauce was just okay.  In all, we were very disappointed in our experience at Rico's and it pains me to say that because we were so looking forward to having an old school, special dinner together.  Major bummer.  Valet parking was excellent."}
{"text":"Ricos is a wonderful example of a restaurant that knows it's cuisine and customers. Quiet dining in multiple rooms. 
Their angel hair pasta with pine nuts is exceptional and a wonderful appetizer . Also not to be missed is the zucchini as well as the banana peppers.
All of their specials are fantastic especially if they have Wall Eye Pike and Virginia spots.
And for dessert a true pecan ball with real hot fudge or caramel. 
We have never been rushed and have been promptly served.
Rico's is a special restaurant indeed."}
{"text":"Rico's is one of those restaurants you've heard about from days long gone. A throw-back to the days of impecable personal service that includes Caesar Salad made tableside. Where the restaurant manager still stops by your table and engages you in conversation. I simply must take a moment to thank Lisa Rose, a beautiful hostess that prepared our Caesar Salad. It has been years since anyone has prepared a salad that was so very enjoyable. And thank you to Dave, the Manager for his attention and conversation. we were ingoodhands. we all look forward to returning soon."}
{"text":"As soon as I walked in to the bar area the aroma of the restaurant told me this is the place.  It reminded me of old favorites like Poli's, Tambolllini's, Franco's (back in the day), Pasta Piatto, all gone now.  Rico's.  Thank you Rico's.  I had the Va Spots and angel hair with pignoli nuts... last night and today.  Nice portion. Sadly, none of my friends wanted to split a Caesar salad.  Next time I'll just get it and take some home for Sunday dinner.  Mmm..... the aroma...."}
{"text":"We ate in the bar which I loved during the week.  No kids running around screaming....nice and quiet with an older clientele.  I had the walleye with crabmeat.  The lemon/butter sauce was light not heavy.  The veal was like butter!  Very tender and a good size portion.  I really liked the house salad dressing which is a flavorful Italian that isn't over-powered with garlic or vinegar.  The tiramisu and carrot cake were good too.  The waitress, Diane, was terrific.  The prices are a little high but worth it."}
{"text":"Ran a little late to our reservation at 9pm by 8 minutes. 

Place was deserted, but there was another table there. 

Felt rushed by everything especially if we see and heard the OWNER of the restaurant rushing our servers, Janice and Don.

Bread was not fresh. 

Caesar salad was fresh as they make it right next to your table. I enjoyed it.

The shrimp Alla Rico? Was alright. I should of gotten the scallops. 

French onion soup was good.

The surf and turf was amazing! The lobster was so sweet, to die for.

This was my first time eating veal and it was alright. It was kind of plan for my taste.

Our food came out and some of our members lost their appetite as they saw the owner rushing the servers so we had to pack our food Togo and get out of their hair. Our food came around 950. We asked for the check at around 10:15. 

Janice and Don was great though. Thank you for the experience! 5 stars are for you guys. 

One star is for the owner displaying such behavior literally two steps away from our table which was totally awkward."}
{"text":"The cesaer salad prepared at tableside was the best in Pittsburgh. All of the food was served on time, hot, and delicious. Will go back often. Dining experience was worth the higher prices."}
{"text":"My favorite restaurant of all time! Hands down. 

Classic Italian meals, great wine, intimate & family-friendly atmosphere.

Francis is always our waiter - outstanding service. He's so friendly and does everything in a timely manner. 

I usually get the surf and turf. The Rico's pasta is also unreal.  

Donny always hooks us up with the best wine every time we go, too!

The bartenders are the best, as well. They will make you whatever you want! 

10/10."}
{"text":"The veal lorenzini was outstanding! Have been here many times and the food is always fantastic. Would definitely recommend , and there it is a storied history (ask Tom r). Virginia spots are as good as any bodies."}
{"text":"Thanks to my cousin Ralph for taking us here, and though he's a regular here, I believe we still would have received the extremely fine customer service. While I was a little disappointed in my own choice (the prosciutto overcooked into ham, & it had been a long time since I had veal and this tasted more like pork, a little dry) everything else was excellent. The zucchini appetizer the best zucchini I've eaten in a restaurant, thin thin slices crisp & cleanly fried. Table side Caesar a fine show and tasty. Can't escape the classy, nostalgia of the place. the excellent open architecture. Angel hair with creamy garlic, pine nuts & crab. Wide noodles with white sauce & huge scallops. They even threw into our take home (lots of rich food) a couple pieces of chocolate lava cake for my cousins anniversary."}
{"text":"I am partial to these \"Old School\" Italian places.  If I could have one meal in this world it is Rico's Surf and Turf, a Rico's salad, and a side of garlic spaghetti.  It is my favorite place in the city."}
{"text":"Lunchtime at Rico's.  Had the Pork Marsala and Virginia Spots.  Both were delicious.  Bread service is the best around.  Our server was excellent."}
{"text":"Food was high quality, sensible purchases. Service was awful. Had large table late in the day for Mother's Day, 11 top. Had to beg, ask for refill of ice tea and water. Good was salty anyway, so to have to ask for iced tea and water was just low class, considering the prices. Frustrated that I had to sip on melted ice chips."}
{"text":"My brother utilized their services for a small family reception after a funeral.  They worked well in planning menu (even make quick offerings for kids) with him.   Food and service were extremely good; private setting was relaxing.  I highly recommend them for such services."}
{"text":"Our wait staff was extremely rude. The calamari was heavily breaded and overcooked. The oysters were frozen and one of the servers argued with my relative about it. The cheese on the French onion soup sunk to the bottom of the bowl and was extremely tough and rubbery; I had to eat it with two hands because it wouldn't pull apart with utensils.  My partner's fettuccine alfredo was served with spaghetti instead. I would not recommend this place."}
{"text":"Rico's menu, excluding the prices, of course, is from a 1960s upscale Italian restaurant. It features all of the veal, chicken, pasta, fish, and meat dishes you would expect. There is also a big, broad wine list. The food and service are good, portions large, prices high, preparations classic, definitely not trendy (although, totally out of character, the quality of the silverware would make you think you were in a Chinese buffet or hospital cafeteria). Frank Sinatra would be comfortable here; vegans, vegetarians, and gluten-phobes not so much."}
{"text":"WOW!  I would give Rico's a five star rating if their desserts were better. There's only two house made desserts.  
If I were able to give 4 1/2 stars I would. Rico's is a classic Italian restaurant with very high-quality ingredients, expertly prepared.  Do try the zucchini -paper thin, crisp and hot, they are delightful with lemon and Parmesan cheese.  I had the delicious veal piccata and it was perfectly cooked, tender and satisfying. My wife enjoyed the Pittsburgh fillet, charred on the outside and near raw inside. No bother !  Our wonderful server took it back and had them prepare it medium rare. Word to the wise unless you want a raw fillet, do  go with medium rare.  
We won't go here every night, but wow was it wonderful! A great place for a special occasion or a wonderfully old-fashioned, high quality Italian meal."}
{"text":"This was our first time at Ricos - it was a delightful experience! The restaurant feels like it's on top of a mountain and in a strange location, but once you get up the hill, your met with a private parking area and the valet! 

The restaurant is very large and classy with multiple rooms. The greeters are kind and professional taking your coat and escorting you to your table. There is a bar area and fine dining areas. The waitress we had was kind and prompt but not as helpful as I would have liked in choosing a meal. Other waitresses seemed more talkative and explanatory with the nearby guests. The ambience is very nice - calm, comfortable, and romantic. It definitely reminded me if an old school Italian joint.

The menu is pretty diverse with plenty of options - it changes daily. Remember it's an Italian steakhouse, so the options reflect. My wife got the broiled seafood platter (fish, shrimp, clams, oysters, scallops) that was coated in bread crumbs and butter, a side salad, and Brussels sprouts and I got the 12oz peppercorn steak with sautéed hot peppers in tomato sauce, a twice baked potato, and side salad. My wife enjoyed her dish and I thought it was tasty too. My steak was tasty, but was a little more done that I requested (I asked for med.). The sautéed hot peppers were outstanding - very spicy. The twice baked potato was very dry - I had to add my own butter. I ended up dipping it in the steak juices... Bread was brought out before our meals, but it was hard and so was the butter - it was average. The salad was great.

We each got coffee and dessert, wife had creme Brule and I had the chocolate fudge cake - creme Brule and coffee was just ok, the cake awesome.

All in all my wife and I were pleased with the taste, quality, and portions of our meals for the price ($2 for a side salad that was larger than expected and tasty!). I'd say this place is less pricey than other similar \"fancy\" restaurant without sacrificing quality - all that food for $108. I definitely recommend Ricos and plan to go back."}
{"text":"Very friendly service and great food.  The wine selection is very large and the owners son, Dave, was very friendly and helpful in wine selection.  Would definitely recommend Rico's."}
{"text":"A Justifiable Rave Review to Whet Your Appetite @ Rico's Gangbusters Italian Restaurant in Pittsburgh, PA
According to others I'm someone considered relatively a gourmet rather than a gourmand, and invariably one who carefully discerns the number and types of restaurants most worthy of a personal review, e.g., on Yelp, TripAdvisor and Facebook.  Justifiable kudos and two thumbs way-way-up, therefore, extend to the entire graciously customer-oriented and very professional staff at Rico's restaurant an iconic fine Italian restaurant in Pittsburgh.  Why?
My spouse and I and our immediate family had the distinct pleasure of dining at venerable Rico's on Christmas Eve. [12-24-2017] My first visit to Rico's was a considerable number of years ago, and this was my spouse's first memorable treat.  Whether you're a native Penguins, Pirates or Steelers fan, or a first-time visitor to Pittsburgh, therefore, please make it a point to treat yourself to dine and imbibe at Rico's restaurant because we feel confident you'll be pleasantly satisfied and pleasurably satiated with Rico's scrumptious restaurant fare and thirst-quenching libations.
During dinner hours after you drop-off your vehicle with the attentive valet parking attendants as you enter the vestibule at Rico's there's a panoply of photos on the walls replete with numerous prior Rico's diners who are/were celebrities or sports stars an added substantiating testament to the popularity and successful longevity of Rico's.   For your added convenience often there's also a cloak room attendant greeting you very invitingly with an infectious smile just to your right after you enter the restaurant. 
Our entire party was greeted most warmly by Mr. David Lorenzini, plus Don, Rico's affable and proficient Maître d, and Tiffany one of Rico's very charming baristas who pleasantly prepared Christmas Mimosas for most of us. 
Shortly thereafter we were promptly seated.  After exchanging pleasantries with our delightful and very proficient and professional server Dede and Don, we initiated our dinner with memorable appetizers consisting primarily of escargot and lump crabmeat Hoelzel accompanied by plentiful warm rolls and butter.  Next, we all thoroughly relished very thinly-sliced fried zucchini squash sliced lengthwise accompanied by tantalizing marinara sauce served on the side.  Afterwards, we had a memorable Caesar salad that Don deftly prepared from scratch table side with his usual utmost pizzazz and aplomb,
My spouse savored a delicious swordfish steak with garlic butter and capers sauce, plus I chose a generous portion of plump sea scallops a la Rico topped with garlic butter and bread crumbs all perfectly cooked scrumptiously to perfection. We each also had a mouth-watering side of Rico's signature creamed angel hair garnished with pignoli nuts plus spinach.
Throughout our meal we imbibed very delicious Cabernet Sauvignon wine.  Just prior to our ordering desert, attractive and very personable Lisa Rose an integral key member of Rico's very customer-oriented staff also stopped by our table to say hello and to wish us a very Merry Christmas too.  For dessert we had delicious classic pecan balls with hot fudge and caramel and a moist carrot cake.
Bottom line:  Please make it a point to visit Rico's whenever you're in Pittsburgh.  Predicated upon our thoroughly delightful dining experience we respectfully believe you'll agree you'll not only be captivated with your dining experience but Rico's surely will also exceed your most discriminating expectations.  Each and every member of Rico's staff makes you feel as if you're the most important person in the restaurant.
Fred Harden III 
San Diego, California
P.S.  Constructive suggestions/comments for patrons of Rico's:  Rico's normal business hours are 11:00 a.m. to 10 p.m. six (6)  days per week except Rico's is closed on Sundays, [Open Mother's Day] On festive holidays such as Christmas Eve, however, Rico's is (officially) open from 2 p.m. to 8 p.m.  Last year on Christmas Eve it was very crowded during the evening; thus, this year our party opted to dine earlier commencing around 4:45 p.m.  Accordingly, to facilitate a win-win situation for both Rico's patrons and Rico's entire dedicated staff who certainly are also entitled to spend some quality time on Christmas Eve and other festive holidays too with their friends and families, patrons of Rico's may want to opt to dine earlier than usual to ensure that everything runs smoothly because when we exited Rico's around 7 p.m., e.g., there was still a throng of people waiting to be seated for dinner. In all probability, therefore, many of Rico's Christmas Eve patrons finished their meals later than 8 p.m.
While Rico's caters to all groups, the core clientele especially during holidays is predominantly gentrified so proverbially \"When in Rome do as the Romans do,\" and while it isn't absolutely necessary to dress to the nines dress comfortably yet appropriately."}
{"text":"Service at the bar was very poor. 
Appetizers were soggy and greasy. 
Salad was made with old lettuce. 
Seafood was cooked to a rubbery texture as was the pasta. All sauces were bland. 
Really wanted this place to be better, so bad that it's just not worth another shot."}
{"text":"I give it a 3 for decent food and nice servers.  However it is over priced and the food isn't better than other places that charge less. If you are not splitting the check your be charged an automatic 20 percent tip, no one should ever determine how much you pay for a tip unless your in a large party. This I found to be ridiculous. Also you must use the valet parking for dinner and there is no reason why you need to when there is a large parking lot."}
{"text":"Wedding Rehearsal Dinner was a success. We had a private room and were acutely attended to. The four-course meal was filling. I could have stopped at the penne dish and been full. Dessert was the best part - cheesecake!"}
{"text":"One of my all time favorite restaurants. I've never had a bad meal or bad service. Me and my family have been going here for as long as I can remember.  We celebrated every major event at Rico's.  Highly recommended."}
{"text":"This is by far my favorite Italian restaurant in the Pittsburgh area.  I have been here many times over the years, last time was for a retirement party and the buffet was fabulous but I hadn't been back for dinner in awhile to enjoy the entire dining experience.  We were greeted by Rico, David (Rico's son) and the lovely and beautiful Lisa Rose who was warm and friendly throughout the evening.  Everyone makes you feel as though you're the most important diner in the restaurant.  The drinks were perfection, the zucchini appetizer and marinara delish, and I've tried everywhere, the angel hair pasta with huge chunks of crab and pine nuts haven't changed in years and it's the best.  Three of us ordered the broiled seafood platter, I'll have to post the size helping but more importantly, the quality was outstanding.  I mentioned quietly that our pasta had gotten cold as we dug through the seafood.  I swear the waitress appeared within a minute and said your pasta is cold so I'm taking it all back and bringing you fresh.  Really?  Do the walls have ears?  The servicer, Natalie, was amazing checking frequently to see that everything was perfect.  This old school Italian restaurant, with beautiful landscaping, is still one of a kind.  I will always go back.  We are all of Italian and Middle Eastern background so you can imagine we're foodies and if we're leaving elated, you deserve the highest rave reviews.  One to five stars...they are 6 stars plus."}
{"text":"This was my 2nd time at Rico's and there were 5 of us in total.  It was a busy Saturday and the waitress was a bit overwhelmed.  The food was superb as was the first time.  The thing keeping me from giving 5 stars is that the waitress wrote in an 18% gratuity on our check; actually hand wrote it in and she calculated the gratuity on the total which had the tax included.... And she wrote in the total as well.  This makes a big difference when the prices are higher.  Was it just this waitress or is this policy at this restaurant now?"}
{"text":"My husband and I went to Rico's for the first time last night for our anniversary.  We live right down the street but never realized what a gem we have in the North Hills!  The atmosphere is like walking into Goodfellas. Don greeted us at the podium and literally became a friend by the end of the night.  The food is out of this world!!  We had the ceasar salad for two ( which is tableside created by Don of course) ..best I've ever had.  I had the Walleye stuffed with crab meat and hubby had the lamb chops.  Unreal.  Their wine selection is on an IPAD, which is a cool way to look at their huge selection.  At the end, Don gave us a tour of the restaurant.  We felt like real VIP's there.  I can't want to come back with our friends and family.  Thanks Don!!"}
{"text":"This place is always amazing! I've never had a bad meal, bad service, bad experience! Worth every penny."}
{"text":"We had dinner there last Friday, broiler scallops were awesome and even better the next day as leftovers.. And I can't stop raving about the Caesars salad!!!!! Great place"}
{"text":"This was the first time my fiancee and I dined at Rico's (Friday, 3 November 2017).  The offering of only valet parking is a drawback for me and something which I do not like. The patron gets off to a great start with the welcome that is received from the distinguished gentleman host. The restaurant is enormous, attractive, comfortable, and elegant. The standout of the entire staff is host Lisa Rose, who immediately caused us to feel that we were with a friend.  She is a dynamo: charming, gracious, friendly, smiling, and ingratiating, one of the finest people I have encountered in the hospitality industry.  The restaurant is elegant and comfortable.  The policy of not taking reservations was not a problem, given the large seating capacity. We were seated immediately. Unfortunately, we were placed between two loud parties, including one with about eight guests whose members had no idea that their talking over each other could be heard throughout the restaurant.  Our server, Francis, has an accent, rendering him not easy to understand, but he is a consummate professional: gracious, pleasant, attentive, and knowledgeable.  Our food was delicious.  We were taken aback by the high prices and the fact that dinners do not include side dishes or salad.  The gentleman who prepares salads tableside was loud and was overheard talking about menopause and diapers as he prepared a salad for the loud couple next to us.  Our fried zucchini, veal parmigiana, and pasta rotolo were delicious and portions standard size. Our glasses of wine were enjoyable, but tiny for the $8 price. We were not bowled over by the bread and roll selection and these should be served warm in a restaurant of this stature: they were not. Soft whipped butter would be more appealing than hard pats of it.  We were taken aback by the high prices, significantly greater than two of our favorites for this type of cuisine: Scoglio and Franco's Trattoria.  I dine at a wide variety of fine restaurants.  I have never before encountered one which charges $4.50 for blue cheese or gorogonzola dressing, more than twice the price of the salad when ordered with a dinner.  I realize how fortunate I am to have Franco's in my community, where I can make a reservation and for $17 receive a huge portion of delicious chicken parmigiana, large bowl of chicken pastina soup, large side dish of daily changing chef-inspired mashed potatoes or pasta, and an assortment of Breadworks products served with whipped butter.  Additionally, Franco's offers many opportunities throughout the year for 10% off or more when one purchases gift cards: unbeatable.  As we departed, I stopped at the host stand to tell Lisa Rose to tell her how enjoyable she made the evening for us and how wonderful she is: she was deeply touched.  She walked out to the foyer with us and told us how we had made her day.  She asked my fiancee her name and hugged her.  She left us glowing."}
{"text":"Also visited with a different group of 13 on New Years Eve 2013. Stopped in my tracks when I saw the menu prices even after having recently returned from a week of eating the signature restaurants in Walt Di$ney World.

Service was slooooowwww. Reservation were for 7:30. Sat down at 8:00. Received menus at 8:30. Appetizer order taken for two people at one end of the table at about 9:00 but the rest of the table was ignored. Entree order taken about 9:30. Food arrived after 10:30. Ouch.

Waitress said there were 3 stuffed peppers on the appetizer plate so we order two of them to cover the six of us wanting one. When they arrived about an hour later there were two per order and this was explained that the kitchen changes things at whim. Waitresses were generally not pleasant.

The food was generally fine, but by no means worth $32-$58 per entree for ONLY the protein and one side (vegetable or potato), and nothing special. Baked potatoes were undercooked. The so-called 'supreme salad' was an up charge for a small house salad with a slice of cucumber, one olive, an one tomato wedge. The least expensive entree was a $31.95 pasta dish.  To be fair, my $35 cajun swordfish was nicely cooked and seasoned.

The owner/manager was everywhere trying to placate what appeared to be generally unhappy patrons. While we waiting for our table we overhead the manager confront more than a few patrons leaving in the lobby asking why they left such small tips--after our experience we knew the answer to the question.

Wine prices were steep (typically $13-15 a glass) and soft drinks ($2.50) each included only one re-fill. The table bread was generic rolls.

Not impressed at all. Sky-high prices for middling food and mediocre service. I would avoid this place. For about half the prices consider nearby Mediterraneo or for a true splurge there are better options."}
{"text":"This is the epitome of old school Italian. From the moment that we pulled in the driveway, everything about this place makes you wonder if Tony Soprano is going to walk around the corner. Most of the cars in the parking lot are Cadillac, the host knows most of the customers by name and most of the dishes are traditional Italian dishes. The food is delicious and you don't have to worry that the chef has a new interpretation of chicken piccata. They do traditional Italian really good. If you used to go to the Primadonna on a regular basis, this place makes you feel the same exact way. However, this place is not infant friendly. They have booster seats but no highchairs. The prices are also good, just a little more than chain restaurants but so much more delicious. As soon as my kid can sit in a booster, we will be here on a regular basis."}
{"text":"Pittsburgh rare my favorite.  Although the steak was cooked to perfection it seemed a little tough.  I did expect more for a $45.00 steak.  A bit over priced for the decor but all in all the meal was acceptable.  My rating will be based on others within the same price range."}
{"text":"I find it unimaginable that no one has reviewed one of the signature Rico's dishes...that angel hair pasta with the crab meat in the white sauce with pine nuts.  It is really not to be missed, and so good.  We went last Sat evening while on a brief trip to Pgh, and this was the Rico's I remembered, everything was really delicious."}
{"text":"Rico's was top notch!  My mother recently passed and she insisted on a \"PARTY\" - so I planned a party at Rico's in Pittsburgh from my home in CA.  I definitely could not have done it without the guidance and expertise from David!  He was able to find just the right wine for the banquet, talk me through an delicious, but not over the top menu and work with me on keeping my costs down without \"cheeping out\" on anything.  Every team member was so professional, kind and made an effort to be invisible.  Once I walked in and the banquet started, everything was handled without my guidance and I was able to enjoy!  The food - Oh!  Appetizers were fabulous.  My favorite was the Zucchini Fritti - so light!  Some in my party commented that the Filet was the best they ever had.  My Eggplant Parm was amazing and HUGE!  As well the Caprice salad was fresh and sizable.  
Thanks Rico's, David and the entire team for sending my Mom out with the party she deserved!"}
{"text":"Nicest place by the Hampton Inn.  Busy. Got seats at the bar.  Do not mistake the older valet guy for a patron. He wears a yellow polo shirt and didn't really acknowledge us as we were in the motorcycle. He wasn't going to valet that :) 

Food was served at a decent pace.  Bill was more than fair.  Bartenders were great! Love a good Italian place on a road trip."}
{"text":"I was here last night for the first time in ten years.  This place is so Pittsburgh.... which is a good thing.  It's definitely \"old school\" with the average customer twice my age, but I liked it.  I first visited this place about ten years ago when I was starting my career and I remember the veteran guys I was with having dirty martini's with there five course lunches.  I remember at that time thinking \"I'm gonna love this career\".  They have probably the best ceasar salad in town prepared tableside.  Last night we only had a few appetizers at the bar, but they were very good.  The food begins with a nice selection of bread.  It was nothing special, but good quality.  We sampled the crab hoezel (sp?).  This was several large chunks of lump crabmeat with lemon and butter.  The price was very reasonable ($14.50) for the large amount of crabmeat.  We all enjoyed very much.  We also tried a calamari and sausage appetizer.  This was surprisingly good.  It was not fried and it was served with a delicious red sauce.  I was really impressed with this traditional appetizer.  We also had the fried zucchini which was lightly fried and quite good with a little red sauce and a bit of parmasan.  The bartender was really good and professional. One of the things I like about this place is that the staff are pro's and not just college kids working until they find something else to do.  I probably should give this place four stars, but it really is in need of a remodeling of the interior.  The interior probably is the same as when the doors opened 30+ years ago.  The owners son also came over and visited with us.  He was really nice and certainly made you feel at home.  This is a good place.  Take your parents.
\""}
