{"text":"Terrible service - once loyal customer, will never return. If I could give this place zero stars, I would."}
{"text":"Me encanta aquí! La comida aquí es autentica y rica."}
{"text":"I love the fast service, especially during the lunch  hours. However , the closer to closing time the worst the food is . The chicken, beef, pork, and potato dishes are cold and not very tasty. (this is for pick up only)   I have eaten here 4 times for dinner, with the large generous portions especially for the price, however the execution was poor at best, again their meats ( especially pork) are cold, dry, and tasteless. My favorite items to get are the moon pies, and the rice and beans are killer!   Overall the experience is not a positive one. There are definitely better places on the west side of Cleveland."}
{"text":"I've only been to Rincon's twice, but I will be stopping back anytime I'm in Cleveland. Their Red rice/beans with fried pork chops are exceptional. I also really liked their chicarrones, empanadas, and fried potato balls. If you're looking for good Puerto rican food, this is the place to go. Just like Grandma used to make. (I felt the need to create a Yelp account just to give this place a good review!)"}
{"text":"If your not in a rush greatt food best puerto rican food in cleveland. Service was great  plenty to choose from and fried pork is awesome"}
{"text":"Some of the combos were not too exciting.  Yep, kinda bland.  The jibarito (steak sandwich between slices of fried plantains) was tasty and I'd order that again.  Good for lunch or a small dinner, if you're not as hungry.  Our server was good and attentive.  We let him know that we were watching a movie at Capitol Theatre and he got us out with plenty of time."}
{"text":"Me: White, married to a Puerto Rican. So this is a review from someone who was introduced to PR food a few years ago.   Atmosphere: This restaurant is great when you just feel like having some good   spanish food. The restaurant is small and has a \"neighborhood\" feel to it. Not fancy at all. Not someplace you would take a date.   Food: The food is very good and you get large portions. About 10 bucks for a platter which will stuff you.   Service: The service is kinda slow, but it's not bad enough to get angry about. The food came quick though.    Overall: want some good spanish food? go here. Want to go out to a nice restaurant for dinner and drinks? Don't go here."}
{"text":"I am not a expert on Puerto Rican food, but this place was good.  I enjoyed the shrimp mafongo, but it was really rich.  The place seemed to really encompassed the Gordon Square area...A bit of a pleasant surprise where you really aren't expecting it. Really a good spot to check out before a movie at the Capital."}
{"text":"I love this place the Puerto Rican food taste like it was made at home in the kitchen ."}
{"text":"A neighborhood Puerto Rican restaurant run, as you would expect, by a family. The Ruiz's, Nydvia and Papo are the real deal.  Before I begin this review, let me say I am completely unfamiliar with this style of food. On the Dishcrawl, I expected a small sample - what each participants received was a platter of rice and beans, chicken AND a jibarito (a steak sandwich between slices of fried plantains)   When I asked her about the size, she said it was a sample. Okay then. :)   It was all tasty and looking at the menu, very affordable. Both Nydvia and Papo were gracious hosts and made everyone feel as if we were invited to their home - which I suppose is what it was in fact.   (four stars instead of five only because I am such a newbie to this food ... I'll have to stop back in to \"get better aquainted\""}
{"text":"I stopped by this restaurant last night because my son was very hungry and I needed something quick. I didn't know what type of restaurant it was but it looked warm and inviting from outside in the cold. I ordered a sandwich quickly and sat down. It was very good (yummy, crusty bread and ingredients tasted fresh) and the service was really great. The best part was that everyone in the restaurant seemed to be so happy (including staff). One of the waitresses (or maybe the owner?) took special care of us as we were leaving. It really made my evening. My son loved it too. I created a yelp account because that's how much I liked it."}
{"text":"Delicious, authentic food, super friendly waitstaff, really good vibes inside!"}
{"text":"Took my wife here for her first try at Puerto Rican food. Unfortunately, the waitress didnt pay much attention to us, and told us she couldnt help us with salsa, queso, or sour cream for our food. Her reason was that they were about to close. (We thought this was strange, as they were still sitting people and the sign said they closed in three hours.) Sorry. No bueno."}
{"text":"I had high hopes for Rincon and I even tried it out 3 times, but on all three occasions the food and service have let me down. The first time I went I got arroz con pollo and the chicken was cold and dry. The second time I went I had the same thing because that is my fav Puerto rican dish and again the chicken was awful and I had to wait 35 min even though I called ahead 15 mins earlier. The last time I went I had the fried pork belly and it was cold and had an off smell. So I am going to stick to Campus Grille for PR food."}
{"text":"Excited to get some spanish food, we decided to try this place since it's right down the street from where we live. After being sat we waited for about 10 minutes and no one came to great us or take a drink order. another table walked in. There were now 2 tables in the restaurant.  Seeing as the other couple was spanish and my girlfriend and I are white the other table was greated immediately and their drink order was taken. The waiter being right behind us could of turned around to ask us for a drink order, but no. He looked at us and walked away. We got up and walked out. We will not be returning"}
{"text":"I just ordered for the first time and all I can say is what the hell is this supposed to be I ordered rice and beans and pork chop I got mushy rice and and I'm sure this is a damn pork chop or not. It looks more like my pork chops shriveled up and died. What a sorry excuse for a Puerto Rican style restaurant."}
{"text":"My partner and I stopped here for nite to eat as his favorite Puerto Rican eatery had gone out of business.  We ordered rellenos de papa, deep-fried mashed potato balls with meat stuffing for an appetizer.  They were great!  Main course; he ordered a steak and I had fried chicken.  Both came with yellow rice and beans.  We were stuffed!  My chicken was a bit on the dry side, my only complaint.  But it was the end of the day, and they were due to close in 45 minutes.  The staff was very friendly, a definite plus.  Located in the \"Gordon Square\" neighborhood, I would easily return to this reasonably-priced establishment to eat again..."}
{"text":"Unfortunately my previous great experience apparently was an odd one. I have been several times after and the service just kept getting worst and worst. The waitress acts like they are doing you a favor and not like you are a customer paying to be served. They never seem to have a lot of the items on the menu, particularly the rellenos, which is the other reason why I decided to never take my guests there again. They scream at clients and treat them really rudely.   It is a lot like the experience of going to Varsity in Atlanta... where screaming and treating you like a misbehaved 3rd grader is part of the show.  Their food is good but the experience is so uncomfortable that I am not planning on going back."}
{"text":"I am a big fan of Puerto Rican food, and was happy to find this place.  It seems authentic, and our waitress was very nice and helpful.  However, the food was much greasier and saltier than it needed to be.  Also, my husband finished his entree before mine was brought out, and our appetizer came out even later.  The menu is somewhat confusing because certain dishes are listed more than once in different categories.  We won't return."}
{"text":"This place has Ah-MAH-zing roast chicken and rice!!! Oh my god. I was craving yellow      rice, beans, and chicken like nobody's business. I think this is the only place of its kind, at least on yelp.   It's not like the other Latin American listings, which serve burritos, tacos, pupusas, or arepas. This place specializes in rice and beans with the most succulent, greasy, tender chicken/pork/gizzards/or whatever you want. They have mofongo, sandwiches, and a bunch of other stuff too.  I am a real pig, so there weren't any leftovers. However, for a normal person, the portions are definitely generous.  Service was friendly and I really appreciated the family-feel of the patrons and the staff. Everyone seems to really like one another here.  Tip - minimum of $9 for a credit card."}
{"text":"I love the chicharron's and the mofongo. I love the bisteak and everything on the menu. Some time's the food is delicious and crave-able. Other times it can be disappointing, which is why only three stars. I order my bisteak in red sauce (which is normally served in a white vinegar based sauce) and several times I received a wonderful made to order dish. The last time I was there, I received tender steak sitting in tomato sauce and raw onions. I'm not kidding. I sent it back and asked for the regular bisteak in white sauce. Don't be afraid to send your dish back here, the server was very gracious about it. On this visit I tried my friends fried pork chops and it was the best spanish style chop known to man. So, this place is no doubt a hit or miss. Consistency is not a virtue here, buyer beware."}
{"text":"This place is clean, authentic, and upbeat. Public parking is in the back.  I wanted to love it, but at the end of the day I think I thought the food was just ok. I needed a bit more zip."}
{"text":"Rincon Criollo is a Puerto Rican restaurant in the Gordon Square neighborhood of Cleveland, right at 6504 Detroit. Rincon Criollo has a carry-out eating area and also a casual sit-down dining room. I sat down for lunch on a Monday and I was seated right away. The dining room holds about twenty diners, about 10 more can eat at the booths in the carry out side. The decor and mood is casual, the room is brightly lit and there is a television. The clientele are a mix of professionally dressed and dressed-to-work types in various uniforms of hands on occupations. The wait staff is good about explaining menu items and English and Spanish are spoken. The menu features the Puerto Rican foods I remember being introduced to in Chicago when I first had it - Mofongo (mashed plantain balls with seasoning) is featured and although I did not try them, the Chicharrones (pork belly with skin, fried crisp) looked amazing and they were pretty big, too. More meat than skin, about 4 inches by one inch and good 3-4 cm thick. I didn't actually see them on display in the way in or I would have had one.   The menu features kids selections, breakfast combinations served all day, a few sandwiches daily (and better ones towards the weekends) along with their famous \"jibarito\" which is a steak tip sandwich served not on bread but between strips of fried plantain.  I opted for a hearty plate of stewed chicken, beans and yellow rice with an empanadilla of chicken (they had no beef ones) and a dessert of their Budin de Pan which is a bread pudding. The empanadilla was sizable, fried crisp and golden. It was pretty good but not as \"full\" as maybe I expected. The chicken was delicious, tender and cooked perfectly (sometimes stewed items disintegrate...this was perfect and had the mouthfeel you want). There were two small breasts in the serving and it was adequate. Truth be told, I went in there with the hopes of getting a goat stew but they only serve that on the weekends. Stewed goat is amazing and I have never had bad stewed goat in a Puerto Rican restarant, try it....the habichuelas (beans) were good too, large plump red beans, simmered to perfection. They were flavorful also but not spicy. The yellow rice was a great accompaniment to the two saucy items and perfect for cleaning the plate.   Dessert was a generous slice of bread pudding; it had hints of cinnamon and caramel and was very dense, moist and delicious. Ordinarily I wouldn't have dessert with lunch but this was a good decision on my part.  The food and beverage came to about $16. The stew was $10 and would have been enough for lunch, the dessert and empanadilla were $2 apiece. Carry out or eat in, the food was very good and not too many sit-down places in this area are open on Monday for lunch so an excellent option.I'll be returning in the weekend for the goat stew and possibly the tripe stew (Mondongo) which is another thing that is always good.  Parking is on the street; the City has pay and display tickets in this neighborhood or you can try parking on a side street or on a section of Detroit that is open parking. This neighborhood is very active in the evening with several clubs and theaters so prepare to really search or use Lyft or Uber if you are going for dinner."}
{"text":"Spanish food in a simple shop with a handful of options.  The beef with bean and rice are all i have had, but never needed to try anything else.  Friends rave about this local gem whenever they visit."}
{"text":"We love Rincoln. No where else in Detroit Shoreway can you feast for under $20. Yellow rice and beans, chicken and beef empanadas, delicious. Only pain is parking."}
{"text":"Cute little place. Not very big, definitely a neighborhood place. I saw quite a few people placing take out orders.  The food was definitely good and well priced. You can't go wrong with fried plantains! You can get them in place of bread, as an appetizer or mashed with a variety of toppings including shrimp with garlic sauce.  I was a little nervous at first since it did not seem like anyone spoke English, but I was able to get by."}
{"text":"I love this place. I've been coming here for almost 2 years. Never have gotten a bad dish. I grew up eating authentic Puerto Rican food and their pork skins are closest i found since i moved to Cleveland.  They also have huge cuban sandwiches. Empanadas yummy and ready to order!! Should get some to take home."}
{"text":"The food here is always spectacular. Their Cuban sandwich is absolutely delicious but sadly it is only Offered on weekends. The service here is great. It is a smaller business that is always busy but it is always worth the wait."}
{"text":"My favorite place to eat! The staff is friendly and the food is delicious. Reminds me of my mom's cooking. I love it and I recommend it to everyone!"}
{"text":"Place is busy around lunchtime. The rice and beans were not that good. But the tostones and empanadillas were awesome! I am totally going back for takeout!"}
{"text":"We spent a quiet Dyngus Day (look it up) here at Rincon Criollo. It was clean, small, and authentic.   I was happy to find jibaritos on the menu (first invented in Chicago at Borinquen) which are these delicious steak sandwiches w/ garlic mayo wedged in between two slices of fried plantains. Mmm.  The plus: $5.50 jibaritos! These sandwiches are huge--maybe 8 or 10 inches?  I had the beef stew with beans and rice. The beef was pretty tender; rice and beans fairly standard. We also had the half moon chicken empanadilla which was very tasty.   Service was friendly, but I wished they would intuitively think of the customer's needs."}
{"text":"Love this place. Go when you are really hungry. Portions are generous. The food is wonderful! I've gone several times and have never been dissapointed. Very tasty and well prepared."}
{"text":"My experience here was not good!  The food was greasy and dry; when we asked out waitress for sauce, she said they didn't have any in the  whole restaurant!  It was pretty dirty and there were bugs flying around inside.  Our waitress told us that they were out of several key items on the menu & they were closing @ 6 on a Saturday night.  The sign said 8 and they continued to seat customers after 6.  ????"}
{"text":"They are rude and slow! They don't know take and serve ppl in the order in which they arrived! So it doesn't matter if you were there first! You may very well ended up being serviced last! I will not visit this restaurant again for that reason alone! I used to frequent this restaurant often about 10 yrs ago! Totally different and I won't be back!"}
{"text":"I'm wondering if the person who left a comment about us having rats is sure that they're talking about the right place? We have never had such an incident occur at Rincon Criollo. We are a family restaurant and we treat the place just like home. The owners are very strict on cleanliness. Orders may take some time to come out, servers may be frustrated and short with some customers at busy times, but rats are definitely out of any question that might have to do with us & that's for sure."}
{"text":"You want authentic Puerto Rican cuisine, jibarro meals that's real close to abuela's cooking? This is THE PLACE! The whole menu just teases those who are familiar with Caribbean cooking at its best! The food reminds me of grandmas meals that were prepared with love and care which made them that more enjoyable!  I can't say enough great things about this place, so I suggest that you just come in and experience the food for yourself!! Take a break from your day and make a break for the islands!"}
{"text":"Awesome food. I love the atmosphere. Very friendly and courteous. It has become a favorite place for me."}
{"text":"Taste just like being in the isla! The presentation is so  wonderful as well and the staff is friendly!"}
{"text":"It's pretty decent if you are hungry and want something a little different for the area. But it's definitely not the best latin food in the city or the westside for the matter. But I wouldn't pass it up if I was hungry. It's always packed when it's open, but I've gone several times during normal hours and it's been closed."}
{"text":"We were in the area and happened to see this little restaurant and decide to stop. My husband is Puerto Rican (born and raised there) so I knew he would be a good critic.   The place has an authentic look and the food was good, just like the hubs said you would have at someone's house in Puerto Rico.  The alcapurria (fried banana meat thingie) he had took him right back to his childhood. The owner/waitress was super nice--she spoke English but we spoke to her in Spanish.  For vegetarians, the yellow rice and beans are a good option, as well as the tostones. They don't use any meat products in their beans which is nice.  Can't wait to go back!"}
{"text":"So it's probably been over 10 years since I've been here. Food is just as great as I remember it. One of the, if not the, best authentic Puerto Rican food in Cleveland. LOVE their chicharrones - my favorite! So crispy and tasty! Had the chicharrones as appetizer and got the Latin style steak platter for my meal. Wife got the pork mofongo and kids go sandwiches. Awesome! I'd give the food a full 5-stars  So why a 3-star review? Service was sub-par. We came on a Saturday afternoon and saw that there was a bit of a line when we walked in. When I asked how long the wait would be for a party of 6, I was told about 15-20 minutes. Not bad! So we put our name down. It ended up taking more like 50 minutes for us to get seated. No one even bothered to update us until about 5 minutes before our table was ready. And when we were finally seated, it took another 15 mins for a server to come to our table. I don't mind waiting, but don't severely over promise on your wait estimate. After we all placed our orders, our food all came out at different times.   Overall, great food, so I'm sure we'll be back again. But we may consider take out, instead."}
{"text":"So here's the thing: I'm Puerto Rican and I grew up eating the food that Rincón Criollo serves. While I try to keep that in mind whenever I find myself there (and I have quite a few times since they opened), I'm always the teeniest tiniest disappointed.   I took my friend here for a going away lunch and since I had talked up Puerto Rican food so much, she suggested we go here. I ordered a smaller meal of chuleta (fried pork chop) and tostones (fried plantains), since I knew that Rincón serves massive portions of regular meals. My friend ordered one of these plates made of yellow rice and chicharrones. We also ordered French bread for the table and instead received French fries.   The fries were cold and limp and the tostones weren't fried all the way through. Still, my chuleta was just the way I like it and my friend really loved her meal. Plus, the place has gotten a little facelift since I've been there, cleaning up the whole look of it.   So from my experience, gringos will love this place and those used to Puerto Rican food will be reasonably satisfied."}
{"text":"I was looking for a unique dinner spot this past Saturday in Gordon Square and came across Rincón Criollo. Walking past the windows of Rincón Criollo, my friend and I knew we were in for a treat since there was a line out the door. Luckily, there were only two of us, so we quickly got a seat by the front windows.   The restaurant was busy, but they had enough servers and we were attended right away! I ordered the combination #5 consisting of yellow rice, beans, and fried pork skin and a Cola Champagne. As the server mentioned, the Cola Champagne is sweeter than the regular cola, but when I actually tasted it, there was a fruity hint to it.   Our order was put in and shortly after our drinks were brought over, the food arrived right in front of us. I was really curious for the chicharonnes, as there is a similar dish in the Chinese culture called roast pork. When roast pork is made correctly, the skin is super crispy, as if you are biting in a potato chip, but the remainder of the meat is flavorful and tender. The chicharonnes was a different in its own way. The skin was a bit hard and chewy and the remainder of the meat had flavor. Aside from the chicharonnes, the beans and yellow rice had a good bite to it! Very affordable for a filling meal!"}
{"text":"Simple place with a big heart and delicious (cheap) eats.   The staff go out of their way to make you feel a part of the family from the moment you step through the door.  With warm food prepared as well as cook to order available, Rincon Criollo was booming with to-go orders and families eating in on a Saturday afternoon. Blasting spanish christmas music and even featuring some dancing wait staff -- Adorable! RC - you had me at hello! (yup. we're on a first name basis).   The shrimp mofongo was prepared in a lemon garlic sauce and wasn't overly crispy. The flavors were perfectly blended, tostones massive and delicious with the garlic sauce and mayo-ketchup. Who can beat this warm comforting atmosphere (gotta love the friendly latino culture), perfectly seasoned food, large portions, and a menu with nothing more than $15? Plus - A quick lesson on Cleveland in the 1950's was a geeky bonus for me."}
{"text":"Every so often I get an urge for Mofongo and I head for Ricon Crillo at Gordon Square.  Located in a couple of storefronts on Detroit is a wonderful Puerto Rican restaurant.  The decor is nothing special, but the room is clean and comfortable, service is friendly and helpful.   Although the menu provides a number of options and they have specials on the weekend, I have always gotten the Mofongo with the garlic shrimp.  The Mofongo is a large helping of mashed plantains mildly seasoned and topped with a good number of medium sized shrimp in a mild garlic sauce.  The plantains are dense with just a bit of a crunch on the outside, the shrimp are pink and perfectly cooked, the garlic sauce works perfectly with the plantains.  I ask for the hot sauce, which is a homemade green sauce with a bit of heat and a hint of jalapenos.  I mash the plantains into the garlic and hot sauce and it is a great combination.    I highly recommend trying Ricon Crillo.  Great food in a casual atmosphere at very reasonable price.  Be aware that the restaurant closes early so get there for an early dinner."}
{"text":"I moved here from New York about 10 years ago and I have been looking for a Puertorican restaurant since then. I finally found one that I can actually look forward to eating at. They make the 30 minute drive worth while. On top of that, everyone there is really nice. Definitely going to be one of my main restaurants."}
{"text":"I've been here plenty of times for lunch, and while the food isn't the best, options for Puerto Rican cuisine are limited so I keep coming back.  It's a nice little homey spot frequented by locals (mostly for takeout). Prices are reasonable and portions are plenty. Menu is simple but solid. Service is very friendly.  When I go for a full meal, I usually get the fried pork (chicharrones) combo, which consists of rice, beans, fried pork rinds, tostones (fried plantains) (with garlic sauce), a pastele (similar to tamale), and one other side that I can't recall. Needless to say it is a FULL meal. The rice is to die for. The pork rinds more often than not tough and overcooked. Everything else tastes OK but I wouldn't miss any of it if I never had it again. I find myself drenching it in the mild, somewhat-sweet hot sauce that is on every table.  Where they shine for me is the appetizer menu. Empanadillas (empanadas) come in chicken and beef variety and are my go-to item. Alcapurrias come in plantain or yucca (we go for the yucca). Bacalaitos, which I can only describe as a savory fish pancake (think heavily battered fish meat). Rellenos de papa, which is a deep fried potato ball stuffed with ground beef. All very good, but all very greasy and heavy.  If I do find myself in Rincon Criollo again, I would like to try the Shrimp Mofongo, which they highlight on the menu.  Overall it's a nice place, but since I discovered Caribe Bakery, I rarely come back here. I would definitely recommend it to anyone willing to try something new."}
{"text":"The food is consistently good here. I always get the chicharrones dinner every time and it's great. It comes with a huge helping of crispy, tasty chicharrones and pinto beans and yellow rice. They also have a number of beverages I like but the water is definitely tap, if you're picky about that kind of thing."}
{"text":"I heard a couple of people saying that this place was awesome but maybe I went in the wrong day. Our server was very cold and not once came to the table to check on us. The food was a little bit flavorless and very garlic-ish. Up to this moment I still got heartburn. And my Morcilla, well, burned and dried. Puerto Rican food is delicious, but this wasn't."}
{"text":"BEST puerto rican food in Ohio.  I went to PR over the summer and this is the only place that comes CLOSE to real native puerto rican food- you MUST try!  Plantains are my absolute FAV and they were bomb (a must get). The rice & beans were very very good along with the Shrimp Mofongo. The empandada's were so so, i probably wouldn't get them again. My friend got the #1 (i cant rem what it's called) but he loved loved loved it. The portions are HUGE so don't fill up on the yummy app's like I did.  I will def be coming back that's for sure."}
{"text":"Yeah the menu is pretty authentic but I went there close to the end of their shift (7pm) and the food was not that fresh. Aside from the french fries and the tostones the chicken was pretty dry and warm. Some items on the menu were not available anymore at 6pm.  I will go back for sure, but perhaps at the lunch time for a better experience.  I asked why they close at 7pm and they said it is because of security. Guess that neighborhood is not too safe!  The flan was absolutely outstanding!"}
{"text":"I tried this place today because it was recommended. I ordered the pork pasteles (tamale) which came with yellow rice and pigeon peas. I also got a beef pie, Chicharrónes and a potato ball. Total $16.50. The chicharrones were delicious, even though i specifically asked for one big one and she gave me three small ones. The potato ball was just ok and flavorless. The beef pie (similar to Jamaican beef patty) was very dry, also flavorless. The rice was dry, the peas had brown (burned looking)areas, and the pasteles was absolutely disgusting! I called to make them aware of the pasteles because that was my main entree. I overlooked the rest. I was told to bring it back the next day and it would be replaced. I got a voicemail around 7:45 tonight (3 hours later) stating that I should have brought it back the same day, and they hope I get this voicemail so I don't waste a drive over there because they are not replacing the meal now. If that is the policy, why wouldn't you tell me that when i called and the business was still open? They called me, after closing time, to tell me it's too late? Won't be back, and this was my first visit! The owner, Nydvia, was the person who left the voicemail.  The food was nasty.....period"}
{"text":"No stars. Left with no food because no one would take our order. The whole staff seemed to be arguing about something that happened sometime before we arrived. Smelled strongly of cleaning solution - not food. Empanadas in the case looked like elephant ears with nothing inside and too crispy looking. Doesn't help that the last time we came my friend ended up with a long nasty hair wrapped around her food. Giving up on CLE PR food, because the quality and consistency aren't there."}
{"text":"The best! Their food is amazing! The only thing that sucks is they close at 7, not open on Sunday and they run out of chicken a lot but overall the place is authentic and awesome."}
{"text":"I really love this restaurant. I would even go as far as requesting their Chicharones alone as my last meal on earth. They are just so flavorful with the right amount of seasoning, crispiness, and fattiness. I could seriously gnaw on those all day! The rice and beans are a great compliment to any combo platter you order, I always get the yellow rice. Make sure you order a Champagne Cola to wash down all the yummy foods, it's not necessarily healthy for you but it's ok to treat yourself every once in awhile.  They were super busy at lunch time on Saturday, but our server/helpers were on top of their game even with my Groupon-which I know can be an inconvenience, but they never made me feel like it was. The price is very affordable too, about $10 for a huge platter of food that can feed you for days!"}
{"text":"When I moved to Cleveland I was dying for Puerto Rican food and I'm so glad I found this place, it's as close to my mom's home cooking as I can get. Unfortunately the two times I've been the service has been awful. The servers take forever to greet you and take your order."}
{"text":"If you know Puerto Rican food you know this place is as close as you get to Abuela kitchen! They have represented the Puerto Rican community well! Food is delicious and very reasonable. Everything from Puerto Rican street food to Classic Dinner dishes. This is a place the entire family can sit eat and have a geat time."}
{"text":"All the food is delicious! And most plates are $10 or less. One of a only a few true Puerto Rican restaurants in Cleveland. The pernil (roasted pork) is only served on the weekends but def worth the trip! My go to is the Carne guisada (beef stew) and roasted chicken."}
{"text":"This place is good. I'm from NYC where there are hundreds of carribean/Latin restaurants, I also grew up on good ole comida boricua. Don't ask me why when I visited Cleveland last week I decided to find the only (probably) rican restaurant in the city, especially based on how Cleveland's food is notoriously bad. This was a pleasant surprise. I was excited when I saw alcapurrias, pasteles, and morcillas for sale (very old school) not even most places in NY even sell these. The waitresses were friendly and I ordered pernil with white rice and beans and two alcapurrias. The alcapurrias were filled with pork (not traditional but pleasant) the pernil was good,  the white rice was, well white rice, and the beans were superb. The best part? The whole meal was under 10$. Now THAT you can't find in NYC. This isn't a standout restaurant, but its good, well made food with friendly service. Cleveland needs it."}
{"text":"Had the bistec encebollado, rice and beans.  Very tasty.  The tostones I ordered were bitter, most likely because the were fried in old shortening or oil.  The guayaba drink was ok however a bit watered down."}
{"text":"So I came here just two days ago since everyone has been hyping it up. Saying they want to go there just because it's Rican food and whatnot, and let me just say, the food was just terrible. I ordered breakfast. And the eggs had a smell of a burnt pan. And it had tasted old and dry. After that, I couldn't continue eating it. They're lucky I even paid for that crap. But on the good side the bread was nicely toasted. Lol  But on a serious note, I have tasted Rican food before at some friends parties and they have way better food than this restaurant. The food here is just so bland as if they didn't have all the ingredients otherwise they're just learning how to cook for the first time. This isn't the place to be. I was highly disappointed."}
{"text":"Finding a Puerto Rican Restaurant in Ohio seemed cool.  Finding out it was a bad cuchifrito joint was disheartening.   Rincon needs standards.  On display you'll find chicharon that's more fat than meat, dry chicken legs, greasy empanada shells (the stuffing is less than an 1/8 of the empanada) and lastly awful bread pudding.  The food is on display and you'll never know if it's fresh or hot from the heat lamp.   My last visit I got the bread pudding to go.  They served a budin that was less than a quarter inch thick and all 4 pieces were burnt.  One piece had a burnt crevice from the bottom to the top.  I have to point out these were on Display, Handpicked by the server, Put in a Styrofoam box and Sold.   No standards.  No mas."}
{"text":"I love this place. Simple, but good food. The place is not fancy and they don't sell alcohol, but they serve large portions of rich food. Def worth a visit"}
{"text":"Really authentic home style meals in a low key location. Chicharrones are good, and definitely don't skip the yellow rice and beans. Great spot for take out or a filling lunch."}
{"text":"Ordered a side of the yellow rice and beans to go. Exceeded our expectations. Is served with delicious smoky baked beans. Will be back for more."}
{"text":"This place is authentic and quite honestly once I got the menu I was happy that being Friday they had additional \" weekend options\". I settled on trying the appetizers of chicharones which is basically fried pork skin. There was a lot of meat on the appetizer and it was delicious even my hubby who dissects all fat that can be seen really enjoyed the appetizer. I ordered a side of tostones also known as fried plantains. They do not salt them but there's salt table side that did the job. I ordered the Cubano sandwich which was delicious! I couldn't finish it! I tried some of hubbys steak with onions and rice and beans they substituted the yellow rice instead of white on the menu it's number one. Literally the number 1 option with a photo. He was happy as the steak was NOT chewy which he was worried about and was really nicely seasoned! I had to order the flan because well it's a Puerto Rican restaurant and they should have kick ass flan.  The menu prices are affordable the portions very generous if I lived close by I'd be fat because it's so damn good! So do your self a favor come try this place. You won't be disappointed! I parked off a side street to avoid paying the meter. It is nice atmosphere definitely family fun business but very clean and great service. They are open on Fridays I called because Yelp had listed them as closed today but the sign photo showed open on Friday. Flan is perfect! It's so excellent! I'd definitely be overweight if I lived close by it's worth a drive to eat here. Check them out! You won't be disappointed!"}
{"text":"I was so excited to try this place after hearing many good reviews from friends. Unfortunately after my experience today, I just don't get what all the hype is about. The beans and rice were good and the fried chicken was ok. The plantanes were so bland they were inedible and the empanadillas were in desperate need of seasoning. I had to drench most everything in hot sauce just to give it some flavor.  The service was horrible. Waited a long time for a server to even acknowledge my table, she didn't check on us once the food was served which was frustrating in my want for hot sauce, and she just wasn't very personable. Which sucks for her because being a server myself, if I get good service, I tend to be very gracious with the tip.  I will probably try this place one more time since it is so close to my home but will most likely order take out to avoid bad service."}
{"text":"My friend and his Puerto Rican father told me this place is not as good as it once was. I was driving around looking for a place to eat on Saturday and ended up here. I thought it was good food. The portions were very large. You can definitely eat half for dinner and take the rest home. Everything that I tried was good. The service was excellent as well."}
{"text":"After the ownership changed the quality of this place all around slightly went down. It is authentic and good food but, it was alot better before the trade. Same prices, slight degradation of food quality."}
{"text":"Great authentic Puerto Rican food! I highly recommend the empanadillas and the sweet plantains. Also the pork chops are very good."}
{"text":"Today was my first time at this amazing place! I have always heard great things about it and a lot of my friends go often. It's a shame that it took me so long to go considering I drive past all the time!   The food was AMAZING! If you like authentic Spanish food then this place is for you. I had fried chicken with rice and beans and my boyfriend had the same but the roasted chicken. I have always lived Spanish rice and beans but this place takes the trophy...possibly the best I have ever had. The chicken was very good too. Next time I go I want to the crispy pork....it looked soooo good.  You know it's gotta be good food when every single person in the restaurant is Latino!   We will definitely be back!"}
