{"text":"New favourite place in Marda loop - get the dolce e piccante pizza"}
{"text":"Man, I REALLY want to like this place because I live so close by. 
But I was disappointed.  The toppings were very sparse. The service seemed like everyone was hired the day before. It was just a drag.  
I will absolutely give them a second chance, (and probably a third), but...."}
{"text":"This Ripe Tomato location is low on toppings and sauce  and I'm pretty sure a buck more in price than the Aspen location.

I was a big fan of Aspen Ripe Tomato that's the measure in taste for neapolitan pizza, it's the best and if I have to drive there I know I'm going to have consistent great tasting pizza. This location and franchise owner should step it up.  It's not like Aspen its meh."}
{"text":"Was here for lunch not too far back.  Ordered a pepperoni and mushroom.  What I got was dissapointing.  

With the majority of these pizza-fired joints that are popping up all over town, the crust is super thin, which can be good or bad depending on many other factors.  This time, it was all wrong, the tomato sauce is so thin and runny that I would probably call it tomato juice, instead of tomato sauce.  As such my thin crust was a soggy mess that had to be eaten with a fork.  If you cant pick up pizza with your hands, what's the point?  The other reason I had to eat it with a fork was that if you tried to pick it up, everything just slid off the pizza and the sauce became a drippy mess on your clothes.  

To top it all off, the pizza was completely tasteless.  I don't know how you can strip all the flavour out of pepperoni as it's a very potent flavour in itself.  This pepperoni had no flavour, even when pulling it off the pizza and eating it by itself.  How is that even possible?

There was almost no cheese.   The mushrooms were abundant in contrast to all the other toppings.  But again, tasteless. I guess mushrooms cost less than pepperoni or cheese, so fill it up with that instead?   That's not pizza. 

The worst part?  I guess because it's the trendy part of Marda Loop the prices get increased by 25%.  What is $12 at other places is $16 here. 

The only saving grace (and the 2nd star for the review) was that they have Boylan's in the cooler.   My drink was delicious. 

Needless to say if I'm in the mood for pizza, I'll be going elsewhere."}
{"text":"A very dirty restaurant. Shame, because the pizza is yummy, the restaurant looks cool, they have beer and wine and art for sale. This could work so well in our 'hood... Except EVERYTHING, especially the entry door and table top, was just gross. Does no one clean this place?! Someone needs to teach these sullen young workers that part of a restaurant job is cleaning. Wipe the flour off the front counter a few times a day, clean the table tops and bar counter EVERY TIME THEY ARE USED, clean the condiment station OFTEN, sweep the floor, make your work area tidy. Give a dam. Because your customers were more than a little grossed out..."}
{"text":"Pizza was soggy in the whole centre..the staff need to loose the attitude (guy with dreads)and you need to spray for ants. They were all over while we were trying to eat. Must be under the cooler at front door. Yuck. Not a good first impression, the overall atmosphere here makes it not enjoyable I wouldn't return. Waste of money... get some real chefs in there and not staff that look like they just rolled out of bed."}
{"text":"Not impressed at all. We dined in, restaurant was cold and messy. Food took over 45 minutes and ended up being burnt on the rim of the pizza and soggy in the middle. I couldn't even finish my pizza, it just didn't taste good. We won't be back"}
{"text":"Well. We have come quite a few times. Its in the neighbourhood - but I tell ya, what a home run this place could be if they would just work on a few things. 
A) front cooler/ display case is empty alot. If i saw it full of salads etc.... you may buy it!
B) service is slow. People are nice and they are all young but everyone seems like they are training... all the time!! 
C) 2nd time I (tried) to order the feature pizza and they were out of ingredients. Lame. 


I think if they just giver on the above, it will be a cash cow. Right now Im worried they will just tick people off. It hasnt been busy at all...... and that pizza oven im sure wasn't cheap!! 


."}
{"text":"The pizza is just ok and it's definitely not fast like they claim to be. Currently waiting on my pizza for 30 minutes, and counting..."}
{"text":"Jammmmmm! New addition to my little \"hood\" Marda Loop. Marda loop is getting so trendy and legit and with this new addition I was so excited to be one of the first peeps to stop by. To my excitement they also serve cold and enticing Village brewery beer on tap so that added a star to my rating right away. The pizza has a great crust made with 00 flour with very fresh and plentiful ingredients. One of the sweetest things here is the price point. It's so nice to have a pint of beer and a well made pizza without a serious gouging to go along with it. Bellisimo!"}
