{"text":"really friendly, cozy cafe. Food is delicious and all made in house by Barbara. Favourites include the oatmeal cake and schnitzel sandwich.  Great prices too. Can get a freshly made sandwich for less than what you usually pay in the rest of Leslieville for a pre-made saran-wrapped refrigerated sandwich. Highly recommend."}
{"text":"I love the cafe. Although the food is simple, it's a great atmosphere. Love the character of the wood tables and floors. With the large garage doors open to the outside, it was the perfect place for some catch up with Conrad C.   Food is simple. All day breakfast, omelette, french toast, scrambles. CC got the ham, pasta and egg scramble which was tasty. Good comfort food, but seems like also something that I can make at home myself.   There's also some sandwiches on the menu and some mains, like lasagna, and I got the schnitzel. It was tasty, with salad and lemon on the side.   They also have a really good pomegrante and apple Kiju juice. All dishes around $7-8.  So comfy this place. Free parking for one hour, one street north of Queen. I don't know about that lot across the street."}
{"text":"This is such a cute cafe!!  Came here for lunch last week and really loved it.    The space is quaint.  It's seems to be a converted garage/car repair shop with a huge garage door along the back of the restaurant when we went.  There a bunch of smallish wooden tables, all facing the kitchen was was completely open    We had the schnitzel with salad, mozzarella pesto sandwich and  the pear cauliflower soup.  Everything was delish and reasonably priced.  I think we came in under $20 for all three items.  The schnitzel was nicely battered and pan fried and served with a pretty standard green salad.  Really solid.  The sandwich was delish.  It looked pretty plain jane, but was chockablock of flavour.  The pesto and mozzerrella were both excellent!  The soup had a strong veggie broth taste, which somewhat dominated the cauliflower and pear, but was still very delicious.    It is amazing that the owner also doubles as chef and server.   She was pleasant and charming.  Clearly, the food is made fresh and to-order with prices that are soft on the checkbook.  Thumbs up!"}
{"text":"This place is sooo good, I've only tried a handful of things on her menu but nothing has disappointed.  The owner does everything on her own. (impressive) yes there is a bit of a wait, but well worth it!"}
{"text":"It's not often that I gamble my weekend brunch experience on a place that is unreviewed, but when my DC spotted banana bread french toast on the menu -- and started shaking me violently to go in -- we decided to give this Riverdale resto a try.  The River Rock Cafe is a cozy spot. This place could give seminars on How To decorate a new restaurant on the cheap: the floors are plywood cut into wide \"planks\" and cleverly stained. A few of the table tops are plywood too, but done in an inoffensive way.  Two tops resemble something made of solid wood but look closely -- they aren't. With a high-ceiling and a monstrous garage door to match, this 8-tabled cafe doesn't seem that small at all.  The menu is short and sweet. They feature some dinner options, all day breakfast, salads and sandwiches. The breakfast options are a bit lacking, but the aforementioned banana bread french toast ($8) was pleasant and filling (four slices!) AND came with a graciously melon-free fruit salad that was overflowing with pineapple instead. Nice!  I ordered the ham and egg pasta scramble ($7.25) which arrived as a towering mound of egg noodles. Reminded me of a German spaetzle. I really liked it; all the savoury flavours were really balanced, though it was tough to finish all that food. The coffee is self-serve and they also offer Kiju organic fruit juices.   Though it appears to be a one-woman show, the food also came out promptly and steaming hot. I was pretty happy about the service and our food and their prices are very reasonable.  Obligatory Title Pun: We will, we will, RIVER ROCK you.  Menu Readability: Cream coloured paper, check. Good use of leading and subtle alignment, check. TrueType Italian Roman typeface, fail.  Need to mention: Three ceiling fans up this grill. Actually, I suppose I didn't need to mention that.  What this place teaches me about myself: Just shake me and I'll comply. (N.B. Don't shake me.)"}
