{"text":"Nice place for date night! Great selection of wines, cheese, fruit & crackers or hummus & pita. and a enchanting atmosphere. They also carry an assortment of imported beers. The owner is always around and working hard to satisfy customers. A beautiful smoke free outdoor patio deck overlooking the Cuyahoga river. There are a few small tables indoors but not a lot of room,  so they wouldn't be the best place for a gathering of people during rain or colder months."}
{"text":"This place is run by an asshole. Went to throw in a application and he expects me to write down all the answers to his interview questions, that A. He is too lazy to ask himself and B. Are something I'd expect to see at Taco Bell."}
{"text":"Great selection of beers on tap.  I love the patio in the summer."}
{"text":"Was told that I needed to make a $10 purchase in order for them to accept mastercard. This is not allowed by mastercard. After telling the owner this, I was threatened: \"You better leave while you still have legs.\" Needless to say, I won't be back."}
{"text":"This place has all of the charm, atmosphere and location to be really special.  Unfortunately the attitude of the staff is very disappointing.   I have been here 5 times.  Twice with a date and three times with male friends and each time reinforces the feeling that service is not a priority here.  Overpriced food and wine definitely is a top priority.     I have met the owner, Robert, several times and there is no doubt that he knows a lot about wine and the best match for food and wine.   His knowledge is impressive and welcome.  Sadly, instead of his staff bringing the same knowledge and enthusiasm to the table, they bring attitudes and indifference.     Will I be back?  Probably.  Will I experience a better time than previously?  Probably not.   So then why go?  Hmmm."}
{"text":"The patio is DOPE. But the service is stuffy and awkward and the smooth jazz is relentless.  :-("}
{"text":"The owner is also too cheap to pay musicians decently & for ASCAP fees. Only public domain music heard here.  Cheep cheep cheep."}
{"text":"Great place for wine and light appetizers after a long day of work.  They have a great and varying selection of both wines and beers.  You can pay $1 to sample any of them before you purchase a full glass.  Personally, I was most excited about the Raspberry Lambic.  Yum.  Appetizers include salads, cheese and meat, crackers, fruit, tortilla chips, and maybe one or two other things.  I've had their pasta salad and it's made quite well.  The ingredients were of high-quality and the taste was excellent.  The seating here is limited, but we have squeezed in a group of about 10.  They also have a patio that can be enjoyed on warm days.  You can also purchase wine or beer to go, as this is more of a wine shop than a bar or restaurant.  They have a pretty large selection, and the staff members are quite willing to help you choose one.  Overall, a great place for a classy night out in a college town."}
{"text":"3rd review and they just keep getting worse.   Now well into my fiances thousand visit (or so it seems) and the owner still cannot remember his name.   Met a friend for a 3PM work break of martinis, warm weather and good laughs.  Service was slow because as usual, Bob, was \"working by himself until 5PM\" This man just does not now how to run a business that make the customers feel wanted.   He made us order our drinks at the bar instead of seating us first. 15 minutes later (how long does it take to make 2 drinks- 1 martini, 1 beer?) we finally got our drinks. He told us if we wanted more we need to come inside. Isn't this place an est. wear they wait on you, not the other way around?   Piss poor service. 15+ minutes for a drink and it was NOT busy. 1 other table besides ours.   Fiance also used a couple for 1/2 off a cheese plate but Bob got snippy when he didn't order the right one. He was suppose to order one with fruit and didn't. What gives? He didn't want it so save your damn fruit instead of wasting it just so you can put it on a plate and make the coupon legit- seriously, lack of brains on that move.   I don't know why I keep bothering. Truth is, I love the drinks and the cheese plates are some of the best around. I just always hope there service can get better....fingers crossed."}
{"text":"Terrible service, a giant rip off for price/quality of cheese, crackers, wine, etc.  Loud train and bugs, over crowded, parking shortage. I strongly recommend steering clear of this establishment and it's terrible owner."}
{"text":"Riverside is like many early relationships. In the beginning, you are excited to have found a gem in the sad state of bar affairs that is Kent. You see a wonderful patio with a river and train tracks. You see an adorably decorated interior.  You see an awesome menu of wine and a great seasonal beers.  ...And then you think, I have found the one.  Then you go on many *dates* with this restaurant and the shininess fades and it's true self shines through...and you are disappointed  all over again.  Riverside on the outside is so enticing, but the more you attend, the more you see the flaws.  The staff is hit or miss -- I've had good and bad service.  The wine selection doesn't often change for buying by the glass -- and the flights are incredibly overpriced.  The corkage fee is also a giant downer.  The food is decent (though I'm pretty sure they buy the hummus from the store and take off the top, but the pita makes up for it) but also quite pricey.  The owner is very stingy on samples and service. You often have to pay a dollar to try a sip of beer -- and the wine tasting Saturdays are not as good as a value as many other places.  I've also heard the owner yelling at his staff on more than one occasion.    Quick anecdote: We asked the server to split our check once (right down the middle w 2 credit cards).  The server said he could not because he does not have a calculator...  All in all, I return when my friends and I want to class it up and pretend we are somewhere nicer - but lately I leave feeling underwhelmed and out a lot of money."}
{"text":"Like many reviewers, I used to love this place, and my experiences have steadily gone down hill. This used to be a place my friends and I would meet up and have a good time. However, even though the service has never been great, the last time we went, I was absolutely appalled by the conduct of our waiter.  First, the waiter did not come to our table for a very long time. Once he had, I asked him a question about the cheeses on the menu. Since this is a wine and cheese place, it seems like he should be semi-knowledgable about those two things. He said, more like snapped, \"I don't know. I've never had them before.\" All I asked him was which cheese would be considered more mild. Then when he came back and friends of our were ordering, he started tapping his foot and his pen at us! Then he snapped, \"Are you ready yet?\" When my friend was trying to choose something he again snapped, \"I'll just come back.\" This server was so incredibly rude I couldn't even believe it. We had chosen this restaurant and were spending a lot of money, and we were all so uncomfortable we couldn't even enjoy our time together.   Finally, my husband, who never says anything to people, asked to see the manager. When the guy came out, the waiter ran over and started defending himself, and the manager did not even take care of the situation or apologize to our table or anything at all! This is really such a disappointment because this could be such a nice establishment, but it's really too much money to waste to feel nervous and uncomfortable the whole time. Too bad."}
{"text":"I used to like it here even with the slow service and expensive  appetizers but when I got a bad beer and the employee could not even make an exchange  I won't be back."}
{"text":"I love it here. Good prices. The server remembers my order when I come in. On Mondays and Tusdays they cork your bottle of wine for free. The outside patio makes you feel as if you are no longer in Kent, Ohio. I have yet to try their food which consists of meats, cheeses, crackers and so forth, but I have friends that have and they enjoyed it. Great find! Wish I would have known about it sooner."}
{"text":"Not much of a wine drinker, but this place is kinda cool. A nice outdoor patio overlooking the Cuyahoga. Unfortunately it also overlooks the graffiti and train tracks, so it lacks the serenity of a winery.  The appetizer menu is ok, but kind of pricey."}
{"text":"I had to role my eyes with this moment.  I had good intensions and wanted to support a local business in Ohio, but maybe I should have just stuck with my NYC wine shops.    After calling Riverside to order some wine as a gift for my Dad for Father's Day I asked for a receipt.  Since I am in a different state I asked if it could be emailed, and was told \"they were not really set up for that\".  Not set up for email?  Really?  Then I mentioned they could just mail it, \"that will be a dollar,\" I was told.  What!  I just ordered $83 dollars in product from your store, and I didn't argue when you told me it would be $20 to deliver it to the next town over and now you want to charge me a dollar for a 44 cent stamp!  Oh come on people, this is not the way to win customers and get repeat business.  Ouch, that penny pinching is going to leave a bruise.  I wonder if the person who came up with that charging policy has experience working in the airline industry?  We all know the dollar is not the issue it's the feeling that being charged the dollar left me with.  Come on guy, use basic customer service skills and throw in the stamp next time, trust me you will make up the 44 cents in the end."}
{"text":"Tried to buy a growler of something they had on tap and was told by the owner 'no, not this beer' - no explanation as to why. When I asked if I could place an order for bottles of the same beer (since the growler wasn't an option) I was told 'the beer company doesn't sell it in bottles' Subsequently found and purchased two bottles of the desired beer  elsewhere.  Felt like I was a nuisance to the owner when I was trying to make a purchase. I have been a long-time customer in the shop and on the deck and am not going to make any purchases here in the foreseeable future."}
{"text":"The management is really stingy and strict. I had a gift certificate that I got from a third party that I had been saving for the summer so we could sit on the patio. It had not expired yet and when we walked in there was a sign at the door that said they no longer accepted those gift certificates. I had a gift certificate with a valid expiration date, not a questionable coupon. I talked to the owner and he tried to argue that a gift certificate is not in fact a contract and that he did not owe me anything in exchange for it. I think they have a very nice setting (if you don't mind a loud train running by every half hour that stops your conversation) but I will never go again because the owner is not personable with valid complaints."}
{"text":"After going here since they opened I had the opportunity to have the owner, Bob, school me on his $10 minimum for a credit transaction (I was just grabbing a couple beers to go as opposed to dining in like usual).  It was nice to be argued with after having been a loyal customer for over 6 years.  I'll drive the extra quarter mile in the future for Bottles 101 since the selection and attitudes are better and they actually care to remember what their customers look like.   Also, the hummus has become quite oiley lately, though, since it's coming from a super market as opposed to made fresh I guess this isn't their fault."}
{"text":"Riverside has the best draft selection in Kent in my opinion.  Too bad their staff isn't very good with names or selecting light jazz...Not that the Baby Got Back rendition was bad or anything..."}
{"text":"I have been going to Riverside since they opened up the bar section in 2005. Or was it 2006? Either way, rough years of my life that blended together from the sandpaper of time. Bob has really done a number on the place. They have around 10 great beers on tap at any given time. The drafts are well thought out with a good variety to accomodate different tastes. Riverside had the Hunter S. Thompson tribute beer Flying Dog Gonzo on tap right when it was released. The web site always keeps a list of what is available on draft. There is a myriad of beers sold as singles also available to drink at the bar. This is the bar that also introduced me to wine drinking. I ordered a Riesling and the man on the stool next to me poked fun at me. The bartender came to my defense. There are many wines to try but I would be lying if I said that I have. The cheese and fruit plates are always enjoyable. The beer list is so extensive that I can't find it in myself to quit my first love. A great place to meet up with old friends and catch up on times in the cold dark winters and an even better place to hang out on the expansive patio when the weather breaks. The view of the Cuyahoga River with trains running beside it is beautiful to say the least. One of my favorite places to go in Ohio for beverages."}
{"text":"My friends and I walked in around 9pm tonight. The server/bartender seemed annoyed we even showed up. The service was awkward. We were having a good time amongst ourselves and sat at our table til 11 at which point he approached us and said, \"just so you know, it's 11 o'clock.\" Very passive aggressive way of asking us to leave. I understand it was slow but we weren't even aware the place was closing because online it says it is open til 1am. All around uncomfortable."}
{"text":"Great staff and tasty finger food.  Always have a good experience.  Would love to see more beers on tap and more food added to the menu at some point - but love it nonetheless.  Great view of the river!  Friendly and knowledgable staff.  Update: had an awkward asshole as a server. Actually accused my stepson of trying to go out the emergency exit. Was a complete asshole and this was after he waited on us and we threw down a 25% tip. I should have changed that to 0%. We informed the owner, who did apologize, but this has tainted our view of Riverside.  The setting is cool and the selection of beer and wine is decent, but the real value is the relaxed vibe. This is not an upscale restaurant with first class service. This is a liquor store/bar in an old dairy mart, with a funky and eclectic, laid-back vibe you might only find in Kent. If they own that, instead of trying to be something they're not, I bet the stars would start coming up. Oh and weed out the incompetent servers and pay for some decent music.   I've also heard rumors that the owner takes a % of the tips. If that is true, that is ridiculous, and should stop ASAP."}
