{"text":"Flashy, Florida-themed restaurant that is a fun place to visit but not necessarily the type of place you would frequent.

The food is typical burger-fare, with babyback ribs and chicken sandwiches on the menu as well. The burgers and buffalo chicken sandwiches I've had here have been decent but nothing to write home about. 
The wings are pretty good, however.
Although I've never tried it, you can get their Mahi-Mahi sandwich, which they call their Grilled Dolphin.  It just sounds wrong when its called that though.

Gator's can be a fun place to watch NFL games though, as it often turns into a rowdy place on Sunday afternoons in the bar area.

There is also a patio area out front that on nice days is a good place to have a drink and appetizer. 

Prices are pretty decent, about what you would expect...$8-$10 for a sandwich and $10-$18 for most entrees.

Overall, I would say Gator's is not necessarily memorable, but is serviceable."}
{"text":"Starting out i thought RJ Gators might break into my go-to restaurants. For some reason, i was under the impression this restaurant was more cajun-like and spicy. Other things to my initial liking were wide straws, table-side tvs in some booths and plenty of tvs around. 

The buffalo chicken wrap ranked pretty low in my continuing search for the best buffalo wrap around. i'm not a fan of tomatoes so maybe that would have helped a little to request none of those. i ordered the hot flavor and it didn't transcend far beyond the pieces of chicken soaked in it and wasn't all that hot. The sweet potato fries weren't too bad, a little cold coming out. In the end, anything dipped in honey mustard won't be too bad.  

The panhandle pasta was pretty bland before adding some hot sauce. The shrimp was extremely dry and chewy and without looking at it could have been mistaken for chicken.

Coconut shrimp was the winning dish at the table. Served with black beans and rice (mother did really like these too). 
."}
{"text":"This place was really not that good at all. The quality of he food was low. I have had much better bar foods than this. The only thing that was okay was the staff, very friendly. The beer menu was average at best. I will not be going back."}
