{"text":"This deserves zero stars. It's THE worst Indian food and sweet place in Mississauga! We bought some rasmalai- it was made with burnt milk. The moti choor ladoo smelled like they were made with stale oil. The thali was very oily, bland and did not have any taste. Too bad we bought all these things as takeout and don't stay in Missi so could not return them! Never ever buy anything from here-the staff is rude and food is stale and bad quality. They are cheating people by selling bad quality Indian stuff. Please stay away from this place-there are far better restaurants to spend your money at in Mississauga"}
{"text":"Food is too oily and made me feel nauseated. I hadn't eaten there in years and decided to give it another try but I will never eat the food again. This is some of the worst Indian food I've had"}
{"text":"I enjoyed the food and the buffet spread. Not the most delicious, but still good. The ambience was great and quieter. We had a mini-reunion there and we could spend a lot of time chatting. The service was the best...very friendly and helpful. The name changed from Brars. The address is not visible anywhere. Thanks to GPS we found it. The strip mall did not have the address up either."}
{"text":"These cheap people can go to any extent to save some money. Food never tastes fresh, always same old stale food. Sometimes good customer service can make it up for that. But, here customer service is even worse than their food.
A big no for any Indian food lover."}
{"text":"We stopped by recently for a quick bite..it will be our last time!!!
Food is hard to digest too oily and quality has changed. I used to love the food and sweets before. I"}
{"text":"The worst service I have ever had at a restaurant. When this place was run by Brar restaurants it was very good. If I could give them a negative star I would. On four separate occasions I have ordered food from them. When I arrive, I'm told they haven't made it yet. What is the point to per order takeout when they are so incompetent they cannot prepare a simple take out order. Also my family only orders the naan bread as their food often gives us diarrhea. STAY AWAY FROM THIS DIVE RESTAURANT!

Note: there sweets and samosas are good"}
{"text":"Went in for a weekday dinner buffet with my wife. The food is not fresh, probably due to not much customers. Rice dishes were not replenished. Roti was prepared fresh but too oily. The sweets were not tasty. Not worth the price. The only thing good was it is empty and you can meditate there."}
{"text":"Great Indian food! Cant believe it was all vegetarian. Very clean and the servers were nice and very worth it for its price. Im not very familiar with Indian food so I would recommend coming here with someone who is, everything can look quite intimidating. Everthing I had was delicious, we got unlimited naan bread, and would definitely  come back if I was in the area"}
{"text":"One star.

I have never given any establishment one star but this place deserves it in spades.

We catered food from here for a party and it was some of the worst Indian food we've ever eaten. The daal tasted like a cinnamon candle, the palak paneer had no taste.  Do you like prepackaged frozen veggies? You can find them in the mixed vegetable curry, you'll love it if you enjoy food that has a texture similar to rubber.

And the final thing that put me over the edge was fighting the nauseating feeling an hour later then spending an hour in the bathroom at 4 in the morning.

My son, my wife all had stomach issues after eating their food.

Avoid at all costs, wish we had read the reviews."}
{"text":"Went for some take out thalis at the RK sweets which was Brar Sweets before. 

For $8+taxes you get 3 veggies and one sweet or 4 veggies, rice naan and a side salad. Good deal. 

We took 4 thalis but combined the veggies,rice and salads in one container. The combination gave us insane amount of 4 veggies and rice. The veggies were really flavourful but the palak paneer was on the spicy side. The malai kofta and shahi paneer was delicious and the mixed veggies had frozen veggies with fresh green peppers and potatoes mixed in for a burst of freshness  - it did not help much. 

The 4 veggies were floating in oil. - which is a big negative for me. 

The naans and rotis were at par. 

Good value- but one star deducted for too much oil."}
{"text":"My cousin took me to this Indian restaurant while I was visiting them.  When I walked in, I was very impressed with the layout of the restaurant.  I am a vegetarian and this restaurant is nothing but Vegetarian.  The buffet had more items to eat than I have ever seen at any other Indian restaurant.  I think it had over 50+ different items. The salad bar was great. It had more things than I expected. It was fresh and Price was very reasonable. They also had two big showcase of indian sweets. Customer service was A+.  Even the Owner \"Ravi\" came out and asked us if we need anything else.  Will come back and eat here again in near future."}
{"text":"Ratings:
Food: 8/10
Drink: n/a
Service: 8/10
Value: 9/10
Hygiene: 7/10
Aesthetics: 6/10

I've been here a couple times for lunch with some friends as we were craving Indian food. My friends are vegetarian, so this place is a great buffet offering only vegetarian options.

The food selection is pretty reasonable and there is a diverse selection. Most of the food is of good quality.

The cost is decent, any other Indian buffet with meat will be almost double the price.

The decor is really simple, but it could definitely do with a facelift. For the price though, I'm not picky.

The service here is alright. They clean your empty places reasonably fast and there isn't empty trays for food often.

The place isn't too clean, there is residue on the utensils and it looks a little worn everywhere. Had to ask them to turn on the water for the ice cream scoop.

A great place for indian vegetarian food and at a decent price. I would recommend this place."}
{"text":"Good veggie place for Indian street food (chaat, chole bhature etc) and also nice for a thali. I usually get their take out thali with 3 veggies, rice and naan for $8. The quality of their sweets has gone down, so I barely buy those, but for the average Indian food, it's a nice local spot!"}
{"text":"Very nice food.Wide variety.Staff is a little too busy but their sweets are good.Samosas are ok.Pakoras are very good."}
