{"text":"My family has been coming to this restaurant since I was a child. It's a great place for families, for dates, for anything really! They're menu is small but everything on it is delicious so it's not a problem. The waitresses there are kind and will remembered familiar faces. 

Usually, for a family of 5, a salad, an appetizer and a main is more than enough. After that, we rarely have room for dessert even though their dessert is good too.

This is one of my favorite restaurants in Toronto and is highly recommended."}
{"text":"Wanted to try a new place and stumbled across this after shopping nearby on Yonge St. Didn't read any reviews first and did the old fashioned peek in the window and went in good faith. 

Menu is written on a blackboard propped on the floor that they have to move everytime someone wants to see it. This should be placed on the wall instead of all those paintings.  Saw 2 people that just came in wanting to see menu and one had to wait while the other end table was looking. Very inefficient and annoying. 

Ordered the Caprese salad (exotic greens, roasted red peppers, goat cheese) and it was decent portion and enough to split into 2 small plates. 

Cheesy garlic bread sticks in the bread basket was a surprise and the highlight, similar to the cheesy bread sticks at the mainstream pizza place except much better.  delicious and nicely done. 

Not all their pasta is home made which is disappointing. 

Ended up ordering the Veal Parmesan (breaded veal, thin ham layer and lots of mozzarella on top) and Veal Limone (thin veal slices that were a to dry overcooked,  except the lemon sauce was nice and not to runny like others).

Didn't try dessert or coffee as there were dedicated coffee house in the area, so that was it for us. 

As others mentioned, place is small and cosy.  Tables are too close to each other but the place is to small not to.  We could literally eat off the plates of our neighbors. 

Clientele is the older crowd and not what you would call hip or trendy,  but it works for them.  Saw a lot of regular customers hamming it up with the owners,  which is always a good sign. 

If you have a big party larger than 4 people you better make reservation as the place holds only approx 30-40 diners at most, packed tightly.  Mainly 2 and 4 seaters.

Overall not a bad place and not the best. Probably would not return as there are many other places to try, as prices are not cheap, but look where you are.

Worth a try for the cosy environment, good food, family feel."}
{"text":"I have been there twice and have mixed feeling about the place:

Positive:
-friendly, casual, romantic, pleasant atmosphere and staff
-The BEST mussels in tomato soup I have tasted. Goes well with their garlic bread sticks. One of my favs.
-Great salads.
-Good wine selection.

Negative:
-I find their main dishes to be a little bland and/or overwhelming in one flavour. For example, their veal was tender but tasteless and overwhelmed by the sauce. The same goes for their stuffed pasta shell (forget the name) there was too much cheese.
-I don't know how they price their meals, but I end up emptying my wallet each time: very expensive."}
{"text":"Your review helps others learn about great local businesses.
Great food. Great staff. Owned and operated by family. The owners wife Marisa is extremely friendly and a fun loving server.  Can't understand some comments about her attitude. 
Food has been consistent for over the 7years that i have been going there. 

Please don't review this business if you received a freebie for writing this review, or if you're connected in any way to the owner or employees."}
{"text":"We had my mothers birthday party here and it was fabulous. The food was excellent and served in a timely manner for a group of our size. The service was polite and courteous.  The shrimp marinara is a very good pick.  Also the price at the end of the nice was a pleasant surprise."}
{"text":"i used to like Roberto's, honestly. It was a friendly, casual dining spot my husband and I enjoyed on a regular basis. But I don't think we will be back, as their service is so spotty and has really gone downhill.

The waitress we had at our meal tonight was, frankly, unwelcoming, with a \"whatever\" attitude.  Did not smile once. Within seconds of seating us she was urging us to order... Give us a few frigging moments to read the menu, lady! We were rushed through our first course and had to fight to finish it, otherwise she would have whisked plates with food on them from us. Our mains arrived while we were still eating our appetizers and when we mildy remonstrated with the server, were told that the restaurant was busy so it was take 'em or leave them... Great choice. She then zoomed by for a food check and with food in our mouths, didn't wait for an answer but darted away. Why bother even asking, then?

And pet peeve of mine: please, Toronto servers, do not address a group of ladies of a certain age as \"guys\". I HATE this. I am not a guy. When and if you start addressing a group of men as \"gals\" (i.e., when hell freezes over), I may change my mind. Until then, I will express my non-appreciation of this habit come tip time."}
{"text":"DO NOT GO HERE -- THEY TREAT YOU LIKE SH*T. 
Went w/girlfriend last Saturday night. 

A lady asked 'how many?'

No, hello, no welcome. 

I politely smiled, 'just us two.'

\"Over there,\" she pointed. She ordered us to, \"sit beside each other.\"

Rather abrupt&not very welcoming. 

WE SEATED OURSELVES as ordered - NO ONE CAME TO OUR TABLE. 

It was 10-min before I got the lady's attention.

I asked for menus. 

The woman said she'd bring it out, it's on a chalkboard.

We were handed drink menus, just laminated, plain white paper, with a list.  

Another woman came by asking us if we'd like something to drink. 

Neither my girlfriend, nor myself are drinkers. 

There were no non-alcoholic beverages. I asked if they had iced tea --and I ordered one and asked my girlfriend if she wanted one. 

The waitress kept pushing booze, making us feel uncomfortable. 

My girlfriend settled water. The waitress prompted sparkling, fancy -- we just wanted water, basic, simple, H2O.  

The staff of Roberto's clearly were making us uncomfortable by treating us like crap. 

Min. later the initial woman drags a LARGE, wooden, chalkboard& plops it down about 10 feet from me, asking if we can see it. 

I stood up. It was the only way to see the whole menu. 

My girlfriend didn't want to stand but she reluctantly does, twisting and turning trying to see the menu. 

The woman saw our frustration, and drags it to another location, still on the floor, asking if that was better. I hope she washes her hands -- I saw her carrying food to tables. 

I could see MOST of the menu. My girlfriend never was able to see the right side, as she mentioned to me they didn't have any prices on it -- though I saw those. They were comparable to typical Toronto fine dining restaurants. 

The menu was incredibly dull, dry and well -- very much like the woman and the rest of the staff -- not very welcoming and certainly not very communicative. 

The menu, hand written in chalk, was simply a list of that evening's dinner items. 

No descriptions. It was more like a shopping list than a menu. 

I get it. 
I do. 
They have different selections every sitting. 

However, the execution is not very practical nor useful. 

Hey Roberto's, EVER HEAR OF AN iPad?

Then in a hurried, yet polite voice, she says ask if we have questions. 

My girlfriend was still struggling to see the damn thing. 

Yet, the woman clearly was rushing us, trying to get us to make a selection, that made asking questions uncomfortable. 

Mostly pasta and salads with one or two meat dishes. No pizzas. 

Eventually, we stumbled onto our selections. 

The woman tries up-selling me  on my appetizer. She wanted me to order the most expensive appetizer.

I already was regretting coming here&I didn't want to try it, so I said my original choice. 

She blurted out what she wanted to hear, the other, more pricy salad. I corrected her and after we placed our order, she left in a huff, obviously disappointed. 

The staff seem to go out of their way to make new customers regret coming here. 

My salad appetizer came. It wasn't very good, bland really.

Our mains arrived - I got a rigatoni in bolognese sauce. The sauce was delicious, though the pasta was a bit rubbery, and obviously store bought, not homemade. Homemade pasta is what I expect -- and get -- at OTHER fine dining Italiano restaurants, why not here?

My girlfriend's pasta was homemade, and she said it was very good. 

No one came by to offer us fresh ground pepper or fresh Parmesan cheese, which you get at any other fine dining restaurant. 

Most of the customers were white men and women in their late fifties or older. They were regulars as the wait staff was quite attentive &pleasant to them. 

We finished dinner, and decided to go elsewhere for desert. I asked for the bill, and when I took out my debit card they said they only take cash and credit. 

That, and after all the uncomfortableness we were feeling, I didn't want to hand over my credit card. I didn't trust them.

The waitress said they have a bank machine at the convenience store next door, matter-of-factly. As they have no signs about this unusual policy, they probably direct confused patrons there all the time. 

I told my girlfriend to sit tight and went to the white label ATM next door. 

I got just enough to cover our bill -- which wasn't a proper one. It was hand-written, and much like their chalkboard, only listed the items we had. The price of our two pasta dinners was a combined total, not broken down as you'd expect at any reputable restaurant. 

1 salad
2 X pasta
1 iced tea 
Tax 
Total

No HST Number (and no business name and address linked to that missing HST number), no invoice number, not even the date. Can you start to get a sense of why I didn't trust this place with my credit card?

Total plus taxes came to $51.50. 

I gave them $52 in cash and whatever change I had. 

DON'T GO HERE -- UNLESS YOU LIKE BEING TREATED LIKE SH*T."}
{"text":"I've been here a few times. Always impressed. Love the travelling chalkboard menu. Traditional Italian dishes that are amazing."}
{"text":"This restaurant has a bit of a tight-knit community vibe - lots of regular customers with a long history of going there. I can see how a newcomer could feel a bit \"on the outside\" when going here... But as a member of a family who has been going here forever, I love it. Their salad dressing is amazing, breadsticks are delicious, pasta and veal dishes are tasty, and their lemon mousse cheesecake just melts in your mouth. Also, their calamari is excellent and their prices are very reasonable. I think it's worth a try if you're in the area - the staff are very nice once you get to know them."}
{"text":"The service is great, the entrees are very good, but it's the appetizers that I love most: I always look forward to the house salad, breadsticks, and amazing calamari. Mmm..."}
{"text":"I came into Roberto's for the first time in June 2015 as a party of 2. The restaurant is quite small, but we were able to be seated right away. We both had an idea in mind of what food we wanted, but unfortunately since there is only one menu handwritten on a chalk board and moved from table to table, we had to wait at least 15-20 minutes for our turn with it just to get an idea of what was being served that night. 

Once we ordered, the food came out pretty quick, and we both liked our meals. The food is was pretty good and I would probably go back again if it wasn't for the way the waitress treated us at the end of the meal:

The waitress was rude and judgmental when we asked for change back for our cash to pay our bill -- expecting us to round up to the nearest multiple of $20, which would result in us leaving a 25% tip. She brought our money over to the owner, and she also made a face about us asking for change, as if we were trying to rip them off. We intended to tip the standard 15%, since the service was by no means exceptional, so it's not like we were just trying to stiff the waitress by not leaving any tip at all. Once we sorted out our tip with our change, the waitress stopped what she was doing and made sure to immediately check how much we tipped before we left the restaurant. I didn't like the hostility directed towards us for not tipping 25% for average service, especially since the two of us are university students and by no means rolling in cash. This isn't a fancy restaurant and people shouldn't be made to feel bad about tipping the standard 15%."}
{"text":"Second visit in 12 months.  Called to make a reservation and was told first come first serve and that they could accommodate us if we came soon.  We arrived and were welcomed by 2 ladies.  Place was packed and we were seated in the window.  Marissa did tell us that it would be 5 minutes before she got to present the specials menu.  Food came quickly and was surprisingly hot and tasty.  We had the specials - shared caprese salad, he had steak and I had salmon.  It's a great family place-it's not Scaramouch but neither are the prices. A day later we bumped into our waitress on Yonge street and she recognized us and chatted.  Also told they will accommodate allergies.  Will return."}
{"text":"As a customer of Roberto's for over 30 years I continue to go back for the food. The tomato sauce that is used in many of their dishes is excellent. But I think this was the last time due to the poor attitude of the owner/chef's wife. You need to be a favourite diner if you want to be offered the non menu specials. The new mushroom appetizer was only offered to special customers. There certainly are other good Italian restaurants that I am sure will appreciate a loyal customer."}
{"text":"This was our first time venturing in, despite living in the area, and it feels like we've been missing out on a local favourite! 

This is certainly a small family-run ambiance, meaning tables are close together and there's literally one menu (a chalkboard they bring around). My wife and our guests had to wait about 20 minutes for a table for four, but I'm glad we did.

The garlic bread was a bit bland, but otherwise the meal was great. I had chicken Parmesan (lots of chicken!) and my wife had salmon, which she loved. The salad we had as an appetizer was also fresh and quite tasty.

Service was provided by multiple people, but the main server treated us like family and joked with us throughout the evening -- certainly made us comfortable as first-time guests.

We'll return!"}
{"text":"I'm giving this restaurant 5 stars, not only because the meal was thoroughly enjoyable, but also because the service and hospitality was awesome. I've passed by this establishment since I was a kid.....it always looked cozy and inviting from the outside. I'm so glad that they are still going strong 40 years later. It's unusual for a restaurant in this city and there's a good reason for it....this place delivers. The atmosphere is warm, the food delicious and soul-satisfying. The servers are lovely.
What more needs to be said....Bravo!!"}
{"text":"Robertos has a vibe of a cafeteria with some latin music on. We both like to sit on one side of the table, as we settled onto the bench seat together, one of the waitresses gave us a stink eye about it and the promptly came over and asked if were going to be eating on the same side. 
Another waitress started talking loudly to the table next to us about proper tipping etiquette according to the new etiquette book-- how people should calculate the tip based on the cost including the tax (20% of the final cost). Yet she neglected to adhere to waitressing etiquette by talking about tipping.

The food was mediocre. \"I didn't throw up\" is a good way to describe it. It was their special pizza night so we expected better. 

We should've just gone to Mamma's Pizza and saved our money.

Final remarks: if you like to sit on the same side of the table, you won't be welcome here."}
