{"text":"Damn! I feel like I've been transported! Want an escape to New Orleans for an evening?  Go to Rock's Landing in McKees Rocks for a few hours. We visited on a Sunday evening and were treated to awesome jazz, very friendly service and tasty southern noms.   Ever heard of turkey ribs? Me neither,  moist, delicious,  and oh so tasty.  A very good time indeed, we'll be back."}
{"text":"I visited this establishment sometime in the fall. Very nice place! Almost felt like I wasn't in Pittsburgh! Food was good and the service was great! The outside heated tents were nice and comfortable! I would recommend people to patronize kick back and enjoy!"}
{"text":"What a hidden gem in McKees Rocks. Rocks has quality food for affordable prices. The menu isn't huge, but what they offer is fantastic. The bar prices and service are also unbeatable. Make sure to try the wings and all of the sauces!!"}
{"text":"Truly a best kept secret!  I am a fairly picky eater and found the grilled chicken to be very tasty and cooked perfectly.  You will not find chicken cooked to this perfection anywhere in Pittsburgh.  The 2 sides I chose were cabbage and greens.  So scrumptious and vinegary and flavorful!  Nothing was over-salted either.  Where can you go and hear professional jazz music while dining (and at no charge!)  What a fun way to spend a Sunday evening.  The icing on the cake was P.K. walking me out to my car to be sure I was safe.  I will definitely be going back!  Glad to hear that you are expanding!"}
{"text":"This place has live Jazz on Sunday nights (definitely) and maybe Saturday's.  There is an outdoor area that they plan to keep open through the fall.  Seems to be a New Orleans theme for the food.  Prices are very reasonable.  Rock's has a very nice atmosphere: Friends and followers of Jazz.  Two different visitors jumped up to sing and the band (Tony Campbell's Group) complimented them well.  This place will expand and grow and they are a great addition to the McKee's Rocks area - No matter where I go in the world someone knows about McKees Rocks!"}
{"text":"So it was another Friday early evening, and we needed a meal out. So we pulled out the Yelp app, and scoped out the nearby red dots that we knew nothing of. Two came up in nearby McKees Rocks, so we checked out the reviews our fellow Yelpers left.  WHOA...the one which the Yelpers raved about the food and portions, was also the one where the Yelpers ripped new colons over horrible service...repeatedly. Skip that one. So we checked the reviews of the second red dot in McKees Rocks...Rocks Landing. Only a few reviews, but pretty much all were glowing, raving about the good food, and the weekend jazz. Well, we were heading for a meal at 4 pm on a Friday, so there would be no jazz, but we thought we'd check it out. It sounded good.  With no idea what to expect, we arrived in McKees Rocks, where previously we'd only driven 'through', and found our location. At first, we were hesitant. It kind of looked like a very unassuming dive bar in a shady neighborhood. BUT, we took ten more steps and went in.  Upon our arrival inside...well...it still looked like a little unassuming dive bar in a shady neighborhood, with a small handful of locals at the bar, with the gal behind the bar making some mighty funky looking drinks with a load of whipped cream and some kind of red topping squirted out of a bottle. The gal looked at us, and said she'd be with us in a second. After she finished serving her drinks, she bubbled down to us, and we asked if food was available. \"Absolutely\" she said, and she lead us to the big back room with tables and chairs, where a little wiry guy popped out of the kitchen to confirm a bar order, and there was a little light box spraying little green dots of light all over the room. Kind of like a green dot laser show, or green dot mirror ball. The gal took our drink order and gave us menus.  The menu was VERY simple and brief, so much so that I had second thoughts about staying. It basically said: Chicken entrees, boneless breast, 4 wings or drumstick and tight (which I'm sure meant 'thigh') followed by 'Cajun, Fried, Grilled, BBQ. Next paragraph, Seafood Entrees: Grilled Salmon, Fried Catfish, Cod, Whiting' Then, side dishes: Gumbo, Jambalaya, Red Bean & Rice, breaded okra, broccoli, asparagus, greens, spinach, cabbage, side salad, grits, mac & cheese, apple & yams, french fries, onion rings. All of the entrees came with two sides. That text was pretty much the whole menu.  I was very confused, and the server aka bar tender, Holly, was VERY helpful, answering all questions and clearing up the mystery. So I ordered fried cod with cheese and bread (to make a sandwich, red beans and rice, and fried okra. My better half ordered fried chicken leg and thigh, mac & cheese and asparagus. He had the happy hour Long Island Iced tea ($5) and I had my usual Diet Coke. Holly also brought water.   It did take a long time for the food to come, and the green dots settling on each of our faces were a little disconcerting, but a bit entertaining, as we chatted. And at one point Holly came by to say that 'Everything is home made from scratch and to order, so it takes a little longer to come out, but I'll get your tartar sauce and some kickin' bourbon sauce, and top off your drinks while you wait'.  WELLLLLLL, when the wiry guy finally brought the food out, all we could say was 'Holy COW!' Obviously, this was ALL just made from scratch fresh. The okra was not the usual frozen breaded okra, but it was fresh chopped okra hand battered. The fish wasn't huge, and came with two slices of plain bread, with cheese melted on top, but it was a THICK piece of fresh Cod, with a heavenly batter. The rice and beans had such amazing full flavor, and my partner's mac & cheese was sooo creamy and gooey cheesy. We both had to try a bite of each other's everything, and it was all absofreakinlutely delicious.   Holly gave us the full rundown of the 'plans' for the place, and how much of an effort the owner had made to 'clean up and step up' this little hole in the wall spot. The outdoor area is a work in progress, but includes seating, cabanas for private gatherings, the live music is piped outdoors, and there is a side bar window so that you don't have to go back inside to order your drinks while dining outside. There is even a dress code that does not allow 'sneakers, hoodies, or sagging pants' after 9 pm. And after 9 pm, there is an age limit...30 and over.  I LOVE this place! As simple and unassuming as it is, you will get excellent food, at a very reasonable price ($11 for chicken dishes, $12 for fish), and apparently, if you go on a Saturday or Sunday night, you'll get live jazz. Just a little flavor of New Orleans.  We WILL be back for that food, and we look forward to see how much the space evolves. It's worthy of the patronage!  Laissez les bon temps roulez, indeed!"}
