{"text":"I looooveeee Rocky Mountain chocolate! I'm in love with the milk chocolate macadamia bears, so happy that this location has them! Unfortunately my experience in this location wasn't as high quality as the product. My cashier Aniah was standing in the corner talking to friends when I walked in, she didn't greet me until a few minutes later when she began with \"what can I get you?\" I was like oh hi, just a minute. Then when I asked about one of my favorite apples she responded rudely by belittling me as she pointed to it. Just bad attitude overall the entire time while helping me. She made me want to get in and out ASAP. Aniah is not as sweet as the goodies they're selling;)"}
{"text":"Ok so this review is for the two ladies that just assisted my wife and I with some toffee and treats. I had asked for a pecan cluster, and after I left I bit into it and it seemed to be walnuts. Now I'm sure I looked like a fool complaining about a nut cluster that, covered in dark chocolate, is difficult to identify. It tasted like walnuts to me, and I know they were probably thinking I lost a few nuts myself. However the ladies exchanged it for me with no fuss. So too you two, thank you. Thank you for your wonderful customer service and for satisfying a customer. The second piece tasted wonderful. I apologize if I made things awkward for you. I don't like being \"that customer\". I wish I caught your names. Hopefully management reads this and can reference the time stamp to give you the credit you deserve. Cheers!"}
{"text":"Nice employees, fresh great apples, and they have a rewards program - what's not to love.. Get ur apple grub on"}
{"text":"I love coming here! Mostly for Yogurtini that's connected to it. It's a weekly habit that my fiancé and I have created. The staff is very nice and professional and it's always well cleaned and the toppings are always well stocked! I absolutely love coming here and it's always my go to dessert!"}
{"text":"Staff are friendly and chocolate is delicious. They offer rewards program and sometimes military discount."}
{"text":"This is a fairly new location for Rocky Mountain. It is combined with Yogurtini. I usually get their caramel apples and they have all been fresh! Their employees are generally all nice. One employee took time to explain the reward program which was appreciated. Just in comparison with other Rocky Mountains, they seem to have less choices regarding their desserts. I'm glad this place is in Norterra now and close to home!"}
{"text":"This staff sucks. I can't believe they are still in business. Sorry to interrupt your conversation with your coworker. Didn't mean to put you out. SMH."}
