{"text":"I will preface this by saying that I really wanted to like this place.  I've been to many churrascarias and I was truly looking forward to having a new Brazilian steakhouse close to home.  

Unfortunately, our experience tonight was less than great.  To begin with, the best cuts of meat were scarce, rarely did we see any Picanha, Fraldinha, or Alcatra.  Instead we saw a lot of chicken, sausage and pineapple.  Ginger beef and Garlic beef were both dry and overcooked.  The service was slow and often there was no meat to be seen anywhere in the restaurant.  Our server wasn't very good either.  She was friendly, but rarely did she check on us.  At one point my wife finally got sick of waiting and just went to the bar to get another drink.  I also question whether some of the gauchos actually knew what they were doing, as they seemed to have difficulty cutting the meat precisely and locating the rare pieces that we requested.  

Compared to other churrascarias that I have been to, Rodizio is average at best.  The only reason I give them three stars and not less is because the price was only $32 and I guess you get what you pay for.  My wife and I both agreed that we'd rather pay more and get quality meats, cooked properly and brought to the table often.  If you want an inexpensive Brazilian barbecue experience, I guess Rodizio will do, however if you want the real deal, then make the drive to Scottsdale and go to Fogo."}
{"text":"My husband and I really wanted to like this restaurant (since we live in the neighborhood) but after trying it twice we left feeling underwhelmed. Both times we've visited the service was less than great, salad bar had many items that were out or not restocked, and it took nearly 20 minutes before my husband received his glass of wine. Now I will say timing is everything. While waiting for a server to come to our table we noticed many attentive servers... however we didn't have that experience. Maybe it's a luck of the draw, but we're not sure we're up for the gamble again. In our opinion, we'd rather travel to Scottsdale for better service and quality."}
{"text":"Love that we have a Brazilian restaurant in the east valley now. It's closer than Fogo de Chão in Scottsdale,  it's less expensive, and I found the food to be equally as good.  I would highly recommend it."}
{"text":"This place is top notch! The service alone was enough to say I would come back. The meat cutters were very friendly and talkative. Brad and Carlos were my favorites. Theresa was our waitress she was very good too! Now the food. This is definitely a place for meat eater! The sides and salads were good. But the meat was great. They had a good size rotation of 12 meats ranging from sausage, chicken, Beef, lamb, pork and this pineapple that is grilled. The owner Nick walked around and introduced himself. He was really cool. I had a great experience and we will be back."}
{"text":"I decided to give them another chance tonight. I really wanted this to be my go to place for entertaining clients and getting my beef fix, but it just won't do. 

After we were seated we waited, perhaps five minutes, to be greeted by our waitress who smelled of cigarettes. 

From the time we were seated, just before 5:30, it took about fifteen minutes to be offered our second meat option of any type. It took a full 31 minutes to see picanha get to our table. I purposefully never left my seat and timed it, because it was getting so crazy.  

When picanha did make it to our table the server cut a \"cube\" off the end of the cut. This was a first... and I asked him to cut it the traditional \"C\" shape sliced way, so I would be able to get a slice that included both the fat and the meat, and he said they were supposed to cut the charred parts off.  If you understand picanha at all, you'll know why this could bring tears to a gaucho's eyes. 

Since picanha is basically THE reason I go to Brazilian steakhouses, this travishamockery sealed the deal on my last trip to this establishment. 

In keeping with the tradition of my previous trip, the salad bar was completely out of bread... on two trips separated by at least ten minutes.  See photos. 

On a weird and \"first time that's happened\" note, a member of the staff came by randomly and jerked away the chair I was using as an armrest and shoved it under the table, because she \"didn't want anyone to trip on it.\" ...I'm not sure what would have happened if someone had been sitting in it. If that chair was a tripping hazard why did they put it there for someone to sit in?

On the way out I visited the men's room. Slung over the stall door were parts of a server's gaucho uniform. I get it, employees need to go too... but perhaps a hook inside the stall would enable employees to \"go\" and not remind all their customers about the guys serving their food doing their business. Also... both automated soap dispensers had blinking red lights and did not work... and the paper towel dispenser at the sink also did not work.  Sure, not the end of the world, but it just speaks to the level of pride in their establishment and how they care about serving their customers.   

On a positive note, they seem to have fixed the water/dishwasher problem, seeing as how the water tasted great, and no longer soapy."}
{"text":"Very disappointing.  Service is poor, and below average in comparison to restaurants in the Gilbert area. Made a reservation and had to wait for 25 minutes.  Food was just okay: salad bar is very basic, not well stocked, and nothing special.  The meat was OK, and the meat servers were inconsistent in their coverage. We did not get some of the flavors.  The place did not look clean.  Floors were slick, so be careful.  The restrooms were disgusting, and looked like they have not been cleaned for a while.   I would never go back again."}
{"text":"Food is great, but if you end up sitting near the bar or on the south east side the servers never make it over.  Been there twice, same experience each time so giving two starts as service is inconsistent at best."}
{"text":"I went to this restaurant for the first time tonight. The interior design is pleasing; although it's a bit noisy. I waited in an empty restaurant for some time before they found a table for me. I never had one single server to deal with. It was confusing since different people kept asking to help me with no co-ordination. The salad bar was plentiful and served very tasty items. There were meat and hot dishes on the buffet so it's not necessary really to order the more expensive meat meal. Perhaps I didn't understand, but I only saw beef being sliced-no chicken or other meats around my table. My server sliced a rib eye steak that had absolutely no taste to it and several pieces of the slice were tough and chewy. $40 was too much for the 2 small slices of tough, raw beef I was served."}
{"text":"Honestly, I can't give more than 3 stars after making a reservation and STILL HAVING TO WAIT 45 MINUTES. BUT!  Alan took care of us at the bar, spectacular caipirinha with Fogo cachaça. The buffet had a great selection of traditional potluck Brazilian dishes, and I would highly recommend the stroganoff. Meat came out tender and well seasoned, hot off the grill. Worth the wait after all said and done, will come back for more!"}
{"text":"To start off I had a good experience with my service from the moment I walk in greeted by a very friendly host, and service was EXCEPTIONAL  food was awesome fun atmosphere overall a good time, my wife and I had a great evening for the bad,  I had ask the manager a question I believe her name was Shauna? Now correct me if I'm wrong, but as I was saying I had ask the manager a question and SHE WAS SUPER defensive,  she almost yelled at me she uses a tone with me that I knew was not RESPECTABLE to treat guest at the end of the dinner me and my wife were speechless we didnt know what to say other than she was UNBELIEVABLY rude but because of our excellent service we received we will be back but I hope that lady is not!"}
{"text":"Amazing! I love fogo de chao and this is just as good and close to home. It is even less expensive!!!! Will be coming here a lot in the future"}
{"text":"I was prepared for an enjoyable experience and it was just okay. We had the $29.95 unlimited salad and sides plus the table meat service. They had a specific name for this particular fare but, I don't recall  what it was. Anyway, the salad and sides area was not well maintained although the selections were fairly broad.  The meat service was very slow at first but picked up after a while. The meats were okay for me, nothing spectacular but all in all the meal was filling. Would I go back again?  Probably not but, it was a different experience."}
{"text":"This was our second time at this restaurant.  The first time they lost our reservation, and once they sat us, service was a bit spotty.  I decided to try them one more time, as I thought they might be working out the kinks.  We went again this evening, we were there for over an hour and meat only came to our table five different times, with only two different varieties.  I finally asked to speak to a manager, and once I let her know that I was unsatisfied, she said she would only charge us for the salad bar and our sodas.  My husband and I were eating with our four children, we only went to the salad bar once, didn't eat more than 3 ounces of meat apiece, and the manager gave me a bill for $134.  We paid and left.  I am beyond disappointed at the service, and the manager's response to the situation."}
{"text":"I stopped in the first night in town and I was so impressed by the service, food and hospitality I actually came back the next day. Annamarie and Shauna literally made both our nights top notch. We will be back in a month or so with a large group and I expect nothing short of an amazing experience. They have already proved themselves 5/5 two times already. Service is top notch and I roll around with big guys and we were beyond full by the time we left. Salad bar is top notch and the meats are killer. I see people knocking the fact that they don't have Filet... try the garlic steak and prime rib and you'll be sure to come back. Annamarie, David, Shauna... thank you for the tremendous service!

Paola was extremely respectful when calling in for reservations and even accommodated is when we were 20 minutes late.

I will be back!"}
{"text":"If I hadn't been to similar types of restaurants I think I might have been more impressed. Beautiful salad bar. But of all the variety of meats none were worth coming back for. Most had little flavor and the cheap cut quality was palatable. We went for a family Sunday dinner and the atmosphere was like being at TGIF's. Everything was loud except the meat server. Really wanted to like it but so disappointed. I'll will be surprised if it lasts."}
{"text":"Great service overall. Our server (Stacy/Stacie) is so nice and knowledgeable.

Great food.. drinks are fantastic!"}
{"text":"I knew I would like this place within a few minutes of sitting down. The wait staff are incredible, intelligent, helpful and witty. Teresa is probably the most enthusiastic waitress I have ever met. As for the food, I might not be able to pronounce any of it but it's all terrific with a couple standouts: linguica, and the beef stroganoff. They have these lime aid things that are wonderful too, and the glazed pineapple, which I thought would be awful turned out to be one of my favorites. 

I'm thrilled Mesa has a place like this now. We'll be back, soon."}
{"text":"Easy to make reservations, great atmosphere , seated right away. The food as always was perfect! Only down side was how long it took to get our drinks, a little to strong but still very tasty. We will definitely be coming back again and again!"}
{"text":"The wife and I got hard core bubble guts (Montezuma's Revenge) within 30 min from eating dinner.  We are thinking it was the horseradish dressing from the salad bar or maybe the crab salad."}
{"text":"Made a reservation for 14 a week ahead for company's leadership. We drove from Tucson. We were told they lost the paper that had the reservation (and that all reservations are written by hand).  After speaking to the manager they said they couldn't honor it.  We had to find another place to take our party of 14 last minute, 30 mins away.  Not impressed with how they handled it."}
{"text":"I don't usually do 5* but this place is in my top 3 restaurants in the country. I used to practically live at the Salt Lake location and I'm positively ecstatic that there is now a location here in AZ.
I just met Chef Nick and he's opened all of their locations. He and the staff here are genuine and just as amazing as Salt Lake.
My belly and heart as so happy they've opened up here. It is not only a carnivore's dream but even the salad bar is insane. Any place that serves food until you tell them to stop is tops on my list. 
I prefer this laid back, fun atmosphere over any of the Fogo y Braza or de Chao or any other Fogo. 
And this is the only restaurant on the planet where I'd let them sing happy birthday to me. Once you hear it, you'll know why. 
Somehow I need to gank the recipe for their little cheesy breads.  
I can't wait until Oct for the exotic meats month."}
{"text":"Rodizio Grill was amazing! I was really impressed with the quality and quantity of food and Brazilian drinks. Our waitress Emily was very knowledgeable and kind . In addition we had a nice conversation with  Thomas as he was serving our delicious meat. Let's not forget the Nathan the bartender his caipirinha was the best. He was right on target on making  our traditional Brazilian drink. Kudos for all the staff and the manager of the restaurant!"}
{"text":"I Love everything about Brazilian/Portuguese food. My wife and I have been here many times along with introducing friends to the place, celebrating birthdays or just craving good food. If it's your first time and you're not familiar with Brazilian food, make sure you wave down the Gaucho with the Picana, it's the best steak Brazil has to offer. aside from table side meat carving, they have Feijoada! which is fantastic, I was looking forward to more meat in the feijoada but realizing it's self serve and pretty much all you can eat, I understand the need to control food cost. The salad Bar as well as the hot foods are traditional and delicious. Getting a bread basket when you sit down at a restaurant is always a treat for me. I'm a man who loves his fresh baked bread and butter. Sitting down here and getting a basket of pao de queijo (which i haven't had in years) was heavenly. The service hasn't been its best when we've been there, but never ruined our evening, the staff is always friendly but always seem a bit disorganized and chaotic. Even so, living farther away now it's still worth the drive."}
{"text":"My husband & I went to Rodizio Grill for our wedding anniversary dinner. The salad bar was great, not just mixed green etc,etc, but other great tasting food.. be careful not to fill up on the salad bar cuz you'll want you appetite for all the meats.... Our waiter Laura was very nice and funny. She also recommended her favorite sangria & dessert and it was YUMMY!!!..Thank You Laura! The gaucho who brought our meat to the tables name was Dallas and and he was great, he had a polite and courteous attitude... He was also funny and recommend his favorite said it tasted like his moms pot roast and it sure did!!!! Was my husbands FAVORITE!!! we would love to have him serving us when we return...we will be back and will be recommending this restaurant to our friends!"}
{"text":"Brought my boyfriend and his friends here for his birthday yesterday and I was less than thrilled with my experience. It was our first time here, I made a 4pm reservation for 4 the day before, we arrive around 3:45-3:50 and we still had to wait to be seated. Anytime I've made a reservation and arrived early, I was seated immediately. After being seated we were given a drink menu and waited for our server, we ordered a couple drinks and got some food. The salad bar was decent and the other hot sides were good too, my boyfriend especially liked the kale salad. Once we returned to the table we noticed there were no napkins at our table. We never got any in our settings! We waited a good while for our waitress, Sonia, to return to our table and I asked her for napkins and let her know there were none at the table. We wait around another good while, and she finally brings us a tiny stack of COCKTAIL NAPKINS. The guys ordered 3 flights for themselves, $12 a piece, they enjoyed those and ordered a Caipirinha for each of them. They were ok, if you like sweet drinks. The guys often had long wait times on their drinks too. Mind you, it was pretty slow when we came, there were probably 3 or 4 other tables seated. Later they ordered the martinis and one came with a FLY IN IT!! The meat was ok, the selection was pretty small and sweet and spicy chicken in rotation???? Not only that, anytime they sliced the meats I cringed because they cut off the worst, most inconsistent pieces. When I go to Fogu I get good slices, here you get a cube off the side. The server path was AWFUL. We waited at least a good 20-30 minutes between meats and ALWAYS got the left overs, cold and rare. Which sucks for my boyfriend because he ONLY eats anything well done and all that was ever left was rare. I requested TWICE for them to come with well done and never once got any. So my poor boyfriend couldn't fully enjoy his birthday meal. After being there longer than an hour and it got busy and service got even slower. We only got our waters refilled twice. One of those times was by a woman who wasn't even our waitress. I constantly saw our waitress wandering around but only came to see us 3-4 times in the 1-2 hours we were there. One of which was to let us know she was handing us off to Edwin. He was a bit better. I let him know it was my boyfriend's birthday(which I put in our reservation notes which was ignored), and then they came back with a dessert flan for him and sang a birthday song in Portuguese I'm assuming which was really cool. The song itself sounded cool and somebody was drumming, that alone made the experience a little better lol Overall, this place is probably better off passing. I would rather splurge and have a MUCH BETTER experience at Fogu."}
{"text":"Another great experience! This was our 2nd time there.  We went for Mother's Day!  This time we brought the kids.  They loved the experience and they thought it was so cool to have the servers come to your table and offer different meats. We will be bringing the kids back for their kids eat free promo on May 29-June 1st.  Glad they are offering that promo."}
{"text":"Don't let the 3-star rating scare you off, especially if you like a variety of meats and/or your beef
 cooked medium-well.  We tried this for the first time last night.  We were with 3 other couples.  Dinner started out well, with a nice server named Will.  A couple of us went up to the sides/salads bar, while the others wanted to eat their meat, first.  Big mistake!  It's prob timed so that you get full on the sides, so you won't eat as much meat.  It was prob a good 30 minutes before we saw any meat.  Let's just say that 4, M&M-sized chicken hearts was not what we were expecting for our first impression of \"meat\". Eventually, more skewers of meat made it's way to our table, but the pieces were small and on the med-rare side.  We thought that after asking for well-done over and over, they may just bring some out.  In their defense, they finally did, but sadly, it was so salty and gristle-riddled, we weren't willing to wait any longer.  The time between skewers was really awkward.  If I ever \"had\" to go, again, I would opt for the sides/salads, only...no meat.  As for the sides/salads, my husband, who is pretty picky, had only the mashed potatoes, while I had some soup, salad, fruit and a couple of sides.  The fresh pineapple was good, as expected, and the scalloped potatoes with bacon and the coconut/pineapple coleslaw was the best thing I had.
A few nights earlier we ate at Texas Roadhouse, and we can honestly say, at half the price of Rodizio's, it was A LOT better.  You should def try it, yourself...I know of others who love it."}
{"text":"I truly believe the people who have given this place high ratings have never been to fogo de chao. My husband and I are regulars at Fogo and had really high hopes when we first tried this place since it is so much closer to our house. We were sure we had found our new Brazilian restaurant. Boy were we disappointed. The meats were horrible and the salad bar even worse. The service was atrocious. We called the manager over to ask for a list of meats-they don't have it. The girl was young and seemed very inexperienced. I know this place is half the price of fogo but I would pay double and drive double the distance to never have to eat here again.  I would never go here again under any circumstances. If you can afford better, save yourself from the mediocre (at best) food."}
{"text":"We had an amazing Mother's Day here! Such a great place to celebrate special occassions. Thank you for taking care of us and filling our bellies with joy and as well as our hearts!"}
{"text":"Okay I have to admit I was super excited to come try this place it's right across the street from my cuz house there'll be just as good another place that we go to but definitely not it is cheaper though first off they took on gas not charcoal which he just lost tons of flavor right there maybe that's why all the meat is so salty I mean really salty they don't have very good choice them it's either it seemed to me that the only bring the cheap Cuts all the time only one time they brought good cuts on me the lamb is horrible very gamey could not even eat it by 30 bucks I guess it's okay still rather spend a little more and get something I like the salad bar is lacking as well best thing was a fried bananas and their lemonade drinks those were quite good probably never go back"}
{"text":"This was a wonderful experience. The staff was accommodating and kind. The gouchos were relatively knowledgeable  (some of the kids needed more training on the different cuts of meat so it wasn't their fault). And the meat......... so good......so flavorful, and what a variety.  Oh, and you have to have the grilled pineapple with the ham!  Yummo! I had the creme brule for dessert. Just a hint of orange. Very creamy. My only constructive criticism is, too much hardened sugar on the top. It was a bit thick for my taste.

I can't wait to go back."}
{"text":"Update - I am giving an extra star because on the way out the door we got a gift certificate and \"Thanks for the feedback\". The certificate was nice though only for two. And really, accepting feedback and accepting responsibility are a little different. 

We had a party of 18 for a surprise birthday party. The staff assured us a private room. When I called the day before, I discovered we didn't meet the minimum for a private room - no one bothered to proactively tell us.  But we were offered a free round of drinks and dessert, and a commitment of semi private space for our event - awesome. We found when we arrived it wasn't semi private at all because our party was too large. Again no one bothered to tell us in advance. The food was fine, the waitress did a good job but she wasn't properly supported by her management - it took 30 minutes to get our checks because apparently the POS system can't track by seat. Management made excuses and lacked empathy on every topic. Had we been aware of the seating challenge we would have understood and sorted it out or gone somewhere else; instead we were baited and switched. There were many opportunities to fix this experience but due to their lack of transparency and basic restaurant management around large parties, it's a miss. I felt duped into having a lovely event at a place of business not prepared to support."}
{"text":"Our first visit and we were not disappointed! We sat at a booth at the perimeter and the gauchos made it to our table numerous times and in a timely manner. The salad bar was fantastic, hot sides looked a little long in the tooth. Who cares? Those are wasted fillers that you can be filling youself with the delicious meat selections! Good drinks, excellent meal and dessert. We also had the pleasure of being served by to extremely polite young men, Dallas and Isaac. You could tell they took pride in their work and were unendingly pleasant. We will return and highly recommend this restaurant!"}
{"text":"(Update) My wife, child, and myself had an opportunity to try here again and it was absolutely fantastic. The service was prompt, and we got our sides quite quickly, even though the place was very busy for dinner. My Brazilian wife and myself tried the feijoada and it was delicious and authentic. We will be returning again!

***********

Wow were we let down by this place. We'd been wanting to try this place for awhile, and we finally did. Took about 40 mins and asking the waitress several times to get our pão de queijo and other sides. Literally didn't see her for over 30mins. Absolutely horrible service. 

The feijoada was inedible and frankly, very unappetizing. This is the worst Brazilian restaurant we've ever been to, here or Brazil. Will never be back, and will be sure to earn othe"}
{"text":"A bit pricy for what you get. It would be nice to see an actual list/menu of items available in regards to the meat. My personal favorite was the garlic beef. Others in my party liked the sweet hot chicken."}
{"text":"What a treat! Wife and I just returned from a delicious dining experience at Mesa's Rodizio Grill. The meats were rare, tender and juicy with heavenly good flavor. The salad bar was excellent. Service was very good. Shawna Fitzgerald, the charming GM is a real pro. My favorite was the sirloin, soooo juicy and tender.  My wife's favorite was the bacon wrapped chicken which had an incredibly good flavor. EVERYTHING  was delicious."}
{"text":"We typically go to Rodizio a couple times a month and this place is superior to Fogo.  The salad bar is better and the meats are the same but half the price as Fogo.  Our second time we were there we did have the issue of getting the meats at our table as well but we haven't had that issue in some time with being seated on the outside of the serving lanes.  Whenever we have asked for a specific meat they have always been very prompt in bringing that particular meat.  You have to try the chicken hearts super delicious!  Keep up the good work Rodizio!!!"}
{"text":"Tried this new restaurant with our son and Brazilian daughter-in-law, whom were so excited to have an authentic Brazilian food restaurant in Gilbert/Mesa! The best service from; owner - Nick, cook - James, the whole staff, and of course all the amazing meat serving Gauchos! We've been to Brazil many times and this would rival anything we ever ate there! Definitely going to be a family favorite!  Go hungry!
 Obrigado!!"}
{"text":"Amazeballs!!! Love love love this place. It was crazy good and servers so nice and attentive   Not to mention the meat. It was melt in your mouth cooked to perfection amazing."}
{"text":"We gave this place a second chance yesterday.  I went when they first opened and service was horrible.  You should leave this place stuffed but we had such trouble getting any one to come to our table with the meats.  I've been to several other Brazilian steakhouses and the variety wasn't as good here.  We went back yesterday for Mother's Day.  When we sat down the table which was set and reserved for us had dirty plates and utensils on it that we had to have changed out.  Service again was very slow.  We had to ask for water refills and the little Brazilian bread that they normally bring to the table.  The meats were almost all dry and over cooked.  The poached salmon they advertised for Mother's Day wasn't brought around until we were already done.  Our server was cute in a corny way.  He tried to make us welcome with his jokes but overall it was not a good experience.  I'd rather have attentive service than talkative."}
{"text":"We had such a wonderful experience the first time we went to Rodizio that we had to go back !!! We loved the food, the server, the ambiance ! Everything was just up to perfection !!!!!! 
Will highly recommend this fantastic place, you won't be disappointed !"}
{"text":"Excellent all the way food ,customer service .Being my first time in Arizona an it also was my bday damm my fiancé sure in the hell did pick the best restaurant to go to two thumbs up guaranteed but I got to say the spicy chicken is fire  dam I didn't not pay attention I thought the waiter said sweet and sour chicken would you like to try some !!!' Dam I was in for a surprise it was deliciously spicy ."}
{"text":"Yummy food and in served in a fun way. Laura was an amazing server and so was Brian the gaucho! We came to celebrate a birthday and it was a great choice!"}
{"text":"I am a big fan of anything involving unlimited slices of freshly cooked meat, throw in an endless salad bar and I'm in heaven! So, when I saw a new Brazilian BBQ spot opening up in Mesa I knew I had to try it! I decided to go for dinner with my hubby one night after the spot had been open for a few months (so service would be smooth) so we made a reservation and popped on in. The ambiance was okay, clean and the decor was pleasant. We were greeted and asked to wait a few minutes since we had arrived early. 

Once seated, our server introduced himself, took drink orders and explained the options (AYCE cuts and salad bar $32, salad bar only $19-21 I don't recall the exact number but it seemed steep for salad). We selected the $32 option and were on our merry way to full belly happiness!

Once the server left we grabbed our plates to load up at the salad bar, which consisted of cheeses, salami, a few gourmet olive options, several salad options and warm entrees. I was surprised not to find heart of palm in any of the salads as it has been at every other Brazilian restaurant that I have visited. They did however, have rice and the traditional toasted cassava flour (farofa) and stewed black beans (feijoada). They brought cheese bread (pao de queijo) and candied bananas to the table.

The meat selection that came by the table was a bit slow and consisted largely of different types of chicken (sweet and sour, bacon wrapped, house spiced), beef (tri-tip, tenderloin, sirloin) and a sprinkle of lamb and sausages. 

After eating entirely too much we decided to finish the night off with dessert. I ordered the flan, which was possibly the best I've ever had. My hubby ordered the chocolate torte, which was massively underwhelming. 

Overall the food was \"okay\", the salad bar, cheese bread and dessert were our faves but the meats were not as good as we anticipated. We felt it was too expensive for what we ended up eating, the cost for both our dinners and 1 non-alcoholic beverage was over $100 after tax and tip. The food wasn't tasty enough to warrant the high price tag and the service left something to be desired. We won't be back."}
{"text":"We treated my wife and Mother in law to Mothers Day dinner. 7 Adults and 1 child, made reservations and checked website before for pricing. Mother's Day brunch ended at 3pm which included Salmon and Ny Strip, but these options were pushed onto the dinner menu once we arrived for dinner and the price reflected $42.99 full Rodizio. Half the bins were empty on the salad bar at 5:30, the NY strip came around once and the Salmon never showed. We were not greeted by our server once we were seated and I had to request another server take our drink order ten minutes after we arrived. Our server showed up halfway through dinner and acted very awkward. Of course the server pushed the 20 percent tip into the bill for the party of eight even though he was only there to refill drinks for half the meal. Over all $400 dinner for 7 adults and a 4 year old, poor value for us. Great value for the server who made an $80 tip off our disappointing celebration dinner. We have been many times, but this will most likely be our last. We have noticed a decline in service over this past year, servers expect tips in today's world, whether they work for it and present a pleasant dinning experience or not."}
{"text":"My group of 9 came in for a birthday dinner on Saturday night. The food was delicious! But we had some stumbles. The free restaurant week drink was gross and I didn't get the one I asked for. I was able to successfully order, receive, and consume 1 draft pint of beer over our 2 hour dinner. The meat servers were awesome. They seemed to catch on that we were out to celebrate and have a great time. They had great energy and were attentive to the group. The server was untrained. With some attentiveness, setting expectations for the UX, and attention to detail he could have easily tripled the price of the bill and added 10-15% to the tip. Our poor server also botched the birthday boy's dessert, bringing the wrong dessert to the wrong person... but only after announcing the 'surprise' was coming. *face palm* The server was a nice kid- he just needs training. In fact I was impressed with his customer service soft skills. Now to train on sales and hospitality. It was a bit of a shakey ride but we will be back. You had me at garlic beef, marinated pineapple, and bacon chicken!"}
{"text":"I happen to find this place by a fluke.  I was in the area and happen to drive by it and decided to stop by.  I was with my other half and we came her for our 7 year anniversary.  

The service was good.  The lady seem to be there when we needed drinks.  I did not understand this was restaurant week either.  It was busy too.  

Now to the meats.  The meats were good, but did not seem to be consistent with the timing or any rhythm.  There were a few spells of waiting for the meats.  It could be because of the restaurant week.  Since this was my first time here I can not judge.  The meats were tasty and seem to be fresh.  My favourites were the pork sausages and the chicken wrapped in bacon.  The other meats were good.  I did love the meat that had a bit of a higher fat content.  I can not remember which one, but it was good. 

The desert was good too.  I had the limeade drink, but had a small amount since it had dairy in it.  
I liked this place and understood it was hectic during this week.  I will go back and give it another shot. 

My hearing is not that great.  This place can get loud.  Just a FYI."}
{"text":"Brought my daughter in for her first Brazillian experience today, her response was: \"This is like, Christmas morning amazing. Maybe this year we can start a new tradition, I don't need the presents, I just want all the meats!\" Thank you to Rodizio staff for a great experience. We couldn't have been more impressed!"}
{"text":"Came here for the first time. Food was amazing. Well seasoned and juicy. I had a great person bring my food. If you go there ask for \"Chad.\" Anytime I wanted a certain type of meat, he brought it right away. Had a great time. Will be back again. The grilled pineapple was bomb too!"}
{"text":"Previous review deleted for some reason. rare food and terrible service for rodizio style of restaurant. We paid 30 minutes in and walked as we'd only seen two meat choices (both closer to rare and poor cuts) and a single frog leg between 3 very hungry diners. Unlikely to be the servers fault but you'd think you could at the very least fill (or refill) a drink.

Will give it another shot after the new year and revisit this review + update if things change."}
{"text":"I really wanted to enjoy as well as love this restaurant.  I was not impressed. I was so excited to go there as I have eaten in other Brazilian, was so excited to try this one. The meat choices were over cooked and the sides while looking fantastic, did not live up to the hype, (reviews on site) they forgot to add salt to bring out the flavor of the dishes. I asked our waitress about this and was told that, \"Because we have a lot of winter visitors, we do not add much salt to our food.\" What about those of us that want food that is tasty?"}
{"text":"Oh boy....get your stomachs ready for this rodizio grill. If you've never gone for Brazilian it's like a buffet except that the meats come to you. There is a wooden device at the table with one side painted green for \"let's fill this tummy up with unending skewered meats!\" And the guys come out with different meats on a skewer  (Such as Garlic steak, ginger steak, pork sausage, chicken, chicken hearts, bacon wrapped chicken, sirloin steak, and even grilled pineapple) and bring out this dangerous knife to cut while you use your tong to grab the pieces.   And then red - for \"Stop! I've finally controlled myself and I just cannot eat anymore and my pant button is about to explode!\" 

For a table of 10 we all chose the Rodizio choice for $32 which comes with meat and the salad bar (aka the fillers). Other option is just the salad bar for about $21 or so. The salad bar is comprised of normal salad items for a salad bar, along with already made side salads such as couscous grape salad, little mozzarella balls and cherry tomatoes, a mixture of different olives, asparagus, pasta, fish stew, collars greens with bacon, and more. 

Since it was someone's bday the band comes over to give you a wishful musical and a piece of unpresentable but probably tasty flan with a candle on top. 

Everything was pretty decent except two people in our group got the bacon wrapped chicken and cut into a bunch of rawness chicken. Ugh!! They stopped eating he chicken for fear of food poisoning. Otherwise price wasn't too bad and the rest of the food was edible."}
{"text":"We've come here 3-4 times and absolutely love the food!  Bonus that the service is amazeballs!   Erin was our server again and we were so happy to see him.... awesome service and very friendly!   The Groucho's are wonderful, especially Dallas.  We see him every time The one guy with the longer hair has been here every time and have been so happy with his  professionalism and friendly service!  If you haven't tried this place, you really need to!"}
{"text":"The food was great and fresh! Compared to Fogo de Chao, there was less variety, but more exotic choices. For example, Rodizio had chicken heart, which Fogo doesn't have. Also, Fogo had a larger salad bar, but rodizio was still plentiful. Overall, it is definitely worth the price and very good!"}
{"text":"Great service...hands down! Everyone was super friendly...but food quality leaves lots of room for improvement. Meats are fatty and cuts very skimpy. Fried plantains are great! Wished better cuts of meat were used : ("}
{"text":"This place is fabulous. I've been to a number of Brazilian Steakhouses, and this one has the best \"side and salad bar.\" The food on this bar is enough. Thank goodness they kept bringing me the meat anyway! Nom nom nom. We went for a Sunday brunch, so we had some breakfast and some lunch. (pssst....Bacon on the bar was some of the best I've ever had). The service was stellar, the meat was delicious and the bar was stellar. I'd live there if they'd let me."}
{"text":"Very disappointed...

I came here with my wife and 2 children as we love Fogo De Chao and dine there often.  When Rodizio opened I was very happy due to it being closer to our home and office.  When we went to Rodizio were not very busy and Very understaffed.  We were seated and waited 15 minutes for our waiter to come by and get our drink order..  Then ate at the salad bar and started to order our meats.  I was again disappointed by a few different items and I never even got a chance to try the lamb as it was always \"cooking\" when I asked for it to be sent over.  

I will not recommend this place or tell any of my friends to visit.  Recently a friend also visited Rodizio and had the exact same experience that I had along with many others as they posted it on Facebook.  I am very disappointed and will not be returning."}
{"text":"\"We have the meats!\" *insert Arby's voice*

We had a 5:15 reservation and were seated right away upon arrival. The restaurant is large and filled up pretty fast for a Tuesday night. Atmosphere is clean, modern cowboy (if that's a thing) and isn't a tad pretentious like Fogo de Chao. There were people dressed both casual and business casual and several babies and toddlers. 

Hubby got the signature caipirinha drink and said it was small but delicious. I got a non-alcoholic limeade pineapple cocktail that was coyingly sweet and tasted like a melted pina colada. This drink is the only non-alcoholic wirh free refills but I only drank half of #1. We chose to do the full experience of salad bar and meats unlimited for $32. The other option was salad bar only for $20. 

The star of our meal was the expansive and delish salad bar. After asking them to refill the empty plate rack, we pigged out on lettuce salads with a variety of topping options, fresh fruit, cheeses, garlic hummus, several cold salads (grape/walnut/gorgonzola, mozarwlla/tomato and the broccoli bow tie were awesome) were enjoyed first. We later went back for a plate from the wall of hot foods to go with Meat Feast 2017.  The mashed potatoes were our favorite of the hot foods. 

As for the meats, the parmesan crusted pork, marinated chicken, and sausage were the winners. None of the beef I tasted had much flavor, although it may have been the more well-done cut I was served. As long as your wooden stick tower (technical term) is flipped to green for go, the meat servers are in constant rotation at the tables and frequently refilling their meat sticks. Yes, I understand that sounds awful but it's the best way to describe it. Ha!  We waited forever for the dang grilled pineapple and kept only getting offered parts from near the core, not the caramelized grilled part. It was disappointing because this was supposedly the best and just tasted like microwaved pineapple. Meh.

The service was a tag-team effort and everyone was very friendly. They were frequently checking on drinks and our table sides (sugared bananas and cheese bread bites). I must admit that the table sides and meat are much tastier at Fogo but the salad bar options, service, price and atmosphere are better at Rodizio Grill. 

We were too stuffed to try dessert. However, our server saw that I am extremely pregnant (8  months with twins) and brought over a free flan and they sang their version of Happy Birthday for my upcoming birth. So thoughtful!  The texture of flan(like a slightly creamy jello) is a no-go for me with pregnancy nausea but my husband enjoyed it.  

Overall good experience. Next time, I will only do the salad bar. There are plenty of protein packed dishes there as well and I enjoyed that more than the meats."}
{"text":"They are okay on services, the foods some of the steaks beef and chicken so salty, and I have to do much water when I got home and kept drunk more water over night when I awake at night! I felt liked they treated us good, but only their foods did not treated us that good! I won't be back here for next time and will find other place have better food and treat us right! I am not recommended if you are not liked a salty foods!!!!"}
{"text":"Love the concept.  Husband and I went here for a late Valentine's dinner.  Even though we didn't bring the kids, I was somewhat surprised to see that it is also rather kid friendly, and there were several families there.

I'm not a huge meat eater, but I liked having the selections.  I thought the salad bar was great.  The side bar was okay - I felt like it would have been nice to have a few more side options - but then again, that's not really why people come here.  In fact, my husband didn't frequent the side bar at all!  Just meat and a salad for him.

I'd say this place is totally fun.  I can't see it as an every day type of dining experience, but for a special occasion, or to bring out of town guests, it's a nice spot."}
{"text":"They should call this place, \"Greasy Floors\". lol.. But seriously, the dining experience was not so bad. Large open spaces, comfortable seating, contemporary style decor. We had dinner reservations for two on a Monday at 5pm. A small line when we got there. First thing you'll notice is that the floors are interestingly slippery. I had asked a couple of waitresses why, but they didn't have an answer. Anyhow we went with the unlimited dinner option. My wife and I did like their salad bar, everything was fresh and we tried just about everything we could. There is one other Brazilian steakhouse I have eaten at, \"Fogo De Chao\" and I just don't think Rodizio can unseat them as far at the variety of meats. Other than steak/beef type options, you do get more chicken options and other meat options at here (that's not so bad). Also, you will not pay as much as Fogo De Chao. Everyone was nice. My server was attentive. I would be happy to go back. Now if they could do something about those nasty floors though."}
{"text":"Carnivores rejoice, I've found the perfect place for you! If you haven't yet had the opportunity to partake in the enlightening experience that is Rodizio, then I highly encourage you to do so! I can't promise you won't need the help of friends and family to roll you out of the place after dinner, however...

For a flat rate, you get access to either the salad bar (which includes some great options hot and cold such as fresh veggies, charcuterie tray, cheeses, collard greens, soups, mashed potatoes, and more!) or the Full Rodizio, which is where it's at! This gets you access to the salad bar PLUS the beautiful red and green hammer of gluttony, which enables you to indicate your desire to have their awesome staff swing by your table and offer up their incredible, juicy, flavorful temptations! They have everything from ham to sausages to chicken hearts to...every delicious cut of steak you can think of!  The meat just keeps coming and we won't judge you if you decide to flip it over to red for a moment while you take time to savor its awesomeness. 

Pro tip: Dont get all full on the salad bar!!! I like to start with a couple side dishes on the plate and commit the rest of my stomach's real estate to the skewers of heaven that their staff flies around with. 

You will be served some great Brazilian apps on the house when you're seated and as you nibble on those, definitely take a moment to look over the drink menu. They have some stellar options! 

And finally, after you're stuffed beyond all reason, they'll present you with dessert options. You'll want to say no...but you won't be able to form the word as you drool over the tray. Go ahead and take the plunge, the desserts are fantastic and quite shareable!

I've never had a bad experience at Rodizio, which is why I keep comin' back. A great place to go for some awesome food in a fun, gluttonous setting. 5 stars!"}
{"text":"Setup reservation 3 days in advance for my family of 5, walked in 5 minutes early after an hour drive(my Fiancé and I just flew in from Minnesota, my brother from Chicago, and our parents who we were visiting) to be told that we weren't in their system, they said \"We won't throw you out though, the wait will be 30 minutes\". We spoke to a few others around us and it turns out that 3 others happened to have their reservations vanish and had to wait. 

On top of that, they had an entire section of the restaurant with empty tables that they weren't seating people at. Just empty tables, their excuse was having lack of staff, at 6:30pm on a weekend. 

We were seated 45 minutes later, and the service was excellent, other than a lack of meat servers. Our server did a great job, and his tip wasn't affected by our overall bad experience.

Lastly, the glazed pineapple was awesome, but other than that, I was disappointed by the lack of meat options. 

Needless to say, we will not come back."}
{"text":"The food here was exquisite; however, upon arrival I waited at least 20 minutes to be seated even though I had made reservations hours before I arrived. The restaurant was completely empty, so I don't know what we were waiting for."}
{"text":"The food is amazing! Price is not terrible. $33 a person for unlimited amazing food.  The only reason it does not get five stars is that it took 20+ min to get a beer, a mojito and desert. Even after we spoke to the manager it still took another 10 min to get the dessert. My first mojito was over poured. They were kind enough to make me a new drink. The second one was made correctly and tasted wonderful. I personally do not recommend the dessert. They had 3 options. I had a fried cinnamon roll and my fiancé had the lime mousse. Cheesecake and the creme brûlée on the menu was not offered to us an option (would have preferred either of those option to what we had).  The Pineapple that came around on the sticks was much better. We never had got any sides. We only saw our waiter when he introduced himself and to take our dessert orders and for the bill.  We had to ask the bus boy for drinks."}
{"text":"First time trying a Brazilian steakhouse.  Some of these reviews may have been written when  the team was still new.  Dinner last night was great.  Server Emily was attentive, Colton was out primary Gaucho and he was fantastic.  Manager Shawna checked in several times.  Great food, excellent salad bar.  Everything was very tasty.  Give it a try!"}
{"text":"Okay, for $50 I expect good service. This short chubby waiter, I think his name was Eric/Erin one of those... omg worst customer service evvvveeerrr. Any time we requested something like water instead of saying \"sure, I'll be right back\" he will always answer back with a question or an excuse. We asked for water and he's like well you're gonna have to wait because I'm going to another table. He looked so annoyed by our party. He just sucked period... if gratuity wasn't forced... he would have gotten nothing! Food was good, but can be found elsewhere with good service!"}
{"text":"Isaac the cook was super helpful and the Brazilian menu was incredible with the juiciest, most tender, tastiest selections of meats I have had since I was in Argentina. 
Austin and Erin. We're our Waiters and did an excellent job,as did  All of the servers who came around offering their sumptuous wares from the kitchen. 
Great service. Positive attitudes and genuine care for not only our satisfaction but our total experience. 
5 stars. Can't say enough good."}
{"text":"Pricey, but worth it if you feel like splurging a little. Weekend brunch is the best time if you're looking to get the most bang for your buck."}
{"text":"Food is great! Both times been there have had horrible service. The servers have to many tables. Literally have to get up and catch server as she runs by. No drink refills. Won't be back!"}
{"text":"This place is amazing! I've always been a fan of Brazilian rodizios, and I was bummed when the one in Chandler closed down. My friend discovered this place and texted me this morning about their brunch menu. 

We drove all the way down there and it was totally worth it. The staff was super friendly, the GM even came to our table to say hi and served us.

The meat is delicious, the salad and side bars are full of options and the desserts are typical Brazilian. I'm sad I'm moving otherwise I'd make this my Sunday go-to every weekend!"}
{"text":"I have been here three times now, and each time has been exceptional. I would strongly recommend having a reservation otherwise be prepared to wait. This restaurant is relatively new to Dana Park so everyone is coming here now. Plus they have really good food and service so I can only imagine their repeat business is high as well. I personally will continue to be a repeat customer and recommend them to anyone that asks for a great place to eat."}
{"text":"We had a large group arriving at different times. We were seated right away but had to wait 15 min before the waiter even came by so we could order drinks. He had explained the process as some of the people were visiting from bout of town and never been there before.  A few of the meat guys stopped by before the drink order  was even placed which was the start to the confusion. We went and got the food at the buffet but still didn't have our drinks. Not even water. We came straight from a graduation ceremony and haven't had anything to drink for hours with the 105 degree weather outside and it took us over 30 minutes to get some water. A few drinks were wrong and one never came. The water never asked how the drinks were. I did not like the drink and was never offered anything else. The food at the buffet was ok but there were no clean plates.  The meat guys came before we got our drinks and were turned down, they stopped coming when we were actually ready for the meat. We were rushed through the whole meal and were brought a check while we were still waiting for the rest of the party to arrive as a few people got stuck in traffic. The whole thing was an unorganized mess and we were forced to include a 20% gratuity even though the service was not good. I don't know if I'll ever be back and will definitely not recommend this place for large groups as they can't handle it.
******Sent an email to the address that was provided but never received a response.********"}
{"text":"I think if you've never had a good steak before you would find this pretty good, but I thought the meat tasted terrible. You can get a better steak at sprouts. The service was excellent, but The flavor of the food was not. If you're looking for a good Brazilian place drive to Scottsdale, this is not worth the money!"}
{"text":"What a great place for a churrasco a rodizio (rotisserie barbeque) experience. The restaurant is spacious and we were promptly seated. After our server explained the concept and the menu items, we were off to the salad bar which had an impressive array of dishes: different prepared salads as well as separate salad components and dressings, ceviche, regular crispy as well as candied bacon, feijoada (Brazilian rice and beans, the national dish of the country), olives, pickles and more.  There are also a variety of sauces; don't forget to take a small bowl of chimichurri back to your table because it's the perfect accompaniment for the grilled meats. 
At the table, the servers brought the skewers of grilled meats - every one of them really good, my favorite being the picanha or grilled top sirloin. We were also provided little trays of side dishes which were a nice touch, especially the bananas fritas which provided a sweet palate cleanser in between the grilled meat entrees. I'm also glad they serve grilled pineapple, not only because it tastes good but also because pineapple contains bromelain, a powerful protein-digesting enzyme and hence really appropriate for a meal that included an abundance of meat items. In all, it was a very flavorful and satisfying feast, and priced right for the quality and quantity of the food we enjoyed."}
{"text":"Having been to many Brazilian steakhouses in the past (e.g.: Brazil, USA, Mexico), I can undoubtedly say this place CANNOT be called a Brazilian steakhouse, maybe a chicken house, but not a steakhouse. I've dined at this place 3x ... 2x dinner, 1x lunch. Last Saturday I went there for lunch and it was a very disappointing experience, perhaps the last time they will ever get my money. Not sure who owns the place but it seems to me Rodizio is one of those places that was set up to fail. Management does not seem to understand how a restaurant should function. The taste and variety of the food weren't great either. I will drive to Scottsdale & Lincoln next time (Fogo de Chao)."}
{"text":"Decided to give this place a try for lunch as we had a craving for some meat. That was a mistake, we walked in and waited at the hostess stand for 5-7 minutes in a somewhat empty restaurant (7 tables sitting). After being sat in a separate area from the other tables we met our waitress Erica after flagging her down. She adequately explained how everything worked and took our drink order. We got up to check out the salad bar which is truer the silver lining of this place as it was refreshed and clean, however the items in the chaffing dishes seemed to have been forgotten about. We finished up our salads and still had not received our drink orders (20 minutes later) We moved onto the meats and they were satisfactory and seasoned well when they realized we were sitting in the other room alone, but when you are so annoyed about service you tend to be a little bit more critical. I also found it odd that the gauchos were not all wearing the same uniform but they were very friendly. I don't think I would dine here again."}
{"text":"This was my 3rd experience and my best.  What made this the best was the general manager Shawna.  This young lady was putting out fires this Sunday before Mothers Day.  It was quite busy, there bathroom issues, long wait times and then me asking her when the bacon was coming out.  The regular bacon yum...and the candied bacon yummier.. were completely empty.  I assumed they would change it to something else as the brunch time was coming to an end and dinner would start soon,   I was wrong.  Shawna had the servers bring both types to our table and in true marketing fashion made things right there on the spot and apologized for other hiccups that day i.e. Bathroom problems.   Well done .  The food is always great.  The desserts and drinks amazing.   However this lunch.....It was all Shawna...hopefully she will get accolades from her superiors.   You have a jewel in Shawna.....and no I am not a relative...haha.  Thank you for a wonderful early Mothers Day experience."}
{"text":"This was our first visit here tonight, my wife heard about Rodizio and decided to give it a shot, we both went for the combination dinner salad bar and all the different meats you can eat, I'm thinking Bring it on well that didn't last to long as after the first round I was stuffed everything was great as well as the service, I told my wife as we were leaving, I think this is the first time I couldn't eat my money's worth, we had a great time and sure we'll do it again soon."}
{"text":"Customer service is fast and friendly but the food is only mediocre. I can't see how they justify $32 per person for their buffet and table-side meat delivery, which doesn't even include drinks or desert. If it were in the $20-$22 range - now that I could understand . It's one of those places where we went and paid (dearly) for the experience but I can't see ever going back again."}
{"text":"I wasn't a huge fan. It seemed like a lot of money for basically buffet style food. The meats were good, but I feel they serve them sparingly and infrequently hoping that you fill up on salad bar foods. Overall, not somewhere I'd want to go again."}
{"text":"Was not impressed. The services was very slow, to non-existent. Asked for the tri-tip on 4 different occasions with 3 different employees and never received it after waiting for 30-40 minutes. Very overpriced for the lack of service or attention to customers. Spent 1.5 hours in total most of the time waiting for different meat options. Went during a very slow time on a Tuesday at 5pm.  Food was mediocre at best for why you would expect paying $33 a plate. Will not be going back."}
{"text":"Extremely horrible server service. Upon arrival we saw two servers at the bar with their arms wrapped around each other. After a 20 minute wait we were finally acknowledged by the girl server from the bar. Her boyfriend was the other server who kept avoiding taking our table and any other table to wait on. He had no problems walking in circles around the entire dining room doing nothing. His girlfriend the server told us \"he doesn't want to take any more tables and that she was mad at him for that\" and told us she was taking all the tables. Looking around there were about 8 other tables taken in our area. 

We asked for a manager and expressed our concerns. He did try to make it up to us but it was a little too late for us. Our server was still busy with even more tables as her boyfriend looked confused. 

We were extremely disappointed in this dining experience on our anniversary. I think next time my husband asks if I want 'Brazilian Steakhouse' we will drive the distance and pay more money for a more pleasant experience at the 'Brazilian Steakhouse' in Scottsdale. Their employees don't seem like high school students and carry themselves in a more professional manner. 

I guess you get what you pay for and this dining experience sure taught us that with the customer service from the server who didn't want to wait on anyone. 

It's safe to say my husband will not allow us to go back. We might just stick to the Rodizos in Provo Utah when we are visiting Utah."}
{"text":"This place is amazingly delicious! Everyone is very friendly at Rodizio. Ask for Oscar or Ilse they are very sweet and will checked up on you very frequently despite the number of tables they have. The meat is good, the limeades are amazing and so is the staff!"}
{"text":"We have now eaten here at least 6-8 times so I can comment from a lot of practical experience.  And since they still give club members a free full rodizio meal for their birthday, we went again last night since it was my birthday!  Five adults and my granddaughter.  Please forgive me for this long review, but I think it might be helpful to other Yelpers to fully understand my thinking and this establishment.

We got there at 6:15 pm for our reservation and were seated promptly and efficiently.  Our whole meal, including trips to the salad and \"accompaniment\" bar was great and with not a single negative comment by anyone.  But the one complaint I have is with their beverage service.....very slow and inefficient.  Got our beverages wrong twice, and even tried to charge me for the extra beverages involved in the beverage screw-ups.  Soft drinks are served quickly and efficiently, but drinks from the bar take much too long to prepare and sometimes never arrive at your table without a whole lot of follow-up asking.  This beverage fiasco has happened to us on multiple occasions so it must be either a beverage ordering/prep system failure or a failure with their bartenders/bartending system.  Management should look into this carefully and fix it, since I can be frustrating for their customers (look at all the other reviews that complain about beverage screw-ups).

Sometimes the gauchos serving the \"meats\" are slow to come around -- especially with the premium cuts of meats.  But last night's service was fast, efficient, and frequent.  We got our fill of beef tenders, leg of lamb, picanya, and other cuts as well.  Oh yeah, the beef last might was very tender and not over salted as it sometimes is.  I don't mean to sound critical, but since we have eaten here multiple times, there have been occasions where the beef was tough and over salted.  I am pretty sure that meat tenderness/grading might sometimes be a little hit-or-miss and the restaurant depends upon its suppliers for most of the meat quality (e.g.-even if the beef is graded at USDA Choice, different pieces might not be equal in tenderness). One last comment about this topic -- the gauchos also came around frequently with different meats with different degrees of doneness; e.g.-rare/medium rare/medium).  This was great for us since my son and I love rare meats and most of the girls in our family like medium.


Also, for the first time in all our visits to this place, one of the managers/supervisors (female) came to check on our table and ask if we were satisfied and if she could do anything for us.  This is a nice touch since sometimes a guest might want something, but last night, everything was pretty much on point.  Oh yeah, they also offer a children's full rodizio menu option which is great -- $11 per child, as opposed to the adult price of $36.


I was happy with this visit and with my birthday.  I also got a free birthday dessert which my GD promptly demolished!"}
{"text":"This place was awesome! !!  Came here last night 2/24.  Our server David was badass, if management reads this please give David a bonus.  Very informative, funny and made the experience even better besides having an amazing dinner.  5 stars, great service from all and great food. We will most definitely be back."}
{"text":"As a mother, I'm pretty used to being pestered all day long. That's kind of how it is dining at Rodizio Grill.  Just as you take a bite of something or start a conversation at your table, up comes a server asking how you're doing and offering you something else.  If you're a big time carnivore and love a room full of energy, you might totally love it.  If you're an introvert who only occasionally eats meat, this might drive you a little batty.  This place was kind of sensory overload for me, but I know the others in our group loved it.  

Our table was on the far left by a screen which made it kind of awkward to get to the salad bar.  I believe this location used to be a different restaurant, so I don't think the layout was ideal for this type of cuisine.  The remodeling job could have been a little better.

The staff was friendly and helpful and with all the choices available even my pickiest son was enjoying his meal.  I'm sure we'll be back for a celebration or special event."}
{"text":"Agree with Chris L.'s review about this place as his story almost exactly mirrored mine - this place definitely doesn't welcome certain types of people. 

I'm Asian and we had a reservation for 4 (my parents and wife) and they stuck us probably in the same isolated, bright, corner table as they did with Chris. I asked why they stuck us in the corner when there were plenty of other tables open, of course they gave us the same BS answer as I saw plenty of empty tables during our meal there.

I'd avoid this place unless you're of a certain type of ethnicity. If you're not and you come here - do so at your own risk of feeling like a third class citizen. Terrible

The food was also mediocre. I've had much better Brazilian bbq elsewhere. I'd avoid at all costs."}
{"text":"We had visited a Brazilian grill in Cleveland Ohio that was amazing so I looked into one here in Mesa, when I came across Rodizio through Google. I took my family last night as a surprise dinner. My husband was a little upset as he was not \"that hungry\" in his words. It reopens at 5pm I had reservations for 5:45pm but made it there at 5:05pm and had no problems being seated. As soon as we were seated we were created by our server Sonia, who was very attentive throughout the evening. My husband that ordered just the salad bar, but every skewer of meat that came out he sampled(we paid full price for him lol), the meat keep coming as long as our green block was up and we loved it, all tasty and hot. Salad bar was fully stocked and the margaritas was on point(my favorite). Overall night was a success and for someone that wasn't that hungry, ate more than us all!! Oh SN: grandson had Mac n cheese from salad bar and \"Loved it\" he got orange juice wasted! Lol great night Thanks Sonia!! The couple next to us eventually bought the full meal after watching us enjoy all that great meat!! Will be taking family back there next month!"}
{"text":"We arrived to our first (and last) dinner at Rodizio, yesterday evening circa 4:00pm. (All our previous patronization of this location was at opening; we've been to Rodizio no less then 15 prior visits.) 
Upon our arrival, we were greeted and seated immediately. Our server arrived approximately 5 minutes later to take drink orders. Another staff member brought those drinks to the table approximately 10 minutes later (At this point the restaurant had approximately 8 tables of fellow diners.) The next issue was there were no soup bowls available for the bacon-cauliflower soup. Several other patrons had to ask for bowls AFTER I had requested mine; no staff took initiative resolving the issue. The lettuce on the salad bar needed replenished and looked like it had been unattended for some time; I skipped the greens accordingly. After 15 minutes, only two meat servers had been to the table. We had to request that the meat servers start swinging by. Up to this moment we saw our server only twice, infrequently enough we had to grab other staff for basic service like pre-bussing, which for some reason was also an issue. Eventually, the manager did swing-by the table and from our demeanor quickly realized something was wrong. She identified herself as Shawna Fitzgerald. We explained the above whilst adding the added info that the national Rodizio email explaining its fish offerings for Lent had neither been mentioned nor offered. The manager was unmoved. Instead, she doubled down on our bad experience by offering defensive rebuttals. For example, she contradicted our concerns arguing that there was 'plenty of staff on the floor', came back to the table making further excuses for the slow meat service stating that, 'our request for beef and not other meat be brought to the table'; the problem is we made the request after waiting 15 minutes for the first two meat servers to show.  So she didn't even have her facts straight regardless whether or not our request was considered reasonable or not. She gave us her card. We told her, especially in light of the increased price point for dinner vs. lunch, that our experience paled by comparison and wasn't worth the extra money (My wife and I had the salad bar; our child had the meat service.) The manger offered us nothing! It's worth mentioning that the meat did start arriving much more frequently after our complaint!
I worked in the executive food & beverage industry for years doing every job from dishwasher to GM. When my valued customers' lay-out undeniable activity illustrating our dropping the ball repeatedly, I made it right w/o asking the customer what they want or, feel like they chose the wrong place to eat and, are OBVIOUSLY leaving with a bad taste in their mouths! Very unprofessional experience!"}
{"text":"This is a wonderful Brazilian resturant.The wait staff are very friendly and helpful. The food is fantastic and delicious. They come to your table with varies types of meat grilled pineapple to sample and you control how much&  how often they come to your table. Excellent salad bar with a great variety of greens ,cheeses meats and more. Come hungry because you're going to want to try everything. Oh and leave some room for dessert,theirs are fantastic and so delicious."}
{"text":"This is the short version for those driving or just wanting the low-down.... Go! Do not hesitate!! Now this is the long version.... Seriously go!! This placed is 5 stars food, but a 10 star value, ambiance, and service. I was really impressed with the quality of the food, the presentation, and the warm kind service from everyone starting from the hostesses to the rodizio guys. They seemed glad to keep it coming, and always explaining what was being served. The buffet was varied. It even included soups. And forn the money the variety of food was very impressive at nearly half the price of other Brazilian restaurants. I chose this place out of the hat. We just happened to be in the neighborhood, but what a great surprise. The pan de Queso is warm, the meats are sizzling. Kudos to management for such a great staff and great taste. So again in short, just go!"}
{"text":"One of the ingrained teachings that I have received from the Executive Managements courses that I have taken has to do with a company's forward momentum.

After having created, and captured momentum; a company's long term success is based on its ability to sustain that momentum!

Such is the case with the new Brazilian Steakhouse, Rodizio Grill.

Every aspect of our visit this evening was par excellence. If they can sustain this level of excellence regarding each customer's experience, long after the initial excitement and momentum has been created and captured from their recent grand opening; they will definitely be a great success here.

Upon arrival, we were promptly greeted by the hostess Savannah. She was cordial and inviting, and guided us to our table with aplomb.

Kelly, our server, promptly introduced himself and went over their dining options, as well as the drink selection. Although, one could simply partake of the voluminous Salad Bar options, we opted to indulge ourselves and include the meats as well.

The salad bar was well apportioned. Between the greens, fruits, Brazilian delicacies and meats; there was more than enough of a variety to satiate one's appetite. Although, I wasn't that impressed with the cucumber and the asparagus (I thought they could've used more thoughtful flavoring in keeping with all the delicacies presented  to us); the Brazilian Rice, Beef Stew, and Mashed potatoes were amazingly distinctive in their flavors.

Then came the gauchos bringing their myriad of meat samplings. 

The succulent beef portions, along with the bacon wrapped pork and chicken options; as well as, the Brazilian sausage and liver were undeniably scrumptious. Every savory bite of of each one of the flavorful meats produced a very pleasant and distinctive reaction in our palates.

My beloved wife detests liver, but her comments about this particular meat selection was very complimentary.

For drinks, we chose the Strawberry Limeade, which happens to be one of their drink specialties. When I imagine how sweet a flower's nectar must be to a Honey Bee, this is how it would taste. This drink was absolutely fabulous and delightful.

You'd think that after such a great reception, wonderful service, and delicious food that I'd be done with my accolades. Not this time, because our wonderful experience didn't stop there.

My wife asked one of the managers where the ladies bathroom was, and this woman took the time and the effort to guide her to the ladies bathroom because she wanted to ensure that my wife didn't go through the long route to get there.

Not only did the GM and one of the other managers stop by to ask us about our dining experience, but so did the Gauchos.

It's one thing for those in charge to be concerned with a customer's experience, but it's another step up when even the rank and file members have that same heart, concern, and care.

And there was the dessert. We opted for the Flan, and this could arguably be the best Flan in Arizona. We've eaten at a plethora of dining establishments that serve this type of dessert, and this particular one just beat them hands down by a wide margin.

As a final point, the atmosphere here is definitely upscale but more inviting and less stuffy than their other counterparts. 

Every one of the staff members asked us if we would be back.

Our simple response, without equivocation, \"Most definitely!\""}
{"text":"Bright my wife here for our anniversary because we loved the Salt Lake location that we tried when we were visiting family. I have to say it was a flop. A long wait for meat, left us hungry and an inattentive waiter left us frustrated. We didn't get a chance to try most of the meats and the meat we did get was few and far between. I was disappointed in the evening. Come on Guys!!! Get your act together. The restaurant is very clean and has a great ambiance. But the service was not up to par. 

I was contacted by Shawna Fitzgerald the general manager, she asked that I email her. Never heard anything back. Too bad. I was excited that she was eager to rectify the situation, but was never contacted by her again. I guess we won't be going back and I'll be sure to pass on my experience to friends. It's a shame too, because the food is great and restaurant is nice."}
{"text":"Rodizio has been on our list to try for some time, today was the day. What a pleasant dining experience, which exceeded all expectations. The staff was extremely friendly, coupled with great service. Hali was our server, and she did an outstanding job from start to finish. This was our maiden voyage into the subtle nuances of Brazilian dining. What wasn't subtle was the amount of food brought to the table,...an insane amount and variety of seasoned beef, chicken, vegetables and fruit. We finished off the night with a generous portion of cheese cake, complementing a phenomenal meal. We cannot wait to return!!!!"}
{"text":"It's expensive but it's tons of fun... We took the kids and they loved it."}
{"text":"I had no idea what I was walking into ,they sat us right away, and told us what to expect and my mind was still blown ,this place is so awesome ,they bring around all different meats ,pineapple, and have a big salad bar ,I will be back soon I'm sad I didn't try it sooner."}
{"text":"Steak soo good, sorry Jesus, good Friday rules broken, better to ask for forgiveness...highly recommended, staff is excellent, price is wonderful especially for a steak house. Amazed"}
{"text":"We were looking for a good Brazilian Restaurant while in Phoenix and we came across Rodizio Grill.  When we first arrived, we were told it would be a 20-minute wait even though you could see the place was half empty.

We were seated in the main area and one thing to say, if you are looking for a quiet romantic dinner, this is not the place.  Extremely loud as the sound vibrates off everything inside and when you have many kids and people who have no decorum, well, needless to say, it felt as if I was eating in a mess hall.

When we were given the menus, all you could say is 'GROSS'!!  There was food all over all of them.  Also, the tables were smeared with the dirty hand cloth as well.  Disgusting!  Had to get everything cleaned a second time ourselves.

The salad bar looked as if a bunch of kids had played in it.  Extremely sloppy and not maintained.  I do not get how management can just set something out and then forget it all.  
The meats that were served were extremely hit and miss.  Some were on point tasty and some were dry and were like shoe leather, very bad!  I found out that you need to get the meat when it first comes out of the kitchen.  If you wait after the meat has made a couple of rounds, it will be cold, dry and tasteless.  Really poor quality control.

We finished with desert, the Rabanada.  It is like churros, however much better and tastier served with fresh strawberries and Ice Cream.  Now this one dish was a winner.  

Also, the service was quite good.  If it was not for the last two items, this place would only get one star.  The desert and service elevated it a bit, however, this Brazilian Steakhouse needs to get their QC under control as it is all over the map from being clean to just eye appealing food."}
{"text":"Probably the worst dining experience we've had since I can remember. The low star rating is for the waitress. We waited 45 minutes for our drinks. Apparently the bar was backed up. I only had water and my water was never refilled until our friend went to the kitchen and the chef accompanied him to the table with a pitcher of water. But again, my glass went empty and was never filled. Our waitress would show up about every 30 mins promise something (water refill, new plates, silverware) and never return. Not even remembering what our table needed. She even cleared the kids plates and took their drinks. After an hour with no kid drinks she returned with their drinks in giant glasses--when asked for the original plastic cups so the kids could take their drinks the waitress stated they were a gourmet restaurant and couldn't give to-go cups. Hello-we just wanted the kid drinks in kid cups! Maddening! In the end manager took care of us and it was appreciated, but I can't say i would give this place another go."}
{"text":"Had another fantastic visit to our favorite Brazilian steakhouse. Experienced the white wine marinated chicken, it was absolutely wonderful! Also glad they have brought the delicious polenta back! Much gratitude to our friends at Rodizio's."}
{"text":"Very, very good good food. For the price, I'd honestly say it's worth it. I'm usually the kind of person who orders a soup and salad combo to save money, and would rather make it than pay someone else to, but here your money will be well-spent.

When you sit down, they give their fluffy cheese bread and fried plantains in brown sugar which are both amazing. Then you can to choose to just eat food from the buffet (an assortment of salads, cheeses, deli meats, stews, bread...) or do both the buffet and their meats. Meats are so worth it though. From lamb, to sausage, to even grilled pineapple with carmalized brown sugar, all of it is divine. 

The ambiance of the place is a little bit more modern and fancy, but no one will judge you if you show up in sweats. Who said you have to be extravagant to get delicious food? Plus, all the waiters are very relaxed and easy to talk to.

Another thing: if doing the meats, you get a small card. The waiters are constantly bringing around different kind of savory things for you to try, and if it's green they'll come by your table. If your getting full or running out room on your plate, flip it so it's red and they'll let you be. 

Awesome place, delicious food, and I honestly prefer this place to the fancier, pricier Brazilian barbecue houses in Scottsdale."}
{"text":"Rodizo Grill is a Brazilian Steakhouse that offers weekend brunch and dinner. You can choose to just eat off the 30 item hot and cold buffet or go for the whole Rodizio Experience  that includes the buffet and slow roasted rotisserie meats.

Everyone get complimentary Brazilian Cheese Bread and really delicious cinnamon glazed bananas. 

The hot and cold buffet includes some Brazilian Side Dishes. Some of the things offered during my visit were - Brazilian Bean Stew, Collards and Bacon, Brazilian Style Pasta, Eggs, Bacon, Fried Potatoes, Whipped Potatoes, Chicken Stroganoff, Fruit Salad, Quinoa Salad, Hearts of Palm, Steamed Asparagus, Coconut Cole Slaw, a Brisket dish, many salads and MORE!

The meats offered during Brunch Time were Tri Tip, Top Sirloin, Hot and Sweet Chicken, Herbed Chicken, Garlic Beef, Bacon Wrapped Chicken, Chicken Hearts, Pork Parmesan wrapped in Bacon, Brazilian Sausage, Lean Ham, and Glazed Pineapple.

Everything I tried from the hot and cold buffet was delicious and the meats I tried were ALL DELICIOUS, FLAVORFUL, so SUCCULENT and so Juicy.....My favorites were the Tri Tip and the Hot and Sweet Chicken...and the pineapple...so good. It's rare to go out and get beef or chicken that is that good and even the pineapple tasted usually great!

All the help were amazing and interactive with us from the hostess, all the servers, the meat servers and the manager. They all made us feel very welcomed and couldn't be any nicer.

We happened to take advantage of the Smoking Hot Restaurant Week Brunch Deal that gave us the full Rodizio Experience, a complimentary cocktail and an extra dessert. But even if we paid full price we would still feel the same."}
{"text":"Very disappointing.... ! Service is bad , the place is dirty , bathrooms dirty , floor is so greasy that it's dangerous to walk ,Bar is sticky and dirty .... I relied on the ratings here on google and no where close to 4* , they don't serve bananas , a lot of the meats that are advertised aren't available ... I would be curious to see the rating after food inspectors do there inspection !!! Not worth the money ...."}
{"text":"Dang it, I wanted to love this place based on reviews and my way of eating (keto/low carb)... but everything was a little underwhelming. The meats were all medium well at the least and I'm more of a medium rare fan. The sides and salad were nothing special. $10.99 for my skinny nine year old is a bit ridiculous. I think it would be a great idea if they served a bunch of different sauces on the table for starters. Dessert included with the kids meals would also be nice."}
{"text":"I have been twice for lunch but not dinner, Both times everything was great. The salad bar is huge with lots of selections. All of the meats were great and selection. The fried bananas they bring out to the table are the best! My only wish is that they would have sugar free options. Almost all of the drinks and sides have sugar in it. Also, they are not on open table so this is a downside."}
{"text":"This restaurant is really unique and fun. The atmosphere is great and the food is delicious! Very fun for a group gatherings! I will definitely be going again. Make sure you bring your appetite!"}
{"text":"This restuarant is beautiful and the food and service is outstanding. The salad bar is fresh, and the meats are to die for!  If you love beef, this is the place to go.  I can't say enough great things about the quality of the food, wonderful staff and cute, romantic place.  Welcome to Mesa!"}
{"text":"If you are coming here, be prepared to eat~!

A very nice place to satisfy your inner carnivore, Rodizio's is a great place to hang out with great staff and just keep the food coming. I'll admit, the first time I came here, my eyes were bigger than my stomach, and I kinda regretted eating so much. That being said, that is my only regret!

If you like meat, definitely recommend! If you aren't picky, give the gizzard a shot too."}
{"text":"We gladly drive 25 miles each time we visit Rodizio Grill. It's simply the best brazilian steakhouse we've been to. First, the food is delicious and varied, from the incredible steak to the sumptuous glazed ham they serve with grilled pineapple that is fantastic. Add to that a salad bar filed with beautiful meats, cheeses and veggies. Second, every time we've been, we've marveled at how welcoming and friendly everyone is. They make each visit so much fun, so relaxed, so enjoyable. Fridays we definitely recommend making a reservation ahead of time, and bring your appetite. Impossible as it sounds, try to save room for dessert... the flan is amazing!"}
{"text":"My wife and I went there to celebrate my birthday. I was excited to give it a try. I had a voucher for a complementary b-day meal, which was very generous, and appreciated. We got the full Rodizio, which is the salad bar and the table side meat service. The salad and sides were okay, thought they would have been a little better for the price. The potatoes and pasta sides were not that good. I was a little disappointed in the salad bar. The table side meat service was good, \"when\" they would stop by. We sat in the middle tables and the servers with the meats tended to go to the booths against the wall and skip us, it happened several times. There were several meats I wanted to try, but they would skip our table or never come back around. There were several times when we waited over 5 mins or more for the next meat to come around, I got a little frustrated waiting for the meat. I sat there several times with an empty plate. I wanted to try most of the meats and I think I was able to try about half of them. The meats I did have were really, really good. It would have been nice to have a menu at the table that listed what meats were available; so I could have asked. I know they are new and can hopefully figure out a better system for the meat service and improve on the sides a bit."}
{"text":"Been a year.  Did dinner this time.  Costs about $9 more for the Full Rodizio.

Honestly, probably not worth the extra money.  Better to do lunch.  Cheaper and the only real difference is the salad bar.  For lunch they regard it as \"brunch\" and it has a few breakfasty things.

With regard to the meats, they are very good.  The garlic beef is definitely GARLIC beef, but it's not overpowering.  I emphasize this because I recently had some \"garlic beef\" at a different place (not local) and I could not tell the difference between that and their regular beef.  They also had a parmesan crusted pork, a spicy chicken, and some other things.

Even lunch is pricey, but if you sign up for their emails you'll get an email for BOGO Full Rodizio.  That is a good value, especially for lunch.  Lesson learned.  Three stars for dinner (because of the value aspect), but four stars for lunch."}
{"text":"Don't go here for Restaurant Week. We were very disappointed.  We made reservations yet had to wait to be seated until they opened another section of the restaurant. No napkins were available so they brought us some from the bar. People seated at the table next to us had to ask repeatedly for their drinks and one person had to walk over to another table to get napkins. The menu last year included a cocktail and dessert. This time it did not. The food was okay."}
{"text":"We decided to try this place for restaurant week. We have been to Fogo de Chao in Scottsdale countless times but wanted to give Rodizio a try, because why not. Same exact concept and less expensive than Fogo.

Overall we enjoyed our experience and the food was good. The salad bar had nice options and the meat was cooked well. I also enjoyed a passion fruit martini and had the rabanada (cinnamon pastry with caramel sauce and vanilla ice cream) for dessert. We all definitely indulged tonight. 

The reason I gave 4 stars was because of the service. Don't get me wrong, everyone was extremely friendly but at Fogo de Chao the service is just hard to beat. I know this will sound like I'm being a brat but we asked for Brazilian cheese bread multiple times and they never came. Really not a deal breaker butttttt if I had to choose paying a little more for Fogo or going here again, I'd go back to Fogo de Chao."}
{"text":"The meat here is very good! The spicy and sour chicken was very good as well as the tri tip. I asked one of the guys if he could bring some of the grilled pineapple because I kept seeing it go by but the guy never came by our table. The guys bringing the meats are extremely nice and are more than willing to give you more pieces if you ask for it. The limeade was very good too, creamy and has very good lime flavor. The only reason I took a star off is because the server that we had was not attentive at all. We asked for refills and she completely forgot about it and when we asked again she acted like she had already brought it to us and seemed annoyed. Desserts were not that great and we didn't know that they weren't included in the price. But over all the guys bringing around the meat made it all worth it. The chef came out at the end of our dinner and checked to see how we liked everything, great touch."}
{"text":"Happy Birthday Dinner Spot!

Warning! You need to be hungry when you come to this place!

Special recognition to Sirina our excellent server and Chad the super friendly meat man for going above and beyond the call of duty! Actually everything and everyone was great.

The salad bar is rather exceptional, it is filled with actually great tasting items. Just be careful not to eat too many or you won't be able to eat any meat!

Excellently cooked meats, a great rotating selection brought to you at your table sliced out onto your plate for your enjoyment.

The non-alcoholic limeade drinks were really good! Especially the coconut mango strawberry cream one, it was outstanding.

I really like the banana appetizers. They are wonderfully flavored and absolutely delicious!

The water is fresh cold and wet.

The service was friendly and professional. Our water never ran low, and the food always was overflowing from our plate.

All in all this is a nice restaurant for a date or even a business meeting. Stop by and give them a chance the food is excellent.

PS: if you are planning to come on Friday or Saturday you need to call ahead and make reservations. Otherwise you will get here and they will say it's a three hour wait and that will be a little bit more than discouraging."}
{"text":"This place was excellent!  The meats were super tasty, and I'm pretty stoked I don't have to drive to Scottsdale for a good Brazilian steakhouse.  They have grilled pineapple and chicken hearts, which are two big sellers for me.  Staff is very friendly and the atmosphere is pretty chill.  I would definitely come back here."}
{"text":"I normally don't even waste my time with crappy reviews, but this place deserves it. The service and management is horrible. I took 45 minutes for us to get our check after being done eating for a good 15 minutes. The meat was delicious, but that's about all I can say that was good."}
{"text":"I don't know if it was just a bad night but from beginning to end this was not good. Only two menu options one with meat, one without. Both friends chose the one with meat, I chose the one without. The salad bar is no better than Sweet Tomatoes yet the price is over $20. If you add meat the price goes up to 35. It took forever to get drinks and our bill was not correct. Would not come back."}
{"text":"Everything is good , except there was only one bartender during our visit, which took about 20 minuets for just four cocktails for our group. Hopefully this won't happen to anyone else."}
{"text":"The food is delicious and i love that it keeps coming it's hard to say no! They have a very nice salad/side bar area with a lot of foods to choose from. They had a few different salads, pastas, fruits, cheeses, salami, and soups. When they waiters are coming around you can make special request of a meat/chicken that you liked so they can bring it out again. My favorite was the top sirloin and it was cooked just how i liked it. I asked for it about 3 times. You are also able to ask them to bring out one that is cooked to your liking which is super awesome. Ohhhhh and a must try is their pineapple holy moly it's delicious when paired with the sirloin. 

So the reason we came here was for our annual Christmas dinner for work, and Savannah was the one that helped me set everything up from deciding what area we needed to sit in to how many people and made the process super easy. 

Another side note they allowed me to bring in a cake and kept it in hiding so we can sing Happy birthday to one of our doctors in which the staff also came out with some drums and sang with us it made it even more special."}
{"text":"My boyfriend and I had his family in town and decided to try this place because it was much closer than Fogo De Chao. 
Upon entry the receptionist were very friendly and helpful. We waited a few minutes for the finishing touches on our table and proceeded to sit down. 

The server did take a bit more than 10 minutes go greet us once we sat down. After he took our drink orders he explained how the service worked. 

The meat waiters were amazing! Constantly coming by and providing a lot of options. We did not have to wait long for our food! 

Like the majority of these reviews, the wait staff is definitely lacking efficiency and punctuality. The restaurant was not operating at full capacity, but the servers were either whelmed with their sections or not properly trained. 
Even the bus boys who took our plates and cups were more efficient. 

I am sure in a few months time the ratings will get better. 
If you plan on going for dinner- prepare to back your patience!"}
{"text":"Hard to explain this place! Salads and side dishes are ala salad bar (all you can eat) but leave a lot of room for the grilled meats. Various servers come to your table with the meat on a spit and it is very freshly cooked.  We had everything from Bacon wrapped chicken, sausage, to excellent cuts of beef and my favorite, parmesan pork. I believe that's what the server called it. The beef was as tender as can be and i think we had 3 different types. It just keeps coming! 

I wish i spoke some Portuguese as this place is themed as a Brazilian grill. Very enjoyable dinner. Down sides, took far to long for a bar drink and glass of wine. It's VERY noisy and it was a weeknight, going to be crazy on weekends, and the price is steep. It's worth it for a new dining experience. $19.99 if you just want the salad bar (to much to write about!), and $29.99 each if you want the meat. We will return for special occasions."}
{"text":"The salad bar is by far better than fogo. The meat ehh not so much but still very good. The service is a little slower but it's pretty affordable. The atmosphere is real nice especially the outdoor seating."}
{"text":"This is your traditional Brazilian steakhouse. It's a little bit more casual than Fogo de Chao, which is good for larger groups of people. The salad bar had plenty of options (mozzarella, Brazilian beans, pasta salads, quinoa, rice, bread, fruit, etc). All of the food was hot and seemed to be very fresh, which is not as common at a lot of buffets. The meat selection was very good (chicken, several cuts of beef, lamb, sausage, etc). Most of it was cooked to medium, but a few of the pieces were well done, which could be improved. Overall, the quality of the meat was great. It was well seasoned and tender like it should be. For dessert, the donut/churro was excellent. 

The service was so-so. The waiter was a bit missing in action towards the end of the meal. And the meat service was a bit too fast at the beginning.

But overall, for the price and more casual atmosphere, it's a great option."}
{"text":"I will never go here again. Terrible ,horrible customer service.  Have attempted lunch here on several occasions but place was closed.  No sign in place just no one there. Tried to go to lunch here yesterday, only offered Brunch at lunch time on Sun.  Didn't really want brunch. Gave them a call. Anna, the person I spoke to told me that it was basically the same as dinner but with less meats.  I said thank you, she never mentioned that I should \"make a reservation\". I mean this is not a high end place, its a buffet with some meats on skewers. We arrive 15 minutes later and we are told there is no table.  There are 40 tables available (open). We wait and they seat about 10 people, never tell us it will be a __wait until you can sit, nothing, nada, no feedback. Morons at the front- Anna who is there won't seat us.  We finally left, forget this place. Will never return. If you have morons running the front, the rest will be bad."}
{"text":"I love this place the food is wonderful and the service was AWESOME Heather G was a delight and made our visit a great one. Thanks Heather!!"}
{"text":"We came here for my mother in laws birthday, her pick, we were excited to try this place and it did not disappoint. The food was tasty and the meat was excellent, I was mostly indulging on the meat and only grabbed a few sides. Every time we turned our stick to green there were waiters with meat immediately at our table ready to provide us with more. They continuously came until we switched it
red. The service was great and dessert was splendid. This is now one of my favorite places to eat. I recommend it to everyone and it's priced right."}
{"text":"A brief summary of our lunch today:
The good the meats were tasty and the salad station was refreshed. The gauchos carving very friendly but no one wore the same uniform kind of odd?


The okay: warm cuisine in chaffing dish but we're not being attended to in the fashion I would expect

The poor / terrible: our server Erica probably the worst service I have had in the past 8-10 years it was so awful my wife whom I was trying to have a nice lunch with had to get up and get her own water for herself.  The signature limeade cocktail garnished with a lemon that took 18 minutes to get, but seriously who garnishes limeade with a lemon if I wait 18 minutes for a drink I do not mind waiting 19 if you have to run to the refrigerator to get and cut another lime. The fact is it was clear there was no management working and if they were they should be terminated because half the staff looked like chickens with there heads cut off.

Overall a bad experience I would never come back even if I was paid 10$ per piece of meat I consume. (Which is a lot)

Shawna if you message me I will be happy to speak with you"}
{"text":"Absolutely delicious. You eat your fill! Came with my husband and son. Everyone left satisfied. Happy and helpful staff everywhere you turn."}
{"text":"I've been wanting to try this place for quite some time. Finally I made it!!!! The first try was a Saturday night. The wait was 1.5 hours. I was starving so I passed. Finally, on a Friday afternoon, I was hungry, trying to decide what to eat when a light bulb went on in my head. I decided I needed to come here. Fortunately, it was an hour before they closed, and they were still serving brunch, which at this time is 11pm-3pm. This building is at Dana Park where TQLA used to be. They've done some renovation to the place, and it's a clean, trendy interior. It's very open, and there's seating inside and out. 

Service was excellent. Granted, there were only 2-4 parties the whole time we were there, but I was so extremely impressed by the level of customer service! Everyone was extremely pleasant, quick and helpful. When we entered, we were greeted and seated immediately by a hostess. A minute later, our server came to say hi. Unfortunately, she left early in our meal but before she left, she introduced us to our new server. Both of them were extremely informative. They started off the meal by asking if we had been there, which I feel is extremely important because I feel it is the server's job to guide us through our meal. After establishing that we were newbies, they walked us through our meal and the whole experience was seamless. The young gentleman who brought us our meats was so positive and knowledgeable. We were literally the only people eating meat so he came a little too quickly, but I'd rather him come quickly then slowly! The manager came by to say hi as well. 

The food...where do I start. First off, brunch prices are $26.99 for unlimited meats, sides, salad bar without drinks and desserts and $19.99 for unlimited salad bar and sides without drinks, meats, desserts.  Dinner prices are slightly more but not by much. THE SALAD AND SIDE BAR IS HUGE!!!! Oh my goodness. It was AMAZING! They had all sorts of food and since it was brunch, they had french toast, banana nut bread, and cranberry muffin. A person can definitely gorge on the salad bar alone. As for the meats, I was told brunch meats include less than that of dinner, most notably lamb. They do not have lamb at brunch. I noticed most of the beef meats were well done, but they were still juicy. My favorite would have to be the garlic beef. It's seriously the most garlic I've ever had on a piece of meat....but I love garlic so it was like a dream come true. All the chicken was very soft and juicy as well. Speaking of chicken, they service chicken heart for all you heart lovers!!!!! They have a glazed pineapple that they bring around that was, of course, delectable. They do give you a side of cheesy bread and banana, both pretty darn good! If you have enough space for dessert, try the flan. It's a perfect combination of soft, creamy, and sweet. I loved its texture.

I will definitely be back another time, particularly for dinner. I definitely recommend a reservation during their peak times, reportedly Friday evening through Sunday evening. Otherwise, be prepared to wait. However, if you want immediate service, go for Friday brunch. I look forward to the next time!"}
{"text":"When it comes to the food and the meat servers I'm always happy. But i've been here 4 times now and every time I'm annoyed during the meal and leave annoyed because of the very slow service. Drinks take forever. Every time. Last friday we were seated at our table at 7.15 and put in a drink order straight away...that did not get there until 7.45
We we're nearly done eating by that time. When they finally started coming, although just a table of 6, not all together with forever in between and once my cosmopolitan came it was in a normal drink glass. Why a place / bartender would choose to not serve a cosmopolitan in a martini glass I really dont know. Ordered coffees at the end, actually served cold.
All in all, love the concept, love the food, love the meat servers they are always friendly and quick but the incredibly slow service has made me decide to not come back. If it was once or twice then maybe but as now is the 4th time i just realized it makes for an incredible uncomfortable dinner experience."}
{"text":"Great place for dinner with friends and family. Staff is excellent and prompt. I recommend you make reservations or prepare for at least an hour wait."}
{"text":"Really liked the food no the atmosphere of the restaurant.  Game in and was greeted by hostess and shown to our table.  The waitress was very attentive and explained to us how things work.   We went to the salad bar first and it was exceptional.  Great variety and freshness.  We ordered drinks and went back to the table and began to try the different meats.  All the varieties of meat were very tasty and you could get different types of wellness.  I also enjoyed the grilled pineapple very much.  Definitely will be back for another dinner. The reason it did not get five stars was because the drinks that I ordered all had ice cubes filling the glass to the very top so it was very little drink inside them."}
{"text":"Great service- staff is friendly and helpful. 
Food- Delicious very tasteful and fresh. Disclaimer they only offer lamb for dinner and during brunch they have a lot more chicken over sirloin or sausage. Overall great experience I will be back."}
{"text":"The important detail in this review is this: when you are seated, they give you a device that has a red block on one end and a green block on the other. I am Mrs. Red Block and my husband is Mr. Green Block. You will soon understand why this is important, and why I've given Rodizio three stars, while my husband may give them four or more.

Mrs. Red: I eat very slowly, and fill up rather quickly. Therefore, this restaurant is my worst nightmare. When the green block is up, one gaucho after another came to our table with their meat skewers, ready to carve off meat for us to try. This is supposed to be a good thing, but for me it was overwhelming. I would barely have taken a bite or two when more food would show up. I wanted to try various things, so I would take a sample. But then I would regret that choice as I started to fill up and couldn't eat all that I had taken. I hate to waste food! I also had foolishly put salad, a roll and a few small bits of potato on my other plate prior to the meat brigade. It was too much food for me. I always hate having my mouth full when a server walks up, and this happened continuously. So if you are like me, this is not a good place for you. That being said, the service was great! The salad bar and sides area were pretty good, and the meat seemed to be good quality. However, sometimes the meat is overcooked, which we figured out depended on whether you got first dibs at the skewer, or if the skewer had already gone back a few times. My favorite item of all was the grilled pineapple - completely delicious!
Handy tip: If you sign up for their eClub, you will receive a buy one, get one free deal for your birthday. ($30 value) Plus, they bring you a bit of delicious flan with a candle and sing a rousing Portuguese birthday ditty. (Nothing like that obnoxious Red Robin one!)

Mr. Green: My husband eats fairly quickly and has a healthy appetite, Plus, he is not picky in the slightest. He was loving the fact that the gauchos come by so often, and was always raring to get a new meat on his plate. When I begged him to turn the block to red so I could catch up, I know he was bummed. He was constantly on the lookout for a new type of meat in the vicinity so he could turn the block back to green. He enjoyed the meal, and just agreed that sometimes the meat would be little dry. 

Final words: if you are a Green type of eater, go with another Green. If you are a Red like me, take another Red. That way, no one at your table is disappointed by either the lack of or the excess of food. If my star rating here was based solely on the food, I would have given Rodizio four stars. They provide a great Brazilian steakhouse experience."}
{"text":"Dinner was good...pineapple is my favorite...try all the different flavored limeades!!!"}
{"text":"Ok, so I was looking for a place to meet a client in the Mesa area, and came accross this place. So decided to check it out with the family first.

We went for dinner on a Thursday night. Which was good, since it I'm guessing it was less crowded than a typical weekend.

Overall, it was pretty good. Food was decent, salad bar had a lot of options, that you could fill up just on that.

However, initially the speed at which the meat was coming to the table seemed a bit on the slow side. I watched a few times as the guys came around and passed us by, while on the way to the tables behind us.

If I were to go back again, I probably opt for a table around the perimeter, as opposed to one in the center. It just seemed as though that was the flow of the meat service.

In any case. Once the table behind us (with the fairly large party) was content, we started seeing the meat more frequently. Which is the reason for the 4 stars, and not lower.

Although given the price, which does not include any beverage, you are basically paying only a few bucks less than the place on Scottsdale Rd."}
{"text":"Update: Noticed 6 priority health violations reported by Maricopa County on 1/4/2018. These were corrected in a re-inspection on 1/17/2018. 
https://envapp.maricopa.gov/EnvironmentalHealth/FoodInspection?p=FD-52909&i=4227923

Very disappointing experience. Correction, two very disappointing experiences.

My wife, adult kids, and I have experienced too many superior Brazilian Steakhouses to regard this establishment as anything greater than subpar. Yelp visitor, just understand that you can do soooo much better than this place in the Valley. And when you'll be paying $40-50 per person, you should aim for better than Rodizio Grill.

Leandro Barbosa, former Phoenix Suns player indirectly introduced my wife and I to churrascarias, traditional Brazilian-style steakhouse, cuisine. In a post-game interview, he spoke of his post-game ritual, a meal at an amazing Brazilian AYCE restaurant that serves barbecued meat right off the spit. My wife and I have since been to many Brazilian steakhouses, most are spectacular, Rodizio Grill is the nadir among them.

We gave it two shots. The first was shortly after it opened in 2016. We gave them time to get their footing and tried it again recently. Similar deficiencies in the experience. Our friends still talk about how awful it was for the expense. Mostly we riff on our first server, who seemed like he was in the witness protection Program and, in general, hated his current circumstance... it just emanated from him.... so much so that we tried to cheer him up... with little success.

Aaaannyway, guaranteed the positive reviews of this place are from customers that were seated in the main dining room (the room with the salad bar). If you are seated outside of that room, near the door or on the sides toward the front of the restaurant, you'll be left wanting. The servers just don't reach those areas often with the food... even on request. There will be just too many hungry folks requesting the premium (or more desired) meats between the kitchen, where the servers start, and your whole table. This is a training issue, one that was NOT solved between our two visits. 

Did I mention the problem? Sure did. I did so, while we were patiently waiting for food at our table. I pointed out the travel paths of the servers and how they rarely came to our table. I pointed out the horrendous LACK OF VARIETY that reached our table. The issue was not addressed during our meal. I Also, spoke to the manager as we paid our check. Truly lack luster leadership and service from the manager.

On our second visit, I requested a seat in the main dining area from the hostess. Denied. I expressed my concerns and the reasons for them. These were dismissed. It didn't work out. Perimeter seating. Same issue with scarcity and variety. The hostess came by midmeal and asked how things were going. I was politely honest that the concerns I had voiced TO HER earlier had been realized. We were, a second time, disappointed for the exact same reason as our first visit. She apologized, then we didn't see her again in the 30 minutes before our departure.

Be warned. Maybe you'll luck out with better seating and service. You now know the deciding factor, seating area and server paths. But, you'll not be getting to best flavor the valley has to offer. Why risk it?

My dollars will be spent in Scottsdale, at a vastly superior, yet similarly priced venue."}
{"text":"This was my fourth time here, since they opened.
I try to come with different people, introduce \"our\" ( I am Brazilian) food to different people.
This week I went with my daughter. Our reservation was for 8 pm - and we were right on time. The restaurant was full, but we were seated straight away.
I have a broken foot at the moment and the hostess seat me right by the salad bar, to make it easier for me.
The meats were delicious. The picanha melted in your mouth - I could not have enough...
The food was very good, the ambiance was welcoming and nice and the highlight of the evening was the service.
Colton and Erick were amazing gauchos, always asking what we were looking for, bringing the cuts we asked very quickly.
A few Brazilians who were working that evening came to our table to say Hello and ask if everything was going well, if we needed anything. We felt very well cared for.

My only disappointment was at dessert. I was dying to have the : pudim de leite\"but had eaten a bit too much, so I asked for dessert to go and they had no to go containers.
I will have to go back for that!"}
{"text":"We came with a group of 10 to enjoy their restaurant week deal, and it was a less then pleasant experience.  We made a reservation a week prior, and we all were very excited to try this place out.  All three of the hostess were clueless and really didn't seem to know anything about the restaurant or the the special deal they were running.  I had to explain the deal to them.  We then were sat and neglected for the next 25 minutes.  I had to go back to the hostess stand and ask for a server to check in with us.  We finally were able to order our drinks, but had to wait another half hour for them to arrive.  We sat at the table for literally 55 minutes before the first drink hit our table.  The server would come by with a list of excuses each time we would inquire.  The salad bar and meat selection was fantastic!  No complaints about the food at all!  Then it was time to order our dessert.... That was another 45 minute ordeal.  Bottom line great food, horrible service.  The meat servers were on point, but the wait and bar staff were an absolute disaster!  Make sure you budget 2.5-3 hours for your dining experience, because you'll need it.  Spend the little extra money and go to Fogo De Chao, well worth the experience there!"}
{"text":"It was OK.   Not the greatest Brazilian place that I have been to and I have been to many around the world and in the states.  Much of red meat was rare.  Some of the red meat was so rare we had to let it go.  I have a term called \"its a redo.\"  Would I redo this place?  I doubt it.  Price to value thing probably not where it should be.  Like I said, it was just OK or as Yelp calls it, meh."}
{"text":"We had a GREAT experience here on 1/28. The hostess wasn't good at her job and was way too shy but everything other than that was AMAZING. Our server was so nice and the guys that bring around the food were all super nice and very personable. The pineapple is honestly one of the best things I have ever eaten in my whole entire life. I am so happy we stepped out of the box and gave this place a try, we will be back!"}
{"text":"A little overpriced. Meats and salad bar are delicious but the place doesn't staff enough people. Meats come around. But it took 2 hours to complete the cycle one time. Salad bar needs more attention and runs out of certain things. All the condiments are there but no bowls? Dessert was good. Service was spotty. Next time I'll try at lunch and see if it's less busy."}
{"text":"Came here for the boyfriends birthday. Loved the food, the ambiance was dimly lit and nice and the service was very professional and great. It was $31.99 per person, all you can eat and it was pretty much the same concept and quality of meat as Fogo de chao, except fogo is $51.95 per person. So I say if you don't mind the drive to Mesa, you can save some money. Also they give you Flan  as a birthday treat. We'll be back again for sure!"}
{"text":"I took my son here last night and it so fabulous! I lived in Brazil for 4 years and missed food so much! It was the best meal and it is affordable! The staff was amazing! We talked to nick, the owner, and Bruno
Jacob
Tristan
Erik
Aubree
Brieanna 
They were all great! Highly recommend it!"}
{"text":"Food what good but service was horrible,  had to ask for the dessert menu 3 times. I almost walked out. If it wasn't for my husband, who just wanted to enjoy our Anniversary dinner, I would have definitely let the staff know about their lack of good customer service."}
{"text":"We have been waiting for a place like this to open up in the area. We have tried these type of places in Chicago and Nashville. The service and food are right in the same line up as the others. Ana met us at the door and welcomed us right in. Our server Emily did an outstanding job of providing information and options. Chad did a great job of delivering one of the choices and his attitude helped make this place one that we will return to and bring our family and friends."}
{"text":"Great salad bar & more meat than you can eat! 
Also, wanted to give our server Chad a shout out for making our Rodizio Grill experience good! Thank you for the extra attention Chad!"}
{"text":"Food and service were both fantastic, so many wonderful cuts of meat are brought over in quick succession by the handsome and friendly gauchos. Huge salad bar as well but the meats are the real star here. Tender, juicy and a nice variety of beef, lamb and chicken. 

At the end of our meal we enjoyed some succulent grilled pineapple, so unbelievably delicious! I can only eat pineapple this way for the rest of my life!

I'm not sure how, but we did not get either the meat sweats or gout, but would have been totally worth it."}
{"text":"Coming back and telling everyone we know!
Food, service and ambience could not be better. 
They took a reservation for a party of 6 and sat us immediately.
 A must do!!!"}
{"text":"Just tried to eat there but no one came to greet us for a really extended time. My partner and I just left"}
{"text":"This place is racist - Asians beware.  I came here with my parents and they stuck us in the corner at the worst table when there were plenty of better tables near the salad bar.  They did this again to my brother and his wife when they came with they parents.  When we mentioned it, they told us the good tables were reserved even though we also had reservations.  They seat Asians at the worst spot so they are not seen in the restaurant.  

I hope that management changes their seating priorities and treats guests equally instead of hiding the Asians in the corner when there are plenty of better tables.  Shame on you Rodizio!"}
{"text":"I came here for the meat --my date for the dinner. We were sat in the corner it wasn't busy but I was nervous they wouldn't see us ..oh they did. The best was garlic steak and the tri tip, I was curious about the pineapple it tasted like grilles pineapple but i think it tasted much better because it seemed extra sweet compared to the meat . The salad bar was okay there wasn't anything that stood out. The thing that stood out was the staff they were extra friendly helpful and always had a smile. For 34 dollars it's worth it just for the meat"}
{"text":"Must go to Rodizio Grill hungry! Best place for birthdays and celebrations. Very friendly service"}
{"text":"Went here for lunch with friends and I must say the food was excellent! The service was good also and the fresh made drinks were the bomb!!! I would recommend this place to all my friends! The fact that it's all you can eat is so worth the price!! Plus they just keep coming with food on the skewers!!"}
{"text":"Fogo de What?! This place blows them out of the water! It's your standard Brazilian steakhouse with a huge salad bar with warm entrees (beef stroganoff and fish stew were great!) and endless meat on swords served by cute gauchos. I tried not to fill up on salad before the meat, but they brought out sides of fried polenta, fried bananas and the heavenly cheese bread--I could've and should've stopped there! But the meat (ohhh the meat!!) was wonderful. The garlic steak and spicy chicken were the standouts there but everything was delicious and tender.!

What sets this place apart from the rest is the service. I've never seen so many upbeat, enthusiastic employees that love their job. Breanna took care of us and went above and beyond to make us feel welcome. She was so bubbly and sweet, and her recommendations on drinks and dessert were appreciated. One of the owners, Nick, took the time to greet us and make sure we loved everything. He shook our hands and thanked us for stopping in. My 85 year old father loved it so much he already is planning his next visit! Thank you!!"}
{"text":"The food here was great! The buffet portion was really nice with lots of options and all the meat choices were very good. Service was friendly and prompt. We never had to to wait very long for some meat to come by, would go again and highly recommend! Oh and totally reasonably priced!"}
{"text":"Giving 2 stars because the service was good and we loved the garlic infused flavored steak.
We went to the Mesa, AZ location on Saturday Feb 17th, 2017.  Our mouths watering to taste all the yummy bacon goodness.  We were sadly disappointed to be told bacon fest had ended a couple weeks earlier.  Why is it still being advertised when it's not offered?  
We were served some barely cooked, basically raw pork.  I pointed it out to our server.  He was very apologetic.  But that's it.  Most of the meats offered lack seasoning.  I need more seasoning.  
The hot and sweet chicken tastes like it's coated in Frank's hot sauce.  Didn't really taste sweet.  The one meat offered wrapped in bacon was served and the bacon was not cooked.  I don't like bacon that doesn't have some crispness to it. 
The salad bar doesnt seem to be as big as advertised.  Im not sure there is 30 different salads.  Maybe 15 different salads.  
Overall I dont think it's worth the price.  We were hugely dissatisfied with our first visit."}
{"text":"I am so happy to have a Brazilian restaurant finally open on this side of town. Not to mention the price for dinner is half the cost as other Brazilian restaurants. The food was delicious and the service was great. There was plenty of meat selections coming around and the salad bar had great options. DAVID was our server and he was just delightful.  He helped us with our drink suggestion and added spark to our girls night out. I can't wait to come back. DAVID, I will definitely request to be seated in your section. Lol"}
{"text":"Went here last weekend with my family.  We were a party of 12 and were seated at the south end of the restaurant.  We had a reservation.  Our main server was Erin.  Our experience was pretty good and the service was pretty good.

My mom and some others had been to a restaurant similar in serving style to this before, but my husband, kids and I had not.  It was a unique experience for us.  This was not an inexpensive meal and for the 12 of us (9 adults and 3 kids in the 4-7 yrs old range) with tip came to about $350.  The adults were $32/person and the kids were $5/child.  

The price of $32/person gives you all the meats as well as the salad bar.  If you only want the salad bar, it's $20/person.  There was a reasonable variety for the salad bar of some Brazilian entrees - Brazilian Beef Stroganoff, Brazilian Fish Stew, Brazilian beef Stew and some other stuff like Alfredo (it had more of a tomatoey type look to the sauce rather than a while sauce).  There was a Brazilian Fried Rice (looks similar to Chinese Fried Rice but the meat is cooked differently.

There was also white rice and some other dishes I cannot remember.  That was more the hot foods section, which is what I mainly ate.  There were some nice cold salads ranging from a Mozzarella Salad, Grapes with Gorgonzola Salad, Couscous and other stuff that I didn't try nor can I remember the names.  Guess I should have taken some pictures here.

There was also like regular mixed greens and stuff like that if you want a more traditional American salad.  I don't know if they had soups or not.

So if you just wanted to do the salad and not the meat part, this is definitely doable and there is plenty of food to fill up on here.  They do have beef, chicken, fish, and some cold cuts, so there is meat at the salad bar, but not the kind the meat servers were walking around with.

There were a variety of meats the meat servers walked around with.  They only had 1 kind of fish and I don't know the name of it.  They had LOTS of different beef - Parmesan Beef, Beef Tenderloin, Ginger Beef Kabobs, Garlic Beef, and I don't know what other beef things.  They had various chicken, some with marinades and even chicken hearts.  Didn't try the chicken hearts as I don't like eating animal organs.  There were also pork and sausages, as well as lamb.  

The piece of lamb I had was really on the almost baaaaing side, and that grossed me out to the point I didn't want to try lamb again.  I do like lamb, but seeing the blood ooze from it made me queasy.  I should have told him more well-done.

They have this little block thing that has a green block on one side and red on the other.  If you have the green block up, they just keep coming with the meats and it comes quickly.  When you have it turned to the red block side, it says no meat right now.

There were a lot of birthdays that night, including mine.  I did have a birthday coupon that allowed me 1 free dinner - so the dinner would've been closer to $400 instead of $350 for the 12 of us.  Expect about $35 before tip for 1 person, if you just drink water and don't eat dessert.  Not sure how after all that food one would have dessert, though we did split the birthday flan (free with the birthday coupon) among probably 10 of us.

They did not ask for my driver's license to verify it was my birthday, but I had my license, so that would not have been a big deal.  Erin was a good server, even when he tried to be humorous.

It was quite noisy in the restaurant, bur probably because there were a lot of people and all the voices.  The music was not loud.  It's best to make a reservation as when we got there for our 6 pm reservation, there were people outside waiting and when we left a little after 8 pm, there were people outside waiting.

Would do this again for a special occasion or date night with my husband.  Our 16 yr old daughter liked, but our 13-yr old son, I think he would have preferred the Asian buffet instead.  

Lastly, the Brazilian Beef Stroganoff could use more meat.  I make this dish at home with lots of meat and think mine tastes better.  My Colombian husband thinks so, but Rodizio's isn't bad, only if it had more meat.  I also heard from a couple other people at my table the restaurant could check their \"salad bar\" more frequently and keep things refreshed and stocked better.  This was a Saturday night."}
{"text":"Our favorite place to eat!  Excellent service from Thiago today!  The food here is always good.  Salads are fresh.  And the restaurant is always clean."}
{"text":"Taking advantage of Arizona Restaurant Week, we went to the Rodizio Grill in Mesa. We were a few minutes early for a 6:00 reservation, so we sat outside on a bench while they got our table ready for us. Restaurant week is an opportunity to dine at reduced prices at local restaurants. While our price was $33 for each person, which is about the normal price for a meal, they added at no cost an alcoholic beverage or complimentary house special soft drink as well as dessert at no extra cost.

For those who have never had Rodizio, it is a Brazilian style dinner. It starts off with an unlimited very nice salad bar which was stocked with some very different salads as well as some hot dishes. Available were items like Beef Stroganoff, Feijoada (traditional Brazilian stew), Mozzarella salad, Bacon, Lettuce, and Tomato salad, and lots more. However, if you fill up on the salad bar you will not have room left for the main attraction, the \"Meats\".

Among the meats served were - Picanha Top Sirloin (A lean, juicy cut of beef with a mild and sophisticated flavor), Bife Com Alho (Tender steak basted in garlic seasonings), Maminha Seasoned Tri Tip Sirloin, Miolo da Paleta (Beef Center Cut Skirt Steak), Whole Sirloin, Frango Com Bacon (Lean, juicy chicken breast wrapped in bacon), Frango Agri-Doce (Sweet and spicy chicken), Sobre Coxa (Marinated &amp; Seasoned Chicken), Coração (Grilled tender chicken hearts), Linguiça, (Brazilian sausage), Lombo Com Queijo (A tender cut of pork, served with parmesan cheese- and bacon, Presunto (Ham), Cordeiro (Boneless leg of Lamb), as well as others that I cannot recall.

On your table is a small rectangular block with one end painted green and the other end painted red. When the green end is up it mean you want more food, and Gauchos will circulate in your area with food on long swords and large knives. They will cut off as much meat as you wish each time one of them comes by. There were so many of them in the area that we had to turn our block to red for a while until we could finish what was already on our plates. Then we turned the block back to green and the Gaucho's started coming around with more meat. Because of the way the meat is cooked, you can ask for any degree of doneness and it will usually be available.

The steak with garlic was particularly memorable as was the chicken wrapped in bacon, the ham, and the lamb. We all had seconds and or thirds of these meats, plus the regular portions of the other meats.

The only way to properly describe this restaurant is as a Carnivore's Delight. One of our party was a true carnivore and probably ate several pounds of meat.

When you lay your block sideways on the table it signifies that you are ready for dessert.

Dings - only one - there are two types of waiters and waitresses on the floor. The meat waiters, who did a terrific job of keeping our plates well stocked, and the service waitresses. Our service waitress was a disaster waiting to happen. She made our meal drag on because she could not be found and was so very slow.

Bathrooms were nice and clean and properly stocked.

3 stars for cleanliness and quality of food."}
{"text":"My husband and I went there with my husbands brother and his wife for a birthday meal. We had heard about it in an AZ Central write-up. It sounded delicious and it didn't disappoint! Nathan was our server and he was nothing but amazing. But really, the entire staff makes you feel welcome, from the people making sure the salad bar is full and neat to the gauchos serving the scrumptious meat! We all did the full Rodizio and loved it. Bring your appetite, though, as it's a LOT of food. We also had flan and the chocolate torte for dessert. I don't like flan, but since it was our birthday, it was on the house. It was really, really good! The torte was rich and smooth and paired so well with the fresh bananas and whipped cream. I would definitely go again. This place doesn't disappoint, and I hear they are now serving brunch!! The only issue I had was that I was cold and kept my jacket on, but I'm always cold."}
{"text":"Great spot. Servers are friendly, and management staff makes an effort to make you feel at home. Their cuts of meat are fantastic. The lamb is my favorite."}
{"text":"Came in for Lunch, and maybe that's why, but the roving meat selection was slim pickings.

Unlike most of the places who typically have a Red/Green coaster, this restaurant used a wooden block with one side painted Red and the other Green.  Kinda unique.

Flavors were decent in the beef selection but not much of an option.  The chicken and pork were dry.  Sausages were flavorful.  Chicken Hearts were unique and it was ok.  Pineapple was a nice touch.  No fish or Lamb available.

The \"appetizers\" on the table were a bit lacking in flavor and the Salad Bar was underwhelming.


Service was friendly and attentive although it seemed like they were still working on getting settled-in.

Prices are in line with what you would expect at these types of restaurant.


Nice place to visit if you've never experienced Brazilian Steakhouses dining before."}
{"text":"All you can meat! For those looking to implode on protein and grilled meats you've come to the right place. Rodizio Grill offers two different price structures: For $19.99 you can have the all you can eat salad bar only, or for $29.99 you can have the unlimited salad and meat skewers.

We started our food journey by being offered fried bananas and fried polenta with cheese at our table. Both were delicious and were a good way to begin our meal.

For those uninitiated into Brazilian style BBQ, servers will come to your table with their skewers and you can choose which ones you want to sample. When we were here they had top sirloin, tri tip, lamb, bacon wrapped chicken, bacon wrapped beef, chicken hearts, chicken thighs, sausage, sweet and spicy chicken, and I did spy a table getting some grilled pineapple that I unfortunately didn't get to try before I ran out of room in my stomach. 

The salad bar had a wide variety of items to try, such as make your own salad, coconut pineapple coleslaw, beets, candied bacon, and ceviche. There was also a hot foods area with selections like collard greens, feijoada, and brisket stew. They were all decent, about what you'd expect from a buffet style of food.

Most of the red meat skewers were well done by the time we got them, although the lamb skewers were nicely medium rare. The seasoning level was OK for me especially since other churrasco restaurants put too much salt on their meat. 

I indulged in a caipirinha which was very strong. If you're into heavy handed drinks this is your place!

For dessert we shared the rabanada and some flan. The rabanada was similar to a cinnamon sugar donut, with a creamy tapioca-like center. The ice cream it was served with was a great accompaniment. The flan was excellent with rich creamy custard flavor and caramel syrup.

Service was superb. We were checked up on frequently and everyone wanted to make sure we were enjoying our meals.

Overall it was a pleasant experience. If I want to indulge in eating from a parade of meats this is a good place to go!"}
{"text":"This place is just so-so! We had Valentines reservations & there were quite a few empty tables & they were turning people away. We had our section of the restaurant to ourselves for the first hour we were there. The salad bar was good, but didn't compare to other Brazilian steakhouses. My husband and I sat at the end of the table so the whole time we were having to hand meat down to everyone else at the table. I liked the dessert options but the  meat I was pretty disappointed with. The majority of the options were all the same...I felt like and the majority of the meat  was rare or close to it. I am more of a well to medium well girl. For that reason alone I won't be back. I tried the chicken & it was kind of rubbery. I also noticed the better meats came out later after we were about full. I'm glad there's a Brazilian steakhouse in the East Valley, but let's hope this place can step it up or they'll be like the rest of the failing restaurants that once occupied this same building and fail miserably!"}
{"text":"Absolutely delicious! Great service! Love their bread! Their meats are cooked to perfection, and their buffet portion has a lot of delicious variety! Including seafood options, which my husband loved! Their desserts were AMAZING!"}
{"text":"Really disappointing experience. Poor service in general, and poor food quality. All of the meat was heavily overcooked, some even so far as being crunchy. I asked for medium or medium rare more than once - but the meat-servers kept bringing only well done, or extra-well done meat. I noticed several tables (including ours) had to wave at their waitress to flag them down. I went to one of these a few years ago in Denver and it was a good experience. This one seems to be run by amateurs. Don't waste gas driving out here, it's not worth the trip."}
{"text":"Had an awesome time here!  First experience at a Brazilian steak house, and we loved it!  Kevin and Sonia were attentive, but the best was obviously the selection of meats that never stopped.  You could just come by for the incredible salad bar, but why would you want to?"}
{"text":"I read several reviews before we came here, and honestly I'm just stymied by some of the things that I saw. So with that in mind...

We had a great experience here! We got here pretty early, I think it was about 4pm or so on a Friday afternoon. There were only two other parties sitting at the time, so we got a nice booth. Our server was prompt, attentive, informative, and polite. I ordered the limeade and my girlfriend ordered something fancy which was sort of minty and tasty. Both drinks were excellent (and there was a slice of lime on the limeade, if that's some weird dealbreaker for you) and the limeade came with free refills, so I tried the guayaba limeade as well, which was equally delicious!

We checked out the salad bar, loaded up, then sat down to start eating. Everything was really nice- the heart of palm seemed actually fresh- I've never had it except for out of briney jar, so that was a really pleasant treat. And they had quail eggs, yo! QUAIL EGGS!

So then the meat started coming, and once it started IT DID NOT STOP. Between the bacon-wrapped sirloin, the spicy chicken, the ham, and the pounds and pounds of other meats I eventually found myself staring glassy-eyed at my plate in carnivore heaven. I felt like an ass because I didn't finish my salad, but I honestly had no idea that so much meat would be piled on my place so fast. The bill was reasonable, the service was great, the food was excellent, and I have nothing but nice things to say about this experience. We'll definitely be back, after like a week of cardio.

Getting here early might be the key- it seems like most of the people who complain about getting stuffed in the oubliette might have gotten here at a later time on a particularly busy night with no reservation. Which definitely sucks- I can see how that could make for a crappy experience, but you have to understand that a place like this tends to fill up QUICK and most people have reservations. Especially during snowbird season. Or whatever, I dunno, just come here and eat some meat."}
{"text":"Chicken options are great. Beef are pretty good depending on how well cooked it is. Pineapple is fantastic! Also LOVE the limeade drink.  Fun place for dinner. $35 per person"}
{"text":"I discovered Rodizio when I was driving home this past Saturday night. The line out the door really grabbed my attention. I changed my plans for Sunday night and gave it a shot. I am so glad I did. Five stars all around, from Issac who greeted us when we arrived, what a great welcome, to the gauchos that were so friendly and they just kept bringing us the most delicious meats and grilled pineapple too. I want to thank Kelly our server and also Brieanna she has the most positive energy and assisted us with a special request for our table as we ended the night. I made it very clear that I was very picky about my Creme Brulee and I told them I was going to put them to the test, since it was claimed to be the best.  What came out of the Kitchen did not disappoint, I honestly did not think that I was going to be having one of the best Creme Brulee ever and this certainly was.

 It appears that I am going to be checking in a lot here. For a place that has only been open for business for about a week and is getting 5 star reviews, says a lot about the Management of the place. I had a chance to meet the owner \"Chef Nick\" when I was there, I can see why this place is getting such rave reviews, it's very obvious, he knows how to run a restaurant. The food was amazing, the staff was top tier and I really appreciated the fact that the management came to our table and checked on us to make sure that we were having a great experience, which we all were.  I have been to a few other Brazilian steakhouses and they have fallen short by the poor quality meats and limited salad bar. Rodizio has great quality meats and a delicious gourmet salad bar that was fresh and had a large variety of great salads, there is no way that you can leave hungry, this is now hands down my favorite place.

For the quality and variety of food, the atmosphere and the very well trained staff. Rodezio is my new favorite place. To top it off, I no longer have to drive to Scottsdale to enjoy a high quality authentic Brazilian Steakhouse experience. I can stay close to home in the East Valley

I already have plans to have a business meeting there next week."}
{"text":"Would love to give them 4.75 stars actually!

Communicated well with me via phone to determine whether they had the accommodations (private-ish large area) for mini-graduation celebration with 18 adults and 5 kids.  Yes!

Staff was absolutely friendly.  This positive attitude despite telling them that we were coming 30 minutes ahead of time and they were recovering from a lunch rush.  We arrived about 3:30pm.  

Took a bit for them to get situated BUT they immediately gave us waters, Samantha (our main waiter) apologized and definitely tried to get things going as well as continuously checked in with me throughout the meal, and if we did flag someone to ask them a question or order something, they immediately responded.

The salad bar had meats and seafood so if you opt for just the salad bar, you won't go hungry.  There were about 8-10 meat/fish/chicken/pork/lamb options roaming about at a pretty steady pace.  The food was great!  The only thing I wanted to say was the rice was a tad dry but overall, my mom loved it and she definitely would say something if it was not good.

I would go again.

Good for kids, groups, celebrations (graduations), and just beast mode hunger."}
{"text":"Underwhelming, at best. The service was dull, the ambiance was odd ... nice interior, but a staff that seemed ill prepared. They were training some folks tonight, so that's understandable, but the whole place was just off.

Salad bar is OK ... good food there, but they ran out of plates twice on a night when it was less than half full. The meat was hit and miss .... good Tri tip and lamb, average ham and steak, underdone chicken and sausage. Just not that tasty when the price and expectations are for a nice night out."}
{"text":"This place was ok service is slow took for ever to get drink refills and meat to come to the table. The salad bar is good. Wasn't to impressed was expecting to be wow'd. I've always want to try a Brazilian place I would go back if service was better. May they need to train on service to customers"}
{"text":"Amazing food with awesome customer service. Brian and Chad were both outstanding. Come hungry for sure."}
{"text":"I went to brunch on a Friday with a friend to give this place a try. I realize not all the meats were available, but there were enough to get stuffed! This place is a little more casual than Fogo in Scottsdale, and a bit cheaper, and a lot closer for Mesa/Gilbert people. The food options at Brunch were great!  There were many things to choose from. The salad were fresh and delicious. The meats were very good!  I really loved the top sirloin and picanha. Even though all the meats were \"well done\" they were very soft, juicy, and flavorful. I kind of wished I had asked for medium to see how they turned out. All the gauchos seemed to be Americans who learned how to pronounce the names of items very good. At Fogo, most of the gauchos are Brazilian and it is fun to hear them speaking Portuguese to each other."}
{"text":"Ordinarily the  place is great. Been there a few times now. Purchased gift cards for my son and two grandsons for Christmas and they LOVED it!
     However, I had reservations for 6 on Friday March 30th at 5pm. We were seated promptly. The server came to the table to take our order and it took quite a long while to get our drinks. Two of which were water with lemon and an Arnold Palmer. When she finally arrived at the table as he did not have the water or the Arnold Palmer.
     She did not explain how the red/green block works, what the guys do, why they each had tongs, OR what the salad bar entailed so they could decide whether they wanted the full Rodizio, or not. This is unacceptable.
     Please inform the young lady server with the dark hair, ponytail, and glasses, and provide more extensive training. 
     She never explained the desserts, and the plates were not cleared by anyone. We sat there in the mess while we had our last round of cocktails, and no plates were cleared until it was time to pay the check. 
      I was not impressed but disappointed that I chose Rodizio for a positive dining experience for my friends who were here from Chicago. 
     My guests were polite but I can speak for them when I tell you we know a good dining experience, and this was not good.
       Please step up your game. Get back on track. You have a wonderful concept which falls flat if not carried out. You charge way too much for not just 1, but 6 guests to have been disappointed."}
{"text":"My husband won a raffle prize at an event for a free full Rodizio experience so we gave it a shot. I had never been to a Brazilian steakhouse before so I was excited to give it a try! 
The restaurant is very clean and elegant, you can dress up, or dress down. The servers and everyone were very polite and informed us of all the \"procedures\" and how to get the most out of your experience. 
The salad bar is loaded with fresh, delicious cheese, veggies, olives, and other yummy things! They're hot food bar had a great selection as well. I had the mashed potatoes and sautéed mushrooms. 
The meats they brought around were always hot and fresh right off the grill. They sliced perfect portions, and told us what every meat was in detail and how it was cooked. Our waitress brought us our sides which I wasn't all that into, I'm a meat kind of gal. 
I had a Rodizio Sangria to drink and it was delicious! 
For having just opened, this place really has it together. It was a great first time at a Brazilian steakhouse! We will be back for sure. 
Keep up the good work Rodizio!"}
{"text":"The service is awful. Meats were overcooked. Had really terrible service, waitress with bad attitude.

 Our drinks never came asked our waitress two times, she said \"the bar is really backed up.\" Never got the drink I ordered. 

Salad bar was poorly maintained. Many items were empty. I asked two times if they had any French bread or garlic toast or any other kind of bread two different staff, one guy answered in a short tone and looked over at a very dry hard roll on the saladbar and said \"there's bread\", I poliletly asked if there was garlic toast or french bread (which was on the saladbar) he snidly said, \"that's bread\". 

We had a large party (18) and was terrible service. Never had any table service for clean plates, we stacked and stacked and waitress just ignored it. We sat in the back and took forever for the gaucho meat servers to come around and pineapple only came around twice even after we requested it, never came.

 Bathroom was dirty.  Not worth the trip. Well worth the drive to go to the other place in Scottsdale if you're going to pay $$$. 

I\"m sad because I was really excited to try this place and have a Brazilian steakhouse in the East Valley."}
{"text":"Special occasion location! This place is great for anniversaries, birthdays or whatever! Can be kinda pricey, but definitely worth it.

Their main theme is meat! Meat meat meat!! You have tons of different choices of meat and flavors.

Don't worry if you are vegetarian or vegan because they have a super charged salad bar! It's not some crappy salad bar at all! They have every veggie, pickled veggie, bread etc you could want!

Very clean and well kept. Staff was kind and accommodating. 

Critiques: Service was slightly lacking. I didn't get a \"salad bar only\" placemat and our drink was a little late. Not huge issues, like I said."}
{"text":"I went back to this restaurant after talking to the general manager. We simply requested not to have Kelly again. We had Jerrod who was absolutely amazing. What a difference. The service was amazing and the food is even better. Go there and enjoy!  Amazing, amazing, amazing!"}
{"text":"If your looking for something different then just a normal sit down order from a menu this is your place. The salad bar wasn't anything amazing I've been to other places similar and their salad bar blew this place out of the water, the meats were pretty decent and the grilled pineapple was amazing! The waiters were persistent and always walking around but didn't bother us to often and allowed us to enjoy the environment and food!"}
{"text":"I have been here 4 or 5 times. Today the service was not good. We got there before a large brunch crowd. Drinks were not refilled well at one point the server took our drink glasses and I think just forgot about us. After 8 mins I asked her about them.

The other big problem was all of the beef was way over cooked. There wasn't even any medium it was all well done. My wife won't even pay for the meat because it is all so over cooked. We asked for medium rare or even medium meat and they just didn't ever bring any. None of the beef had an even hint of pink. The meat servers were all very nice. 

I have been to a lot of Brazilian steak places and most don't over cook their meat this badly."}
{"text":"What an awesome meal. Bring your stretchy pants, not a date! The meats were fresh from the grill, great service. They have a salad and sides bar, but you won't need it."}
{"text":"More options here than what another Brazilian all out can eat steakhouse has - appetizer and main course wise. Great bang for your buck!"}
{"text":"I visited this restaurant with a larger group of people. I have to agree with the folks who mentioned the slow service. I do not eat meat, therefore I only ordered the salad bar. During my first trip to the bar, a friendly manager advised me of the dishes I could eat. I appreciated that. However, our server talked to us when we first arrived but then disappeared for the rest of the evening. We weren't even able to get our water refilled. Very disappointing!

The folks with the meat came around frequently, though."}
{"text":"Pricey and mediocre.  Staff is very friendly, but the meat selection is not as good as Fogo de Chao.  Also, many selections were slightly overcooked - chicken and pork were dry, and beef was well done (I prefer rare to medium rare).  We won't be returning."}
{"text":"I came here recently with a small group during AZ Restaurant Week because I'd never experienced #allthemeats at a place like Rodizio and Fogo. Their website allows for online reservations PTL, so it was quite easy to get it set up. $33 per person during AZRW is quite a steal based on looking at their menu. 

Couple of my friends arrived earlier than myself and they were fine to sit them before my arrival. Our server was quite amazing, as were all of the guys coming around with #allthemeats. Can't even begin to rattle off a list of all what I ate. Enjoyed every bite until I couldn't eat anymore. The sides though and the salad were a-ok. Probably worth another visit to try out more of the sides and salad."}
{"text":"A great spot for families and date nights. The servers are super friendly and prompt. You also get meal on your birthday with purchase of a full adult meal which essentially is a BOGO."}
{"text":"We arrived last evening to treat a family member who's visiting to a nice meal.  We've come here a few times and have always enjoyed.  Last night was fairly busy when we arrived (7p'ish) and had about a 10 minute wait.  No problem.  Once seated - placed drink order and hit up the salad bar.  First few servers were quick to come around with pineapple, garlic beef and a chicken option.  And then they came around again and again (with the exact same meat offerings).  I had asked one of the servers what meats were available that evening and I would guess we were never offered over 1/2 of the choices.  Our main server asked if there were any meats we would like, I asked if we could get the tri-tip and never saw it.  Finally saw a sausage option and the glazed ham.  While the food is delicious, I left feeling we didn't get our money worth last night and the meat options were not readily available.  We noticed numerous times that there were ZERO servers coming around with any meat at various times and had to wait quite awhile between offerings.  Not sure if it was an off night, but I sure hope that isn't becoming the norm for this establishment."}
{"text":"Saw there reviews and though i would give this place a try. If been to  a restaurant like this in wi and a absolutely loved it.
 I was sat immediately after walking in. I sat in the bar. I got the unlimited mimosas by the recommendation of my bartender/waitress, good idea the flavors of juice were tasty.
 My waitress was very knowledgeable and attentive. 

How ever bye me sitting in the bar none of the meat servers came my way. I probably sat for a good 25min and only one meat/server served me . I brought this to the attention of my waitress. Probably waited another 10min and another gentleman asked how I was doing. I told him the same thing I wasint getting served. Right after talking to him my plate started getting full. 

The food all very tasty. Especially the Pork and Beef items I had all amazing. The chicken was also pretty good very tender meat. They also have and unlimited saled bar with variety of choices. Very impressed. 

Food definitely 5 Stars
Atmosphere 5 starrs
My watress/ bartender 5 stars

The only reason I'm giving 3 start is because how long I went unnoticed. Not matter is your slow all areas should be checked for customers.

I would like to give this place another chances probably at dinner time too instead of brunch. They offer more meat selections at dinner time."}
{"text":"This is a meat lovers paradise. Also has a salad bar and drinks are good. The servers keep coming around with different assortments of meats to try. Great for dates, and birthdays. Will be coming back for more."}
{"text":"Raw chicken, so raw that it was still clucking. Had to change out plates and silverware for fear of contamination. Mediocre service. Had to ask to please have some meat besides raw chicken be served at our table, as literally no servers were stopping with meat. Cheap tables and chairs that kept sliding around. To top it off, got sick a few hours later. The bill for our table was $500. What a waste of money. Fogo de Chao is way better. Would give this place a zero if I could."}
{"text":"Geeeze!! From beginning to end this place was delish! If you have food sensitivities pack in your own knowledge - the wait staff/kitchen staff aren't very knowledgeable. They actually had a penne pasta dish labeled as GF and even after I brought it to their attention they seemed fairly clueless. Other than that - YUM!!"}
{"text":"The reviews were mixed; but I guess there are just some people that can't be pleased.  The building was impressive, nicely decorated and the staff was very pleasant.  Nathan at the bar was helpful, professional and kind; Sonia our server was efficient and pleasant, but the real delight was the food and the \"meat servers\"  Jose, David, Avilia (sp), these guys were personable, polite, next to the food the real rock stars of the evening.  They were engaging and pleasant, and the food was really good.  Especially the Tri-Tip, where the fat on the outside gets the crispy goodness packed with flavor.  The salad bar was more like a salad island, very complete and very fresh.  The entire experience was positively delightful and I would not hesitate to return.  I appreciate the sincerity that all reviewers provide and the proactive response from the restaurant, but I was unable to find a single fault or experience any of the negatives I read about.  For some the glass is always half full - for me personally, anything in the glass means its not empty.  I would take friends, family and important business clients with confidence."}
{"text":"I have been here a total of 3 times! the first time was amazing it was right when they opened the service was amazing. They explain how it worked and the different servers came with all different kinds of meats. So many meats and so much food! I left so full and the money splurge was worth it. 
The second time I came it was a party of 12 and the service was okay I just thought there was a ton of us so it was hard to manage and the meat was amazing so I brushed it off.
This time was absolutely awful. The server was rude and about 4 meats went by when nothing no one came by our table for 30 mins before the server came by and asked for our plates but we said no we are still eating the green cube was up. I thought that was weird another 10 mins went by and 1 meat came and the pineapple and then the manager came by. she has how we were doing and if we needed anything else I said I wanted chicken wrapped bacon and brought it out. I basically had to beg for meats to come out to our table which was so weird and has never happen before. So paid a pretty penny just to go to mcdonalds and order more food. I don't think we will be back any time soon."}
{"text":"What a surprise to go to such an awesome place for dinner tonight.  Great service, great food great company with my son Kris and his wife Carrie for their birthdays."}
{"text":"Our second visit here Sirina our waitress and Chad the meat man were really helpful. It is my 26th birthday! And they really made my night feel special.

Chad even recognized us from Our previous visit. The top sirloin, garlic tenderloin, and pineapple were my favorite! 

The employees sang me a birthday song in Portuguese and brought me out the cake I brought here for me bday. 

The Rodizo limeade was really refreshing again.

Note: if you're signed up for the Rodizo Grill emails they give you a full Rodizo Grill for free with another full Rodizo purchase."}
{"text":"Great second visit experience.  service was superb, frequency and quality of meats was coming to our table at great pace.  Did not venture much to salad bars, but I was not there for that...Desserts and wine were great!  We shall be back."}
{"text":"Ok, #1 the price is more reasonable than my fave place, but this will have to stay at #2 on my list for now.... 

The meats were pretty good, but their style of cooking didint leave much option to get med rare everytime they came around.. and they did get pretty busy, so it would take awhile before your fave meat came by again.. 

The best was on one trip, the pineapple came by followed by some awesome glazed ham... Wife said best pineapple EVER in her life... we still joke about that.. 

Pros, get there early, and if you are on a Beef Only diet, like i tried to do, it can take awhile between rounds, so get a few extra slices when they are coming through.. 

Cons, Get early cuts, as Med Rare isn't easily accomplished.. :-(

Staff exceptionally good and humorous and tentative... We will be back a few times a year,, 

The Price is RIGHT !!"}
{"text":"We just finished dinner here for Restaurant Week, where they have a promotion for a full Rodizio (meats and salad), a cocktail, and a dessert for the price of just a Rodizio.  My wife hadn't been here yet, so I thought this would be a good night for her to try it out.

It's located very close to our place in Gilbert, so it gets 5 stars for convenience vs driving to Scottsdale. 

We made reservations for 8pm, arrived a few minutes early and were seated at 8:10pm.  No big deal; hostess was friendly.  Four stars at the front door. 

After being seated, we were given the list of drink/cocktail options -- all of which were sugar-laden.  I asked whether I could have something without sugar, like a plain gin and soda.   Our waitress said yes, but she'd have to charge for that.  

Ugh, ok.  Tanqueray please. 

We enjoyed a pretty good palette of options at the salad bar.  I'd give the salad bar four stars for variety and tastiness. Compared to other Brazilian steakhouses, that was probably the part that would be most competitive with other chains. 

Next, we were ready to give the green signal for the meat!

The server/gauchos were attentive, willing to bring any of the offered cuts prepared to your preference.  However, I'd say their offering is a little bit narrower than some of the competition.  

Overall, cuts were slightly above average -- but we'd have a great cut of one thing and then next have something else that was dried out.  Overall, 3.5 stars for the meats, which is really the reason to go. 

Midway through our meal there was a shift change and our attentive waitress handed over our table to another waiter.  

After tasting everything, we laid our red/green signal maker on its side and tapped out; we couldn't eat any more meat.  On to dessert. 

Our waiter explained the two options for dessert.  My wife chose the rabanada, a cinnamon pastry with a creamy center.  I didn't want any sugar, so instead asked to box mine and I'd give it to my daughter. 

Our waiter explained he couldn't do that as take-home boxes aren't allowed.  I showed some disappointment with that and he said he'd talk the manager.  Basically the promotion that drew us in that evening was turning into a dud; no drink and no dessert. 

A few minutes later, my wife's dessert arrived (missing cream in the center) and mine not surprisingly didn't arrive at all.  A few minutes after that, the waiter brought the bill and hurried off, clearly not interested in any discussion regarding my dessert. 

At that point I decided to start working on this review.  Midway into this, the manager stopped by and asked how our evening went.  I explained everything that had happened and she quickly corrected the matter with the boxed dessert and some complimentary drink and dessert coupons for next time. 

Our waiter never spoke with her, so she said she would follow up on that later. 

Her eagerness to make things right quickly saved the meal.  If she hadn't shown up at our table, this review would have gotten two stars or less -- pretty much on the basis of inflexible service.  However, the manager's willingness to correct the matter without a word of debate, along with a respectable churrascaria experience, gets this one four stars."}
{"text":"All around an amazing experience! First time in a Brazilian steakhouse and it's my new favorite thing! Everything we tried was beyond delicious and the wait staff was so friendly! You really have to be hungry because they keep piling on the food!"}
{"text":"We've been twice and it seems like they have it dialed in, the meats were all cooked to perfection and the custom service was great. Carlos the Groucho is particularly wonderful. The Brazilian limeades are to die for. I love the pineapple. 

The salad / sides bar doesn't have many offerings that I enjoy and the desserts we've tried have been just ok - that's why they have a star to grow"}
{"text":"Update! 
What happened????????
We have gone back to Rodizios with friends and had a 5 star experience. Then last night husband and I went to enjoy the rib special before it went away. Wow! Night and day difference compared to the other times we went. They had two! Servers for the entire restaurant. Poor Guys. Then the meat was all overcooked and burnt. Ribs were tough fatty inedible. I pretty much got full off the salad bar and cheesy bread. Such a disappointment. Manager never came around to apologize. She was busy busing tables herself. Not sure if majority of the staff called out or if they were just saving money during the week days. But we probably won't be back. 

-----------------
Five stars?! Say what?!
Saw the coming soon banner while driving by one day...surprised TQLA didn't make it because they were always busy.  But knew we had to give it a try. 
They just opened this week and everything was great!! The huge salad bar has so many different options. But! Don't get full off that. You have several different types of meats to try. Everything from chicken, pork, beef, and even lamb. I love how everything had its own flavor and nothing was bland. The only real \"issue\" I had, was all the meat was well done. I'm more of a medium rare type for my beef. But nothing tasted dry.
Service was great. Always had someone by to refill our waters and take away plates. My husband had their limeade and added strawberry and coconut per our first servers recommendation. Even though i prob couldn't finish a whole drink, it was still good to taste. 
Keep up the great service and keep the food great!!"}
{"text":"Ate here last week, and it was one of the worst experiences of my life. The food was terrible, and the service was even worse. I wouldnt recommend eating here to anyone, my dog wouldnt even eat the leftovers."}
{"text":"Great meal Great time! Went with a couple of friends and we all enjoyed it.Salad and sides bar was excellent with lots of choices and the meat just kept coming.Prepare to eat lots and lots of meat and prepare to go home stuffed."}
{"text":"Lunch on Sunday was disappointing. Slow service and bad quality of meats. They had a lack of good selection and served a sweet meat that is not even Brazilian style. The cheese balls were dried and tasteless. The salad buffet could have more selections. Won't go back ever again. Thiago, our server, was very friendly. However, Fogo de Chão is still a better option."}
{"text":"Very disappointing experience. Visited Rodizio for an early Valentine's Day dinner with my husband. Had a reservation. The restaurant was only half full. After 10 minutes of sitting at our table with no sign of a server we asked the hostess if anyone was assigned to our section. About 5 minutes later someone came to take our drink orders and directed us to the salad bar. Our salad plates were empty before anyone came around with meat. We kept our token on green (meaning we wanted the meat servers to stop at our table) the entire time we were there. There were extremely large gaps between meat service. In the hour we were in the restaurant only 4 meat servers came to our table. We were so frustrated that we finally asked for our check and left with empty bellies....paying $80 for next to no food. The quality of the food we did try left a lot to be desired. The waitress was very apologetic and acknowledged the horrible service but we were not offered any restitution. The couple next to us left right behind us due to the same experience. I would call to voice my complaints to the manager but we have no desire to return to this restaurant in the future. Fogo de Chao is leaps and bounds above this place in terms of food quality and service. This review is getting two stars only because of the friendly and sympathetic waitress. The rest of the experience was a negative 5 stars."}
{"text":"Worst service ever. The female manager is one of the worst person I have ever met in a managerial position. My 8 year old son went to touch the his fork at our table and the server SLAPPED his hand. Are you kidding me. Manager did nothing about this. Took everything I had in me not to end up going to jail. 

And no my son way not acting out or anything like that. He just went to pick up his own fork to eat and the waiter was like. IM TALKING 

Offered me a desert for assaulting my child. 
Really. I don't need free stuff. I make in a week what you make in a year lady. I own a large valley home service business 

\"So here they think it's ok to slap children\""}
{"text":"Loved the salad bar!!  Would go just for that. We weren't impressed with the meats. Great variety but left us flat"}
{"text":"Was looking forward in trying this place, but sadly we walked out after evaluating this place. Bathrooms were extremely dirty, floors were dirty, and a lot of the items at the salad bar looked as if they were sitting there for a very long time.  Did not look appetizing at all. Management get your act together and clean the place up!!"}
{"text":"This is the second time eating here within one week for me!!! Just love the meat they have here. Wide range of variety and very good meat quality. What most important is their staff is amazing! They will definitely impress you with the warm and awesome service!

Thank you Tyler, Thiago, and Anthony for being truly awesome servers! We will definitely visit back again!"}
{"text":"I liked this place, I just don't like it when companies do the 50 bonus to employees who get their name written on yelp reviews. Its dishonest to me to go up to tables and ask for your name to be mentioned. That's not fair to the rest of the staff who don't  think its appropriate to ask every customer to put your name in a review for cash. I had lots of good employees helping us in our selections. Please get rid of this practice or give 50 to everyone instead!"}
{"text":"Went there for a pre-Father's Day dinner. We made reservations ahead of time and didn't even wait a minute to be seated. Our waiter Josh was extremely sweet, but did forget our drinks. No biggie though...it was slammed busy so we understood. Salad Bar and Sides Bar had a great selection, even the kids had something. The meat kept coming and there were many varieties. I give it a 3 for overall experience. With that said, maybe our expectations were too high or maybe we've actually have had Brazilian food, but there is absolutely nothing Brazilian about this place. The meats are flavorless and some were too dry to eat. Even the pão de queijo (cheese bread) tasted nothing like real Brazilian pão de queijo. We asked one of the servers if the fried bananas were actually fried plantains like in Brazil and he said that \"when the restaurant first opened they were, but things have changed\". Fun experience but if you're looking for a real Brazilian steakhouse, this isn't the place."}
{"text":"Second time in this new restaurant !! The good news is David and Nathan were AMAZING!!! Great service from both !!
Took wayyyyyy to long to get drinks and fresh plates !! They need more servers  and a little more attention to detail !!
Hoping they figure it out, food was good!"}
{"text":"Starting from the beginning... We made reservations for 6:45pm arrived at 6:40 and were told our table would be ready in a few minutes. No biggie! We arrived early I get it! But no.. it's now 7 and they don't look any where near close to sitting us. After speaking with the 3 very confused hostess we were not sat until 7:10 because they were \"cleaning off tables\" LIES!!!! Over half of the restaurant was empty! 
Now that we are seated, 2 of our 4 plates were dirty and we had to swap them out with guess what? The empty but yet, set table next to us! Ugh!!! 
Server finally comes by and asked what we want to drink. When my husband asked for the beer list the guy couldn't remember what was on tap because he doesn't drink. I don't care you don't drink! You still need to know your basic drink options! 
So now that we have ordered drinks we go to the very empty and lack luster salad bar just to come back and wait 10mins to get 2 of the 3 drinks we ordered. I didn't receive my beverage until close to the very end of my meal. 
Now everyone has finished, we place the block on it's side, and our waiter walks by us 3 times before asking us if we wanted the check. 
Only good thing about the night was my family, the top sirloin, and the grilled pineapple."}
{"text":"I went there expecting more. Meat was dry, selection of cuts were smaller Than most places. Meat wasn't seasoned well, very bland. Service was good and we were treated well but I wish the food was a little better"}
{"text":"Went to this restaurant,  it's awesome..... it will not disappoint.....one word says it all (((DELISH!)))"}
{"text":"I took my kids and in-laws to Rodizio Grill this evening to take advantage of their kids eat free promotion happening right now. It was a first-time experience for all of us.  We made reservations so we didn't have to wait for our table and were promptly greeted/served by our waiter.  

We all got the full Rodizio, which included the salad bar and the meats that they bring around to your table.  The salad bar has a variety of hot and cold pastas and other dishes, as well as fruit and green salads.  There was plenty for my 4 children to choose from (some are waaay pickier than others).

After our first salad bar trip, waiters then brought around a variety of meats to the table. It was at this point that my 6 year old boy thought he had gone to heaven.  His favorites were the sausage and the bacon wrapped chicken.  Oh and the pineapple.  Warm, sweet pineapple sliced right there at the table.  I honestly don't know how he ate as much as he did.  My father-in-law thought the tri-tip was amazing and my husband tried chicken heart for the first time, which he enjoyed.  All of the meats had really good seasoning.

Overall, it was a meal that 8 out of 8 people enjoyed (4 of those people being semi-picky small children).  I would recommend to anyone."}
{"text":"This is the place to go if you are a meat lover.  Wow what an experience!  Great fun and energy.  Annamarie and Savanna were great servers. Annamarie really took care of us.  We had to come back two nights in a row.  The manager was great and really works well with her team. She interacts with customers and keeps it all going. This is my new favorite restaurant when ever I am in town."}
{"text":"What a great place. Started out with Sonia and her partner Heather. What great service. Our meat server, Thiago was the best. If you have never been here then put it on your bucket list! The food is second to none and the service is top notch to say the least. Try the Passion Paradise drink, WOW. FINALLY the night mgr, Shawna, went out of her way to make sure the service was great. 
Thank you my wife for bringing me here for my birthday. You are the best and the love of my life."}
{"text":"Me and my girlfriend just ate here for the first time.  Food was EXCELLENT, staff were EXCELLENT and the overall experience was EXCELLENT. The price for the meal was well worth it. Definitely coming back!"}
{"text":"Agree with other people. Disappointing. The food was pretty good but the all you can eat salad bar, etc... was poorly stocked. Several trays were empty making the salad bar extremely  below par. There was several items that were not restocked. In an effort to make ammends the manager offered to give me a gift card to come back. Which I appreciated and gave them my address. The gift card never came. Just another example of the managements poor organization."}
{"text":"It's about time a great fancy Brazilian restaurant came to the East Valley! WELCOME!!!

When we first arrived here at 4:40p.m., there was already a line waiting out the door. You could clearly tell that the owners & hostesses were overwhelmed and nervous. I had no idea they were only opened for just about a week and that was their first opening weekend. After putting in our names on the waiting list, we were seated in less than half an hour. The interior of the restaurant was definitely well decorated & has a comfortable outdoor seating areas for huge parties. Our server was extremely friendly and helpful. So were the staffs who brought over the meats one after another. My favorite was the fried bananas appetizer and grilled pineapples (I had at least 10 pieces of those). I know....I am supposed to be here for the meat. But boy those were absolutely delicious. For approximately $40 per person, you can have all you can eat salad bar (with huge selections) and unlimited amount of meat that comes around your table. Dessert and drinks are not included in this price. We had a crème Brule (and I forgot what the other one was). After we both ordered 2 sodas and 2 desserts, the bill came to less than $100 (including 20% tips). I thought that was very reasonable considering how much food we've eaten. 

Some of the meats was a bit dry but still tasty. On the first week of their opening, I thought the overall experience I had was fantastic. I will definitely come back here again to dine in....and next time, we will certainly come back with a group of friends."}
