{"text":"Oysters were fine. The hot sauces that went with them weren't very hot at all except for the hottest one. 

My smoked salmon didn't taste different than store bought ones. My homemade ice tea was unique. Not too sweet and wasn't l overpowered by lemon either. 

Our server was very nice and accommodating. She made some good suggestions to us. 

I'm not sure I would return. I may go back to Diana's Seafood instead."}
{"text":"Love love love ! Great food! Really hits the taste buds of sea food lovers ...the best way! 

have been here many a times .... Love how they change up a lot of the plates! Always a new adventure  

(Summer nights)Lobster Bisque - creamy buttery not over salty just perfect! 

(Summer nights)Scorpion Fish with Roasted Garlic Mash - Garlicy creamy perfect mash - Fish was flaky tender perfect ... Severed with a side of roasted crisp veggies. 

(AIl year)personally love the smaller oysters ... I usually eat 12  just for me! 

(Entering spring)Tuna Tartar -Fresh And Toasts were a perfect duo

(Autumn) Seared Tuna with a creamy broth was absolutely perfect and the long chip

Clam Chowder - Creamy perfection with a little potato"}
{"text":"Great fresh and tasty oysters. Hosted some friends here. Manager on duty that night made the night. Thanks"}
{"text":"If you haven't already discovered this jem and love all things Sea Food including Oysters then Rodney's NEEDS to be on your list. 

I had my first Rodney's experience in 1989, I was 4 years old LOL!!! 
And to this day, I salivate at the thought of sitting behind the long bar and enjoying a cornucopia of north american Oysters with good friends. Simply -the best Oysters in the city with the fresh graded horse radish and variety of accompanying hot sauces . Then there's the ambiance. 
You can have a quiet and romantic table or as I prefer, sitting at the long bar while  trying to duck the shucking shrapnel...kidding. These folks Shuck The best and help create that one-of-kind personal experience. Louder & Livelier is my taste.

This is a wonderful Canadian success story with it's East Coast roots proudly displayed and has maintained it's reputation by never forgetting where's it's from and how it got to be so dam popular. In a world that love's the \"next great thing\" it's reassuring to see the longevity of a brand known for constantly over delivering.

Myth Busted....you need not try and swallow Oysters without chewing. Some of these things can be the size of your hand.

Nuf said....gotta run.....lap top's getting wet from me salivating."}
{"text":"Ordered the Lobster Roll lunch special. It was good but I wished there was more Lobster in the Sandwich but I guess I can complain since I only paid $10 plus taxes and tip."}
{"text":"Had dozen oysters, lobster club, shrimp cocktail.  All great but shrimp cocktail. Shrimp were not firm,  soft and not cold.  Seemed marinated and had a light colour did not taste fresh.  Killer cocktail sauce.  Cherry cider was remarkable.  Love this place worth the drive from Barrie.  Go to SOMA for a Bicerin and you have a perfect outing.  Waiters are hilarious."}
{"text":"Quick review:

Food: 
Really good
Service:
Friendly bar staff. We sat by the bar and we were served as fast as they could as it was a Friday night. This place does get busy.
Price: 
A little bit on the pricey side but you're going to get that on King West. Also, it's seafood - good, fresh seafood in Toronto is pricey!"}
{"text":"I was on the hunt for a good oyster place and Rodney's did not disappoint. I walked in and the smell of the sea filled my nostrils. I went there once for dinner and twice for lunch. The oysters were fresh and tasty, the chowder was awesome. The guys behind the bar were knowledgeable and friendly.
On my next trip to Toronto this will be one of the first places I visit and probably the last before leaving."}
{"text":"Yay for Summerlicious and getting me to this neck of the words to try out Oyster! The food here was just spectacular and I ended getting another order of oyster (massive one) to go along with my mussels as the selection and quality was top notch. 

This is definitely a place I'll be coming back regularly to get my fix of oysters and tasty beer to pair! Also, it's pretty cool to say you get your oysters from one of the world's premier shuckers! ;)"}
{"text":"Oh, where did the old Rodney's go??? For those of you that remember the Adelaide location, anything else is a disappointment. The ambience just isn't there. That said, the food continues to be great and the service is always dependable. As an oyster bar, it stands heads and shoulders above the rest, even though she ain't what she used to be."}
{"text":"This was my 4th visit to Rodney's and I have noticed a considerable improvement on their service. The food has always been wonderful here, but last week was especially delicious. Our group of 3 ordered a variety of dishes including fried clams, New England Clam Chowder, Graces soup, Pasta with scallops and an assortment of oysters and each were amazing and reflected a high quality of ingredients. Everything we tasted right down to the homemade tartar sauce was spectacular and unique. As a seafood fanatic I have had my fair share of scallops, crab and clams and based on my experience all these were cooked to perfection in all of dishes we sampled.  This is clearly a high end place and the price tag reflects that, but paying for good food makes every cent worth it. 

As I mentioned earlier the service has greatly improved (which explains my choice in giving 5 stars). Our food came out fast and hot, our servers were friendly and attentive and overall, everything went smoothly.

Last little mention! I order the spiced caesar and it came with a JUMBO shrimp and was HOLY COW type of awesome! Great quality, great food and much better service= one happy diner!"}
{"text":"If you have been to Rodney's in Vancouver, this is NOT the same. 

The ambiance was lacking, and they do not have their famous West Coast Caesars. Menu is much smaller than Van. 

However food was decent and once we got to chatting with our server (used to work at the real Rodneys) we really liked him. 

Want delicious seafood in TO? Try Oyster Boy. Mmmmm"}
{"text":"I love love love this place and have been going here for years. Great place to have a pint (of good beer) and a few oysters with friends or special someone. The chowder is also pretty good but the sit down dinner menu is a little sparse. Come here before or after a meal or outing. Several fantastic house sauces for oysters- I recommend the shallot vinaigrette! Delicious! Little pricey but worth it. The other oysters inthe area dont even compare."}
{"text":"Don't come here around 9:30 - 10pm. Staff seems to want to get out of here and rush your service. They start to stack the patio chairs and clear your table without asking if you are done eating. So annoying, if you don't want us here you shouldn't have seated us. Menu ok not great, lobster club ok, fundy scallops ok, veggies under fundy scallops under seasoned and cooked in the morning."}
{"text":"services is very good, all the servers are friendly. we orders oysters, lobster, soup, pasta, dessert. Its all good, we go back very often whenever craving for oyster."}
{"text":"Great place, friendly and knowledgeable staff. We started  with an assortment of oysters based on our waiters recommendations and followed it with New England Clam chowder and a lobster roll. Food and service were great! Absolutely no complaints."}
{"text":"Mussels, Lobster and Crab o my! 

Our delightful waitress was very accommodating to our rather lively party of 3 on a busy Friday night, she even had an anchor tattoo on her arm, how cool is that!

We didn't have oysters but the mussels, lobster and crab were definitely a seafood fantasy dream come true."}
{"text":"Such a busy place, but it's surely worth the wait! The oysters are fresh and tasty. Two of us had a dozen and half as appetizer and we liked the Massachusetts bay oysters the best. The pan seared char was absolutely amazing! My friend ordered the calamari and it has sweet chili sauce coating which is a zesty flavor, quite liked it!"}
{"text":"Great staff. Really attentive,  know their dishes, work well together and you can tell they like what they do and each other.  The oyster and seafood collection is 2nd 2 none.  Had a medley of North point and pei oysters...succulent and flavorful .  You gotta try all sauces too."}
{"text":"Went here for a birthday party - group of 12. The food is delicious (I had the halibut), but the server was awful. I have never had such odd service, he just walked by the table and we'd have to yell at him what we wanted. He never stopped to take everyone's orders together. You practically had to beg place an order. As a result the mains all came out at different times, mine came a good 20 minutes after everyone else's. He never apologized. I never had a drink as I wasn't able to place one. The whole table was talking about how odd it was. Food was delicious, but the service was waaay off. Also an automatic tip of 20% for a group seems steep, maybe that's why he was so awful."}
{"text":"All the hype around this place didn't make much sense to me. Maybe years of living on the West Coast and enjoying fresh seafood made me biased, but... 
Clams were boiled in water. Chowder was watery too. Tacos - flavorless. The only thing that I liked were fries that came with mussels and bread with butter. Is it worth a $90 meal?"}
{"text":"We sat at the bar, had a couple of beers after work, and had some oysters while my co-worker had some items off the menu which were all great. The service was prompt and no pretentiousness here.  

Will come here again as it's close to our office."}
{"text":"Unacceptable service. 

Called at 7pm on Wednesday night to see if there were any tables open for 7:30pm. The hostess said no, but they had tables for 8pm. Made the reservation via the phone, confirmed via Bookenda with my name and my phone number. During the call, the hostess even mentioned that she was able to pull up my information from my previous visits. Upon arriving at 7:58pm on Wednesday, the hostess insisted that she never took down my reservation, despite the fact that I had the Bookenda confirmation. She said she only had 2 reservations for 8pm in the system,made us sit and wait until the walk-ins in front of us were seated and she had confirmed with the no-shows that they were not showing up. It took a total of 20 minutes to get seated. Remember, we were hoping for 7:30pm and only settled for 8pm when the former was unavailable. If she had told me initially that I would have to wait until 8:20pm, I would've most likely gone to another restaurant that had something available for 7:30pm (50 minutes prior). 

In this case where it was clearly the hostesses' fault (she mentioned remembering taking my call), any other hospitable establishment would have apologised and then sat us at the next available table. I was eager to bring an out of town friend here for dinner and had been hyping it up, only to be disappointed by the service we received. 

What is the point of offering a reservation service and of confirming the reservation via Bookenda when the reservation is NOT honoured? Not okay."}
{"text":"Being from out of town this is DEFINITELY  a fun place not only to eat but to hang out. The server that served the 2 of us, gave us a dozen oysters from all over the country. They also had 5 different sauces to choose from - going from sweet to spicy. I enjoyed all of them.

I also had a seafood soup which was absolutely good. 

Certainly the check the place out especially if you love oysters. You won't be disappointed."}
{"text":"My favorite restaurant in Toronto! My fiancé knows how much I love this place and tries to make sure we hit Rodney's every time we're in town. BEST oysters around.  Tastes like the ocean, it's that fresh. We had the clam soup and fundy scallops too (all so good). Ended the dinner with the key lime pie which was amazing. Seriously."}
{"text":"Went to the Oyster Festival where I paid $34 per person. According to the website it included 2 drinks and 1 food item per person. On the website food items were described as oysters, mussels, lobsters and burgers. When went to the festival they were charging an extra $20 for the lobster! False advertisement! They should had informed the customers that the lobsters were not included in the admission for the festival.  Many festival attendees had the same issue. Would not go to the restaurant or festival again."}
{"text":"I had such high hopes for this meal but, alas, they were not met. 

The most unfortunate thing about the evening was our server. As he came to deliver our drinks we were all wrapped up in a conversation, so he put them down and said to himself \"ugh, you're welcome\". The passive aggressiveness was totally uncalled for. 
I ordered a new beer and he proceeded to describe the beer that I ordered to a guy sitting at our table, ignoring me. 
There were four of us, two people only wanted two oysters each, so we wanted to order 10. The server said he won't do 10 as it's bad oyster feng shui, so we had to order either 9 or 12. 
Not a pleasant dining experience, as you can see. 

My fried seafood dish was extremely chewy with some deep-fried sharp bits in it. The other parts in the dish were tasty though. The rest of the table was happy with their food, so I'll round up to 2 stars."}
{"text":"Best Oyster House in Toronto.  Great variety and quality.  Sled up to the Oyster Bar and watch the pro's work."}
{"text":"Our server was so friendly and so sweet that I absolutely have to give him a shout out here. He picked us eight oysters which could not have been tastier. The lunch was amazing especially the lobster roll. But the smoked salmon plate is one that I would write home about and absolutely come here to get again."}
{"text":"First time here. Felt like home. Kelly the bartender served us with knowledge and information of all the oysters and recommendations based on our interests. Great atmosphere. Friendly staff. Music is perfect, hard to leave this place! Bronwyn, the general manager brought us a smile, she is awesome at what she does! Loved also sitting and eating at the bar, you get to watch all the action of \"shucking\"! HANDS DOWN, best sea food place I have been to yet! Great job guys!"}
{"text":"We came here for a late night dinner.  The oysters, clams, and steamed mussels were lovely.  There are so many varieties to choose from and it was very fresh!  They have fresh grated horseradish and a variety of pepper sauces and vinegars to accompany the oysters/clams!  Watch out for the scotch bonnet sauce if you aren't too fond of heat.  My group loved it.  My buddy had the lobster and said it was very \"sweet.\"  We left very happy customers!"}
{"text":"The best oyster place i have been too. You feel right away the passion for what these guys do. Almost feels like a religion... In a good way. Server gave great advice on oyster selection. Also had a great crab. If you can, sit at the bar and you will enjoy the oyster show all diner.... Wish we lived in Toronto to go back often.... Also, great music selection and ambiance. Servers looked really friendly and fun. Ours could not smile. Only reason why i don't go all the way to 5 stars...."}
{"text":"Delicious oysters. They have impressed for the second time and I can't wait for the third, and to take more people.

The staff is very friendly and courteous. Service is fast.

The basement establishment gives a refreshing change from the busy and noisy king street. Its a great place to relax after a long day at work."}
{"text":"Food was okay, nothing impressed me much. I can go elsewhere for seafood. But the SERVICE...


The hostess who greeted my group was very rude. But whatever, I didn't care much since she isn't the one serving us. HOWEVER, my server was worse!!

I was sitting in the bar area and our male server is actually one of the guys behind the bar dealing with the oysters...so I am not sure if I should call him a server? or just someone handling oysters at the oyster bar. Anyways , this guy was so rude. So rude to the point that I nearly had to get up to speak up. I wanted to leave so badly due to the horrible service. But because a friend of mine really wanted to have oysters, we decided to stay. 


The server was very impatient with us and he looked very frustrated when my friend was asking about some oysters on the menu. Then when my friend told me she wanted to order pasta in addition to the oysters, he replied back \" ok HOLD ON! let me deal with one thing at a time and get the oysters done with first\" . After the server said that, he left quickly. 

At this point, I really wanted to leave. But I was with a group, and it is not up to me to decide for the whole group.

I have never experienced such horrible servers in Toronto. I will NEVER return here."}
{"text":"Rodney's has offered me indifferent service and boring food on two occasions. Both times, the oysters were middling, and once their were shell remnants in two of the oysters which oughtn't to happen where professional shuckers are involved. Furthermore, the oyster chowder was ho-hum, and despite high prices the place resembled a low end wings resto more than a place I'd come to eat an aphrodisiac."}
{"text":"Rodney's and Starfish have been both excellent places for oyster fans. 

The lunch and dinner menus are excellent. Food gets delivered to the table quickly. Consistent and courteous service.

If I'm on King, then I go to Rodney's if I want seafood."}
{"text":"Rodney's is closer to a 3.5/5 for me but because their oysters are just hands down amazeballs, I have to round up. 

You just can't beat how ridiculously fresh and just-plucked-out-of-the-ocean their oysters taste like. Seeing a whole platter of shucked oysters (oh god, do you know how HARD it is to shuck them yourselves, as a newb?) plus their little basket of sauces and condiments makes me light up. 

Other pluses: their freshly-sliced bread, the harbour-like atmosphere in the restaurant, and the clam chowder (GET IT). 

They lose a star for me for their other foods: the smoked salmon platter (it was eh, tasted the same as defrosted store-bought stuff), the periwinkles (aka snails that you had to scoop out yourselves and dip), and the steamed clams (also had to scoop out and dip). 

The last waiter we had was also pretty weird -- he seemed apathetic almost? Like, sure I'll get you your order but also what if I don't? He also clearly forgot one of the foods we ordered AND messed up something on our bill and then tried to play it off cool. Figured $2 wasn't worth fussing over, but still, dude, you're in customer service, smiling won't kill ya!"}
{"text":"Some people like oysters, some people don't -- I'm of the people that do like oysters. Now, nothing beats fresh out-of-the-sea kind of oysters from say, the south of France; but if you find yourself in and around the King and Spadina area of Toronto, Rodney's is truly the next best thing!

Jennifer L. and I sat at the bar and watched as they shucked our oysters. With a large variety of these little critters from around the world, we ended up with a selection from mostly out East, chosen by our server. We also partook in the lobster bisque which was a delicious affair. 

My guess is that the oysters averaged about $2.50 each, dishes were mostly in the $12 range while the main seafood dishes went into the $20 so you will most likely be spending upwards of $30/per person.

For those of you still on the fence about oysters, this would be a good place to re-visit your mollusks palette!"}
{"text":"Porn in the bathroom. I'm not against porn or anything, but it's really poor taste to have it posted in a bathroom in a restaurant. I don't care if it's \"artsy\" by being black and white, but I go to the bathroom to pee not to look at girls spreading their legs."}
{"text":"Came here on a friday night. No tables were available so we ate at the bar. Bartenders were helpful. I've never had oysters, so was guided through what each type of oyster tasted like and where they came from. We grabbed an assortment to try. For the main, I grabbed Georges Bank Scallops. It was pan seared to perfection sauted with shallots, tomatoes, mushrooms and collard greens in an olive oil - balmasic reduction. Delicious! Highly recommend it. Overall, great seafood place but tough on the wallet. As expected for the neighborhood."}
{"text":"I went there with my mom to have some wine and oysters. The riesling wine from Niagara was very good. The oysters were ok, I feel like they are kind of small but I guess that's what they are supposed to be like anyways. The service was a little bit slow but that's because they were very busy."}
{"text":"My husband and I came with our toddler on a Friday night. We were seated promptly and greeted by our server shortly after being seated. With our server's help, we ordered a mixed plate of raw oysters and an order or fried oysters. I really liked the fried oysters. It was lightly breaded and a good size. The sauce it came with was delicious. (Some sort of mayo) I ordered the garlic shrimp for my main and my husband had the scallops. It was fresh and good but the portion seemed a little small. For me, it didn't seem as balanced."}
{"text":"Oyster recommendation good.  Of the 4 types recommended, one was not too tasty and had a strong fishy smell.  We tried the dungeness crab (2.5 lb for ~$90).  Crab was overpriced and was not very fresh.  As for the shrimp cocktail 6 medium sized shrimp for $21 is a bit much.  Not very tasty as it was over cooked.  The best dish in the house was the pasta with scallop for $24.  Generous amount of super sweet scallops.  

Dining room ambience isn't bad.  Noise level is tolerable, however, we didn't care for the porn pictures in the washroom.  Not very appropriate especially if you have children."}
{"text":"We have been there before and had a wonderful time.

We head over there recently, after a bad dinner outing that needed something to make the night end on a positive note.

The setting can best describe as a shipyard meet local bar.
We had to wait 15 minutes before getting seated, even though the place was not busy.  Apparently, they were closing parts of the restaurants for the night, which was strange, considering there were at least 10 people waiting for seats.

The oyster were fresh as always, and they also had Periwrinkler available that night.
We ordered up a dozen of assorted oyster and a bowl of the Periwrinkler.

Everything came in due time and were delicious.
Service was inconsistent, as our waitress was getting her side of the bar closed. 
We felt we were a bother whenever we asked her any questions or needed anything.

This was in direct contrast to our last experience here, where we had an amazing waitress who took her time to find out what we like, and recommended oyster to match those preferences.   

If I was to review Rodney based on this experience alone, it will be a 3 star.
  
Since I have been there before and had an amazing waitress the last time I will be give Rodney a 4."}
{"text":"My one and only go-to place for fresh oysters! 

Love their food. 
Love their wines. 
Love their services. 
Love their interior design (including the ladies room)

So what are you still waiting for?"}
{"text":"Great food..great service...the waiter made a mistake on our order..so we got the free fundy scallops!! Hope he could make more mistakes lol...."}
{"text":"My husband and I have been here several times. Most of our visits have been unforgettable. The services had been amazing. We would learn about the oysters we're eating and the care and effort into the delivery of our meal from ocean to plate.

Kudos to the servers who has served us not only the food and drinks that were at our table, but also the knowledge and passion that comes from someone who truly loves the food they served.

We ordered just about everything on the menu. From oysters to other seafoods... But we were there primarily for the oysters. Oysters come with a wide array of add-ons, such as different kind of vinegars and hot sauces.  The clam chowder was to die for. 

Will go back as often as I could afford it.

It's pricey, but worth every dollar."}
{"text":"Good times had by all at this oyster shack. Best hot sauce selection I've seen in Toronto besides a tiny hole in the wall called Gayle's in Bridgetown, Barbados. Beers never tasted so good when oysters is it's date. Shuck and slurp away!!!"}
{"text":"Good friendly service.  Fresh seafood.  Very big bill.  

Tasted most of the main, lobster, crab, and oysters.  Its  exactly what you would expect in a seafood restaurant.  I wish more restaurant have the same cozy atmosphere and décor.  Its the perfect place for gathering without the loud music and busy ness...  

Only problem I have with this place, actually its more like my problem for being poor, is that the seafood is crazy pricey."}
{"text":"ordered a ceviche tricolor only to be told 20mins later that they didn't have any. bad attitude from the server, no sincerity in the apology. 0/10 in my opinion"}
{"text":"If you're looking for exceptional seafood, this is not the place.  If you're looking for mediocre oysters, you can't go wrong here.  Our waiter was great and he seemed to be very knowledgeable when it came to oysters which I find is a must if you are going to an oyster bar.   The food itself was decent.  It would pass as a meal.  I guess most people come here for the oysters which were wonderful except we had a few oysters with pieces of shell in them which is a no no when it comes to an oyster bar.  I guess they were training someone on how to shuck oysters on their first day of the job.  The atmosphere was kind of loud, which I don't mind.  Don't look to have a candle lit dinner at this place because you won't enjoy it.

Service: 4
Food: 3.5
Atmosphere: 3
Overall Experience: 3.5

The negative experience we had was definitely pieces of shell in the oysters.  Imagine slurping down an oyster and then all of a sudden you feel a sharp piece of the shell down your throat.  Not a good experience.  But I guess if you're not shucking the oysters yourself, anything can happen."}
{"text":"Love the Oyster selection. Came for my birthday and let loose. Expensive - yes, but the quality and selection is excellent. I came only for the oysters, so I can not speak for the cooked food selection."}
{"text":"The food is delicious, environment can be improved. I don't like the smell when I first walked in.  But I have no complaints for the food."}
{"text":"Great lobster club with a cold beer and for dessert a key lime pie. 
They sell Guinness on tap. Perfect!"}
{"text":"An overall all terrific experience.  The waiter was very knowledgeable, helpful and creative.   We weren't looking for a large meal, but a bunch of the best seafood dishes available.  We got exactly what we waned.  It was a great meal.  

Great fresh oysters.  The shrimp scampi was excellent.  The scallops were delicious.  

After the meal, he suggested we try some Stilton cheese.   Wasn't sure what to expect.   Then he brought some port wine.... Both on the house.  

Worth the tip!"}
{"text":"Best oysters place ever! It had the best and freshest oysters i had in Toronto. Love the variety of sauces! The scallop was excellent...they served the whole scallop, including the roe which is the best part! The spicy grilled octopus was not bad either. The patio is lovely during the summer."}
{"text":"I've been going to Rodney's for about a year and a half and their consistently amazing. The food and oysters are super fresh. If you're getting oysters I would let the staff pick the ones to give you - they know their stuff. I also have enjoyed their lobster and other specials; I have been delighted each time! Peter and David were taking care of us this last visit and we had such a good time (everyone at Rodney's is so friendly). I would recommend sitting at the bar if it's a small party (though you can't make a reservation for the bar) so you can chat with the guys and watch them shuck oysters. Hands down my favorite seafood place perhaps anywhere! Go. now.  (Unless it's a Sunday when they are closed)"}
{"text":"Rodney's keeps it simple and that's what I like most about their food. Fresh seafood doesn't need a lot of flash and their menu reflects it. Booze Alert - They only serve beer & wine so those looking for a stiff cocktail should saddle-up at Crush next door before heading down to Rodney's."}
{"text":"Outstanding place. Wonderful service by people passionate about oysters. The staff, the food, and the location compliment each other in a very balanced
way. Highly recommended.

Only negative was the temperature. It was so warm at times that it impacted the enjoyment of the meal. Otherwise I would have given 5 stars!"}
{"text":"First time at Rodney's and will never go back. Went for dinner with a group of 20 and our server provided the WORST service ever. She was not knowledgable, rude and told us that we couldn't order a lot because it would be too complicated for her. Oysters were served without sauces which we had to flag her down and ask for. Sauces were taken away before oysters were finished. Meals came out at different times which meant that half the table were finished their dinners before others have even received theirs. Couldn't flag her down to take drink orders and had to order with someone else. The list goes on and on.

Worst part of this experience was that an email was sent to the management team detailing the various complaints but was told that Rodney's Oyster House made an exception to accommodate such a large group. That the final numbers \"thew them off\" which went from 17 to 20... funny how 3 individuals could make such a difference.

So if you are looking to have dinner here with more that 8 people good luck with that. Once they get your 20% gratiuity they don't care about serving you. I would have given this 0/5 stars if I could."}
{"text":"Can't say enough good things about this place. Their Oysters are fantastic. Definitely the best in Toronto, and one of the best in the east coast. Their oysters are fresh and they do a great job of opening them cleanly. Their scallops are great as well. Staff knows their oysters and are very friendly. Awesome place."}
{"text":"I haven't been to Rodney's in over a year, but knew this was the place to go for your oyster fix since they have fresh oysters and seafood while offering friendly service in a relaxed atmosphere.  Our go-to place for fresh oysters.

I arrived shortly before 7pm without reservation tonight and was told the earliest table would open around 8:30pm for four people.  They only had half the restaurant open as they didn't expect a busy crowd for Wednesday. 

I was the first to arrive from my party and knew my friends were craving oysters,  so asked if there was any room at the bar as we didn't mind, but it was completely packed.

The hostess suggested perhaps we can go elsewhere for a drink and come back at 8:30pm, but I told her we were all hungry and craving oysters, so probably go elsewhere as we didn't want to wait. Momentarily, the hostess told me to have a seat  and she'll see if they can open the other half of the restaurant.   I only waited about 5 minutes before the hostess informed me they can accommodate us and open the other half and seated us at the hightop table by the hostess area.  Now that's customer service.  

The restaurant was a little short staff despite the unexpected busy night, but I think they handled service pretty well and were quite attentive without being intrusive.

The selection of oysters were mostly from the east coast which we love and a few from the west coast.  We decided to just stick to the east coast and had the server make the choice for us according to our preferences. We were quite satisfied with the oysters except for one (which I cannot remember) because it was too salty.  We only had half a dozen oysters each  because we wanted to have other seafood.

Unfortunately because of the weather out east they didn't have any clams or mussels (which we always order) on hand and not too much other fresh seafood.  We could have easily ordered more oysters,  but didn't feel like any more and decided to go elsewhere to have our mains.

Overall,  the service was great, but the selection of fresh seafood  limited and pricing was a bit too expensive for what we ordered.  24 oysters, a pint of beer and a bottle of wine came to $150 and we were still hungry.  It was definitely an expensive appetizer experience for us.

Normally Rodney's would be 5 stars rating for me, but It was a bit of a disappointing evening because in the past we always enjoyed our food and easily would have spent over $100 per person and be stuffed.

We'll probably go back in warmer weather when there's an abundance of fresh seafood.  Blame the Canadian weather for the lack of fresh seafood available."}
{"text":"Four of us had a delightful dinner at Rodney's on King St. West.  After dinner, Rodney himself visited our table, and we had our group picture taken behind the oyster bar (so yes, he's there).

We had our primary waitress, but another waiter also checked on us, refilled water, served food, etc.  Based on other postings, it would appear they've responded and stepped up service to a 4-star level.

Our waitress recommended, then promptly served beautiful oysters.  She helpfully suggested choices from among the many available sauces.  We also had chowders which were terrific.

We ordered lobster, dungeness crab, and fresh scallops.  Our waitress introduced us to the live lobster and crab before carrying them off to the kitchen!  They were prepared perfectly, having done some of the work to make eating easy.  All the necessary tools came along too.

We didn't sample any wine or beers because we had show tickets at Princess of Wales Theatre, which is a short 10 minute walk down King Street.

The only reason I'm not giving 5 stars is because there was time between finishing our soup and dinner service.  That may have been delays in the kitchen, or just the time it took to prepare fresh shellfish.  That said, both of our servers let us know they were checking on our food, so we didn't feel forgotten.

If going to the theatre in Toronto and in the mood for seafood, DEFINITELY put Rodney's on your list."}
{"text":"I attended Rodney's Oyster House on a Friday evening.  At 6PM, the place wasn't that busy, but it soon filled up.  The atmosphere is very casual, as the decor is supposed to make you feel like you're in a fishing house or something.  The staff is dressed very casually and without uniform, so make sure you don't mistake a patron for a waiter!  

The main selling point of ROH is, obviously, the oysters.  They have a wide variety of oysters which you can order by the piece, or put several of certain kinds to form a platter of sorts.  The servers are knowledgeable about the different kinds of oysters, and have recommendations depending on whether you're a beginner oyster eater or not.  The rest of the menu is seafood-centric - no steaks here!  

As someone who enjoys seafood, I was expecting big things.  Unfortunately, the entire experience was a bit disappointing.  To begin, the service was very mediocre.  While our waiter did a good job of talking about the oysters and accompany sauces, what he forgot was his primary duty: to wait tables.  He would disappear for stretches at a time.  One order of oysters was forgotten, left to sit at the pass until he was reminded that we were still waiting for these.  Half the ice had melted by the time our platter finally arrived.  It was two hours in before we had even ordered any main dishes.  Drink orders would arrive only partially filled.  He was the jovial sort who would pal around with the table when he did show up, but no amount of joking around is going to make me forget about my empty stomach!    

As for the food, the oysters were very good.  They tasted of the sea, and the variety means that you can try different ones and compare them to find your favourites.  The sauces went along nicely as well, depending on your tolerance to chili sauces.  I had some bits of shell in a couple of my oysters, though.  I don't know if this is a normal thing or a problem with the shucking, but it's a little less enjoyable to have bits of shell amongst your beautiful oyster.  

For an entree, I had a pasta with scallops which, like the service, was disappointing.  That thing that struck me was that there was no cohesion: here's some pasta with a tomato sauce, and here are some scallops piled on top.  Throwing two things together does not a dish make.  Execution wise, both the pasta and scallops were a touch overdone - the pasta a little past al dente, the scallops a little rubbery.  It could be that I chose poorly - looking around at the smoked salmon plates and the lobster club sandwiches that my companions ordered, they looked pretty good.  But you can only write about what you know, right?

Overall, especially given the price, I'd say it was a disappointing experience.  It could have been a bad night - certainly some of the other waiters looked more attentive, and as mentioned, some of the other food looked good.  But considering some of the other restaurants in the King West and Queen West areas, there are a lot of other places where you can consistently get a good meal with top notch service for a similar price.  Will their oysters be as good?  Maybe not, but almost everything else would probably be better."}
{"text":"I should preface this by saying I've only had oysters on a handful of occasions before coming here.  Not knowing my oysters, the waiter suggested we order a dozen of the staff's selection.  Simply put, they tasted fresh and were delicious.  

We also got a 2 1/2 lb dungeness crab.  I have had more experience with crab and I have to say this was probably the best crab I've ever had.  It tasted fresh and was seasoned/cooked just right.  We didn't even notice but our conversation stopped for a good 10-15 minutes while we were working on the crab because it was just so good.  

I didn't really get a chance to appreciate the atmosphere of the restaurant.  We didn't make a reservation so we just sat up at the bar.  In retrospect, I probably should have waited for a table.  The shuckers worked at the bar and it made for an extremely busy place because the orders for oysters kept coming in.  Also, I think the service may have been a bit slower at the bar.  

The final tab came out to more than we expected but, for once, it was worth the money."}
{"text":"For a number of reasons this is absolutely the place to go for fish and seafood in Toronto.  Rodney does not comprehend \"not fresh,\" so everything and anything you eat here came out of the sea very very very very very recently.  The only place on the east coast better for oysters is the Oyster Bar at Grand Central Station.  The Bay of Fundy scallops are a treat.  The lobster club is a special treat.  The curried shrimp is a treat.  Everything is a treat . . . including the absolutely proper service, decor, and--yes, wait for it---lack of a sound system.  You go to Rodney's if you want to think while you eat, or speak to someone who can hear you.  They know how to get soft butter for your fresh bread, how to have a box of kleenex in the washroom if you have a cold, how to grate fresh horseradish in front of your eyes for your oysters.  The table service is fine but can, just sometimes, be a trifle spotty.  For an experience beyond compare, sit at the bar.  (No one would expect the desserts to be terrific in a fish house, but the chocolate mousse is splendid.)"}
{"text":"I was really looking forward to a delicious seafood dinner. Rodney's looked like it had it all. We ended up spending way too much money on food that was simply not worth it. Customer service was strange, never had the same person serve us twice. 

Dining in a basement atmosphere, empty dark entrance greets you."}
{"text":"Very cool place. We came here later in the evening after another event (group of 5). We initially sat at the bar then moved to the table a bit later when 2 others joined our party.

The service was fantastic...friendly and knowledgeable. We got a couple of \"sampler\" platters of oysters where basically we asked the servers  to help us choose. They did a great job and even recommended what sauces would compliment which oysters better. It has been years since I've had oysters and it was nice to have them explain by staff that didn't make me feel like an idiot for not knowing the differences etc. They had a great wine and drink selection and pretty decent prices. The rest of my party had already been there and they raved about pretty much the whole menu

I loved the vibe of this place. From the  down-to-earth-easy-on-the-eyes staff  (male and female) to the interesting decor, this is a cool sport to check out when you are in the mood for tasty food, a couple of drinks and great conversation."}
{"text":"Incredible selection of Oysters, well served attentive staff. Narrow menu with an ok selection of wine by the glass. Service was quick!"}
{"text":"Rodney's is a fun hep yet classy place. It gets very busy and I couldn't get reservations for 2 on a Friday for all of Saturday evening. But we still dropped by n were told we can be given the bar high table  after 20mins waiting, which was fine for us. The table was big for 2 ppl but im so glad they didn't try to fit im another couple at the other end of the table like they do in Khao San!!  

We were greeted well by our server Mike n he brought us a mix of east cost, pacific n Massachusetts oysters mixed by chef's choice. The Salmon platter was v tasty, U-10 scallop was nicely done too. Service was friendly, music was loud but pub kinds which was good for saturday night. Overall nice experience though menu options r few."}
{"text":"Come for the raw oysters, not for the cooked food. Not even the baked oysters. 

While the service was good and the oysters were fresh, most of the cooked food was pretty mediocre. Tried the scallop pasta, baked oysters and clam chowder. For the price, I expected something a little more refined. 

4 stars for the oysters but 2 stars for the cooked food."}
{"text":"I love oysters and I love good customer service. So this place just scores so high with me.

Their Seawitch sauce is pretty good but is pretty much your average delicious seafood sauce. I did not enjoy their White Boy Soul sauce at all but otherwise, pretty good selection. Our server was patient, kind and just all around a lovely lady. She made some nice recommendations. They ran out of clams for the night but kept the bread coming. This was important because my sister was not a fan of oysters.

The decor was great! Just a good place all around; their wifi password is pretty funny too :)"}
{"text":"3 stars for the food, and not the service!

I had 3 types of fresh oysters. They r indeed veryy fresh.
Pan-fried oysters: better than raw IMO. I could actually taste what's inside the oyster.
Grilled rainbow trout fish: Delicious! Perfectly grilled fish on a bed of celery root mashed potatoes. Mmmm.
Key lime pie: decent, but I've had better.
Sea scallops: Tastes good, but not as fresh as store bought ones I had.

Unfortunately, the service was crappy. I would definitely choose a place with better service and same quality of food.

1. When we were modifying our booking, the host emphasized we only had 1.5 hrs to our table. I said sure, that's more than enough. She puts it literally that people would arrive on time and take over our table by 1.5 hrs. Okay, I get it! Then when we arrived, she told us to forget about the time limit. Okay?!

2. The waitress wasn't very knowledgeable of the oysters & the food menu. She wasn't very helpful at picking the meals. In the end she refused to give us separate bills (wtf?!). So it was kind of annoying, that we had to pull out our cell phones and calculate our own bills and tell her the amount to put on the machine. My friend lost one of her eye contacts so she had to squint and use only one eye to labour through the Math on her phone calculator. She was pissed. The waitress then told us our bills were just a $9 difference, but we calculated and it was a $15 difference. Maybe stop faking what you don't know?

We spent $103 for the two of us, and for this price range I expected at least pleasant customer service. Their service does not match up to their price."}
{"text":"If you come here and you are a party of 2 ppl you need to get seats at the bar.
The bar is where all the magic and shucking  happens.
If you know nothing about oysters like me, don't worry the friendly guys behind the bar will recommend  a selection of their best selling oysters without making you feel like a moron. 
My favourite oysters were the ones that tasted like cucumbers and the raspberry yummmm.
They offer a variety of sauces to accompany the oysters ranging from sweet to extremely spicy.
Their wines by the glass are a bit expensive. You may want to share a bottle instead.
I had my eye on the lobster club sandwich but was too full after trying all those oysters. 

The service was great here... The hostess was extremely accommodating ( we asked to move seats 3 times). The shuckers were helpful and funny. :)

I will definitely come back to try the lobo."}
{"text":"The choice of oysters are as good as some other oyster bar. The menu barely has any dishes on it;  they can't be considered as a restaurant. The wine selection is even worst, they only carry dry wine and is over priced too."}
{"text":"Good selection of oysters. Local draft beer. Knowledgeable and friendly staff."}
{"text":"After hitting up the Vancouver location, I was excited to learn that Rodney's was also in Toronto.  I must say that the Vancouver location is far superior than the Toronto location.  Had the oysters (a mix of 6), lobster club and soft shell crab special all of which were great.  I tried to purchase a risqué tee to bring home and the hostess had o idea that shirts were available for purchase and the wait staff was annoyed to help find one (and by find, I mean go through a mountain of disorganization) because she had tables.  At least the food is good..."}
{"text":"I am a huge fan of lobster and oysters. Hence, this place was heavenly for me. My friend and I took another friend for her birthday... We decided to splurge and we each got an appetizer with a dozen oysters and some dungeonous crab and lobsters . I had the clam chowder which was delicious. I absolutely recommend ordering it!! My friends had some sort of jambalaya appetizer which was good. The oysters were fresh and we really enjoyed their different sauces that are homemade.

The dungeonous crab and the lobsters were definitely highlights to our dinner. They were meaty and so fresh. We ordered too much food but it was so worth it. I ended up taking my family from out of town back to Rodney's a few weeks later.

The only complaint I would have is that the service is not that great. The servers are super friendly but both times I was there, it was very hard to flag down our server. We rarely saw our servers and a different person even brought out our food. Minus the service, I love the food and I love the atmosphere. It's as if you are dining on an old pirate ship!"}
{"text":"this is the only place that never disappoints our oyster cravings. the only other thing on the menu that we wish they had all year round is the soft shell crab. if you see it, GET IT! However, nothing else seemed too spectacular."}
{"text":"I have been to Rodney's a number of times and I am rating them against themselves in this review.  Have always been happy with their oysters (selection) and amazing condiments.  Have tried their lobster club (quite good) and clam chowder (good) as well as their scallop entrée.  Prices are in line with what you can expect in downtown Toronto and befit the very established Rodney's brand.  Majorly disappointed however in the two lobster dinners that were recently had there.  Had ordered lobster in the summer and  felt the size that appeared on my plate reflected what was actually ordered (about 1.5 pounds for me and close to 2 pounds for my dinner companion).  The fries were and still are quite good and were substituted by an amazing and plentiful side salad, then.  Was thinking that Rodney's was one of the best places in town to order Lobster for the money but this last time changed my mind.  I ordered a 2 pound lobster that while tender and very tasty seemed like a meagre 1 pounder at a cost of $50.00. My dinner companion felt the same way and the nice salad substitution was much smaller and less impressive this time.  We brought this to the attention of our server but nothing was done.  Still think this a good place to come for oysters but in terms of the other offerings, if you are looking for value, and a place that stands by its brand, you should probably look elsewhere."}
{"text":"Been wanting go here for years went with my best friend and wow wow wow amazing food & staff thank you see you again"}
{"text":"Consistently good oysters. Never been disappointed with their selection. The servers are a hit and miss - some are know-it-all annoying, but others are pretty cool and laid back. ...Wish though they had better bread."}
{"text":"crap service during lunch. almost empty restaurant but waiters are too cool to care about service. i used to go to the old rodney's when it was located on adelaide.  downhill from there.   oysters weren't the freshest either"}
{"text":"Amazing oysters and tons of selection. We had some good smoked salmon and mixed seafood chowder too. I'm definitely wild for oysters but this place has always had great service as well as good food.

We went back last week and found their secret patio too! Patio plus oysters is a winning combination.

Lastly don't forget to check out the bathrooms if you want some r rated entertainment."}
{"text":"The best seafood BY FAR in the city or anywhere.  They do one thing there (which is a bonus) seafood and seafood only.  Top quality oysters from around the world and Maritime lobsters along with the other crustaceans. If you're lucky enough to be there when Rodney himself is there, a fantastic time plus laughs is guaranteed.  Make sure you try the Frost chowder."}
{"text":"An old friend of the family's told me to go to Rodney's for oysters - they said they knew the owner and loved the place. I have to agree with them. Though I've never met the owner personally, I definitely recommend this restaurant/bar to anyone who enjoys fresh seafood. Even if you don't like oysters, that's fine. There are other items on the menu that you might like, and, at worse, you can still enjoy the great ambience and the bar. 

My recommendation would be to sit at the bar so that you get a front row seat of the oyster shuckers. The restaurant itself is also quite pleasant with wooden booths and it is nicely-laid out. The photographs around the restaurant are interesting to look at. 

I went this past Friday (in January) and Rodney's was not even half full. Apparently, January is the quietest month. For those who criticized the speed of the service, the oysters are freshly shucked as the order comes in and that takes a little while. I can imagine that if it was a packed Friday night in the summer, the service might be much slower. As it was though, the service was efficient and extremely friendly. 

I eat a lot of oysters. These are as fresh as they come. We also tried the Manhattan clam chowder (tomato-based soup) and the New England clam chowder. They were both delicious, but I think I would stick with the original New England version. We also had a half-order of steamed mussels and a half-order of steamed clams. These came in a delicate sauce, much like what you would get at a seaside restaurant in the Maritimes. No cream here! Just white wine, lemon and some onions. 

I think the best thing about Rodney's is that you can get a half-order of pretty much anything on the menu. This is great for someone like me who wants to try as much as possible but doesn't want to eat an enormous amount."}
{"text":"Tucked neatly just off of King Street is the hidden courtyard of Rodney's Oyster House.  I discovered that the excellent service was only surpassed by the great food.  An admittedly light menu is more than compensated by the freshness of everything served.  I started with the Oyster Slap Jack - a soup  so good that I offered to bus tables for free for a day in exchange for the recipe.  No dice.  There are dice though, I suspect, hanging from the rear view mirror of whoever is in charge of the music selection - think all those songs you'd love to forget from the sixties and eighties - weird.  

The oysters as expected were delicious.  I finished out the evening with the smokers platter made up of just the right amount of three types of delicious smoked salmon and accompaniments.  Don't miss this Toronto gem."}
{"text":"Great fish house. While I was not impressed where we were seated (right beside the main entrance at an insanely busy time), the deep fried branzino fish was excellent. Nothing else related to my visit to this restaurant stands out."}
{"text":"Absolutely incredible! It's hard to find a good, relaxing 5 star meal in this city. The atmosphere is unpretentious, cozy and the wait staff is knowledgable and friendly. Date night, family night, you name it. Oysters - T.D.F."}
{"text":"Went to Rodney's with the old man. Got there around 4:30. Service was very friendly and super attentive (at first). We started with a couple chowders. I had the Manhattan tomato base style and my father had the New England (hands down the far superior chowder) unfortunately, my Manhattan style chowder did have a burnt taste to it. The server handled it with extreme attention to customer service replacing it and on my request giving me the New England instead. Then we moved onto an oyster platter (dozen) tasted very fresh. Great selection (we let the server choose). Following that we had the seared scallops. Just amazing. The sauteed veggies were clearly the way to go with our meal course. The scallops were seared to perfection and tasted sweet and delicious. (Be warned they are on the smaller side, though for us that was not an issue) finally getting to the main we both went for the famous Lobster roll. What can I say? Probably the best in Toronto. Bacon adding a nice contrast to the sweet delicious lobster. The sides we got being skinny fries and onion rings. No complaints what you would expect there.

     All in all a great experience and surely I will be returning. (Only reason wasn't 5 star because our server switched out with another half way through the meal and the girl he said would be replacing his services was never to be seen at our table.... That said I've never yelped before but Rodney's was so good I wanted to leave feedback! Go go go!!! And enjoy!"}
{"text":"It's the oysters and service.  Quite a few oysters to choose from, staff great at helping you decide,  The atmosphere here is lively and fun, really like the crowd, its a real mix.
I also ate the lobster roll which was good not great, although the proportion of lobster is pleasing.
Oh and have a Caesar, love the stringy horseradish they add."}
{"text":"Still a great spot for fresh oysters and any other seafood you are craving.  Their lobster and crab are always cooked to perfection. The service seems to be going downhill. I've been back a few times in the past 2 years and the service is not consistent. Sometimes we get a nice server, sometimes we get snarky servers that make us feel like a bother just for placing an order or refuse to let us pull over an extra table when ours is too full of food and the place is empty. I will still return though cause the food really is that good. If all I wanted were oysters though, I'd head to Oyster Boy"}
{"text":"Went down hill. Went last night. I live in Toronto and have family in PEI I know seafood, plus I used to work in the restaurant industry and know what is supposed to happen at the front of the house and the back of the house (and neither is happening here anymore). Maybe Rodney is relying on his name only now and is forgetting about the rest. 

What happened as this place used to be good. 

Service was bad even though they were not busy on a Wed. My male waiter with an accent fits into what Rodney's visually but he can't wait tables to save his life (even though he wrote everything down on a pad). The Calamari never came and my soup never came. I asked for the soup after 10 min of waiting (and no waiter returning) and they brought it out. It was the last item on the bill telling me it was forgotten (Like the Calamari that didn't appear on the bill). 

If it was service only, I'd go back but it was more. 

Food - the items that we receive (as noted above some they just forgot about) were okay but not great. The $29.00 Lobster roll should be one of the best items on the menu but it does not stand up to anything I have had in PEI or Toronto. It's bland and greesy and the worst part is that it contains  a lot of under-cooked bacon instead of Lobster. It's not big and for the money you would think they'd serve w/Lobster but that's only what you see on the outside. They suspiciously sneak the bacon inside to make it seem like you get more lobster. Will not return and it's too bad as this place used to be okay but not now."}
{"text":"Even 1 STAR is way too much credit for this unprofessional so called establishment! The service was not there. We sat at the bar in front of the Oyster Chef/Shucker where we saw a dirty and slimy towel right in front of us. He throw the shells at the disposer where it was located very close to our face and it splashed slimes all over my husbands shirt.
We were shocked to see two staffs behind the oyster bar drinking a full glass of Bourbon and cheered with using foul language. All we heard was F--- words and loud laughters from the servers.
The menu is small with very little option on food. VERY expensive. 
Overall, we do not recommend this restaurant to anyone."}
{"text":"I came here December of 2014 for my birthday lunch with my boyfriend. We had recently been to San Francisco and were looking to get an oyster fix. After some great reviews on Yelp we decided this would be the oyster joint we'd hit up to get our seafood fix. We were definitely satisfied at the end of our meal.

Our main focus was to order raw oysters, and although we love eating them, we don't know too much about the regions they come and which ones are better. We let the server know what we were interested in and the lack of knowledge we had, and he was very helpful and ended up ordering a platter of 16 oysters from 4 different regions. All of them were great, fresh, and oyster shucking bar was in plain sight, so you could see the people shucking the oysters fresh. To fill us up on other stuff other than oysters we also ordered the lobster bisque. We really enjoyed that, it was on the special menu of the day so its not available on a daily basis.

I would definitely come back to Rodney's. I can't say it was as awesome as the seafood we had in San Fran, but it was definitely good considering the region we are in. The ambience of the restaurant was nice, the servers were laid back but still attentive. I loved the decore in the washrooms, it was vulgar, but humourous and made going to the bathroom an entertaining activity.

I would definitely go back."}
{"text":"The ambiance was great. But the food was a little on the disappointing side. If you're new to seafood you might like this place. As someone who has tried many seafoods and different seafood restaurants, this place was just not worth the price they charge. The drink options were great and the interior was nice. Just not so much for their seafood!"}
{"text":"Came here twice. The first time my husband had a lobster and I had Grace's special soup which had crab and vegetables and oysters. All incredible. Super fresh high quality food and fun service.  Really felt we got a good value. So I came back for a quick lunch a couple of days later. 

 I had a lobster roll that came with skinny fries - which was top notch but, before that, I had the Manhattan clam chowder: first and only fail. They seem to have thickened it with corn starch or flour - such a weird thing to do with Manhattan clam chowder. I usually get this instead of New England specifically when I want more of a vegetable soup with clams without the dairy and thickness... And I am sorry to say that while it was filled with lots of vegetables, potatoes and clams, the taste was way off with an odd sweetness, the clam pieces were tough/over cooked, it was too thick because of the aforementioned added starch, and it had a funny iodine/tin taste of bad clams. Sure hope this doesn't mean I'm in trouble later... I am actually writing this review hoping the staff will read this. This should be a five star review all the way...so, until they fix the Manhattan clam chowder, stay away from it and, fingers crossed, they fix it soon. It's too good a place for that one dish."}
{"text":"Grouper was fantastic. Beyond our expectations. I have been dining on King west for years and somehow have only hit this spot now. We started with a glass of wine and oysters. So many different varieties of oysters to try, and they put together a sampler for us. Then we had Grouper and Nice Fundy Scallops. 8 sea scallops on a bed of sautéed vegetables and spinach actually had great flavours but the Grouper overshadowed it all. It had great flavour a with the perfect balance of sweet and savory. We will eat here again. Great dining experience."}
{"text":"Came here on the weekend.  It has a very cool environment and makes you feel like you are on some sort of fishing ship.  Given that it was a beautiful sunny day, we opted for their patio which is nice and quaint (shaded as well). We ordered 3 types of oysters, pan fried oysters, oyster po-boys, fried clams and the New England clam chowder.  The oysters were fantastic. They were fresh and they provided a large selection of condiments for them. The pan fried oysters were good as well. They were lightly breaded in panko and was full of flavour. The clam chowder and the fried clams were decent. With the oyster po-boys, my group and myself were slightly disappointed. They were extremely small and there was quite a lot of fried batter over the oyster. The saving grace with this po boy was the bread they served it in. It was soft in the inside and crunchy on the outside."}
{"text":"What's the big deal? I love oysters, but don't have a lot of peeps who will eat them with me. I went here on an impromptu dinner that was deemed my birthday party. Perhaps it was the high expectations and wanting to celebrate. But, the food was so disappointing. I did not get oysters, because nobody else was getting them. 
Everyone's food came out cold-ish. Despite one of my friend sending hers back, I can't say anyone was excited at the end of the meal. 
Music selection needs some work."}
{"text":"Absolutely awesome.  I don't even like oysters that much, but I did try the fried pair as an appetizer and it was very good, very delicate with a delicious lemony sauce underneath.  I had the Nice Scallops and they were PERFECTLY cooked.  The mushroom spinach mix underneath was very good and the broth on the plate was perfect for the tasty bread they give each table.  Lovely atmosphere, perfect for date.  Sat at a table but the oyster bar looked fun."}
{"text":"Super fun place with great service and awesome oysters.  I liked the ambiance, casual and fun but great food and drinks.  We stayed a long time and the waiter never pressured us to hurry.  The oysters were right on the money.   I also had an awesome New Orleans bananas flambe for dessert, one of my favorites!  This would be a regular spot for me if I lived nearby."}
{"text":"Met up with a friend for bivalves and a beer, or 2. Sat at the bar, ordered a mix from the waiter/shucker. Each of us ordered a different half dozen to begin. Took a 20 minute lesson from Rodney (not the Rodney) whilst he shucked 6 or 7 dozen. He was patient and informative. All servers seemed excited by my stating I would try a dozen to shuck myself, and encouraged me to do so. Love this place, oysters around 3$ each. Limited but decent beer selection. Staff is exceptional."}
{"text":"I love seafood, especially oysters, and when a group of us decided we wanted something a little different, we found Rodney's Oyster House. 

The minute we walked in on a Friday night, we knew we had found our local hangout. Known as an honest to goodness oyster saloon, the place was jumping. We sat at the bar and ordered a couple dozen oysters. Of course we ordered drinks, and I started out with an RBB Cesar 8 Martini, which is a concoction of Vodka, Clamato, horseradish and spices. I know that I am going to be copying the recipe the next time I am nursing a hangover. The rest of the group ordered dirty martinis with lots of olives. The oysters were delicious and really fresh, and since there were 6 of us, we decided to order another dozen. I love having fresh oysters with lemon juice and chilli sauce. Man, my mouth is watering just thinking about it. 

For appetizers, I had a bowl of New England clam chowder that was thick and rich. I've had good chowder before, but this was ridiculous. There were big chunks of clam and potato that made an excellent dipping sauce for our fresh bread. The others in our group went for crab cakes; delish, fried calamari; OMG, and Tuna Tartare, which literally melts in your mouth.

We were really full, but had to try a main course. We ordered a bottle of Reisling, and a Shiraz to go with. I know you are supposed to drink white wine with seafood, but I'm all about breaking the rules. I had the black sea bass; yummy, and the rest of the group feasted on grilled shrimp, lamb, yeah I know in a seafood restaurant, and thai curry mussels. We all got to taste each other's meals, and honestly, none of us were disappointed.

We skipped desert in favour of oyster shooters, and when I say shooters I mean plural, we had two each! Luckily we got a cab home. We are going back next week to try other items on the menu. 

The customer service definitely held this place back from getting a 5 star. Sometimes you are 'serviced', and sometimes you are not. We were certainly not but I won't let that deter me from having amazing oysters."}
{"text":"It's unfortunate that this place is dealing with old reviews claiming that the service isn't great. Granted they are a busy restaurant, and you won't have a waiter or waitress at your table every five minutes to see if everything is going alright, but who likes that anyway? They check up on you enough, and most of the servers have a tremendous amount of personality. 

It had been years since I'd had oysters. I went with my father for his birthday, and the idea of oysters kind of grossed him out, but he was really into having a fresh lobster. When I told our server about my father's aversion to oysters, she was shocked! She insisted he at least try one, and suggested a nice, small, light, starter oyster to see how he liked it. The fresh horseradish and lemon was enough to get him to take a deep breath and give it a try, and wouldn't you know? 

Hey Mikey!* He liked it! 

The server cheered and clapped her hands excitedly when he seemed pleased, and suggested another couple for us to try. They did not attempt to oversell us with expensive oysters (they can get up to $5.00 a piece). For the 10 oysters we got, we spent less than $20.00

After the oysters, we shared some muscles that were done in a beautiful white wine sauce (and let me tell you, they did not skimp on the white wine). Then on to the main course. 

My father had a 1.75lbs lobster, and just to show us the scale of the lobsters they had, our server pulled out a 6 POUND Behemoth! (there's a picture included on the yelp page if you're interested). It's largest claw was the size of my hand! Their price was $23.00 a pound, which is less than you'll buy lobster for at a grocery store. I had pasta with MASSIVE bay scallops, of which there were 8 on my plate for only $21.00!

The staff was knowledgable, and very courteous. They asked us if we wanted more drinks, checked up on us a couple times, answered any questions we had, and were generally very nice people. 


Dinner came to under $200 (including tip), but look at what we had!

- 10 oysters (5 each)
- 1 pound of muscles 
- 1.75 pound lobster
- 8 Bay Scallops in red sauce on linguine. 
- 5 pints of beer

I don't splurge like this often, but it was a GREAT dinner, and I'm just looking for an excuse to go back ASAP. Try this joint out!

You will NOT be disappointed. 

*Incidentally, my father's name is Mike, and for a first time with oysters, he enjoyed them greatly!"}
{"text":"After reading on BlogTO that this was one of the best spots to have a lobster roll in Toronto, I decided to try (#1 on the list was not open for lunch). What a waste of time. The roll was ridiculously small and was served with awful fries. I guess they do such a small roll because they charge only $10 dollars for it, but it was not worth it. Not going back. I have not tried the oysters, but the ambiance is not nice, restaurant is in the basement, no windows, tacky decor..."}
{"text":"Dined in Friday night on the patio, and it was marvelous.

The server recommended to make us a platter of a variety of oysters, which was great though my favourite were the Raspberry oysters, which were to die for.  Buttery, well shucked, and just pure heaven.

Also ordered the mussels, which weren't the absolute best I've had, but were a hearty addition to the main attraction :)"}
{"text":"Bomb oysters. I ate at 4 places out of a 5 days trip in toronto. This place is by far the best oyster in town. I'll never eat oysters anywhere else if I lived in Toronto."}
{"text":"I really enjoyed sitting at the bar and seeing the oysters being shucked fresh right in front of me! I ordered 6 oysters - chef's selection. They were incredible.

Finished off the experience with the rice pudding which was good but not great. Would get it if you're a rice pudding fanatic :)

Very attentive and sweet waiters."}
{"text":"I don't normally give twos but I have to share my experience last time I was here. 

In terms of the food and oysters, I would give this more of a 3.5 to 4 out of 5. But the service (and I'm not normally one to complain about service) was a joke.

The brunette scatter brained woman who was working our table at the far end of the restaurant was either stoned, distracted or completely out of it.

The real fault here was when we were talking about if we could get less than the suggested dozen oysters she recommended, she literally walked away from our table mid conversation and didn't return. My girlfriend and I just looked at each other like \"Did that really happen?\" and we go to tons of restaurants on King west (Gusto 101, Jacobs, Marben, Spice Route) and none have been this bad.

Not only that, I had to get up to find her on two locations and the food was average to above average tops. If that brunette still works there, I would be shocked .. but because of that, I'll never be going back. Plenty of options for seafood, shellfish or oyster nights anyways."}
{"text":"Stopped in at Rodney's today for a medley of oysters, Malpeques, Lameque Verts, Mystics, and  Beach Angels, all were quite nice. They could do with a greater variety of sauces, most were all tomato based in varying degrees of heat. How about a nice spicy mango chutney.  Also had a bar clam roll and salad. The roll was a bit of a let down with the clams being made from frozen, dry and overlooked. Had the waiter bring additional tarter sauce to liven it up a bit. Atmosphere was warm and classy. Will probably stop by again to sample more of the menu."}
{"text":"key notes about rodney's:
- they have great oysters and stars for shuckers. a lot of east coast oysters on deck right now - definitely recommend the raspberry points, and the mystics. their man man behind the bar doing all the shucking (missed his name), told us that his record for one night was shucking 2,000 oysters. no joke. 
- they currently have a couple of specials going on - and the spicy dungeness (sp?) crab soup is fantastic. as is their hot smoked salmon. hmmmm....
- a totally unpretentious place and extremely down to earth.
- a little pricey for a tuesday evening, but worth the splurge if you can do it up.
- last night was my first time, but won't be the last... 
- and one random note about the men's room. there happened to be a lot of really \"artsy\" black and white photos of women's private parts. was a serious surprise when i went for a wee when i looked up at the art work...."}
{"text":"I've eaten at Rodney's a few times, and am quite a fan. In terms of oysters I usually just ask the people at the counter what is good that day, and I have never been lead astray. They know what is best/freshest. I always order teh manhattan clam chowder as well. As someone who is lactose intolerant it's great to have a non-dairy soup option. I recommend sitting at the oyster bar. I almost always do, and I have always received great service. Once I was even sitting next to the owner! Plus I enjoy watching the shuckers work."}
{"text":"The collard green soup special with crab and shrimp was very good - lots of crab.  We also ordered the spicy octopus special - which has to be one of the best preparations of fresh octopus I've had. It was a delightful blend of spicy octopus, asparagus, tomatoes, brocollini, and olives.  Very fresh and well prepared.

We ordered one dozen lameque and one dozen shigoku oysters, which were fresh and masterfully shucked. Our favorite was the lameque this time, upon recommendation of our waiter. They were a decent size and creamy - with a slight sweet algae finish, which was wonderful. When one of the waiters brought our oysters, we appreciated the time he took to speak to us about the oysters. We usually lean towards west coast oysters, so we were pleasantly surprised by these lameques and will definitely ask for recommendations next time.

Meanwhile, there's a selection of 5 sauces plus your usual Tabasco, vinegar and worcestershire sauces for the oysters.  I did enjoy the scotch bonnet sauce since I'm a huge hothead, but I think I was hoping for a sweeter house-made shallot vinegar sauce as well to balance it out.  (It likely did not help that the sauces sitting out in the large jars became runny with frequent use as well.)

Overall, I highly recommend this restaurant. Please be warned that for two people without alcohol, our meal went over $150 (incl. tip)."}
{"text":"Unbelievably fresh. Their oysters are on point! The service is great, their selection of wines is good and the servers always do a great wine recommendation. Their pan fried oysters are incredible. JUST FREAK'EN INCREDIBLE. This restaurant is my benchmark for how oysters should taste. Their oyster fixings are AMAZING too. 

We ordered 1 bottle of Oyster Bay white wine, several orders of pan fried oysters and a couple dozen+ fresh oysters and our bill for 2, great tip in was about $160. We left stuffed, and satisfied. This is cheap based on everything we got and Toronto in general. At about $80 each, for food and and wine this is my go to place. 

AMAZING!!! If you are trying to impress a seafood lover, come here. Will be back!!!"}
{"text":"I recommend raw oysters plate. The variety is great. My friends and I did order other dishes like the mussels, pasta, etc. But nothing really struck me as much as the oysters. Our waitress was alright...she seemed a little flustered in the beginning. Perhaps there was a lot of people to handle? I do agree that there were bigger groups there and only she seemed to be watching the area - so I think that's understandable. We went for my friends birthday and she was very good about bringing our cake out and was pretty attentive to our needs during that time.

The decor of the place is very unique - feels like I walked onto a ship at times. The washroom is especially unique - you should probably stroll there."}
{"text":"One of the best I have had in the world, second only to the Oyster Bar, Grand Central Station in New York City.  The staff was very helpful with making my choices.

Atmosphere is awesome, I would definitely go back.

http://www.oysterbarny.com/"}
{"text":"I am throughly impressed with Rodney's oysters house, and I don't say that often! Being from Nova Scotia, I was feeling a little homesick and on the hunt for fresh oysters and seafood for that matter. My friend immediately suggested Rodney's and the reservation was made. 

Their selection of oysters at first worried me because they have such a huge selection, I was concerned about the freshness. But after trying 4 different kinds, from 4 different regions, they all were completely fresh, decadent and absolutely delicious and arrived promptly. Our server, was extremely knowledgeable about each and kindly suggested their house white wine as a pairing, which worked well with each of the different tastes of the oysters. Also, their selection of condiments and mignonettes was impressive, and our server advised which would be best with the different oysters. Their condiments consisted of the typical toppings for oysters but they had a selection of house made condiments, that ranged from spicy, savory and sweet and were so great I seriously thought about purchasing a few of them. On top of the oysters, we ordered the fried smelts which I never had before and was a little skeptical. But they were cooked to perfection and accompanied by a tarter sauce, which was equally delicious. Also, we chose the their daily tartare which was salmon, which was equally as fresh and divine as their oysters. 

The decor is very fisherman chic, which seems to be appropriate considering their menu items. There's more of a laid back vibe here which makes me feel like I'm back at home. I would HIGHLY recommend this place if you are a seafood lover, or looking to match the freshness west of the east coast. I can't wait to go back! After reading this review you can tell key words are, delicious and fresh, everything good seafood should be described as."}
{"text":"I'm from the maritimes so I'm very picky about my seafood. This place is good - I think it's a good place to go for a drink and some oysters but I wasn't a fan of the tiny menu. I would go back for an appetizer and move on for dinner. Good selection of oysters, the staff were knowledgeable. I wish I loved it, but just didn't. Customer service was really good."}
{"text":"Service : 
Food : 
Drink : 
Price : 

First of all, let me tell you that it started with the first impression at the entrance.  The hostess was nice.  However, our server and others waiters & waitresses didn't take care of us well.  The service sucks!  Why?  It might be bcoz we're Asian (plus only one white guy). Is that right?  
- At least 3 time the blond hair waitress took something from our table without saying anything.  She took our plate, our chair and other stuff on the table.  Just took them, didn't say any words!  When our friends showed up, they didn't have their seats bcoz she took them away.  We waited for few minutes to ask for other seats but no one shower up.  We had to grab the seats from the next table by ourselves.  Actually, it was ok to do that by ourselves but we just wanted to let you know and asked you for more set of cutlery.  Ended up, we had to grab the plates from next table too.  It wasn't nice for an expensive restaurant.  Your service was like a cheap one.
- our server seemed to have bad mood.  He didn't want to take orders, recommend or explain anything.  He didn't bring us any sauces with the oysters or recommend them or any drinks that go well with them.  It was the first time for some of us so we needed our server to give us as much as details he could.  It was disappointed!
- we asked the same waitress to take pictures of us when they were closing.  I knew that she wanted to go home but it was only one time we asked you for a favour!  Her face shower that she didn't want to.  I'm  sorry.  20% sharing tip as you told us.  If u got some, why you couldn't pretend that you were willing to serve us.
- the problem was worse after midnight.  The kitchen was closed so our server were gone too.  It was funny.  We saw he was around but we couldn't call him.  It looked like he ignored us.  Or it was bCoz sharing tip?
- another waiter took our sauces when we were still having oysters and other food.  We mentioned to him that we still have food coming soon as well.  He said it was ok and took it! Oh surprised! What did he mean 'it's ok'?  For us, it was not ok!

***Only one staff (in the kitchen) he served us the 2nd plate of oysters, he was very nice  He brought us back the set of sauces, explained about oysters, sauces and brought us the extra bucket for putting oyster shells.  We wanted to tip him separated but the waitress said we couldn't do that.  Though we did, he had to put the tip on the house for sharing (she looked mad when we asked about it) Fine! We didn't do that.  But you guys didn't treat us as we expected!  From the beginning till the end, it was bad, disappointed!!
*** Was it normal service here? Anyone can give me more information? Shame on you Rodney!"}
{"text":"I went to a party that had complimentary oysters, had a few and wanted more but it was all gone. So my girlfriend and I went to Rodney's, her favourite oyster place. And now it's mine favourite!

We had the house oyster from Rodney's Oyster farm and the large Gilden ones which I like a lot better. And we had a scallop pasta.

Price came to $90 for a midnight snack but well worth it. Yummy."}
{"text":"I'm not sure what the fuss is about. I've had better seafood elsewhere. 

I've been here a few times because of someone else's love of oysters, but I am generally not impressed. 

Here is my take on a few of the items that my group tried: 

New England clam chowder -- way too salty
Smoker's Platter -- tasty, and I recommend it
Garlic Shrimp -- you can find a better and cheaper version in Chinatown
Lobster Club -- too heavy on the bread and greasy

Will I be back? Not if I can help it."}
{"text":"I was here last week, on a beautiful Tuesday evening with no reservation.  My party and I waited about 30 minutes to sit on the patio. Unfortunately, Rodney's doesn't serve liquor, or we would have waited by the bar.

I think the reason for my 4 stars is that there is only beer and wine at Rodney's and I like to have a Ceasar with my oysters!  My server did, however, recommend an amazing white wine. 

Oysters were plentiful and fresh and delicious. We had three kinds, and I wish I could remember what they were... 
Servers were knowledgeable, friendly and prompt. 
Lobster was delicious. 
Shrimp cocktail was huge and fresh. 
I had a bite of my friend's chocolate mousse and it was rich and yummy.

The patio was secluded, but we could hear the banter of what sounded like homeless people from beyond the thick shrubs. However, this made for an entertaining meal. I love Rodney's and will be back again and again."}
{"text":"Here on business and stumbled upon this place on yelp. The scallop ceviche and oysters were amazing! They sell the oysters individually so you can try a variety. We had great service and really enjoyed the atmosphere!"}
{"text":"Rodney's is alright. The only thing I thought was good on their menu was the lobster roll. It has a nice fresh and creamy taste like nowhere else I've tried before. Although the rest of the menu is A for effort but the flavours just aren't there. As far as the oysters go, it's an interesting selection but it doesn't take much for a restauraunt to order a variety of oysters. They should work on the menu and flavours in their other dishes. The pasta was very disappointing and flavourless."}
{"text":"We came from Los Angeles  for the Grey cup because we like to travel and it was refreshingly not the NFL or USA.  We had great oysters but later the too cool for us hipster bartenders were overheard blatantly laughing at my friend  because he was a sports fan.  I try to understand differences and snap judgements but I cant make an excuse for this blatant bold disregard.  I get everyone should fly their individual flag, but being mean bc you don't like the same things is just being a bully.   It was a vibe drainer, we were having so much fun till then.  My friend asked me 2x as we walked out if that really just happened, of course I had to be honest. It was our first time to Toronto so it sucks but what the f*^# ever. There must be many spots  that appreciate patronage. Tomorrow is another day in Toronto.  We got this!

Update we had delicious ramen at Momofuko for lunch and a ridiculously great meal at Buco for dinner.  It had amazing charcuterie and cheeses.  Nice vibe but even better food.  

Skip \"hot-Rods\" there's a lot better spots in Toronto sans the dbs."}
{"text":"I came here for my birthday last night. I've been craving oysters for weeks so I begged my s/o to bring me here. I'm not sure if I overhyped, because I've heard so many good things about Rodney's, but being an oyster fanatic, I was sure disappointed. 

They had their \"Winemaker's\" event last night so it was a bit packed and loud. As soon as we sat down, we were given complimentary bread and butter. The bread was cold... We then ordered an oyster sampler - cost over $40 for a dozen. I assume the server chose the expensive ones. Of the 12, only one selection was actually good. The rest were either mediocre or bad. We also ordered clam chowders - which lacked salt and flavor in general. I actually felt like canned clam chowder tasted better (no joke). For a seafood bar, that was disappointing. It was $10 a cup - which is RIDICULOUSLY expensive. The menu selection, I think, was not that wide of a range. It was also very vague. Most of the dishes weren't paired with anything... Just an order of one item, which I was not accustom to. We ordered a serving of steamed mussels ($14 for about a pound) - which was one of the better items we got. We also ordered a small scallop and pasta (which was probably the only paired dish on the menu). Pasta was also good - sauce was on point. I think it was $16. For two people, our bill came up to $100 plus tip. Oh yeah, and we weren't full.

I actually thought Rodney's was a bit more on the \"high end\" ambiance... But I should've known better... It's an oyster bar. It was more on the casual side. 

Service was horrid. Our server lacked customer service skills, whispered, and failed to answer our questions about the menu items. \"Can you tell me about the NB Smelts?\" \"They're New Brunswick Smelts.\" *facepalm* She wasn't the friendliest either. The hostesses also weren't very friendly. Didn't smile or respond when I said thank you and goodbye to them. 

Definitely was not a good idea coming here to celebrate my birthday. I felt extremely bad forcing my s/o to come here and dish out so much money for less than mediocre food and horrible service. I probably wouldn't come back here either because nothing \"wow'ed\" me. There are definitely better oyster bars out there that isn't a highly rated restaurant. Two stars because the pasta and mussels were good."}
{"text":"If you love oysters, definitely come here.

Arriving at 7 pm, I was once again struck at how empty this supposedly popular place was.  By 8:30, the place was filled, once again confirming that Toronto people eat late.

I really loved the friendly and laid back vibe, but especially loved the selection.  Our oyster platter consisted of 6-7 variations of East Coast variety that I rarely try being from the West Coast.  A large selection of sauces (from mild to spicy hot) was also available.

Add plenty of beers on tap, clam or oyster chowder, and steamed clams and you've got a winning recipe.  Prices are reasonable given the seafood and service is quick and prompt.  

Rodney's accepts credit cards including American Express."}
{"text":"I have always been a fan. 
However I do not come here often. Since normally I tend to go purchase my own oysters to crack them at home or at parties. For some reason, I still find people who think that opening an oyster yourself is next to dangerous... or perhaps magical. Take your pick. I like many think it is neither.  

However, you will enjoy the decor, it is low-key with a ton of wood accents which makes the place a bit homey, although it is far from it and it is comfortable. 

Prices are alright but can sure climb if you keep buying oysters and wine. Specially if you buy them by the dozen, since then you risk both getting sick on oysters at best or end up with Cirrhosis of the liver at worst.   

Great for a dinner date, as the place is nicely lit and being outside is just fun. There is something about having seafood in a patio I have always enjoyed since in many nearby sea restaurants around the world this is something they do often and due to it, I get whiff of those memories when I eat here. 

Great for groups as well. 

A Toronto favourite."}
{"text":"This has got to be one of my all time favorite places... ever! This was my second trip to Rodney's and it was better than the first (and I didn't think it could get better). What I love about this place is not only is it the best place to get a large variety of fresh, delicious, oysters, but the staff here is incredible. Form their beautiful hostess seating you, to the great guys shucking and serving behind the bar, the staff is super friendly and knowledgable.
A really cool thing about Rodney's is what I call it's \"high end\" casual atmosphere. Not pretentious at all, so weather you wearing a suit, want to have an adventurous date w someone special, to coming in off the street in jeans and a T, you'll feel comfortable. And, if you're a seafood lover, guaranteed to find something on the menu you'll enjoy."}
{"text":"Food: always good 
Service : went back after a while today and service was definitely lacking. Asked our server to describe the special and she reached over the table grabbed a menu and read it back to us. 

Got an assorted oyster platter to start and when we asked her what order she recommended we got a half hearted suggestion ( which really didn't do the platter justice )"}
{"text":"Good vibes with a quaint back patio. Perfect for post-work happy hour/snacks. Also good for a casual dinner with friends. And of course, Awesome OYSTERS (duh!)"}
{"text":"Excellent service and a delicious meal. Rodney's is a fairly casual setting with friendly staff and a lively bar area. We were seated at a high-top table near the bar (as we did not have reservations) only minutes after arriving. They were extremely friendly and as we had never been, they gave us a full run down of the menu and gave recommendations. 

I had two oyster noobs with me and our server made several suggestions on how they should dress their oysters and what they should order. We were given a complimentary sake shot as a fun experiment as we tasted a number of different varieties. 

I would highly recommend and will definitely be back!"}
{"text":"I will admit that I used to have a huge fear of seafood. My mom had awful food poisoning once from shellfish, and as a child, I was horrified that this little sea creature could cause so much damage! So, for the longest time I avoided any kind of seafood. I had a strict NO seafood policy, but, as you get older, your tastes and policies change, and I am VERY happy to now say that I am a seafood fanatic!  (see my various sushi postings).

  So, when I heard of Rodney's Oyster House, I had to try it! Located on King Street, Rodney's has a wonderful and fun atmosphere that any seafood lover will enjoy.

 Known for their oyster menu, Rodney's has everything surf n' turf including lobsters, chowders, mussels, shrimp, and daily specials that are fresh. Upon entering Rodney's, you'll notice the many gigantic tanks filled with the delicious catches that you can pick yourself before you eat!

  Their oysters are nothing to sniff at. You will find, daily, a selection of 9-26 different varieties from both the Canadian east and west coasts, as well as American and selections from abroad. If you are an oyster connoisseur, your taste buds will not be bored!
 
 A few things to keep in mind:

 -The place is usually quite busy, so make a reservation to save time.
 -the spread doesn't come cheap. Rodney's is relatively pricey, but well worth it.
-bring a group of friends and take turns trying different kinds-it's more fun that way!
-the seafood is treated well and Rodney's is part of a number or Canadian organizations that ensure proper handling for safe environmental impacts.

   Lastly, Rodney's makes you fee like you're on the PEI coast, so go in and enjoy a truly fun and different kind of atmosphere to any Toronto restaurant!"}
{"text":"Nobody does it better than Rodney.  This has been one of my go to spots for dates, business, pre-show drinks, etc.  Great selection of oysters, which you know will be fresh and delicious.  A good mix of chowders, sandwiches and other items that fit the mood.  Lots of cool beverages to quench that thirst.  And the price tag is so low!  Only complaint is some staff who think they're more important than the customers.  I'd drop this to 4 stars, but will overlook because of Rodney.  Hopefully staffing improves."}
{"text":"if you crave oysters .. the freshest you will find .. I and my friend shot down 3 doz of an assorted mix, and if we were not short on time, we could have easily gone for another 3. Next time, it will be oysters plus the seafood galore they have to offer."}
{"text":"This is a temple of oysters and I've sampled many bivalves worldwide. Not only are there endless varieties from both East Coast and West Coast, but the knowledge of the servers is too. They're almost like oyster sommeliers-- describing down to the most minute details about taste and texture. Blew us away. One variety from British Columbia was plump and white, almost like rare abalone. This place is on point and I would return over and over again!"}
{"text":"My all time favourite place to get fresh oysters!  I was introduced to Rodney's for the first time at my friend's birthday party and I will never forget my first experience here.  The ambiance of the restaurant is very fun and fitting.  I would definitely recommend making reservations because it does get busy here, especially on weekends.  The server we had was Kelly.  He was phenomenal, enthusiastic and definitely passionate about his job.  He described all the fresh oysters they had at the time and was thorough in explaining the texture and taste of all them.  Some of my favourites were the Kusshi, Kumamoto, and Mayflower. They also have a variety of different sauces that you can try with your oysters, ranging from a mild to spicy flavour.  Not my cup of tea as I like my oysters the Plain Jane way, a squeeze of lemon and some Tabasco sauce.  Everytime I come here, I cannot pass up their Manhatten Chowder.. It's just so delicious and creamy!  And it comes with a side of crackers.. not just ordinary crackers though, Oyster Crackers! I've also tried their Pasta with Scallops and Pan-Fried Oysters, the numerous times I've visited, which I highly recommend.  The second and third time I came to visit, the service wasn't as good but I mainly come for the oysters and nothing else.  Service is just an added plus to every restaurant experience.  I recommend everyone to start saving up your hard earned cash and come try Rodney's, I promise if you like oysters you will not be disappointed!"}
{"text":"Had the Lobster Club sandwich ($25) but the flavour and texture of the lobster was lost in the mayo sauce it was in. Wasn't very \"seafoody\". Had some oysters which were alright, but lacked in any kind of explosive taste.

We saw waiters carrying around huge live crab, which was neat to see. You might want to spend more ($30+) to get some better tasting meals here. 

Try it out if you're in the area."}
{"text":"I LOVE COMING HERE! Their Manhattan chowder is amazing, and their oyster selection is fantastic. I love the little sauces (seawitch has got to be the best one) too. Be social and sit at the bar--it's plenty lively.

Be prepared to spend."}
{"text":"This is the place where seafood dreams are made and realized! Have been going here for years upon years and still adore everything about it.

From the oyster pools and other cool decore to the amazing FOOD!!

ALSO do NOT miss the annual oyster shucking competition/festival in the summer time."}
{"text":"Fantastic array of fresh oysters, best I've experienced in Toronto by far.  Other food not necessary. In fact I regret ordering the crawfish as it just wasted stomach space that could've been put to better use.

Once ordered live oysters for pick up to shuck at home for a dinner party.  Delicious.

Wish our waitress was more knowledgeable about the different types of oysters, flavours with good recommendations - but that's just me knit picking."}
{"text":"This is my 10th time to this restaurant.  Lots of oysters selection.  If it wasn't for the poor service and cooked food, I wouldve gave it a 4 star for oysters selection and quality.  Cause the scallop pasta that I had was so rubbery.  The halibut that my friend order was drier than my face  :(. The waitress that I had on Friday night wasn't the friendliest either (I guess she's new)."}
{"text":"Amazing service. Amazing food. Amazing amazing amazing.

Went to celebrate a girlfriends birthday at Rodney's Oyster House in the middle of the week. Made a reservation before hand but when we arrived at about 5:30 pm on a Thursday night it was quite empty. However, if you plan to eat a later it is best to make reservations because when we left around the restaurant was packed!

The server we had was fun and enjoyable. We knew we wanted oysters but wanted to try a variety. We told him we wanted a dozen and certain types we like and he made us a platter of different oysters to try. Definitely the way to go especially if you don't know which kind you like/want! Our favourite was the malpaque. Super huge and the oyster meat was soo sweet. It was delicious. Oysters also come with a tray of different sauces and the server was great with letting us know what was what. I always start out with the mild sauce and work my way up to the spicy one. I loved all the sauce and it was fun taste testing them all!

We also decided to do a couple of different apps. Had the ceviche and the smoked fish platter. Ceviche was super refreshing but the portion size is a little on the smaller side. The fish they used was super fresh and adding the mango in gave it a really nice kick.

The smoked fish platter had a great variety and even included accompaniments for each fish! Quite enjoyed the smoked trout and the candied salmon (i think it was salmon..) that one was like a sweet dessert!

Since it was my friend's birthday they even gave us a chocolate moouse on the house and that was delicious! I definitely will be back to try the other oysters here. 

Great atmosphere and if you were to go a little earlier.. it can even be quite family friendly (given the area it is located)."}
{"text":"Well it was almost 100F, so what better thing to do then to walk 45 minutes Rodney's Oyster House!  Gotta love being a visitor...lol

So we start walking here and I'm thinking...damn this place is far...I thought they said it was like 10 min (we went to the wrong location...thank you Google Maps for only showing the further location).

Anyway, we finally get there and it seems to be a fairly popular place with simple,  no-nonsense decor...I was told it was a boat...hmmm.  My colleague and I were very lucky in that there were just 2 of us, so we didn't have to wait, although the hostess was surprised we didn't have a reservation (I suggest you make one, especially with a larger group).

We get seated and get the menu.  Now...let me just say I love crab and I had seen crab cakes on the website and I was so ready to order them...not on the menu!  I tell the waitress, and she said..sorry, we only have those as a special...sucked!!

But what did she do to cheer me up?  She brought out a plate of smoked salmon with horseradish dipping sauce...AWESOME...and so sweet.  

My colleague ordered a beer and ordered the ice tea..it was FANTASTIC - ginger, honey, and some other secret spices mama (the 85 year old woman that still works in the kitchen!) adds to the batch.

For food....we were both far from disappointed!

1 cup of creamy New England Clam Chowder...a huge hit (he was licking the bowl).
1 plate of fried oysters...we were not aware that they are giant oysters, and were concerned about what steroids those clams were on...Either way...DELISH fried goodness.
1 plate of 1/2 Jerk Shrimp and 1/2 Pasta with Scallops...perfectly cooked, tender and so well paired.

Great stuff...we enjoyed ourselves, the food and the service..GO HERE!!!"}
{"text":"Great place for seafood BAD PLACE IF  you got a GROUP of 10 or more . we went for my friends birthday and we ordered all kinds of seafood in a non sharing manner each person or couple ordered w.e. service was decent but when the bill came it turned into a DISASTER for 20 people it was about 600 plus tip . we had plans after to go to a club almost didn't make it cause we spend 30 min marking off who had what and who payed how . not only we took up a bunch of the servers time, I also got told by the manager that they WILL NOT DO anything to improve service for groups."}
{"text":"What a unique gem in the downtown core. I love Rodney's, especially for the one-in-a-million chefs and servers. They are all so cool, so knowledgeable and never pushy. It feels like you're very welcome at Rodney's, and so I'll continue to have client lunches and family events here. Expensive, but not pretentious. Casual, but classy. Some racy bathroom art that is sure to make you giggle. The oysters, of course, are fresh and delectable. The sauces and garnishes are so fun. My go-to is moules frites, but I tried the Quahogs with potato wedges, which was a fabulous combo (dip those fries into the broth.. yum!) the Quahogs are more of a chewy clam. Really tasty. Scallops on a bed of veggies were beautifully presented, and the crème brûlée was un-real. I almost licked the jar. Can't wait to go back!"}
{"text":"This place is really good. Definitely worth the wait. We sat at the bar and enjoyed watching the staff shuck oysters and prepare the oyster trays. It was a lot of fun. Their Manhattan chowder was very tasty. We also got their crab cake and U-10 scallops which were incredible, great night... a bit pricey.. but worth it! Only gave it four stars because of how pricey it is."}
{"text":"Food and service is excellent at this place !! The menu is simple and easy to choose from. The server was very well knowledged of oyster choices and I told him to go ahead and choose oysters for me ! 

I love the environment. It is an older building and it is decorated so nicely !! 

I will definitly be back here again =)"}
{"text":"The service here was great. I went with a friend and neither of us really know anything about oysters. The server ordered a few for us to try so we could determine which we liked. Everything tasted great. Would definitely go back. 

The fried oysters were also very good  we had 2 orders"}
{"text":"SIMPLY the best place to go if your visiting canada and you wanna have great food and service. The staff was friendly and informative. The oyster selection was great and extensive and the sauces were all excellent. There was something for everyone here. The lobster club was jammed packed with lobster , bacon , and goodness . The lobster rolls were so good I had to have 2. Hands down its a must visit especially if your in the downtown toronto area. Perfect complement to a day of shopping."}
{"text":"Very very friendly staff ... Duncan is a great bartender and awesome host ... make sure you hunt him down ... very informative and funny ..."}
{"text":"There's not a lot to choose from as far as seafood restaurants go in Toronto so I'm always eager to try a restaurant like this.  The quality and selection is good.  

Main problem is it is really pricey.  Especially the oysters.  I would think that an oyster restaurant would use there buying power to offer a reasonable price.  Instead you pay upwards of $5 a piece.  No combo deals or anything just pay per oyster.

I paid an arm and a leg for the dungeonous crab.  Nothing more than boiled with warm butter that had no seasoning added. 

All kinds of empty tanks in the front.  Makes you wonder, when it's prime summer time hours."}
{"text":"Our annual Christmas dinner with our fave friends brings us back every year to Rodney's for a no holds bar seafood and Prosecco extravaganza. 

For a few hours every year we get together and just go full throttle on what they have to offer and what they offer is great ambience, friendly service and straight forward, generously portioned seafoods.
The name says it all...but branch out and try the specials. Last nights branzino was to die for."}
{"text":"This is a really relaxed, enjoyable place to have some really good oysters and enjoy someone's company. The wine special was good and the oysters were even better. We sat at the bar and the guys behind the bar are quite entertaining. We were going to have chowder for entrees but ended up having more oysters as they were so good. Those are the biggest oysters I've ever seen and they tasted very good!"}
{"text":"Someone should teach the hostess a lesson in customer service. Read some of the reviews and really wished we could've had the chance to try this place. However, we left within a minute following a very cold reception we received from the rudest hostess I've ever met. 

Without passing judgement, she scoffed at us for not having a reservation, reinforcing the King West stereotype that everyone should wait in line even though the place is empty. On top of that, she talked down on us as if we were being unreasonable (which we were totally not) and tried to make a \"joke\" out of it because she has messed up... Honestly I have never been given such rude service before even sitting down! It's okay though, it's not like this was the only restaurant to be. Get over your heads.

Ps. If there was an option to give this place 0 stars, I would."}
{"text":"I loved the concept.
The premises are clean, well planned, and they transport you to a sailboat.
The food is so fresh, that makes you think it was just caught from the Atlantic.
We ordered a dozen of mixed oysters (the kumamoto from NY, were my favorite ones), that came with horse radish, lemon, and a variety of cool salsas.
I strongly advice to ask for the scallop ceviche, the codfish fritters and the Cajun crab soup.
However, the service dissapointed me. 
Just at the door, the waistress asked us if we wanted to be inside or out (with this beautiful weather, of course I said outside), so, she just gave me the two menus, and told me the directions to go outside and pick our own table...
We will definetely go back for lobster."}
{"text":"Rodney's is perfect if you want the freshest oysters and service that manages to be both laid-back and professional.

Oysters are the main draw here - close to a dozen varieties, all perfectly fresh every time. The excellent staff know their stuff and can tell you which oysters are at their best. Main courses are good and well-prepared. The wine and beer list is small but thoughtfully selected to go with the fresh seafood.

The service is East-coast hospitable - I've been here in jeans and straight from work in a suit and felt comfortable either way. Little touches make a huge difference.Once  I was running a little late, and they brought my dinner companion an \"amuse-guele\" on the house while he waited.  I ordered a beer before dinner which I didn't finish before the oysters and  wine to match arrived - and our waiter brought over an ice bucket - unasked - to keep my pint cold while I had my glass of wine. We ordered a lot of oysters and weren't sure we were hungry enough to each have a main course; not only was sharing a main absolutely fine, but they brought it on two plates.

Rodney's is good, fresh seafood, simply but expertly prepared, with unpretentious, hospitable service. If you like oysters, this is about as good as it gets."}
{"text":"Awesome place, great oysters. Sit-up at the bar and let the guys put a plate together for you. The fresh hoarse radish that is grated in front is amazing. Don't forget the lobster roll, one of the best I have ever had."}
{"text":"My girlfriend and I went there for her birthday. The food was great (we had an assortment of oysters and scallops) but the staff was most unwelcoming. They made us feel as if we should have never came there. Waitress was rude, when i asked a question she gave me a snarky remark and when i went up to pay for food (because no one would come with the credit card machine) the waitress thought we were going to dine and dash. It's a shame that a birthday dinner turned out that way. But as I said before the food is great, we just had issues with staff."}
{"text":"Delicious oysters. Kusshi oyster was my favorite. Creamy and sweet. Highly recommended"}
{"text":"This is a great place for oyster and wine. I don't usually eat lot of oyster due to my cholesterol but why not once a while. 
The oyster a very fresh and the Pinot tastes very good too. The atmosphere is nice but crowded. You need to book for a table k. A weekend if you want to get in."}
{"text":"We came in on a Saturday afternoon and were seated at the bar.  Not a big deal though; we got to see our oysters shucked right in front of us.

The restaurant serves oysters from various places and have them on ice on the bar marked with wooden planks.  They have wooden planks from other oysters they've had hanging on the walls as well.  I was so impressed with the staff's knowledge about their oysters.  We ordered our oysters two dozen at a time, and both times one of the staff talked about where each set of oysters were from and how their tastes differed.  To be honest, I couldn't repeat to you where any were from, but I had so much fun tasting each and noting the differences. 

In addition to the oysters, we ordered a bowl of the New England clam chowder and also received house bread.  Be aware that all those oysters add up, and you should definitely expect to \"Treat yo self\" if you eat here...  We definitely treated ourselves!"}
{"text":"This is my favourite oyster restaurant in Toronto. I've been here for the last three birthdays and for other casual outings. 

I first tried Kushi oysters here and now I can't get enough. The staff is always great: friendly, knowledgable and patient (for first-timers, this is key! You don't want to have a first bad experience with oysters lol). They even shucked us a few oysters on the house so we could try it before we bought a full plate. This really helped me decide which types of oysters I preferred (I found out I enjoy the milky, sweet melon-like tastes of Westcoast oysters and the Eastcoast oysters were a bit too salty and coppery for me). 

I've tried their other menu items in Toronto and in Vamcouver: Manhattan clam chowder, steamed mussels, hot smoked salmon, traditional shrimp cocktail. These items aren't consistent from restaurant to restaurant. For example, in Toronto the chowder was a little sour but in Vancouver it was very rich and peppery. The hot smoked salmon in Toronto was amazing and it was limp and slimey in Vancouver.

Overall, I'd definitely recommend this restaurant."}
{"text":"This place was awesome, even though it was extremely busy, the service and help was good, and they were very knowledgable.  It was my first time going to an oyster house and to be honest all the food we tried was amazing.  Sat at the bar, and they took the time to explain the various kinds of oysters!  This place is not cheap, but then again oysters never are!  Definitely worth the experience, pretty loud rambunctious atmosphere, but didn't mind it!  Will go again, if i am feigning oysters!  Make sure to book a reservation though! this place tends to get booked up quickly."}
{"text":"Yes! The service has gotten better!

We ordered 2 dozens or oysters, sparkling wine, a soup and a scallop pasta.

Oysters- I figured the best way to eat them is to start from the biggest ones to the smaller ones. The smaller the sweeter. But hey, its your food, eat it however you desire.

The reason why I gave 5 stars is because........ of the service!

This really nice lady with red hair that was in great shape was our server.
She was really patient and attentive.
What's special about her is that she's smart and honest.

We were supposed to order 2 entries but she held up the orders until we finished the oysters because she figured that we probably wouldn't be able to finish the food.
So we ended up just ordering one entry and split it.

She saved us money but most importantly she prevented us from wasting food.
Most servers would just let you ordered what you ordered in hopes of a bigger tip.



  Woohoo! As good as it gets!

P.S This is not a place for kids. Don't bring your children, especially boys and if you do, don't let them use the wash-room."}
{"text":"Just about my favorite restaurant in Toronto.

 I wouldn't change a thing about Rodney's. They've found the perfect balance between casual and fancy. It's high end without being too pretentious.

Their waiters are always so cool - but manage to be even friendlier than they are hip. And, most importantly, they serve the best seafood in the city. They really know their stuff and are happy to spend some time explaining the daily specials and the oyster menu.

Definitely pricier, but worth splurging on special occasions with a lobster and oysters."}
{"text":"Me and my friend, frequent this place often. The servers are really nice and very knowledgeable. No other oyster house in Toronto can compare...and I'm not just saying that...Along with enjoying some raw oysters, they carry a more then decent beer menu.

Overall a great vibe, usually busy and good music selection...Zeppelin and oysters...Wicked!!!"}
{"text":"The oysters don't get fresher than this at this Toronto favorite. A seafood room showcases the catch of the day in large clean tanks. The entrees are tasty but the real strength of this place lies in their raw bar. Service is friendly and matter-of-fact."}
{"text":"So so so GOOD ! The seafood is so fresh and delicious. I love the half sizes they offer so that you can try several things without wasting food. The scallops were my favourite and their home bread is super tasty. Also- the iced tea is amazing !"}
{"text":"We had a terrific wine at Rodney's and I wanted to track it down at the LCBO. I didn't know the name so I emailed them and they got back to me within half a day with the name of the wine, and an offer to order me a case. 

Now that kicks a little bit of ass. Great customer service Rodney's!"}
{"text":"Food was awesome, service was average. The hostess had an huge attitude issue. We wanted to sit at bar and she had us wait when there were clearly empty seats. Oysters were great, beers were great , service needs to work on smiles- big time"}
{"text":"Oysters are my absolute favorite and I would enter a oyster eating competition if it were possible, so of course we had to make a stop at Rodney's Oyster House since I've heard nothing but good things. 
When you first step in it is a very quirky little restaurant, really nice. A very big restaurant but they still manage to look quaint. 
We decided to sit at the bar so we can see all the action. I would've gotten 100 oysters if I could, but we had to narrow down to 12. Since we didn't know which one to get our server shucked us a dozen with 4 different types (3 of each type), which was all so delicious I could've stayed there all night. I was so please with how friendly, knowledgable and attentive the staff was. 
Will definitely be returning to try some of there real dishes. My dining experience definitely met all of my expectations."}
{"text":"Great seafood and atmosphere. Do yourself a favor and try to sit at the bar. 

Oysters-Amazing

Lobster roll-Out of control good

Perrywinkle-Best $8 bowl of seafood i've ever ordered

Really great experience."}
{"text":"Great oyster variety. Liked new England chowder as well. It is on the expensive side so be prepared to pay."}
{"text":"really enjoy the oysters here!  Very fresh.  Great selection.  

And I enjoy the lobster club sandwich.  Lots of food! 

Bring your own bottle and they charge a floating scale on the corkage fee based on how much money you spent on your meal.  

Check out the mens bathroom for some interesting art."}
{"text":"No better place for seafood and a great atmosphere. Been here several times and have never once been disappointed."}
{"text":"I always come back to Rodney's whenever I crave oysters as I know they deliver consistent quality and service. They have a great selection of oysters and give reliable recommendations for those that don't know their oyster technicals like myself.

One thing that I really recommend is their pasta with scallops. Why get pasta at a seafood house? Because you know the pasta will be good if there is only one option available. We get this every time we visit and I often ask for seconds lol. It is simple yet the rosee sauce is so tasty and they give generous portions of scallops which are perfectly seared  (I'm normally not a scallops person). Tip is that you can ask for a half portion if you want to give it a try :)"}
{"text":"Best service from Sean Boyd,  the most informed, kind hearted, friendly, service-oriented waiter we've experienced in months. Sean, treated us like royalty, recommended all the right product, never stopped checking on us, his hospitality kept us here for two hours longer than planned. Ask for Sean for an amazing seafood experience!! More Sean's are needed in the hospitality industry."}
{"text":"Visited with my mom and fiance for a bite and a couple of drinks - TGIF!

We sat on the patio, which was lovely. Service was relaxed and friendly.

Deciding to share a few plates, we ordered oysters, lobster bisque, clam chowder, calamari, fried clams, and a lobster roll. Everything was delicious, my two fave items were the oysters and the chowder - so good!

If you are a seafood fan, I would recommend checking this place out for sure! :)"}
{"text":"This place was great! The oysters were fresh! The sauces were flavorful and creative. The fish n chips were fantastic!! We will definitely be returning. The restaurant is clean and the service was amazing!"}
{"text":"The best of all was the amazing service, Dave was absolutely great, very knowledgeable, helpful and charming. 

We ordered oysters, lobster, crab, garlic shrimp and fish and chips (party of 9) and everything was delish, they have different types of oysters from different regions and it's very interesting to eat and learn about your meal at the same time. 

The key lime pie was really good.

If you don't like sea food don't come here, if you do, you are going to enjoy every bite :)"}
{"text":"the place offers a variety of fresh and great oysters with other amazing seafood. I especially liked the seafood chowder"}
{"text":"Tonight was my first visit and a treat as I don't get oysters often enough. I live in Orlando but I am visiting the area for work. Oysters were delicious. Service provided at the bar by Kelly was top notch. Couldn't ask for better service. All I had was a variety of a dozen oysters. You had the choice of five different condiments for the oysters. To be honest I didn't find any of them to be particularly interesting. They were pretty bland or pedesterian. My \"favorite\" was the one they considered the equivalent of cocktail sauce. So if I had any feedback it would be to definitely up the game on the sauces...but the oysters were very reasonably priced and delicious. Wine choice and pricing was just ok. 

SO overall it was a delightful evening with great service. Nice crew works there."}
{"text":"Didn't have a reservation and the place was packed.  We sat in the front area in front of the live crab and lobster tanks so it was entertaining while we waited.  In a lobster vs crab battle, I think the crab may win.  The lobsters claws seam more deadly, but the crabs are faster and more aggressive.  Just my take.  While we waited, the hostess took our order for drinks and treated us like we were already in the restaurant, checking on us every so often.  The 30-40 min or so went by fast.

This time I splurged for the dungenous crab.  It was crazy good. The waitress brought him by before he was cooked so I could say hi.  

This place doesn't disappoint!  This was the first visit where I did not have oysters, and it was still great.

Takes Amex"}
{"text":"I love Rodneys. I have been visiting Rodneys since I was a New Yorker visiting Toronto, and I try to go at least 3-4 times a year. A special occasion? Rodneys. Looking for a snack and a drink on King West? Rodneys. In the mood for some late night oysters? Again, Rodneys. I always try to get a spot at the oyster bar and watch the expert shuckers do their thing. I also always have at least a couple dozen oysters and a fine tap beer, and then am open to trying anything else. Anything else ranges from periwinkles to chowder to clams. It's all good. 
The oysters are what makes the place though, and the selection is among the best I've seen. I recommend trying as many different oysters as you can. Rodney's always has a different choice, and they know how to shuck em!"}
{"text":"I've been to Rodney's several times and I'm not sure why I had not written a review! I give it 5 stars on service and fresh seafood. Tonight we sat at the bar and I stuffed my face with a clam chowder soup, grilled scallops and a dungeon crab . My hubby had a lobster. The seafood is so fresh and tasty. Can't wait to go back for oysters!"}
{"text":"Solid 4 stars.  I sat at the bar since the restaurant was going to be seated with many large parties early on.  I am a solo diner in for business.  The bartender/server was very outgoing and made me feel welcome.  There is a gentleman shucking oysters easier than I've seen anyone and that was quite impressive. 

I had the Kumamoto oysters and they were delicious.  There are jars of sauces in front of me, but they weren't explained.  I figured out fast that one was ungodly hot (Hell and Back) and the other was much more mid.  

I got the lobster roll (no mayo) which came with a lovely lightly dressed salad and 4 battered onion rings. The lobster was tough and was not served with drawn butter or seemingly on a buttered bun.  That was really my only let down is that I've had lobster rolls from food trucks that were better.  Alll in all, I'd go back but probably try something different."}
{"text":"We were not disappointed!  Very casual and friendly environment.   Entire staff was genuinely kind and welcoming.  Our waiter helped us pick some oysters which we absolutely loved!  We also ordered the whole steamed lobster and the fried soft shell crab.   Everything tasted great!!  No wonder this place is always busy!  Had the lime pie for dessert, it was delicious, had to order a second slice! 

We'll definitely return and would definitely recommend!  Although, next time we'll try something other than the fried soft shell crab."}
{"text":"We love oysters. This place was way over priced.  The food was somewhat lacking flavour.  Despite being full of people. Their is little to no atmosphere and kind of like eating in a dark dungeon."}
{"text":"First time I had a platter of oysters + beer. Great service, great oyster culture Resto. Learnt a lot, ate a lot. 

Second time I went in for a quick lunch, same great service but the soup quantity was too small for an adequate lunch and it was too pricey for $12! Came with a lovely pumpernickel bread tho.

Rodney pops by once in a while and he's a great guy to chat with if you strike up a convo with him.

I like going here"}
{"text":"Very nice place, great atmospheare, good tap beers. Plates overpriced though. Just regular lobster roll. Oyesters simply delicious. Very good and friendly service and well prepared staff."}
{"text":"Service was great. The guys at the bar shucking were fun! Definitely the best place to sit. Prices were on par with any other Oyster bar I've been too, not cheap but that's expected. Would go back for sure...probably for the lobster, it looked delicious."}
{"text":"Came here for a birthday so I got to try a wide variety of dishes.

Had a large selection of oysters. They were good. The usual. 
Also had some crab and lobster, nothing spectacular, but again - good.
The rest of the dishes were horrendous and over-priced (and I didn't even pay). Seriously, don't eat them. Come here for the oysters, I guess its hard to find such a wide variety of oysters in the city.

As I tend to repeat restaurants that I enjoy (meaning sometimes frequenting them multiple times a week), I have to ask myself whether I would return.
Considering alot of factors including food quality, presentation, variety, and price, would I return? No (and I rarely say that)."}
{"text":"Loved the decor of this establishment and the variety of oysters they have. A bit on the pricer side but definitely tasty and fresh. Got to try 12 different oysters, all from the east coast. It was so fresh! In addition, ordered their smelt. Only thing I didn't like was the smelt because it had too much panko crust. Service very friendly and attentive. Would definitely come back when I visit."}
{"text":"We reseved the table and when we got there they said that one of us had called to cancel, really? Lame excuse. Then they gave us a table and the waitress was so rude and she even had the audacity of saying when we put our hand up, that we were not the ony ones she has to serve and there was more tables and we have to wait bcs she was with the other table at the moment. The food was really good, delicious everybody was very happy with. But I have to say the service SUCKED."}
{"text":"If you're looking for Canada's freshest oysters, you must go to Rodney's! The oysters were incredible however I was a little disappointed in the sauce selection. I would have liked to have experienced more mignonettes with fresh ingredients. 

The steamed clams and mussels were great and they flavored the sauce perfectly. The tuna tar tar was lacking a little flavor however was still fresh. 

The service was great and the ambiance was cozy and casual. I would definitely eat at Rodney's again."}
{"text":"Had the lobster club sandwich which was delicious, and accompanied by the biggest, thickest, tastiest onion rings ever."}
{"text":"This place is live. The lobster and crab platter is fresh. The potato wedges that accompany the seafood is like crack. Oysters and scallops are always super fresh. Great selection of sauces for the oysters. Their homemade ice tea is good too ^^"}
{"text":"This dish in photo looks good, right? Yeah, this small, unfulfilling 3-course in one meal was over $100! We can honestly say Rodney's is one of the most overrated, overpriced seafood restaurants in Toronto. The hostesses were also super unfriendly."}
{"text":"A casual, family style seafood house in the heart of King West. 

I came here with a friend on a Monday night for the pasta with scallops ($21). This is the only pasta available on the small menu, but we were very pleased with it. The pasta was served with simple but creamy rose sauce. There's also no shortage of scallops on the pasta - served with 7 perfectly seared scallops, which was more than enough for me. The waiter was also very attentive and provided great service. 

We decided not to try the oysters this time but I will definitely be back for them!"}
{"text":"Sitting at the bar with an old friend, enjoying a glass of wine, talking about relationships while slurping down delicious oysters... priceless 

I love oysters and order them as much as I can.. These by far are the best I've had!"}
{"text":"I've loved this place ever since I first came here almost 10 years ago, and the love for Rodney's has not faded. It was a while since I've made a visit, but the restaurant still continues to maintain its charm, and more importantly, the quality of the food (although I was a bit sad that the rice pudding is no longer on their menu...).

They have a wide variety of oysters that come in fresh daily, which can make it a little difficult to choose unless you're an oyster connoisseur. I absolutely love oysters but haven't really put in much effort into remembering which ones I like, so I usually just ask the server to bring me a selection of their recommendation, and so far, I haven't been disappointed. Some may be a little more briny and saltier than I might like, but that's all just personal preference, and the best oyster really depends on your own palette. My favourite part about Rodney's really comes from their large selection of sauces, which range in the level of spice. I don't find Tabasco to by spicy enough, so their extra spicy sauce provides me the right amount of heat I enjoy.

Their appetizers in my opinion outshine their entrees. Their clam chowders, both the New England and the Manhattan kind, are excellent. They are chunky, they don't skimp out on the clams, and they make sure you will always get a bite of a clam with every spoonful. Another must-order is their cocktail shrimps, they are jumbo-sized, succulent, and the sauce had a nice kick to it that pairs well with the shrimp.

I'm a big fan of cocktails and unfortunately the only cocktail they have here are Caesar's, which I found a little too watery for my liking. I would've preferred a stronger taste of the tomato, but it does hit the spot if you are craving one. They do have a fairly small whiskey and scotch selection, and they do offer a bunch of beers but this isn't quite the right choice if you're looking for a big bar selection.

The entrees at Rodney's are kept simple, which has always been my preference when it comes to seafood. They don't overpower the seafood with thick sauces, are too many spices, which lets the seafood showcase itself. It may taste a little bland for some people, but I personally prefer food to taste a little on the lighter side.

Service at Rodney's is always attentive and friendly, and fits more of a casual and relaxed environment despite the price point. It is a fairly expensive place, and if you're on a tight budget, I would recommend eating somewhere else first then grab a few oysters & appetizers here - and even then it can still cost quite a bit, as each oyster can range from $2 to $5. If price is not an issue for you, then go all out and enjoy all the great things the oceans have to offer."}
{"text":"Discovered this place with my friend recently and we both fell in love with it. I even went back by myself for lunch a few times. I reccomend sitting at the bar, the set up is really interesting and although there's alot of people working in such a small restaurant it feels like an intimate family oriented restaurant it's really nice. Get the chefs to choose a mix of oysters for you... the only ones I wasn't fond of is the west coast ones, their huge and the shells are really bumpy so it should uncomfortable eating them plus they don't taste as good in my opinion. Also it's a great place but it's Really pricey so just a heads up but it is worth it."}
{"text":"I like some seafood but I'm not a big fan of oysters, but one of my friend loves to come here whenever he's in town, so I'm glad they expanded the menu some.  We've come a handful of times, but this past experience we had was terrible.  A group of us went, and spent well over $300 yet we were treated like absolute scum.  We tried to make conversation with the servers and shuckers and we were either ignored or given short, one word answers brushing us off. They didn't seem to have any problems conversing with the other patrons, but they clearly had a problem with us.  

Now I'm sure people may read this thinking maybe they ignored us because we were drunk and belligerent.  Well I personally was sober, and my other friends had a few drinks but were not even loud, let alone belligerent.  And if for some reason the servers thought they were too drunk than they should have stopped serving them alcohol rather than taking our money yet treating us like we didn't deserve to be there.

It's really unfortunate, because in the past, we have had great experiences talking with the staff and eating the deliciously fresh food.  After this experience, however, I will not come back."}
{"text":"Love this place.
I usually get the special of the evening, and I'm never disappointed.
It's a bit pricy, but the quality speaks for itself. 
It's worth every cent.

They also sell Lobster by the lb.
I ordered 3 for New Years last year, and was shocked at the quality and freshness. (Not cheap, at $120) -- BUT, worth every cent. They arrived in a ice packed box, moving. I still dream about those babies ...  mmmm .. live, fresh lobster."}
{"text":"I want to rate it 3.5 stars but it doesn't give me the option so I am rating it a 3.
Over the years I have been here quite a few times and if I had written this review a year ago I would have rated it a 5 but unfortunately two of my experiences over the last year prompted a less than stellar review.

One of my visits choose to sit at the bar with a friend, we befriended the couple next to us, not only was the bartender very slow with serving us but he was very rude to the couple.
The man asked him why they don't serve certain products and the bartender went on a rant on how bad those products are which was very unprofessional of him, meanwhile the brands the man was asking about are great high quality products.

The last time I was there I was with a group of 5 and the restaurant was not that busy as it was a Tuesday early evening about 7PM but still the waitress was extremely slow we literally had to flag down the waitress every time we needed to order more drinks.

Although the last two times were less than what I expected, all my other experiences had been great up to that point so I will give Rodney's one more try but if the service is bad or I encounter rude staff again I will not be returning."}
{"text":"Vacationing in Toronto. Found Rodney's on Yelp. I never want to eat another Texas gulf oyster again! Some of the best oysters from both coasts. Anything from PEI was a winner. Ate on the patio. I highly recommend that if weather permits. One thing I didn't care for was the fresh shaved horseradish. It was dry and stringy and not liquidy and chunky like most other places. Still was good, just not spicy enough. I will return if back in town."}
{"text":"Excellent Oyster Bar.  Nice and fresh. Staff very knowledgeable and attentive.  Brett was ours and he never steered us wrong in our selection of oysters or items off the menu. It was great to be able to try different varieties of oysters.  From the Canada's west coast to the east, US and Japanese Kumamoto, all were fresh, unique and delicious. The pasta was cooked perfectly and the scallops nice and fresh with just a bit of a kick. Oh and the hard shelled clams...a must have! I had to ask for more bread to soak up every last drop of the broth. You will not be disappointed."}
{"text":"I feel somewhat blessed that I'm so close to not one, but two great oyster places.  Rodney's and Oyster Boy (http://www.yelp.ca/biz/oyster-boy-toronto).  Both provide fresh lobster and seafood as you'd expect, and do shuckings right in front of you, so you know the oyster you're about to enjoy is utterly fresh.

What I find with Rodney's is it seems to be more about the group experience than that of the individual.  Since Rodney's is a larger venue, it affords an experience for larger parties that many restaurants of its ilk can't afford.  In so doing, it always appears to me that the restaurant is overrun by groups doing their own mingling and eating but taking away from a more intimate setting.  Having been there for group events, and seeing the number of groups gathered out front of the restaurant, you can tell they handle groups well.

Not to say that tables of two or four are abused by any stretch.  The food is fresh, the wait-staff attentive, but you can't help but get the feeling of being somewhat overwhelmed when a group of project managers from Bank of Montreal suddenly descend on the place for a private function.  Myself, I prefer the intimate."}
{"text":"There are very few places i'd trust to eat raw seafood.  I have a \"delicate\" digestive track.  That being said, Rodney's never lets down.  I've been going for over 10 years, and had them cater a party too.  True, it's expensive, but if you're out on the town for oysters, what do you expect?  they have a tiny menu, but what they do well, they do VERY well.  

Normally when I go I just ask the waitress what's good and then ask her for a selection of all of that.  The shucking is also great.  I hate having sand in my oyster, but I've never had to worry about that here, as oppose to many other places I've tried in and outside of Toronto.  A good pilser, clam chowder and a rice pudding usually top off the meal.  The only thing I'd complain about, and it's not so much of a complaint as it is a \"hmmm\" issue, is that the tables seem very far apart.  It makes the experience seem a bit isolated - and sometimes I just have the feeling to tell my neighbour, \"hey, this is amazing, have you tried it?\""}
{"text":"Oysters are fresh.  Sat at the bar area.  The bar server is a little too pushy.  Little too attentive.  Recommend to put labels on the different types of oysters if ordering a mixed variety, that would make the experience more fulfilling and to know what to oder next time."}
{"text":"I forgot how much I love oysters until I came to Rodney's and had some great oysters. I came here on Friday night 9pm, it was pretty loud and packed inside still. The music selection is pretty good, the atmosphere is pretty chill. 

Service was good and the server recommended an excellent dark beer (I normally drink light) and excellent selection of oysters.

We started with 2 dozen oysters to share amongst for of us. they were all very fresh. My favorite one was a PEI variety. Of course they are expensive; probably average $3-$4 each. 

For main, I shared the scallop pasta, which they split in two plates for us. The rose sauce was too sour, taste more like tomato sauce. Pasta was al dente and a bit bland. Scallops were okay (total 8). 

I also had the pan fried oysters. Breaded in panko, I could smell the oil, but its crispy and good with mayo. 

I tried one of my friend's mussels cooked in tomato sauce. Meaty and good sauce! And for $14, its a good price for 30+ mussels!

Total bill was $60 per person. Very steep price, but I'd say it's worth a try. I 
like the fresh oysters and the environment, and the dark beer was delicious!"}
{"text":"Always good service, helpful people.
Beers are cold, oysters are shucked great.
Many choices of hot sauce.

Next time though I will choose my own oysters, as I didn't like my servers suggestion.  I should have listened to myself (not the restaurants fault as oysters are always a preference)"}
{"text":"This place is awesome. The service was fantastic and our food was delicious. Food is served quickly without compromising quality.  

Our \"Oyster Relocation Engineer\" really knows his stuff. We started with a plate of 12 oysters to share. As we picked the ones we wanted to try our server made recommendations - he did a fabulous job. The ones he did recommend were exactly as he described and what we were looking for. 

We also enjoyed cups of Clam Chowder and the smoked fish. 

I will definitely be back."}
{"text":"I went to Rodney's yesterday for dinner. The overall experience was pleasant. The waiters are very informative when it comes to oysters. 
We ordered a dozen and let them pick for us so we could try a variety and then order more of the ones we liked. It worked out well. 
The oysters are very very fresh. They also have a large variety, which we appreciate.  
We also ordered cooked food, scallop pasta, soft shell crab with pasta and made a social request for fried halibut. The halibut was amazing. It would be under their lunch menu fish & chips. The waitress was very clear that they usually don't do that for dinner and she made a big fuss about it being a one time occurrence (that they would make a lunch item for dinner) she was slightly abrasive and often was really busy, enough to make it known to us... 
The scallops in the pasta were great, but the pasta itself is mediocre, wouldn't order that again. 
Soft shell crab was done well and was served with a cold macaroni salad which was really delicious. 
It's a the place to go for oysters, next time I might try sitting at the bar for faster service."}
{"text":"The tuna tartare was overpriced but amazing otherwise the ambience is not at par with the king west crowd.

Very quiet and not many people."}
{"text":"The food took forever to come out because of a mix-up, but we weren't charged for the dish (thanks!), so no complaints there. (Another Yelper says this place recently changed ownership -- maybe they're going through growing pains?) 

The moules frites were excellent, but oddly not served with bread (isn't that how it's done?).  I would have asked for some but the server was rarely to be seen, despite the place being pretty empty late in the evening. 

Our brownie-based dessert was unbelievably fresh, delicious and well presented (which was unexpected, for an oyster joint!) 

Be warned: the menu is pretty pricey (but other Yelpers say it's worth it...).  Also, there's a $5 charge to split a dish (a huge pet peeve of mine -- you want to charge us more for eating less?!) 

I like the decor a lot -- heavy woods and hefty fixtures create a maritime feel, but without going \"overboard\" (har har!).  Being located on a tiny sidestreet off of Bay Street also adds to its cozy feel."}
{"text":"The entrance to the restaurant was a little strange because it looked as if it used to be a seafood market that's no longer. But once you got inside it was really cute, with the oyster shells everywhere. We ordered two dozen oysters, the smoked fish which was excellent!  I think next time we'll pony up to the oyster bar next time!"}
{"text":"I went to Rodney's Oyster House last Friday for a birthday. \"It's Friday night, and I feel all right. The party is here on the West side\" (This is how we do it) This was my first time here at Rodney's and my expectations were high. Our server Kelly was a cool guy and made many jokes and was really informative about the menu. I started off by ordering a bottle of riesling for my self and my significant other. The wine was ok, nothing special, but thats not what we went to Rodney's for. We started off and ordered the Lobster Chowder, it was quite good and suprisingly filling. Finally we had a big platter of assorted clam and oysters. There were about 3 dozens per platter. My favourites were the Kusshi Oysters from BC which was a meatier oyster, and the Kumamoto Oysters from the Western Pacific which had a creamier taste. They were amazing out of the large variety that we tried. With the oysters there were sauces that complemented the delectable taste of the oysters. They ranged from mild to spicy and were quite flavorful. Finally we ended off with Deep Fried Oysters which were also delicious. There were more options other than oysters but thats what I specifically went for. All of the Seafood was fresh and had a very minimal fishy taste. I had a great time here with great people and would definately come back again even with the high cost. It was worth every penny. P.S. Did I mention that Oysters are an Aphrodisiac;)"}
{"text":"Went here yesterday for my birthday lunch and I was blown away with the fresh seafood and lovely customer service. The waiters were fun and accommodating since my group didn't know much about the various of oysters. The volunteered to put together a mixed plate which brought oysters from around the world into one dish. The oysters were fresh and the sauces they had to go with them were all delicious. We then ordered the clam chowder and seafood stew was a great way to start the meal. Both dishes ensured that the seafood was not overcooked, nothing was chewy or rubber. We also ordered a whole lobster dipped with butter, sea scallops and fried oysters. All dishes were cooked well and once again seasoned to perfection. Can't say enough positive things about this restaurant. If you are a seafood lover, this place is a must!"}
{"text":"Rodney's is first and foremost an oyster house.  If you like oysters, you will find some of the best and freshest oysters from the east and west coasts here. Beyond that, the soups and appetizer plates are consistently the next most promising choices in terms of flavor and creativity, including deliciously meaty fried oysters.  The main plates are good, but tend to fall in a price and taste category that seems similar to a lot of other places. You won't go wrong, but I would not come here to order a salmon plate unless I just hated oysters and wound up here with friends/colleagues.

Reservations here are a must, particularly on weekends.  The biggest negative here is the service. It is not terrible, but could be much better.  Things like offering to hang a coat, explaining the ingredients of an appetizer when it arrives, giving helpful descriptions of the individual oyster varieties, or understanding wine, don't happen all that consistently or well. The service is not rude or totally checked out, but it could be better.

That being said, Rodney's is worth a visit and a return visit, especially if you are a fan of raw oysters."}
{"text":"Went back in forth for our dinner selection when we finally settled on Rodney's and we are glad we did.  Not knowing we'd need reservations we sat at the bar to avoid the 3 hour wait.  We were seated right in front of the oyster shucker and were able to listen to him explain all the different types and flavors we were experiencing.  They were great.  We also had a scallop special which was pretty amazing.  Live scallops roasted in an herbed butter sauce topped with fresh parmesan cheese.  We literally drank the butter sauce out of the shell after we ate them.  The staff was very friendly and helpful.  There were a lot of locals there who were surprised two people from Dallas had found this hidden gem. We were also given some recommendations for other \"local\" places we should visit and were glad we did."}
{"text":"The oysters..oh the oysters.

This place has a really comfortable vibe.

My friend and I ordered:

- Rockefeller Oysters: They weren't anything special, next time I would stick to the raw ones
- Raw Oysters: AMAZING. The waiter brought us a few different kinds so that we could try to understand the different flavors. They were so fresh and delicious. I loved the tray of assorted condiments ( about 15 different bottles) they give you.
- Lobster: As good as lobster gets.
- Seafood gnocchi: Oh lord. I think I licked the bowl on this one. Pillowy gnocchi with scallops and shrimp. It had a rustic feel to it with an variety of lightly cooked cherry tomates. I want some right now.

I would go back for the oysters and that gnocchi. Damn.

Price: It is quality seafood so you pay for what you get!"}
{"text":"I am a regular there. Hands down Rodney's has the best oyster in down. And the seafood is very fresh. 

The reason I am only giving three stars because of the service. Often we wait for another 15mins even when we made a reservation. We went there this Friday, there are few new faces, I think they did not get train properly. No smile, very rude and took so long to get our bills. It was $200 for three of us."}
{"text":"Can not recommend enough. Oysters are fresh and delicious, and the wait staff will ensure you get exactly what you're looking for. Try the clam chowder!! Will be back soon xoxo"}
{"text":"I'm kind of disappointed. I'd been hearing how great Rodney's is and a trip there was a nice opportunity to see if it was up to the hype.

It's a beautiful day today, so let's focus on the positive: fantastic oysters. We had an assortment that our server suggested and they were all brilliant. Chiefly among them the Kumamoto oysters were delicious. But then I think that Kumamoto oysters kind of fall into the same category as garlic and ginger: you can really never go wrong with them.

Also in the positive: you can get 1/2 orders of the main dishes which is pretty great. I had a soup and 1/2 an order of the scallops which were (while not great) pretty darn good. Fantastic for those for whom variety is the spice of life.

So why was I disappointed? As others have commented, the service was pretty bad. It took 45 minutes from our reservation time to get seated and our drinks ordered. Another 30 minutes for the main dishes. In fairness, they seemed a little understaffed so I put it on management. 

I think it was also a little expensive but whatever.

The wine list was ok. I was a little disappointed that they did not have more wines by the glass. Also only beer and wine which is a little odd for a place that \"nice\" but licenses will be what they will be.

The soup was tasty but a little thin. It was advertised as shrimp and crab but there were only two shrimp in the soup. Not a deal breaker because of the good broth but kind of disappointing.

The whole crabs and lobsters looked pretty good and maybe if I had tried them, this review would be different.

The obvious comparison is Oyster Boy. I like Oyster Boy a lot and just for service and prices, I think Oyster Boy gets the nod here but Rodney's oysters (and oysters alone) make it kind of close.

As with some other places I've written up, I'm not averse to going back but I have no burning desire to do so. If I got back, I think I'll stick to the oysters and wine and hope to be out in less than two hours."}
{"text":"Great oysters; we asked for a random selection and they brought over some great choices. 

The new england clam chowder was great as well, but my favourite was the fried calamari! So good!"}
{"text":"Great oysters! Service aggressive + rushed. Wine list short,very expensive + bordering on intellectually challenged.greasy fried oysters . Salmon special 28.00 the size of 4\"x5\". Delicious oyster slap of years gone by was watery with odd tasting oyster bits. Crackers were stale. ?? How soon can I get to the Grand Central Oyster Bar??"}
{"text":"Was at a company meeting in Toronto 3 days last week and stayed at the Cosmopolitan SOHO which was a great hotel. The first night we were there I looked in to restaurants and found Rodney's which is about a half mile away. Went there with a co-worker/friend and we had the most awesome meal. Wide selection of oysters and other shellfish. The Graces Chowder was excellent and would certainly go back the next time I am in Toronto. I kind of compare it to Neptune's in Boston but on a larger scale. Rodneys was a bit pricey but well worth it if you love oysters. Oh . . . the fried oysters were freaking insane as well!!!"}
{"text":"An amazing gem in this city! I absolutely love Rodney's!! The fresh incredible selection of oysters, the wine list and the service are all amazing! Not to mention the clam chowder. If you love seafood you have to go here!"}
{"text":"A couple of friends had been to Rodney's and I thought it may be worth a go. I had dinner and noted the variety of items on the menu. A couple of items ordered included the George's Bank scallops and a grilled branzino over a bed a mixed vegetables. The meals were exquisitely prepared and were of excellent quality. The place was moderately busy it was a great experience. There are a variety of oysters to choose from if you enjoy the oyster bar. Good place to go if you are a foodie or for special occasions."}
{"text":"Ruined the fish by undercooking and then burning the shit out of... Removed from bill without even asking, thanks. Appetizer was good, drinks were not cheap, Bummer :("}
{"text":"You can't go wrong with this place.  Their clam chowder soup is tasty and oysters are a must.  Lobster roll was standard and the tuna tartare special was very fresh.  We had a simple seafood lunch and had no disappointments.  If you love seafood, this is your place."}
{"text":"Wow!!! What a great experience! Food amazing! Service amazing! The Pino, excellent. 

To the man in the grey shirt, possibly early 40's who asked me how my food was while my mouth was too full to answer.....the girl with the blue hair thinks you're SO HOT"}
{"text":"Rodney's was amazing, which is something I rarely say about a restaurant. I brought my mother here for her birthday and we both agreed that it was one of the best meals we had eaten in awhile.

When we got there at 6:30 it was only half full, but quickly filled up. I was glad I made a reservation. Service throughout the meal was fantastic. Our server was very friendly and frequently checked on us to make sure we had everything we needed. He was also very honest about how he felt about some of the dishes and helped us decide what to order. I appreciate when servers tell me what they like and dislike as opposed to saying the whole menu is amazing. Likewise, the man serving our oysters (we asked our server to choose a dozen he thought we would like - he had some great picks!) was very helpful in describing all of the oysters to us and where they came from.

Aside from the dozen oysters, we also had the New England clam chowder (which, which tasty, was our least favourite item), lobster club, and the scallops. The scallops (which were server with sautéed veg) were fantastic and very filling. I was also pleasantly surprised by the lobster club; it had quite a bit of lobster and came with some great onion rings. While the food definitely doesn't come cheap ($20+ per entree), it's really worth the price (unlike some places *ahem* Rock Lobster).

Overall, a fantastic meal. The restaurant also has great ambiance and would make a great spot for a date or special dinner."}
{"text":"My sister Evelyn mentioned that she wanted to go for oysters on her birthday but I suggested ordering a box from a wholesaler and shucking them ourselves at home. So my family and I threw her a Champagne and oyster party on Saturday! 

Originally, I wanted to order the oysters from Oyster Boy on Queen West because they are located just a few blocks from my place. I haven't tried the oysters from there but I've only heard great reviews and also know that Canoe gets their oysters from there. But after speaking to them and Rodney's Oyster House on King West, I decided to go with Rodney's. The gentleman I was talking to at Oyster Boy couldn't really answer my questions and was in a hurry to get me off the phone. Although it took a while to get a hold of the wholesaler at Rodney's, he (Michel) was super friendly and helped me choose 3 different types of oysters for the party. We wanted a selection of oysters so we went with Village Bay, Malpeque, and Ruisseau, which all have a variety of taste, meat quality, meat colour and shell characteristic. To be honest it was difficult for me to tell the difference between the oysters but it was very obvious that the oysters were excellent quality. My family and I were very impressed and were glad we chose Rodney's.

Photos on my blog post here: http://www.callherpennylane.com/2014/03/oysters-champagne-for-evelyn-birthday.html"}
{"text":"Stopped in for the 1st time. We didn't have reservations, but was quickly sat at the bar. Which worked out perfectly for us.... Considering we had Rodney select the oysters he recommended. So glad he did! We loved everything. He then recommended the scallops... OMG! I'll be tasting those all the way back to Ohio. They were absolutely the amazing. The texture, flavor... Everything was perfect. Cannot wait to visit again and see what he picks for us next time!"}
{"text":"We only came for a dozen oysters, but they were fresh and delicious. They were prepared excellently with no loose shell pieces. There was an assortment of sauces to go along with them. I really liked the \"Back from Hell\" wasn't too hot and u am a wuss when it come to hot.  

They had an excellent selection of oysters from the East and West coast of Canada and the US. Price was reasonable too. 

They have a nice little court yard to enjoy the warm summer air."}
{"text":"We went there before a Mirvish show and was really disappointing. I know it is a seafood restaurant and was expected to pay a little more. However, a small size gumbo was $14. 
When we ordered a plate of scampi, it literally was just that. Three small scampi in a very watered down butter sauce, with absolutely no starch to come with it. It would have been nice if it was either 1- stated on the menu or 2- stated by the waiter.

Right, the waiter. He was so rude, only stopped by once during the whole meal. When the plate of scampi came, we asked what would be the best way to eat them. He said \"just open them and split it\" We know that we had to open them and split them so that we won't be eating the shell, but we would appreciate a little more instructions. Could he not see that we are don't eat seafood often?

Going back to the scampi, they are definitely very small. the sauce was tasteless and all this cost us a grand $23.

Great, this was the most unsatisfying $50 meal we have ever had. 

Especially for a seafood restaurant, we would expect a little more."}
{"text":"My bf and I came here for dinner a night before long easter weekend. We made a reservation for 9:10 but arrived about an hour and 15 minutes early. We let the hostesses know that we were here but we still had to wait till 9:10 to be seated. Well that's understandable because the place seemed packed. 
The decor was cool and detailed. At the entrance there are live shellfish and the staffs occasionally come grab them so you know they serve fresh seafood. 
We ordered a dozen of assorted oysters (with the recommendation from the waiter), lobster club, and pasta with scallops. Oysters were good and fresh. But I don't think they're the best I've tried. They definitely don't top the ones I've had at the Oyster Boy. 
The hot dishes, lobster club and pasta with scallops were so disappointing. The lobster itself in the lobster club was delicious and cooked just right. But with the rest of the sandwich, it tasted so mediocre and blend. I wish it was a little bit more flavorful. The onion rings that came with the sandwiches were good though. For the pasta with scallops, it was so small in portion!! Like the lobster, the scallops were delicious but the pasta was sooo blend and tasteless. It was as if they boiled the pasta, mix it with tomato sauce, then put some scallops on top. $20 for such a small, tasteless dish? No I'll pass. The only good thing about the pasta was the scallops. Well, after all they do specialize in seafood. I guess they did what they are good at - making the lobster and scallops good. But they seriously failed on cooking the land food. 
Oh also I really disliked how they serve the drinks with shaved ice instead of ice cubes. Our coke and orange juice got watered down way too soon - after a few minutes I was basically drinking half orange juice and half water. 
The waiter was very friendly and knowledgeable, but lacked attentiveness. He forgot to bring us the special daily menu when we were seated, was nowhere to be seen when we needed him, and almost brought us wrong bills. 
It was too expensive for our mediocre experience there. A dozen oysters, lobster club, scallop pasta, and 3 cups of nonalcoholic beverages came to $95 plus tips. Honestly I had much better experiences at the Oyster Boy, Big Daddy's, or Diana's Seafood (which I have yet to leave reviews for) for less price. We were quite disappointed and I will not recommend this place because there are definitely cheaper and better alternatives in Toronto."}
{"text":"Called in earlier in the afternoon trying to get a reservation for the night, got told that we don't need one coz a table was easily available around 6. Got there, got told no table available tonight because of an event going on. And we were asked to wait 20 mins for a bar seat, seriously?! Totally unprofessional service, won't come here again and would never recommend this to any friend!!"}
{"text":"Service was so slow.  I mean really slow and the wait staff couldn't care less.  Food was OK but nothing out of the ordinary.  The oysters didn't taste all that fresh.   The high prices did not correlate to high quality food."}
{"text":"I recommend sitting at the bar ordering some fresh oysters and getting a bloody caesar. 

I asked about their local beers telling them I drink SoCal craft beers and they swayed me into getting their bloody caesar. After taking a sip, I knew that was a great choice. I wasn't have any luck with the beer choices available in Toronto.

Service was friendly, bread was fresh, and oysters were as fresh as they can be. 

Highly recommended for oyster lovers in Toronto!"}
{"text":"Oysters...that's all there is to say. Actually I can also add mussels and urchin, and other delish seafoods.  This is currently my favorite restaurant.  There are fancier more stylish places; there are more 'in' places.  But to me,this place is kind of grungy and these folks know their seafood and have a passion for oysters...and it shows.  It's also relatively child friendly - I've brought my 4 year old a few times and she has always been welcome and loves to sit at the bar and watch oysters being shucked."}
{"text":"I'm never going back again. Food was really good as always, but the bartender who was serving us made my wife and I feel like we were just tourists passing through. No class. The feeling is gone."}
{"text":"I've been to Rodney's for the birthday of a friend. We were a group of 8. From experience, going to a restaurant with a large group can be a bit of a let down, but I was really pleased by my experience there! 

We reserved for 8pm and first good surprise, the table was ready on time even if it was a busy Saturday night. 

Our server, Woody was fun, resourceful and knew his menu and wines extremely well. Our group of friend is nice but we had a lot of questions and we like joking around a lot. Woody was on top of everything and was joking around with us, which made our experience even more pleasant. Kudos to the other waiters passing by our table and exchanging jokes too. 

Now for the food, we decided to share everything. We had 2 types of oysters; 1 from New Brunswick that were just out of this world, and another from the Pacific that was also great. Both were delicious on their own. We also were provided with 8 different type of sauces if we wanted. 

We then had Salmon Tartar that was very well executed. The fried calamari was also a hit, perfectly crusty with the breading. Following was mussels in a garlic sauce that was so good, we asked for a second dish. 

The only so-so dish were the scallops. It's a shame because they were perfectly cooked. However the mushroom dressing that came with it was too bland. Maybe something to work on.

The staff was nice enough to offer a chocolate mousse to the birthday girl and sign happy birthday in a very joyful tone. 

With 5 bottles of wine, food and tip, it came to about $80 for the 7 of us. (How bad friends would we be to have the birthday girl pay!) 

Strongly recommend this restaurant."}
{"text":"Mmm headed to Rodney's for my anniversary. Decor was pleasant and fitting as heck, I thought it was quite cute. 

Server was very knowledgeable on every oyster we ordered,  which was useful since we don't eat them too often. 

My boyfriend got the U10 scallops which were TO DIE for!!  The pieces of pork were melt-in-your-mouth delicious.  The scallops were hearty and filling. 

I got the Lobster roll.  It came with a generous portion of Lobster,  but I feel it was lacking some flavor.  It was covered in a sauce but had no real BAM. The onion rings were awesome though.  

Cesar was great,  but not spicy enough (I like it super spicy though,  so I'll give them that). 

Our bill came to about 130 after tax,  which was fair for what we ordered. 

One complaint,  service is quite slow,  but they were surprisingly busy for Wednesday evening.  Still,  I would return in a heart beat."}
{"text":"I have been here several times, most recently a party of 6 of us sat on the patio.

The Oysters are always delicious and I recommend trying a variety so you can taste the differences between them! 

They got docked a star for inconsistent service. It seemed as though we were inconveniencing our waitress simply by being there!"}
{"text":"Rodney's is a great long standing establishment for oyster & seafood lovers. I'm particularly fond of their large selection of oysters from coast to coast. 

We got an array of oysters and fresh cherry stone clams as they're always a favourite amongst us. We enjoyed some tastes more than others and got recommendations for the next time we're here based on our tastes. 
They offer a range of seafood sauces from mild to super spicy. We ended up taking home a jar of \"back from hell\" because it was so good! I'm not a big spice eater but the sauce paired really well with the oysters. 

We also opted for the tuna tartare and clam chowder soup and enjoyed both of the dishes. 

The staff is very friendly and knowledgeable about the menu. Can't wait to come back to try more oysters!"}
{"text":"I love Rodney's. Quality seafood from knowledgeable servers. They know what they do and they do it well! Fantastic oysters perfectly shucked. A favourite place for my bf and I, Rodney's is a consistently delicious date night.

On our last visit, we outdid ourselves, and so did they! We didn't have a reservation on a Friday night and they are ALWAYS busy so we were taking our chances. We were able to sit at the bar which may not be as comfortable as the table but it is still a welcoming and perfectly fine spot to enjoy the full menu. Staff here is wonderful and welcoming. 

We started with a delicious pinot noir - only beer and wine here folks - they believe it pairs best with the oysters. I trust them! We had 24 oysters from the east and west coast, all very nice. This was just to whet our appetite as we moved on to appetizers. Sea scallops came beautifully presented on the half shell with a sweet and chili lightly dressed sauce. Scallops were perfectly cooked, I've never had them right from the shell before. Delicious! Our other appetizer was out of this world tuna tartare. I asked what kind of tuna and they went to the kitchen to ask for me - it was yellowfin - one of the least overfished and as safe as you get types of tuna - and man am I glad. Perfectly dressed tartare with nice sized pieces of beautiful pink tuna with just the right amount of avocado - I'm sensitive to how much avocado is in my tartare/ceviche! And it came served with these awesome crunchy puffed cracker/chip type things - perfect for scooping. Just amazing!

Then our mains....a market price dungeness crab and a lobster - both showed to us right from the tank and served with warm heavenly butter. Side of fries. The crab was so sweet and flaky and the lobster was tender and melt in your mouth.

We weren't done even then! A key lime almost cheesecake like pie with graham cracker crust and a chocolate mouse (on the house!) set our tastebuds over the edge. 

An absolute perfect meal.

Pricey? Yes. Worth it? 100%"}
{"text":"I finally found this place after biking up and down King Street for about 30 mins. It made me laugh at how difficult it was for me to find a place that, upon looking on their website gives the impression that it is fairly easy to find/locate..... I thought Rodney's was on the North side, it is actually on the South side, and given the fact that there is a ton of construction happening down in that area. Geeze, what a whirlwind. 

Bottom line, I FOUND it and it was nestled in this building that houses several other establishments... for someone that was there for the first time, it was a tad confusing...after attempting all other entrances only to find the WEST entrance is the true entry point into the lower level, that is Rodney's.  ANYWAYS enough about that, even though it's usually about the journey and not the destination. In this case, it was the other way around.

When I arrived, I wasn't sure if it was seat yourself or wait to be seated as I did not see any sort of sign there... there's a possibility I missed it, considering the mind space I was in... I walked in and a guy came to hand me the menu's. I was already going there specifically for the lobster club. I waited less than a minute for him to promptly take my order. Effective and immediate service, check.

I eat seafood but no RED meat, and since I do not regularly order club sandwiches, I was not in the know of it containing bacon as a compliment to the lobster. So, thankfully, after waiting what seemed longer, but was probably close to 10-15 minutes, I got my sandwich, opened it up before leaving and discovered that it contained the bacon that I can not eat. I had to wait another 10-15 mins for one that I could enjoy. And let me tell you... it was amaZing!!!!

I've had my lobster fill for a while, but I would definitely give it another go and recommend it to others. :) That chocolate mousse cake in their dessert section seems like it would be a good fit, for a chocolate addict such as myself."}
{"text":"The staff have insightful oyster knowledge and able to tell the oyster's region based on the shell alone. They also are able to explain each region's texture and flavour and provide you great choices based on your preference.

We also ordered a New England Clam which was really filling with great taste. It's creamy...but the rich taste doesn't overextend to a point where you get full, instead, it makes you want more.

For main, we ordered Branzino and Pasta with Scallops. Both dishes were amazing! Branzino impressed me the most because the skin was very crispy with rich flavour, while the meat still retain juice. It made each bite extremely satisfying and wonder how they done it. Highly recommended dish! For the Pasta with Scallops, for any scallops lover, they cook it very well. Nice golden colour from the pan fried and not burnt. The pasta sauce was really good that went well with the scallop.

My only reason not giving a 5/5 is based on cost. Did I get my money's worth (which could also translate to, can I afford this often). And, if the price is high, would I recommend this experience to someone else with a budget and tell them they will get their money worth. Unfortunately, the place flirts with that line in my book, so I can only give it 4/5."}
{"text":"Freshest and widest selection of oysters in Toronto! They hire the best oyster shuckers around!

Awesome for a casual night out. And definitely sit at the bar.

I always get the same thing: 
(1) Selection of Raw Oysters
(2) Pan Fried Oysters
(3) New England Clam Chowder 

Such a simple meal, but gives me extraordinary satisfaction!"}
{"text":"The tuna tartar was fantastic.  Good oysters and seafood.  Very casual place.  We will be back."}
{"text":"Somewhat on the pricier side, but definitely worth coming to. I came here with some friends who live in the area that I was visiting from the States -- and I'm really glad we stopped there. They're regulars here and absolutely love it.

The oysters are fantastic. And I can't even convey how much I love that they've created a wine specifically to go with them. It just makes them that much better.

And I definitely recommend trying the Manhattan clam chowder (I'm always a New England fan, but trust me on this one). It's super thick and chunky -- not just a thin tomato broth."}
{"text":"We had such a great experience our first night in town that we went back two nights later. The food is perfect and simple. This isn't high end designer plate stuff. The oysters are fresh, the entires are huge. The lobster roll is fantastic. The service was excellent. They were fast, attentive, and kind"}
{"text":"Never been disappointed at Rodney's.  Such a cozy place to go on a Friday night for wine and oysters - the staff is very hipster and friendly, the oysters are amazing!  Also recommend the clam chowder, both the traditional Boston and the Manhattan are great."}
{"text":"My girlfriend and I came here for my birthday, so I could have some nice seafood and try an oyster for the first time. We were sat at the bar, where we were nearly ignored by our server.  We weren't spending very much money (she's vegan (and could only have the house salad) and I only wanted a couple oysters, a few glasses of wine, and an entree).  Our server seemed extremely annoyed, and spent very little time with us, even after I asked for some recommendations (which he rushed through). I ordered a lobster club, which was average at best. My girlfriend mentioned that it was my birthday to one of the workers (I assume the manager?) at some point, and after our meal I was brought a chocolate mousse by our server with a birthday candle in it, which was unrequested, but appreciated.  I was finally beginning to forgive for the lack of service, until my waiter brought me the bill with a $7 charge for chocolate mousse that I did not order or even want, and that I thought was a gift from the restaurant.  I am a 20 year old student, I don't have a lot of money, but I was looking forward to a nice meal, and I expect to be treated the same way as wealthy customers paying more money.  I spent $70 (which was more than I intended to after I was surprised with the charge for my \"birthday dessert from the restaurant\") and was treated like my business and money was second class and undesirable. We did nothing to deserve our lack of service last night, as we were sat quietly at the end of the bar, being very respectful.  Thank you for accommodating the worst birthday dinner of my entire life.
- i sent this also to the restaurant, and I recieved this e-mail back FROM RODNEY HIMSELF

Without prejudice and with my limited knowledge.
Rodney himself here and I am sorry about the birthday(moose), a wonderful chocolate treat but should have never seen a charge. That I can administer, if you share a snail mail address with my desk!
I also would apologize to your girlfriend, how exciting to choose an Oyster House to celebrate a 20th Birthday.
We have done more for vegans, than we have for carnivores, so in saying that.... one has to note... to ask, if next time or whenever you two go out,  a little stronger.
When I went to the Saturday Night Crew, The Bar Floater, The Crew Chief, and The Night FOH(front of house), I presented your position/situation in the Oyster House and they all went \"OH, The-Two-Girls-in-Pink at The-End-Of-The-Bar!\" in a very respective manner of fun and social intercourse mannerisms. They felt you two had a good time! 
Rodney's looks after 1500 people per week and the surge comes at the back end of the week. 
Rodney's is not a club, we are an Oyster House and that means you participate with the Oysters as much as The Crew does with the customers(yes, paying, I know, entitlement!). You are not part of a show, you have to make some of your own fun.
The Lobster Club is a generous offering on fresh ACE bakery bread and holds almost 1/2 a fresh cull lobster, freshly cooked and prepared for each order. I am insulted that you would refer to it as average, but at twenty years old, unless you are a daughter of Eddie Arsenault from Howard's Cove, PEI, and were brought up on Lobster, you are naive about lobster and I would spend some time with you on these point, and The Howard's Cove area, if so be. 
It is a top seller, with absolutely no complaints  save for, \"I can not eat it all, can you put it in a carry away, I'm sorry but I'll enjoy the other half tomorrow at lunch!\".
30 years of saying a warm hello, \"How can we help you?\" and I get this note presented! I noticed your young age and the journey of life is unfolding in front of us all on this occasion.
Your choice of words reflects some immaturity that will improve with life's journey and your ongoing education, of school, food, and knowing.
Hey, you are young, smart and you felt you were not looked after.
There might be a personality issue, something that was on your side of the fence, or some form of something I certainly am not getting, or getting into.
Hey, I've been doing this for 30 years Carmen, same place, same way... we are going to misfire on a variable, and I think it is you and your visit, sorry young lady!
But I want to make sure the financial variables(short sheeting) in the ROH moments, are looked after and plus I do have a gifting for you and your girlfriend..... so please, a snail mail address!
I don't mean to be offensive, but enlightening, at least not as offensive as you are to me, Rodney, personally.
But this is why I am sending out a note, again without prejudice!

May it all appear and be different next time.
Your Most Loyal Urban Oysterman,
Rodney

Rodney told me that everything about his establishment is perfect, and I am immature, uncultured, and I have a personality problem that did not allow me to have a good time. I will never be returning."}
{"text":"This is a great place for oysters!  It feels a bit of a party place - nothing wrong with that, but just to set the ambience.  Doesn't hurt that it's on King Street West in the middle of the \"Entertainment\" district.  The guys behind the counter clearly know what they are doing but also know how to manipulate and upsell, which is their job.

I sat at the bar and ordered a dozen that were selected for me - a bit of a slippery slope, since many of the oysters are more than $3 a pop, and that bill can grow quickly.  Not that they aren't some of the best that I've had, particularly, the four (@ $3.99 each) French Tsarskaya being completely amazing, but still.  I followed that with a bowl of Oyster slap jack, which despite my server's assurances that it would be the right amount after a dozen oysters, I found myself wishing I had ordered a smaller portion, especially after my 2nd Okanagan Pale Ale.  

I had some great converstaion with my adjacent bar mates and we talked at length, maybe over an hour.  Overall, this was very fun, but as my food was highly limited in breadth, I would need to go back to experience other food (& take a much bigger wallet with me!)"}
{"text":"This is most likely the best oyster house you'll find in Toronto, it probably has the best selection and the freshest quality.

Don't get fooled by the relaxed environment because you will end up spending big bucks here. The server is not going to take your jacket or fold your napkin, so the service is not your typical four yelp dollar sign. Food wise, it definitely lives up to the hype. 

Besides their oysters, I also recommend their in house ceaser (you can adjust how spicy you want it), and the scallop pasta!"}
{"text":"The servers are welcoming and knowledgeable about the food. And the food...it truly does not get better than this! I highly recommend the lobster club - it has 3/4 lb of lobster meat topped with bacon! The fried oysters and oyster slap jack (a chowder) are great starters.
On a side note, don't eat too many raw oysters unless you are used to them. For beginners, just 1-2.
Also, get reservations and get them early! Our concierge at the Hilton was very helpful in making them for us, and it was not too far of a walk from the hotel."}
{"text":"Food - fresh, tasty, generous portions, incredible oysters. I recommend kusshi oysters! 

Service - very attentive and helpful. Explained sauces, oysters and menu thoroughly.

Atmosphere - visited around 12pm for lunch, so would say it was quiet and peaceful. Heard it can get quite busy for dinner though. 

Overall 8/10!"}
{"text":"Really fresh and great food. Service. Is 5 stars. The only reason I didn't give it a 5 star in Yelp was because of the limited liquor menu. I think the should up there game on the cocktail list. Then it's a 5. The salmon smoke jerkin wasn't that good. But everything else was great. The oysters where 5 star. Amazing. Will go back again."}
{"text":"food is great but overpriced!!!

the scallops were good but nothing amazing....I have one entrée one app and two beers and it was $80!! quite expensive..i also did find that the waiter was little annoyed that I did not order enough especially since most people spend over $200 on oysters"}
{"text":"Came here for oysters but decided to try their pasta. Their pasta is really good. We ordered the seafood pasta and it was creamy and there was a good portion of seafood on top. The scallops and shrimps were large and fresh. 
They offer a huge variety of oysters both east and west coast. We usually get oysters from the east coast. They were very fresh and salt."}
{"text":"They have freshly cut horseradish which was really nice. A good selection of oysters, but not too many from west coast."}
{"text":"Charming, cozy atmosphere on a cold Toronto evening with delicious oysters, succulent lobster and wonderful branzino."}
{"text":"The place wasn't as loud as the place in Vancouver, which is quite nice. Staff were friendly and oysters were fresh. But their scallop pasta wasn't fully cooked and it was kind of plain...I think I should order the lobster club instead the next time."}
{"text":"Best Oysters in Toronto
We had 2 dozens of assorted oysters all was so fresh and tasty - straight from the ocean
the clam chowder is good also
the place looks very nice that really take you inside to fisherman's journey"}
{"text":"Solid and dependable oyster house. The food is always consistent, fresh, and well-executed. Has all the classics you'd expect from baked oysters to chowders, lobster rolls and everything in between. I find that most of the food here isn't iconic, but it's better than average and the prices are fair. Definitely one of my preferred casual spots in the city."}
{"text":"If you like oysters, a stop at Rodney's is a must! They had over a dozen to try when I went. I sampled a large variety including Lameque Verte (NB), Totten Virginica (WA), Glidden Point (ME), Island Creek Shell (MA), Oak Island (NS), Onset Bay (MA) and Kumamoto (WA). 

My favorites were the Totten and Island Creek. The Totten were medium-sized, medium salinity, plump with a an almost buttery finish. Island Creek were similar minus the buttery finish and a little more salty. Lameque was pretty safe being medium-sized and not salty. On the other end, the Kumamoto were small and very salty.

Other tasty dishes that I got to try were the New England Clam Chowder, Jerk Shrimp and Nice Fundy Scallops. Everything tasted great and was cooked perfectly.

Service was very friendly. Really liked the restaurant decor too. Will definitely be going back."}
{"text":"Certainly the oysters are very good.  And I love the chowders. A nice touch is having Alpine beer.  But they don't serve a true Lobster Roll.  Okay, the bun is pretty good and there's a decent amount of lobster.  But bacon?  There were two strips of bacon underneath the lobster.  We're not talking a club sandwich; the menu said \"Lobster Roll\".  And it came with mediocre doughy onion rings.  Again, never seen that before.  No potato chips?  No cole slaw?  For the price I can get two appetizer-sized lobster rolls at the Chase Fish & Oyster.  Or I can go to Smoked & Cracked for a lobster roll with integrity."}
{"text":"Good place for oysters. I don't recommend anything else. I didn't like the lobster sandwich. I ordered 4 dozen of oysters, clams, lobster sandwich and calamari.  

The service was good in general. I would definitely come back here for some oysters next time I'm down on King."}
{"text":"Were my oysters fabulous? Yes. Was my wallet happy. Unfortunately, no.

I came to Rodneys with a friend after work one night. Though it was busy we only had to wait at the bar for about 15 minutes before table became free. Good thing we weren't staying at the bar, because the service was...well let's say subpar. We didn't even get water in the time we were waiting, And when we asked questions about the menu after we found that we are moving to table, the bartender told us they have to ask our servers.

Fortunately, them service greatly improved when we were seated. Our server was so friendly and informative, and selected oysters he thought we would like based on what we said our tastes were. While it was really busy, he did make an effort to stop by regularly to check in with us. While he originally forgot to bring the sauces, upon reminding him he also brought us a free glass of wine each. Definitely made up for the mistake!

So, our oysters were amazing and the chocolate mousse we had for dessert was great too. The only downside of this meal was the price. I know that oysters aren't cheap, but compared to my experiences at other oyster bars in the city, this one was up there in price. I hate to say it, but because of that I'm not sure I'll be back."}
{"text":"It was my first time here after hearing all my friends tell me I should have come a while ago. I was here to try out their oysters when me and a friend of mine found that we were really hungry. So we ordered a dish that wasn't called fish and chips but it's the same thing.

We kindly asked one of the servers for their pick of oysters from the east coast which made it easier on us because they had so many choices!! 
My favorite oyster was the \"prince \" I believe from PEI. So fresh!!! And they give you so many different sauces it was amazing! From vinaigrette to mild sauce to very spicy to just plain awesome Tabasco! 

The fish and chips were amazing! The fish itself tasted so fresh and no tartar sauce was even needed to devour this dish. The fish was huge in size and it came with potato wedges and a cabbage, cilantro salad. 

Would definitely definitely come again!!"}
{"text":"Came here with the family so my mom could try oysters for the first time; we all loved it.  Our waiter made fabulous recommendations and we tried about 6 different kinds, from different coasts and prepared differently and none of them disappointed.  A nice restaurant with a laid back atmosphere and friendly staff.  Thank you for a wonderful experience!"}
{"text":"Great place for fresh oysters (good selection of fresh oysters from B.C and PE.I) service is great and the atmosphere is warm and casual. Moderate selection of beers but they do have a great wine and champagne list. Location at King and Spadina is fantastic. Love the selection of sauces they have too (from mild to smokey, to super hot and spicy)  Thing they could improve on...Hire another 'shucker', it can take a while to get your oysters when they are busy, add some more craft beers, and change up the bread (maybe bring in some flat, or cornbreads) Overall though a solid 4 star oyster bar!"}
{"text":"For the food, service and atmosphere this place always ranks 5 stars with me. Although we usually run up quite a bill it's worth it for the energy that Rodney's conveys. 
Sit at the oyster bar and ask questions. The servers love to chat and tell you about the oysters and what you can pair with them. Most of all relax and enjoy those delicious oysters!"}
{"text":"Don't really know my way around oysters and the waiter was really helpful. and i didn't end up spending as much as I thought i would.  . .. . .good spot."}
{"text":"Had been here many times before.  After some years, I'm back again last night.  There is a chill vibe here.  It's more like my friend talking to me than customer service for the table.  I like how casual but helpful they are.

Seafood is phenomenal here!  I especially like the west cost Fat bastard oysters and u 10 scallops dish!  So good!  Fat bastard is just as it's named, fat and meaty.  U 10 scallops are huge and never frozen! 

This is not a buck a shuck place, you can tell from the photos of oysters. If you are looking for quality, this is the place! 

The special house made oyster sauce are still the same several kind, I hope they will keep it the way they are as the sauce tray is a signature here. 

It's a bit expensive, but all worth it for a happy dining experience with great seafood."}
{"text":"Great restaurant, the oysters were awesome, Mike our waiter was very helpful, nice and friendly. Coming from St. Louis Mo USA , the oysters and service was the best."}
{"text":"Since I'm from Vancouver,  I had to go to the Rodney's in Toronto to get my oyster fix. There's 2 locations in Vancouver and they're amazing so this is a must. Toronto's Rodney's oysters didn't disappoint and they were mostly from the East Coast. They were all really fresh but occasionally they weren't shucked well so there would be sand - all good, majority were amazing considering it's Toronto. 

Besides oysters, they also have hot dishes so I got the clam chowder, crab cakes and seafood stew. Loved everything but seafood stew was slightly less satisfying than the other options."}
{"text":"3.7

As a birthday gift I came here with a friend and treated her to dinner. It was almost empty when we went, so we decided to sit at the bar where all the action was goin' on. 

Order: Dozen oysters (The servers selection) + 2lb Dungeness Crab

Coming from different parts of the world such as New Zealand, New Brunswick, and P.E.I, I liked the N.Z and PEI's the best. They all had a lovely natural sweet and fresh oyster flavour. Placed infront of us were almost 6 differnet kinds of sauces, I did not want to overpower the natural flavour so I only tried two or three. That being said, I like the oysters at its' most natural with a small squeeze of fresh lemon juice!

That crab.....y'know even if I describe it as \"the best and most freshest crab\" ever, you really have to try it yourself. It was steamed to perfection and the juices of the natural flavour were just intensified. It was amazing, really. 

My server behind the bar was a bit intimidating... 'cause we took so long to order and I absolutely hate people who just stand there and don't give you any privacy. It makes you feel like you need to hurry up. It's probably because we were just teens and he thought we didn't have money. Hate that. But moving along...

T'was was pricey, indeed. Came to about $120 (including tax + tip) and were weren't full, but we were just right. Still, since it's my friend's birthday it was well worth it! I suggest this place for a nice special occasion or just a good seafood dinner.

PS: my friend got diarreah later so idk.... you be the judge of that. (I personally didn't get it)"}
{"text":"Came here really late (10:30pm?) on a Friday night. 

We had to wait a bit to get a table but not too long. Place was still busy serving people even late into the night.

The oyster menu was quite extensive but unfortunately, given the late time, they seemed to be sold out of quite a few of the choices from the list. 

Nonetheless, the oysters were all awesome upon arrival. I really dig the giant plate of hot sauces that are set on each table. Lots of choices. 

I also tried a special soup of the day, a white bean Tuscan soup with shrimp, which was really tasty. We didn't have a full meal as we had already eaten earlier.

Service was good, although we seemed to have several different servers, but this was perhaps because it was the end of the night and staff was going home. 

Must go back for crab and lobster."}
{"text":"Well - regretfully - I am dishing out a 1 star rating.

A longtime Torontonian friend who was returning for a visit really had a craving to go here.  Meanwhile, I don't even eat oysters.

The food was just fine ... but the service on a slow afternoon (literally 6-8 people in the whole restaurant), these 3 front of house staff couldn't get it right.  And they really didn't give a sh#t either.  I can't even remember the last time I left a $0 tip - that's right - a big ol donut ---- but I just couldn't stomach giving these guys a single cent.  It was that bad.

I guess that explains why it was so slow.  Poor Rodney's.  At least they're popular with the people who \"used to go there\" back in the day and return to remember the good ol days.  But boooooooooooooooooooooooooooooooo!"}
{"text":"The service is respectable, the food is average but the prices seem a bit high. A bowl of soup is $15 and a cup $10. They charge a hefty 20% gratuity for groups. They do not have a bartender so you are limited to beer, wine and Caesar presumably out of a bottle. The ambience is not the best. Coupled with pricey parking for $15-$20 (if you can't find street parking) since it is a bit far from the subway especially on a colder day, I would look for something classier and better value for money."}
{"text":"Such a gem! We got seated pretty much right away without reservations. Service was amazing and food delicious!!!! Price wasn't bad either. Bill came out to be about $212 with tips for 4.  Will return if we visit Toronto again."}
{"text":"I loved this place!!!.. All the seafood is very very FRESH!!.. At the entrance of the restaurant you can see everything alive, so you know it is really fresh!!... The oysters were incredible delicious and the mussels too.. But for me, the best thing there is the scallops pasta!!.. It is AWESOME!!.. If I go back there that will definitely be my choice!!.. 

In addition, the place is cool, and the service is good. Also, they have good wines too..

Definitely 5 solid stars!!

Tip: make reservations!!.. As this place is sooooooo good it is hard to find a table without reservations.."}
{"text":"I left without eating.  We dropped into Rodney's on the way to a show after studying their reviews.  On the way in, we passed the fenced in outdoor seating area, which seemed lively.  Upon entering we were greeted by the hostess and asked if we would prefer outdoor or indoor seating.  We expressed a preference for outdoor, because it was a warm, sunny afternoon.  We were advised that a table should be opening in a few minutes, and sat in the chairs in front of the hostess station.  A couple who arrived just after us sat to our right in the waiting area.

Within minutes, a young woman strolls in off the street and asks the hostess if she can sit on the patio, and the waitress says no problem and waves her on.  Then the couple to our right is escorted to the patio.  Without being asked, the waitress volunteers that they arrived after us but had a reservation, and it should only be a few more minutes.  

This is where  things started to get weird.  We were moved from in front of the hostess station to an indoor table by the kitchen.   When we are brought water, a bread basket and menus, I politely inform the host (a guy with a moustache and knitted skull cap) that we're waiting on an outdoor table.  The host then walks away and returns within seconds to inform us that there won't be any seating available for quite some time.  He then proceeds to aggressively hover, not providing us the basic courtesy of 2 minutes to decide whether to say, particularly as we had already had 15 minutes of our time wasted.  

I'm not sure why these folks were being so dodgy.  If there wasn't any outdoor seating, it should have been disclosed from the start.  No one wants to spend money in an established where they're made to feel uncomfortable."}
{"text":"A party of three had clam chower, lobster, crab and 18 different oysters. While the service was subpar the food made up for any lack of attention. Great simply served lobster and crab with butter warmers.

The Loch Ryan flat oyster from Scotland was great so were the Black pearl from BC. The different sauces were a good touch.

I would return for oysters for sure.

 Bill came to $227 plus tax and tip!
The 2.5 pound crab was $70 holy moly!"}
{"text":"I wont dive into a lengthy tribute to rodneys oysters, as you can very well read below, the oysters and seafood here are fantastic. Today I am paying tribute to a lonely sandwich that truly deserves tribute, Rodneys lobster club. ive never before had such a fantastic club sandwich and most likely wont ever again until i return.

Place has great seafood and wow what a sandwich, but what kind of seafood restaurant doesnt offer a nice bloody ceasar along with my oyster, they have 0 booze ( no vodka, no gin, no tequilla, no nothing) which essentially takes away from the experience."}
{"text":"If you're only craving oysters, Rodney oyster has an extensive list of oysters outside of the usual Malpaque or Kushi found in all other restaurants. The rest of the menu was quite dissapointing.. Nothing out of the extrodinary.. your usually boiled crab and lobster for a hefty $35/pound!! I

 wouldn't say this is the best seafood in Toronto. I guess living in the middle of the whole contanent, you can't expect Toronto seafood to sweep you off your feet. 

P.S. Take a close look at the pictures in the bathroom."}
{"text":"Rodney's Oyster House is THE PLACE to take my Yelp Drinking Buddy who never eaten oyster before in his life?!!

How can someone never eat oyster before?? Does he knows what he is missing??

The waiter was really excited when he find out that we have an oyster virgin in the house.. and I ended up letting him pick the selections of oysters that would have give my YDB a more unique experience. 

YDB has a great time and I think he is ready for the next step of eating dozens of oyster and drinking all the beers and hang out as my oyster eating/drinking buddy!"}
{"text":"There are so many different kinds of fresh oysters to choose from Rodney's we didnt know which ones to choose from! Very gladly we had our server who explained the different types of oysters (taste and texture wise). We enjoyed our oysters.

My seafood shrimp pasta was served fresh and hot. I definitely enjoyed the pairing with white wine and the pleasant atmosphere."}
{"text":"Great service (sit at the bar and ask for James), great seafood, great scotch (its the only liquor they serve for some reason but thats fine with me), and great mens room (somehow both tasteful and tasteless.)  Definitely check this place out if your north of the border."}
{"text":"Best oysters I've had in my life. Been all over, NYC, Paris, blah blah it doesn't matter. The selection and professionalism of the staff here is tops. 
The staff is incredibly into what they do, they know what they're talking about, and they'll talk to you about it. Friendly, welcoming, easygoing atmosphere. 
You can't beat this place."}
{"text":"I had my engagement party here last weekend, and it was AMAZING. I found them through an event planning site. Rodneys (Julius Chapple) contacted me right away and asked detailed questions about what I wanted our of my engagement party, our personalities, food and alcohol preference and then sent over a great spreadsheet with all costs broken down. There were absolutely no surprises at the end.
They gave us the Cuddy room, which is a great little room for private parties. Service was amazing, food was great. They had set out some cold appetizers (veg crepes and smoked salmon along with oysters) and then had hot food passed around (crab cakes, shrimp dumplings, beef skewers). 
We were very well taken care of throughout the night and it was just the perfect choice for a private party.
I would definetly go to them again for other celebrations. Thank you Julius for working with me and making sure my event was memorable!"}
{"text":"The food here is amazing! I went on a Friday night. The oysters we ordered were fresh and the scallops were delicious. However, the calamari was mediocre. Our server was very friendly and conversational. He was attentive and made great recommendations. The only thing that I found a bit odd was that we were told by the hostess that we would have to wait 20 minutes to be seated. The restaurant was not busy and did not get busy either as the night continued. So I don't understand why we were told that. Also, the hostess ignored us and did not say good bye when we were leaving until my friend said good bye to her. Other then that the overall experience was great! And I would like to come back again."}
{"text":"This place is another of my go to oyster place. But Rodney is always full and always busy so service is pretty slow. It is also really hard to get a table during busy hours. There's always a wait. Unless you go after hours. 

Service is more consist and nice compared to oyster boys even though they have a similar style. The waiters are more attentive and the service is consistent throughout all my visits. They are friendly and conversational. 

Oyster here are a hit or a miss. Sometimes it's really fresh but sometimes it's not so fresh. It could be due to the reason that restaurant being extremely busy and the quality is difficult to maintain all the time. I've encountered it two times. I almost ate a dead oyster. The oyster smelt really bad once you pick it up. They probably missed it. I expected them to inspect them before serving but i guess it was due to that fact that it was closing soon and were in a rush. 

I usually order oysters but i've order off the menu before. I order the creamy seafood pasta here and I was surprised. It is one of the best seafood pastas i've had. It was creamy and flavorful. All the seafood in the pasta was really fresh. 

Overall decent place. I would give it a 4 stars if you go at the right time. But if you are at the restaurant at the wrong time I would only give it a 3.5 stars. Service is always good though. 

TIPP!!!!!! 
Do not order take out. If you want oyster, make sure you don't order take out. I've learned it the hard way. I've ordered a few dozens of shucked oyster to go and the oysters were so bad. They were not fresh and tasted like nothing by the time I got home. I remember the sorrow of eating it because it costed money but it tasted like nothing. It's just like eating something that's a little chewy. 

I've also ordered the pasta to go through the phone and the employees messed up my order. I've ordered the creamy seafood pasta to got and i ended up getting some tomato pasta.. after reheating it doesn't taste fresh at all. It was bad."}
{"text":"Bottom line: decent food. 

Last dinner in Toronto of course I had to choose a seafood place. To start, we got the chowder and 8 oysters. You can definitely taste the freshness in the food and that's always a good sign. We also got a bottle of white - Rodney's oyster sea legs 2013. It complemented the seafood pretty well - crisp but not the smoothest. Though it was pretty cheap for a bottle. 

One thing I love about this place is that you get to order half portions. I wish more places would have these options so I can try a little bit of everything. Greedy me hehe. We got the half crispy calamari, pasta with scallops, and steamed mussels. Everything was on point in terms of taste and quality. Service was nice. My tummy was very satisfied and I would definitely come back!!"}
{"text":"I had a really great experience here, from beginning to end. The hostess was pleasant, the waiter was attentive and the food was amazing. 
First we order a bottle of Château du Coing Muscadet, which is the wine you would typically pair with oysters. 
We asked our waiter just to choose oysters for us, which were all fantastic but much preferred the oysters that were from Eastern Canada. Which we got a second round of oysters that were from the region.
We also order the calamari (a main dish), which was delicious but kind of over priced in my opinion and got the deep fried oysters as well. Our bill came to around $180 for two people before tip."}
{"text":"I took a trip up to Toronto to visit my boyfriend while he was there on business, and dug around online to find seafood places near our hotel b/c I had a craving for lobster. From a handful of reviews and reports on a more moderate price range (I was considering some fine dining places as well), we decided to give Rodney's a shot.

The restaurant is on the casual side, like a casual crab shack feel, which we appreciated since we were in jeans, but there were a number of groups there dressed in business or going-out attire enjoying a meal. The place was very open and  had a very warm and relaxed feel to it, and the waiters and waitresses were all very friendly. Service in general was great. My boyfriend called ahead of time to make sure they would have a table for us, and we were seated immediately.

My boyfriend had the corn chowder to start, which was hearty though not particularly flavorful, but that would be my only complaint on the food. The selection of fresh oysters is impressive, and I was enamored with how tasty their kumamotos were. They also gave us a selection of sauces to have with our oysters, which was a nice treat. We ordered their crab soup, which was spicy and delicious, and was somewhat reminiscent of roux-based Cajun dishes, which my boyfriend and I love. (We're both originally from Louisiana.) I had the chocolate mousse for dessert, which was light and fluffy.

Since we arrived fairly late for dinner, when I asked for a 2lb lobster, the waitress brought over a 1.5lber and apologized b/c the next biggest she had was a 2.75lber. We decided to go for broke and get the bigger one, which she brought over for our approval before sending it to the kitchen to be cooked. I know it's difficult to wrong with lobster, and I've consumed a lot of lobster in my time, but I have to say, this was by far one of the best lobsters I've had. Ever.

All in all, it was a great stumble-upon during my weekend trip, and worth every penny. I highly recommend this restaurant to anyone with a hankering for some good lobster, oysters or seafood in general."}
{"text":"Rodney's passes the test of authenticity that very few restaurants even attempt.  Their raw oysters are a cut above even the top tier oyster bars.  I love their unique collection of sweet & spicy sauces.  I truly love cocktail sauce, but Rodney's unique combo of fresh horseradish, and sauces allows for a better sampling of their oyster collection.  Being from Maryland, I rarely enjoy a tomato based spicy blue crab soup that is served in a location North of the Mason-Dixon Line, and not blessed by the Virgin Mary!  Now for a main dish, I love the Maine steamed lobster cooked to perfection to a standard that even Emeril Lagasse would praise.  I also love the scallops.  You have to leave room for dessert here--my fave is the Lime Pie less the Florida Key Lime.  It is a fantastic dessert bordering on a classic designation.  As much as I love the food at Rodney's, I equally love the authentic nautical atmosphere, and the friendly people of Toronto staffing the restaurant.  I love seeing the Asian families,  Canadians, and the multicultural atmosphere.  In an age where even the best restaurants have fallen into the trap of creating cookie cutter institutions catering to the Yelp Generation, Rodney's is a truly authentic seafood haunt.  Now that is something you cannot convey on social media.  I am counting the days to my next Toronto visit!"}
{"text":"What is up with this place? What's the hype!? 

I honestly don't get it. 

What is so nice about this place?!?! it's just dungy, basement place where they charge you $70 for BOILED crab which I can do at home. 

What's the big deal? 

Oysters? Oysters were OK- nothing special... 

I actually went to Rodney's becaue I saw the raving rates @ yelp. 

You screwed me over. You lied to me."}
{"text":"OMG our meal at Rodney was AAAmazing.  Our server Sean gave great recommendations and went out if his way to make sure we ordered the right amount of food and getting the freshest sea food of the day.  We definitely had the best meal in Toronto at Rodney's.  Wonderful service and top quality seafood.  Scallops on the half shells was sweet and tender.  The 2 dozen oysters we devour was creamy and tasted like the sea in the best way possible.  We left it up to Sean with the oyster selection and he did not let us down.  The callaloo soup was such a treat. Every spoon had crab meat in it and it came with 2 jumbo shrimp.  The soft shell clams (something I never tried) was also a nice surprise.  Pretty much everything we had was fantastic.  If you're craving seafood this is the place to go.  Thank you Ashly from Barchef for recommending this restaurant for our last meal in Toronto."}
{"text":"My favorite place in Toronto. I take all out of town guest here. It's best to have the servers pick out a selection for you. They know best"}
{"text":"The oyster's here are the freshest I've had in Toronto.  They have a great selection from around the world and each one has a unique taste that they will explain to you when your order.  Although the prices aren't that low, you do get quality.  They have a really cool bar area."}
{"text":"it's been a while since coming here and was so excited to come back!
We ordered 4 varieties of oysters but our favourite of the night was the island creek. They didn't have any fresh clams or scallops which was very disappointing. We also ordered new england chowder, soup of the day (kind of like a gumbo), steamed mussels, and soft shell steamer clams. Service started off great then went downhill a bit. Our server dropped a few mussels on her way to our table and someone at my table did mention about wanting a fresh plate but our server definitely was unapologetic and had no intention of bringing us a new one. i don't think it was a big deal but her reaction to our comment and change in attitude definitely ruined our dining experience a tad (awkward). However, oysters were great, chowder and mussels were good and i still enjoyed my dinner."}
{"text":"Okay so here's the update.... Rodney is no longer the owner and this place has officially gone down hill. The service is slow and the server was not aware of the patrons. They have people who don't know how to shuck oysters shucking them... they get your oyster order incorrect even when it's a simple one.... just to name a few things I experienced today. 
When you have a bill that's going to be more than a few hundred dollars you're gonna expect a bit more. 

I was not the only one who had this experience. For example,  the people who were at the table next to mine had be sitting there for 45min. waiting for oysters- they only ordered 12.

I also noticed a group of 4 or 5 had left just as my party and I came in and the table didn't get cleaned till another hour went by. And it's not like the place was busy by any means.. there were 18 people in the whole restaurant (yes, I counted). 

Clearly the ball has been dropped and it's actually not worth it to go here till it gets rolling again."}
{"text":"Decided to check out Rodney's with my boyfriend before committing to buying tickets for the Oyster Fest. Started off with a Caesar which had a huge shrimp in it, it was delicious! 
They have a wide variety of oysters, we had no idea what to choose so the waiter prepared a selection of 6, which was great. They have a lot of sauces and condiments to add but everything's really fresh so you could do with only lemon. 
We also shared a bowl of clam chowder (very good!) and one of their specials of the day which was a lot of fried goodness... shrimp, calamari, fish and 3 huge scallops grilled to perfection.
Their patio/garden is wonderful, but I think next time we'll try sitting at the bar, there was a very cool vibe there, plus there's lots of space.
Even though the patio was busy, the staff was very friendly and attentive. 
We paid $86 for two drinks, two starters and one entree, and the portions were more than reasonable. Oh and they serve bread and butter, that's always a plus!"}
{"text":"Great vibe, great food great company. The restaurant was quite crowded when we went. We conversed at the bar while waiting for the table where I drank a Steamwhistle beer. Yummy. We had a little bit of everything. I enjoyed the interior of the restaurant the most. A rustic, comfortable, homey feel. Bathrooms were clean and presentable. I really have no complaints about this place. Would definitely visit again."}
{"text":"Came here for a fancy dinner. It was part of a stay-cation of sorts, which included staying at a hotel and coming to a Lonely Planet recommended establishment.

We went all out, we had a bottle of Cava, 12 Oysters (of their choosing), and we each got a lobster. All of it was lovely, especially some BC oysters that were huge and we'd never heard of before. The only thing I didn't like is that the lobster just came with a bowl of potato wedges. Seemed a bit of a random side choice, and we weren't given any options.

The atmosphere is lovely, like an adult playground. It's sort of saloon-meets-dockyard, so it's casual enough that you feel you can get a bit rowdy, but the food itself is first class delicious. 

Our bill was a bit pricey, but hey, we ordered lobster and sparkling wine, I think if you just stick to oysters and cocktails your wallet will thank you.

I have a real desire to go back here right now. They might be gonna get the 5 star boost!"}
{"text":"I had the worst customer service experience....will never go back! First of all they don't serve mix drinks....are you for real?! Second of all, our waitress was terrible. She gave us our menus and than didn't show up until we flagged her down! Now I can understand if the place is busy but there were a total of 6 families there. She kept following another waiter around and flirting with him. Every time we flagged her down, she gave us attitude. And all the food was cold...which I'm guessing was due to her to busy flirting to actually delivery the food."}
{"text":"Not only was the food tasty and fresh but our delightful server made this a fun time at Rodney's. We sampled around the menu having a wonderful bowl of crab soup Canadian style (I'm a Marylander and we have some great crab soup in our restaurants). it was a bit spicy but not enough to hide the taste of the nice pieces of crab meat floating in the broth. Then we shared an excellent shrimp cocktail with some okay cocktail sauce. The shrimp were large and steamed just right maintaining a perfect texture. I had a side salad that was fresh and so attractively prepared that I did not want to destroy the artistic design on the plate. And the house dressing was a lemon flavor which brought out the taste of the greens. Soon after we finished those appetizers. our server greeted us with our two 1.5 pound lobsters that had been steamed (and no water poured out on our plates) and cut so we could eat the meat without hammering and digging into the shells. Along with the yummy lobsters, we had the French fries and they were grease free and perfectly fried. If you want to see where we ate - check out the How to Eat a Lobster video at http://rodneysoysterhouse.com/toronto/videos/

This meal was all about the preparation of the seafood. Not only was the seafood fresh but the kitchen staff knows how to cook the shrimp and the lobster to the right texture. This is not always so as I have chewed my way through many a shrimp cocktail and steamed lobster. We had a little space for dessert and ordered a rice pudding. It was definitely homemade and not too sweet. However, it needed some cinnamon to help with the taste as it was a bit bland. Our wonderful server who told us she has worked for Rodney for 24 years, brought out the cinnamon shaker for us to use.

If you have read some of my other reviews you know how I complain about the plastic bag bread that is served in many restaurants. Not Rodney's as they served us a small basket of delicious whole grain bread topped with delicious rye. In order to save myself some calories, I pulled off the crust, ate it, and left the interior of the bread behind. 

Also the restaurant makes some great brewed iced tea and stores it in the cold case in Mason jars. Our server opened the lid of the jar and poured the chilled amber colored liquid into our glasses for us to enjoy.

I checked out the restroom and found some interesting photos of naked men and other oddities of human behavior. My husband said there were photos of naked women in the men's room and also some other oddities as well. Obviously Rodney knows how to keep people happy at all times in his establishment even in the restrooms.

So Rodney's turned out to be a fine place to dine and a memorable experience as well. The prices are high but the food and the service were worth every Canadian dollar we spent that evening."}
{"text":"Not recommended.

Noisy, crowdy, packed place. If you try to drop in, only the bar would be available. I tried a couple of times, no luck.

Service is aggressive, though on a positive side. Those guys are the only reason I was potentially thinking to give Rodney's just one more try before dropping their rating to \"avoid\".

But - but! - the kitchen is bad. Not just \"lacking something\". No-no, plain and straight - unable to deliver what they are there for.

Plates looks like some professional chef back in time designed them, but nowadays the feat is expected to be repeated by a group of barely trained folks who are constantly in rush - and they fail predictably.

Piece of fish, burned on the sides and raw in the middle, sprayed with pepper like it's a Middle Eastern protester, deadly over-salted, smallish size, with pieces of spine in it - for almost thirty bucks? Gimme a break...

Maybe the trick is in oysters? Like, you can spoil every little piece of seafood, but oysters are just that - either fresh or not? So maybe the hardcore oysters' fans may like Rodney's, but than it is clearly not a seafood restaurant - just an \"oysters place\". Hopefully."}
{"text":"I've been taking friends here, it has the best vibe. I love seafood pubs.

I try to sit at the bar, you get service right away. The bartenders are very friendly and approachable. Amazing people to be around.

Aside from their fantastic list of oysters, they actually have a kitchen that makes food like:
- the Tuna Ceviche, which was really good. 
- smoked fish!

The Smoker's Platter $19 had about 3-4 pieces of each of their smoked fish (ex. Haida Indian Candy, Peppered Steelhead Trout). It was sooooo delicious.

Unfortunately the beer list (ales and lagers) is just okay."}
{"text":"Ok food was great no complaints however something serious could of happen would've ended up in the hospital. I had the special crab soup of the day and found a piece of sharp plastic that can cut. Imagine that through your intestines.  I had 30 assorted oyster pieces, pasta with scallops, lobster roll. And other of the dishes ordered was slap jack, new England clam, tuna tartar, steam mussels, lobster, creme brulee. Everything was great.  I have talked the waitress about it and the soup was waived from the bill."}
{"text":"Loveeeeeeee this place!!!! Fresh seafood of all kinds. Oysters, mussels, and boiled lobster are must-haves!

Decent, clean washrooms. Great service. Complimentary bread & butter.  Great overall. Prices are not bad either. I love the sauces. Never disappoints!"}
{"text":"Oysters oysters oysters!!! If you are craving oysters, Rodney's is the place to be. If you don't like oysters, this menu is likely not for you. When I come here it's usually for oysters and onion rings (not on their menu). I have tried their pastas, soups, and sandwiches, but find them to be mediocre. Last year they had soft shell crab, which was amazing, but have not seen it back on their menu since."}
{"text":"Had dinner here with the family today. Sat indoors and was seated promptly. Waitress was excellent today and dealt with all of our questions/last minute changes very well. The seafood was done exactly how it should be done. Lobster cooked perfect, oyster selection was great, crab was great (and very pricey). Baked oysters were awesome except one per person would've been smarter than the two per ordered."}
