{"text":"Best sea bass i had, it was so juicy and tender i almost came to tears. we also had a tuna appetizer and it was delicious as well. 

Oysters on the other side were 'meh', the waitress helped us to put together a platter, i mean they were fine but not like WOW, but i admit the sauces were amazing.

Cons: service was so slow and i had to walk up to pay and waited another like 20 min to get my card back!! and it was pretty expensive consider we didn't even have any drinks or dessert. 1 appetizer + 2 main + 5 oysters + tips = $100.

i heard there're other better oyster bars so maybe will only go back here for other food."}
{"text":"This place is adorable!
It is easy to get comfortable here because the staff are incredibly helpful and super friendly.  As well, the decor is east coast unassuming.  It's a good balance to the Bay Street Ego.
Not to mention, the oysters were fantastic!
Great for drinks and a snack!"}
{"text":"It was a let down.

The Oysters are okay.  But next time I want good oysters I will definitely go to Oyster Boy on Queen.  Why?  Service. 

Our server seemed mildly surprised when we said we wanted to order more that drinks.  When we asked about the oyster selection her response was vague and uninformed.  We pretty much ordered blind, half dozen was tasty, the other half dozen was unsatisfying for our taste.  A more informed server would have been able to guide us better.

Food took forever, and our server forgot we existed.  We would have ordered more oysters after the initial round, but we couldn't flag anybody down to take an order.  We just got bored looking at empty plates and realized we weren't hungry anymore.

We also ordered a lobster risotto, which was a tremendous rip off.  There were one or two tiny chunks of lobster and a whole bunch of chopped up shrimp.  Teeny tiny shrimp, the cheap kind.  If you you are going to call it lobster risotto, put some friggin' lobster in there.  

Finally, the price doesn't match the quality.  Won't be back.  Much better places for Oysters in town."}
{"text":"4 out of 5! Amazing oysters and service. Watch out for the hot sauce"}
{"text":"Customer Service at its Best. Recently I was going to the opera, and decided to have supper with a friend beforehand and made the necessary reservation and also left my business card with my e-mail address on it. Two days before the event I received an e-mail advising me that they had booked a rather large after-work drinks party for the same time as my reservation, It was suggested that this might not be the time or place for an intimate supper. However, as far a I was concerned this was not a problem, and we had a fine supper tucked around the corner at the bar and enjoyed being part of the Bay Street Boys crowd even just for an hour or so. Again Customer Service at its Best.......Thanks."}
{"text":"My friend is obsessed with Rodney's, and it's all my fault!  I introduced her to the place the last time she was in town, and now she insists on going every time she visits.  Usually we go to Rodney's Oyster House on King, but this time we decided to go to Rodney's by Bay because it was a bit more central to where we were.

As luck would have it, we showed up just in time to catch the end of their cheap app promotion.  I have to say, I think I have perfect timing when it comes to food - but as Uncle Ben once said, with great power comes great responsibility!  This is something I have to master, because we ended up ordering twice as much food as we initially intended.  Freshly shucked oysters, candied smoked salmon, mussels and clam chowder.  A feast fit for a king (perhaps Triton or Poseidon? *pardon my nerd moment)!

I'll skip over the oysters, because as always, they were amazing.  The candied salmon was a delicious combination of salty and sweet.  It also came with a small bed of greens and a blueberry compote.  I'm slowly starting to believe a fruit compote is the perfect compliment to almost anything!  The mussels were so flavourful, and the broth was amazing.  I made sure to scoop up all the bacon morsels before the bowl was taken away.  I only wished that it came with some bread so that the delicious liquid didn't go to waste. The clam chowder was incredibly hearty, and was filled with a good amount of potatoes, carrots and clams.  The soup broth was delicious, but I found the potatoes and carrots slightly bland.  It was a large serving and could have satisfied me if that was the only thing I ate.

Personally, I like the atmosphere of the location on King a bit better.  It has a more authentic (??) and fun feel to it.  And while the Bay location is not a stuffy joint by any means, it felt more like a restaurant that has oysters than being all about oysters.  That being said, both locations are great and reflect the area of Toronto that they are in, and it's really just up to personal preference.

Shuck on, friends!"}
{"text":"From oysters to tartare to poutine to scallops to cod, our table tried everything and was simply blown away by each and every bit.  Reasonable pricing and friendly service made this one of the best dining experiences in Toronto."}
{"text":"Cutest little place. I definitely prefer this location over their King location. They don't have the all the selection as their King location. But I like the intimate ambience."}
{"text":"Tucked away on Temperance, this place is easily missed. My advice... go find it!

I love the layout of this oyster bar/kitchen. Not over sized, great bar, good service. All in all a win in my books. I've been back a few times so that says something for a guy like me. 

I've been for their Halibut and Chips, which was a great sized yummy meal. My most recent visit was for a couple drinks with friends and a plate of their signature oysters. 

Probably a few more suits than not, again, given the location in the financial district this is much the standard. Not necessary of course, just don't walk in wearing your Sunday brunch sweats, you might gain a couple stares. 

Like it. I'll certainly be back again."}
{"text":"needed a fast lunch today and ordered the tuna. By far this was the tastiest tuna and display I have had in years"}
{"text":"This place is exactly what Bay Street needed.

Rodney's on King is good - but it feels a little like fishermans warf.  

The Bay Street location is classy, with great serving staff, and aweome menu and overall great dining experience.

I like to sit at the oyster bar as it is fun and social, but there are more private seats if you want to be left alone."}
{"text":"The atmosphere is wonderful and it serves the oysters to match.    its perfect for lunch or an afterwork snack."}
{"text":"Awesome, awesome, awesome! 
I just came from a delicious lunch at Rodney's By bay and I am so happy! I love the original Rodney's and now I love this place which is more convenient for lunch during the week.
The place is square shaped, with a square shaped bar with seats all around, and tables in the front and on the far side. We sat at the furthest table in the corner. Cool vibe, cool bar, and comfortable.
The food was delicious. We started with a dozen oysters, all up to par. Then we split a bunch of apps. The fries were great, the tuna tartare 3 ways was delicious, the calamari was perfect and the crab cakes were only ok. Oh! And the smoked salmon was melt in your mouth scrumptious.
I really like the vibe and the food here. Service was fine too. Very nice, not long waits fine.
One weird thing. There were a lot of older man/younger women couples here. Is that a common Friday lunch thing, or is it because of the oysters? Just an odd note. 
Good beers on tap, and they have half pints, which I always like.
The location is convenient, but it is on a off-the-beaten path street, with nothing else there. Go anyway."}
{"text":"Oysters selection and quality = excellent,, excellent, excellent!

Waiter was great. Very attentive, helpful."}
{"text":"The place were everybody knows your name.  Really nice ambiance and incredibly friendly staff. 

It's definitely more of a drinking environment that dining, but Rodney's executes its limited menu consistently well.  

The wild smoked salmon is my go to dish.  And of course, Oysters!"}
{"text":"This is my after work hang out spot. Best oysters in the city! Good looking bartenders and oyster shuckers. The tuna tartare is delicious. I could eat 5 servings. I love the side street location on Temperance. Great date spot. Lots of hot business men. Love it."}
{"text":"Great staff, they're wonderful! - knowledgeable and friendly,  Amazing oysters, love the Raspberry Point and Kumamotos.  Moules et Frites are good too.  Can get really noisy here, especially during lunch with the banker/lawyer crowd.  And you NEED a reservation.. the place is very small and you typically can't get a table at lunch without one."}
