{"text":"Great place.  Everything is great.  Fresh produce.  Store is clean.  Prepared foods are excellent.  Killer fruit salsa!"}
{"text":"First time visiting.  The deli counter assistant was extremely nice and helpful.  They have a wonderful selection of deli meats, including Boars Head meat. Great variety of pasta/deli salads, produce, and so much more.  I am giving it a four stars due the bread being a little older and hard for my liking."}
{"text":"This place is great, a real hidden gem. Very fresh produce plus delicious hot foods prepared every day. This a place that every time I visit I can't wait to come back and try something different and don't forget about the baked goods."}
{"text":"Best veggie burgers ever!  I swear they must put crack in those things -- I'm a total addict!  I'll go back a couple times a week for more...and I'm not a vegetarian!  They're pricey though but totally worth taking out a second mortgage for.  Their produce is decently priced.  Slightly cheaper than Giant Eagle but not West Side Market pricing either.  It's a clean market and very welcoming with a good selection."}
{"text":"Great little market with fresh items! Deli is way better than local supermarket delis. Stephanie at the deli was great- very friendly and thorough with asking what exactly we needed and fast! Will definitely be returning in the near future :)"}
{"text":"Thier are times when you go out of town and you are looking for a good place to eat. I would have to say this is one of those places. The food is and the service is better. Good friendly service. Fast and easy and ready to eat. If you want fresh, they have that too."}
{"text":"I've  shopped here on and off for almost 12 years and after my last visit, I will spend my $$ somewhere else. I always make an effort to smile and say hello to employees here and the response I get most often is a blank stare. The produce is average and their prices been rising swiftly over the past couple of years. Why make a special trip to support this local market when the product and employees attitudes are poor? The cashier who rang me out last time especially needs to work on her customer service.. no greeting of any kind until I said hello and asked how she was! then she simply looked annoyed and scowled. BYE BYE ROMANO'S"}
{"text":"My go to place for fruit and vegetables. Love the Stromboli.  Only place my husband will buy lunchmeat.  Great service,  plenty of help.  Try the chicken, bet you can't eat one piece?"}
{"text":"Killer made-to-order sandwiches had me visiting this deli more than once during my recent assignment across the street.  The deli section has more meats and cheeses than most delis I have ever been to that are twice the size.  They also have stromboli's, calzones and pizza.  I could have made a meal just out of the free samples while waiting for my sub to be made.  To top it off, a very appealing meat counter and a produce section puts this deli over the top.  Bonus points for the easy-on-the-blinkers gals working in the store and their mid-western accents!  Nice!"}
{"text":"I like the fact that this is a small family-owned Farmers Market. I have been coming here since they have opened and have enjoyed shopping for fresh fruits vegetables and premium Meats. My last visit will end up being my final visit in that I ordered a sandwich from the deli and received a very unpleasant surprise. The roast beef sandwich was great until I got to the end of it. I had a piece of metal in it that cut the inside of my mouth. The cut inside my mouth took about a week and a half to heal as it was so severe. Also buried deep in this sandwich we're Globs of hair that look like somebody had emptied their hair brush. I truly enjoyed the sandwich up until the discovery of the metal and the hair. I really think they make a great sandwich but the person who made this sandwich for me wrecked my experience and I will never return for another sandwich again"}
