{"text":"It is certainly is no more than a 2 star rating and needs some \"primping\". But its 1950's  retro-charm and a really good attitude made for a great time- a lot of fun and a good atmosphere.  The rooms are large and very clean. Very close to the Indian Ruins which were fabulous. The restaurant surprisingly had a delicious shrimp dish- in the middle of the desert! Very yummy!- We will come back after newly proposed rehab is completed - We saw a lot of activity with new landscaping and redecoration."}
{"text":"Love this place!!! Easy access to the lake, great food, wonderful atmosphere and really really great staff!!!  Rooms are nice and love sitting by the pond drinking a few beers and watching the sunset!!"}
{"text":"My daughter and I stayed here this past weekend. It was awesome! It is tucked away in one of the most beautiful places I have ever seen. We were originally in a room. We were unable to get wifi, as the resort is in the process of remodeling. I told the person at the front desk and was offered a cabin for the next night (no extra charge) it was very nice, warm and homey. it is not fancy, but that is not important to me. The restaurant serves good food at a good price also. Customer service was great! We went there to relax and soak up the beautiful scenery, I came back refreshed and ready to start my week. We will definitely be going back in the Spring/Summer"}
{"text":"This is a really nice place- great for families, fun pond for fishing with the kids, ducks, great food and service at the restaurant. It is very basic and being updated so don't expect a \"resort\". Reminded us of an old Summer Camp- in a good way! They are on their way in the updating process and the beds and linens are all comfy and new. AC units kept us cool even though they are older too. We will definitely go back to see what they have accomplished. Perfect for our weekend family memorial trip."}
{"text":"Wonderful, peaceful place!  Only 100 miles from Phoenix, you feel like you're far far away..."}
{"text":"Just spent this past weekend, great for staying at the lake. Come back to A/C and a hot shower. Food was good in the restaurant and the new owners are great. Looking forward to seeing the remodel progress."}
{"text":"Nice place, very friendly people, good food at the restaurant, rooms have been upgraded nicely, and THEY MOVED THE GEESE to another area of the property  - a lot of fun!"}
{"text":"The nicest thing I can say about Roosevelt Resort Park is that the people seemed pretty friendly and it was basically quiet except for the periodic sound of power tools and the high-decibel air conditioner in the cabin. It's also in nice proximity to the lake, cliff dwellings, and some decent hiking trails. The rest of the experience was laughably overpriced. I guess everyone's entitled to their own definitions of words, á la Humpty Dumpty, but what they called a \"resort\" falls firmly into the category of \"trailer park\" in my lexicon.

We checked in around 5 pm and were pointed across a field in the general direction of our cabin because, as it was explained, they had removed all the numbers from all the cabins. Our cabin was identified as being \"the one with 2 green chairs out front\". Every cabin here has 2 green chairs out front, and it took us 2 tries to get it right. 

We were under the impression that we were getting a cabin with 2 rooms, a view of the lake, and wifi. This cabin had 1 room, a view of a trailer park, and little-to-no wifi. Also, it was about 115° inside, which was impressive, considering it was only 93° outside. We had to run the air conditioning for 3 hours before it was bearable to sit inside. It was about 24 hours before the room fixtures, including the beds, stopped radiating heat. We ran the AC 24/7 but still had to go out in the afternoon because it was pretty unbearable when the sun shone directly through the window, the curtains over which did nothing to block light or heat. 

The kitchen included a lopsided stove, which filled the room with smoke when lit, as did one of the burners on the range, a fridge from which pieces kept falling off, a microwave that did not work at all, 3 bowls, 3 spoons, 3 mugs, 3 washcloths, half a roll of paper towels, and some dish soap. Apparently, they cannot keep utensils or cookware in the cabin because \"people will steal it.\" Good thing I got my friend to call ahead and ask about those amenities. If I hadn't brought my own pot, pan, plates, baking sheet, forks, knives, salt, spatula, &c., we would have been pretty hungry.

The shower in the bathroom, a molded-plastic type cubicle, felt even smaller than it was because the floor was broken and you could only safely put your feet on the side. There was a huge crack down the middle of the floor that had been badly repaired with some kind of epoxy and then cracked again. I guarantee that the fauna beneath that shower is worthy of a David Attenborough narration. The toilet seat was not screwed on all the way, so it slid around when you sat on it, and every time we came in, the little basket of soap and lotion left on the tank had mysteriously relocated itself to the floor. Upside down. 

One of the beds had a broken frame, so that every time my friend sat on the foot of the bed, the top half popped up like a seesaw. We saw many medium-sized spiders in the room, but they were very fast and I couldn't catch a single one to put it outside. There was only one usable outlet (unless you count the 220 volt outlets, but I don't think you can plug a laptop into those). In the afternoons, a flock of aggressive geese wandered the property, hissing at people. (Apparently this is part of the property's charm, as the new \"Convenient Store\" next to the office is called \"The Angry Goose\".) One of the windows was taped into the frame; this was the only window that had a screen on it. There was only one parking spot in the shade next to the cabin, and it was occupied by a decrepit Jeep that, as far as we could tell, was not moved once the entire 4 days of our stay. 

The way I see it, this room would have been OK if they priced it like the lowbrow work in progress that it is, but it cost as much as a nice hotel room in a city. My friend was terrified that the clerk would ask us how our stay was at checkout, but apparently the clerk did not care how our stay was, and my friend was relieved to not have to talk about it."}
{"text":"This is the perfect place to stay at if you want to go and spend a couple of nights or more \"in the middle of nowhere\" but still with amazing locals around you. The place is easy to find, and it is a very nice drive there - along the coast of Roosevelt lake if you drive from northwest. Different hikes are quite close by - for most of them you need an off-road vehicle to access the trailheads, but we went for a nice hike along the lake - it was very beautiful and calm. 
The staff at the hotel is so welcoming and helpful - they greeted us very well and tried to make our stay as good as possible. We spent the New Year's eve there, so we got to experience a great dinner and party. The restaurant at the hotel is a very nice and comfortable place to have a delicious meal, just relax, talk to people, watch TV. There is a fireplace inside which makes it even more cozy. 
We loved everything about this place and we will definitely come back if we can. However, some tips for other travellers: 
* this is not a luxury place so don't expect that - it is quite simple, modest, but very lovely; 
* there was no hairdryer in the room or at the hotel in general so better take yours if you need one; 
* there were geese and ducks wandering around - it was so cute and lovely - but they were sometimes very loud in early mornings or sometimes even in the middle of the night. So if you are a light-sleeper, maybe they might disturb you; 
* there is no internet in the rooms, just at the restaurant. For us it was perfectly fine - we just spent as much time as we wanted at the restaurant, drinking coffee, having meals."}
{"text":"This is a tough property to review! The staff is over the top nice, friendly, accommodating and so very helpful. There is a pretty pond in the center of of the property. The restaurant was delicious and priced fair. We had a very large \"cabin\". We comfortably slept 2 adults and 6 kids. Just realize that the space is extremely simple, dated, and absolutely zero upgrades have been done, probably since it was first built in 40's or 50's! As long as you know what you're walking into, you won't be disappointed."}
{"text":"Great food, great people, family friendly environment!  Its the perfect place to go for piece and quiet. Fishing in the pond is fun too. Can't wait to get back."}
