{"text":"Our office group eats here often (against my wishes), and I am NOT a fan. They are extremely overpriced and the last time I ate here two of us came home with food poisoning. The staff is always very friendly, but I am not a fan of the food whatsoever."}
{"text":"Great service. Great food. Enjoyed dinner here. They take reservations three or more. What I enjoyed most was their ability to not allow the place to become hectic. Crowded but relaxing. Food didn't take to long and was excellent. We had spaghetti and meatballs,Manicotti, and ravioli.  Garlic buns are to die for.  Very reasonable prices restaurant.  We will definitely go back!!"}
{"text":"Just wanted to say that Rosie's is my go to place for pizza. I love thin crust and their's is awesome. Lots of toppings and they have green and black olives!!! If you haven't tried it you should."}
{"text":"I LOVE the homemade lasangna, also quite wonderful are the homemade meatballs. I personally think the sausage caroze is to die for and can make a meal out of that.. Her food is of the highest quality you can tell and there is allot of love in it.... YOU can just tell,,, whomever spends all the time to make this food taste like moms, deserves me and you to go back time and time again!"}
{"text":"What I like best about Rosie's is that the food is consistently great. Whether it is packed with people or a quiet evening in the summer, the food is worth coming for. The waitresses are pleasant. Your are in Sun City West, so expect to see seniors. Unless it is the middle of the summer, make reservations. 
I love to see Rosie when I come in because I know she cares about what her customers think. That is the sign of a great mom & pop restaurant."}
{"text":"THE BEST! I travel extensively and as a result have the opportunity to sample my favorite food, (Italian, of course,) in restaurants not only in this country but internationally - including three trips to Italy. Rosie's rates at the top of my lists for the best cuisine, service and, if you get to talk to the 'Rose' her self, atmosphere. There's a nightly special but all the prices are very reasonable. Here's my insider's tip - - order the lasagna!"}
{"text":"Whoever was running the front desk, owner or not, was rude to us customers. Food was not great, I'm confused on how Hunt's tomato purée on soggy pasta is spaghetti. The bruschetta was 10/10 would eat again. It was the best out of the meal, but not enough reason to go back. The service was okay, (bus boy was great, waitress was okay) but everyone there gave us dirty looks for being under the age of fifty-five, even if smaller children were very well behaved. If you're an old-folk and want to enjoy today's elementary food then this might be the restaurant for you."}
{"text":"Awesome Italian food!  Our server Karen was outstanding.  Very friendly and the food (delicious) was very quick.  Rosie was super friendly too and fun to talk to.  I'll definitely be back and bring some friends!"}
{"text":"They should be ashamed to call this italian food. My sausage carrozza, had more water in it than sause. My guest chicken parmigiano was also full of water and chicken seamed like it was reheated several times. Service was weak at best, seemed rushed to get us out, clearing table while we were still eating. Place represents Chicago everywhere,  but their attitudes seemed more like New York. Won't see us again..."}
{"text":"The food wasn't bad it was pretty decent.

But the service was absolutely horrendous the woman who worked at the front desk area had no personality at all she was cold and rude and I don't think people like that should be working in the customer service industry. I will not return here because of the service it makes me feel very uncomfortable and awkward!! Overall the service was very poor and you do not feel welcomed at all here I will never return because of that! Get your act together guys!"}
{"text":"Been coming here for years.  I love love love their food.  Whether you get the baked ziti, chicken parm with giardiniera, or the pizza you can't go wrong!   Highly recommended!!,"}
{"text":"Great mid west style pizza. Thin crust and cut in squares. Get the sausage and green olive. The garlic rolls are home made and so good. The pasta was ok. It needed more garlic and spices. But I'll be back for the pizza for sure."}
{"text":"Great little restaurant. Prices are right with you to servings. Homemade everything! Really a great find a restaurant in Sun City West."}
{"text":"We went to Rosie's tonight on a friends recommendation and the food was wonderful!  I had spaghetti and meatballs, another friend had the raviola, both meat and cheese - excellent on both accounts. They also serve your choice of soup or salad, I had the chicken noodle soup, homemade, very good and my friend had the salad which had tomatoes, cukes, onions and of course lettuce - it was a salad.  But the biggest treat of the night were their homemade garlic buns - oh my gosh, excellent doesn't begin to describe them.  The prices were average, and on a Tuesday night by 6pm, there was a wait for a table!  We will go back to Rosie's and we would suggest you do too!"}
{"text":"We like thin crust pizza so that is why we buy here. Our last take out pizza I ordered was the works. My wife picked it up and did not know what I had ordered. I was on the computer so they started with out me. When I saw the pizza it at first looked barren,then after that first slice it hit me. No pepperoine. I called,they said it was under the sausage,what a laugh I nearly fell out of my chair. My compensation would be a refund for the pepperoni. NO THANKS you lost any of my groups future business."}
{"text":"Had a reservation & waited about 5 min to be seated.  took some time to place our order.  Food was great but overall the service was slow & poor. It is a pet peeve of mine that a server can write down an order & 15 minutes later they don't know who gets the soup & who gets the salad.  Ask for water 3 times--1st with our order  2nd with our salads & 3rd after our dinner was served, finally got it when l asked another server for help.  When paying our bills the cashier ignored us while shuffling papers around the bar. Would l go back  PROBABLY  The food was that good.
Meat Sauce ok     Marinara Sauce Great      Meat Balls Teiffic"}
{"text":"The Pizza was awesome, the other food that was ordered by my other guests said their food was ok, the service was sub par and I don't like to sweat while I'm eating my dinner. We brought this up to the hostess and she was really rude about it saying it was so hot outside that their cooling equipment couldn't keep up. That place isn't that big, they should have been able to freeze us out of there, if it couldn't, then they need to call their HVAC company and get it replaced. I'm not sure if I would eat there again, if I did it would not be in the summer!"}
{"text":"This is my favorite restaurant in Sun City West. The Italian food is delicious!  The salads are huge and use quality ingredients. The lunch specials are always great. Service is wonderful. Don't miss out on the garlic butter rolls!"}
{"text":"The calzone was loaded with cheese, great crust! Thin crust pizza was VERY good! Will definitely go back again!"}
{"text":"Absolutely LOVE this place!! If I could rate more stars I would! I usually get the cob salad and awesome. Anything from here is awesome! The daily specials are all very tasty and you get a hefty amount of food for the price. I recommend this place to all our patients whenever they ask for recommendations for a bite to eat. They have a forever customer whether they like it or not! Lol"}
{"text":"The food here is decent, but the service and attitude of this establishment is one of the worst in Sun City West. My wife and I arrived at 6:30 PM at just wanted to order a sallied and small pizza. They are open until 8:00 PM - Three waitress look at us like \" What do you want and why are you here\" it was that look if you know what I mean. We are told you can sit back by the wall and proceed to seat ourself. A waitress sitting by the window slowly drags herself back to our table and ask us what we want to drink. Just water would be fine for now. She puts the water on the table and says \"Someone will be with you soon and goes back to her window seat and sits down. 10 minutes later our waitress comes to the table with the \"What do you want look on her face and takes the order\" we ordered small salads and another waitress drops them off. So things are looking up until the pizza is basically dropped on the table in front of us still in a hot pan with nothing to hold the pizza. Ok, I know the pan is hot but this this the last time we see her. My wife has to get up 10 minutes later and go to the cashier area to ask for a re-fill for her water. We have a few pieces of pizza that we would like to box up and can't find our waitress. I finally go to the cashier whom I assume is one of the owners and ask her for a box and our check. She asked me \" Who was waiting on you\" I tell her \"I don't know, we have not seen her\" The cashier finally gets her from the kitchen and she has the nerve to stare me down as if I was interrupting something much more important. The cashier does apologize and tells me \"she was cleaning the kitchen\" I let her know she would not have to worry about cleaning the kitchen without any customers. I will not got back and will let all my snowbird friends know my experience. Some advice for Rosie, Hire people that are friendly,"}
{"text":"I am writing this because we have tried Rosie's twice and had identical experiences.
Hopefully the owner will read this because the attitude of the owner/cashier would drive anyone away which is too bad because the food is not all that bad. Everything is a pain in the butt to her and she is sorry she is there with her screaming infant in the backround.
This is the first negative review I have ever written but if it will open her eyes to the reality of where she is coming from I will have helped her to gain more business"}
{"text":"Had a very pleasant experience at this particular restaurant.  Food was outstanding, service was excellent, our server, Karen was extremely nice and fun to talk to.  Talked to Rosie after our meal and she couldn't have been nicer!  Loved everything about the place!  Will definitely be back with friends!"}
{"text":"Just moved to Surprise and I love exploring new and special places.  What a gem Rosie's is!!  You know how when you walk into a place and you can just feel the good energy.... ordered the Honey Almond Chicken Salad and the Italian Beef to go - had a nice glass of Merlot while I waited.  Both were delicious, great flavors and portion size.  I really look forward to exploring the rest of the menu.  I can already tell this is going to be a favorite."}
{"text":"The place was clean, quiet and cool. Prices are a little bit high (Even a salad was between $10 & $14 depending on what size salad you get.) but the food is tasty. I don't know if it was just because we were all starving  but it seems like they took so long just to get the pizzas to us. I joked to my husband and Mom that it seems like they had to go all the way to Italy just for the ingredients. We enjoyed our food and would go back. I took 1 star away because it took a long time to make it during a non busy time. Only 2 other guests in there at the time and they already had their food."}
{"text":"The kids wanted pizza so we decided to try Rosie's. First thing I noticed was the tables are a little small for pizza but we were able to make due. The wife and I shared the antipasto salad. Lots of lettuce, a healthy amount of meat, but a little skimpy on the cheese. My little one loved the cheese so much we had to order an extra side to keep her happy.
The pizza was pretty good. Thin (but not too thin crust) so it stayed hot. Everyone seemed pretty pleased. Was vacillating between 3 and 4 stars but the service was good enough to push it up. Would like to try this place again the next time we're visiting the in-laws."}
{"text":"So I found myself once again in Sun City West tonight this time to enjoy dinner with the in-laws. I have determined that if you enter the realm of Sun City, SCW, or SC Grand you are less likely to be stared and glared at if you are accompanied by a SC resident. Keep this in mind when you enter the Twilight Zone.

But the point of this review isn't to give tips on how to best deal with SC, but to tell you about a great little family restaurant called Rosie's Italian Cafe. Rosie's is nestled in Sun City West off of Meeker (also known as Reems outside of SCW) and Camino Del Sol near the True Value Hardware store. It is a cute place that recently added on another dining room when they took over the old Dominos pizza location that moved out of that strip mall. This turned out to be a good thing for Rosie's because before Dominos moved, Rosie's only served pastas, salads, and sandwiches--and NOT pizza. Which in and of itself is rather strange for an Italian restaurant. It seemed to work for them because for the most part, Rosie's has a pretty good, steady business. But, since Dominos moved out, Rosie bought their pizza ovens and voila, now Rosie's serves delicious, hot, fresh Chicago style pizza now.

Rosie's is moderately decorated with pretty floral plastic tablecloths and photographs of Chicago along with Chicago memoribilia. Nothing fancy or over the top and that's actually refreshing to not have a restaurant over do it. 

Back to that pizza....and let me just tell you, that pizza is thin crust, flavorful, mouthwatering gold my friends served straight from the ovens to your table with a wink and a smile from Rosie herself. 

Rosie's has a great selection of pizzas but if that's not your thing, they also have a fantastic selection of pasta dishes and a Chicken Parm dinner that is simply to die for. There are also hot and cold sandwiches, light appetizers, salads, and soups on the menu as well.  The garlic bread served with the pasta dinners is hot, but melts in your mouth from this great garlic butter sauce that they smear on it. Oy...it is so good. The salads are fresh and not wilty with a great selection of dressings.  There is a soup of the day selection so the soup variation isn't too great, but that's ok because the one soup they are serving is made fresh that day. 

Rosie's had a very good, steady flow of business tonight, a Wednesday evening, and when we left, there was actually a wait list for people to get in. Rosie's also does a steady take-out business as well.

So, if you are looking for a solid family restaurant that is no frills in the West Valley, Rosie's is your place. Blue Haired chaperone not required, but definitely recommended!"}
{"text":"Living in the area I try to patronize small local businesses. Have eaten at Rosie's a few times before and the food is ok but the staff is less than welcoming. They make you feel like you are interrupting their evening plans. I will not be returning there for that reason. On the door their hours are until 8 p.m. I arrived at 7:20 with my guests and pulled right in front of the restaurant. Rosie saw us and turned off the open sign. We were informed that we could not be served because the kitchen closed at 7:30 when we were leaving the whole staff was looking at us like we had an extra eyeball. I always give up a place a few chances Rosie's Italian restaurant has had her last with me"}
{"text":"Love the food and staff at Rosie's. The stuffed shells are amazing. Really great marinara sauce. Meal comes with garlic knots and salad which is appreciated also. Prices are very reasonable, especially for the quality of food. Can't wait to get back here!"}
{"text":"Totally impressed! This cozy restaurant is a little slice of Italy! Service was very friendly and personable - we were seated promptly by Rosie herself! Food was excellent! Very generous portions! Had the meat and cheese ravioli's - usually I'm picky when it comes to red sauce but Rosie's is the best I've ever had! Also had salad and a garlic butter roll.... All I can say is yummy in my tummy! You've gotta go to try the garlic butter rolls alone! My sister really enjoyed the BBQ chicken salad with a garlic butter roll. A little bit of something for everyone even if your not a fan of Italian. You won't go home hungry or disappointed! Being in our early thirties, me and my sister didn't mind the Sun City crowd that filled most of the restaurant - everybody was there having a good time! Next trip I'm definitely going to get the tiramisu even if I need to take it home for later!"}
{"text":"Very nice Italian cafe with Rosie herself coming out to say hi to us.  Meat Lasagne was outstanding and now I can see why it's their best seller.  We called for reservations and actually called a different Rosie's in a different state (screwed up on the phone internet search), and this Rosie's was very accommodating and got us seated!  Thanks to everyone there we had a wonderful dinner."}
{"text":"After our last trip, we're really disappointed.  Last Friday, the lasagna, which Jo-Ann had always loved, was pretty thin - very little lasagna, but lots of sauce...swimming in sauce!  Way too much sauce for the small cut of lasagna.

Yes, the service was slow.  Slower than we've experienced in the past.  But the gals were friendly and nice.

But the food quality has gone down.  Three stars now."}
{"text":"Rosie's is one of the best little pasta joints in the Sun City/West area, and has a huge crowd of local regulars.  We usually go on Friday nights and it is almost always crowded so get there early.  It is a Chicago-style menu with many special favorite dishes.  Seating is fairly limited and they do a huge take-out business.  The food is always good and the service is usually excellent.  A real family style business.  The place closes for two weeks every August so the owners can visit family back in Chicago, so don't try going then.  They do have a side room for private parties that they sometimes use for overflow crowds when they get busy.  They have make your own pasta choices dishes available too, with different pastas and toppings combined."}
{"text":"One of the perks of working in Sun City West is that Rosie's is right up the street. This is a great little place with tasty Italian staples. There's nothing terribly adventurous on the menu, but they serve tasty pasta dishes with perfect al dente pasta and delicious sauce. I love the garlic butter rolls. The rolls are slightly crusty on the outside, and the soft inside is perfect for sopping up all the delicious garlic butter. The Antipasto salad is one of my favorites. Everything is deliciously fresh, and I like the feta cheese dressing."}
{"text":"For a \"don't feel like cooking Monday night\" this is a good option. Small locally owned with nice staff. I had lasagna and hubby had a sausage sandwich. With drinks it came to $27 plus tip. Very popular with the local crowd so if you are under 55 you will feel like a youngster."}
{"text":"Excellent calzones and garlic buns!!  Visiting from out of town, Yelp saves the day again!  We wanted some good Italian food while visiting my parents in Arizona and found Rosie's.  A really cool place inside, I'm guessing she's from Chicago.  There were about 154 pictures of Chicago plastered all over the walls.   The only thing about the atmosphere that I didn't like was the odor.  I smelled of old basement or something funky.  You'd think all that delicious food would over power anything in the air, but I guess not.  

We wanted to try a variety of different things and share it all.  We went with a calzone, dinner salad and the meat and cheese combo raviolis.  The calzone was AWESOME!  A super big portion and cooked to perfection.  The marinara was a bit sweet, maybe a touch too much sugar in the recipe, but it was fresh none-the-less.  The raviolis were good, I liked the meat ones better than the cheese, but a good size portion as well.  One thing that came with the raviolis, and also is offered as an appetizer was the garlic buns... Holy moly.  They were soooo F'ing good.  A must have appetizer if you come to Rosie's.

Overall the service was good, the food was tasty and we left stuffed!!  I would definitely come back to Rosie's when visiting again!"}
{"text":"I've never had to wait so long for a cheese pizza...close to an hour!  But besides that the pizza was good, but not the best..."}
{"text":"First time here and I love it. Everything was great food and service! I had the chicken fettuccine Alfredo and Steve had  the special eggplant plant parmigiana. I loved my dish it was huge. Steve said the marinara was on point. He's a chef and very picky. The garlic buns was the best part. I will be back for sure and Steve said he wants to bring his sister here when she visits in October. I can't wait to come back."}
{"text":"I would give zero stars if I was able to. 
My father and I drove 25 minutes to go here so he could get the Italian Beef sandwich. He has stage 4 cancer, Chemo got the best of him and he's down 35lbs, when he said he was hungry and wanted to eat I told him I'd take him where ever he wanted and this is what he was excited about. I read reviews before we went but remained optimistic. 
What people said about the rude staff are spot on. The woman, she has short hair and wears glasses, was cold and rude. It was 11am, we were told we'd have to wait because they just opened, fine. My father requested 5 sandwiches, he asked that they not be assembled so he can eat them now and later. She acted like he asked for a unicorn, she rudely said she ask the kitchen. She came back and refused. I explained again, nicely, just throw the meat in something and give us the buns. Easy. I have a gluten allergy, can't eat the bun anyways so what's the big deal? She refused then big ol' Rosie came from the back in her apron and just stood there looking at us with her hands on her hips. 
I was disgusted. We left with nothing. Obviously this place is doing so well they don't mind losing a $70.00+ sale and they think it's completely fine to treat people like shit. I will never go back and I'd never recommend this place if it were the last place to go."}
{"text":"Rosie's is in a really nice location away from Bell and Grand which seem to be the major avenues for dining options in this part of the desert.  The wifey wanted cheese ravioli, and what she wants she gets, so off we went to try something new...

I've seen more youthful crowds at Hospice of the Valley mixers..  The ambiance is nursing home-esque.

The food was OK.  Not bad at all!! But nothing that would make me crave something from here to make me want to come back.  

The service was a bit slow but not awful.  Dessert seemed pre made..  And the kids SCREAMING in the other room... 

Probably won't be back agian.."}
{"text":"Went today for the first time.  Both of us had The special -Baked Ziti.  Lunch was awesome.  We will be back soon!"}
{"text":"Great lunch specials! Service is a tad slow, but a nice experience!"}
{"text":"First timer at this sub shop and was worth it. Got the chicken parmesan sub and the bread was very good with fresh ingredients. Worth a another trip sometime soon."}
{"text":"Rosies... The gluten free menu continues to blow me away!! You must try the lasagna! I really enjoyed the Chef salad which was absolutely huge! The staff is a very friendly bunch of people and the service was great, our drinks were kept full the entire meal. The sausage to die for, and I can make a meal out of that alone. As I have shared in other reviews... I am gluten free, but the rest of the party enjoyed the buttered garlic rolls that kept coming out. We will go back, again and again."}
{"text":"Visited today for the first time, at the end of the lunch rush.
We were seated immediately, Water was delivered shortly thereafter. (That's a thing to me, living in the desert.)
Staff was friendly and moved with a sense of urgency.
I got the large Cobb salad. Every item was fresh. Homemade dressings excellent.  The salad was HUGE!!!
Sausage and mushroom pizza was nice. Crust was thin and flakey. 
Spaghetti and meatball was the afternoon special. Daughter liked it.
Karen was great, and Rosie very cordial, taking time to speak with us.
The only reason I didn't give them 5 stars was a matter of my own personal taste. The sausage and meatball could have been much spicier. I know how to order there now.
All in all, very pleasant dining experience.  We will certainly be back in the future."}
{"text":"Went to Rosie's on the recommendation of a friend.  It's a small restaurant (cafe) in a strip mall.  We got there at 5pm hearing that it fills up quickly.  We didn't have reservations as we didn't think they took them, but they do for parties of three or more. The staff was very helpful and because we were there early we were able to get a table.  
 I typically do not go out for Italian food as I figure it's easy enough to make at home.  Therefore I ordered something I wouldn't normally have.  Stuffed Shells Florentine.  They were excellent.  The portions are large and the prices were great.  It's an old style restaurant  with down home service and food.  The food came quickly and nice and hot.  Went with another couple who the week before took us on an hour drive to what they claimed was the best Italian restaurant they have ever been to.  Well, they have been converted and are now fan's of Rosie's.  My husband had the stuffed shells as well.  My sister-in-law had traditional spaghetti and meatballs and her husband had lasagna.  He quickly determined after one bite that it was the best lasagna he has ever had.  
I do have to say the garlic buns were different.  Not great or bad, just different.  The Italian sausage was also excellent. 
Treat yourself and go to Rosie's.  When we left at about 6pm there was a line outside.  We leave this area in a week and are planning to go back one more time before then."}
{"text":"Reg lunch ~$10+
Special lunch $~$7
OK food, regular portion size.  Several people said it was their favorite, but I'll probably not return."}
{"text":"Rosie's is that place you wish was better. The menu has many choices, but several dishes, which I have tried over several occasions, all need more flavor. Is it because of the clientele and the overall median age? Taste buds not as keen as they once were? Perhaps it's the logic of \"Who cares, they'll eat it anyway?\"

I don't want to sound too critical. After all, I appreciate the fact that Rosie's exists and is available as a \"Mom and Pop\" restaurant. But they got to step it up a couple notches.

The owners, I believe are originally from Chicago, as per the many signs, photos, and memorabilia on the walls. However, they certainly did not bring that big 'ol Chicago flavor back with them to the desert!"}
{"text":"I love EVERYTHING about this place. Great food, cheerful service, fair prices, and generous portions. The antipasto salad was fresh and plentiful. The cheese ravioli  was tasty. The garlic bread that comes with the meal is unique and delicious. 

The thin crust Chicago style pizza is one of the best in Arizona. Absolutely perfect. 

The decor is unassuming, the food belongs in a fine dining establishment. 

I've been coming here for many years, and this week was in the area so stopped by for a few meals. It was like seeing an old friend after being away and they never changed."}
{"text":"OMG the pizza is the best pizza i have ever eaten.  it is a for from where we live but the food is out of this world. Go try it  out. you will love Rosie is a sweetheart."}
{"text":"Excellent food from top to bottom taste of Chicago  Not to mention   Excellent thin crust pizza"}
{"text":"Underrated by those not familiar with real Italian cooking.  The Sauce (or Gravy) was great, and that my friends is the basis of everything."}
{"text":"I loved Rosie's meat lasagna for lunch. It came with a green salad and her famous garlic roll. It's enough for 2 but I ate the whole thing and didn't eat dinner!"}
{"text":"Definitely one of the best italian places in the area, if not west valley! Went with my dad a couple days ago for lunch and was impressed with the friendly service.  I would consider this a very relaxed, casual place to enjoy a great meal. The greek feta dressing was great and salad was very fresh.  Would definitely come back!"}
{"text":"Went here based on reviews...very pleased. Authentic Italian in SCW! And it's open past 6pm..lol.  Their meat sauce is great...get extra on the side to dip those yummy garlic rolls! The baked ziti is huge and could easily feed three people, no kidding! Salad was fresh, dressing good too. It was a busy night and food took a little long, but we didn't mind the wait for great food. We will definitely be back! Tucked away in a little business mall, you gotta know it's there to see it! Worth the look!"}
{"text":"What a wonderful find for a \"Foodie\" from Seattle looking for a great Italian spot. Did not disappoint! We started with the homemade garlic rolls and a nice crisp green salad with house Italian dressing. I tried the chicken fettuccine and my friend had the spinach stuffed shells.
Good service, nice portions. High quality food with LOVE in it!
 Yeah!"}
{"text":"After incredibly slow service and average food, we were asked to leave the restaurant because the owner (Rosie) needed our table. There were several other empty tables in the vicinity. Never have we been asked to give up our table at any restaurant. The only reason we were there that long was the slow service. Avoid this place at all costs. There are other better restaurants in the area. Don't give this woman a penny of your money. She obviously doesn't believe in superior customer service."}
{"text":"Rosies was very good we love the food down my husband said it was the best eggplant he ever had we will be going back"}
{"text":"My husband and I stopped in for dinner and were pleasantly surprised.  Great pasta and sauces.  Try the mushroom ravioli for a real treat!  We plan to try their pizza next time - we've heard great things."}
{"text":"Not that impressive. Decent calzone with soft crust though. Cooking for the tastes of people with advanced ages basically."}
{"text":"Had dinner here last night.  The food is very basic Italian fare - but not too bad.  If you are looking for something like linguine & clams or frutti da mare - do not come here.  The problem is really not the food - it's the attitude they give off.  Very brusque and uncaring.  They all really seem as though they don't care if you ever come back!   And they succeeded - because we won't be back.  They rely on the fact that they have very little competition and that most of the residents of Sun City, Sun City West and Sun City Grand are unwilling to drive off the \"reservation\"."}
