{"text":"I don't know what they put in the roti wraps, but it must be cocaine. I keep coming back. The bread is from another world. Just melts in your mouth, and golden, smells like heaven cause it's cooked fresh everytime. Same with the rest of ingredients. Good price , includes drink. Best roti in sauga/Etobicoke area"}
{"text":"Large Goat roti is delicious. Will be stopping in again as their aren't many roti places close to Etobicoke."}
{"text":"This is the fourth time we've been to Roti Stop and we have not been disappointed yet. The chicken curry rotis that my husband and I ordered today were flavourful with lots of chicken and just the right amount of potatoes and sauce.  They were freshly made and were still hot when we brought them home. Delicious!!"}
{"text":"I am 5'6, 134 lbs with a normal appetite and I'm still hungry! I had the chicken roti that is sold for $7.25 which is way too much for the size itself. The flavour was good but a little too salty and I'm a salt lover! Overall it was good but nothing special.   I honestly don't intend to go back because I feel like I got ripped off. If you have the money to waste go for it but make sure you get at least 2!"}
{"text":"Order: Regular jerk chicken with rice and peas  Roti Stop is a small caribbean restaurant in a strip mall near Dundas and Dixie. After seeing it didn't have many Yelp reviews, I didn't have high expectations. The meal that I  had was not bad, but it lacked anything that stood out. The chicken? Average. The rice? Average. It seems like the type of restaurant that gets the vast majority of their customers from a small, local radius. There's definitely nothing wrong with this, as their food is decent and priced competitively, but don't expect to be blown away."}
{"text":"I Stopped buy this place while getting my car exhaust done at Zorro Mufflers, down the street from it. I tried the chicken wrap in a roti and asked for it to be spicy, it was full of flavour and very filling. Best home-style comfort food. I will defiantly be coming back to this area cause of this place."}
{"text":"Save yourself the disappointment and go to island palace that's in the same plaza. Roti stop is very stingy with their meats. They fill up ur dish with rice and potato. Island palace hooks it up!!!"}
