{"text":"What a great find!  We were touring The Christmas Story House next door... we were getting back on the road, so needed lunch.  WOW...pierogi... hadn't had this since I was a kid in Ohio.  Our food was home made AND SO good.  This is a clean, friendly and fun place.  Great neighborhood vintage pub!!!"}
{"text":"Don't let the \"pub grub\" moniker fool you. That steak was the bomb.  And that was the first time I've ever wanted to eat my kids' chicken fingers...  Oh and Rose's apple pie. Ok y'all can go home now cuz a crowd is going to ruin it."}
{"text":"The chili, burgers, pickled eggs, fries, and Rowley bites are all awesome! The burgers were as good as, if not better than, those I make fresh at home. I wanted to try the pierogi, but they are only available on Fridays. I will not dock this place for that. As it states on Google, it's a dive bar in a small neighborhood. Go see the Christmas Story House, take the tour, then go to Rowley's. We were told they're under new management."}
{"text":"We went here after we were at the X-mas story house . Just to let you know the beers are $2.50 now not $1.25 . It's a dive bar but I'm ok with that ."}
{"text":"To be honest, I'm a little surprised by all the 4 and 5-star reviews. The food is average at best, even for a dive bar. I have given the Rowley Inn 3 tries now, and the food has gradually gotten worse: inedibly under-fried wings and fries, over-cooked, rubbery chicken sandwich, gluey mashed potatoes, etc. Essentially, the Rowley is a lovely dive bar in a cool location, but they need to improve the food to please hungry Christmas Story House visitors looking for a decent lunch."}
{"text":"BEST DIVE BAR EVER!!! The other reviews are spot on. Great spot. I recommend it to all that visit Cleveland and like finding the off the beaten path/non-tourist places."}
{"text":"First time here. Found this awesome little corner bar by accident. Wish we hadn't eaten before we came but still got the awesome corn dogs. The menu is incredible. Owner and staff super friendly. Wish I could give more than five stars"}
{"text":"Great little corner bar with awesome food!happened upon this place while waiting for car repair. Got to enjoy their pierogi nite and happy hour. Plus right across the street from \"The Christmas Story\" home. Owners were pleasant and accommodating. Will definitely return!"}
{"text":"This place is the real deal. Friendly staff, great beer selection, tasty & filling bar food, and charming old-timey decor that is original, not emulated. If you're tired of douchetastic bars and overpriced cocktails, you know where to go, now."}
{"text":"This place is the tits.  Cheap drinks, colorful clientele, and karoake without the crowd to boo you off the stage.  Authentic old school, blue collar, hole in the wall feel that brings a warm feeling to this drunk's heart.  I've been there more often to open it up at 5:30 than I'd like to admit. And while those tend to be pretty blurry experiences, I always wake up with my cheeks hurting from smiling so much. The crowd that early is exceptional. You got a few of the regular stalwarts glued to the encore westerns channel, sprinkled in with a few like minded patrons who just didn't want the night to end.  The Rowley Inn is always a good idea, no matter what the time."}
{"text":"Came here for a Cleveland beer week event not knowing anything about the place. Good beers, of course. But I just had some of the best pierogis ever - and I make my own. They were chicken paprika's, which is awesome, but they were also fried perfectly as were the onions. Very happy and will come back again."}
{"text":"We were on a road trip back to California, and wanted to see and do inexpensive stuff...the Christmas Story house fit the bill but The Rowley Inn (located across the street) was where we really enjoyed ourselves.  Some of the nicest people we ever met work here and with a happy hour that starts at 5:30 am how can you go wrong?  Very pleasant experience.:-)"}
{"text":"Nice place. Great stop if you drop the wife off to tour the \" A Christmas House & Museum\" friendly bartender fills in all the behind the scenes info on the house."}
{"text":"Huge fan of this place, been going for awhile.  Papa Chubby hosts great karaoke on Friday and Saturday nights!  Only issue is with the young kids who can't handle their alcohol picking fights with my friends.  They should've been kicked out as soon as they walked in because they didn't need any more to drink."}
{"text":"This is an old steel worker's bar. I've been coming here since 2012. Since then a new owner has taken position and has only made it better. He's kept the same uhh-maze-ing beer prices while adding to the selection in the cooler as well as the menu. The best bartender, Taylor, opens up at 530a on Thursdays and Sundays. I highly recommend you come visit and tip well."}
{"text":"Wings were delicious! After leaving South Side disappointed, we were happy to find the food here so much better. The bar tender was a little grumpy but we'll be back!!"}
{"text":"We were a little skeptical based on The location, but decided to give it a try. The menu was larger than expected with a nice variety of options. We ordered the fried pickles appetizer and were surprised by the large fried pickle spears. They were delicious! Then our meals... More food than we could eat, and it was deli"}
{"text":"I think I've died and gone to a Yelpers DYL heaven! While waiting for a cab after touring A Christmas Story House, we espied what looked like a little neighborhood bar just kitty corner to the leg-lamp-in-the-window home and decided to kill the time with a cold one considering it is always 5 o'clock somewhere.  Upon entering I immediately thought I had been transported to the VFW bar from Grumpy Old Men. With a long bar, the Simpson's pinball and Ms Pac-Man video game and bowling skeeter ball, we soon came to find that the place was half filled with friendly locals that all knew each others names.  After the initial shock of any domestic beer for a $1.25 the big jaw dropper for us was when we looked at all of their \"top shelf\" liquor. Each bottle had a price scrawled onto it with a black sharpie marker. Hennessy, Kettle One, Crown Royal etc. your choice $2.75, Freakin' unbelievable! Needless to say we sat and ordered doubles and my friend looking around said he may not have this chance again so he told the bartender to set 'em for the whole bar. As the patrons were most appreciative, the tab for 17 drinks came to $28.00. That's $28.00 dollars!  We smiled knowingly at each other as we knew we had found one of life's little diamonds in the rough nirvana. As I stared at the sign on the wall that said, Open at 5:30 A.M. I thought to myself; luckily for my liver this place is far from where I call home,"}
{"text":"They get four stars just because . This place is a dying breed , the neighborhood corner bar where they if not know your name they remember if you have been there before. We always stop  in for one of Dennis's bloody marys and to see the locals hangin out . Recently under new ownership we hope the rowley inn has a bright future and can't wait till we return for our next bloody mary."}
{"text":"6 of us came in to get some drinks and we were told we couldn't sit at a table because we weren't eating. What kind of establishment doesnt let people sit!? You spend more money in drinks than food anyways. He said they expected to be busy today, that's why....  We proceeded to sit and order a few apps. Spent 100, tipped 20 and left within an hour.   Food was sub par. Pierogis came out just above room temperature."}
{"text":"Growing up in the 'hood' Rowley was the place to go.  Happy to see that the new owners are doing it proud.  It isn't a big place, with a big kitchen, so the food does take time.  Grab a table, get the salsa and chips with a beer and you'll be fine.  Portions are nice, the nacho's could do with a little more toppings.  Burgers are fantastic, especially at 1/2 price 'happy burger hour'.   Anything we've tried to brunch was fantastic."}
{"text":"I am so excited that I finally came here! This is my type of bar- great food, good beer selection, and great company! John the owner is wonderful to talk to and he has a great establishment. I love a good bar that you can sit at with your friends, chat with the bartenders and locals and do some good 'ole fashioned day drinking.  Tip #1: get the poutine! It's so delicious and I didn't want to stop eating it and at $5 why not?! Tip #2: The draft beer selection is small but good. Order a draft- oh and they are affordable! Tip #3: They open at 5:30am on the weekdays and serve breakfast all day! Tip #4: Happy Hour is from 2-7pm M-F and they have some stellar deals!  This is a Cleveland must-stop. I can't wait to go back!"}
{"text":"Some people might scoff at the five stars I gave the Rowley but, having lived right around the block; this bar has been my savior. It's the perfect bar to visit alone when you don't want to be spotted by anyone you know. The bartenders remember what kind of bourbon you drink (Echo Springs) and will watch you play the bowling machine, laughing when you botch the split.  And they open at five thirty in the morning. Awesome. I have been there for last call and then returned for first call. No one even noticed. Don't gentrify this place though, the local clientele own the Rowley. I was just lucky enough to be a resident too."}
{"text":"First time checking this place out! Dawn was amazing and suggested a ton of great food options! Huge portions and great beer! Will definitely be back soon!!"}
{"text":"Cool little joint on the outskirts of Tremont. Great service by Dawn andTaylor! They recommended the  Bumpus Hounds and Loco Moski and both were tasty little dishes. Bonus: it's right by the Christmas Story house."}
{"text":"I decided to give this fine establishment a try after my friend suggested we meet up there. Wow, was this amazing. I don't have a picture to attach because our food was gone within 10 minutes, literally. Rowley Inn is in Tremont, but a bit out-of-the-way in the middle of a neighborhood (It's also across from the Christmas Story house). It's a very casual, dive-y atmosphere that makes you feel right at home. Street parking is readily available per usual in the Tremont area.   I got the Veggie Sandwich AND the Avocado Tacos (don't judge, I was hungry). The tacos were fresh, light, and had the most amazing remoulade. The Veggie Sandwich was hearty and filling with fresh ingredients as well. The service was great, polite, and prompt; everything you're looking for! Washed down with a Jackie O's brew, I was left completely satisfied. I will definitely be back here again."}
{"text":"Was ok.  Not great.   Service was not good.   Food orders wrong.  Talk to the manger.   He made things right.   That what I call customer service.   I would recommend this place to everyone"}
{"text":"Stopped in yeesterday( saturday) after touring the xmas story house. Amazing atmosphere and one hell of a stunning bartender! Didnt catch her name but i wish i did so i could giver her a shoutout on here. A dark haired girl with tatts and glasses. She was fast and we never had an empty beer in front of us. Especially it getting busy from us tourists haha. Gave us suggestions on some other places to try downtown. Will def come back to see her beautiful face again and to enjoy the amazing food and atmosphere. Im from pgh so dont tell anybody i said good things about cleveland ! Haha"}
{"text":"This place is steps from The Christmas Story House.  I didn't even know that when I bookmarked it b/c their food looked good, especially their grilled cheese.  We did NOT eat here, we just came in for a few cocktails after the tour across the street- (you get a 10% with tour tickets Or a Yelp check in)  I liked the bartender and they had a nice selection of local beers."}
{"text":"Fantastic potato and cheese pierogis with grilled onions and diced, grilled green peppers. The mashed potato, turkey and gravy pizza was really good too."}
{"text":"The Rowley shares an interesting history as it a place for good food, a gathering place for Cleveland folks, and it is THE place to go for a snack before or after you've stopped at the Christmas Story House and Museum a stone's throw away.   The Food was really great, as was the service. The place is small, but homey with libations and tasty treats that made the trip really worthwhile. Parking, as is normal for that area, is street or one of the locally owned lots. The prices were good, and we really enjoyed the food and company.  So, before a trip in Christmas Past, make a stop in the present and get yourself to Rowley's!"}
{"text":"One of the great hidden neighborhood pubs, has been around forever but the new menu is what is bringing people in, really good food with a few unique dishes, Loco Moski - Is a twist on a Hawaiian classic. Sauteed pierogies topped with a 1?2 pound hamburger patty, gravy, sautéed onions, and 2 fried eggs. Sounds weird, but it's delicious. The Clevelander Burger- 1?2 Pound Burger, 1 pierogi, kielbasa, braised cabbage, Swiss cheese, stadium mustard - awesome! And the Chicken and waffles on breakfast specials is delicious also. Only down side is, that its a small pub with good food so sometimes it's hard to get a seat."}
{"text":"Came for the pierogies but will come back for the poutine and the mac n' cheese.  Not discounting the pierogies but they absolutely know how to handle the poutine and mac. I also enjoyed the small but classy list of draft mirco brews in the friendly corner bar type atmosphere. Maybe next time I will be brave enough to try one of the Ovaltine cocktails that fit in with the theme of The Christmas Story house next door. And for anyone who is early to rise (or real late to go to bed) they open at 5:30am.  The only downside was the lack of parking going on around that whole area."}
{"text":"Great dive bar. Dawn the bartender is so cool and friendly. The beer is cheap the food is awesome. Thursday is taco night,best tacos I've had in a while. I would aslo suggest the burgers. The people here are friendly. They have an old school bowling machine. Thursday is Trivia Night. They also have 3 nice sized tvs at the bar to catch a game. Its a nice change from the trendy hipster Tremont scene."}
{"text":"Came here at 5AM to get breakfast because we landed very early from a red-eye flight in Cleveland. Called to make sure they were open and ubered from the hotel. The neighborhood is very interesting, with older homes all around but with the house from A Christmas Story right across the street. The bar itself is in an old inn, and the feel of the bar was old-timey and divey. However, the drinks offered were local and hip. When we asked for a food menu, however, the bartender informed us that the kitchen doesn't open until later. We decided to make our own breakfast by ordering bloody marys. The bloody mary that this girl made was one of the best I've ever had. She took a long time to make them, but the result was so good we asked for a second one. When we asked for the check, I had to do a double take because the check said it was $10 for two bloody marys. I thought she made a mistake, because Vegas drinks are about $15 each. It's out of the way, but for a bar being open at 5AM on a Thursday, we had a great and memorable experience here!"}
{"text":"I don't give 5 stars easily as I don't believe in dumbing down the rating system. That being said, this place is quite simply awesome. They are doing the \"corner bar and grill\" the way it should be done. How should it be done? It's simple: good service, great ambience, a fantastic selection of cold beer; both utilitarian and craft, and last but not least, really good food, sourcing local items where able. I had the Clevelander Burger which ordinarily has a pierogi, kielbasa, braised cabbage and Swiss cheese on it. Unfortunately, it was a busy day (the day after Christmas) and they ran out of pierogis, but the sub of mashed potatoes was still great. The fried pickles are the best I have ever had, hand battered and served with ranch and hot sauce. My wife had the grilled cheese. She said it was the best she ever had.  This is a gem in the middle of a working class neighborhood. While you are there, go across the street and tie the \"A Christmas Story\" house. I strongly urge you to try it."}
{"text":"Stumbled across this small gem! Best burger, fries and onion rings I have had in a long time . Very friendly atmosphere.  I look forward to visiting again."}
{"text":"This could be the best dive bar ever and I love that Google Maps can't find it. If you are looking for it, it's across the street from the house in \"A Christmas Story.\" The Rowley Inn is a great place to go with a few friends for cheap drinks and a quiet atmosphere where you can enjoy one another's company. The couple times I've been there it was dead but still a charming bar to hang out in. Pay a visit but don't go in with hipster high expectations or you'll be disappointed."}
{"text":"Great old bar! Original wood bar top is over 100 years old.  The food was great as was the service.  Reasonable prices, fun atmosphere and directly across the street from the \"Christmas Story\" house."}
{"text":"Some of the best bar food in Cleveland! Poutine is amazing (the gravy is home made deliciousness and the curds get all melty) and the wings are huge and juicy( get the garlic parm!) You will not be disappointed (especially if you come during happy hour when a lot of apps are half off!!!! )"}
{"text":"Stopped in for lunch after a stop at the Christmas Story house. Food was great! I recommend the BLT and a side of mac & cheese.  Staff was friendly and the service was fantastic. The next time I'm in Cleveland I'm definitely going back."}
{"text":"Rowley Inn is exactly what you would expect out of a dive bar! You get that awesome hometown hospitality feel and great food to go with it. We specifically chose Rowley for their peroigis and they were awsome! Our peirogi dinner was so big I would definitely split if you are not that hungry or tend to eat less. We also ordered fried pickles, which came as full sized pickles instead of chips (as they often do). Definitely a show trying to eat one of those covered in scorching hot fried dough. They were delicious though!  The best part about this place is the old school bowling machine in the back of the restaurant. We were fully entertained while waiting for our meal (although it was very quick, which was surprsing given the tiny size of their kitchen). It is only 50 cents a game and you get all 10 rounds, fun for the whole family or a small group of friends!"}
{"text":"Awesome place to cure the night shift blues. The staff is always great and accommodating. Especially since they are dealing with a bunch of disgruntled 3rd shifters, like myself. Lol. The food is great. The breakfast tacos are phenomenal. Row let is a definite go to for me."}
{"text":"Fantastic!  If you want food done right, this is your place!  We were visiting from NH, toured the A Christmas Story house and got a 10% discount with our tickets. Finished our tour close to noon so we headed over for lunch and did not regret it. Best BLT I ever had, crisp and buttery sourdough bread, perfectly cooked bacon, just delicious.  A side of onion rings, also cooked to perfection.  One of my best meals ever.  Also, the service was excellent.  It's small and cozy.  A must stop!"}
{"text":"Truly enjoyed meeting the owner, and bartender Bill while we were back visiting for my 30th High School Reunion last month.  The place is 111 years old and a quaint bar/ restaurant located next to the Christmas Story house and museum.  I had a breakfast sandwich that was gargantuan- sarah had a chicken sandwich the size of Elyria.  Quite a bang for your buck.  They give a nice discount to visitors of the Christmas Story house and the portions are huge.  They have a full bar and also some great beers.  The next time I'm home visiting the folks, I'm going to make it one of our regular stops. Thanks for the great grub and conversation gentlemen- it was nice meeting you!  Kevin Blatt and Sarah Peachez"}
{"text":"We 8 people needed to grab some authentic Cleveland feeling food after two days of training. I messaged via facebook from our meeting to see if they could save a spot for us. They did! We were lucky lots of bar seating but not many tables. Worked out perfect and everything was great. Try the loco moski, bumpus hounds both group favorites. Red Ryder, a major award and the ovaltine cocktails were delicious. If you've got a crew to help you try the very rich dessert pierogis (we had cannoli)"}
{"text":"Okay so we came over here after a recommendation from the Christmas Story staff.  This is your local neighborhood bar.  It is a bit of a dive, but that is what makes this place so awesome! The Mr. ordered the chicken tenders and fries, myself I ordered the Grilled Cheese burger.   Oh my goodness the portion sizes of this place and the prices are amazing. If you are looking for a great place to eat that has amazing portions at cheap prices come here.   Staff was a bit busy with regulars, but the friendliness made up for that!"}
{"text":"I love this place. There. I said it. I just couldn't wait until the end of this review. Seriously, if it was possible to have a soulmate in a bar, this is mine. Rowley Inn is a place where I can finally feel comfortable as a 40-ish year old man. Where I'm not adrift in a sea of Millennials spewing you know's and likes with reckless abandon. The crowd here is just right for me. A beautiful mix of sort of middle age and 50+. Quiet, courteous and just right. Like others, I'm reticent. I want to share my experience but I also want to keep this place to myself and the others that already know about this Cleveland gem. Alas, as a Yelper, it is my duty to share and share I must.  Rowley Inn is a neighborhood bar in every sense of the word. Located right across from the famed Christmas Story House, it's situated on an average corner on an average street in an average part of town. Perhaps average isn't the right word. I'm at a bit of a loss. Maybe it's because Rowley Inn is just as it should be. Zero pretension. No aires. It just is and that's perfect.  The inside has a well-worn, historic feel that only decades of loyal patronage can imbue. It feels like a place you've been a thousand times. It has its own smell, it's own sense of light and time. String lights swagged about, a wood bar that runs the length of the space notched by countless elbows and sweaty pint glasses of cold beer. Black vinyl clad seats calling to weary asses. As soon as we walked in I knew. This was it.  The service is pure Cleveland and, for an outsider, may seem slightly cold and distant. I know better. I play by the same rules. We Clevelanders are not about in-your-face, forced hospitality. We don't wear smiles like a mask. We're slightly reserved to those we don't know. We hold back, but only at first. I could sense that if we continued to visit we'd be welcomed into the fold, but it would take time. During our two visits, drinks were always filled. Food delivered to the the table in a perfectly choreographed routine that has clearly played out countless times, and just the right amount of attention. Again, just right.  The draught beer selection is not large, but it's well-curated and features plenty of local love. We're talking Platform, Thirsty Dog, Brew Kettle, Sibling Revelry, all great stuff. They've also got a bottle list with some diamonds amongst the kimberlite. And their happy hour (Mon - Fri 2 til 7) is among the best in Cleveland. $1.50 Domestics and well liquor, $2 off draft beers, wine and specialty cocktails, $1 off imports and craft beer bottles / cans, $5 burger and fries, 50% off select appetizers. I told you it was good.  The food is just spectacular. Incredibly affordable and so satisfying. I want them to make me dinner every night. It's like these guys have decided to call out all other bar fare for the lame, bland, frozen gunk that it is. Everything I've had here has been supremely satisfying, delicious and prepared with an attention to detail that can only come from a cook and kitchen staff that prides itself in a job well done. Everything is prepared fresh and local ingredients abound. Nothing crazy, just simple food executed brilliantly.  Their soft pretzel - among the best in the area - is baked by local Zoss Bakery. Soft and glutinous inside, golden, crispy and salty on the outside. The only downside? Not enough of their delicious beer cheese dip. The spinach salad is fresh, crispy, and perfect for sharing. Bits of crispy bacon, toasted walnuts, funky blue cheese. Two other standouts - the Pierogi and Kielbasa dinner (two local sausages, two deliciously obese pierogi, kraut, cabbage - pure Cleveland in edible form) and the Bumpus Hounds Lunch (a masterpiece, turkey dinner in open-faced sandwich form smothered in gravy and creamy, buttery blue cheese mashed potatoes) are must-try's that I know I'll be having again and again. Oh, and the mac and cheese would make Sara Lee ashamed to use the term. The crispy topping really makes it.  Some other things to mention - they have breakfast all day, their fish and chips is so damn good it will make London question whether or not they're doing it right, and the burger is cooked perfectly with a char that's clearly artist level stuff. Sorry, I'm rambling - and getting really, really hungry.  I know I'm gushing and it's a bit out of my character to do so, but places like Rowley Inn have the effect on me. I simply can't say enough good things here. But you probably shouldn't? come here. Really, you wouldn't like it. It's not for you. Maybe you'd be better off heading down to Professor or maybe over to W. 25th and...I'm sorry. I can't keep up the charade. Make your life better and visit this place now. Just try to tell your \"younger\" friends that they wouldn't like it. We shouldn't have to share it, right?"}
{"text":"Just a stop after The Christmas Story House on the way to Buffalo, NY for Christmas.  Great people and friendly traditional tavern atmosphere.  This is where roots are and I likes it.  I would go out of my way to stop here again en route from the west coast.  Thank ms for the great beer, warm bar, and fantastic genuine conversation. :)"}
{"text":"Great classic hole in the wall with good food and beer across the street from the Christmas Story House!"}
{"text":"Amazing.  Their poutine is great and their burger was awesome.  Made a new friend at karaoke.  Everyone is SO friendly."}
{"text":"I stopped in with some friends during the week for happy hour. The place was packed at 3:30pm, but I think that was because tours started up at the Christmas Story House across the street. Eventually the place cleared out a bit but none of this stopped our group of 5 from having a good time!   We were seated at the corner of the bar and enjoyed happy hour specials like half price poutine ($3.75) and discounts on draft beers ($4.50). Our server was awesome and we all around had a pretty enjoyable couple hours just talking and laughing.   So about the food. A couple of us went with the poutine and we were a bit disappointed to find out that they were out of the regular fries and instead we were served seasoned curly fries. Cheese curds were not even in the slightest bit warmed up. But the gravy was very good. My friends said this dish was great in the past so I am going to chalk this experience up to the place being so busy and running out of their typical food stock.   I did get the The Bumpus Hounds Lunch ($10) to-go. It's basically an open faced turkey sandwich with blue cheese mashed potatoes and gravy on top. It comes with a side so I selected their gouda mac & cheese (+$2) and an extra side of coleslaw ($3) as well. The mac & cheese is freaking delicious! I will have to try it as a entree with chicken mmm. The purple cabbage vinegar based coleslaw was a perfect pairing to cut the fat. Food held up even when refrigerated and reheated.   Minus that poutine issue, I enjoyed this place and would definitely come back. It's got that neighborhood hole in the wall bar vibe to it. Nothing fancy - just good food, good service, and good company!"}
{"text":"Stopped in here after seeing the Christmas story house. I had the loaded Poutine.....omg. So good. Fries, gravy, cheese curds, bacon and twofried eggs.....heaven in a bowl. The peach-bourbon wings are great fried pickles--yum. Saw other things on the menu that the group I was with would love to come back and try"}
{"text":"My husband and I travel from Florida to visit family a couple of times a year, and we ALWAYS make sure to make a visit or two here every time. They always have a great selection of beers and ciders. Their pirogies are to die for! I'm in love with the four cheese, but they were also featuring the jalapeño cheddar flavor, which was a spicy, delicious variety as well! I can't eat them without their kraut, sour cream, and homemade sautéed onions (which are amazing). We always order the German pretzel with beer cheese, it's a bar food staple. Their onion rings are ENORMOUS. The batter on the onion rings and fried pickles are delicious. Honestly, this place is a under-discovered gem of Cleveland. Affordable, tasty, cozy. The owner, Jon, is always there and super friendly. Add in the novelty of being able to see The Christmas Story house from the window, and boom. Magic."}
{"text":"Love this place. Drinks are cheap. Mike the owner and my bartender was an awesomely friendly & talkative guy. No yuppies (except me I GUESS, lol).  Almost don't wanna tell ya so the secret gets out!!"}
{"text":"Absolutely outstanding food. You have to try the bumpus sandwich. The local history here is cool too. This was the place where the producer cut a check to the owner of the house for the christmas story."}
{"text":"This place is amazing and part of what make the City of Cleveland what it is. Hidden in Tremont. Loco Moski, Wings, Burger, or drinks, everything is delicious!!!!"}
{"text":"What a gem. Tucked away in a secluded corner of Tremont that you would only find if you're looking for the \"Christmas Story\" house, it is well worth looking for anytime of the year. Walking in to the establishment you find yourself in an older building with quite a bit of rustic charm. The menu however is a modern twist on comfort food with a few more contemporary favorites. The owner is charming, and really put some thought into a very well rounded menu with something for everyone on it! Skip over the other overly popular (but not as deserving) Tremont locations and stop at Rowley Inn. You won't be disappointed!"}
{"text":"On our road trip though Cleveland we decided to stop into the Rowley Inn for brunch. The only problem I had was trying to decide what to get! All of the food options are amazing, with the service to back it up. Taylor and Sean took care of all of our needs right away with a friendly smile :) The craft beer selection is definitely on point and the bar is unbelievably clean. If you're looking for great food, drinks, service and atmosphere this place is the best Cleveland has to offer!"}
{"text":"Stopped here after a trip to A Christmas Story House. I probably wouldn't have sought it out otherwise, but I was glad I popped in. Great menu, good food, good Bloody Mary and friendly people."}
{"text":"This bar is like a myth.  People have heard of it but either have no idea where it is or if it still exists.  It does still exist and I'm guessing not much has changed over the years.  It's tiny, dirty, dark and just the way I like it.   On Fridays and Saturdays there's karaoke.  They have quite possibly the worst selection of songs ever but I have the worst voice ever so it's all good.  They have an old school bowling machine and pac-man.  Not to be vintage or hipster retro, but because that's what was cool when the place first opened. They have food but I've never eaten here and don't have that strong of a desire to.  Also, it seems like no drink is over 3 bucks.  Most are cheaper.   The clientele is amazing.  Lots of blue collar old men looking for someone to talk to, some with very cool tales to tell.  Younger people wanted to get away from the normal Tremont scene and once a very loud bachelorette party.   Once I came here with some friends.  My one friend brought a very annoying chick that started to put everyone down.  Her efforts were rewarded with one of the bar patrons stepping up and telling her off.  Something I had wanted to do all night, making this place even cooler."}
{"text":"3 adults and 2 children for lunch total bill $79.26 plus tip WOW. Corn beef sandwich was terrible, BLT half the bacon not fully cooked, other 3 lunches were ok at best. Don't think I'll be back."}
{"text":"Great dive bar. Loses a star because the kitchen isn't open yet. Just remodeled and waiting on the Fire Marshall to clear them. Waitstaff was amazing. Beer was cheap. Right next to the \"A Christmas Story\" museum so it's a logical stop."}
{"text":"It's definitely off the beaten path, but glad we made the trek over here from Downtown. The pretzel appetizer was delicious and definitely worth getting. I did a DIY burger with ranch, bacon and provolone - it was delicious! Fries were just okay, ketchup wasn't Heinz :(  Service was excellent! Prices were pretty good! Even better with the Yelp 10%!"}
{"text":"Lots of history is tucked inside this local gem. And some really tasty eats too!  The Rowley Inn has been in business since 1906 and during the filming of A Christmas Story, it was THE place to be. The upstairs was even used for wardrobe and makeup.  It looks like a typical cozy dive bar, but thanks to the new owners, the menu offers up lots of not so typical dishes that will have you coming back for the food.  To get the word out, they hosted some local bloggers and invited us to try some of the menu items.My favorites were the shrimp cocktail, mac 'n cheese, the chicken club and the Clevelander burger. That bad boy includes  pierogi, kielbasa, kraut, beer cheese,and Stadium mustard. Definitely tastes like Cleveland!  I honestly have to say that I really enjoyed pretty much everything. The only thing I didn't care for were the fried pickles. They are beer battered and I prefer mine with traditional breading.   It's not the healthiest menu but it's really great for when you want something delicious and hearty. Try the brunch too. Dee-lish!"}
{"text":"The feeling you get walking into the Rowley Inn is very different from other places in the Tremont neighborhood. This place feels like a local bar, and when I cam in around 12 pm on a weekday the 4 other people were no doubt the \"usuals\". I sat at the bar to order a beer and a burger, and the waitress while friendly was a little strange.   But, when the food came out I was stunned! My burger looked and tasted amazing! It was actually a different burger than the one I ordered, but at the sight of it I was happy for the mistake. Beer selection was ok, service was ok, food delicious! Definitely will be back!"}
{"text":"I went to the Rowley Inn for lunch before visiting the Christmas Story House. The food was phenomenal! I got the fired pickles and the Mac n'cheese with kielbasa. It was amazing and a huge portion, I couldn't finish it all! I highly recommend it!"}
{"text":"We visited this evening, after seeing great reviews on Yelp and Urban Spoon. Arrived around 7:45 pm to find  trivia wrapping up and one other table. Having never been before we weren't (and still aren't) sure if table service was offered. We sat for 10 minutes with no greeting, then decided to grab a beer from the bar. Again, returned to the table and sat for an additional 20 minutes with no waiter.... the place was nearly empty and I am very disappointed in the fact that we were not looked as we were looking forward to giving it a try."}
{"text":"This hidden gem is located next to the iconic \"A Christmas Story House\" its small in size but the service and food are unbeatable. We had planned to  eat here even before we found out you get a 10% discount with your tour ticket from the  ACS house because of the fantastic reviews. It's definitely a place to find when in Cleveland. You won't be disappointed.."}
{"text":"Perfect dive bar...comfortable, groovy and cool. Don't change a thing"}
{"text":"Now under new management, the already-excellent Rowley Inn recently launched a new menu that I could not be more excited about. I had the privilege, along with a few other local bloggers, of attending a sneak peek tasting of the new menu, & it just served to solidified my existing love for this place.   Want pierogis? The Rowley Inn has got pierogies, in nearly every form & flavor. For brunch, you can get them tossed in your choice of wing sauce. For dinner, you can get the Cleveland burger, which is topped with a jalapeño pierogi. For dessert, try their caramelized apple pierogi, reminiscent of Little Debbie's miniature apple pies, but homemade & infinitely more satisfying. Oh, & don't forget the Loco Moski, a Cleveland take on a Hawaiian favorite: pierogis topped with hamburger patties, gravy, & fried eggs.   Of course, the menu isn't all pierogis (not that I'd complain if it were). They also serve chicken & waffles, a variety of salads, fried pickles, & plenty of other incredible-sounding options for all three meals of the day. The Rowley Inn used to be a bar with good food; now it's a great restaurant with a bar. And speaking of the bar, you'll definitely want to try their new Red Rider cocktail, made with Bulleit bourbon. Get it? No? Here's a hint: The bar is right across the street from the Christmas Story House museum. Brilliant!  This cozy, unassuming little spot in Tremont is one of my new favorites. See you there!"}
{"text":"Amazing burgers. Good fries. The beer flight was good. Build your own. I asked the bartender to make one for me- my fault. I ended up with a raspberry beer. The old school bowling game was a lot of fun. Best part of the night was the trivia night I ran into. It was great to go meet some local people. I will definitely be back."}
{"text":"Awesome place. Food and service were excellent. We had the loaded poutine which was absolutely delicious. And the kielbasa omelet was delicious as well. Drinks are strong and very reasonably priced. My husband had a Pecan Porter from a local brewery called Saucy brew and he absolutely loved it. We will be definitely be returning to the Rowley Inn."}
{"text":"A humble palace devoid of decadence and located within stumbling distance of the famed X-mas Story house, the Rowley Inn is a neighborhood relic of the highest order. An antique bowling machine looms in one corner, rusty and wise. Craft bottles (Mad Elf, Platform Gose, et al.) are half price after 5 pm on Mondays. The onion rings are greasy as Dive tradition dictates, served hot and crispy on a white oval platter with a squeezer of old school ketchup. There's poutine too, in heavy bowls. And a slight cocktail menu. The other night, smooth jazz resounded from overhead in a baffling accompaniment to the Cavs game. The bartender, snarky but adroit, served with practiced precision. There's a ragged poetic sensibility here at RI. Gentrification has yet to invade and morph its ancient rhythms. That's real wear on the bartop, dear reader, not some clever facsimile distressing. You'll feel genuine as you get plastered slowly on a swivel-stool, transformed into a symbol of the old world yourself, a sign among those on the walls, gathering within yourself the dusty glimmer of yesteryear."}
{"text":"The four stars are just waiting to be boosted to five when I actually try the food, which sounds promising. As a bar, it's all you could ask for: Dirt-cheap drinks served by people who manage to be simultaneously surly and friendly. No cutesie hipster irony. Gritty not scary. The all-important bowling machine. I feel like a fool for not trying this place sooner."}
{"text":"Great cheap food and drinks ! Nice atmosphere, place has been there since early 1900's.  Staff, very friendly.  Across from the Christmas Story House."}
{"text":"I must say I loved this place. Very Divey, old school atmosphere. The food and drinks were Awesome. The price was spot on too. I had the Grilled cheese with mashed potatoes, which were awesome."}
{"text":"More people need to check this gem out. It's a bar that serves first thing in the morning and feels exactly like what you imagine Cleveland was in the industrial age... pure rust belt hospitality."}
{"text":"Rowley's is a classic neighborhood bar, the kind you would expect to find in a very chill residential section of Cleveland that would be dead quiet if not for the Christmas story house and museum across the street.  At the time I was there, the place was still under considerable renovation, with much of the bar still in disarray from the changes.  However, the dirt cheap drink prices, and $1.50/beer happy hour special more than made up for the inconvenience.    I enjoyed a few pierogies and chicken wings while watching people come and go from the Christmas story house.  I'm sure these crowds pick up around the holidays and make for great people watching.  The food was good, but only after we figured out what menu items were in stock.    I would definitely return to this bar when renovations are complete since those drink prices and classic residential-bar are hard-to-beat."}
{"text":"This place was the absolute example of a corner bar with lots of flair!!!! The location was scary yet magnificent. Located on the corner of which seems like a sketchy street, yet diagonal from a Cleveland legend, The Christmas Story House, which was deceiving bc in the middle of February was completely packed. The food at Rawley Inn, was better than just bar food, with lots of flavor and flair. My favorite was the poutine, which I've never tried before, but will return for. I'm adding, the draft beer list was small but satisfying. The rest of the food was delicious and the owner John was super friendly and inviting! I will absolutely return!"}
{"text":"This is a good bar, close to the legendary hangout of Cleveland superhero's - The Clark Bar. This place has an old school mechanical mini-bowling machine that should be a national landmark on it's own. It has friendly service and is down to earth and has not yet turned trendy, hipster or douchy."}
{"text":"Stumbled upon this awesome neighborhood bar while visiting Cleveland. My friends and I spent a couple hours there on a Saturday afternoon and we were blown away when we got the tab! Dirt cheap!! The bartenders were very nice and very attentive. They totally could have gotten away with charging more, that's part of what makes the place so great. It's sort of a dive bar, but that is a-ok by us."}
{"text":"After visiting The Christmas Story house we were hungry.  As we were walking up to the door a family was walking out.  After a brief conversation, we decided to give it a shot.  The Inn was busy but only because there isn't all that much seating. We sat at the bar.  One thing I loved about this place is that it is a neighborhood bar, love those bars.  The Inn had quite a few different beers on tap.  I laughed when the bartender poured my daughter a 22 oz pop, the straw disappeared into the glass.  Food was decent and the service was great."}
{"text":"Yes!! Big Ball Bowler!! A great place, friendly staff, good beer and opens at 5:30 am. All you need for a good time."}
{"text":"Decided on The Rowley Inn when looking for a brunch place to have book club. I have never been and stumbled upon it on yelp.   The place is intimate and welcoming. There are only about 5 tables but there is ample bar seating. We had a group of 7 and our server was every bit accommodating as wonderful.   The drink menu takes names from the Christmas story house and are strong and delicious. They also have bottled root beer which was soooo good.   The menu had a lot of choices. I ended up going with the chicken and waffles. It was served with hot sauce and gravy. So it's a little more on the savory side. I asked for a side of syrup to give it a sweet kick for me. It was delish and the chicken was dried up perfectly. The home fries that come with it are so crispy. The others at the table got sandwiches off the brunch menu and they are big and super good. Everyone was happy.   Really was impressed with this place and can't wait to come bAck!"}
{"text":"So this place brings me back to my youth it's one of those places that everyone knows your name. Great drinks and food and atmosphere.  We plan to make this a regular stop."}
{"text":"Thursday is trivia night and it's a blast. Also, taco nite! They deep fry their taco shells and they make homemade nachos for the taco salad."}
{"text":"Friendly neighborhood bar with cheap drinks . Bartender is friendly and always look forward to stopping in this place when coming into town ."}
{"text":"This place is the bees knees! I rarely comment on this stuff, but jeez oh Pete it was delicious. It is your typical American bar food, but all feels very homemade which is rare nowadays. I had a burger, fries, and a pretzel. My gf somehow made an amazing selection lol! Seriously though.. I highly recommend his hidden gem!"}
{"text":"We got a LOT of food for $22 - Matt the owner-bartender is very nice. We were here on a Friday night and it wasn't overcrowded, no blaring music, and oh, not an ounce of pretention. Honestly, I left thinking I hope not a lot of people find out about this place. Let them have the Tremont Trendies ... the locals need to keep these hidden treasures for themselves."}
{"text":"The greatest owner and employees I've ever met!!   My boyfriend and I went to here on 3/15/18 we were from Massachusetts and we stopped here to eat. Hands down the greatest corn dogs I've ever had and the boyfriend cleaned his plate off when we had the loco moski. Besides the amazing food, I accidentally left my purse there and I was worried to death about it, I knew I couldn't turn around the car because it was too late by the time I realized I left it. The owner was so kind and nice that he told me that he would be able to ship it back to my house for me. There's not a lot of honesty in the world, but this spot definitely has the kindest hearts and cares for their customers. WE LOVE YOU ROWLEY INN!!"}
{"text":"I spent the entire time swatting flies off of my food and away from my body. Complete bar atmosphere and smells of wet rags. Seems like the type of place where they have regulars who feel they can do/act as they please (they were extremely loud and obnoxious, and clearly knew the employees). The fried pickles were awful and took 15 minutes to come out. Server was nice, pirogies were good. Not good enough to go back."}
{"text":"I have returned to try the new menu and it is great. Had the breakfast burger and it was huge! This is still a local pub with all the local characters  (some guy was carrying a cat in a shopping bag) let's just say the cat was well behaved and the dude was a hoot. I will be back next time I am in town."}
{"text":"Rowley, I should be giving you five stars but you know what?  I like credit cards and you see, you don't take them.  So anyway, now that we have that all clear:   The Rowley Inn is caty-corner (that's obviously not how you spell that) to the Christmas Story house.  In fact, all winter Ian (who played Ralphie's little brother, Randy in the movie) would often be found drinking at the bar.  Side note: Ian doesn't laugh when you ask him to eat like a piggy.    The Rowley has a few noteworthy things that haven't been mentioned: First off, it's been around since your parents and possibly your parents parents have been there and you know, nothing has changed.  There is still a strange old mural on the wall that has obviously succumbed to decades of tobacco abuse.  There is also a juke box which, though nothing fancy, you'll find plenty of hipster-approved tunes.    In addition, there is also a taco night and karaoke on Fridays and Saturdays.  Honestly, I'm almost hesitant to talk about either for fear of it getting 'sold out' like Tina's or LPP on Tuesdays, but hey...anything for you Yelpers, right?  So uhh....yea, Rowley is awesome.  The beers are cheap and there are my three favorite things (music, tacos, karaoke) so this bar is a real keeper in my book."}
{"text":"Been wanting to check out because of high marks from Yelpers. My daughter and I went for lunch today.    Was fairly busy for a Friday at 1PM but it is obvious they cater to the crowds going to The Christmas Story House so guessing a good part of their business is from this crowd.   We sat at the bar and were immediately greeted by a friendly bartender. He suggested a new beer on tap that we were both very pleased with, Jackie O New Growth.  The menu is quite extensive for a corner bar. We decided to split the Reuben which was very good. It was not huge like some other Cleveland establishments but was adequate. And corned beef very tender and tasty.   Crowd and vibe is corner bar friendly. Nothing fancy here, but if you want a comfortable place to eat some darn decent food, this is the place to come."}
{"text":"What a great place, I wish I had a local spot like this in my neighborhood.  Awesome good, great service and the drinks were perfect.  Thank you for the great afternoon."}
