{"text":"I love this spot, the team is amazing.  The only things I can say is that I've noticed the spot is always dead. From an outside perspective and someone who's into marketing there's a lot of things wrong. Few examples. The menu. You're a restaurant not a take out, although amazing, the amount of food you serve is over the top and doesn't leave room for smaller portions. Also as a Jamaican SOME of the food isn't that great, the mains specifically.  Example coleslaw is very very bland.  I want to help more with marketing and will be getting in contact with the owner because I feel like I could make more from what you have now. Jamaicans have some of the most amazing dishes and I'd love to see y'all take it to a different level actually, in the kitchen."}
{"text":"Ordered last night through Foodora and wings were 5 stars, juicy, smokey cooked flavour (most likely grilled not deep fried, incredible authentic jerk spice and nice heat!!!  The quality of the chicken was very fresh and nice size drums and wings.  Huge fan!  Where did it all go wrong from there?  Ordered Jerk Shrimp plate which included rice with lentils with a tasty pineapple relish still pretty good expect the shrimp was tasteless under seasoned and shocker considering how good the wings were.  Also the coleslaw was just cabbage with mayonnaise, found that to be terrible.  Very inconsistent but would give them another chance and try other items on their menu."}
{"text":"Apparently this place opened a week ago, and boy am I happy it did. Roywoods Ossington shares proprietorship with Roywoods on Fort York, but apparently not its kitchen. The vibes here are also super different. I've never been to the Fort York location, but from pictures I gather it feels like a cafeteria.   Not their Ossington location. With their new spot, they've managed to blend in with the young, night-loving neighbourhood while standing out in a pretty conspicuous way: light strings adorn the ceiling, making the place noticeable to pedestrians.   I came here on a Thursday. NAV and The Weeknd blasted through speakers as I ordered Jerk Wings ($10) and a New York Sour (Bulleit Bourbon, lemon juice, simple syrup, and red wine - $13). The woman working the bar was super friendly and happy to talk a bit about the place and menu. She explained that the New York Sour skipped egg whites for vegans' sake.   If you're a vegan, this may be a great place to drink. The bourbon/wine combination was unusual and worked surprisingly well, with the tartness of the lemon complimenting the earthiness of the rest of the drink.   As far as food, I can only speak to the wings. I've thought about cutting meat out of my diet for a while, but food like this makes it tough. The wings were hands-down the juiciest, meatiest wings I've had in ages. These aren't your average over-fried pub wings. The jerk rub is great. It could use more heat, and would be nice if there was even more of it to really show off the flavour.   If the cocktail was a bit expensive, the wings were perfectly priced. Would highly recommend them to anyone. Overall, I'm very happy this place opened up. It's open until 11:00 p.m everyday (according to my Google search), so will definitely make it my new late-night eats spot."}
{"text":"Tried to eat here but unfortunately the chicken made me sick for 3 days, vomiting and explosive back door. It's great if you like food poisoning, otherwise perhaps avoiding it would work better. Also, they play awful music that they think is cool."}
{"text":"Gord and I had supper this evening at Roywoods Ossington.  They have another location on Fort York Blvd. (I've been to it and liked it) and recently opened this one on Ossington Avenue.  The walls in the rear are lined with album covers.  They have Red Stripe beer ... yum!  I ordered the Jerk Chicken Plate.  I ordered it without coleslaw or veggies so they gave me extra rice.  The chicken was boneless and the jerk sauce had a nice kick.  I'd get it again.  Gord surprised me by ordering the Jerk Shrimp Plate.  He's not a fan of jerk and he enjoyed it.  He said he'd get it again.  There was lots of shrimp and they were huge.  Nani was our server.  She was really friendly and took good care of us."}
