{"text":"Is it a small mall food court eatery? Yes. Is it nonetheless delicious food? Overwhelming yes!   Although the Thai food they offer isn't as authentic as bonafide restaurants (the local sweet mango is my favorite), I make it a point to go to here whenever at the mall. They offer sriracha sauce to compliment meals and the staff is quite friendly. While not mind-blowing, when considering the context in which Ruby Thai stands it is very tasty food.   Protip: tip them a dollar in cash and they will give you a frequent customer card, six meals then a free one.  Protip #2: there is a $5 credit card minimum."}
{"text":"Nice pad siew! Best pad siew in Toronto which tastes so good and similar to the one I used to have back in my hometown Malaysia!!!"}
{"text":"I've been here a few times. The lines for the custom ordered soup or noodle dishes are absolute bedlam - had no idea where to line up and where to order and there are at least ten other people at lunch who also are just as confused. Ordered from the pre-made bar a few times. Really good Manchu-wok/Szechuan style food. Ordered from the soup bar once, not overly impressed.  My friend ended up with food poisoning that afternoon. Not conclusive but a little suspicious."}
{"text":"First visit was disappointing.   I ordered a veggie combo for 7.56 inclusive of tax.  The noodles were good, not over-salted. The green beans were tasty. The disappointment came from the eggplant.  The sauce's base must be ketchup. I could not eat it.  There are not many choices for vegetarians.  The options being green beans, tofu, eggplant and broccoli."}
{"text":"I LOVE THIS PLACE. They are always handing out free samples and the food is always fresh and tasty. Had the mango chicken on my most recent visit, crispy and delicious. The rice was good too. About a little over 5 dollars for a large portion. 10/10 recommend."}
{"text":"The food court really misses a pho place. Ruby thai noodles are ok but really not anywhere close to \"good\". Their soup base which is the main part does taste much. There is no hoison sauce or spicy sauce on the side to make it up either. I still go there since I dont know any better alternatives but it doesn't taste too great."}
{"text":"So I really like the noodle soup at this place . Mostly the Tom Yum but I have to say that the service here is terrible there is this lady who works at the noodle soup place the (First Lady in line)who is always yelling at you. There is a line of about 3 of them managing that station and they are all yelling questions at you all at the same time asking what meat , veggies , drink all at the same time. I know they want to be fast but that's ridiculous .  The service is very off putting, the food is decent but the service is what gives them a 3 star only ."}
{"text":"I would give this place 4 stars if I could, food is generally good. I'm a fan of their noodle soups and go 2 to 3 times a month there. But today, I ordered roasted duck with guilin noodles and when I opened up my meal there were French fries in it!! No jokes. So weird. Unfortunately I already walked back to the office so I wasn't about to trek back."}
{"text":"First off this place is actually called Ruby Thai Kitchen. It is located inside the South Park Center Mall in Strongsville. It is on the 2nd level in the food court. I got my order to go.Which I believe really gave my food a chance to come into its full flavor. I have been to this mall several times now in the last few months and I am going to say that I would go back here again and even look forward to it. I chose not to have any rice or noodles, just the entree itself. A shrimp curry, it was fantastic! I was really happy about my choice. They seem to have a high turn over so everything looked freshly cooked. My food was very good. Inexpensive as well.  If you like Thai then this is a place worth checking out."}
{"text":"I ordered the vegetable lo mein with the bang bang chicken. Chicken was cooked well. Food was pretty great for a food court restaurant. Didnt give it 5 stars stars because the lo mein could have used more vegetables besides just onions."}
{"text":"First visit and was thoroughly impressed. I ordered the noodle soup where you can customize your meat/protein, you noodle type, and your soup base.   My choice was beef, with rice noodles, and Malaysian laksa soup and it was delicious! The beef was tender and flavourful and the soup was aromatic had great depth of flavours. The dish is nicely garnished with bean sprouts, bok choy and tofu.   Will definitely return to get my Asian curry soup flavour fix! Highly recommended for $8.23 (tax included)!"}
{"text":"Ordered a flat rice noodle with tofu and braised beef in clear soup. Not bad for fast food, and did its role (fill my starving stomach) fairly well. Obviously not an authentic Thai restaurant given that its employees spoke Cantonese, but it was decent."}
{"text":"If I could give it ZERO stars I would. Efficient staff but I paid $8.91 for a shrimp wonton soup that only had TWO wontons in it. Broth had too much lemongrass in it and was so strong in lemon flavour that it was inedible. Went back to complain and they didn't do anything."}
{"text":"One of the busiest places in FCP food court.   The lines may have insanely long, but they go by pretty quickly (the noodles line up).   For around $8-$9, you can get a custom bowl of hearty noodle soup, whether you want tom yum, Laksa or spicy. You also get a choice of different types of noodles."}
{"text":"My review is based on them being a mall food court eatery. You can't exactly call a food cart a five star dining experience and I haven't heard of a mall food court restaurant receiving a Michelin star but nontheless mall food is food. Ruby Thai had really decent food for a decent price. They even have those cool little drinks from Asia that have the ball on top and you have to pop it in.  For some reason every other place was packed durin lunch and they weren't. I gave them a try and I wasn't disappointed. The bang bang chicken is a perfect amount of spicy. Noodles were average though. Nothing special with the noodles.  Overall, not bad."}
{"text":"Welcome to Ruby Thai.   There are three lines that move concurrently. The left is for made-to-order noodle soup, middle is for prepared Chinese food, and I will figure out the right one in due time.  I had the Beef Brisket with Shanghai noodles, soy sauce marinated boiled egg and the spicy beef broth. Very aromatic! The beef brisket was tenderly chewy and the broth wasn't overly-salty - did not have to drink copious of water post-meal. Nothing special about the Shanghai noodles, doe. Good amount of toppings (veggies + meat). Pretty good for $7.90.   For reference, the nutritional information can be found here: http://irg168.com/rubythai.html"}
{"text":"Confusing as all hell during the lunch rush.  Let me help.  There are three lines. Far left: made-to-order noodle soup. Middle: made to order pad thai, Singapore noodles, etc. Far right -classic mall food court steam line.  I usually get soup - barbecue duck being my favourite, even with having to negotiate bones. If I'm not in the mood for that then pork is good too.  The soup options are good - laksa is my choice most of the time, a coconut/curry kind of thing from Malaysia. Vermicelli are the easiest noodles to battle with too, they don't clump up so badly.  For a cheap feed it's decent, I've had better pad thai but the Singapore noodles are delicious."}
{"text":"Ruby Thai's soup noodles is so legit and the best Asian food court meal. Choice of noodles (egg noodle, rice noodle, vermicelli thick/thin) , soup base (clear, spicy, tom yum, laksa, guilin) and meat (beef brisket, chicken, char siu, wonton, etc.) I'm impressed with the variety & quality. I always get the beef brisket  - it's so soft and tender!! The BBQ Chicken is amazing as well, full of flavour and not dry at all. It also comes with choice of egg or tofu. For noodle & soup, I like the vermicelli in laksa. Great lunch choice for under $10. Best taste and value in downtown!!"}
{"text":"Food: 3/5 Service: 2/5 Location: 3/5  The chicken pad thai was tasty, but nothing special - pretty much on par with Thai Express at $8 a bowl. Similar to Thai Express, the pad thai and pad sew is fried up in a wok when you order. They also offer made-to-order noodle soups and a more Manchu Wok-esque scoop and serve combo menu on the other side. However the line-ups were confusing since they had 2 to 3 different line-ups going at once for the different options. During the lunchtime rush it took 15 minutes before they even got around to making my order. They also managed to confuse my order (probably because it was so loud and everybody was shouting when I was trying to give my order), giving me rice instead of noodles. On the bright side, they were willing to fix their mistake and made me another pad thai right away.  Overall this might be a good place during off-peak hours, but I would avoid the hectic lunch rush.  EDIT: I came here when the rush wasn't as crazy and it was totally fine. Got a noodle soup with beef brisket instead and it was alright. Nice amount of veggies, they added a soy sauce marinated hard boiled egg, but the beef was a little tough. Upgraded the rating to an A-OK!"}
{"text":"Reasonable price in financial district. Had hot soup egg noodles with beef brisket. I got the spicy flavoured soup option. They add either an egg or a piece of fried tofu (your choice). But since I was there late for lunch today, only tofu was left. They usually add some Shanghai bok Choi and some Cilantro. Today I didn't like the beef as it had \"animal\" smell if you know what I mean. I'll still go back though because they have lots of other options like stir fry on the spot or ready to eat combos."}
{"text":"The food doesn't taste the same, it seems like the new management doesn't know what they are doing."}
{"text":"My favourite lunch spot on the weekdays during work.   This is what you need to order from the Noodle Bar:  Item #4 - Guilin Noodles - Choice of: Marinated Egg or Tofu (I always get the egg) - Choice of: Spicy or Non-Spicy broth (opt for the spicy! It's actually not that spicy)  I've shared this order with 5 friends/colleagues and they all LOVE it and always come back for more. And, at under $8, the price-quality-taste-value can't be beat.   I've tried other items on the menu below, but always end up defaulting to my #4 Guilin Noodles order.  The Malaysia Laksa soup + Vermicelli noodles + Beef is very flavourful, spicier than the Spicy Broth, and is a bit too salty for my taste.   Note that there are 3 lines at Ruby Thai: the noodle bar (made to order), stir fry (made to order), and the pre-cooked food line. I've only tried the noodle bar, and it's only available during the lunch hours."}
