{"text":"Love, Love, Love this food! Always fabulous! Prices are terrific too! Friendly service too!"}
{"text":"Street tacos are awesome and really priced nicely! However if you are a big water I would not recommend the street tacos..."}
{"text":"I tried out Rubys Food truck tonight. Ordered the adobada taco and a carne asada quesadilla. The taco was awesome ! The quesadilla had good flavor but once I bit in I found a hair in my quesadilla. I immediately called back and they offered a new quesadilla, refund, and were sincerely sorry. I still recommend it but I want Ruby's Food Truck to still be accountable on yelp. My advice is to still give it a chance but if food safety is really important to you like me I say skip it!"}
{"text":"My boyfriend and I are Ruby regulars. At 7:30pm they pull into their spot at the car wash on Thunderbird just west of the 101 and you can expect them to be there for you until about 11:30pm-midnight. We crave their tacos throughout the week and have them for dinner at least once if not twice a week. Can you blame us? They're delicious and the price is amazing, $1.50/taco. We get 3 tacos each, chips with pico de gallo and guac and have our filling, amazing, best tacos ever dinner for $10. When it's not freezing we usually eat there at the food truck tables, but in the winter we call in our order and just pick it up and go. Ruby and his daughter are the nicest people to work the truck and I've never been disappointed with anything on their menu. Even though I usually stick to tacos, it doesn't hurt to add on a perfect churro or switch it up to a quesadilla or burrito. Yum all the way!"}
{"text":"We were looking for some Mexican food late at night but I am sick of all the Bertos. So we saw this food truck on Grand and decided to stop. I must say we were not disappointed it was really good food. The green enchiladas were great and the tacos we're awesome. If you looking for something fast open late and great food this is your place."}
{"text":"My friend and I came tonight. It was amazing and my first time trying it. My friend loves it and goes all the time. I wish they were open for lunch so my mom could try it since she only stays on this side of town in the afternoon. I got the shredded beef chimi and it was to die for! I'm super impressed and will be back for sure! I love Mexican food!!!!"}
{"text":"You must stop to try Ruby's! Always greeted with a smile!  On several visits, I've tried the loco burrito, chicken tostada, chichen tacos & fish tacos.  All excellent choices!!! Delicious and very flavorful!!! Don't pass this Peoria gem!  Friendly service too!"}
{"text":"We love Ruby's! There al pastor tacos are amazing, full of fresh pineapple and flavorful meat.  All their tacos are tasty and everything we have had here is delicious. The custard filled churros make the meal.   They are also very friendly and provide great service!"}
{"text":"They're deep fried shredded beef taco is the bomb their tacos are good they're all tacos are good everything on the menu is good I highly recommend just taco truck they're the best in town 10 + 10"}
{"text":"I love this food truck, its directly across from my apartment complex which makes is extremely convenient. I eat here at least once a week, its just that good. Ruby is one of the nicest guys, and he makes fantastic food. Highly recommend the pastor taco's, the churros are dangerously good, and make sure to get chips and pico with your order."}
{"text":"I was excited for the taco truck on this side of town but not impressed. Not enough meat, I was able to make a rolled taco with 1 tortilla. I would rather go to Mixteca. The hard taco was good but again would rather go to Mixteca."}
{"text":"Great authentic Mexican! Love the hard tacos and the Adobada and Al Pastor street tacos."}
{"text":"Ruby's food truck  has delicious mexican food. Their staff is friendly and the prices are affordable. P.S. The beef chimichanga is too die for"}
{"text":"Food truck done right! So many food trucks aren't friendly or accommodating, and many of them just don't care about customer service or their product. This was a VERY pleasant change of scenery!  We ordered carne asada tacos, chicken tacos, green chile chicken enchiladas, and a quesadilla. Our friend ordered a taco salad, no sour cream, on a separate tab.   Food was prepared rather quickly and man was it delicious! Chicken tacos were seasoned well, my son said the enchiladas tasted just like grandpa Horacio's, and my younger son, the picky eater, loved the quesadilla.   They accidentally made our friend's taco salad with sour cream so they were super nice and remade it for him. Then, instead of letting the extra taco salad go to waste, they offered it to us for no charge!   Ruby himself was doing all the cooking and he's a very sweet man. The woman taking orders was also very sweet.   Overall great experience, we'll be back!"}
{"text":"Good food. I'm not sure of their times because I came when Yelp said it was opened.. around 8pm on Sunday but they weren't there.  Anyway this is a food truck in a non-shady area so that's good.  The steak and adobaba pork tacos are great. The tacos are small but you can get  4 of them for 6 dollars so that can fill you up. The chimichangas are huge and would be the thing to get if you're really hungry. Burritos would be for inbetweens :)  The seating is pretty good and more importantly, the area is well lit so feel free to stay to eat. It's barely getting chilly outside at night so it's nice outside. Look for that neon \"Open\" sign when you are near!"}
{"text":"The best Mexican food around. I've tried almost everything on the menu and it's by far my favorite place to grab a quick bite. If you're looking for street tacos, this food truck is the perfect place for your needs. Enjoy!!"}
{"text":"I usually don't mess with food trucks but a coworker put the stamp of approval on Ruby's, so I decided to try it out and its was pretty damn good."}
{"text":"My family regularly gets tacos from Ruby's.  At least once a week.  We usually order 8 carne street tacos which is perfect amount for my husband and I (and 1 yr old).  The carne asada tacos come on two corn tortillas, carne and onions with cilantro.  We also get salsa and limes to go with them.  I crave these tacos. So so good!!!"}
{"text":"I'm very disappointed in this place because there wasn't a place for me to really review the hours that was said that they were going to be there was false and I had drove all the way from Litchfield Park just to go and find a food truck coming from Los Angeles there's one in every corner so finding that this place was good and that the hours were late I thought it would be perfect but as I arrived there was no food truck to be found very disappointed they need to be a little bit more professional I wasted gas and my time"}
{"text":"I love the food the chips are very fresh. I ordered the chicken enchiladas very good. I also ordered the steak tacos and burrito and that was very good also. A definite must try you wont regret it. Last but not least the customer service excellent money well spent."}
{"text":"So I'm always open to new places. Saw this place driving by and stopped in to get tacos to go. I have to say pretty darn good. Flavorful meat and a good amount. Only downsides was watery sauce I like the chunky kind homemade of course also I really am a stickler for cleanliness and you cannot see in this truck at all. . But otherwise great food. Friendly staff."}
{"text":"Tried out this food truck last night. We have driven by so many times and finally decided to stop. We tried the chicken quesadilla, three street tacos (chorizo, pollo asado & pastor) and the Burrito Loco w/ adobada.  Our favorite was the pastor taco with pineapple. So good! We will definitely be back to try some more. Everything was fresh and flavorful. Watch out. The guacamole is a bit spicy."}
{"text":"You want good and tasty food get some tacos and a churro from Rubys they are soooooo gooooood!!!!!!!"}
{"text":"I don't think I've ever left a review on Yelp but I just had to for Ruby's Food Truck. I've been wanting to stop here and had the opportunity tonight. I ordered chicken enchiladas. These were the best that I have ever tasted. Amazing! Can't wait to try the tacos."}
{"text":"I absolutely love ruby's food truck. The food reminds me of Mexico. Great prices for the delicious food. Love you guys!"}
{"text":"Saddened to learn about what happened to this wonderful family. This has been a weekly regular of ares for years. I hope and pray there able to recover from this.  Hands down best street tacos in the west valley. The father daughter team put there heart and soul into each dish made and the hospitality to match."}
{"text":"So so so good! Inexpensive! And awesome service! I don't know what I would do without this place."}
{"text":"Fish tacos were delicious! And they were super friendly and speedy with the food! Also, yummy horchata!"}
{"text":"So delicious! Chicken soft tacos are great, lots of onion and cilantro. Chicken enchiladas are also great! Haven't tried the beef or pork yet. Only complaint is that it would be nice to have an option of rice or beans (mostly rice) to go with the tacos and burritos. But I'm impressed with the service, seems to be very clean and fast. Hope they stick around!"}
{"text":"The food quality is good. I ordered carne asada and al pastor tacos, where's the beef? The al pastor tacos were sweet but the pork was not marinated enough."}
{"text":"Absolutely delicious.  Very unexpected we have eaten there various times and always satisfied!"}
