{"text":"Food is alright but the worst part about this place is their meal hours. They are conveniently located in Atlantic Aviation (the General Aviation FBO) so patrons of the FBO just may be most of their business? Very often we (flight crews) leave there in the morning and want to take a sandwich with us for lunch. BUT, they won't sell you a sandwich before lunch.   It's not that they can't, they won't. Patrons are told \"I can make it, but I'll get in trouble\". The manager needs to wake up and realize who their customers are."}
{"text":"Great staff and food! Everything is fresh, and made from scratch. This is a must stop for the traveler with an apitite for the finer things in life."}
{"text":"Always good food served by wonderful staff and Chris the manager. 

New specials everyday. Prices are great and portion sizes are usually big. 

Awesome place to get a bite before heading out of the Atlantic terminal."}
{"text":"I ate here a week ago and I just have to say Cheyenne and I think she said her name was Desee? We're both fabulous! Super friendly and helpful! I will be back for sure!"}
{"text":"What a pleasant, tasty surprise! This cafe in the executive jet terminal on Tropicana Ave serves up delicious food! I had the burger...it rocked! Service was quick, friendly, engaging and welcoming."}
{"text":"Was here for lunch today and enjoyed an Italian Hoagie with Pasta Salad and Homemade Cream of Celery soup.  It was all soo delicious! The service was great!  You can sit in or take out.  Either way the food was really Great!!!"}
{"text":"These guys are awesome. I'm such a picky eater due to my food allergies, they are always so patient with me. They make everything perfect and always remember my weird orders.  Everything tastes amazing here, is decently priced, and the service is always exquisite!  Thanks so much Runway Cafe crew, I truly appreciate you!!!"}
{"text":"Landed at the Atlantic FBO and was looking for a quick bite to eat. The girls at the desk recommended the runway café. So I walk down the hallway into the café. 

I got their at the transition time between breakfast and lunch. I asked the girl what was the best seller in the house and she recommended to Philly cheesesteak because it didn't take very long to cook.

The Philly cheesesteak came out within about a five minute time frame. They wrapped it all up for me in a little to go bag so I can take it on the flight to the next stop. The sandwich was great it was one of the best Philly cheesesteaks I've had in a long time. Will definitely come back and try something else on the menu."}
{"text":"Food is always good and Mark, the general manager, and his crew are always attentive and courteous. They always have creative lunch specials and yummy homemade desserts too."}
