{"text":"Went there to watch comedy was very disappointed the bartender was very nasty to me and the beer tasting very bad definitely won't be going back"}
{"text":"This place used to be pretty good a few years back...they had good karaoke bartenders were cool all the bar games (pool darts beer pong etc) were free the best part was that they had a punching back right in the middle of the men's bathroom!! I moved away for awhile & i just moved back recently...i drove by & figured oh what the hell..I'll go in and have a drink...i went in & it has changed quite a bit..the drinks went way up the bartender was being a total douche i found out that they're under new ownership they took away the free games & took out the punching bag in the men's room...i was quite disappointed & probably won't be going back there..sad because it was a cool bar back then..."}
{"text":"Moved to Vegas about a year ago and this bar was right by my house.  From day one the staff was polite, hilarious, aggressive, and knew how to pour a strong a** drink.  I have been in for every shift and there is something I like about about every bartender.  I would recommend this bar to anyone.  There is a kitchen.  The food is great..try the Gyros.....my fave."}
{"text":"I'm on the area on business pretty regularly, and went here on a recent visit to watch a baseball game.  Excellent service and the food was surprisingly good.  I'll definitely be back as Rush Hour has a nice relaxed atmosphere."}
{"text":"Used to be a regular here but as I've moved away it's far less often that I visit. Originally this was a nice quiet (mostly locals) bar with a few pool tables, some great bartenders, and decent gambling. I drove by quite a few times before stopping in on a recommendation and fell in love with the place after my second visit.  Over the years the bar has changed to serve a younger crowd (including karaoke on Friday nights), but most of the bartenders are still great and I stop in when I'm on this side of town for good times. I recommend it to anyone looking for a locals bar on the weeknights, or the younger crowd on the weekends."}
{"text":"Been coming here for years and he place still looks good. Lots of remodeling and still the place to get a very cold beer! Sahet is awesome with the bar food selections. You have to try his hot wings!   Friendly atmosphere, pool tables and darts! The best wall decoration is the Jim Otto portrait!!! Go Raiders!!!   Fred the owner, if you catch him, is A OK...Kudos for keeping the neighborhood bar around!"}
{"text":"Cold beer, tight slots, but very good bartenders. Very smokey though they could update vent system."}
{"text":"Super welcoming place. Bartender James is super chatty and friendly, drinks are tasty and its very clean.  Bonus is there is a kitchen with great food too! I encourage you to take a chance here for sure!!"}
{"text":"Been going here over 7 years. My wife and I went there while we were dating and now we are married and continue to go there. Food is great. Service is wonderful and James the bartender is AWESOME."}
{"text":"A fun sports bar covering all teams with friendly people and hot bartenders."}
{"text":"good place to have a beer and play some Keno...."}
{"text":"Awesome food, great service and good value.  We will definitely be back.  Also, play poker on Thursdays and Fridays."}
{"text":"I like how  nice and welcoming the bartenders are. The chairs are comfortable and the drinks are good. Also when it's late at night you have to be buzzed into the bar."}
{"text":"Love the staff!! They are amazing people! If you want to have a good night out it's a great place. Don't mind the smoke then your good!"}
