{"text":"I just returned from this great little coffee shop.  The owner, Paul, was very welcoming and we chatted a moment about his home country Australia while he whipped up my 20oz latte. 

If you've never been to Latta Arcade/ Brevard Court, it is a quirky hidden gem in Uptown Charlotte. I've lived here 13 years and only found this place when I moved uptown last year.  It feels like you've stumbled across a European courtyard with its multiple pubs and restaurants. The thing it was missing was a coffee shop, and Rush Espresso has filled the gap. 

All the restaurants here have outdoor seating and are dog friendly.  It is a great place to get your morning jolt and do a little people watching."}
{"text":"My girlfriend and I have been fans and frequent customers since day one, but the food quality has gradually degraded (cinnamon buns are terrible and don't even have icing anymore, seriously??), then they changed the coffee last week to an Australian brand and it is terrible!!!! I drink only black coffee or iced americanos so I love a strong dark bold coffee. This junk is watery, has and unpleasant bitterness, no body and no real flavor. So bad in fact my girlfriend and i could taste the wateriness in my girlfriend's mocha (now that's bad!). We're both hugs fans of taking a risk and supporting the small, local and unique, but clearly someone has lost touch with what made Rush Coffee a success to begin with. 

We won't be back till you change the coffee. At least then I'll have something to help me choke down the dry cinnamon buns and cardboard tasting muffins.

Love the concept, get back to your roots!"}
{"text":"Great atmosphere and fun  ... you never know when the next star is born!
Talented musicians there for one thing and that is to play it right."}
{"text":"I have grown to be a coffee snob over the years, and this is some of the best coffee that Charlotte has to offer! Its always nice to see a long line at local coffee place rather than Starbucks! 

Thank you Rush for the amazing Lavazza coffee!"}
{"text":"Solid espresso bar; quiet in the morning and busier when games are on at the stadiums nearby. Have everything Starbucks does plus a little Aussie spirit!"}
{"text":"Rush rocks! From drip coffee to lattes, cappuccinos, and more, it's all expertly crafted. With few options beyond Starbucks on this side if uptown, this place is a godsend.

They use Lavazza and have a nice selection of pastries that are baked in house. The spinach and feta croissant is particularly tasty. 

The icing on the cake? Paul and his team are a lot of fun and super friendly."}
{"text":"Wish you were open on Sunday... I live up town and walked over at 9am on Sunday to find you were closed."}
{"text":"Seeking local coffee in Charlotte, I'd scoped out Rush Espresso & SO glad I did!  This is my new go-to, pre-work coffee spot!

Serving Lavazza coffee which is bold, strong, & has a slight hint of cinnamon, this latte needed no sugar or any other dressing up - it was flawless!

Nonfat latte - extra shot.  Perfect ratio of coffee to milk, creaminess totally complimented the coffee & I was so sad when it was all over

Can't wait for my next work trip so I can enjoy another latte or 3!"}
{"text":"Best coffee shop uptown! Staff is friendly and knowledgable. Small but has a great vibe. There's usually a line but it moves fast. The secret is out. Rush is the best!"}
{"text":"I'm pretty sure this place is out of business. Went there today (Saturday) and it is all closed up with the lights off. Today is the Charlotte Jazz Festival with lots of foot traffic. This place is dying off."}
{"text":"GREAT CITY CENTER COFFEE. Rush has one of the best cups of coffee in the city IMO. They have a smaller shop but serve great coffee. You may or may not be able to sit down, but take a cup to go and go to the park to get some sun."}
{"text":"These guys are amazing! I have been coming here since they opened and never had less than a perfect experience. The coffee is consistently excellent, I usually get a Cappuccino or a Caramel Late. The guys behind the counter are always nice and fun to chat with. Definitely one of the best coffee shops in town."}
{"text":"GREAT coffee shop that uses Lavazza italian espresso coffee. It's always busy, so you know that it's great ... especially if you like to support local business. Their cookies & baked goods all looked scrumptious.  

The caramel latte was the perfect amount of sweet caramel & espresso, I'd definitely recommend!"}
{"text":"Rush is my new favorite spot to grab coffee. The shop itself is super cozy and inviting. The espresso is very high quality and they always seem to make the perfect drink. The croissants were great too. The service is excellent and very friendly. It is clear that they care about quality and customer service. It is by way better than any chain coffee places."}
{"text":"Looked up times open... Check.. Yay!!! Let's go! 
Walked over to get amazing coffee... Check
Got there...... Closed argggggggggh.    
times online conflicting   Too far to drive to Bally"}
{"text":"Visited Rush while picking up some pastries for a meeting - my caramel latte was solid and their muffins were definitely tasty enough to make me come back in the future. Plenty of exterior seating and while the interior only has a few spots, the decor is charming. Appreciated the lemon water and cups set aside for guests. 

If you're in uptown give this little gem a visit!"}
{"text":"I love this coffee and service. The croissants (ham/cheese and blueberry) are my favorite. Every cup I get tastes great. I seriously do not go to any other coffee shops unless I am in a bind. Rush Espresso has spoiled me rotten."}
{"text":"True to its name, this isn't a place to linger as the inside is tiny, but easily my favorite coffee in town. Espressos are great, lattes are perfect and the cold brew is why I visit almost every afternoon. This place is also the friendliest and least pretentious coffee shop I visit, which is the other reason I go back so often. If I want the coffee shop experience or want to sit and linger or meet a friend I go elsewhere, but if I just want damn good coffee I go to Rush."}
{"text":"Wish I knew about this spot sooner. Is definitely a clean place. That's like the first thing I noticed. I noticed how clean it was. This is a good spot to go to just kick it or to talk business or catch up on your homework. Is got plenty of seats and they have FREE wi-fi. If you get tired order you a red eye if you get hungry order some food!!!"}
{"text":"Great little spot in a tiny courtyard in Uptown that everyone hopes won't be devoured by corporate expansion.  Rush, like many of the establishments here, is a cozy place with off-the-chain coffee straight from Italy.  Really, one of the best brews in all of Charlotte.  I recommend trying one of their spinach and feta cheese croissants fresh from the oven.  Soon you'll find yourself saying, \"bon giorno\" and \"prego!, prego!\"  Rush is magnificato.  Ciao!"}
{"text":"Love this place. The guys are super friendly and unlike not just coffee, they have a variety of sizes!"}
{"text":"Rush makes an amazing salted caramel latte. It is a cozy little coffee shop close to the park in uptown. We like to walk there on Saturdays to have coffee and a pastry. Highly recommend!"}
{"text":"One of my favorite coffee shops in town. Delicious Italian coffee (makes you feel like you've stepped into a European shop), cozy décor, and great customer service. The baristas are always so friendly. Happens to be right across the street where I work-- so I frequent Rush for an afternoon pick-me-up. Try a spiced iced chai latte with almond milk and you won't regret it. :)"}
{"text":"Had a pretty good iced green tea b/c at 4pm didn't want any heavy caffeine,  just a place to read with the wife. Nice little establishment. Will come back when  back in town."}
{"text":"This is located in the french quarter in uptown.  It's really small but has tables where you can sit inside and outside.  The iced white chocolate mocha was really great. Customer service was lacking, which is why I took away one star."}
{"text":"The Chai tea latte is to die for.  One of the very few coffee shops where we both love to have a chai latte is Rush Espresso.  I love their cappuccino too, tastes very fresh and the aroma is great.  wife is a chai latte aficionado so when she says she loves it here, I don't question ;)
The guy who runs this place is pretty cool, interacts nicely with his customers.  its a pretty small place in latta arcade and have few tables inside and outside the shop.  Tried their Choco chip muffin once and it was tasting pretty good (a little bready though than muffiny, but still tasting good).
I and my colleague went to this place today and its his first time and he loved his white mocha. oh yea I took a chai latte again."}
{"text":"Definitely best coffee in Charlotte! Warning: it's addictive. And everybody is so nice: Shin, Scott, Monet and Devin!"}
{"text":"Great coffee shop and amazing breakfast croissants. The staff is also very nice. I would recommend this place to anyone!"}
{"text":"Best coffee in town! I tried this place the other day after a friend suggested it and I have to say, their warm and cold coffee beverages are incredible! I was especially impressed with the iced latte! Most coffee shops fill the cup with tons of ice which ends up leading to a watered down cold coffee drink. This place added just the right ratio of ice to cold press coffee and milk! I got a 2% sugar free hazelnut iced latte and it tasted so creamy I couldn't believe that this was a rather a healthy drink! The service was also wonderful. We were greeted with a smile and pleasant conversation. If you haven't tried this place, it's definitely worth a visit!! I can't wait to go again soon."}
{"text":"What a little hidden gem! I've worked in the Uptown for nearly 2 years and didn't stumble upon this place till I started at my new job right around the corner from this location. Located in Brevard Ct., this cute little coffee shop is dynamite! They use coffee from Italy- LavAzza. I've never had it before coming to Rush, but damn it's good! 

I personally like their hot coffee over iced coffee (that usually doesn't happen) and their lattes are pretty good too. Plus, when you order a latte, they design the froth into a pretty design- which I love!

The only drawback to this location is that they are limited on seating so don't expect to come here and sit & chat, however they have about 5 outdoor tables."}
{"text":"My favorite coffee spot in Charlotte! The wait is usually rather short and Forest is a phenominal barista and so kind hearted. Wouldn't get my extra large extra dirty chai latte from anywhere else!"}
{"text":"Lavazza coffee!!!!  A favorite brand of coffee preferred by Italians and me!  It's the only place I've found to far that serves it in Charlotte. 

The owner is a very friendly Australian with a pleasant doubting accent, which you're bound to hear as he greets everyone.

Coffee, perfect for after lunch or dinner."}
{"text":"Best Chocolate Chip Cookies I have ever had.

I realize the craziness in this statement but I'm being 100% for real, go try one and message me that I'm wrong. You won't. Had these in a meeting today and myself and co worker agreed so I thought I'd take it to yelp to inform the masses. Also had some coffee that was tasty as well. I'm looking forward to going and trying more of there drinks and eating another one of their cookies.

Located in the Latta Arcade next to Clover Joe's."}
{"text":"Easily one of the best coffee shops in town. It's necessary to combat the post lunch hangover. Recommend: Mocha or Red Eye"}
{"text":"If you aren't going to Rush every morning to get your buzz on, you're doing it wrong."}
{"text":"Much better than Starbucks.  They use LAVAZZA which may not mean much to most people but it is a high quality Italian brand that is very smooth.  They also have a good selection of bakery goods and their croissants are surprisingly very good.  The atmosphere here is also very relaxing with outdoor & indoor seating.  It's very cosy inside making this place a great study or wifi jam session spot. I'll be back."}
{"text":"We went yesterday @4:30 (5 people)  to an excellent coffe place, the ambiance was nice and the coffe was delicious, however the  person who served us (when we got in) aproached  us with the following warning \"i close in 20 minutes\"....really? Then we asked for some pastries , and then he hesitantely replied, I do not have any\"....really again?....the coffe very good, the place beautiful,the service \"TERRIBLE\" 2 stars for the service"}
{"text":"Tiny little cafe perfectly placed in Latta Arcade. European cafe vibe. Only place in Charlotte I found that serves this Italian brand coffee- Lavazza. Very limited seating. 

It's as close to a strong Cuban cafe con leche as I can find in Uptown. They have almond milk as a milk alternative. Delicious pastries.

PS- one of the baristas has a Down Under accent. Love it! Every barista that I've come across have been awesome. Very well run small business!"}
{"text":"I love buying local! My favorite coffee/lattes in uptown and by far the best spiced dirty chai I've had. The coffee is great but the people are even better. You can tell they know all of the regulars. FYI - 2% is the lowest they go on milk and they have a good selection of flavors to add (looking at you, pumpkin spice and peppermint mocha people)."}
{"text":"This is a great little coffee shop and the barista was so nice and friendly! Definitely worth a stop in."}
{"text":"Love this little coffee shop! Friendly staff, hot coffee, delicious pastries...all without the insanely long lines you experience a block down at Starbucks. I'm happy to support a local small business! I ONLY hesitate to give this coffee shop five stars because I want to keep it as my best kept secret."}
{"text":"Found in Latta Arcade (on your right when you walk through the doors to the outdoor area), try the cappuccino or espresso to go or take a seat at their outdoor tables in a prime people watching spot"}
{"text":"Very cozy place. Area is very comfortable. Staff are as friendly as you can get. I had a straight black coffee. Should have gone with something more exotic but it was still good!"}
{"text":"At Rush, you feel like family. The perfect place for quick cup of coffee. The top notch crew behind the counter & the coffee they serve are the reasons why I make Rush part of my daily routine."}
{"text":"Coffee is good, prices are good, people are friendly!  You can't get any better than that for a coffee shop.  

A little bit of seating inside and a little bit of seating outside.  Comfy enough for a quick meeting, but not comfy enough that you lounge all day nursing one cup of coffee.

This is at the back end of latte arcade which is the beginning of something else when it gets to the outside part, but you know where I mean."}
{"text":"Rush: for the love of God, please buy lids that adequately fit your paper cups. The cup/lid combination you currently use has resulted in coffee dripping all over my hands each of the last 3 times I've been there. The lids do not seal the cup well. 

2 stars for decent coffee. 
-3 for failing to correct what's wrong"}
{"text":"Rush is fantastic! Change up your daily coffee run and try out this cute spot near/in Latta Arcade. Shin is so friendly and a great guy. Both of my go-to drinks are fantastic here - black coffee or a latte. Everything looks fantastic - they have some snacks such as sweets and croissants, too."}
{"text":"Cute, hidden place inside of Brevard Ct. I can't imagine how they're staying afloat on the weekends surrounded by all the high rises. It was a ghost town this past weekend with not much going on Uptown. We stopped by for drinks to go after having a fitting at Ole Mason Jar next door. It was nothing to write home about so I can't imagine coming out here just to get a coffee. The barista poured my latte w/perfect art and all while answering their awesome old corded phone - like a boss!"}
{"text":"Well I didn't get a chance to go in because it was CLOSED on a SUNDAY at 10AM. No sign saying we'll be back, or closed for the day or anything. Just lights out. I was visiting Charlotte and looking for a local coffee shop. Disappointed I wasted time walking around the city to find a coffee shop closed on a Sunday."}
{"text":"Rush is the best, the people, coffee, atmosphere. It's a great place to take a break when you're struggling through the work day because not only is the coffee there to lift you up but the staff is absolutely the best. Highly recommend it."}
{"text":"Today was my first time trying out rush, starters the coffee was delightful and gave me the extra boost I needed to get through the day. Second I just need to point out the adorable blonde named Brittany, she was so helpful in directing me with what drink to get and very knowledgeable about the menu. I've just started working in the plaza and definitely will be back and bringing my coworkers!"}
{"text":"My husband and I love excellent coffee, the service was excellent, but we were both really disappointed with our macchiato and cortado. Both tasted like they were old beans, and quite bitter. 

The shop & atmosphere are lovely, coffee disappointing."}
{"text":"Where have you been all my life! No, I'm not being unfaithful to my sweetheart of 8 years. This place is located at a secluded corner of the Brevard Court, and makes good coffee. Sort of what I've been looking for a while.

First off, the whole Brevard Court thing and the Latta Arcade is just awesome. I've only been to the front side (or back) facing the Romare Bearden park but never went far enough inward to see this place. It reminds me of the many small coffee places in larger cities. Not that that's what makes it special.

It's the ambience of a quick cozy coffee place that actually makes good coffee is what makes it stand out from Starbucks and Caribou. The old world map by the windows, small tables in and outside the shop, the friendly service and reasonable price all together kicks butt.

So on this first visit I ordered a cappuccino. I definitely like it. I ordered a large so that I can enjoy it on my walk back to Trade and Tryon where my office building is. I usually don't finish that much coffee since I'm not a coffee guy, but I actually wished I had more! If you know me, you know that's something.

As a Yelper, I have to be objective, right? So here's the downside. It's small. I mean, I walked in expecting a few tables but there was only one that was big enough for a grouo of two or more. Sure, they have tables outside, and we took advantage of that, but it would have been nice to have been inside. It's warmer but still winter. There you go. The reason a star is missing in this review. You're welcome."}
{"text":"A hidden gem in the Latta Arcade. This place has the best coffee in Charlotte!! I am always running here throughout the day for my caffeine pick me up. The staff is awesome and always have smiles on their faces. They also serve yummy pastries."}
{"text":"The cappuccino is the bomb! The gentleman who prepped our coffee is very engaging, and his cappuccino is really the best. After a couple of really bad visits to another, formerly favorite coffee shop, we tried Rush and do not regret it."}
{"text":"Located right uptown in historic Brevard Court this is my go to spot for a quick coffee grab or just to sit outside and take in the sights and the sounds of this beautiful area! The coffee is great and so is the service the owner Paul is great and very personable.  If you are ever uptown be sure to check this place out"}
{"text":"First of all the place is very clean.

I came at a particularly light time, 45 minutes before closing. All eyes were up and the greetings were warm. I chose to eat at the bar. The bartendress, \"Jessalyn\", is spectacular(to evetyone) and recommended and offered a tasting which was spot on.  Local beer on tap.  The fried oyster salad is a well orchestrated fusion of flavors with a spicy finish. Very fresh. Breading is great and rhe the presentation is visually pleasing. 
Pecan crusted trout was served on a warm, contemporary \"pottery square\".
The fish is finished in a buttery crust of pecan and mixed, fine crumbles. It is light and fresh. I will name the peach accompaniment a peach chutney with an up tone of red pepper barely noticable at the end., all atop a bed of whipped potatoes and green beans. Personally, I will skip the green beans. Everything else I recommend.
This is a great place."}
{"text":"Tucked away in the very back of the Brevard Ct alley, this cute cafe is all you need for a lovely weekend morning. 
I came here to get my study on, and hoped for empty tables after reading some reviews that said it can get crowded. And I can see why!
It's a very small space with a few tables inside and outside. I'd definitely sit outside if the weather was nice enough.

I got a vanilla soy chai latte which was rich, creamy, and not too sweet. Just the way I like it! 
Their sizes are a little smaller than average, but no complaints there. 
Definitely a quality place. The manager/barista seems to be really good at what he does and I love the local feel of this place. Almost everyone that came through was a regular, and knew the manager by name. So friendly and welcoming, and the whole shop had a very warm vibe.

They also have an assortment of baked goods that looked delicious! A lot of customers got the croissants and bagels.

I would definitely come back here to try their other coffee drinks."}
{"text":"Moved from Raleigh where they have many more privately owned cafes like Rush than Charlotte, which is surprising as Raleigh is less than half the size. I mention this because there are not a lot of options in uptown Charlotte. Starbucks doesn't count. 

Therefore, I can easily say that Rush is the best coffee shop in uptown Charlotte. But to be clear, this is not because Charlotte lacks options, but because they are a great coffee shop! I would know as I have been to many in Raleigh. They make their lattes, cappuccinos, and mochas beautifully. They have all the extras you could need, more than Starbucks. And they have several delicious food items for purchase. 

But more importantly, the staff are amazing. They make the place special! And of course, they know how to make an amazing espresso every time! They remember their customers and they build on relationships with everyone. Without them, I wouldn't have bothered to write this review. 

So even though Charlotte baffles me in having crap selection in coffee shops, especially for being the biggest city in the Carolinas, I really don't need to look any further than Rush. They saw the coffee desert in uptown and created a life-saving coffee oasis!"}
{"text":"This place is great! It's especially wonderful if you want to \"get lost\" writing or reading in the middle of Uptown. The service is excellent- I have never left without smiling. The coffee art is gorgeous and owner is so jovial to speak with."}
{"text":"Great hidden spot in Uptown

You normally would not pass this place unless you had business in the Latta arcade.  It's a small hole in the wall shop, but they brew up some awesome caffeinated drinks.

Staff is super friendly and helpful.  Beware of the business people rush in the morning and lunch time refreshers."}
{"text":"Bravo coffee shop!  This place has so many great things. The coffee itself is very tasty and each drink is made with care. I like the salted Carmel specialty drinks and of course this time of year is all about the pumpkin.

Prices are on par or perhaps a little less than you would expect. It seems to be very popular in the afternoons so perhaps the word is out on this place!

The store and outside seating area is just lovely. Very rustic modern. Though both areas are a bit small. The outdoor area you are kind of sitting on top of each other, though it kind of gives it a European feel. 

Defiantly make the walk over from the office towers. You won't be disappointed!"}
{"text":"Latte is ok, not particularly outstanding. Tea is just standard teabags. The tables were a bit wobbly and not exactly the cleanest. Interesting little hole in the wall but not the best I've had."}
{"text":"Come and support your local coffee shop:) Great service and amazing coffee! Highly recommend it... Plus, their little shop is super cute!"}
