{"text":"Never, ever have I had such horrific service before. Made reservations a week ago for the Rusty Nail - wanted to go back to the place my husband and I had our wedding reception at. We get there at 6:30 and our reservation is \"lost.\" We were seated about 15 minutes later - not bad. Ordered a bottle of champagne which our waitress couldn't find. 20 mins later it appears. We put in our dinner order at that time which also included an appetizer. 40 MINUTES LATER the chips we ordered arrived - cold. Like they were sitting in the refrigerator cold. Another HALF AN HOUR goes by and I have to track down our waitress to see where our salads are. They come out and were the most pathetic salads I've ever seen. The lettuce was wilted and there were maybe 4 bites of food. We have now been at the restaurant for an hour and a half and have seen our waitress 3 times. I ask to speak to the manager. 10 minutes later, no manager. I ask the host to speak to the manager and I'm actually sorry I did. Not only was she rude but she could have cared less about what I had to say. When I said we had waited an hour and a half and had only received a cold appetizer and wilted salad I was told that everyone was waiting that long. Like that's supposed to make it ok?!?! Are you freaking kidding me?!?! No apology. Never again."}
{"text":"If you're planning a class reunion here, go somewhere else. Although the price seems \"reasonable\" there is a loophole in the contract and they basically find a way to over charge for the rental. It took months for the \"deposit\" to be returned and the owner tried to back out on terms given via email and even used her personal issues as leverage to attempt to justify the change. The food was ok, but very cold once it was set out. The only reason I'm giving it two stars is because the bartender was awesome and courteous and the room was nicely decorated and gave plenty of room for our class to mingle and dance. As for the restaurant itself, I cannot say I've ever eaten there and probably won't."}
{"text":"It's a little pricy so I don't go often, but I love this place!  My fiancé and I first went a couple years ago for Valentine's Day (beautiful, romantic setup by the way), and we've been back as much as we are able ever since.  The food is amazing (pretzel-crusted chicken is my favorite), the staff is friendly and helpful and we've never had to wait.  0 complaints here!"}
