{"text":"UPDATE
Re-rating after a year. 
I don't know, the ramen just wasn't impressive. With their high price, I don't see any value anymore.


I've tried and were disappointed with many Ramen restaurants here in Toronto. I think I can give 5 star to this one :-) 
I had the Tonkotsu (Otokoaji) and the soup was fatty and salty and just the way it's supposed to be. And the noodle is the thin type (like angel hair pasta) which is typical and authentic noodle for the tonkotsu soup.
Yes, I agree with others that I wish egg came with it without extra charge and wish it were a bit cheaper, but I'll come back. Poke salad was good, too. I'm curious to try other dish on the menu. Keep up the good work, Ryoji!"}
{"text":"No doubt about the atmosphere, I like it lot more than Guu, not too \"dramatic\" and noisy. Service is good. Full bar, not too fancy but with great quality. I think I had the best \"whiskey sour\" here in town.
No doubt about their food quality. My favorite dishes so far is Kobe beef tata and homemade peanut tofu. Definitely have to mention their Raman. Soup flavour is rich and thick but not salty..... everything just make. I think I will try their potato takoyaki and the wasabi cucumber at my next visit. 
No pictures cos my phone battery was dead.... and the food was too good to be wait till the battery has been charged."}
{"text":"I was given a complimentary voucher to eat at Ryoji so price was not an issue.   To be perfectly fair though, the lunch menu was a bargain with deliciously prepared sous vide pork belly at only $6.  The fact that the meal was free did not affect my taste buds.  The food was overall very tasty and very well-prepared.  

We had the Rafute (pork belly), and the signature Nanban deep-fried chicken.  The pork belly was melt in your mouth and infused with flavour while the chicken was crisp with a thin batter and very moist and tender inside.  We had the Okinawan soba in a flavourful bonito and pork broth.  But the most exciting dish was the Okinawan Goya Champru - a bitter melon stir fry topped with bonito fish flakes that swayed in the steam.  Quite a showpiece!  A complex mix of taste and textures.  This dish was specially ordered as it was on the online menu but not on the lunch menu.  The chef agreed to prepare it because the restaurant was not busy today, it being the last long weekend of the summer.

The Okinawan donut dessert was the perfect ending to the meal.  For more details, please visit my blog at www.foodsparks.blogspot.ca...

Service was attentive and flexible.  I gave the chef extra points for preparing a dish that is not on the lunch menu.  I suspect the quiet day helped.  Ambiance was glitzy - mirrored walls and ceiling, not what I normally expect but then I'm not twentysomething."}
{"text":"The owners of this place need to sort out their wait staff and flow of their dinner service, otherwise they are going to lose customers fast. We came for dinner on a Friday evening and got a seated immediately as it wasn't too full. The service started out good but got extremely disappointing after we gave our order. Our drinks came right away but we waited about 45 mins for our food. We were only acknowledged about the lack of food when we mentioned something, but then told one of the dishes we ordered was sold out. No heads up or warning that it was sold out earlier. No apologies given either. It took another long wait for our next order of drinks. We were given the excuse that the restaurant was busy which is a bit ridiculous since there was a section completely empty and as a restaurant manager or owner you wouldn't sit anymore people than the normal amount you have prepared your restaurant for. To add,it took another 15 mins to get our bill and pay. Only to find out there was at least and extra $20 of food charged on our bill that we never ordered. They let a party of 27 people pay separate bills so we were stuck waiting. The servers also bickered at each other in front of guests. Luckily we were treated really nicely by someone named Alex or whoever the manager or senior server was there that night. He even offered us something special the next time we go there. Honestly, not sure if there is a next time in the near future. The only saving grace was their food. It was actually delicious. It's a shame the restaurant was ran poorly because there's so much potential for it to be amazing. Hoping the owners and managers train their staff better"}
{"text":"I've been there few times now and love the atmosphere and service.
The lighting inside is really nice. if you are looking for a bar for late night date, they have a very nice seat by the window in the lounge area.

My favorite tapas dishes are chicken wings, beef dumplings, tuna and avocado tartar, and calamari salad.

The best noodle I had here was Shio.

Some dishes may be pricey but worth a try."}
{"text":"So I went back to this place last night after not having been there in months. Wow what a difference - the servers really weren't all that knowledgable (Japanese resto should prolly have staff that know how to pronounce the dishes and also what they are right?). The ramen - for which they are known for supposedly - was at best average...but it's priced in the premium range. So...something's off there.

Overall, mega overpriced for what you get IMO. $14 for a tiny filet of sea bass cooked in what amounted to soy sauce? C'mon..that's just wrong. 

Anyhow, I'm definitely not going back to this place."}
{"text":"My new favourite spot. Great for going out with friends or on a date. Very cozy and also funky atmosphere. The ramen is delicious. Decently priced. My favourite drink on the menu during the winter time is the hot oolong cassis. The staff is great and very friendly. Oh also, the toilet seats are heated. You'll either love that or hate it."}
{"text":"This is without doubt one of the finest ramen places in Toronto. I far prefer it to Kinton. They even ask you if you want the noodles al dente !!
Soup is excellent... Difficult to beat."}
{"text":"They must've worked out the kinks because we had a great night. We had to wait about 30 mins for a table for four but we were able to wait inside on stools which was fine. And not at all unexpected for a Saturday night around 7. The service once we came in and sat down was very quick. It wasn't more than 15 minutes before our food came, and it came fast and together. 

Tried both the Ryoji ramens with the marinated egg. The ramen was delicious. The broth was really amazing. Better than Kinton. More depth, flavour, and way less salty. Tried the takoyaki, which wasn't as good as we've had elsewhere. But still good.  

We're definitely coming back! The manager was gracious as well, when there was a rude group of patrons trying to squeeze us together so they could fit more people onto our very small bench. Great customer service!"}
{"text":"This is hands down the BEST ramen noodle place around. Love the fact they have lunch size options too, and in case you are very particular about the texture of your noodle, you can ask it to be made firmer or softer! The broth is super flavourful and always hits the spot (try the Tonkotsu special). Prices are so reasonable too given the trendy interior and cool vibe atmosphere. The staff are also super friendly and always so helpful. We come here quite often and always leave very satisfied. Would highly recommend if you're in the neighborhood."}
{"text":"Hmmm, I would say their peanut tofu is a must. Everything else was fine but notable. Definitely much better ramen places out there. 

Small drink selection... and it's an izakaya??? Drinking and izakaya go hand in hand to me, and the limited number of soju/sake was disappointing. 

Wait staff needs better training. Maybe this restaurant is just really inconsistent?! 

On the plus side, it's a fairly big restaurant. So good for groups."}
{"text":"Ohhhh... I just had another fix of authentic Okinawan food at Ryoji. Everytime I come here, satisfaction is always guaranteed. I totally recomend this place."}
{"text":"How is this place not 4 stars!

Service could use improvement, it is a little slow, but everyone is very polite. The food is delicious and presentation is nice.

Very authentic. Some of the other trendy ramen places have such superficial flavour. I tried to find out why their ramen tastes so much better, and it is all said on the website. Their broth is the result of at least 18 hours of cooking, and their noodles are freshly prepared in house. 

You can choose how your noodle is cooked. I don't know any other place that offers this option. I know Sansotei offers thin or thick noodles, your call. I always ask for hard (al dente, in Italian terms lol).

The design of the place is really cool too. Mirrors everywhere and some very interesting fixtures. Honestly, this in itself is an extra star. Very clean and modern, it makes you feel like you're transported to somewhere else.

Prices are very good for what you get, especially for the ramen. The appetizers are a bit of a rip-off. You can get the mini portion ramen which is 7-8 dollars. That is for when you are not that hungry. If you are hungry, go for the regular size, which starts at 11 dollars. Most are 11, except for the specialty ones.

I am by no means a vegetarian, I do love my meats. But, their vegetarian ramen is amazing. I don't know any other place that has this, not yet, anyway. Do give it a try."}
{"text":"I enjoyed Ryoji! It has a very nice atmosphere and the staff were very friendly. We went there for lunch on a weekend and there were plenty of seats available. I ordered the Onna-Aji ramen which had a flavourful soup base and the noodles were cooked just the way I liked it. The portion was good too so that I was able to try some of the other menu items.

The poki salad was nice and the fish was fresh. The zucchini fritter tempura was nothing special though and it was a bit bland. I would definitely like to go back and try dinner though!"}
{"text":"I like the decor, friendly service and home made noodles. The broth was way too salty. I'm afraid I just ate a bowl full of MSG!"}
{"text":"Don't waste money on their appetizers, stick with their Ramen. I found the best deal to be ordering their mini size and if you need more just ask for kaidama (extra noodles). Can't say no to their sapporo special."}
{"text":"Disappointing dining experience of my life. it was our first time here,Extremely awful service , waiting ages for ages for foods. The manager massed up the order he took. We waited our noodles for one hours ,The waitress ignored us   So many times. No to mention the Quilty of the food. The worst Soba I ever had."}
{"text":"I've been here a few times and I love the ramen and izakaya dishes! 

The staff is great and the atmosphere is perfect for dining in a big group or just by yourself. 

I wrote a review before about how they don't do take out. Well, they've changed their policy recently and now I can enjoy my ramen at home!"}
{"text":"Ramen is just fine but I'm obsessed the desert they offer! Btw i love pork neck meat, pork ears and fried chicken! They are so delicious:)"}
{"text":"they always have sapporo drinks by glass n pitchers specials so we become regulars but today they wrote on the board the same specials but when we ask for bill they said tgey dont hv specials n charge us regular price but i said they hv it on the board they are so dishonest n disrespect my bf stop me from talking to the manager just bec hes too nice but nobody shld be treated like that such a dishonest merchant ill never go back waitress is very pushy on us ordering food but its sunday afternoon we re at the lounge area pls dont go there"}
{"text":"Best ramen I have had lately. Service is slow but the food was great. Reasonable prices."}
{"text":"My first great ramen experience in the city! I love the upscale decor in the back of the restaurant. It sure did look fancy, but I sat at the bar which was fun too because I enjoy seeing what little that I could of the cooks making our food.

The waitress i had was Japanese and she was amazingly friendly. I didn't understand what other reviewers meant when they said staff were friendly but now i know. It was as if she were my friend. She smiled and laughed a lot. Customer service is HIGH on my list and I'm glad the staff gave a homey feeling. Other staff that I interacted with also smiled and were pleasant to interact with. 

Okay onto the food. I started off with the mimiga, which is pork/pig ear. I personally LOVE pig ear. I've only had them at Taiwanese places so it was interesting to try at a Japanese place. It comes with a spicy sauce coated over it or a peanut miso sauce. We got ours with peanut miso. It was a lot softer than I usually eat it. It is cartilage after all and I'm used to the stiffer feel. However I enjoyed this new texture and it was YUM! The pig ear comes on a bed of shredded red onion topped with the sauce you choose  and sprinkled with some crushed black sesame and i think crush dried seaweed.

As for ramen I got the tonkotsu ramen. The noodles are the thin straight flour noodles. I usually prefer mine a little thicker but this did not disappoint! I got mine \"soft\" and oooo was it ever so delicious! The noodle portions are generous. The wood ear mushroom (if you eat it alone) has a very mild spicy kick. You can't tell if you eat it with the ramen. I LOVED IT! The meat was tender, juicy and fatty. uhhm, yum? The only thing keeping this from being 5 stars is the broth. It has a great pork flavor but it also has way too much sodium! Go easy on the salt and this will be perfect.

Last but not least and probably not important but I just wanted to mention they cut my seaweed in the shape of a heart. They didn't do that for my date so maybe this is only for women on Valentine's day? I thought it was super cuuteeee!"}
{"text":"A great place! I really enjoyed almost all the dishes I ordered. 
The ramen was good albeit it does not stand out from the other good Toronto ramen places. I really enjoyed the potato-based(?) takoyaki and the peanut flavored home-made tofu. The citrous and fizzy yuzu wine was also very pleasant and refreshing.
The other dishes I've tried were decent and of general Toronto izakaya standard.

The price is comparatively expensive for the small portion, but that seems to just be the way izakayas generally are.

Customer service was great and the environment is cool and clean. 

Would strongly recommend it to friends/couples who are looking for a place to chat while having enjoyable but not-too-heavy food and drinks."}
{"text":"I'm very disappointed - the restaurant is way overpriced for the portions. They charge for everything - $1 for extra wasabi sauce that comes with the grilled pork neck. Seriously? Service was friendly but slow."}
{"text":"This place is bigger than other izakayas in town with a variety of seatings. The ramen was good. You can get a whole runny egg and the cha siu tasted good. 

The goya champuru was surprisingly good. You can taste the soy in their tofu!

Would come back for more of their izakaya foods!"}
{"text":"Came here on a Sunday night around 9pm with my hubby and was seated right away. Ryoji is a ramen house/izakaya in one, it actually does pretty well in both fronts, their ramen menu is a bit smaller than a regular ramen place (about 6 or 7 choices of ramen), their izakaya menu is also smaller than a regular izakaya menu. However, the choices offered are interesting and tasty in general. The vibe and decor feels like Guu, even down to the mouth wash available in the bathrooms. It is pretty loud.

Had the Otoko-Aji Ramen which is the basic tonkotsu ramen. The broth was pretty good, it is definitely a rich and fatty kind of broth, so if you are fat and collagen adverse you might not like it, I liked it. The noodles comes as soft, medium or hard and are the thin, white, straight type wheat noodles. It was a thinner noodles than most ramen places. The pork belly that came with it was soft and had about a 1:1 fat to lean ratio, so again if you are fat adverse you might not like it, I don't mind it. The gripes I have with this dish is that (1) no egg came with it (you have to order it separately) and (2) it was a bit too salty.

We also had the Otoko-Aji with Kuro-kogashi which is basically black garlic oil, so basically a tonkotsu with garlic oil. Besides the garlic oil, it came with 2 sheets of seaweed compared to the regular Otoko-Aji ramen. This was even saltier than the regular tonkotsu, but as I mixed the noodles and the soup more, it was better. I also got a noodles refill (Kae dama), and the 2nd set of noodles with the broth was better since the salt level was much more balanced. Out of the two ramens we tried, I actually like the regular Otoko-Aji ramen more even though I am a huge garlic fan.

We also had the Ji-Ma-Mi which is a house made peanut tofu with a light soy-syrup kind of sauce. This dish was good! It was definitely the most interesting thing we had tonight. The \"tofu\" texture is almost like a cross between a mochi and tofu with a slight peanut flavor. The savory-sweet sauce that came with it really complemented it.. Good dish.


Service was fine, the servers were a bit swamped, but were friendly and informed us our dishes were coming when we have waited for a while without us asking. Overall, I like this place and will definitely return, there are lots of other interesting items on the menu that caught my eye, such as pig ears in chilli oil, grilled pork neck and a pork belly platter done two ways."}
{"text":"Service is subpar and food is mediocre at best.  Two of us arrived at around 5 pm Sunday and we were led by the hostess to a table in the dining room.  After we sat down, the waiter then came and asked us to moved to a smaller table even though the restaurant was practically empty.  We reluctantly moved to a table that felt very cramped in an empty restaurant.  Moments later, more couples came in and were allowed to sit wherever they wanted even though other small tables were available.  We asked for tea and only one glass came until we asked for another.  The waiter never bothered to check whether we needed more even though our glasses had been empty for a long time.  Furthermore, the waiter seemed irritated when we just needed a bit more time to look over the menu.  Service was very slow even though there were only a few guests in the restaurant.  The food wasn't that great.  The rolls were too stuffed with rice and the ramen tasted bland and oily.  Not to mention it was over priced.  The decor is nice, but the unprofessional service and the mediocre food make it difficult to justify the price of admission."}
{"text":"our family eats here all the time. the staff r friendly polite and the food is so good and tasty.the fried chicken is awesome and pork ramen and vegie is so good.would recommend this place to friends and family and david is a great guy and very polite to talk and ask ? about there menu thxs again.."}
{"text":"WORST SERVICE EVER!!

We ordered \"Red tuna sashimi with salted fresh wasabi pesto\" 
The red tuna had an extremely strong fishy smell and a cloudy colour. It was clear that they were NOT fresh and I was so grossed out after trying one piece.

When the waiter came to bring our next dish, we mentioned to the waiter \"Sorry, but these tuna are extremely fishy and don't look so fresh\".

She went \"Well, because it's FISH\" with more attitude than common sense because clearly that wasn't the issue.

I said \" Well, I am Japanese myself and was born there. I know what fresh sashimi should taste like and this is really gross. You can smell it from here.\"

Then she started arguing with me, saying \"Well, I lived in Japan for 8 years too and trust me, everyone loves this dish. It's probably just YOUR PREFERENCE.\"

Rather than trying to make it right, she just kept arguing with me and being defensive.

In the end we just had to tell her, \"We are not here to argue with you. We just want you to take this dish away because it smells and we don't want it here\".

When we ended our dinner, my friend and I were still pretty upset and shocked about what happened and asked a different waiter if we could speak to the manager. 

The entire restaurant was dead empty and all the staff were just chatting at bar. We waited at least 15 mins and the manager could not even get his lazy ass off the bar to speak to us. 

We were just so extremely disappointed with the staff's behaviour.

This kind of business won't last.

Even if the food were remotely palatable, service is king. Don't waste your money."}
{"text":"Ryoji used to be our regular go-to as we live in the neighbourhood and go out for dinner at least 2 nights a week. Over the years, the food has gone from great to so-so and the service has gotten worse. 

We used to *love* going for the ramen (our favourites: shio, tonkotsu and shoyu as they come with an egg... sometimes. The menu and the serving staff don't agree and what the serving staff says, goes, never mind what the menu says; they won't even check the menu and just say that the menu is wrong). As well, their Nanban (fried chicken) was my absolute favourite! Unfortunately, the last couple of times we have been there, it hasn't been as hot/well-cooked and has even come to us undercooked. 

The service is very friendly when you walk in but not as much once you sit down (even when not busy as it was last night). Their servers also seem to rotate a lot. We were regulars the last couple of years and the staff in the beginning knew us/recognized us. Now, they don't try to get to know their clients. Our waitress came to our table once during our meal to ask us how things were. Once she offered us our bill, she went to 2 other tables (brought them their bills even though they asked for it after we did) before bringing us our bill (and I had to put my coat on for her to get the hint). And like many restaurants nowadays, the pre-set tip options tip on the tax, so we always enter it manually. 

We used to recommend Ryoji to all of our friends, clients and visitors from out of town (we even told them it was worth the drive from Oakville or Mississauga or wherever). Now, we can no longer recommend them as we can't guarantee that the food and/or service will be great. Too bad as we really loved this addition to the College strip for our weekly nights out."}
{"text":"Vous aimez la cuisine japonaise et vous en avez marre des faux restos-sushis ? Et bien voici le dernier arrivé de la scène torontoise: Ramen Izakaya Ryoji. Spécialisé dans les soupes styles 'ramen', ce restaurant est très porté sur l'authenticité de l'expérience culinaire japonaise. Quand nous y sommes passés, nous avons eu la chance d'avoir parmi nous un grand connaisseur de la culture et la cuisine japonaise. Son verdict? Bon mais pas extra, authentique mais cher. Nous y retournerons pour y découvrir les nouveaux plats en espérant que le rapport qualité prix s'améliore. 

Was exited to discover the new Ramen house in my neighbourhood and promptly invited a group of work friends to check it out. We were lucky enough to have a nipponophile amongst us. The verdict : OK, but not great. Authentic yes, but overpriced. The menu selection needs to be expanded because we all want to believe in Izakaya Ryoji."}
{"text":"I have no idea what happened to this place. It tasted so perfect when I went here for the first time, but the taste changed a lot after that and just went downhill. I ordered the same ramen like last time (spicy miso) and what supposed to be their popular appetizer , poke salad. The ramen came first. It tasted good, but you can see that it's not fresh when you look at the fat on top of the broth. It looks like something they made a week before and been reheated for a couple of days. It wasn't like that at all when I ate there last time.

The poke salad is just horrible. The sauce is just too thick and they put a lot of it. I would normally be fine, but the sauce is so strong that it overpower everything, even the ramen broth. I could not eat the greens at all, so I only ate the 5 pieces of tuna cubes. The waiter realized that and grabbed the manager. They took it off my bill and gave me a free dessert. That's why I gave this place a 2 star instead of 1.

This is just an advice, I think Ryoji needs simple appetizers like gyoza, simple and not too overpowering. Satsuma age would be good too, mixed with strong tonkotsu broth."}
{"text":"Stopped in for some cold ramen lunch. Yeah sure, I have been here a bunch of times and don't always love it. The 4 ****'s is for the cold ramen stuff they've got going this summer. I brought a friend from London, UK. Now I know that London is not the ramen carpital of the world, but it's a very famous city and they have lots of food there. So....long story short, my friend's review was this: \"I don't see how it could have been any better!\""}
{"text":"We had the spicy miso, it was good.  The broth was the best we've had but the portion too little for your money.  Not enough meat and vegetables compared to some other places we've eaton.The decor and atmosphere thou was one of the best in the city.  I recommend you try for the experience but if you are like us who have tried various Ramen places be prepared that you certainly get less for your dollar."}
{"text":"Horrible service. Went on a Friday night to a mostly empty restaurant. It took the server 15 minutes to actually take our drinks order and only one of the two drinks came. We had to ask for a beer two more times before it finally arrived. We ordered a few of the dishes and only half came. We thought the kitchen was just short staffed but the server brought us our bill (we didn't even ask for it) and we had to ask where the other half (4 dishes) of our order was. The server said we didn't order them! We didn't wait for the orders to be replaced and just left! No reason for a half-empty restaurant to have such bad service."}
{"text":"Unique Okinawa food on the menu that you can't usually find elsewhere. Goya chanpuru was especially impressive."}
{"text":"Not impressed. So much for the 10 most anticipated restaurant selected by blogto.com

Food was not bad, though not much selection for lunch. Service was not that great. I was seated for 10 min, and ppl who got seated after me got their water already. Food took a long time, not everyone got their ramen at the same time and order was messed up too."}
{"text":"Went to Ryoji for a ramen tasting purchased through Toronto Common - $24 including tax and tip.  I loved the style and decor of the restaurant, as well as fun music. They were playing early 2000's hip hop and rnb which I've heard is a common occurrence.  All of the ramen I sampled tasted good, not overly salty or oily but the real good stuff was the apps. Yum yum! I think I would go back primarily for more appetizer samples and to hang out with the cool staff.  We sat at the bar so got to chatting with Jared the bartender (who also serves depending on the day) who is absolutely awesome!  

Great tasting food, friendly service, lots of drinks and music to reminisce to.  What more could you ask for?"}
{"text":"I visited with my friends for a hearty meal. Out of many choices, I ordered Okinawan Soki ramen. It had soft delicious pork ribs and chewy slices of octopus leg (in hindsight I think it was just some fish cake). Anyhow, the ramen had a good proportion of the chicken broth soup and soft noodles. I'd say it's definitely worth $12 compared to some other ramen places. I would not mind coming back to try other ramen."}
{"text":"Ryoji is my new ramen and izakaya date night spot!

The space is gorgeous with crystal and shiny things along with elements of traditional Japanese decor.
 
Note: if you want your own table, make sure to ask for one!  We were seated at the giant communal table which is close to the sushi bar and the action but not very private.  There was a couple next to us and they kept staring at our food.  I wonder if they were confused about what to order, I wonder if inability to order from an izakaya menu is a deal breaker.  They were seated too close to us for such a long table.  I felt like they were invading our privacy -- not the other way around!

I came here with a friend who is preggers, so we actually didn't try any of the raw items.

I was going to drink for both of us and I took a look at the drink menu.  I do wish that they had more original cocktails available.  They have a sake menu but I got one of the only sake cocktails they had available.  The sake Caesar was pretty fantastic and spicy! 

As for the service, everyone here was super nice and attentive.  We were greeted warmly and the good service continued throughout our entire meal.    We were brought clean plates between courses and they came by often to check on us and bring us more water.

We started with Ryoji salad.($8).  It's a simple salad with beets, cucumbers, and greens.  Topped with sunflower seeds, tofu, and miso dressing, the salad was  refreshing and not as boring as expected.

The pork belly platter ($14) was a huge surprise.
The serving was gigantic!  There were two styles of braised pork belly plus potato pieces.  The pork belly was fall apart and melt in your mouth fatty.  It was awesome!

The fried chicken ($11) was good but a bit too greasy and slightly soggy.  It's served with tartar sauce and there are notes of sweet and sour from the marinade and the sauce.  This dish was alright but nothing spectacular.

As for our noodles, my friend ordered the Tonkotsu and I ordered the Shio.
My friend loved her noodles and I liked mine.

I've heard that the noodle servings were small. 
But, I didn't find that at all.
The noodles were perfectly cooked to medium texture.
The broth was smooth but a bit salty for my liking.
But overall, I wasn't disappointed.

For dessert we had the choice of the donut with green tea ice cream or cheesecake.  The server said that she recommended the cheesecake.  It had a cute presentation and it's served in a  flute.  The texture is very soft like a cheesecake- mousse with a blueberry sauce.  It was good to the last spoonful.

We had a great experience here!  One of the better izakaya spots that has cropped up.  I like that I can get ramen but other items as well."}
{"text":"Ji-ma-mi.  Looks like a boobie (a tofu dome with a dollop of ginger right in the middle - was this on purpose?!), tastes like a strange tofu glue.  Imagine the texture of mochi, but a lot more dense.  It was weird, but I also kinda liked it a bit, whereas my partner thought it was one of the more disgusting things he'd ever had.  Meh.

We both enjoyed our summer special ramens though (Bonito Tonkotsu Shoyu, $12 and Spicy Black Sesame Miso Tonkotsu, $12 ).  Though I had been planning on getting a small bowl, the bonito broth was tasty and I had no difficulties polishing off the whole bowl.  I was told the Black Sesame Miso broth was very tasty as well, though he found it to be too salty to just drink it down (despite the temptation).  I also enjoyed my cold noodles; perfect for a hot summer day.

The only thing I sort of regret having ordered were the oysters on the half shell.  Although they were fresh, they're just literally oysters on the half with no unique sauces or anything.

There are a lot of ramen spots in the city now, but I think Ryoji is worth a try!"}
{"text":"Food: 3.75/5 (No complaints)

Service: 3/5 (friendly but all over the place like mixing up orders etc repeatedly on a v.slow night, and did very little to emphasize the Okinawan focus of this establishment)

Interior: All over the place (bar, resto,, lounge)

Ambience: kind of flat in relation competitors 

Repeat: Not likely"}
{"text":"The calamari appetizer (it's on the cute written sheet) is really tasty and really nicely stir fried. 
We also got two mini bowls of ramen, one tonkotsu ($7) and one vegetable. Both were really flavourful and perfect size for someone with a small stomach like me!"}
{"text":"Finally a place that serves good ramen with ample dining space, great décor, and I can actually get a decent seat at a time of day when normal people eat. Perhaps I was just lucky. Considering this significant advantage over other ramenyas, I found the prices to be very reasonable. $12 for a very good bowl of the hakata style ramen. The black garlic oil version (kuro kogashi) isn't a variation I see often but, as a garlic lover, this will be my go-to dish.

Easily in the top 5 best I've had so far. And I've been to a lot."}
{"text":"Tried 9 of the ramen during an epic ramen tasting on a lovely Tuesday evening! Cute ramen shop with Japanese decor, the inside is slightly too dim for my liking though. Staff is super friendly and responsive. I really enjoyed the different broth they serve up with their ramen although I find a couple a bit too salty for my taste (I think it was the miso and shio).

Would definitely come back to try other items on their menu."}
{"text":"My love for ramens runs deep... Real deep. I told this to my friends in Toronto and they decided to take me here to take my love even deeper. 

First of all, we all got 1 L Shapporos and that was great. They were the size of my torso. And then we ordered edamames and deep fried zucchinis to start until we got our soups. 

I got the veggie ramen, which was delicious but a mistake when I tried one of the ribs in my boyfriend's ramen soup that he had along with other tasty pork products of types. I was definitely jealous. (Next time I am getting that). 

I really enjoyed Ryoji, however (I did really enjoy my soup! But next time, RIBS!). It was dark but fun and a great place to go with friends for a hot bowl of ramens."}
{"text":"If anything coming for the tonkatsu ramen is amazing. Honestly I feel it was as good if not better versus the Toronto favourite sansotei. What's even better is this is a bar and they serve popular izakaya food. I would stray away from takoyaki because the one I got were potato based?? And legit was a friend potato with octopus?? Not sure. 

Come here for ramen and sake!"}
{"text":"Came here on a Saturday night, the restaurant was quite busy,

The food dishes that we ordered were good, which I would have given 3.5 stars...however the service was pretty horrible, our waitress didn't really know what she was doing, she didn't come check on us from time to time to see how we were doing, we had to go look for her around the restaurant so we can order additional items...she also go our orders mixed up...

was generally a pretty poor dining experience despite the fact that the food was okay..probably will not come back again"}
{"text":"Hot ramen on the patio during a hot summer night. Yeah, it sounds weird but it felt like the right thing to do on our first night in Toronto. We were doing a tapas crawl of sorts down College, because when you have a limited amount of time in a city, you have to get in all the food you can. 

My husband started with a sake flight and I started with a sochu flight. Both were tasty, but the sochu flight had a bit more flavor variation and was therefore more interesting to us. (The sake flight focused on sweet/fruity types; would have liked to see some drier varieties represented.) 

We ordered three dishes that we realized, in hindsight, were more than a little pig oriented: pork tacos, pork hocks, and a mini tonkotsu ramen. The ramen was the star here, with an especially rich and flavorful broth. The pork hocks were very nice and had a wonderful texture. The pork tacos were a last minute substitute for a dish they ended up being out of, and while solid, the flavors were not exceptional or memorable. 

Service was a bit on the slow side, but we weren't in a hurry. It was nice to sit on the patio, watch baseball on the TV, and enjoy some tasty Japanese food."}
{"text":"??????
???????????????
????????
????????????
?????????????????
?????????????
???????????"}
{"text":"Decor at Ryoji looked like a night club with lots of gold and bling everywhere.  Nice comfy sofas for you to sit on.  Ramen was perfectly cook and the pork was tasty as well.  Price is decent comparing to all other Ramen places.  Lots of staff to serve and also checking up on you.  They have a beautiful outdoor setting as well."}
{"text":"Very bad Servise, I order a chicken soup ramen(the winter special one)?I was waiting for 40mins, and I asked the waitress, she said she will check, and when she back she told me they don't have any more."}
{"text":"I was drawn in by the cozy patio -- I needed some lunch and ordered the Cold Noodle special. It was literally the worst $10 dish I could imagine ordering on College Street, and it took 45 minutes to reach my table. On top of that, I've been sitting on the toilet for the rest of the day and night. Absolutely ridiculous excuse for a kitchen.

I never post Yelp reviews, good or bad. This experience was so awful that I had to."}
{"text":"Stopped by Ryoji for a bite with the girlfriend on a chilly Friday night. The atmosphere was nice and the restaurant is nicely decorated.

We were interested in the small plates rather than ramen, but we decided to try a bit of both. Off their specials menu we ordered the kobe beef sushi and the squid karage. From their regular menu, we got a mini-bowl of garlic oil ramen, chicken karage, the pork jowl dish, and a cold tofu dish (ji-ma-mi). 

The kobe beef sushi was a little underwhelming. It didn't taste bad, but it was lacking creativity. Kind of plain. The cold tofu was interesting, it didn't taste like any other tofu I've had. It wasn't soft and falling apart, but rather a bit chewy. We both certainly enjoyed it to start our meal. The squid karage was fantastic and very tasty. Our ramen came shortly after that, and I have to say that it was done quite well. Not the most amazing ramen, but a very solid bowl of noodles. The soup was good and not as heavy as other places. The pork jowl was oustanding, fantastically cooked slices of pork jowl that had just the right amount of texture, served beside a really tasty wasabi pesto. The chicken karage was also decent, but both my girlfriend and I preferred the squid. 

Service: it was okay. The waiters and waitresses were friendly but I had to ask for water a few times. Not a big deal, but I also would not have minded if they just left a bottle of water at the table. 

Overall: Not a bad option if you're in the area and craving non-sushi Japanese food. I'd probably visit again, but wouldn't go out of my way to come here."}
{"text":"- okinawan food is pretty dang good. they love their pork.
- try the ton-toro (grilled pork neck), mimiga (pig's ear), takoyaki (instead of batter, they use deep fried mashed potatoes to cake the octopus)
- reasonable prices.
- didn't try the ramen yet
- i'll be back."}
{"text":"Personally I think this joint should get top ramen ranking - the ramen is unquestionably amazing and there is little to no ramen-goer traffic in Little Italy so that you can actually be seated in a reasonable amount of time and have leisure to enjoy your meal.

They used to offer two main broths: pork and chicken. They've changed up their menu a bit, so I'm not sure if they still offer the chicken-broth ramen. 

For dinner-goers, they can get pretty unique izakaya items along with great the ramen experience."}
{"text":"I really enjoyed this place. The food is very good, from starters to ramen. I shared a bunch of appetizers (Kobe beef, grilled squid, takoyaki, nanban fried chicken) and all were good to great. The fried chicken was my favourite- juicy and full of flavour. The takoyaki were some of the best I've had in Toronto. The starters ranged from $7-12, and the portions were average.

I ordered a regular spicy miso ramen ($12) as well and thought it was excellent. It wasn't actually very spicy, but the flavours and textures were really good, and the portion was big enough.

Beer is affordable and there's a wide selection of wines and sakes."}
{"text":"Pork belly in two ways was huge in portion size.  Ramen was flavorful and noodles were perfect.  The broth and chashu might be a bit fatty for some people.  Still a fan!"}
{"text":"Good service, nice space.

Food, good:
- cucumber and wasabi (literally pieces of cucumber on a plate, with a side of wasabi, yet delicious)
- beet salad; fresh miso dressing
- grilled squid
- pork neck (sauce was amazing and perfectly salty and fatty pieces of pork)

Food, skip it:
- fried shrimp (I hate that mayo sauce izakaya places put on fried things)
- beef cutlet, nothing interesting

I never seem to like the drinks at izakaya places, this was no different.  She did admit it was the first time she'd made my drink though (I didn't complain, she volunteered this information).

It was a perfectly fine time, but I most likely wouldn't be back. And no, we didn't have any ramen -- so there's always that!"}
{"text":"The izakaya competition in Toronto is getting pretty stiff.  I came here on a Friday night at 10:15 and was seated immediately.  Decor is neat - the ceilings and walls are covered in mirrors so it makes it seem like the place is much larger.  Waitress was very friendly and visited us often.

Onto the food.  I had the Kara miso Ramen.  I've been to just about every ramen place in Toronto and have to say this ranks as number 2 next to Santouka.  I like the texture of my noodles hard and they were spot on.  The soup was salty and savoury just like it should be, and there was a generous amount of chasu (sliced pork).  This was by far the best part of the meal.  Unfortunately, two of the other items on the menu we wanted were unavailable so I had to make other selections.  I tried the rafute platter which was four huge pieces of pork belly braised in two different flavours.  It was OK.  The salty one was slightly over cooked and a mush of meat and fat.  Probably not the right choice for a table of 2.  We also tried the new grilled calamari, which was done well but a bit bland (the dipping sauce was good) and takoyaki balls.  The upside is that both of the apps were below $10 and large portions that could have easily been split between four or more.  Sapporo and Asahi are on tap.

Ryoji has a cool atmosphere and would be a nice spot to have a few apps and drinks in the evening.  I'd say Guu and Hapa have better tapas menus, but you really can't beat the ramen here."}
{"text":"Best ramen I've ever had in Toronto. Fall off the bone ribs, eggs were perfectly cooked. Came here for lunch and had ramen which was AMAZING. Then for dinner they have a different tapas menu which is equally as delicious. I prefer the ramen though :P So so so good! I always get the ramen with the vodka infused chilli oil. 

Helps that the service was great. Really polite and chill people."}
{"text":"Ryoji's stands out because of its great atmosphere without attitude.  In my decades in Toronto, I wasn't aware old College street was capable of such charm anymore.

It's a rare triple threat of well-thought out:
- bar area and drink selection, 
- restaurant seating and food and 
- music and dance floor!  

It's both dim and bright at the same time: with pale wood and reflective surfaces, but the lights turned down low.  It's both intimate and partaaay depending on which side of the restaurant you want to sit in.  Whether you're on a date or with a bunch of friends, you'll find your nook and purpose.  

The servers are professional and polite Japanese & Canadian staff.  We had the takoyaki (octopus balls--I know, I know), taco rice and friend chicken, which were all thoughtful renditions, not super, but yummers nonetheless.  A few beers too, and the bill was under $50.

I went on a Thursday, when it happened to be a residents' DJ night spinning Cosmic Disco.  Even the disco sounded right.  

Better get the address down because Ryoji's facade is not too remarkable in the dark."}
{"text":"My review is solely for the Okinawan Soki soba.

I just ordered this dish because I've been craving it ever since my trip to Okinawa. It's an addicting soup that I couldn't stop dreaming about.
It's light yet unique and isn't greasy like the other ramen options so I would call the bowl pretty comforting. The noodles weren't like the ones that I had in Okinawa (chewier at Ryoji) but they were equally enjoyable. No complaints here. They also added all the right toppings and provided me with the unique koregusu which is vodka-infused chilli peppers. Love!

It's unfortunately out of my way in Little Italy and don't think I will be able to go too often."}
{"text":"It was awesome  i really enjoyed their roll n fried chicken and salad :) 
I love japanese food !!!!!"}
{"text":"The food was actually amazing, and its definitely a cool place, really good japanese tapas and ramen. It was really expensive though, and they have those tiny beautiful servings that you feel hungry after. But the biggest problem was that when we got the bill they had added like $10 of food and alcohol tax which was a total surprise since we'd been eating and drinking out for days without ever seeing that on another bill. So we felt like we got scammed by this restaurant, at every other restaurant the taxes were included in the prices. For that reason I wouldn't recommend coming here, because they add about 30% onto the bill without telling you beforehand. Also the house white wine was really bad!"}
{"text":"This was one of the worst ramen experiences I ever tried. The service took forever (1 hour) from time of order to when food was served. We ordered ramen so I don't know why I takes so long. Then it took another 15 min to get the bill. The ramen also didn't taste that good and it didn't have any of the toppings that the menu said it would come with. For $13 for a bowl a ramen I don't think I will be coming back to this place."}
{"text":"I love ramen noodle and this place looked really inviting.  I thought the pork ramen Noodle I ordered was acceptable although my boyfriend ordered a vegetarian ramen dish that we both didn't find appetizing.  We don't often send food back as we are not too picky but it was very bland.  When we asked the waitress if he could order something else she replied that we mind as well pack it up to go because we still have to pay for it. We were not offered an alternative and there was not even an attempt to satisfy their customer.  Very disappointing."}
{"text":"Came in on a freezing Wednesday night, so there was no wait as they were only half full.  It's pretty quiet, with just the owner and one other employee greeting you as you come in or out.  I definitely prefer the quiet atmosphere - call me overly Western but I want the food and drink without the noise level of the typical izakaya place.  The location is chic and trendy, with mirrors and comfortable lounge chairs and benches.  A great place to enjoy a meal and conversation with a friend - why ruin it with drums and incessant chanting?

The food was well presented and of good quality.  We had the Tondo Tonkatsu Special Ramen, Poki Salad, Shrimp Mayo, and Tuna Tartare.  They brought us small bowls so we could split the ramen, and small spoons so we could split the tartare.  Everything was delicious, but my companion felt that the shrimp tasted either not fresh, or overcooked.  Also, as an earlier reviewer pointed out, the Poki Salad has some weird textures.  The seaweed is a bit chewy, and the tortilla shell is not crispy.

Service was good - friendly and prompt, good banter and anticipated our needs.  The owner also wanders around making sure everyone is having a good time.  

The reason why this place did not get a better rating from me was their drink menu.  Izakaya is supposed to be focused on drinking and serving small delicious dishes to complement said drinking, yet they completely missed the mark with their drink menu.  I was hoping for a crazy cocktail list like Guu's, and was sorely disappointed to see that their list of cocktails were merely standard bar cocktails with clever Japanese themed names.  (Sex on the Okinawa Beach?  Long Okinawa Island Ice Tea?)  All they had was a standard restaurant selection of beer, wine, and cocktails.  Where's the lychee or yuzu themed drinks?  The macha smoothie with whipped cream and vodka?  Not cool guys, not cool.  

Next paragraph, and I'm still not done complaining about the drinks.  Stay away from the Chu Hi drinks.  These are glasses of soda and booze, with fruit of your choice on the side.  They bring you a juicer and a piece of fruit, and you get the \"fun\" of juicing it yourself and pouring it into your drink.  I go out and pay high prices for cocktails because I expect someone *else* to do the messy, labour intensive work of preparing my drinks *for* me.  My companion insisted she enjoyed herself, but by the time she was done, there were grapefruit bits and juice ALL over the table and her hands.  

Overall a pleasant experience, but I am unlikely to come back."}
{"text":".The price was quite high. For example, $12 for only 4 small shrimp and a little sauce. And $9 for the cocktail drink which only contain little alcohol. 
Just taste like normal tea. Also, the taste was as good as most Japanese-owned restaurants. The sashimi was just randomly cut and the sauce was not enough. 

Apart from the price the the food quality, their service was really awful and rude. 
The service was very very very terrible. There were only three servers and everyone seemed to be too busy to even patiently listen to your orders. They didn't write down and forgot a lot. We asked for some sauce for 4 times! They just said ok and forgot it soon.
We kept waiting over 1 hour and only got half of our orders. We even waited for our takoyaki more than 30min (which we can get at other places after a few minutes after we placed the order. Not to mention long waiting time between each dish. We also saw many customers were just waiting for their orders. 
The most unbelievable is the servers' attitude. When we asked to cancel those not served and pay the bill, the manager was so rude to us. He said everyone was waiting, not just us. Finally we cannot wait any more and asked them to cancel the order. The manager was unwilling to cancel orders even the dishes was not prepared yet. After a negotiation, he finally cancelled our unserved order he even put the tip 15% as mandatory. But we didn't think it deserves. So we tried to negotiate and he just asked us to wait for another 15 minutes because he said he was \" busy\". He didn't even say a \" sorry\" to us. And he told us and criticized us about our cancelled items that he lost $40 bill because of our cancellation. His behaviour and words were incredibly rude. The waitress was also impatient and didn't look at us even we tried to talk.
We will never go here again. My accompanied friend have been to Japan a lot and also work in Japanese company. I also know a lot about Japanese cuisine. This should not be the service level of Japanese restaurant. 


To conclude, this is the worst experience I have ever been in Toronto and had for the Japanese cuisine."}
{"text":"Very cool spot.  Incredible pork belly platter that comes in a unique 3-bowl set up.  Pork just melts in your mouth.  Came in two flavors a BBQ broth and a salty/buttery broth.

Calamari salad was above superb.  One of the best I've had and it comes with a creamy sesame dressing.

Would've had 5 stars if their ramen was as good as my NYC standard Ipuddo!

Energy and vibe is really cool.  I'd definitely come back to this spot next time I'm in Toronto."}
{"text":"?????????????????
??????????????????????????
??????????????????????????
?????????????????????????????????
???????????????????????
????????????????????????????????????
?????????????????????????????????????????????????????????????????????????????????????
?????????????????????????????????????????????
??????????????????????????????"}
{"text":"For the price of $15, for lunch, you can get a side salad, a bowl w your choice of protein on a bed of steamed rice, and a small ramen soup of your choice! How awesome is that?! Being that it's in a college town makes it all that better because they know what's up when it comes to hooking it up with good food at a good price. The environment is awesome with a lot of red. They have indoor and front outdoor seating which is great for people watching. The food comes out quick and fresh! This is definitely a spot to come eat at, more than once for sure! I wish during my toronto trip I had known about this place sooner, I definitely would've eaten here more than once! BUT it was our last meal before driving to the airport which was the best goodbye meal we could've asked for!"}
{"text":"Came here for a late night food hunt.

Atmosphere was great, as it was the night before Halloween, the entire place was decorated and all staff was dressed up including the kitchen staff, which was pretty cool.

Now that being said, the atmosphere was almost the whole 3 stars. 

Food was not even mediocre. I ordered the special ramen, the soup had a weird taste and had a thick layer of oil flowing on top making the whole dish taste greasy, and the ramen wasn't fresh, texture was weird as well. The slices of pork belly was way to fat. Dish of assorted pickles was ok, but really wasn't worth the $2. Salmon was fresh, still not worth the $13 for so few pieces. 

I would not come back again."}
{"text":"3.5 

On College, the street full of mediocre restaurants, a few stand out to be different than the rest. 

Food was good. A twist on the typical Izakaya menu, which was nice to have something different. Service still needs to be improved - it just opened so hopefully they can work on some of the kinks. 

Inside, it's more a lounge, than a typical Bar type Izakaya like Guu. Shiny chandeliers, high ceilings, mirrors and lounge chairs. It's big, twice the size of Hapa. It's a different vibe, you could have a proper meal without people shouting at you, but at the same time, it doesn't seem as authentic.
When we walked in, it was quite loud, so their shouts seemed half hearted - I would suggest that they turn down the music. 
But I did like the music  J-Pop. 

They have some interesting Ramen choices, Okinawa style, not sure the difference, but seemed like a different spiced broth with different noodles.  I got the Spicy Black Sesame soba (not buckwheat soba) that came with the broth on the side for dipping. It was different, but the noodles seemed to over power the taste of the broth. Hubby got the Vegetarian Ramen, I'm still skeptical it's a fully vegetarian broth, but it was more tasty than my own. 

For snacks , we shared the Peanut Tofu that everyone keeps mentioning in the reviews. It was hard to find in the menu, so I asked for it. Although sharable, it's not really appetizing looking, just a big blob sitting in some sweet soya sauce. It was tastey, but I think it was the soy sauce that made it. 
Also got Potato Takoyaki. A great twist on the original, and less dough. I actually prefer this!
Also got the Fried Chicken (both wings and regular) and regular tasted better, with a mayo like topping. 

Then there was the Fried Chicken fiasco.  We ordered the Chicken Wings($8) , but we were brought the other Fried Chicken dish ($11). We thought it was our own mistake, and ordered the wrong thing - oh well - and started eating it. Halfway thru, the correct Fried Chicken Wings showed up and when we disputed it, the server told us well you've eaten it all, you'll have to pay for it. We were a little shocked, and started making a stink, when she went to ask her Manager. This was the right thing to do - she ended up taking off the mistake on (more expensive) off the bill. Our server from the beginning seemed new, and we understood it wasn't her fault, but at least now she knows how to handle it. 

We could have stayed longer and had dessert, but something about the fall sun shining into the glass windows made the entire area like a sauna. 

Overall, I think I would come here again, and yes worth a try at least once. I like how there are lots of side dishes to try other than just your typical Ramen. Hopefully their service will be smoother next time around."}
{"text":"They still have the best Ramen in town.  however side dishes no longer good after in the new menu, and they jacked up the price too."}
{"text":"Went there the other night with my gf for a date night.
Ramen was really good- I took Spicy Miso and my gf had mushroom one. Both really good and favorable. Not as good as Ichinn ramen in Kensington which is amazing but still really good!

Service was great though- Azriel did a great job, so attentive but not pushy. We were not starving so he recommended smaller ramen and then dessert after which was a great call. Drinks were good as well.
Whole night was really pleasant.

The only reason I am giving 4 stars but not 5 is the loud music.
I wouldn't mind it on weekend night but it was random Tuesday night.

Still, definetly going back as its in my neighborhood as well."}
{"text":"This last time at Ryoji Ramen was really pleasant as well. It's just formidable when you visit a place which provides you consistency and tasty deals every time you go. 

This is the kind of places that are concerned for building a clientele of regulars that would visit them without mattering they aren't in the hip radar anymore (sometimes ppl likes to make lines just for new hot spots).

About to entering the place I read on the blackboard: $$$Kobe appetizer half the price$$$ What??? Mmmmm!!!! Once seated, we were tempted by the waitress again... \"Today's deal is the Kobe appetizer half the price\", damn!!! So much inducement was kind of fishy even for a Japanese place..lol. After sharing our thoughts of how those Kobe cows are massaged and treated excellent, and how pricey their slices usually are, we decided that even if they were trying to get ridden of \"about to expire\" product\" it was going to be worth to taste it.

We scored, if you ever go on Sunday and they have that deal + 5$ Sake, you'll be so happy you won't even care next day is Monday. Those slices were like smoky butter that just melts in your tongue while you try to chew. Wonderful!!! 

The Ramen were tasty too, but this time the flashlights were stolen by an appetizer.

They had a big party in there as well on the upper part, but this place is so well planned, that the slopes, mirrors, and decoration give you space to just enjoy without caring what is happening around."}
{"text":"What follows is the review of a Ramen virgin::

Overall, my experience here was sensational. The food is wonderful and the service is far more attentive and professional than expected. I highly recommend this place for a fun and casual dinner spot.

Here's what we tried::

Poki Salad:: I would order this if I just wanted a salad, but over all wasn't terribly impressed by it. The flavor was nice but a little low on the sashimi. The tortilla bowl is made of whole wheat, making it oddly textured. I also found there was a little too much iceberg lettuce. Overall, I felt this dish would be better if slightly refined; a tastier lettuce, a little more fish, a better tortilla and it would be a real people pleaser.

Tondo Tankostu Special Ramen:: it was love at first bite for me. The soup base is subtle but dynamic. And that egg, I dreamt about that egg, words escape me to describe how wonderful it was. I particularly enjoyed that this soup had a bit of everything: ribs, egg, leek, spinach, chashu. Servers will explain how to order your noodles and I recommend the \"hard\"

Hot Stone Bowl Pork Kimchi:: better than anything I've tried in Korea Town, this bowl was a medley of delicious flavor that I will certainly be back for. This dish was beautifully balanced, hearty and satisfying in size and flavor. A true winner. 

What brought this place home for me was the attentiveness and knowledge of the service staff. It was nice to have someone carefully explain each dish with enthusiasm and detail."}
{"text":"Awesome! We ordered zucchini fritters, tomato tempura (which was amazing actually), gyoza beef dumplings, and Kobe beef tar tar. All delicious and our server, Alex P, was perfect, and did an excellent job of describing/explaining the various dishes."}
{"text":"Cold weather comfort food!"}
{"text":"I went to the okinawa night. There was many pretty cool performances with their traditional music. The food there was good, i ate okinawa ramen, fried chicken, oysters, and tacoyaki and so on. I loved all of them!!! Their stuff is friendly and the ambience is comfortable and enjoyable."}
{"text":"What can one say about Ryoji? When you walk into a Japanese bar, and there's a guy bowing to you, and another guy behind the bar with cornrows and a bandana ready to cook, you can't help but feel safe. Our waiter had a cool ring.

So we drank beer. And it was good. We also had fried chicken. Excellent.

Ambience was calm - made me feel comfy while throwing back beer. There was a wedding reception (or rehearsal) going on. That's cool, because we basically got drunk and joked about the newly weds (or weds-to-be) and how awkward it was that we were basically crashing a wedding (or rehearsal dinner) that we weren't invited to. The white groom guy performed the ritual \"look I'm cultural just like my Japanese wife and her family\" dance which was painful to watch but that has nothing to do with Ryoji.

4/5"}
{"text":"just had the ramen, which tasted good, but nothing mind blowing...good place for drinks and service was good"}
{"text":"My favourite place for ramen, the spicy miso has this delicious creamy taste. Try their specials. Their fried chicken is awesome and mackeral sushi.
The staff are always super nice, and the decor is really lovely. I love that it's not super congested with people and everyone gets their own space. They're super understanding towards students which is refreshing. A lot of restaurants show no love towards students so when Ryoji offers a student discount? In my books that is awesome. 

Will be my go-to spot for ramen for sure!"}
{"text":"Why am I paying for a fine dinning experience sitting on a patio with platic chairs and table with  beer labeled umbrella's?

I used to REALLY enjoy this place would have given it a four star in the past but their recent changes fail! Let me explain......

I live down the street and pop in for a drink/ dinner quite often.  I loved that it was full, lively and had \"bar food\".  It was simple, each dish was large enough to share between two people (I used to order 5-7 dishes between two and be full).
I went last night expecting to share a few plates and drinks...

They have changed the menu 100% (as of this week) 
I get five slivers of salmon the size of my nail for $15, a root salad that had six pieces for around $16, shrimp tempura was four small shrimp for about $18 and markel roll (4 pieces) was around the same price.
(Although the quality was very good and the presentation A+)  

I was shocked at how tiny the portions are with such a heavy price tag.  They are trying WAY too hard to be upscale.    I truely don't mind paying $$$ for an amazing fine dinning meal.....this just isn't the place.  I do hope you they bring back their old menu or something similar and return to being a place where you can just enjoy a decently priced, tasty meal with a few drinks.

*My friend ordered that Ramen and it was still the same price and size"}
{"text":"Had a good time at a tasting event here. Tried 4 different izakaya's dishes Deep fried house-made Okinawa tofu (atsuage), Grilled Tontoro (Pork Jowl), Takoyaki (Deep Fried Octopus Ball) and Fried Ebi (tiger shrimp) Mayo. Definitely enjoyed the tofu, pork jowl and fried ebi as they were quite flavorful. The takoyaki was interesting as it was made of potatoes but didn't really taste any octopus in it. Also tried 4 different kinds of ramen as well. I tried the Tonkatsu (rich pork broth with egg white ramen), Shio (sweet soy broth with whole egg ramen), Shoyu (light chicken and pork bone broth with whole egg ramen) and Okinawa Soba (light bonito and pork bone broth with traditional Okinawa style soba). All the flavours were good but the Soba noodles were my favourite as it was full of flavors. My only criticism is if the pork was a bit more fattier as that's how I like my meat in the ramen. Also had the Sata Andgai for the finishing touch and simply loved it! Overall, great experience. Loved the decor and the staff were friendly as well."}
{"text":"Yes yes yes so good. I had the vegetable ramen with an added egg and it was great! Plus you get sooo much food, next time I would just get the mini size, and both the regular size and mini sizes are reasonably priced. Plus $10 for a 30oz mug of sapporo!"}
{"text":"Very filing!!
We went for the Ramen tasting. My daughter and I were traveling from the US. She is 1/4 Okinawan but has never been. She has a love for Asian food and enjoyed every minute of her dining experience here. The atmosphere has a modern Japanese twist. I lighting set the tone, the bar is long and big and the people are super friendly. We had edamame,  3 ramen dishes and a desert. I also had Saki beer. Yum to all!! The edamame had an anchovy sauce to give it a salty kick. The ramen had a tasty broth filled with protein and veggies. The desert was a donut hole type pastry with carmel sauce and ice cream. Amazing presentation and a flavor explosion!"}
{"text":"The food was descent but the food comes out slow and we had to follow up with our orders in order for the food to come. We also ordered the baked oyster and realized at the end of the night that it never came and we were charged on our bill for it. The server should have followed up with our order and made sure that all the food comes to our table. It was not exactly the best experience I have had with izakaya restaurants."}
{"text":"Hung out with my friends at Ryoji recently. The decor is definitely out of the park and not your typical izakaya! It is trendy, comfy and posh. 

The sake list was limited and a few were out of stock! 

Their tapas selection was good and food was awesome! We ordered steak and it was tender and spot on medium rare! The fish carpaccio was tender and nicely marinated! 

We wanted to try their mochi sorbet but to our disappointment, the four pieces they claim in the menu were actually four half pieces. No one was expecting half piece mochis and became an immediate turnoff."}
{"text":"tried calamari & chicken & ramen
it was gooood ;)"}
{"text":"I was really excited about this place,  I randomly heard some guy talk about it one day that it was his ramen place of choice and I had to try it. However, I was a bit underwhelmed.

So this place is big and chic, the decor really looks nice like a place to hang out at. It's not your typical ramen place that is usually no frills and small. This place is massive in comparison, and as a result, was empty.

We started with the Tuna Carpaccio which was about 8 slices of tuna overtop of some nice sesame oil and soya sauce and greens, this was rather nice I think.

They got basically two ramens to choose, Shio or Tonkatsu. Tonkatsu is basically pork broth and thus very rich in flavor. The Shio is a mixture of pork and chicken broth and thus a little lighter. You got your little bits of fat on the top that actually hasn't grossed me out too much in other ramen places but this place it kinda did.

A tip, so with the Shio ramen you can upgrade it to have an egg for $2 more, but here's the kicker. If you just get the regular Shio and then add an egg, the egg itself is only $1.50 so instead of ordering your pre-assembled Shio+egg for $13, you order the Shio for $11 and then add an egg for $1.50 saving yourself $0.50. Now the waitress was on to what I was asking and said there was extra meat, but the menu does not say so. I did not need more meat and here is why.

This meat, the Chashu, is super fatty, Now this may be proper pork belly, but most places have a nice marbleized meat, not this place. This place has meat that is like 80% fat. I'm not a big fan of fat so this wasn't my liking.

The broth, I don't think it's as good as other places nor was the noodles as pleasing. this was a disappointment for me.

I looked onto the other table and they ordered tea which comes in this clear glass with this little holder. Unfortunately, it came apart on her and ended up spilling all over the place. She got some very lack luster sorry and another tea, but for that, I mean it's hot tea, I would of expected a bit more."}
{"text":"My Japanese friend recommended this place. I went Japan over 5 times, experienced ramen many times, so I'd tried real Japanese Ramen. I could say It was pretty good taste, Most similar with Japanese Ramen among those in Toronto."}
{"text":"Great chic setting with plenty of space for plenty of groups, and a small horseshoe bar right by the main door. The overall largeness of the space is the most noticeable aspect that makes Okinawa import Ryoji stand out from other such places in town. Feels lounge-y and traditionally Japanese at the same time.

On the other hand, I ordered a shio ramen. I guess even for $10 the bowl ranks on the small side, though I did enjoy their notably thin noodles with good texture, and was overall warm and happy with each bite. A side dish of octopus balls ($7) arrived bloody piping hot, but later revealed itself to be mostly mashed potatoes with a tiny chunk of octopus embedded.

Just on the ambiance alone Ryoji would make for a rockin' place to hang out with a few friends. But for a place that calls itself a Izakaya, the beer and sake selection is too small.

{TTC: 506 streetcar to Crawford Street.}"}
{"text":"Nice and cozy place, good service and excellent food. I was surprised by this place, it looks like a Japanese modern gastro pub serving delicious ramen. I had the traditional Tonkotsu ramen and it was perfectly done. The soft boiled egg added an additional authentic twist to the dish. I also tried the sashimi that I would definitely recommend. The ambiance is nice, the decor is modern and the staff very friendly. I didn't try the deserts or the cocktails, but I will definitely return to this place."}
{"text":"Great new addition to the growing restaurant scene near the Ossington strip. I came here on a Tuesday night and we were seated right away. Ordered the Ramen and tofu. Portions are on the smaller side but very tasty. Ryoji is not only a Ramen house but also an Izakaya. It's a good restaurant if you want a mix of both but I could think of better restaurants that specializes in each category: Kingyo for Izakayas and Santouka for Ramens.

Overall, it was a pleasant experience and will come back."}
{"text":"The space is beautiful. Modern, chic, and a perfect place to hang out with friends on any night of the week really. We were seated in the lounge area, where there were tv's playing the sports games, and comfy chairs to relax in. The mirrors along the wall definitely make the space a lot larger than it actually is (great tactic).

Looking at all the menu items, there were a few things that seemed to be unique and different from other ramen shops; it is an izakaya afterall! My friend really wanted to order the carpaccio of the day, so we went with it! Today's selection was octopus, with balsamic soy, dragon fruit, green onions and lots of bits that was presented rather beautifully on the long plate. It was so artistic that I didn't want to eat into it! 

At first bite, I took in a rather salty bite... from the sauce, I presumed..... I wasn't sure what to expect from the octopus as a carpaccio.  I can't say it was not the same as how a beef dish would be. It was sliced nicely but not super thin (I don't think it could get that way) and the acidity from the sauce didn't really get soaked into the octopus because of it's rubber texture. Should octopus be served as a carpaccio? I'm not quite sure.

Nothing else on the menu really sparked our interest so we went for the ramen - the tonkatsu for my friend and the chicken broth one for me, except I wanted all the toppings from the vegetarian ramen option. I was very happy that the waitress was extremely accommodating and gave us multiple options to maximize our overall experience.  You can also choose your noodles to be soft, medium, hard or extra hard. She recommended to go with hard because the hot broth will cook the noodles a little once served so we went with her expert advice.

The ramen came out piping hot, just the way I like it. The vegetables were plentiful and full of colour. The noodles were large, you would never know given the medium sized bowl. I must say that the broth was not over powering which was nice and my friend found that the tonkatsu was not as heavy as she is use to which was nice. The noodles, although hard in texture ended up getting soft quite quickly. I will have to go with the extra hard next time to make sure there is enough bounce with each bite.

Although the chairs were comfortable in the lounge, I found it a little hard to eat as the tables were low and you would have to lean over so much just to eat your food... probably better as a late night option for drinks instead.

Overall, a very good experience but I'll have to try some other ramen places before coming back."}
{"text":"My girlfriend and I tried this place out last week and I was a big fan. We were sat quickly and the service was good. We began our meal with the wasabi cucumbers, which are fun and do have a bit of a kick. The sake flight was a great buy and gives you a good opportunity to try some different sakes.

For dinner we each had ramen dishes. She had the spicy miso ramen with an side of pork belly and I had the tonkotsu with an extra hard boiled egg. Between the two I'd say hers was the clear winner. The spicy miso is really quite good and I'd recommend giving that a try for sure if you want a ramen dish with some heat and wonderful flavours.

Overall I'd certainly go back and would recommend this to place to anyone in little Italy looking for some ramen."}
{"text":"Very cute ambiance. Lots of mirrors and lights giving a more spacious effect to the whole place.

Tonkotsu ramen & Shio ramen: It was alright.. The tonkotsu ramen tasted better than the Shio ramen - but the broth needs more flavour

Ji-Ma-Mi (peanut tofu): 3.5/5 I liked this! It had an interesting mochi-taste; I enjoyed the tofu mochi paste itself without the sauce.

Grilled calamari: 2/5 nothing too special.

Goya chanpuru (stir-fried bitter melon slices with tofu, scrambled egg and pork belly): 2/5

Service was great."}
{"text":"The ramen was great. The rest was OK. The food came very slowly and the izakaya meals were not as great as the other izakaya places i've been too. I'll definitely come back for the ramen tho"}
{"text":"Came here with a party of 15 for my best friends' birthday on a Friday at 8pm.  They quickly sat us at a great large communal table by the bar, which allowed us to easily add/subtract party people.

The vibe of this place is great. 
Loud and loungy (is that a word?) and everyone is chatting away at their tables, drinking the night away. 

Dim lights, and high energy make it easy to order sharable apps and drink the night away. The food was special and tasty. 

Definitely a place I'd return to. 

Fun fact -- the washroom toilet seats are heated! Huzzah!"}
{"text":"Great authentic Japanese  Bar experience with some of the best soup & tapas in town 
The only franchise outside of Okinawa!
And delicious unique cocktails & generous wine pours.
Great staff too
My new patio hang on College this summer for sure ."}
{"text":"I came here for their Okinawa night which is a $20 buffet.  Items included Bitter Melon Salad, seaweed salad, battered fish and green beans, stewed chicken with black sesame, rice porridge, wheat noodles with vegetables in soup. All items tasted average; favorite was the fried fish.  I would have given this event a higher ratting but the services was terrible.  They told us food would be served at 5pm but it came out 30 mins late.   One big plate of food came out every 10 mins and then we had to form a line to take turns filling our plates.  Some of the popular items were gone quick so those that waited in line would have to wait another 10 mins for the next batch.  They didn't always have new clean plates or communal tongs so some people brought up their previously used plates and chopsticks which contaminated food.  There were no heating stations so food that was sitting there got cold fast. If you wanted to try all 6 items you had to stay for 3 hours as the noodle soup came out near the end.   My guess is they didn't have enough staff to deal with both the Okinawa night diners and their regular diners that order off their regular menu.  Also for parties 6 or more they charge auto gratuities (15% and they tax tip)."}
{"text":"First impressions: Gorgeous lounge-like interior, kind of dim but beautiful accents in the dining area. One of the only ramen places in downtown Toronto that are open until 2 AM on Saturdays (blessed). Last call is at 1:30 AM! 

I liked that they have two sizes for each of the ramen, the waiter told us the difference between the small and the regular is small = one fist size of noodles, regular = two fist sizes of noodles. 

We ordered an appetizer to share-- the octopus with wasabi root. It comes with some sheets of dried seaweed, and is heavy with the wasabi root. If you're not a big fan of wasabi, may want to skip on this one. However, I really enjoyed it and the green onions in the dish helped cut down on some of that spicy wasabi taste. 

We ordered the classic Tonkatsu (Regular) and the Spicy Miso (Small) ramen. Be aware that in some of the ramen dishes, the egg is not included and costs an extra $2. I had the Spicy Miso, it was pretty good. The noodle texture has the perfect amount of bounce to it, and the broth was good although not really as spicy as I would have liked. 

The real standout was our waiter! He was really funny and helpful in giving us suggestions. We ordered one ramen to go last minute for our friend and he was able to rush the order for us. Amazing guy, wish we got his name so we could shout him out here!"}
{"text":"A nice environment, interesting food ideas, and fantastic ramen (we had the spicy miso). I would not agree that it is overpriced (as some have said). Admirably, they are trying to stand out by a unique menu, but I can't say that the food was consistently delicious. I would recommend it for something different. I enjoyed the Shochu with lime, something I've never tried before (refreshing light alcoholic drink). Service was pleasant and food came relatively quickly."}
{"text":"June 24 - Tue - Rainy
Strolling down College St at Little Italy on the day that Italy had been knocked out by Uruguay.  What a gloomy day for Italian fans; and I'm one of them : (  (I'm now cheering for Belgium..... why? ....... coz they make good chocolate!)  ok.........  back to that gloomy day........ oh.......... we saw \"lights\".......... there were rows of lamps in the front big window of Ryoji.  This place looks classy with soft lightning and wood decor.  We were greeted right away and was seated facing to a TV.  Our server moved the big leather chair around for my friend to face the TV.   Very attentive and caring server!!  He went over the menu and gave suggestions on what to order.  We had Goya Champru; it's sauteed Japanese bitter melon with salted pork belly and egg.  It came in a small portion in a white bowl with a \"small\" spoon.  I finished it in about ten spoonfuls (would be 3ish for a regular) I couldn't tell what's in the sauce, but it tasted so good!  Next came the Rafute; one cubed cut pork belly with a soft boiled egg and lotus puree.  It was presented so well on a big white plate.  The pork belly is tender and the top is crispy.  We had a mini ramen after the two tapas.  The soup base was good and I love the thin noodles as well.  The mini is just $7; reasonable price!  This's my fave ramen place nowwwww!!
Our last dish was - SataAndagi; donuts with chocolate together with a scoop of ice cream.  Luv the food here, their service, ambiance and the comfy big leather chair : ) Tapas are a bit pricy, but worth to try!"}
{"text":"Came here for a large party, 17ish people and service was fast and efficient. They were able to accommodate individual bills easily, so props to them! Selection of appetizers was reasonably priced and tasted good. We had the karage, grilled squid, beef tataki, and takoyaki, all very good. Takoyaki was better than I've had at most places. Didn't try the ramen so can't comment on that, but it's nice that they have a small size option (~$7) and the full size option (~$12) for people who want to eat more or less. Also sapporo pitchers were really affordable at $20!"}
{"text":"Usually, I headline my reviews by my orders and recommendations. But since I went to a Toronto Commons event (and we get to nibble on everything), it will be fully incorporated into my review, cheers :) 

Starters
Deep Fried Homemade Tofu: tangy and salty- very flavorful. I am not usually a fan of tofu but I loved the novelty of the texture.  

Tontoro (Pork Jowl): rich and delicious, it reminded me of chinese pork. 

Takoyaki (Deep Fried Octopus Ball): Fried mashed potato, ocotpus, bonito flakes, pickled ginger, tonkatsu sauce and mayo. I found it interesting- there was a mashed potato mixture on the inside with the octopus ball. 

Ramen
Tondou Tonkatsu Ramen: Rich and flavourful pork bone broth, topped with chashu, bean sprout, scallion, and kikurage mushroom. I found this to be a lovely. very heavy/rich of a dish. 

Tondou Shio: Light and flvourful chicken and pork bone broth, topped with chashu, leek, konbu, fish cake, and yaki-nori. This was my personal fave. It was rich in flavor but not as overwhelming as the Tonkatsu

Seasonal Special Ramen: cheese ramen (delicious) 

Tondou Vegetable: Konbu and Shitake mushroom broth topped with thnkly sliced mixed vegetables and finished with garlic chips, black pepper and basil oil. I found this to be an interesting western fusion dish with the sliced red peppers and balsamic vinagrette to add an earthy aroma/taste.

Dessert
SataAndagi: Freshly prepared Okinawa doughnuts drizzled with chocolate sauce with ice cream. This was a rich ice cream and I loved the homemade jam that accompanied the dish 

My suggestion is to check out Toronto Common (torontocommon.com) if you haven't already. It is a great business that lets you sample little portions of their top sellers. I think I paid $25/person for all of the samplers I got above. Definitely well worth it :)"}
{"text":"Came here with a friend because of her recommendations. Appeal was great, food was great and service was decent. They missed one of my friends order though and made him wait an extra 10 mins. Server should have been better at taking orders."}
{"text":"Arrived at Ryoji Ramen with my girlfriend on a blizzardly Thursday evening. 

We had read that they do not take reservations, so we were slightly concerned that the wait would be long (though we really banked on the fact that there was so much snow, that people would not be out and about). Gladly we were right, and managed to get seated right away.

The style and layout of the restaurant is very appealing. I couldn't get a glimpse of the entire place, but firstly - it is big. Secondly - they make the place look very modern.

We were seated just off of the entrance way, near the windows facing College St. The seats were like large armchairs, but the proportion to the height of the table make it perfect for eating in. I'm typically skeptical on arm chairs because I expect you to sag right in once you sit - not the case here.

Our server was friendly (somewhat too friendly) and walked us through our options and the menu. The only reason I may say that she was too friendly, was because I found her to be interruptive when me and my girlfriend were talking - she would simply cut me off mid-sentence. A minor detail truly, but had to note it.

OK the food and drinks:
 To Start:
  - Ryoji Takoyaki
  - Atsuage Tofu
 Followed By:
  - Otoko-Aji Kara-miso (for her) - Tonkotsu ramen w/ spicy miso paste
  - Otoko-Aji \"RYOJI\" (for him) - Tonkotsu ramen w/ boiled egg and extra Chashu
 To Drink:
  - Nigori Junmai sake

The meal was overall enjoyable. The highlights were the ramen itself - good broth and I enjoyed the firmness of the noodles. The appetizers were disappointing though. Neither of us found them to be particularly noteworthy. 

I would go back again for the ramen."}
{"text":"For me there are certain specific meals in life that spell out comfort food but none more than Japanese for me! Nippon food isn't typically something very highly seasoned yet simplicity is key to a finely crafted meal.  On a cold December evening I was craving a nice piping hot bowl of Ramen. In SW Japanese cities such as Osaka, Ramen is a food culture whereby people slurp noodles in Ramen bars in places such as Dotonbori in silence where a specially tuned broth is finely crafted by day and noodles are hand made. 

Coming to Ryoji it was evident that this was owned by Japanese with your typical greeting when you walk in the door and a nice communal table facing the kitchen.  The decor was tasteful of wood accents and mirrors to make the place feel larger.  The kitchen had an open design that you could see some of the action of the chefs preparing your meal.  

We ordered the wasabi cucumbers as an appetizer and the grilled tako. The wasabi cucumbers were nasal clearing good but not overly overpowering that they were unpleasant to eat.  If wasabi is not your thing avoid.  The tako was exquisitely prepared and succulent and not overcooked.  My main reason for here was however for some Ramen.  My selection was the Ryoji Ramen which had soft boiled egg, pork belly. and vegetables.  When ordering I was asked how I want the noodles (firm, medium or soft).  Medium I selected.  The broth was really exquisite.  It came out piping hot with a very buttery but smooth and superbly flavourful broth that was lightly salted.  Really how Ramen should taste!  Noodles were cooked to perfection.  Serving size was not ginormous but adequately acceptable."}
{"text":"Bla..  I want to give this a two star but I'm being pressured to give it a three by my lunch mates. I hate peer pressure! 

Came in here for lunch. Their lunch menu is small. I guess this is typical of ramen places. Has only about 6 types of ramen and some appetizers. 

I got the Shio Ramen. For the price, it was not worth it. It's not a very big bowl, the noodle weren't anything special, the soup did not have good pork flavour and it was quite light in my opinion... there was also a THICK layer of oil on top of my noodles floating around... lovely. 

My friend got the curry chicken with rice.. that was okay..  and my other friend got the vegetable ramen which was alright.. I honestly don't have anything good or bad to say about this place. All I can say is, the ambiance of this place is REALLY NICE. Gorgeous lighting and seats, patio is large as well. But the food itself is mediocre and pricey.  Service was also kind of slow since we were sitting out on the patio, and the servers don't come out that often. Overall, not my fave ramen place."}
{"text":"Okinawa style ramen. It's something I've never tried before, and I always wondered what the difference was between the ramen places I'm used to (Kin-Sanso-Touka-Jin let's call it!) and this place.

When I arrived today at around 1pm, there was only a couple seated inside. At first I thought I went to the wrong place, as the signage was slightly confusing, but it was the correct place. They had a $5 Sapporo special, though I wasn't up for alcohol this early in the day. I ordered green tea and the shio ramen, though I was really considering the tonkotsu ramen.

As I said, you can't compare the Okinawa style ramen and the other more mainstream ramen joints, as their styles are different. Personally I find the ramen okay, but it was too thin for my liking. I asked later, and that's apparently what Okinawa style ramen is. Ah well, guess I know for next time. The broth was decent, though a little oily for my liking. So just a note, if you like your ramen thick (like me), this isn't the place for you to try ramen.

I wouldn't mind coming back for the izakaya side of this restaurant, however I'm rarely in the Little Italy area at night."}
{"text":"This place is solid, I'm surprised it hasn't scored higher. The interior is decked out in fun styles and staff greats you with traditional welcome chants (screams if you're lucky).

We came in a group of 12 and they were very accommodating, everyone showed up at different times and they had no issue. Also gave us our own bills.

We ordered off the special menu so I can't recount all the details - each week I believe is different anyway. We were very happy with the tastiness of the food!

Saturday special $10 Saporo pitchers too - can you say WOW I'll take a second!

KABAM! Go here - you'll be happy you did."}
{"text":"I'm surprised that this place doesn't have a higher average ranking!

Never heard of this place until my pal suggested that we meet here. Right in Little Italy, it was super easy to get to. For a Tuesday night, both Ryoji and Little Italy was quiet, but I'm assuming that it's busier from Thursday on.

Ryoji is an authentic Japanese restaurant with locations in Japan, their menu has a lot of Okinawan dishes, which are quite unique. When I was in Okinawa, I had a lot of dishes with goya (a vegetable that's supposed to be really good for you) and taco rice (so simple, but so awesome).You can find both these things in the menu. I really like the decor of this place - they have both a dining room and bar area. Service was excellent; the staff are trained well as they know the menu and have recommendations for n00bs of Okinawa food. 

Food was pretty good imo. I didn't go with anything fancy - the taco rice hot stone bowl was super tasty. The drink menu was awesome - there was a lot to choose from including a variety of Chu-his (shochu highball). I recommend the Calpico (sweet milk drink) Chu-hi. They also have Asahi on draft, which is nice!

Wouldn't mind coming back!

Good for: drinks, groups, dinner, socials"}
{"text":"For a hilarious dinning experience you should order the coffee, shrimp and veggie skewers. If you want to enjoy your dining experience you should probably stick to the Ramen."}
{"text":"The best ramen in Toronto. It's very authentic! I love Okinawa soon soba  
they have a special menu which is seasonal! I love to try new things once in a while."}
{"text":"The place is super cute with bar, lounge and patio areas. There is also a good selection of ramen, tappas (cold and hot) and desserts. We tried a bunch of their tappas which I will comment on below:

1) Pigs ear - Tasted exactly as I thought but with miso on the side to add flavour... honestly, wasn't impressed and wish I didn't order this eventhough it was recommended?!
2) Steamed mussels - A bit overdone in my opinion, both in terms of overcooked and overseasoned. I wanted it to be more brothy but it was more of a thick, consistent and salty sauce on the mussel 
3) Squid tempura - I thought this dish had a lot of potential with the nice light batter and nice flavours but once again, so salty!
4) Takoyaki - This was one of the best takoyakis I've had in Toronto and very similar to authentic Japan ones I've had on my trip to Japan.
5) Spicy Miso Ramen - I'm not a huge ramen person but this ramen was really good. It was the thin ramen which I like and everything about it was good - green onions, pork and nice miso flavourful soup (wasn't that spicy!) 

Overall, the food wasn't bad but the overseasoning for some dishes made it unenjoyable at times. The service wasn't bad but I found that recommendations to not be very helpful. Overall, I think this place has potential, I hope to revisit and see if I change my mind."}
{"text":"Showed up on a Friday night at 7pm and it was closed - no sign on the door nor message on the website."}
{"text":"The tofu is amazing! I had to put it out there first, because (yes!) it was that great. We had the tofu champru, a delicious dish of stir-fried tofu with pork belly, bean sprouts and leeks, smothered with bonito flakes. Now, you would think that pork belly would be the star, however in this dish the tofu shines. It is made in house and has a meaty flavour and texture like I've never had before. I'm craving more already, and it's only been 12 hours since I had my last savoury bite. The leeks proved a good amount of \"green\" balance to the dish while the bean sprouts give a good crunch. The aforementioned pork belly was pork goodness leans well to the overall meatiness of the dish. I would DEFINITELY recommend this dish, even to someone who doesn't like tofu. I can't wait to go back again for more tofu bites!

Now, for what brings the star rating from 4 to 3. I had the tonkotsu with hard cooked noodles. I've never been asked how I would like my noodles cooked, but I'm an al dente kind of girl, so it was an easy decision. The noodles had just enough bite, and started to soften at the end in the hot broth. There were substantial pieces of pork belly in the soup, which probably would have been enough fatty goodness for one bowl. It had a delicious soy glaze which gave a nice contrast to the meat and whole bowl in total. The broth had a good amount of flavour, however it was a little too fatty for my preference. Not enough flavour to warrant the bits of fat floating in my soup. The pork belly would have been enough for me."}
{"text":"It should be two stars but I am still happy that our city is host to a variety of food that never gets old. Ryoji Ramen specializes in food from the island of Okinawa in Japan.
Food: we tried many things but not their ramen. The bitter melon and pork dish was tasty. The yellowtail was thick and delicious. The wings seemed baked and were not good.
They have a menu above the kitchen but do not actually have them. Every single one of the items was not available!! Why have them up there then?
Service was pretty bad. We didn't tip. Drinks arrived without glass. We asked for glasses and they forgot so we started drinking from the bottles. When the food finally came after a long wait they forgot extra plates. We asked them for extra plates and they again forgot. Finally, we ordered a warm dish but they served the fish cold instead and apologized 10 minutes later. Of course we were still charged.
They were playing Christmas music (actually I prefer Japanese music to get a real Japanese feeling when I dine at Japanese establishments), which is fine I guess but they were playing Christian country music with \"baby jesus\" and \"he is our lord\" and 'shepherds saw the king\" lyrics which was gross.
I am not a fan of the tacky chandeliers or Hawaiian shirts on the cooks either but maybe that is Okinawa style? Anyone the guys in the group complained about the waitresses not being flashy but one can ignore that because they always complain. Hey Bill, why didn't you take us back to Hapa?"}
{"text":"*I got a $50 gift card so part of this meal was paid by someone else :)
*my friend and I ended up ordering $100 worth of dishes and drinks as toward the end of the meal, we realized $50 was just simply not enough to fill up both of us.
*Servers were good except for manager who gave us an attitude, because we were using a gift card. 

-Red Tuna Sashimi with Salted Wasabi Pesto - $13: 
The tuna was placed inside a tube made out of daikon radish, and the flower-shaped radish resembled the falling sakura flowers. Despite the artsy presentation, I thought this dish was a bit too expensive for $13 as you are only getting a few chopped pieces of tuna here. I liked how the salted wasabi pesto had enough spicy kick without the heat linger in your mouth. However I couldn't really taste the raspberry balsamic soy vinaigrette as I felt there were too much raw red onions compares to the sashimi, thus I couldn't taste the flavors of the tuna.

-PEI Oysters topped with Yuzu Jelly - $9 for 3: 
Very good, sweet PEI oysters with a slight tangy yuzu jelly to brighten up the freshness of the oyster. 

-Kobe Beef Tartar - $15: 
I highly recommend this dish! The portion was generous for $15 and it would have been better if they offered more crostini or different type of bread! My teeth constantly felt like it's going to break soon everytime I took a bite :(. I liked how the fresh scallion puree and garlic confit aioli added just enough flavors while still letting the natural flavors of the beef tartare to shine through. It was not spicy nor too salty, just seasoned perfectly with some crunchy texture from the crispy rice 

-Kobe Beef Steak - $23: 
Again the portion was a bit small for $23 but it was another dish that both of us really enjoyed. The steak was perfect medium rare and melted in your mouth goodness. The garlic oil and pickled onions gave a hint of spiciness and the sweet(!) soy sauce was just right without overpowering the natural taste of the kobe beef. That bright orange puree is smoked carrot and I wished there was more, it was aromatic, smooth and comforting, yummy!

-Mini Shio Ramen - $7
The noodle bowl came out piping hot with a smooth and superb flavorful broth. With that said, it was quite bland and I felt the broth might be too fatty for some people. Noodles were cooked to perfection and I was surprised to see thin noodles (which is what I prefer anyways), and there wasn't an option to choose thicker noodles so I guess this is how Okinawa ramen is supposed to be?  The cha siu was buttery soft and melted in your mouth, but I would have appreciate it if there was more meat compare to fat and a bit more charred on the pork belly."}
{"text":"Love this place!!! One of the best Jap Izakaya dt. Especially enjoy my late night out on weekends! Beef tartre is a must-try, ramen nicely done!!"}
{"text":"I have to say the food is 3.5 star, portion vs value is 2 star, service is 5 star and ambience is also 5 star."}
{"text":"Don't come hungry.

We passed by Ryoji so many times and were always tempted to go in. I mean it looked great! Nice decor, classy looking, and well-located.

So we went in finally to give it a go. From previous Yelp! reviews it seemed like a reasonably priced, good quality izakaya and ramen place. But when we opened the menus and saw the prices, we were perplexed. It turned out that the owners of the restaurant had decided that same day to do two things that spell suicide for a restaurant that's not THAT popular: (1) increase the prices (2) decrease portion size.

I'm not sure what they were thinking as the restaurant at 8:30 maybe had like 12 people in there, including us. For a place that is quite large it was virtually empty.

Listen, it was date night and we were hungry so we ordered what we thought would be a decent sized meal, but when we got our plates I could only think of that scene in Demoltion Man where Sly Stallone and Sandra Bullock go to future Taco Bell, pay a fortune and get big plates with artfully plated crumbs. I couldn't resist aping Stallone's quip, \"Good thing I'm hungry!\"

Generally speaking the \"Tapas\" they served were plates smaller than the beer coasters atop which stood the only correctly portioned selections: our pints of Asahi Beer.

Food: 
The Red tuna Sashimi was tiny, wrapped in a superfluous daikon tube, and flanked by a sort of yuzu pesto and a flower. Fancy pantsy but we had to get a few more things. However, at an average of $16 per dish, with the most expensive one being the kobe beef \"steak\" at $35 it became a game of \"which plate is worth it?\" The answer: None of them. I am a growing lad so I ordered a Momofuku priced bowl of Tonkotsu ramen as a staple as I daintily nibbled at our selection of the Tofu dish in \"Ryoji sauce\" (which I think was some sort of sugary syrup made from natto), the tuna (as above), the fried chicken, and to finish off, the walnut creme brulée.

The tuna was delicate and nice but the potion was laughable, even by izakaya standards. My companion left hungry. 

The Tofu was nice but nothing to write home about.

The fried chicken was just fried chicken with some sort of sweet/umami seeping from the skin. Served with tartar sauce. Tartar sauce??

The creme brulée was cold everywhere. I didn't mind that much but my companion, who is a brulee fanatic had to wonder why they didn't heat it up in a bowl of water as many do, then torch it right before serving.

Finally the ramen. My god the ramen. At first I was satisfied as the broth was delicious, better than Momofuku's at the very least. But once I got to the ramen part, as in the noodles, it was downhill. They were overcooked, as was the chashu - in fact it was fatty and falling apart. The garnishes didn't do much to save the bowl and in general it was quite suspect. Of course I finished it, being the hungry fat bastard that I am, but that appears to have been a grave mistake. I don't know whether it was the chashu, the egg, or the soup as a whole but it didn't agree with me and I was up all night, sick and in pain, while my companion who had eaten everything I had that night, with the exception of the ramen, was fine if not a little hungry afterwards. So logical deduction would place the blame squarely on the ramen. I normally have a pretty strong stomach so this must have been something \"special\" to wreak such havoc on my system.

I know it's like a kiss of death to even suggest that a restaurant's food caused any kind of physical illness, but I have to call it like it is.

Service:
This review would have been a 1-star had it not been for the service. The best part of our meal was our server who was courteous, personable, informative and attentive.

Ambiance: \"Hey, let's pump loud electro music in a mostly empty restaurant because, Little Italy!\"

Price/value:
Way, way, WAY, overpriced for what you get. I've eaten at better places in the more affluent downtown core, and gotten better value and food. For 3 tiny dishes and ramen with two beers (which were on special for $5 per sleeve), parting with ~$80 is just not great value.

I'm not sure Ryoji understands what part of town they are located in. Perhaps in their research they see that Momofuku charges quite a lot (especially at Daisho and Shoto) and figured people are willing to open their wallets for tiny snacks and pretense. But this ain't the Shangri-La hotel, it's little Italy and a basic rule of running a successful restaurant in a mostly residential neighbourhood is to have local regulars. To do that you either need something truly unique in atmosphere and quality (i.e. La Carnita) or you need to give some great bang for the buck, as any of the numerous Italian joints can tell you. 

An empty restaurant is a death knell in this case, because its telling of something that the locals seem to know from word of mouth. Perhaps the high price per plate is their way of trying to pay for the extremely nice decor?"}
{"text":"I love Ryoji!

As soon as I noticed this restaurant on my college street commute in (aka restaurant scouting time) I knew I wanted to check it out!

I love allllll kinds of Japanese food, but I have a self imposed rule about waiting in line for ramen. That is, I won't do it. That's why I was extra pleased that I absolutely love the ramen at Ryoji, and I never have to wait! 

Ryoji is an absolutely beautiful restaurant. When I've been there for lunch, there has been classical music playing which just fits perfectly. For late night dinners, there is more of a lounge-y feel with top 40 music, and it works too! I love the wall of lamps and the drift wood art pieces. It's all so perfectly designed. 

Everything I've tried food-wise has been amazing - those soy eggs are cooked to perfection! The daily sashimi platter is fresh, and the cooked appetizers have been amazing too.

This is definitely a great spot for a date night or a lunch to impress your friends. While it is kind of pricey, you can definitely be full off of just a ramen, which is only $10-$12!

I will certainly be a regular!"}
{"text":"The atmosphere here is pretty cool, only stopped by for a quick appetizer and some drinks. Would definitely come back to try the ramen and Okinawa style food next time~ 

Warm sake is delicious.
Service is prompt and friendly. 

Very chill atmosphere which is great for large groups or individual seating near the bar. 

Love the decor.. tried the karage chicken and the mochi special. 

The fried chicken was tasty the mochi was just ok. Would have given it 5stars if they stuffed it with ice cream instead of red bean paste, but that's a personal preference. The Mochi was a good texture, but wouldn't pay $3 each for it next time.. 

Other than that, would definitely come back with a group to try the other items just because of the friendly service and cool atmosphere."}
{"text":"Grand opening...very busy as expected! Thank goodness we didnt hafta wait outside...waited by the small circular bar area...my frnds ordered a sake ceasar which they said was quite nice, they also have Asahi, Sapporo on tap along with a few other selection....

The kitchen was a mess...as expected...the food took a long time, orders were missed...we never got our Ramen $9-$12 after chasing it twice while all the tables around us sat got their ramen (maybe ours?) and left....they keep bringing us plates that wasnt ours, we shud've ate it anyway...

Nothing particularly worth mentioning, they did have a few yummy deep fried items, like Zuchini fritters $7 and deep fried salmon $8! They even had Tomaoto fritters $8, which we didnt try...

Their Ji Ma Mi $6, homemade peanut tofu mentioned in a food article I read was \"soldout\" so that was a disappointment...

Overall, good vibe, a bit classier feel than Guu, i just might come back to try their ramen if in the area again but most likely rather try somewhere else instead..."}
{"text":"Lots of ramen, soba and tofu choices on menu... And probably that's all they offer. Expect more choices for an izakaya. 

The ramen and soup base taste good, my Japanese friend told me it's very traditional. Nice to have an authentic taste of Japan. It's definitely better than kinton ramen. 

Service was average, after we arrived, I realized the waitress was one of the smoking crowd standing outside.  We ordered a sashimi to share, there was one left and they took it away.  Not attentive! 

With lack of food choice and not attentive service, it's a 3 star.  Ramen alone is not bad though."}
{"text":"My experience was unfortunately not great. My server forgot to give us water (after saying she'd be right back with it) and forgot to give us the bill when we asked. We ended up walking to the front to pay. 
The cooks also forgot to put the soft boiled egg in my ramen...which I feel is a key part of ramen? 
On top of that, service was slow and we were only a party of 2. 
I prefer other ramen places (maybe the egg situation tainted this one for me). 
I can say that the fried chicken (karage) was really good!"}
{"text":"First time I ducked my head into Ryoji, I was hoping to eat there with husband, toddler and infant for an early 5pm dinner. Unfortunately I realized that its victim to the College crowd and is more of the loud pumping music kinda place. We ate across the street at Sushi Bento. 

But the menu and the izakaya tapas kept calling to me so I arranged a girls night sans kids and husband. The ladies and I all liked most everything we ate that night. 

(Of note, I did notice a mom and toddler eating close to the door with highchair that night. Not judging at all-  but I wouldn't recommend this place for toddlers/babies. Although i know my kid would love the Ramen and tofu dishes, it's not that amazing I would sacrifice her ear drums.)

Back to girls night, felt like we ordered 75% of the menu, and we liked most everything we gobbled up. We didnt try the ramen- too hot weather and not conducive to sharing. Will need to return another time to try that. 

Our faves: peanut tofu, tuna carpaccio.
They could improve on: 
- Ryoji salad, throw in more beet slices, there were only a couple measly beet slices and these ladies like their beets. 
- Zuchinni fritter tempura. Very tasty. Bland tasteless sour cream dip on side? Not so yummy. We asked for more Yuzu pepper sauce that came with a fried chicken dish.  Now that sauce was very tasty- Wanted to bottle that up and put it in our purse. 

Would definitely return and try the other 25% of the menu."}
{"text":"Love the style and service. I tend to order the same thing every single time (spicy miso ramen) but I've sampled pretty much everything and no complaints. Just overall very good place to eat."}
{"text":"very nice setting, decor, and friendly and competent staff who knows what the place has to offer and can help you to choose the best items!

very good meals, although my ramen was only luke warm. marinated boiled eggs are the best. porks ribs are very good.

desserts are not fabulous and chocolate fondant especially.

would definitely go back"}
{"text":"A group of us came to Ryoji Ramen & Izakaya for Christmas Eve dinner since we didn't want to cook.  This restaurant is located at college street near Little Italy downtown Toronto.  There's meter parking right in front of the restaurant.  When you enter, the restaurant is huge. Very modern and clean.  We reserved a huge table in the middle of the Restaurant where there's this cool display in the centre of the table.  They specialize in ramen and tapas.  We all ordered a few pitcher of beer and also ordered 2 sets of multiple tapas on the menu.  We had the chicken Karaage.  I like the ones in most Ramen place better since this was was drizzled with sweet sauce it made the chicken a bit soggy.  We also ordered fried calamari legs. The portion was tiny and it was a bit dry.  We  had a bunch of sashimi dishes but I don't like raw food so I didn't try. The sizzling steak with butter on top was very good.  We had the pig ears. It was drenched in this peanut sauce, not bad. We had the deep fried shrimp it was nothing special I would prefer shrimp tempura.  For the ramen it comes in regular size and mini. Regular size is essentially 2 fistful of ramen noodles and mini has 1 fistful.  We ordered a bunch and shared it. We tried the tonkotsu ramen, spicy miso ramen, garlic oil ramen and shio ramen. For a place that specializes in Ramen it was ok. I've definitely had better. I felt that the food was over priced and not sure if I would come back here again.  The service was fine nothing to write about."}
{"text":"Came here for a late night dinner on a Saturday around 12:30am.

They have a late night menu that runs from 10:30pm to 2am which is fantastic because it serves tapas and ramen. I had the mini shio ramen ($7) which is whole egg noodles in a light chicken/pork broth with chashu, leeks, fish cake, nori, and green onions.
 
The chashu was okay but I really enjoyed the rest of the bowl! The broth is saltier than most places but it's still great! 

Definitely coming back!

Note: Also tried the mini Shoyu and I hate the broth. I took a sip and I couldn't bring myself to eat it."}
{"text":"Amazing... how disappointing this restaurant's food is these days. After launching with potential a few years back, the food has turned soggy (fried foods), heavily salted (cooked dishes) and sometimes even just luke warm (ramen). I guess this restaurant has given up? 

But... the most annoying thing about this among others, beer(Sapporo draft) was flat. Reminds me of syrup. Simple things matter. When simple things get missed, it means to me, the restaurant doesn't care. 

One star was for a coupon we could use. One star was for food that was edible."}
{"text":"It's gonna be a no for me. Plenty of other better izakaya restaurants in the city with excellent quality dishes. 

I bet it's hard being a ramen and a izakaya - probably better to specialize in one area. 

Sashimi - $18, 8 pieces. Hard to mess up, probably the best dish

Takoyaki - I think they dropped the batter in a deep fryer instead of the traditional molds so the batter was thick and uneven. Also where the Bonito flakes at??? Jinya has the best takoyaki in my opinion. 

Tonkotsu ramen - $9 for the mini. Nope the noodles were like vermicelli and the broth was not rich in flavour. Pass. 

Mojito - surprisingly came in a large beer mug. Tasted good but probably not a lot of alcohol in it. 

All in all wouldn't go out of my way to come here again."}
{"text":"Perfect! I am surprised this restaurant didn't get as high ratings as I thought. Ramen totally rocks! My favorite is the Okinawa So-Ki Soba. They also have authentic Japanese Sodas(which are really good!) They also have good Gyoza and Chicken Wings. Everyone was very nice and polite."}
{"text":"Amazing! Everything about this place is great. We ordered the ramen which was so yummy. Our waitress was so nice and pleasant. And the decor is very beautiful. I would recommend eating here and I hope I get a chance to go back."}
{"text":"As usual, I really want to visit Ryoji Ramen & Izakaya since it opens for business. But I can say the same with every single Ramen and Izakaya places that opens recently in Toronto....

Walking by on a Sunday late afternoon, I was surprised that it was opened for business, since they just extended their business hours! So I dragged my Yelp Friend in before he can said NO....

Love the set up of the restaurant. Half of the space is set up like a Izakaya/Ramen joint and the other half has this lounge like vibe. I just could not resist but just sank myself in one of those comfy armchairs... 

Ryoji offers some speciality dishes from Okinawa which is quite unique. Also Okinawan food is known to be healthy and is believed to be the reason for the longevity of the locals, of course we need to try some of those!

We shared as a pre dinner snack:

Ji-Ma-Mi Okinawa Style Homemade Peanut Tofu ($6)
- The taste is really light and subtle, texture is interesting... A little saltiness from the peanuts sauce
- The Okinawan style tofu is a rich source of isoflavones, which help in preventing lifestyle-related ailments
- I guess this is a healthy option!

Otoko-Aji Tonkostu Ramen ($11)
- Another Okinawa style dish: As it is believes that Pork soup contains significant amount of elastin and collagen....
- The aroma of pork was delighful...the broth quite balanced and we drank it all
- Noodle has good bite but I found the \"pork belly\" chashu a little too fatty for me... if it charred a little more, would be a little more enjoyable

Asahi Pint ($8)
- Draft Beer selection is decent as it has Blanche De Chambly and even Steam Whistle available

The service was attentive and polite. 

I definitely will be back again for a drink when I am in the area. And of course have some more healthy Okinawan food!"}
{"text":"The fried chicken is great here!  Staff is friendly!  Asahi on tap :D the Ramen is tasty I would say its better than most Ramen places.  I personally like it here over Kenzo and Sansotei if you like Ramen definitely give this place a try."}
{"text":"I am beginning to wonder if good decor works inversely to the overall value in Ramen houses. I was happy to see another place in the 'hood. I usually hike up to the student heavy Kenzo on  Bloor to get my fix but this place looked intriguing and upscale. Its sparkly with some big communal tables, 'Guu' style 'all hands'  greetings at the door and an authentic Okinawa pedigree. And thats kind of it. Apparently the some spur of the hometown family had a thing for Toronto and came here to open its first out of country satellite branch.  But the 'kinda off' quality that was revealed through my first dining there made me think that whatever nephew came to town might, y know, - be the one with a coke problem. The staff were flat out untrained, couldn't identify the ingredients in a couple of my dishes and didn't seem to think it might be their job to find out. The decor is nifty but overlit, the music over loud and the tables are crammed in too tight. I don't like ass in my Ramen as the neighbor slide in. Does anyone? The Ramen itself is pretty good but the Ryoji salad was just 'meh' and spicy tofu not spicy at all. Service was slow and drinks overpriced. Oh, Gods of Ramen, how you tease. \"...ramen served by hot italians?\" Its back to Kenzo for me. The staff there are authentic, barely make eye contact - but they know their stuff."}
{"text":"We were killing some time before a concert at the nearby Mod Club and wanted to drop in somewhere for a quick bite when Ryoji Ramen & Izakaya appeared before us. The place had been on my radar for quite some time so the whole thing was rather fortuitous. 

Obviously I wanted to try their ramen, but we decided to start with one of their specials:

Okinawa Poutine (\"cheddar cheese, tomato, chili aioli, and taco beef\"): Honestly, this was terrible. It's basically frozen-from-the-bag fries topped with a lazy assortment of generic toppings and a very puny helping of partially-melted cheese. The Fries Supreme at Taco Bell are more satisfying and the folks at Ryoji should be ashamed of themselves for serving something of this caliber.

After that debacle, I was very skeptical about my main:

Spicy Miso (\"Our \"Tonkotsu\" ramen noodles and soup served with spicy miso, ground pork, chashu, bean sprouts, scallions, and kikurage mushrooms\"): Though it'll never be mistaken for the best ramen in the city, this certainly hit the spot. The broth is very rich and flavorful, while the various components all work quite well. There's not much heat here, though, and on the whole the dish lacks a knock-you-out-of-your-socks kind of moment.

Then again, it's the best thing ever compared to that pathetic Okinawa Poutine."}
{"text":"Honestly...my friends and I were skeptical as to the professionalism of such a \"well lit\", and populated establishment.
 Much to our surprise, we were greeted  and treated with stellar service by the restaurant manger David. He went out of his way to learn names and even seat us personally! 
It's definitely hard to come by such service these days and I feel that it needs to be commended and is worthy of a review. I can't stress enough the great time that we had here!!!! -thank you David and crew!"}
{"text":"This is one of my favourite Japanese izakayas so far. They serve Okinawan (tropical island in southern Japan) food, which attracted me to this restaurant in the first place.

Interior design is a bit fancy, yet the atmosphere is approachable. I like that they have different types of seating including counters, wooden tables & stools, group sofa seats, and small couches, which would suit various occasions. Unlike other Toronto izakayas, you won't hear the staff shouting welcome, thank you, etc.--what a relief, you can actually enjoy talking to your companions!

Throughout my couple visits here, I've tried variety of tapas. Their tapas are actually not all Okinawan and include regular Japanese izakaya dishes, so if you want to try Okinawan food, check the \"Okinawa\" section in the menu. On top of my head, I really enjoyed Rafute, Tontoro, Unagi (eel) roll sushi, and Ebi mayo. Goya Champuru, the very famous Okinawan dish is also worth trying if you like bitter melons. Great thing about Ryoji is that their dishes have creativity; I wouldn't call them fusion cuisine, but they are not strictly sticking to traditional style either. Also, they serve Canadian craft beers--yay for those who are tired of having Sapporo/Asahi all the time at izakayas."}
{"text":"We came here at 12:30 AM for late night dinner after a night in the city. This place is very beautiful and we're so glad that it's open late! Parking was a pain, but worth the delicious food! I made the mistake of ordering a small, when I should have just ordered the large. My husband got the large tonkatsu and ordered refill noodles for $1.50! Can't beat that!"}
{"text":"Wretched food and service. Took 20+ minutes for our server to even come over once we were seated, and another 10 to bring us our drinks. Aside from my beer, every item we ordered was awful. The edamame was overcooked, the deep fried tofu was rubbery and flavourless, and the mackerel sashimi was comically tiny and did not taste fresh at all. Worst of all was the sashimi garden salad, which was a few bad pieces of sashimi on bed of greens, absolutely coated in \"toasted sesame powder\" (which looked and tasted exactly like Parmesan cheese). Ugh. Inedible. This meal was a disaster from start to finish and way overpriced to boot. Bad service, bad food, bad music, bad scene all around."}
{"text":"We were warned they were short-staffed and the kitchen was rather slow. I suppose we should have taken the warning a lot more seriously and left.

Unfortunately, we decided to stay and it did not go well. 

For some \"unexplainable reason\" (according to our server) a part of our order was misplaced and one of us didn't get served the main dish until the other had finished eating.

To be fair, they offered a free dessert to compensate for the mishap. However, it was the WORST creme brulee EVER! Practically tasteless!!  Oh, also, my drink, which usually is served with a tea pot and a glass of plum wine, arrived in a mug and had almost no taste like very weak tea.

We understood they were short-staffed, but we had hoped it didn't mean the quality of food and/or service would be compromised.

We've been to this place several times before and liked it, so we were particularly disappointed by how this dinner turned out. We sincerely hope this won't be the standard at Ryoji.

   [NOTE: Added an extra star for our past dining experience, but this visit was only 2-star.]"}
{"text":"Looking for a reasonably priced place to linger over a late lunch? Ryoji iz your place. 

Massive horseshoe bar on the right, cozy leather armchair tables on the left. Sushi bar-style table down the middle of the bar side. Big patio. No matter what type of seating your heart desires and your butt enjoys, they've got you covered. 

The price point is the clincher for me. Ramen is ramen and it shouldn't be expensive. Ryoji respects this simple truth. Their pork ramen is my favourite (add some rooster sauce!), and their fried chicken sandwich (I forget the proper name) is also quite tasty. 

I'll be back for dinner and drinks. College St is going to get all wild, Ramania style, one night soon. I can just feel it."}
