{"text":"Best sushi place and great ambiance. Their sushi chef is amazing and i love the creativity in his cuisine and furthermore the food is super fresh! The staff is wonderful and very attentive to the clients needs. Personally this is my favorite sushi place in Montreal. the food and decor makes Ryu a fun place to go to. Keep up the good work and phenomenal food Team Ryu!!"}
{"text":"Excellent food but horrible service. The first dishes were brought out after about 15 minutes of ordering, but the second round of dishes were brought out one hour after that. We were still hungry but did not order more as we did not want to wait for another hour. No apologies or explanation was provided for the delay.   The wait staff did not seem trained as they removed the plates before we were done without asking us if we were done.   Would not come back and would not recommend, even though the food was good."}
{"text":"Ryu offers a fresh interior decor that can be sexy for setting the mood for a stimulating sushi date vs Maiko (which is in need of some decor upgrades). I cannot resist the impulse to compare the two. The overall sushi menu at Maiko is better in many ways and I'm not sure, but Maiko may offer better value for your dollar on certain dishes (and depending how you order). But that depends how you define value. Yes, the food is better at Maiko, but the food and atmosphere of RYU is a lot more current and happening. I recommend to call in advance to find out what's going on. RYU puts on alot of parties, so depending on if you're in party mode or if you're looking for a more \"quiet\" night, you may want to double check with them, because the atmoshpere is completely different, depending on what they have scheduled. I like that there is a clean, new lounge in the Pleateu. Sometimes it gets tiring going to such rustic, candle-lit, hipster joints all the time. I need my dose of swanky, vegasy, miamish vibes. Or what I like to call \"M-T-L Chic\" joints. Which is another way of saying \"it's nice to see some MTL business owners that actual invest in atmosphere and not just put their grandma's couch set by the bar and call it hipster\". Another thing about Ryu is that it can be fairly dead with not enough customers to create an ambiance at times, but this has probably changed, since I last went, because it's a new spot and it takes time to catch on. Menu -wise: A big turn-off is the heavy use of crab-stick, instead of real crab for the pricepoint of the dishes."}
{"text":"I had dinner at Ryu a couple of times and every time it has been an amazing experience. The service is excellent, the sushis and the tartares are really good and always taste very fresh. Nice ambiance too!"}
{"text":"Resto branché dans Outremont. Très haut de gamme. Normalement, c'est hors de notre portée, mais un ami avait des coupons de style Groupon et nous a invités.   On a pris deux tartares de poisson, des edamames et 7 plateaux de sushis pour partager à quatre et c'était plus que suffisant! Tous les plats étaient excellents! Les sushis étaient vraiment bons et hors de l'ordinaire. Ils n'utilisaient pas des noris pour enrouler, mais des feuilles de soya colorées ou des feuilles de riz. Il y avait aussi des sauces spéciales pour assaisonner nos sushis. Le seul hic est qu'il a fallu attendre assez longtemps pour avoir nos plats ce qui fait que notre repas, commencé un peu avant 19h30, a duré jusque vers 21h30.  L'ambiance était très branchée. Le bruit était par contre très fort et on s'entendait à peine parler. Le service était très courtois."}
{"text":"Super chic restaurant, but don't expect to have authentic sushi.  Top grade fish, but the rice lacked vinegar.  I asked the chef/owner about the rice. His response was that they cater to the locals, who like their food sweet.  Truly an aha moment for me!! I'm still on a look out for the perfect sushi rice in Montreal..."}
{"text":"Worth the sushis experience! Considering that I'm very picky for sushis, I'd definitely recommend this place.  First of all, ambiance and architecture / interior design are the main highlights. Lighting was warm and dimmed. Comfy seats and tables. This is certainly a sexy and charming spot where you could spend a long evening chatting and sipping a small glass of sake.   I would recommend the spicy tuna on crispy rice as a first tapas, followed by some makis : Lotus, Mr Miyagi and Tsunami. Sushis were not too big and not too filled up with rice. Fish was fresh and delectable. Creative ginger-base dressing also came along with the makis. Black cod served with shiitake mushrooms was also delicious.   RYU offers a wide wine (red / white) and sake (375ml / 750ml) list.   Service was fast and good enough on a wednesday evening, it was during weekdays and the restaurant was almost empty.  RYU, you impressed me."}
{"text":"Good, but a little disappointing. The ambience and decor are nice. Prices are reasonable. The food is okay, but a little disappointing.  For 4 people, we ordered Miso soups, a Rainbow roll, a Spicy Salmon roll, a Captain Crunch roll, and a General Karrage roll. The Captain Crunch was disappointing because they put a lot of rice in the Captain crunch roll and few breadcrumbs. We thought that the General Karrage would have fried chicken but the chicken was not fried. Too bad."}
{"text":"interesting concept like the fusion flavours but again being asian i am hard to impress verg crewtive cuisine though and great atmostphere good for dates"}
{"text":"We came here for our 5th anniversary on. A Friday night (8pm) the place was about 1/6 full. No jokes! Took a look at the menu and it seemed interesting but then looked at their sushi menu and notice that it was very limited. A whole lot of tuna or salmon tartar type of makis and not much choices in the sushi/sashimi either. I took pictures of the menu. Check it out for yourself.  We got:  Miso soup with seafood. Wasn't hot enough. Now... I know that you're not supposed to boil a miso broth. But this soup was barely warm. Good but almost cold.  Spicy tuna on crispy rice. Generous portions and very satisfying!   Baby octopus with onion rings. The octopus was chewy and the onion rings, although very light and crunchy, was way too salty.  Steamed bun with fried chicken. Nice fusion between asian and southern food.  A nice try.  Halibut maki. The lemon juice they sprinkled on top killed the delicate flavour of the fish. Good but nothing special...   Club Ryu. The waiter said it was a play on a club sandwich but it came out like a spring roll sushi style. We only tasted the fake crab taste and they literally forgot the tobiko. For 17$ i was expecting much more then that...  Our bill totalled to about 200$ with wine. To be honest, i would of gladly added an extra 40$ to go three blocks down (JunI)  The service was what made it to me. Attentive, professional. They answered all our questions with smiles! Loved it!!!  I will not be returning and i can't say that i would recommend this place. Sorry!"}
