{"text":"J'allais au vua pour mon lunch quand j'ai remarqué ce resto que je ne connaissais pas. Wow, beau décor, excellent service,des prix raisonnables et de bonnes portions. J'ai pris 3 petites portions pour goûter le plus de choses possible. J'ai vraiment adoré et si c'est aussi bon quand je mange sur place je change la note pour 5 étoiles."}
{"text":"Excellent restaurant de Sushi situé sur Saint-Denis près de Maisonneuve. Le décor y est très Japonnais, de même que les vêtements du personnel. Les sushi sont de bonne qualité, préparé devant vous et les prix sont on ne peux plus raisonnable.

De plus, si vous attendez une commande pour emporter et que l'attente est longue, ils se pourrait qu'on vous offre des échantillons du menu."}
{"text":"This restaurant has Chinese, Japanese and Korean cuisine. The service was very quick and the inside of the restaurant was nice and clean.

The food was very good and only a bit more expensive (a few dollars) than what I usually pay for."}
{"text":"Amazing Asian restaurant! The prices are affordable and the cuisine is on point! Will come back!"}
{"text":"J'hésitais devant le menu dehors et un homme est sorti (l'hiver, faut le faire!) pour me convaincre, en mentionnant que les pizzas-sushis étaient du \"instagram material\" et que les sushis peuvent être servis sur un bateau \"et c'est pas plus cher\". Ça m'a fait rire et je suis entrée.

Je n'ai pas regretté! Sushis très frais et savoureux! Un peu trop de wasabi sur les nigiris à mon goût, mais c'était vraiment bon tout de même! J'ai aimé la soupe miso, même s'il n'y avait pas de tofu dedans. D'autres clients et moi avons eu droit à un sushi frit en dégustation. Vraiment abordable et super service! En espérant qu'il ne ferme pas de sitôt!"}
{"text":"This place reminds me of the food that you would get in a shopping mall food court. The food here isn't good. It's not discussing, just bad. I wanted to try something new for lunch and while walking on St Denis, I came across their menu outside. A bento meal seemed like a good idea. A little bit of everything. I was so disappointed. The salmon was dry and over cooked, the rice was mushy and the avocado pieces in the rolls weren't fresh... Granted it wasn't expensive but I've eaten better at a better fare. Service is nice though but I won't be returning here."}
