{"text":"I went to Sababa Grill for the first time yesterday evening. My friend and I picked this place at random so we had no expectations beforehand. Raining as it was, we sat indoors, at the back of the restaurant where a lovely bench with beautiful and colourful cushions were at our disposal. I immediately felt relaxed. The décor amplified the feeling of comfort as though we were provided special protection from the rain.  We ordered our meals with a half a litter of house red wine. Velvety and smooth, we easily went through the bottle. I ordered the merguez plate served with rice and house salad. The merguez was juicy and tasty. The spices brought comfort to my soul as would a hot meal served on a winter's day.  We stayed for a while after finishing our meal, sipping the remainder of the wine, contemplating the scrumptiousness of what we had just ingested, as we carried on with our conversation. A great spot for a casual meal with a date, friend, lover, or on one's own. The welcoming and charming atmosphere will take away the woes and worries of the day. An inexpensive treat for those who want to lay back and indulge in delightfulness."}
{"text":"Falafel pita is the best thing I've ever put in my mouth. Mint tea is also amazing!"}
{"text":"I will honestly say that they make the best Falafel sandwich I ever ate!  You can really taste the fresh mint, fresh coriander and sesame sauce, plus, they grill it!  Take it out and enjoy it in Parc Mt. Royal, it's well worth the wait. Delicious!"}
{"text":"Sympa."}
{"text":"This place has lost it's charm since the original owner sold it. food is not the same anymore neither the service or the the famous tea. what a huge loss to montreal :("}
{"text":"I have never eaten a bad meal here.  Consistently good and always delicious.  No alcohol permit :( but great moroccan mint tea!"}
{"text":"de-fricken-licious.  just went there tonight for the first time. the prices are really good, and i can't stress enough how flavorful and fresh everything was. yum yum yum."}
{"text":"Je suis rentrer au hasard dans ce petit resto, rien d'impressionnant a l'extérieur. Mais le menu attention cela change !  Des burgers très original, exemple le mien avais du peanut butter dedans, sympathique !  Service: rapide. Le prix :10 12 dollars en trio avec une sacré assiette de frite très bonne !  Bref une bonne surprise je dirai, je traverserai pas la ville pour y allez mais je sais ou allez manger la prochaine fois que je suis proche !"}
{"text":"I had the Rumi Double Double Burger and my husband had the Shish Taouk  Pita Wrap. I have to say hands down best burger I have ever had in Canada. It was amazing! Do try. My husbands pita wrap was also very flavourful. We both enjoyed our trip to this restaurant. We also had the fries, which were decent but the sandwiches were yummy! The chefs plus guy working behind the counter all were very helpful."}
{"text":"Last Thursday, a friend and I wanted to go see some Fringe festival plays. We decided to each make a list of the top 3 plays we wanted to see and debate the whole thing over dinner at Rumi Express which neither of us had been to. Totally worth it, dudes.  I got there early and was famished, so I ordered some hummus and a basil lemonade while I waited. The hummus was creamy and just right - not too much tahini, nicely oily and sprinkled with paprika, accompanied with a whole (uncut) pita which is good cause it's fun to tear chunks.   But yeah, the lemonade was the clincher - clear and refreshing and the basil totally works. When Catherine showed up, she had a sip and said: \"Ca vaut le détour!\" - so yeah, at the very least, the lemonade's worth the trip.  For my main dish. I felt nostalgic so I ordered a foul platter. Foul is a traditional middle-eastern breakfast that my grandma makes. And while this one certainly doesn't hold up to grandmaman's, it was still very decent - with well-seasoned fava beans in a light, lemony, cumin sauce with accompaniements of pickle slices, mint leaves (mine were kinda wilted unfortunately) and a chunk of mushy flat bread.   It was a generous, totally gratifying helping but yeah, the lemonade was definitely the clincher!"}
{"text":"I have shivery midnight dreams about the salmon wrap (perfectly spiced and cooked to delicate perfection) hummus (nutty and deep and warm) and cheese bread (crispy and melty) here.   Legit one of the best meals of my life. Such a relaxed, chilled out little cafe to while the hours away."}
{"text":"The food was good and well presented and the service friendly. The negative note would be on the drinks. They were out of all the 'original' lemonade on their menu and we had to settle for water."}
{"text":"Rumi c'est plus qu'un resto oriental, c'est une ambiance, des odeurs, des couleurs et des gens vraiment sympas. Au menu, des grillades, du humus, du baba ganoush, du dal, des nans, des tajines et encore toute une foule de plats tirés directement des grands classiques de là-bas. Tous très bons, tous cuisinés avec amour. Niveau dessert, j'ai un petit faible pour leur gâteau au chocolat et à la cardamone, mais les autres ont tous l'air aussi savoureux... Bref, un endroit où on se sent bien et où on mange bien... A tester absolument!"}
{"text":"Very glad to have stumbled upon this little place! I had the prix fixe menu which was, in my opinion a great deal at twenty bucks, with an extra five for a glass of wine. Highlights were the good service, incredible dal, and delightful mint tea at the end of the meal. Rice and chicken shish taouk were both a bit dry, so one star off for that. But all in all a good experience. I'm all about bang for buck and this is definitely it. Even though I wasn't head over heels for my meal, I think I would go back with friends to share a few things around. Definitely give it a try!"}
{"text":"I've never been to the more upscale location on Hutchinson, but this place was fantastic. I personally tried both the safran plate and sandwich, both were excellent but I favoured the sandwich...the sauces were amazing.  Never will I look at Basha the same way knowing this place exist!"}
{"text":"I'd like to give this place 3.5 stars  We tried a whole host of things here: Babaganoush, Falafel, Pita Shish Taouk,  Fattouche Repas  We enjoyed everything.    Would have been nice if the service had been a little quicker, but we can't have everything. :)  Since I can't give a half a star I am rounding up."}
{"text":"L'assiette de falafels était à la hauteur de mes attentes. Le personnel est sympa. L'ambiance y est vraiment agréable. J'y retournerai assurément. Accès Wifi apprécié."}
{"text":"Le cadre est sympa,  les sandwich sont bons mais pas renversant. Ils manquent de peps et de caractère à mon goût. Par contre c'est les meilleurs falafals que j'ai goûté à montreal!"}
{"text":"I will preface my review by noting it took a whopping 1h50m to get food delivered from here. I think there were some issues as they forgot the meal of a person who ordered with us and also forgot a drink. Maybe it was an off night? Honestly I've had slow delivery but this sounds unbelievable to even say!   I would definitely suggest to go eat at the restaurant versus delivery though alas for me it's too late.    The daal soup is good and was the best of what I had. The kefta pita wrap is tasty but I would suggest  sharing it as it is a lot of kefta. Unfortunately, the tabooleh and fattouche both had way too much lemon, which overpowered the rest.    All in all, daal soup was great, the rest ok, and delivery was out of this world (not in a good way)."}
{"text":"Depuis deux ans, il nous arrive régulièrement de débarquer chez l'ancien Rumi pour les légumes grillés servi en portions généreuses avec certains plats ou pour la soupe dhal. Les mezze sont délicieux, il n'y a pas à redire. Toutefois, depuis le changement de direction, il y a un an, quelques chose, un je ne sais quoi dans les saveurs, est parti avec les anciens proprios. Les frites, auparavant savoureuses, sont maintenant presque brûlées, les hamburgers sont moins appétissants. Il y a du laisser-aller dans la cuisine du Sababa. Heureusement que l'efficacité du fidèle serveur-gérant-hôte \"name it\" nous fait oublier ces petits ratés. Cet homme est d'un professionnalisme!... On continue d'y aller. L'addition est honnête et les portions sont généreuses, malgré tout."}
{"text":"I had always wanted to eat here, so when I happened to be on Boul. St-Laurent today and hungry, I didn't hesitate. Alas, it was probably not my day. I ordered the shish taouk and when it arrived, I was delighted to see a nicely arranged plate of char grilled chicken, rice and coleslaw, but was quickly dismayed to to realize that the chicken was way too charred to my liking. I could not taste the spices, although I was sure that had it not been so overcooked, it would have tasted fantastic. I asked the waitress if it was normal for the chicken to be like that and she said that it was, explaining that it was char grilled. I left it at that. When it came to pay time, she asked me if everything was okay, so I told her that I didn't like my chicken for the above reason. She told me that she would pass on the comment to the kitchen and gave me a 10% discount on my bill, so that was a nice gesture on her part. I think I'd give them a second chance, given that I really like the casual, cosy set-up of the place and that most of the reviews here are glowingly positive, though I probably won't order the chicken again."}
{"text":"Hands Down best Middle Eastern restaurant in Quebec!!!!!! The food is always fresh and the service makes you always want to come back. Great establishment :)"}
