{"text":"The best falafel I've ever had, no doubt.  I'm usually just go to the take-out section inside the store but I've been in the restaurant a few times and the service has been a bit slow and the menu doesn't have the basic falafel sandwich which is usually what I want."}
{"text":"Great falafel.  The original falafel and shias kebab in Toronto before the owners of the other restaurant were in diapers.  The best Tehina in Toronto and salads.  Shwarma is not my favorite."}
{"text":"excellent! I went to the grocery side many times during summer vacation. I like humus,chicken kebabs,salads.  They are friendly. I want to go again !"}
{"text":"The Toronto Lover system: 5 stars = Must visit! 4 stars = Really good. I take my friends here. 3 stars = Somewhat worth it... if you have nowhere better to go. 2 stars = Below average. Attend only when necessary. 1 star = Do not visit!   I can't say very much about the restaurant, except that I've heard mixed reviews from people who attended the sit-down area of Sababa. However, this review is about the takeout counter. It is one of the freshest, most consistent, tastiest, heartiest takeout counters in the city. Have the lentil soup. Have a falafel or a shwarma. Thank me later. Did I mention the lentil soup?  4 stars"}
{"text":"Best falafel I've had anywhere.  (Israel included). I still use sababa's as a baseline for falafel and tzatziki anywhere I go.  They make fresh pita every day - amazing by itself.  They have a selection of dips and sandwiches and a great selection of middle eastern foods in general."}
{"text":"I've been to Sababa probably about 10-15 times in the past 10 years. They offer tasty mediterranean food at a reasonable price. I love getting the Beef Kabob's medium rare with fries or rice. Service is good.   When you're done eating, you can walk over to the grocery store section and pick up some things not easily found around Toronto. Overall a very good choice for a night out."}
{"text":"I called in for a take out order stating my pickup time. I was punctual. The food was ready to go.  I presented to my family dry, tasteless lamb dinners. Cardboard chicken dinners with tasteless fries and accompanying soggy salads .  Dreadful food. Possibly left over from a dine in order.  Sababa will be crossed off my dining list immediately."}
{"text":"I've only sat in the restaurant once (nothing too special) BUT I LOVEEEE the takeout counter next door. Best value! Delicious!!!! Well worth the line up when its busy. This used to be my go-to lunch place for work (until my work relocated).  If you're planning to pick up some lunch during weekdays, call in ahead so you can avoid lining up!  My favourite is the lamb pita sandwich :)"}
{"text":"Came here after reading the BlogTO article. Restaurant is located in a corner of a Plaza, difficult to spot from the street. Service was really slow even though the restaurant was empty.   The dips were ok. Falafel and Shawarma were alright. The pita was warmed up not baked fresh. Lighting wasn't great either. The slow service is what really got to me."}
{"text":"To celebrate 25 years serving our community, Sababa made some incredible renovations to their restaurant.  Come see for yourself."}
{"text":"Last week was my first experience of Sababa Falafel. The falafel itself was so tasty but the sandwich was full of mayo. I liked but it was too much. My friend tried burger and he said what i just mentioned. The staff were friendly. The place is not a restaurant it's just a take out place. Totally Sababa is not my fav midleeastern redtaurant."}
{"text":"Ordered a chicken shawarma today, actually my first time ordering it here. i stopped after attempting to eat a third of it.    the meat was over seasoned for my taste, the preparer was also too liberal with the sauces (the order comes assembled from the kitchen) , noticed some new signs posted, cost 50 cents for any substitutions and prices have gone up since I last visited a couple months ago.   I'll stick to the falafels and hamburgers for now..."}
{"text":"We have been to Sababa (groceries side!) on several occasions now and almost always (but one time) to get their delicious falafel in a pita: tried falafel for the 1st time in J's life; dunno what to eat when we're around Yonge/Steeles area (many times); brought cousins to try their falafel; to counter the bad experience we had after having shawarma from another nearby place.   All times, we enjoyed the fresh and warm falafel with their spicy sauce! The falafel was so moist, and the pita was so fresh! Definitely give Sababa's falafel a try when you're in the neighbourhood!"}
{"text":"The food was very good we enjoyed our stay and some of the best Lentil Soup  I have ever had.. nice .."}
{"text":"The lamb kebab dinner was absolutely amazing. The lamb meat was so so incredibly soft and well seasoned. I ordered a side of hummus as well to go with it and it was the bomb! The only downside was that the take-out service was kind of really slow, but the food made up for that! Will be frequenting this place a lot more now that I've discovered this gem :-)."}
{"text":"Went here for lunch at around 11:30am on a Saturday, the place was empty and by the time we left, there was only one other table and a gentleman ordering a take out sandwich...  The first impression of the restaurant was that it is very dark. I've read review that they had renovated the restaurant but I'm pretty sure they kept the tables, chairs, upholstery on the benches and the carpet. For this reason, the restaurant has absorbed the smells of the food which didn't lend to a pleasant dining ambiance. There was four of us and we ordered the combo (dips, falafel, meat on rice) with an extra skewer and side dish of fried eggplant, which I would definitely order again. The dips were very good and yes the bread they make was very authentic and fresh. The falafel was also very good, and by the time the meat and the rice came, we were already full. The chicken, lamb and kofta kabob were good, but the beef skewer was tough/chewey and had a weird/strange taste to it. The rice was just ok, tastes like what you would get at a Jimmy the Greek. Overall, good value for the food and I think what they are good at (bread, falafel), is very good, but everything else is just so-so.. I would also just suggest the restaurant reupholster during their next renovation and/or get a deep clean of the restaurant as my clothes and winter jacket ended up smelling like the place."}
{"text":"This is my favourite place to go when I wanna eat authentic Middle Eastern food, the prices are reasonable, they should open another location close to downtown, also I like to buy from the grocery the Baklavas and turkish coffee. there are many options."}
{"text":"I always get the chicken souvlaki dinner :P   I used to frequent this place quite...frequently(?) during the summer of 2012, as my boyfriend used to live nearby. I can't really say much about the food as I always get the two piece chicken souvlaki dinner, but its always delicious, especially with $0.75 worth of tzatziki and a thing of hotsauce.  Fries are good and probably come from real potatoes, the salad is too lemony/soggy for the most part, and usually the pita is stale or missing altogether, but for some reason I keep coming back.  The chicken souvlaki is really good though."}
{"text":"The best middle eastern food in all of the GTA. This place is a restaurant, take-away counter and middle eastern grocer. They make their pita fresh daily in a wood oven and you can buy it packaged + still warm.  Sababa's babaganouj is the best i've every had + they make hard to find salads and dips like labeneh & turkish salad.   I have grown up eating at Sababa and have yet to find anywhere else that even comes close to the quality, variety and authenticity offered here."}
{"text":"Was never a fan of the restaurant as I came a few times,  better go to Me Va Me, better flavors.   But wanted to have a shwarma in pita, you only give meat and a salad while each topings is an extra 50 cents is a bit ridiculous.  You get 2 stars for the meat nothing else. By the way, very oily as well."}
{"text":"Sababa is in my backyard and I have been coming here for years, I never really go into the restaurant I always go to the counter and the back of the grocery store.   They are famous for their falafel which is a great tasty, quick and cheap lunch item. I also get their lentil soup on cold days cause its delicious. They bake all of their pita fresh in-store and have an amazing selection of dips such as hummus, baba ganoush etc. They allow you to sample them before you buy and their service is pretty quick. Their Moroccan cigars are pricey but really crispy and fresh.  You order at the back and they will put the $ amount on the bag, you can then shop around a little more and pay at the front.   I would recommend getting their hot sauce on the side with the falafel for extra flavour!"}
{"text":"Came here once with a bunch of friends after they had the sababa burger before.  Price is very reasonable and a burger will fill you right up for ~$5-6 dollars.  Burger was amazing!! Super flavourful, I shared one with my bf and immediately regretted it.   Will def be back for more. Their hummus also looked super yummy too so hoping to try that next time."}
{"text":"Sababa is a well established and highly well known middle eastern restaurant in Richmond Hill.  Opened for 35 years and yet I akways see steady business in the restaurant as well as the grocery store attached with with the take out location.  If you know what to order, I would say it may be wise to call in and pre order before the pick up as they do take some time especially when busy.   This is pertaining to their take out location.  I normally enjoy their Sababa Burger, which is a nice meat patty with ground lamb meat along with their signature salad mix of ice berg lettuce, tomatoes, cucumber some onion and fresh minced curly parsley.  Mixed with lemon juice and olive oil it seems.   The burger is served in a white small round warmed pita stuffed with the salad mix and their tzatziki sauce.  Pretty bomb.    Likewise their other selections included chicken shawarma or falafel sandwich.. all prepared in the exact same manner with stuffed with salad and the tzatziki sauce.  All are fantastic.    The price is right for some economical healthier eats.    Skip the side order of their crispy french fries if you want to save on the calories... even though they're also tasty and crispy.    I'm sure the restaurant is delicious as well and I've yet to try!  If you haven't been to Sababa I'd totally recommend giving it a try... for some long-time goodness that won't break your wallet."}
{"text":"Went to Sababa for a lunch date on New Years Eve day.  There was no love connection with the date - or the food.  My date assured me that what Sababa lacked in ambiance, that it made up for in tasty food.    Sure, Sababa makes their own pitas (they were meh), but to me - this place is not unique, and is not a good example of the complexities that middle eastern food offers.  In fact, I am going to say that I found it quite disappointing.  The beautiful smells of Pomegranate (http://www.yelp.ca/biz/pomegranate-restaurant-toronto-2#hrid:Ce1hRRyXhGRWruzB-AOrYQ) were not there.  The complexities in flavour were not there.  I had a kebab, and found it to be - meh.  The serving size was not very large, and the entree seemed like it was missing something.  It was overwhelmed by rice (that wasn't even warm).  I'll stick with Pomegranate and Sheherzade (http://www.yelp.ca/biz/sheherzade-persian-grill-and-dizi-toronto) downtown."}
{"text":"Both the take out counter and dine in restaurant serve great food.   Their falafel sandwiches at the take out counter are tasty fresh and topped the way you way you request them.   The restaurant offers wonderful kabob platters with rice. Their apps are fantastic too. In particular the lentil soup, fried tomatoes, baba ganoush, are my favourites. As others have mentioned the pita is soft and fresh. You can also purchase the pita in the adjacent supermarket. We often buys several oaks and freeze a few to have them on hand.   Great place for authentic middle eastern food."}
{"text":"Had the dip sampler platter with red pepper dip, eggplant dip and hummus. All Dips and extremely fresh. The pita bread is made fresh on site and so fluffy and soft. The chicken skewer was very flavorful, but a bit dry. The portions are generous. The ground meat kabob was very flavorful and moist. I would definitely come back. The take out at their grocery store beside the restaurant is amazing as well. The decor is a bit outdated and old school. But the food is on point."}
{"text":"This is the place to go if you want to get  textbook-perfect falafel.  Crunchy crust and moist and flavourful inner pocket.  During the summer I came here each week salivating over the warm and fluffy pita which accompanies the falafel.  Their salads are also very fresh and flavourful with fresh herbs and spices my favourites are the Sababa and Tabouleh salads.  I usually get the combo and for $40 (not including tax and tips) you can have a full meal of falafel, salads and lamd with rice.  I am getting hungry for the smoky lamb chunks while I am writing this review.  But the best thing here that is consistently fresh is the seabass.  I try to always come here to see if I will get failed by my experience but time and time again, I get consistently great food.  The service is prompt and attentive but as long as they get my order right I have no more expectations because the food is lovely."}
{"text":"My manager bought us the dinner combo for lunch lol, which includes chicken kebabs, rice and salad.  I will definitely recommend the salad!!! the dressing is so good. 5 stars for the salad. The chicken is a little bit dry. Maybe I will try lamb next time."}
{"text":"I tried Sababa for dinner tonight as I was in the area and a friend had previously mentioned it.    Reading one of the previous reviews, I ordered the Siniyeh tahini... I have to say, I was pretty disappointed.  The \"famous mediterranian salad\" that it comes with is just a regular garden salad with some parsley mixed in, and the only side option is saffron rice or fries.  The Siniyeh itself was alright, but the beef patty seemed overcooked, but the creamy and overly heavy tahini sauce made up for that.  I will say the tahini tasted alright, but definitely not recommended for the health conscious.  The saving grace for the meal was the pita bread, which did seem fresh and when eaten with the Siniyeh, it was alright.  Overall, Sababa restaurant is nothing to write home about, and with so many middle eastern and Korean options in the area, I pass on Sababa in favor of trying something else next time I'm in the area."}
{"text":"I can't wait to go back!   I definitely love the romantic vibe inside the restaurant. The lighting makes the restaurant inviting.   As for food, I definitely would love to eat their hummus again!!! Yummm! It was so creamy and flavorful. Just how I like it. I also loved their lamb burger that they serve during lunch.   I would have to give service a 5 Star! The waitress who helped me gave really good suggestions. I'm grateful for her. She's a 5!"}
{"text":"The restaurant is pretty expensive but the take out counter at their mini grocery store is amazing! This is my to go place for Falafel pitas! For under $5, you get a delicious pita filled with fresh f alafels and veggies! The f alafels are deep fried and are very crunchy, not oily at all. For the sauce, it's up to your liking and can ask them if you want more hot sauce to add spice to your pita.   I've also had their chicken Shawarma here and I must say it's very delicious. I love their pita here, and they can be purchased at a good price from their grocery store.   Overall, they have great sandwiches at reasonable prices and service is quick and simple. Good for to go!"}
{"text":"I've been here twice. First time we shared a chicken shawarma and a falafel sandwich. The second time I went by myself and just had a falafel. The paper bag says something like \"Best falafel in Toronto\". I think so too but personally, I think there's too much sauce. I like my sandwiches a little dry. But that's just me. I'm a fan of milder tastes. The chicken shawarma sandwich was definitely not that good. The chicken lacked taste.   The one undeniable fact about this place is that they have THE BEST PITA BREAD I've ever had. Seriously, they should change the text on the bag to \"Best pita bread\" instead!   The takeout section is in the grocery store. I like it enough to come here again. The falafel price is very reasonable at $3.50. If I feel adventurous, I'd maybe give their kebob dinners a try. Or maybe I'll just stick with a falafel. For $3.50, it's almost enough to fill me up."}
{"text":"I come to Sababa often, because of their grocery section, there you can also order stuff to go. It's been many years since I had a meal in the dining area. To-go stuff is quick and easy, also a nice variety of Israeli products and snacks."}
{"text":"The restaurant is big. I love the decoration here. Lots of tables and booths with lots of mirrors on the walls to give the illusion that the restaurant is even bigger than what it really is. We ordered the $40 combo and it came with pita bread (unlimited), falafel plate (6 pieces), rice, fries, 4 appetizers of choice, and 3 skewers of choice. A great bang for the buck! Appetizers were amazing. Pita bread is freshly baked in their store. I recommend the Kebab skewer here. Service is exceptional. After we were done the waitress informed us that there is a grocery store next door so we checked it out too. We are so pleased for trying out this place."}
{"text":"First time here at this long time establishment for a friends birthday. I was told that they just renovated a few days ago and it looks nice. They are missing mirrors in the bathroom, I hope they put them up.   We had a great energetic server who went above and beyond to give us separate bills, including a sep one for our appetisers and one for our wine which only a few people shared.   Food was ample and tasty. For appetisers we got the combination salad which comes with crispy falafels and choice of salad or dip (3).  I was overwhelmed at the selection so be prepared when you order. They have 5 kinds of hummus and baba ganoush.   For our mains, AT and I shared a lamb kebobs (2) $15 and a ground meat kebab. All come with potatoes or rice and salad (meh)   It was tasty but not as flavourful as I hoped. Maybe the spices ? AT suspects it because it's not cooked on top of a charcoal fire that gives it that smoky taste.   Dessert we ordered a trio of cakes for the birthday boy.   The big tables help out with all the food but clearing the table wasn't a strong suit. He did wait patiently however with a credit card machine for each of us to punch in.   If in the area, definitely come check it out."}
{"text":"I was so fortunate last night to eat at this Fine establishment. Our soccer team celebrated the end of season by eating here as a group.  My goodness!!!!the food was fresh, delicious and plentiful. We couldn't ask for more.  The pita bread was hot and kept coming. The array of dips, treated my taste buds to flavours and textures that I had not experienced before. Loved loved the falafel! It certainly did not disappoint.  The Cuban cigars spicy and delicious, and the skewers were perfectly seasoned and prepared. Last but not least, the wait staff were very friendly and attentive. We will be back for sure. My boys are already asking when can we come back. Merry Christmas!"}
{"text":"I used to live around the corner and remember when they opened.  My friends wanted to go to a new hip place but I insisted that I wanted to check out the tried and true.  And I was so glad we did.  Everything is delicious.  You need to come hungry for sharing appetizers and then an entrée.   Their grilled eggplant salad with tahini is one of my favorites.   I also love their different types of pickles and olives and the kubbeh (ground meat with pine nuts in bulgur).   The majadhra rice is also perfect.  They have a great meat selection and it's cooked to perfection.  Authentic and out of this world.   The staff is also great."}
{"text":"I haven't been to the restaurant in a very long time, but the grocery store next to it does take-out and it definitely is the best shawarma in Toronto! For $6 you get a loaded beef or chicken shawarma in a homemade pita and it's always delicious. The only downside is you might have to wait upwards of 10 minutes which can feel like forever when you're hungry and want something fast."}
{"text":"I've been coming here for nearly 2 decades (19 years to be exact), so I guess it's time to write a review.   Contrary to my usual lengthy missives, there isn't much to say about a place where the food is always great, the service is always with a smile, AND they serve grilled chicken hearts - absolutely fiend those, and never seen them anywhere else.   Been here hundreds of times, and will continue, for as long as it exists."}
{"text":"I normally go to the Sababa grocery for the take-out food. So far I've only gotten chicken/beef shawarma pita for $5.99+tax. The meat is scrumptious; savoury, tasty, salty with basic salad that balances it out. If you also add some spicy sauce, it adds an exciting sour sweetness and the spiciness kicks in later. Eating the pita can get messy. Beware! There is outdoor seating outside the grocery store you can eat at although cleanliness is questionable.  When you compare Sababa to the famous Laffa, Sababa is definitely the most affordable and the meat can compete. It does not have the interesting fillers FL has but maybe it has more meat?."}
{"text":"Friends along with myself always have something good to say about this restaurant. Its cuisine infused with tons of flavor. The service is good, but could use some polishing. Portion size is excellent and the best bang for your buck.  You need to come and try the lentil soup! it's a fantastic bowl to warm up too. Their hot table/grocery store next door to the restaurant, has many items you can not locate at any regular grocers.  We get a birthday coupon in the mail every year, granting $10 savings on our next visit. Its really nice to see they appreciate our business, just as much as we appreciate their food.  Atmosphere is warm. Decor needs some attention, carpet condition not the most hygenic in a food establishment and the upholstery in their booths could use some steaming."}
{"text":"I have been a regular Sababa goer since moving to Toronto a couple of years ago. It offers very genuine Middle Eastern food, well prepared and reasonably priced. The grilled chicken hearts are absolutely delicious, as is the Foul Medames that is served as an appetizer. For 'whole fish' fans there is a delicious grilled whole fish. The appetizers are excellent. This is all served in a relaxed and convivial atmosphere."}
{"text":"Had dinner last night with a couple of friends at Sababa and I thought the food was really good and reasonably priced.  All the dishes were fine, but in particular the Lentil soup was really good.  Cheers..."}
{"text":"Big Fan! On my \"must visit list\" when in TO  Best Tzatziki - better than any place in SF Yum Falafel Sandwich - yes Truly Med, even better than yours :( Fresh Pita - could you ask for anything more..   Friendly staff.."}
{"text":"I'm giving this a 4 only because it was the original of these middle eastern places.  Hasn't changed a bit in 35 years.   You walk in and you catch a whiff of what smells like armpits.  It's actually their spices and falafels in the fryer.  Don't be alarmed its actually a good thing.   One of the best falafels, it's plain and simple.  None of this umba crap and eggplant and cole slaw and garbage that doesn't belong.  It's salad, falafel, tehina and hot sauce.  The way a falafel was meant to be.   Their tehina is the best you will ever get. Lentil soup is amazing  Moroccan cigars that you eat one and you want 12 more.  Shush kebabs are ok. Their shawarma is garbage. Aside from the feeling that your in spice market in Lebanon, this is my go to place for a falafel to go."}
{"text":"The takeout counter is at the far end of the grocery store.  Sandwiches come in white or whole wheat thick fresh homemade pita.  The best, in my view are the shawarma and falafel.  The chicken breast sandwich is good too.  This place reminds me, by far, the most of the falafel shawarma stands in the middle east.  It is really authentic, in that good sense that transports you with every bite to a memory of eating similar food over there.  You can taste the lamb fatty goodness in the chicken and beef shawarma.  The counter offers tons of middle eastern salads, some serviceable, others great, and snacks, and a killer red lentil soup.  If you want an interesting desert, try the kaneifah, if available.  Wander the grocery store while you wait for your sandwich to be prepared and you will find everything from israeli snack foods, good middle eastern coffee with cardamom, Turkish lokoum, and Lebanese olive oil.  You will also find spices from all over the middle east, some for food, others for tea and coffee.  This place has been kicking around since the eighties, and it has always stayed true to its roots.  If it ain't broke don't fix it.  BTW, the restaurant next door is fine, but one should experience the counter first.  Order a sandwich, sit outside at the new outdoor tables, or stand like in the old days and like in the middle east, and chomp away, while the tehina that trickles out of that tiny breach in your pita drizzles down your hand and maybe your arm.  Napkins are advisable.  You can be more civilzed and eat at the restaurant next time."}
{"text":"It is my honour and privilege to let the world know of the best middle eastern restaurant i have ever tried in my life.  i have been going here since i was a kid.  It is unfortunate that nowhere downtown - lets call that anywhere south of st. clair, across the city from east to west- can you find a good falafel, much less a great one.  And so, rather than continue to bemoan the bad falafel boring this city, let me confirm for you the freshness of a falafel you will taste tucked away amongst fresh vegetables, and real hummous (thats not HUMMUS as pronounced like \"BUM\" with an \"H\" + US--for there is no such word--try pretending that you are about to hock a loogie while saying \"whom\" then \"moose\" and you might come close to the proper pronunciation - sorry pet peeve), dripping in tahina and lord almighty in a soft, as in with substance, feels like fresh bread, easy to open up for a pocket-full-of-goodness pita and there you have it.  AND THIS IS JUST A MEASLY FALAFEL SANDWICH!  god forbid you should try the hummous with meat, or the siniyeh in tehina sauce (imagine a flattened pancake of spiced lamb covered in what essentially is melted tehina {tahini}), or even simple pickled prizes like olives and  pickles.  for appetizers try the sambousek, or the kubbeh, both fried pastries, filled with ground lamb (different styles); or the labaneh, which is a type of cream cheese.  If youve read any of my other reviews, you know i could go on.  And i will. Just to say that after youre finished eating, feel free to go next door to their grocery store and buy more falafel, more hummous, more of all the stuff you just wolfed down and check out many middle eastern foods made and imported from that part of the world for your enjoyment.  (for a new take on chips, try BISSLI snacks.)  sigh.  okay.  im feeling depressed now.  I might have to trudge my way out, halfway through this month, down to davisville subway station and buy a metropass or a day pass and just go there.  its that good."}
{"text":"Came here because of all the positive reviews but really wasn't that impressed. It was not bad but all the food was pretty typical and average. I've had better kebabs elsewhere and nothing was that flavourful. Definitely would not drive out here to try the place if I wasn't already in the area. The falafal was probably the best dish we had that night."}
{"text":"A hidden gem in North York for what they brand as Middle Eastern cuisine, which I believe is closer to Lebanese. We had the lamb kebabs with rice and fatoush salad and the chef's selection of their dips and falafel. The lamb was excellent, very juicy and grilled to the perfect tenderness. The dips were also great: hummus, babaganoush and red pepper. Falafels were really good as well. The place is tucked away in a small plaza on Steeles so easy to miss. They also have a small grocery store attached that sells some traditional spices and ingredients for the same cuisine; plus a hot table."}
{"text":"Overrated.  Had a lamb shish kebab and a chicken shwarma.  Lamb meat was tough, full of chewy tendons that you ultimately had to spit out or swallow.  Chicken mean was more like sliced thigh. Thick dry pieces.  Their lentil soup was tasty and excellent.  Food was well seasoned and the pita was excellent but I wouldn't go back."}
{"text":"Used to be a good place because of value. Rude and slow service at the front payment counter was tolerated because of this one reason. As of 2016, prices have been increased 25-50% across the board. No longer any reason to visit this establishment."}
{"text":"Ordered a couple of shawarmas and fries. Shawarma was pretty decent although I would of liked tomatoes in mine and a few other toppings. No doubt I could have had them all but at 50 cents additional topping I was like no thanks. I appreciated the fact that it was a hot sandwich. Too many places out there serving cold shawarma meat. I would also like to add that their boxed baklava were really dry. Didn't enjoy them at all. Sadly I won't be back."}
{"text":"I went to the other side to order takeout which is at the back of the grocery store. Got the chicken shawarma because I was really craving a shawarma today. Unfortunately, I didn't like it very much. It tastes a bit different from other shawarmas I've had. Hard to describe, the sauce is kind of creamy and nutty, no garlic flavour which I'm accustomed to. I can't get used to this!   The rest of the food in the display case didn't look the freshest either."}
{"text":"I've been going to this place my whole life. It is probably the best palestinian style middle eastern food in the city.  Its a restaurant with an adjoining grocery. Both the restaurant and the grocery are fantastic.  First the restaurant: Don't let the occasional sparseness of diners put you off. This place is great. I've probably had most of the stuff on the menu by now, but my regular order for years has been a bunch of appetizers (hummus, tabouleh, mixed pickles, eggplant salad - or just the combo salad) and as the main course - Siniyeh. Siniyeh is a great dish you can't get at too many places. It's basically a ground beef patty seasoned with middle eastern spices and covered in tahini sauce, pine nuts, and parsley, slow baked to perfection in the oven. It also comes in a tomato sauce variety,but i prefer the tahini one. The dish's in that category of the menu all come with a salad and your choice of one appetizer. So if you're going alone, don't order any of the other appetizers, it will be too much! and of course all the food is served with the best pitas you can get in north america (IMO).  the grocery: ok, best pitas in the GTA BY FAR. It is very hard to find this style of thick pocket pita anywhere and done correctly and super fresh almost anytime you go. The machine that churns them out is actually right behind the counter in the back where you order the takeout, and is pretty much spitting them out all the time. I make sure to buy as many bags as i can fit in my freezer whenever i go! Their hot sauce is also hard to beat.  Make the trek out to bathurst and steeles if you want the good stuff."}
{"text":"Was very disappointed. The review at that moment was 4 stars, and I was expecting the food would live up to the hype, but failed. The kebabs my group of friends and I ordered were dried and tough, but had taste. The lentil soup I had was not impressive at all. The only part I liked was my salad.  Perhaps my group was too big for the staff and chef to handle, and thus, some food was overcooked and dry."}
{"text":"The food is good, but boooooy the service is bad. The young guy you have hosting is either stoned, bored, doesn't care, or a combo of all three. He just mumbled the entire time."}
{"text":"Very good lentil soup and good value falafel"}
{"text":"Went on Tuesday evening. Quite place, friendly staff. Humus was great, very creamy. Falafel was also good. We were quite disappointed in the kebabs. Lamb was dry. And both lamb and chicken kebabs needed more seasoning. Maybe we will try the pita sandwich next time ."}
{"text":"I always get the falafel sandwich from the back of the store. It's by far the best falafel I've ever tasted. The pita is fresh from the oven, it's also just an amazing pita in general, the best I've ever had. Pita is soft, thick and taste great.  The falafel balls are incredible. The salad has a lemon kick, and is always fresh. The Tahina sauce is thick and delicious. When all this gets combined its bite after bite of heaven. Sooo good! I used to get two sandwiches, but now I only get one, so I can watch the weight.   Their falafel prices were always much cheaper than the competition, used to be $1.50  now its $4.75. So, their not crazy cheap anymore.  But, not a big deal. Now I have two reasons not to buy 2 falafels.   Bottom line. Best falafel. Nobody comes close to matching this sandwich."}
{"text":"Sababa is an institution. You either get it or you don't. Have the messy as hell Shawarma or the delicious lentil soup and shut the $%*& up about the ambiance in the sit down portion. Not to your liking? Go to the take out counter and try REAL middle eastern food without the pretence while loading up on turkish coffee and Spring mango drink."}
{"text":"Best shawarma I've ever had! I didn't go to the restaurant, I went to the store that is next door which is also called Sababa. The meat tasted fresh and the food was so filling! My husband recommended this place and I'm glad he did because we want to have this food catered at one of our parties!"}
{"text":"Gave this place 2 chances and I think it is the worst middle eastern food in Vaughan, I have truly no idea how this place has good reviews, were very disappointing both times from the Food as well as the service!"}
{"text":"The food is amazing. The chef does a really good job of making sure the kebabs come out from the grill juicy and succulent. The lamb kebab was super tender and tasty. The french fries were alright too. I really liked their dips. Great job!  Customer service was top-notch. 10/10.  The decor....not so much. It feels dated, dark and the seats are old. This place is in dire need of some renovation. If you don't care about decor though, you won't be disappointed in their food. I can assure you of that.  Did I mention that it was pretty affordable too? Yeah, the prices are very reasonable for the quality & quantity of food that you get."}
{"text":"Had the worst experience at this place. Chicken shawarma plate just wasn't good. After seeing all the positive reviews, I was excited to try it out, sadly left me severely disappointed. Not only was the food not good, but the prices were outrageous. Save your money, go elsewhere!"}
{"text":"One of the best middle-eastern restaurants I've ever been to.  They have their own pita machine so it's always super fresh."}
{"text":"I have never actually dined in there, but I have had take-out from their store next to their restaurant. Best falafels, spicy hummus and sababa burger I have ever had. I will be dining in to there restaurant if there take- out is that good. I highly recommend it. :)"}
{"text":"The best hummus and falaffel in the city. Really really great tender fallafel and amazing home made hummus. The shewarma is fine, salads are good, and theres a nice grocery store owned by the same folks thats next to the restaurant where you can buy hummus to go. Definitely think thats a great idea."}
