{"text":"Great German brew and definitely my favorite dollar taco Tuesday spot! Truly 1 dollar tacos. They have a wife variety of fun choices (Korean bbq, of course that would catch my eye, etc). A great spot to relax with friends."}
{"text":"Tacos are great, and very cheap. The service however makes it impossible to enjoy the experience. If you go here, be prepared to wait a good while unless you intervene, and even then you'll probably still be waiting. Every time I've gone there we have had a problem with the one waitress (older lady, always wears her hair in a braided ponytail). She's very hard to track down, always irritated, and rude. The last time we were there, one of my tacos was wrong, my friend's cheese didn't taste right, and we were given no napkins (getting napkins at this place would have been another 20 minute wait). I brought all of these to her attention after she had to literally be sought after, and she flipped out and walked away. She told us \"scratch the fucking ticket\" so at least we got a free meal out of it, but we won't be back."}
{"text":"Love love love wing Wednesday!   When grumpy is on deck, the best wings are served!  I even think they're better than the famous Quaker steak.   Middle East, southwest , Cajun, tikka masala + more!   The flavors are fantastic!   I would every week if I could!"}
{"text":"What a cool place especially for the location ! I always enjoy good German style places, because I grew up in southern Germany. The beers selection is great, and people can drink out of the legendary 1L beers.   Food is pretty decent, especially for the price. Wednesdays are wing specials, where you get a pound of wings for 5$! The sauces and dry rub selection is vast and good.   For the service........ Nothing personal against the bartender/server/foodrunner/busser/ everything, but this is the slowest service I have ever experienced! 1 hour and 50 minutes to get wings and fries. Worst part about it each individual order was 15 minutes apart. So, my friend received his food, 15 minutes later I did, then 15 minutes later the other friend.  The drink order took about 20 minutes. I am not blaming this on the staff, but management. Also the cook did not seem to know to handle tickets and or how to line them up on the board, hence 30+ minute ticket times. The wings were horribly over cooked, but still tasted good.   I hope  their service picks up because I enjoy the place. But no one should wait 2 hours for wings."}
{"text":"It depends on for what you're looking, BUT, if you want a laid back, old-school, good-time Cleveland bar, the Sachsenheim is the place for you. I'd never been there prior to this evening, but I'd read some reviews and figured it was time to go. I met a couple of friends on Wednesday wing night for a few drinks.    I was the first to arrive at about 9 p.m. and was a little wary of going in by myself since the place is located in a mildly sketchy neighborhood. In truth, it's just an old working class area and I knew that there was nothing to fear. So after waiting 10 minutes for my pals who ended up being 25 minutes late, I decided to enter. There were a few other customers, but the place was pretty empty. I asked the barmaid about the draft beer selection (about which I'd read) and she replied with about 5 or 6 quality German drafts. I settled on the Kronenbourg 1664 and sipped on it while waiting. The beer was fresh and cold.    My friends arrived around 9:25. One ordered a Warsteiner and the other ordered some German IPA. They too were quality beers. Since it was wing night, we ordered 1 pound of chipotle dry-rub wings and 1 pound of hot buffalo wings. We did not order any blue cheese dressing. This proved to be a MAJOR mistake. The wings arrived and were beautiful. The dry-rub were well coated with rub and the buffalo were doused in sauce. We attacked the dry-rub. The attack was short lived. While the flavor was fantastic, the heat on the dry-rub wings was ridiculous. The three of us were sweating and crying. To cool off, we actually ate some buffalo wings. Our mouths were scorched. In spite of the pain, the wings were VERY tasty and fresh. The meat was white and the skin was crispy. After acting like babies, we asked the cook (and apparently the majordomo) to bring us a blue cheese. Although my two friends had had enough, I dipped the dry-rub wings into the blue cheese and it properly balanced the heat. The cook later told us that the dry-rub chipotle wasn't really that hot and that the REAL hot wings were the \"death by pepper\" and habanero.    After the wings were finished (we actually left 3 of them), we had a few more beers and played a few tunes on the juke box. The place emptied out and we discovered that there was a ping-pong table in the back of the room. Since my good friend Blanco and I are players, we were pleasantly surprised by this discovery and played a game using the house paddles and ball. Unfortunately Blanco got the best of me in a 22-20 overtime win. The top-notch barmaid informed us that Wednesday nights during the cold months are ping-pong nights and that many players congregate, sweat, swear, and have a good time at the table. We will certainly be joining them this year!    This joint is solid. The lines of the beer taps are CLEAN which is a complete rarity in Cleveland these days. Just about every time I drink a draft beer in a restaurant or bar, I taste the nasty (although usually faint) aftertaste of unclean tap lines; like some sort of rotting mold of which the owners are unaware and the patrons are too kind to mention. Not the case at the Sachsenheim. The barmaid was friendly and informative about the history of the place, the food was fresh and properly prepared, and the atmosphere was casual and old-style. If this is what you like, get there ASAP."}
{"text":"The 5 stars are for Taco Tuesday.  I plan on hitting up Wing Wednesday in the near future.  This place is epic.  Remember when you could smoke in bars in Ohio and dives had an odor?  The combination of fried oil and butter mixed with stale beer and cigarette smoke would come together for this incomparable funk.  Well you can still get a hint of that when you walk in the Sachsenheim.  And that's not a bad thing.    This place was full of people of all different walks of life.  The music was loud and raucous.  It was an ideal scene for reasonably priced German Beer and amazing tacos.  This place easily provides the most bang for your taco buck.  And I use the term buck literally; the tacos are only a dollar.  But, the tacos would be worth it if they more than a dollar. They have a great variety, they all seemed good.  The Jamaican Jerk Sausage and Chipolte Bacon Chicken were by far my favorites.  In comparison to other taco spots, nobody stacks up.  The only minor issue was the service.  The place was packed, but still not an excuse.  When we found seats at the bar, the bartender offered me a complementary Jameson for my trouble.  She was forgiven instantly.   This place is simply amazing."}
{"text":"For sure not impressed with the decor but the tacos and beer are great! Taco Tuesday is awesome and great options and combos of flavors. I was a bit skeptical of the place when we first drove up but the food was so tasty I'm for sure going back.   Great beer/food with excellent prices."}
{"text":"The city of Cleveland has a lot of solid taco nights, but I'm gonna go out on a limb and say this is hands down the best. $0.75 for some of the best tacos (not just pub tacos) I've ever had and $1.50 outrageously good empanadas. They usually have 7 or 8 different meats or flavors, each with a very distinct, delicious taste. Grumpy likes to mix in a few specials on top of the menu staples which I always go out of my way to try, and have never disappointed.  They're wing is no joke either. $3 for a pound of wings and all they're sauces and rubs are home made and are top notch.  Throw in $5 liters of good german beer and you've got a can't miss situation."}
{"text":"My girlfriend and I used to frequent here for Taco Tuesday...the food quality was usually decent. I'd give it a 7/10. However the service leaves much to be desired. On average it usually takes 15-20 minutes just to get your server to bring you a menu. Once you get your menu be prepared to wait and wait and wait before placing an order. This theme repeats itself throughout meal. Waiting for your food and further waiting to get your check. There have been many times were we had to approach or server (usually this older lady) to bring our check over. Due to the slow and inattentive service will unfortunately not be going back. Plenty of other places in this town to enjoy a taco Tuesday."}
{"text":"The prices here are really low but food is hit or miss. I used to visit for taco Tuesday and wing Wednesday quite often. Now sometimes I go and the wings are so salty and dry I throw them away. The taco night is still generally good but it gets overcrowded and not enough people working there. If you are in the area and don't mind the wait, give it a try. It is by no means a fancy place so don't bring a date!"}
{"text":"Sachsenheim Hall is glorious. Tankards of quality beer are available just above (and occasionally below!) retail. Enormous quantities of pretty good and very cheap house made food flow like wine. You never know what sort of crowd might be in the bar, but there's a good chance you'll hear some German \"um-paw-paw\" music from upstairs, run into a singer-songwriter's club, or a bunch of loud beer SNOBS.  You don't even have to use your imagination to see someone wearing lederhosen if you go at the right times! Their outside area is swell in warm weather, with some seriously nice old trees."}
{"text":"Great beer, cheap food, good times :)  Kind of in a bad area of town though... so just a watch out.  The menu is usually only a single type of item for the night (tacos, wings, etc.) so don't expect many options.  I usually go for Tacos which are amazing... lots of interesting tacos above and beyond basic beef and chicken.  The place seems to be hit or miss in terms of the crowd.  I've seen it packed to the brim.. but then i'v also seen it virtually empty.  When it gets busy the service REALLY slows down (even for basic things like Taco's or wings) but normally pretty quick/normal service."}
{"text":"Worst fish fry and service ever! When we first arrived I went to the bar to grab a drink knowing the wait time could be awhile. The bartender was annoyed that I did not know about the beer selection and never once so much as cracked a smile. We waited for a table only to be greeted by a very frustrated waitress responsible for the whole dining room. The waitress told us it's going to be an hour and a half for food and she didn't know when she would get to clean off our table from the previous guests.  Still we decided to wait in hopes the food would be worth it. When are food finally arrived the perch was dry, hard, and definitely left in the fryer for to long. Nothing was homemade and most of us did not even get tarter sauce served with our fish. The fish, pierogi's, and fries where definitely supermarket freezer items and very poor quality. We got there at 6:30 on a Friday night and they were  out of shrimp and sour cream. Lastly, they ran out of pierogi's so the kitchen decided to give us smaller orders but for the same full price and with no sautéed onions as advertised. The pierogi's came with a literal cup of applesauce minus the pull off lid that you would put into your child's lunch box for school. Do not waste your families money or time. Cleveland has so much better to offer in the way of a good fish fry."}
{"text":"We love the \"Sachs\".  The kitchen is small, so there can be a bit of a wait.  Where else can you get a full liter of german beer for $5-$5.75?    Heck, we went to dinner at Sokolowski's and waited almost 1.5 hours in line WAITING.  I'd rather sit at the Sachs and enjoy a liter of beer, enjoy conversation and wait for my food to arrive.  We have enjoyed everything we've had to eat."}
{"text":"OK. First thing you need to know is that this place is in a fairly shady area of Cleveland - the first time I went there I was pretty sure my GPS had gotten me lost. But the place itself is nice, homey and pretty darned awesome!  Basically this place is a German Bar with cheap food! A Litre of beer costs you $6. Yes. A litre of Heffeweisen. Or Dunkel. Or an IPA. $6. Insane.   And then there's the food. Taco Tuesdays where you have about 16 different types of tacos for a dollar each. Wing Wednesdays where you get tasty wings with a seemingly endless combination of dry rubs or sauces for about $2.50 (or is it $3?) a lb. And 75 cent Burger Thursdays.   And to top it off, they have a old school jukebox, a pool table, a Table Tennis table and a coin operated mini bowling lane (which is frigging awesome)  No matter which day of the week you go to this place, you cannot go wrong."}
{"text":"TWO WORDS: WING WEDNESDAY. Hands down the best wings I've ever had in Cleveland! The place is no frills, but if what you are looking for is incredible wings this is the place. I had the Garlic Parmesan wings (amazing sauce) and the Jamaican Jerk (dry rub) and they were both great!"}
{"text":"Amazing place ! Awesome food and good people . If somehow it doesn't work out for you just be patient"}
{"text":"Came here for the hyped $1.25 tacos and cheap empanadas with a friend. Apparently this place used to be a community center as the place is huge and at first you might find it looking a little old/sketchy. Don't be afraid though, I found myself trying to find parking (it's free!) in a lot that was full.  Food was good for the price, environment was open, and service was quick/friendly! Definitely will come back again. Tip: find seating yourself."}
{"text":"Finally made it out here after many years of thinking about giving it a try. I am going to do a simple rundown of things I like and things I don't.  Like:  - the crowd. I get tired of yuppies, hipsters and the general asshatery that goes with them. Mostly blue collar working folk while I was here, but surely that gets more mixed at times.  - good prices every day of the week  - good beer and full liter mugs... awesome  Don't like:  - service was bad, with one of the staff being the exception. I don't need someone hovering over me but it is nice if they don't disappear either.  - food was only ok  - location blows. i am not one to shy away from run down areas, but a friend lived right down the street from this place many years ago and I had a few situations arise while visiting.   All in all I like the place and will most likely try again."}
{"text":"I live way over on the east side, and I drive all the way out here every other week because I love this place so much.  There isn't much in the way of beer and food choices, but what little they have is always great.  And they are one of the few places around that have a beer garden and ping-pong table.  Combine that with the best Taco Tuesday around and German beer served in huge Liter mugs... this place is Awsome!"}
{"text":"This place is a hidden gem. Went there for wing night and had good beers and food. 5$ per pound And over 26 sauces to choose from. Talking with the bartender melaine she informed me about how all the catering tgey do is from scratch.......wow. that's impressive. They make thier sausage homemade and all tge burgers homemade.  That was crazy. You would have never guessed. I cant wait to go back for taco Tuesday. They said tgey serve over 700 at night out of that  place. That's sweet! Want to try thier Saturday night German food specials too. Definitely excited to go back!! Great watering hole for locals!"}
{"text":"My boyfriend and I drove from the East side for the legendary Taco Tuesday.  We must've forgotten we left the house wearing our cloaks of invisibility, because we sat at a table for 35 minutes waiting to be served.  Not only did we not get menus, we didn't even get a glance.   Thankfully there are other Taco Tuesday Nights in Cleveland so we took our hunger elsewhere."}
{"text":"My favorite comfort food joint! From tacos to prime rib, grumpy and his staff put on a great daily menu. Keep an eye out for there special events you don't wanna miss things like schnitzel fest, Fat Tuesday buffet or Sausage n Beer Fest!  Fish fries are every Friday not just during lent! And not just fish, mussels, chowders, lobster Mac n cheese, clams casino! And more! you never know what he might put on the menu! And I can't forget the bar...8 rotating taps of German and local beers! and cooler full of bottles!  Moe and Melanie do a great job every day of the week!"}
{"text":"The Sachsenheim is a dump.  I like it though.  It is so sad that there aren't enough Sachsen's to keep this place up & running the way it should be.  This place has 3, count them 3 ballrooms!!!  I mean, think of the fabulous concerts or weddings this place could have.  I bet it was a site to behold in it's heyday. For now though, you should go & support a place of local history.  WARNING: this is shady-town so be careful and go with a friend to your car.   They have GREAT German beers on tap & for a deal too!  The food isn't half bad  Grumpy will take care of you!  Seriously, next time you're in the mood for a great brew, check out the Sachsenheim!"}
{"text":"THIS PLACE KICKS A** FOR TACO TUESDAY! Are you kidding me I love this place.  Best kept secret in Clevleand.  Trust me if you find this place your never gonna meet someone that was just passing throught he neighborhood and decided to Stop. HERES THE FACTS: Tacos: Fast, delicious, plenty of options, AND ALL $1 Service: Fantastic.  Super friendly staff Parking: TONS OF IT Beer:  UMMMM $5 Litres of Dunkel. Need I say more?  I may be off on the price but who cares its still cheap.  I mean for under $20 you can eat and drink like a FAT ROMAN. People:  A mixed bag from Hipsters to business men in French cuff Shirts. THE BREAKDOWN:  Get you butt to this place before it gets too cool for school and you cant get a taco cuz of the crowds.  I also heard wed. burger night was bad ass."}
{"text":"What a neat place!   The Open Mic has been switched to Improv on Thursdays."}
{"text":"This is a place that is hard to rate. A four star review seems high for what this place is, but a three star seems too low. But I am giving it 4 based on ridiculously cheap prices and tasty food quality and the rest is just ancillary.  Taco Tuesday and Wing Wednesday bring me back to this little dive over and over. This isn't your typical Taco Tuesday in Cleveland, where you only can choose from a few tacos. There are probably 15-20 choices that sometimes rotate, sometimes repeat. Last night I had the Ancho Chicken, Chipotle Pulled Pork, and Chicken Paprikash tacos. I'm usually squeamish about ordering meats and such in divey places but the flavors and quality seem pretty high. Lettuce, tomato, and cheese top all tacos, you choose your meat fillings (a few veggie choices, too), hard or soft shell, and sour cream and/or salsa. Beers are German and I usually split a giant stein with a friend, but last night I opted for a normal size beer. So, three tasty tacos and beer = $7. Seriously. $7. Wing Wednesday is a similiar set up with several wing choices, both dry and wet style. I love the wings but I haven't been going as often since wings make my clothes shrink.    Ambiance and service? Well, remember you are eating good food on the cheap. Corners have to be cut somewhere. This is a super old historical bar that could be quaint, but sadly, is pretty rough around the edges. It did appear that they recently painted and repaired some ceiling damage. But the tables are old school cheap bar tables and it's very, very dark inside. And service varies from average to slow. Best bets are to sit right at the bar for quicker attention. It gets packed on Tuesdays and Wednesdays and I don't think the kitchen can quite handle the volume efficiently during peak hours, but that's ok. Remember... $7 for really flavorful tacos and a quality German beer. Just know going in that this isn't fast food. And if you chose not to go? That's ok. More room for me at the bar to enjoy my uber cheap and suprisingly tasty tacos."}
{"text":"Great homemade brat burgers and fabulous beer. Plus great prices. We'll be back for sure."}
{"text":"Tacos were very tasty and unbelievably cheap. Good selection of German brews, and very well priced also. Not the most aesthetically pleasing decor, but that doesn't matter much to me.   The service was great, I left happy, I will definitely come here again."}
{"text":"This is my favorite, favorite place for comfort food. Think schnitzel, pork loin, chicken Marsala. Tonight we had the chicken Marsala and it was a religious experience. Grumpy's Marsala sauce is INCREDIBLE! Also had the goulash. Thick chunks of tender pork, fat egg noodles and an awesome, rich sauce. Both meals were solid five stars.  Yummmmm"}
{"text":"Don't be afraid to get out of your car here on Tuesday night.  You are about to enjoy some of the best ( and cheapest) tacos in the city.  The staff is very friendly so don't be upset if the service isn't great.  Have a cold Dunkle relax and enjoy the trip down memory lane."}
{"text":"Tried it out, it was an experience. The staffing was poorly planned, an estimated time of food order to table was 1 1/2 hours it took about 45 minutes for the food to arrive and when it came it came out fast. The bar was packed, and apparently you have to know someone to get waited on in a timely matter. Not coming back."}
{"text":"The sun is shining, the birds are chirping, there's a beautiful 78 degree breeze blowing out there and the sky is blue.   Not in the Sachsenheim Hall. But that's ok. Even though the place is a bit of a windowless behemoth, the giant beers and wings on Wednesdays more than make up for it. $3 for a pound of huge wings and about 12 different flavors to choose from, from sweet and mild to face melting, dry rubs and sauces too. Great for groups, never really packed out and always cheap. Tons of parking, motorcycle and scooter friendly."}
{"text":"Put the Grumpy Sauce on anything you can. Heck just eat it out of the portion cup. You will thank me later."}
{"text":"That was an odd, but interesting....at times frustrating, experience.  Hearing about the legendary $1 taco Tuesday, my friends and I decided to give Sachsenheim Hall a shot.   When I first walked in, I scoped out the scene for a table for 4, which doesn't exist. Sachsenheim offers bar seating and communal tables. Time to make new friends...   When we asked our waitress about happy hour specials, she said that there was no happy hour since their prices are already so low, despite the big sign at the bar advertising happy hour until 7. For whatever reason, there is no written beer list, and our server seemed on edge and annoyed when we asked her to run through the beer options.   Fast forward 45 minutes and empty beer steins and we couldn't track down our waitress. We waved down another server who wished us luck finding ours when we offered up a physical description. About 10 minutes later, we spotted her, waved, and were told that she would be back. It took at least an hour to place an order for our second round of drinks and food. So frustrating!   When the food finally did arrive it was equally cheap as it was tasty, which made the wait feel somewhat worthwhile. The Korean Beef tacos were the hands-down favorite. I asked for non-dairy and my empanada was super cheesy. It was only a $1.50 loss though (we didn't see our waitress for another 20 minutes once we were served, at which point it didn't feel worth it to ask for a cheese-less empanada). One of my friends never received her empanada, but was charged for it, and again chocked it up to a $1.50 loss. It just didn't seem worth going through the hassle of finding our server and waiting for the issues to be resolved."}
{"text":"What can I say about this place? It feels like home from the moment you walk in. Moe treats everyone like a regular and it seems like he remembers you even if you've only been in a couple of times. Mallory is a fantastic bartender too. She's funny, keeps up a good conversation and makes a mean drink. Speaking of drinks, I'm not a big beer drinker but the dunkelweizen is on point and I'll have it every time. And don't forget the food. I've only seen a menu on Taco Tuesday but the kitchen also cooks up solid steaks, schnitzel, pork chops, and I'm pretty sure whatever else they feel like on any given night. Make sure you get some grumpy sauce for your fries if they have it."}
{"text":"Found this through Cleveland Taco Scene on facebook.  Tuesday are 75 cent tacos. Yes, really.  They have like, a dozen different kinds too.  Whichever you get, go with the soft shell though.  Their hard shells are just your standard manufactured taco bell shell.  I had the fish taco and it was my favorite by far.  Also tried the chipotle chicken and bacon & the chorizo chicken sausage.  They were okay but would have been better in a soft shell.  The empanada though, for a $1.50...you can get any of the tacos in the empanada and it was SO delicious!  I think next time I go back I may just go with a couple of those.  $1.50 is still pretty cheap and it was huge! I got mine with Chile con Carne. Drool!    The beers are big and cheap as well.  Between my boyfriend and I, 7 tacos, an empanada, and 4 medium size beers, our bill was $24!  I have to admit I was a bit skeptic because this place is in the middle of the hood, but you would never know it once you got inside.  It's a good mix of people and everyone was really friendly.  The inside decor is pretty basic.  It's a German Hall and that's exactly what it looks like.  There is a \"beer garden\" I guess you could call it in the back and it's very lush and green and a great setting for tacos and beer!  The bartenders and staff were really nice.  I was expecting them to be curt and annoyed as they were running their as*es off because it was busy, but I didn't feel rushed at all.  They were really patient and learned our names by the time we walked out the door!"}
{"text":"Best taco Tuesday in town, and liters of beer! Liters! Only 4 stars because the service can be sketchy, despite friendly staff. Great taco selection though, and the empanadas are delicious, definitely my favorite. A few years ago it was frequented by older blue collar types, now is definitely more \"hipster.\" Still I`ll risk hipster run-ins and slow service for an ancho chicken empanada and black bean & corn taco!"}
{"text":"The best taco tuesday in Cleveland.  They did raise the prices so now I think they're 1.50 but still pretty awesome.  On any given Tuesday there's at least 10 different combinations ranging from lamb to chorizo.  Given  how packed it is, the servers are doing they're best but do expect to wait a bit for your food.  They also have real beer sizes here, including the legendary beer boot.  Order the tacos loaded so they come with lettuce, tomatoes, cheese, sour cream and salsa.  My favorite was the chorizo and I wasn't really a big fan of the lamb.  They hda run out of fish tacos by the time we got there. The whole entire hall screams tacky wedding reception with plastic flowers and the faint smell of smoke in the bathrooms.  But it's clean and there's ping pong tables.  There's also girls selling homemade cookies for a buck that look pretty tasty."}
{"text":"Never a let down on wing and taco nights!  Great food at great prices and draft beer selection is top notch.   Grumpy takes pride and it certainly shows....check it out."}
{"text":"Pretty cool place in a old school working class neighborhood.  They have a kick ass (mostly German) beer list.  The litre mugs always run out..guess they dont just wana BUY MORE?  Daily specials are good too.  It IS priced well and very affordable as the other reviews say....but if ya look at the cars parked in the lot these people arent hurting for money... Welcome to hipsterdom..."}
{"text":"After my first visit to the Sachs three weeks ago, I've stopped in for every Taco Tuesday since. They definitely lived up to their hype for me, and you just can't go wrong with $1.25 tacos and cheap beer.   They have a large variety of taco fillings, and they're definitely a step above your average bar tacos. The atmosphere is that of a no-frills dive bar, so I didn't expect the food to be as good as it is, but it's phenomenal. I'm looking forward to trying out their Wing Wednesdays, and they also have $1 cheeseburgers on Thursdays. You really can't beat that.   To be fair, the reviews here are semi-accurate about the service -- IF you come when they're slammed. I think a lot of reviewers here are expecting way too much from a busy neighborhood bar. Go in on an off night, or at least not at prime taco time and it's a 180 difference. Moe is great! If you can be chill about an occasional wrong order and slower service, you won't be disappointed. The worst that's happened to me is I've been accidentally served extra tacos. That's not a con in my book."}
{"text":"Went here on Tuesday for the 75 cent tacos and met up with some new Cleveland friends.  The place was way out in BFE, but I really dug going here.  I think it's the best when you go to a place that you would have never found out about had not a local told you to go there.  The place reminded me of these halls near where my grandparents lived so there was some nostalgia going on there.  And 75 cent tacos who can beat that.  The beers are super big and super cold and the service is slow so you need to make frequent eye contact with the waitress but at least with the beers being so large you only need to get here attention once or twice.  I got the fish tacos, black bean and corn tacos and the refried bean taco and my fav was actually the refried bean one.  I also preferred the hard shell to the soft (the soft was too large a tortilla for how little filling there was so you ended up tasting mostly tortilla when you were eating your taco).  My dude got a bunch of the meat ones but preferred the regular beef the best.  This place is a very cool place.  I like the pool table and the shuffle bowling game and he prices are great!  These aren't going to be the best tacos you've ever had in your life, but for the price they can't be beat."}
{"text":"It may not be perfect, but it's perfect to me. The food is always good and ridiculously cheap, and their many taps of fast-drinking German beers are always alluring. It does seem chronically understaffed, but they do their best and patience is rewarded with big portions of hearty central European and American bar food to go along with full liters of that outstanding brew. It's also a fantastic and fantastically inexpensive party and meeting space. Finally, they have awesome special events like Schnitzel-fest and Sausage-fest, so you'd be wise to check out their Facebook page."}
{"text":"I really wanted to love this place.  I've tried a lot of different things here and visited around 10 times.  I've done the taco night, the wing night a couple times, did new years eve there, and I went to the cinco de mayo buffet.  I love old bars, dive bars, i'm easy to please.  But this place just isn't good service-wise, which is too bad because overall the food is good and fairly priced.  Taco night is an under-staffed madhouse.  We never went back for that after waiting endlessly while two servers tried to serve everyone and failed miserably at it.  Wing night - the prices and wings are good but again - bad service most of the time.  I'm not expecting a server to fall over themselves for me.  I'm looking for someone to check in on me more than every 45 minutes, get my order somewhat right, and to not be rude the entire time.  Apparently that's too much to ask here.  New Years experience was actually much better than the other times we went.  Good meal, somewhat decent service for the food, and the male bartender, who is often there, was great.  Cinco de mayo buffet was a joke.  The guy who makes the food there - let's just say he definitely lives up to his chosen nickname.  He restricted what we could get as we were going down the line....we weren't trying to take an excessive amount of food by any means.  I merely wished to try one chicken empanada and one beef since i didn't love a lot of the other options and he rudely barked at me that I could only have one and only one or the other.  Is this not a buffet?  You aren't allowed to serve yourself at said buffet, there are staff members there to serve you one small piece of what you desire and you can only have one.  So, stunned and puzzled, my party walks with their small plates of food to a cafeteria-style table to eat.  Trying to make sense of it, the people in my party thought, well, maybe they just want to make sure everyone gets some of everything before letting you have more?  So we went back up to inquire and the man barks at us that this is not all you can eat, we got our plate, so we can go sit down.  We were never rude or demanding in any way so I can't understand why he is so hostile. It was such a bad experience that my brother, who was there for the first time, vowed to never return.  What also disturbed me was there was a lot of leftover food from this buffet since they we're being so restrictive with portions, and we watched them pack the food back up in a way that made it seem like it was going to be served again at some point. I wish this place was better, as we'd go there weekly if it was.  You shouldn't be made to feel like a business is doing you a favor by taking your money, but that's exactly how it feels.  We tried the wing night one last time following the bad buffet night and service was so bad once again, we just gave up and have never returned."}
{"text":"For the past few years, various friends and family members have asked me to join them for Taco Tuesday. Finally I made it and am glad I did.   You can't beat the 5 dollar liter beers! And the $1.75 tacos are great too. I especially enjoyed the chicken paprikash tacos.  I also tried the white mushroom and bean chili taco-  and for all vegetarians out there...it was decent. Our table also ordered all the flavors of empanadas. The blueberry was my favorite but the peach just did not have enough filling.  You will be charged for sour cream and salsa, which some of the people at our table never actually got yet were still charged.  We would have said something but the service was so slow we just wanted to get out.  They also did not charge me a dollar for each water I drank like it said on the menu, so we called it even!  A tip from someone who frequents the joint told me to order a beer from the bartender before you sit at a table and just sit back and know you will be there for a while if you are getting food. But again...$5 liters are kinda worth it and the atmosphere is so casual and laid back that despite the service I would go back. Their outdoor patio reminds me of someone's backyard!"}
{"text":"I'm no stranger to the Sachsenheim's glorious taco Tuesday. To start, don't expect to come in here and find a drink menu. This is a no frills, easy going, neighborhood bar (with a fantastic beer selection). I'm not much of a beer drinker anymore but who can resist $5 for a liter of beer? I'm pretty sure they are 10+ at other establishments. The taco Tuesday is amazing and has a variety of meat choices to choose from. I will also speak highly of their Fish Fry on Fridays. It was one of the best. The service is sometimes less than average, but we went last night and it seems that they have hired more wait staff and food runners recently. I hope to one day make it to their wing night!"}
{"text":"My family and I went here for their Marti Gras party last night and we had a blast! We got the creole buffet and I ate till my hearts content. The red beans and rice was spicy just like I like it and I loved trying crawfish for the first time! My boyfriend and I come here often for taco Tuesday and the awesome drink specials. We plan on coming here for fish fry Friday!"}
{"text":"This is a fascinating place. I loved being in this 1910 era building. So much must have gone on here throughout the years - you could kind of feel it. And nowadays, a rather decent Taco Tuesday is going on. (Signs alluded to other popular days like wings on Wednesday and German food on Saturday).   I ate 5 tacos. Chorizo and spicy beef were my favorites. There were so many meat types that one could fill their tacos with. I tried a chicken blend with bacon that was interesting, but good. I would definitely come back here for Taco Tuesday. The price, portion and flavor were all good.  I also got an empanada, which I wasn't a super big fan of. I found it a bit tasteless...overpowered by oil. The size was big though and it was well stuffed with meat. All the taco meat options are options for stuffing the empanadas as well.   Prices were more than reasonable with $4 pints and $1.25 tacos, hard or soft shell. Burritos were also an option.   Service was friendly. Our waitress was attentive and friendly and went over her favorite taco fillings with us. Orders came out as requested, with or without cheese and sour cream and in the requested shell type.   Our waitress took our names down and the kitchen sent out the tacos divided up accordingly. When I finished my first three and ordered two more the kitchen was super fast in getting them out.   Not a fancy place, though they do have a patio (folding chairs and tables on the grass), but definitely worth checking out this 2016 Cleveland Scene Magazine Best Taco Tuesday winner."}
{"text":"Can I say this is a hidden gem or is that a cliche?    The Sachsenheim, though difficult to say, has been a great find.  When you first arrive, it's this massive building where it's actually a little difficult to find the bar.  Is it to the right?  No..that's a dance hall.  Oh, the left.  I get it.  The staff is friendly, learns names quickly and a young girl seems to always have huge warm cookies to sell to benefit something or other...  I went on Taco Tuesday so here is the breakdown: TACOS: Such a great selection!  It seems to change seasonally.  The Habenera was hot but my personal selection was the Chipotle Bacon.  It had an excellent depth to flavor.  None of the tacos were bad and I was pleasantly surprised how each tasted SO different!  Green Chili, Sausage, Pulled Pork, Bacon, Chicken, etc.  Lots of options for even the adventurous types!  Plus, they're only 75cents.  Yea...you read that right.  BEER: I started out with a huge mug of the Spaten, which may or may not be a Malt.  The beer was cheap and available in every Munich-approved size you could want.  On tap they only have German beers, which is a good thing!    ATMOSPHERE:  It's a bit of a hipster bar, crossed with some townies, some metal-heads and a table full of cops in uniform.  Strange mix, but welcoming and unpretentious.  I'm pretty sure about every third person at the bar I recognized from a Grog shop show at some point.  Overall, this place is a...ahem..gem!  My bill was under $10 and I left full and buzzed.  Next time I might even splurge on the 14\" Burrito (about $5) or the 14\" Quessadilla ($4)."}
