{"text":"This restaurant is a real find in a non-intuitive location.  Wonderful food combinations - the Mulligatawny was exceptional and the Cornish Hen flavour fusion very nice - provide excellent choices for both the adventuresome and seekers of an excellent Alberta beef experience.  Highly recommended,  excellent service,  beautiful and unique food choices in an understated environment. Go"}
{"text":"Do not let the decor fool you - the food here is exceptional - beautiful presentations and unique flavor combinations - all at a reasonable price"}
{"text":"This restaurant is a Gem! No question, this is the best food I've had in Alberta and 5 stars is well deserved and I'd rate it 10 stars over 5 if I compare it to other restaurants in Alberta.  Happy I got to discover this place!   Nothing in the cupboards?  You know what to do!"}
{"text":"Food was Tasty. It's Got a Nice blend of East and West cuisines.   Ask the Chef to make your food spicy and you will really like it :) !!"}
{"text":"Great menu, fair prices. Went for the fish n chips because they were a bit different.  Good Choice. This location was really cold."}
{"text":"Do not let the decor or location deter you. The food at this restaurant is fantastic and I plan to make it a regular stop. Very friendly service as well. Check it out!"}
{"text":"Sorry, but this is neither good Indian, French, or Fusion.  Maybe it's the attempt to blend it all together that's the problem here. Nothing very creative and as some other reviews have mentioned, the English pub decor is very odd and does not match well with the food concept."}
{"text":"My husband and I just ate at Saffron Mantra tonight for the first time. The moment I walked in I was reluctant. The location use to be a pub before it was Saffron and it still looks like it's a pub. Ambiance is definitely lacking on first impression.  It wouldn't be so bad if they changed the tables and chairs or at least added table cloths. Now the food; We ordered the Saffron's Coconut Calamari as an appetizer and I forgot all about the ambiance. What a great ballance of flavours. Both of us loved it. For entres I had the Cottage Cheese and Zucchini Kofta and my husband had the Cod and Chips. Again, who cares about ambiance. We shared our dishes with each other and we both loved each one. The fish had an amazing batter with an even more amazing tartar sauce and chutney. So often curry dishes can come across as heavy and overpowering but the Kofta had such bright and delicate flavours.  Service was friendly and prompt,  prices manageable, and portions just right. It will definitely be a regular place for our Sunday night dinners."}
{"text":"Food was excellent. Lots of flavour & excellent portion size. Fantastic service. Prices were very reasonable. Quaint decor. Lots of seating, could easily host large groups or Christmas parties."}
{"text":"A friend told me that he drives all the way from the south just to eat here with his wife so I figured I had to give it a try... and YOWZA! French Indian fusion sounds like a confusing mix but these guys nailed it.  Hands down some of the best tasting food I've ever had. I'm a little scared at how close it is to my house, though!!"}
{"text":"Amazing food! Great management! The owner/chef came out to talk to is about this new place. We just stopped in randomly one day for lunch and I can't stop thinking about it! :) Cant wait to come back just for his exquisite plating technique! Oh and of course to try all the food!"}
{"text":"Went here for lunch.  Upon looking at their menu they had a pretty extensive breakfast/brunch section.  When I arrived I saw someone with the butter chicken and so that's what I had to order.  The butter chicken was quite good. The chicken was moist and tender, the makhani sauce was one of the best I've ever had.  It wasn't too thick or heavy, with just the right amount of spice.  The veggies were cooked perfect, nice and crunchy.  The naan and the rice gave it that extra heartiness that I needed to fill me up.  In my opinion, the price was a bit on the high side for lunch.  The entree was $16.95.  I would've liked to have seen a smaller version for a bit less.  Although, this would've been a perfect dinner dish.  Our server was friendly but a bit clueless at times.  Their take out menu advertises a \"Breakfast Promotion - $8.99\" All breakfast.  To me this meant all their breakfast dishes were $8.99 but they are not.  A bit confusing.  Their dining room is in desperate need of a renovation.  It's dark and a bit dingy; you can tell it was previously a pub.  It doesn't need much, just a new paint job, lighting update and some carefully placed decor and it would look 100x better.  I'm giving it 4-stars instead of 3-stars because I was impressed with my butter chicken as butter chicken can be really mediocre at times.  It would get 5 stars if the wait staff was a bit less clueless and the ambiance of the dining room were to be updated."}
