{"text":"I've been to Sage several times, mostly to grab a slice of their quiche (which is always tasty and filling, and my favourite offering of theirs) when I'm too rushed to pack my lunch that day. That being said, I have several reservations about going here:  1) The rest of their food is pretty bland. Sandwich/wrap fillings are surprisingly tasteless, even the curry.  2) Some items are overpriced. $4 for a side salad that's just a small pile of lettuce and some grated carrot/radish?  3) They give you a really hard time about using a credit card. They will take it if you absolutely have no other form of payment, but will let you know how unhappy they are about it. Which leads me to my next point...  4) Few places in Toronto have staff as rude as Sage's. I don't expect restaurant staff to be smiley or even friendly, but on multiple occasions I've seen Sage's owner and employees badmouth customers who've just left, in front of a long line of people waiting to pay/order. Once about a woman dared to ask to use debit for a $4 purchase (I was about to pay with debit for a $5 piece of quiche, and quickly started scrambling in my pockets for enough change...). And once about a customer who had changed the number of sandwiches they were ordering for catering.   Like I said, I'll go here if I need a quick bite, but I stick to the quiche, make sure to bring cash, and try to be in and out as fast as I can."}
{"text":"A go to Sandwich shop near Baldwin. Sage is a cafeteria style soup-n-sandwich joint in an old house on McCaul. Grab one of the tasty wraps and head to a table in the back. In an area of the city without too much character (at least for restaurants) Sage is a nice place for a casual lunch out during the week."}
{"text":"Sage is a great lunch spot on McCaul near Baldwin.  The wraps are great.  My favourite is the curry chicken wrap and the half and half (bbq chicken & grilled veg).  Fresh ingredients and very tasty!"}
{"text":"Let it be known, I have been to this place on several occasions and enjoyed their numerous fresh offerings... I find the wraps healthy and tasty, soup's good, and the cafe has a cute, bare bones atmosphere.  I must say though, I have been irked by the customer service on a few occasions now, particularly one individual who has demonstrated to be crusty and curt.   My latest example, (the catalyst for this review)...  We ordered a meal and a coffee, and was told it was self serve.  Instead of using a mug, we used the paper cups, (which were provided)...with the intent of eating quickly, and taking the coffees to go.  While pouring the coffee, we were scolded like children, being told by this individual that using the paper cups were expensive and bad for the environment...then she left in a huff. We explained that we were taking the coffee to go, but this did not seem to satisfy her distaste with us using the paper cups they provided.  Now, I'm all for being a steward of the earth, but as paying customers we should be treated with respect, and not given a subtle slap of the wrist, along with a lesson in being environmentally conscious.    Good food, but good riddance...you are not my 'Sage' for lunch any longer...especially 'Mother Nature' and her nasty attitude.  JJ"}
{"text":"I really wish I could give Sage 3.5 stars because that's what I think it is.    The food is fresh and healthy with a homemade feel that can be hard to find for lunch in the area.  They have a soup and pasta of the day, salads, and a large selection of wraps.  I have to agree with some of the previous reviewers though who say that it is a little bland.  The wraps are about 8 bucks and don't necessarily come with sauce or cheese (you can order ones that do though).  I've had the grilled veggie wrap (good but bland), the eggplant feta wrap (less bland but only because of the feta) and the vegan peanut tofu wrap (a little sweet but ok).  I've also tried the tomato soup which is nice but again, lacking in much flavour besides the tomato.   So the food I would say is a 3, solid if you are looking for something healthy.  The overall atmosphere I would give a 4.  The decor is really homey and country comfortable. Service is quick and the employees seem very nice.   Overall I would say that Sage isn't delicious but it is very comfortable and satisfying, especially if you are in the mood for something fresh and healthy."}
{"text":"Food here is always delicious and service is friendly and welcoming. It's great brunch and value without the frills.  Had the Bennie sampler, 3 different Bennie all on one plate and it melts in your mouth bursting with flavours, savoury with a kick!     The apple cinnamon french toast is fresh, chewy and fragrant.  Busting with flavours without being over sweetened!  You won't be disappointed."}
{"text":"What a gem!   Everything is fresh and tastes really healthy (because it is).  The prices are really decent ($9 for soup and a wrap) for the amount of food you receive. The service is sharp and kind.  The hours are tough if you don't live nearby (only open until 5; 11-3 on Saturday and closed Sunday), but it's really worth it.   Go to the AGO on a Saturday, skip eating at Frank, and hop around the corner to Sage after enjoying the art."}
{"text":"I have such mixed feelings about this place. It's close to my work and the food is fresh but I always feel terrible about myself for going there. Two reasons: 1. The service is not so great. The owner is rude and very abrasive. She doesn't like being asked questions. She's rude if you do and she doesn't make it a pleasant place to be. Which is really too bad because minus the bad attitude, it would be such a nice little spot.  2. It's expensive for what it is and the portion sizes are small.  I have mixed feelings every time I stop in - which has become less frequent lately. There are plenty of other places to eat close by. Next time, I think I'll try something new."}
{"text":"Great place for takeout lunch. Lovely tables and decor inside. Limited seating but sometimes you can get a table. I usually get the curry chicken wrap because it's just so delicious, but the rest of the menu is quite extensive and tasty as well."}
{"text":"I have always, always wanted to have a meal here, but I tend to be walking by when they are closed.  I finally had a free weekend and was asked to have brunch here.  My dream came true!  I believe the owner was serving us.  Things seemed to take a while, but she was all on her own and chit-chatted with everyone - some regulars, some newbies.  Very personable.  I ordered the hot cocoa, which took a lifetime to get to my table (the owner had to find time between serving all tables to steam the milk/cream).  It was delicious, but a stupid fruit fly ruined it for me before I even got halfway through the beverage.  Ho hum.  I love their menu because there is specifically a 'non-egg' section.  I'm not a huge fan of eggs, not sure why, so I immediately decided I would take advantage of this.  I ordered the non-egg version of the breakfast burrito (for all you egg-lovers out there, you can add egg).  The burrito was pretty good, quite standard.  I really liked the potatoes that came with my meal.  The plate was garnished with some fresh fruit.  It was very filling, and not too greasy.  Interesting:  The walls at Sage are filled with fabric art - which is basically pieces of fabric put together (not sure how) to form a picture.  Quite interesting.  Not sure if this artist is always featured there or if it changes every now and again."}
{"text":"I hate to say that I'm not such a big fan. If going out for lunch I'm likely to pick the sushi rolls on Dundas, or Sushi on Baldwin, or sandwiches at Avenue Bistro. But, on the occasion I do get to leave work for lunch, I have a few friends who drag me to Sage.  My gripes: All the food tastes like stuff I can make at home. The sandwiches are not grilled, hot or tasty.  If you pay for a filling, the wraps are often filled with more lettuce than filling. The Noodles are greasy but bland. the soup was bland.  I've really given it my all, but everything I eat here is underwhelming.  Although Margs recommends avoiding the lunch hour, they close at the ungodly early hour for 4pm, so its always either busy or closed.  Still only going if my friends drag me."}
{"text":"Great spot for weekend brunch, without the long lines of their weekday lunches. Their basic breakfast is great (the potatoes are delish!), but they've got some more exciting options too. Reasonably priced, you can expect to pay $10-15 for most brunch dishes."}
{"text":"It is a really charming, little place. Everything is quaint and there are many options on the menu.  I had the eggplant, sundried tomatoes and feta wrap.  It was good, but not amazing.  The one thing I found was that the servers and the person behind the cash were not very friendly, slightly cold and distant and that totally didn't match with the interior.  Previously, I had a less than stellar catering experience here.  But, I did enjoy my lunch today and will return again and hopefully a) I'll try something more adventurous and b) the staff will be a bit more cheerful."}
{"text":"I love love love Sage Cafe. But if you don't want to wait and don't want to be surrounded by pushy patrons, do not go right at lunch time. Any other time, this place is the bomb. The wraps are SOOOOOO good. Every single one that I have tried has been delicious. My favorite I think is the salmon dill one but honestly every single one you try will be good. It is a little expensive for a wrap sandwich but once in a while you can splurge. There are also some fancy drinks that you wouldn't be able to get at a regular 7/11."}
{"text":"This is the third place in the past two weeks that was rated 4-5 stars on yelp that bombed. Even a few of my favorite reviewers from yelp gave this place five stars! Am I just picky? Most say yes, but after today's experience, I'm confident that's not the case.  On the outside, Sage has a lot going for it: intimate, home made style treats and charm. It's whats on the inside that counts and Sage's inside seems to be going bad, real quick. The place was empty which is usually a bad sign, but we decided to write it off to the -14 weather outside.   We ordered tea and coffee. My cup was covered in old coffee stains and his Americano bland, but we chose to turn a blind eye, as we just wanted to enjoy our Saturday morning brunch.   The food on first appearance looked fine and I was just hoping the taste would be its saving grace. First bite, underwhelming. He ordered the Salmon Benny on a homemade biscuit. The salmon was fishy, biscuit mushy and the potatoes undercooked. I ordered the Apricot Ricotta stuffed French Toast. It was a little dry and the filling cold, but was good enough to eat and get filled on. I decided to ask for some syrup as it was lacking in the sweet rich flavor you'd expect from Ricotta stuffed French Toast. After a generous pour of what I'm sure was Aunt J syrup, I took a few more bites and looked to my right. On top of the syrup were six tiny red ants that were feasting off the sweet sap. I looked down on the table and a few more scurried in front of me, trying not to be seen. This was not something you just shrug off.   I called the owner  over and she immediately took it away and was very upset as well.  She even said shit out loud as she hurried to the kitchen. She asked to make something else, but based on the lack luster flavor, ants and dirty dishes I started getting concerned about the overall sanitary conditions of the place. We asked for the bill and she comped my meal. I was a little shocked she charged for my partners as he hardly ate his either. But truthfully I was getting the sense they needed every last dollar.  Right before we left, a table that had just come in asked for some milk. She came over to our table and grabbed the left over milk cup and gave it to them. I was shocked. For all she knows, my partner could have sneezed or dropped food in it. That was the sign that Sage is slipping from the supposed once glory days to a deteriorating sad mess. What a shame; and I was really looking forward to it."}
{"text":"There are three quick reasons why I love Sage:   1) As soon as you walk in the door the adjective that comes to mind is 'simple'. For me this is a bonus. They use simple ingredients and make real homemade food (i.e. don't add 10 x's the salt, sugar and oil you would use at home)  2)I like to come to Sage to study - it's very peaceful and small with good soups that make me feel like I'm back home sitting in my mother's kitchen.  3)You can sit near the giant windows to get a good dose of vitamin D. Is there anything better than studying near giant windows?? Well besides the studying part?  No, no there is not!  Et voila! There you have some incentive to visit Wendy, Charlotte, and Fernando at Sage. Having said this, I invite you to join me, but hope to keep the unique peacefulness and serenity in tact! Merci!"}
{"text":"Oh this is good food. Fresh, delicious, reasonably priced and creatively made. I had a salmon dill wrap today and roasted squash soup. Came to $12 with bottle of water. Excellent flavour. Perfect serving size. And not heavy/greasy. Felt good eating my food, not guilty.  There is excellent array of menu options. Meat, vegetarian, and seafood wraps. Also hot meals. All around the same price.  Seating is relatively plentiful (the place looks deceivingly small from the outside). But be warned it gets very busy at lunchtime! I was here on a weekday, between 12-1pm it was nonstop traffic. The staff thankfully are used to the rush and keep up with it.  Go here, you will like it :)"}
{"text":"Just had lunch there, my girlfriend and I split BBQ chicken - grilled veggie and curry chicken - apple almond wraps. Both were good and came with garden salad of fresh greens. I particularly liked the custom-made sauce, which was very delicious and enhanced the otherwise simple ingredients inside the wrap. This cafe is situated inside an old house in the Baldwin Village, has a cozy relaxed vibe and friendly service. Good choice for lunch, especially in the summer when you want to enjoy cold foods."}
{"text":"If you're looking for something other than burgers and hot dogs, this is the greatest thing you'll ever have. A little restaurant found on McCaul and Elm, they serve great and fresh saladas, entrees and wraps. I definitely recommend the wraps (great $7 lunch that's very filling). However, at lunch time, it's quite busy, so make sure you have the patience for the line-up."}
{"text":"Perfect place for a date! Their tofu wrap is vegan and deliscious, and I'm under the impression that they have a vegan soup every day too. For the non-vegan folk, there is quiche, gourmet pizza, salads - it's really quite lovely. The ambiance is cute, quaint and has an almost-European feel to it. I highly recommend it!"}
{"text":"This is a quaint little cafe. They have an especially yummy curry chicken wrap. I also like their quiche and I enjoyed  a nice latte there today too.   It has a really laid back informal vibe. An artsy type had set up his MacBook there and seemed to have been there for a few hours and they seemed welcoming to that too."}
{"text":"I heart Sage Cafe. It's been my go to lunch spot for a while now. Perfect location if you are going to the AGO or visiting/working at any of the University Ave. hospitals.   They have lots of daily specials: 2 soups, pasta, pizza, quiche. Plus there's the regular menu with lots of delicious sandwiches/wraps, including many veggie options. The baked goods look great too, although I've never tried them. Some of my favourites include their pesto linguine, goat cheese/spinach/mushroom quiche, and corn chowder. Everything is fresh, (relatively) healthy, and delicious.   This place does get a little busy at lunch hour, but staff are always pleasant and efficient. Some seating in the front, which is nice for people watching (although cold in the winter with the front door opening and closing). The back area has more tables and they will bring your food to you. I especially enjoy the placemats which feature recipes by kindergarten-age kids, e.g. \"Dinosaur Soup\"!!"}
{"text":"I'm really fond of this place. I kind of wondered why one of my colleagues was obsessed. He kept running out at lunch to get sandwiches and also buying big containers of pasta for his dinners when he couldn't be bothered to cook. Then I started trying it for lunch and got hooked myself. One of the criticisms levelled against it below is that the food tastes like something you could make at home. That's precisely its charm for me. The food tastes real and wholesome. Like the stuff I'd like to make at home-not the handfuls of M&Ms which would be more likely to exit my kitchen. The lunch menu doesn't change much and is full of sandwiches, soups, salads and various meals like lasagne etc. I've had soup which was really tasty and fresh-tasting and my other go-to is the salad with BBQ chicken. It's healthy and tasty and really not that expensive at just over $8.  I love the ambience of the café. It's cosy and welcoming with bright colours and tables for two. Staff are not always very friendly-perhaps due to the busy service at lunchtime; however the older woman who works there (and I think cooks) is a complete sweetheart. She's like the grandmother I never had-all sweet, smiley and caring. So-decent value for money, cosy and reliably tasty food. That's an excuse for ending up there every week, isn't it?"}
{"text":"I am so glad I found this cafe!  Friendly service, great salads and coffee! Good selection of foods during the week. I was told brunch and breakfasts were an option on the weekends. Nice jazz music playing, local artwork on the walls. Nice sitting area in the back.   I will definitely return!"}
{"text":"Eating at Sage is like eating at home. This small lunch spot is in, what looks like, a converted house just off the Baldwin strip. And, they haven't gone too crazy on the conversion because it still looks and feels like a house. There are a few seats up front where you order and a cozy room in the back with a few more.  The food is tasty, healthy and has that homemade feel to it. The have a variety of wraps (with plenty of veg options) as well as soup, salad, pizza, and quiche. All looked good but I went for a feta and avocado wrap. They use a large, thin pita bread like a tortilla to wrap the wraps. There was plenty of perfectly ripe avocado, a decent amount of feta, and it was filled out with tomatoes, lettuce, and sprouts. My only complaint is that it could have been a little bigger. This is something I could have easily made at home, but sometimes that's a good thing.   There's also a variety of tasty looking muffins, bars, tarts, and other sweet things up front. I went for a butter tart with hazelnuts (or maybe some other nut, I'm not sure). Not quite as gooey as I like my butter tarts, but it was pretty good and the crust was nice.  My meal came out to about $9.50 with the tart and the wrap."}
{"text":"I absolutely love this lunch spot!   This is a popular place, so prepare to potentially wait in line, but it will be worth it!  Sage has a great menu which has a lot of variety but also manages to not be overwhelming. It's an order your sandwich at the counter type place, and they make it right there! There is plenty of seating but it's also great for take-out.   I love their wraps, and they have tons of veggie options. Personally I'm a fan of the avocado and feta, and the egg and avocado (can't go wrong with avocado!!) what's great about this place is because they're making it right there you can do a few custom tweaks - I always add grilled zucchini!   Besides the wraps, they have salads, a daily pizza and a daily quiche, and lots of baked goods.   Everything is super fresh - it's the kind of food that keeps you full all day but you feel good about it - tons of fresh veggies and deliciousness!   This is a nothing fancy no fuss place, and it's a staple of the neighbourhood!"}
{"text":"I go to Sage Cafe mainly for their wraps. It's about a 5 minute walk from University Avenue   Today I was able to sit-in for a meal, it was around 12:30pm so I was surprised there were available seats in the back but there was a small line for customers to take-away.   We ordered the smoked salmon and the falafel wrap, brewed coffee and tea. Brewed coffee is self served and no free refills. However, the tea comes in a tea pot which can easily serve 2 people. The wraps are really good, large portions with a fair price. I was thinking about ordering another one so I can have for lunch the next day.   Sage is a great spot behind the hustle of the hospitals and business offices. I would love to try the weekend brunch menu."}
{"text":"I finally came back so I could try the vanilla french toast I had previously dissed for their marvellous eggs benny. I walked through the door and lo and behold a new brunch menu was waiting for me. (yay) But the vanilla french toast was no longer on there! (boo) But it had been replaced by an even more decadent version, stuffed with ricotta and apricot (yay)! Man, what a rollercoaster that day was.  After regaining my emotional footing I ordered the aforementioned dessert-passing-for-breakfast. I don't normally cuss before noon (not quite true) but FUUUUUUUUUUUUUUUUUUUUUUUUUULL HOUSE that was a mean french toast. Slathered with real maple syrup, the thick pieces of perfectly carmelized bread had my heart pounding -- and it wasn't just from the fat intake.  The french toast was served with a salad (why?) and fresh fruit. Service as always was impeccable and motherly. Sage is as good as it gets."}
