{"text":"This place has the most helpful (not to mention attractive) staff of any coffee house I've ever been to. Reasonably priced, delicious coffee, VEG menu, and polite considerate staff? What could be better?"}
{"text":"Peet's Coffee is my favorite coffee chain, so it's nice having access to it on campus.  They don't take credit cards, but there is an ATM in the basement below them if you forget.  Be sure to get a frequent coffee card for 1 free drink after every 10, and they then sign you up for a raffle."}
{"text":"The coffee is great. I actually prefer the Peet's Coffee they serve here to Charbucks, most of the time. They also have decent ice cream and light meal/snack selections, although I haven't tried any yet. The baristas are really friendly and nice, too. (Actually, they're welcoming enough to make me want to come back -- and this guy has most of his classes all the way across the campus!)
Despite having adequate seating, the somewhat unusual location (in the lobby of the building) can create a strange, quirky vibe that can take a while to get used to. It's a fairly busy lobby, so any private conversation about sensitive business is not an option here.
They only accept cash (and CaseCash if you have a Case ID card), with a PNC Bank ATM located downstairs."}
{"text":"I am not exactly sure if this is place is meant to be open to the public or just meant for Case students and anyone else who finds out about it. 

The coffee here is just OK--I used to work at Case and would come here whenever I either didn't bring enough coffee in the morning or when I'd get worn-out midday and need a refill of coffee. I always regretted it, though, but...any port in a storm, so to speak, when it comes to coffee!

I hadn't been here for awhile and I was in the mood for something different, so I tried the Chai Tea Latte. It was exceptional--some of the best chai I've had in awhile, with just the right amount of spiciness. If I come here again, I am definitely getting that. 

They have a mix of tables and comfy chairs. Privacy is a bit lacking here though, especially when it's quiet, so don't plan on spilling your deepest, darkest secrets to someone here unless you want everyone else to know them too. 

For whatever reason, they didn't take credit or debit cards when I went there tonight. Lame! I forget if that's the way it was when I used to go there in the past though. Fortunately, there is an PNC Bank ATM in the bottom of the building. However, they do offer free WiFi with no password monkey business or labyrinthine login procedure, which is a huge plus!

If you come here during the day, don't count on finding parking nearby because there isn't any. However, the lot adjacent to the Sages Cafe is open and free to the public after 5PM, and it's easy to park then."}
