{"text":"Good food. Fresh ingredients, well prepared. The Pho has a wonderful broth, and the spring rolls were some of the best I've had. Comfortable environment. Friendly staff. Good value."}
{"text":"My order - Spring rolls and all combination pho  For the pho- the broth was flavorful. Meats were tender. Noodles cooked well, but was not as abundant as pho from other establishments. Basil, sprouts, and jalapenos provided were fresh and colorful. Siracha, oyster sauce, and a house chili sauce were available. The chili sauce is recommended.   Spring rolls are well sized and came with good consistency peanut sauce.   Atmosphere was more hip than other Vietnamese restaurants I have been too. Seemed like a solid place to take a date.  Primary objective entering restaurant was to enjoy a bowl of pho with all the meat variations, peppered with basil, bean sprouts, and chili sauce. Objective was achieved, meeting expectations.  Suggestions - The pho will not thwart your hunger for too long. I was hungry within 3 hours of the pho. The soup in the tummy is an illusion!"}
{"text":"Terrible service! We waited over 30 minutes for our food yesterday, and no one came to check on us. When we confronted our waitress, she blamed it on the kitchen. No apologies, nothing! Terrible! Food is decent, but we won't be coming back because of incompetent staff."}
{"text":"Excellent food but the waitress was rude. The lady at the cash counter did not seem too concerned. We waited at the door for somebody to seat us for, get this - 10 minutes. Yes, no kidding. When we eventually were seated, the waitress had no expression and no words - no hello/welcome/sorry - nothing. The only reason I gave it two stars is the food and the younger gentleman who served us later. Seriously, if the owner does not care about her customers, they are not getting any of my busines.."}
{"text":"I am a big fan of Saigon Noodles. Their pho is PHO-nomenal (had to, sorry): my favorites are the Pho Tai, Nam, Gan (steak, flank, and soft tendon) and the Pho Ga (chicken). I also love their Egg Noodle Soup with Roast Duck, which has a wonderful, rich, complex flavor. I have also been known to order their Vermicelli Bowl (Grilled Lemongrass Beef), which is delicious and comes with a side of fish-sauce-based dressing (sound disgusting? It's SCRUMMY, IMO).   I have ordered food to go and dined in. Saigon Noodles offers friendly service and a great atmosphere for a business or casual lunch. Clearly, I have been a frequent customer of Saigon Noodles--and will continue to be."}
{"text":"Their noodles are very delicious. I tried one weekend special which is beef noodle soup. It is so good. Also, their prices are cheap. I didnt see any item that costs more than $10. This is great for a student like me."}
{"text":"The pho and spring rolls were delicious. I recommend the Vietnamese iced coffee with condensed milk. Yummy!"}
{"text":"The Pho is amazing, and that's what I usually get.  Ordered the Vietnamese crepe and it was weird and I didn't much care for it, but it's probably just a matter of taste, plus I think I was expecting an actual crepe and that was definitely not it... But did I mention amazing Pho?!"}
{"text":"They cannot substitute for anything. Which means they must cook their food from Walmart since they do not make it fresh.  That is the only reason to not just take some veggies out. They were rude and short about a simple request.  If a restaurant cannot cater to their customers small request they might as well be the freezer section of Walmart.  Food was ok but not worth the price. Service was slow and terrible."}
{"text":"Wonderful Vietnamese food!  I especially like the meatball pho (I love meat balls and sausages of almost every kind!).  This is one of the places I love to stop by on the rare occasions that I find myself on the far west side of Madison."}
{"text":"As someone who has been trying a lot of Vietnamese restaurant in North America, I would say that Saigon Noodle's Pho is relatively comparable to all other good restaurants out there, and certainly the best in Madison.I've had better ones, thus the four stars but I still come and eat here often whenever I crave for a hot, delicious pho.  I always get the one with everything in it (no. 19?) but if you are a beginner, I would suggest trying the pho with some beef steak (ask them to make it well done), flank steak, or the meatball.  Not a pho fan? You can always come here for the rice or rice-noodle dishes (my fave is the one with grilled chicken and spring roll). Not feeling hungry enough? Try to super yummy Viet spring rolls with peanut sauce (non-fried, with shrimp and beef slices inside)."}
{"text":"I have been a regular since 2005.  Great place for a quick, inexpensive meal.  Food is always fresh and steaming hot, service is quick and no nonsense.  Owner operated; she is always there morning, noon and night keeping the quality high.  Always a large group of Asian students from the UW eating noodle soup.  I highly recommend."}
{"text":"Saigon Noodle has the best pho in Madison, hands down, especially when you talk about value to amount of tasty food. It is usually packed on the weekends but the service is quick and the food is worth the wait. If you don't need the wait, come on a weekday or Sunday night."}
{"text":"Delicious pho, spring rolls, and Thai iced tea!  As good as an Pho I've had back in Seattle.  Would highly recommend!"}
{"text":"This is one of the better Vietnamese restaurants I've tried in the area. I had the spicy beef soup, and it was spicy indeed, which was great. The spring rolls were also very good. Hubby ordered a vermicelli bowl, which was quite small and lacking meat, but otherwise tasted good."}
{"text":"We moved to Madison from Toronto, Canada last winter and I was terrified that we wouldn't be able to find any Vietnamese restaurants, being Vietnamese, it's a legitimate fear! We were so spoiled in Toronto with all kinds of great restaurants and all kinds of great foods to choose from.  We found Saigon Noodle on Google and it's less than 5 mins drive from our new home. I was skeptical at first, by experience, there are a lot of restaurants that are not authentic Vietnamese owned and/or fusion. To our excitement and relief, the owner, Anne, is Vietnamese and we get to know each other.   Pho is as good as it gets and other dishes are really great, too.  My favorite is spicy beef  soup (Bun Bo Hue - a very popular soup originated from Hue , Viet Nam) served only on the weekend. There are other popular dishes that they don't serve here due to lack of demand, which I ate a lot of in Toronto and really loved. However, for the small Vietnamese population in Madison, we are soooooo happy that Saigon Noodle is here AND very authentic. They recently renovated and it's much bigger, just come before the rush as it looks like everyone in WI come for dinner lol. The service may be slow at times on the weekend but the food is well worth it. We tried 2 other Vietnamese restaurants and by far, this one is the best of all. Do try other wonderful dishes and especially the Vietnamese specialty coffee, you won't be disappointed."}
{"text":"By far my favorite restaurant in Madison. Pho is the best in the city for sure and the redesign makes it look very classy and fresh.   Service can be hit and miss unfortunately, sometimes very quick and at times very slow. While it's great to see everyone working hard it is a little distracting and irritating that they wash and clean the silverware out on the floor.  Make sure you plan your time to visit- even with the expanded space you can end up waiting a little bit for a seat. Come early and enjoy!!"}
{"text":"This is the best pho in Madison. I had pretty low expectations going into it, not trusting Wisconsin Vietnamese food, but was pleasantly surprised when I got my bowl of pho. The restaurant is clean and the service is very quick."}
{"text":"Very cheap, awesome food!  The place was also recently reconstructed.  The place looks much classier now than it did a few months ago.  The Pho is the best in town and it's only $7.49 for a regular or $7.99 for the large.  Just get the large!  It comes with bean sprouts, fresh basil, hot jalapenos, and lime.  You can't really go wrong with it.  Make sure you get one with the beef tendon.  The spring rolls are just \"okay\", the grilled chicken is very good.  It comes with a fishy sweet sauce to dip it in and it's very good.  I love this place, and wish there was one closer to campus.   I don't get to go nearly enough."}
{"text":"Cheap. Food has good quality. Service is usually good. We had bad service before but rarely. Highly recommend."}
{"text":"If you're around the area, Saigon Noodles is a safe bet for Pho. Some people love the place, but I'm not the biggest fan. The food is okay; nothing special in my opinion. However, the service is quite fast, and it's a great place for larger groups. The spring rolls are tasty, and they are made in an authentic fashion.  The portions are large, so you will not be left hungry. There are other places with better Asian-fare in Madison, but there are also places with pretty bad Asian food, so if you don't know where to go for your Vietnamese fix, Saigon Noodles is a good go-to."}
{"text":"Family favorite that never gets old. I've been a loyal costumer of Saigon Noodles since day one!  My all-time favorite is the #7 Saigon Platter (~$8) and the #63 Bun with beef and egg roll (~$9). The Saigon platter comes with an egg roll, spring roll, grilled beef skewer, grilled chicken skewer, and a fried chicken drum (or flat). I love the #7 because of the variety and everything single thing that comes with the platter is simple delicious. #63 is a classic. Bun is a Vietnamese vermicelli noodle dish with grilled beef and egg roll chunks, cucumber, lettuce, nuoc mam (a Vietnamese \"sauce\" that acquires a unique flavor with hints of salty and sweet-- a bit hard to describe so I recommend trying it yourself!).   I've also tried a few of their desserts, such as their Che Ba Mau (Tri-Color Dessert), and strawberry smoothie with tapioca pearls. The Che Ba mau (~$4.25) is traditional Vietnamese dessert with three different colored layers, hence the name \"Tri-Color Dessert\": mung beans (yellow), red beans (red), a green jelly (green), all in a sweet coconut drink. The strawberry smoothie (~$4.25) is not too sweet which i greatly appreciate. It comes with real fruit pieces and tapioca pearls (+75 cents).   As a Vietnamese-American living in Madison, it's pretty difficult to find an authentic and amazing Vietnamese restaurant, but thankfully there's Saigon Noodles! All the dishes are fantastic!"}
{"text":"Will the hostess smile instead  of looking like she will bite my head off?  Food average not good enough to excuse the lack of customer service."}
{"text":"Saigon has been one of m go-tos in all the years I have been in Madison, so I've seen them grow from the small restaurant which almost always have long wait lines to the current renovated site, which is expanded, so it is a lot more spacious and comfortable to dine in. There will usually still be a line during peak periods but it is really a whole lot better compared to those early days. Really happy about that ~~  I like their pho and their spring rolls. Usually I would get the saigon deluxe, which has all the different meat parts. But if some of those seem a little too adventurous for you, there are many other combinations available. Usually I would just order the large portion, since you get way more food for less than a dollar extra, pretty worth it in my opinion. If you go for brunch it will be a good way to last till dinner time! I am particularly attracted by the light broth which is not overly salty.  Their spring rolls bring with them a very refreshing start to a meal. Filled with vermicelli, thin pork slices and shrimps, top that off with some sweet peanut sauce. It's perfect!  Recently I am taken to their spicy beef, which is offered as part of the weekend special. That is something I'd never gotten sick of even if I have it religiously every week. I love my pho with the lemon and bean sprouts. The sprouts add a crunchy texture to the soft pho noodles. The weekend is here again, time to plan a trip back for some spicy beef ~~~~"}
{"text":"One of my GO-TO spots.  The staff is incredibly friendly and kind and the Pho and Papaya Salad are delicious!!  Those are my staples which I order every time and I visit every chance I get.  Their red pepper sauce (which is on the table) is a must have add-on to the Pho and Papaya Salad for any one who likes spice.    The recent expansion is great as seating used to sometimes be a challenge."}
{"text":"The food was fine. The crab rangoon was actually really good and the beef pho was satisfactory. Unfortunately, the guy at the counter spent the whole time that I was there complaining about other customers and swearing, meanwhile there's a little kid 5 feet away from me at another table. The place is small and you can hear every word that everyone says. He also had ABC News on the TV, so there was no atmosphere whatsoever. There are better places to get the same sort of food and I won't be back to this place."}
{"text":"Since my last review, Nifty Fifties closed (foreshadowing, perhaps?), and Saigon Noodle expanded into that space. While their pho is still mouthwatering, they shifted the rest of their menu when they expanded.  While I wouldn't say anything was bad, most of what we tried (other than the pho) wasn't as authentic as they used to make it. We tasted a definite lack of fish sauce in the papaya salad, and their egg rolls changed. Plus, their Vietnamese crepe was decidedly buttery compared to those I've tried at other Vietnamese restaurants... a flavor that overwhelmed the delicately spiced pork inside the crepe.  While it's still the best option for pho in Madison, I'd suggest heading over to Ha Long Bay on WIlly St. if you have a bit more location flexibility for the best full Vietnamese flavor experience."}
{"text":"Was very skeptical especially considering I'm in Wisconsin!  Thought I'd give it a try despite it being really out of the way to my destination.  But the restaurant name was funny so I went for it.  No lie...best pho I've had from here to LA.  Normally I need to doctor it up quite a bit but it was good untouched.  I did however mess with it because I needed my lime sriracha and fish sauce fix ;)"}
{"text":"The best pho and Vietnamese food around. The spring rolls are the best I've ever had--the sauce is perfect. They can get pretty busy, so try to go at off hours if you want to avoid the line."}
{"text":"Excellent food and very good prices. Hours aren't great so make sure they're open before you go.... but if get there and they are closed DO NOT go to the Thai place just the west."}
{"text":"I like the Saigon Noodle a lot, I have tried the #66 (which is my favorite), for those who haven't tried it yet it is a bowl of vermicelli noodles seated on top of a nice refreshing salad with chopped romaine lettuce, cucumbers, Brussels spruts and basil, it has grilled shrimp and crushed peanuts, I love all that combination! I have also had their chk noodle soup and it has a nice flavor except for the fact that the chk it's very chewy, I suspect that after they boil it they pull the end of the meat that it is on the bones and throw it on the soup, if you don't mind that, u can try it. I like the same version of the 66, which is the #42 but with rice instead of the noodles and pickled veggies. The egg rolls are good. Sometimes the grilled shrimp taste like if they were marinated for too long or the noodles are little bit hard to chew. The thing they need to work on its on their customer service, most of the servers don't smile or pay attention to you, besides, whenever you place an order over the phone they say 25 min and when you show up they make you wait for 10-15 more easily and I don't like that at all. I think since they renovate the restaurant their customer service has been worse."}
{"text":"Only place I could find within walking distance from my hotel.  It's ok. Food is not horrible. I found the pho broth a bit salty and the spring rolls dry.  Place is clean and staff is attentive."}
{"text":"So refreshing to have an authentic Vietnamese restaurant in Wisconsin. The food is excellent - even my toddler daughter loves everything she's had here and requests to come back regularly. Being from California, we get spoiled with good Vietnamese food and this place is as good as my hometown joints. The service is nothing special. They are often too busy to pay any special attention to customers but I never let this distract from our experience because the food is so good. There are a lot of staff and each portion of your meal is brought out by someone else so it's hard to build any rapport with your waitstaff. They work to get you seated and served as quickly as possible. There is often a line of eager customers at the door waiting to be seated, a good sign that at the food is excellent. Come when you have time to wait in line so you aren't disappointed."}
{"text":"We enjoyed our meal.  My spouse is in a wheelchair so parking and getting in through the double doors was a challenge but worked with a little help.  We ordered fresh spring rolls (very good), chicken skewers (excellent) and a papaya salad (not so good).  They use a manufactured pressed chicken loaf so it can be thin sliced ... which is a bit off putting. Not bad, we'd go back, but not great either."}
{"text":"I  absolutely love this place, and I've been coming here for years!  Best pho around.  Beef Stirfry with the rice noodles is also one of my favorites and don't forget the tricolored sweet dessert."}
{"text":"Great lunch prices, fast service, and delicious Pho and Spring Rolls for a quick weekday lunch stop. The server I had was very efficient... I received my spring rolls in under 2 minutes (it seems like everyone in the restaurant ordered them, so I'm guessing they are rolling them fairly often... or they had pre-rolled several that morning). The peanut sauce served alongside the rolls is delicious. Not too peanut butter-y, but it had just the right touch of hoisin and spice to be sweet, savory, and not too thick.  The pho did not contain as much steak or meatballs as I would have liked, but the broth was delicious, and the noodles were perfect. I really enjoyed my dish.   The only reason I don't give them 5 stars is the lack of meat in the Pho.  I would definitely stop here again when on the West side and craving some delicious Vietnamese. I want to try their Bun next time!"}
{"text":"I've definitely had better Vietnamese food but Saigon Noodles is probably the best you'll find in the Madison area. We always come here for the pho (#20 Saigon deluxe) and a couple of my kids love their grilled pork over rice. They must put MSG in the pho broth because after eating it I always get very thirsty and have a slight headache the rest of the day but I don't think my other family members are affected as much. The decor is nice and clean. They do get really busy during peak meal times so be ready to have a short wait and don't expect stellar service. However, food is delicious and well priced."}
{"text":"Every time I go to Verona for training, I just go to this restaurant to have dinner, no surprises, authentic enough. you can't expect much in that part of the country. For an Asian like me, they are good, good noodles and good rices,  good rolls."}
{"text":"We had papaya salad and two pho.   + good taste, good service, fresh food  - regular size is a smallish portion"}
{"text":"This is my favorite place for noodles in Madison. I go fairly regularly and always order the beef pho. I've tried to branch out, but the soup is so yummy and crave-wothy I never tire of it. The spring rolls are also super good and very fresh. I prefer the vegetarian as they are loaded with cilantro. I always leave happy and full!  The service is great, even when it is busy (which it often is)."}
{"text":"I ordered the deluxe pho which included variety of meats.  I thought the meat portion was a bit skimpy but it tasted good.  I had the summer rolls.  It was not very big and the shrimp to pork ratio was a bit off as well.  I wished they had a couple of more shrimps to make the roll better."}
{"text":"All time favorite!! Best pho. I have tried pho from many restaurants in Madison, nothing can compare to Saigon Noodles. Sad that I have moved too far, but first thing I want to eat when I am in town is pho here."}
{"text":"Wonton soup and a Tsing Tao after a long day of work.. Can't beat it. Best dinner ever."}
{"text":"Love, love LOVE this place.   Down to earth, friendly staff, good flavors and reasonable prices. We have not worked through much of the substantial menu yet, but the pho and many of the rice-based offerings are solid."}
{"text":"Delicious!  I got Pho Ga, and the broth was very flavorful.  The rice noodles were cooked perfectly.  I really liked the fresh veggies that were served alongside the dishes (bean sprouts, Thai basil, sliced green chilies, cilantro, lime wedges, etc.).  My only gripe was that the chicken meat was very tough.  My husband got Pho with beef and he really liked it.    The wait staff was polite and the food came in a timely manner, even though the place was moderately busy (~6:00pm on a Saturday).    The set-up of the restaurant was also nice.  There was ample seating and the tables were arranged in such a way that you were comfortably far enough away from the next table.    I'm excited to go there again and try something new!"}
{"text":"Nothing beats a bowl of hot pho with beef and steak on a cold winter afternoon.  I have been to this place more than 20 times.  And the bill has never been over 12 bucks per person for a meal and beverage."}
{"text":"so I don't think this is very good EXCEPT FOR THE CHICKEN (but more on that later) - but I'm Asian, I live in Asia, and I've been to Vietnam, so I'm not really the targeted demographic here. BUT this IS wisconsin, and so this place makes for an exotic option.   if you want pho and don't have a handy Vietnamese chef in your kitchen, get a passable bowl here. portions are quite large, and they have a proper menu full of rice-flour derivatives like stuffed crepes and noodles. flavours could be fuller bodied and a little less salty (I'm still not sure I didn't detect MSG) but you know what - I think it makes a great choice in Madison, where much of the food is (expectedly) American.   I also had the mango salad, which was a tad too sweet but otherwise decent for a plate of Asian-tasting greens.   what you MUST try, however, is the delicious grilled chicken. marinated beautifully and grilled with some char, it comes smoky and tender and SO TASTY. best dish in the house."}
{"text":"This is probably more of a 3/3.5- Based on the other reviews I feel that I should like Saigon Noodles more but I've been twice and neither time has left me impressed. The first time I went was a Sunday at around 3 pm, so at a very off hour, but there were still a surprising number of people there. The second time I went was on a Friday at around 6/6:30 and the line was out the door so it's clearly a very popular place. The food was fine both times but nothing that memorable or special- I'm not sure if I'm ordering the wrong dishes or my expectations for Vietnamese food in Madison are too high. One thing that did stand out though was the peanut sauce that came with the spring rolls- it was incredible so I definitely recommend trying that sauce. I got the #18 pho which tasted good (even better after adding in the chili paste and hoisin/leftover peanut sauce) but there were very scant amounts of meat in it. I'm not sure if this was because they were extremely busy or that's the normal portion, but the noodle:beef ratio seemed too high. This is some of my friends' favorite place for pho/noodles in Madison so I'll probably be back to try other items and see if that helps me understand the hype."}
{"text":"This wonderful restaurant received a baffling unknowledgable review in the Sunday State Journal.  I've been going there for years, love it, and have never taken a friend who didn't love it.  It's packed w/Asians consistently, which speaks to its ethnic excellence.  The vermicelli bowl is scrumptious.  I like reviews and reviewers, but this one was dead wrong."}
{"text":"This place sells authentic Vietnamese food, however, the flavor is lacking. I thought their Pho broth was very lacking in spices (anise, coriander, fennel seeds) or if they didn't boil their broth long enough to get the deep flavor of the beef shin. But nonetheless, this place does the job of satisfying my craving for my mom's traditional Vietnamese food every now and then."}
{"text":"Food's good, but service can be both unfriendly and slow.  Worth going as good is great."}
{"text":"This place is great! I only wish they had another location closer to downtown. The pho is stellar."}
{"text":"Inexpensive for a big bowl of noodles, and despite the variation from time to time, it's solid on the whole."}
{"text":"The recent renovations are great but has the service gotten worse? It took an hour for us to get our food. The simple pho I ordered had one piece of meat. I was disappointed cause usually this place is great. I hope it was just a bad day."}
{"text":"I am a regular here. Everything on their menu is good, including Pho and other Vietnamese dishes. Way better then Pho Nam.  Highly recommended if you are in the mood for some Vietnamese food."}
{"text":"Love the beef pho with meatballs! Also the crunchy egg rolls are delicious with the sauce they serve."}
{"text":"Have been here multiple times, and I have gotten a different pho everytime.  The thing that is great about vietnamese restaurants is even when it is crowded, the food that they serve is meant to be eaten and produced quickly, so there is never too long of a wait.  The regular beef pho witht he round steak is good, but seems a bit lacking in complex flavor.  I've also tried the beef pho with tendons which was the same taste as the regular but with nice large chunks of gelatinous tendons, definetely an aquired taste/texture.  By far the best pho i've had from saigon is the combo of regular sliced round steak and the \"overcooked\" flank steak.  While it is definetely well cooked, the tender flank steak adds a depthness to the broth that is just not accomplished with the regular beef. Having eaten some of the most authentic vietnamese pho in san francisco and living in Los Angeles I can say that Saigon noodles is as close to real pho that youll find in madison.  Service is \"get you in and get you out\" which i happen to like at a spot like this, now if only they had real imperial rolls..."}
{"text":"Love the beef noodle soup! Very good place to get yourself warm and comfortable. It could be a little bit noisy with soooo many babies and kids, but it'll be fine once you get used to it."}
{"text":"Great bun (\"dry bowl\"), seems fairly healthy but mostly I like it for the flavorful beef slices.  Also the spring rolls and sauce are great.  Can be a bit loud inside and a line of people at popular dinner times."}
{"text":"We visit the Madison area occasionally and when we do I like to stop here for lunch.  The food is fresh,  delicious and  the whole family loves it. It's a busy place so you might have to wait a few minutes for a table.  It's worth the wait! The staff is very efficient which keeps wait times to a minimum. We'll be back  the next time we're in town."}
{"text":"Pho pho pho! So good! Only thing we get from there and it's so good. In the winter we get once a week and anytime were sick! Yum"}
{"text":"I only walk in the door and say #21 large...special pho with everything including tripe and tendon. Fantastic flavors. I also sometimes hit their weekend specials and really like the crepes. Great service and I love the place."}
{"text":"Good food! I had a crispy crepe filled with bean sprouts, cucumber, chicken, and small shrimp. The sauce was a sweet vinegar. The dish had a pile of Thai basil (good if you like anise) to add to your crepe if you choose. My son had steak Pho. He liked it. The restaurant was clean and relatively quiet, considering the number of people here. I would come again!"}
{"text":"Pho or a vermicelli bowl; both are comfort food, and thankfully, my soul is restored after my visits to Saigon Noodles. The new remodel has really changed the atmosphere, and the food remains outstanding. Just give me more tendon and tripe in my soup."}
{"text":"Excellent spring rolls, peanut sauce is the key!  Also tried my friends steak pho, will definitely be getting this next time!"}
{"text":"The Egg Rolls and the Pho were very good!"}
{"text":"I visit here almost 2-3 times a month and rarely order anything other than the Pho. The Pho noodle soup is very good although I really don't have another place to compare in Madison.  Recently I tried the sizzling crepe, and also did a vegi/tofu bahn mi sandwich take out. The sizzling crepe was so-so compared to ones I have had in other Vietnamese restaurants. I would have appreciated more veggies and there were no bean sprouts. I was very disappointed with the bahn mi sandwiches. The proportion of the filling and the bread was way off. Way too much bread. I could barely detect any sauce and the tofu was flavorless. I can make a better bahn mi sandwich myself. I will just stick to the Pho soup from now on. One star for the ban mi, three stars for the sizzling crepe and four stars for the Pho soup."}
{"text":"As an Asian person I didn't find the food very good. The portions are small and the pho is lacking in taste. In my opinion Madison has very disappointing Thai/Vietnamese food. A lot of white people do seem to enjoy the food here so if you're white come and if you're Asian seek another place :)"}
{"text":"The best place in town to get your fix of Vietnamese food!  Hands down!  The bowls of pho isn't a majority of broth like most places in town.  Lots of meat, noodles and veg just how I like it.  Everything on the menu is delicious.  Very clean.  Professional and quick customer service.  Also, one thing I look for in any Asian restaurant, being an Asian, is that there are lots of other Asian customers in the restaurant too, which there was and is a good sign!"}
{"text":"Hands down the best steak pho in town.  I dream about the savory broth and noodles.  The steak is tender and in small enough pieces to gobble up as fast as possible.  The spring rolls are light and the peanut sauce is on point.  The thai iced tea is perfectly sweet.  Order take out and skip the lines at lunch. It is good for my waistline that they do not delivery."}
{"text":"Very solid Pho, which I crave in the winter all the time, so I will be back...My one beef is that they only sell their bahn mi to go...after driving across town to try their bahn mi a while back, I was told that I had to take it to go...odd...they might want to be a little less rigid on that one..."}
{"text":"I'd give the Pho a 3.5 star.  I had a large Pho Dac Biet (combo).  The pho broth was ok (3 star).  It wasn't bad but wasn't the best I had either. The portion was the equivalent of a small (- 1 star) that I am accustomed to in Houston where we have many Pho places.  I liked how the combo already had meatballs and the meat tasted fresh.  Just wish there was more meat or noodles in the large bowl.  The sever looked at me confused when I ordered in Vietnamese, that should have been my first hint the Pho might not be up to my expectations (-0.5 star).  I didn't try the other menu items so I can't comment on them. I would expect the Pho to be their specialty being a Vietnamese noodle shop.  Place doesn't accept AMEX so corporate cards maybe an issue for corporate travelers."}
{"text":"So I will start by saying I haven't tried other places in Madison, however..... I've had Pho in many places around the US and Canada. This place ROCKS!!  The Pho is absolutely amazing and very tasty. If you like tripe, it is expertly prepared and so tender. I would highly recommend this place to fellow Pho seekers."}
{"text":"Phó was decent but what they lack is the customer service. They seem to forget when I ask for more water or napkins. And when you remind them they give you the cold shoulders. Will not be returning."}
{"text":"I can say this place is the best Vietnamese restaurant in Madison area! I had to try a couple of other vietnamese restaurants near Madison during its renovation construction. I realized that I must thank Saigon Noodle for its great food.  Now no longer waiting too much in line with the recent renovation."}
{"text":"Great quality, good portions, excellent value!  One of my favorite places in Madison for Pho noodles and Vietnamese spring rolls."}
{"text":"Saigon noodles is probably my most favorite pho place in Madison. I love how their food is so nicely priced yet so filling! The broth is tasty and flavorful. The noodles really soak up the flavor.  They give a nice amount of bean sprouts and basil and jalapeños which is awesome! I feel like this is very authentic pho (although I'm no pho expert). I've had their Thai tea too which is delicious. A bit on the sweet side but still great nonetheless. Service is awesome and quick and attentive. Love love love Saigon noodles!"}
{"text":"Love love the pho here!  We like to come on the weekend and get their spicy noodles specials too.  The prices have give up,  but nit incessantly enough to make you think twice about getting a big bowl of piping hot noodles.   We've tried their other menu items such as fried rice and stir fries,  but nothing compares.   Be sure to get the spring rolls!"}
{"text":"Of the half dozen pho places (coast to coast) I've been to this is my favorite pho to date. Do yourself a favor, order #21 and try the broth as served. Needs nothing. I did play around and added to the broth. $8 and couldn't finish it. The spring roll was also the best I've had. The sauce served with the spring roll was the only food I wouldn't highly praise. Do yourself a favor, go."}
{"text":"I had high hopes bases on the Yelp reviews I read, but it was really just ok. I had spring rolls (4 stars) and pho (3 stars). I really just wasn't blown away."}
{"text":"I had the \"Saigon Deluxe\" Pho, with all the goodies in it, and the chicken skewers. The broth was an amber color coming out, which wasn't normal for me, because when I lived in Wausau, the broth was clear, but you had beef paste on the table to add to it. I think they just added the paste for you already. Perhaps the difference was in the fact that Pho was sold from Hmong restaurants vs Saigon being Vietnamese. It wasn't a big deal, as it was very delicious.  Only 2 downfalls which caused me to rate it 4 stars. First, their hours are confusing, and sometimes they are gone for weeks at a time. Second, is that I'm not a tea or coffee drinker. I generally drink a clear soda, but there were no refills. It was $1.25 for a can of soda and a glass of ice. I highly suggest a fountain machine, because not only will it knock your soda costs down, your patrons will appreciate the refills."}
{"text":"The service was terrible we have to wait for 45 minutes for our Pho. I make pho and I know it doesn't take this long especially when you're already have the broth and everything else.  Once we finally got our food it  was very good."}
{"text":"FAV Madison restaurant! So fresh, always consistent, and amazingly delicious! Thank you Saigon Noodle."}
{"text":"I'm a huge fan of Vietnamese food. Literally every new place I travel to I look forward to banh mi, pho, bubble tea, and my favorite vermicelli and meat dishes.   Decided to order take out for my first experience at this restaurant because the house was packed on a Friday night. Ordered lemongrass beef with vermicelli noodles and iced Vietnamese coffee with condensed milk. Super disappointing. First off the meat was red and I'm referring to food dye. There was no flavor of lemongrass whatsoever. Stingy portions! Every other Vietnamese place I've been to in my lifetime gives you a great portion of noodles, veggies, and meat. I couldn't even find the cucumbers at the way bottom - maybe 5 small thin slices. The Thai basil didn't mix well with this dish either.   Ordered Viet coffee with condensed milk. Talk about diabetes in a cup. I've ordered many Viet coffees and I know how to make the drink. Way too much condensed milk for an iced coffee that was 12 oz. The best part of ordering this type of coffee is to actually taste the strong brew that will make you grow chest hairs.   The good stuff - the fish sauce. It was flavorful in abundance and I could see the fresh pepper. That's about all. Not sure if I'll be back to try other stuff...it wasn't worth the price."}
{"text":"One of our favorite restaurants in Madison, we probably go there once a month or more.  The pho is awesome, as are the crispy vegetarian egg rolls."}
{"text":"So I came into town to get one of my favorite dish pho. The place was packed and I thought this might be really good! Oh how I was wrong. The pho tendons were too stiff and tasted kind of rubber. Also the noodles weren't very good either. The broth was ok I guess.  This was on the bottom of my list of pho places, but it can be that I might be very picky since I am coming from a place where they have awesome pho."}
{"text":"Had the Pho with the tripe and the tripe was cooked very well which always bodes well for a Pho establishment.  The clear eggrolls which were also quite delicious.  The service wasn't anything exceptional but the food is quite delicious.  Definitely will go back to try some of their other options."}
{"text":"I ordered a beef pho and it tasted really good. Regular size is big enough for me to get full. And they provided a lot of bean sprouts that you can add to the pho."}
{"text":"So good. I have eaten here repeatedly and the food and service are consistent. Quick and inexpensive."}
{"text":"I've lived in Northern California for the past 3 years where pho places are a dime a dozen. This place is still my all-time favorite. I come back about once every year and the taste is still like I remembered. Maybe there's a hit of nostalgia here, but at the very least this place is the best you can hope for in a city with a relatively low asian population like Madison. IMO it's at least on par with, if not better than, the best noodle houses I've been to in the Bay Area and Sac. You should feel lucky, Madison."}
{"text":"Authentic Vietnamese cuisine in Wisconsin...yeah I know who would have thought.   A bit pricey compared to Southern California prices. Bowls of pho come out very small even though they advertise x-large. Spring rolls are fresh. Service is quick."}
{"text":"This is one of my favorite places for lunch. I'm a big fan of their noodle salad and the pho. Love, love the spring rolls.  When I'm feeling like a treat I'll stop by and take out an order of the spring rolls and the \"special\" bahn mi. Everybody likes this place and It can be insanely busy at times."}
{"text":"Delicious pho, service can be weird sometimes but otherwise it is on point.   Weekend specials are worth a visit, the spicy beef soup is great. They ask if you want the bone in, but sometimes they give you cartilage which is tastes, other times you get a large bone and less meat."}
{"text":"After a disappointing visit at another Viet restaurant in Madison, we didn't have high expectations for Saigon Noodles.  But, since we were close and was tired of cheese curds and burgers, we came her anyway just to break away.  Boy, we were sure glad we did!  We ordered the special pho, bun bo Hue, iced coffee, and a durian shake to go.  The pho and bun bo Hue were on point.  The first thing we liked was that the staff actually spoke Vietnamese so we had a chance to converse with them.  The pho had just the right amount of noodles and beef with a flavorful broth through smell and taste.  The bun bo Hue was also captivating in smell and flavor without being too spicy or too heavy on MSG.  Very good noodle soups that hit just the right spot for us.  Definitely get the durian shake for a dessert and enjoy a taste of South East Asia.  Overall, we were very happy we were in this area for this restaurant.  too bad it's far from downtown..."}
{"text":"My go-to place for pho! Always crowded when I go, but the service is always good. I like their large menu and I have tried the pho, vermicelli, spring rolls, and fried rice. I think this place has the best pho in Madison. Reasonably priced, too. Feels much like the casual pho place back at home (in LA)."}
{"text":"I don't understand the negative comments earlier posters have made. I've been eating here since the day they opened and have always been very pleased (and now very glad they have doubled in size). Yes, a couple of their waitresses aren't the friendliest but they are always busy and it is not a big deal for me.  I used to live in the Vietnamese section of Garland/Richardson, Texas and had 10 Vietnamese restaurants within 4 miles of my house and the Pho, Bun and Spring Rolls here are the equal of anything I had in Texas. My only complaint is I wish the Bun was a little larger.  There is a reason they are always busy. When I have friends in from out of town, this is always the restaurant I recommend."}
{"text":"Food good and service was super quick!  I really wanted the beef pho but unfortunately it was only a weekend special. Not super impressed."}
{"text":"The food was bland. Especially the pho. The pho was tasteless and did not have any flavor to it. Stopped by here on the way back to Milwaukee and was very disappointed. The service was horrible. We had 5 different waitresses, which I hate when there are more than one person serving me because I wouldn't know who to tip. Doesn't matter anyway, because the girls were not friendly and didn't have good customer service skills. We never got refills on water until we finished eating. We never got our check and waited 15 minutes for it, and still no one came so we had to go up front and pay. Never will I come here again. I should have just gone to the thai restaurant next door."}
{"text":"Man, I'm going to pick on this place more than it deserves.  The spring rolls were great, and the pho was standard fare although the broth was a little weak in terms of beef flavor.  Plenty of noodles and tripe makes me a happy camper.  The decor is too modern.  The place is too large.  I guess I'm used to grungy places that serve up the most delicious pho this side of the Pacific.  Large and open space with okay pho I'm less down with.  I was almost uncomfortable slurping my noodles in this environment!.. I guess that's the curse of being in a strip mall.  Worth the trip.  As long as you spice the pho up with chilis, sriracha, lime and black pepper, everything is A-OK on a rainy day."}
{"text":"This place always pleases!  In a city of many fine Asain restaurants, this one serves the best pho and spring rolls.   The vermicelli bowls with an egg rolls is also addictingly wonderful! I wish I could tell you more but I'm stuck on the few dishes I must have on every visit."}
{"text":"Interior design is nice. Had the pho and so far this is the best place for pho, except for at home."}
{"text":"Just for not being open on Monday's. How can i eat here everyday when your closed?"}
{"text":"If you know what pho is supposed to taste like, this ain't it. Broth is watery and portions are small even when you order a large, it's like getting a regular. For a place that's supposed to specialize in pho, they sure aren't meeting in standards. Go to Nams Noodles instead!!!!!!"}
{"text":"The veggie egg rolls were wonderful!  I had the Asian noodle fish soup...delicious..."}
{"text":"Best phô I've ever had. Hands down. Better than any other place in Madison. The broth is deeply infused with so much deep flavor; the soup will satisfy your soul! It's a total steal at $8 for a giant large bowl. Do yourself a favor and get the large. You won't regret it!"}
{"text":"one of my favorite in Madison! The pho is very well prepared and warm me up especially in a windy day. The spring roll is strongly recommended as well. I don't like durian smoothies as much as others, maybe because they put too many pearls inside and pearls stuck together. And the durian taste is not that strong. But in general, I love the pho here. I ordered Saigon diluxe + spring roll + durian smoothies for $19.25 in total. The food worth it's price."}
{"text":"Love stopping by when hanging out on the west side of town. The food is delicious and packed with all my favorite flavors. Depending on when you stop in, the place can get really busy and there can occasionally be a long wait, but its completely worth it."}
{"text":"Saigon never disappoints! I've only ever gotten pho, but honestly if I could eat it every day I would. I've had a friend get the stir fry before which she also enjoyed very much.  Very welcoming atmosphere and always quick service. Every person that I've introduced to Saigon has always ended up loving it. Definitely a place you should check out if you want some great pho!"}
{"text":"Nothing hits the spot if you are stopped up with either a cold or sinus trouble. I've been to Saigon Noodles in the past & always turned to the beef pho. No more. I have found my new favorite- Number 24, Rice Noodle Soup with Fresh Vegetables (it includes tofu). It is not greasy or salty  (Mileage may vary on the salt thing, it wasn't salty to me, it might be to someone else). Not to get too gross, but if I was suffering from a stopped up nose, I would have this with some of the chili sauce on the table and leave feeling unclogged and happy. This will be a godsend for our family during the long winter months ahead. We went in on a late Friday afternoon and it was blessedly quiet, but they do quite the business on the weekends and at lunchtime."}
{"text":"Unfortunately the options for Vietnamese food in Madison is disappointing. Given this fact, Saigon Noodles is only okay. I've had their pho here and its good, nothing special, nothing horrible, basically just a-okay. The fresh spring rolls are disappointing, small and not that tasty. They are basically one of the only options for vietnamese sandwiches but you can only get them to-go. I've had other things but again nothing to really write about. Overall food is only average but they are located near the mall so its convenient."}
{"text":"This is my new favorite pho place in Madison. The broth is good, and the portions are reasonable. Their vietnamese coffee is premade and does not come with the press on top, but it's still pretty good.   The ambiance (lighting, pace, space, and decor) was comfortable and pleasant enough that I commented on it multiple times during dinner. At 6pm on a Sunday, the place was full of couples, families, and friend gatherings, without being over-crowded.   It's the only place in Madison that makes the tri-color dessert the way I like it - with lots of jelly and coconut milk, and not too sweet."}
{"text":"Saigon Noodles was a recommendation that was from my Fitchburg friend and her husband. I had mentioned that I was a Pho junkie and he was like, I know of a place we know if a place we normally go to. It was also bookmarked in my Yelp tabs too, due to the awesome positive reviews about this place, so I just had to say yes to the proposition. Located in Fitchburg, off the Hwy 12, this restaurant was partially full at 8pm when we came through. The place closed at 9pm daily, so I'm glad that we got in and made it happen.  They had private parking, although they probably do share with other businesses in the vicinity. The place was relatively large for a Vietnamese restaurant. It was upscale in a way of its size and decor, but still serving Pho, classic vietnamese dishes, and other delicacies of the region. The service was quick and expedited as normal. The entire process of ordering and food to table was about 10-15 minutes, which was not bad at all. What I liked about this place was the fact that it seemed very inviting and homely, while keeping up that upscale ambiance that works pretty well.   I just went for the usual combination Pho, but large and extra noodles, with a side order of spring rolls. The broth of the Pho was ok and good, although it could have been more deeper. The large bowl was pretty big, almost like an XL bowl, if it ever was. The spring rolls came first, which I doused in the chili sauce into the peanut sauce. The spring rolls seem to be chilled in the refrigerator and not freshly hand made. Oh whatever, but I am just picky that way. I ended up being super bloated and full, but it was well worth the effort.   The service was good overall. The prices were consistent with other Pho restaurants I have been to, but I do discover that Vietnamese restaurants up here tend to be cheaper than that of ones in Hawaii, where I am located. In some Hawaii spots, pho can go as high as $10 a bowl, which can get crazy! They take visa, MasterCard and of course, cash. Recommended if you are here in this neck of Fitchburg and craving a good bowl of Pho or other classic Vietnamese dishes.  Support local!  B+"}
{"text":"I come for the pho, Its the best in madison. Other items are ok but I always come back for the pho. Service is good and the interior is subtle. Cant go wrong with pho at saigons!"}
{"text":"I love this restaurant on two levels:  1 - I'm used to getting pho in Cupertino at the all-Vietnamese strip malls.  Saigon Noodles would fit right in.  They might not have two pages of pho combinations, but really, I don't think the clientele would go for some of the funky junk they put in there, anyway.  It's all about the broth and they've got good broth.  2 - My dad goes here a LOT, like, the owner knows him by name.  My dad is older than dirt, uses a walker and needs a lot of TLC.  She gives it to him every time.  He's treated with respect and care and for that, she gets 10 stars!"}
{"text":"This has become my favorite pho place in Madison! Came here on a Sunday at 2pm and it was PACKED! You know it's good when the place is filled with Asian families. The service was fast and friendly...but we all know we go to these places for the food right?  The pho was delicious. The broth was tasty and not too salty. It came with your standard jalapeno peppers, bean sprouts, and cilantro. The large bowl came with extra noodles and was very filling.  Huge fan, repeat customer, highly recommend!"}
{"text":"A hot bowl of good pho for a wet cold day.  Saigon has the best pho in madison, imho. Why you might ask? Because I just said so :-)  Seriously, I have tried many bowls of pho across the US and in Singapore. The one place I have yet to digest an authentic bowl of pho is in Vietnam.   Pho is simple to make - soup, meat and middles. Throw in a bunch of basil and bean sprouts, green chili and a squeeze of lime and you got a bowl of pho. So what differentiates a good and bad pho is the soup. Granted I have been to places that messed up the noddles and that is just lousy cooking.   The soup at Saigon is light, clear and tasty. Perfect most days and when it is off, it is easily corrected with a cup of hot water, I.e salty on some days. Good pho stock must be cooked for more than 10 hours using beef bones and Saigon gets their supplies from down the street, at s grocery store I frequent. I trust the quality.   Fast service means you can get in and out during lunch. Pleasant staff too. Ann (the owner) is always so cheerful.   Come on in for a nice bowl of authentic pho. Other dishes to try are the vietnamese rolls and crispy egg rolls. The former is rolled nice and tight. You don't find that everywhere."}
{"text":"If you're hungry and have a lot of time to kill, then this is the place for you.  I'm usually not a stickler when it comes to having to wait for my food, but this is pho for god's sake. You just boil some noodles in some broth. There's no reason why that whole process should take more than 30 minutes, unless there's some secret Asian cooking method that I'm missing.   But despite all that, their food is absolutely delicious. Their pho is extremely fresh, and their meat actually differentiable. My favorite part has to be their steaming broth though. Usually I just douse my soup with sriracha until it's red, but this time, the soup was flavorful enough on its own.   Oh and they also offer a variety of freshly made smoothies, so be sure to check those out.  If it weren't for the slow service, this place would definitely be a 5."}
{"text":"We visited Saigon-Noodles on a wintry Sunday evening. As soon as we opened the door, the fresh spicy aromas delighted our noses. The restaurant was bright, open, and full of patrons. Our waitress brought us menus and seated us immediately.  Perusing the menu I encountered numerous dishes I wanted to try. We decided to try the Vietnamese Steamed Rice Rolls and I ordered the eye-round steak, flank-steak, and meatballs. Our waitress returned momentarily to take our order, and it was not long before the appetizer arrived. The plate was covered in what was basically a light veggie salad and covered with bite sized stuffed rice rolls. The stuffing was a mixture of pork, onion, and mushrooms inside Spring-roll wrapper. Dipped in the accompanying sauce they were delicious! We cleaned the plate down to the last bean-sprout.   The pho was served with the usual bean-sprouts, jalapenos, lime, and basil accoutrements. The table had soy, fish, vinegar, spicy chil and sriracha sauces available to add. The meats in the pho was perfectly cooked. The pho broth was good, but it lacked the complex depth of flavors I expect from pho.  I will definitely go back again. The service was good. The price was good. And as I looked around the room I saw numerous dishes I would love to try."}
{"text":"Yum!!!  Great fresh, flavorful food.  Nice atmosphere, good service."}
{"text":"This is definitely our go-to place for Vietnamese food.  The owners and waitstaff are great, although like so many others have said, I hate the loud dish banging when they are clearing a table."}
{"text":"One word, pho. Everything is good but the pho is to die for. We have three kids under the age of 5 and they love this place too. They eat the soup, and love the egg rolls and beef skewers. It's always busy which is a testament to the quality and authenticity."}
{"text":"My go to place in town for banhmi sandwiches. It's a bummer they don't serve it while dinning. These sandwiches are for take out only. We make special trips just for that and it's so worth it. We also love their special weekend only additions like spicy beef noodle soup. Their special fried rice is always a hit as well."}
{"text":"Their spring rolls are the best, very very fresh tasting and the sauce that come with them is insanely good.  I tried their Wonton soup at the waitress suggestion and it was also very nice.  The broth was very tasty and the dumplings themselves were also great, not too salty.  I've not eaten my entire Deluxe Noodles yet (with Rice noodles) as the soup was a bit heavier than I bargained for but I can say that from eating about half of it that it's superb.  It's filled with various meats, shrimp, seafood and plenty of large, flat rice noodles.  This is a great place to go to get a bit different Asian cuisine, one that's much healthier than 99% of the Chinese and Japanese places you will find out and about.  I like Vietnamese because they don't fry everything like the other Asian places tend to.  Very highly recommended.  I only rated 4 stars instead of 5 as they weren't quite as great as a place I used to frequent in Richmond, VA but then again few restaurants are as good as that place."}
{"text":"Papaya salad and the sliced beef Pho with extra meat is where it's at. This place will not disappoint if you get the papaya salad as a starter (perfect size to share for 2) and the Pho.  *not open on Mondays*"}
{"text":"If you're Hmong and you had a rough night of drinking you do not even need to call your friends to know that everyone will rendevouz here the next late afternoon to nurse those hangovers with a steaming bowl of pho (#14 large which includes everything from tripe to tendon, meatballs, and beef flank).  If you're not Hmong and you're not Asian you might not be able to tell that this is only mediocre Vietnamese cuisine.  If you're Asian and you eat here, you are probably an international student and you eat your pho with a lot of fish sauce.    Bascially, the only safe thing on the menu here is the pho.  That and Lao Beer."}
{"text":"This is one of our favorite places to eat when shopping in Madison.  The vermechilli bowl - lemongrass pork and egg roll is my favorite.  Don't forget to order wonderful spring rolls.  They are a work of art!  They are made with  fresh basil and  accompanied by some yummy peanut sauce for dipping.    The food is consistently very tasty.  Unfortunately, prices have gone up and service many times is lacking. Vermechilli rice bowl,  spring rolls,  and hot tea for lunch was $18. A bit steep!"}
{"text":"Three years later, have moved away but was back in Madison and decided to stop by this place again.  Same quality of food.  Nicer ambiance now that they have expanded and remodeled.  I just wish there was better Vietnamese food in Madison."}
{"text":"They've been mentioned in other reviews, but, seriously, holy cow -- the spring rolls!! Two full jumbo shrimp are rolled up with a bunch of other good stuff, and the sauce they bring out with the spring rolls is just incredible. I was literally eating the spring roll sauce with my spoon!  For her meal, the fiancee got the bun yum, and really liked it. I got the steak and rice, which was OK, though pretty boring. Luckily, they brought out some of that magical neon-orange sweet & spicy sauce that makes everything taste better, and then my meal was good. Neon-orange sauce notwithstanding, I'll order something different next time we go (yes, we'll definitely go again)."}
{"text":"We used to eat here on a weekly basis and then the prices on everything started slowing going up 50 cents at a time. So we eat here maybe every two weeks instead. The last time was earlier this week and there wasn't much to be disappointed except the quantity of noodles of a large bowl seemed a bit smaller than usual. Very rarely do I get a bowl with mediocre broth. I hardly ever feel the need to add hoisin and cringe when my hubs does so.  Service is usually fast and we have the same waitresses who know we like to order right away."}
{"text":"Great food, but the terrible service will keep us from returning. No one checked on throughout our meal, no one offered to refill our water, no one asked about boxes. I had to ask the manager at the front to bring out check. She barely looked at me."}
{"text":"I always get the pho and the spring rolls.  I've been there several times and have yet to venture to a different part of the menu because my usual order is just that good.  The best spring rolls around, and the food is pretty affordable as well compared to the other ethnic food places in the area."}
{"text":"For about $18 (with tip), I got Pho, a banh mi, and spring rolls. I waited quite a while for my order, but the food was made to order, so fresh and so delicious.  The broth for the Pho was complex and perfectly spiced. The banh mi was fairly large compared to what I've had before, and the spring rolls were fresh and vibrant.  Overall, a great meal. The place is obviously popular since it was packed, with people waiting for seats and for takeout."}
{"text":"Very clean establishment, fast service. I did enjoy my pho. Good for Madison standards wish I had more meat and noodles for ordering a large bowl. Used to the portions in San Jose cali little Saigon. Decent price overall a good experience. Wish I took a photo but I devoured my food before I remembered."}
{"text":"Pho Nam was closed and I needed noodleage. So I tried Saigon Noodles. Uhhhhm...  First off the service was a bit weird. I had 3 people come by and place a small plate, water, and then a drink order. It was another 10 minutes before someone came and took my food order. Other patrons had come in and were eating before I even ordered.   The pho was just so so. There was hardly any meat in mine and about 1/2 the noodles you would usually get.   The flavor was just meh. I added a lot of soy and hoisin to mine to up the flavor ante.   All in all. Stick with Pho Nam."}
{"text":"I felt sick and needed my asian remedy of pho to feel better. I walked it and found that there was chaos. Partially because they don't have a hostess the other half because they were busy on a cold night. granted I'll give it to them. But by the time i was waiting 10 minutes in a line that had grown to be out the door, i think they need to think of another system. From bussing tables to actually taking names down at the door.   Regardless I rallyed, we got seated and within a couple of minutes i knew my order. water was hastily dropped off at our table but after another 15 still no one had come by to take our order. On top of that the parties that were seated after us had their order taken and we were there raising our hands trying to get someones attention. Still, coming from a vast and varied amount of different asian restaurants i didn't judge. I did judge however that after we ordered our pho it took another 20 minutes for it to come out. I know that getting pho on the table takes a couple minutes because the broth should have already been in a pot and sitting at a hot temp and all that is left is adding the right meat.   Then the food, well it was just okay. By that time i was just happy to get some food in my belly. the broth wasn't very hot or flavorful so using the condiments was prime. the meat was chewy and the noodles were...somehow not that good. but, it will do. I didn't have high expectations for this place and somehow they were still not met. But, if i need a fix of pho, due to its convenient location to me i might come back.   Happy finding other pho places."}
{"text":"First time eating Vietnamese.  It was very good and the prices were good too. I expected a larger bill. I had the shrimp and egg rolls. Very good.  Overall a very nice affordable family restaurant."}
{"text":"The soup noodles are awesome but the Fried Rice Comb is also great too!!!!!!!!!!!!"}
{"text":"Really great, affordable Vietnamese restaurant near a mall on the west side of Madison. This whole area seemed like it had some great food finds: Thai, Indian, Mexican, and other little non-chain restaurants.  Saigon noodles is bright, clean, and packed with people.  Service was prompt and attentive. Prices were reasonable, especially considering the quality of the food.  My fiance got the pho with tendon, flank steak, and beef chunks--he loved it.  I got the beef and egg noodles stir fry and it hit the spot.  Condiments to make it spicy were all right on the table.  I also had a nice cold Saigon beer (perfect accompaniment) and we shared both the Vietnamese fried egg rolls and the fresh spring rolls, both of which were well put together and tasty. I will say that I wished my stir fry had a few more vegetables in it (just for variety's sake), but otherwise zero complaints from me about this place. Great for an easy weeknight dinner out, especially if you need to do some mall shopping afterwards!"}
{"text":"Saigon probably offers the best bang for your buck in terms of affordable and great-tasting Asian food in Madison. It is THE best Vietnamese restaurant (okay, I've only seen two...) in the area.  The standard pho noodles and vermicelli bowls are great. The spring rolls and egg rolls are equally delicious. The service is also impeccable. Saigon is a pretty good place to go in groups. Separate checks is never a headache here.   Note that they are closed on Mondays and that reservations are not taken. However, even if there are waits at Saigon, they are usually quicker than most restaurants.   Tip: Credit card is only allowed when you order $15 worth of food or more."}
{"text":"Updated review: eaten here many times, always ordered the vermicelli with grilled shrimp. It always came with a sliced egg roll on top. This time it did not. The top of the vermicelli section of the menu refers to an up charge for swapping to a vegetarian egg roll. Seems pretty clear the bowl should come with the egg roll.  I asked the waitress about the missing egg roll. Her response: \"That one is number 66. You ordered 65. Sorry.\" Then she promptly turned away. No offer to bring me the egg roll and charge me for the dish I intended to order.   Read the menu carefully, folks!"}
{"text":"Echo many previous reviews: Saigon Noodles is the best Pho in Madison!  This is my most visited restaurant in Madison in the last five years.The owner renovated the restaurant and expanded to the space next to it a couple years back. Now the decor and ambiance is better than before, and the quality of food is still consistently good.   The pho is so good that I ended up not trying many other dishes on their menu. Whenever i step in Saigon, I want my pho again."}
{"text":"I went here with a friend of mine who is from Vietnam, he recommended the Pho (pronounced sort of like \"fuh?,\" a beef stock soup with rice noodles, onions, meat, and optional add-ins brought to your table including hot peppers, bean sprouts, mint leaves and lime). I now get it every time I go, and crave it more than chicken noodle soup. The portions are generous, the atmosphere is clean and the location is easy to get to. The next time it's cold and generally cruddy outside, consider stopping here for a bowl of Pho."}
{"text":"I went there with a bunch of buddies because they couldn't believe I've never had pho before. I got the number 19 which has everything in it. I absolutely loved it. They have good eggrolls and spring rolls. Good waitstaff along with clean atmosphere."}
{"text":"We were looking for authentic Vietnamese grub and this place delivered! Pho was is a must! The food was great and the servers were extremely friendly, explaining to use how to properly dress and eat the foods. We will be back!"}
{"text":"Found this place on yelp and I was super excited to try it. As a Southern Cali Out-Of-Towner I couldn't wait to get a bowl of warm soupy noodles and feel like I'm home again. Walked over from my hotel, opened the door and I was happy to see a clean, well decorated restaurant. I was greeted by a waiter with a great smile, he was nice and polite and everything was perfect.   Unfortunately it all went down hill from there...  I ordered Chicken Pho and Spring Rolls To-Go. $14.45 Total.. Little pricey but not bad.  A Lady handed the order to me in a bag. The soup and noodles were separate and I saw that the soup container was pretty full. Being stuck in a hotel I would like to heat up the noodle and soup together in one container, so I asked if I could have a extra plastic container. \"No we don't have any\" was her answer... \"ok... what is this thing that the soup is in then\"? I thought to myself. But I didn't want to argue with her.. Then I looked into the bag and there were no utensils.. \"Can I have some chopsticks and a spoon please?\" I asked. She rolled her eyes and tossed some in my bag.   Oh well.. bad service.. but at least I got my Pho! Still happy I walked back to the hotel.  I ate the food as soon as I got back. Since I didn't get to reheat it, it was not piping hot like how I usually liked. The flavor or the Pho was not that great. It was very salty and the broth is regular beef Pho broth not chicken broth. The spring roll was very tasty though. The mint leaves were really nice and refreshing.  Now... Here's my horror story and when my yelp review will turn into a Rant...!  Within 30mins of eating the food I started feeling nauseous. About a hour later I threw-up and had a great bowel cleansing (cough cough). It was like clock work.. every 20 mins I have to run to the restroom... stomach pain... vomit.. the other stuff.. for about two hours. I took some Pepto-Bismol and drank lots of water. It didn't really get better. At this point I was getting scared.. should I go to the ED? I did some research on WebMD and it seemed like food poisoning symptoms. I thought about the Pho Place and felt like I should call them to at least let them know that their food might be unsafe. What if babies or the elderly eat it and get sick? The consequences could be terrible.  Of-course the same lady picks up the phone. I told her why I was calling. Her immediately reaction was \"It cannot be our food!. I sold many of those items today and No One got sick.\" No apologies, nothing nice.. she then continued to say that it is impossible to get food poisoning that fast. I ordered the food 3 hours ago and it takes at least 3-5 hours for food poisoning to happen. Then she started to say she cannot do anything for me at this time and I should drink more water.   THANK YOU! You are now a DOCTOR and Thank you for your medical advice!  I told her I'm not blaming her, I just wanted to inform them before anyone else got sick. She continued to be rude and condescending so I told her to forget it and hung up.  So maybe it's not the food.. it was me.. but the service was still terrible. I hate leaving bad reviews for family owned restaurants but this was just a nightmare! So save your  money. Go eat somewhere else. You do not need to go through what I went through. Laying here in pain.. homesick.. yelled at by some rude lady... I might wake up 5lbs lighter tomorrow! Yay... No really.. don't go there..."}
{"text":"If you are looking for authentic Vietnamese in Madison, Saigon Noodle is the place to go. Their pho and bun bo hue (weekends only) are authentic. I recommend their summer roll for an appetizer, and then the pho.  I also like their fried rice; I found it really tasty.  Prices are good, place is clean enough.  Not all their dishes are on the mark. Their rice dishes are so-so, since they don't have com tam and use plain rice. The bun is nice, but the pork they use is not quite what I'm use to. They also have Vietnamese sandwiches, but again it is okay.  Oh, and one thing for vegetarians: if you get the vegetarian bun, do not use the sauce that comes with it because it's just good ol' Vietnamese fish sauce!  But even with these side remarks, what keeps me going back there though is still their well made bowl of pho or the bun bo hue. I'm telling you it is like crack."}
{"text":"Good food. I didn't like the pho so much but the noodles I got were good."}
{"text":"Food is Good, service is Terrible. Unless the young waitress  are working. It is Pricey for lunch."}
{"text":"I'm a little disappointed. First time we were there.  Spring rolls are fantastic but had a problem with the main dish.  We asked the server for a soup to share between two.  We were directed to the Pho and decided on a bowl.  For my main dish I ordered the spicy beef special. Little did I know that this too was Pho (soup). So when everything came out we had soup and more soup. Why the server didn't correct us or at least ask I'm not sure. I even asked if the special was served with rice or noodles!"}
{"text":"Pretty good vermicelli bowls. I had the #66 the shrimp and egg rolls. My partner had the #62/63 the pork with egg rolls.  The egg rolls were good. The vermicelli was good. And the protein was good. Overall our dishes were just ok and not as flavorful as other restaurants."}
{"text":"You've found your Vietnamese kitchen! Clean, polite, with the best delicacies on a well balanced menu. The egg noodle duck soup is incredible, the spring and summer rolls perfect, and the Pho extremely well done. They are good so they are busy...but the best in Madison should be. 5/5 Stars.."}
{"text":"The pho is good. Broth tastes like how pho should taste, you can tell they got up at 4 am to start making it. Portion size could be bigger, especially since I'm ordering the large size.  Bit on the pricy side for Vietnamese restaurants, but overall I left satisfied with the appetizers and pho."}
{"text":"The review filter thing really helped out Saigon Noodle. I was impressed by the number of one and two star reviews that Yelp removed! My problem with this place isn't the food - it is the SERVICE. It is HORRIBLE. We were seated and waited -20- minutes to even take an order or even order drinks. 20 minutes, I am not kidding. The waittress was plenty nice but wow, 20 minutes. And even when we had our food, not a single check-in with us despite our empty glasses. I'm not sure the point of having a restaurant with GOOD FOOD but absolutely PISS POOR service."}
{"text":"I eat here a lot.  For Madison and the Midwest, this is very decent Vietnamese food.  I give it a 4 - not because it's bad or the place is dirty or the service is terrible (because none of that is true) - but because I am aware that there are better parts of the country where there is better (and cheaper) Vietnamese food.  (I also rarely give out 5's, and actually have yet to do so).  Here are the reasons I like eating here: - it's decently priced (large bowl of pho is about $6.75) - the pho is delicious (great broth base) - the wait staff are friendly (and after coming here so much they tend to know me and what I usually like to get) - the restaurant is clean and well-maintained  I highly recommend Saigon Noodles.  Good authentic ethnic food in Madison."}
{"text":"Best pho I have found in this area. I am a big eater and the regular size is perfect. I've never been able to finish a large. But then again I always get spring rolls too.  Vietnamese spring rolls are amazing-- love the peanut dipping sauce.  This place has always had great food for a great price but now, after their expansion and renovation, I would recommend it to anyone. Service is a bit slow but just sit back and relax... worth the wait."}
{"text":"Great Pho, and other dishes.  I cant make any claims about how this is the best in the midwest or just like in Vietnam, but it is seriously good food.  Also, the place has many asians eating there, so i trust they no something about good Pho.  I wll say there is a Wide selection of Pho, including with all the \"interesting\" bits. On saturdays they make Spice Beef Pho -  Nice and spicy and worth a stop for just that  If you like Pho, or   just like great food at a low price - this is the place"}
{"text":"I wish there was a half star so I could put this at 3.5. I like Saigon Noodles the food is fresh and the place is clean. There are several good choices on the menu that ensures you can eat here a couple of times a month and not have the same thing twice. A few more choices on the menu and I'd throw in that extra half a star."}
{"text":"This is the only place I go for my pho fix! Their broth is amazing!!! For the size you get and the price, it's totally worth it. Every time I go here, I always order the same thing- Saigon deluxe pho bowl and an order of spring rolls! SOO GOOD! The environment in this restaurant is loud but that's because it's always busy. It's a great family restaurant although it can get too crowded. We always get great service here. No complaints. HIGHLY recommend if you love pho."}
{"text":"Fantastic. Favorite of Vietnamese restaurants in Madison. I I'm in love with their soups if you are a from scratch healthy soup person."}
{"text":"Love this place! Delicious pho.   Customer service isn't always fast or friendly -- it's hit-or-miss depending on who you get. But the food more than makes up for it!  Just know that you need to spend $10+ to use credit card. They are also closed in the late afternoon. I've gone there at 2pm to (tragically) find the door locked! They're also not open on Mondays.  But definitely make a trip out here if you want some legitimately good Vietnamese food."}
{"text":"Sufficient Vietnamese food for Madison. They serve alvacado smoothies. The woman owner is a little snooty and not great for take-out, therefore, they don't get 4 stars."}
{"text":"Come here almost every Saturday, food here is aswome! We come here so much that we don't need to look at the menu, were ready to order as soon as we are seated."}
{"text":"The food was delicious but the wait and service wasn't up to par. I don't know if it usually is that busy on a Saturday afternoon since I'm not from here, but they need to have more people staffed on extremely busy days. Rather than having only 2 servers... I would give this a 4 star but the wait for food was too long and the prices are more expensive than other vietnamese restaurants I've been to."}
{"text":"I've been here countless times and while their prices have increased over the years, at least the quality of their pho has not changed. Well, maybe a little; there is definitely much less meat now, but that's another issue.   The broth is rich and easily customizable with your favorite sauces, and the few bits of meat that are included taste fresh and tender. Probably one of the best places for a hot bowl of pho in Madison."}
{"text":"I love the bun bowls. Perfect for a sunny day. Food and veggies are always fresh and crisp. If I could go every day for lunch,  I would!"}
{"text":"The Pho here is great! Pairs well with the chilly winter we have here"}
{"text":"This is my favorite Vietnamese restaurant of all time. The food is delicious and very authentic and the restaurant is always super clean. There are many options to choose from but I almost always get the Lemongrass Pork & Egg Roll Vermicelli Bowl, their pho and spring rolls are also delish. They have yummy bahn mi sandwiches too but you can only get those for takeout.   Great food, great service, great place!"}
{"text":"Nothing phenomenal with the pho, noodles and vermicelli but still tasty and decent sized portions. The pork in the vermicelli was also dry and different from the kind we've had elsewhere."}
{"text":"Not the best Vietnamese food I've had. I had the roasted duck soup and the duck was super fatty. The rest of the soup was pretty good. Prices are very reasonable. The staff is friendly."}
{"text":"I liked the friendly, unpretentious atmosphere. I got the Saigon Deluxe with a pot of tea and an iced Vietnamese coffee for desert, all of which was delicious and reasonably priced. I'm especially looking forward to coming back in the winter, nothing beats a hot bowl of pho on a cold night!"}
{"text":"Service at Saigon Noodle wasn't great the night I went, but the Pho was decent and the one person appetizer sampler was a nice menu option - I really liked the beef skewers and their salad rolls. Dinner plus che ba mau for dessert only ran me $15, so I was pretty impressed by the value. If I'm in the area and feeling like Vietnamese, I'd probably go back, but I wish the servers were better."}
{"text":"This is one of my go-to spots when I'm in Madison. I always come for the pho although it's not the best pho, it's probably the best that you can get in Madison. The Thai iced tea and springs rolls are also must haves when I come. The portion and prices are decent. They have expanded the space not too long ago and the extra seating means there will not be long waits which is good especially when you come hungry."}
{"text":"Best Pho in Madison.  Period.  Dont be fooled by the strip mall location.  Ive been going here since they opened.  The were always too busy so they expanded into the neighboring business.  The only downfall of this joint is maybe you could knock it for the ambiance. I for one could care less about what a restaurant looks and feels like. If they can serve up some good grub ill eat anywhere"}
{"text":"I was craving pho during a business trip to Madison, and after searching, Saigon Noodles came on top as the best pho in Madison.  First time I went there, they were closed at 2 pm between lunch and dinner. They were still open when I came but they wouldn't serve me saying they're close.   Okay...  Next time in town, I was craving hot soup and thought I'd give it one more try. This time, they were open! Oh, thank God.  The place was rather modern in decor -simple and clean. It looked new inside and older from outside. There was a mixture of people from various cultures. They say, if an ethnic place is filled with their own kind, it is a sure bet for authenticity. Can't tell with this one, as around me there were bunch of people who didn't know how to eat their pho or how to pronounce it. This guy next to me thought the bean sprout side plate was a free appetizer salad that came with the meal and was looking for dressing.  Anyway.. I stopped reporting on my people watching and back to the food. The fried egg rolls were pretty good and they served it with pickled vegetables, which I really enjoyed. I ordered the big pho and the broth tasted good and clear. However, it wasn't the best one I had. It didn't come close to the second best either. I had a lot of noodle left but the meat was on the lighter side. They were gone before I ate half of my meal. I lost interest in the noodle without any meat left in the bowl.   They charged for hot tea but I must say the hot tea was nice. It was Jasmine, and quite strong and heavy muscatel. I loved it. I stayed longer even after I finished my meal to empty the tea pot."}
{"text":"I love their Vietnamese spring rolls with shrimp! Very fresh ingredients and light enough for a spring appetizer. My other go to is the Pho with meatballs. Great environment and friendly staff!"}
{"text":"Used to come to this place a lot and it was pretty good. Just came back after a couple months and got a pho deluxe in LARGE. When we got the portion, it was very SMALL and the broth was so watery. I complained about it but they didn't seem to want to do anything about it. Very very disappointed!"}
{"text":"I tried this place because people recommended, but j preferred Pho Nam, because the place was disorganized, not particularly clean, and the staff were almost rude. They didn't seem to mind is when we went in. I hate those kind of people"}
{"text":"I had the veggie Pho. It was hearty and delicious.  Clean environment. Definitely recommend! The owner of the restaurant is also very nice."}
{"text":"Amazing Spicy beef glass noodle soup and best spring rolls I've ever eaten. The service is great, very polite staff, well versed with the menu. The venue is huge with lots of place to sit. The lighting could be dim. I wish they stayed open until late hours for midnight cravings"}
{"text":"I am a big PHO fan and you should have it here.  But there is a WEEKEND ONLY special which you should also try!! The Vietnamese crepe- Banh Xeo. This is a yellow crepe made with rice flour, coconut milk and turmeric; filled with minced chicken, shrimp, beansprouts and green onions. Served with Lettuce and fresh basil, cilantro and mint. You take a piece of leaf lettuce and place a piece of crepe and filling inside, top with fresh herbs, roll it up, dip in the sauce and eat. It all sort of falls apart and is super messy- but DELISH!!  The new design and space is beautiful and clean. A big bench area for people waiting for take-out that does not infringe on dining space.  Usually very busy, but the servers seem to keep up well and with energetic efficiency. Beer in bottles only, but that is better than none."}
{"text":"I've been missing saigon's pho so much since I left Madison. I used to get beef& sausage pho and spring rolls. These two menus cannot go wrong!  The price is reasonable and the quality of food is really amazing. I highly recommend this place if you are looking for a legit pho place in madison."}
{"text":"I decided to venture out here a day after my wisdom tooth surgery and it was still an amazing experience.  I ordered the pho w/ meatballs and it was phenomenal. I will certainly be back for spring rolls and bun!"}
{"text":"I love this place and have been eating here, going on my 5th year now. I'll write more about this place later. I'm a busy grad student, what can I say. The management has done a fine job of being consistent in quality.  I usually order the beef delux pho noodle dish, or the bbq lemongrass beef with cold vermicelli noodles and fish sauce on the side.  Their springrolls are also tasty.  I've also had their chow fun (it might be labeled something else on the website) and it was good, slightly oily, but that could have been just that one time."}
{"text":"Decent and cheap. I don't like pho or the noodle bowls (not a knock on the establishment, just my personal taste), so I always get a rice dish. It's all very simple and light: plain rice dish with a bit of heavily seasoned meat and some veggies, but I always enjoy it. The pickled radishes (I think) are tasty too."}
{"text":"We just moved here from Shanghai & Siagon Noodles has been a terrific find! We went in with no expectations & came out as fans - the service is great, the food really good (tried pho & spring rolls) .... all in, I have to believe this is the best place to go, if you're in the mood for a steaming hot bowl of noodles!"}
{"text":"I never thought I'd eat a banh mi in Madison, but since I got to drive a little further away from the capital during this trip, I got to try some new restaurants. Saigon Noodle was one of those places. A friend of mine and I were craving banh mi, and some other friends we're staying with suggested Saigon Noodle. We visited during lunch, and banh mi can only be picked up for take out orders, so this review only covers take out.  We ordered the special banh mi that included pate and ham. The meats tasted good, and while I don't usually order pate, I enjoyed it. The cucumbers were sliced longways, but not julienned like the daikon and carrots. I like lots of vegetables on my banh mi, so I was missing more of the pickled flavor, and I wish there was more cilantro too. The jalapeños were just spicy enough, and the bread was crusty on the outside and soft on the inside, though it wasn't warm.  We also ordered spring/summer rolls and Thai iced tea. Both were good.  I give this place four stars for Madison, but if it were in San Jose, I would give three stars."}
{"text":"Pro: It's has the best Pho in Madison. The food is decent.  Con:  Seating is limited.   Every time we go, there's always a wait for seating.  We've made reservations before but they've given up our seats even if we were on time. Service is ok - our drinks aren't always filled.   I love their banh mi (Vietnamese sandwiches).  The vermicelli noodle salads are fresh but the nuoc cham (dipping sauce) are flavor-less.  I will return for the Pho and banh mi even if it means waiting in line. There aren't any other Vietnamese restaurants in the area."}
{"text":"I love, love, love this restaurant. I am never disappointed! They are always busy but they still manage to give great fast service and deliver great food. I've been here loads of times and have gotten a great meal every time. The staff is always nice and friendly. I can't recommend this place enough."}
{"text":"Food is good, service is terrible, the staff didn't come to our table for over 10 min finally when they arrived they wanted our whole order.  Didn't ask if we wanted drinks at all. We were then never spoken to during our meal except to see if they could take our sauces away.  Dirty dishes were left on our table thru the meal. Staff was more interested in filling sauces, and condiments then giving service to the customers.  You can the best Food but if service is bad you will continue to lose customer like us who used to come frequently."}
{"text":"We went to Saigon Noodles at 6pm on a Tuesday evening.  There were others there, but it wasn't packed and there was no wait for a table.  What there was a wait for, was for ANYONE to stop by and give us water or take our order.  After sitting there for 25 minutes, we finally flagged down a waitress, who told us that they couldn't work any faster (really?  what if the restaurant were full?)  Since we had tickets to a 7:30pm movie, we couldn't wait around for them to get their act together.    All in all, I can't comment on the food, because we never got any.  But I can comment on the service, which was beyond terrible."}
{"text":"This is my favorite place for pho. The broth is rich and meaty but clear and clean tasting as well. The soup is full of ingredients and the ala carte sides don't skimp, either. It's pretty common to treat pho like a do-it-yourself meal, so that's helpful.  Actually, the experience really drives the place. The location is really beautiful, and the service is really good. That gets especially high marks because the menu is pretty unfamiliar to most here in Madison. I am pretty familiar with pho, but when I ask questions about other things on the menu they don't drop a beat. Example: when I got the crepe the server was very polite in informing me the proper way to eat it. I'd tell you, but it's a nice experience to learn about another culture from someone who cares.  Some people like hole-in-the-wall ethnic joints, but I think that game is overplayed. Saigon puts just enough shine on to make themselves look great so they can share their food with you."}
{"text":"Modern/earth tones with excellent lighting.  At first I thought the service was off. Put after leaving realized they closed at 9pm ( thought 10) We arrived at 8:30 and didn't leave till 9:20. Oops our bad. THat being said they gave us time to look over the menu. Checked on us though out. Food came out fast with a good time between getting appetizers and entrees. At they end they were pushy. Thats when I saw no one else in the place and wandered when they closed. They never told us they were closing soon.  The Lotus salad was nothing special. On the blah side without drenching it in the house dressing (a mixture of vinegar, fish sauce, sugar & hot pepper).  I've never had Pho before. Since hearing good things about this place thought this was a good place to start. Got the Deluxe in the large size. Huge with a good ratio of broth to items in it. Big on flavor but I put a lot of chili sauce in it cause I lot things spicy. Couldn't stop slurping(a sign in other countries that you like it, put considered rude here). It's only the beginning of Pho season. Well see hot Saigon Noodles stands at the end of the season thou."}
{"text":"Saigon is an amazing places for noodles and such. The food is amazing, lots of it, and always under $10 a dish.  The restrarant is very busy, so you maybe standing around for awhile during the lunch hour so come early.  Service is slow, but friendly. The food is worth the wait. Average time from order to in front of you is 20-30 minutes, but, once again, totally worth it."}
{"text":"The bun bo hue here is so good!!! I would definitely recommend trying it. The pho is okay, not the best pho I've had in my life but probably the best pho I've had in Madison. I ordered a small pho dac biet last time I went because at most pho places a small is more than enough to fill you up especially if it's the special. But I was still kind of unsatisfied after that bowl. Should have gotten a large.  The menu is a good size, prices are reasonable, and service is good. We've eaten here several times with parties of 10+ people and the staff is always pretty accommodating."}
{"text":"Such delicious food!  I enjoy food like this and their food is some of the best!  Start with the spring rolls and go from there!  You won't be sorry!"}
{"text":"I've eaten here a handful of times, both before and after their renovation. Everything is amazing, service is always good- and it's generally busy but that's ok. Some of the best Vietnamese food in Madison."}
{"text":"I am a big fan of the bún (vermicelli noodle) dishes here, particularly the ones with an egg roll as one of the ingredients.  I usually get the lemongrass chicken or pork with egg roll - you just can't go wrong with all of the great flavors and textures with this meal.    They've recently remodeled, and I believe expanded, and the new space looks great.  What had been a pretty utilitarian space (totally fine, it's the food that matters) is now really nice and pretty."}
{"text":"I've been to Saigon Noodles a few times and all I ever get is the Beef Pho, not because everything else doesn't sound and look great, but because the Beef Pho is that good. We got the food very quickly and, best of all, we paid $20 for two, including the tip."}
{"text":"My girlfriend and I were craving Pho especially after the recent cold weather. We both ordered the Steak Pho, and definitely enjoyed it. The price was great less than $10, the portion was large, and we left satisfied!"}
{"text":"Best pho in madison! They also have bubble tea. I also love their Bun."}
{"text":"My favorite restaurant EVER! I no longer live in Madison but every time I visit, I make sure that I stop here. The food is too-di- for, the service is always friendly and-- espeicially after their remodel in the last year--the atmosphere is classy but casual. I really can't say enough goo things about this place. Try it, you won't regret it!"}
{"text":"Great Vietnamese food! Sometimes there's a wait, but it's definitely worth the wait. Probably my favorite Vietnamese place!"}
{"text":"I went to Siagon Noodles at the recommendation of a friend, after telling her about my favorite noodle place in town. I waited in line at the door with my husband for over 10 minutes, while looking at tables that needed to be bussed. Once it was our turn to sit, there were only round tables left, and they would not let us sit there because we were a party of two and they could sit five there. There were no large parties waiting for a table. So, we left and went to Pho Nam, where we were greeted and seated promptly. Had a delicious lunch, and great service! Doesn't matter how your food tastes if you don't have customer service skills. Do yourself a favor and just go streight to Pho Nam Noodle House on Junction Road."}
{"text":"Very good food at reasonable prices. Casual atmosphere with efficient service. All and all, a positive experience."}
{"text":"We were in Madison last week and I checked YELP for a Vietnamese restaurant and it turns out Saigon Noodles was just a few blocks from the hotel.   Saturday night parking is tough but I found the last parking spot in the small strip mall lot.  The initial impression was very inviting, the place was busy, clean,and  tastefully decorated. We noticed a lot of diners of Oriental heritage so I knew this was going to be really good!  We were given seating right away.  Like others have reported, it takes a while for the server to come to the table but we weren't in a hurry.  While the server takes the order, various people come out with the food when it's ready.  We ordered an appetizer and chose their \"sampler platter for one\" and cut the Spring roll and egg roll into 3's.  Wow, I don't normally like Spring rolls because they often taste like grass to me, but this spring roll had three huge shrimp below the wrap, and was absolutely fabulous!  Next time there I will order a large spring roll for myself.  The chicken and pork teriyaki sticks would also excellent.  Wow.  From YELP I learned their specialty is PHO so the three of us ordered PHO's.  I had the chicken pho and it was delightful, tasty, and a joy to eat.  The chicken was more in a pulled form rather than little cubes.  I enjoyed their pulled chicken much better than the often seen chicken cubes.  They have two sizes of pho, regular and large.  I could barely finish the regular size and after seeing the large pho brought to other tables, I couldn't imagine myself eating that much :)  The broth was tasty, the rice noodles superb, and it had a wonderful flavor.  We all enjoyed our Pho's and we all agreed that these were some of the best PHO's we've had.  I am looking forward to coming back again and again when we are in Madison.  The entire dinner was fabulous and I consider myself lucky to have found this place!"}
{"text":"We tried this place based upon the good reviews we saw here at Yelp and were not disappointed.  It is quite nice inside.  Neat, clean and orderly and not overly fancy.   I found it quite comfortable. The staff was very pleasant and helpful and took time to communicate a few things about our meal. I felt the portion of protein was a little small on one of our dishes but the flavors were subtle and quite good.   We were very please with our first visit and will be back. Thanks Saigon Noodle!"}
{"text":"I have been here several times this past summer passing through Madtown and adore this place. Pho is some of the best that I've had. Even out of the places in Chicago. Very cheap. Clean. Staff is very nice and helpful.  Easy parking weird customer base. But oh well.  Family friendly."}
{"text":"One of the better Vietnamese place in Madison. My regulars are spring rolls for appetizer, Saigon deluxe pho for entree and Thai tea for drink. Everything is decently priced. The have the weekend special with the the amazing spicy beef noodle and I love the traditional rice crepe. The service here is excellent. One of my friend couldn't eat pork and she ordered spicy beef. The waitress took the order and double check with the chef and found out that the spicy beef noodle's broth was made by both beef and pork. If it wasn't for her, my friend wouldn't have been enjoying her lunch as she should have."}
{"text":"Pros - Well made noodle soup that's great for cold winter days. A relaxed atmosphere. Price and parking were decent  Cons - For pho I've had bigger portions for the same price, service was a bit slow. Floor was pretty slippery on days that snowed or rained.  Overall -   Food - Good bowl of pho  Price - The serving size could be bigger, paid about $8 for a bowl of soup  Service - Slow"}
{"text":"This place was awesome! First time ever having Vietnamese food. My boyfriend and I shared that Saigon platter, the spicy beef which is only available on Saturday and Sundays and, the combination rice. All were amazing!"}
{"text":"Love it here! Best springrolls and pho in town! This place is always super busy for this reason but it's worth the wait. The owners and wait staff are also very nice!"}
{"text":"Food taste sweet, and MSG-ish. You will feel very salty afterwards. Drink a lot of water.   For a town like Madison, It's the best option you can find for Vietnamese food. I dined there countless time in 5 years. Love this place for personal reasons."}
{"text":"cant go wrong with the spring rolls and peanut sauce!   really wanted the spicy beef but we went on a weekday :(. got the got the noodles with pork and egg roll, which was still awesome. Deff need to get there on the weekends for the specials."}
{"text":"Yummy! I love their spring rolls, very fresh.. And the dipping sauces are delicious. I ordered the Papaya Salad, very tasty, will order again. My boyfriend got beef pho, which was very good also. Try the Thai tea!"}
{"text":"To be honest, I don't get the hype. It's a good place to go if you're REALLY craving pho in Madison (I mean, there really are only two establishments for pho), but their pho is only average. Noodles clump at the bottom of the bowl, broth is not very flavorful--I have to say I prefer Ha Long Bay's pho over Saigon's. The last time I went, a customer was extremely angry over a piece of hair he found in his pho.   If you do go, get there early on the weekends to avoid the mass of hungover college students flocking there. And don't get the papaya salad."}
{"text":"I come here for the Pho, the broth is pretty darn amazing, and the spring rolls, which comes with some bomb peanut sauce. Nothing else. I don't care for any of the other food as they're either mediocre or just not worth the cost. Service is alright. Waiters don't really care about the customers and that's the reason for my low rating.   Another tip is to never expect your food ready when you order takeout. I get that they want their food to be the freshest possible when you pick it up but I ordered ahead for takeout for a reason. Every time I order food to go they tell me it'll be ready for pick up in 15-20min. That's not true. It's more like, you call them with your order and they wait for you to actually show up first before they start even making the food. I always end up waiting 15min at the restaurant for my food to be ready. I get that they want to make sure that the customers actually show up. But come on, what was the point of me calling in the first place?"}
{"text":"we got there at around 11am on a weekday and we were seated right away.  The service was very good and attentive.    This place has the perfect flavorful pho broth, not to salty or to sweet,and the right amount of beef.  My whole fam ordered the large bowl and it was totally worth it because they finished it ,  In Wisconsin This place is as good as the pho in Illinois.  The bubble tea that my daughter got was also very good and I can't complain about the spring rolls & the egg rolls because my fam downed it quickly. Lol!"}
{"text":"Awesome food! Chicken skewers and pho are certainly my food to get here. I could totally eat here everyday... Good value for a meal too."}
{"text":"I have been to Saigon Noodles several times and always leave satisfied. The service is quick and friendly. The pho is probably the best in town (let me know if there is better). The ambiance is somewhat sterile and Americanized  --  probably less intimidating to those experiencing Vietnamese food for the first time. Ample free parking out front, I highly recommend trying if you have not already."}
{"text":"they have the best wonton soup. also the pho is phenomenal!!!! great atmosphere with quick service. Waiter was very polite!! I go there every other week!"}
{"text":"A decent place for Vietnamese foods in Madison. I love the pho, bun bo (spicy noodles that they only have during weekend), che 3 mau (tri-color dessert) and everything here. The price is reasonable too.  My only complain is the location, pretty far away from downtown.  Of course you can have better Vietnamese food in Chicago but this seem to be the only Vietnamese restaurant in Madison. There's another one near Regent and it's not really a Vietnamese place. The pho over there is not even acceptable."}
{"text":"I've had better Vietnamese but not in Madison.    I've seen more people-of-Asian-descent eating here than I knew there were people-of-Asian-descent living in Madison.  That says something about the place.    Pho was good.  Spring rolls were good.  Bahn Mi was good (take out only and $3.75!!).   Friendly, clean.  I'll be back."}
{"text":"Love the pho and the service is always very friendly. On weekends the spicy beef pho is absolutely delicious. The spring rolls are really good too."}
{"text":"A craving for some delicious vermicelli bowl was the culprit behind us being swayed to drive all the way to this joint!! (Oh and the cheesecakes at Cheesecake Factory :) ).  The decor is understated and clean although the reception desk is a quite a bit away from the entry door and the lady at the counter just screamed from her desk \"How many\". Kinda awkward to scream back a number!! (Probably best to simply walk over and answer her lol)  We ordered 2 different varieties of Vermicelli bowls - One with Pork and Egg Roll and the other with Pork and Shrimp. Both dishes came out on time with a side of their house dip/sauce. Every ingredient on there was very fresh and once you've mixed it all, is extremely tasty. The pork was the standout here! Incredible moist, juicy and had a awesome char on it. The egg roll was nice and crispy and the shrimps were thankfully not cooked till death :).  One thing to remember though. The protein portion to me felt a tad less and so we ended up ordering Extra on the side ($3.75) which too was very less for that price. Still the taste was spot on! Service is OK.  I'd love to give their Pho and other dishes a try so will definitely be coming back here."}
{"text":"Would agree with most reviews and say this is probably the best Vietnamese food in Madison. Came here for lunch and it was fairly packed but they seated me really quickly which was nice. The service was prompt as well.  I ordered the ice coffee w condensed milk, pho # 18, and the egg rolls. I like that Saigon gives you the option to order a regular or large. The egg rolls were alright, would probably not order them again. I really liked the coffee. It was very flavorful.  My bill came out to 17 which was nice given how much food I got."}
{"text":"Delicious pho..I usually order the Saigon deluxe which comes with a variety of meats. Their spring roll appetizer is also good. Definitely recommend this place. Great service and reasonable pricing too!"}
{"text":"The four stars is for the wings. The wings are great!!! Just the right crispy with not too much batter. Yum. I'll come back just for the wings. And they come with pickled radish and cabbage. The pickled radish tastes just like the kind they serve with wings in Korea.   The pho is so so. It was a tad too sweet for my taste and didn't seem as authentic... But hubby liked it. Tasted less msg (which is good) and more chicken brothy (not so good for a pho).  I ordered the steak, brisket, tendon and tripe, but had very little brisket, no tendon, and only the fat part (rather than the tentacly part if you know what I mean. Also the part that I like!) of the tripe.   I ordered the regular size and it was super small. I mean, for pho... Pho needs to come in a big dish. It's the law. :)  If I come back I'll skip it and just get more wings or try a vermicelli dish.   Sunday night and packed. Clean and friendly, albeit slow service."}
{"text":"I have been to Saigon Noodles many times, and every time, there's something unpleasant about their service.  Yesterday was my most recent experience. We were sat at the table and were given menus quickly. Different servers were passing us and no one was taking our orders. About 10-15 minutes after we were done looking at the menus, the customer who came in after us was attended to first and the server took her order. I had to wave to get the server's attention to at least give us something to drink. When she came to give us water, I told her we were ready to order and she told me that another server will be coming to take our order. That took another 5 or so minutes. The server quickly took our orders and seemed like she was rushing. That's when I found out that the people sitting next to us, who got there way before us, did not get to order yet either. It took forever to get our food, too.  I get it, they were busy and probably short-staffed, but it would have been a better experience if they at least apologized for the wait or smiled at us.  Other times, we were either not given the time to look at the menus to get our orders and felt rushed, or the server assumed we were done ordering and walked away before grabbing her attention to let her know we were not done ordering yet.   The only reason why I'm giving them 3 stars and I keep coming back is because the food is actually good. The portions are not too good, though, especially take out."}
{"text":"It's a decent place took to in comparison to the other pho restaurants in the area. There is plenty of seating inside the restaurant and we didn't have problems getting seated (unlike Ha Long Bay which oftentimes requires a wait). I would say that the prices are a bit high for a typical pho restaurant (for non-pho items), but fine for an area lacking in Vietnamese places. The pho is very decent with a good broth base that isn't filled with MSG. Since we came here on a weekend, they had banh cuon special. Again, this is also pricey for such a small portion, but I must remind myself this is not a deli in CA or WA. The banh cuon (rice crepes filled with minced pork) was very good and the waiter mentioned that it is hand made by the restaurant. I wanted to try the bun bo hue but was recommended to pick something else by the waiter. Will come back if I'm craving Vietnamese food."}
{"text":"Best Vietnamese restaurant in Madison.  The pho is delicious!  Atmosphere is clean, but not very cozy.  I wish I lived closer to go more often!"}
{"text":"Good broth. Lots of meat in the large bowl. Spring rolls were good but peanut sauce was ok. Service was great."}
{"text":"I love pho and the stuff they have is great for the price. Pretty standard vietnamese food overall but getting a giant bowl of soup for 8 bucks is hard to beat. Make sure you taste it before you go nuts with the condiments, it usually only needs some chili paste. Good decor. The bathrooms are clean which was good for me last week when I was so hungover I had to clutch the porcelain halfway through my meal. Turns out it tastes just as good coming back up as it did going down. Spring rolls are only OK."}
{"text":"This is a great option for all those times you leave the mall starving but don't want to eat at the food court.  They make some tasty food that really doesn't disappoint. Just try something new! .  Expect to add your own seasonings and sauces to customize to your taste. The sauces are all laid out, right there on the table, you should use them.  Their hoisin peanut sauce is amazing. I like to put it on everything."}
{"text":"This had to have been one of my worst dining experiences. I'm from Austin, TX where \"good\" Vietnamese and Korean can be found. Not too many choices here in Madison so my expectations were low.    Our party of four was seated immediately. All was well until the water glasses came out without ice. Egg rolls were a bit greasy and really small for the price. However, the spring rolls were fresh and delicious.  My dish of Korean Grilled Beef came with a huge portion of white rice, pickled vegetables, and a few pieces of Karbi (marinated Korean BBQ beef ribs). It looked and smelled great until I realized that there was no meat on the bones. I paid $10.95 for a plate of fat.  I brought this to the attention of the manager who told me that this was how the beef ribs arrived - sometimes it had meat and other times it didn't.   Maybe it was my fault for ordering Korean food in a Vietnamese restaurant but it turned out no one enjoyed their Pho either. My sister-in-law said it was the worst she had ever had and my brother agreed.   What a terrible experience. Definitely will not be back."}
{"text":"I went out to dinner alone because I had just driven 4hrs from Illinois. I was craving some pho and luckily I found this place on yelp that closed past 9pm.   I ordered a #18 and it came out in less than 3 minutes. Amazing. The broth was piping hot and delicious. Not a lot of meat (about 3-4 pieces of each kind), but reasonably priced compared to places where I've been.   I also ordered a Strawberry smoothie before I left because surprise, minimum $10 charge on credit card. It was worth it because it's made with fresh fruit and not powder! 5 stars! Madison, you are lucky to have this place!"}
{"text":"This is the best pho restaurant in the area hands down. Now that is not saying much since Madison is really lacking in the Vietnamese food area. However, if you're itching for that bowl of Pho, then you should definitely come here for some nice noodles! We also had their banh cuon which was a special for the weekend. It was very good! (just the portion size was too small...)"}
{"text":"Best Thai food in Madison hands down! I always order the Vietnamese Spring Rolls which come tightly wrapped (a very good sign) and a Grilled Chicken and Eggroll Vermicelli Bowl. The chicken is just so incredibly juicy and crispy and the vegetables are always fresh. Service is quick and friendly. Whenever I have a car on campus I make the trek over."}
{"text":"Definitely my favorite place to get pho (SAY \"FUH\") in Madison! I swear I come here at least once a month, or more if friends are in town. I always order their fresh spring rolls (one order to myself teehee), and combination pho. The fresh garnishes that come with the pho are always fresh: lime, thai basil, bean sprouts and jalapenos.   Great portion sizes, prices and food!"}
{"text":"I've had pho at different restaurants in different area codes and this is some of the best pho I've ever had. One star down for the tea/Boba. Not the best. Skip the tapioca balls and stick to the pho.   Great service. And a plus that they let us split the check. Yeayh!"}
{"text":"Fast, fresh, colorful. I was here for lunch and ordered the Korean beef, grilled on the bone and sliced into medallions, then served over rice with fresh carrots, cukes and a few other raw veggies. For lunch, the portion size was fitting but had it been for dinner I may have been left wanting more. Dare I call it South Korean beef for lunch; North Korean beef for dinner? Either way, the price is right, the service friendly, the food fresh, and the newly remodeled interior clean and classy. Definitely a must for Vietnamese fare."}
{"text":"Saigon Noodles, take me away!  I'll drive across town and wait in line, just to tuck in to a nice, cozy bowl of #14 pho tai nam. You've helped contribute to the cure of more than one cold since I've moved to town, thanks to your fresh jalapenos and chili-laden condiments. Yes, you're on the Westside (which, for some reason, no one wants to drive to) and yes, you're in a strip mall. So what? Whether it's a hangover or a sinus infection, you pick me up and set me straight.  Besides pho, I'm a big phan of your spring rolls ($3.50) and your bahn mi sandwiches aren't too shabby, either! Maybe you don't have the pretty decor and mood lighting of Ha Long Bay on the Eastside, but you're fast, delicious, and always there for me--except on Mondays when you're closed, which I've fallen victim to on more than one occasion! Pay attention to the time, because they have this funky mid-afternoon closing time Tuesdays - Thursdays between 2:30 p.m. and 4:00 p.m."}
{"text":"Been going here for years and is amazing!  You have to try the spring rolls, the peanut sauce is incredible :)"}
{"text":"Pros: Tasty, large portions, reasonable prices, fast service Cons: ?  The pho here is said to be pretty good. However, I really like vermicelli bowls! You know, the type where you have cold bun noodles and pour the orange-colored Vietnamese sweet and sour sauce all over, accentuating the flavors of the scallions, peanuts, and crispy spring roll. Glad to say, they do it fairly well here."}
{"text":"Endless line. No place to stand ( and of course no place to sit while waiting). As they do have Ling line, the cleaning of the tables is \"not the best\" and no one even look at the dirty floor.  But - the food is good and with big portions.   Service is \"not good\" ( that will be understatement $"}
{"text":"This is our go-to restaurant when we want to eat out.  It has seen me through two pregnancies and the pho and spring roll cravings, our kids love eating there, and we have never been disappointed.  The food is consistently high in quality and flavor.  Both my husband and I love the spring rolls, pho, and bun noodle bowls.  My kids enjoy everything they've had there (which is quite a variety) and my 3 year old loves the pho the best.    I have eaten at easily 20 different Vietnamese restaurants and this is in my top two.    Sometimes the service is gruff, and they are slow with carry-outs."}
{"text":"Their pho always hits the spot for me. One of my favorite restaurants in Madison. There can be a wait at the door sometimes, but it's worth the wait."}
{"text":"Their Pho is perfect and comforting, the spring rools are well made and very fresh, and the peanut sauce is awesome!  Also, the 'young coconut' drink is something that I find myself fatasizing about.  I know I could just do at least THAT at home, but I'd rather go there.  It's also on the fairly inexpensive end, so I find myself going there towards the end of a pay period frequently."}
{"text":"Yes I WILL go back.   Food is stuff you can't get at every other \"noodle\" place. I  had the Vietnamese Sizzling Crepe.   Bonus: The Staff was great with my brat-monkey of a child (for real, I was going to kill him and the staff stopped me)"}
{"text":"Vietnamese food that is as good as any you can find in the big cities.  Everythign is fresh and tasty.  They recently renovated and expanded and atmosphere is comfortable, airy and modern.  Always excellent service.  Make sure you try their daily / weekend specials and I actually prefer their rice dishes to their soups.  If you are afraid of trying Vietnamese food this is great place to get your feet wet"}
{"text":"My vote for the best pho in Madison. No shying away from tripe or tendon options, the portions are generous (not all broth) and flavorful, and the place is always pretty busy.   Also, as someone else noted - durian drinks, for those who like bananas that think they're garlic. =)"}
{"text":"Run, don't walk, for the exit. Just don't stop in the disgusting bathroom with the built up grunge on your way out. You will find out why at the end of this review. The only thing worse than the food is the service. I received my lukewarm, small, greasy, not at all crispy \"crispy eggroll\" appetizer at the same time I received my pho. I received them quickly, after waiting so long to be waited on, was glad to get my food. I am not being unreasonable- the egg rolls were listed as an appetizer, and NOT as a side dish. . The hostess brought the hot tea, and was apparently too busy gabbing it ya and visiting tables of people she knew to bring it to me before my meal started.  I didn't even want any more, as I ordered it to warm up on a chilly day- and I already had my pho. The pho broth was watery, no beef taste at all, minimal spice taste, and not hot enough- I believe it should be piping, the reason for this, the sprouts and peppers and herbs on the side that you can add. It cooled down even more after I had added  seasonings- more than I normally do- to make it palatable. I saw nary a piece of cilantro. There was a few tiny slices of spring onion floating, and I did not taste any onion, garlic, or other allium in the broth. Once I had added my bean sprouts to my broth, I discovered that they had been sitting in a huge pool of water. Ewwww. There were not many slices of jalapenos, hardly a high price item, I would have asked for more, plus another slice of lime if I were able to track down a server. And more water!  She just dropped the bill and took off, I would have liked her to at least inquire if I wanted my food wrapped, more water, or a dessert. The server did not return until I had finished my meal, to check on my food or refill my water (Vietnamese food is salty, part of why I like it). I could go on. At the end of my meal (this is what ended my meal).  I watched a female employee cough into a rag, then continue drying utensils WITH THAT RAG and putting the utensils into a separate container. No worries, I'm calling the Health Department- this appears to be a TRAINING opportunity."}
{"text":"We didn't really go in with any expectations; but the food was really good! The egg rolls were excellent and the pho was satisfying. For entrees, we had the combination fried rice and vegetable stir-fy, both of which were solid 4 stars! I would definitely go here again....btw, given the food quality and decent ambiance, the prices are pretty cheap, I think."}
{"text":"LOVE THIS PLACE. Been here countless number of times and its always so delicous. The BUN is my favorite but they have lots of good items on the menu. Highly reccomend this restaurant"}
{"text":"Only pho restaurant I go to that satisfies my LA palette... I'm sure a Vietnamese who knows how to make their own pho would differ and wouldn't argue against that. They have okay egg rolls and spring rolls and the pho has great flavors. Mix in some hoisin and hot sauce in your pho to perfect the flavors to your taste! I prefer the rare steak pho, not being a fan of the tripe and all other meats that they offer. I like to put generous amounts of bean sprouts, basil, lime and dip my rare steak meat in a mixture sauce of the hoisin and hot sauce."}
{"text":"My recent fresh spring roll craving was fully satisfied. Thank Saigon Noodles for existing in Madison.   For entree, I ordered stir fried rice noodles with beef in their \"house sauce\" - ok, the sauce was just Hoisin sauce and not much of anything else. My friend's pho tasted pretty good except the noodles was slightly over cooked. Overall, not a bad place to come for a quick Vietnamese fix. Sorry for the bland review, but it was one those places. Except, of course, the spring roll."}
{"text":"It is a good place to eat. The weekend special is usually really good. Spicy beef with bone is my favorite. However, the meat usually has small amount and sometimes pho looks shred."}
{"text":"Love this restaurant and eat here often. Owner is a delightful person. I am a fan of the pho, roasted duck soup and vermicelli bowls. Kids rave about stir fried rice noodle dishes, chicken skewers and spring rolls. Great Vietnamese coffee! Yum."}
{"text":"If you want something different than Pho or noodle soup, their menu is not very diverse. I got the beef with rice noodles dish and it was a small portion and tasted OK (kind of buttery tasting). Not the best that I've had in town."}
{"text":"I have yet to have anything here I haven't liked.   I have an addiction for their vermicelli bowl \"bun\". Make sure you get it with the egg rolls. I'm typically not a fan of egg rolls in general but there is something right about the vermicelli, the vegetables, sprouts and house sauce that give the dish great flavor, texture and soul that I cannot get enough of.   The seating is limited and the service is hit or miss but please don't let that keep you away!"}
{"text":"I love your new look, Saigon Noodle.   Since the remodel, I have been to Saigon Noodle no less than five times. It is gorgeous - large, modern, with a hint of mom-and-pop goodness. Facelift aside, the service is much more efficient than before and the menu is still great.  The best combination meal that I have come up with so far: Vietnamese spring roll (sans pork) + Grilled shrimp vermicelli bowl + thai iced tea. It will be a sure hit. Trust me. :)"}
{"text":"Pho is really outstanding.  Some how the owner/manager always recognizes me and I really appreciate it.  The french bread sandwiches (not sure if they still offer these) are fantastic, great crusty baguettes with fresh veggies and slow cooked tenderloin.  I would avoid weekend nights, as there is usually a line out the front door.  As I write this, my GF is picking up carry out from S.N. & I've got No Reservations Vietnam episode(s) cued up"}
{"text":"Authentic Vietnamese entrees. I enjoyed the beef vermicelli dish. Good spot and would recommend. Service was a bit slow though so don't be in a rush."}
{"text":"Great authentic Vietnamese food, can't go wrong with their pho or rice dishes. On the weekend they have a yummy crepe dish that hits the spot. My only peeves with the place is that service is always spotty and poorly organized. I think they would have a 5 if they fixed that. In addition, never order the Vietnamese coffee because it takes forever to get it for some reason.   KEY NOTE: Portions are small so don't expect to be like super full after a meal, but it is refreshing so if that is what you need then you good to go."}
{"text":"While their food is decent (albeit flavors aren't as intense as I'd like), their food is not what I'd term a good value.  I bought 5 grilled pork sandwiches and asked for extra grilled pork.  That request jacked-up an already pricey $4.25 sandwich to....gasp.....$3.25!!!!  Certainly I should have been more clear on that but caveat emptor.  The big shocker, though, was that the additional meat was a few extra small pieces.  And I do mean a \"few\".  Unfortunately Saigon Noodle is the only game in town when it comes to Vietnamese cooking but don't forget to bring a good sized wallet.  You're gonna need it."}
{"text":"This is one of my FAVORITE west side eats!  I HIGHLY recommend the veggie spring rolls and the number 60 & the number 65 (I think this is it, it is lemongrass chicken with eggroll).  I can't order anything else because I love these!!!"}
{"text":"Can I be a super fan even though I've only been twice and even though I got the same thing both times?  Bún gà nuong xa  In other words...  grilled chicken over vermicelli noodles.  It's tasty. It's plentiful. It's cheap at lunch. It's quick. What's not to love.  I do feel like I need to explore more of the menu before I can make this a five-r."}
{"text":"This is one of the few restaurants in Madison that I keep coming back to every time. I was blown away the first time I came here, and still so impressed the time I came here. There is no other place to get pho in the area with such incredible tasting broth. No matter what kind of cuts of meat you want, there is probably a combination you can choose from on the menu as well. The pho comes with a big plate of bean sprouts, poblano peppers, limes, and fresh mint sprigs - you can choose what you want to put into your bowl of pho. There is also a tray on each table with different sauces such as Sriracha and Hoisin sauce that you can add to alter your pho to your perfect flavoring. I don't know how else I can rave about the pho, other than rambling on about all of the possibilities in creating your perfect bowl of heaven.  I also would highly recommend the spring rolls from here. The peanut sauce is so good that I shamelessly will eat the rest with my fork because I never want it to end.   The prices and service at Saigon are also very reasonable. This is the perfect spot if you're looking for a good bowl of pho or something to cure your hangover!"}
{"text":"Having frequented too many Vietnamese restaurants on both coasts, I've enjoyed my share of pho and other items.  Thus, Saigon Noodle is being compared to all the Vietnamese joints I've been to.  I have to admit, before I first tried Saignon Noodle, I was definitely skeptical.  Being located in Madison, I thought that there was no way in hell the food could compare to dives I've been to in Little Saigon in the OC or in the San Gabriel Valley.  I was pleasantly surprised on my first visit to the restaurant.  The food was better than many of the places I've frequented in the locations listed above.  Their menu is pretty extensive, offering items from pho to fried rice to vermacelli dishes.  I prefer the broth of my pho to be a little more on the richer/fattier side, but Saigon Noodle serves a damn good bowl (blows Nam Noodles on Regent away).  Pho's always my dine in dish, while the vermacelli with pork and a spring roll is usually my take-out dish of choice.  I still need to try one of their Vietnamese sandwiches, which are only available as a take-out.    Meals are of great value, and the family that owns the business are super people.   The place can get super crowded, so be prepared to wait if you go during peak lunch and dinner hours.    Honestly, I can say that Saigon Noodle is my favorite place to eat in Madison, taking into consideration taste, value, and overall satisfaction."}
{"text":"The pho here is hands down the best you will find in Madison. I haven't had anything else here, even though I've been several times over the past few years. You can definitely find much better pho in other cities, but this is the best here, so keep that in mind.  The service, like Ashley mentioned, is pretty odd. Sometimes multiple people take care of your table, and oftentimes they'll fill up one person's water but not anyone else's and make no effort to return to do so. I'm still not sure if you're supposed to pay the bill up at the counter or leave it at the table for the waiter to take care of, and I've been to Saigon Noodles at least 6 times. They also get very busy and start wheeling carts full of dirty dishes around tables full of people eating (sorry, that just grosses me out). The tables are close enough to each other that the cart will inevitably brush anything you have hanging on your chair (coat, purse, etc) and potentially you, so beware.  Decent food but keep in mind that the service is lacking."}
{"text":"I am happy to have found a Vietnamese place that can make all those favorites I grew up with. Having just moved here a few weeks ago, and having lived in NorCal, Chicago, and DC, I was expecting the worst. Being half-Viet, I grew up eating the fried spring rolls, spicy beef noodle soup, and rice dishes. This restaurant definitely gets props for trying to tackle the variety of Vietnamese cuisine. Lots of places can do only one or two things well, but this place has gotten a bunch of things right. It's not perfect, like the rice dishes (com dia) should have the rice chopped, not whole grain, and the spicy beef noodle soup (bun bo hue) was missing the pork blood cake (but honestly I never eat it anyways).  But those are relatively minor.  The staff were really nice and attentive.  So, I will be sure to check out the rest of the Vietnamese restaurants in Madison, but I am happy with this find."}
{"text":"Honestly I've never eaten anything here other than spring rolls, banh mi, pho, and occasional sips of my girlfriend's vegetable soup.  And that is ok, because I loves me some pho.  Pho pho pho.  Best with extra sriracha and chili slices so my eyes water and nose runs.  To the uninitiated: order the spring rolls and pick a pho (and you may want to steer clear of the tripe & tendon on your first try just in case), have a beer if you like, and go to town."}
{"text":"This place was in a strip mall on the West side... I was craving some noodles, so I went. There were tons of people there- a good sign. I had some grilled shrimp vermicelli, and my friend had some pho. We had some appetizers, and they were all good. The spring rolls were gorgeous. Everything was delicious and reasonably priced. I will be returning for more, more, more NOODLES."}
{"text":"Excellent Vietnamese food! Not the usual heavy americanized Chinese food from happy wok. Fresh, well prepared, good service, and absolutely delicious."}
{"text":"Best pho place in town. Great soup base - not salty or greasy. Papaya salad is also my favorite."}
{"text":"This was my first visit to Saigon Noodles and I'd ALMOST forgotten how well a hot bowl of pho fits with a grey, stormy day. Saigon was relatively full but still quick and delicious on this first visit. The pho broth was good, but a slight sweetness through me off a bit at first. Over time as the other flavors married themselves into the soup the flavor improved significantly. I ordered spring rolls and egg rolls to start, both of which were good. The egg rolls may have been slightly on the small side, but very solid flavor. Spring rolls were nicely sized and again, good fresh flavor. I also ordered a thai iced tea right at the start and it took a while to arrive but once it did it really hit the spot. Lots of deep flavors here from strong dark tea mixed with creamy half and half. This is a perfect compliment to a hot and spicy dish and I was a little disappointed that the chili paste I was adding to the pho could never quite get the flavor hot enough for me. Overall the portion sizes were good without being over the top or skimpy (although a little more heft in the egg roll would not have been amiss). The prices were quite reasonable and the service was solid.  I saw a sign in the window for Vietnamese sandwiches but did not see them on the menu anywhere. A really solid bahn mi can be a PERFECT compliment to a good bowl of pho so I was disappointed not to have that option presented.   Apologies for the relative brevity and lack of detail but I visited Saigon Noodles some time back and started the review but didn't finish it. Perhaps it's telling that the overall impression I'm left with after a while is 'good'..."}
{"text":"A clean pho place? Unheard of! I always love hole in the wall sort of places because I'm a firm believer that the dirt and grime makes your food that much tastier. (At least that's how it is in Asia - street vendor food is out of this world).   But yes, this spic and span joint on the west side is definitely the place in Madison to go for Vietnamese beef noodle soup (pho). Their bun bo hue and spring rolls are also a fave of mine. This is asian comfort food at its best in Wisconsin.  Those from larger cities might balk at the price, but it's cheap for around these parts (~$6 for a hearty bowl of soup noodles-)."}
{"text":"Last winter, my husband and I went to Saigon Noodles to satisfy a pho craving and I would describe it as a good meal.... but being freezing cold, despite sitting at a table very far from the door.  Today, my husband and I had another craving and we were in the area so we ventured over to Saigon Noodles.  I would not come back to this restaurant-the chicken skewers we ordered, which were around $6 were made of greasy chicken product (think nuggets) and came without any sauce and stale veggies on the side.  Our pho ga lacked any flavor and arrived cold....I also found a hair in my pho.  The worse part of the meal was being literally frozen.  I will admit that today was a particularly cold day, but the restaurant was filled with folks with their coats on.  Unfortunately, this restaurant is completely understaffed as well...the poor waitresses were running around like crazy and didn't come to the table except to take our order."}
{"text":"Big fan of this place in terms of atmosphere and pho! Prices are a little higher here than at other comparable pho places and you can't pay via credit card unless it's over $15. It can get crowded at dinner and weekend times.  Location is right across the street from the mall and close to tons of other stores and restaurants. There's a small parking lot.  I've only ever ordered the beef pho but absolutely no complaints. I love the red pepper flakes and hot sauce at every table and the big plate of fresh condiments to add to a huge bowl of noodles. Taste is great but it is probably hard to mess up pho."}
{"text":"Just gotta update and say the service here, is, um, weird.  For example, when the server/runner brought us water, she just set the glasses on the edge of the table and walked away.  No effort to put a glass in front of each person.  Same happened with other beverages and dishes.  The first time a server came to our table, they said \"um, you wanna order?\"  Our table \"Uh, can we order some drinks or appetizers first?\"  It's all very odd and I felt a little bad for my guests that they encountered such strange service.  PS the sizzling crepes on weekends is really good"}
{"text":"Great place to enjoy Vietnamese food. You can't go wrong with pho, and they also offer weekend specials which are really good (beef stew and spicy beef noodle!)"}
{"text":"Madison has good pho!  The regular and spicy pho was delicious.  The spicy came with a big slice of pork on a bone. Very interesting. It was definitely one of the nicest Vietnamese restaurants with modern clean ambience. The bahn mi sandwich was good but you can only order it for take out.  Very unusual and they should really change that policy. But based on the food alone, I give it 4 stars."}
{"text":"LOVE their new redesign and renovation!! It looks totally different and WAY classier! It does not look like the stereotypical \"asian restaurant\". I love it when restaurants/stores/companies REINVEST their money into their own businesses because they have pride in their business. This is definitely a company that takes pride in their business.  I always see their employees cleaning or shining utensils. I love shiny utensils!   Plus they never rush you...even if you come in 20 min before closing. (sorry about that Saigon!)"}
{"text":"My family is a frequent flyer to this restaurant. It is a great place to eat it especially during the winters! You can never go wrong with any of their Pho's. Be careful though as their sizes may be larger than your average serving size. To start your meal, you should get an order of the Crispy Egg Rolls and an order of the Spring Rolls. This combination provides a balance of fresh vegetables and crispy fried rolls to get your pallet started. As far as entree's go, my personal favorite is their Combination Fried Rice. It is a young chow type of fried rice with a Vietnamese twist too it. The Com Dia's (Rice Dishes) complimented by a Thai Ice Tea are always favorites for my family. Overall, this place definitely offers a welcoming and open environment. It can get pretty busy at times, so waits are not out of the ordinary. Pro-Tip: Order the Crispy Seafood Noodles with extra noodles for your table. Wow your group with this shareable dish and show them your adventurous side!"}
{"text":"Pho here is relatively delicious! Although there is no seafood pho, #21 is a good option. Opt for the larger size if you're extra hungry. Make sure to get the Thai ice tea to quench your thirst. Happy eating!"}
{"text":"We go here all the time.  The food is great, and the service is OK.  The food comes out quickly and is cheap.  Don't expect your server to be chatty, but they'll take your order no problem.  I'm a vegetarian, and I love their vegetarian spring rolls (#51) and their vegetarian Pho soup (#58).  Yummy, yummy!"}
{"text":"The dishes tasted good, but it's a bit pricy according to the quantities we got. I wish they could offer a bigger bowl."}
{"text":"This is the only place I've found in Madison to get banh mi.  They're not as good as the banh mi I've had in California or Northern Virginia, but definitely good enough to satisfy the craving, and the main reason I come here.  The dinner menu is heavy on noodles and pho; it's perfectly satisfying but nothing special.  I've found the service to be strangely slow, even when the restaurant isn't full."}
{"text":"Not pricey at all, quality of food is above average while the service seldom sucks! Need more servers and apparently they are sometimes just too busy to take care of everyone."}
{"text":"Into pho now and enjoy Saigon Noodle for that too very much.  The broth is not knock-out on its own - - but add in the meats in the soup and the alchemy that is adding in the condiments, then, by the end, you are planning your next visit."}
{"text":"I love this place and go as often as possible.  #12 is my favorite!  Get here early!  My husband and I arrived at 11:15am once and saw they weren't open until 11:30am so we just walked across the street, bought something, came back at 11:37 and there were only two tables open!  The line was out the door by the time we left.  If it's super busy and you don't want to wait for your check, just go up to the counter, tell her what you had and pay.  And if the restaurant is reading this...please open earlier, as pho is the best breakfast!"}
{"text":"Stopped going after seeing a roach on the table...  not the definition of clean, can't imagine the mess the kitchen must be In."}
{"text":"This is one of my all time favorite restaurants. I love the food and drinks. The service can sometimes be a little slow, but they always bring you exactly what you ordered. The atmosphere is also really nice, and usually there's no wait (or a very short one).   I usually get the lemongrass chicken over white rice, or the lemongrass chicken vermicelli bowl. A lot of people really like the pho.   The spring rolls are my favorite in town - they come with beef and shrimp, and a creamy peanut sauce for dipping.   The best part is the Thai iced tea or Thai iced coffee. I would highly recommend giving either a try the next time you're there."}
{"text":"Good pho, and really reasonably priced. We order to-go mostly. We almost always get the pho #16 with 2 different types of beef. We also get their fresh spring rolls which are good and taste really fresh.  I've also gotten the Oriental soup with Noodles and wontons, that was really good too. The broths are not overly salty and the additions of the Thai basil, lime, hosin, and hot sauce add a lot of additional flavor. Every once in a while though they do forget the hosin which is my favorite thing to add but no biggie."}
{"text":"For all my pho cravings, I go to Saigon Noodles, since it is close to where I live. I've honestly never ordered anything different for my entree besides the Pho Dac Biet, so that is all I can tell you about. It's pretty standard and the broth is very good.  I've also gotten the summer rolls. I still think they're a little overpriced but the peanut sauce is A+.  Service is generally pretty quick, so that's good!"}
{"text":"I just moved to Madison and Saigon Noodles was an amazing find. I have been missing my favorite Vietnamese restaurant in Baltimore, and Saigon Noodles made me forget all about it!  Every dish tasted remarkably fresh. The pork skin rolls had plenty of fresh mint. For dinner, I ordered the pho bo vien and my friend had the bun bo nuong. Both were delicious. I chose the large bowl ($7.45) because it was only 50 cents more than the regular bowl, not expecting to finish it. I finished off the pho, all of the mung bean sprouts and Thai basil that came with our dinners, and even wanted to drink the broth at the end!   Although initially I was excited about the strawberry smoothie with tapioca pearls, it ended up tasting a little chalky. It had fresh fruit in it though, which was a nice touch. Next time I will try the avocado smoothie.   Two of us had dinner, drinks, and an appetizer for under $30. What's not to like?"}
{"text":"I come here mainly for the noodle soups. They're all good, but there are a few that are weekend specials. Love the Spicy Beef Noodle Soup!  Had the Beef Stew today with bread, delicious but wish it were thicker. I'm working through noodle soup menu and haven't had one I didn't like!"}
{"text":"I usually come on weekends to have their pancakes only available on weekends. I should say I love this special pancake. As for their pho, I have tried the best pho in Hawaii (they have so many places to have the best pho) so I can't say that their pho meets my standard. It's just okay.  I like their new remodeled place. It's now wider and has always been clean."}
{"text":"Best pho in Madison (granted, there are not too many pho places in Madison). The atmosphere is what you would expect from a vietnamese restaurant: hustle and bustle, no frills. Depending on the time, the service can be slow. But if you like vietnamese food, it is worth giving this place a try."}
{"text":"i come from an area in southern california where theres lots of good asian food and was very excited to find that there was a vietnamese store here...  its ok because theres no competition, the noodle portion is too small for the price and the egg rolls are not that good but since theres no alternative... they get a 4"}
{"text":"This is a pho is soooo tasty, the crispy egg rolls are delish. I would pass on the shrimp fried rice. Nice friendly a atmosphere."}
{"text":"I will preface this with: The food is fantastic. I eat here once every two weeks.  However, before I decide if it is the day to make my bi-weekly trip to Saigon Noodles, I think to myself: 'Am I too hungry to wait the 20 minutes after I order to get my food?' 'Do I have snacks or a second meal ready for when I am hungry an hour later?\"  If my answers are \"No\" and then \"Yes\", then I make my way to Saigon Noodles!  Only once have I gone here and it was not poppin' with customers. This place is extremely popular and that might be its reason for unfortunately slow service. As soon as you sit down, order some egg rolls. Two reasons you want to do this: 1. They are delish 2. They will tithe you over until your food arrives.  After you order your egg rolls, get some water or whatever you would like to drink. Be warned, however, if you order a a Vietnamese Coffee, you are taking a risk. You might get your tasty shot of energy before your meal arrives, you might get it when you are 3/4 through eating your pho, or it may never come. It's kind of a fun game of \"Do-you-deserve-a-coffee-today? And its totally worth playing, for when that sweet cup of fantastic is set on your table, oh baby, be ready to be swept off to heaven.   Try the Pho, try the rice dishes, get a Vermicelli Bowl, and try something with Shrimp - it's almost worth ordering the extra $5 worth of shrimp (but $5 for 3 shrimp is never actually worth it).   In summary: Amazing food. a little pricey for being hungry soon after eating, and slow service- but I'll always be back."}
{"text":"I arrived at eleven just as the place was opening. There was a line of people to get in, which was reassuring. The fact that I think I was the only caucasian person was also reassuring. The server/host was friendly, though maybe a little overworked. I ordered the vegetables with garlic sauce and was left unimpressed. I paid 8 dollars for what seemed to be simply a plate of slightly steamed vegetables with a tad bit of sauce. Nothing terrible about my dish, but I think next time I patronize Saigon Noodles I will order something that's not on the last page of the menu. :)"}
{"text":"I LOVE this place and my #16. I can feel comfortable dining alone or with others in a friendly, casual atmosphere. There is an occasional line (confirmation of good food) but the wait is never that long.   I have been to this restaurant at least 20 times and have never been disappointed."}
{"text":"Just read the review in the Wisconsin State Journal about this restaurant. Please disregard that review. This is a wonderful restaurant that consistently provides fresh and interesting Vietnamese food. The Flavor of the Pho has depth and character and never fails to please! I have been to this restaurant at least once a week for the last three years and have never had a bad meal."}
{"text":"Time for an update.  I've warmed to this place. It's become our weekly, weekend lunch place during the cooler months. Their weekend specials include at shrimp/pork filled crepe that's great. Their pho is consistently flavorful and hits the spot! Madison will never have the multitude of pho joints that Seattle and Portland have but we're pho-tunate to have Saigon Noodles here."}
