{"text":"I was skeptical to visit this place at first since there was another pho restaurant literally right beside it with tons of people inside.  But am I glad I came here.  Now I don't go eating pho all that often but this is easily beats any pho place in Scarborough/markham area.  We ordered a super bowl and tempura spring roll for 2 people and it was a good portion for us. There was a ton of different fresh toppings on there including chicken! The soup base was great and noodles were thin topped with excellent service and 20% off if show you them the promo on yelp.  Hands down one of the best pho places I've been to."}
{"text":"SO HAPPY I FOUND THIS PLACE!!  I don't know how I didn't know about it sooner, as I tend to ferret out and visit all the really veg/an friendly places in town, and I'm in Kensington all the dang time for errands. But I was hungry, knew I could find something vegan in the Market, and looked up just in time to see the sign saying \"All vegetarian and vegan. No MSG.\" I was like YAS!  I've been three times now, and have not been disappointed. It's been so filling and delicious, and fresh!! The staff have all been really friendly as well. And this place hasn't jacked the prices up to heaven just because it's veg either - everything is really reasonably priced!  The vegan pho that I had was extremely tasty and filling, and while I ordered it spicy, I appreciated that hot sauce was on the table so I could make sure it got my eyes watering just the way I like!  The next time I had one of the meals that came with several little portions of various vegan dishes. They were all fantastic, but the Caramel Tofu blew my mind!! It tasted so similar to the Bourbon Chicken I used to get in the US before I moved here and went veg. My friend who came with me also raved about his meal, and was super enthused about my Caramel Tofu as well.   We'll definitely be returning!!"}
{"text":"Friendly and prompt service. The food is tasty with fair sized portions. The pho was very good as was the grilled pork. Will definitely be back."}
{"text":"The tea was very fragrant (floral mix with brown/ roasted rice). The lady working there was very friendly and attentive. The food took a while but was very delicious. I ordered the clear noodle soup and it came a lot of assorted mock meats. The vegetarian imitation crab was very close to the real thing. I enjoyed my experience and would definitely go again."}
{"text":"This place is awesome! Inexpensive, healthy and delicious, next time I'm in Toronto I will definitely return."}
{"text":"It is always difficult to find a vegetarian restaurant to try with friends and get positive feedback. Saigon Lotus is a great place to have some authentic Vietnamese food (in vegan version) with non-vegetarian friends. We ordered steamed rice roll, pad thai, pho, and veggie rice combo; all taste great. The service is good, too. People are super friendly.   I will definitely recommend this place to my friends and come back to try the other dishes."}
{"text":"The service was excellent. The lady who helped us was super friendly and was very kind answering the questions that we had. We ordered the brisket noodle, lemongrass pork on rice vermicelli, pork and shrimp roll, and the 3 colour drink. The herbs that came with the noodle were very fresh (according to my boyfriend). I loved the lemongrass pork on vermicelli/ Overall we really enjoyed our dinner, definitely going back!"}
{"text":"I wish I could find a place like this in SF!  Varied menu with tempting options, and everything is flavorful and tasty!  I had vegan combo while my companion had pho stir fry with loads of veggies.  We loved them both.  The place in the heart of Chinatown is clean, friendly and peaceful!"}
{"text":"Currently my favourite vegetarian food place. Food is well-seasoned and has mock meat options. Vegetarian Pho is really flavourful.   I have to leave this rating because I was having some expensive vegetarian food elsewhere and I kept regretting my decision of not coming to Saigon lotus instead."}
{"text":"We had the avocado tofu roll which was good, with sesame sauce, which we liked. We did not like the fried tofu nuggets (which were literally chopped pieces of deep fried unseasoned tofu). Curry noodles were ok, not great. Sweet and sour tofu (33 i think) was terrible and tasted like tofu in ketchup. Pho tofu was very good. I would recommend for the Pho, but not other dishes. Better quality found at Kings Cafe just a short walk away, by Kings doesn't have Pho.  Did the 20% off yelp check in."}
{"text":"Never thought I would be able to love a totally vegetarian meal as such a avid meat eater but the food was so good! The waiter was so nice and let us split the bill five ways.  I got the bun vermicelli with crispy roll and the combination of fresh veggies and the tofu was delicious. Would totally recommend. My friend got a green curry with eggplant and also commented how they would not mind being vegetarian if every meal was like this!"}
{"text":"We ordered few different dishes to try out. Liked the crispy vegan spring rolls and steam rolls. But we have had better pho elsewhere. Also, We ordered a rare beef pho but they brought us house special pho instead. Asked the waiter about it. But his response was somewhat skeptical as if we ordered wrong!"}
{"text":"Came here at a rainy evening I was the only one customer there. Quite, small and clean. This is a small clean and vegan friendly place, I ordered steamed rice roll with mushroom. The mushroom on the top is crispy, it has some mint as well which is definitely a big thumb up! When I was half way to finish the meal, I felt a little bit oily, but their special sauce helped me a lot.  Overall, if you are a vegan and try to find a place to eat in Chinatown, here is the place for you."}
{"text":"Really delicious Vegan Vietnamese food!!! Really good service and it's really affordable and tasty and super cheap!! I love the different types of tofu (sweet and sour was so good and the one with mango) and their miso soup is great. Will come back again a lot!!!"}
{"text":"Restaurant only offering vegan or vegetarian options, which is fine.  However, pictures of beef pho is still shown on the website.  Wasted 45 mins going downtown with friends who eat meat."}
{"text":"Delicious, fresh, tasty!  Non food related stuff: This place is pleasant on the inside. Staff were super sweet. There was a few problems with getting out correct orders but they fixed all problems and apologized. Also could streamline the process for splitting bills.   FOOD:  Ordered the steamed mushroom roll and the bun bo hue soup. Steamed mushroom had great dipping sauce. Soup was great - Mock meats were excellent and tasted real, great texture. Soup wasn't too spicy so I added more spice.  Love it and will be back."}
{"text":"We were the first to arrive when the restaurant opened for lunch. The lady didn't have any smile and wasn't welcoming. When we tried to grab her attention to order, she ignored us and kept playing with the TV remote to play some DVDs or CDs to play atmospheric music for the restaurant. I would rather see a smile and an attentive server than hear music forced on us. She could have taken the order send it in and then play with the remote. But I guess to her we weren't that important... the food was not bad but they didn't give us a dish that was mentioned in the set menu. I would go back again, because we just don't like the server's attitude!"}
{"text":"If you want perfect price to quality ratio-this is the right place! Great vegan and vegetarian dishes under 12$. I would recommend their tamarin soup! This place also has indian cuisine options!"}
{"text":"Delicious. The freshness and quality of the pho and all the ingredients clearly showed. I loved the taste of the broth, the noodles, the mock meats, the rolls - everything! Prices are super reasonable for the portions (a small size is good for a meal), although I was slightly disappointed to see that the bowl was filled with mostly noodles and not much else. But again the taste was so good I can't really complain.  The restaurant itself was quite spacious and quiet with relatively private booths, which was nice. Service was extremely quick and friendly: no prompting was needed for seating, water, or the menu; there was very little wait for food or the bill as well.   So happy that their menu is very very long - and with a huge variety for it all being vegetarian! I will be back for sure. Actually, I think this will be my go-to place for pho downtown from now on :)  Can I just say again that the food was SO GOOD???"}
{"text":"I really love the sweet and sour tofu. The tofu is perfectly crisp and light. The sauce is sweet, tomato-y and a bit tangy. The proportion of tofu to veggies is spot on and the portion size is generous. I highly recommend this dish.   The spinach and cheese crispy rolls were filled with spinach and tofu and were nice but I didn't like the tamarind sauce that came with it. I will stick to the veggie crispy rolls next time.   My partner really liked the spicy lemongrass tofu with Pad Thai.   Overall, this is very good quality food at very reasonable prices."}
{"text":"This place is a dream come true for vegetarian who enjoys viet food. 2 side menu, regular and vegetarian.  Best vegan pho broth I've had, very aromatic and taste quite close to the regular pho broth. The vermicelli bowl was so damn good! While still eating I was already planning my next visit.  I couldn't stop being amazed and feeling blessed while eating here.   The steamed mushroom rice rolls were very light and refreshing, not sure what the sauce was that came with it, I pretty much drank it after finishing the rolls. I believe there were some fried king oyster mushroom strips on it, I would love to just eat a full bowl of it, that thing was addictive. Great appetizer, a must try!!  There's a very friendly family vibe here, servers are all really nice. Seems like Saigon lotus is getting more and more busy now, so do come earlier to get a table, if you are feeling lazy, they are ok foodora as well.  Highly recommended !"}
{"text":"Wow, coming to this Vietnamese restaurant is a whole different experience.  The quality of the food is great.  Tried the steam rice rolls.  It's really fresh and hot.  Pho is good too.  Coming next time for the vegetarian stuff.  I'm allergic to MSG and it don't have it."}
{"text":"My new favourite for Viet! Delicious vegan menu too! Loved the tempura shrimp and avacado salad rolls."}
{"text":"This place is so good, can't believe there's no MSG and also it's vegan. The price is really cheap also I'm in love"}
{"text":"I had initially come to check this place out because of the 20% off with a Yelp check-in and I was very curious as to what vegan pho would taste like and I was not disappointed! This place is officially my new go-to vegan eats spot.   They have quite a large variety considering they only offer vegan and vegetarian options. Most dishes are Vietnamese/Thai/Chinese inspired dishes. I've tried their vegan pho and bun bo hue for their noodles in soup and personally like the bun bo hue better. Both soups are very flavourful and you don't feel like meat is missing at all! They're both topped with different vegan \"meats\" some of which are fried and crispy.   My favourite thing on their menu is their rice noodle rolls. The wild mushroom roll and portobello and vegan meat roll are both amazing and go for $5 each. The mushrooms are marinated very well and you'll be surprised by how flavourful they are.   Another must-try is their iced lemon lime/citrus tea (I can't remember the exact name). It goes for $4 but it has a really nice tea flavour. I never get disappointed when I visit and always find myself craving their food. Definitely excited to try their fried noodles and rice dishes."}
{"text":"Great atmosphere, loved the decor and the food was superb. You got to try the mango-coco bubble tea, yum"}
{"text":"I love it the first time I came but the second time I ordered chicken in hot pot and it was like the worst chicken ever. The meat was so dry and tasteless. I see people post photo of hainan style chicken in hot bowl but couldn't find it in the menu so I thought that the chicken in the hot pot I ordered would be similar but no, the chicken looks completely different. I could cook the meat better..."}
{"text":"Good food and nice service! Convenient location for U of T students."}
{"text":"New favourite restaurant. Reasonable prices and generous portions. So many delicious options and every meal I've ordered here so far have been tasty and out of this world. Would recommend to anyone any day! Best vegan/vegetarian restaurant"}
{"text":"Great savory food. The Pad Thai Lemongrass Tofu was awesome, the spicy lemongrass tofu vermicelli bowl was even better! Really glad we took a chance on what seems like an up and coming place!"}
{"text":"Just ok. After seeing the rave reviews on Yelp, I convinced our group of six to hike over to Saigon Lotus for a post-pride parade dinner. First impressions left much to be desired - we felt we would need to be literally wowed to deserve the 4.5 star rating. Although the food was decent we certainly weren't wowed. Overall this is a good spot if you are vegan or vegetarian. If you are a meat eater, there's better to be had."}
{"text":"Unfriendly treatment from staff, slow and mix up orders. Food too salty but the spring roll was refreshing that's why 2 stars."}
{"text":"Love, love, love the food! Admittedly, I have never been inside the restaurant. This is my go to Uber Eats or Foodora restaurant. As a vegetarian it is so awesome knowing I can order anything on the menu without worrying about hidden animal bits. But besides all of that. The food is just plain delicious.   I usually opt for a combo which serves as two meals for me... the portions are very generous. I have tried every dessert in their menu and like them all. The sweet and sour crispy tofu is my personal favourite. I wasn't too thrilled with their fried spring roll, but that is the only thing on the menu I wouldn't order a second (... third, fourth, or fifth...) time.  There was a time when the uber or foodora person (honestly can't remember which) forgot my bubble tea. The restaurant called us before the food arrived to apologize. When does that happen? They graciously gave us a free tea with our next order and a bonus dessert."}
{"text":"Went to Saigon Lotus yesterday for dinner with a friend and we had an amazing time. Saigon Lotus is located just behind the famous Pho Hung, which is well-known as THE place for Pho in Chinatown.   We went to Saigon Lotus because my friend can only have vegetarian options and there was a vegan Pho being advertised.   My first impression of the restaurant was that it was clean, simple and family-run. Someone greeted us at the door and proceeded to seat us. The atmosphere is definitely casual and not meant to be fancy, yet it felt very comforting and warm.   My friend ordered the vegan pho and also a cold spring roll dish. I ordered the number 80 Pho with beef large and also the hainam chicken so I could take it for lunch. It was the owner who came to take our order. She told us about the special where Pho was buy one get one free, so we took advantage! She also looked at my order and asked if I would be able to finish everything. I really appreciated that she took the time to make sure I was not ordering too much instead of just trying to maximize on profits. I told her it was fine since I was planning to take it home and have it for lunch the next day.   Our food came about 20 minutes later. Compared to other Pho restaurants, the portions here are not as large. However, when you consider that we were getting one Pho for free, it really made sense why the portions were a little less, although by no means were they skimping. Nevertheless, the taste of the Pho was great. It was flavourful and delicious. My friend, who had the vegan Pho and is a bit of a foodie, really enjoyed her Pho as well. The large Pho cost $8.50, which is pretty cheap.   We also immensely enjoyed the cold spring rolls which came with a delicious peanut sauce.   The hainam chicken I ordered came last but not least. This dish came in a stone bowl and the portion was huge, with steamed chicken, cilantro, mushrooms, and a few other toppings over fried rice. I was so full from the Pho by this time, I really didn't eat too much of the chicken until the next day. It tasted great and the portions were so big I still had leftovers for dinner that night. The chicken was not overcooked, not greasy but tasted fresh and clean.   Also, the owner packed an extra soup for me when she was packing my chicken to go.   Overall, we were both really, really happy with our meals. All in, we spent $31 for the 2 of us, which included 2 Phos, a cold springroll dish, and my chicken over rice dish. And that price includes the 20% tip I left.   Definitely coming back here, even without the promotion."}
{"text":"Quick service. Delicious food. Comfortable atmosphere with live plants and instrumental music playing in the background. The mock meat tasted extraordinary. We tried the vegan crab meat salad roll which I could hardly taste the filling of. These salad rolls compared to Vietnamese salad rolls I have tried is smaller. I enjoyed the peanut dipping sauce. We also tried the steamed vegan mock ground meat roll and I thought it was SUPERB to my taste buds! We ordered the small vegan pho and that tasted very fresh. The noodles were chewy. The vegan mock meat taste uncannily similar to real meat to me. We also tried the vegan BBQ meat vermicelli noodles with spring rolls. I like how all Vietnamese spring rolls I have tried so far is really crispy (double skin?). This dish was flavored with a few different types of mock meat (mock bacon, mock pork belly, mock pork) which added texture to the dish. The fresh salad and pickled veggies also cleansed the spring roll. I highly recommend the taro pudding!"}
{"text":"My husband and I stopped by Saigon Lotus while visiting Toronto and are so glad that we did! We shared the vegan butter chicken and the BBQ Pad Thai and they were both DELICIOUS. Would visit again and highly recommend to others. I want to go back already!"}
{"text":"I literally think about the vegan Pho and fresh rolls every day. I am obsessed with this place. Love the separate vegan menu, delicious fresh food, friendly service and warm casual atmosphere. Have yet to order delivery but I'm sure it will be just as good. I would recommend this place to anyone - it's fantastic!"}
{"text":"Amazingly delicious vegetarian Bun bo hue!  The broth was steaming hot, flavourful and infused with lemongrass, annatto seeds and had a slight spicy tinge but all very palatable.  The bowl came with enoki mushrooms, cubes of tofu, deep fried tofu puffs, mock meatballs, mock Ch la, and seitan.  You will almost forget you're not eating meat as all the toppings combined will satisfy your appetite.  I also ordered the steamed rice rolls with mock minced meat and mushrooms it was sprinkled with a few shreds of deep fried portobello mushrooms and plenty of mint leaves. Drenching the rice rolls with the nuoc cham dipping sauce is a definite must.   Will return again for sure with the 20% off your bill when you check in with Yelp.  The discount makes the price of your meal very affordable."}
{"text":"Already planning my next visit. I ordered a fried fish dish with a mango slaw on top of rice and boy was it delicious. My family is a mix of Khmer, Viet and Chinese so this meal really hit the south east Asian spot. Can't wait to come back and try some other menu options. Compared to Pho Hung the owners and workers are more hospitable and overall customer service is top notch here!"}
{"text":"3.5/5  We came here around 5pm on a Sunday evening and there were still ample seats around. I got #31: the noodles with BBQ vegan meat (seitan if you're unfamiliar), crispy roll, and vegan fish sauce. The food was just okay. I had their egg noodles with soup before and they are a much better deal. Especially because they add more of the seitan and the vegan fish cakes which taste exactly like fish cakes. The crispy roll was good and true to its name - crispy with some noodles and veggies. It tasted good but overall, the meal was A-OK."}
{"text":"After reading all the good reviews, my friends and I went to try this place out. We all ordered different bowls of non-vegetarian pho and also their rice noodle rolls with mushrooms to share. I had a raw beef pho and while the herbs/garnishes plate was generous and fresh, I didn't really like the pho itself very much. I think the main problem was how thick the beef was sliced and it was a bit tough because of that. The rice noodle rolls were pretty tasty though and I would order them again.   It's hard to find Vietnamese restaurants with so many vegetarian and vegan options so I think this place definitely works well for that. However, as a meat eater, I think I can find better beef pho elsewhere. I probably should have ordered a veggie dish instead but if they have something on the menu, I expect it to be good."}
{"text":"This is a great Pho spot. The soup tastes just like non-vegan Pho and doesn't feel like it's lacking in any way like I thought it might when I was thinking about coming here. The portions were large - we shared a large bowl of Pho and that was enough for the both of us. Overall a great Pho spot and I will definitely be back at some point!"}
{"text":"The spring roll was really really good. The other dishes we had were good but nothing too special to register with me. We got a discount for posting on social media and the server was very nice too. Very affordable too."}
{"text":"This is by far one of the BEST viet restaurant left, it's hard to believe it is an all vegetarian/vegan place! As a Viet, viet restaurants are a dime a dozen, yet not many left to impress. It could be very much that growing up eating the food of my people left me jaded and hard to please...or simply because knowing how to make the dishes at home it prompts the question, \"why the hell am I paying for that?!\". I am undeniably fugal, especially when it comes to Viet food...I would splurge on sushi, Chinese food, and even fast food...but never Viet food. I unreasonable EXPECT value and quality for the price I am paying, with that being said...  Really this is one of the best I've had thus far. Notable is their quality, I would not hesitate to pay a bit more for this. I am, by all accounts, a carnivore, and if any places that fail to offer meat can still leave me wanting more, it's an A+ in my books.   Starting off with the broth, offered alongside the entrees, there is notable depth and umami taste - it does not taste artificial nor does it have the after effects of the overuse of MSG (as most viet places do). Simple clear broth that just simply delicious. We ordered an order each of Steamed Rice Roll with fresh wild Mushroom, the Spicy Lemongrass Tofu, Seiten and Crispy Roll Bun, and Pho Vegan.    Steamed Rice Roll with fresh wild Mushroom - The taste was outstandingly fresh. Steam-rolls can easily go south if stored improperly or for too long. The shelf of these are not long. These came out perfectly chewy and the \"nuoc mam chay\" that accompanied the dish was just as perfect as it can come close to short of having it made table side. It's the right chewiness and ratio of fillings. My only gripe was the lack of bean sprout and herbs that I've been accustomed to.    Pho Vegan, again with the topping and the broth...it was an absolute delight. It is expected that a vegetable broth will not have that heaviness of the usual beef broth, but it was none the less a pleasure to enjoy.  The noodles were a nice slightly al-dente consistency as I prefer, and topping galore. I would've preferred it even more so if the broth had a more distinguishable taste of PHO (ginger, cinnamon, star anise, etc.) but that's my preference.   Lastly, the bun was just mind blowingly delish. Much like the non-vegetarian version, the contrast of the fried and grill topping gave the dish its signature smokey, savoury taste. The lemongrass was quite pronounce and was much appreciated. Once again, the \"nuoc mam\" sauce was very well done. The rice noodle, once again, had a lovely consistent chewiness.  Hats off to the chef. I hope that the quality will not deteriorate over time and will definitely be back. This is good food at its best, pure unadulterated goodness.  TLTR: AWESOME VIET FOOD...FORGET IT'S VEGAN...JUST AWESOME FOOD!!!!"}
{"text":"2 sided menu. One is vegan while the other isn't. The vegan options are plenty. I ordered combo #1 which is a sampler of 4 different items with rice. Great taste. Very reasonable price. 20% off Yelper special. Spacious place. Overall great experience."}
{"text":"A quaint little vegan/vegetarian  Vietnamese restaurant in Chinatown.  I would say 95% of the menu is vegan.  If it's not vegan, it's very obvious as they will list the ingredients m They have a good range of vegan pho and mock meats and a lot of tofu based dishes. I had a coconut curry vermicelli with tofu and veggies and my gawd, this was one of the best curries I had. It looked soupy when I received it, but then once I took a bite, it was nice and creamy and I was so shocked that it was vegan.  My friend also ordered a vegan combo for $10, which looked great.  What was also great is that they had some vegan smoothies.  Yummy.  Verdict: If you're vegan or vegetarian, love msg-free Asian food, are in the T-dot, this is a great place to eat."}
{"text":"THIS IS MY FAVOURITE VEGETARIAN/VEGAN RESTAURANT IN TORONTO RN. i've been here around 6 times and have never been disappointed. the food is great and at an affordable price. cant think of any other vegan/vegetarian vietnamese restaurants in toronto. i've been here two days in a row so far and might come back for a third. highly recommended!"}
{"text":"I came here for the second time and was delighted once again. Such friendly and efficient service and wonderful tasty food!"}
{"text":"Pretttttttty good.  I really wanted meat but they made my first vegetarian experience aiiight. I didn't die without the meat! Satisfied ^^"}
{"text":"If you're looking for healthy(ish) Asian takeout this is the spot! The root veggies salad is surprisingly fresh and flavorful. We had a variety of dishes and loved them all!! This is our new go to uber eats delivery, holds up great. You won't miss the meat or be disappointed!"}
{"text":"Ordered crab meat spring roll and special beef noodle soup. The spring roll is ok. Generous amount of meat in the soup. The noodle tastes a bit undercooked which I don't mind, better than overcooked. Personally I don't like the sweet taste of the broth. It feels like they added sugar to balance too much salt in the broth. Nice dining place."}
{"text":"so first of all, I'm the biggest meat eater and I was a bit negative about trying a vegetarian vietnamese restaurant since I've grown up eating all of my mom's classic vietnamese recipes that includes meat in all of them. let me tell you, this place took me on an emotional rollercoaster. everything I tried in the \"bun bo hue\" got me asking myself  \"this is not real meat?!\" I was so happy and this restaurant is probably the best vietnamese restaurant around as they don't use MSG and heavily rely on flavoring w/ meat. because one essential thing in pho is the meat bones, so I'm shooked!!!! one thing I did not like is the lack of attention you get from the servers, I was in such a good mood that me and my partner just laughed it off and made jokes about it. we legit waved our hands around, called out, and got their attention like once. eventually we just got up and asked for whatever we needed- so one star knocked off."}
{"text":"I've been dreaming of the vegan pho here with its deliciously umami clear broth, assortment of vegan meats, and chewy rice noodles ever since my first visit last Friday, so literally couldn't fight off the urge to come here after work tonight for an early dinner. 5/5 service today, much better and way more personal than the first visit when we experienced slow and inconstant service because they were so busy. Tonight at around 6PM customer flow was light, so I had the chance to speak one-on-one with a few staff members - such wonderful people!  I ordered the Tuesday special - buy a $4+ drink and get 50% off any entree. I ordered a lychee fresh smoothie with only fresh fruit and ice, no sugar added by my request and tbh the fruit itself is such a wonderful natural source of sugar you really don't miss out on anything by omitting added sugar. Vegan bubble tea (also $4) are another drink option. They also have teas, alcohol, and fruit juices here.  I tried the vegan crab and BBQ meat pho (#26) today and wasn't as impressed with it as I was with the vegan pho (#20). There weren't enough toppings or vegetable variety. They put romaine lettuce in there and I'm not a fan of warm, soggy salad-type lettuce. The vegan crab was pretty standard and similar to the grocery store variety, but the vegan BBQ meat was sooo real!!! It even came with the fatty vs. lean layers, just like real pork. It was also seasoned perfectly, so the lean cut especially tasted just like real BBQ pork omg. Lastly I had the avocado-vegan crab summer rolls ($3). This appetizer is really light, but the with miso-peanut sauce it becomes pretty filling. Total bill was just under $13 including tax... Incredible value.  Will be back to try everything on their menu lol"}
{"text":"Little gem of a restaurant. The menu is a few pages long and all dishes we have tried have been delicious. Saigon Lotus has dessert options but our favorite is their sticky rice with mango. Drink options (non-alcoholic) are plentiful.  No MSG, vegan, and flavorful. This is a 10 in our scale of goodness.   The restaurant is clean and lovely and it reminded us of our travels in southeast Asia.   The location is easy to get to... It's Kensington market but on the quieter side, right off Spadina. Good for families, groups too. Service is friendly and prompt. A must try.   Saigon Lotus is really one of the best vegan restaurants in the city. Price point is very reasonable (not expensive at all)."}
{"text":"Love it! It's so affordable but the ambience and the food is quite superb and simple. Will definitely be visiting again for their beef pho. Was amazeebbaallsss!!"}
{"text":"This is my first yelp review! That says something about this food!  IT'S AMAZING!!! This is the ONLY Vegan and Vegetarian vietnamese food that I had in Toronto. I cannot wait to come back!!!  All the food is amazing, clean, tasteful, and makes you want to keep eating more!  DEFINITELY A MUST TRY FOR THE VEGANS OR VEGETARIANS OUT THERE!! EVERYTHING IS AMAZING!!  -Sorry, my phone does not do the food JUSTICES!"}
{"text":"I've tried almost everything on the menu and I can't get enough.   Best vegan food with excellent variety I rat here once a week.  The service can be slow but they're trying their best I promise."}
{"text":"This place is fantastic. The only problem myself and friends/family have encountered is the service. It's almost self-serve. There are many dishes to choose from. The pho here is great and their 3 bean dessert is one of my faves too. I believe this dessert is vegan as they use coconut milk instead of condensed milk. Will definitely go back. This is one of my fave Viet restaurants. It's just as good as Pho Linh and Pho Tien Thanh."}
{"text":"As someone who isn't a vegetarian/vegan, I'm obsessed with this spot. It's truly amazing to see the creativity in creating different meats here. While it doesn't exactly taste like meat, there's such a wide range of flavours and textures that goes beyond your typical tofu interpretation of a vegetarian/vegan mock meat. I've taken my vegetarian friends here and they have become obsessed as well. I recommend the clear glass noodle dish with mock meats!"}
{"text":"I am a carnivore but this place gave me the best bun bo hue and I didn't miss meat. If that's not enough, Saigon Lotus has better vegetarian food than what I had in Vietnam. Will be here often."}
{"text":"The vegan pho and butter chicken is really good. The pandan flavoured water is refreshing."}
{"text":"This place is dope. Great prices and the Vegan Pho was fantastic. I'm not Vegan but my girlfriend is and we both agreed this is the best Vegan Pho we've had in the city to date. I highly recommend!"}
{"text":"Me and a friend were in Kensington market for the day and decided to grab some lunch at this Vietnamese inspired restaurant. We ordered the spicy pho and the assorted platter with rice. The prices are reasonable for the area and the portion size. The soup was my favourite it wasn't too spicy and it had great flavour. Also to mention we have no idea it was a vegetarian and vegan restaurant prior to making our selection but you can barley tell all the mock meat was vegan! Overall definitely recommend."}
{"text":"DELICIOUS and affordable! Where has this place been my whole life? The pho I tried (#22) was flavourful, spicy, and contained lots of veggies and vegan meats that I've never tried before (all perfectly seasoned). The portions were generous and served quickly by very nice staff, and the restaurant is bright and inviting. As a vegan I will never feel like I'm missing out on anything ever again--am definitely planning on going back and trying everything on the menu! My husband had the veggie combo #2 and he loved it, despite being a meat-eater. Very pleased with this new discovery!"}
{"text":"Decided to check this place out yesterday and it was amazing! I had the fresh rolls, vegan tofu pho, and a pineapple smoothie and loved every bite. The pho is huge and super flavorful for only $9. I loved that they had booths and all the plants inside. I will definitely be returning :)"}
{"text":"Probably the only vegan pho in the city, so brownie points to start. The soup is solid, but would have loved? more seitan, and variety of it in my pho. With the 20% off Yelp offer though, I had to give it a 5 stars. Oh and the steam rice roll is heavenly!  P.s. they've gone full vegetarian/vegan now but it's still a great place for all IMO. We can all use a little break from meat from time to time."}
{"text":"Finally visited this place! Pretty good bun bo hue, especially for being vegan/vegetarian. It tastes like East Chinatown's Que Ling's or Dufferin's Linh's BBH - similar broth but with no meat. Not very spicy, either. However, doesn't beat the best bun bo hue in the city, Bach Yen (please visit there, it's AMAZING and actually spicy). Came to around ~$13 for a large after tax + tip."}
{"text":"Amazing place and food I will definitely come here again I ordered combo 35 which contains some thick noodles with tofu and vegetables. The taste was amazing loved the food. The food was healthy and make u feel light and energetic after. I also ordered the bean shake with ice that they serve in vetnamiz resturants the test is same as other stores. The woshrooms are decent smelled good nothing super fancy? which is fair enough as the prices are low for this restaurant. The radio channel they were running seemed to lag not sure why but maybe it's for one time problem.   Will definitely recommend this place for other friends. They have two sided menu one side is vegan one side is not so pick wisly."}
{"text":"Very delicious and fairly priced vegan and vegetarian food. Tried their pho and if was absolutely delicious, and I'm not vegan nor vegetarian myself."}
{"text":"Been here twice so far and found that it was pretty good amidst all the pho places in the area. Broth and noodles are decent and good portions for a large ($8.50). Staff are very friendly and place is much cleaner than any other pho place around.  I think they're the same owners as Ginger but found that the quality is slightly better. Give it a try and support a local business!"}
{"text":"A friend and I decided to give this place a try, as they promote themselves as an \"Authentic Vietnamese & Vegan Restaurant\", and we are both vegetarians. When we walked in we were greeted warmly by our server who quickly sat us at a table. There are two sides to the menu, a regular side and the other is vegan. As a vegetarian, I've never had so many options to choose from in a Vietnamese restaurant, and they all looked delicious!  For appetisers, my friend ordered a Tofu & Avocado Fresh Salad Roll which came with a miso peanut dipping sauce, and I ordered a Yam Tempura & Avocado Fresh Salad Roll which came with soy sauce. For entrees, we both proceeded to order the Spicy Lemongrass Tofu Vermicelli Bowl which came with a vegan \"fish\" sauce; which we were both sceptical about when it arrived.   The fresh salad rolls were pretty good as the ingredients were fresh and complemented well with the dipping sauce provided. The vermicelli bowl was amazing, but not so much in the presentation of the dish. The spring roll that came with the vermicelli was fairly unique and really tasty which were made with mixed vegetables, lentils, and chickpeas. The pieces of imitation chicken were fairly tasty, had the same stringy texture as real chicken, however, my friend wasn't impressed with it as he is not a huge fan of soy based \"meats\", \"If tofu is already fake, imitation meat is faker than tofu.\" I took one star off as the vermicelli were either overcooked or the quality of noodles was not the best considering there were a lot of broken pieces that required us to use a spoon to consume it -- lastly when we were on our way to pay at the cash register witnessed a server picking a piece a vermicelli from the bowl and putting it in his mouth as he was bringing out that dish to a customer.   Overall, it was a great experience as the servers working there were friendly and fairly attentive to our inquiries on a number of dishes. Numerous times a few servers came by our table to check in on us to see how things were going and how the food was, which I appreciated. I can see there is potential popularity amongst this restaurant in the near future as they are located right beside Pho Hung and within Kensington Market district. I would like to see them open later on weekends for any night goers who are vegan or vegetarian looking for a quick and affordable place to eat. I would definitely come back to try the rest of their other vegan options available. Highly recommend this family run restaurant!"}
{"text":"Tried it long time ago, Pho is Pk but the fresh rolls with crispy shrimp/pork are to for!! Will definitely come back again."}
{"text":"Vegan indeed! Most satisfying mix of flavour and taste. They were able to make the veggie meat, tofu, and eggplant to taste like BBQ b**f, smoked Unagi, curry F*sh balls, and sweet/sour P**k. It was the most surprising last minute decision I have ever made on my late night food craving runs.   I ordered the veggie combo B for $10, and #25 the egg noodle pho (reg) for $7.50.  It was so satisfying and intriguing that I will return to check out their Combo A ($10), and other pho plates!  P.S. the meals contain onions, garlic, and chives (for those who are religiously vegetarian)."}
{"text":"Ok, dropped by again to sample some more dishes and I feel like the place deserves 4 stars overall. They do have a number of very well-made, delicious, and unique options here. The pho however is rather lacking and is far from the best veggie pho I've ever had."}
{"text":"Pros: Food quality is good. Portions are small, so you better more numbers. Ambience is good.  Cons:  not specific to this place. But in general, I think I am getting a dislike towards vegan restaurants. All those fake meat stuff (predominantly soy and tofu based) is pissing me off. I would rather go to a decent vegetarian place and have good plant based food."}
{"text":"Small spot out of a house around the corner from Spadina in China town. I loved the \"Vegeterian only\" sign out front which highlights the fact that i could order anything on the menu. The staff is very nice, the decor was clean, and it had a nice vibe.  We ordered the yellow curry vegan combo, butter chicken, and spicy vegetable rice with pinapple. Unfortunately, the dishes were ok but we low quality compared to the price.  Also, I would have given more stars had i not waited for my dish while everyone at the table ate theirs."}
{"text":"They now take credit cards for online delivery!  This time we got everything we got last time as well as the vegan pho and yam tempura rolls. Super delicious!  Owner was again awesome and called when the order was on the way.  Go check them out!"}
{"text":"Tried this place for the first time - with my neice who is vegan (I am not). Delicious! We both had pad thai....and really enjoyed it! Started with the fried spring rolls. They were tasty, but a little greasy. But would still order it again."}
{"text":"The prices are unbelievably reasonable, the food was mind blowing and the staff was friendly. I'd go back for sure."}
{"text":"Ordered the Oxtail Pho. Broth was flavorful and they put in a generous amount of oxtail. It was cooked perfectly to where the meet fell off. They offer a 20 percent check in deal for yelpers. I elected not to use it because I want to support restaurants that serve good food at a good value."}
{"text":"This is one of the best Asian vegan restaurant I have ever been to! The food was absolutely delicious and the price was reasonable. I could eat this all day everyday!"}
{"text":"Awesome vegan Vietnamese food in Toronto's Chinatown!  I came with a friend (non-veg) and we ordered the spicy lemongrass tofu-avocado roll, the vegan pho, and the vegan combo 2. With tax and tip (plus the yelp check in discount) it came out to just over $25. PLUS you'll probably have leftovers!  The spring rolls were great, as they generally are (it's hard to go wrong with rice paper and tons of fresh veggies!) The vegan pho didn't taste like a traditional pho, but given that it's a vegan soup that's only to be expected. I love soups in general so I was really happy with it! I also highly recommend getting the vegan combo (2). It's about the same price as getting any one of the individual components, but this way you get to sample!   So in conclusion, I liked everything and doubt that you could go wrong with anything you order."}
{"text":"Disappointing.  Pretty hungry, my choice for dinner was Saigon Lotus based on reviews and photos. So, why is it a one-star for me?  1. Hygiene - I sat at a table that was all sticky and the menu was actually almost glued to it. 2. Service - More like fast food, pretty quick, but I had to go get my own napkins and chopsticks or cutlery. 3. Menu - a lot of options on both vegetarian and non-vegetarian. 4. Price - good portions for value 5. My order - what gave it a 1 - Contemplating between a combo of small dishes or one main meal, I went for the latter, which was combo 35, pan fried rice noodles with a mix of fresh vegetables and sauce. Excited to try a new Vietnamese hot dish, this is what I got: a warm plate of sticky noodles, topped with mere samples of almost raw vegetables, soaked in a watery sauce that splattered all over my face and shirt. - vegetables were barely cooked or stir fried - vegetable quantities were very small, such as mushrooms, a few slices that might not combine to one whole. - Sauce: coloured water on the bottom of the plate below the nest of noodles. So watery every time you fork up a bite, it leaks down to the bottom. - food was not hot enough, more like microwaved.  This is all based on my experience from trying a vegetarian noodles dish. Don't let this review stop you if you want to go try it out, because food review is based on one dish. My only mistake... not taking photos to post.  Personally, I would never go again to try other menu options."}
{"text":"What a pleasant surprise.   As someone who has to have some sort of chicken or beef incorporated in every meal, I can say that their pho here was delicious.   I ordered their regular pho noodle soup and was very impressed. The broth was rich and flavourful and though just a taddddd bit sweet, it was easy to balance out by adding a bit of lime. My favourite part of this meal, however, was the assortment of tofu and \"meats\". I don't even know what I was eating but there was so much variety of flavour and texture in each bite that it made me completely forget that I was having a vegetarian meal.    I will definitely be back here again given that the price was as cheap as other pho spots and that it was just damn good."}
{"text":"We went to this place because of the rating and the vegan options. When it was predominantly empty we hesitated, but very glad we tried anyway! The dishes taste great and are presentable as well. I would really recommend giving the popular places a pass in favor of trying this place slightly of the beaten path."}
{"text":"Amazing place! Delicate and tasty.  Definitely a hidden gem around Chinatown, highly recommend for pho lover and vegetarian.    I came on a Monday night after work, around 615 and the place is half full. This place is nice and quiet. Table and floors are clean and not sticky. They have great variety on menu. The owners are super friendly and food are at a very reasonable price.   Had a mushroom steamed rice roll as appetizer, The deep-fried mushrooms on top was a nice touch, love it. Definitely a must try in store.   Then we ordered a clear noodle bowl with vegan meat, the vegan version of BBQ meat was interesting to me, as I never really had much vegan food in my life. It sort of tasted like a hard sponge tofu with the BBQ fav on it. Very cool. I just wish this bowl has a little bit more vegetables rather than all the imitated meat and tofu . But everything is delicious.   We also had a curry vermicelli! The rich coconut fav in the soup definitely makes the bowl super delicious.  They have taro and yam in the bowl, its surprising how well these items go well with curry.   I would definitely come again."}
{"text":"Having gone vegan as a Vietnamese took away many of the joys of my favorite viet dishes. However, I once again got to eat meals I've yearned for since I went veg. This would have to be hands down one of the best vegetarian places I've ever had the pleasure of trying.  With vegetarian plates on par with any regular dishes, you'll be delighted to find fresh and delicious meals here. To top it all off, lunch here is a steal and you can eat happily here for around $10. This unassuming little gem tucked away in Chinatown is a diamond in the rough. I wish I could go here everyday and if you have the chance bring all your vegetarian friends here to have their expectations blown away.  The two dishes I tried was the bun thit nuong chay and banh cuon with the vegan meat. The rice roll was exceptionally good and I'll dream again of the day I can have rice rolls again. Saigon Lotus will not disappoint and prepared to be left with the urge to come back here every day."}
{"text":"A new find! Delicious, authentic, healthy and reasonably priced. I loved it. Definitely in my regular list."}
{"text":"Disappointed by the pho here which had a very strange taste that I just couldn't put a finger on and the vegetables inside the pho just tasted boiled and flavourless.  The apps were better but nothing that would entice me to come here on a regular basis.   Service was friendly and prices were fair. Might come back and try some of the rice dishes just to give it another shot but not for awhile."}
{"text":"We didn't know this spot was vegan only, but were pleasantly surprised by the outcome ! The stir fried vegetables with vermicelli and tofu was very tasty and did not taste or look too oily or heavy ! The imitation chicken was also very good ! There was barely a difference in taste !   If you are looking for a healthier option or are strictly vegan or vegetarian this restaurant is a great option !   It is also very close to Kensington market, which is always a fun area."}
{"text":"4.5. Really yummy place near Kensington/Chinatown area. Not your traditional pho place as it's all vegan/vegetarian. I'm not either of those, but i do love my tofu! I'm not a salad person and i prefer my meals hot. This place is definitely somewhere i go when i'm not in the mood for meat.   Fast service and decent prices   i recommend the curry vermicelli bowl. A+"}
{"text":"really great place! Inviting atmosphere and super friendly staff. Awesome selection of vegan (and non-vegan) dishes. Our pho and vermicelli bowls arrived really quickly and tasted bomb. Totally recommend :))"}
{"text":"A friend and I decided to check this place out because someone in Instagram I was following mentioned their March promotion which was, buy one Pho get another Pho free!  How much cheaper can Pho really get???  Let's just say two pho later and a vegan spring roll we both left $8 less but tummy filled happier  (20% tip).  The service was good, typical Vietnamese standard, although they did check in on us to see how we were doing (mind you we were the only customers).  It was about 2pm.  They had free wifi and generally without the March deal by checking into the restaurant in Yelp you can get 20% off   The pho was decent, lots of meats--ordered the Dac Biet pho without the tendon--noodles were ample, portion was large for a small bowl!  The star was the vegan spring rolls made with lentil, chickpeas and taro--really tasty!  I would definitely come back to try their vegan pho"}
{"text":"Came here with my sister around after lunch time and there were a few tables occupied. I ordered the sate ramen and I was still amazed by how the server come out holding the bowl like it was nothing even though the soup was basically leveling to the rim of the bowl. When I tried to carry it, I nearly dropped it because it was so hot so kudos to her! Overall, it was really good, it's hard t find places that sell good vegetarian dishes as many and delicious as Saigon Lotus. I shall come back and bring my vegetarian friends to try it out."}
{"text":"This has been the greatest find for me of the entire year! As a Vietnamese vegan, I have been craving Vietnamese food every time I am in the China Town area. I am thoroughly impressed at how delicious the food is here. My favourite has to be the Bun Bo Hue, especially since this was a favourite of mine before I went vegan. The staff is also very friendly and welcoming. It's also a short walk away from the St. George campus at U of T!"}
{"text":"This place serves amazing vegan pho! It is also reasonably priced and delivers great service!"}
{"text":"Saigon Lotus was amazing. Came here during the Chinatown festival and it was packed. I did have to sit with some obnoxious people but that's another story.  The food was delicious. Started off with the steamed rice roll (banh cuon) with ground vegan meat and portabello. Couldn't tell that there wasn't meat at all and their fish sauce was perfect. The pad thai with bbq vegan \"meats\" was my favourite dish. The bbq tofu was nicely charred and packed full of flavour. The noodles were really saucy but my only complaint would be that I would have preferred thicker noodles instead of the thin ones. Finally, the vegan pho was packed full of different toppings and the broth was good (still like the meat broth better though).   I would definitely come here again and try to get some die-hard meatlovers to try it as well."}
{"text":"The hainanese chicken was dry and possibly the worst I have ever had. The pho broth left much to be desired. Have never seen a place mix beef and chicken into the same bowl. Would not recommend eating here"}
{"text":"Not a fan. Maybe I just didn't order the right stuff. I mean, the service was great, the ambiance was nice, and the menu selection was pretty good too... but the food was just SO bland.  I am not a strict Vegan or vegetarian, although I am a huge advocate for plant-based diets. I've had some pretty good vegetarian foods too. But the Vegetable Tofu Pho at Saigon Lotus did not meet my expectations at all. The soup was bland, the menus fail to point out which meat substitutes were deep fried, the pho noodles tasted hard and plasticy, and I just didn't feel good after the meal (even though it was cheap and healthy...?!?)  The Yelp Check-in discount was great, and maybe the stir fried dishes are tastier, but my two cents? There's SO many amazing restaurants in the area, I would probably trek somewhere else for lunch/dinner."}
{"text":"The first Vietnamese vegan restaurant I've seen and tried in Toronto and it. is. BOMB!   The location is in Chinatown and so I thought the space would be very small and not that clean but actually it's very spacious and we didn't have to wait in line. And the service was very friendly and it was almost a hidden spot that's out of place in the busy setting of Chinatown.   The food though was the star. We got #46 which was the stir fry pho (interesting I know) and it was deeeelicious! they're very generous on the vegetables as well! And my friend got the combos that they had and again portion size was very generous and from what I tasted, very unique and flavourful. We also got two of the four summer rolls they had and oh man, it was very exquisite and not the generic summer roll that you get in other places.   Oh yeah did I mention it came down to $12 per person? When you check in at the place you get 20% off! Make sure you do that. Even aside from that it's very affordable with summer roll being $3 and the main dishes ranging from $9-10. What a steal!   Overall a must try vegan restaurant in the city."}
{"text":"Came here from the Yelp offer (20% off). I normally wouldn't go to a vegan restaurant on my own volition. I was pleasantly surprised at the variety available here. One side of the menu is vegan and the other side isn't. I had the yam tempura and lemongrass pad thai. Food was great and service was okay. The price is also great. Would be a good place to grab food with vegan friends."}
{"text":"I had forgotten how much I missed vegan Vietnamese until today. Years ago we were devoted customers at Lotus Blossom on Dundas Street and Bo De Duyen on Spadina, which both offered really good Vietnamese food. On a rainy Friday we decided to try out Saigon Lotus after reading about it online. Located just west of Spadina Avenue on the north side of the street, just behind Pho Hung the place is located beside the Korean place Ka Chi Korean. Set back from the street the place is long and narrow with windows that open up in the front creating a bar at which to sit and watch the world go by. The ceiling has a barrel vault that lightens the space with booths located on one wall and tables in the front of the restaurant. The kitchen is located in the back. The place is really light and airy. It is wonderful being able to look at the menu and order almost everything. There is a mix of Vietnamese inspired appetizers, lots of variations on Pho, noodle dishes, rice dishes and a few vegetarian dishes. They also offer a selection of Vietnamese drinks including my favourite a strawberry vegan shake. The servings are generous and the food really delicious. I opted for a couple of appetizers and was surprised by the amount of food. My friend had a black bean ginger dish that was also really yummy. It is so nice to have a vegetarian/vegan Vietnamese place back in the downtown core. I know we will be back again. If you are vegan patronize the place so they will be there for a long time."}
{"text":"I was apprehensive about trying this place.   Vegan pho?  Come on!   ...It's not referred to as Vietnamese beef noodle soup for nuthin!   Let me tell you I ate it 6 hours ago and I'm lying in bed now. craving another bowl. WOW... just freakin amazing.   They hit you with so many different textures and flavours in the soup you will have a hard time believing it's vegan!"}
{"text":"Horrible service. Always take wrong size of my order. And never provide the proper service even if you keep asking. Also they had a history of having FAKE vegan food. Taste is fine. They used to provide crab meat which is made of seafood and not really vegan. Waiting time too long yet the food isn't that good. The veggie roll is ok that's why 2 star."}
{"text":"I have no idea how long this place existed but it's such a hidden gem for all you vegetarians and vegans out there.   It's nicely decorated inside with ample seating, good for groups too as there's a long table inside that can fit over 10 people in there. Though this place has a \"pho restaurant\" vibe, so not sure if hosting a party here would be appropriate.  Lots of veggie versions of your typical Vietnamese fare, with a section near the end with some Indian options too!  I highly recommend their bahn cuon rolls - it's freshly made and tastes amazing. I wish they sold a bigger plate of this for a meal and not an app.  The butter chicken was sub par - I think you should stick to their Viet dishes instead - the vermicelli and bun bo hue tastes great!  As for desert, I'd recommend you go explore elsewhere - the mango sticky rice was cold and not very tasty.  All in all an excellent option for veggie lovers!"}
{"text":"I'm a big meat eater, but my group and I wanted to try something light and healthy. This place was vegetarian but delicious. The owner hosted and waited us, she was really nice and helpful helping us pick something from the menu. Great environment right in the heart of China town"}
{"text":"I came here last year and they had two menus: meat inclusive and vegan. I was surprised to see that they are now fully vegetarian/vegan!  We ordered the steamed rice rolls with fresh mushrooms (the fried mushroom on top was sooo good) and vegan avocado crab fresh rolls to start. The fresh roll sauce was served 5 minutes after the actual rolls arrived, so we devoured them without the sauce.   For our mains, we got Cauliflower and Potato curry (too much spicy tomato sauce), vegan pho, clear noodle crab and bbq meat pho (the broth wasn't that savoury, could have used more flavour), and the spicy lemongrass with seitan and crispy roll (was great, had chickpeas in the roll!).   The server was decent, and the place is really clean. I like how it's vegan and hope more people come here so it stays open! It was pretty empty when we went Friday at 6pm."}
{"text":"One of the best vegetarian/ vegan pho in Toronto!! Actually possible one of the better Vietnamese restaurants in town (even including the non-veg ones). Exceptional service level and staff are very accommodating with dietary restrictions. On top of them everything is reasonably priced and good size!"}
{"text":"I don't know how we didn't know about them sooner! Delicious vegan and vegetarian food and great service. Must try their papaya-mango salad! The day we went they were playing My Neighbor Totoro's music... what else can you ask for??"}
