{"text":"come here for lunch and order the grill.  love this place.  lots of food and reasonably priced."}
{"text":"Tasty and innovative sushi. High quality. Try the mango sushi. Frozen grapes at the end of meal were a nice touch."}
{"text":"Because I live quite close to Crowfoot, I will usually make occasional visits down to either Sushi Boat or Sakana Grill when I'm in dire need of sushi.  Although I absolutely love sushi with a burning passion, I by no means am a total expert at identifying the quality of the sushi.  As long as the sashimi isn't dried up or has that particular slimy texture when its borderline rotting; and as long as rolls are intact, and the food taste good, then I'm not overly picky.  

Sakana Grill has been established in the Crowfoot location for a number of years.  Although I have been a somewhat faithful customer, this location unfortunately suffered low reviews over the previous years due to management, hiring of staff and, lower food quality.  Trust me, I was one of those customers who experienced not the best service too.  However do not let prior experiences or even past negative reviews deter you, as Sakana Grill has dramatically improved.

Whether there was a change in management, or perhaps it is the new competition that entered the northwest region of Calgary (Kinjo in Dalhousie), I have found a marked improvement at Sakana.  Over the past few months of this year I dined here on 3 or 4 separate occasions - and every time I experienced exceptional customer service and had a lovely time there.  The menu has expanded a great deal where it now offers specialty sushi rolls, and an array of new appetizers where it is fit for all types of people, whether sharing or not.  The staff has also upped their game where they are always energetic and upbeat, while at the same time extremely attentive.  What I found the most changed characteristic of Sakana, is their complimentary dishes of food and dessert offered to diners as well as free Pocky (but only for the ladies).  So it's a very lovely touch in chilling at the table while getting small samples of free food! 

The only thing I do find inconvenient is how they serve the sushi when you order it off the \"checklist\" - instead of serving each type of sushi on multiple plates, theu're altogether on one plate.  Its not an issue, just inconvenient as it can be confusing identifying your sushi to someone else's when their on the other end the table.  However I guess it makes the most sense instead of having a stack of towering dishes all over the table.

And as a last note to all reviewers: my review does not extend to the chicken or beef teriyaki, or the yakisoba dishs as I am unable to eat those items on the menu...so I don't know how it tastes, but it looks good."}
{"text":"I had an awful experience at the Crowfoot location. The sushi was disgusting and tasted old. The other dishes weren't too bad, but nothing great."}
{"text":"Really dísappointed for the take away service. We have to wait around 45min for an order with a sashimi and a sushi roll. That will be our last time to come."}
{"text":"Awful service!  Arrived at 11:30am for lunch, didn't get our order taken for at least 20 minutes.  Another 40 minutes passed before the food started coming out.  Kitchen workers just dropped it on the table next to us, it took a good 5 minutes before the waitress would come around and give meals to the appropriate person.  Food was mediocre, not a great value for what we paid.  The waitress had the audacity to get impatient with us when we were paying the bill because we asked to pay quickly (and all on one credit card!).  Will never go again and certainly wouldn't recommend to others."}
{"text":"If you're looking for a budget friendly option for sushi and Japanese food in the northwest, this is a good choice! They have a huge menu including some value \"love boat deals\" (order one just to watch the tiny waitress stagger out of the kitchen carrying a wooden boat as big as she is). 

There are plenty of cooked options for non-sushi lovers. My favourite Japanese restaurant is still Shikiji, but this is a more family and wallet-friendly option. I find their rolls not quite as fresh-tasting. When you enter, a smiling line of kitchen staff may shout \"Irasshaimase!\" at you, but they just mean \"Welcome!\" so try not to be alarmed!"}
{"text":"I recommend for all non sushi lovers to visit this place before you stop eating sushi. I couldn't stand sushi anywhere else because I felt like the meat was too fishy or it felt like I always felt sick after. At Sakana grill you get fresh fish all the time. I have never had a bad experience and my food is always good. 

If your afraid of trying sushi, try the sushi tempura roll.. This roll is the best shrimp sushi I have tasted. It so well put together and it never falls apart. The shrimp is wrapped with cucumber and avocado and then on the top it's a fresh avocado slice on top. DELICIOUS!!"}
{"text":"I *love* this place!  The food is always tasty, and they often give you complimentary extras that you didn't order as a way of saying thanks.

I used to come here often in University and haven't much lately, but not much has changed.  Still a nice and intimate atmosphere, and there's always Japanese music playing in the background.  That said, I mostly went on weekend afternoons, so haven't yet had a chance to catch any of the special evening entertainment like the magic shows.

Sushi, of which they have multiple choices, is an option here, but it isn't the only one.  They have plenty of cooked dishes as well, my current favourite being the Katsudon.

I haven't come across many places in downtown Calgary that offers the same selection and variety for the price as Sakana Grill.  It's my first choice downtown when it comes to Japanese.

10/30"}
{"text":"Best sushi pizza in town!

Everytime I've been at this Sakana I've had delicious fresh sushi. They have some great, interesting rolls. 

Prices are normal for sushi, I also found the menu quite confusing the first few times I was there. They don't have a broad range of rolls but still a good visit if you live in the NW. I never order combos because they always include California rolls, and I seem to be the only person who doesn't like them.

My recommendation: The sumurai roll - but I don't think they have it anymore."}
{"text":"Great sushi, great value! If I am feeling like sushi, this place is definitely the go to even with plenty of other flashy sushi places downtown."}
{"text":"This used to be my favourite sushi place in Calgary but since their renos they have made their sashimi paper thin. Not to mention, their renos suck. They took out the coy pond and now their is no privacy in between tables"}
{"text":"I'm not a big sushi guy, but if that's what the people want, I'll go. And I did and wasn't let down. They had an excellent and large teriayki chicken plate for us non-sushi carnivores.
But even I was impressed with the boat of sushi they offer there. It's an actual wooden boat (not full size, but big enough for a whole table) filled with different kinds of sushi and other Japanese culinary items. They forced me to try the tempura which I can say was tasty.
Sakana Grill has an authentic Japanese feel inside and a great atmosphere for large groups. It's hard to get in and out of the booths, but that made it feel truly Japanese, like maybe I should have taken my shoes off, too."}
{"text":"Frequent this place & they are consistently good. Great value especially during their \"happy hour\" When the boats are on special. They also usually throw in a fruit bowl and poki for dessert"}
{"text":"Very good atmosphere and good service. For the price the sushi is very good. Best sushi on this end of calgary."}
{"text":"I wasn't a big fan of Sakana grill but at least they're trying.  I used to come here after 9 because they have that Happy Hour menu where you can save on some items like Love Boats etc.  But if you're going there for the Happy Hour then you'll be disappointing.  They've added specialty rolls now and it's actually very good.  The service has gotten a lot better with the new hires so that's a bonus.  

So skip the regular love boat items and order the special rolls.  It's not worth the savings."}
{"text":"Had dinner last night... Service was okay, they were super busy, but at the end of the meal a man came to our table. We assumed he was a manager checking in, turns out they had a roving magician. Best we've ever seen... Planning to go back next week, out kids loved it."}
{"text":"Giving 5 stars to this place would have been a very generous... and I mean a VERY generous rating years ago.

However, I'm actually going to give it that rating right now because it deserves it!

This Sakana Grill at the crowfoot location has definitely improved since the last time my friends and I went here. 

Before the food would taste very bland, refrigerated and felt like it was just slabbed together. This time, I ordered the Geisha Roll and Ocean Mountain roll with my boyfriend, and wow... these rolls were SUPER tasty, amazing, and you get A LOT then what you would expect to get! 

We also got some tempura udon... for 10.95... you get a plate of tempura, and a huge HUGE bowl (like... a large pho bowl size) of udon (althought it's only filled up half way). I shared this with my bf and the soup was really tasty, the noodles were the right chewy consistency and the tempura was very good. We also got some sunomono as an appetizer and it was bigger than expected and they used real crab :)

The service is by far the best I've gotten from any sushi restaurant. The staff are very cheerful and attentive and actually make our dining experience so much better.

My friend's birthday was during the time we went and we told the waitress. She gave us some complimentary sundried tomato with avocado sauce sushi on a dish, as well as some complimentary shumai (I think it was complimentary... o_O). Since it was her birthday, they did a birthday cheer for her while dressing her and her bf up in cute asian outfits. :) My friend also received some birthday dessert pocky and her SO also received some pocky as well.

To end off the meal, Sakana Grill crowfoot location gives you a complimentary bowl of fruit (fresh fruit ftw!) and Pocky for everyone. 

I would definitely go back to this place. They have stepped up so much since my last visit, I'm glad I was convinced to go back! :)"}
{"text":"I returned with another group of friends on a Thursday night. We arrived a little after 5pm and the restaurant only had a couple of tables. However, service was extremely slow as our server disappeared for quite a while and another one ended up taking our order. Also, none of our glasses were refilled with water even when they were completely empty.

The food was very prompt, except they gave us sashimi sushi instead of just sashimi and they corrected it after we informed them. In addition, they gave our table of 3 some complimentary sushi, other tables received some as well. 

The food was quite good, except some of the sushi rolls were not very firm and fell apart easily. Our bill came to a total of $51. Overall not bad, the service could have been more attentive, however I think it was due to the specific server we had."}
{"text":"So, a couple friends and I rolled up to Sakana Grill for some late night sushi, which Sakana Grill ACTUALLY does, so kudos for that. We ended up having to wait 15 minutes for a table. However, we were offered to take seats at the grill. Sorry something about sitting in a line when trying to have a conversation among friends isn't right, so yeah, not this time. Service was indeed slow, but this isn't new for any previous customers.

        Our server actually missed the sushi we had ordered on the order form. Not that I expected him to study and dissect the order form, but at least glance at it and realize that people do order off of it. The food was scrumptious. One of the few restaurants in Calgary that actually serves mayo with their Takoyaki. Unfortunately, there was a surplus of mayo and not enough Tonkatsu sauce with the Korokke.

        At the end of the day, SG is great and probably the best late night sushi restaurant in Calgary. However, I wouldn't be planning a trip there any time before 10pm.

One week later update:

So, After I initially wrote this review, I went back to Sakana Grill the following week to appreciate the good food. Service was some what better, all of our food was ordered and beverages were served in my lap. I don't know if the staff recognized my famous Yelp review, but I did indeed have water split on me. The server was embarrassed and repeatedly apologized.  However, when the bill came there was no compensation, only my damp jeans. Sometimes I wonder, the power us Yelpers have. We must remember the old Spiderman quote, \"With great power, comes great responsibility.\" 

Yelpers - we must not be silenced by restaurants. Let the truth be told."}
{"text":"Good food with decent service. Lifeboat special, can't beat the price and taste. Definitely try baked oyster (with cheese), and Dragon roll."}
{"text":"I went here tonight and found the staff very rude. We ordered a few things and realized they weren't made properly and they just shrugged it off and handed us the bill. I thought it was horrible service and the server seemed like she just wanted us to leave the entire time. The food was decent but the spider roll was absolutely disgusting and made me vomit. I told her it didn't taste right as I get that all the time and she just said oh ok. I wouldn't recommend anyone to go here."}
{"text":"Great food , great people working here especially our waitress Waw!  Also cool magicians Irene and Yuu.  Our first time here, from out of town will definitely come back.  They also let us sit at The Sushi Bar even though it wasn't open for dinner!!"}
{"text":"Sakana Grill, the epitome of your average Calgary sushi experience.

AMBIENCE/SERVICE: Relatively large restaurant that obviously looks like it serves a lot of people. \"Irashaimase\" was always on point and servers were generally no-nonsense like most Chinese-owned sushi places, sometimes even cheerful. Speed was pretty decent too. 1.5/2.5

FOOD: I would only come here at late-night when their specials like love boats and salmon nigiri go on sale. Their fish is ok, definitely not the freshest, and sometimes they get the temperature wrong, but this is nitpicking if you're hungry at night after a long day. They do have a rather large menu with many special rolls. I usually order gomaae (spinach and sesame paste) and black cod, which are both pretty hard to screw up but still quite good. If the quality of fish went up just a notch, this place would definitely deserve an extra star, but it is still pretty good value late at night. 1.5/2.5"}
{"text":"I always get my takeout sushi from Sakana Grill and it is always fresh and delicious.  The delivery time can sometimes be more than an hour which can be annoying when you are really hungry.  I have gone there many times for table service which has always been impeccable.  

Their drinks are slightly over-priced for what they are, but if you are a sushi tea and water drinker than you will be totally fine.  

Great place, good prices, huge menu."}
{"text":"You know you're hooked on Yelp when you make a date with a friend just to earn a  badge. But that's exactly what I did with a fellow Yelper as we set out on a quest to earn the Sushi Sensei badge! 

Not only did we want to earn the badge, but we also wanted to be able to compare the restaurants like for like. We decided that an order of California rolls would be our staple in every restaurant and we would supplement that with an order of the restaurant's feature rolls. Now, you're probably thinking \"that's a LOT of mayonnaise and fake crab\". Well reader, read on, because although we risked OD-ing on mayonnaise and getting mercury poisoning, we came out with some great tips for anyone seeking sushi in Calgary's downtown area!

Sushi Stop #1: Sakana Grill
Our sushi crawl started at Sakana Grill in Chinatown. On arrival, we were seated in a cozy booth and welcomed with a complimentary spicy salmon roll.  It was delicious, so these guys were already in my good books. Everyone loves a little something for free, even if it just wets your appetite for more!

We settled on an order of California rolls and an order of Geisha rolls (mango, avocado over sun dried tomato, finished with mango sauce & sweet spicy sauce). The mango rolls were to die for. In fact, of all the restaurants we visited on the sushi crawl, these were my favourite rolls. They had a great combination of sweet and spicy and the presentation was beautiful. 

California rolls leave little room for creativity, but these ones were good. Not great, not bad, but good. I wish I had more to say about them, but they absolutely met my expectations for how a California roll should look and taste. 

We also ordered a glass of their house sake, which turned out to be the best tasting sake of the evening. 

Price wise, Sakana Grill is as you would expect. It's not a fancy sushi joint. It is a nice, comfortable restaurant with average priced sushi. Our tab came out to about $30 for our 5oz glass of sake and two rolls. 

I'm giving these guys a 4 because they went the extra mile... a complimentary taster on arrival, the best tasting house sake of all the sushi restaurants we visited, speedy and friendly service and a box of Pocky sticks to finish up. All that, and the sushi was good quality and tasty, especially those mango rolls. 

Sakana Grill - I'll be back!

--
L"}
{"text":"Happy hour is great! Same great food at discounted price"}
{"text":"The food is good but the service is garbage they literally get every other order wrong ,and the only time i ordered delivery they never showed or called. When i went there to complain they wanted to give me 10% of which is on every pick up. Also the woman on the phone said she's gonna get the manager and hung up on me.no need to say the manager never called back. So I give this place  out five."}
{"text":"What's this? Happy Hour for sushi? After 9PM, Sakana discounts their love boats and depending on the night, other select items on their menu as well.

Who eats that late? A lot of people apparently! The restaurant is always full whenever we hit up Sakana for \"Late Night Sushi\" as we like to call it. A love boat deluxe (comes with tempura, dumplings, assorted sushi & sashimi, rice, soup and salad) and bowl of udon is the right amount for 3 people without getting too full."}
{"text":"Being pregnant, I am currently avoiding raw fish.  But I love sushi.  In fact, I often crave it. So I settle for cooked fish sushi or vegetarian sushi.  I was delighted to see that Sakana Grill offered a selection of both types of sushi I can eat.

We opted for the Caterpillar Roll and the Spicy Fuji Roll.  Both were very good, though the Spicy Fuji Roll did not live up to its name - not very spicy, but nothing being generous with the wasabi and ginger couldn't fix.  We also had the miso soup, edamame, and dessert.  Oh, be sure to ask for the dessert menu.  The green tea ice cream was excellent, and the coconut surprise ice cream was outstanding.

I was really impressed with the service.  When we were there, the restaurant had two very large, very loud, and very boisterous parties at the two main grills.  But the couple tucked away in the quiet, romantic corner was not forgotten.  The staff was quite attentive and service was exceptionally prompt.

The food itself was good, and probably worth about 3 or 3.5 stars. But the dessert definitely bumps up the score.  And the service, even more so."}
{"text":"Downtown Sakana was not as busy compared to the one in the NW. They have the same menu, but service isn't as good. They do have Taipan which is cool and different, reminds me of Edmonton's Japanese Village. However, I was there for cheap sushi, Happy hour ends at 5pm and they are very strict with that rule. Recommend the love boat deluxe! Get a mix of everything, from cooked food to raw. Overall, okay sushi, not the best. Price is excellent."}
{"text":"This place has fallen.  The tempura was breaded like fish or onion rings (without panko crumbs)... It had no crunch.  It may have come from a freezer.

The sushi was inconsistent.  The rice was chalky?...  I know weird but it was off in a way that ward to describe.  The nigiri cuts were ok sized.  Wild salmon not on the menu so had to eat the weird orange  salmon.  All the roles we ordered were oddly sweet.  The ones that weren't sweet were drizzled in sweet reductions.  Fast food quality, certainly edible but not overly enjoyable.  Perhaps a better place to grab lunch than to go out for dinner.

I used to go here quite a bit but I won't be back.  What is with NW Calgary and the vast quantities of poor - mediocre restaurants?!"}
{"text":"There is better sushi places around here! Came for the happy hour, but realized they have changed their portion sizes. Steak was good but only had a few oddly shaped beef pieces. 

Sushi has got to be some of the worst in the city. They rolled so sloppy they would fall apart when picked up, and one of my pieces had an inedible hard piece of something inside. It was almost as though they were made by an amateur.

However the worst part of our visit was our server Vennie. She left the menus on the table after we ordered, didn't bring our waters even though we asked twice, and when she finally did bring our water they were half empty. She didn't ask us how our food was, she didn't clear any plates off our table, and she didn't thank us for the visit at the end. 

It's sad because we saw other tables around is getting much better service from other waitresses."}
{"text":"Good place for a bit of sushi in the NW. Sushi quality can vary, but it's generally good. Get the \"love boat\" with soup, salad, tempura, sushi, sashimi and teriyaki chicken for dinner!! it's a good value... yes even if you're with your buddy and not your partner. ;)

Oh yeah, they had a magician there the last time we went! What's the tipping etiquette for that?!?!? We didn't tip, but nothing disappeared that we were fond off either, so I think we did OK."}
{"text":"I went to Sakana Grill with my friend Katie during lunch, the seafood was fresh and the rolls was very good. I recommend the Cowboy roll and Rainbow roll. And the lunch bento special was good too, includes soup and salad. Overall, good price and freshness of seafood. Services was okay."}
{"text":"I had a chuckle as I walked to the front door. The restaurant took over Pizza Hut. It's funny because Pizza Hut moved next door to a smaller space. While, this sushi restaurant is housed under the symbolic Pizza Hut roof.

The service is good. The place was packed when I went on a Saturday night. Their specialty rolls were average. I prefer this joint over Kinjo, if I was hung up on staying up in the NW area. Otherwise, downtown and Kensington offer better quality sushi."}
{"text":"Simply awesome. Best Sushi in town we know yet in a great atmosphere."}
{"text":"Been to this location a few times and it never disappoints for food. I have had the sushi and the entrees every time I have gone. I love their sushi and my husband loves their tempura shrimp.

Service is always good, never have a problem getting a table and I love their fruity tropical drinks. Not very Japanese but so good.

They are reasonably priced and I also like their magic entertainment on the weekends. Food is always great. No complaints.

Will visit again and again."}
{"text":"Mediocre... Pasty, over vinegared sushi rice really ruins good sushi. I love well prepared sushi rice and sometimes the rice doesn't get the focus it should. Expensive too, but given that this is Alberta I'd be willing to pay for it if the sushi rice was better. Tea was good. 

Music was unnecessarily loud over lunch hour.

In all, I'd rather spend the money at Globefish for the sake of food quality."}
{"text":"Small portions really small portions really would never use this company again
Skip the dish 7 minute drive away my food was sitting getting cold
Not impressed with either will not use either one again I can't believe how small the portions are"}
{"text":"I have to admit I would have never given this place 4 starts after my first couple of visits. We went later in the evening, and ordered the 'love boat'. The boats are a great deal for the amount of food that you get, but there is a reason they're a great deal... the fish is kind crummy and rolls are very basic... sort of feel like you're getting leftovers.  

HOWEVER, having gone back after not being impressed the first few times, I discovered the real Sakana - and it's good! Lots of great specialty rolls - I find the mango sauce particularity yummy. The real crowining glory is the seared nigiri - tuna or salmon seared with a crème brulee style torch right at your table - AMAZING. My mouth is watering just thinking about it! 

To add to the already fun and very traditional atmosphere there is a magician on weekend evenings, and chefs often putting on a show at the grills. Similar to Kinjo they'll give a box of Pocky to the pretty ladies dining, which is always a lovely bonus! 

I certainly suggest Sakana, but do stay away from the boats if you're looking for the freshest fish."}
{"text":"Nice spot. The sashimi pieces are nice and big with good texture. The rolls and other izakaya-type items are also solid. I'd like to see more rolls without frying in them; most have some tempura ingredient. 

It probably deserves 3.5 stars, but rounding up for value and the nice folks there."}
{"text":"My boyfriend and I went to the NW location because we were craving for the happy hour sushi. We got the deluxe love boat, and to my horror, the teriyaki chicken was boiled and then had sauce splattered all over it. The gyoza was over cooked and the meat tasted spoiled. The tuna sashimi looked like it was close to cooked. It was not busy so we could see the kitchen looked like a complete mess! It was our first time there and we do not recommend our worst enemy going! It is evident that the owners and chef have lost inspiration and motivation in their food."}
{"text":"#180

This should have actually been #179 (since my latest visit was yesterday) but apparently, I had an issue posting a draft. I visit this location quite often (especially now that the downtown location has closed for renovations and a rebranding).

I normally come in for their famous Happy Hour pricing with a $27 Love Boat for two being my staple (which, even as much as I eat, I can only eat about 1/2 to 2/3 of it) so good thing I bring my dates with me. Maybe it's because the staff recognize me/us but I always get great service and my glasses very rarely run empty (but if that should happen, they are there before I can raise my glass).

My Love Boat is always delivered with a smile and a plethora of fresh scallop (1 piece) tuna sashimi (3 pieces), salmon sashimi (3 pieces), snapper (I think) (2 pieces), salmon sushi (2 pieces), tuna sushi (2 pieces), ebi sushi (2 pieces), cucumber roll (6 pieces), California roll (6 pieces), salmon roll (6 pieces), and 5 pieces of House? roll (has tuna, salmon, imitation crab). I also get two green salad and two miso soup.

I like to also try something new with my Love Boat and last night was no exception. I tried the tuna takaki which is 4 pieces for $6 (Happy Hour pricing). I wasn't expecting much but the pieces are huge and their ponzu is pretty good (though I need to remember to ask for extra onion).

I have always like this location though parking can be challenging (there are a large number of spots but this spot is very popular).

Good selection (at least for Happy Hour) for a fair price with friendly service (though I see other reviewers have not been so lucky)."}
{"text":"I have been coming to Sakana for years and years. 

The quality if the sushi is consistent and the prices are some of the less expensive in the city. It is not the best sushi in town. But i  come for the late night sushi boat specials. $24 sushi or sushi/hot combo boat. 2 soups. 2 salads. Good deal! Runs in the afternoon and after 9pm (M-R) and after 10pm (F-S)

Two people can eat for $30. 

Thomas, the owner, is a wonderful man and is always happy to see his regulars. 

They also do the knife throwing Japanese cook thing. Good times. Good for a first date or a business meeting."}
{"text":"Sakana Grill was once my favourite sushi restaurant in Calgary. However, With the Menu change i don't have any urge to go back. The portions/rolls are extremely small. Not only are the rolls smaller in numbers, but also in diameter. I had to order 3 of the same rolls to get the same amount of an old menu/standard sized roll. Seems like a way to charge the customer more for less. I won't be back until standard sized portions are added back to the menu."}
{"text":"So glad my husband reminded me of this location. Sakana was always a go to spot for me at the downtown location, but the past couple years its gone down hill. I was pumped when we came here!

It's never too busy, so easy to get a table and quick service. The sushi is good, fresh and reasonably priced. I stick to my usuals, miso soup, salad, salmon, kappa rolls and a few other random pieces."}
{"text":"I'm disappointed to give a bad review of this place, as it used to be a go to. But the last couple times have been beyond despicable. 

The place wasn't full, actually it was empty, it will took about 20-30 minutes to even get a water. The server are rude and abrupt. And once we finally got our sushi, which was another 30 minutes, the quality was terrible.

My miso soup tasted like it was a liquid salt lick, the salmon was just tossed on the rice, there was way too  much dressing on the salad and the edamame was cold. 

I am willing to try the Crowfoot locations, before I fully write this off, but it's close."}
{"text":"Some of the staff are really hit or miss, there is one older lady in particular that I always get as a server and I always KNOW she's my server because I've waited 10+ minutes just to be greeted and asked what I want to drink. Other staff members take their time talking to customers and don't come to you until they're done chatting, and some girls act like they'd rather be working anywhere else than here. But, occasionally you will get a splendid server and it will make up for all the bad ones that are here.

The food is also hit or miss here, some nights it's splendid and some nights the rice is incredibly hard and uncooked. I think their might be multiple chefs here that are causing this fluctuation in food quality, but I can't be sure. I've had multiple times where they didn't clean the salmon properly and had fish scales in all of my sushi. 

The only great thing about this place is the prices, the salmon sushi is .85 cents per piece and they have great happy hour prices. (2-4:30 & 9-11). 

If you're willing to test your luck and see if you get a good server and a good chef for that night, then I'd say go for it. On great nights when the food and service is good I'd give this place 5 stars. But for all the other times I've come here and all the inconsistency's, I have to give it 3."}
{"text":"It skidded a bit after Peter Kinjo left, but last time I was there it was a good quality sushi place. Miles beyond what passes for sushi here in Montreal.

The ambiance is nice, the servers polite, and the food is delicious. Whenever I'm in Calgary (and I can't get down to Kinjo!) I don't hesitate to check out Sakana."}
{"text":"Being a sushi lover, it is sad when there aren't many sushi choices in downtown at reasonable prices.  Sakana was one of the very first sushi restaurants I've ate at in my early teens - I've been eating there since they first opened! When I'm at work and need a quick fix, Sakana does the job. I know they're not authentic nor do they have the best service, but my last few meals have been pretty satisfactory with fresh fish and decent hot items.  Overall, decent with average prices and they will continue to be my go to in downtown when I'm at work."}
{"text":"Newly renovated. We usually just come for happy hour. Not bad for what you get at happy hour."}
{"text":"Great sushi spot to hit in Chinatown when all of a sudden you and your party decide on \"anything but Chinese food!\" but won't hop back into their cars because they've already paid for parking :/

Sakana grill's prices are a bit expensive compared to the better sushi joints I've been to (Wa's is just a few blocks up Center Street) but they do have some unique items such as their tempura soft shell crab.

I ordered their Abure Rolls, which means it's sushi slightly seared at the top. The waiter came by with a fancy blowtorch to sear my roll and my mom decided that her sashimi was \"too raw\" and asked him to toast her expensive pieces of salmon and tuna :( ...+1 for Sakana Grill not taking the insult"}
{"text":"This is the only place in Calgary I will eat sushi and drink Sake. I have try many and they are crap. At least they are not cheap on the fish. Little expensive on the sake otherwise everything else is great . The service is always good."}
{"text":"There's a reason--a few of them, actually--that I haven't been here for some time. The sushi is average-to-good at best, so usually I'll go somewhere else for something really good. It's been a long time since I've been and decided the Love Boat special would be a decent late lunch/early dinner. 

The last time I was here their service was terrible and the waitress all but demanded a tip. Today, they're busy and the service is very good if distracted. The system was apparently down so, after waiting more than 30 minutes, we were informed the system was down and that out order was being placed again. I almost said \"no thank you\" but out soup and salad had already come. I was reminded why I don't come here and will hopefully remember for next time"}
{"text":"We go to Sakana at least 3-4 times a year for birthdays or special occasions or because my friend is craving the steak sauce. Every time we go there's at least 12-18 of us and they're so accommodating to put us around the Grill. The service is slow and sometimes it takes a LONG TIME to get more beverages but I've solved this dilemma by ordering a bunch at the start lol. We used to get an older Chef who put on a spectacular show but the last few times we've gone we have ended up with a younger guy who does a good job, but he is not as interactive with the crowd. We always enjoy our food and the show though and we never leave hungry. The staff is super accommodating and they have a candy buffet which is pretty neat. Not an everyday kind of place but so good for occasions or date night :)"}
{"text":"I have always loved this place. I have been there countless times and every time the food, service, value and atmosphere are top notch! They always go above and beyond for the customer - every staff member says hello and goodbye to you. 

Some nights they give you some frozen grapes in chocolate and a pack of pocky sticks with the cheque for free! Other nights they'll have a magician entertain every table, or a live Grilling session during dinner time. They're open late every night and that is a plus for me, because my sushi cravings always happen around 9PM... :)

Check them out!"}
{"text":"We come to Sakana often on Friday evenings for their happy hour. It's nowhere near the best sushi in town but it's definitely a good place for groups and if you're looking for a late(r) night sushi eats. They have salmon and toro specials, teriyaki box specials as well as udon and their love boats on special. We continue to come back because it's a nice environment for us to spend a few hours catching up with friends/family and the food is pretty good for the price."}
{"text":"The boys and I came here on a Saturday expecting to order from the happy hour/late night menu. To our dismay, our server informed us that happy hour didn't start until 10:00 pm (at the Crowfoot location, it starts every day at 9:00pm).  Hmmm...Could our hungry teenager wait for an hour before we order our usual Love Boat Deluxe?  

Fortunately, our server was very accommodating and wrote down our entire order--our son's cucumber and California rolls (items which were not on the late night menu) would be served immediately, while the Love Boat Deluxe and beef udon special would follow promptly at 10:00 pm.  The salmon and tuna sashimi have always been fresh and served at the right temperature.  The cooked items have been fairly decent as well--the shrimp and vegetable tempura were piping hot with light crunchy (not greasy) batter, the gyoza filling (juicy, nicely seasoned pork) was nestled in a thin wrapper, and the chicken teriyaki was just the right balance of salty(soy sauce) and sweet(mirin).

This location is also great for groups.  We saw a large party sitting around a horseshoe shaped table with a teppanyaki chef grilling food in the centre.  It's a spectacular show for all to see, but make sure you're prepared to put your clothes into the wash once you get home (or you'll smell like teppanyaki all night long).

Remember to help yourself to the dessert buffet (gummi worms, sours, Werther's originals, chocolate mint patties, rice crackers, jelly beans) before you leave!"}
{"text":"My littlest sister loves this place- because it's economical on a student budget. I won't come back again. The place is filthy. The floors are disgusting, the tables sticky. The menus are tacky. My concern is what the hell is going on in the kitchen if the actual restaurant eating area is so dirty.

As for the food, all the rolls taste the same. The sushi pizza was over fried resulting in crunchy, not crispy rice. The flaming dragon roll was meh. The rainbow roll rice tasted- stale. 

The teppinyaki was skillfully done and made for a great show- and the salmon and Veges tasted great. 

People come here because it's downtown and cheap. Cheap sushi is not fresh sushi, and sorry nothing can compensate for a genuinely dirty restaurant"}
{"text":"I frequently visit Sakana, but mostly during Happy Hour. $0.99 for a salmon, I don't think I can complain too much. 

We usually order the tempera udon, which comes with tempera on the side, as well as four pieces of sashimi on the side (only during Happy Hour). We also get 10-15 pieces of salmon sushi, a couple of toro (only on special from Mon-Thurs during Happy Hour), an appetizer, and teas to drink. Our bill is always under $40 (which includes 15% tip), and for the amount of food we get, it is pretty good. I also have no complaints about the service provided here, even though we always get different servers, I find that they are all pretty efficient and friendly.

On their regular menu, I think the baked oyster and sushi pizza is pretty good.

I think their regular prices are a bit overpriced for the quality of sushi you are getting. The love boat and love boat deluxe is around $35, which I think is way too expensive for waht you get. There are many many other sushi places you can visit in Calgary for a better quality for that price. But if you are looking to fill your late night sushi craving, Sakana is the best."}
{"text":"Not the best sushi nor the fanciest  but it's certainly pretty good"}
{"text":"Cheap late night average sushi.

I came here late one night for what I heard was their sushi happy hour. Unfortunately, I found that there was poor service but some alright sushi. Considering the price, we received a lot of sushi and food. The quality was average but definitely good compared to the price paid. I also had some of the house sake which was quite good.

Come for the happy hour pricing, but otherwise you can find better sushi."}
{"text":"Been eating at Sakana since they opened, always love the tappanyaki and sushi. Usually start with a couple rolls and sushi, then the best of the best, tappanyaki. They cook your dish in front of you, it's grilled to perfection. I always order the steak and shrimp, and just for the record, best shrimp ever! And you get veggies also, as for the rice, I pay extra and get egg fried rice. All served with 2 of the best sauces, the ginger (for seafood and veggies) and the steak sauce (for meats) but I use both for everything! I recommend this place for a great night out!"}
{"text":"Sure there are many sushi restaurants in Calgary but Sakana Grill is the full experience that you want to have when you go for sushi. The biggest menu, the friendliest staff, overall a very entertaining Japanese experience. If you go on your birthday they sing to you in Japanese, it is very cute!"}
{"text":"The downtown location offers the option of having a chef cook right at your table, if you're into that sort of thing-great for groups, I might add. I've always sat in a booth away from the \"entertainment\" and enjoyed my food no less. The Love Boat Deluxe is a terrific value especially if you order it from the late-night menu after 9PM; just don't expect the actual wooden boat (these seem to be in short supply). On your way out, help yourself to one of the complimentary sweet treats, such as the chocolate mint patties."}
{"text":"The Crowfoot location has a \"Happy Hour\" menu after 9PM, where the Deluxe Love Boat is discounted to $27 from $38. You get an assortment of nigiri sushi, sashimi, orange chicken, gyoza, shrimp and vegetable tempura, steamed rice, miso soup, and salad--more than enough to feed two people. It was delicious, and the service was prompt and efficient. Good value, we'll be back."}
{"text":"Dined on a friends recommendation and I was so great I listened! Ordered the chicken teriyaki and stampede roll and both were delicious! Food was great and the atmosphere was very inviting!"}
{"text":"Pretty good sushi place. Tried 4 different sushi rolls and they were all pretty tasty."}
{"text":"Went for happy hour at about 4 p.m. and they have a special menu that serves Salmon and Tuna Sushi for really ridiculously low prices like $0.90!!  We ordered the Sushi Love Boat that serves 2 people for about $25.00; it comes with salad and miso soup. The Udon and Tempura also comes with 2 pcs of tuna and salmon sashimi each.  The Udon is $9.90.  

Whole bill came to about $45!!  I kid you not!

The sushi rice was really fresh and moist.  The fish yummily fresh.  Very important.  

Only thing is service is quite slow."}
{"text":"Excellent happy hour! $1 salmon: either as sushi or sashimi!

Customer service is fairly standard, nothing extraordinary. The quality of food at this location seems better than the downtown location. Only sad thing is they only serve toro sushi (from the happy hour menu) from mon-thurs. 

I didn't order it this time but the deluxe boat is pretty good. it has a great mix of sushi, sashimi, and kitchen items!"}
{"text":"Sakana is perhaps best known for its Happy Hour pricing, which I believe to be in play a couple of times each day (once in the late afternoon, and again late-night).  This promotion is highlighted by their \"sushi love boat\", which drops in price from around $35 to around $23, and is truly one of the best sushi deals going in Calgary (or anywhere, for that matter).  The boat contains a good assortment of quality nigiri, maki, and sashimi, and feeds three comfortably.

It's not quite 5* sushi quality, but it's very good, and dollar-for-dollar it would be hard to do better (at least during Happy Hour)."}
{"text":"Came here for the Happy Hour (Start at 9pm) special. We got the special love boat deluxe for two to share ($27 WOW), baked oyster, 8 toro sushi and the butter grilled corn. 

The butter grilled corn was nice and sweet. The Toro Sushi was very fresh and delicious. Toro sushi was my favorite out of the entire meal. The baked oyster was ok. It was a bit bland. Oysters just needed a bit more flavor to it. 

The Boat was massively huge. We definitely ordered too much food. I was full after eating the toro sushi.

Service is ok. Will come again for quick dinner."}
{"text":"The decor is nice but the food is not at the same level. So came here for the late night special and ordered a bunch of things. Everything was disappointing. From something so basic like tempura to sushi. Also the best deal is their toro sushi during late night and we were told that they don't have enought toro so that special isn't there anymore (for this location ???? only???) 

Service was meh as well. At least they came to clear the plate. If I had to compare this place to all you can eat quality, I would say the grade is definitely lower than all you can eat. The salmon sushi wasn't fresh and had too much rice. Not to mention the salmon very thinly sliced. 

The most disgusting sushi, I ever had was from this place the unagi dragon roll. First off it was cooked and second of all, unagi doesn't go well with lemon. Why is their slices of lemon between the roll. Nasty. So nasty. 

Never coming back."}
{"text":"Looks like there will be a new location opening on Macleod in the SW sometime soon hopefully!"}
{"text":"Review: happy hour.

One of the few Japanese restaurants in Calgary that serves happy hour, we wanted test how happy the hour truely is at this place.

Bottomline: average Japanese food at a cheap price. Good place to fill up on sushi without costing your mortgage.

Atmosphere: generally speaking, the decor is modern and ambience is decent. However, they paid much less attention to the details. I.e. there were old decor visibly tucked away high up on the shelf that seemed to have collected dust over the last century. The kitchen door to the outside faced the parking lot and was opened so you could see all the garbage and old dirty racks and boxes stacked up against the restaurant. Service was good.

Food: mediocre Japanese food. They offer two different sushi boats during happy hour and we tried both. The sushi was heavy on rice and some rolls fell apart when I picked them up. But at least they tasted good and the fish was fresh. The tempura was battered well and the gyoza were also tasty. Chicken teriyaki was nothing special and tasted like homemade.

Value: pretty good price for the portions of food you are getting. Don't expect high quality Japanese food though."}
{"text":"I am alright with Sakana Grill. If it is late, and we are in Chinatown, or looking for a place to eat before hitting up a movie or something at Eau Claire, I am definitely willing to eat here, although it is by no means a mindblowing experience. 
Service is generally pretty friendly and awesome here, although I have experienced a server who reminds me of Mel from Flight of the Conchords here which freaks me out a little bit. But I digress. 
Something I do like about Sakana, is that they don't have just your typical cucumber maki or avocado rolls here as options for vegetarians. They also have a delightful asparagus and avocado roll here that I really enjoy, as well as a sundried tomato roll. None of my friends really enjoy this roll for some reason, so I rarely order it if I'm sharing, but I think it's pretty cool that they have this as an option. 
Additionally, they usually have specials on Japanese beers, which I don't particularily enjoy myself but my friends love. I usually just fill up on the cheap genmaicha. 
I see here that someone commented on the entertainment/magicians. Yes, they are still there, but this is actually something that really makes me uncomfortable about dining in at Sakana. It is quite awkward when you are trying to have a conversation, and you don't want to turn away the endearing magician lady, but also don't really want to pretend to be entertained. Also, the first time this happened to us my friends and I just stared across the table at each other, and didn't know if this lady was expecting to be tipped, or what have you. Uncomfortable. 
But decent food if you are in the area and nothing else is open."}
{"text":"Last weekend, Kat and I were hit with post-work hunger pangs - hard. It was a Sunday night, aka. Yr City's a Sucker Time, when nothing at all is open downtown except pubs - and this place. It is hard to say no to a Japanese place that is open late, so we walked in (although \"staggered inside with weakness\" might paint a better picture) and were promptly seated in a cozy booth, next to a heavily tattooed couple in the adjacent cozy booth. We four had two cozy moments. Menus were dispersed, orders quickly taken, and food reasonably quickly served.

We tried the takoyaki balls (well-seasoned, but tiny piece of octopus), I had a miso soup (standard quality, although a big Western-style spoon?? Points off for missed aesthetics!), and we shared the standard bearer of a sushi place: California rolls. Fantastic, though it might have been the hunger speaking.

For the mains, I had the unagi roll and Kat had the other standard bearer, the Katsu don. I was not prepared for the entire roll to be deep-fried (although I was hungry, it WAS late and I prefer to keep it light by that time), and it took away from the fish; all I could taste by the end was batter. Her Katsu don was slightly better, though I have tasted superior ones in other places. Overall, it is worth a visit if its late and you are in the area and craving sushi and nothing else is open.

10/30"}
{"text":"The menu had changed and the portions were Tiny and almost all rice. It was expensive for the Tony portions.The service was horrible. We were talking to the waitress saying we wanted to order more and she walked away. They did not refill our water the whole time. After they brought the bill we had to wait 10 minutes and ask for then to bring the card machine."}
{"text":"I love going here when I have the munchies late at night on weekends.  After 10, they have this excellent \"Happy Hour\" special, whereas the Love Boat sushi, sashimi, tempura, teriyaki and soup special for 2 is a mere $25.  It's a ton of food for that price, and I don't mind the 20 min drive to partake a heck of a snack with my friends.  While I would never say it's the best quality, it's still yummy and belly dead fish filling satisfying.
I would like to give a better review, but I've yet to ever try their normal menu or their teppanyaki girll offerings.  But service is usually pretty awesome, the settings are kinda quaint with their faux version of a japanese home, and parking is rarely a problem.  So until then, all I can really judge from what I've tried and it's definately something a place to keep in mind when late night snacks are needed and Denny's won't cut it."}
{"text":"While the decor is fantastic to look at the sushi here leaves a lot to be desired.  This was the only Japanese restaurant in the area that was open for an early dinner so we decided to try it out.  The food I'd say was worthy of 4-stars.  The service was quite terrible and deserved 1-star.  First, we were left waiting for a good 10-15 minutes before we even saw our server for our drink orders.  Second, it was another 10-15 minutes before we got our drinks.  Since we started to see a pattern here we quickly ordered our food before our next long-wait.  The kitchen must have been slammed because our food started trickling out about 30-40 minutes after our orders.  One of our rolls were was wrong and again, it took awhile before our server could be found.  Once we told her the order was wrong she asked if we still wanted it. Really?   If you're going to play that game then just give it to us for free then!  We ordered the baked oysters where were supposed to be our appetizers.  We had reminded our server of the oysters twice and she said she was on it.  However, we got them dead last and after we were all full and done eating.

I might go back one more time to try Sakana Grill in Crowfoot as the food was fine.  Perhaps another server may change my thoughts of this place."}
{"text":"Have been here several times, deliciously consistent food and drinks. Fresh sushi and great service. They also do a fun and unique birthday celebration. Would recommend!"}
{"text":"Well....used to be my favorite place.  After they change the menu..mmm not anymore. 
Smaller portion...I mean very small ..$$ the same ..
Not longer some rolls avaliable
Word on on streets..\" Sakana is not the same anymore \"
I did appreciate the service tho..."}
{"text":"Went to the place before the holidays hoping that we could have lunch AND book a Christmas lunch for over 50 people but KATHY SPOILED IT. Yup, she's still there and we were served in her section. NO SERVICE even when we said we were ready to order. After at least 20 minutes, WE GOT UP AND LEFT. Meanwhile, she was in the sushi bar area, saw us getting ready to leave AND DID NOTHING!!! She didn't give a $HIT!  Too bad...we've already told others at our company and will continue to tell others to AVOID THIS PLACE. Kathy, get out of the hospitality industry. She doesn't wear a name tag anymore, but she's short, Chinese (not Japanese), wears boots in the winter and is FAKE with the low-fans to get FAA LAYS!"}
{"text":"This is the best sushi restaurant in Calgary. The service is good. Most important the quality is very good and with a reasonable price. The fish is flash, and all the grill is delicious."}
{"text":"Well, Sakana Grill - Crowfoot - you did it again!  Dinner here tonight was utterly bad.  We ordered the Happy Hour Love Boat Deluxe and 2 bowls of Beef Udon.  The miso soups and the salads arrived promptly for the Love Boat. Then, our 2 bowls of Beef Udon arrived but without our sashimi side plates.  We waited for 40 minutes for the Love Boat Deluxe to appear at our table and the waitress' excuse was that the kitchen ran out of items like the tempura and gyoza!!  What!!??  You would think that a restaurant that advertises for Happy Hour should have a fully-stocked kitchen.  What I really think was amiss was that the sushi chef was having a hard time keeping up with the take-out orders and ours was also backed up.  Needless to say, the tip was very small.  Don't know if we will be back in your new fancy open-concept restaurant.  I don't like the booths for 6 people - 4 people on one side of the booth separated by these tall movable metal reeds from the 2 people on the other side of the booth.  I can literally pick off the other person's plate and maybe, pass my dish over to their side!!  Bad seating arrangement.  The waitress was only a little apologetic that our food was so late in coming and was run ragged throughout the whole restaurant.  Poor management of staff.  You have lots of cleaner-uppers but not enough waiters."}
{"text":"This was a disappointing restaurant. The fish tasted old and the service was terrible. Would not go back anymore."}
