{"text":"Hmmmmmm, it was hard for me to decide how many star Sake deserves.   The place's always packed and noisy, I should've see it coming. We had two combos, one bulgogi, one 30pcs sashimi, they come with two large hot sake, the price was really cheap.They must have brought us 10 complimentary side dishes, which made this is by far, the cheapest sake sushi bar.  Waitresses are all cute and polite, however, the waitress put a slice of lemon on our complimentary shrimp skewer using her bare hand in front of our face befr she put that plate onto our table. So i thought, this is interesting.  Sashimi plate: I'm new on sashimi, tried about 10 different dt Japanese places with high rate on yelp, by far, this is the worst. Freshness was just bearable, by bearable I simply meant u won't get sick. Me and my friend are sashimi nuts, and he hates wasting food, but we had left over on that plate. But again, it matched up with the price. Bulgogi: Decent tasting, not bad, but I won't order it again either.  In conclusion, the best food I had there was the complimentary potato chip. If wasn't for it's cheapness, I would't hesitate giving them 2 or 1stars. Keep in mind, this is a nice, cheap drinking place for group of people, but don't expect getting good food here."}
{"text":"My review may be biased because I know the people who run this place. However, I've been to about 30 or more sushi places in Toronto, and I honestly got to say that SAKE when measuring how much quality food I get while placing price constant,- it's a pretty good deal. Individual menus are comparative to other places, but their COMBO menu (which seems difficult but actually is quite straight forward if you understand it) is really affordable.   The crowd is young and loud and most of the time, the place is pretty full, so I guess if you're looking for a quiet candle-lit dinner, this isn't your place unless you come before 7. However, if you like lively, exciting atmosphere, super nice staff, with cheap sake+sushi/sashimi/ other food combination deals, then this place is for you!"}
{"text":"The Toronto Lover system: 5 stars = Must visit! 4 stars = Really good. I take my friends here. 3 stars = Somewhat worth it... if you have nowhere better to go. 2 stars = Below average. Attend only when necessary. 1 star = Do not visit!    The problem with having a thousand sushi joints in the city is that it makes it ok to offer discount sushi. We forget that sushi is supposed to be a delicacy: the fish should be of the highest quality and flavour. The 30 piece sushi and maki set for $17 or Caterpillar Roll for $9 is now the comparable, but it has to make you wonder.  Let me review Sake Sushi this way... it's a bar: expect loud music, tables full of people drinking sake and beer, and platefuls of food arriving quickly and flavourlessly. The same way one might order nachos or fries at the pub, throngs of youngsters order Philadelphia and Red Dragon Rolls at Sake Sushi as they down their drinks before heading out into the Koreatown area.  The atmosphere is fun. The service is very good. The food is below average.  2 stars"}
{"text":"The authentic Japanese staff generated quite a discussion about the merits of sushi du Vancouver vs T.dot sushi joints largely run by Chinese folks. Sake seemed to me to be authentic because of the sake selection and the crazy cartoon-filled menu. This place has as many bottles as the more upscale Fune Sushi, but a college-town/pre or post Karaoke kind of ambiance.  The set menu of 5 beers plus tons of food had to be explained to me, but I ended up with the usual Chirasi bowl and some edamame. The spicy tuna roll at the other end of the table has real hunks of tuna, not just the left over bits mashed up with sauce. So, that's always a plus. Rolls are not cheap, but sashimi was, that confused me a bit. Even the vegetarian crispy roll is $8. So, ordered just fish on top of rice was a bargain at $11.  To complete my authentic Japanese experience, I wanted some sake and since I was drinking solo, ordered the Sake Sochu cup. The cup cracked me up! It's a glass with a sardine-esque roll-back lid. I bought these for 100 yen in Osaka at Don Quixote! Here you can get your sake on for $8.  Kompai!"}
{"text":"Myself and a large group of friends headed here on a Wednesday night intrigued by their Wednesday sashimi special that we had read about here.  It started off badly when we tried to call and make reservations and the phone line was not in service. However they were open. We were disappointed to find that we were the only ones there, but also that there was also no sashimi special on this Wednesday!   We all ended up ordering a la carte, which was much more expensive than the plethora of sushi restaurants in the annex, or the Korean restaurants nearby.  I ordered the Sashimi bowl, and it was good, but covered with WAY too much mayo. Maybe 1/4-1/3 of a cup? So I basically had mayonnaise for dinner. I mean, it was yummy, who doesn't like mayo? But next time I'd ask for it on the side...  Also, they only had one person in the kitchen, so our dishes we ordered came out one at a time over a period of about 1.5-2 hours. Luckily we didn't have anywhere to go, but since mine came out last I was starving as we have been there for almost two hours!  This might be a good place to go for a drink and a snack, as their alcohol was very cheap, and they did have a drink special (4 beers and one food dish for $24-$28 depending on the food item)  Wouldn't go back."}
{"text":"Perfect date night spot! Check this, Wednesdays they have a 25 piece sashimi special for $5 if you order one of the combo deals (ex. 5 beers and a dish, or a bunch of sake and a dish which is usually around $25), so not only do you feed the bitch for $30, but you get the bitch lit up (win win right?).   Now lets go back to the feeding part, the food is unreal! I highly recommend the octopus balls, the spicy salmon hand roll, and the sweet corn dish (which they just bring you for free and should be called \"Rob Ford corn\" cuz its like crack).    I'm trying to find something bad to say about the place but there's never been a line up, they yell nice things at you on the way in (and out), they bring the food right away, it's a great price (two people can eat and drink well for under $60), the quality is consistently on-point...I'm just hoping the Queen-Street-wanna-be-Willamsburg-hipsters don't find out about this gem."}
{"text":"Mmmmmm SUSHI!! Toronto has hundreds upon hundreds of sushi bars. Many of them are basically the same; bento boxes, sashimi, rolls, etc. What sets Sake apart is the atmosphere and great staff who work there! I've been a regular at Sake (once Mittomi until earlier this Fall) for a couple of years. Every time I go in I get greeted by a cheerful unison of 'hello's' and a warm, friendly embrace of great service.    If you like the White Stripes (the band) you may notice the very red, white, and black colour scheme, offsetted nicely by some neat Japanese art work on the walls. Best of all, they make a killer dynamite roll!  Mmmmmm...sushi....."}
{"text":"Cute staff, affordable drinks and complementary side dishes. I think I've been here four times this week? Sorry not sorry haha.  This is great place for dates or a large group of friends. I recommend coming early because it gets pretty full and there's no limit to how long people can stay."}
{"text":"We've been coming to Sake Sushi for 2 years now. The food is always excellent and fresh, unlike other sushi joints. The owner and the staff are always extremely polite, and the prices are very reasonable. I highly recommend it to anyone who likes sushi."}
{"text":"My friends and I converged to Sake Sushi bar after spending a night drinking a few bottles of soju and (badly) belting out karaoke tunes.     It was a busy Saturday night in Koreatown and Sake was no exception. We walked in and from first appearances all of the tables were full. But lucky for us, they had a table available for five more slightly inebriated people like ourselves.  I liked their menu: order from the A, B, C's which is a dish and your choice of drink, either five beers or one bottle of soju. The dishes are tapas style and we ordered a variety of plates like spicy salmon, tempura, teriyaki noodles and sushi rolls. The food tasted great and my favourite was salmon pieces served with salad and marinating in a spicy sauce. My friends and I devoured it!  The staff was friendly, accommodating and very patient. We weren't the only drunks in the restaurant and their service was top notch. I'm coming back but slightly more sober."}
{"text":"sake bar is a good place if you want to have a good time with your friend while eating some good stuff. the chicken karage is the bomb, never tried the sushi (shame on me), but usually the food on the combos are really good. they have various alcohol not too expensive; beer;cocktails;wine ect.   the service is maybe the bad part of this place, it's really slow and not as friendly.   i really like this place but sometimes i decide another place just because of the music, they usually put Japanese music, not that i don't like it but sometimes it just doesn't match the ambiance!  i would definitely recommend this place for a large group."}
{"text":"This place is great! They have typical food + 5 beers or 1 soju combo. The food is good, the side dishes are awesome, and the waitresses are nice. If you order a lot of dishes, they give you generous on-the-house dishes! I brought my friends here and they love it. We keep going back and we haven't had any bad experience so far. Definitely one of my favorite bars in Toronto =)"}
{"text":"Call us K-town n00bs, cuz that's apparently just what we were until now. Having parked our bikes at the nearest available posts with full intentions of heading to Clinton's, we screached to a halt at the sight of the chalkboard sign that silently screamed: \"5\" BEERS + \"30\" PCS SUSHI OR SASHIMI + APPETIZERS \"$31.99\". What's with all the quotations!?, we sillily asked each other. There must be a catch! We timidly entered to be greeted by an uber cheerful server who handed us a double-sided  laminated menu and waited patiently for the okay to seat us.  The dizzying menu consisted of A's, B's, and C's, which allowed you to choose from drinks (assorted beer and sake), sushi, sashimi, dons, udon, the list went on and on. We decided to go with a spicy mixed sashimi bowl (which was actually even cheaper at $22.99 for the combo). With no expectations (but lots of curiosity), we were blown away as dish after dish of appetizers arrived. McCain-type greasily delicious fries drizzled with ketchup, green salad swimming in zippy ginger dressing, spicy salmon and onion stirfry, Japanese pancake drenched in mayo and sweet okonomiyaki sauce, even a bowl of canned peaches too. The spicy mixed sashimi arrived in a towering heap garnished with a whole handful of nori threads.   Although I probably wouldn't come back especially for the food itself, the dishes were all actually pretty good accompaniments to the Canadians. Obviously, it was also a hell of a steal. Beside the crazy combo deals, Sake also has cheap a la carte tapas and sake shots you could buy with mere handfuls of change."}
{"text":"Amazing service, great prices and very well made authentic sushi.   Since the place is owned and operated by a young couple, you can expect quality and consistency. I have been going to sake regularly since they started (last year) and they have never failed to disappoint. They also have live jazz music every Thursdays."}
{"text":"Sake Sushi Bar. As the name implies, it's a bar. Loud music and a dark but lively atmosphere, it's a nice after work place to get your drank on. Service is really good. They shout greetings to you as you enter and leave, but at a reasonable level where it doesn't disturb the whole restaurant.   Food here however is subpar. Sashimi is fairly cheap but expect cheap quality to match. Odd slices and bland tasting. I really liked the sake house special roll however. They gave us complimentary fish head as well. Being an adventurous eater seeing fish head doesn't phase me but others may get grossed out by it so it was surprising they presented that to us. Combos are a good deal (especially on Wednesdays). It's the pricing of cheap drinks plus food that made us come here but I wouldn't go back on food alone."}
{"text":"The first hint about this place is the name of the restaurant--if you're in a sake sushi bar, expect to drink. This place is super awesome for groups of people who is looking to spend the night drinking. Keep ordering the drinks the free food just keeps coming. We were stuffed with alcohol and yummy eats by the end of the night.  Now my knowledge of the Japanese and Korean culture doesn't seem to be up to par, because things here get me a bit confused. The place is in Korea Town, the name is Japanese, the people who work there is japanese, the menu has japanese, but the side dishes that come, the combinations of alcohol and food, dishes like pancakes and fire chicken is pretty Korean.   Not that it matters, because you're not here to be a \"foodie\", you're here to drink, and then eat yummy whatever food they bring you. The sushi is actually pretty good. The sashimi pretty fresh too. Like someone said below, you can get a 30 piece sashimi+5 beers and a ton of side dishes for $32--why not?  The servers here are super polite, super pretty, and super efficient. For someone's birthday, the had a cake (sashimi cake?) and they flickered the lights on and off and happy birthday music played. Pretty funny.  Honestly, great place for a night out in town."}
{"text":"Note that the Sashimi special (10 or 30 piece for $2 or $5 with purchase of entree) is only available on Wednesdays"}
