{"text":"Good place to eat, enjoyable atmosphere, great food at a fair price.   I ate there on WEDNESDAY at about 5 pm.    I was greeted at the door and chose to sit away from the grills.  They offer bar seating, restaurant style seating and hibachi seating.  I sat in the restaurant area.  Our server was quick to the table, but gave us time to look at the menu.  Prices were on the higher side of fair, but later proved be correct. $40 dollar steak and lobster.  The server knew her food and gave us excellent advise, when we asked.  The steak was very tender as was the lobster.  I really enjoyed the meal. Even the rice was special, it had a smoked tasted that was great. The vegetables were even cooked correctly.  The whole meal was great and plentiful.  Normally at restaurants they offer a meal and some parts are just ok.  This restaurant's meal was great, all around. I happily left a 30% tip and will return soon.  Thank you..."}
{"text":"Was leery of trying at first because the old Hibachi Hiyashi was hit or miss, but we were pleasantly surprised. Went here for a sushi night and ordered pot stickers, calamari, and had salmon and tuna sashimi. The appetizers were cooked perfectly, but the sashimi was so fresh and sweet that we will be back as soon as we get the chance. Large portions of fish and the service was fast and attentive. It was so good that we ended up staying after for more saki bombers than we probably should have. Highly recommend"}
{"text":"My family and I decided to try out our newest and nearest Teppanyaki restaurant. I have read and heard mixed reviews. I cannot speak for their sushi but I can tell you it's overpriced compared to where we go for fresh quality sushi (Fresh Wasabi). The inside is very nice and new and they did a pretty good job at seating us fast on a Saturday at 5pm but we did have a reservation. I wasn't a huge fan that the soup and salad came right before the chef got to our grille and started cooking because you almost feel rushed to eat it. The flavors for everything was very very tasty! I loved the fried rice because it had so much flavor and seasoning so it didn't need any extra salt which can happen a lot at these types of places. The seafood was cooked beautifully and so was the steak we ordered. The vegetables were delicious and plentiful. We like to add teriyaki to our vegetables and meat which give it extra flavor. We thoroughly enjoyed the food. My only three real complaints would be that our chef did NOT really put on a show at all! No butter-fly, beating heart fried rice, egg roll, etc... he did a couple of things but was not very interactive like we heard at the other full tables around us. Second complaint was it was very very loud in there and you could barely hear any speak. Lastly, since it was so full in there and there wasn't a lot of space between grills it got very very hot. We will be back to give it another chance because the food was very good. I'll keep you updated."}
{"text":"service food was terrible. ordered steak medium and came out burnt. food no flavor at all , tasted old. was very disappointed. Should have gone down the street to Big Buddha  like my wife suggested. For a new restaurant you would think to see a manager around, none what so ever. God luck Sakura"}
{"text":"I dined at the Surprise location twice in the last two months and both visits were terrible. The first visit I ordered salmon, mixed tempura, and California rolls. There were three tiny pieces of salmon and a lot of onions and cabbage underneath it with a lot of teriyaki sauce. The tempura and California rolls were BLAND. How can you mess up imitation crab meat? It tasted like mayo and mush. The rice on the seaweed didn't have enough rice wine vinegar nor salt, it didn't have any flavor.  The server was pleasant and he was very kind. Despite the flavorless meal, I tipped him for his good service. I came there for the food though and it was disappointing. Second visit was WORSE than the first visit because the server took away our menus and I had to stop her and say \" why are you taking it away, you haven't even taken our order?\" She apologized and said she thought she took it so I asked her ,\" then what is it?\". She took our order and another server in training brought our drinks . After they both delivered our orders, no one checked on us. I was sucking on ice chips because I was thirsty. Two tables were waiting and shaking their heads and looking around. Food was mediocre, not a good representation of Japanese cuisine. Rolls were uneven and loose. Shumai tasted like rice paper dipped in fish flavoring. Gyoza was decent but I can buy better Gyoza's at Lee Lee market or Trader Joe's. Poor service! I had to ask the host to find the server so we can pay and leave. I won't give this place a third chance. It struck out the 2nd time and I always try something a second time to give the benefit of the doubt.  UNI hands down is the best sushi place in Surprise !!!! Sakura needs to train their servers and season their sushi and dishes."}
{"text":"Brand new place, had to check it out. It's huge, and very nice inside. Nice setup of hibachi grills on one side and tables and booths on the other. You don't have to sit at a hibachi table to order the teppanyaki meals either which is nice!  Food was good, in fact I thought the chicken was pretty damn awesome in the teriyaki sauce they cook it in. The lunch portion of meat was a bit small and my dude thought the rice was a little undercooked but we both said we would definitely come back. Good new addition to Surprise!"}
{"text":"One star for the chef that actually busted their butt to make the food and put on a show. This place was mostly empty and I probably should have listened to the reviews but gave it the benefit of it being new. Long story short it took forever before our chef came over and the prices are outrageous. Just don't see myself going back here. I don't mind paying, but not for average fare. Take a look at the menu prices that another yelper posted, not very wallet friendly."}
{"text":"I called Sakura at 2:30pm to make a reservation for my daughter's Birthday dinner, at 6:15pm on 4/24. I was told they could accommodate the 12 of us, in the regular dining area (not a teppenyaki table)  at the time I wanted. My husband and I arrived promptly at 6:15 and we were told it would be about 10 minutes before they could seat us. I said it was fine, and asked to see a menu. I noticed there were only a few things listed for the dining room menu and asked the hostess (whom was very nice)  about teriyaki chicken, for the teenagers that were joining us. I was told they only serve it at lunch, but I could ask our waiter/ waitress if we could order it for dinner, but she wasn't sure if we could get it.  Then I asked if the $25+ prices were what we would be paying for teppenyaki plates, even though we wouldn't get the whole \"experience\" of the teppenyaki table. She said yes, those were the prices. So now all our friends and family have arrived and we are discussing food options, and we are all literally still in the waiting area to be seated. It's now 6:50 and the hostess asked if I thought we could \"squeeze into\" 2 tables there were side by side or did we want to wait for the 3rd table to open up. I saw the couple sitting at the table she was talking about, and they had both just ordered cocktails. There was plenty of room in other areas of the dining room to pull table together for the 12 of us to sit, the entire time we were waiting for this one table to free up.  I dont understand why after making a reservation, we had to wait more than 45 minutes! It would have been longer.....but we  decided to take our dinner party elsewhere. I called another local sushi restaurant and they were able to get us in, no problem. We arrived there in 10 minutes and our tables were set and we were seated as soon as we walked in!  Sakura not only missed out on a very hefty dinner bill, but have also made a very bad impression on 12 potential loyal customers! Doubt any of us will ever be back!"}
{"text":"Our new favorite place in Surprise for sushi. I would highly recommend the Cowboy Roll, but the three others we got were also amazing!  Thanks to the staff for your great service and attentiveness during our dinner last night.  We'll be back!!"}
{"text":"We had a wonderful family lunch at the Teppan portion. The chef put on a great show for us and our food was perfectly cooked (steak, chicken, shrimp, scallops). Good food and good fun!"}
{"text":"Great ambiance, terrific service, fantastic food. We had goyta, filet mignon, Godzilla sushi roll, and mango mochi. All of it was fabulous. Filet mignon was succulent and cooked to perfection. Highly recommend! We will definitely come here again."}
{"text":"We were excited that Surprise was getting a hibachi place again. We didn't see/hear about an official grand opening and just found out by driving by to check on the progress as you can't tell from Bell Rd. Don't let the outside fool you, it is HUGE inside! To the right are the hibachi grills/tables and to the left are dining tables, the bar, and the sushi bar. Dividing everything is a water structure/fountain with some tiny fish in it.   We sat at the hibachi tables (it was Monday, 2/19 when we went) for dinner and it was pretty empty. We were probably one group out of 4 other groups/families. They had plenty of employees working though- although the host seemed to be in his own world and never noticed that we even walked in. A server finally came over and sat us. We got our drinks fairly quick and placed our order. The sushi roll we ordered was awesome but other than that, we are on the fence. It felt like it took forever for our chef to come out and begin. I don't know if it's because they start people off at different times? Ex: When we arrived, the others at our table were already being served soup and salad (the dressing is awesome). So it took awhile to get our soups and salads then wait for the chef. Our chef was nice but not very interactive other than the standard \"onion volcano\" and offering to toss a veggie into everyone's mouth. It was pretty quiet otherwise. The chicken tasted awesome, the filet was just \"meh\" - won't get that again, and the shrimp and shrimp/yum yum sauce were pretty bland. The fried rice was excellent but the steamed rice was partially crunchy.   Also, it was a chilly AZ day and the hibachi tables got a direct gust of wind whenever the door is opened. That was not enjoyable as I didn't want to wear my jacket during dinner. If we ever do return, we're going to ask to sit to the far right of the restaurant, not near the water/door.   For the price, I don't know if we'll go back. For two adults and one child, no alcohol or soda, our bill was over $100 and I don't feel that their experience and food as a whole warrants that price. Didn't feel very welcome."}
{"text":"Best place in surprise to grab some delicious sushi and have you tired the hibachi grill !!! It's out standing,I have had it twice and both my chefs were awesome!!! But ...... when we went this last time we had Michael and let me tell you what this guy can preform!!!! I definitely will be coming back and I recommend asking for Michael"}
{"text":"So this turned at pretty ok. I set myself up for an expensive mistake, but I'm ok with my dinner. I was not knocked off my feet or anything, and the prices were kind of high but I would come back. The one caveat is the sushi was a bit bland and the pieces were small, but still tasty. I am spoiled but again, a good experience."}
{"text":"We walked in at 10:15p and the first thing they say to us is \"kitchen closes at 11p.\" Not a real good first impression. And then every 5 min the waitress came over to see if we were ready to order.   Now I do realize (as a previous restaurant manager) your staff is always ready to close up as early as possible if they can. So I realize that   a party of 4 walking in 45min before kitchen close might prevent that, but at no time should you make your customers feel that way.  I would have given them 1 star, however the food really was good. Too bad the service was lacking. Unfortunately, I'll never come back. But if you decide to, don't make the same mistake we did. Go during peak dinner hours. I'm sure their service is impeccable then."}
{"text":"New place and ratings were not very high, but gave it a try for a group of 10 last nite and have to say it was really spectacular, great cook put on an excellent cooking show, food was fresh and well cooked, very tasty. Think they have ironed out the newness. Will be back."}
{"text":"Food was flavorful and service was great. If you need a place for celebration, here it is."}
{"text":"I have been to this new place twice. The first time I sat on the side without grills and I ordered the chicken. I was really disappointed with the serving size of the vegetables. I seriously had 2 pieces of broccoli and 1 small piece of zucchini. The rest was mushroom and onion, and all together, there wasn't a half cup of vegetables. I spoke with the manager who agreed it was not appropriate and sent me a small dish of vegetables to compensate. It was about the same amount as the first portion, so not what I would be happy with given the 21 dollar price tag. The food tasted good.   Today I decided to try it again on the grill side, thinking it might be more what I expect at that type of restaurant. Nope. I ordered the chicken again. There were more vegetables this time; I will admit, but still not enough given the price tag. Then the chicken was served and it was about half the amount on my daughters children's meal. The food tasted good but far too expensive for the serving sizes given.    The service was excellent; our server was very attentive However, the cook was only attentive to the other side of the table hardly bothering with our side, which normally I wouldn't care, except I think that may be part of why the were so short.   Again, the food tasted good, but  the serving sizes are not really  comparable with other restaurants of this type even though the prices are as high."}
{"text":"Very good! We sat at the Teppan table. Had steak, scallops, chicken and shrimp. Very yummy!"}
{"text":"Went for dinner this evening for the firt time.  Beautiful building. Food was not good.  We had a noodle dish and calamari. Our friends had sushi rolls and edemame.  It was so salty you almost couldn't eat it.  Not much flavor other than the salt.  Waiter was nice but never even checked to see if our food was alright.  The music was bizarre! Rap music at a nice sushi restaurant was not very relaxing.  It was like they couldn't decide if they were a nice eatery or a bar and grill.  Won't be back."}
{"text":"Tried this place for lunch. The inside is very nice. We sat on the side with normal tables and has some sushi rolls. They were excellent. Definitely come my back to try the hibachi side soon!"}
