{"text":"About as mediocre of a salad you can get. To make it worse you always end up spending $10+. Not gonna go back."}
{"text":"What a great concept!  The salad was fresh and dressings very tasty. The Staff was awesome. Keep up the great customer service."}
{"text":"Good salads. A little pricey. Used to have dope sourdough, where did it go? I loved the bread. Who doesn't love bread? All I'm saying, #bringbackthesourdough"}
{"text":"I come here quite often for a yummy filling salad so I'm surprised I haven't reviewed it until now. I always make my own salad, and you can choose a base (grains, kale, spinach, etc) and four toppings.  I love how their vegetables are fresh, although overall the salad is a bit on the expensive side (which didn't affect my rating). The portion, though, is quite large, which is great. I really like their bbq chicken and tuna.  I do with the tuna had more flavor though. My favorite dressing is the carrot ginger vinaigrette which is slightly sour but I love that you can slightly taste the ginger.  The one thing I'm not a big fan of is that they don't consistently have spring greens / mixed greens. I'm not sure if it's because it's not a part of the menu or if it's seasonal or every other day :/ otherwise, love the food. Definitely very filling!"}
{"text":"I'm a little surprised at the lukewarm reception here so far, given that the last salad I ordered at Salads UP is easily the best salad I've had in a long time, if not ever. It was the Turkey Toss, a daily special that featured kale tossed with cranberry-red wine vinaigrette, roasted turkey, Brussels sprouts, sweet potatoes, stuffing \"croutons,\" and topped with a toasted marshmallow. (A toasted marshmallow! On a salad! And it worked!) Not kidding, it was divine. I felt like I was eating a (much healthier) Thanksgiving dinner for real.  I can't speak to the permanent menu or to the wraps; so far, all I've ever ordered is the daily salad special, so perhaps that's the trick to getting the good stuff.  The prices are reasonable for lunch iff you only get a salad or wrap ($8-$11 range). It gets a lot more expensive if you add soup ($5), a smoothie ($6), or a fresh juice ($5). All of those items are tasty and worth trying, but it makes for an expensive lunch if you opt for all the trimmings. Unsurprisingly, there is no soda fountain, so the drinks are all bottled (read: pricey). However, they do have free fruit-infused water.  So far, I've never waited in a line, even at the peak of lunch hour. Service is friendly. Wifi isn't available/doesn't work, so don't expect to do any studying there. But if you're looking for a good salad, I'm not sure I can think of a better place on State St. (or even in Madison at large) to make it happen!"}
{"text":"I have tried a number of the salads and juices and they all have been fantastic. The ingredients are high quality and fresh and the flavor combinations are unique and delicious.The Dandy Lionade (with lemon, dandelion, and red bell peppers) and the Elixir (with passion fruit and mint) juices are the best!"}
{"text":"Around mid-winter, I find I crave salad. For some reason, Madison doesn't have too many places mainly dedicated to salad, which is a shame.  This is a smallish place that was doing a brisk business even at 3 o'clock in the afternoon on a weekday. To get the staff and everyone else pumped up, music more suited to nightclub was blaring from the ceiling speakers, making it difficult to communicate with the staff behind the counter. Thankfully, either by fiat or otherwise, the music was switched off.  The menu is an oversized board mounted to the wall and you can either create your own salad or wrap with what is on hand or order one that is already established by Salads UP. The queue snakes around guided by ropes. Everything is laid out in front of you behind the counter, so you can see what your getting. I opted for one the established called Fresh Prince, which had two kinds of lettuce with various toppings and a ginger carrot dressing. This is then lightly chopped for easy eating. The salad was pretty good, but will probably taste better once winter hits and the need for vegetables in your diet increases. All the salads can also be made into wraps which looked like to be a popular option. Drinks and cookies are at the cash register, along with the tip jar. The also have ice water for those that want that.  The seating is mostly high plastic stools with no back, but one of the bars looks over onto State Street, which is great for people watching. There is a low communal table that fits around eight if you prefer that option."}
{"text":"Awesome spot for a quick lunch or dinner on-the-go. Went in a few weeks ago and noticed the huge range of cold-pressed juices--definitely will be stopping by more in the near future to try those out! Had the Kale Caesar wrap warmed up which was a great, and filling dinner ! Definitely check this place out if you are in the Madison area."}
{"text":"You really have to be into Wasabi if you order the so-cal wrap; the wasabi ranch was extremely over powering. The price is a little too high for the quality of the meal."}
{"text":"The concept is great. The salad flavor was just so-so. Service was slow and chaotic. Not impressed given its basically a full service salad bar"}
{"text":"GREAT salads and AWESOME customer service! We get takeout salads once or twice a week. Everything is always FRESH! It's a go-to place for us."}
{"text":"Cool concept and love when a restaurant try's serving healthy food. Unfortunately this one falls very short. First off, both wraps were not amazing. The flavors were off, I especially didn't like how extremely sweet the BBQ chicken was. The chicken itself seems overcooked and/or low quality.  The worst part was I found a relatively large and sharp bone in my food (see picture). I'm very lucky it didn't puncture something in my mouth. I've found bone several times before while eating out but nothing to this size. I never thought about it before but a wrap is probably the most dangerous place to discover one.  Bad first impression but I'll still give two stars since the concept is good and I see great potential if they can improve."}
{"text":"Cool concept- but not great in practice. Salads are very mediocre & WAY too expensive for the quality/portion size."}
{"text":"Went in today to try one of their new Acai Bowls. Ordered the Berry Bowl. It was made to order. Ingredients seemed fresh. Overall, tasted good. I also love their salads, especially their Chicken Caesar Salad."}
{"text":"Really like this place. Cool, clean and fresh spot. The selections are tasty and you can make your own. All ingredients are fresh with lots of selections. They even have gluten free and vegan selections so there's something for any one.  I also like the option to order and pay with the app you download on your phone. Plus, if you do the download, you get $6 off your first order. And after so many visits, you get credits toward another order.  I plan to come here a lot while my temp stay here in MadCity.  I'll remember to post pictures of my salads or warm bowls. Maybe I'll order a wrap next time.  Oh! And if you check in on yelp, you get $2 off."}
{"text":"I'm a HUGE salad fan, so it's very important for me to find a reliable salad place in whatever city I'm living in at a given time. SaladsUp is my go-to in Madtown. Besides always having the foliage and add-ons I like (not everyone has fresh shredded kale & goat cheese!) I think their selection of dressings is 1. very unique and 2. very delicious. Can't wait to try the New Glarus vinaigrette! Really kind staff, and decor is on point."}
{"text":"I was super excited about trying Salads Up. Unfortunately, I was disappointed with my smoothie and warm bowl. I ordered the Super Fruits smoothie that boasted an array of yummy fruit and almond milk, and it came back tasting watered down, severely lacking in flavor and had the consistency of a slushie rather than a smoothie. I also ordered the Koto Bowl, which had virtually zero additional flavor than from the natural ingredients. The tofu was bland, and I could not taste even a hint of the Miso Chilli Dressing. I was really sad :( Come on Salads Up, you can do better. For me, it's a Salads Down."}
{"text":"I visited a few weeks back while on a walk around down-town Madison. I found a Groupon deal for $8 for $4. It's certainly meant to be healthy and the quality of produce didn't disappoint. It's a bit expensive compared to Salad Creations that was on the West Side of Madison a few years back, but I don't mind it for a \"feel good\" faster food option. The size of the salad was a bit too large for me so I had to throw some out since I wasn't going home and it's warm out. Solid place. I'll return again!"}
{"text":"quick and easy way to get a great salad! you essentially tell them what ingredients you would like, and they just throw it together in a bowl. i added the shrimp to my salad and it was great! also have the option to make it a wrap if you desire. dressing are good too"}
{"text":"Very mediocre especially for the price. Lettuce was watery and flavorless - a big problem for a salad place. Bread was stale.   Fairly inefficient and slow. Lots of staff meandering around but only one taking orders and one chopping. Managers seemed more interested in standing around than actually helping out.   Staff should go to DC or NYC to observe how Chop't or sweetgreen get people in and out the door with delicious flavorful salads."}
{"text":"I've been here twice, and have had a mediocre experience both times. My first salad was roughly $13.00 (no drink or chips) and was nothing special. The second time I came back because I had a 20% off coupon and decided to give it another shot. I opted for a signature wrap this time around and what I got was brown apples and an extremely brown avocado. I am actually appalled that the employees would feed that overripe of an avocado to their customers."}
{"text":"I'm really loving this place. I've been twice and am going to add it to my 'usual lunch haunts' list. I first tried the tuna poke (Island Poke) salad and it was really good. The tuna was not the best that I've had and it had a little 'fishy' taste to it. Other than that, it was full of flavor and I loved the spicy sauce and variety of offerings in it. The second time I was in, I went with the SoCal Surf salad. Yum! There was a lot of shrimp in it. I added pepita seeds to the top and that crunch was so good. The lemon vinaigrette was a nice compliment to the olives and onion. You can't go wrong with avocado. And this salad is no exception. The first time we were in it was a nice day so we sat outside on their patio tables. The second visit was a little colder out, so we grabbed a table inside. The music was a bit loud so it was hard to have a conversation with the others at my table. I love the two flavored waters that they have for free. I usually try a glass of both. What a great excuse to keep hydrated. I need to stop back in to try one of their warm grain bowls now that the weather is getting cooler out. Eating healthy doesn't have to taste bad. Glad that they have figured that out for me. I think you can order anything on the menu and not feel guilty about eating out. I like that!"}
{"text":"Groupon Review:   I paid $4 for $8 worth of food and well I got the \"Earthling\" smoothie which was actually pretty good. Kale, spinach, banana, and pineapple were the only ingredients (I know because I was eyeing the man making it like a hawk). It's pricey but I would like to return and try one of their acai bowls.   Salads UP is definitely a place to go when you what to treat yourself in a healthier manner."}
{"text":"The concept is pretty cool and the location is great. Definitely recommend getting a salad wrap! The soup is good too."}
{"text":"This place has a really cool concept that Madison hasn't seen before. They make everything super fresh, even going as far as pitting the avocado in front of you. But, the flavor and value weren't there for me. The menu is small and only one thing sounded good to me. I asked for it in the wrap version and they looked shocked. The girl preparing my food didn't know what was in the item I ordered and had to look up at the menu board for every single ingredient. The whole time she was asking me questions about what I wanted and I couldn't hear her at all, which annoyed both of us. Ultimately it took 15 minutes to get my food and my boyfriends in hand even though there was one person in front of me. Once I actually ate it I was so disappointed because all I could taste was the wasabi ranch and their starchy flour tortillas. I ate it in 3 minutes and paid $13.50 for it. Probably won't return."}
{"text":"This shit is so over hyped. I really enjoyed it the first time I went but the last three times has been so disappointing. One, the staff is very rude and the food tastes bland like something from Gordon's salad bar. It is SO expensive...save your money and go to Whole Foods and make something with flavor."}
{"text":"Came to Salads Up for the first time for dinner and was very underwhelmed by my experience. The Red Card deal of the week was to get $2 off any salad or grain bowl, so that's why my friend and I tried it out. In an effort to try something that I haven't had before, and something you don't see on many menus (unlike a Cobb salad or a Caesar salad), I ordered the Seoul Food which is a Korean BBQ salad. It was comprised of spinach, BBQ chicken, pineapple, cilantro, roasted red peppers, and Korean BBQ dressing.   I was really thinking that I would enjoy this salad, but after eating it I wished that I would have played it safe with their Cobb salad. The chicken pieces in this salad were large and unappetizing to look at. I ate them anyways, and they were meh -- not very tender, and took a lot of chewing to actually eat because they were big. My friend and I were looking for knives to use to cut our chunks of meat into smaller pieces, and the workers informed us that all they had were sharp knives behind the line so we couldn't use them.    The salad was overwhelming with roasted red peppers, and had a few pieces of pineapple in it. A bit more of a balance between the two would have probably helped!   I spent about $8 on the salad even after getting $2 off, and I don't think I'll be returning to pay full price for anything else. I feel a little harsh writing this review, but for a place that's meant to specialize in salads, they didn't hit the bar for me. I would much rather spend $10 at Panera for one of their salads -- which are healthy and filling and much bigger portioned than Salads Up."}
{"text":"I tried the kale Caesar salad wrap, acai bowl, and power green drink. I thought that the wrap and drink were both very good. I ordered through uber eats and the description did not say that there was chicken in the wrap, but I still enjoyed it. The acai bowl was very sweet, and bigger than I expected. Overall, I would reorder the wrap again and try some of their other juice flavors. The acai bowl seemed more like a dessert than a healthy breakfast"}
{"text":"They have really good warm grain bowls - salads are really yummy too! Love the Caesar and Avogoddess sauces most. It's a little overpriced but each portion is huge so you can split it to two meals if you want"}
