{"text":"Salerno is my favourite spot in Montreal to get a panini. The best part? They're open 24/7! Therefore, if you want a panini or are craving a late night sweet treat Salerno's is the place to go. 

If you're there during the day, ask for Nancy. She makes THE BEST sandwiches ever. She really packs on the meat and cheese! 

The paninis are only $5.00. You get to choose your cold cuts (salami, mortadella, capicollo, prosciutto) cheese (provolone, bocconcini), bread and toppings. Toppings are usually pickled veggies such as eggplant. You could add mustard and/or mayo. 

If you're not in the mood for a panini they have a wide variety of cold salads and pizzas that could be warmed up upon request. They also have a big variety of traditional Italian cookies, pastries, donuts and cakes. 

Definitely a spot to check out if you're in the St. Michel area and if you want a taste of Italian culture at a low price."}
{"text":"Came here to pick up a large order of panini and cold cut cuts for a family get together. Was served  by 2 terrific staff members who had everything prepared and wrapped perfectly. 

It all tasted very good and will be back to test out their pastries. 

NB it's a cash only place and unfortunately the Sunday I was there their ATM was on the fritz. 

Parking is a little tricky!"}
{"text":"I love their cold cut sandwiches. I usually order one with all the spicy meat cold cuts and it's around $5 only! Ask for mushrooms and mustard and mayo :)they also have cold pastas, ready to heat sandwiches and pizzas. They have a variety of desserts (bakery) and cookies, donuts , cakes as well. I always find this convenient as this is a 24/7 place. :)"}
{"text":"Je croix que je viens ici depuis bébé. 
Les lieux ont apporté beaucoup de modification à la.bâtisse mais leur produit ont garder le même goût et authenticité avec le temps. Leur fameuse pizza au tomate fraîchement faite du jour est un classique.
Tout sauf sur ce qu'il y a sur les tablettes ou au  frigidaire est fait du jour. Je vous recommande ce bijoux de boulangerie Italienne."}
{"text":"They have some great italian subs. A sandwich costs about 6$ and comes with a generous portion of cold cuts, cheeses, and pickled stuff. Since I'm not a connoisseur in italian subs, I asked the lady to prepare two sandwiches as SHE LIKES them, so to this day I have no idea what I ordered exactly, but they were both 5/5 good. 

I also tried a cannoli. It was great. It has a good contrast in texture: crispy dough and creamy filling. It was also not overwhelmingly sweet. They are a bakery, so they sell many other pastries and cakes that all look delicious. 

While in their store, I also saw fridges filled with homemade batches of tomato sauces, pizza sauce, and different pasta sauces. They seemed like I'd finally be able to cook a good pasta dish. 

One important thing to mention is that they're open 24/7, which means you can walk in at any time for a delicious sub for 6$. There's also pretty big dining room next to the shop so you can eat on the spot and go for round 2 ;)"}
