{"text":"I actually think it doesn't deserve a star. Service was rude and food was bad. The tomato salad was supposed to be heirloom but was just tasteless generic wanabe tomato salad and, I had to ask for it 3 times because the server kept forgetting and became even more upset than I was. I love Laurier avenue and I appreciate the other restaurants even more now that I know how bad this one is."}
{"text":"How would you like to have a meal surrouned by a bunch of cokeheads? And I don't mean Coca-Cola. We had a front row seat, by the window...

Hands-down the most creepy ambiance. Who does smalltimer drug deals in restos anymore? This is so Boul. St-Laurent (à la Caféteria) passé. One of the local dirtbag dealers actually got the waitress to break his drug money for change. WTF!

Sad part is, the food is actually okay, because it's a chef-owner running the kitchen.

Bathrooms: I have to comment- don`t even lock properly. (sliding pocket doors with a ten cent lock)

The wine by-the-glass was old from sitting around for too long. Not cool. Red vinegar anyone?

The whole experience was shocking, considering the potentially charming interiour of this resto. I was expecting more.

The icing on the cake, was the big whiff of cigarette smoke that passed through the room when the kitchen staff took their break. Mmmm... appetizing.

Do urself a favor and pick any Laurier resto- except this one; unless, u want a chance at the same experience. They're anything but uninteresting, that's for sure. Oh, and if you do blow, this review might be useful to u, as well."}
{"text":"This is my second dinner at Salute and I'll give this nice little neighbourhood restaurant (Laurier blvd) a lukewarm approval on the food.  I started with tomato-braised meatballs as my app and had cod with scalloped potatos as my main.  My wife started with a tomato salad app and had porcini risotto as her main.  We shared a warm chocolate pastry for dessert.

My thoughts:  I waited at the bar for my table to be cleared and suggested to the lady who seated me that I'd enjoy a cocktail while I waited.  \"Good idea\", she replied.  And of course I sat there with no drink for 5 minutes as no one was tending bar.  I let it go.  No big deal.  So we order cocktails at the table.  bartender comes back...\"sorry sir, Can't make a Manhattan, I don't have the ingredients...may I offer you a Martini.  I settled on an original concoction he invented a few days earlier...and it was ok...but not anything I would ask for a second time.  

The Tomato-braised meatballs were fine but cod was disappointing.  It was tender and buttery, but really nothing beyond ordinary as far as flavour goes.  The Porcini Risotto was extremely salty and the menu does not note that it's prepared with truffle oil.  I am borderline allergic to truffles, so factor that into my comments on the Risotto.

The dessert was tragic.  It looked like it was scrambled together in a real hurry in the hopes that we'd bolt it down and leave, so the staff could go home.   And maybe, just maybe that was the underlying factor that night.  It was early Jan.  The Christmas holiday and New Years is just a few days in the rear-view and maybe people just weren't up to the effort.  BUt it was my second dinner there....and it reflects my first experience...so I think that's the last time at Salute for us.

The staff were great and the wine was nice...so for the sake of the very nice people working there, I hope others have better experiences than mine."}
