{"text":"Went looking for something to eat a bit later in the evening and couldn't find much open. Just when I thought Sam's Eatery was closed and was walking back to my car Sam himself let me in and made me something to eat on the spot. He mentioned that customer service is his specialty and his passion and talent show in his food. I had an amazing falafel and bought some desserts, and lunch items for the week. He didn't have any Baba Ghanoug left but went into the back and he made it on the spot! Doesn't get any fresher then that, and is wayyyyyy better than the store bought stuff (that goes for the amazing hummus here as well). You won't be sorry if you try Sam's Eatery, it is a way healthier option than any fast food joint, and everything really is delicious!  :)"}
{"text":"A friend of mine and her daughter mistakenly sat at one of Sam's patio tables thinking they were for the Quizno's next door. A Sam's employee very rudely told them to leave. When they complained to Sam himself, he screamed at them and said \"I hope you fucking die!\". No Sam, I hope your business dies."}
{"text":"This is the only place you should go to if you're in Airdrie for Lebanese/Middle Eastern Food.   Sam is an amazing man. Such a kind and caring person who truly loves his food. He makes EVERY SINGLE THING from scratch. His Chicken Shwarma is perfectly seasoned. His Beef has a nice savoury flavour. The Donair Special is a huge STEAL at $5.   Other key things. Sam has worked in the camps up north for over 40 years so he knows how to fill a stomach. I went in because of a sign on the side of the road that said Donair $5. When I got in there the decor was nice, but the place was empty. (THIS SHOULDN'T BE THE CASE). Sam was working behind the counter when I got there.   We talked a little and I learned a lot about him. His care for his food is amazing.  His house dessert is amazing. It is a small crepe which he fills with a cream filling and then drizzles a simple syrup over top of it. I ate 6.   The baklava is flaky and moist, just like it should be. There is a definite flavour of honey in it.   The Tabouli is incredibly fresh and tastes of lemon juice on the end.    as I have already said Sam is kind and generous. He really believes in his food, and his work.   I would HIGHLY recommend Sam's Eatery anytime you want good, high quality middle eastern food.   I can't wait to try everything on his menu."}
