{"text":"Just had my first Sammy's experience (8/18/14). I will definitely be returning. I've tried a lot of different pizzas in the Greentree area, and this one is a favorite."}
{"text":"Ordered over $100 of wings and pizza here, paid over the phone with my credit card. Delivery driver delivered pizza and we tipped in cash. Delivery driver came back 2 hours later and said we didn't pay the bill. We told him we paid via credit over the phone. We told him to have them call us if there was any problem. The girl called back and said we never paid, even though they took all of our credit card numbers. My wife tried to explain the situation and was yelled at. My wife asked to speak to the owner, and she got on the phone. The owner told my wife that she didn't want to hear what she had to say, and proceeded to call my wife a bitch, and that if she didn't pay again that she would send the police to our house.  We used to frequent this place, but will never go back. Also, we will tell anyone who considers this establishment to be warned. They are rude and we do not recommend their food. The salad we got from there tonight was bad, and their customer service is terrible. We are going to contact the better business bureau, and we will never, ever go back. Neither will our friends or family. Their treatment of a customer is classless and obnoxious. Don't go. Save yourself the hassle."}
{"text":"Horrible service....ordered from them twice.   The first time took over 2 hours for my food to be delivered to me cold and just tonight I didn't get all my food and their pizzas have a lack of toppings... Won't order from them again"}
{"text":"Could this place be any slower? I mean any other pizza place it's like 15-20 minutes but whatever. I've come here for pick up 3 times. The first 2 times, I waited an additional 15 minutes after arriving (which was 25 minutes after I called). So the third, I was smart enough to go later. However, here I am, 40 minutes later.. still waiting for a small pizza and hoagie... Don't bother with this place."}
{"text":"overall food wasnt half bad, my major issue was so -called hostess chasing our car down the street because we had the nerve to use gift certificate to pay for our order, never have i been treated so poorly ,my only advice if you decide to go is bring cash and lots of it"}
{"text":"I have lived by and been visiting this place for almost 8 years. They have hands down the best Pizza in the local area. I grew up just a little over an hour from Buffalo and I can tell that they have the best Wings in the Pittsburgh area. Ive tried dozens of places and most come up short. This is clearly not a wing town but Sammys almost always hits the mark. They are always perfectly cooked without having to specify any special instructions and the sauces are great. If you get hot wings from any of the other local spots they are almost always under cooked and have a very strange sauce, not really quite sure what it even is. Not Sammys, perfectly cooked Buffalo style hot wings, best you can get this far from Buffalo. They're hogies are also fantastic. They use Mancini's bread so you can't go wrong. The Italian is my personal favorite. Hands down best pizza joint in the area!"}
{"text":"One of our favorite places to order from regularly. Great pizza, usually extremely quick from order to pick up time. 

Some of the best wings from a pizza joint. Done all the way through, crispy skin.

Only complaint - they only deliver on weekends."}
{"text":"Sammy's. Shammy's. Sambo's. Slambo's. Shlambo's. Shammy, thank you for the shamshine. I could go on, but I'll get on with the review. However, those are all the names I call my fave pizza joint in Pittsburgh.

\"Hold up, J.\" I hear you saying. \"Didn't you decree Sarafino's as having the best pizza in Pittsburgh?\" I did..and Sammy's is right up there with it. It's different from Sarafino's, but I love it just as much, so the kudos is going to have to be shared in this instance. So let's get down to it.

Sammy's is an inconspicuous joint in the Green Tree/Crafton dining area. It's been there for a while and it has its share of local fans and families that frequent it regularly (along with our local boys in blue as well as the state police). The staff is friendly, the atmosphere low key, and everything I've tried on the menu is damned good. 

The pizza is phenomenal. The sauce is on the sweeter side, with just the right amount of tang. The crust is soft and not too chewy, with the cheese to sauce to crust ratio practically perfect. Every time I have a first bite of a slice of Sammy's pizza, my mind splits open, just like Lou Reed sings about on \"Sister Ray.\" It's so good. Every element of the pie is tasty, with no one part overpowering any of the others. I like the pepperoni they use here. It's the smaller disc type that curls up on the edges when it's baked. And you can't go wrong at all if you get meatballs as a topping here, either.

My other favorite thing here is the chicken wings. Now, I generally think Wings, Suds and Spuds up in Moon Township has the overall best wings in the Pittsburgh area, but they can be a tad expensive. Sammy's fries their wings as well, and come really close to being a mirror of Wings, Suds and Spuds. They're also about four dollars cheaper per order. I love the buffalo bleu, buffalo ranch, and parmesan bbq sauces. They have a ton of other flavors, as well as some not regularly listed on their weekly wing night specials.

So what else is good here? The chicken parm sandwich is perfect, I've not had a better one anywhere. The steak hoagie is also excellent. The nachos are super, if you just get them with cheese only, or one of the bigger versions with meat and other toppings. Onion rings? Crazy tasty. Mozzarella sticks? Gooey and groovy ust like they should be.

There's also plenty of salads, soups, pasta dishes, fish sandwiches, etc. Everything I've had here I've enjoyed. I go to Sammy's at least once every week and I never feel like I'm tired of it. It's just that good. The prices are in that sweet spot as well, so compared to some of the other pizza and Italian places around, you do get great value for your money here.

It is a smaller establishment, but looks can be deceiving. The parking lot isn't big, but even when it looks crowded, there's often plenty of spots to sit at inside. So don't let a few cars dissuade you from coming in. A good restaurant wants lots of customers, after all. 

For the beer drinkers out there, Sammy's does sell brew, though there is no bar. They do have a good selection of favorite, expected domestics as well as some indie brews. 

They do a bang up business on the weekend, and deliver only on Friday and Saturday. If you live in the area, you may want to just call in and pick up your order as it's often quicker to do so by 30 minutes. No slight against their delivery, but since it's not an establishment that mainly focuses on that aspect, the takeout is a great way to go. A lot of times the parking lot is filled mainly with people just running in to pick up their orders.

So if you love pizza, Sammy's is the place to go, along with Sarafino's. If you're looking for the usual sorts of things local pizza places offer aside from pizza, then you definitely want to go to Sammy's. It's light years better than Portofino's, Mario's, etc. You can tell the staff cares about what they're making and serving to its patrons as the food is always top notch. 'Nuff said."}
{"text":"A friend told me about Sammy's Place having some good pizza so naturally I wanted to give it a try.  I also stumbled upon Just Pay Half gift certificates to make it an even sweeter deal.

Sammy's is a little out of the way for me and I only got take out a couple times so I can't speak much for the service but my pick-ups were always a pleasant experience.  I've only tried their regular pizza (none of that specialty stuff) and the turkey club loaf hoagie.  I didn't find anything outstanding about the food, but it was above average.  I did like the pizza sauce (a bit on the sweeter side).  And I happened to discover they make a hot ranch sauce so I made sure to ask for it with every order.  (It's nothing special, just buffalo sauce and ranch dressing mixed together but I could not get enough of it.)

If I lived closer to Sammy's or I was a little more impressed with the pizza I'd probably end up there more often.  And I would maybe have been able to decide between 3 and 4 stars."}
{"text":"Killing myself right now for living close to Sammy's 40+ years and never stopping in until last night!!! How we ever passed up this GEM--I'll never know! Clean, cozy pizza joint with great, friendly atmosphere and delicious food. The Super Steak hoagie is out of this world!!! Be sure to try one! Perfectly cooked, tender and tasty steak with cheese, onions and more--on a fresh mini Italian loaf of bread! We were in HEAVEN!!! Also had a delicious plain cheese pizza that was full of flavor and good cheese--the crust is perfection! We LOVED this place so much, we came back with family today for a late lunch only to find they are closed Sundays...we were bummed--but--as heartbroken as we were--I give kudos to them for taking a day of rest on Sundays (like the way it used to be on Sundays-everything was closed). You best bet our hungry butts will be back here within a week to try some more of their great offerings! Thanks for great food and great casual dining experience!!! See you soon! ; )"}
{"text":"This is the kind of gem that's off the beaten path and overlooked, but my wife and I had a great meal on the cheap, despite the late hour."}
{"text":"Really good steak hoagies and their sauce is really good, on the sweeter side, the cheese ravioli dish is really good also!"}
{"text":"Full disclosure- I have lived just up the hill from this joint for over three years and just visited yesterday for the first time. Now I'm kicking myself because I loved it!

I'm always on the hunt for a good turkey sandwich, and usually I'm disappointed. Looking at you, Subway, with your brick-textured bread and low quality lunchmeat. I have found my diamond in the rough: Sammys turkey wedgie. It was so good I forgot to take a picture! But definitely enough for two meals.

We got some wings and a pepperoni pizza as well. My husbands rule of thumb is that if a pizza place can't make a good pep pie, than they can't get anything right. And they DID! It was wonderful. I agree with the \"sweeter\" sauce posts- it's perfect, and the crust is fluffy but not doughy.

The ladies that work there are great, too. We had a nice chat with them since it wasn't too busy when we were in.
Ill definitely be back. Count on that."}
{"text":"In my opinion, they have the best single cuts. Cheese and crust are perfectly toasted. (For some reason I like their cuts more than whole pizza). And slices are huge!"}
