{"text":"Recently got out of the hospital and wanted something flavorful to eat. I decided to try out Sammiches Bistro on 19th Ave. I had the Carne Asada sandwich with homemade fries and it was delicious . Please give this place a shot, you'll be happy that you did. They also deliver ! Great attitude, great food, great price, great place.."}
{"text":"I was in town, from Atlanta, visiting family for Thanksgiving and wanted a sandwich. We went on Yelp and this place popped up. It is tucked away but so worth it. I had the buffalo chicken sandwich. It was so tasty and the baguette it came on has the perfect crust on the outside and soft inside. The owners were awesome and helpful with my selection. I will come back to this spot for sure. 5 stars easily."}
{"text":"Excellent. I have been working in this area just over 2 years now and I can honestly say that this was hands down the best lunch I've had during that time. I ordered the Tasty Turkey, it comes w/ Turkey, crispy bacon, provolone cheese, spinach, onion and basil pesto served on a toasted baguette and it was every bit as good as it sounds. I over heard someone order the Stake and Onion sandwich & the Carne Asada Torta, they seemed extremely pleased. I plan on trying both on my return trips. I highly recommend you check this place out, I can't imagine you will be disappointed."}
{"text":"I've had the Turkey and the BBQ Chicken Sammich. I was pleasantly surprised by both. The presentation and flair did not detract from taste in the slightest. Compile this with the warm and friendly staff... they made me a new regular on my first visit."}
{"text":"The food and staff are excellent and treated me like I've been a lifelong customer. I live in Chandler and found this place by chance when I was in the area. I would definitely go out there for those sammiches again!"}
{"text":"This place is AMAZING!!! Everything I have had here is AWESOME. Amazingly friendly staff and never too busy. Thank you Sammiches Bistro for being a great place to dine!"}
{"text":"Just ordered the Black and Blue Bacon Mushroom Burger - freaking ridiculous! That burger was to die for. We will definitely be coming back-Yum"}
{"text":"Stopped by on a whim. Chef Jacob and wife, Cathy, were extremely personable as I waited for my food. I ordered the Chicken Caesar Sammich. Happy with the sammich and happier with the owners. Yay for a successful local business!  (This is my very first review of any business, so it should tell you something!)"}
{"text":"Great food and great people. I got the bacon chicken ranch sub and let me tell you, it was amazing. One of the chefs and his son were working when I ordered my food and they're both very friendly. It's a good feeling when you find small eateries with amazing food and people lol"}
{"text":"Wife and I stopped in because we were on the west side of town, this was nearby, and it had 5 stars.  I had the Buffalo Chicken sandwich and my wife had the Steak and Onions sandwich and we shared some fries.  First off, crinkle fries are delicious and just because they are crinkled, doesn't always mean they are frozen.  I don't know whether these are frozen or not and I don't really care, because they were hot, fresh, and tasty.  Let's get rid of the ketchup packets though guys.  You've got classy stainless steel ramekins and then ask guests to fill up them up with packets.  If you're looking for cost savings, have a ketchup pump in the back.  Now for sandwiches... Buffalo Chicken was made with juicy grilled chicken, Bleu cheese and celery slices on a garlic bread bun.  Celery slices are a really nice touch and make this more unique instead of just putting lettuce on it.  If I ordered it again,  I'd get double celery, a little less buffalo sauce, and add tomatoes.  The Steak sandwich was tasty with tender meat pieces and crispy onion straws.  Great sandwiches.   Atmosphere:  Yes, of course this place doesn't have much curb appeal because of the 'eh' plaza it's in (but they can't help that).  Inside is clean and cooks/server were all friendly and passionate about their food.  Decor needs some work.  They've got something going with some pipe work on the wall, but it needs something else...maybe some pictures of people/food/places and not maps.  Lighting is kind of cool, but again needs some refinement.  Wouldn't mind if there was some music too.  Bottom line: tasty food, friendly people that are passionate about food, average atmosphere, low curb appeal neighborhood."}
{"text":"I very much enjoyed my experience at Sammiches.  The owner was friendly, convivial and genuinely interested in making sure we had the best experience possible.  This was not a difficult task as the food was excellent.  I was surprised to learn that all items were home-made, including the meatballs, Italian gravy and the bread.  We actually watched one of the cooks step out the back door to pick fresh basil for one of the sandwiches.  I had the Knuckle Sammich and quite honestly the meatballs were some of the best I've had in the valley.  And it was so inexpensive!  My girlfriend and I got out for less than $15 for a very satisfyingly sized lunch.  Outstanding, would go again."}
{"text":"This place is really good. Had the Cuban! Next week is burgers, be there! The prices are decent and the staff very friendly"}
{"text":"Simply put. This place is awesome. No frills, just great sandwiches at a reasonable price. The staff is always super friendly too!"}
{"text":"I'm not a burger person at ALL, with that being said this place is my number one resturant by far.... I discovered this jem almost two months ago and I've been here 10 times since. I know pretty crazy but everytime I have been here the burgers just keep getting better! The owner is fabulous and so is the staff I can't get enough!!  If you are looking for THE BEST burgers and sandwiches in Phoenix look no further!"}
{"text":"Sammiches Bistro has delicious food !  I always love finding a mouth watering sandwich to eat and their Buffalo Chicken Ranch sandwich did not disappoint. We also ordered the onion rings on the side, and they were cooked to perfection! We can't wait to tell our friends and go back!"}
{"text":"Stopped here while on a roadtrip for a quick bite and we are so glad that we did! I had the Caesar sandwich (minus tomatoes) and my husband had the Cuban. Both sandwiches were delicious and used very fresh, tasty ingredients. The pork and chicken were juicy and dried out. If we lived in town, we would definitely be back. So, if you live here stop by and give it a try!"}
{"text":"I honestly haven't had a better delivery experience. We ordered a Steak and Shroom fry plate & Chicken Caaesar Caprese.   I'm not one to over exaggerate but I can't even put in words how amazing it was. The food came in about 30-40 minuets; which I thought was acceptable. The driver (head Chef) ended up giving us out meal free.   GREAT customer service , and AMAZING food"}
{"text":"Sorry Cheba Hut, I found my new favorite sandwich joint! The BBQ Chicken Ranch sammich was delicious! I can't wait to try more, everything looked super yummy. Everyone was really friendly and even comped our meal because they were out of tortillas. Not what I expected!"}
{"text":"After having eaten there a couple times, I had to write a review. This place is like Food network came to life in  our neighborhood. The Chef Jacob is a cool down to earth guy who wears his passion for food on his sleeve. I got down on the jalapeño burger special... twice. It was hands down, the most perfectly crafted burger I've ever enjoyed. Kathy who runs the place was kind and accommodating to my son's food allergy. Robust menu that is as unique as it is delicious. They are even adding breakfast foods soon! Go check it out, you won't be disappointed."}
{"text":"This is my second trip to this little bistro and I will definitely be back again! The menu is small, but everything on it is creative and delicious! Who would have thought that pear on a ham panini would be so awesome?  The shop is just starting out, but they're definitely off to a good start! I intend to keep coming back just to see how this awesome shop evolves."}
{"text":"Excellent place for sammiches. ..  First time there after reading the reviews on yelp. Rather odd location.. never seen a salon mall before this. Sammiches is right in the middle of the shops. Very original concept and it evidentally works for them because they were BUSY!!!!  My wife had the chicken cease sandwich, I had the hami. She loved he's an dine was very original... ham, cheese and a slice of pear... (yes .pear)...  On sourdough and grilled like a panini.  IT WAS VERY GOOD.  Right off the 101 and 5 1st it get's a lot of business from the nearby doctors offices...and for good reason.  Excellent fresh handmade food at reasonable prices. The owners are very friendly and  very good at what they do.  Support the small busines' S and go there. You will not be disapointed."}
{"text":"Went in from the reviews. Both the owners were there. They were very nice and polite. Very delicious food and great bread. Great price for the food you get. I live near by and will definitely be back and bring people here. I love the old school diner vibe. Very relaxed atmosphere and a salute to the good times."}
{"text":"Had the buffalo chicken sandwich and is was great unique taste compared to others sandwiches"}
{"text":"I like the new restaurant - there's more room and a stream punk theme (cool radio). Same delicious FRESH sandwiches plus crispy fries. It's one of my go to places."}
{"text":"Just had lunch here, and it was amazing! The chicken Caesar sandwich was very tasty. The restaurant is in a charming suite."}
{"text":"Decided to stop in after seeing all the great reviews and see what this place was all about. A little hard to find at first...but very glad that I did! My friend and I tried the salad they had on special and it was without a doubt one of the best salads that I have ever had! Presentation was excellent as well as the service. These guys are proud of what they serve!"}
{"text":"Amazing! Why did I wait so long to try this place? Went today for the first time and had the green chile burger with fries and everything about the food was perfect. The burger was perfectly cooked and juicy, the fries were crispy, and the portion sizes were VERY generous. I ordered pickup but the inside of the restaurant seemed like a nice place to chill after work with some friends. You can really see the owner's unique personality in the decor. I can't wait to come back and try more things off the menu"}
{"text":"You wouldn't really expect a great inexpensive sandwich bistro to be in a such a location but they have great food and the owners are super nice. Great menu items and future food ideas from the sounds of it from talking to the chef (owner). Looking forward to thier next restaurant outside of the Salon building.  We sat around with our friends in the cozy area eating and talking to the owners. My son and I enjoyed the Knuckle Sammiches my wife and daughter loved the Hami Sammiches.  Great stuff, we will be back!"}
{"text":"Now I feel like all I did on my Az vacation is eat lol.. so many delicious meals to test. I definitely enjoyed my choice of Grilled Chicken Bacon Ranch Sammich Combo, everything just right!"}
{"text":"I love trying out new places for lunch or dinner and this is a great find!  Tucked away inside the Monogram Suites, Jacob, the owner was extremely welcoming and talkative.  I got the Caesar and my boyfriend got the Knuckle Sammich (meatball and pepperoni), both were delicious. Will be back again!"}
{"text":"I don't write many reviews and I'll admit that when I do, it's mostly because I had a terrible experience or an exceptional experience. I'm glad to report that Sammiches most definitely falls under the latter category.  I am all about supporting local businesses as I believe in the community. This locally owned and operated sandwich shop is exactly why I believe in supporting local business.   I was kindly greeted by Jake and Troy who are clearly passionate about the culinary arts and take a lot of pride in their product. The chefs were very inviting and provided good conversation in a relaxed environment. I had the spicy italian sub which was on fresh baked bread. The meats and cheese were very fresh and toasted to perfection. The pesto was delicious and fresh which complimented the sandwich very well. I personally wasn't a fan of the vlassic pickle served with the sandwich, but that's just me. I prefer a true deli pickle.  I will most definitely return to sammiches to try out different sandwiches as it's a great value for the quality of food."}
{"text":"This is a really fantastic place for sandwiches, everything made from scratch."}
{"text":"Sammiches is a family owned and ran little bistro that is absolutely amazing. The staff is as kind as can be and will chat you up while they make your delicious food. My favorite sammich has to be the chicken Caesar, but not to discourage any other food. The whole menu is phenomenal and so are the people. The menu is widely ranged from a lot or a little to meet whatever you desire! I recommend going when ever you get the chance and you won't regret it!"}
{"text":"This place is amazing...They deserve all of their success. Stop reading this and grab a sandwich!"}
{"text":"Good food, not great.  I had the burger and fries.  The fries were crinkle cut, basic, reminded me of frozen from the grocery store.  The burger was fine, but I like In-N-Out as much for 1/2 the price."}
{"text":"What a hidden (almost literally) find! GO INSIDE the Monogram Salon Studios!!!  While driving back to LA from the Grand Canyon my wife and I hit up Yelp to find a tasty lunch spot. After circling the build two times we decide to go inside and ask if anyone knows of Sammiches. There they are right inside.  What amazing food! Coming from LA tasty food is hard to find and when you do you can really pay for it, not at Sammiches. Great food, great prices, and great conversation with the owner.  If we ever find ourselves in Phoenix again we'll definitely be back."}
{"text":"Great sandwiches and fries. Liked the baguette. Great service! Will definitely be going back to try a burger next time!"}
{"text":"This small operation has a big heart when it comes to being a good neighborhood corporate citizen.  I urge all in the Moon Valley area to support them!"}
{"text":"Oh my gosh, you guys! I totally wanted to try this place when it came up in a yelp search months ago solely based on its adorable name. Today I threw it out there at work go try and guess what?! Everyone loved it!! I had the garlic bacon shroom burger and it was a fantastic mess! So delicious,but I had to wash my hands twice eating it. Lol. Both my coworkers loved what they got. One had the tri tip torta and the other had the steak and shroom fry plate. Definitely will be back to try all of the other delicious selections!"}
{"text":"Amazing! I lived in Florida for some time and I must admit the chefs (Jacob) Cuban is hands down the best I've had! To top it off, He is a cool cat!"}
{"text":"If you want a sammy before your nappy, this is a fine choice. I've been in multiple times now and each time has been great. The buffalo chicken salad is a staple. I've had three different sammies, the Cuban, steak and mushroom and a special that was outstanding. Staff is super nice. Owner is out and attentive. You know your Sammy was built with love. Save yourself from the gravy pants you'll get from chino bandido and get a Sando."}
{"text":"My husband and I have been coming every week after work. The chef is very passionate about what he does and takes his food seriously. That pride is what made this restaurant stand out. The owners seem to really appreciate their customers. I have seen on several occasions that they refer to people by name and strike a conversation. You honestly cant go wrong with anything on the menu. I love the Tri tip sammich my hisband will eat anything. Best place to come and feel like you are getting a home cooked meal with friends."}
{"text":"Absolutely fantastic! The chef clearly crafts every item with care and it shows. The meat and toppings were all perfect, and the bread... wow! The bread they use is so good, so fresh... I can't stop thinking about it!  I completely understand why this place has 5 stars. Good food, good service, well priced. I will be back for sure!"}
{"text":"Very delicious turkey sandwiches and fry plate. Service is very welcoming and warm, willing to give history on the restaurant and menu. Try the Jesus Grilled Cheese sandwich and you will not be disappointed. They listen to the customers needs and improve where ever needs fixing. Definitely coming back very soon !"}
{"text":"The best Cuban sandwich I've had.  The pork was pork shoulder sliced thick with a delicious mustard sauce.  The bread was tasty.  The two owners were friendly and the atmosphere was comfortable."}
{"text":"Excellent sandwiches, great personalities. The bread was fresh and chewy. The ingredients were tasty and well thought out. We had the knuckle sandwich which was super tasty and fulfilling. With pepperoni, meatballs and melted mozzarella, you can't miss. We also had the turkey bacon sandwich. The dressing was a homemade Sriracha ranch and really topped it off nicely. Finally we had the steak sandwich. Great flavor, but beware if your not big on onions because it is loaded. The meat was tender and flavorful and really fulfilling. Overall great sandwich shop and we will definitely be going to the new place on 19th and Greenway.  Mr. PHILLY says check them out."}
{"text":"The meal was made to perfection. Had the steak and shroom sammiche which was absolutely amazing. Wife got the Buffalo chicken that she enjoyed very much. Customer service is excellent! Nice little sandwich shop with a chef who knows what he is doing and puts time and effort in his menu."}
{"text":"Quaint little bistro inside the Monogram salon mall. Don't be fooled by the exterior - just walk into the salon shops and you will see it right there! The hubby and I had the Caprese sandwich and Turkey sandwich - both were delicious! Homemade pesto was plentiful, and the basil on my Caprese sandwich was hand picked fresh from a plant outside! How neat was that. Owner Jake is a very good conversationalist, and he recommended a stylist for me to check out as well! Rumor has it a stand alone shop will open soon on the West side, where pizzas will be added to the menu as well! Definitely going to go back and try the breakfast sandwiches soon."}
{"text":"On our quest to try new places for lunch that aren't too far from work, we turned to Yelp for some help. During the search, we stumbled upon Sammiches and decided to give it a try. It is located in the Monogram Salon Suites building, straight ahead as you walk in from the entrance.   I ordered the Tasty Turkey on a baguette. It was delicious. The bread, which is baked at the owner's bakery, was soft and fresh. The sandwich was filled with a good amount of meat, which was nice and moist. It was also served along with a pickle and a spread of pesto for dipping, which added a nice kick of flavor.   My hubby ordered the Monogram on ciabatta, and he thoroughly enjoyed his choice as well. It was pressed Panini-style and grilled to perfection. The bread was crispy but not burned, and the sandwich was served with a cranberry yogurt sauce for dipping. Even though my hubby doesn't like Swiss cheese, the owner/chef convinced him to give it a shot as it was picked specifically to go with the raspberry jam and yogurt sauce. It paid off as my hubby said it paired well.  We got both sandwiches as combos ($7.50 each), so they came with a generous sized drink and a bag of chips. Definitely money well spent. The owner/chef was very friendly and you could tell he enjoyed his job. This is someplace we'll definitely return."}
{"text":"Seriously love this place. The food is outstanding and the chefs are very personable. Hope to see more business for them because it is always a good experience. Can't wait to try all they have to offer."}
{"text":"Awesome bistro.  Owner is very careing and hospitable.   Takes pride in his work.  I would for sure recommend to stop past here and grab a sammich or four!!!"}
{"text":"Love this hidden gem! Split the Caesar sandwich and the chicken bacon ranch sandwich with my friend and they were both to die for! Everything is made to order and you can tell all the ingredients are fresh. Very friendly staff as well.  Definitely going back!"}
{"text":"Amazing! Chef creates fantastic dishes that are unique. They take a lot of pride in what they create and it comes out in the food. Great atmosphere good people and has become our go to spot for Breakfast on weekends and lunch during the week. If you consider yourself a foodie and are looking for something new and fantastic just walk in and ask for the special (daily)."}
{"text":"I got the caprese sandwhich. It was delicious! The bread is a-mazing. We just moved our family to the area into a bigger place because we have a baby on the way. This place is right down the street for us and I'm really excited to come back and try everything! Next time I think I'll get the Italian, I saw two men who ordered it and it sounds delicious. The owners (I assume) inside look like a family, I like that. They were very polite and nice, acknowledging me when I walked in and left. You can tell when people are genuine and kind and these people definitely are. I also like that the menu is simple. Not too much that it's overwhelming. It's got your good basics. Which is good for a hungry indecisive pregnant person like me :)"}
{"text":"I found this gem of a place on accident and I am so glad I did. Yesterday, when I bit into the Chicken Cesar sandwich, the rest of me became jealous that it didn't have taste buds like my tongue. It was so good I got it again today. I'm a big fan of this place, and know I will be a frequent customer. You should be one too!"}
{"text":"I never write reviews but I just had to! AMAZING! I have been searching and searching for a great delivery place, I have no car so it's very difficult to get food whenever I'm hungry, plus too hot to walk. I called in my order. The guy repeated back my order, which was awesome!  I can't stand ordering delivery and not having them repeat back to make sure they heard right and then my food being wrong when it gets to me. I got the chipotle ranch burger. YUM! Tasted about as delicious as In N Out if not more! It wasn't dry or lukewarm. And pretty cheap with all the yummy stuff that comes on it! I got a side of onion rings, fries, and bacon ranch fries! All crispy and just the right temperature! Usually fried delivery food is soggy and cold! The onion rings came with a sauce on the side, awesome! The bacon ranch fries were so great and tossed very well. Usually when you get fries with toppings it's literally only touching the top fries and then the bottom end up being regular old fries. Everything was so delicious, the delivery was fast and easy, and I got everything for $16!! Very cheap for delivery!   The ONLY negative is that they close at 8, I wish they could close at 10! But I'm not gonna knock them off a star for that, I'm just being greedy lol!!"}
{"text":"Great food. I got the Cuban, girlfriend got the steak onion and shoot, and friend got the Buffalo chicken. It was all fantastic and the Chef was very accommodating and funny!"}
{"text":"Decided to try this place since I was on this side of town. I paid 11$ for a Cuban sammich, crinkle fries, drink + tip! It was EXCELLENT. Place was clean, and the chef & waitress were super nice. He made the wrong sandwich on accident and gave it to us for free!!! :D Definitely will be coming back!"}
{"text":"What a find! My husband and I stopped by yesterday. The place is cute, clean, and friendly! Hubby had the Cuban, I had the Caesar. Both were fabulous!!!! There are a lot of items on the menu I will certainly be tasting! We will be back, Chefs!"}
{"text":"This was showing on Yelp with as 5 stars and 125 reviews, so I was excited to check it out. First, let me say, NO WAY. Maybe something happened, like they lost their chef! The service was good, but there was only us and one other group in there at the peak of the lunch rush. They were out of several menu items?? we started with the loaded fries with cheese and bacon (the fries were good, but not homemade and there was such a small about of cheese and bacon (crappy this cheap bacon) on them! And they came with standard bottles Ranch dressing?? I had buffalo chicken sandwich. Again, OK, but pretty bland and the baguette was small and not very good. Let's just say there was one disappointment after another. Not a place I'll be returning to, there are too many other better places around!"}
{"text":"Was blown away by the steak and shroom sandwich. Chino bandino is one of my favorite places to eat, but after eating here I will have a to go decision when I reach this parking lot. service was great everyone was very friendly. I have about four sandwiches in mind for my next visit"}
{"text":"Still great! It's been moved into our weekly lunch rotation.  Nice people & great food. Highly recommend trying it out!"}
{"text":"Pretty decent place.. Nice sandwiches..  I had the Buffalo chicken sammich and it was pretty awesome.. The best part was the chopped celery in the sammich..  Definitely recommend to all the sandwich lovers.."}
{"text":"The food and service were good. Only takeaway is that I wish they had a little bigger of a selection on the menu."}
{"text":"Super good food and customer service! Very well priced and they don't skimp on the meal. Me and my boyfriend ordered a steak and shroom sammich with added onions and steak quesadilla. They were both delicious. Meat mushrooms and onions were packed on to my sammich! Their fries are delicious as well! The only thing I wouldn't order again was their chipotle coleslaw which was kind of bland. Other than than, we won't hesitate to eat there again."}
{"text":"Had their version of Cuban.  While I wouldn't really call it Cuban, it was one mean sandwich.  Possibly the tastiest thing I've eaten in a few months."}
{"text":"Best sandwich I have ever had from any sandwich shop. I have the tasty turkey first then the monogram and they we're both amazing. The sandwiches never let me down and my mom loves the salads. I recommend this place to anyone who wants a quick sandwich that has an awesome taste!"}
{"text":"You need to try this place amazing burgers fries and sandwiches  the chef owner is great!"}
{"text":"Yummy, nice people, we will return!!! Delicious!!! My hubby had Buffalo Chicken Sammich. I had the Black and Bleu Salad. We shared the Bacon Cheddar Ranch Fries. All was yummy."}
{"text":"Really good sandwiches. The bread was fresh,  and they were made witty care. They should really shred their own cheese, it would be better. I was kinda confused why the restaurant was \"steam punk\" themes (as in they had some top hats with goggles around the wall) and exposed pipes...but the sandwiches were not steam punk themed. Clean place, friendly staff. A little pricey, could use a little more meat on the sandwiches for what they charge, but still good"}
{"text":"Dad and I stumbled upon it while looking for something to eat and we're very glad we did! The sandwiches were absolutely delicious! I was a little suspicious since it was a small place in a health and beauty mall but the place proved me wrong.  The girl did take a bit so it isn't a great place if you're in a rush. But I didn't mind the girl took her time because the food came out delicious and I would definitely come back if I had the chance to!"}
{"text":"Incredible place! I typically hate pesto.. Chef had me try it before he made the Caesar sammich and omgahh so good. The bread was fresh and delish too. Definitely recommend."}
{"text":"You should probably do yourself a favor and go here.  Let me tell you about my first time experience with Sammiches Bistro.  I was hungry.  But not that, I want a happy meal hungry.  I wanted real food.  I was looking for places near my area and this place caught my eye.  All the people reviewing this place had great things to say... can't be that great but the Cuban sannie, looks really good!  OK, I'll bite!   I show up, it is like 6:50 and I see no one inside the place and one of the waitresses sweeping up.  I think, this place is closed - Yep!  Closed!  I assume this was the owner, said they were closing early and was super apologetic.  I can understand this, especially since I have worked line before.    I told him I saw the Cuban on Yelp and it looked really good.  He offered to make the sammich, if I take the order to go.  Perfect, this is what I was planning on anyway.  I sit down, the waitress takes my order and we have some pleasant conversation.  The owner offers me a soda on the house for the \"To Go\" request.  Awesome!  I am waiting on my Cuban sannie, when I noticed he is making another Cuban and I think... \"Did this dude not like the way the first one came out and is making another, better one, for me?\"  Just as I think this, he says, \"I wasn't happy with the way the first one looked, so I made you another one - on the house\"  0_0  You sir, are a champion among champions!    Great place, go visit them - you won't be disappointed.  I will be returning!"}
{"text":"Amazing!!! One of the best sandwiches I've had at a restaurant! Definitely will be back soon. Great staff as well!"}
{"text":"My daughter had the rib eye steak and shroom sandwich wth garlic aioli sauce and she gives it a 10 star rating! Told her there was a 5 star max, but she said it was far better than 5-give it a 10! I was allowed a LITTLE bite and then the protective arm wrapped around her dish...thank you Chef Jacob and Miss Mariah, who pleasantly greeted us, took our order, and prepared our food!"}
{"text":"Had the Steak Onion Sammich!! It's now in my top 5 Sammiches in the Southwest. Very friendly relaxed place I'll be back for sure next time I'm in town. And also my lil dude says the grilled cheese was the best ever!!"}
{"text":"Just tried this place out because I saw the reviews on it and this place definitely lives up to the hype. I got the spicy Italian and it was absolutely incredible. This place is a gem.. Regardless of the strip mall it's located in. Top notch food and great customer service. Would recommend."}
{"text":"See David's review below.  Our experience was exactly the same.  Food was fresh, well prepared and the pesto was to die for.  Atmosphere is unusual in that they are currently located in a group of salon facilities but don't let that stop you the food is first class.  It is amazing what they put out of the small work space they have.  The fun part is you are sitting right next to them as they prepare the food and we got a little story on the owner's history.  They are passionate about their food.  We will be back."}
{"text":"I'd like to write some long elaborate review but I can't find the right way to explain this place.   Just got a burger and fries.... It was really really good... Plain and simple.   They have this odd steam punk decor thing going on that I can't seem to find the bistro correlation.  Only other thing I noticed is the place needs a deep cleaning.... Basic stuff like wiping dust off your decorative light fixtures."}
{"text":"Awesome food, friendly service, passionate owner!    Try the tri-tip mushroom, onion and provolone sammich.  It's delicious!"}
{"text":"I read all the great reviews on this place and decided to try it. I got the meatball and my husband got the turkey. The sandwiches are pretty good and simple. They definitely take their time to make sure each is carefully crafted. It was very busy during lunch and only two people working there so make sure you either go early or make time to wait. Overall the sandwiches are good and tasty but nothing out of the ordinary. Service is friendly but not the fastest. I would not suggest dining in when there are so many people ordering because it gets a little congested in such a small space. Definitely worth a try if you want a sandwich and a great option for delivery!"}
{"text":"Great customer service. It's a little hard to find so follow the tips for location. Everything is freshly made so either call ahead or prepare to wait. It's worth it! I am not so crazy on cheese so next time I will order less cheese on my Grill Chicken Sandwich."}
{"text":"Killer killer food!! I never write reviews but this place is definitely worthy. The owner and staff were extremely friendly and inviting  and take much pride in their work! Will definitely come by again to try out more and stoked to try out your next venue! Thank you"}
{"text":"The trip-tip was both very messy and totally awesome.  The Chipotle coleslaw adds a nice lil kick to a great sammich."}
{"text":"Wasn't even sure where this place was located! Went in to a \"studio suite\" place. Asked what were their top sellers. My sister had the knuckle sandwich (meatballs) I had the chicken Cesar sandwich. Halfway through we decided to trade halves. Both were equally DELICIOUS! Who would have thought? I live in San Diego, so won't be able to come back very often, but I'm sure my sister will be back! And the HOMEMADE pesto was to die for!"}
{"text":"In town from North Carolina heading up to Flagstaff and found this hidden gem. Jacob was awesome and the food ruled. Great service..and infused water!"}
{"text":"How did I miss writing a review for this place?  This place is legit!  The chef is so passionate about cooking - it makes the whole experience worth while.  Some of our favorites are the BBQ Ranch and Turkey Pesto...but Chef let me sample the chicken salad the other day and that was awesome too.  I think you just can't go wrong.  AND, he buys his produce fresh each each day, and uses the herbs that he grows right there in this cute little bistro.    Stop by - you won't be disappointed!"}
{"text":"Amazing!!! I stopped in today after a long day of work and the staff was nothing but nice.  Fully explained the menu and helped me choose.  I landed on the buffalo chicken sammich and fries (crinkle cut ). It was GREAT, great flavor with a kick. I will definitely be back very soon to try the rest of their selection of food"}
{"text":"Want another example of how Yelp can change your life?  I give you my lunch today.  I hadn't really planned on going out for lunch on my Thursday workday, but my co-worker persisted.  So I set about looking for a quick lunch spot in the west valley on my Yelp app and low and behold this place popped up with more than 50 almost entirely five star reviews.  The menu looked fairly simple but tasty.  So alright then, off we went to investigate.  It's no wonder I've never heard of this place until today.  The business is actually located in the lobby of a highly unusual office/retail building on 51st Ave just south of the 101.  If you're coming here, look for the office building labelled \"Monogram Salon Suites\".  Inside the building there's hair salons, massage therapists, a clothing boutique, and then right smack in the middle lobby area is this tiny kitchen/sandwich nook.  There were two chefs on duty (I believe their names are Jacob and Troy) working with tons of equipment in a space no bigger than your average office breakroom.  The chefs said their sandwich menu is still evolving, but they gave us a menu of what was being served that day (as well as displaying it on chalkboards above the cooking area).  I decided to go with the Caesar Chicken sandwich this go around.  I was going to choose sourdough as my bread, but the chef insisted I go with ciabatta as he felt it was a better accompaniment.  I also got a side of their tomato cucumber salad and a water.  Total price for everything including tax and tip was $8.    Just an FYI, everything they make is from scratch so this isn't a fast food place per se.  Ours took about 10 minutes to make.  That said, you can order online for pickup in advance using Yelp, Eat 24, or Grubhub.  There's seating for maybe 10 people in and around the kitchen and that's it, but we managed to get a two person table for lunch.  I didn't know this but they press the Caesar into panini form, which was actually a pleasant surprise as the bread was warm and crunchy, but mostly retained a nice chewy interior.  The Caesar Chicken bore surprisingly little resemblance to a Caesar salad as it contained grilled chicken, pesto, tomato, lettuce, and mozzarella.  Despite the lack of resemblance, it was indeed a very delicious sandwich.  Warm, plenty of chicken, liberal amount of mozzarella and just the right amount of sauce.  The tomato cucumber salad was also a deliciously refreshing accompaniment and had just a hint of basil, salt, and I believe a little oregano as well.  Really excellent quality lunch for the price.  My co-worker got the turkey sandwich with turkey, bacon, provolone, spinach and onion on a baguette.  She too was extremely impressed.  A delicious lunch all around.  I'd only dock this place one star due to the fact that this place would not be ideal for groups or for a quick grab and go stop.  Plus the setup of the ordering process can be a little confusing as there's no register and there was only one menu available to look at this time around.  In many ways it was like ordering food from a bar.  All that being said, they have a really good online ordering system from which you can order your food for delivery or for pickup.  In talking with the chefs it sounds like they already have a pretty loyal band of folks that submit big catering orders (based on the Yelp reviews, I'd be hard pressed to disagree).    So there you have it.  Another great find that I wouldn't in a million years have even thought to look for without Yelp.  And thus my lunch went from boring and subdued to exciting and fulfilling, all with a few taps of the trusty Yelp app.  West Valley Yelpers, go get yourself some sammiches."}
{"text":"Looking for a fast bite to eat that will make you diabetic? Then go somewhere else, if you want a 10/10 sammich that makes you want to stay there forever and just keep eating this is the place to be. Chef Jácob and Chef Tyrone are some of the most memorable cooks you will ever meet. They always start out with a friendly smile, and make supreme lunches. I have been visiting here for almost a year with no complaints, except that they are temporarily closed on Mondays which makes it difficult to get my fix.   Vegetarian?? Sure they have something for you.  Spontaneous and adventurous? Get the steak sammich. Sure it's a dollar more, but let's be clear this ain't no McRib, this shit will make you beg yourself to make room for another wholesome sammich."}
{"text":"Saw the reviews on yelp and figured I'd give it a try, I ordered the special that my server Kaylee recommended, it was great & she informed me it'll be on the menu next month so I'll for sure be back!"}
{"text":"Delicious!! What a hidden gem! It is inside the Monogram Salon Suites so don't look for the storefront on the street! We were headed to Peoria Sports Arena for a Spring Training game and decided to get sandwiches to take to the game. Thanks to Yelp and all the previous reviewers for leading us here! My husband had the chicken caesar sammy and I had the buffalo chicken sammy. Yum on both accounts! Freshest bread ever and loaded with meat. This is a must stop!"}
{"text":"I had the Chicken Caesar Ciabatta Sandwich and My husband had the knuckle (meatball) sandwich, both were very tasty! With the combo, i got a cucumber/tomato salad and he got potato cheese soup - both delicious! Fresh baked bread, all homeade food! Owners are so friendly! Small area to sit but worth the customer service and food! Menu changes as well.  **one tip, theres no storefront sign, but its located directly inside the monogram salon suites, dont drive off. We'll definitely be back!"}
{"text":"Wow this place was surprisingly good and lived up to the reviews!  My wife had the caprese sandwich and it was light and perfect. I on the other hand had the chicken bacon ranch fry plate...for some reason I didn't realize it was on top of French fries...but none the less, amazing!! I would definitely come back. And the owner/chef was attentive as well...amazing!"}
{"text":"I will just simply back up what everyone else has said here.  This is without doubt the best sandwich shop I've ever been too.  My wife and I have been twice now.  1st time:  I had a meatball sandwich, and the wife had a chicken/pecan/cranberry sandwich.  Mine was 3 good sized meatballs on a layer of pepperoni, then covered in cheese.  Gramma's marinara on the side.  It was SUPERB.  My wife's sandwich came with a side of English strawberries and cream for dunking.  The bread is amazing.  It's the perfect crunch to chew ratio.  You hear it crackle as you eat it.  So good!!  2nd time:  I had a steak sandwich, and the wife had Thai chicken.  Once again, the food was amazing.  My steak sandwich had a Sriracha buttermilk sauce, cheese, and red onion.  The Thai chicken had peanuts, Hoisin sauce, peppers, and sesame seeds.  The owner and his sous chef are amazing.  They chat with you while they're cooking and they have plans to open an actual bistro in the future.  If their 'dinner' is even half as good as their sandwiches, they'll be a hit.  Seriously, try it.  You won't be disappointed!  We will definitely be back...soon!!!  Also:  It's under $20 for 2 sandwiches, 2 bags of chips, 2 BIG drinks, and 2 pickles....Even with a generous tip, cheaper than most lunch spots, and 10x better."}
{"text":"Okay, not really sure how to describe this but WOW.  I asked my daughter-in-law on a \"good idea\" on what to get my wife for our anniversary, and she said Chef Jacob and Chef Troy. Puzzled, \"I asked her what do you mean?\" and the conversation continued.   Nevertheless and reluctantly, I contacted Chef Jacob and thru a series of text and email messages, I was convinced. Mind you this, or any anniversary, is important as many married men will attest. I am not rich or well to do so keep this in mind.  Both Chef Jacob, Chef Troy and the owner came to my home and looked over the kitchen area, and reviewed our options. They were seriously coming to our home and cook in my kitchen just like on all those reality food shows. This was exciting for my wife because she actually watches those shows.  Last Tuesday they arrived and I became an instant Husband of the Millenia. My wife had never had this done for her for any occasion much less any of her family or friends.   Outstanding and superb job by Chef Jacob and Chef Troy. Here is what we had:  Appetizer Deconstructed California rolls with avacado and crab over mixed greens with sushi rice balls  Main course Saikoro steak with crispy garlic, Korean pepper strings and grilled, salt crusted asparagus.  Desert  Pan fried pound cake with lemon curd and raspberrie compo topped with house made whipped cream.  If you are worried about the cost, don't. Extremely reasonable and better then going out to any of the 5 star restaurants.  They even clean the kitchen area where they work.   Outstanding food, and Superb customer service and showmanship."}
{"text":"Omgs! This place is amazing!!!!!! This is ridiculous. It looks like a small sandwich shop. But let me tell you the truth: hidden executive chef that is making sandwiches as his love. They bake all their own bread and pick the basil fresh from a plant in the back in front of you. Buffalo sauce: home made. Don't get fooled by looks or size, this place is 10 stars. PS, it is hidden inside the monogram suites."}
{"text":"My girlfriend and I went to Sammiches for the first time yesterday. The owner Jacob and his wife Cathy were both working so we got the full experience. The sandwiches were phenomenal and Jacob and his wife are basically the coolest couple around. The sandwiches are made with such care as Jacob is so passionate about what he does. If you've seen the movie Chef the owner, Jacob, will remind you of Carl (Jon Favreau). Definitely a sandwich shop worth visiting."}
{"text":"Quickly turning into a regular here for lunch! I love the food, love the deals! The location is close to where I work and the company is nice enough. No complaints!"}
{"text":"A new hidden gem.  I think this page may get overlooked alot because it's in the same stop mall as the hugely popular Chino Bandido.  But if you want a great sandwich for lunch, this is a cool place to check out.  It has a old lunch counter feel to it, and they were playing old 1950's base ball games over the radio. It really makes you feel like you have stepped back in time.   I ordered the Cuban sandwich and since the kitchen is open I could watch them. They made everything fresh. The pork loin wasn't precooked, he did it all right in front of me. That means it takes a little longer than some other sandwich shops, but its worth it. Even though I'm not usually a fan of sweet pickles, I didn't even notice because the pork loin and prosciutto were bomb.  The owner was super nice and visited with me while I waited as well.   Awesome little place. I will be back."}
{"text":"I had the chicken bacon ranch. Very good and the bread was toasted/soft and very tasty. They make their own homemade sweet pickles. Very friendly staff. The only disappointing thing was, the menu didn't say there was onion on the sandwich; I'm not a fan of onions. I would have order it without. And Yelp states they have sandwiches and salads. They don't have salads. I'll be back to try the Turkey bacon basil sandwich."}
{"text":"Supporting locally owned businesses.  Sammiches Bistto is an unassuming place in a nondescript strip mall that looked oddly appealing for a quick bite to eat. Sammiches has a pizzeria type layout which was comfortable, inviting, and the best part is Sammiches Bistro is not a chain restaurant and is a locally owned business.  Immediately upon walking in we were greeted by the owner and his staff. We were promptly seated , given menus, and ordered our beverages. Sammiches offers a unique  and varied menu.  You won't find the same ordinary sandwich combinations that you will see at chain sandwich shops.  Chef Jacob has created uniquely delicious sandwich combinations that you won't find anywhere else.  On this visit we ordered the Steak, Onion, and shroom sammich and the Barbecue Chicken Sammich. Within 10 minutes our entrees were delivered to the table, and these sandwiches were really good. My steak sandwich was full of tender seasoned grilled ribeye, onions, cheese, dressing, crispy fried onions, on a toasted roll.  It's easy to see that the owner is passionate about his business; He made a point of going to each table to ensure his customers were enjoying their meals. If you're ever in the area you stop by and give it a try you won't be disappointed."}
{"text":"They tested out a new breakfast menu today!   I ordered the French Toast Sammich, which is a bit out of my comfort zone because I tend not to mix my food up.   The thick slices of bread were cooked perfectly, nice and french-toasty on the outside yet soft and somewhat dense inside. Add a sausage patty, crispy bacon strips, a fried egg and cheese and it was a fantastic balance of savory and sweet, crispy and soft.  My guy ordered the Hatch Green Chile Tri-tip breakfast, also very good. Served on a bed of hashbrowns with tortillas on the side too.   As for my sons, they both got the breakfast biscuit sliders with gravy. While they were tasty, the homemade gravy really hit the spot!"}
{"text":"One word: Wow.  I found my new sandwich shop this place is amazing finally good food."}
{"text":"This place was not what I expected.  Very pleasantly surprised!  I was expecting another sub sandwich shop.  I was not disappointed after looking at the menu.  I couldn't decide on which sandwich to try so I just started at the top of the list with Carne asada.  Meat was tender and well seasoned,  toppings were excellent but not over powering.  The bollio bread was perfectly done!    Food safety inspection happened while u was here and no citations were issued!  So that always makes you feel good.    Looking forward to the Cuban sandwich, tomorrow probably!"}
{"text":"Yum!  Took our family of four. Between us, we tried a burger, a fry plate and 2 sammiches. All were delicious. We will absolutely be back"}
{"text":"Awesome food! Awesome service!! I found out about this place on yelp, as i would of never known where it was. I have gone there 4 times now, and would eat there everyday if i was able to. Highly recommend!! The chicken caesar with pesto sauce is to die for!!!"}
{"text":"Great place to stop for food!! My burger was perfectly cooked and the service was very good! Will definitely come back!"}
{"text":"Let's just say that I won't be back for one specific reason, the service.   I was looking for a good sandwich, so I stopped by this place due to their awesome reviews.  There were three other people in this place and it was around 1pm.  Being that it was my first time there and their toppings weren't listed on the menu for the sandwich I was ordering, I asked what comes on their sandwiches. The cashier was helpful and advised me of what was on them. The \"chef\" on the other hand (I'm assuming the owner), said, \"all of our toppings for the sandwiches are listed on the menu.\" I stated that they weren't and even had to show him because he continued to say they were. As I'm waiting for my food, the \"chef\" tells the guy making my sandwich that he needs to get it together.  Embarrassing your employees in front of customers isn't the thing to do.  I asked this \"chef\" something about the toppings and his response was, \"we're arrogant chefs here. You get it how it comes.\"  Ummmm I could be like my friend and allergic to raw tomatoes, so getting it \"how it comes\" isn't gonna work for me. The cashier even agreed with him, saying yes and nodding her head.  I always give a restaurant two chances (if I don't care for my food the first time), but they lost that 2nd chance.  This is no way to keep customers. The sandwich itself wasn't bad, just wish that it had more than 3 slices of meat for what I paid."}
{"text":"We discovered this place today. First, I have to say the food is amazing! The chefs are fantastic we enjoyed talking with them while we ate the food. These sandwiches are absolutely fantastic I enjoyed every bite. I normally do not eat bread but the baguettes are so soft. Even the French  fries tasted so good. We will definitely go back. I'm so glad we finally have a wonderful restaurant close to home. Gourmet sandwiches are a definite must! I can't wait to get a catering menu. Thanks Jacob and Troy for a wonderful experience!"}
{"text":"Decent burger and fries, atmosphere was nice.   I am a burger snob and this was a pre-made, yet fresh beef, hand patty, marinated burger with a bunch of unique seasons and flavors. While it was good it is not something I will crave. Prices are a bit high but the basket of fries fed two of us."}
{"text":"Just checked this place out tonight. The food was amazing! Def get the fry plate. People were really nice and took time to make sure we were happy."}
{"text":"Saw this joint on my way back to the office. I was on the fence about what sammiche to get, either Cuban or the Buffalo chicken. Plus they have burgers and salads!  The gentleman that sat me made his recommendation for the Cuban and that's all she wrote folks! Friggin delicious!   Cuban bread, slow roaster pork, ham, Spanish chorizo with cheese, in house made pickles and mustard. Damn it was good!   I will be back. Give these folks a shot! I saw some food that other customers ordered and now I have to come back. Damn it all looks delicious!"}
{"text":"Found this place on Yelp. We ordered the Tri tip fry plate. It was good but meat was tough. We enjoyed the flavors. The service was very good. One of the chefs even came out and checked in on us. Parking very easy as it's in a strip mall. Not sure if we would come again when in Arizona, but maybe we just didn't find what we really liked."}
{"text":"Alright, so there is good and bad with this review. I am giving 4 stars with hopes of going back and being able to change it to a 5 and because I don't want to ding the mom and pop shop of their 5 stars.   First things first...I tried it because of the 5 stars and that's it. It's in a strip joint with Chino Bandito and not exactly a high end area. It is new to the area also so that was intriguing.  Secondly when you walk in its clean and cute with the 50's style counter and black and white floors.   The food.   I would give it a 2 here I was disappointed in my meal. The saving grace was that I went with a friend who ordered something else and said his was better than mine (he tried both but isn't a share-er).  I love fries. They are seriously one of my top 5 favorite foods so when  u tell me your fries are HOMEMADE I'm so in. I ordered the steak and shrooms fry plate (no bread just the innards on fries). And my friend got a Cuban with fries.   His sandwich according to him (he's a cook) was good but needed more sauce.  My steak and shrooms were seasoned well but there wasn't enough cheese for it to be done on top of fries. Period. There was also NO sauce. NONE. AS IN ZERO. so it was boring to say the least. We decided it needed a horseradish aoli to take it up a notch.   If u are going to put on the menu and talk to ur customers about the HOMEMADE fries they better be homemade. They were definitely frozen crinkle fries....my least favorite ever. I wasn't happy when I opened my to go box up and saw that. Also, no to go condiments or silverware were bagged up.   Drinks. Only soft drinks and lipton berry iced tea from the tap. I'd like a real iced tea.   Anyway I'll try again and we shall see if I can give a 5."}
{"text":"We found this little gem from the excellent yelp reviews, and after reading the menu online, decided we had to try it. It did not disappoint! The food was excellent and the service was even better. Can't wait to go back. I wanted to try about 5 different items, and settled on the tri tip fry plate with added green chilies. My friend has the Swiss and shroom burger."}
{"text":"This place is awesome! Hard to find but delicious! The guys who work here are super friendly. My food was fresh and made to order! My new secret place. I had the Caesar chicken pesto! Hot and delicious :) please come to Anthem. We need you"}
{"text":"In the mood to go to a place we haven't tried in the neighborhood and we like to support local businesses. SO glad we stopped in and we will be back. Super clean, super friendly, great service and great food. Sandwiches are awesome with super fresh ingredients and the French fries are perfection!"}
{"text":"the sandwich was good. I had the Carne asada, which was good, but not so great that it makes me think i absolutely mist come back. The owner (at least I think it was the owner) gave me a bag of chips on his dime I think just to sweeten the deal, and he was friendly, as we're all the staff. I am not sure if \"hole in the wall\" is what they are going for in terms of environment, but that's what the place looks like. It wasn't easy to find, and their sign isn't clear from the street. Located in a dumpy - looking strip mall in what appeared to be a really seedy area. Their procedure is also weird. I came in, and the counter says to order here. But then the waitress told me to have a seat and that she would bring me a menu. she asked me for my order and my drink, and then instead of bringing me the drink, she brought me a styrofoam cup and expected me to go fill it up at the soda fountain. I could have done that if I ordered the sandwich at the counter. It's not a huge inconvenience, it just doesn't make any sense. there was a sign posted on the front door that said there were no public restrooms, which also seems to suggest that it was not in a good area. I had to use the men's room incidentally, and it needed a lot of help in terms of decoration and it stunk like there was a blockage in the sewer system or the grease trap. in terms of overall restaurant experience, I would say the sandwiches are probably good enough for this place to be at least semi known for its food but the overall establishment really needs a lot of work to be worthy of all the five star ratings it has been getting."}
{"text":"Have had a few really awesome lunches here so far! The paninis are great - my favorite has pesto, ham, bacon and melted cheese. I would recommend this to anyone, especially with the location being so accessible from so many different directions. You're in for a good treat with Sammiches."}
{"text":"This is the best place ever!!!!!!! They really know what they are doing over there. I probably go in there once a week and I get their onion and cheddar burger it's so awesome! They really know how to make the food flavorful with every bite that you take! Chef Jake and chef Troy really know what they are doing and they're so awesome to talk to! They'll talk to you like they've known you for 5 years even though you just met. I would recommend this place to anyone who asked about! If you haven't tried it out you really need to!"}
{"text":"My staff and I have always loved everything we have ever ordered! The food is always delicious. The daily specials are always a fun mix up!!! Thank you for all the love you put into every creation! We love Sammiches!"}
{"text":"Had the Tasty Turkey today.  I can see why it's such a popular choice here!the bun was so fresh and soft anx good!  The pickles sure tast homemade to me!  And the cronkle fries are not frozen! They're FRESH!"}
{"text":"There are a few times in life when a meal is so expertly crafted and planned that's is nothing short of genius, today   Sammiches made one of thoes meals. I got the Tasty turkey with there house made pesto. It was phenomenonal. To top it off  Chef Jacob and Chef Troy were so very kind, it made the experience that much better. The food was fresh, the staff was amazing I give it 5 stars and highly recommend it."}
{"text":"I am a gourmet chef, and I am tough on restaurants.  I do however have a weakness for little 'hole-in-the-wall' joints where the cooks are passionate about the food they put out and the staff is friendly. This is a place worth my repeat business.  Sammiches just opened in this little strip mall a few blocks from my house. My wife had the Steak and Onion sandwich.  I had the Cuban.  They were both excellent and the prices are VERY reasonable.   We also shared an order of fries. Many times, a restaurant will put out a great main product but them skimp on the sides.  Well, I don't know if they make their own fries or not but they were great fries.  I don't know if it's a good thing or a bad thing that they are so close to home because I will be eating there a lot."}
{"text":"Great overall experience despite the challenging location. Super friendly owner and staff. Ingredients were fresh from their little patio garden. Nice touch guys!"}
{"text":"This place is outstanding! We went for lunch the first time a couple days ago and they had everything you'd want in a great restaurant- clean place, friendly staff, delicious food, and the chef came out to check on us personally and make sure we liked everything. I had the tri tip torta and my husband had the chicken bacon ranch sandwich- both were delicious. I plan on making this a regular lunch spot!"}
{"text":"This little bistro is one of the coolest spots. I was nervous because I am very picky and didn't want to come across as rude; but the 2 guys were very patient with me and even gave me some samples to try before ordering. Not a ton of seating space but the outdoor patio is very clean and peaceful. I'm not from this area but I will be back! :)"}
{"text":"We ordered take out on Yelp. It was super easy and they even called us to let us know they had ran out of a few things. We ordered really close to the time they were closing so we weren't too mad that they were out of soup of the day or the ciabatta bread.  Hubby picked up the orders and it didn't take too long until he was back. He said the guys were super friendly. I ordered the Ham Samwich and hubby picked the Italian something. I didn't try his but mine was very good. The bread was toasted, which is already a plus. Hate it when sandwich places don't toast their bread. Just kills it for me. The ham and cheese combo with the pear slices really harmonized as well.  Since they were out of a few things, they gave us a few bags of chips for free. A very nice gesture. The pesto sauce and the sour cream jam sauce were  both really good.  Some 'food for thought': maybe they can try to make their own house chips instead of the bagged ones. Also, hubby said he wished to have more condiments, like lettuce and tomato, on his sandwich other than just cheese and meat.  Overall, we loved this small local samwich shop. We will be ordering from them again."}
{"text":"Like to try new places all the time. This place is Amazing. Going to be one of my new spots. Thx for the great good n will recommend"}
{"text":"Super delicious. Really impressive food for the little set up they have. Wish there was more dining space but you work with what you got! Chefs are really nice and they make some mean sandwiches. Soup was great as well."}
{"text":"i actually meant more pescatarian options :) What about fish sandwiches?"}
{"text":"Finally made it to Sammiches and was very pleased.  This dude has some killer food going on here.  Had the steak sammich and it was badass. I'll be coming back. They are moving to 19th Avenue and Greenway starting March 21st so it'll be a little farther but I'll probably still make the trek."}
{"text":"Great place to stop and get a lunch!  The owner/chef Jacob really prides himself in making your Sammich the right way and includes a complimenting side sauce (for some sandwiches) that goes perfectly with your meal."}
{"text":"Delicious food ..pretty hard to find ...Look for Monogram Spa Suites ..excellent service ..very small quite place ..support local businesses !"}
{"text":"I've had the opportunity to eat at Sammiches on several occasions since they moved over to 19th Avenue and Greenway. Unfortunately, I missed them during their earlier days of operating inside the salon suites - even though they were creating quite a buzz from the very beginning. Since then, they've made the move to the plaza that also contains cult-favorite, Chino Bandido.  Overall, I like what they have. Everything is very good quality and reasonably priced - although for me, it took awhile to find something that suits my personal tastes. Their Italian was decent in quality, while their Cuban, which comes highly recommended by most people, just wasn't for me. However, I really enjoy their grilled cheese, aided by the addition of a bit of oregano and dipping pesto on the side. Their barbecue chicken is also excellent!  What I really do appreciate, however, are the burgers here, which surprised both myself and my girlfriend. I enjoy their unique baguette and always insist on adding a fried egg to mine. If you're skeptical about some of the sandwich creations, I can assure you that you can't go wrong with one of their burgers.  We were a bit disappointed that they eliminated their breakfast items before we were able to try them. There was a French toast-styled sandwich, which I was really looking forward to sampling, but they opted to eliminate everything entirely. Nevertheless, there's still plenty of things that I intend on trying in the future.  The place has tremendous Yelp hype and seems to have quite a following - although every time we stop by, we seem to be the only ones there. Hopefully, business will keep growing as the positive reviews continue to spread. The owner is a really nice guy who always remembers us whenever we visit.  Stop by and try some of their stuff!"}
{"text":"Tried this place for the first time today...came in at about 4:00 and the place was empty as expected at that time of day.  This was only to our benefit!  Not only was our steak sandwich with caramelized onions and sautéed mushrooms amazing...but the owner shared with us how he came up with some of his menu items.  We had a great visit and truly enjoyed our meal.  The perfectly tangy-sweet pickles are from scratch and the crinkle cut fries are fresh and delicious!  My boyfriend and I totally recommend Sammiches and plan to return to try everything on the menu."}
{"text":"The owners are very kind and put passion into what they do. The place is decorated nice and is kept clean both inside and out. You can tell right away that much care is put into the restaurant and the food itself. They really care for their customers are build a relationship with each one whenever possible. Food is fresh and tasty, but it's not something I would ever crave - so far we tried the carne asada sandwich and the Cuban."}
{"text":"Just ordering for delivery and it was great!  I ordered the Cuban and the bacon ranch fries. It was fresh and delicious! My boyfriend ordered the grilled chicken bacon ranch fry plate and the grilled chicken was amazing, wasn't dry at all and I will probably order that next time!  All in all the food got here fast and we will definitely be ordering again"}
{"text":"My first experience was wonderful, and I found them in yelp. My steak and mushroom sandwich was incredible. Plenty of meat and cheese, and one is more than enough for one person. My picky two-year-old grilled cheese, made on sourdough bread with multiple cheeses (I ordered over and did not ask what kinds of cheese were on the sandwich) The bistro itself has a warm comfortable feeling with A clear view of the kitchen. When you walk in you get a clear view of the professional chefs cooking your made to order food. Very clean establishment and friendly staff. I will absolutely be a returning customer.  While the prices may seem slightly intense you're absolutely getting what you pay for the quality of food and Quality of it's preparation."}
{"text":"Extremely good food, friendly service, and great prices. The only negative I could possibly think of is it only next to my work and not my house(or that might be a good thing because I would never leave)"}
{"text":"Great food. Awesome service. Five stars all day. Unique taste. Food was made fast. Ranch was thick and yummy. Yummy"}
{"text":"Wonderful food and fun casual atmosphere. The food is delicious!  I hit this place up at least once a month. Never disappoints!"}
{"text":"Live  on East side out here doing a job. This food is incredibly delicious.  If you are in the area stop here and eat you will be so glad you did."}
{"text":"This place is worth checking out. It's a couple of guys who love cooking and sandwiches and they come up with some amazing creations."}
{"text":"First time to check this place out. It is billed as a sandwich shop, although it's not what I expected. I expected a big sandwich board and walk up order situation.  And many people came in and out and ordered take-out. However, we came to eat in. And the restaurant had tables where we sat and were waited on. Not normal for a sandwich shop. But it was great.  I tried the \"fry plate\", which was a plate of French fries covered with your choice of toppings. I had steak, onions and mushrooms. It was excellent.  A friend tried the tri-tip fry plate and he claimed it was also excellent.  The prices were reasonable and the staff was kind. Food took a little longer than other sandwich shops but it was fresh , hot and crispy (I was delighted to have hot crispy fries, rather than old soggy ones)!  I will go back and try the sandwiches another time to see if the place lives up to that part of its namesake.  --  UPDATE: I did return and had a sandwich- the Cuban. I loved it. I've had Cuban sandwiches before. This was perfect. As was the side (cheesy fries). This will be a main stay for me. Lots to try here."}
{"text":"Went to Sammiches on my lunch hour and ordered a Tasty Turkey. It was really good, bread perfectly toasted. The owner was adamant about trying his pesto made from scratch ( the basil plant is even in view outside) and it was delicious!  I'll definitely be back for their new sandwiches that they just placed on the menu."}
{"text":"Stopped in for a quick bite to eat after getting my car serviced at bell ford, tried the special and it was amazing! My server Kaylee was super friendly and attentive and the chef even came to the table to see how I enjoyed the food. Definitely will be making a trip back soon!"}
{"text":"Chicken rubbery  Bread was better than the whole sandwich  I don't normally post but I was expecting a much better experience. The hostess and the cook were very kind but I'm not visiting again."}
{"text":"Always great food with friendly service. We love it here. Haven't had anything that wasn't delicious."}
{"text":"Sammiches is wonderful!  The service, the food, everything is great.  I had the Tasty Turkey sandwich without bacon.  The bread was light and fluffy, not dense like sandwiches made elsewhere.  It made the bread to turkey to cheese ratio perfect.    My only complaint is that I work while they are open so I have only had the opportunity to eat here once.  Hopefully their new location will have longer hours so I can indulge more frequently!"}
{"text":"Went in for the first time today with my family. The owner was funny and welcoming. Most of all the food was FANTASTIC I was blown away!!!  I got the steak and shroom sandwich amazing! My husband got the Cuban sandwich and he LOVED it. I can't wait to go back I just loved the chef and the food! Five stars for sure."}
{"text":"I went here for lunch, Best chicken sandwich I've had in a while (chicken and bacon), the way the sandwiches are served tells they thought about details, aluminum wrapped and the bread's cut are outstanding and the house bread is delicious, menu looks small but they cover plenty of flavors, place is cosy and original, staff and chef are very friendly."}
{"text":"One of the best sandwiches I've had.  Staff was friendly but slow.  The place could be cleaner."}
{"text":"This place was great! Food was amazing and they're starting a breakfast menu too! Why aren't you going!?!?  you should totally go!"}
{"text":"Great. Went at an odd time On a Thursday and it was empty and got great service. Food was great and affordable. Would recommend"}
{"text":"Nice job guys!  Great food and very good service.  Had the Cuban and was great!  Will be back for sure."}
{"text":"Tried this place with a coworker a couple of days ago I ordered the fry plate steak and onion. It was a large amount which I loved but unfortunately my fries were bland and dry. The steak was pretty good but there was hardly any cheese or siracha sauce on them. Ill try this place again because the buffalo chicken fry plate sounds good I just hope everything is dressed more."}
{"text":"This is a great little local place.  Clean, great service and delicious food... Plan on returning more often.  Good selection of food, and it is cocked to order.  Pretty quiet at lunch, hoping this place takes off."}
{"text":"Tried out for the first time today. Great price. $6 for a meal? Also they were all good. I had a chicken ceasar sammich and my friend had a knuckle sammich. The owners are also nice and friendly. I would definitely go back soon for a quick meal."}
{"text":"This place is delicious! Came in on a whim and it was so worth it. I love finding places that use local ingredients and put pride in their food. It totally came across in the food. They have just moved to the new location on 19th avenue & Greenway so I'm sure it's only a matter of time before everyone finds out how good this place is. We will definitely be coming back!"}
{"text":"They took calls, texted, and handled money wearing the same gloves they were making my sandwich with. That was enough to freak me out. I had the caprese sandwich, it was nothing special. They're ok people, but lousy and unsanitary sandwich makers."}
{"text":"This place is great!! Mom and pop spot. Great food and very polite people!! Highly recommend this place!!!"}
{"text":"I was referred by a friend to try out Sammiches. It was the last place you'd expect to find in a salon! My boyfriend got the Caesar chicken with pesto (highly recommended) and I got the grilled cheese, which was also delicious! Jacob (owner) and his son were very welcoming and friendly! Highly recommend!"}
{"text":"WOW!!  I have found a place where the thought of a sandwich actually appeals.  Everything is full of flavor!  I couldn't stop eating the fries or the pickles.  The Roasted Garlic Cheeseburger special - OUT OF THIS WORLD juicy and flavorful. I will be returning, again and again!"}
{"text":"My first visit today.  Its so nice to support local businesses that actually care about their customers and take pride in what they are doing.  I took food to go but the outside patio looked like a great spot to eat lunch.  The Pesto sauce was on point!  Strong work on the chow.  I'll be back again."}
{"text":"I absolutely adore this place. We came in for a quick bite one afternoon, and the chef made us feel like we were at home having a meal. I got A buffalo chicken burger with ACTUAL real bleu cheese and it was amazing. The fact that the use real bleu cheese makes me know that the care about the quality of their food. My boyfriend got the Cuban and said it was amazing. We will definitely be making this place a regular spot!!"}
{"text":"The Ceasar is delicious! Stopped in when i2 was on this side of town for work. A little hard to find because there isn't a sign on the outside of the building - they're hidden within a building called Monogram Salon Suites but is definitely worth the search!! I'll be back when I'm in the area again!"}
{"text":"Super delicious !!! Went in around 12, and found out they're serving breakfast till 2!!! I could not decide what to get because everything sounded so good and the chef put together the most delicious sandwich with everything I said I liked ! Owner went on to tell me her husband made that up on the spot and it did not disappoint. Frozen or not, the fries were hot and crispy, perfectly cooked! I will definitely be back very soon ! Great staff and experience !"}
{"text":"OMG, these are great \"sammiches\"!  Even though the hubby and I eat here when we're visiting our salon in the Monogram Suites, we make it a point to stop by whenever we're in the neighborhood.  Between the two of us, we've tried at least a half-dozen different ones and truly can't make up our minds on which is the best; they're all fantastic.  Great service as well and, if they're offering their homemade 'sweets', do not pass them up!  You will never be disappointed in the food, the service or the prices!"}
{"text":"My first time at this bistro and will definitely be back! It's perfect for to-go orders and the food is terrific! Serving soup, salads, sides, and sandwiches, I went for the Tasty Turkey Sammich- provolone, turkey, crispy bacon, spinach, and onion..and I asked mine to be wrapped in lettuce (I'm watching carbs). The ingredients were fresh and flavorful and the tomato and cucumber salad I ordered was equally as tasty. BONUS: The value is solid! Next time, which will be within the week, I'm getting the Spicy Italian Sammich-pepperoni, soppresata, salami, and provolone...and yep, in lieu of the garlic hogi, I'll be asking for a lettuce wrap!"}
{"text":"Had the Chicken Ranch Sammiches and it was very nicely flavored and super yummy. I would have given them 5 stars if they had homemade fries. They had regular krinkle fries that you can buy at the grocery store. That was a disappointment."}
{"text":"I went Cuban, which I wasn't sure of as I lived in Florida for a bit. But, the twist on tradition works out pretty well. It also came pressed, which again I wasn't sure it would! The mustard is a good one, and overall the sammie satisfied my longing for a decent Cuban which is hard to find in this neck of the woods.   GF went with a steak shroom onion sammie and she liked the textures and flavor profile. She ended up bringing like 1/2 of it home as we shared a plate of bacon ranch fries which she says she would have preferred a flat steak type fry but since I usually eat like 3 fries and push them away, I liked them and ate quite a few. Ranch on fries. When did that become a thing and why haven't I ever tried it? Works well.  We brought a chipotle something or other burger back for the kid - and he inhaled that rating it 5 stars.   A big plus here, if you are dining in, is waitress service (or lunch counter). It sure beats shuffling along a sneeze guarded line calling out ingredients, or ordering from a teen that doesn't look you in the eye, punches some buttons, and then you go pick your food up a few minutes later. Nice to have table service!  The dilemma for these owners is going to be the same thing as Goodfellas Grill next door faced: Chino's. Once you're in that parking lot (which can be tricky to get into during rush hours) Chino's draws you like a magnet if you're a fan - and plenty are! Luckily though, both this place and Goodfellas are friendly, service-oriented, and serve up good food! So, next time you're in the plaza, check this place out!"}
{"text":"Great sandwiches. Had an awesome burger last time I as here. Check out the daily specials."}
{"text":"Great little place today there was 3 of us we had tri-tip with hatch chile's, over easy eggs on a bed of hash browns with three grilled corn tortillas it was really tasty we also tried French toast sammich with eggs bacon and sausage with a side of syrup for dipping and last but not least biscuits and sausage gravy  with soft scrambled eggs and homemade biscuits it is a test kitchen weekend and I hope they keep it all we will be back maybe even tomorrow"}
{"text":"One of the best Burgers I have ever had.  The fries were ok but not the best.  I ordered the garlic bacon shroom burger.  So good."}
{"text":"Went here to grab dinner yesterday for me and a coworker and I thought it was great. The gentleman was very nice and the prices were awesome.  I'll be back again."}
{"text":"Great hole in the wall restaurant with exceptional food.  Had the steak and mushroom sandwich and every bite was delicious!  Friend had cheddar onion sandwich and raved about it. I'll definitely be back with friends!"}
{"text":"So glad to have discovered this food!! Their bacon ranch fries are amazing! We have the buffalo chicken salad and the ranch steak salad. They were perfection. I took a bite while I was in my kitchen and couldn't even stop eating long enough to sit down and the table. They were very filling and the mixed lettuce was crisp and clean.  The Cuban sandwich we got was also fantastic. On top of all that they deliver! So being a mom of two young children that made things much easier for me. I ordered again two days later."}
{"text":"I really don't see why they have so many high praises and ratings. The sandwiches are all very simple, things you could easily put together at home. They are very slow at making each one, seem pretty unorganized and the atmosphere is cramped.  I got the Italian, it was simply salami, pepperoni, cheese, mayo, lettuce, garlic salt and tomato. Then they had a homemade pesto, which seemed cool, but they put a small bit (not enough for my sandwich)?on my (tacky) styrofoam plate. Why wouldn't you just put it on my sandwich? Plus no option for onions, olives, or other special toppings. In summary, they are SUPER nice, the sandwiches are somewhat cheap, but there is nothing special about the food. It's something all of us could go home and make on our own. Plus it's a real hassle to get your sandwich and eat it in the cramped space.  Sammiches, if your goal is to simply make money off of the patrons that come through the office building you're in due to convenience...I think you nailed it! If you actually want to own your own place sometime and want to be the best, you are really going to need to find something that makes you unique and go with it. Subway is fast and has lots of options, Firehouse steams their sandwiches, Jimmy Johns has better quality meats, bread and is very quick, Bocadillos is a huge portion and a crazy good gourmet offering, WhichWich lets you make whatever you want with tons of ingredients, what does Sammiches do that no one else does? I should be able to walk away knowing what makes you special. Get to work!"}
{"text":"Food and service was AMAZING! Had the special of the day Jalapeno Cheeseburger and it was so good, the toasted bread is to die for!"}
{"text":"We ordered three sandwiches. The capturer, the monogram, and tasty turkey. All look tasty and met our expectations. Whenever I'm in the west valley, I'll be sure to stop by."}
{"text":"I was at work last week and wanted a sandwich, but didn't want to go to the usual chain type places.  I did a quick search on Yelp and this placed popped up.  I recognized the address due to it being near/next to Chino Bandido, but never knew this place was here.  Turns out that it just opened recently.  I got in my car, drove down, parked outside and walked in.  I was greeted right away and shown a menu of their sandwiches.  I decided to go with their version of a Cuban sandwich.  Their version of their Cuban is a little different than most.  Their version is described as, dijon crusted pork tenderloin, spanish chorizo, Swiss cheese, Sammiches own zesty bread and butter pickles, and German mustard loaded on our signature baguette.  I got the combo meal which included fries and drink.  Total was right around $11.00.  Here is how it was...........  Cuban Sandwich-  This thing was fantastic!  One of the best sandwiches I have had in Phoenix!  The pork tenderloin was sliced nice and thick, the spanish chorizo was thinly sliced into cirlces, the Swiss cheese was nice and melty, the bread was hot, toasty, crispy yet chewy inside.  The pickles were awesome, and the German grain mustard really tied everything together.  This sandwich was fantastic!  The fries that came with it were very tasty too.  They are a crinkle cut fry and they were fried up and salted perfectly.  A great meal.  While I was waiting for my sandwich, and during my lunch, the owner Jacob started up some friendly conversation.  I was wearing my St. Louis Cardinals hat and we started talking about baseball (he is a Yankees fan) and other things.  Really personable dude!  During our conversation, I started asking about the menu and other sandwiches and inquired if he ever had a meatball sandwich on the menu.  He told me that on Fridays, he did.  I told him I would see him on Friday to try it out.  Here is how that one was............  Meatball Sandwich (The Knuckle)-  This sandwich comes with toasty bread, sliced pepperoni layered on the bread, and then meatballs cradled inside the pepperoni, topped with cheese and then served with a side of marinara to put on yourself!  This sandwich was tasty as well!  The meatballs had a great texture and I liked the addition of pepperoni to the sandwich.  The cheese could have been broiled/melted just a little bit more, but the sandwich overall was very good.  Once again, the fries were great!  The best part of this was that it's his Friday Special.  Sandwich, fries and the drink are only $7.50!  Can't beat that deal!  During my meal, I chatted it up with Jacob and Mariah (hostess/cashier) for awhile longer and he told me about some menu additions he is thinking about doing etc.  Good times!  If you are looking for a local, friendly shop that serves great sandwiches, head on down here!  Prices are great, hospitality is awesome, and the sandwiches are unique and different compared to most other sandwich shops.  I will definitely be back to try out their other sandwiches and to shoot the shit with Jacob. I'm still thinking about that Cuban!  Might have to come back next week and get another.  It was fantastic!"}
{"text":"This tiny sandwich and salad shop is tucked away in the Monogram Salon Suites.  It's hard to find but worth searching out. This was my second attempt to find Sammiches and luckily today I was successful. I had the raspberry almond chicken salad with house made raspberry vinaigrette. It was simple, fresh, sweet and savory, but not too sweet, in short absolutely perfect. The romaine lettuce was washed and cut before my eyes, no lettuce from a bag for these guys. This is no ordinary sandwich shop, so if you want insipid and predictable chain food go to Subway or Jimmy Johns or any number of others but if you'd like something prepared with thought, heart and taste come here. Pleasant conversation with the Chefs Jacob and Troy was an added pleasure."}
{"text":"Great food at an amazing price. We will be back. The steak sandwich was really great with caramelized onions and an amazing sauce. Don't bring a big party with you if you plan to \"dine in\" because the seating is very limited but the food and service make up for the lack of seating."}
{"text":"Chef Jacob knows his way around the kitchen. Very skilled and great flavor profiles.   Been here three times now and every time I ask Chef to make me the best burger of the day. Garlic mushroom burger once, green chili burger twice. The green chili has a nice smoky flavor with a good amount of heat. Patty is cooked perfectly. The fried egg on top gives it such a decadent, rich finish.  Place may look like a hole in the wall, but step inside and you'll see why this place has so many 5 star reviews."}
{"text":"I had to try something new at a new place, the infused strawberry water was refreshing and crisp, the Caesar samich was simply amazing, the pesto complimented the chicken and mozzarella very well and I loved the crunch of the bread. Also Jacob and Troy I believe, we're very nice and I'd recommend anyone come try it for yourself."}
{"text":"This place is amazing! The tri tip torta is spicy, with great flavor.  I had it delivered, and it was here in less then 30 min. I would definitely return."}
{"text":"I am not the type of person to give a bad review on a restaurant, but I feel like the 5-star reviews of this place are a complete misrepresentation of the quality and don't want others to be mislead. I don't understand how this restaurant has 5 star reviews!!!  Given that Sammiches Bistro is so close to my house and it had rave reviews on both Yelp and Google, we decided to give this place a try. Sammiches has a small dining area and bar top area which is where we were promptly seated.   We ordered two steak sandwiches that were comprised of pre-cooked ribeye steak that was cubed into large chunks and then refrigerated until served. Unfortunately, this gives the steak a thick unappealing rubbery texture. The sandwich was served on a barely toasted baguette with garlic salt, garlic aoli, and caramelized onions. I opted for no mushrooms. The french fries were fine, just a basic frozen packaged fry.   The waitstaff was just meh....not overly attentive and spent most of their time standing around. The owner was attentive and asked what we thought or how he could make the meal better, etc.   The point is, NOTHING about sammiches screams 5-stars to me and I don't want others to be mislead."}
{"text":"Had a BLT from here today and hubby had the grilled cheese with three cheeses, both were good but the pesto they included for us to try was exceptional! Loved it with both sammiches  next time want to try the cheddar potato soup."}
{"text":"Very good! We were staying at a local hotel and placed or first order for delivery on Yelp. It worked liked a charm. Food was really good, we were missing silverware and napkins which made eating a challenge. But I would definately order take out from here again!"}
{"text":"Great little sandwich burger place that has been open for over a year at this location. Very good quality food excellent mixtures of tastes and textures. The Sous Chef Troy really cares about what he does and it shows in his work. Friendly helpful staff definitely worth checking out if you're in the neighborhood or even if you're not."}
{"text":"You would be hard pressed to find a better sandwich. With the quality of the food as well as the great character of the  chefs Troy and Jacob, make this establishment one we will continue to visit as well as recomended for great eats and conversations.   Great job guys! Keep it up..."}
{"text":"Sammiches was recommended to me by a friend, so I stopped in for a pre-Camelback hike carb fest. I swear, I usually pick from the menu pretty quickly at restaurants, but here I wanted to eat all of the things, it was difficult to choose.   The tri-tip torta I eventually received was spot on - with a spicy sauce, cheese and tomatoes. On the side, bacon ranch crosscut fries - very good flavor and crispy-ness. Also, a Coke. Great job, Sammiches - I'll be back soon."}
{"text":"Well, I'm giving them 3 stars... Don't be mad! I wasn't really overwhelmed by the awesomeness of this place, like other people are on Yelp. This was our first visit and it will probably be our last. I try a LOT of new places and this cafe was ok for decor- not my taste. If you're a guy, you'd probably like it more than me- more darker masculine style with old baseball games playing on the stereo. It was clean- I didn't visit the bathroom (that's usually a good indication of cleanliness). There was another big table of people there and us. The waitress was nice. I told her I'd like an ice tea and if they had lemon, that would be great. She said they don't. I thought it was strange since the giant carafe of ice water had sliced lemons in it, but who knows. **to be fair, the owner asked me if there was anything I would have liked when we checked out and I said Lemon would have been great and he did say he would have happily gotten a lemon for me- so, the waitress just didn't know... Not a huge deal. While we waited for the other table's food to be made, my daughter and I talked and watched the open kitchen activity. Someone came and picked up 2 big boxes of frozen crinkle fries, so I knew the other reviewers were \"off\" thinking they had homemade fries. Granted, the fries were fairly good. The disturbing thing for me was that the younger cook went outside with his gloves on, did whatever he did, came back inside (after touching the main door handle twice at a MINIMUM), did NOT change his gloves and went straight to the frier to take out the fries and then retrieved something from their toaster oven WITH HIS HANDS (same gloves) and put it in one of the person's food baskets from the big party of people. So, needless to say, I was VERY conflicted about even staying to eat. It appeared the owner was making our food, so we stayed. My daughter is picky and ordered a plain cheese quesadilla - it was just ok. I asked our waitress which I Should order, the Tasty Turkey or the Jesus' Grilled Cheese and she suggested the grilled cheese. So, I went with her suggestion. It was ok. Minimal oregano on it if any, as stated on the menu. It came with pesto sauce to \"dip\" my sandwich into. I thought that was odd. I would have rather liked the pesto on the sandwich- I think it would have elevated the sandwich and made it much better- up to the rave reviews on yelp. I was underwhelmed by the food - sorry every other yelper, but it was just ok. The owner was very personable- he should be out there greeting people and be in the front, not the kitchen.  It seems that the owner is a big part of what brings people back and I understand why- he's very personable and friendly and you can tell he genuinely wants you to enjoy your experience. I think that they need to brighten up the place a bit, put out lemon and sweetener for the tea, put the pesto on the grilled cheese sandwich and USE CLEAN NEW GLOVES TO PREPARE THE FOOD. That would be my assessment of my experience... Take it or leave it."}
{"text":"Unreal hamburger!!! A new menu \"starting tomorrow\" and this was one of the burgers being added to the menu. I don't recall the name of the burger but let me tell you...get 3 napkins or a beach towel because you'll need it to clean up after you're done. It was phenomenal...out of this world delicious!  A special shout out to the chef that created this masterpiece, I know your mama is proud of you!  Thank you also for your service in the Marine Corps, always great to meet a fellow service member.  Semper Fi Marine and keep on creating and cooking!!!"}
{"text":"I felt like the Little Chef in Ratatouille with fireworks going off in every bite! :D You...gotta...try...this place!"}
{"text":"We drove 30 miles out of the way to check out this place because of the yelp reviews. It was worth the drive. I ordered the Cuban sandwich and my husband ordered the garlic, bacon, shroom burger. Both had beautiful presentations. The chef asked us to taste test tomato soup that he was experimenting with and it was also very good. It was thicker than any tomato soup that I've had before but very flavorful. According to my husband the burger didn't have as much flavor as he expected but still good non the less. My Cuban was great. It was a small place with an intimate atmosphere. Everyone was friendly and welcoming during our visit."}
{"text":"I stopped by today and it was closed. Is the place out of business? I really liked it."}
