{"text":"Sampaguita is my first Filipino Restaurant I have ever been to (yes, Filipino). Great atmosphere. When you walk inside, it truly feels like home. The food looks as good as their menu. Plenty of selections and generous amount of portions t equals profit. 

Everyone should check this place out. You will keep coming back."}
{"text":"We've been here several times now. It is one of the best, if not the BEST filipino restaurant in Toronto. Favourites including Pinakbet, Kare Kare, Crispy Pata and Bulalo. Reasonable prices, good portions, fresh and delicious every time."}
{"text":"I can not get enough of this place! This is our go to Filipino restaurant. Affordable enough that I might come here every Sunday for dinner. This is my kind of comfort food. Portion size is great, fresh and restaurant quality. This isn't your mom's cooking. This place is popular so head in early to get a seat and you have to order the lechon kawali and kare kare. Keep in mind, this place is so popular they sold out of lechon kawali at 6pm on a Sunday. We got the last order. First time here, order the dinner sets.The servers are really friendly but they are crazy busy so be patient with them. See you next weekend Sampaguita!"}
{"text":"Food is great, service is great. However, they don't accept credit card. Although they accept debit cards, only those issued by Canadian banks.  They accept USD but the rate is $1-CAD 1."}
{"text":"Located at Wilson and Bathurst an area synonymous with Filipino restaurants and businesses. Sampaguita Village is a Filipino/Chinese restaurant that leans much more to it's Filipino side and that makes me happy. 

It's a no nonsense place that does traditional Filipino dishes the justice they deserve. Most Filipino places have all of the choices precooked and are served as part of meal (think Manchu Wok). Sampaguita is a sitdown meal with wait staff serving full dishes of made on order food (think Chinese restaurant). 

The dining area is simple an array of large and small tables. Some bamboo details, a mural of Filipino life and 2 tv's. It's an open kitchen which means that the smell, the smoke and the chatter from the cooks flows throughout the space. 

The best part about this place is the food. It's always busy and I can understand why. We tried some Filipino favorites and enjoyed them thoroughly. Lechon Kawali (crispy fried pork), pancit canton (thick egg noodles w/ veggies in a tasty sauce), beefsteak (thinly sliced beef w/ onions in a rich sauce) and the best Garlic rice I've ever had (think Chinese fried rice w/o all the soy sauce just lots of garlic). 

The prices are reasonable you can feed 4ppl for a little over $40. If your alone they have a lunch menu ($10) that includes rice and meat entree with a little steamed bok choy. We do take out all the time and plan to get some party size dishes made for our next party.

Next time your in the area or shopping at Yorkdale (it's not far) and are looking for something different (or craving for that familiar taste) try them out."}
{"text":"Great service, great food! Haven't been to many filipino restaurants (except in the Philippines) but had a great experience here! Ordered the garlic rice, kare kare, and crispy chicken in house sauce. All tasted very authentic and fresh, and had plenty of leftovers."}
{"text":"First time have dinner there with my husband, we ordered a dinner for two which comes with wings&rolls to start, then a combination plate with BBQ chicken & pork, and we asked for upgrad a steam rich into garlic rich.....the BBQ meats are very good condition, a man who looks very nice and I believed he is the owner of the restaurant told me they fresh cook the food by order, no msg~~that's a good selling point.

Both of us like the food there, we is supposed to back again, next time I would like to try theirs soups, it seems to be the most popular section ,almost all the other customers ordered it."}
{"text":"One of the better Filipino style restaurants in Toronto. Fresh, cooked to order dishes. Quality ingredients. Fair prices. Rice is never over cooked, noodles never broken like frustratingly most of the Filipino places out there. Good value for portions. Always busy and often hard to find seating. Lechon kawali, BBQ pork, and house pansit are yummy! Lumpia Shanghai is similar to Vietnamese fried spring rolls but I don't mind it. Much better than over garliced and blacked peppers ones at Filipino places. It's wrong but seems to have been a wide spread recipe! Ugh! 

Sampaguita Village is owned by ex Hong Kong native chef whose staff are mainly Filipinos. It's like a family run places, done well by paying homage to Filipino cuisine. The Chinese have it right when it comes to good quality food at fair prices! Still waiting for a truly authentic and quality Filipino place in the city though. It's not Lamesa and similar places like it."}
{"text":"The ambiance was not the best. I felt claustrophic but DAMN! The food was the best Filipino food I've had in such a long time....better than Remely's or Max's. the price is affordable and the portions humongous.  So if you want quality and not following a hype then this restaurant is the best decision although the staff could use a little bit of finesse when handling certain situations."}
{"text":"Can definitively say, my favourite Filipino restaurant to go to in Toronto. They accommodate you the best they can, considering how busy it can be around noon hour. Expect a line that could reach the front entrance if you happen to come around that time, but it's well worth the wait. My girlfriend and I recently went and ordered a ton of food, most we were expecting to bring back home and gorge on again. 

Sampaguita Special (Bihon and Canton noodles)
Garlic Fried Rice
Sinigang Vegetables (Medium is big enough)
Lumpiang Shanghai
Tilapia (Fried with Sweet&Sour sauce)
Lechon Kawali (THIS IS A MUST GET - everybody in the restaurant ordered it and you cannot take out this order)

All of this for under $60

Kain Na!"}
{"text":"The owner,  trying to be funny,  said to my friend,  \"What's a white guy doing here?  I'm sorry we don't have baked potatoes.  And here's ONE napkin for you.\"  VERY OFFENSIVE!   Our night was ruined,  and i felt soooooo embarrassed for it was my idea to have dinner here. Will never come back here."}
{"text":"If you are craving fast, fresh, cheap, delicious food this is the spot. For $50 including tax and a hefty tip, my boyfriend and I enjoyed on a Saturday night Sinagong (tamarind) soup with prawns medium, Pancit Sampaguita medium, Lechon Kwahili medium (fried pork), and Sampaguita dinner for two which included rice, lumpia (spring rolls), deep fried chicken wings, and mixed grilled pork and chicken. Don't let the medium fool you, the portions are HUGE! I was reluctant at first because how packed it was but we were seated quickly and served so fast! Also very friendly service as a cherry on top, none of that if you don't look Filipino, or speak tagalog you go on the back burner which I've experienced at some other Pinoy places in Toronto."}
{"text":"The only food that doesn't taste right is the sinigang na baboy. Will not order this again!"}
{"text":"I love this place! I like the location they are quite separate from the entire busy strip of all the Filipino stores in there. the good is amazing and worth joining the huge crowd. The service is decent , and I recommend this place to someone who likes to dine in a very casual setting.

Always busy even on weekdays. Make sure to order the garlic rice and the Kare-Kare"}
{"text":"This place is one of my favourite filipino restaurant.  I recommend to order their lechon kawali, my favourite.  I like the fact that the prices are reasonable and portion is great! This place is great for dine-it but it has a really small place and take out.  I totally recommend this place :)"}
{"text":"I'm a Filipino-American in Toronto for business frequently lately. I'm from the midwest USA. And in the midwest, Filipino restaurants are few and far between.

So I make a point to seek Out Filipino restaurants when I'm in town. When I'm somewhere for the first time I order the staples: barbecue, beefsteak, shanghai, rice.

I went in with high hopes due to the great ratings. But if I'm being honest the food was average at best. The barbecue wasn't the traditional kebab style but a pork chop. It was dry and missing the signature sweetness. The beefsteak was too sour. The shanghai were flavorless. 

There was a nice crowd and it looks like they've been in business for a long time. So maybe it's a local flavor that has kept this place so popular. The decor and the service is SO Filipino. Filipinos will know what I mean. 

I really wish I liked this place better! The staff are nice and I know they care about their customers because I witnessed it. It just wasn't my favorite."}
{"text":"Our friend recommended this place for good Filipino cuisine. It was our first time having Filipino food and this place did not disappoint!

We ordered the kare kare, pancit sampuguita and half portion of the wings.

Kare kare, an ox tail stew in peanut sauce, mixed with green beans and chunks of eggplant. It is served with a side of this dried fish sauce which really adds another dimension to the dish! Without it, it literally tastes like what it is - ox tail in peanut sauce, which isn't bad, but the fish sauce changes the whole dish. Even though the dish was found under the soup category, it is saucy enough to have with rice.

Pancit sampuguita was a noodle dish made with yellow noodles and the clear noodles. It tasted similar to Chinese Shanghai noodles except with lemon juice, which also, like the fish sauce in the previous dish, really adds another dimension to the dish. It was pretty good and the portion was huge.

We were told we had to get something fried when having Filipino, so we opted for the chicken wings. The deep fried batter was light and crispy but didn't have much taste to them. It was served with a dark vinegar dip. It was ok but I was expecting something salty, not sour.

Overall, we enjoyed our meal very much, would come back again. The portions were huge and we had a whole box of noodles to pack home along with half a bowl of the kare kare."}
{"text":"Homesick for Filipino food, decided to try this place out with the bf. The wait can be rather long, and the service sub-par. Despite that, the food is legit!"}
{"text":"3.5 stars

Was looking for a place near my work for a quick Monday night dinner. A quick Yelp search brought up this place.

It was packed when we arrived, which is always a good sign, especially on a Monday night. It quickly cleared out a bit when a group of families left, leaving the place about 2/3 full.

We ordered the pancit Sampaguita and lechon kawali. The lechon kawali was excellent - the meat was so tender and moist and just the right balance of fat and meat and the skin was super crispy - crunchy. The pancit was only okay, in my opinion. They're not stingy at all with the protein, but the flavour leaned toward the sweet side. I would have preferred a bit more savoury.

Service was super friendly and laid back. They started getting ready for the staff meal toward the end of our meal, but they didn't make us feel rushed at all. They gave us the bill but insisted that we take our time. That was nice.

Overall I'd give the food 3 stars with an extra 0.5 for the service."}
{"text":"Best Lechon Kawali I've had so far, tender meat and crispy skin, must order! I love their oxtail kare kare as well. Super down to earth and friendly staff, would absolutely recommend to friends. Very family styled restaurant, great for comfort food after a long day at work!"}
{"text":"Comparing this restaurant to other Filipino restaurants especially the ones in Scarborough that are close to me would be sacrilegious. This place boasts amazing food that comes with a price that is very wallet friendly haha. Although I still think that the restaurants that are located in the same area as this one is still arguably the best ones in the lines of Filipino cuisine. 

My sister and I ate here on the 16th and ordered the BBQ special for 2 (which was a great deal, it came with chicken wings, lumpia, bbq chicken, and RICE. omg i cannot get enough of rice) and also some lechon kawali (omg we were such fatties). 

It was soooooo good, although I wish we ordered something with \"sarsa\". It was good and I will def come back.

THE ONLY thing negative I have to comment about this place is the STINJYNESS when it comes to the dipping sauces. I want more SUKA god damn it!"}
{"text":"Been getting take out for several years here. Always love the food, but recently they put in a weird rule.  They will not sell me lechon to go, even when I see it directly in front of me.  At first they said they no longer sold it on weekends at all over the phone.  Then the next time they said it was for dine-in only.  This is just horrible customer service!  So if I sat down for 2seconds to order food and just dumped the plate into a container, it would be OK, but takeout is not?!?!  FAIL. Basically, no tip, no lechon for you. We will likely stop coming here and grab from one of the other half dozen Filipino restos near by instead."}
{"text":"Really enjoyed my first experience here! It's super busy though and they have a number system while you wait for your table (likely have to wait outside).

LOVED the crispy prawns (spicy) and the crispy pork. The prawns were really high quality and fresh tasting We also got the BBQ chicken. Everything was delicious. Yumm-o for the garlic rice. We also got the Kare Kare which was too peanut buttery - I'm sure this is how it's supposed to be but I wouldn't order this again.
Really authentic experience and friendly service. 

Will definitely be returning!"}
{"text":"I am a pinoy and I am giving them a thumbs up for most of their food. Place is really busy all the time but once you are seated, you're good. We love their liempo and barbecues. Location is convenient as well but parking is a little scarce. Will be back."}
{"text":"The restaurant is well known by its Sampaguita pancit which is a type of spaghetti noodles with different meat combination. My friend and I visited today for the first time because it was nearby her new condo. We ordered an extra crispy pata. This dish is similar to crispy pork belly that I used to have from HK. We also tried the halo halo. I definitely recommend this restaurant for those who wants to have unique experience of the filipino cuisine."}
{"text":"3 for the food. 5 for the service.

I was very pleased with the service. They clearly are very used to being packed all the time so there as no slacking off, very pleasant and prompt staff, and the food arrived considerably quick. cash and debit only here which is a bummer.

As usual I got my go to dish, crispy pata. It was ok. Not bad but not great either. It was crispy as advertised but can be elevated further with more tender meat and crispier skin. Got the pinakbet which I don't really eat a lot but I found it rather good. Normally, filipino veggie dishes has its vegetables overcooked beyond recognition but this was rather more chinese style. Vegetables still had a crunch to it, very good bagoong, and the crispy pork pieces were a good addition.The lumpia, was pretty average. Halo halo was ok but $7?? that's way too expensive.

Have to admit it is one of the more decent Filipino restaurants I've been to. Prices are ok. Some are a tad expensive while some a on the cheaper side. The soups in the menu I found to be unusually expensive."}
{"text":"When my uncle mentioned a while back that Sampaguita makes great Filipino food... I had to try it especially since my aunt is a very good cook.
Finally made the trip for dinner with some family and that's the best way to dine at Sampaguita so you can order multiple dishes and share family-style. I rarely go to this part of town (Bathurst & Wilson) but I can see how people (mostly Filipinos) do go out of their way and wait in line to eat here. Dinner on a Thurday night was a 20 minute wait, they don't take reservations.  The place is small and tables are tightly packed, but they serve great, fresh, made-to-order, no nonsense, authentic Filipino food... No cafeteria-style here.

We had:
- Garlic fried rice
It's a must to soak up all the sauces
- Lechon kawali (roast pork)
Crispy crackly skin and soft meat... Must eat with the spicy vinegar soy sauce - I can totally drink that on it's own
- Kare kare (ox tail stew)
Love It! Flavourful peanut sauce with crispy veggies and soft oxtail... Comes with a side of bagoong (shrimp paste)... Soo Good!
- Pancit (noodles)
It was good with lots of meat, seafood and veggies, but my attention was focused on the top 3.
- Spicy fried calamari
Thinly sliced squid with lots of diced pepper, so good!

Portions were big and great for sharing, there were 5 of us - total was $83 plus tip.  We had lots leftover and that's a good thing... Most people walk out with doggie bags and look forward to the next day when they eat the leftovers for lunch.
The place is busy, but service is quick and they don't miss a beat.

It was worth the wait to dine at Sampaguita and I mos def will be back!

Pro Tip:
While in line waiting for a table, take a look at the menu, give your order to the wait staff and your food will be ready for you as soon as your table is ready."}
{"text":"Great food with great prices!  I moved to the area and always pass by and see how busy this place is! Never tried filipino food before so wasn't sure really what to get.  The staff gave us recommendations and they were all amazing.  I really liked the garlic fried rice and the lechon!  

I got take out a few times after as well and the food was  just as good take out!  I often pass by after work to get food when I don't feel like cooking.  

Highly recommend this place and I wish I went in sooner!"}
{"text":"One of the better Filipino places I've been too. That being said, I don't have filipino food often because I always end up ordering a lot of fatty fried food, and little to no veggies. 

The prices here are very reasonable.... portion size is very generous. 

Ordered the Lechon Kawali, which was delicious.  Some pieces were a little fattier than at other places I've  had it, but most of them were okay. The medium size is actually pretty big.  It also  came with 2 sauces on the side... no idea what they were, but they did go well with the pork. 

Also ordered the Pancit Sampaguita noodle dish. I thought it was only okay. It seemed to be dominated by a strong celery taste, and I'm not the biggest fan of celery. I also found it rather greasy. My wife enjoyed it though. 

I'll return to try some other dishes, and order the Lechon Kawali as well. Probably will avoid the weekends given that other reviews mention its packed then."}
{"text":"Does not take US debit cards. We had the vegetable soup, medium house noodle dish, and BBQ chicken. My dining partner really liked the BBQ chicken."}
{"text":"If I could, would rate 3.5
It's a family run restaurant that serves family style dish. Tried the crispy pork that everyone recommends, it's not bad, has crispy skin but the meat is on the dry side, definitely tried much better one elsewhere
Since we came in 5, we got to try multiple dishes. What's so funny is that we ordered the sweet sour soup, the house special stir fried noodle and"}
{"text":"For authentic and delicious pinoy food, this is the place. it doesn't look much from the outside but everything is so good and I guess this is why it is always busy. I still wonder how they do their lechon kawali, it is to die for."}
{"text":"If you are looking for a homey filipino eatery, this is your place! The service and environment reminds me of an outdoor market eatery in Asia. We ordered a bunch of dishes, but I really liked the roast pork and shanghai noodles. I wasn't a bit fan of the beef shank and napa soup. However, the garlic rice was tasty as always. Also, don't forget to order a can of calamansi juice! Parking can be difficult in the plaza, but you can park on the streetside behind the plaza."}
{"text":"I've eaten here a few times already and I really like the food. I love the lechon kawali, my friend and I get that each time we go :) It is a small space and it's usually busy but we always end up finding a seat."}
{"text":"We've dined here twice so far so this is an overall review in comparison to several other Filipino restaurants we've tried (i.e., Max's of Manila, Casa Manila, Jesse Jr.'s).

Taste: very authentic Filipino!  You can see your food being whipped up in the open concept kitchen, smoke and all!  Of course it's the usual meat-heavy fare but does not fail to please.

Variety: there's a generous variety of choices to choose from on the menu, perhaps the most compared to other restaurants.

Portion: huge!  Amazingly huge!  At our last outing here, we ordered about five entrees for four people and were completely overwhelmed with the amount of food left over after we had feasted our faces!  Always good for leftovers.  Definitely the most generous helpings compared to all others we've tried.

Waiting time: no reservations allowed so always count on waiting by the door behind at least four other families.  Not ridiculously long though.  Always a good sign that there is a steady following though, especially with other Filipino restaurants in the area.

Pricing: very very decent, especially given the very very generous portion sizes!  Other restaurants just can't compare when it comes to value.

We've really enjoyed ourselves so far!  Only suggestion is to somehow find a way to expand to increase restaurant capacity...but that's obviously preaching to the choir!  Maybe buy out a nearby Filipino restaurant?  ;)"}
{"text":"Just got wing- They ok! I wanna try other items tho."}
{"text":"One of the few places I have ever given 5 stars. An avid fan of Filipino food and having been to the Philippines many times, this is the real deal! As soon as you walk in, you feel like you have entered tita's kitchen. Amazing tastes, large portions, good prices. The only thing they don't carry is San Miguel beer. But do have Corona and Blue. Try the beef steak, sinigang, pusit, fried shrimp, pancit, lechon kawali, or the pinakbet (sp?). You will not be disappointed."}
{"text":"I always get the lechon kawali and squid platter. Uber good. I've never had a fancy for Filipino cuisine or lechon (pig) at all until this. The service reminds me of Filipino aunts. I feel right at home. Its a small place to go eat and the price is just right for authentic Filipino food. I'd always come back here :)"}
{"text":"The food here is authentic small-town province Filipino food. It was totally awesome! We wanted to order everything on the menu, we just didn't have enough space in our stomachs. 

I only gave four stars because they need to renovate the interior of the restaurant & get a bigger place. During weekend dinner & lunch hours there is not enough seating for all the clientele.  Take the time to arrive before the lunch rush-hour crush, and you will not regret it! We came early just before 11:30 a.m. to reserve seats enough for us & our guests. 

The customer service was great, but the food was even better! Our favourites were the lechon kawali, fried fish steaks, & the battered fried squid! Portions are large & really great for big groups. Will definitely be coming back!"}
{"text":"Food was good but the place was incredibly small. Not to mention the food smell that sticks to your clothes. The menu variety could improve as well. However, the portion that you get for what you pay for is great. If the place is bigger, I'd give it 5 stars!"}
{"text":"Amazing authentic Filipino food! My personal favourites are the pork sinigang, garlic fried rice, Korean beef, and lichon kawali. Fast service, open kitchen. They tend to get super busy on the weekends. Located in the heart of little Philippines in Toronto. They only take debit and credit. Take out is a possibility if you are on the go. Would recommend this to family & friends."}
{"text":"Always have good service .. Sam the owner is very accommodating because I am on a low salt diet he makes sure the kitchen uses less salt when I order .. their singing bangus and special pancit are my faves"}
{"text":"A street (Wilson Ave.) full of Filipino restaurants in Toronto, what a pleasant surprise. Nice vibe, great tasting food and quick service. I over ate and felt like I was back in the Philippines. The seating was kind of tight but I suppose this was a good sign. We ordered about 10 different dishes and we enjoyed them all."}
{"text":"If you need a quick and filling Filipino food fix, this is the place to go to.

We came for Sunday dinner and there was a bit of a wait to get seated. Seating was a bit cramped, had a cafeteria vibe and we felt like our neighbors were staring either at us (who stuck out a bit from the Filipino crowd) or our food.

We ordered:
Lechon Kawali / Squid set - the lechon was damn good and crispy while the squid was decent. The squid was deep fried and leaned more towards being a Chinese dish.
Pancit Sampiguita (miki-bihon) - pretty decent and huge portion. The noodles were a combination of egg noodles and vermicelli, that included a \"sahog\" of various meat including chicken, shrimp, bits of lechon kawali, and some veggies.
Lumpia - came with a sweet and sour dipping sauce. This is found was pretty average.
Sago drink - I thought this reminded me of the usual \"gulaman at sago\" drink, but I just found their version too sweet and syrupy.

Overall the service was pretty fast, friendly (where the manager/owner? Was making rounds at tables to make sure everything was ok) with huge portions for cheap!

I'd definitely go back again when I'm up in the neighborhood and will try their grilled dished (grilled liempo)!"}
{"text":"Awesome food and great service! Highly recomended to order are as follows: Lechon kawali, inihaw na hipon, garlic fried rice, pancit sampaguita, sinigang lapu lapu, crispy pata, crispy fish steak and their house combos are good options too! And they are walking distance from FV foods which is bonus!"}
{"text":"Sampaguita Village is a Filipino-Chinese fusion restaurant in Midtown Toronto. Just by the sheer number of local Filipino people dining in the restaurant, I knew that I was in for something good (or authentic, at the very least).

The owner of the restaurant occasionally works as a server, and he's one of the best things about the place. He's attentive, apologetic when he drops the ball (the restaurant is usually jam-packed and things slip by, as expected), and very kind.

The food is very inexpensive and the portions are huge. You definitely won't be leaving Sampaguita hungry, that's for sure. I've had the chance the try the fried rice, noodles, and calamari, and all three were awesome. I'll definitely be back to try the house special noodles and fried chicken next time around."}
{"text":"Uhmmmmmmm... yeah, this place is fantastic!
Sooooo good!

Sometimes you're stuck waiting in line, but it is well worth it!
I have yet to try anything from here that I did not LOVE! The only thing better then this places food is my boyfriends, haha.
It is definitely a go-to if you are craving some Filipino grub or if you are looking to try it out for the first time!
Staff is quite friendly, seem to have a 'family' vibe around here, nice people. :)
They also do big trays if you're looking to cater for a party or something... if you aren't planning on eating there you can always call in your order so when you arrive you can grab it and go!"}
{"text":"I was craving Filipino food and found this place on Yelp. I loved the reviews and photos and also happened to be in the area during the weekend so I came here for dinner. Whooaaaa, this place was PACKED with people lining out the door! Finding parking in the plaza was near impossible, I would say if you're stuck finding a parking space, try the side streets. 

Thankfully, after circling around for the third time, I found parking! Also, I was eating alone and didn't mind sharing a table so a waitress was able to settle me to a seat almost immediately. 

I have to admit, I am not an expert in Filipino dishes and had to refer to some of the Yelp photos to guide my food choice. When it came time to order, the waitress was kind enough to give me some helpful suggestions. For how packed that restaurant was, I would say food came out rather quickly. I ordered a veggie Sinigang and pancit bihon. Both were very delicious!! 

Because I shared my table, I was faced with dishes that my table mates ordered and it looked mouthwatering to me. Definitely, the next time I return, I may bring a friend or two so that we may order a couple more dishes together as Filipino eating is very communal. 

Highly recommend this location the only downside is the parking."}
{"text":"I'm a Filipina,  and since this restaurant happens to be in Little Manila, my rating is going to be pretty tough. 

It is a popular place with Filipinos and non Filipinos alike; but with relatives and friends that can cook way better AND the close proximity of many other Filipino eateries in the area, I'd rather go somewhere else. Not much in the way of ambiance, and the service is hurried, not very personable."}
{"text":"When a place is filled with locals you know you are off to a great start.  It's a small, no frills place that serves up a big bang 

The portion sizes are generous and the prices are decent.  I don't eat Filipino food often, as to be honest, I'm not the biggest fan of it, but this is one of the better places I've been to.   I believe it's a family run restaurant so there is care put into the quality of the food. 

Definitely get a few items to share - you won't leave hungry.  The service is super friendly and quick.

BBQ Chicken , pork belly (I don't eat pork but my friends said it was delicious), veggies (gotta get the greens in), crispy squid, everything I tried was really good.  The food came in a decent time and was hot.  

The parking lot is small and I can see how it can get packed as other reviewers mentioned.  Try street parking as an option"}
{"text":"Great place for authentic filipino food! The place is a tad small (they should expand - hint hint!) but the service is quite fast.. I love the exposed kitchen atmosphere. The servers are very friendly! The servings were HUGE - definitely worth the value! 

Here's what we ordered:

- Crispy squid (highly recommend getting it spicy for an extra $2). It's not really spicy, but they toss it in a mild chili sauce

- Garlic Fried Rice (can't go wrong with this dish. The garlic is not too overpowering, and it was a nice side dish to all of the main dishes)

- Pancit Sampaguita (great noodle dish because it had a lot of the meats, seafood and veggies - it was nice and moist [not dry])

- Crispy Chicken with house sauce (boneless chicken used with batter, not what I expected but still a good dish to order. It's not oily, it's quite light and comes with a nice sweet and sour sauce on the side)

- Steamed (Turbot) Fish (this was a great dish! Lots of meat on the fish, it was steamed and sitting on a light sauce garnished with some green onions. It wasn't fishy at all)

- Kare Kare (it wasn't my favorite dish on the menu. It wasn't as meaty as I am used to kare kare being, and it didn't have any tripe. The sauce/soup was a little runny for my taste - I'm used to kare kare sauce being richer and deeper in color. Still an ok dish though)

Lots of other great dishes served to other tables. Their pork sinigang looked amazing. This is the kind of place that you have to visit time and time again so you can try all their dishes!"}
{"text":"This has become a regular lunch spot for me and my coworkers. Pancit is amazing, but their lechon kawali is to die for. Service is really quick, and portions are amazing for the prices. The first time I walked in I think I was the only non-Filipino there, and the staff welcomed me and immediately gave me a crash course in Filipino cuisine - the meal was incredible."}
{"text":"No doubt their house special is the best! If it is your first time coming to this place, make sure to order their house special noodles! It makes you love the place even more. It is the best noodles I've ever had. It is not too pricy and the portions are big!"}
{"text":"Such a lovely family restaurant! We came for lunch on Wednesday, and there were some empty tables, but they quickly filled up within fifteen minutes. We ordered the Pancit Sampaguita, which was their recommendation, Lechon Kawali & Shrimp, as well as Crispy Chicken. The house sauces are delicious, and seemed to work with every type of meat. A few pieces of pork belly were slightly burnt and too crispy, but otherwise the food was of great quality. The portions are quite large as well, and we had plenty of leftovers.

Service was decent - all our food came out within five minutes, but there was never any water refills - I think the staff got quite busy during the lunch rush. All around amazing food at an affordable price."}
{"text":"I have been here many time and was never disappointed once. Their portion is big, especially the grilled meat platter. But my favourite is still the fried calamari! Yum! The best ever! The restaurant can be very busy, mostly on the weekend. Price is reasonable, food is good, can't go wrong :)"}
{"text":"its my first time to visit this place and its really good !! a crispy lechon kawali!! and yummy squid.."}
{"text":"It is so intimate and friendly. the food is authentic,superb and well priced."}
{"text":"Decided to order takeout from here instead of eating in on Saturday night. This turned out to be a masterstroke as this place was jam packed with 99% Filipinos, which is always a good omen regarding the legitimacy of the ethnic food.

We ordered: kare kare (oxtail and peanut butter soup), the lechon kawali (pork belly) and fried squid house combo, and the pancit sampaguita (fried noodles). The Kare Kare is the must order dish, such a rich, unique flavour. The beans, oxtail and eggplant are all delicious in the soup. The fried noodles were okay, and so was the pork belly - nothing too special for both. Come for the kare kare, stay for the kare kare!"}
{"text":"This place is a go to for me when I crave for Filipino food. Their menu is simple and straight forward. If you want to try Filipino food, this is one of the place to go to if you find yourself in the Bathurst and Wilson area. Prices ranges from $12-15."}
{"text":"Food is good but overtime the prices got higher and the quantity of food you get, decreased. You don't exactly get what you pay for anymore. Space is small and cramped. Its very loud with little to no A/C. Wait times can be long as well.. ill stick to cooking at home"}
{"text":"Having moved to the area recently, I decided to try out what was rated for Yelp as one of the better restaurants. I had ordered the Lumpia De Shanghai previous but as take out, and it was pleasant. This time I wanted to full on experience.

So my friends and I went to see what was good, what all the hustle and bustle in the small strip mall off of Bathurst near Wilson was about.

When we got there, the dining area was packed and there was a flow for take out. We were given a table after 3 mins of waiting.

We sat down placed our orders, I took the beef and garlic rice dish, my friend took a Korean beef steak dish, and the third guy took a shrimp and rice dish.

The orders moved slowly, but we finally got out food and then a few minutes later our drinks.

The beef in my dish was tender, garnished with a lot of onions and some brocoli and a large serving of rice. 

Our bills all came out to 13.84 which is very reasonable for the portion size.

I shall be back."}
{"text":"I ordered the Filipino fried chicken for take out. 
The right combination of salt, pepper and garlic resulted in a delicious lip smacking taste. 
If you like fried chicken, check out this spot. 

**be forewarned with take out. Better live close by as it will stink up your car good. If you take transit, it'll stink up the bus good and will be like a mean prank to other transit riders."}
{"text":"Excellent food. Owner is super friendly guy who chats with you and comes over to ask you if everything is ok. He really cares for his customers. Food is very tasty, but as with all normal Filipino food, it is oily! Most famous is the lechon - get any dish with that and you'll enjoy it. Place is relatively small. On weekend dinners you we'll most likely wait in line to get a table. Interior decorations are very sparse and a bit cramped. But the food makes up for everything."}
{"text":"A must go to place when you are looking for filipino food to satisfy your cravings. I love the lechon kawali (crispy pork), kare kare(ox tail cooked with peanut sauce), crispy squid and inihaw liempo(pork belly). 

Always packed so better go early. They do not accept reservations."}
{"text":"A very tiny place but absolutely amazing food!  Dishes are served fast and piping hot...I've never been disappointed."}
{"text":"Why eat at a GTA Filipino restaurant when you have aunts that are awesome cooks! Well, this place was both totally worth the drive out to North York and my calorie count for the evening (week really - yay cheat meals!). 

We didn't order much because we were about to head to a Yelp event with food but the three dishes ended up being plenty as an entire meal for 5ppl! We got the lichon kawali, which was deliciously crispy. We would have liked more of the skin but should have asked because the table next door got tons. Newbie fail. The garlic rice was nice and firm and not at all sticky like we had found in other places. The favorite of the night was definitely the kare-kare; an oxtail stew with veggies in a peanut based sauce. It's one of those things that I wonder if non-Filipinos would enjoy but my NF friends loved it too. 

I'm coming back with my parents!"}
{"text":"Outstanding Filipino cuisine offered by this very low keyed restaurant.  The \"Lechon Kawali\" is one of the best I've ever had.  We drive over 4.5 hours (from USA) just to have a taste of authentic Filipino food offered by this restaurant.  

A couple of suggestions:  
1.  Accept credit cards.  Cash only is challenging at times.  Debit cards are useless for USA debit cards.....
2.  Take reservations for groups of 5 or more."}
{"text":"Came here for the first time a few weeks ago. Best filipino restaurant in the GTA in my opinion. Expect to wait for a table, but it was worth the wait. We ordered the kare kare, sinigang, lechon kawali, and pancit sampaguita and enjoyed all of our meals. Had plenty of leftover to bring home."}
{"text":"Better than I thought! 
Loved the crispy pork belly and the pancit sampaguita 
BBQ chicken was slightly burnt but very tender"}
{"text":"Despising every minute of having to be at Yorkdale, and hungry as hell, I launched my Yelp app to look forward to a place to eat once this mall nightmare subsided.

Highest rating - Sampaguita Village. Sure there were only six reviews at the time, but the common theme was 1) Excellent Phlip food and 2) ginormous portions.  Considering how hungry I was, Yelp app had me at 'launch'.

The menu is Chinese and Philipino at the same time. The place was packed with Philipino locals which instantly was a good sign. The place itself is pretty much a hole in the wall, but as soon as you enter, the mouth watering aroma's over power you and you stop thinking about the interior. 

Service is fast, friendly with smiling Philipino ladies telling you what they like if you ask. Not being a pork eater myself, my options were limited (though the pork hog did look spectacular). We settled on kare kare (oxtail peanut stew) and pancit (thick style noodles with veg and protein mix). Tip: The shrimp paste is excellent if you can handle that flavour.

First off, that was wayyyyyyyy too much food for a sane person. Two healthy dudes, we barely finished half the food. Second off, the open concept cafeteria style seating makes you want to order everything as you see food go by. It's a trap. Whatever you think you should order, cut in half and you're good. Once you place your order, DON\"T CHANGE IT. You're good. Trust me.

I definitely will go back here next time i crave some Phlip food. I used to go to Max's restaurant, but i'm over it after going to Sampaguita."}
{"text":"This little mum and pop resto is a hit. It hits close to home. By far the best filipino garlic rice I have ever had but shhh dont tell my mom (sorry mom).

This place is a chinese and filipino fusion. I stongly recommend the short ribs with garlic rice, its about $16 before tax but the portion is good enough for 2 people. I usually get the sinigang ( pork tamarjnd soup) it adds a sour kick to all the salty foods you and its nice to have a hot soup with your meal.

The place could use a uplift. The hall way to the washroom was cluttered with boxes and such but it didnt really bother me that much, just remember if your going to eat here, its def not fine dining, but the food is so worth it."}
{"text":"Ok, so just a quick update on a recent food binge we had here. Came for the lechon kawali, which is the deep fried pork belly and for $17, the serving shrunk to a point of non existence resulting to losing our appetites. Really??! It was ridiculously small in comparison to a slab of fresh pork belly you can purchase from the grocery store (which I'm sure they can get way cheaper in bulk from Chinese suppliers).

I'd price it at $12 the most based on portion, these are boiled to tenderness and then deep fried until crispy. Pretty simple process, especially with an expensive pressure cooker to cut some corners.

Not many ingredients is used to put 'fancy gold flakes' pricing on it. It clearly states on the menu that the lechon kawali is priced based on current per pound pricing but I can get a slab of fresh pork belly for the $17!! This is why Filipino cuisine is never the go-to place when you are on a budget and a hefty appetite. Ample portion sizes is never our forte, sadly."}
{"text":"I'm lovin' it!

Went for lunch with a friend who had spent a substantial part of his childhood in the Philippines. The place was packed with Pilipinos: natives eating at an ethnic restaurant is always a good sign. And a good sign it was!

The sparse and rather sterile environment was somehow warm and enticing: the sizzle of food cooking, the laughter and hum of conversations and the smiles on people's faces added much to the otherwise drab settings.

We ordered  lechon, fish steak and garlic rice. Lechon was crispy and fatty: tres delicious. The fish steak was crisply battered on the outside, but very tender on the inside. The garlic rice along with the vinegar/soy/red pepper concoction were nice accompaniments to the meat on the table. I wish we had ordered veggies to balance the meal.

While the food was very fresh and tasty, the lack of sauce made the meal a tad dry.

The portions were ginormous and we had enough leftovers for a meal each between the two of us. Unfortunately, the left overs didn't taste as great the next day. I guess fried things taste best when eaten fresh.

I will be back fo sho."}
{"text":"Best Filipino resto to go to! I have brought all my friends who haven't tried Filipino food here and it's been a hit on their end. I love the kare kare but unfortunately they got rid of their small size (bring it back!). I also love ordering their rice and beef ribs dish, and crispy chicken with rice. I usually end up subbing all normal rice for garlic rice because it has a much more enhanced taste. You must go here over all the other Filipino restaurants I know of :) May look like a hole in the wall, but when push comes to shove, the food is what you're here for."}
{"text":"FOOD:

PRO: Miki-bihon or Sampaguita Noodles was the bomb! Overall food here tastes good and authentic. Servings are huge here, one order is already good for sharing.
CON: Casa Manila has better Kare-Kare.

PRICE:

PRO: Inexpensive and you get the value from what you paid for. 

AMBIANCE:

PRO: Casual vibe. You can come here and not worry about what you wear.
CON: Place is too tight, they have a tiny space. During peak hours, you can barely get in and out of your seat. 

SERVICE:

PRO: The staff is friendly and very polite. They will even recommend dishes to you when you are not sure what to order. The owner also asks the customers if you're satisfied with the food or not."}
{"text":"Not bad, not bad, not bad.

My boyfriend and I went on Thursday, around 11:45AM thinking they'd still be closed (it looks like it's abandoned to be honest).  But inside was already bustling, people were already eating, and a lot more came in right after us.

The place was small and I can see how it would fill up quick.  There are a lot of people in the restaurants (cooks, servers, the boss that likes to sit in the front with his friends) and makes the restaurant feel a little cramped.  

We ordered the Sampaguita Pancit and the Crispy Chicken with House Sauce.  The food came fairly quickly (thank god) - nice and hot.

The pancit was looooooooooooaded with shrimp, pork, and chicken.  It was literally half 'meat' and half noodles.  That has never happened to me before.  Especially at an Asian restaurant.  The noodles are half big egg noodles (I have no idea what they're called but they're udon like) and half vermicelli.  Yum.

The crispy chicken was pretty good too.  They fried the skin to perfection and served it along with 'house special sauce' (which according to my boyfriend) is very common and not so special.  It's a combination of vinegar, chilis, and garlic.  Any how the dish is like having chicken thrown into a deep fryer and away it goes.  Not bad but not amazing.

Overall, the restaurant was clean but a little cramped (eaves dropping is very easy [[well because the tables are close together and the customers do tend to be LOUD]]).  The food is okie dokie but nothing good enough to fantasize about instantly when you're hungry."}
{"text":"The moment you eat at this place, you know that it's run by a person who cares about food. I haven't met the owner, but I can tell that he's set a high standard for his staff. I'm amazed at how efficiently this place is run. It's like a well-oiled machine. On weekends, there's a typically a lineup of 5-10 people at any given time waiting for a table. That's typically a good sign.

The staff at Sampaguita Village is very friendly and efficient.

The food tastes great. Consistently. My all-time favourite is Pancit Sampaguita. Get a Medium one if it's meant for one person. Otherwise, if you get a regular sized portion, you can easily share it.

When I'm in that neighbourhood, I like to drop by for lunch. I'm usually the only white guy in the restaurant since the majority of other patrons tend to be Filippino. That's another good sign because it means that the food is authentic.

Being a frequent patron of Thai, Japanese, Mexican, and Indian restaurants, I don't know that many Filippino restaurants in Toronto, but this place is for sure my favourite Filippino restaurant."}
{"text":"Every dish that we have tried here has been delicious and the price is good as well as very big portions you will most likely have left overs to take home. Service is good fast and friendly."}
{"text":"Always a good place to eat Filipino foods.Around 2years ago was my last visit here and I can say that the good taste is still the same although I have 4stars because the servings got smaller and as always it's congested.The management really needs to expand since it's fully packed all the time! All in all we'll go back for the good price and good taste."}
{"text":"First time having filipino food,  not having much expectation,  it made me fell in love with Filipino food.  As a Chinese,  I always thought filipino food will be too exotic and flavourful but it actually tasted almost just like Chinese food.  If you're not too adventurous this place would suit you.  
 Portions are HUGE.  2 of us ordered garlic fried rice(highly recommend),  sour fish soup,  green beans,  and fried pork. We smoked up before eating and we still couldn't finish it plus enough for the both of us to take home for lunch.  All that for $40! I will Definitely go back"}
{"text":"The sinigang was awesome, nice and tangy and spicy like it came straight from the Philippines. Crispy lechon and bbq chicken was cooked to perfection and the bulalo, sinigang, and rice all came out steaming hot. Very good on prices too. For the four of us it was around $80 but we also had a lot if leftovers too. Great place, even if it is packed to the gills as everyone obviously loves the food and good service here.

On a note about the owner: he was an executive chef for 35 years and even though he is retired, he still maintains that passion and drive for quality, inspecting every batch of sinigang and bulalo and other dishes, improving them as needed to bring them to their highest quality. He greets every group of diners throughout their meal with a smile and to make sure their experience is the best it can be."}
{"text":"3.5 Star

Sampaguita Village does have a feel of a down to earth hole in the wall restaurant in a little village where everyone drop by for dinner. 

This place was packed and the parking lot was a nightmare. I ended up parked at one of the meters on the side streets, even paying for parking was worth it compare trying to fight for a free spot in the parking lot.

Since I was with a regular of Sampaguita Village, I left the ordering to the expert and ended up we shared:
 
BBQ Chicken ($4.95)
Pancit Sampaguita ($11.95) 
Spicy Shrimp ($11.55)

The food was tasty and portion size was more than enough for 3 of us to share. 

The service here is fast and friendly.

Tips: the pop or ice tea costs $2.50 a can?! Seriously.... don't care that!"}
{"text":"If you really like Filipino cuisine,this is the right address for you.
Big portion and sizes."}
{"text":"Did the take out here because the place was bloody packed. It's typical for the Filipino places like Remely's and some other ones I have unfortunately been too when I was younger. 

They have packs a few tables and it is really cramped. 

Maybe it's okay if you want the nostalgia of the karenderia that I went to in the Philippines but I have never enjoyed the Experience of those places I just wanted the food. 

This is why I prefer a comfortable seating which this place does not provide.

Anyway I just got two dishes for take out. Filipino style spring rolls which are a little over an inch long as expected. But it is $1 each. More expensive than a typical dim sum so very overpriced especially after I tasted it. It wasn't too oily but the thing left an after taste that was typical of the dish. An after taste I don't really like. It is a veggie roll too and was over peppered which does not do so well for my taste palette. 

Minor correction. Apparently there was meat in the spring rolls. A so tiny sliver of it that I thought it was veggie. 

The other one I took home would normally be something I would enjoy. Grilled pork belly. Aka inihaw na liempo. Initial taste was okay but nothing really special. Then it sort of degenerated to being vinegary and over peppered.  The good part it wasn't like that for all the pieces. The ones that have a bit of skin and fat tasted better. Though it is tougher but i like it that way.

There are two reasons why this place got another star. One of the was the liempo and the other is that it is not icky afterward. But for $11 for a tiny box... So not worth it. 

I don't think I would willingly go there  especially since the parking is way cramped for the plaza."}
{"text":"SO. MUCH. FOOD! And all perfectly greasy for a Saturday afternoon. We ordered the lechon kawali, sampaguita pancit, and wonton soup (because we were walking in from a snow storm and felt soup was mandatory). Everything was delicious, and I loved the different textures between the crispy lechon kawali with the sweet gooey sauce and the different noodles and crunchy beans in the sampaguita pancit. 

But enough about the food, what really made my experience at Sampaguita was the service!  The service here was fantastic and I loved how full and open the kitchen was. The waitress asked if we had ever been before, and was quick to make suggestions when I told her it was our first time. She also came by several times to make sure we were enjoying it, which I thought was very sweet! It was almost as if I'd been invited into a Filipino family's house for lunch with the warmest welcome."}
