{"text":"This is a new restaurant...so give them a try! The food was good...pad thai was great. The customer service was outstanding!"}
{"text":"My wife and I always use yelp to find new and exciting places to eat. Samurai Asian bistro was another excellent example of why I use it. Every item we had was absolutely great, my wife was really wanting a Japanese soup and the shoyu ramen noodles really hit the spot. We certainly found a new place to eat when we are craving sushi.

- spicy edamame = off the charts
- fried Goya = excellent
- chicken yellow curry = excellent"}
{"text":"OH MAN, I REALLY wanted to love this place. It's OH SO CLOSE to work, and would have been so perfect and convenient. In my head it was all planned out. I'd eat there every single day for lunch...not really.

OK! so,...the place is small but nice inside. The food is average at best. Every roll I tried was lacking...mainly in texture. The rolls were mushy, sushi was blah. Not a lot of flavor. I just wasn't impressed. Although, I would try it again in the future.

Give it a try, you might like it. ;)"}
{"text":"I've been there twice for lunch since they have opened and have been very happy.  The lunch bento boxes are a great deal and very good.  The shumai are great and the entree portions were really good.

The last time I went I had the salmon.  Actually a nice cut of fish.  They put a nice sear on the outside for some texture and the fish itself was cooked nicely.

My daughter ate about 3/4 of it.

I'm not sure if I would make this a sushi destination though.  There are a lot of good options in Goodyear that I would put above it for the actual rolls.  I think maybe it's the rice, but there is something a little lacking in this department.

However, I will continue to come here for the rest of the menu which has yet to let me down.  Service has been fantastic as well.  I'll probably still give the sushi a try as a side item, but not the draw."}
{"text":"We just ate here for the first time and loved it!  We had the red curry and the mango chicken.  Plus they brought out free fried ice cream for our birthday.  We have been looking for good asian food on the west side of Phoenix and we have finally found it."}
{"text":"Greeat place too full up on your favorite Sushi sashimi and salmon teriyaki , excellent flavor creations love it."}
{"text":"The food here is decent (I'd say a solid \"C\" on a school grading scale), but it's what happened at a recent visit to the Samurai Asian Bistro that causes me to give it such a low overall rating. Our family will never return to this restaurant. 

After finishing our so-so meal we went to the car where my little one announced she had to use the restroom. With more than a 20 minute drive back to the home of family we're visiting, I didn't want to take any chances, and I thought it wouldn't be a big deal to go back into a place we just dropped almost $50 in to use their restroom. Additionally, the neighborhood is a bit sketchy (saw two shirtless junkies stroll by on our way in), so we didn't want to look around for another facility or just stroll into some other business. My wife took her back in to Samurai Asian Bistro and walked back to the restroom where the cook/chef literally ran from behind the sushi bar to intercept my wife and my young daughter. 

At first he tried to block their entry to the restroom, then after my wife insisted we had just finished our meal, he continued to physically block their path and kept asking how many was in her party. She reiterated that we had just finished our meal and paid for it and to please move so she could use the restroom. He remained mostly in the way so my wife brushed past him so my daughter could use the restroom without having an accident. My daughter is five (!), mind you, and my wife is a pretty, well-groomed and unimposing person by most measures. 

Needless to say, she was furious when she came out of the restaurant. I asked if she wanted me to go back inside and address the situation in some way. She insisted I did not go inside for a variety of reasons, including me losing my temper. 

Bottom line, we will never go here again. Up until my wife's experience with the cook/chef, the service had been good, but the food and ambience just isn't worth it--especially with staff who act so inappropriately and aggressively toward someone in their establishment. We've been here before and were not impressed and only went back on the insistence of family we're visiting who somehow enjoy the place. 

For those reading this review who don't care about the drama the chef/cook caused, I think going to a sushi restaurant is a better idea if you want sushi,  to a Thai restaurant if you want Thai, to a Chinese spot if you want Chinese, etc if you're looking for a specific type of food or dish. It's a jack of all trades, master of none-type thing. As my wife said, they make a lot of different dishes, but none are really good. The hodge-podge of \"Asian\" food dishes from Chinese, Japanese, and Thai cuisines will leave those who are accustomed to those types of food feeling dissatisfied."}
{"text":"This place has okay sushi but their Ramen taste like spaghetti.....but there Thai tea was good and really good service"}
{"text":"This is my first time doing a review because it's worth it. This place is the best Japanese restaurant in Goodyear area. It's cheap and yummy!"}
{"text":"Good food for a good price. I had the 2 roll special- I chose a salmon avocado roll, spicy yellowtail crunch roll, a salad and miso soup all for 8.50! Most meals come with a salad and/or miso soup. The miso soup is excellently balanced, not too salty although it was a bit hot temperature-wise. The sushi was great as well. My wife ordered the orange chicken. Overall it is good. The dish portion is deceptively large. They have a good variety of music so that it still has a traditional feel yet they will throw in some of your old favorite hits. The decor is simple but satisfying. Clean tables and a cool environment. The staff is nice and does not pester or hurry you while at the same time making sure you have what you need. I recommend this place to anyone who wants good food even if you are on a budget."}
{"text":"This place is slow...geographically this place would thrive in another area BUT the chicken fried rice is the best I probably have ever had! The price is absolutely right as well! I wouldn't get the sushi because it is not as cold as I would like but the entrees are perfect. Also, the happy hour menu is HUGE...3-close! Nice little quiet spot for a date  merry Christmas..."}
{"text":"I had high hopes for this place because it has 4 stars, but was very disappointed. The chicken lo mein had no flavor at all and neither did the California rolls. The chicken fried rice was just ok and it was the best thing we got. Probably won't be back."}
{"text":"Service could have been better. Curry nothing to remember. Sushi was blah. Katsu seemed like it was leftovers that was re fried. Was really hoping it would be great spot since I live so close by but I won't be returning."}
{"text":"Food was decent, although I just had vegetable tempura which is difficult to mess up. My husband had sushi which was also just ok. The most annoying thing was that when we went we were the only customers in the entire restaurant and had to wait 20 minutes for my husband's food while everyone else ate. They didn't even start making his food until after I was served. Maybe we will come back if they ever learn proper serving etiquette, but that's not likely."}
{"text":"Rock shrimp tempura is awesome.  The four season roll looks amazing and tasted great.  Four kinds of fish in that roll.  Red curry is delicious."}
{"text":"Well the good reviews sure fooled me : (

I got a bad stomach ache after eating here and feel like throwing up.  I got the Philadelphia roll. Never again! 

Also the server and sushi chef did not seem like they wanted to be there. The atmosphere seemed pretty miserable. Kinda sad really...

My family members have stomach aches too. I do not think their sushi is clean and prepped properly. 

What in the world have we done to ourselves. Worst night EVER. Please please please save yourselves and avoid this place!!

The good reviews must have been from better times. I think this place is going down hill for sure."}
{"text":"So, I read \"Avi E.'s\" review of 22 August 2013, where she writes, \"MEH, I've had better\" and after eating here last night, concluded that she obviously won the lottery that day and was either very generous in her review-writing or high on the excitement of becoming a millionaire.

\"MEH, I've had better\" would be a major step up for this place.

We went for dinner last night, because we wanted to try something new and I hadn't had sushi in a long time.  That they had a 9 hour Happy Hour should've been a clue right off that something wasn't right.  But, I had been very happy with Akai Hana's Happy Hour and thought, \"let's give it a try\".  My, my ... what a difference a couple of miles make!

First, the place is indeed spotlessly clean; big plus.  But almost completely empty on a Thursday night at 7pm?  Very unusual for Goodyear/Avondale.  Alas, by meal's end, it was clear why.  

The host/waiter barely understands English, which was only a problem for me, when I ordered the $4 salad for myself only to have two plates of salad brought to me and my guest.  And what a salad it was!  If you can imagine someone going into the garbage and pulling out the wilted lettuce leaves left on old dinner plates and then covering them with watery Russian dressing doled out by the eyedropper, you got the picture.  In fact, at one point, I had to confirm that this was just a complimentary salad with dinner and he was still bringing mine to the table.  Nope.  This was the salad; however, it was $1, not $4 and he split it in two.  Okay, blood pressure dropped a little; because had it been two, unsolicited \"salads\", upon which a rabbit would've starved, it wouldn't have been so nice an evening considering what my next question/statement to him would've been.

My guest ordered the spicy mango (a Thai dish).  He claims it was good.  From appearances, I would compare it to someone opening a can of chunky cat food and covering it with watery, Italian-like dressing that someone grated two passes of a mango into.  Serving size?  Okay (and I'll leave it at that).

I went for the Happy Hour sushi rolls.  This choice was, without a doubt, what led me to the decision to never visit this restaurant again.  It probably didn't help, that I had Akai Hana up the road to compare this place to, but, for the same amount of money, whereas Akai Hana's portions are decently sized (and they're smart enough to serve their happy hour sushi rolls on long and thin plates to make them seem bigger), the happy hour sushi rolls served by this place could best be described as \"Japanese Totino Pizza Rolls\".  Out came, indeed, a dish with 8 pieces of a sliced-up California roll, which any bird, mouse or other animal smaller than a newborn kitten would have found perfectly sufficient.  As for me, I took a bite of each and they were gone.  When my guest and I decided to order more sushi after his spicy mango dish (appetizer, if you ask me), we went for the rolls that cost double, thinking there'd be more substance to them.  Nope.  Same size.  The Las Vegas rolls were warm and were covered with what looked like melted-down grass clippings, but were otherwise no different --- and no more filling --- than the rolls priced at half of them.  On the other hand, to complete the overall dining experience, this set of rolls were brought to us by the sushi chef, whose unsmiling countenance made me feel like I was being fed by the Addams Family butler, except a little less friendly.

So, in conclusion:  

cleanliness:  excellent;
food taste:  MEH, I've had bread and water more appetizing;
portion size:  perfectly acceptable for any prisoner-of-war in a concentration camp;
value for the money:  seriously?  You really need me to answer that?

As a final note, I should tell you that I'm a diabetic and one reason I avoid sushi is because the carbohydrate-content sends my blood sugar spiking.  Two hours after eating here, my numbers didn't move a bit upward in spite of devouring four plates with eight rolls.  I think, that in itself speaks volumes.

Sayonara, guys!  I'll stick to Akai Hana"}
{"text":"Update: love this place even more. Fried rice and lo mein are out of this world. Have not tasted nothing on their menu i don't like"}
{"text":"Overall, the service is about a 3/5 as the waiters seemed like they didn't want to be there, however the taste of the food is a 6/5. Chicken tempura roll was one of the best I've had, as well as their iced tea (it's not your regular old iced tea, I think it's a Thai version.) the chicken lo mein is awesome as well, especially if you drizzle a little bit of eel sauce over it. The bill came to about $22 for 2 rolls (chicken tempura and California), chicken lo mein, an iced tea and a Dr Pepper. Overall fair prices, especially for the quality of the food. Portion sizes could be better though. Definitely will be back, I can see myself being a regular here. 

NOTE* bring a sweater!"}
{"text":"Very good sushi here, and well-priced.  A typical no-frills, basic decor and ambiance sushi joint, but solid and tasty sushi offerings!"}
{"text":"I am so glad that we came here this weekend! We have our go-to sushi restaurant that we frequent; however, since we had a babysitter, we decided to try something new. 

I must admit that on our way here, I almost turned around to go to our usual spot because I was extremely hesitant after hearing some of the reviews (my husband was reading them to me as I was driving); however, we were feet away from the restaurant and decided to stop. I'm sooooo glad that we did. 

The food was ammmmaaaazzzziiiinnnngggg as was customer service! The miso was absolutely delicious and piping hot. Miso had a generous (for miso) serving of seaweed and tofu. We ordered the Ninja Jalapeno appetizer, which was delicious! Perfect mixture of cream cheese and spicy tuna. I will be dreaming about these jalapenos for the next few weeks because they were that good! 

I also ordered the Crazy Roll and the Jalapeno Yellowtail roll. Both rolls were delicious and everything tasted fresh."}
{"text":"I keep coming back because they are consistent with their good food.  always friendly, always clean- you have to go during HH (everyday from 4pm-close) and try a little bit of everything. 

Pro- great food and fresh raw fish.  Miso soup is flavorful and the tempera is light. 

Con- the bathroom could use a face-lift."}
{"text":"I would say just ok. We were in the neighborhood for a movie. Orange roll was good as well as the gyoza and miso soup. The bathrooms and restaurant were clean. We went at 11:15 am on Saturday and were the only ones there for an hour. The staff was very strange. I wouldn't say they were rude but just very quiet and most of the time not visible. Very strange for a sushi place. I would call it average. I probably won't make a special trip to come here again and like my husband said there are way too many sushi places with decent food to give average to below average customer service."}
{"text":"Wow 1hr wait for 1 roll sushi and garlic pepper beef only 3 tables filled. That's the way to get the doors closed fast. Ppl have jobs where they have to be back on the dot. Glad i did not or i would walkout. Water taste like faucet. Salad clearly grocery prepreped has cleaning solution taste. Vegas roll left a pasty film layer in my mouth likely poor ingredients.  Neeext"}
{"text":"Just ok, nothing bad nothing great. I wouldn't turn up my nose if I had to eat there again but wouldn't pick it as my choice as there are better asian places nearby.

Detractors:

1. California roll was warm and had no cucumber. I'd never had a California roll without cucumber before.
2. Teriyaki Chicken was just a chicken breast heated on a hot grill. It was white and had not been charbroiled which is a must for teriyaki chicken in my opinion. It was dry and flavorless except for the sauce which wasn't too bad.
3. The rice was dry and not the normal Japanese rice I'm used to.

Positives:

1. Iced tea was brewed and not instant like in many Japanese places.
2. Gyoza was good.
3. Salad and soup that came with bento box were good.
4. Surprised by fresh vegetables that came with the teriyaki chicken."}
{"text":"Great starter salad and the spicy mango chicken was delicious.  Perfect portion for a lunch special.

They do serve sushi and I will more than likely go back to try a few rolls."}
{"text":"Sushi was okay. The pad Thai was not okay. It was more sweet than savory. The noodles were the best part of the dish. Unfortunately, though the dish was just ordinary. Not a place I will return to for sushi or pad Thai."}
{"text":"Great food and friendly service as well as a clean restaurant. Definitely worth checking out if you're in the mood for Chinese food!"}
{"text":"Pretty good tasting sushi for the happy hour prices. Service was great also. Many options to choose from. Definitely will be coming back."}
{"text":"Terrific Christmas Day meal for six of us: pork udon, Thai basil chicken fried rice, General Tao's chicken, teriyaki beef, teriyaki chicken, tempura shrimp, tempura vegetables, and a variety of sushi rolls.  Highlights were the udon, the fried rice, and the yummy roll.  Attentive service and food arrived hot and quickly.  Generous portions and great value for the money ($25/person including tip).  Highly recommended."}
{"text":"This was the worst sushi I've had and with it came poor service. I called and asked for specials - they told me it was 2 rolls for $8.50. Not until after I ordered the Las Vegas and Green Dragon did they say special rolls were not included. Paid $18 for the two - pretty over priced! I picked them up to go and when I got home to eat (5 minutes later) there was a bad odor when I opened the boxes. The fish lacked color (not a good sign) and tasted bleak. The consistency was off, they used way too much cream cheese to compensate, and put very little eel sauce on top. The green dragon's eel looked and tasted old. The temperature of the rolls was off too. While the green dragon should have been served cold, it was luke warm. While the Vegas should have been hot, it was luke warm. 
Long story short, I could barely stand to eat a couple pieces of each and had a stomach ache for a while after that. I'm confident I would have suffered severe food poisoning if I'd consumed all of both. I'm very disappointed. Perhaps their other food is good (I wouldn't know), but this isn't the place to go for sushi. I do not encourage anyone to come here."}
{"text":"Ordered Shoyu Ramen and it was flour noodles (Udon) in Shoyu ramen broth...topped with a piece of Nori and an egg.  That's all.  Didn't taste bad but very weird.
I am Japanese and we do not call that Shoyu Ramen where I come from... 

Everything else tasted OK.
The place was empty and the service was efficient.
Will go back if I ever feel like Udon noodles in Shoyu Ramen soup."}
{"text":"I stopped by for dinner while killing time in the area. The venue is pretty small and had customers come and go but was never too busy. That might have been because it was Sunday evening. I had the Philadelphia roll, edamame and Ninja Jalapeño roll and sake bomb with Kirin Light. The sushi was great. Ninja roll had a nice kick to it. Price was reasonable and I believe they have a happy hour menu available daily from 3pm to close. Service was decent considering there was only one server/hostess. I never ran out of water. Plus they played a ton of 90's R&B."}
{"text":"Great tasting sushi for great prices! Happy hour is from 3 PM until closing time. I've eaten at all of the sushi restaurants in the area and this one is by far the best!"}
{"text":"Great Sushi place in the Goodyear area!  We ordered take out and had the Spider Roll, green dragon roll, sex on the beach roll and rainbow roll!  All of it was delicious and a must try!  There are so many different places to try but this would be a good start if you're staying or living in the area!"}
{"text":"Went here on a date night and the atmosphere was good, what I expected. Smallish, dim lighting, and not too noisy. Staff was friendly but didn't talk too much which I kind of liked. Food was pretty good. If I was in the area I might go there again but it's not my favorite place. Quality was good, prices were fine, water could have been refilled more, but overall a good experience!"}
{"text":"I got the eel roll (tempura eel, cream cheese, cucumber with crunchy topping) and the Philadelphia roll (salmon, cream cheese and avocado) - both were so amazing and they were made very fast. The food tastes very fresh and it was decently priced. This is my new favorite sushi spot!"}
{"text":"This place has the best shoyu ramen on this side of town, by far! I was raised in Japan, so my standards for ramen are a bit higher than most, and ramen in Arizona never really meets that standard. For the Japanese restaurants in the Goodyear area, this has the best ramen that I've tried. The price is very good as well (happy hour prices!) for their rolls and sashimi plates too. This may not be the best Japanese food I've had in Arizona, but it's worth the price and worth the visit!"}
{"text":"Very good food, reasonably priced. One of the better sushi restaurants on the west side. Inside of the restaurant has a great feel to it. My only complaint is that the restroom leaves a lot to be desired. Overall, though, very good restaurant."}
{"text":"Best sushi and sake bombs, with an awesome happy hour menu (and a generous happy hour it is!) in the valley, hands down. Nuff said. 

This hidden gem will fill your craving for Asian cuisine, not just sushi but ramen, Thai, and other dishes whipped up by their talented chef.

A true delight. Courteous and efficient service, love songs on the playlist to woo your love, and a fun kids menu to boot! 

Easy parking, great for takeout as well."}
{"text":"Went for Happy hour. There is only certain rolls on the Happy hour deal, and 90% of them have tempura or are deep fried, not a fan of that! Sushi was good, not the best I've had. I would probably go again."}
{"text":"Came here for dinner on a Friday night. There was a sign saying they would be short staffed. I was a bit worried, but the older gentleman working alone was very attentive. He made sure we had what we needed. The chicken yakisoba was delicious and In love their veggie spring rolls."}
{"text":"This is a very small place. There was one server.. it was pretty dead on a friday night.. we got a shrimp tempura roll which was good! 3 of us got the orange chicken and one got the general tso chicken. I thought the dishes had a lot of flavor! 

Don't expect anything fancy or over the top here.. prices are good, food is good, one server is difficult but he did a good job. We will prob come back!"}
{"text":"It should of got a 4 start review but they didn't had my soup I want it but it's all good 
Stop by got me some sushi rolls during happy hour and Wow I was Happy"}
{"text":"I would never in my life go to this place again I was there a few days ago and there was a gentleman with glasses who seated and waited for me and my son. I will start off with how horrible the service was as he was extremely rude and would slam plates on the table.  We were the only ones in the restaurant and yet it took him about 15 minutes to get us our drinks.  I actually had to get up and head back to where he was standing to ask him if he could bring us our drinks.  If there was a way to add negative stars for his service that's what he would get. 

Now moving on to the food. I ordered a Ramen soup with a side salad and my son ordered the orange chicken with a side salad. The dressing that was on the salad was so clumpy not because that's the way it should look but because it looked like it was old or expired. I still  went to head and tasted it and the taste was disgusting, I wanted to throw up. 

My son and I both ordered a soda and both of our sodas were flat; different flavors. I asked the waiter if he could give us a different type of drink do to the fact that the soda was flat. We both went with a sierra mist or sprite can't remember exactly which one it was and it was also flat.  I asked again however to switch it up to a Tea which was also flavorless. 

I see some people have pretty good reviews for the sushi which I have not tried however this was my experience I will never return and would not recommend you do either."}
{"text":"There's a Chinese restaurant in Lancaster, CA that my wife likes, they have big servings with really good food. So, we decided to try and find a similar restaurant here in Phoenix/Avondale/Goodyear area. I saw the Samurai Asian Bistro in passing the other day and told her about it. We decided to go and let me tell you, while the portions may not have been as large as the ones in California the food was very tasty. I highly recommend this place. Food is delicious and priced just right. I will definitely will go back."}
{"text":"I love this place! I come here at least every two weeks because the few people that work here care about the patrons that come in. I'm an introvert who doesn't really like dealing with people, but they are so kind and caring about their customers so I enjoy coming in every time. The food is also AMAZING! I LOVE the food too! Their sushi and their happy hour cannot be beat! I order to-go half the time just because I'm craving their food. It's worth coming here. You cannot beat good miso soup for a dollar! Love it!"}
{"text":"Amazing and off the hook! We are from the east and this place gave us Thai as well as Japanese. The service was on point and the food super fresh! This is a little gem! Looking forward to visiting soon!"}
{"text":"We just moved to this area and I'm a huge fan of sushi and Asian cuisine, I must say I was pleasantly surprised with this place. I had the shrimp yakisoba, the shrimp were cooked perfectly, and the New York roll. Both were amazing, their rolls aren't the prettiest but they are delicious. My husband had the chicken teriyaki and the Dysart roll and those were also wonderful. Small staff but very fast and nice, amazing place, I will definitely be back."}
{"text":"Just moved here from California and came across this spot. Amazing!! They have happy hour from 3 to close. WTF!! my buddy and I had 5 rolls, shrimp tempura, vegetable tempura, edamame, miso and rock shrimp. We walked out with a $42 tab... ARE YOU KIDDING ME!!! Davied the sushi chef was great. I can't wait to bring my fiancé here when she gets in town."}
{"text":"Complex Flavors...Certainly worth visiting.

Samuari Asian Bistro features a combination of traditional Thai fare along with a contemporary sushi bar in an inviting atmostphere. We visited Samuar Asian Bistro during happy hour (3 to close daily) and were pleasantly suprised with the prices. The entrees are fairly priced and every entrée comes with a small side salad, which is topped with a tasty dressing.

On this visit to Samuari's we had the Pad Thai, Thai Fried Rice, egg rolls, and sesame chicken. Every entree was made with the freshest ingredients, seasoned perfectly, and were absolutely  delicious.

Samuari Asian Bistro makes it hard to find excuses not to keep coming back. Plus, the portion sizes guarantees  you will have leftovers for the following day, so it's practically like you're getting two meals for the price of one. The only drawback is service tends to be on the slow side."}
{"text":"Absolutely love this place!!! It was my first time going and it won't be my last. The food and service was amazing. The waitress was really nice. My sister loved the Miso Ramen. My 1yr son enjoyed the kids chicken lo mein. While I fell in love with sushi rolls. The rolls didn't smell or taste fishy. I give this place a 5!!!"}
{"text":"My husband and I moved to the SW side of Phoenix and desperately searched for a good sushi place! We tried numerous restaurants and Samurai Asian Bistro was amazing!!! We've been here multiple times and always have a wonderful experience! Prices are great and service is always fast! Clean restaurant & delicious food/sushi!"}
{"text":"Drivin by this place many time...glad i finally came in. Great food. Great price. Definitely coming back."}
{"text":"This places has such great prices and the food is great! Definitely come for happy hour! We ordered the $2 coronas and a bunch of sushi rolls for under $20."}
{"text":"At first glance it looks like no one was home butt surprise! Excellent food Sushi, Sashimi, calamari, unagi everything was great I would come back again for sure....!"}
{"text":"Found this cute, cozy, very comfortable place for delicious sushi. The place was small but so clean and cutely decorated, giving me a welcoming vibe when I stepped in. They have a happy hour menu from 3pm till close everyday. We had a table of four people and when the bill came out, we were shocked to see how reasonable the prices were. We had ordered a whole lot of food as well. I've been to other sushi places that are way more expensive and the sushi is not even anywhere comparable to this place. I love the the \"sex on the beach\" roll. It's crunchy and delicious. I also love the spicy edamame. The first time I tried just the plain edamame, but the second time I tried the spicy one and omg it was so good!! Their pad thai was yummy as well. They offer both Japanese and Thai food here. Also make sure to try the thai tea!!! Super good!! I've been here twice and am completely happy both the times I've gone. Be sure to give this place a try if you're in the area and wanting some good sushi!!!"}
{"text":"This place actually surprised me. The way the building looks outside does not do its food justice. We had a rock shrimp tempura and I highly recommend that! The description says it's spicy but I would consider that more of a tangy taste. In addition to the appetizer I had the sesame chicken. This is not the kind of chicken you get at Panda Express, it's actually very tasteful and fresh! I do recommend this place and I know it won't disappoint. The coustumer service was on point!"}
{"text":"Went with my book club and we all enjoyed the food. Very nice staff, good food and great prices!!"}
{"text":"This place is a diamond in the rough. Avondale, especially this area, isn't \"known\" for their food... Especially sushi. However, I have never had a bad meal here. The service is friendly, warm and consistent, they even have taken the time to memorize my favorites orders. The happy hour deal is great and is offered every day of the week! From their ramen, pad thai, rolls and appetizers, everything is delicious and amazing."}
{"text":"I'm loving every bite of my wok spicy peanut chicken.  Lots of crunchy delicious vegetables, mushrooms, chicken.  The spicy peanut filled sauce tops it off wonderfully.  The chef brings the meal to the table.  The staff is very good.  I never have to wait and the ambiance is spot on.  I have eaten Thai and sushi here as well as the wok meal.  Everything is sooo yummy.

If you are in the area, I highly recommend this restaurant."}
{"text":"One of the best gems on the westside!! The sushi chef is the best in town. All the help are genuine, and kind.  Definitely a place to take your date on a nice romantic night!!"}
{"text":"This place is a hidden gem. The sushi is mouthwatering and delicious. I was fist skeptical about this place specially because it was empty, but I had to try. Do not get discouraged if it's empty it's well worth it. Shortly after business picked up. I will be returning to this hidden gem."}
{"text":"Ok this is an 2018 update. Now that I eat sushi I came here with my kids and had the yummy roll on a Friday evening. Pretty good! I ordered the kids the hibachi shrimp fried rice and wow!! So yummy. Their miso soup is also amazing. Everything was great. Can't beat the prices. We will be back soon!!"}
{"text":"Great prices and amazing food especially Happy hour under $20 for a meal for two!!!! Service was on point and sushi was delicious! I will definitely be back!"}
{"text":"My first time trying Samurai and I was impressed! The sashimi was fresh and delicious! We also had the Yummy Roll and that was sooo yummy! They have Happy Hour from 3pm until close every day so that's a plus. This will definitely be my go to sushi place when I am in Goodyear. The staff was extremely nice, pleasant and helpful."}
{"text":"My husband and I were not a fan of this place. The rice didn't stick to half of our sushi rolls. The miso and spicy miso were bland."}
{"text":"Food and service was amazing happy hour starts at 3 and ends at closing time. The jams over the radio were on point. Got the rock shrimp tempura for an appetizer and they were amazing also got three sushi rolls all good and they have a bomb Thai ice tea"}
{"text":"This place was a little suspiciously quiet but the reviews were good so we tried it out. We can see why people say it's a hidden gem! We tried the spicy tuna roll, Alaskan, rainbow, red dragon, ichiban, and those were so good that we have now ordered the green dragon and the happy roll. Very, very good Our service was great too and it was an excellent visit. I would definitely come here again!"}
{"text":"Wanted noodles and teriyaki chicken. Found this place and decided to give it a try. The Bento Box is more than enough food for 1 and the teriyaki chicken was really good. One of the better California rolls I have had and the gyoza was pretty delicious. The udon noodles were not what I expected but the 2 year old liked them. The General Tsos chicken was some of the best I've had, not over sauces. The only  downside was the wait for the food but will be back to try more."}
{"text":"What a great little surprise of a restaurant. Food was fresh and delicious. Service was A+! Will visit again. We had BBQ fried rice, tempura, and combination plate of sushi rolls."}
{"text":"Great food, and service! Wonton soup, and spicy mango chicken are great. They are very reasonable my son and I ate here Wednesday night, two appetizers, two entrees for less than $30."}
{"text":"It's quite unbelievable to find such a high quality sushi spot in this area. Come for the happy hour, you won't be disappointed. 

The yellowtail is simple divine. Melt in your mouth good. The eel, tuna and salmon are excellent choices as well. Don't be afraid to get adventurous, the octopus is tasty too! 

An excellent choice for a quick and healthy dinner in Avondale. Oh, and I would be remiss if I didn't mention the amazing soundtrack"}
{"text":"By far some of the best sushi I've had since moving from CA! I'm so happy I found this restaurant! Though I definitely would say it's more $$  but for quality I'm willing to spend it. For four rolls we spent $35~ one roll was still being made when I took the pictures but we were too hungry to wait and take a picture of all four together!"}
{"text":"I live right up the road from here and so far so good. It's my go to place when i'm in the mood for fresh sushi. The restaurant is also set up very nice and clean"}
{"text":"This is the place is very nice and the food is very good the prices are great as well the only downfall to this place is that it's dark and that's that I went during the day I thought they were closed for a minute if they would just open up their blinds up and have a sign out that says that they're open I think they would get more business now I know that they're open late so I don't know if that's when they get their most business but I went during my lunch time and it looked pretty lonely but besides that I recommend this place by far the best place for susi out here"}
{"text":"I saw this place spring up a while ago, but just got around to trying it. I was pleasantly surprised. They have a nice mix of Japanese, Chinese, and Thai food. The food is very reasonably priced and you get a really good sized plate. 

I got the black pepper chicken, which came with white meat and was cooked really well. The sauce is unique and delicious. My mom got the sesame chicken, which they also make with high quality white meat chicken, and the sauce was great. We got an order of chicken Yakisoba noodles to share and it was great too."}
{"text":"Let me tell you all something! Get the orange chicken! Best I've ever had. It's delish! It's fresh and has great flavors! Second get the basil fried rice! Great portions and freshness. Sushi rolls are average but the pricing is great! And did I tell you that they have happy hour from 3-close?!?! Sake bombers are 3$ !!!!! Insane right?!?! Try it out! You won't regret it!"}
{"text":"Decent happy hour. Good portions and pretty tasty. Limited seating & wait staff but still pretty quick service. We'll come back again but with a smaller party."}
{"text":"Come here all the time! Food is delish and affordable. Only complaint is they stuggle to answer the phone when I'm trying to place an order for pick up."}
{"text":"Clean establishment, friendly service, bland food. Have gone here twice, while it was bad, it wasn't good either. Middle of the road sushi place."}
{"text":"We live in the neighborhood, and we finally tried this place. I wish we had gone sooner. The food was fantastic, the service was a little slow but we prefer to be to be left alone. The seafood was fresh and you really can't beat the prices, especially at happy hour. We will be visiting this place more often."}
{"text":"Not a bad little sushi spot! They have Happy Hour from 3-close with great drink prices. The sushi was pretty good - fish tasted fresh and they used large pieces of crab instead of the mushed up kind. We also split their Spicy Peanut Chicken dish. I didn't care for it. The veggies seemed too hard and raw for my tastes.

I don't think I would come back here. It's not bad, but I feel like there's got to be better sushi somewhere!"}
{"text":"I love this place. Great food. Try Dysart rolls, we love them. This is definitely our, \"Not sure what I'm hungry for... Screw it, let's go to Samurai's!\" place of choice. Really can't go wrong. If dining in, it's not too pricey."}
{"text":"Very tasty! I had the green curry with chicken. It was fabulous! The waiter recommended it, because I could not decide what to order. The choices are fabulous. I don't live here, but will stop here every chance I get."}
{"text":"This is probably one of the best Chinese/Asian restaurant out here in Avondale. Great service, Clean bathrooms/ Quiet and relaxing, and most important great food I recommend the Las Vegas roll/ Dysart roll and the sesame chicken."}
{"text":"Meh. I HAVE experienced better. Sushi is definitely not, just, sushi. I've come to learn that over time. I had high hopes for this place, but the sushi was just 'okay'.

I ordered a Cali roll (my fav) , a Shrimp Tempura Roll and the Vegetable Mini Rolls. All of that set me back $17 and some change!

The Cali roll wasn't cold enough and they skimped a little on the cucumber, also every bite seemed to taste different. It was weird. The Shrimp Roll wasn't anything special and same thing with a few of the bites tasting different. The veggie rolls were pretty good, but I have a feeling they weren't 'homemade'. 

Overall the food just left me a little unsatisfied and a tad bleh by my last bite. Such a bummer because I really liked the vibe of this place.

Ah well, like I always say you can try out whatever you want, but I guarantee there's better sushi joints around. I may be back at some point to try out some other menu items (which I'll review), but I probably won't order sushi again."}
{"text":"Hidden little gem, great happy hour everyday after 3 pm. Food was tasty and service was great, will be back!"}
{"text":"First time to this little place in Avondale. I was very glad I stopped in for a late dThe service was supreme. My server was at my side when ever I needed anything. I ordered a roll of sushi, egg drop soup and the udon soup. I was pretty hungry after a workout and this was more than enough to satisfy me. The sushi came out quick. The egg drop soup is a pretty big serving size considering the price and the udon noodle soup was massive. The sushi was fresh and the rice and salmon and salad were very good. I had enough to take home for lunch for the next day. Luckily I don't live too far and will be returning to this gem of a restaurant."}
{"text":"Had a craving for hibachi fried rice and saw that Door Dash delivers Samurai Asian Bistro! I couldn't resist. My fried rice and vegetable mini rolls were delivered in 20 minutes. Good stuff!"}
{"text":"Favorite place to go for sushi, love their happy hour specials and always order the yellow curry. Great atmosphere and service. So relaxing.  My husband is obsessed with the salmon roll."}
{"text":"Love this place, not too bad on the prices and excellent service ! Delicious food of course."}
{"text":"We had a take out order and they were very fast and the fried rice, lo mein, and sushi rolls we got were INCREDIBLE!!"}
{"text":"I've tried these place more than a couple times and I really like it. I give it a 5 because it's super organic super light and just taste diff then most sushi places. Not so much salt etc. Customer service is always great."}
{"text":"Awesome service whenever I walk in. They really work to make you feel comfortable and happy about your dining experience. The Saki bomb specials are insanely cheap and offer: Sapporo, Asahi, Kirin/Kirin light. Really just a great spot if you are looking for sushi.l here in goodyear. Keep up the great work you guys!"}
{"text":"\"I love your sushi roll, hotter than wasabi. I race for your love, Shake-n-Bake, Ricky Bobby.\" ? Drake

Let's get this out in the open: This is not a place to go to if you want a true authentic experience. This is the place to go to for some cheap rolls!

While not the biggest in size (hey, size sometimes matter), the quality and price is where they lure you in. With a wide array of fare, this Asian Bistro has Chinese, Japanese, and Thai cuisine to suite everybody's taste buds. Don't want sushi? Have some curry, lo mein, or even udon! Don't want to watch your brother slurp up Pad Thai? Nibble on some edamame. The four of us spent $50 on Sunday dinner here. I don't think we have ever spent so little on dinner together! Happy Hour is daily from 4pm until close. 

Samurai Asian Bistro is a cozy restaurant, very clean with nice dim lighting. Service isn't the most personable but there's always somebody nearby when you want to add more to your order. It's definitely a good spot for decent eats at a great price."}
{"text":"The Dysart roll is life. That's all I need to say about this 5 star sushi hole in the wall.. 

Ps. Happy hour deals are amazing!"}
