{"text":"Delicious & affordable. Not what some may consider \"fine dining\" but it's definitely a lot cheaper than most sushi/teppanyaki places around. Cheaper in this case doesn't mean bad quality, either. Everything was still very tasty and service was great."}
{"text":"This is a solid place for sushi! They are consistent, great prices, fresh and delicious every time! Service is also good, so I keep coming back!"}
{"text":"We had no idea what to do for dinner and we stumbled onto this incredible restaurant tonight!!  We are picky eaters & have a very high bar for the restaurants we go to. This evening - we enjoyed one of the most amazing, tasty, & flavorful meals we have had in Vegas.
Our Teppenyaki chef was named Big John. If you go - Ask for him! He gave us sauces that were filled with incredible flavor, meats cooked to perfection & an experience we won't soon forget. And yes we'll be going back - again & again!
We ordered the chicken, steak & calamari... With fried rice, noodles, soup & salad. We have enough leftovers for two more meals for each of us! Go - You won't regret it. Nothing is better than rich flavor, spices & tastes that are completely memorable... This place offers all of that & more..."}
{"text":"Man, what an interesting experience tonight.  I have never felt compelled to write this sort of review, but hopefully it helps the management to get their crap together.  I will say that I have been to their first establishment in BHC, and for an old McDs building this place is surely an upgrade.  Not fantastic by any means, but a decent steak and ok sushi.  Tonight at the Sunset location, however, something was REALLY off.  The sashimi portions were small for the price, which would be fine for higher-quality fish, but this was decent, run-of-the-mill quality.  The bigger issue with us, however, was the service.  I ordered sashimi a la carte and my wife did AYCE.  The server was keen to interrupt after the first order roll to lay out the \"we will charge you for what you don't eat and we don't do half rolls\".  So our part of the deal was to follow the rules and her part to bring the food.  She failed miserably.  Only that one roll was consumed after 20-25 minutes and she was not stopping by to take any more orders...it was almost seeming that she was avoiding eye contact with us...eventually we asked one of the bussers (who was generally attentive) if the wife could order AYCE from him, he hesitantly took her order and also refilled our drinks.  About 50 minutes into the 60min limit, the waitress drops off the order list, mumbles something and walks away, again not taking the order or even addressing us directly.  About ten minutes later the wife stops her, orders a couple more items and eleven minutes later she brings the bill.  From then, we waited another 20 minutes for her NOT to pick up the bill, and we had to go to the bar so we could pay and leave.  So that was our experience.  Needless to say it was memorable for the wrong reasons, but perhaps it was a really REALLY bad (not busy) wednesday night."}
{"text":"We went here to celebrate my daughters 14th birthday. (December 3rd around 6:30pm) We waited about 45 minutes for a table at the grill because she had never been to a Japanese steakhouse before. My husband and I have frequented them for years so we were excited to share the experience. Well, our chef spent the entire time talking to a couple at the table who were regulars. Even after telling him it was our daughters birthday he spoke maybe 10 words to us, didn't \"perform\" like the other chefs and made extremely inappropriate jokes at the other couple in front of my child and her friend. On the plus side, the food was amazing and the other staff were absolutely awesome. 
The sushi we ordered was extremely small for the price, we are used to getting triple the amount of sushi for the price, but it was very good. We spent $200 there and were very dissappointed with the ambience. Also. The bathrooms were unclean and missing paper towels. And while waiting they stuck is in a small corner between the bathroom and the bar and forgot about us.  We were the only people on the list yet watched 5 other families be seated before us. I wish I could give it more stars because the food was really good, but the whole night was just dissappointing. It kind of ended the night on a bad note."}
{"text":"Fantastic! We had dinner for my son's birthday here tonight. The food, service, and atmosphere were all great. The server was super attentive and she made the kids feel very special. Between all of us we had the teppanyaki shrimp, chicken, and steak. All were well seasoned and well prepared."}
{"text":"This was the place Fukuda used to be at. Little bit cheaper and same great food. If you liked Fukuda you will like this place a little more. If you like teppan grill you will like this as well."}
{"text":"We have been there 3 times now.  We have eaten in both the All You Can eat dining area and the tepanyaki grill dining area. The 1st time was fantastic.  We had a minor service hiccup the 2nd time, but we think it may be due to unexpected short staff on a Wednesday night and the place was busy.  We expressed our dissatisfaction with the service to the manager, Kazu.  He was very understanding and even discounted our meal (although this wasn't requested or expected).  The 3rd time we came back, we brought 2 young kids with us and sat at one of the Tepanyaki grills.  We all had a great fun time.  The kids were very entertained.  The chef made sure to include them in the presentation.  The food was excellent, and we feel the price is a good deal for the quality and service.  The previous 2 visits were both all you can eat sushi, which is also priced properly and with a very large selection of specialty rolls and non sushi items included. The quality of the sushi was great.

We will be returning again in the future and recommend this to both adults and for children.  It's a family friendly environment, yet there was not many children during any of the 3 visits. Thanks again for the great night!"}
{"text":"Store is 3 star, service is 3 and a half. 
But food... People say it's very good but, I'm from the country where teppanyaki is wonderfully good and usually costs only $3 to $5 ... So this is not impressive to me at all. 
It's slightly better than Panda Express alright, and that's it. 

Had teppanyaki here, teriyaki chicken and shrimp combine, and NY steak and salmon combine. Served with steamed rice, fried noodles and broccoli. 

When they came, my first thought was, they don't look like teppanyaki at all. This didn't bother me because it could be new style. 

Teriyaki chicken was ok, tender, less salty than other Japanese food or Chinese food places (,which was a good thing, teriyaki is not about being salty). Shrimps were a bit hard and dry, a bit less than ok

Beef was in good quality but the cooking didn't quite match. Kinda wasted the steak. 

Salmon fillet was alright. 
Broccoli was a but too crispy, I personally don't think broccoli is something you eat half raw. 

Really the food was not bad, just... they were no more than grilled food. There was no teppanyaki aroma in the store, as for teppanyaki, they didn't make it right."}
{"text":"Amazing hibachi restaurant!! Food is amazing! Sushi is all half off all the time! Two people- soup, salad, sushi, hibachi steak and chicken dinner, noodles, rice, veggies, shrimp, and SAKE $60 easily! Service is hit and miss! Make a reservation but still expect a wait."}
{"text":"I've been here so many times and love it. But 4 days ago was horrible. Theres only few people and still messed up with my order. We waited for 20 mins to take our order then another 20 mins wait for the food. Then 10 mins for wrong order. Their AYCE not really great its really limited sushi rolls."}
{"text":"Food was okay-- nothing to write home about. Would have been a good neighborhood spot to go to except the service was atrocious... Not planning on coming back"}
{"text":"Went for all you can eat sushi!! 
Bar was full so had to sit at table. Our server was horrible he checked on us twice and we waited forever to get our food. But once we got it it was horrible. 
Ordered some rolls that should have been hot they were cold. It was definitely half assed. We even had to ask the waiter for table next to is to refill drinks and give us more wasabi because our server was not checking on us. 
Will not be going back."}
{"text":"Aabsolutely love this place! Price is good, food is great, and service is fun and helpful. 

My girlfriend and I frequent here quite often and have always been pleased with the quality of the food. 

I highly recommend ordering off of the grill. It's fun, fresh, entertaining , and extremely tasty. 

ABSOLUTELY LOVE THIS PLACE! Once again, fun environment, tasty food, great sushi, good prices, and sweet service. Make sure to see Cindy next time you''re in. :)"}
{"text":"By far my favorite sushi joint in Henderson!!!! I'd recommend this place to anyone!  The sushi is always fresh and the chefs  and waiters/ waitress are fun!! It's such a chill place!   We have even had shots saki shots with of sushi chef!!!  white tiger roll is amazingly good! Did I mention they have a half off sushi menu!!!! WHAT WHAT????"}
{"text":"The sushi was nasty and the fried ice cream tasted a little like onions. I love avocado, but it was smeared all over everything and dulled the flavor. The service was also extremely slow and I had to ask another server to retrieve my waiter. I was not impressed."}
{"text":"Had dinner with a large party handled us well will defiantly be back. 
Cindy was fantastic."}
{"text":"This place is disorganized. The food is gross. The hostesses?, I guess have know what they are doing. I was seated three times. The salad is so watery.  Salad spinners cost $10. If I was a British chef with a tv show, I would be yelling at the top of my lungs right now."}
{"text":"We have been coming to this place from 2005 and it has been always great! They have never changed the food quality over the years and we appreciate that. My kids have a great time with the cook show and we enjoyed our dinner all the time ."}
{"text":"Food was good, we had teppanyaki. It was lunch time but no discount for lunch. I think the bento boxed meals are a good price but the teppanyaki was expensive. Enjoyable atmosphere. .I will go back."}
{"text":"The sushi here is fresh & tasty, which is hard to come by in the desert.  Excellent prices and fun roll combinations.   Service has been fast & friendly every time @ the sushi bar."}
{"text":"Sushi wasn't that great. Sticking to Goyemon next time. The restaurant itself is dirty. The frame above us was covered in dust."}
{"text":"Place looks great with their warrior suit decors. I had the all you can eat sushi on a weekday for $26.  I like their selection of sushi.  What I like best is their portion of sushi ismall, which means more meat than rice.  Every sushi roll I ordered was great.  Only thing is the batter on the tempuras was not the one I'm used to,so tempuras came out average.  Other than that, my ice cream came out great,  big portion !  I would eat here again!"}
{"text":"eaten here a few times, enough to have a consistent opinion, and that is, unless you want JUST sushi, which is good, don't bother. abysmal \"service\" and upcharges for days. we came in at 2:35 and in an empty restaurant, waitress wouldnt let us order lunch that ends at 2:30. we wanted to sub the cali rolls that come in bento boxes for simple cucumber rolls-- LESS ingredients and no protein, and they wanted a dollar upcharge to do that. freezer burned tasting rice. kitchen staff picks the pandora playlist so it's always random punk rock or other crap not conducive to dinner conversation. just a strange place. not worth going except for a quick $6 sushi roll lunch."}
{"text":"Good service and good food but they over cooked all of our steaks but overall nice place."}
{"text":"Love the Samurai here at home, so last week was in Vegas and took my niece to Samurai last week for 50% off sushi.  The sushi was awesome and the staff was great, very friendly and attentive.  The restaraunt was nice and clean. Bruce is the best teppanyaki chef!!!!

If you have not been, you need to go!!"}
{"text":"Try the poki salad on seaweed.  Delicious! Plus our server Cindy was attentive. When we said we loved the green tea, she brought us a couple of different samples of leaves and powder to try at home!"}
{"text":"Well prepared shrimp and scallop hibachi. Beef and vegetables very flavorful. Nicely seasoned. Lobster and butter mmuuahh! No complaints."}
{"text":"The only reason I am giving this 2 stars is because I love their sushi. 

Have been here a few times on my lunch breaks from work, always order to go. And I am obsessed with their sushi. Well I took today off work and my 6 year old daughter wanted sushi so I thought we would go and sit down. When I arrived I noticed the servers were a bit busy so we waited. About 15 mins had gone by and we were never acknowledged! I told my daughter we would wait 5 more minutes but then I noticed one of the servers sitting behind the bar watching the soccer game! I was so fed up that we walked out and when we did I yelled \"terrible service\" I will never go back here after that although I love their sushi. We ended up going to Momo Sushi on Stephanie and it was pretty dang good! So I recommend not going here unless you want terrible service!"}
{"text":"Best tepanyaki in Vegas I've had! The flavor is a little different (better) than other places I've eaten, you get more food and the staff is great! By the way, it's a bit less expensive than ALL the other places I've eaten at and the sushi is good too! 
I love this place."}
{"text":"My family decided to come here a few Fridays ago around 8 pm for AYCE sushi based on a recommendation from a friend, there were 5 adults and a child.  The sushi was absolutely delicious and was a fan, but the service needs some serious work.  We waited 10 minutes before our drink order was taken and another 10 mins to receive our drinks.  Once we ordered our food it cam out pretty steady.  And then our waitress disappeared.  We were ready for dessert and the check and waited 30 minutes before we saw here again.  She then came over and asked if we wanted desert and again disappeared for another 15 minutes.  At this point we were ready to go and just wanted our check.  I understand it was  a Friday night but having to wait that long to pay or receive desert is ridiculous.  Will try again because the food was great, just hope they are working on their customer service issues."}
{"text":"Horrible HORRIBLE waitress. Mari M. on Saturday night, I arrived late to join a birthday party that was already in progress.  She gave me attitude from the moment I sat down, asked me if I was going to order food and was irritated when I said yes, immediately asked me what I wanted without even offering me a menu so I could see what was available.  She then proceeded to tell me if I was going to order food she'd have to move me to another table, had no regard for the fact I was with 7 other people that were there for a birthday party and wanted me to move to a table to eat alone.  The chef had NO problem adding my order to what he was already cooking, but she had an attitude the entire remainder of the meal, it took me 3 attempts to get her attention just to order an ice water - 20 minutes after I had sat down. I apologized profusely for the inconvenience even though the chef told me to stop apologizing and there was no reason for her to be treating me the way she was.  If the chef is okay adding the order to what he's cooking on the table the waitress should not have an issue.  Chef was amazing, food was amazing and the waitress was awful.  The only reason I tipped was because I didn't have any cash on me to give directly to the chef.  She made me feel like I was an absolute horrible person just for showing up late which was out of my control."}
{"text":"This place rocks. My best good friend and I come here all the time. Cindy is always cool she recognizes us when we walk in. Awesome sushi for a good price."}
{"text":"My favorite sushi restaurant in Las Vegas/Henderson! We usually do the AYCE, which is reasonably priced for great, fresh sushi!"}
{"text":"We came for the AYCE. Pretty good selection to choose from. Friendly and helpful wait staff. We tried different rolls and was recommemded the sexy girl which was yummy. We came for lunch and there was no wait. By the time we left the lobby was full. Looking for a regular sushi place. May try again."}
{"text":"I ate on the teppanyaki side...so disappointing. The show was entertaining and the chef funny - but that doesn't make up for the lack of seasoning on the food. I had the chicken and shrimp with fried rice. I've heard the sushi is good...if I go back maybe I'll try that side next time."}
{"text":"Best Hibachi food ever! Chef Ken was the BEST!! He has a hilarious sense of humor and cooked the food to perfection! I'm from Dallas, TX and eat hibachi style restaurants often. Hands down the best! You won't be disappointed!"}
{"text":"This is my favorite sushi place in Las Vegas. By far. 

First, the atmosphere. It is a large standalone building amongst small stripmalls, so it feels like your going into someplace special, and you really are. The place is great for dinner on a Friday night. There's a large bar, three teppanyaki stations, and a large sushi bar as well. It's very entertaining setting! I much appreciate variety in music at restaurants, and they have a nice pandora mix playing usually. 

The sushi! My gosh, THE SUSHI. The best I've had in the Las Vegas area. It's my second favorite sushi place over all, only to Blue Nami sushi in Folsom, CA. I moved to Vegas when I was young and have struggled to find a sushi place that compared to Blue Nami, but this one blew me away. The fish melts in your mouth, it's so fresh. The sizes of rolls are perfect, and their unique variety is refreshing. They have at least 35 house rolls. I've tried most. All were delicious. 

The ONLY THING that gives this place a 4 star instead of 5 is the service. I love all the servers there, they are kind and outgoing, and the teppanyaki chefs have wonderful talent and are great performers! But, the service speed and attentiveness is spuratic. Some nights, it's perfect, the best I've ever had. Other times, if it's really busy or something maybe, it's slow and unattentive. We will give our drink order and not see the waiter/waitress for another 30 min. Or I'll ask for a refill 2-3 times. Those nights, the food takes forever to get out of the kitchen. And it's rarely all dishes at the same time. 

Besides the occasional service slip, this is a 5 star restaurant. It's my favorite, and my regular spot and the only sushi place I'll eat at now. DELICIOUS. Try this place, you won't regret it. (:"}
{"text":"My boyfriend and I went there for lunch one day and we sat at the sushi bar. The service was impeccable, the sushi bar attendant was consistent in asking us how we like our rolls he had made for us. He was happy and friendly. He gave us some recommendations and they were all very good. The outside makes the place look average but once inside the decor is up to date and really nice. It definitely doesn't feel like some of the mom n pop places I have been to before. We will most definitely be back again soon. 

** TRY THE LION KING ROLL** 
Delicious!"}
{"text":"The first time I came here, it was fantastic. The second time wasn't bad, but not as great. This third and last time was just downright disrespectful. 

It took a few minutes for the waitress to seat us, not sure why, they were completely dead. It took about 20 minutes for her to come by with the ridiculous paper for your all you can eat sushi. After we ordered 4 rolls to start we literally waited 30 minutes for them to bring us two rolls. No one came by to check on us, we had to wave over somebody. After we told them that we had been waiting a while, the man left and said I'll go check on your other roll. Another five minutes go by.. 

We just paid for the three rolls and left. 

It was horrible service. Never again."}
{"text":"First time here, have to say I am amazed. The experience of cooking your own food, the Lychee Martini is amazing, I'm not a fan of drinking but this is so sweet!!!! Our server was great, never went empty on our sides, drinks or meat and she was really fun ask for Alodia was great sweet girl ask for her"}
{"text":"Found this place by chance. Driving by and was hungry... wife and I ducked in to see a new sushi place and how the prices were against other local hotspots.  We were pleasantly surprised to find a very extensive menu for those that are price-conscious sushi eaters as it can get expensive fast.  Great service... always welcoming, more than happy to accommodate guests. So good and friendly I ordered pickup sushi on way to hospital to have baby.... yeah, they are very into pleasing customers with fast, courteous service  and ALWAYS with a smile."}
{"text":"This is the best all you can eat sushi in place in Henderson!!! They have a very good selection in the menu to choose from and quality of food was great. Definitely somewhere I'd come back to."}
{"text":"Service is quick.  Food is tasty.  Only one complaint, the sushi roles are loose and fall aprt more than often.  Not sure if its because of who was working that night or the usual problem."}
{"text":"Reservations at 7:30 for my daughter's birthday 7:30 comes and goes not even a word from the staff that they are running behind at 7:45 I ask when we are going to be seated I am told it's going to be another 15 to 20 minutes. They were seating parties that were not complete which is supposed to be against their policy tying up the tepanyaki tables. Absolutely the worst customer service they offered to seat us in the dining but told us we couldn't order tepanyaki only bento and sushi used to like this place but they made my little girl cry on her Birthday I will never step foot in this restaurant again"}
{"text":"I will not be returning to this place. The customer service was horrible and the sushi was just ok. The waitress got our order wrong and also forgot to put in my order for a spicy tuna roll. When we brought it up she didn't even apologize and just gave us the check.

Not wanting to spend more money in that establishment,my husband and I promptly went to Yummy Grill down the street."}
{"text":"Dined in this evening at about 7:30. There was a short wait at the door and the place was busy. Got sat about 10 minutes later. It was my first time in and didn't know what to expect. I was pleasently surprised to see a few tepenyaki chefs working their magic. I should have chosen to sit and enjoy the show. I wanted a more intimate experience with my gf so we decided to get a table. We were sat at a high back booth and it was private, exactly what I was looking for. We started with Gyoza and spring rolls. Not too pleased. 2 super tiny spring rolls for a high price. We also ordered 3 rolls of sushi to accompany. Our appetizers showed up quickly and then 40 minutes later still no sushi. I then ordered 2 more rolls that never showed up until I had to flag down my server. My original 3 rolls never arrived but the 2 I ordered afterwards finally arrived after speaking with my server. We spent an hour and a half waiting and left unsatisfied and hungry. By the time we were \"finished\" the restaurant was almost empty...I don't understand how you can forget 5 rolls of sushi...C'mon! I will try this place again. But this time maybe not stuck in a corner. We will try the sushi bar or will sit with the tepenyaki chef. It seemed everyone else was well taken care of. 1 star"}
{"text":"Went here for lunch one time, a friend recommended it. Our party got to the restaurant at 11 am but the hostess was kind enough to let us in and order. We sat at the bar and the food was good, it was both filling for a lunch and it was half price. The only other place I know that does that is  Kobe sushi. The sushi was average but it's definitely the place to go when you want sushi but not hungry enough for All You Can Eat. It's a great lunch place, sushi quality is very similar to Kobe sushi. A way better choice than eating grocery store sushi!"}
{"text":"I'm a regular at this restaurant. The food is consistently delicious and the portions are HUGE. I love the service and the atmosphere. Some chefs are better than others but its always good. Check this place out!"}
{"text":"I love this place.  The sushi is absolutely delicious.  I am part Japanese and very picky when it comes to freshness in fish and this place is as good as it gets.   The servers are all very nice.  I especially like Cindy.  We are regulars and she makes a point to come over to say hello even if she is not our server.  It took us a while to find a nice sushi place close by, but now this is our go-to place.   MMMmmmmm"}
{"text":"This place is awesome! Great food and service..my wife and I liked sexy girl and shrimp roll (tempura) can't wait to come back!!"}
{"text":"Everything was fantastic! Service was great!  Really enjoyed introducing sushi to my BF we will definitely be back!"}
{"text":"The service here is great. Our usual server even remembers our names and likes/dislikes when it comes to our orders. The price is also very cheap for sushi. I highly recommend his place for sushi cravings on a budget!"}
{"text":"Decided to give Samurai a try. Worst decision ever. The Host sat us at the grill and 5 minutes later told us it would be a 45 minute wait for a chef. We were given the option to sit at a table and just order off the regular menu, so that we could receive our food quicker. I took this option and 15 minutes later, not having received any beverages or any kind of service. I opted to just leave. I mentioned this to the Host on our way out and he acted surprised. After further consideration, us leaving was probably for the best. Seeing as how no matter where I stepped in the restaurant the floor was sticky and had an overall dirty appearance. I will never return!!!!!"}
{"text":"5pm with only four other tables, the kitchen was really slow. 2 rolls took 10 minutes, which wasn't bad. However, the chicken bento box came out 20 minutes after we ordered and the Nabeyaki udon took 40 minutes. The person who ordere the rolls and the person who ordered the bento box finished eating and had to wait for the the third party to finish the udon. The manager was insincere about the wait and as we lef didn't even acknowledge us to say goodbye."}
{"text":"Took my family of five to have sushi here tonight and our server has to be thee best server in Vegas! AKIKO is her name and she's attentive, sweet and clean! The manager was awesome and noticed we don't like Japanese mayo so he told the chef's to make sure nothing with mayo goes out. Attention to detail. That's what separates this place from the rest. I do recommend making reservations because it can get packed. This is our family spot. Thank you guys!!!!"}
{"text":"I gave 3 starts because the food is decent.  Service is bad though.  Unorganized, short-staffed, hectic.  Not terribly polite and not trying too hard.  For a city like Vegas, they have a lot to learn about customer service.  Someone needs to sit the staff down and educate them on customer service - maybe a few seminars would be helpful."}
{"text":"Location easy to find. Liked the ambience setting. Service was ok. Food was decent. The jalapeño bomb was delish! Had ayce and I was stuff.  Couldn't order much sashimi for ayce and limited order for fresh shrimps and uni. But I guess that's typical of ayce sushi. 

Probably would come back to try more, especially the ikka nigiri :)"}
{"text":"The best Japanese restaurant in the area! Always the best food no matter what you try, and a very friendly attentive staff. I great spot for date night or groups. The chefs are always entertaining and I have always left satisfied and too full for my own good"}
{"text":"Love this place...been going here even when they were still Fukuda. Like this place better than Benihana's or other Teppan place in the valley and price is quite fair. I always leave this place stuffed. Great teppan and sushi!"}
{"text":"Outstanding!! Food was delicious. The service was excellent. And the chef was a lot of fun. I would definitely go there again."}
{"text":"So I was recommended by a few close friends of mine to eat here. I'm a sushi lover so I gladly agreed to trying a new sushi joint. Now, I've been to a number of sushi places and I've gotten to know what is normally good and bad sushi, as well as what the prices normally are for all you can eat. Long story short, loved the sushi and the large amount of options available but did not like the amount that the total came to at the end. Never in my life have I made more than $30 for all you can eat sushi that was this far from the strip. Now this is somewhat my fault for not asking the price beforehand, however, there was no place that showed the price which rubbed me the wrong way. Would not recommend this place for all you can eat. Sushi wasn't bad though so I would recommend for that."}
{"text":"My all time favorite sushi place!! Been coming here for 5 yrs!! Worth the drive!! The staff here is very friendly and loves when my bf and I come in to eat, whether it's at the sushi bar or tempayaki (however you spell that) I highly recommend this place!! I think it's better than Osaka.."}
{"text":"My absolute favorite place to get sushi! I come here at least once a week and have never been disappointed with the fresh taste of the fish or the friendly staff! My favorite rolls would have to be the Mexican and Sexy Girl! I have also had their hibachi, which is amazing! Have been to what seems like hundreds of sushi places and NOTHING beats Samurai! Oh, and half off prices on rolls?! I'm in!!!"}
{"text":"This place have good sushi and great customer service..I will go back to eat there again"}
{"text":"Their rolls are very reasonably priced so we went ala carts instead of ayce. Ended up being $35 instead of $42(2x$21 ayce) and we both left quite full. So either route is a good value. 

Rolls were tasty. Took a little long to come out with restaurant almost empty(we ate at a weird time 2:30pm so no reflection on them, we've been there at night and they're busy) we got the Lisa Lisa which was yumm, and something wrong which was spicy and yumm!  Great place when you're on that side of town for sushi and teppanyaki!"}
{"text":"Worst customer service experience ever. Went to pick up a to go order. They said it would be twenty minutes. Went there 20 minutes later and they said it would be another 20 minutes. Ended up waiting a total of 45 minutes for a to go order. Absolutely ridiculous. Then I got the order and it wasn't even right. I ordered 3 sushi rolls. Only ended up getting 2.  They should have a least offered a discount or been more apologetic. Pretty sad for my first experience there. Will definitely NOT be going back!"}
{"text":"It's good food for a great price. My favorite hibachi"}
{"text":"Always passed by this place many times on Sunset & finally got a chance to try it awhile back.  Nice place but just a tad bit too dark in there where you can barely even read the menu (where we were seated anyway). Nice people tho.  But if you're super hungry, NOT really a good place to go as they take SUPER LONG to serve the food.  Sorry to say. There wasn't much people in there either when we went.  I had my 3yr old daughter w/ me & my hubs & even she was complaining of how hungry she was.  =( The sushi was good though but I must say I had better.  Went in for AYCE sushi.  I believe it was about $20 per person. I still would go back & try it again.  Hopefully I can do a better review update for them."}
{"text":"Food is good but service has been slacking , been there many times and seems to be getting worse. Hopefully it will get better."}
{"text":"The best sushi in Vegas.
Yummy!!!!!
I took my family here for my son's birthday.
Jack is awesome ,always come back for more!
Great service and good food!!!"}
{"text":"Talk about a perfection on a plate! Our chef was a cool dude with a bunch of cooking tricks and oneliner jokes. Cool guy Forsure. The real prize is the food here.. I cannot put enough emphasis on PERFECT. Solid portions as well.. Coming again when in the area.."}
{"text":"The dining experience for me has been really great out of any time attending teppanyaki. The people have been very interactive and very helpful in picking my food preference since this was my first time going to this kind of place. I highly recommend that you all should try out this place and you will not be disappointed!!"}
{"text":"Went in by myself the other day.  Was ok.  Sushi was good, service was good. I was the only one at the bar, still had to order on paper, but that was fine, just silly.  Nothing to really write home about.  Overall ok, I just wont be back.  I"}
{"text":"We took our 2 year old here for a fun Sunday night dinner and were absolutely impressed. The cleanliness, the service, the atmosphere and most importantly the foooood were all incredible. Half price Sushi all day.. and Sapporo on draft! We'll be back!"}
{"text":"Had a great time celebrating a birthday the other evening. Service was great and the hibachi chef was entertaining. He was so nice and humored all our questions and kept making us laugh. The price seemed right for the amount of food and it was all delicious. The waitress was so sweet and hilarious as well, doing her own little funny dance when she brought the birthday guy a dessert and we sang him \"Happy Birthday.\" 

The group I was with also mentioned that they have a notable sushi menu, but I didn't have a chance to try it. I will have to next time!

The only reason I'm not giving 5 stars is because I don't remember anything major that set them apart from other hibachi restaurants. If you want a solid, good hibachi time, definitely go here. I will, so I can avoid the bigger more expensive ones on the strip."}
{"text":"This is the best Japanese Steak House in town, their servers are super friendly. Manager Jack stopped by at my table to make sure my food was cook to perfect. 
I was seating at a booth but was able to see the cooking show from Teppanyaki Chef across from my table. I will definitely go back to have Japanese Teppanyaki there!"}
{"text":"This is one of my favorite places to eat. Everything here is amazing, not just certain meals. You can get a meal with steak, fish, fried rice, noodles, a few rolls, salad, soup, etc, for about 14 to 20$$ and it is a really good meal the will fill you up. You can also get sushi, it's reasonable priced. You can get all can eat for I think about $26 or about $23 for lunch. The sushi is amazing. Only one place has better sushi in my opinion and that is Yama. The staff here are very frigidly and nice. It's a really fun environment."}
{"text":"I have had nothing but amazing times here!  Happy hour to family or birthday get togethers. The service and atmosphere is fun and inviting and the food.... DELICIOUS!  Chef Ken is one to ask for when doing the grill!!! - his personality shines with different people and is a party each time I have been there. He prepares your food to perfection and you leave full and with a smile. My favorite spot to go!"}
{"text":"This place is now my favorite, go-to restaurant for just about every Japanese craving, whether it be sushi, steak, or even teriyaki chicken. We've been here multiple times and been seated at both the cooking table (amazing!) and a regular table. All experiences here have been great. The service is really good and friendly, and the cooking table is a great, fun show. But the real winner here is the food! My girlfriend is a big sushi eater and has loved every bite here. I'm not as adventurous and so sometimes get their teriyaki chicken or salmon bento boxes, which are delicious! Most sushi restaurants (understandably) do not serve good \"alternative\" options like chicken which are almost always fatty, gross dishes. But not here! This is the only sushi restaurant I've been to that is spot on with every dish; even the kids' menu! A must-eat in Henderson and worth every penny."}
{"text":"The chef Geo was Awesome!......but the guy who took our order was rude and and not friendly. The food was delicious"}
{"text":"Tried a new Japanese restaurant because we like to support new businesses. We were seated in the nearly empty restaurant, waiter said he'd be right back.  Ten+ minutes later, I went looking for him. Said, I'm sorry, we're in a hurry, can you pick up the pace? Food took half of forever and my dinner partner's meal was inedible. Mine was below average and left me feeling queasy.  Once we got the check, the waiter never came back for my credit card. I carried the check to the register and watched the waiter nearby, before he disappeared. Turns out, he saw that I was not at my table and ran into the parking lot to catch me.   Eventually, he returned. I said, Were you looking for me in the parking lot while I've been at your register?   I give this restaurant less than 6 months."}
{"text":"Had such a great time! My brother and his girlfriend go here all the time. I finally tried it with the rest of my family and everyone loved it. Our server was very funny and accommodating. We went for the AYCE and definitely left full and happy. Overall, good food and super friendly staff."}
{"text":"Anytime I can get all you can eat sushi, I'm a happy camper! The service here was excellent and for $27 AYCE sushi the pricing isn't bad either. However, this place is getting a 4 because the sushi could have been better. Although the ambiance at Blue Fin isn't as nice as Samurai, the freshness of the fish and the flavors of the specialty rolls were much better."}
{"text":"After a long day taking care some personal business I found this place at omg I will go back anytime for fresh sushi on the bar look who they made it so economic and I will recommend the all you could it but if not to much hungry it's also good"}
{"text":"If I could give zero stars, I would. We have been to this location three times. We have had seating issues each time at the teppanyaki table but this time took the cake. We called and made a 7:00pm reservation for five for a birthday dinner. We arrived at 6:50pm and was seated literally behind the chef. We said that we would prefer to wait for the next table to open because we were all crunched together behind the chef. 

They seated us approximately 15 minutes later and took our orders. They brought the soup, salad and drinks out, with no issues. The chef then comes and starts cooking without any type of introduction of himself at all - no hello, no order confirmation, nothing. The only word he spoke is to ask angrily \"do you want garlic\" as he was making the rice. I'm not sure what his issue was, but he definitely had one. I was appalled since you come to these places for not only the food, but for the show too. I'm assuming that he was upset regarding the seating issue that we had although I really don't understand why he would be upset about that - it really had nothing to do with him. 

I have never been so uncomfortable in my life having someone who who was obviously pissed off cooking my meal and slinging bowls of rice at us. The rice literally took 3 minutes to cook (which if anyone is familiar with teppanyaki, they spin the eggs, toss the eggs into the hat, do the heartbeat, etc...) literally NONE of that was done and not a word spoken to us. 

It was a very uncomfortable situation, and we actually walked out. We will not return to this location and I am writing this review at Geisha Steakhouse where we have been treated with the utmost of respect and had a very, very nice dinner. 

We won't return here and I will tell anyone and everyone I know to stay away."}
{"text":"With an almost empty restaurant we waited for over 45 minutes for our food to be started at the grill. My husband ordered a diet Dr Pepper, the waiter said no problem we have that. My husband was brought a regular drink. Noting the difference we asked another server that said they don't carry the diet version. The cook got my order wrong, giving me the wrong protein. Our cook chef Ken spent the entire time ignoring my husband, my father and myself to flirt with a woman on the other end of the grill. My father asked me why I wasn't eating the fish that I normally ordered, when Ken overheard he snidely said \"what you're pregnant\". To which I replied \"I am\". No congrats were offered or anything. Being as this was literally the only thing he said to us the entire time other than \"how do you want your steak done?\" I found it to be extremely rude. We won't be back. If I could have given them zero stars, I would have.

The owner himself has contacted me trying to rectify the situation. I appreciate this being that I understand one employee should now ruin an entire business. So I am adding a star for the owner's customer service."}
{"text":"My fiancé and I visit this restaurant approximately two to three times a month. The sushi is very fresh and we always receive the best service. The Japanese lasagna is my favorite!"}
{"text":"Really this experience deserves a -1 star review the only reason why I'm giving it 2 stars is because I came in once before and my server was great and the food was ok for the price and convenience. Unfortunately things have drastically changed from the last time I was here. To start the minute I walked in with my daughter it took a few minutes from the guy up front to even look up and acknowledge us then he just took off expecting us to follow him to the table without saying anything. Next it took 15 minutes for someone just to come to the table and say hi and take drink orders. I figured it's ok it looked like he was by himself and had a couple of tables I decided to be patient and giving it a chance. After waiting another 5 minutes for a water and a sprite. I finally see the server coming with our drinks but then stops puts the drinks down 5 feet away from me picks up food for the table next to us and just carries on. meanwhile another 10 minutes go by and I'm still just staring at my drinks from a far. Now I see there is another server working. A guy who came in 20 minutes after me gets seated and water within a few minutes and the final straw is when the other server walked by my table and drinks sitting on the counter twice and nothing said or done. At that point I.just got up and left WORST SERVICE EVER!"}
{"text":"I always order vegetable rolls at sushi places. The past 5 times I've been here I was always charged $2.50 like their avocado or cucumber roll. Today the charge was $4.95. I asked why - it's a special roll, not on the menu (like every other sushi place I've been to). What about the 1/2 off cut rolls all day - \"only applies to those on the menu, not special rolls\". So while I was going here when in the area, they have lost my business."}
{"text":"This place is a local favorite! The food is always fresh and very affordable, I've been coming here for a few years now and I would highly recommend stopping by whether you're just visiting the Las Vegas/ Henderson area or a local."}
{"text":"My husband and I came at 815pm on Friday night on a last min date night dinner. We were seated with 2 other parties at our hibachi, very friendly ppl. Service from the hostess was good, our chef was great as well. Food was REALLY good and cooked to exact specification. There were two small children in one family and the chef did a great job entertaining them. There were a few other ppl that visited our table (they cleaned up our plates and got us refills) and their service was fantastic, prompt. Excellent customer service goes a long way for us and I am so pleased we came here for our one night out without the kids. My husband rarely enjoys himself when we eat out and he was very pleased with the food and experience. Coming back for sure."}
{"text":"My husband and I tried this place for the first time tonight. My tepanyaki was amazing. My husband had sashimi and loved it. The pieces were a little small and the menus were sticky, otherwise I would have given it 5 stars."}
{"text":"I made reservations for 2 at this place for Friday night at 7:30 for a table. We got there at 7:20 and the hostess says, \"Your table is almost ready. The couple is just paying and leaving.\" So we waited...and waited...and waited. It was now 8:15 and we were still waiting for a table. Many people kept coming in, waiting and just leaving. The service is terrible. I can't rate the food since we never got a chance to try it out."}
{"text":"The service was really great. Everyone is super nice here. But, the sushi was just ok. I have higher expectations than most when it comes to sushi. But, in my opinion, it was mediocre."}
{"text":"Throughly enjoyed my entire experience here at Samurai! Greeted nicely by the host and had a 15 minute wait for a teppanyaki table. The great thing about this place is a full-service bar! I'd recommend the Tokyo tea. They have three types of seating: teppanyaki, regular dining, and the sushi bar. 

After seating down, my friend and I ordered some sushi in addition to our teppanyaki meal. I ordered the Japanese lasagna because it sounded interesting and was pleasantly surprised by the taste. My friend ordered the Kamikaze roll, which was a fried California roll. Both roles were great, and will try the all you can eat sushi the next time I come.

As for the teppanyaki, the portions are huge! They offer fried rice and fried noodles in addition to your protein and grilled vegetables. My last name was Jack and was skilled and very friendly to the entire table. I had the New York steak and scallop combo which were actually cooked by Jack.

I would definitely recommend this restaurant and will be back again soon!"}
{"text":"The atmosphere is nice and SOME of the waiters and waitresses are nice and lively. However, on my last visit, (and I mean that in more than one sense) we were shorted three sushi rolls in our all you can eat order. I will admit, they were decently made, but being a sushi fanatic, I've definitely had better in Las Vegas. The mochi ice cream was also like plastic. I was definitely let down from the all the hype my friends gave this place. 2 out of 5 from me."}
{"text":"This time we sat at a table and had excellent service. My mom had the sushi appetizer and the hibachi NY steak with scallops and fried rice. The steak was super tender and delicious!!!! I ordered spider roll and spicy tuna which were both excellent. My dad had a few appetizers, the golden fried scallops, pork belly, and gyoza. Seriously everything was freshly cooked and delicious. I would definitely go back and sit in the tall female server's section!!!"}
{"text":"So this place is pretty chill. Its very casual, but nice. A good setting for a date or family time.  I came in with three of my room mates and we got all you can eat sushi. It was affordable and yummy.  A lot to choose from.  I would come again :)"}
{"text":"Best sushi in town!! Way to full to do a huge review. Get the dynamite appetizer! Expect a food coma."}
{"text":"The food here is pretty good. If you want to try something crazy I'd say go for the Monky Brain! It's a tempura banana with crab mix and hot sauce. It's delicious! The only problem I've had is that service is usually very slow and you have to give the server the stare down to get them to come over to your table. I have even had to raise my hand for them to notice me. And the last time I went the credit card machine wasn't working and it added almost an hour to our visit and the waitress didn't seem apologetic at all. But overall, the food is good, the sushi prices are low and it's a fun environment."}
{"text":"Good food at a decent price! For lunch we enjoyed different bento boxes. Staff was so nice to us even though we had a one year old with us. Definitely coming back"}
{"text":"Tried it for the first time with my husband and brother late on a Sunday night at 9:00. Nice looking place. Service was good. I had the dragon and the rainbow roll. They were alright. The role were small, bit ibdidnt even finish it. I wanted to try their all you can sushi deal but didn't know if it would be worth it. My husband got some fried rolls, he liked it. I want to go back and try the ayce sushi. It cost us $60 with tip."}
{"text":"My husband an I love this restaurant. The food is delicious and priced very well. Also, their customer service is very good. One of our favorite places to eat at!
I recommend the Gimmie 5 Sushi roll."}
{"text":"AWSOME place!!! Great food, great atmosphere, and great people!! The owner is extremely nice!! Visited with my co-worker and had a blast!! Definitely a place to visit!!"}
{"text":"First of, I don't usually give a three stars review unless I have to.

We went to Las Vegas for a family vacation and since this restaurant was technically within the same block as our hotel, we were like, hey why not try? Plus I saw the reviews that this place is a kid friendly restaurant.

Came here around 5 pm? I forgot exactly when but the place was not packed! The hostess asked us if we want to sit by the teppan or regular table and we instantly asked for regular table because we have three toddlers.

First impression when we walked to the table. The floor was sticky! It was so yucky but we thought since we are already here, we should just eat. I mean, bringing hungry toddlers out from a restaurant is like looking to start a war. 

Menu was big. We got confused because apparently they have a half off price going on and the server or the hostess didn't even mention it to us so we had to ask.

The portion was big though. I ordered beef teriyaki bento box and chicken katsu bento box for my kids. And since my kids don't eat that much, I was able to share it with the grandma. We did order extra cucumber roll and California roll. This foods were able to feed 2 adults and three toddlers.

My husband ordered 3 rolls and I another entree but I forgot what. Lol. Sorry I was paying attention to my kids more than anything. Again, no complaints here about the foods. 

My dad has a chirashi bowl. It was actually decent since they cut the fish thick. I mean compare to Chicago where everything is super cheap. Lol. However, I am not sure why they put the chirashi in like a regular plate and not like in a proper bowl. I do know this because my dad is a Japanese. Again, we did not complain or anything because the food taste good.

So yeah three stars because of the food taste and the portion. I had to take two stars because of the cleanliness. Will go here again if we ever in the area."}
{"text":"Went here at 8ish on a Friday night & the place was dead.  We were seated at the grill & were told it would be 20-30 minutes before we could order because our party of 3 was the only one at the grill.  Option B was to sit at a regular table & we could order from the teppanyaki menu there.  We opted for that so we could order faster.

So to start, the fried rice and the rice in our Firecracker roll was gross and way over-cooked.  If there's ONE thing a Japanese place needs to get right, it's the rice.  

Two of us ordered the filet steak, one medium-well and one medium rare - both were cooked WELL.  The third in our party ordered the NY steak, medium rare and it was also cooked WELL.  In addition to being over cooked, all of the steak was kind of flavorless and bland.

The teriyaki chicken was also overcooked and had a super bland flavor.

One of us got scallops, which were - you guessed it!  Over-cooked and bland.

Maybe the chefs are afraid of food poisoning and cook the crap out of everything, just to be safe?  I dunno, but over all I'd classify this food as merely edible and overpriced for what you get.

Oops, I forgot to mention that the service was non-existent.  Our waiter was pleasant, but I think we saw him maybe 2 times during our dinner.  We all left regretting our dining decision and mourning the small dent in our wallets :("}
{"text":"I always have a ton of fun at the hibachi table! Their cooks are so much fun and we always have a blast! We make it a point to come at least 2 times a year. It does get a bit pricy but it is definitely worth it! Sushi is also 50% off! You gotta try them out!!"}
{"text":"I love this restaurant ... It has the habachi on one side and table service on the other .... The food is delicious every time we come here :)"}
{"text":"omg, so good.  I had the NY steak and scallops.  The scallops were the best I've ever eaten.  They melted in my mouth like butter."}
{"text":"I was heading towards the strip in Las Vegas with some friends a couple weekends ago, when somewhere along the way we diverged from our path, took a wrong turn, and found this gem. We were too hungry to wait any longer and Teppanyaki sounded like a great way to start off our weekend, so we decided to go in. It was the best decision we made because it was hands down the most exciting (and not to mention most delicious) teppanyaki experience I have ever had thus far! There were some people at the bar and several other groups sitting at the other grills. The ambiance is casual and trendy, and the service is exceptional, especially our chef!! I so desperately wish I can remember his name! He deserves credit on Yelp. He was soo incredibly entertaining while skillful in the way he cooked our food. The four of us ordered a LOT - lobster (my personal favorite), filet mignon, grilled salmon, fresh sashimi, jalapeno bombs (a MUST TRY if you're into spicy!!), several side dishes such as miso soup (which was peculiarly tasty, much different from other miso soups I've tried in California), and salad, along with a whole lot of Japanese beers and sake. We all had a ton of fun as they led us on with loud sake bomb chants! Also, I can't forget to mention the special birthday treat. It was my 21st birthday so they changed the music they had playing into an exciting \"Happy Birthday\" song for the whole restaurant to hear. The curious attention of all the other customers were on our group. The waitress brought out some free dessert, and everyone had a birthday shot with me. What a great way to start off our weekend in Vegas. 

Sigh, if only this place were closer to where I live in California... 

We all thoroughly enjoyed our experience there and decided that whenever we choose to visit Vegas again, we will definitely be going back! No doubt!"}
{"text":"Stay away from the soft shell crab! Ordered the Crazy Philadelphia, while it was a heaping portion, it seems like they deep fried it to the point the rice was like mochi. Bonzai roll had too much ponzu sauce but other than that it was good. Gyoza and Creamy Shrimp was pretty good. Expected the Orange Crush to be good but the spicy tuna with lemon and salmon just didn't work together... overall was not impressed. Maybe again, maybe never again.....

To top it off, we asked to split the check and they billed it entirely on mine."}
{"text":"I love this place. The food is great and their prices reasonable . Great service .
You can get all you can eat sushi for a flat fee and it's more than worth it.
The head chef is a fun guy and will even make something custom for you.
I visit at least once a week."}
{"text":"So we have lived in this area for the past year and have driven past this place on several occasions and decided to finally give it a try after shopping on a Tuesday night 

We were pretty surprised that it was so busy for a Tuesday night so it immediately caught my interest. We walked in and were greeted by the host who gave us menus to look at because we couldn't decide whether we wanted a table, to sit at the  bar or at a hibachi table. We decided on the hibachi table. It's interesting to see the negative reviews on bad service because I ordered a iced green tea and my boyfriend a lemonade and our glasses were never empty, at one point the waitress even brought my bf two glasses of lemonade. So we each ordered a sushi roll as well as the teppanyaki meals one was the steak shrimp and scallops my boyfriend does not like veggies so we requested fried rice with no veggies while I wanted all the vegetables so he came out. Made sure who wanted what and made our meals separately while putting on a great show was very personable and our food was amazing.. 

So for two hibachi meals two drinks and two sushi rolls our bill was $77.. Very satisfied customers we will be back!"}
{"text":"We come here regularly for sushi (half off BTW!) and the teppanyaki grill! We find the service to always be great, the foods amazing, and way cheaper than Benihana. Who wants to pay more for food that's not as good and service that isn't good either? Not me!! It's a new regular spot for us!"}
{"text":"Part Japanese steak house for dinner and a show, part AYCE sushi. Go for lunch or order a la carte for discounted roll prices. Unless you're truly planning to put down half the menu, or you're only ordering nigiri, a la carte is your best option for sushi.

There's a good variety of fresh, baked, and shrimp tempura rolls. Unlike most AYCE spots, they're pretty light on sauces here and some rolls are pretty basic. Between a friend and I, we ordered 4 rolls to share. Three were tiny, and one was normally-sized, unclear why. Fish was fresh, and portions were such that adding on a soup and salad made for a complete meal under $20, which isn't bad at all. Their sushi isn't necessarily the best, but it's a great deal!"}
{"text":"Amazing sushi. Great prices. Excellent service. After trying many of the sushi place in the henderson area this place has the best quality, service and prices. Sushi was priced great and very fresh."}
{"text":"Service was great. Portions are a bit too big for both appetizers and sushi itself. I normally eat a lot of sushi and sides in one sitting but the rice-to-fish proportion threw me off. Besides that, great tasting food!"}
{"text":"This place wasnt terrible, but i dont know if i would beg to come back.

We arrived to an almost empty restaurant....and we were welcomed by a sign that said \"wait to be seated....including the sushi bar.\"

I waited for a few minutes,  and then told the person i was with that i had to go to the bathroom. While it was clean, it had an odd smell to it.

Finally,  after arriving and going to the bathroom,  we were seated at the sushi bar. 

We saw our waitress twice. 
When she dropped off our drinks, and when we paid the bill.... she told us to give our order to the chefs. I understand that this is part of sitting at the bar....but, we didnt even get her to refill our water.

The chefs, werent really personable.  Didnt talk to us. Thats part of sitting at the bar, isnt it? To socialize? They didnt even smile at us. 

We ordered a screaming o salad, orange crush, bonzai and the surf and turf roll.

The screaming o salad was wonderful. The fish was super tender , and the sauce had just enough zing with crunchy radish  underneath. 

The bonzai roll and the orange crush (with lemon slices) were okay, but not memorable. I prefer the Ashley Roll at Spicy Tuna in henderson....larger slices of lemon....which gives a lot more POP of flavor.

The shining roll for us was the surf and turf roll, which seared steak. It had just enough sweet and spicy. 

By this time, i guess someone the chefs, and other employees knew sat at the bar next to us...because even employees were coming out of the kitchen to talk to this lady. Luckily  for us, it brought another waiter to refill our waters... but then we were ignored even more by the chefs because they wanted to talk to their friend. 

We ordered a last minute hand roll.... which was just handed over to us.... it wasnt put in a plate, or even had a napkin underneath it. 

So, the food was okay, but the staff is just what crushes me. Like... i know im not your friend. ....but, I'd appreciate a smile. 

Thanked the chefs, paid and left.

6/30. 
Got a message from the owner, who told me that they have the lowest prices in town.... okay, well, I'd rather pay more for sushi AND be treated like a guest than pay less AND be ignored. If i wanted to be ignored, I'd  just do take out . 

Honestly,  it just felt like a bunch of excuses for the chefs not speaking to me.... Posted picture of the message.. your restaurant isnt the only restaurant thats busy...and believe me, your chefs  sure seemed 100% when their friend walked in!!!"}
{"text":"So good!!! My husband and I went there for the first time last night and we were so impressed! We sat at one of the teppanyaki tables and Jack was our cook! The prawns were amazing! Literally melt in your mouth! Best I've ever had! Everything was super fresh and delicious! We will definitely be returning!!"}
{"text":"Best hibachi I have ever had!! Wish it was closer. Great chef, amazing food, grat prices! You won't be disappointed."}
{"text":"Sushi was fantastic, service is even better, great atmosphere all around good experience"}
{"text":"Awesome place for teppanyaki and sushi cravings. This place is about 5 min. Away from my house which is perfect. 

They have Hawaiian seafood and I can tell that their products is high quality. Everything in the filet mignon, lobster, and shrimp had the right flavors. I recommend coming with a group of friends and having the chef cook in front of you. Coming back to try the other food next time."}
{"text":"As far as teppanyaki is concerned it was really good. Can't speak on the sushi since I didn't try it. They do have AYCE sushi for $26.99 though. 

 I got the NY Strip and Scallops while my wife got the NY Strip. Each order came with a decent portion of veggies (standard carrots, zucchini, mushrooms onions, broccoli), noodles, white rice salad (dressing was way too watery) and soup. 

The steak was cooked a little more well than I asked. As mentioned the salad was watery. The chef wasn't very graceful putting the food on my plate, kinda threw it at us. I'm totally down with them being funny but this was just more general sloppiness that I expect more from based on other experiences.

I think overall wasn't quite 5* but was really good. I would definitely go back."}
{"text":"I accidentally stop by this place and didn't even know they have all you can eat sushi. The quality of the food is impressive. Totally worth the price . The experience is such a pleasant surprise . I definitely come back again since it is really close to where I live so, I don't have to drive to China town anymore :)"}
{"text":"My usual go-to place for ramen and sushi. Love their tonkotsu ramen. I also had some all you can eat sushi with my cousins and for its price, it's very much worth it!"}
{"text":"Delicious! Very good choice of sushi, friendly staff. Yelp doesn't accept short reviews and I'm not capable of writing long ones. But the place Is really good."}
{"text":"My girlfriend and I love this place. The sushi is good, the chefs are funny."}
{"text":"I ate the sushi on first visit.  It was good.  But Samurai is really about the steakhouse.  They put on a hell of a show and the food is really good.  Certainly not the lowest price food in town, but for a tepenyaki grill it is really reasonably priced.  They also have one of my favorite saki's.  They have an unfiltered sake that you have to shake up.  The waitress is a blast.  Every time she comes to the table she shakes her whole body while shaking the sake.  Fun all the way around.  I recommend this place highly."}
{"text":"It's yet another AYCE sushi restaurant. It's fine, because I love sushi and everything sushi is great. However it's not my favorite and the place just kind of does the job. I felt like a bunch of the sushi was too \"Saucy\" aka slathered in mayonnaise, or just needed to be a little simpler. The service was friendly and everything came out in good time, but the ordering process is a little strange. If you're looking for AYCE I'd recommend finding that 4+ star place which they're a dime a dozen."}
{"text":"The Rainbow sushi here is DELICIOUS! I regret not trying the hibachi since it looked good and my coworkers said it tasted good too. This is a much try if you're in Henderson!"}
{"text":"I love finding a good teppanyaki place, especially when it comes with a great sushi bar to match! Without a doubt the sushi was the best part of the evening and I was blown away with how affordable the rolls are, even the specialty rolls! I'll be back just for sushi for sure!

The teppanyaki experience was good, but perfunctory. I didn't feel our chef engaged with the table as much as I am accustomed to. They had all the expected tricks and thrills, but he didn't seem very enthusiastic or interested in creating an experience for the table. I was celebrating an important birthday and the other group we were seated with was celebrating two birthdays and the chef never asked if anyone was celebrating something- a pretty typical situation for groups at this style restaurant. I guess along the same lines, nobody really asked; not the host when I made the reservation, not the host when we checked in, not the server. The host wasn't very personable during our few interactions; after being asked to wait for our table, he basically ignored us when we told him we would wait at the bar for our table and he wasn't very pleasant when he eventually seated us. 

All of the cooked food was good, but the steak was great! So tender and flavorful. The hibachi meals come with all the usual suspects- soup, salad, rice, veg, shrimp appetizer, but they also serve a simple noodle side with what I would describe as a light teriyaki sauce. 

Now let's get back to the sushi! We tried the \"I love yellowtail\" roll, because I LOVE yellowtail :)) and the baked lobster roll. I'm normally not this first one to pick a warm/cooked roll but went with it on my friends selection. It was the best bite of the whole night! Super rich, loaded with crab and lobster, and a crisp freshness from the cucumber. 

All in all, I will definitely be back for the good food and reasonably priced sushi, but the service all around needs to be a bit more polished and attentive to earn that 5th star from me."}
{"text":"We went here on Valentine's Day and I must say this is the best food and value I have experienced, ever!
The flavors were out of this world. You can taste quality and authenticity. 
I was not 100% in love with the plum wine but who needs it? They have great deals on beer and the food is so good!"}
{"text":"My fiancee and I went here for our 1 year anniversary - we absolutely loved it, this is my fourth time eating here and her second time and we can say hands down this is one of our favorite restaurants - we always sit at the teppanyaki table.  The cooks are funny and entertaining and the food is simply amazing.  Huge proportions, we can easily say this is one of our favorite restaurants for special occasions."}
{"text":"The food & atmosphere is great. But prices are outrageous. We spent over $100 on a family of four. Which did not include desert. They should offer discount pricing for locals. Or speciality coupons to help with the prices."}
{"text":"Love this place. We have been here for teppan and sushi twice in the past month. Definitely  will come again."}
{"text":"This restaurant is awesome. Went here for my birthday last night! & the service and food was amazing. Great experience grill side!"}
{"text":"I really love this place!! I mean this place encompasses everything I look for in a good hibachi place. Its inside of a mall and very easy to find along with lots of abundant parking.

The staff is really sweet and there is no limit of how many people they need to start the grill. If its only one person they will still start the grill. When I was there with my boyfrined they started the gril with just the two of us. When we finished I watched just one guy get cooked for by a chef. I think thats just great. 

The food was your typical Hibachi food and was actually pretty! FIlet mignon was soft and rice was served to us in abundance. Unlimited refills on soda and a reasonable price for a glass of wine. The chefs are really into it and they had different tricks I have never seen before at a hibachi restaurant. I really wish this place was not so far from the strip. It is approximately 20 minutes from Mccarran international. It was all in all a great experience. I give it a full strong 5 stars for great service, great interaction with the Hibachi chef and good quality food for value. 

Prices are very reasonable and your wallet will smile from the break yuou give it if you have the opportunity to leave the strip.

Decor is standard, nothing specail, but as long as the food quality is good and fresh and staff is friendly decor takes a back seat.

They have this creepy samurai statue when you walk in don't be alarmed. Little couch seating area kept us comfortable as we waited 10 minutes. Bathrooms are clean and they do also have regualr tables where you can just eat sushi and not have hibachi which I did not try. 

Great place! Go get some Hibachi!"}
{"text":"Stumbled upon this Gem when looking for another Teppan spot we visited in Vegas a while ago! I love Yelp! This was not the original plan; but glad we found it. It's in the parking lot of a casino. I give it 5stars for quality, price, and service. Try the cold apple Sake...I think it was called Hanan. For less than $90 we ordered...Sake, soft shell crab, lobster/scallops combo, filet/shrimp combo! Could never get all that at Benihana. Oh they let you create your own combo of it's not on the menu and their kids menu had a variety of foods (we didn't have kids with us; but my kids love Teppan too) Only area of improvement was the dipping sauce- ginger was too runny and I don't know what the other was. Can't wait to go back!"}
{"text":"I Have recently started coming to this place. im usually a sashimi person but this place has a great price on rolls! The fish is fresh and the service is great. if your a fan of salmon my personal favorite is the samurai spicy salmon roll. And the fire roll. They have great variety of rolls for everyones taste. I would Recommend trying if your in the Henderson area!"}
{"text":"As always, great service, great food, and great prices! Kevin was our sushi chef and he made the experience so nice . He normally is our chef , but we haven't been in for awhile . He remembered us, made us the best special rolls . And kept us laughing! Love this place"}
{"text":"We came Tuesday night for hibachi and it was great. The food is excellent the chef was good and entertaining. We always go there for sushi , this was our first time for hibachi. I had no idea how great it is and how good the food is . Service was excellent . Fast , friendly and attentive. Glory recommended great cocktails and also offered $3 more for fillet instead of steak and also offered Kobe so we all had fillet and lobster, Kobe and lobster which were great. Everything was cooked perfectly . Generous portion of food.We would definitely be coming back for hibachi."}
{"text":"This was the absolute worst sushi restaurant I've ever been to in all 50 states.  No one greeted us at the door so after 3 mins we sat ourselves at the empty sushi bar.  The chef finally came out, didn't  say hello, and when we tried to order something after 10 mins of waiting he yelled \"first come, first serve, you wait!!!\". It was the single rudest experience I've ever had.... After getting our sushi 20 mins later, which was made by a sous chef who didn't even know what a scallop hand-roll was we were given a roll without half the ingredients the menu stated it to have.  They didn't even apologize or warn us what we were actually receiving and the scollop hand- rolls had maybe 2 scallops finely minced and mixed with imitation crab which is what the cut rolls was filled with instead of the fresh fish we actually ordered.  I joined yelp just to write this review, that's how bad our experience was... Horrible service, horrible sushi and it wasn't even cheap.... Never go to this restaurant you will be severely disappointed and leave insulted!!!  If there was a negative amount of stars I could give, I would!"}
{"text":"Dining room service was too slow, didn't get napkins or plates and hot food took forever !! Bento box we're okay and rolls were good!!!"}
{"text":"Service ok, food greatquality, fresh and well presented. Had two cold beers and some apptrz it was good portions small but great qualiity. Service too casual but thats the culture. Def... be back to try full experience."}
{"text":"Hidden gem! 

A friend raves about this place and we finally went with her. It was slow, so I was nervous, but turned out to be a GREAT experience! Most hibachi grills are pricey. This one is reasonably priced. Our grill master was hilarious and showed us all tricks we hadn't seen at other grills. They were nice enough to allow me to only order sushi at the hibachi grill since I wasn't as hungry. I had a few bites of my boyfriend's and it was delish. I'll definitely return on an empty stomach. 

-Good sized portions
-Inexpensive sushi rolls (half the price of other places)
-Fresh ingredients
-Friendly Staff"}
{"text":"We stopped by for an AYCE sushi dinner on a Tuesday night. Wasn't very busy, so service was quick and friendly.

The soft shell crab, agedashi tofu and mussel appetizers were good. But the sushi rice was noticeably wrong. It was undercooked and wasn't flavored properly. 

Basically, the sushi was okay. There are better AYCE sushi places for the same price, but if you are nearby and are hankering for some quick sushi action, this place will suffice. If you are a little more discerning and can stand to drive a bit, do so."}
{"text":"I have eaten sushi and teppanyaki items here. 

the angry lion roll is good! (I think that's what it's called) 

hot sake is good here. 

service is a little slow. but they usually come if you're looking and trying to make eye contact. I wish they came to check on tables on their own. 

the grill food is great. 

okay be careful of one thing while sharing because I misunderstood and got charged! if you want to share a meal with someone, they charge you and give you extra sides while splitting the main portion. I don't really like that because I don't want two rices two vegetable sides two salads etc... I wanted to share one meal and eat sushi and have dessert, so that way I could have a little of everything. but yeah they charge you to split so don't split the meal. just order one as is and share when it's prepared to avoid the charge! 

helpful tip from restaurant owner and I will definitely go back and get my split now that I know!"}
{"text":"Good sushi bar excellent service ! Very fresh and tasty Sushi. Took my son and his girl Stacey  and we loved it Steak and scallops .yummy"}
{"text":"This is a true diamond in the rough. I must've passed by this place dozens of times when I lived in this area and I never stopped because from the outside it just seemed like it would be below average. My girlfriend finally convinced me to stop in one night and it was so good that we came back again 2 nights later. We had no idea they did teppanyaki! The first time we went, we just decided to get regular dishes- she got sushi and since I hate anything fishy I ordered the Beef Yaki Udon Bento Box. The portion in my box was a very pleasant surprise, and everything in it was delicious--especially the tempura and the salad (and I typically hate Japanese Steakhouse salads). The second time we went, we both got teppanyaki, and for what you get, you can't beat the price. Huge portions, the meat was cooked perfectly (I had the Chicken Teriyaki & Filet Mignon combination), and everything was delicious. The only negative thing was that our second time, the waitress didn't seem interested in serving us at all, so we rarely saw her and when we did, she was a bit standoffish. I give it somewhat of a pass though, because everything on the order was correct and came out relatively promptly. Highly recommend!"}
{"text":"Their AYCE was AMAZING!!! Great service as well. I'm from LA, and came down to visit family. I will definitely come back here when I'm in town."}
{"text":"I'd love to know if this is a nice place to eat. Unfortunately, I stood at the entrance too long waiting for someone to play host. No one ever did."}
{"text":"We had a reservation for 7pm on a Saturday night and were sat immediately. The waiter was on top of everything and the manager checked on us as well. The chef was very personable and the food was amazing."}
{"text":"This place was ABSOLUTELY AMAZING! I can't wait to go back here and have it again. Great environment, staff, and cooks. You won't be disappointed!"}
{"text":"This place is amazing! It's a little intimidating when you walk in, and when it's busy, it takes a minute to get a seat, but it is totally worth it! The staff is so friendly, and the food is some of the best I have ever had. I LOVED the sushi and definitley will be back for more. Their bento boxes have so much food and are extremely affordable. Their calamari is so tender and so absolutely delicious. I absolutely cannot wait until my next visit!!"}
{"text":"Very delicious rolls. Clean. Nice ambiance. And excellent prices. Definitely putting this place in my regular rotation of sushi joints!"}
{"text":"Love, love, love this place!  Been going there for a few years now, back when it was Fukuda.  The sashimi and California rolls are fantastic here.  I had the sushi bridge, and it was so neat, a little wooden bridge on a platter filled with some of the freshest rolls around, tuna, unagi, tobiko, and nigiri...For lunch we always get the bento box, which is a STEAL for 8.95. You get miso soup, salad, crab rolls, pork katsu (or salmon or beef), gyoza dumplings, and tempura shrimp and vegetables!  Rolls are always half off so we get a nice plate of spicy tuna to go with that bento box.  Oh, and the service can be a bit spotty at times, but no big deal.  Every server we've ever had there has been great to us, even if they were a little slow.  So, I recommend this place to anyone wanting some nice, fresh sushi or rolls.  I love Fukuda (Err, I mean Samurai), and hope you will too! Sayonara!!"}
{"text":"We go here for sushi because the a la carte pricing is good. But lately the place has been very dirty. Tables all over full of dirty dishes just left to sit. It's unappetizing, actually kind of disgusting to be surrounded by dirty dishes. The place was relatively empty, yet they had to clean a table for us to sit down, big left the rest dirty the whole time. Nice enough staff, but very slow service, and dirty bathroom as well. The sushi was good and the price was fair"}
{"text":"I went there with my kids because that place is one of our favorite dinner hotspots. We had very good experiences in the past when we went there. We all got waters to drink. The water was disgusting. Tasted unfiltered and there was little pieces of gunk in the water. The worst part is, the waitress knew it was disgusting water, but she decided to serve it anyway. After they served us the Badwater they took it back and gave us bottled water and said that the water was bad the end of the dinner tried to charges three dollars a bottle for the water we refused to pay and argue with the manager to get it removed off the bill the fan didn't work above where they were cooking so we are in a constant smokestack. The cook was a old Chinese man who kept dropping his knifes and cooked everything at the same time and burn the eggs and the fried rice it was disgusting but after our $48 dinner I decided I wouldn't go there again.  By the way if you decide to eat there ask for the Mexican chefs they cook the best and give you the Best show."}
{"text":"Absolutely the best Tepan Yaki in Henderson, right next to Sunset Station Casino.  I've been going here for several years (it used to be called Fukuda) and have always found the restaurant very clean and with excellent fresh ingredients.  I've never had the sushi here, but every time I go for tepan the sushi bar is loaded with people!

I could only suggest two things to improve the dining experience:  (1) Get rid of the fantastically bad music that is always playing, (2) Have the chefs offer to prepare cooked sauces (like Musashi on Paradise)."}
{"text":"Went there tonight 11/9/15 for dinner at 730pm.  Showed up early and was greeted by a very friendly host.  He gave us menus to look over while we waited for our hibachi table.  My daughter and husband had never been to a teppenyaki restaurant before and did not know what to expect at all.  I had never been to this restaurant before.  We are seated quickly and did notice that the plates were slightly soiled, but not anything major.  The grill area was clean.  We ordered two adult teppenyaki meals and 1 child teppenyaki meal, plus one sushi roll, an order of strawberry mochi, and 2 soft drinks.  Our server was quick and courteous and always seemed to fill the drinks at the perfect time.  The teppenyaki chef was funny, easy going, and put on quite a show for my daughter's and husband's first experience!  My family and I are not light eaters - but the portion sizes were enormous!  Standard teppenyaki comes with soup, salad, a huge mound of rice, 2 pcs of medium sized shrimp, a big portion of noodles, a nice size amount of vegetables, plus whatever meats you ordered.  Our daughter's meal was easily enough for 2 light eaters. All in all, we well be back again.  The sushi was delicious and we would come back for that alone.  All sushi was 50% off, which I gather is the norm. It all left a good impression and was reasonable.  Our bill was $109. We left 20%.  Next time, I'll be sure to bring extra cash for the teppenyaki chef!"}
{"text":"Best place in town for all you can eat sushi. My wife and I have been coming here for a few years now. Staff is friendly and great selection."}
{"text":"Great service and the food is amazing. Never fails to exceed our expectations. Hands down one of the best restaurants in Henderson."}
{"text":"Very good hibachi! love the fried rice and yum yum sauce"}
{"text":"Prequel: food is ok but service is HORRENDOUS. Came here on a Sunday night. The host looked stoned and clueless and told us 20min wait for a party of 4 around 730pm. The wait was actually 35min. Their waiting area is super tiny and crowded and they only have 2 seats for all the people waiting. Secondly their parking lot is a mess. The restaurant wasn't even packed for the size of the restaurant but there was limited parking. The parking lot design was horrible. You have to make a 3 point turn into the back lot where it ends in a dead end. We parked in the lot next door because the lot was a cluster fuck. 
After we finally got seated by Stoner Dennis the menace host who literally couldn't make eye contact with us and had no idea what was going on with the table situation, he has the nerve to ask if we want our table wiped. The table was dripping wet and had food particles on it. After he cleaned it with this smelly rag that he grabbed from who knows where he then started to fan the table with the menus to dry it!!! 
Fine we sit down cause I'm just thinking this guy is an idiot but then he passes us the menu and it is wet and covered in what looks like mas ago:orange fish eggs and sticky pieces of rice. My friends and I are hungry at this point to where it now takes another 10min to get water and then our waitress Jenny didn't even take our order. When she came back to drop off our water, she spilled the water all over the menu and instead of placing them down in front of each person she just put them in a pile and shoved it toward us as she walked away. I was pretty pissed at this point and even asked my friends if we should leave, but we were so hungry at this point we had given up. 
We ordered the bento boxes which came with quite a bit of food. Bento box tonkatsu and Teri chicken. The chicken was super dry but the tonkatsu was decent: fried and fresh. Not super flavorful but it came with a heaping pile of rice, California roll (tasted horrible), 4 pieces of tempura, 2 Goyza and a small bowl of miso soup, we also got 2 Ikura nigiri and 1 sake nigiri. It was also ok. I couldn't tell if it was fresh but one thing I did notice is the rice was too sweet for my liking. 
The best part of the meal was another waiter/bus boy Mel. He was so happy, introduced us and got us refills on water, any side extras and always came to check up on us. On top of that they serve Sapporo in chilled glasses which made this place tolerable. 
Overall horrible service and subpar Asian food. I don't understand why this place is rated as high as it is. One thing I can guess is this place is filled with non Asian people who don't know the difference."}
{"text":"Food and coctails from there bar were excellent.  Service was slow.  Pre-bussing plates and things off the table was never done and it created a bit of a space problem at the teppan grill for us trying to eat around dirty plates.  Leftovers were fantastic and I would call this an excellent meal for the price."}
{"text":"We love hibachi so anywhere we travel, we always go to one! We were staying at Lake Las Vegas and this place was not too far from our hotel so we gave it a try. We were a party of 5 and got sat at the grill within 5 minutes (around 7:30). That was great because we always have to wait at these type of grills. We all ordered hibachi and I also got a roll (Washington). The roll was nothing to write home about, tasted fine, was kind of falling apart, and I wasn't impressed with the size or amount of fish on it, but it was decent. The hibachi was really good. I got shrimp, my love got steak and shrimp and the kids both got teriyaki chicken kids meals. Our chef was great and really friendly..I didn't get his name but he said he was the head chef and had been there for years. He was really friendly, there was also a younger child at our table who was afraid of the fires so he made them small and kept making sure she was ok with it. I thought that was awesome at how accommodating he was to the other family. He made sure to involve everyone at the table and most important-he made bomb ass food. He also made us a special spicy sauce that was really good. Prices were a little cheaper than hibachis were used to (in Cali) so that was good. Overall I would recommend this place! Good service, good food and a fun atmosphere!"}
{"text":"My parents & my aunt recently took me here after we went tile shopping for my new house. I had the tuna roll sushi & the mushroom broth, which were both delicious. 
It was also amazing to see the chef cook our food in front of us! I will definitely come back to this place for either lunch or dinner! Highly recommended."}
{"text":"I been in this place twice. The first was two weeks before mother's day and the second was two days before mother's day. I ordered AYCE both times. 

The first time, I forgot to say to make the rolls half order, as I assumed the waiters would know that from my previous experiences with other AYCE establishments (Yama, Twister, Sakana, etc), but then all my sushi rolls came out in full orders. I knew I had to finish them all, so I only managed to order 4 rolls and I was stuffed. The rolls are good, but the waiter failed to inform me whether I would order half or full order. Also, for the dessert, I asked if the one time only means that I can order each dessert item one time, but she just restated what I said. We got the woman as our waiter. Can't remember her name. But I just ended up ordering fried ice cream. I asked her if I can order mochi and fried ice cream, she just said one time. And only my fried ice cream came out, not the mochi. Then afterwards, that's when I guessed that you can probably order only one dessert per AYCE visit. She seemed to not understand what I was saying.

The second time I was here, we got the Indonesian waiter and he told us that they don't do half order of rolls but on the menu, it says there's 50% off, so I showed him that and he just kept saying that there's no half roll orders. So I just ordered full like last time, but this time, I had my mom with me so we both shared the rolls. We didn't get to order much, as full orders were a lot. And the dessert, we just ordered one each cause I didn't feel like asking him to clarify it again. Overall, the food here is good, the service slow, but the details and clarifications with the waiters/waitress were a little frustrating at times."}
{"text":"It was sex in my mouth  It was amazing!! My new favorite restaurant !! The portions were more than a few mouths full !! I actually got full looking at !! No joke lol!!!  I order the Philadelphia crunch role !! & New York strip with lobster! 
It was DELICIOUS!  It's a must... try for your self kinda place ;)"}
{"text":"Amazing restaurant!  We had dinner reservations for ten and even though we were delayed for 45 minutes, they held our dinner table on a Friday night. Food was absolutely delicious n well worth the 'All you can eat' price. Everyone agreed this will be our monthly Friday Sushi night. 
Only draw back was having to share the Sushi 'All you can eat' form.  Otherwise, great place, great food and great staff."}
{"text":"Walking in on a Saturday night and their was no wait, wow! Service was very attentive, on his game with the refills, friendly etc. 

Our cook was Geo, he was amazing. He was friendly, making jokes with my children, asking repeatedly if we were ok or if we needed anything. Food was cooked to perfection and their prices are not bad."}
{"text":"I have a new found appreciation for this place. Had a great time with my friend tonight. Food was on point, chef was amicable and the ambiance was uplifting. I'm glad I came here tonight and can't wait to come back with the family."}
{"text":"5 stars for exceptionally friendly and fun  staff. We ate here this past Wednesday and had a wonderful experience sitting at one of the grilling tables. Between our party guests we had sushi, steak, chicken, salmon, shrimp, and lobster and everyone was pleased with their meal. We will be back."}
{"text":"horrible experience. tasteless old fish, dry rice, chewy nori. all you can eat gimmick, waitress insisted on only placing half our order which took 30min as they enforce charge for not finishing all food then never returned. 60 min max for ayca."}
{"text":"This place rocks! We had another great meal here tonight. The dinner isn't rushed and the Grill Chef put on a wonderful show. He was especially entertaining to my 7 year old. I wish I could remember his name! 

We made a reservation for the Teppanyaki Grilll, which I highly recommend. We had a party of 7. We started with some Asahi beer. You have enough time to chat & enjoy your company before the chef starts your grilling entertainment. 

My kids loved it! My daughter is 14, & she said it was really cool to watch the chef prepare her meal in front of her.

I had the scallops, which were moist and cooked to perfection...not chewy. I ordered the NY steak med.well. It was delicious! No fat on it, tender and full of flavor...I didn't even need a knife to trim it! 

They also served a bowl of soup, I don't know what it's called\" but it is a broth base with some green onions in it and fresh sliced mushrooms. After that comes a small salad with a ginger dressing, followed by stir fried rice.

The chef does a great show with the eggs for the rice! Just charming.

The noodles have a slightly sweet flavor to them and the vegetables were crisp. 

Everything has been excellent here twice within the last month. I hope they keep up the good service and the food quality."}
{"text":"The sushi here is unbeatable ! Seriously.  Prices are practically half off and the staff is always friendly. They also put a great show for when you order the hibachi! Everything is seriously delicious! Order the Lisa Lisa you won't regret it"}
{"text":"The owner has contacted me assuring me he would handle the problem and has compromised with me on the situation in a swift and respectable manner"}
{"text":"Excellent sushi and great prices. We are on vacation and are not to familiar with the area but it was recommended from a friend and I am glad we went. Had tons of different selections on the specialty rolls and all the normal rolls you would expect at any sushi restaurant. Also the service was great. No issues at all. I would recommend it to anyone looking for a good place for dinner."}
{"text":"We love this place. We've tried just about every sushi restaurant in the Valley, and we keep coming back again and again. Try the Sexy Girl - or, if you're planning ahead, order three of them as soon as you sit down, save yourself some effort."}
{"text":"Terrible! Absolutely terrible. Waitress forgot our sushi order. Literally almost hit my friend in the head with a plate. Argued when I asked if I could get seasoning for my fried rice. Forgot we ordered double rice. I've eaten hear many times. This time was the worst. Food had no taste and waitress was rude and argued"}
{"text":"It's alright for a Japanese restaurant ran by Koreans.  The fish isn't very fresh, and they put a 60 min cap on the all you can eat.  

To save money on the all you can eat, they take forever preparing the food.  I know it doesn't take that long to prepare sushi, my other half is Japanese.  I could never take my Japanese mother-in-law here, she would find the food very distasteful.  If I wasn't a cultured person, I would find the food and experience great... however I was disappointed in the cost versus the quality.  If you are going to order the all you can eat, order everything in the first order so you can get your moneys worth.  This is my first Yelp review but won't be the last."}
{"text":"As a frequent dinner here, we would have been more than happy to give 5 stars.  We spend our thanksgivings here, as we don't have any family here. We love the sushi, the ambiance, etc... But tonight that all changed.  After a horrible day with no air conditioning we decided we would go out for sushi... We were seated right away as always. The waitress came up after a good few minutes of waiting, took our drink order, and walked off. Come back and tells us they only have one apple juice for my two kids. Ok fine, split it and top it with water. No big deal. Drinks come. Mine should've had alcohol in it but didn't taste like it.  Now this is where it goes south. She comes to take our order... I order the kids teriyaki chicken for my 3 year old, a California roll with soy paper for my 5 year old, and a 007, spicy crab, and California express for myself all on spy paper.  She then turns to walk away... Without even taking my husbands order... So we say wait we aren't done.  He orders the all you can east sushi and tells her the rolls he wants to start with. She walks away.  When our orders start coming out first it's my sons chicken, and a plate with a California roll, and spicy crab roll.  A few minutes go by and two of my husbands rolls come out. A few more minutes and we stop the waitress because the rest of his rolls and my 5 year old roll never came out.  She come back with my husbands rolls and runs off. We stop her again and for my sons roll and she says oh it's coming.  Meanwhile he's hungry and whining. She brings his roll out but it's wrong. Whatever he eats it anyways... My 3 year old was still actively eating and she asked if we wanted a box for his food. Ummm no.... He's still eating....  She refills my husbands drink, and takes my drink but never asks if I wanted another... My husband goes to order more rolls and she says \"wait, you wanted all you can eat sushi??\" It was at that point we gave up and said forget it we are done.  Went too find a manager and guess what. There's none to be found. There's the head sushi chef, and the head hibachi chef, both are busy and the sushi chef needed translation.... After a few minutes of waiting for the bill we are told they would bring us desert.  We declined because we were just done, and fed up. We went to a place we've always had an enjoyable time at, but we were just served a headache and until we complained we were rushed to eat and get out....  I can't say we will come back ever, which is disheartening because, we actually enjoyed coming here. The food is great. The hibachi noodles are to die for. But with that service.... We won't. I'm not spending over $100 on food when we are treated that way...


Oh and for a table that just ordered 7 sushi rolls... More than one thing of wasabi and ginger would be great..."}
{"text":"Great food. Their teppanyaki is awesome. Our chef was funny and very engaging. I had the New York steak and teriyaki chicken, and it was excellent. Our chef Martin had it down to a science where nothing was ever cold, and sent it out as courses. The pricing is much better than the other well known place in the Westgate. Highly recommend!"}
{"text":"We've been here several times for lunch. It's GREAT for a quick bite. Their special rolls range from $6-$11. There's a slight language barrier every time we visited. There isn't a description on most of the rolls. We like to know what we are ordering. I have a  new crab allergy so I have to be super cautious what we eat. We went here last week and just told the sushi chef that I like everything but crab and eel. He made us 3 rolls. I don't know what was in them, and I have the slightest clue what he said but as usual it was good. 

We love spicy anything, We do know that their \"Fire Roll\", \"What the Heck\", and \"911\" rolls suit our fancy. 

The service is great despite the lack of english. our server kept calling me \"Sexy lady\".. I  loved her immediately... who wouldn't? =-)

I recommend this place to anyone who is in the area that is looking for a non fast food but FAST lunch."}
{"text":"Not good, reservations are running at least 60 minutes behind. Definitely not enough busser staff( hostess said they have 2) on a packed Saturday night. Manager does not seem to be aware of what's going on, there are literally multiple tables after guests have left and not being cleaned, while Manager is wiping the bar top ( as the Bartender watches) ...No idea about the food haven't gotten there yet. Really bad way to run this restaurant."}
{"text":"Went last night for dinner and geo was our chef, he was great and we had great entertainment and even better food. 

Service was good and Cindy even gave me a funny little birthday dance.

We will be back for sure"}
{"text":"We go here at least once a week for lunch here! Awesome Staff! Great Prices! The teppanyaki style grill is way better than Benihana Restaurant for sure. The Chefs are funnier and it is easier to enjoy your meal without being in the Big Casino atmosphere and having to hassle with all the noise, people and parking. The food is amazing and ALL  the Servers are so pleasant and helpful ..Cindy is usually our server and she rocks this place!  Love this sushi restaurant and highly recommend at least trying it once you will be hooked for sure."}
{"text":"I'm gonna keep it short and simple..This is the best place for teppanyaki and sushi in Henderson. I have absolutely no complaints about their food,service,and hospitality.Last time i was there, my comical server served me my unagi (eel) and told me , (in japanese accent) \"This very good for you..Japanese viagra!\" i almost choked on my water from laughter! i'm definitely coming back..Oh yeah..almost forgot, you HAVE TO TRY THEIR SOFT SHELL CRAB APPETIZER.. I give this place an A For Amazing..Peace"}
{"text":"Great Sushi!
We were looking for a local place for some good sushi and stumbled upon Samarai. 
The  best sashimi (yellowtail and salmon).
Good rolls and of course sake and beer!

Prices were very reasonable. About $80 for two of us and we're both full when we left. I think they do have an AYCE as well.

We did not sit at the teppanyaki table, just had sushi. Fantastic service by Cindy and Mel. Never had to wait :)"}
{"text":"Don't get me wrong. The food is great! I love coming here when the restaurant is practically empty. No other place has rolls that compare in flavor. I hate bland rolls so I really prefer to come here. There are just a few issues I have.

 I have been coming here for a little under five years now. I go as often as I can, anniversaries, birthdays, date nights, etc. Everytime I come in I get seated within an okay amount of time considering how packed it gets. Which is understandable. I get asked what we would like and I always do all you can eat. The new waitresses always ask me if I know how it works and I reply yes because I've been coming for a long time.

 Some nights when it's busy I don't get my rolls until 20 min after they've taken my paper. Other nights I get most of the items on the paper and they bring back the paper before I get the last roll or two on my list. They almost always forget to being the miso soup I always finish with. Which is very frustrating. Some nights it's also super difficult to get a refill on water until we are ready to leave the restaurant. 

It seems that they can't keep waitresses on staff and are always having to hire new people. Which if I was working so much that I was forgetting bits of orders then I would know thay the job is too overwhelming and I would probably quit too. 

Five years ago the restaurant had waitresses that were trained well before they were put on busy nights. They were always so nice and quick to take care of you. Sometime in the five years they got new management and everything changed. New waitresses are being thrown in on busy nights and trained on those nights. They quit playing kpop and jpop which I miss a lot! And they watch my table like a hawk. They stare at my friends and I instead of bringing us water and collecting our plates. I'm a hairstylist not some weird looking teenage that is going to run out on the bill. 

My suggestions, open up another location because you're almost always looking at a 30 to 60 min wait. And train your girls before you throw them on the floor on a busy night. Also teach them better customer service."}
{"text":"We went to Samurai (then Fukuda) for New Year's Eve several years a go for the first time. I had just delved into the world of sushi and I was not disappointed!!! We are there at least once a month and the food and service never fails. The owner, Freddie, is fabulous, the sushi chefs are always friendly (we usually eat at the bar) and Cindy is our favorite waitress. :) My boys love the hibachi chicken, steak and noodles. I can't say enough good things about this joint. Samurai is our \"Cheers\". Whether you get All You Can Eat sushi, sit at the sushi bar, at a table, or at a hibachi table, it's all good. WE LOVE YOU, FREDDY!!!!"}
{"text":"They lost a star because of the entry way being dirty.  When you first walk in it has a faint odor like the carpet got wet and has mildew underneath.  Once you get past the entrance, it gets way better.  The food is wonderful!  Service was spot on!  The chef at the grill was funny and pleasant.  You need to go here either when you are starving or want to bring food home for tomorrow because you will have plenty to eat!."}
{"text":"Every time I come here which is at least once a month I have had a wonderful experience. The service is great. The chefs are social and switch up the routine from time to time. Birthdays are a blast. I always recommend this place. The sushi here is something I always look foreword to. Try the Lisa Lisa or the Japanese lasagna!"}
{"text":"Only 2 stars... and these stars go our server.  Sushi was bleh... really sloppy ... how many rolls can you stuff with imitation crab or spicy tuna... get creative"}
{"text":"This place was gross. Went for the table cooking had a reservation for 6 and had to wait for a party of 8 and sat for 30 min after we were at the table and had ordered. 

I ordered a spicy tuna hand roll and received a cut roll...

The food was also terrible. They put lemon on everything and put sesame seeds in everything. 

Also the guy cooking our food wasn't that great and didn't really put on a good show. 

I do not recommend you eat here. It is cheap but really crappy!!!"}
{"text":"Absolutely love this place and will never go anywhere else for sushi or hibachi style food! Our server Andrew went out of his way to accommodate all of our needs (my husband and I are picky eaters). Every worker was so nice and the food is outstanding. A must try!"}
{"text":"Made a 7pm reservation and unreal when they mess up the time with minimal apology. Then seated but food took longer than usual at tepanyaki places. Food was so so. Kazu the manager was very insincere about apologizing for us running an hour behind and then they bring us the wrong bill. Very disappointed since we liked coming here on the rare date night or special occasion."}
{"text":"I've been to samurai many time, they're offering the best teppanyaki in town. But this time my family and I decided to try their AYCE sushi. I had to say OMG. They had such a verity appetizer and so many kind of sushi roll after We  done with the sushi,  the sever offered us a desserts, I got the mochi ice cream for myself and all my family got the tempura fried ice cream. We really had a good time. Definitely recommend this place. I will see you guys again soon."}
{"text":"The food is terrible and they made us pay extra for what we didn't eat, and wouldn't allow us to take it home. The owner just sent me threatening messages about my review, and posted such unbelievable lies. And he continued to threaten me until I blocked him!. Please post the screenshot of the police report and the video clips of us ordering and receiving 200 pcs of sushi rolls. Now I know why the waitress whispered to my children and I-'sushi man is watching me', as she took away the two uneaten pcs of California  roll. I feel sorry for her, working in such a hostile environment."}
{"text":"One of our absolute favorite spots.  This is my wife and son's choice every year for birthdays and for Mothers Day. We've had numerous chefs and you can tell that the restaurant has a specific flavoring, but each chef does seem to cater it slightly to his tastes. We had Kong today and he was great. His fried rice was awesome!  

If going on a weekend afternoon or evening, or a holiday, I'd highly recommend reservations! 

We've always say at one of the grilles and never at a table or at the bar, so I can't speak as to how the service is in those areas. But at the grilles, the service is awesome. Out of all the times we've been, I can recall only one time when the service was not up to their standards, and looking back, that weekend they about 15 people out the door waiting for a grille. They were SUPER busy that time. 


Just an FYI, if you tell them it's your birthday, they will make a production out of it, literally. They will play a birthday song over the PA, and one of the lady's, Cindy, will come to the center of the grille and do a birthday dance for you (it's a clean, family friendly dance)

In short, go, eat, enjoy. Youll be glad you did!"}
{"text":"Very disappointing.

Our food arrived for 2 out of 3 of us.  It took another 20 minutes and the 3rd member of our party still was not served.  We cancelled the last dish and got our bill.

The waitress was not the least bit worried about all of us waiting for the rest of the food to arrive, and being polite, not eating our meal.  She still get paid right?

The food was also a little disappointing.  The rolls we ordered were not as round as your thumb.  With 6 of them packed together it took up about 2\" x 2\" of space on the plate.

Quality and taste was a little below average.

No guessing that we are not returning.  But mainly because of the horrible service and lack of concern."}
{"text":"My wife and I LOVE this place!  We come here anytime we are celebrating a birthday or anniversary!  The cooking show is great!  Cooks are quite talented and funny, and the food is AMAZING!  I would recommend this to anyone looking to have a nice meal!"}
{"text":"Wow we took our son here for his 11th birthday yesterday  and we had such an amazing time. The tempinyaki was really good. I had the salmon and steak combo my husband had the the scallop, steak ,and shrimp. Chef George was hilarious he had us cracking up. My son loved his vegetables. He ate a whole plate of vegetables. I was amazed. Our Server Brandon was great. Great food(huge portions) and great service made for a wonderful Birthday celebration. I highly reccomend this place for a fun night out with the family,celebrations, firstdates, you name it!"}
{"text":"The food is really good. We got the AYCE sushi. It was a little expensive at $26.95 but it's all you can eat. There are a few that you can only get one order each of, but the rest aren't. I was trying to figure out which one was my favorite and the waitress was trying to help us too. I showed her a picture of the half eaten roll, but she couldn't figure it out. So I think my fave is the baked lobster roll, but I'm not 100% sure. I ordered green tea, hubby ordered iced tea, and pops ordered soda. So our total was $95.01 after taxes.

If we go back again, we won't order everything at once. We've never been there before and ordered a bunch of stuff at once. They all came pretty much one right after the other and filled up our table. So only order a few rolls at a time unlike us. 

The waitress was pretty attentive and filled our drinks pretty quickly for most of the night. She was very friendly up until my trying to figure out that last roll I wanted to order (trying to figure out what it was but didn't in the end). The fried ice cream was pretty good. I got the vanilla flavor. Yum!

Overall, everything was pretty good. We will probably come back again."}
{"text":"I enjoy the AYCE!!! I also get take out sometimes and the price was reasonable. Have not tried the steak but can't wait to check it out."}
{"text":"I did not have the teppanyaki, we sat at the sushi bar and had the all you can eat.  We had the white tiger, lobster roll, popcorn lobster, philly express, crunchy roll, avacado roll all with rice paper.  The flavors were delicious, the rolls could have been rolled a little bit tighter.  
Staff was attentive, but the serving space was awkward and required a lot of handing over the head.  
Wheelchair seating was also not great, it was good for the teppanyaki, but the sushi bar was all higher stools.  The bathroom would have been impossible for a wheelchair."}
{"text":"Brought my family here because I wanted sushi and the lady didn't. so it's a win win they offer tepanyaki. let's start w price. Benihana price for a neighborhood located restaurant. she ordered Kobe beef and lobster n I settled for filet mignon and salmon both w fried rice. I also ordered a couple rolls n a few nigiris. 

Our chef was friendly and cooked our steaks perfectly to our liking but wasn't that entertaining for a interactive cook but food was good. 

Sushi was mediocre. Not a place I would go to for sushi but it served its purpose. 

It's pricey but if your trying to avoid the strip.. It's a decent place. Will come again for the tepanyaki n not so much the sushi"}
{"text":"The teppanyaki (steak & shrimp) was very good and our chef was a lot of fun but I really did not like the sushi. I actually thought it was my least favorite sushi in Vegas. The service was good, the staff attentive and friendly but I would not go here for sushi ever again."}
{"text":"I will not be coming back here simply because the wait staff sucks...and when you order and pay more for a Filet that is what you should get. Six people at the grill me and my wife ordered filet the others ordered sirlon...the cook cut it all up and served to everyone....Not good business sorry....altho the food was good...service sucked mainly an old waitress bitch!!"}
{"text":"We've eaten here several times before but tonight was AWESOME!!! Daniel was our chef, this guy is way too talented a chef to be at this place but I'm sure glad we got him. Get here ASAP, ask for Danielson the cook. He won't be here long."}
{"text":"From the soup to the main course! Omg it was absolutely delicious!!! First time at here at the experience was amazing. Must try! Feast here"}
{"text":"I am beyond thrilled to know this place is right by my house! I can't believe it's taken me this long to even come here. It was wonderful I ate sushi and my boyfriend had the chefs cook his in front of us. The rolls I had which were the cooked lobster roll, the rainbow, and the orange crush were wonderful! His meal which was scallops, steak, and shrimp with noodles, fried rice, and vegetables was delicious. Great for a group or just a fun place with friends! The service was awesome everyone was really friendly and attentive. I will defiantly be coming back!"}
{"text":"A great AYCE sushi spot near Sunset Station. They have the live, fun, chef teppanyaki table cooking show if you like to be entertained while they cook for you.
The restaurant is big and spacious but sometimes they don't have enough help when it's busy and the service can be lacking, but for the most part it's not too bad if you catch them at non peak times.
If you are not in the All You Can Eat mode the rolls are 50% off which is a good deal if you are just in for a small bite. Sushi rolls and Nigiri sushi is very good and they have all the standard items to choose from. When in the AYCE mode you just mark the order form and in a short amount of time you will be served. Apparently there isnt' a time limit like most places, but here at Samurai you can order up to 3 times by the looks of the order form, but I normally can't make it passed the first round and then I \"tap out\". Overall a very cool place for sushi or for a special occasion the teppanyaki tables are fun and the food is really good.

I'm dropping off 1 star because they may not always have enough servers for the amount of business and the glass on the front door has had the same fingerprints on it for as long as I can remember.
I guess after a few more months there will be so many finger prints on the glass that it will seem like it's frosted and I won't notice anymore."}
{"text":"Stopped here to eat while taking a friend home from the airport. The parking lot tricks you on the way out! I got stuck and had to turn around, anyways back to it. 

I got the NY strip with fried rice on the teppanyaki side which also comes with soup, veggies, and noodles. It was a lot of food, I ended up taking half of it home. It was decent and seemed to be fair for quality vs cost. It's a nice place to take people to if they've never had teppanyaki or just want some. The show with food was your typical show, I haven't seen anything I haven't seen before but it's still fun to watch. 

I also got some nigiri sushi, tuna and salmon, both of which were pretty good. I honestly didn't expect much but the fish is pretty fresh for Vegas. 

Cost vs quality I say it's decent. If I'm in the area I'll definitely stop by again but I wouldn't go out if my way to eat here.

Oh! The chef was pretty cool so we got him a shot of tequila to say thank you! =]"}
{"text":"Amazing food and good service. Ate at the restaurant side and got sushi and shrimp teppanyaki. Would highly recommend"}
{"text":"I came to show my friend teppanyaki for the first time, but unfortunately there was only a single teppanyaki chef for lunch and he was about to start cooking an already seated table. I said it was okay and that I was willing to wait, so we waited about 15-20 minutes.

The restaurant itself is huge and also offers a la carte dining including AYCE sushi options. The a la carte sushi prices are quite competitive too, advertised as always half price.

As for the teppanyaki itself, it was fairly standard fare. Our chef was friendly and tried to make conversation even though our table/party consisted of only two people. We were served ginger-based and mayonnaise-based dipping sauces; occasionally I also see a horseradish-based sauce at some places but not here.

The other thing that stood out to me was that everyone got a shrimp appetizer even though it was only lunch, and that everyone also gets a portion of yakisoba (noodles). I have never had noodles automatically served, but this was also my first teppanyaki experience in Vegas (if this is the norm here, I have had countless teppanyaki meals in my lifetime). Though the noodles were tasty, instead of more carbs, I would have preferred the bean sprouts that some other places serve.

Nonetheless, the food was tasty and I really have no complaints about the teppanyaki experience. I wouldn't mind coming back to try their non-teppanyaki menu as well."}
{"text":"This place seems to provide several dining options: sit-down, sushi bar, AYCE, teppenyaki.

Took my family here for the teppenyaki option and enjoyed it. Depending on the platter, you can choose from 1 to 3 items, ranging from $12.95 (vegetable) all the way to $41.95 (filet mignon+lobster+scallops). My dad and sister picked the NY steak with choice of scallops/mahi-mahi/shrimp for $22.95, while my brother and I opted for the teriyaki chicken with choice of shrimp/salmon/calamari/mahi-mahi for $18.95. Reasonably cheap considering what else is included in the price:

We were served a mushroom soup to start, followed by a small bowl of salad -- this was appealing and a nice start to our dining experience. Our chef appeared shortly after with his cartful of necessary ingredients and began his hibachi show. He started off with the rice (we substituted and paid extra for it to be fried rice), tossed us some appetizer shrimp, followed by a mixture of vegetables, then each of our main courses, AND then some noodles, which was my least favorite side. It seemed like it was just spaghetti noodles with some brown sauce. Everything else was pretty good, but not really the best I've eaten. (It's no Benihana's!)

In short, though, you get a lot of food and it's cooked right in front of you. Our chef entertained us with tactical flying spatulas and acrobatic eggs, heart-shapes, food trains, and a volcano show concocted from onions and oil. It was a fun dining experience for an affordable price."}
{"text":"I'm going a full 5 guys...which I rarely do. We came here on Valentine's Day...with our kid and no reservations; fully expecting to just sit at a normal table with no teppan service because of the crowds and reservations on V-day. The Owner himself found us a seat at teppan, then our Chef who awesomely named himself \"Daniel-son\" (for those Karate Kid fans) and he was AWESOME!!! So polite, entertaining as hell and the food was cooked really perfectly to our individual preferences. We then got into our drinks too long after and were overstaying our welcome, the Owner politely asked us to switch to a booth which normally I would be pissed about but the fact that reservations were arriving and we had none and he sat us anyways made me realize I was being a bit inconsiderate and made me so grateful for the actual care and love that this guy puts into his place of business. Another Bravo! We will definitely return and recommend. Also, the pricing is extremely fair considering the quality, quantity and amazing service provided. Give it a shot!"}
{"text":"This place is great.The chef we had was very entertaining and put on a great show. We had the NY steak and scallops and the scallops were big and cooked to perfection."}
{"text":"Just went here tonight to celebrate Mother's Day a day early, in the hopes that we'd have less of a wait. It was a good idea because there was NO wait for a table for 2 adults and 2 high chairs, and the entire experience was wonderful!  The service was pretty good.  Our waitress was nice, seemed caring, and she came to check on us throughout the meal.  We had AYCE.  Most of the plates came pretty early and in a short time frame.  There were a few that were spread out, which worked out fine while we enjoyed the earlier dishes.  The ambience was nice, too.  Pretty full restaurant, and we had a view of the teppanyaki stations and all the tricks that the chefs were performing.  Free entertainment!

Now, the food.  I am SO glad that we found this place!!  We're new in town, so I'd been hoping that we would find a go-to sushi/AYCE place.  I think this might be it!  Some of our notable dishes include the Screaming O, the yellowfish sashimi, the Japanese lasagna (baked cali roll with cream cheese on top), softshell crab, spider roll, the Something Wrong roll and the Hold'Em roll. Yum, yum and YUM!

All in all, a very nice Mother's Day meal!  Thank You Samurai Japanese Steakhouse & Sushi!!  See you next time! :)"}
{"text":"This place is terrible! The service is awful, and the servers are rude. We got seated quickly, but then wasn't seen for at least 10 minutes and she had an attitude. We ordered Steak and Chicken and after eating for 15 minutes, I noticed a piece of hair in my food. I asked to speak with a Manager, and the lady said \"there is no manager here today, what is wrong?\" I told her there was food, and another guy came to the table. He was nice enough to take care of the entree but asked if it was my hair. The original waitress didn't come back after like, as if she was scared. It was not an experience that was worth the money you would save there vs. going somewhere like Benihana. I would not recommend it to anyone!!!!!!!!"}
{"text":"Come here at least once a week, sometimes more! 
The food is always amazing. 
Sushi is one of my favorites. AYCE is pricy unless you can eat a lot. 
Staff is always friendly! 
Hands down one of my favorite places."}
{"text":"The food at Samurai is AMAZING.  We ate at the teppan table with a group celebrating a graduation.  Between the chef and the server, everything was fantastic.  This place is very reasonably priced for the amount of food you get.  The cocktails are a little weak, but if you go with Saki, you can't go wrong."}
{"text":"Hands down the worst sushi place I have been to in the las vegas area.  I was getting ready for work and I still had a hour and a half before I had to leave so i wanted to grab some sushi.  I was thinking about heading back to one of my better spots but a friend told me that this place was great so I went here instead.  When I walked in I was semi greeted by a hostess as I stood there for about 2 min or so.  I asked for a table on the sushi side and she seemed a bit confused that I wanted to sit by myself.  It took them over 10 min to bring water to my table.  After that a nice gentleman took my sushi  order.  I was doing the ayce just to try it out.  I order a few pieces of nigiri and two rolls.  It took over 30 min for them to come to my table. After that I never saw my server again.  The rolls were dry, the quality of fish was not that great.  and after another 25 min of waiting for  a server  I gave up.  A new server came to me quite rude asking if I wanted anything else.  I had to go to work so i just said no and I wanted my check.  It took them 25 min to check on my table but just a min to get my check.  I was quite irritated with this place and the price is much more expensive then any other lunch ive been to.  I will stick with either sushi bay, or island sushi.  Avoid this place."}
{"text":"The lunch special Steak and Chicken was so filling and so good, our server  Hieu was very attentive and very friendly. I will be back for more."}
{"text":"Wow we just had dinner the food was amazing and the service was incredible! If you are looking for great food and entertainment this is the place to go! We will be back to dine very soon. Don't forget dessert the fried ice cream is so yummy."}
{"text":"Huge fan
Food is great and the staff is perfect.
We are well known here and their customer service is great"}
{"text":"My family likes to frequent this spot. The sushi is decent, but the hibachi is superb! Last time, I had the Filet Mignon with Scallops. The meal comes with onion soup (chicken and salt based broth with green onions and mushrooms), salad, a choice of fried or steamed rice, veggies and noodles. My meat was cooked to perfection (I love my steak medium rare which not every chef can accomplish)! The waitstaff is quick and the chef has plenty of tricks to keep the crowd in awe. I would say best to go as a group for lunch or dinner and bring your appetite."}
{"text":"For the price the sushi it was a good and it was delicious I got the shrimp lovers roll was sooo good next time I'm out to Henderson that is definitely a spot I have to stop off and at lest get one roll!!!"}
{"text":"This is one of my favorite sushi spots! I always go alone and sit at the sushi bar.. most of the chefs know me now and know what I order.. they have killer deals on basic rolls.. I love the spicy tuna and cucumber salad! But their deluxe rolls are awesome too! I go here at least once a week and it's always wonderful, fresh and affordable."}
{"text":"After passing by several times, I decided to give the Samurai a try for dinner.  The layout is pretty nice; they have a bar, teppanyaki grill, and seats. The 50% sale is pretty legit with dishes as low as 2 bucks!  I'm definitely not a sushi connoisseur; I like to stick to the \"simple\" rolls like California and crunch (LOL). Overall I had a good experience, the rolls I had were tasty and prices were on point. I would definitely come here again and would like to try out the teppanyaki next time!  I'm a fan for now!"}
{"text":"This is our go to sushi place, good, fast, great service and decent atmosphere! No complaints!"}
{"text":"Came in for lunch today. When I came in, the place was empty, ordered the AYCE Sushi. I came in with my brother, altogether we had 8 various rolls. Pretty good selection, and tried some new rolls I've never heard of. Would recommend this place to people who like sushi. Will come again soon!"}
{"text":"Samurai Japanese Steakhouse & Sushi is absolutely amazing!
This place is the absolute best and the sushi here is delicious and fresh! 
The customer service may be a bit overwhelming but you can tell that the waiters here mean well. 

I am a regular customer at this sushi joint and have always ordered the same rolls: Japanese lasagna, Popcorn lobster, and Cajun albacore.
Although I have staple rolls, I do try a different sushi roll each time I visit and each one I have indulged in has been quite delicious.

I enjoy coming to this restaurant with family and friends because of the decent priced food, great customer service, and quality of food."}
{"text":"All you can eat 2195 for lunch. Great deal. Better than average sushi.  Love the sexy lady and dynomite rolls. The spicy tuna here is very good."}
{"text":"Had diner on Friday night with 5 of our friends. Excellent meal with great service. 1 friend was allergic to shrimp and the Chef  cooked the shrimp on the opposite end of the grill so there would be no problem.  Very helpful.  Recommend to everyone."}
{"text":"Just had dinner and it was very good. Fast, fresh, and good sized portions. We over ordered. No complaints on food quality or service. Both were very good. I have to be wowed to give 5 stars. We will be back. We are newer to the Vegas area and this restaurant had set the bar for sushi for us."}
{"text":"Samurai is AMAZING! This place was recommended by one of my friends. It's not so pricey. Great food. Great service. Definitely one of my go to spots!!!!"}
{"text":"You need to come to this place!! By far the best sushi spot around! We come here all the time and absolutely love it! The guy Andrew who works there is phenomenal! He always goes above and beyond to make sure we're satisfied! Oh and do I mention the Pork belly cooked well done?? It's BOMB!!!!"}
{"text":"AYCE sushi lunch was disappointing!

Came here with a friend one day for lunch, and decided to do the AYCE $21.95 for the limited menu and $26.95 included items for dinner. The service was painfully slow, and we had to wait a while for our food after we put in our order and the restaurant wasn't even very busy. We opted for the $26.95 dinner option for lunch because it included uni, and sweet shrimp 1 order per person. For our first round, we ordered mostly sushi, the rice to fish ratio is not great. The slice of fish is pretty thin over a normal to slightly large piece of rice. Compared to other AYCE sushi places in town, the ratio could use some improvement. The sashimi plate also had very thin slices of fish. 

The service was not only slow but pretty absent, my drinks were not refilled, our server only came to our table when she delivered our food but never came back to check on us or if we needed anything else. We had to flag her down several time just for more wasabi. 

Overall a pretty mediocre place."}
{"text":"I would not go here again, there are just too many other good places to eat around here!

1. Walk in the joint and are asked grill or table- friends and I chose table.
 
2. Asked what we wanted to drink; some of us ordered soft drinks and some water.

3. Told the waitress we were ready to order (because it took that long, without her asking us once if we wanted to order or need explanation of the menu)

4. She then said sure \" I'll be right back\" (was gone for 3-4 mins) then came back and asked the people who were drinking water if they would like a drink. (up-selling trick for soft drinks or other drink with higher then food margins) When they said no they were ok with the waters, she then again said \"I'll be right back\" (gone for another 3-5 mins) 

Seems like this is another selling tactic to make people order a lot because they made them wait so long to order!

5. Ordered food.... food was average at best. I would normally tell you guys what I ordered but if you have read the review this far you should not really care what I got... Save yourself the time and money and go to a better sushi place. 

There are some others in the area that have 4-5 star reviews on Yelp from me and other Yelpers....Happy hunting!"}
{"text":"I've come to this place for the past year and have notice that the establishment has gone down hill. It needs a remodel desperately, especially the flooring. Disgusting. The food is great tho and the prices are fair."}
{"text":"one of the best in Vegas.  ask for uncle Peter if you sit at one of the teppanyaki tables.  Peter made the meal,  his personality is as fabulous as his cooking.  he also took the standard routine of *showing off* during the cooking of the meal and improved it with his own originality.  exceptional."}
{"text":"Still waiting for a table years later....  was told it would be a 40 minute wait and it's been even longer than that.  You should not give false expections to hungry people.  I have heard from many people while waiting the the service is bad, but they come back for the food.  Do NOT come during dinner hours without a RESERVATION!!!!  Very unhappy and will not be back."}
{"text":"this is a favorite standby, always good with great prices. Cindi kind of freaks out if they get a little crowded and will try to rush you thru, but tell her to relax and she gets over it. sushi is good to better and well priced. tapen is fun and very good. priced fairly. cooks have fun and can drink beer. will let you ask for special seasoning such as more garlic or butter and no onions. had large group and lots of fun. full bar too."}
{"text":"I was a little skeptical of this place when we first walked in, but the food and entertainment was fantastic. We sat at the hibachi grill and laughed all night long with the chef. The meat and seafood was good quality. It ended up being the perfect night for my cousin to get engaged!!!"}
{"text":"Being here twice for work gathering. This place is great, the service always excellent with friendly staffs and the cook is extremely entertaning. The first time I was skeptical about the amount of food you would get for this type of place, let's put it this way I can barely finish my share. The fried rice is absolutely delicious. We always have a good time here."}
{"text":"We ordered $70 worth of food to go and it looked and tasted like 3 kids meals. The sushi was chopped seafood mush rolled up in rice and topped with a sliver of fish. I would never recommend this restaurant."}
{"text":"Great all you can eat spot! come here all the time with my family and always leave satisfied. Teppanyaki here is really good as well."}
{"text":"We came around noon for lunch. The restaurant was empty and the staff looked like they were prepping for the day. We were greeted by a female employee from the back...then there was nothing!

We waited for was about 5 minutes, nobody came to the front, no more acknowledgment, nobody to seat us...nothing. So we walked right out. I did check the restaurant times and the open sign...yup past 11.30...they were definitely open. 

I don't know about you, but I'd say that's some pretty bad service..."}
{"text":"This place is great! Prices are more than reasonable and quality does not suffer. Try the Washington, green valley, and Mexican rolls."}
{"text":"Great Service!!! Andrew was an exceptional server. Food was awesome, and came out quick. Highly recommend and will be back again. We had the Sushi Boat and Chicken Teriyaki Bento. Was delicious!!!!!"}
{"text":"Today was our second time here.  We enjoyed it so much we came back within a week.the wait staff is friendly. Chef Ken is  wonderfully entertaining. While preparing our Japanese delights. His humor is quite refreshing in the mid afternoon.  The food is excellent we will recommend this place to our friends for Japanese cuisine"}
{"text":"We used to like this place, it is great for kids. the WAIT time is exhausting!! Food is good, not exceptional but good, affordable and the chef's are for the most part great.  Wait staff is ok, they are not attentive except for one woman who is great and dances with the birthday music. My biggest complaint is the wait, sometimes you have to wait at your table for an hour or longer to get the cook to your table. I am sure it is unpredictable how busy it will be but with small children this makes for a not so enjoyable night.  I also think the place could be cleaner, the chairs are very sticky. The place definitely could be cleaner. These days it seems like the wait gets longer because they have less or all new cooks.  Cleanliness is an issue, the chairs and carpet is very sticky."}
{"text":"As you read this review, please note that there is an update at the end!!!

I have mixed feeling about this place because it has so much potential. While the food was tasty, my problem with this place concerns the lack of quality customer service.

 It took them 15 minutes to take our order while our menu (yes I said one because they only gave us one menu when I had asked for two) was closed and waiters/waitresses were walking around , my girlfriend and I ordered appetizers and 2 entrees, my entree came with the appetizer and then 15 minutes later my girlfriend's entree came. Didn't give us a refill on our waters for the hour that we were there. When we finally finished our food, the waiter passed by our table maybe 3 times just staring at us while I was signalling them to come over. Now when they finally came over, a cool 20 minutes after we were done eating, we asked for our check, paid and then left. 

Ten minutes after we left I realized I forgot my electronic cigarette on the table and called where a lady picked up the phone and had no idea what I was talking about, so I decided to go back. I was met by an annoyed manager that just wanted me out of his restaurant, he told me that his busboy didn't see anything and had already cleared the table, I asked him if he could please make sure that the bus boy didn't see anything and he said \"I'm sure he said he didn't see anything\". After insisting that I see this busboy to hear it from his mouth and make positively sure (because it was a 300 dollar piece) that it wasn't there anymore, he agreed, went to his bus boy and asked him the question and the bus boy said that he didn't clear the table and that another person did it, so it showed me that the manager didn't even ask the right person about my vape, In the end the other bus boy said that he didn't see anything and anything on the table was thrown away? Okay, makes sense you threw away your plates whatever. They didn't even offer to show me where the garbage was or help me look for it....

All in all they don't care about you having a great experience. They just want you to eat get out and have the next group of people come in. If you want an all around good experience, don't go here, go to yama sushi for AYCE sushi, you want teppanyaki go to Benihana's. You want something cheap, with a substandard experience and inferior service, this is the place to be!!

UPDATE: The owner was kind enough to contact me and explained the situation as a whole.... The truth is that the person I talked to about my electronic cigarette was not actually the owner or even the person in charge so it was totally handled the wrong was and I wasn't even supposed to be talking to that person. The owner apologized and handled the matter very professionally and was far above my expectation on what he was willing to do to make me a satisfied customer which I am now... I would like to thank the owner for contacting me and clarifying the issues that we had an promptly returning my electronic cigarette! The food was honestly great and the management was just a little bit off that time. I've been here numerous times and this was the first time something bad happened, and even though it was bad, it was promptly and professionally resolved. Thank you again!"}
{"text":"I really like this place .. This my first time here .. Was fun the food was good the people that worked there was great too ... Would go back again :)"}
{"text":"Just spoke with the owner who was apologetic & listened to what I had to say about less than stellar experience. He offered to send me a gift certificate & I went back. Service has improved A LOT. I have been there a few times since using the gift certificate & wow, every time has been a great experience with attentive service!!"}
{"text":"Great place! Great atmosphere! We took our boys here for our NYE family supper. We wanted to try something different & do something fun, this was the perfect choice! We were seated at the grill and instantly were approached for our drink order. Our chef arrived and the show began! The food was fresh and perfectly prepared and a delight to witness! Our chef was definitely an entertainer...wish I knew his name. Shorter gentleman, Spanish accent, did a steam train with the onions that positively mesmerized our boys. We were all so intently watching him & the speed he could cut, chop & dice things that we kept forgetting to actually eat! We've been back several times, tried the sushi a couple times as well and have not been disappointed. The entire staff is friendly & works well as a team. They have AYCE!!"}
{"text":"Love everything about this place. We sat at the sushi bar, rolls were delicious and the price couldn't be any better. The \"I love yellowtail\" and Garlic edamame were my favorites but everything was delish. Our waitress had a great personality and kept calling me a \"hot sexy lady\" and was singing and dancing so she had us cracking up. Flattery gets you everywhere with me so def got an extra tip. We'll be regulars here!"}
{"text":"We had a few favorite sushi spots but we are always up for trying new places. Since Samurai was closer to home we hoped it would be a good experience and it was. We were really glad we stopped in for the all you can eat sushi.  The sushi was fresh and the size was perfect. You were able to order half rolls allowing you to have more of a variety. My only negative was the slow service, but all in all was a good experience and have gone back for their garlic tuna."}
{"text":"I was disappointed in the quality of their steaks. One visit it was good and the next we received tough fatty steak. This was our favorite spot but the inconsistency has driven us to another restaurant for our teriyaki cravings."}
{"text":"I'd give 10 stars if I could. 
Sat at the sushi bar and the chefs are super attentive. We had the sexy girl, scorpion, jalapeño bomb, and hot night rolls. All of them were amazing and we received them very quick after ordering. My favorite was the sexy girl. Shrimp tempura, cream cheese, cucumber, jalapeño, spicy tuna with spicy mayo and eel sauce. Not too spicy just perfect. My boyfriends is the Hot Night roll. Spicy tuna, cream cheese, deep fried, topped with spicy crab. Also so good. 
We are already planning on what to order next time. We will for sure be back. And the prices are better then any other place we've tried... Way better food, service, and prices then Red sushi downtown."}
{"text":"Food is yummy, and service is spot on! Prices are extremely affordable! Get the Monkey Brain Sushi! as a dessert! :)"}
{"text":"Ayce sushi in henderson! The best sushi bar and servers. Always on point with whatever you want to order. Fast and convenient location."}
{"text":"Excellent sushi!  Great price!  I was there for lunch when everything was half price. The choices of sushi were quite extensive. I will be back!"}
{"text":"I've frequented this establishment about 6 times in the past year and always have a good experience. The staff is always adequate and friendly. The restaurant is very spacious,  clean, and just plain nice. They have the tepenyanki grills and also serve sushi with similar appetizers you'd find at any AYCE sushi joint.

This review is for the sushi part of the menu.

Sometimes you crave sushi but don't want to bust your gut \"eating your monies worth\" of unlimited sushi and appetizers for AYCE. Well if you order two special rolls off of a sushi menu the total usually comes out to how much sitting down and getting AYCE sushi for dinner ($25-$30).

Well here comes this place.  The whole menu is \"half price\" meaning everything is $3-$8 dollars. That means getting a couple rolls of sushi for a light lunch or dinner with tip could easily be $10-$15 which wouldn't force you to get all you can eat for the sake of \"well it's just a few bucks more.\"

They have a great selection of special rolls. 

I don't remember any ones in particular EXCEPT the monkey brain. It's four banana slices that are topped with spicy crab and sauce. The combination is really good and unique. Also the white tiger which is a shrimp tempura roll topped with white fish and sauce. 

We usually go for light dinner before a movie but went recently for AYCE for a birthday and it was good. Their fried appetizers aren't the best. They are too heavy. Tempura is usually more light. I'd say stick away from the calamari or soft shell crab. The food was still good but the fried stuff wasn't so good. I got to try some of the nigiri and it they were good. 

Their uni here was really good though! I believe the places that have a one per person limit on uni and ebi get the good stuff. They have that 1PP limit on it and it was sweet and not fishy. Their cake albacore was also really good.

Overall I like this place. It's a solid four overall when you incorporate the value, staff, and ambience. 

I don't recommend it for AYCE. For the price I'd for sure go to GOEYMON, sushi twister, Oyshi, or sushi mon. 

This is like a safe restaurant to introduce to people who've never had sushi. 

This wouldn't be for a person who is a sushi expert."}
{"text":"My boyfriend and I come here quite often because it's close to our house, affordable, and has good food and service. We have never done AYCE because we could never ear that much. Having said that, there are a few rolls that we consistently order here: the shrimp tempura roll, sunset roll, and lisa lisa. If you are looking for traditional rolls, however, this is where they lose half a point for me, but due to the other good factors, I'm rounding up to a 5 star rating. 

We also like their bento boxes. I love their beef teriyaki box. The beef is legitimate steak cubes, and the flavor is not too sweet. My boyfriend likes the yaki udon and I always steal a few bites from him when he orders it because it is pretty authentic tasting. The bento boxes all come with an assortment of tempura, gyoza, California rolls, salad, and rice. It is a great deal for the price and I always have basically an extra meal to take home for the next day. 

We have done the teppanyaki once. I really liked it. Honestly, I don't care much about the entertainment factor because I just love the flavor of teppanyaki but I thought the chef did a good job engaging my boyfriend and I and the other family at the table with us. My boyfriend was less impressed, but we aren't sure yet if it's because he doesn't like teppanyaki or if it's because he didn't care for their teppanyaki. 

The service is always friendly and engaging. We have always been greeted with a smile and we truly do enjoy this restaurant. Whenever we are looking for a meal on the way home, Samurai consistently pops up as one of a select few \"go to\" places."}
{"text":"Today was craving Salmon or Tilapia for lunch.  Was in the area and I see the sign \"50% Suishi\".  Well, that got me and decided to stop here.

Let's start with the staff...all pretty good.  Only issue I had is when I first got here.  The place wasn't busy at all and they told me to sit anywhere.  The first place I chose, they told me to move.  The second seat I chose, they still told me to move.  I guess it's sit where you like except here, here, here, or here. Finally seated in a little corner/cubby type area.  They wanted me close to the sushi chef. 

Let's look at the price.  AYCE is about $20 for lunch, which is average to everyone other Sushi Restaurant out here.  If you are getting just one or two rolls, it's cheaper to get their 50% off sushi.  I have to admit, their 50% sushi is cheap.  One of trhe cheapest I've seen in town.  Reviewed the menu and decided on 3 different rolls and some calamari.  Did the math and it was cheaper if I got the AYCE.

My Complaints:  Bottom line, you get what you pay for. 

-Calamari:  It was a full serving.  I expected your typical tiny fried calamari that you find at sushi restaurants.  But it was so greasy that I thought I was eating onion rings. The calamari was also served with sweet and sour sauce, which I was not use to. 

-Sushi:  Had the Spider Roll, Red Rock, and Tiger Roll.  I was a bit disappointed.  All rolls were loose and all had more rice than substance.  I don't know about you, but sushi shouldn't be eaten with a spoon.  The rolls would break at the slight touch, that you had no choice but to use a spoon/fork.  You know the rolls are loose when it's even served to you broken up. Taste wasn't the best either. Not sure if it was not fresh or was it due to me having better in other places. 

-Dessert:  Wanted the Fried Vanilla Ice Cream, but the place was out of vanilla ice cream.  C'mon man.  

I did not have a great experience here. But I will still try them at least one more time. Looking at the menu, their steaks look good and are pricey.  The Tepan Yaki looks to be their specialty.  This review may not be a fair one since I had not tried these.  If my experience changes, then I will change my review."}
{"text":"Already craving this place again. The shrimp and noodles are soooo yummy. Definitely try it if you're going to the grill. Their sushi selection is also impressive and the quality/presentation couldn't be better. Will be back here again!"}
{"text":"Love samurai sushi chefs,the two Kevin"}
{"text":"Longest wait ever! I waited 30 mins for my take out at 9:00pm with the restaurant almost empty. Staffs just walked around and didn't  really care about anything..  When I got back to hotel which was like 3 mins by car! The food was cold.. And not very tasty at all!"}
{"text":"I gave this place two stars because it just all around rubbed me the wrong way. It's big and oddly seated. The sushi wasn't very good in my opinion & the service was very slow! My husband got the teppan yaki & it took them 45 minutes to get him his food! And I was completely done and full by the time he even got his food. I wasn't pleased at all. We won't be eating here again sadly."}
{"text":"I had the Spicy Salmon Roll and the Salmon teriyaki bento box. Both were very good and service was quick and efficient. Our server kept on checking on us if we needed anything.  Would definitely be coming back."}
{"text":"The food is delicious. There was 5 of us dinning. The fried rice was great with steak & lobster my other family members enjoyed their meals as well."}
{"text":"The wait was super long but we waited once seated we had allot of fun , the chef we had was hilarious I wish I had checked his name .... The other chef at the table next to us seemed suuuuuper boring so I'm glad we had the chef that we had  
I will definitely go back maybe on a week day vs a Saturday, the food was really good we had the shrimp, filet and scallops and all was cooked perfect !!"}
{"text":"The food is absolutely amazing but the service is extremely slow and it wasn't busy at all.. at one point we had to flag someone down just to order our dessert and try to get the check. Definitely recommend and will come back."}
{"text":"One of the best all you can eat sushi places in Vegas.  If you sit at the bar you will get extremely fast service.  The baked lobster roll is to die for."}
{"text":"This place was Awesome. Their food had Alot of flavor and our waiter needed a little personality check...overall would love to come back again for more :)"}
{"text":"Average Hibachi. Good food, funny chefs etc. I've gone several times and tried the Chicken, Strip Steak, Filet Mignon, Shrimp, Mahi and Lobster. They are all ok. Good but nothing special. I wish they used fat lo mien noodles rather than spaghetti style noodles. I usually skip the noodles, I don't care for the sauce. The fried rice is the best part of the meal. It's really good. 

The staff is always REALLY nice and the chefs are pretty funny. It's a good time, the food is good, not amazing but good. They also have a sushi bar which I have not tried but it always looks fresh and they are always busy."}
{"text":"Me and my boyfriend  came here this past Friday nite, and this place was so delicious, the guy was very friendly and he put on a great show. I will definitely be coming back here again."}
{"text":"I've driven by this place many times and thought I should stop in to give it a try and yesterday I finally did. The host greeted us right away and seated us in a comfortable booth for our lunch. We saw a sign for $21.95 all you can eat sushi, but having never been before we decided just to order a la carte. 

I started with edamame and a house salad. I love the cold, creamy ginger dressing on salads at Japanese restaurants so this didn't disappoint. The edamame was okay, but a little more on the tough side with a little too much salt.

My husband and I shared three rolls for lunch. We enjoyed the Lobster Roll, Red Rock Roll, and Mexican Fiesta Roll. All of them were really good and made me wish we had gone for the all you can eat sushi option. All of the rolls had a great combination of flavors and sauces. Everything tasted very fresh."}
{"text":"I am probably not the best person to talk to in regards to sushi, seeing as how I dislike most seafood options out there. 

We ordered some California, spicy tuna, and salmon with avocado rolls. I wasn't a huge fan of the tuna or salmon, which I tend to enjoy on most occasions at other sushi places. Thus, we ended up ordering three more plates of California rolls! Hard to mess those up.

However, prices are more than decent (50% off for rolls), service was good, and atmosphere was enjoyable. It'd be fun to go with a large group and try out the teppanyaki. Another added bonus (for me)-- they play kpop and jpop while you dine! 

**Note: There is an all-you-can-eat option for about $26 (dinner) with a 45-minute time limit. Make sure you specify if you're doing AYCE or à la carte, otherwise they will probably charge you for AYCE!"}
{"text":"I must update this after Freddy, the owner contacted me to apologize and sent me a gift certificate to come back. He knows who his regulars are. He actually explained why they couldn't offer AYCE at the hibachi and it makes sense.  We came in for my MIL's birthday and what a nice experience.  Seemed like the staff was prepped and on their game that night. Sushi was good and made its way to our table very quickly. Thank you Freddy for the opportunity to come back again. You and your staff turned it around completely and made it a great night for our family."}
{"text":"First time there tonight. It was great the chef made the event more enjoyable. Food was great"}
{"text":"Tried the california roll, albacore nigiri, and spicy crab roll. For the price, everything was decent. A cheap sushi type of place, not somewhere I'd go if I had a craving for real, quality sushi. But for a quick fix of cheap sushi, I would probably come again.

California roll-- fine and it probably my favorite; it's hard to go wrong with it or mess it up. 
Albacore nigiri--definitely had better.
Spicy crab roll--pretty much just a california roll but spicy. 

They serve tap water, and you can still taste it through the lemon wedge flavor. Personally, I can't tolerate the taste of tap water so I would bring my own if I were to come again."}
{"text":"Food and server was good,.....BUT....., the management should have advised our party of 15 that their women's restroom was out of order prior to seating and cooking our meal in front of us. They knew this prior and still served us!  I honestly believe they violated a health code of Clark County Nevada. Very disappointed and where do those waiting on you take care of their business when the need hits?  This was brought to managements attention when two women had to go to a casino to use the restroom. They said they were closing their doors but folks were still coming in???  Just isn't right......."}
{"text":"The worst service. Ruined steak and lobster gave no discount. Waiter slow. All you eat sushi is only an hour. The sushi comes out so slow you couldn't get more if you tried. Will NEVER come back."}
{"text":"Waited over 7 minutes to get seated and it was before 2:00pm by the time I got my order in it was pat 2pm and it cost me the dinner rate instead of the lunch rate. Never go back again rude waitress."}
{"text":"Fabulous. I went here in May and forgot to finish my review. This place must be documented, it is awesome! I was in yellowtail heaven, and everything was amazing and fresh. Here are some items we ordered on AYCE: 

Samurai spicy yellowtail sashimi and tuna
Samurai spicy yellowtail roll
I love yellowtail roll 
Sweet shrimp
lots of nigiri!

DELICIOUS!!!!!"}
{"text":"I recently dropped in for some sushi and was pretty underwhelmed.  I used to go here quite often for the AYCE at lunch.  The experience was always very good (but not outstanding).  I sometimes did the half price sushi (even takeout!)  if I didn't have the room for AYCE.  On this recent visit, the half-price sign was gone from the front but I went in anyway.  Turns out they still have this special going on.  Anyway, once seated (at about 2:45), I asked to do the AYCE and was given the dinner price of 26.95 each!  REALLY?!  No way...not here.  I did the half off and was rather disappointed with the size of the rolls.  The taste was OK but something was lacking.  I do like their deep-fried rolls (why doesnt Island Sushi make those?!) and the garlic tuna and cajun albacore were pretty tasty.  The specialty rolls were a miss for me.  The gal who was our server seemed to have an attitude.  Now I am NOT one of those who treat anyone badly....in fact, just the opposite.  I believe that you get back what you give out.  This gal had a chip on her shoulder and she was in a mood...with all the other tables nearby.  I will say that others in the restaurant were VERY friendly.  For about the same price, I will stick with ISLAND SUSHI which is a FANTASTIC place."}
{"text":"Geo was out chef behind the grill! Absolutely amazing! We been twice and he has made it a great experience for us!"}
{"text":"I came here yesterday and had ordered the steak teppanyaki. The food was delicious! ALSO Rebecca was the assigned server for our table and she was so helpful and kind. She recommended steak teppanyaki and it was the best choice I have ever made! I'll definitely be going back!!"}
{"text":"Don't love it, don't hate it...the waiter taking our drink order was gone a LOOONG time.  But the Singapore Slings were YUMMY and very strong.  The food on the hibachi grill was good-especially the scallops.  I would go back again if someone else paid for it...otherwise I would save my money and 1.) get sushi at MOMO's or 2.) make scallops at home myself so I can wear my PJs and watch Game of Thrones."}
{"text":"Samurai is my go-to for all you can eat sushi. The staff here is very friendly and welcoming. They're super fast in delivering your food and the quality is amazing. They never disappoint. If you ever come here, get the all you can eat; you won't regret it."}
{"text":"The teppanyaki here is awesome! Everything was delicious, the service was fast & or chef was really great! Will definitely be going back."}
{"text":"Love going to their \"all you can eat\" sushi dinner. At only $26 it is affordable and super yummy. The staff is super nice and the facility is clean. It always seems to be a bit slow, but I usually go around 5pm."}
{"text":"Happy early birthday to me! :p cute place great prices for teppanyaki! 50% off sushi everyday can't beat that! Me and my husband shared the filet mignon, chicken teriyaki, and shrimp! For about 30 dollars :)) not bad at all. Of course we had a few drinks soo it cost a little more ;)). I can't wait to go back!!"}
{"text":"I love coming here!! The booths are very closed off and intimate which is nice when you need some quiet. I've never had to wait for a table and the staff is very nice. Their sushi menu is also half price all day, everyday, which I find humorous and delicious! Great spot for a quick lunch or dinner!"}
{"text":"I came here for lunch today with my boyfriend and was very pleased. First off, the service was great. Our waitress was friendly and prompt, and was good about keeping us updated on our wait. The food itself was fantastic. We got the Sexy Girl, Samurai Surf and Turf, Bonsai, and Shrimp Lovers. They were all delicious. No complaints at all on the food quality. And the price was fantastic! I was shocked by how inexpensive it was, especially considering how good everything was. My only complaints are that the music was way too loud, which made it not as relaxing as most sushi restaurants, and they gave us two little pieces of ginger that was kind of dry. I personally prefer a generous amount. But that wasn't super important. We will definitely return."}
{"text":"Samurai Japanese Steakhouse is my family's go-to place for very special occasions. Recently we had friends come in from Alaska and they rented a limo to explore the strip and to take us somewhere to eat. Samurai was our choice on where to go first and as always they delivered an outstanding experience that still has our friends talking about it days later. 

On our most recent visit we had the privilege of having their head Tappanyaki chef put on quite a show for us and he took the time to entertain both the adults in our group and the 7 year old who was with us. While the presentation was very good, the food was exceptional. From the steak that was cooked exactly the way you wanted it that melts in your mouth, to the perfectly prepared lobster tails to the shrimp we loved (and I do mean loved) everything that was prepared for us. 

We did have a slight wait to be seated at the Tappanyaki table. And yes the place is not spotless. The glass on the front door could use some cleaning. And the bathrooms while clean could use some updating. But we ignore that because once our family sits down at the Tappanyaki table we know we're in for a treat, and Samurai never fails to deliver outstanding food at least when it comes to the Tappanyaki experience. 

4 Stars. I won't go with 5 because I wish they would keep someone at the front door to help get you on the wait list faster and a little bit of time spent spiffing the place up to match the excellence of their food would help. But I will say this. While it's not cheap we pay the bill with a smile as we're walking out the door happy and satisfied. And yeah, we will certainly be back."}
{"text":"I've been here 3 times and this has definitely been the worst experience ever.  We were a party of 4 2 of us ordered ala cart and 2 ayce... My brother in law ordered the shrimp fried rice with no onions but it came out with onions and we told the server Alondra, she takes the bowl and disappeared... the rest of the party are done eating and his rice hadn't came out yet.... another server brings the rice out turned over on a plate still with onions in it... Alondra still no where to be found....... I really can't believe the experience I have had... I drove here from N Las Vegas.. guess we won't be making this drive anymore... if I could post with no stars I would..."}
{"text":"Not bad! Typical hibachi place, service and food was exactly what you expect. 
Nothing was overly impressive. 
But no complaints"}
{"text":"We have Brandon as a server every time we go here and he is great. He makes sure we have everything we need, always asks how everything came out and does his best to make sure we have the best possible experience. Aside from the servers the back room is exceptional if I do say so myself. Food always comes out in a timely manner, and the sushi is awesome. Couldn't ask for a better sushi restraunt."}
{"text":"Coming from North Las Vegas I was visiting Henderson to go out and have sushi with my mom, I was happy to find out this restaurant offered a fairly priced all you can eat option. The quality of the fish is very good and the rolls were equally satisfying. Our waitress was very kind and helped us navigate the menu since were were new to that restaurant. 

One thing though, I wish they didn't use so much rice."}
{"text":"After spending time shopping sales at the mall, there's no better time to eat sushi rolls...FOR HALF OFF!  Save even more money? Sure, don't mind if I do.

My mom and I came here in the afternoon, and there were 5 cars in the lot.  Yes!  We get in, are seated and ordered drinks right away.  We then placed out order.  I ordered the Spider Roll, Mexican Roll and 007 and my mom ordered the Lobster Roll and Shrimp Tempura Roll.  You know that wiggle dance you do in your seat when food tastes really good?  Well, we were doing that nearly after every bite.  They were all so fresh and tasty. I don't know what they use in their sauces, but they are all so delicious.  My taste buds kept wanting more, but my stomach was telling me enough.  The total for 5 rolls and an iced tea was $35.  Not bad at all and we both left happy and full.  They have AYCE, but I usually am unable to eat enough rolls to get my money's worth.  I did see that there was a time limit: lunch is 45 min and dinner 60 min.

My mom is not the best person with chopsticks, but refused to use a fork.  Our waitress gave her trainers to slip her chopsticks into, showed her how to use them, and my mom kept clicking them, she was so happy.  She also came by frequently to see how we were doing.

I had been here before in the past in the evening when there were more people, but I don't recall my rolls tasting as good as they did when I came back.  Now I crave their rolls just about everyday.  And the service was just as good in the evening as it was in the afternoon. I can't wait till my next trip here."}
{"text":"This is definitely the go to spot for quick, delicious,  and high quality sushi.  They never seem to disappoint.  Me and my girlfriend have been coming here close to a year now and the servers recognize us all the time and are always upset when we don't come in together.   They make us feel at home.  They're always on top of their attentiveness.   They come by often to check how we are doing and see if we need a refill or anymore sushi.   Perfect thing is it isn't too often so we can actually have a conversation without being interrupted every couple of minutes.  The best thing about this place is their half off deals on almost everything.  It's definitely worth the 4-6 dollars for 8 rolls per dish.  Music isn't overwhelmingly loud, just right.  We are always going to be coming back to this spot.  They also half the center catering people that make the food right in front of you in the center of their building,   so right when you walk in you're mesmerized about how awesome these people are,  very impressive with their showings while they cook,  and they also incorporate a little comedy act every time they cook.  Overall great place.  We'll always be coming back.  The food,  servers, and service is just great for what you are paying for."}
{"text":"Went here last night for the first time (AYCE Sushi) and won't be going back. 
First bad sign: menu was dirty with some kind of old sauce all over it. 
Pickled ginger and wasabi were both dried out and sad looking, like they filled the dish hours before and let it sit. 
Waitress very dictating about the rules. We do AYCE sushi a lot, we get it. No need to point out how many pieces of nigiri I'm ordering or tell me to order many small orders instead of one large one. 
I have concerns about their food handling procedures: edamame on top was lukewarm, pieces under those were hot, and ones under those were ice cold. 
Sexy girl roll comes out (which we didn't order but weren't sure since they took our menu), the tempura shrimp in the roll wasn't warm at all. 
All other sushi was about room temp but the screaming-O was ice cold. 
Most of the sushi rolls were not well wrapped and fell apart. 
Nothing tasted fresh. Final small order took twenty minutes to come out. 
Had to ask for the check three times. 
In all a mediocre dining experience. With all our local restaurant choices, this place needs to step it up."}
{"text":"I would have given this a 3rd star but due to poor service I gave it 2... My boyfriend and I came here for the first time Friday night and though the food wasn't bad it wasn't anything worth talking about either. Fried rice was bland, sushi OK and we ordered lobster that looked like cat food so that's as far as I'll go... then there was our waitress who seemed extremely annoyed at the fact that she had wait on us..?? Never smiled, didn't ask if had any questions about the menu. Dunno, not worth going back. Better off paying a little more for better quality/service @Benihana."}
{"text":"This was our first hibachi experience and it was a lot of fun! Our chef, Peter, was hilarious all the way through our meal! He's a large part of the reason it's 4 stars for my review. 

The food was pretty good from the grill though though the salad and soup they serve prior to the meal leave a lot to be desired - small portions are fine but they just weren't tasty. 

I ordered shrimp from the hibatchi and my hubs got chicken and steak. The meals also came with grilled vegetables and rice. Everything from the hibachi grill was very tasty and well cooked! 

I did find fault in a couple of small things - 1. Being our first time there it would have been nice to have a little explanation of how it worked (they wait for the table to fill up a little at the seating time and then send a chef over. I was starving and there was no explanation about the wait for our chef). 2. Decor, counters where we sat, and the overall feel of the restaurant was a little dated/dingy feeling. 

The couple of negatives were far outweighed by the quality of the actual meal and the interaction with the chef."}
{"text":"This place is one of my favorite spots in Henderson.  The food is very consistent.  Another that is consistent is the slow service though"}
{"text":"I love that the booths are high for extra privacy. The lady serving us was sweet. I got the chicken teriyaki bento box with the Lisa Lisa rolls. My hubby got the all you can eat which he enjoyed. I liked it all though I feel like I've had better sushi elsewhere."}
{"text":"Wow! This place blew me away! Thought it was going to be bad, but it exceeded my expectations.

We got AYCE-- shrimp tempura, screaming O, seaweed salad. Loved them, especially that they also have huge servings. Also had couple of nigiri, which is not the best proportion of rice to protein ratio but I loved it anyway. Also tried the surf and turf and shrimp tempura roll. Dessert was decent. My friend got mochi and I got the cheescake. Bill was $63.09 with 2 iced teas and taxes without the tip.

Definitely a must try if you're in Henderson!"}
{"text":"Lunch All You can Eat: 21.95

Dinner All You can Eat: 26.95

Rules for All You Can eat:
Lunch (45 Mins) Dinner (60 Mins)
Sharing food is NOT allowed
Remaining food in NOT allowed
Rice is part of the Sushi and Rolls
Remaining food will be charged A La Carte Price
Take out is NOT allowed
(All reasonable and understandable rules)

Favorite Dishes:
Garlic Tuna Nigiri
Tuna Poke Salad
Fire Roll (more spicy than usual)
*Cajun Albacore* (must try!)
*Spicy Yellowtail* (must try)
Macaroons are on the desert menu!

I would rank this place in my top 10 favorite AYCE places in Vegas. 

Service was great! Sushi was good! Nice restaurant!"}
{"text":"I came here twice.  One a few weeks ago, second time is right now.  I am literally sitting in the restaurant writing this review.

The first time we came, it was amazing.  The waitress was fantastic, the food was filling.

Second time, meaning right now.  Total opposite.  Maybe it's because we came when they opened, but I'm annoyed.  It took them ten minute to sit us, then it took another five minutes to ask for our drinks and another ten minutes to take our order.  Keep in mind, we're the only one in the restaurant and right behind us we hear the workers gossiping and talking.  Needless to say, I'm annoyed.  

Homeboy isn't getting tipped."}
{"text":"We had such a great experience here last night and want this amazing staff to be recongnized for their outstanding service. We were on our way to another restaurant and stopped here instead. We came in kind of late and they sat us at our own table at the grill. We had an amazing chef who told us he had been there for 15 years. When he came over to us he fist pumped my husband and gave me a hug. He acted like he knew us for years and made us feel very welcome. He was very nice and talkative. He made us special sauces for our food. It was like having our very own personal chef. He definitely made a connection with us and created a lasting impression, two important things when it comes to customer service. Oh, the food was great, too! As we left, the crew was at the door giving us a hand shake and another hug. I would definitely go back."}
{"text":"For years my husband and I have recommended this place to friends and family but it has become such an embarrassment now. How is it that \"walk-ins\" have the priority to reservations? So if you make a reservation you sit at the end or edge of the table but a \"walk-in\" gets front row to the hibachi grill. The inconsistency of the cooks are so ridiculous and argued with me in front of the entire table opposed to talking to me on the side. I spoke to the manager \"Brandon\" behind my husbands back to not upset him but found out my husband had also spoke to \"Brandon\" behind my back to not upset our son. This dinner was his choice for his birthday dinner. Observe two open seats due to poor hosting on both sides of this parent and child during this restaurants \"rush hour\". Please rethink your visit here and make the reservation where it counts and they want your business like Ohjah or Benihana's"}
{"text":"I love this place. Always do family dinners here. The wait is not ever too long & the food is always really good. I have yet to have a complaint &had been coming here for a couple years"}
{"text":"This place was very good. The sushi is fresh and nice size rolls. Most of the sushi menu is 50% off which is a great deal. They offer all you can eat if you are really hungry. The appetizers were great as well. Don't get to sit at a teppanyaki table this visit but saw a family's food and it looked great. Only gave it 4 stars because of the smell in the restaurant. It smelled like natural gas the whole visit and I don't know if this was caused by them starting all the table or if there was a problem. Will definitely go back and hopefully change this to 5 stars. Finding AYCE sushi in Hendo is hard to find."}
{"text":"Food 2/5
Atmosphere 1/5
Service 3/5
Value 1/5

Food quality of some items is acceptable. Not terrible but there are better options."}
{"text":"Came here on Sunday At 1130 am to have a celebratory birthday lunch with my son's friend.  I enjoyed coming here before it gets too busy!  

1.  Ambiance - 4 star very nice and just right amount of lighting. Nice and roomy with bar area, sushi area, teppanyaki, normal seating.   There are three main teppanyaki areas that are two grills per area and seating for 20. However 2 of the seats are an add on as it seems someone bridges the two 9 seat grill areas with an extended table ao two can fit. I would not want to sit at that spot!

2.  The chef- 5 star-  John the chef for  teppan yaki was great! Entertaining, fun, listens to you and makes you feel very comfortable. Ask for him if you go there. 

3.  Menu - 5 star - awesome menu from sushi to teriyaki to combo dishes to teppan yaki, all the choices for all tastes!

4.  The food- 2.5 star. Hmm maybe coming on Sunday was not the right timing. 

A.  Miso soup 1 star. Uninspiring and not tasteful. Almost water like. The consistency was very diluted. The miso was not suspended well in the broth and the broth was  well watery. 

B.  Salad - 1 star - they serve the salad with Miso Dressing and the salad was drenched in this!  The bottom inch of the bowl was full of miso dressing. Liquid. Japanese food is all about subtlety and this was not subtle. 

C. Teppan yaki-  3 star - we ordered 4 orders of steak and lobster and they only had three. That is odd and yet they did offer to split it four ways and brought lots of shrimp. So that was a great solution. The steak was good, the chicken good, the salmon great, the fried rice nice. Okay stuff overall.   A big believer in Japanese food and natural flavored and since there is so much sauce I say this was good just hard to compare. 

I like the place. I think it is a good place to entertain friends. 

The entertainment factor is great,  the teppan yaki is okay too. I will be coming back to try the sushi as many yelpers rave about this!"}
{"text":"I have mixed feelings about this restaurant. I think the food was good ( I ordered a variety of sushi) and I also liked the fast service. What I don't like is the all you can eat price. This price does not justify the amount of sushi you need to eat to get your money's worth. You basically have to order over 5 rolls to pay what the all you can eat price is. That seems like A LOT of sushi....and it is! 

I ended up ordering two all you can eat. I liked it but I had to end up paying over (full price) for the rolls I didn't eat. I understand this rule is necessary so that people don't over order. I wish they had the option to order a half roll instead of a full one. I like to order variety and with the all you can eat option is not really possible unless you eat a lot and are ok with paying for the leftovers. 

Overall I think I would visit again...but I would not get the all you can eat option. Their regular prices are great and if you don't eat a lot of sushi this is a great affordable restaurant to come."}
{"text":"My wife and I finally got to try out this place.  We've been talking about it for a few years, but it's never been at the top of our list, with so many great options in this area.

The wait to get our food was a little longer than we anticipated, we surmised this was because they only had a couple people actually working the hibachi grills.  Also, there was no explanation of the system, what to expect, or the menu from wait staff.  We were left to figure everything out on our own.  

Once our chef arrived, the experience was fantastic.  The food was ok.  I would not return for the food.  But Peter was very entertaining and made the experience a delight and making up for only \"ok\" food.

I would give the wait staff and food 3 stars, and Peter, our chef, 5 stars."}
{"text":"This is the Japanese restaurant that has taken over the building where Fukuda once was, at Sunset and Marks. I have made a few visits already, and have been thoroughly impressed.

If you were a regular Fukuda patron, fear not - from what I can tell most of the food items are pretty much the same, and that's a good thing. From what I can tell, the only substantial changes have been some of the decor, and some of the employees, and owners. 

Each time I've visited, the staff have always been friendly, servers and teppanyaki chefs alike. Everyone here seems to enjoy their job, and they create a solid, welcoming atmosphere. The decor inside the restaurant is top-notch. Not quite Benihana-level fancy, but there's only so much you can do with a building like this, and I think they have created a solid atmosphere in all aspects.

The food is nothing short of excellent. I am typically a chicken and steak eater, and their teppanyaki takes on these items are great. The soup and fried rice are amongst the best I have had in these kinds of restaurants. With your meal, they even provide noodles, something not many other restaurants like this do - and they are quite delicious as well. 

As far as pricing goes, they are more than fair. I have seen similar items at other teppanyaki-style restaurants go for far more expensive prices - and they generally offer far less food with their meals. These portions are large, and if anything, I believe you are getting an excellent deal here.

I wouldn't necessarily call this the best teppanyaki-style restaurant I have ever eaten in, but at the rate things are going, that could change very soon. They have great staff, excellent food, a good atmosphere, and a convenient location. For the time being I am giving this place a solid 4/5 rating, and that could be going up to a full 5/5 very soon.

Final verdict? I strongly recommend this restaurant!"}
{"text":"Looooove this place!! Food is sooo good!! Service is great. Ask for Gio if you do Hibachi! Portions are huge you will not be disappointed. Family friendly too :)"}
{"text":"We didn't know they had all-you-can-eat before we hit their place. We gave it a try after we went through their menu. Their baked mussels were really delicious. Sushi taste ok but you can't beat that price. Maybe next time we would want to try their steak."}
{"text":"Went here for the sushi, but the teppanyaki smelled amazing. Must try next time! All you can eat sushi on a Friday night!

SERVICE: Let me start with service first. Our waitress was nice and friendly. But she was not attentive. She rarely came to our table when we wanted to order. Thankfully our first round of sushi we ordered quite a bit. Maybe because it was a Friday night, but the cooks were slow. It took maybe 45 minutes to get our first order! And it came so sporadically. We would get one plate, finish that plate, wait another 15-20 minutes, get another plate. It was RIDICIULOUS. I mean, you go to all you can eat sushi with an appetite. And having to wait so long for your food is just not what you want or expect. The waitress was nice enough to apologize that our food was so slow. I think overall it took us 2 hours to eat all you can eat sushi because of the waiting. We probably got less than 8 plates. That's absurd. 

FOOD: the food though was so good! The fish was fresh and cut to decent sizes. When you bit into the salmon you can bite into it without having to chew it in half, so fresh. The rolls we got were all delicious, I'm sure the other rolls on the menu are just as good!!! The nigiri is what we mainly went for, and what I would go back for! 

ENVIORNMENT:  A good size alcoholic bar area! The sushi bar looked like a good size as well! The restaurant itself is very big spacious. Enough teppanyaki tables and a good amount of tables for eating sushi.

ETC: If you come here on a Friday night, come here early!!! Or you will be waiting forever for your sushi..."}
{"text":"I love sushi! So when I found out this place offered half off all sushi rolls I was there! I usually order to go when I order from Samurai's.
Here are some of my favorite rolls! 

California Roll, Spicy Crab Roll, Philadelphia Roll, Avocado Roll, Shrimp Tempura Roll, Spider Roll, Vegas Roll. 
On their special roll list my favorites are...007, Pimp My Ride, Green Valley Roll (this is my all time fav), Love Roll, Rainbow on Spicy Tuna, and the Yum Yum.

They also have AYCE if you want to eat in. For yummy and reasonable priced sushi I love this place. When i'm craving sushi this is were i'll be!"}
{"text":"I love this place I have been twice now and I love all you can eat sushi! There fish is so fresh and delicious. The salads are tasty to as well as the cheesecake can't wait to go again next week."}
{"text":"All the food is incredible, but especially the prawns.  They melt in your mouth.  Such an awesome place!"}
{"text":"I've been going to Samurai since it's opened and it's one of my favorite sushi places to go to. The service is always so nice and the chef's work really hard on busy days. 10/10 recommend!!"}
{"text":"Love this place! Great fun environment for family and friends to get together. Not to mention the sushi is bomb! (At cheap prices)

A must try in my book!!"}
{"text":"I'm not sure why the proprietor thinks continuing to harass me online and threaten me is hurting ME. This is his establishment he represents and as of this point, he is coming off as rather deranged because someone had an opinion he didn't like. I WILL NOT REMOVE MY REVIEW. LEAVE ME ALONE FREDDY. CEASE AND DESIST.

We walked in and the place looked rundown. I guess you could say it is family friendly as it was full of kids and babies. That's not negative, just a helpful tip. However, it is certainly not even close to a classy establishment. It was a dive. No hostess to greet us, we left. I did give two stars but decided to change it to one due to recent angry and threatening messages from the owner because I spoke my mind. It's called Freedom of Speech. It's in the Constitution and it's allowed. 

My advice to management would be, stop lashing out at reviewers who had a bad experience and I can see on here there are a few of us describing the same thing. Rather, learn from their words and take steps to rectify the problems. Spend some cash, not a lot and make the place a little nicer, a little cleaner. Train some hostesses. You'll appeal to a wider demographic and might actually make more money and that is the goal, I'm sure.

Yes I am different, Freddy. I don't respond to harassment and threats and never will. I'm forced to communicate this way as you have shut down any effort to communicate by blocking me after you sent me your threats so therefore, here we have it. Be grateful I did change it. Yelp handled it the first time. You've made your point, you're only making yourself look nuts at this point but hey, it's your business you're representing not mine. I've gone as far as I'm willing to in order to placate you now leave me alone."}
{"text":"I love the food here! Sushi and grill are both fantastic , great chefs! Everyone is very friendly nice staff"}
{"text":"We used order to-go from here every now and then because its right down the street from our house and they used to do 50% off sushi. Their sushi is mediocre. Nothing to brag about. We have dined in a couple of times and their service is always HORRIBLE! Like really horrible. They take a very long time to get your order and they hardly ever come check on you. You literally have to go hunt them down to place an order. Also, they finally got their website up with a menu, but the rolls have no description on them (not very helpful)."}
{"text":"i often go here for lunch because their 50 % off menu is awesome i actually feel like the money i spend here is worth it. its still pricey for lunch i tend to order like 3 rolls and it comes out to $20. still its a great deal"}
{"text":"I don't do Sushi but my husband does so while out shopping tonight I suggested that we go here for dinner. What a pleasant surprise! The food and service were outstanding. Ask for Jenny to help you she took the fear of not knowing what to eat out of the mix. Thank you.
This is a must for sushi lovers as the husband was over the mood with it."}
{"text":"Thus place was recommended by one of our friends
And it's must try place ! Everything was so good!
Sexy mama, surf turf, yellowtail and just can't 
Wait til go back !
AND IT'S GOOD PRICE !"}
{"text":"Teppan, the kids loved it. Steak was juicy. Kids had fun watching the show. I would definitely return"}
{"text":"...fun place to take the family-with kids I should add...decent food and chefs are entertaining...a win win...just sayn"}
{"text":"This may be the best teppanyaki I've ever had! 

Went on Christmas eve and made a reservation.  They have a ton of tables there so it's a lot easier to get a spot on a busy day than at the one by my house.  

The amount of food we got was ridiculous!  I got the teriyaki chicken and it was amazing and the portion, huge!  The meal comes with the soup and salad, white rice which you can upgrade to fried, and noodles.  The noodles are an added bonus because I've found that most places around here don't include them.  

The prices are very reasonable and the service was good.  And who doesn't love a good show with their meal lol.  Will definitely be back!"}
{"text":"Fast and cheap. I'm a big fan of Japanese food so I'm pretty harsh when it comes to quality.  

The place was pretty empty when we came in. The hostess could have been a bit friendlier when she was trying to seat us especially since there was only another small party before us. She tried seating is at the same time which is weird since we were in no rush.

We ended up ordering a spider roll (my favorite) and a dragon roll (one of my boyfriend's favorites) and one teriyaki bento. 

The rolls arrived quickly but they were on the small side. I'm not sure if it was because we asked for no avocado (due to a food allergy my boyfriend has) or because of the price of the rolls (which are pretty cheap). The bento box was pretty generous though when it came to portions but lacked flavor in the chicken and the dressing for the salad.

Overall, if you want quick and cheap food this would be the place for you but don't be surprised if your food is lacking in the flavor department."}
{"text":"3.5 stars averaging it to a 4-star because  it has 50% off on all sushi instead of paying all you can eat sushi. 
We would usually go here when craving sushi & the sushi is good but nothing short of amazing.  

The service is sub-par, you would always have to call for them to get your attention.  When its someone's birthday they blast their own version of a birthday song on their speakers and its pretty fun to listen and sing along with."}
{"text":"As regulars, my boyfriend and I LOVE Samurai steakhouse. We come at least twice a month and love everything. The atmosphere, chefs, servers, and of course THE FOOD is always beyond expectation. Five stars in our book everyday! 

Ps one of the few Japanese steakhouses that still serves the pink (yum-yum) sauce! NEVER GET RID OF IT!"}
{"text":"The sushi and sashimi is the best in southern Nevada. Once you try this place, you won't go any where else!!! The Popcorn Lobster roll, the spicy tuna sashimi, the Cajun Albacore Sashimi and the angry lion are my favorites!!!"}
{"text":"It's close and the food is always been good everytime I've come to eat. Great food great atmosphere and even good for the kids if you want dinner and a show."}
{"text":"I think this is my overall favorite AYCE sushi restaurant in Vegas.  

Sure Goyeman might have more creative specials, and Twister might have faster service, and Island might have better sides, but they also have some big problems too.

Samuri has a wonderful selection of no rice options (lovely wrap, stuffed tomato, poke salad, screaming o, and 3 or 4 types of sashimi), great chefs that will customize for you, fast service (if you are the bar), and a pretty wide selection of nigiri, and a good selection of rolls that aren't all based on a california roll.  

Plus the restaurant is spacious, so you never feel crowded, and we've never had to wait for a table.  

Last two things, they don't do a stamp card but their prices are a buck or two cheaper than the places that do, so it evens out.  And they are currently running a special of 50% off all sushi, so if you aren't that hungry this is another good option.

Only bad side, they keep the restaurant on the cold side because of the teppanyaki tables, so you may want to bring a jacket..."}
{"text":"I just had a fab dinner with my husband and all the other guests at our teppan table. Cindy who greeted us, waited on us and brought us everything was so sweet and awesome. We ordered sushi appetizers, cocktails which were all perfect. Then the chef came and he was incredible. He was new to town and he was one of the best teppan chefs yet that I have had in town. What was his name????? He was Mexican........he said so, from Texas. He had so many cool tricks beyond the volcano, etc. anyway, the food, all fresh, cooked perfectly, tasty, and awesome. We had 2 full entrees with steak and seafood, 4 drinks, 2 different orders of sushi and it was unbelievably inexpensive for all that we had. Cindy and the Chef were people we cannot wait to see when we come back, again, and again....Great place, great food, great restaurant!"}
{"text":"Two great reasons for me to come here: Teppan and AYCE. Maybe I should attempt to do both at the same time? That's something to put on the bucket list, but I have come to Samurai for each individually and I'm a fan of both. If you want to sit at the hibachi, I would definitely recommend reservations on the weekend. Otherwise, they have about a 10-12 seat sushi bar with a full dining area.

The AYCE is usually what I come here for. I've done it for lunch and have been in and out in less than an hour when I sit at the sushi bar. The sushi selection is standard and the service is consistently good for us. If you're not into AYCE, all of the nigiri and rolls are listed as half off. They also have a full selection of bento boxes which my wife orders from and they also have udon and ramen which I have yet to try.

We've done the hibachi once with the family and had a very enjoyable experience. The classic performance tricks were done which entertained everyone, especially the children. The chef batted .000 on the shrimp toss but he did well in cooking the food. Everyone was pleased with the grill items and their portions.

We'll be back again depending on what the family wants."}
{"text":"We stopped here on the way home because we had a hankering for sushi!

When we looked at the menu we were surprised to see that it said HALF OFF SUSHI prices!

We didn't know what to expect so gave it a shot...

We tried the rainbow roll, crunch spicy tuna, and another roll with a sweet sauce on top. Each roll was delicious - but nothing to 'brag' about...

The green tea mochi was pretty delicious as a dessert!

I wasn't too impressed with the cleanliness of the restaurant...it's rating made me have another expectation of the place and when I went to use the restroom it was in pretty bad shape...a restaurant definitely isn't just based on food alone."}
{"text":"It almost felt like having an affair coming here, if you read my reviews you will find that I am a huge fan of Geisha House, but we were out shopping and this place was near by.

We had a little wait to be seated, no worries, we arrived shortly after the evening rush so expected a wait.

After being seated, we waited...and waited..and waited...Finally a waitress asked us if we were ready to order, I said \"sure, let me get the Turducken with all the sides\"

A blank look from the waitress....

\"Oh you don't have menu's !\" she finally caught on....After that service was smooth.

Steak (new york) shrimp and chicken, fried rice and some veggies...

All in all pretty good, for the price very good.

Everything cooked well and it certainly hit the spot.

The only thing I will say is, it wasn't as good as Geisha House, the portions were larger (lots of shrimp) but Geisha House just plain tastes better.

This is of course subjective, both places are good, but Geisha House is till my true love."}
{"text":"Breathtaking experience. Food from another world. Our Chef Gio did not only entertain us in the best possible way but he also created incredible taste sensations: special sauces, unbelievably tender meat (according to my fiancée), calamari like directly from the fishing boat, perfectly orchestrated vegetable and rice. Simply amazing!"}
{"text":"The service was good and the food wasn't as great as expected. It's very similar to other Hibachi Places I've been too. The plates had a great deal of food but seemed to have been thrown together. Nothing special."}
{"text":"Samurai Steakhouse is our go-to place for almost every special occasion or family get together. I have a lot great memories here. The food is delicious! I've never been a fan of fried rice at most places, it's usually kind of bland to me. But Samurai's fried rice is killer! They also have a great sushi selection.

We always make sure that we sit with Chef Gio, we've been going here for so long he remembers how we like our food cooked and our sauces made. All of the chefs are great and entertaining but he's our guy! Compared to most other tepenyaki places Samurai's prices are really reasonable and you always leave full and with to go boxes!"}
{"text":"Consistently good food, good service.  Sushi portions could be a little bigger but the sushi is always fresh."}
{"text":"Besides Sakana, this is my go to place on this side of town for ayce sushi, now that I've been there 3 times. 

Service: overall great once you get seated. Two of the three times I walked in, I seated myself after waiting near the \"Please wait to be seated\" sign for about 5 minutes without any human interaction. Once seated though, they're attentive, efficient, and helpful with food selection & drink refills.

Food: Everything is \"fresh\" and tasty. I usually recommend individual rolls, but here, everything is great. I like their spin on the Rainbow Roll, with spicy crab inside instead of the fake stuff. 

Didn't get 5 stars for 2 reasons: Because they need better appetizer selection. Chicken and beef teriyaki, nachos, and other weird creations are avail at their competitors like Sakana and Sushi Twister. They don't include their best stuff in with their lunch price like most places do. I've lived all over the country and Vegas has more ayce sushi places than anywhere else, so the competition is HIGH. Need to keep up with rivals. Haha"}
{"text":"We came here last Friday for my fathers birthday! We had a reservation and it was busy! They set up our area and our drink orders where taken. Shortly after when everyone was seated our food orders were taken and then chefs came through with the ingredients for our food. We had an amazing and absolute fun time. The chef was very interactive with our group and the group that was seated with us. Delicious food! We even ordered rolls and extra salads! Our drinks were always filled up! Great portions, so much so we all had enough for a couple of meals to take home. They did bring out a birthday dessert for my father, and Cindy and another server even did a little cute dance to make things more enjoyable! I will DEFINITELY goback! Service, food, and people were great! If you haven't experienced it I HIGHLY recommend you do so soon!"}
{"text":"This is my favorite hibachi restaurant in the valley. And i feel like I've tried them all. The staff is always super friendly and the food never disappoints. If like hibachi as much as i do, this is your place. The chicken is juicy, the steak is tender and the sushi is on point."}
{"text":"First time dining here so we went for an early dinner to avoid the crowds but it was pretty much empty. There was no hostess as we walked in and stood in the entry for awhile until someone saw us and seated us.

Then we waited at least 20 minutes for our waitress to come to our table while she passed our table several times completely ignoring us. They sat 2 more tables after us and she quickly served them first. 

We almost walked out before she finally stopped at our table with not a single greeting, smile and hardly a word. It was very uncomfortable. She took our order then disappeared again. We were hoping the food would make up for the horrible service but the bento boxes were mediocre and not appetizing. We did not finish our food and she did not return after we got our food. We just wanted to leave. We flagged her down to get the check and of course that came quickly.

We never felt so relieved to leave an establishment before."}
{"text":"I went to my trusty Yelp app looking for some good sushi. After having intestinal surgery 3 months ago, I was ecstatic when I finally got the okay to eat sushi, as the craving had intensified while I couldn't have it. Of course, right?! Although I live in California, I come to Vegas 2-3 times per month. This city is literally a second home for me. I like to find regular places that I can go to that have consistently good food and service. I'll be honest, the proximity to the hotel is what made me choose Samurai; that and the decent reviews. Many of the photos were two to three years old or more. Not seeing recent photos was a concern, especially since the page is owned/claimed by the owner, Freddy. He could post some recent pics of the food, the restaurant, the guests... I hope he does. Seeing recent pictures definitely helps many people, myself included to decide on if I want to stop in or not. 

I read the review posted by Sera and I was a little surprised by it. I agree that there were kids in there when I went in, myself. However, how those kids behaved had nothing to do with the establishment and everything to do with the shitty parenting. For example, On my first visit, I ordered take out and waited up front. This kid who had to be maybe five or six kept running up to the front and he'd sit on the bench right by the front door and play with his toy. His parents took their sweet ass time coming to check on him. This kid must have run back and forth five times. He could have gone right out the front door or someone could have taken him. Regardless, to me, it didn't reflect on the restaurant. Secondly, not having a hostess standing up there was no big deal for me. I figure at busier times, someone is at the front desk, which rang true when we walked in for dinner the other night. The restaurant was nicer than I thought, after reading her review. I really expected to walk into a rinky dink and this place was nothing like that. 

When I did walk in for lunch on my first visit, it only took maybe 2 minutes for Andrew to walk up and greet me. He was really pleasant when I arrived, and patiently waited as I perused the menu for my to go order; even asking me what I had a taste for, so he could help me narrow down the choices in the menu.  I asked to speak to Freddy, the owner. He said that he wasn't there at the moment and asked if anything was wrong. I told him that nothing was wrong, but that the bad review that was written made me want to come in, rather than prevent me from doing so. I felt like one star was a bit much when the other reviewer stated that she walked in and out, since no one was up front and there was too many kids. I was surprised that she never tried the food. It sounded like from her review that she never had any interaction with anyone. But she's definitely entitled to her opinion. Hope she tries it again, because both their food and customer service is excellent! That, I did not expect. 

That day at lunch, I ordered three rolls; a Lobster Roll, a Crunch Roll, and a Spicy Tuna Roll. I honestly didn't expect much. I thought it would just be average, but these rolls were fucking good! That Crunch Roll has got to be the best that I've ever tried! And that Lobster Roll......OMG!! All three were delicious!! When I got back to the hotel, I shared my new treasures with my group and everyone loved them equally as much as I did. 

Fast forward to the other night, we all decided to go for a Teppanyaki dinner. We have enjoyed Teppanyaki since we took a cruise and they had it. This is where they cook on an open grill for you. Peter was our chef and he was fantastic! He had a great sense of humor, the food was delicious, and we had a great time.  The dinners are priced reasonably and you get a lot of food. The rice was probably my favorite, but I wished he would have seasoned it a lot better. However, I know they keep it neutral for everyone's palate. The shrimp was super flavorful and big and the steak was tender and equally as flavorful! Someone else in our group got lobster and chicken and all of it was delicious, tender, and we had big portions. We ended up taking the rest of our food to go, because we were damn near in a food coma. We will for sure be back! Andrew and Peter were excellent and so was the food and the vibe!"}
{"text":"Ate here this afternoon had the spicy tuna roll. Awesome service was quick and very nice. Great food fresh. And the place was very clean and seemed busy."}
{"text":"Delicious sushi, lots of different rolls to try for different tastes. Can't beat the AYCE price, including appetizers. Fast service, nice wait staff. The teppanyaki is fun to watch. They are nice to our kids. We have been coming here for years and will keep coming."}
{"text":"I have lived in Maui for 18 years and I know great sushi. This place has great sushi and great prices. I promise you will not be disappointed."}
{"text":"Service: 4
Food: 4

Casual lunch/dinner spot that has such friendly service and an extensive menu full of scrumptious options.  Great for friends, family, kids, and groups.  

I had a bento box, and my friend ordered 2 sushi rolls.  Everything smelled and tasted good.  If I'm ever in the area again, I'll go for one of their delicious sushi rolls instead, since that bento box was a little too large for me!  We also noted that they have a buffet, so if you're starving, swing by!"}
{"text":"This is by far the best hibachi in Henderson. Great service, fun environment and clean. They make their own sauces as well and they are superb!"}
{"text":"Interesting service. 
This was our first time here, they didn't explain anything to us (as far as if they had AYCE or not, what the lunch and dinner prices were, or a la carte??) We had to keep asking the waitress how everything worked. 

Lunch is from 11-2:30 at $21.95 / Dinner is from 2:30-close at $26.95.

They give you a time limit to eat your food and you only get 3 rounds to order LOL!!! What is this, a race?? 

Anyway, the food was seriously nothing special. It tasted similar to the sushi you buy at the grocery store. EVERYTHING had crab inside and topped with salmon, and they skimp on the eel, cucumber annnnnd avacado. 

The waitress said, \"Not to bag on my job, but there are way better sushi places than here. They don't even do half orders\".  
Ha!!! RED FLAG! 

The best part is the place is pretty dirty. Their ceiling fans are COVERED in dust and filth (which blows everywhere, onto our food in the air) soo gross! Seee pic! 

Probably wouldn't come back. Actually we wanted to go to Tokyo Boys but they didn't open until 5pm ); too bad."}
{"text":"Quality food and. Great service by Mel our server. He was helpful even with our two toddlers making a mess"}
{"text":"I didn't really like sushi at first so I loved going here since my girl loves sushi and we can have the best of both worlds I would choose steak and lobster and she would have sushi rolls and even though I didn't like sushi she gave me some to try and it was really good from there that now I enjoy sushi because of this place and also their showmanship here on the hibachi grill is awesome they are very funny and fun to watch so I really recommend to try this place"}
{"text":"The food was pretty good and fish seemed pretty fresh which is definitely a huge plus for a sushi restaurant. The staff was all very friendly and helpful as well as attentive to any needs we had at the all-you-can-eat sushi bar. We even did the customary purchasing of hot sake and sharing with the sushi chefs. They were all quite gracious and thanked us very much for sharing a couple of times with them. 

I happened to find this place on Yelp as I was in town for work that entire week. As usual thank you very much to the individuals on Yelp who leave reviews. I would definitely recommend this place and will be back when I go to Vegas again for work."}
{"text":"Tried this place for the first time and I loved it. Came in  on a Sunday around 2pm and it was empty. I sat at the bar and was helped immediately. I did the AYCE. The fish was very fresh. The appetizers were good as well. I don't remember exactly what I ordered but I do know that the super white tuna was superb.  Customer service was great and the sushi chef was very animated and friendly. I will defiantly be back for round two in the near future!"}
{"text":"AYCE Sushi Lunch was great. I am not so familiar with different types of sushi, but I enjoy flavorful, unique food and Samurai delivered.

Went with friends and tried several choices. I can not remember them all but Japanese Lasagna, Sexy Girl andSo Wrong (?) were among our favorites.

Our server was very good, service was very good at the beginning, but became sporadic toward the end of our meal. Did we wear out our AYCE welcome?

It was my first time here, friends had been before. We'll definitely be back."}
{"text":"Food was on par!! Everything tasted great, the servers were very friendly.  The only reason for the 4 stars is because we had a reservation for 7:30 and they didn't seat us until almost 8:15."}
{"text":"Worst service ever!  The lady who sat us was rude! She seemed put out by the fact that we wanted to sit at the hibachi table. Once she finally sat us she gave us our menus and walked away and never came back. I finally flagged her down and asked her for a sushi menu she brought it to me,a few minutes later and never came back to get our order. After waiting for 20 minutes for her to come back we decided to leave. If I could give it negative stars I absolutely would! I will stick to going to mushashi steak house where the food is amazing the service is phenomenal and they appreciate you coming in!  I will never be back here again!"}
{"text":"If I'm looking for a quick place to grab some sushi on a Friday afternoon this is my go to spot.

I've already gone here 3 times and have left satisfied all 3 times although I was probably close to falling into a food coma from all the sushi I ate.

I haven't done the teppanyaki here yet, but it is something I'm interested in experiencing. The first time I ate here was for mother's day and we had a pretty good view of the chef when another group was getting it. 

I order from their single roll menus. I'm not a huge fan of sashimi so any place that offers a good selection on baked and fried rolls is a winner in my book. However, if you're into sashimi this place does offer that as well. I praise menus that signal out which rolls are raw and which ones are fried and baked. It makes it so easy on picky sushi eaters like myself to enjoy a meal =)

All 3 times I've gone here, I NEVER had to wait for a table. So there's a pretty good chance you won't have to wait for one either. The ambiance is on point as well. I'm a strong believer that when eating sushi I need to be in the right environment. This restaurant offers that."}
{"text":"Great time last night. Food was very good and you get a lot. Went their for a bday celebration and was not disappointed. Thanks for a good night"}
{"text":"There's some things about Samurai that I love and some things that I don't particularly like....however the good outweighs the bad in my case.

Pros: 
*Half-off sushi- good quality fish/product, yummy roll combos and easy on your wallet
*Chefs- we request Big John by name. He's funny, energetic and puts on a good show. If we can't get Big John then we ask for Kevin.
*HIbachi- we only eat at the teppan table when we dine in. The filet mignon is awesome and oh so juicy, the chicken is tender and not overcooked and their \"pink seafood sauce\"...well, I dip everything in it :)
*Hours- open for lunch and late at night so I can come in right at noon for lunch or eat a late 10pm dinner. It's convenient! 

Cons:
*Cleanliness- the bathrooms here drive me bananas. They are dirty and have trash everywhere. The rest of the restaurant is pretty decent. 
*Pricing- hibachi is kinda pricy; the filet mignon meal is $24.95, I can go to Ta-Ta's down the street and get the same quality of meat for $14.95. I keep coming back because of the relationship I have formed with the chefs. 
*Chefs- if I don't get Big John or Kevin as my hibachi chefs then it seems like the quality of my meal diminishes. For example: when I order my usual meal they give me fatty scraps of filet and they don't listen to how I liked my meal prepared (aka light pepper, no garlic, real butter, etc).
*AYCE sushi- you can only get AYCE sushi at the sushi bar or at the dining room tables. You cannot get it at the hibachi tables which I think is ridiculous."}
{"text":"Food was good. Price was excellent. Service was horrible! Waited 3 minutes before anyone acknowledged us (restaurant was empty). Our waitress took forever bringing out our drinks and forgot our appetizer. Then after food was delivered, the waitress never checked up us (we needed our drinks refilled) and we had to ask someone else for the check because she was no where to be found."}
{"text":"Great sushi :)I have been coming here for the past 6 years. Never had a problem. The owner is very sweet and funny lol My favorite was the Japanese Lasagna and the Spicy Crab roll."}
{"text":"So after eating here about six times I have noticed the amount of time it takes to get any order or anything done is amazingly long. Usually a 20 minute to thirty minute wait just for first delivery of sushi unless you sit at the bar. Even getting your check will take the understaffed restaurant 15 min. Food isn't bad but the staffing sucks here, this place needs to hire a couple more people."}
{"text":"While it is off the beaten path of the usual sushi restaurants on Eastern or Rainbow, Samurai Japanese does a pretty good job of cooking up some AYCE sushi or some tempanyaki style grill action if that is more your speed. However, if your just looking for a couple of rolls and don't feel like stuffing your face until you tap out, they have been offering a 50% all rolls and nigiri for quite some time now. 

Of the last few times I have been, the service has been on par and the food is pretty good. I mean you do get what you pay for, but I think here, you get a little more bang for your buck compared to many other sushi restaurants in town. I don't have any particular rolls that stand out in my mind as amazing, you must try these when you are here, but I am a huge fan of the cajun albacore and garlic ahi."}
{"text":"This steakhouse is pretty awesome. I got the bento box lunch special and it was delicious. I was actually surprised at how inexpensive it was also. It was $20 for two of us at lunch time. Typically for a Japanese steakhouse that's as nice as this one, you pay a lot more. Great meal, great price, friendly staff, clean facility. Definitely a must-try if you're in the area.

There were a few downsides that didn't necessarily ruin the experience, but they're definitely the reason why I gave them 4 stars and not 5. When we got there, they sat us down and took our orders all within just a few minutes. It was awesome. Then we waited 25 minutes for our food to come out. She didn't come back at all to see if we wanted something while we sat they're. It was just a dull 25 minutes of waiting. Let's just say this isn't necessarily the quickest lunch spot. Also, in the midst of taking our orders, she pulled out the restaurant phone that was ringing and stopped taking orders to answer the phone. It was kind of awkward and we just sat there waiting for her to come back and finish the orders. 

At the end of the day, the downsides that I encountered at the restaurant aren't big enough issues for me to never come back. I actually really enjoyed my time there overall. I'd go back and have another meal there, that's if I have the time to spare."}
{"text":"I would give it 10 stars if I could..Made my daughters B-day very Special....Chef cooking on Grill in front of us, Friendly, funny....Food, Service was excellent. Great prices. Had filet mignon w lobster, rice, noodles w veggies, salad & soup. Shared w my daughter for 8 bucks more..42 bucks for both!! We will be making it a family place to eat twice a month."}
{"text":"Came in and saw the reconstruction and new modeling, that i loved & i was more impressed the food is here . A must go"}
{"text":"Came here after a bad sushi experience across the street. Service was very good. The sushi was very good and prepared much faster. The wasabi was fresh. Portions were larger as well. We will be back."}
{"text":"I found this place on yelp while looking for a decent Japanese place to eat.  I was very happy with the food which was better than average.  The service was good although the waitress kept calling me \"sexy lady\"!  I don't mind a compliment but it was a bit overboard.  The food and price made up for it though!:-)"}
{"text":"Just moved from Los Angeles, ca to Henderson, Nv & I had a HUGE craving for sushi. Passing by on sunset everyday I was like hmmm that place looks good ! I tried it out for the first time & I feel in love ! I had the shrimp tempura & green valley roll since I'm a shrimp fan. They were so nice when I got there & over the phone. I will be back there soon :)"}
{"text":"We have dinner here a few times a year and they never disappoint!! Everyone is very sweet and funny!! The food is always AMAZING"}
{"text":"******EDIT SEE BELOW*********

We had this place for the first time today and first off, no one is in the front to greet you, you had to wait for someone to come up and that took a few minutes, then she was somewhat rude and since there were two parties that came in together she seated us at the same time, maybe because she felt that she was too busy to seat each party by one??

It took a while to get someone over to even get us water and they didn't give us a regular menu, just a sushi menu. My husband isn't a huge sushi fan so we had to wait for seriously 10 minutes for the waiter to even come over for us to order, and by the we weren't fully prepared because we needed a regular menu. So I decided to order my sushi.  Finally after twenty or so minutes my husband was all ready to order, but then my sushi came out WAY before his food even arrived. My sushi was OK, not great like I've had at other places. 

My husband's FINALLY came out after what it seemed like an eternity and it was HUGE, not complaining at all about the amount of food they give you in your bento boxes, but it wasn't good at all and he ordered the beefyaki bento and got like THREE TINY pieces of meat. Rice seemed old as well and he didn't really eat much of anything else except the noodles and beef. 

All in all, I am disappointed because I saw these other reviews and thought it would have been A LOT better. Maybe because we didn't do the grill because they seemed to get spectacular service.

*****edit*****

I decided to change my review due to the fact that the owner just emailed me due to our experience. He really does care and I do believe in giving businesses second chances. Thank you again Freddy for your concern about our dining experience!"}
