{"text":"This is a nice place!  Fresh fish, polite staff, and generous portions.  We tried the salmon and snapper, both were great.  We probably ordered too much because we loved the chips and salsa that we started and finished with.  Would recommend their margaritas!"}
{"text":"Growing up eating fresh mariscos has been a tradition in my family. The standards are set extremely high when it comes to dining at a mariscos restaurant. San Carlos Bay has delivered exquisite dishes with incredible taste and delicacy on a consistent basis. The chefs at San Carlos deserve credit for the fantastic craft that they do. Freshness and the quality of ingredients are superb at this restaurant. I totally recommend this place to anyone who is ready to taste mariscos at their finest."}
{"text":"This place was great I would highly recommend it. My wife don't like seafood but she loved the Baja fish tacos.  The service was very excellent I will be coming back soon."}
{"text":"I love mariscos, but i didnt love San Carlos Bay. To be fair, they are known for their caldos and I just ordered filete veracruzana....but still!!! my dining companion got the fish tacos, standard to be sure, but really below standard. We are regulars at Playa Hermosa, so we decided to try out San Carlos Bay, I wont waste you time on a comparison, just know that all my dislikes about San Carlos Bay do not exist at Playa Hermosa. Service was decent, food just ok, and unless you are over 60 and white - you may stand out. Avoid this establishment and head around the corner for a better atmosphere, way better food and a decent ROA."}
{"text":"I was so excited to eat here after reading the reviews but we were never served so we finally left. We stood outside for 15 minutes waiting for a table then sat at our table for another 15 minutes waiting for menus, water, maybe some of those chips and salsa. After looking around and realizing that most of the patrons were also looking lustfully toward the kitchen over their empty tables, we decided to go elsewhere. I don't know what was going on, perhaps all their staff called in sick? We were never even able to catch the servers eye, it was so weird. It was a Friday night, maybe we'll try again on a weekday."}
{"text":"Love this place. I use to come here when I was a kid with my parents because they said it was the best. I just came in today and definitely did not disappoint. Great service. Super clean. And super tasty food."}
{"text":"Not sure if this is new, but its cash only. It would have been nice to know that before I drove to it, sat down, and was ready to order. The polite waitress told me where the nearest atm was but it wasn't a bank and I didn't feel like paying a fee to withdraw $ and then go back. Two people were in there eating by themselves at the peak of lunch hour. For what its worth, their food looked pretty good. Maybe I will try again when I happen to be in the neighborhood with cash. Just wanted to post this to give anyone the heads up to bring cash."}
{"text":"The food, service and establishment are great   Its my all time Mexican Seafood Restaurant in Phoenix.  I went with a party of 8 and all ordered different dishes they were all exceptionally delicious. We tried  Must try the Camarones Culichis (Shrimp in green sauce topped with jack melted green cheese) Botana de Mariscos (Fresh Seafood served cold), Tortitos de Camaron (Great as an appetizer) and Enchiladas de Camaraon ... ALL were very good ... served with ice cold beers.  We will be back next week to try the new menu!"}
{"text":"Not far from the airport, and a great way to start and end your trip to Phoenix. If you live here, better food than the 'upscale' joints in Scottsdale. The seafood is as good as any I've had in many trips to Mexico, and reminds me of a hidden gem an understanding cab driver took me to on a back street near the Sheraton in Puerto Vallerta, and have never been able to find since. You'll know you're here when you spot those casually hung 'Best Mexican Seafood' awards as you enter.  Start of with one of their many varieties of Ceviche, available in three different sized portions. My son liked it so much he had one as an appetizer, and another larger one as his main course.  My brother then had Grilled Octopus - very tasty and tender. I ordered the Fish Grilled in Garlic Sauce. Amazingly fresh, and done (not overdone) just right. Both platters came with  rice. beans, salad, and under the fish - French Fries! Not at all soggy. And the warm tortillas and spicy salsa let you build a few tacos along the way.  We washed everything down with several Mexican beers, at  4 bucks a bottle, the same as they charge for for 'domestic' beer (although domestic here would probably be Mexican). Friendly waitress and patrons, and even though we were the only gringos in the place, we felt right at home.  The three meals, as above, with tax, tip and beers came out to only about $70. You could drive down to the actual San Carlos Bay through Tuscon and Nogales in a couple of hours, but why bother when it's really right here."}
{"text":"I absolutely love San Carlos Bay! I tried almost all of their menu and my favorites are the culichi, devil shrimp,  shrimp, octopus and scallops cocktail and the crab meat tostadas! Yumm   Fresh fresh seafood! Real taste of Mexico"}
{"text":"Drinks are ok, but that's all we got. After waiting for over an hour & 20 min we offered to pay our drinks & Left. Hostess said drinks were on the house cause of the wait. So if you got a few hours to burn go here."}
{"text":"La comida esta riquissssssssssma, Prueba el filete relleno, es muy bueno. Las Botanas y ceviche estan excelentes tambien.  Food is delicious!!! Try the stuffed fillet, its great. Also the appetizers and ceviche are excellent as well.  I Highly recommend this Restaurant."}
{"text":"Been coming for years and they never disappoint!! Makes me feel like I'm back in Rocky Point at the fish market. Must try and they now accept cards, which is great for me since I never have cash!!"}
{"text":"I was kind of turned off when I pulled into the parking lot, but I decided to try this place after researching and it got amazing reviews on Yelp and other websites.  Although the outside is a little unappealing, the food was so so so good!  The salsa was very spicy, and tastey!  I would definately go back for some good Mexican seafood!"}
{"text":"Outside looks grim, inside was clean, friendly and quite Mexican. In the shadow of the 51, easy to get to.  My wife and I visited a relative at nearby Good Samaritan Hospital, it was a very convenient location. We had jumbo shrimp stuffed with cheese and wrapped in bacon (12.50) and Shrimp & Fish fillet in Garlic Sauce (13).  Both came with salad, rice, refried beans and french fries, all on the same platter.  The fillet was fresh, cooked to perfection and delicious.  We had warm tortillas on the side.  Flan for desert, dense, sweet and filled with the tiny holes I always look for in home made flan.  Good lemonade (not too sweet) (2) and a can of soda (1.50) rounded out a filling and gratifying meal.  We will certainly return to try more of their extensive menu!"}
{"text":"Excellent venue! Highly recommend the shrimp, stuffed red snapper and garlic fried fish. The guacamole was also a great addition. Try it!"}
{"text":"Excellent Mexican style seafood. The shrimp culiche is out of this world! I've never eaten anything like it. As for the alcohol situation, they have beer, wine, and tequila only. So not really a FULL bar but I'm good with that. Try it out..."}
{"text":"Run over to Mariscos Playa Hermosa if you're wanting seafood/mexican fare. The chips and salsa was nice but seafood cocktail makes me sick- canned oyster on top with god knows how old squid and octopus that were rubbery and gross. The waitstaff are very nice and hospitable but the food really sucks."}
{"text":"We returned from having an awesome meal there. All four of us had appetizers some beers and margaritas chips and salsa and fantastic entrées. There were only four of us we paid the bill of about $100 and added a 20% tip. When we got home my father showed me the receipt only to find that the waitress had added a 15% service charge and not told us. I have never in 40+ years of dining out had a service charge added toa four top table. This woman that was our waitress did not inform us of this nor should she have put it on there to begin with. And when she saw that we left her a tip on top of us she should've informed us of it again. This is out right left. This is 100% unacceptable and not allowable I have been eating at this restaurant for 10 years and will never go again because it's not necessary to steal a loyal patrons money. She ended up with over $35 in tipsBecause of her unethical and illegal behavior"}
{"text":"I have been here numerous times and l have yet to be let down. Everything always taste fresh, and this place is a great \"dive\".This is one of the best kept secrets in Phoenix. You can't go wrong with anything on the menu and ICE COLD BEER."}
{"text":"The parking lot is too small so watch out for your car doors.   The seafood is about as authentic as it gets in the US. Arizonans cook their seafood like New Yorkers cook their steaks: rare = medium, and medium = shriveled. Still, the shrimp & octopus cocktail was tender & plump. The peppers stuffed with shrimp were savory. The rice was not sticky and the refried beans didn't taste like they had lard. But I didn't ask.  I would do this again, but next time I'll bring a friend. It's a very social place, 4 girlfriends chatted it up before, during and after I left."}
{"text":"This time I have the Super Cocktail. It was soooo good! Filled with raw oysters and shrimp with clams, squid, octopus, shrimp and sea slugs. The large is huge, definitely big enough to share.  This place is at the top of my list!"}
{"text":"I haven't been here in a few years, the food was great! I actually over ate and now I'm paying for it. Haha. But I love seafood. The service was good. The Micholada, was so good!! My bf had 2, I was driving so I only had a sip. Would recommend to go and eat!!!"}
{"text":"We stopped by this place for dinner this week. We had never been here before and were curious about the place. The interior of the restaurant gives you a feeling of being in someone's home.  The decor is simple, the place is clean, and not too big. When we entered the restaurant, the waiter seated us immediately and brought us chips and salsa. We both ordered Margaritas. They were very good but could have used a little more tequila, but that's a criticism I have of most restaurants these days.  I ordered a combo plate with shrimp, a fish filet, topped with green peppers and onions, served with Spanish rice, beans, fried potatoes, and a warm fresh flour tortilla. My husband ordered a similar meal, only in garlic sauce without the green chili, and with corn tortillas. Everything was fresh and delicious, and the service was great. The prices are very reasonable and actually less expensive than other Mexican seafood restaurants. Overall, a great experience. We were full and happy when we left. Their menu is loaded with a lot of delicious looking meals and appetizers. We will definitely be back!"}
{"text":"Great authentic sea food. Need to try it once. Won't be disappointed. Recommend the 7 seas cocktail and shrimp fajitas."}
{"text":"Ahem, it's called San Carlos BAY seafood restaurant.   Anyway, this is my favorite restaurant in Phoenix. The seafood is out of this world. I normally only order one dish, the Shrimp in Garlic sauce, and it never ever disappoints. Tortilla, beans and fries come with...but the real kick in the pants? When that delicious sauce marinates everything on the plate, making the fries all garlicky and moist...MMMMM...I can't wrap it all up in the tortilla and shove it into my mouth fast enough.   I also highly recommend ordering a shrimp or seven seas cocktail as the perfect starter.   My family has been coming here for years, it's not in the best neighborhood. Last time we were here the place got robbed. No one was hurt, staff casually called the police, I'm guessing this had happened before. I was just glad the shrimp were okay.  But don't let that deter you! If you like seafood and mexican food you will be in hog (cerdo?) heaven! Mariachis on the weekends too...(just don't be that guy that requests they play La Bamba)."}
{"text":"Nothing fancy... every item on the menu is either shrimp, crabs or fish. If you are not going for fish, stay home. The service was not that great, as I ordered the wrong dish and did not eat it, however, the waitress did not ask any questions, but took it off the table. Chips and salsa were a disappointment. A one and done experience for me."}
{"text":"The food here is awesome. San Carlos is one of my favorite Mexican Seafood joints.  The 7 seas cocktail makes you feel like your really ocean side. The diablo shrimp and bacon wrapped shrimp are also extraordinary. The micheladas are great too. The salsa had a nice flavor.  I have only been a few times and would love to try out more of the menu.  I would have given it a 5 if it wasnt for the ghetto building. Its like they picked it up from Rocky Point and dropped it on McDowell. These owners should wise up and renovate. 5 for food, 2 for the atmosphere, 3 for service, and a 4 overall."}
{"text":"This little place is AWESOME!  Nuff said.  But, if you really want to know...My fiance and I went here on a sleepy Sunday night when we were too tired to cook anything...and darnit if Costco wasn't closed to pick up a pizza, so we headed over to 16th street to see what new place we could find.  We were first given a bowl of chips and salsa.  The salsa looked like a mix between red and green salsa, and since I have a weird aversion to green salsa, I hesitantly tried it.  It was delicious, as were the house-made chips.  We ate two bowls immediately because we couldn't stop.  After asking the waitress what was best, my fiance decided on the spicy marinated fish, and I on the garlic shrimp.  Holy crap, it was delicious.  The garlic sauce for my shrimp covered everything, from the beans and rice to the secret fries beneath the shrimp (which magically didn't get soggy).  My fiance said his fish was the best he's ever had in America.  Mine also came with tortillas (I chose flour), and they were great, like the kind my mom bought from the \"tortilla lady\" back home.  We were so full we couldn't move afterward, but I woke up in the morning craving the garlic sauce again...  The place is small and quaintly decorated, like something you might find in a small town.  We saw lots of families and tables of friends come and go.  The best part is, you don't have to sit and awkwardly wait for your check.  You check out at the desk.  I highly recommend this place for some great mariscos.  I don't know how it could have been any better."}
{"text":"Traditional Mexican style seafood wish they would explained or give more detail on the menu pf what entailed.   Had the Mexican octopus but I had to ask the waiter what Mexican octopus was. Food was delicious service was good appetizers and great moderately priced"}
{"text":"I was way excited to try this restaurant since it's so close to my house.  I just assumed it was one of those places that looked like a dive outside, but served up a piece of heaven inside.  Once I read the Yelp reviews, I was convinced I had made a sound real estate investment!  Maybe my expectations/hopes were too high, but I thought it was just ok.   I liked the chips and salsa, and the service was friendly without being in your face.  We ordered a round of margaritas which tasted good, but were really weak in terms of the amount of tequila.  My father had the garlic shrimp and octopus which was really delicious--if I go back this is what I'd order--and I had the fish cuilichi was ok, just kinda heavy and not really something that got me excited.  The girly girl in me says, \"not worth the calories!\"  I think I'll give it another try some time in the future--perhaps it was an off night."}
{"text":"Heartbreaking that San Carlos Bay, serving arguably my favorite dish in the country, scammed my credit card for a $70 tip (instead of $7). So for $63 you have lost your number one fan who always so looked forward to stopping in upon arrival in Phoenix.   I have given them every opportunity to fix this. When my credit card company alerted me to a suspicious \"tip\" amount I called and was told the owner would call me back but my call was not returned. Then I stopped in to deal with it face to face while driving back to LA and the guy took all my information and promised the owner would fix it instantly the next day and that they would call me to let me know it is done. They did not.  Sad the world is filled with scammers these days."}
{"text":"Seriously good. If you're passing this way, staying by sky harbor you need stop here. The tacos pescada were tasty filling authentically prepared and worth the find. Second best reason for coming to AZ"}
{"text":"Whenever I fly back to Arizona, about twice a year, I drive straight from Sky Harbor to San Carlos Bay. For fifteen years I have kept this tradition. The chips and salsa are perfect, mariachis drifting around, real families and workers on their lunch breaks. All the seafood is perfect, especially the ceviche. The soups are amazing. For the kids, I get fried shrimp with french fries, and they're the best fried shrimp you'll ever eat. Flying into PHX, I dream of this and am never disappointed: a cold Pacifico beer with those tiny, tart Mexican limes and a whole fried snapper endiablados style.   The neighborhood looks like a place you'd go to pawn your grandma's walker or sell a hot catalytic converter, but inside San Carlos Bay, you'll think you're eating on the square in Guymas!"}
{"text":"The food here is just so good! This restaurant doesn't look like much on the outside but looks can be deceiving though. I came here with two of my friends and we were impressed with the quality of the food here overall. The location is not in the best area of Phoenix but overall that shouldn't deter you from coming here at all. At least it's fairly close to the airport making it a great spot for a meal.  I had the grilled fish + shrimp with the garlic sauce as well as refried beans + mexican rice. Everything was great! I'm looking forward to my next visit here already."}
{"text":"This place is gooooood. Clean, comfortable, quality service and tasty food for sure. Reasonable prices. Would be nice to have Happy Hour there though.  Had the shrimp cocktail-medium....$10 and delish. Had the chile relino plate-$12/14....pretty good. And tried the ceviche-$4/5....yummo.  All in all, I would recommend this little place."}
{"text":"Love this place. Outstanding ceviche, great chips and salsa, friendly service.  Every time I come to Phoenix, I go here."}
{"text":"Service was fast and the food was great!  I had a Pina Colada and Fried Fish Fillet (Snapper) and Wow!  I'm full, happy, and sleepy.  Will be sure to visit next time I'm in the area."}
{"text":"I am indeed a fan. If you're down for some mariscos in Central Phoenix you should defitely try it out. Reasonable prices for good food. The mariscos are the upper end of the menu. There are also cheaper texmex items if you are in the snacking mood. They recently began accepting credit cards. Nice wait staff. Pleasant."}
{"text":"Love this place, been coming for over 9 years. Never disappointed! Amazing ceviche tostadas, shrimp cocktail and the lemonade is fantastic."}
{"text":"I love this place. My wife and I ate such a large and delicious meal there for lunch this weekend that we went into a food coma and fell asleep for 3 hours.  The shrimp aguachile is incredible.  The coctel de camaron is delicious as is the albondigas.  The chips and salsa are great too and really get your palette ready for the deliciousness you are about to receive."}
{"text":"The shrimp cocktail served in a fresh coconut with the meat is just amazing.  Everything else was high quality and tasty.  The shrimp with garlic was excellent and all the dishes are generously sized."}
{"text":"Went today for my third time for lunch. I have to say each time better than the previous visit. Shrimp dishes are so good as well as beans salsa and rice.  Has made my lunch rotation for Mexican  downtown which is a big deal as I have been doing lunch for 10 years downtown.  Try it will not disappoint."}
{"text":"If you like FRESH seafood and also enjoy spending very little such as $25 for TWO DINNERS this might be a place for you!   Small converted older Phoenix Ranch style house converted into a cheerful Seafood Restaurant that had live music when we were there, located among a row of row of other Mexican Restaurants. (that were rougher looking)  We had the spicy marinated fish and the diablo shrimp.  The Marinated Fish had essence of vegetable threw it and was cooked to perfection being very light moist but not falling apart also skinless , lacking fish taste meaning being sweet and fresh instead . The fish was topped with a spicy red sauce that was a perfect spice heat and topped with fancy cut lightly cooked celery for texture . This dish came with salad garnish , beans , rice , tortillas and the fish was elevated up on the plate by the use of fries .  The diablo shrimp come with a similar set up but are topped with onions and the spice heat is more of a challenging 10 out of 10 instead of the expected heat of 7ish . (this dish had good flavor but is not for everyone)  at the time of this review this is a cash only establishment but a sign is posted that they will except credit cards soon .  We were Five Stars satisfied with meals and service , we'd return ."}
{"text":"Food properly prepared however, they put my fillet on top of a bunch of french fries. Not sure what the purpose of the fries were since my fillet came with sauce on it and the fries were soggy and gross. Upon separating the fries from my fish - the fish was flaky and the sauce was delicious. Staples- rice was perfectly cooked, beans good not lardy or too pork flavored, tortillas were good. Two stars come from the fact that if you are in the business of selling seafood the restaurant should strive for the best . Soggy french fries holding up my fish fillet was disgusting."}
{"text":"We now call this the\"Happy Place,\" because we go here when we are looking to celebrate.  First and foremost, if you want oysters; these oysters are unsurpassed in quality, much better than someplace like Red Lobster.  Red Lobsters has good oysters, too, but not like this.  If they have a best oysters in Phoenix contest, I would vote for this.       The Margaritas are amazing, & cheap; not skimpy with the alcohol, (to be frank,) yet taste healthy, not overly sweet, not like a mix, super fresh.   I usually prefer traditional margaritas, but I love the strawberry ones.  You might actually find a bit of strawberry in it?  Not strawberry flavoring.   This restaurant reminds me of the food I used to eat in Chicago, and when I lived in West Chicago, a Mexican neighborhood for 13 years. The food was so authentic; so good.  I have often heard it said that Chicago has some of the finest food in the world, well, not to talk this up too much, but I just feel like this restaurant would rank that way.    Everything is freshly made, well presented, perfectly cooked, large portions.  Salsa is great, too, the chips are those thin slightly salty ones.    I like the homey look of it, too, feels down to earth, and relaxed atmosphere.  You are to eat some really good food, have a good time, maybe try something new? Like getting a home-made meal on a holiday.     Lastly, the staff could not be nicer, more helpful or polite.  I am in love with this place."}
{"text":"What a charm San Carlos. Unpretentious - as though sitting in a restaurant somewhere deep in Mexico - this place has all the charm of, well, a shitty little restaurant deep in Mexico. But that's not why I love San Carlos. I eat here because of their inexpensive yet delicious food offerings.  Let me put it another way, I recently dined at Ocean Club, ordering their seafood tower as an appetizer. It was in the three-hundred dollar range...for an appetizer. YIKES. At San Carlos you can get the same seafood platter, featuring every denizen of the deep for under thirty dollars!  Clams, mussels, crab; both king and stone claws, snapper, cod, octopus, tilapia, and a host of other fish whose names escape me all served on an oval platter stacked four inches high. Two of us couldn't finish it.  As I said, if you're looking for charm, forget it.  Also, make sure you have a good car alarm as it's in a dodgy part of Phoenix.  But it is Arizona, so no-one will be surprised if you dine with a heater on your hip.  It also helps if you know a bit more Spanish other than; My name is Diego, would you let me sleep with me for twenty dollars?"}
{"text":"Great service and awesome food!  Stopped in for a lil something before we checked into hotel.  Had bacon wrapped shrimp, fresh tortillas!  Great food, clean and very nice service! Must check this lil hole in the wall out!"}
{"text":"Been here a few times and never disappointed.  The green cheesy shrimp dish was phenomenal."}
{"text":"I'm Mexican from Chicago where there's a huge Mexican population & excellent Mexican restaurants. This is the first Mexican seafood restaurant I found in Phoenix that delivers. If u want authentic Mexican seafood this is the place. Also food is fresh & seasoned perfectly. I really believe this is the best kept secret in Phoenix! The Capachana cocktail & 7 Sea Soap is to die for! Can't wait to try the full fish Red Snapper, very hard to find. Waiters said it's available only on weekends"}
{"text":"I was really excited to try a new place in my neighborhood for a good shrimp cocktail.  We sat there after they brought us chips, salsa and water for 30 minutes and couldn't get attention from any wait staff to actually order.  The last straw was when a table cleared out next to us and the waitress started busing the table.  Wouldn't look up so we could catch her attention.  We finally said F it, we left and came to Rositas.  Jam packed full of people and still amazing service and great food.  Guess I'll stick with the one amazing neighborhood spot I have.  Oh yea the chips were stale and taste store bought and the salsa was pathetic and flavorless."}
{"text":"My husband and have been driving from Scottsdale to eat here for many years. The restaurant very clean and service is superior. The waiter also knows what we are going to eat and brings us hot fresh chips and salsa right away! Love the ceviche! Yes, the neighborhood is dicey and the parking lot is tight but the food is oh so worth it!"}
{"text":"This Place Is Awesome!!!! Food Is Great I Highly Recommend It ! If Your A Fan Of Seaffod I Would Highly Recommend You To Come Here!"}
{"text":"Definitely a hidden gem!  I have eaten everything on the menu.  No, not all at once. I've been going for years.  The best baja style mexican seafood in town.   Even the raw oysters are fresh and delicious.  You can't go wrong.   SRSLY. GO.  They don't always take credit cards. I'm not sure why. Bring cash just in case."}
{"text":"Stopped here for a quick bite after flying into Phoenix and found this restaurant on Yelp.     The food was fantastic, I had a filet with a green chili-sour cream sauce which was wonderful, delicate and flavorful, I'd never seen or had anything like it in Denver.    My wife had a soup with very large pieces of shrimp, scallops and fish.     Great flavors and value."}
{"text":"Food took over 40 minutes to come to the table so if your hungry this is not the place to go. The shrimp ceviche was way too raw. I clearly understand ceviche is semi raw but this one was basically completly raw. The other hot food ordered was room temperature. Food was sent back but brought back the same way. The beans were burnt and tasted horrible. Unfortunately, this was our first time and our last wont be back very disappointed. Location has a great clean feel but the qualify of the food is not up to standard and would not recommend to anyone.!"}
{"text":"Nice atmosphere compared to all the other sea food restaurants that I have been to in West Phoenix.  Only negative part is they don't make my favorite fish ceviche only shrimp ); also the waitress was MIA we waited for water to be refilled and took for ever.  But when we got our check we got charged for 2 drinks and 2 tostadas when I only ordered one of each ): waitress was not to friendly might of had a bad morning ..."}
{"text":"Their shrimp ceviche tostadas are TO DIE FOR!! I usually have it served in a bowl and I use the table chips, they are crispier than the tostada shell. Add a side of guacamole and GO TO TOWN. I have been coming here for years and I have never had a problem with service or food. Their Micheladas Preparadas are pretty awesome as well."}
{"text":"Fabulous seafood made like home-made.  The  staff was friendly and accommodating.  The Culiche was to die for and we found out it was a recipe passed down in the family.   Such a simple little restaurant with amazing food.   If you are looking for fancy restaurant this is not the place.   If you are looking for a seat cozy restaurant with amazing seafood,  this is your place."}
{"text":"Another great place off the beaten path. It's actually a Mexican Seafood restaurant. No chicken, no pork, lots of shrimp, very good shrimp. Don't turn down the free Chris and salsa, the salsa is one of the best I've ever had."}
{"text":"Sea of Cortez style Mexican food. Doesn't get much better than this.  The Shrimp Cuilici (sp) is the signature dish and the item I order the most. It consists of shrimp baked in a creamy pepper sauce with a layer of cheese. It all blends together in a gooey goodness that you can spoon over tortillas.  All the seafood is awesome there, cooked in several styles. I love Mexican food and I love seafood. San Carlos Bay is the best of both worlds."}
{"text":"Pretty authentic hole-in-the-wall Mexican seafood. Its loud, crowded, and a bit greasy, but the food and atmosphere keeps us coming back when we visit PHX."}
{"text":"Food is so good there i had camarones ala diabla the  Food was delicious my wife had a shrimp cocktail and some ceviche tostadas they were unbelievably delicious we will be back soon"}
{"text":"Food is good without any doubt!! But why do we have to wait soooooo long to get it on the table?? Food preparation is way too long and by the time you finishing all the serving of tortilla chips and salsa you're already full!! It would be nice to get the main entrees out sooner!"}
{"text":"Not a bad choice if you're looking for seafood/Mexican food in this area.  We don't live in this area, so I can't see it being somewhere we would make a special trip for.  I had the whole fried fish (snapper). It comes in large, medium, and small.  I got the small, which was a very good sized fish.  It also came with fries. It was tasty, but it was missing a certain amount of seasoning. Each table has a large selection of bottled hot sauces that I utilized to kick up the flavor a notch.  I also ordered a small shrimp cocktail that I thought was good.  Staff was nice and the place was clean.  It just didn't wow me."}
{"text":"Think you can't find fresh seafood this side of the Mexican border? Think again! This place has the best ceviche dishes in Arizona. Fresh oysters, octopus, crab meat... Anything you would want to order in Rocky Pointe, you can get right here.   Complimentary chips and salsa never ends. Ice cold water, soda, beer, and margaritas to quench your thirst on the hottest of lunch breaks. No less than eight authentic hot sauces, ranging from mild to EXTREME, right there on the tab.   Service is always smiling, even when the little dining area has a wait ten parties deep. As a little blonde gringa, I usually feel self conscious about my obvious lack of Spanish language knowledge. Here, I don't feel embarrassed my poor Spanish or by using the English words. The waiters are always polite and helpful.   Not to mention, this place gives you plenty of bang for your buck. I dare you to try finishing their large Seven Seas cocktail!"}
{"text":"Love this place! What a lovely discovery at the beginning of our 6 week stay in Phoenix.  I'm fussy when it comes to Mexican food, having lived in El Paso. This is not Cal Mex, Tex Mex or New Mex, but the real deal. Great chips and salsa, and the dishes my wife and I got - fish tacos and seven seas soup, were both excellent. And enough food that I'll have lunch tomorrow from the leftovers.  To cap it off, the service was loving and warm.  Turns out, it empties out after about 7pm, so those wanting faster service should show up when most people leave.  FYI: There were only 3 other tables occupied when we were there. Everyone else was Mexican. A good sign, right?  Great place!"}
{"text":"I found my new place for Camarones Culichi... the rice and beans are amazing as well. I'm extremely picky but I have zero complaints about this place. Our server was very friendly and made sure we were satisfied. I will definitely be back"}
{"text":"I've been coming here for over 12 years and this is always my go to spot for mariscos or just to get a michelada when I'm in AZ. family owned and great people. the Camaron Bucanero is on point"}
{"text":"Best Mexican Mariscos  in AZ!! Not only does the food taste good but they are clean too!!! I only eat at places that are issued a clean bill of health and this is one of them unlike the others out there. The food, WOW! If you want to feel like your sitting in front of the Sea of Cortez without actually going you come here... Coconut shrimp cocktail as good as it gets.... I have been going here for the past 7 years and will keep going back... Almost everything is great... I would skip the French Fries on the dishes since they are not so good and i don't expect them to be at a Mexican seafood place."}
{"text":"Very boom good good stuff jalapeños bacon shrimp they were delicious I would say come here and eat"}
{"text":"If you are in the mood for Mariscos this is definitely the place to go. My fiance was craving Mariscos yesterday and I sat and thought where is a good restaurant. I hoped on my Yelp looked up the nearest Mariscos restaurant and this place popped up. It had been years since I stopped in this place, but I was eager to take my fiance knowing how good the food was.  On the outside, it's probably not the nicest place in the world and it may not be in the nicest area. One thing I can guarantee is your going to get great food and great service. As we walked in, the place was very nice on the inside I can tell they've done some remodeling since I last came. As we sat down the waitress immediately brought us chips and salsa. The chips were nice and warm and the salsa was very flavorful and not too spicy. Looking through the menu there were so many great options I didn't know what order. When the waitress came to take our order I decided to get the Camarones Culichi and my fiance ordered the shrimp cocktail and a tostada with shrimp ceviche.   After getting chip and salsa wasted our food arrived. We didn't wait too long to receive our food, maybe we did but the service, salsa, and chips were so good I didn't even notice. Looking at my plate I was very delighted, the rice was cooked well the beans were creamy and cheesy, and the Camarones were to die for!!!!!! The Camarones (Shrimp) sat in green sauce with tons cheese. Every bite I fell more in love with this dish I never had something so amazing. As I finished a tear rolled down my eye, it was that good. LOL!  If you are in the area or just looking for great Mariscos restaurant this is definitely the place to go. I've been to many Mariscos places in Phoenix and this is by far the BEST!"}
{"text":"We stopped in on a weekday for lunch. There was 5 of us and we were seated promptly. I was skeptical at first, mostly because I was not feeling like I wanted Mexican Seafood, but when I had the first sip of my Limonada (freshly prepared and refreshing) and dipped into the homemade chips and salsa, I knew all would be ok.   It took me quite a while to choose from several options on the menu. Most of my lunch partners went for the baja fish tacos, another for the Camarones al mojo de ajo...or Garlic Shrimp. Two of us decided on the Camarones Rellenos (stuffed shrimp). Now when I think stuffed shrimp I think of my favorite stuffed shrimp at Papadeaux's, with lots of flavor. I was expecting the same here. When it arrived there were 6 large bacon wrapped shrimp on a small bed of french fries, accompanied by refried beans and rice. The rice and beans were very good, the filling in the bacon wrapped shrimp was very basic unseasoned Ricotta/Requeson, not like the jalapeno, garlic, with monterey jack cheese I have had at other places. It was admittedly bland. I added lime but decided against any of the bottled hot sauces on the table. I should have spooned over some of the salsa but hind sight 20/20.   The other diners with me enjoyed the fish tacos but mentioned they had had better, while the other with the Garlic Shrimp raved about that dish.   In all I would go back here to try any of their other dishes on their menu."}
{"text":"San Carlos Bay exceeded my expectations and I can't wait to go back next time I have a hankering for some Mexican seafood. The fish is fresh and they don't skimp on anything here. The complimentary chips and salsa and aresome and even better when served with a Corona Chelada. On the recommendation of some other yelpers I ordered the shrimp diabolitos (I think that is how it is spelled) and it was amazing and as spicy as expected (warning- I love super spicy food and this was definitely on the higher end of spicy- heat akin to the level of the slow burn of an indian vindaloo). I will definitely be back for more!"}
{"text":"Excellent place to dine my wife had the Whole Red Snapper dinner and it was extremely good. A lot of fish for one person. I had the Octopus Vera Cruz dinner. I was stuffed and didn't have room for dessert. It was the first time there and it was worth every penny. Prices were great for the portion they served."}
{"text":"Excellent Fried Snapper!  I had listened to a good friend talk about this place for years. Although he had eaten other things from their menu, he absolutely raved about the fried snapper whenever he had it.   Well, last week I was in the area, with time to kill before a meeting downtown, and a pretty good appetite. I decided it was the perfect time to try San Carlos Bay's snapper for myself.  I was welcomed to sit anywhere I pleased, and was very shortly brought chips, salsa, water and a menu. The salsa was on the hot side, but delicious with the fresh taco chips. I ordered the whole (head included) fried red snapper (small - you have a choice of small, medium or large) which came with refried beans, rice, and a lime.  My food arrived in a reasonable amount of time and looked wonderful. The fish was still piping hot, and had been scored on both sides to ensure even cooking. What I loved about the preparation was that I ended up with so much nice crispy fish! It came away from the bone easily and I only had to be careful about the tiny bones along the fins.   My fish was un-breaded, nicely seasoned, and perfectly cooked. The \"small\" fish was the perfect size for me, and left me completely full. I didn't add any hot sauce or salt, but enjoyed eating the hot salsa with it, along with juice from the lime. The refried beans were good too. I've never been a fan of that red Mexican rice. I tasted it, but left it alone after that.  I completely enjoyed my meal, and also thought that it was appropriately priced. Service was friendly, and I intend to return the next time I need a fish fix."}
{"text":"Honestly the most authentic Mexican seafood you can get in the city! I have never even seen a piece of lettuce that was overipe- everything is fresh and delicious. The service has been excellent all 20 years I have been going here. Highly recommened."}
{"text":"Well, this is my 2nd visit to San Carlos Bay, I was fortunate to get a parking as the  parking space seemed little small, they have remodeled the restaurant since the first time I came back in 2013, I somehow liked the older look. So, coming to the food, being from costal region in India I always loved Seafood and I was finding it so difficult to get a good seafood place in Phoenix, however this place didn't disappoint me, the fish was so fresh and delicious. They have the right amount of spice in all their dishes. Overall I would rate this place as one of the best seafood places you can try in Phoenix."}
