{"text":"Great food and amazing decor and ambience! The food was just right. We ordered the chopped salad with goat cheese, asparagus appetizer, pineapple fried rice, butternut squash risotto and the apple crisp dessert. Tasted like premium food in Manhattan but in the outskirts of Cleveland. Very satisfied with the experience and would highly recommend. Two thumbs up for Sanctuary!"}
{"text":"Pleasantly surprised. My 3 favorite things together. Veal piccata, gnocchi, & asparagus. Pretty good. Wasn't expecting anything as good. Gnocchi were al dente, veal was tender & lemony. Very nice."}
{"text":"I took my fiance here for  our Valentine's day dinner and was refused service. Our reservation was for 8:15, we walked up to the counter and was seated by 8:10 and that was the last service that we received. Three different waiters continually walked past us until I flagged down the manager around 8:37. She apologized and walked off, but when we still hadn't seen or heard from a waiter by 8:50 we stood up to leave and then the manager came over with a bottle of water and asked if we were leaving. I'm not sure what the issue was but they weren't crowded, and the couple that walked in(without a reservation) ahead of us were promptly waited on."}
{"text":"My dad and I dined here on Thanksgiving. Turkey you could cut with a fork, so tender (they brine the bird before roasting it), stuffing and mashed potatoes, excellent. Caesar salad was lovely. ordered the beef tenderloin mid rare, and it was served mid well. The manager and server were very much on top of this, and the manager offered us dessert on the house, which was very nice, since I really didn't consider it a big deal. Second filet was perfectly cooked. I love that this establishment respects the concept of fresh, seasonal ingredients. Unusual for this part of the city."}
{"text":"Pot roast is so good. I may have had as good but I've never had better ( and I make mean pot roast folks )."}
{"text":"Really a lot to be desired. I got here early for a Paint Nite Event and decided to go to the bar for food because I hadn't had dinner yet. I got the pierogi app and I was still waiting nearly 20 minutes after ordering. I went back to my event and it still took another 10 minutes for my food to be brought out. It was ok, not the best I've had. For a wine bar, they were out of all but 1 red wine, didn't have any of the sangria mixes and were out of more than a few whites. Definitely not worth your time, go find somewhere else.   I was speaking to the Paint Nite instructor and she's had people walk out at the end of her event and not even pay because it took so long to get the check. I mean come on, you'd think you'd want to impress a group to get people to come back"}
{"text":"I attended a meeting here last week and a few of us stopped in the Sanctuary bar beforehand for a drink.  Love the bar, and the service was fine (although we all commented on how unprofessional they looked dressed in faded jeans -- seemed to be the uniform).  My complaint is that the prices in the wine list and on the happy hour hand-out were old and not what we were charged.  I had ordered a glass of wine and when I paid I was told that they no longer have the 6 oz pour; only the 8 oz pour -- of course it's more money.  We were also told when we were handed the happy hour list that the prices on the hand-out went up about 4 months ago and were all $1 more than on the hand-out.  We complained to the manager that we should be charged what was on the price list and he adjusted the price for that one drink only; subsequent drinks were $ more.  How hard is it to print up some new price lists  --  4 months you've been charging more.  Very poor way to do business!  The food & beverage manager needs to get a clue!"}
{"text":"Better than average hotel bar. Food was hot and good. Apps came out quickly then it slowed down. We were staying at the hotel, so it was ok. Nice selection of tap beers.  White sangria makes me think it is warm out.   Would stop when not staying especially during happy hour. Thanks to Bryan"}
{"text":"Cold food served with mediocrity.  We were a large group and some waited a considerable length of time to be served- not that the food was worth waiting for.  The dining room was empty at a peak lunch time-a clue that the word is out that you can do better almost anywhere.  The only reason to eat here is if you are a hotel guest and too lazy to go out to a decent place."}
{"text":"Came here because it was close and easy, and now I know that is about the only benefit. Food was ok, but definitely not worth the price. Next time I'll get in my car and drive a mile for better food."}
{"text":"Pristine service by Zamika(sp).  Took her meal suggestion and loved it.  Even made a Limencello margharita for me, twice."}
{"text":"Good food and great service! I tried the salmon dish which was prepared perfect. Prices are very fare.."}
{"text":"Let's be real this is a hotel restaurant so my expectations weren't that high. I normally don't eat at the hotel but decided to stay in tonight since the weather was nuts. I'm actually pleasantly surprised.   I ordered the Ahi Poke but they promptly called and said they'd run out. To make up for it the gave me a complimentary crab cake. I cannot believe how delicious it was! One of the best I've ever had! The wings were good. Nothing special about them. For dessert I trie the chocolate Babka cake with salted caramel ice cream. The ice cream was terrible. It had a plastic like taste to it. The cake on the other hand was delicious.   Service was great. The other meals I saw guests eating looked good. I'd say for a hotel restaurant this is one of the better ones!"}
{"text":"Went to dinner a little later than 9pm, and it was a bit loud in the bar section. So moved over to the restaurant section which was a lot quiter. Ordered a Nevada Sierra IPA, which came in a nicely chilled, perfectly drafted, clean tall glass. Completely made my night after a long day. It was delicious. Their freshly baked seasoned Italian bread with olive oil was exquisite, melted in my mouth. They even offered more but I didn't wasn't to get full. And ordered the scallop risotto which was good as well. I'm not a big fan of juices/sauces, but it was good! It's also not cheap, but a great dining experience!"}
{"text":"I met a friend here for lunch today. The ambiance is nice and typical hotel decor. It was very dead as there was only one other table the entire time we were there.  We started with the deviled eggs, which were very good. They were creamy and a bit tangy. They took a bit of time, but the waiter mentioned everything is made fresh.  For lunch, we both for the trio for $11. I had the tomato basil soup, salad and a shrimp taco.  It was all good, except the shrimp taco was very spicy. I had asked that my taco not be blackened and that the jalapeño slaw be left off. My server ensured me that the slaw wasn't spicy and that it made the entree so I left it on. It was incredibly spicy.   The tomato basil soup was pretty standard, but tasty and creamy."}
{"text":"Ughhh- and can I say arghhh, too?? What a cluster fuc& . One of my favorite spots near my house just got blacklisted. Why? Let me tell you why.   1 we sat at the bar. Getting a beer and a vodka on the rocks took 20 minutes . Btw - hostess was sweet as can be and sat us right away   2 sat next to drunken woman- which I normally love, until she she gets into religious debates w me  3 waiting 40 min for our  apps   4 more talk. Still waiting for food. Out of nowhere , bartender tell my fiancé that girl needs to be cut off. He thinks it's the drunk older woman - it's me! With one drink. The older woman is now trying to read our signs. Escape route?   5 we ordered a rare steak and it comes comes out well . Staff fights over it. We are in earshot.   6 couple next to us (darlings) tell us they are so sorry for are trials and tribulations.   7. Bartender keeps slamming glasses and plates and seems to be very angry    FACING THE RIOTS WOULD HAVE BEEN A BETTER CHOICE."}
{"text":"This place is a mess. Slow service due in large part to being under staffed. Food is average at best... when they actually finally get it right... the bartender is nice but he is too overworked to keep up. Unless you really can't go outside the hotel I wouldn't recommend eating here."}
{"text":"Attended happy hour, or thought I did, with a group. Waitress had nice, but showed no enthusiasm for us being there. She did not tell us about happy hour, and what was included.  About 5 pm I asked for menus since we wanted to order at happy hour prices. Most HH begins at 4:30. Here it starts at 5. So we learned our wine was not ordered during HH. We ordered apps and I ordered a burger. It was good, tho a couple dollars over priced, but it's HH. Got the bill. Burger wasn't included in HH pricing.  Totally missed the whole HH here. If only the waitress had explained it, or we should have inquired.  I know the food service has changed here, therefore so has the menu. I'm not a fan like I was."}
