{"text":"This place is disgusting. It smells like water rot and that would explain the cockroaches. I have no idea how this place stays open by the health inspector! The walls and floors are rusted through, the food is mass produced (not fresh, as falsely advertised), the food is microwaved and over priced. The staff is slack ass and I really do not know why there are so many good reviews when the place should be shut down by DHEC!"}
{"text":"After being given a couple of recommendations from people and co-workers I finnally decided to give The Sub Station a try. I decided to try their steak and cheese. Being able to get whatever add-ons I wanted without extra cost is great, the fact that I didn't get much or that they weren't evenly distributed wasn't so much. I decided on a nice bowl of soup to go with the sandwich, watery cheddar and stiff broccoli. Which had to be microwaved before served.  And that was only my first experience.  Thinking it may have just been a bad day, or I made the wrong choice in sandwhich (which shouldnt happen in the first place) I chose a chicken sandwhich. Again, getting tons of add-ons the only consistent one was the slices of tomato and lettuce, I was lucky enough to count three pieces of chopped onion and there was No oil and vinegar. So I had to ask for some ranch, which was pitifully bland.  I could be just catching them on a bad day, but if everytime I go there is a bad day for them. Maybe I'll just stay away so they can have good ones from now on.   3X3 Analysis:  Pros: - Nice amount of seating which is not intrusive to the order line or drink station. - Decent wait time. - Free refills (though I'm not sure if they were free or they just don't care).  Cons: (I'll have to narrow this down as I am only putting the top three in) - Bored or uninterested staff, it seems they'd much rather be somewhere else or doing anything but making food. - Disinterested for the care of the sandwich, not one of the sandwiches I got were well built. - Almost total lack of condiments, your only choice besides oil and vinegar is Sarachi sauce.   Final Decision: I doubt I will be returning there by choice. If I absolutely have to I may just ask for some chips and a large soda. Maybe a pack or two of crackers. So long as its nothing they actually make."}
{"text":"Sub Station was alright, but I wish I was more impressed.  I would probably choose Laurel Market South down the street before coming here again.  It is like subway, but with some more variety.  They have some specials and a few unique things.  I went with a smoked pork sandwich that they were selling from a partnership with some BBQ guy.  It was pretty standard, probably would have been better fresh.  There was also a large bone in it, which wasn't pleasant but I guess is evidence that the meat was the real deal.  They ran out of coleslaw (which came with the meal as listed on the menu) so I asked for another side or some money back and they acted really peeved and said the coleslaw was a freebie.  I didn't really comprehend that answer, so they gave me a cookie to make it better."}
{"text":"Solid place to get a good sandwich.  Everyone that works here is beyond friendly and I'm always in and out in no time.  They have an enormous menu and everything looks delicious.  I always go with the #18- salami, pepperoni and ham.  If you are a fan of the \"Italian\" sub, you'll love it."}
{"text":"Severe stomach ache after a tasteless lunch, very disappointing And would never attempt again.  Bread was dry, meat was dry."}
{"text":"Went in and decided to get a bowl of soup. Talk about chincy...I said it was a rather small portion. They told me their soup offering only comes in one size. I think, in its entirety, I had 10 spoonfuls from the portion. Yeah, don't think I will return."}
{"text":"I'll choose Sub Station II over any other sub place any day of the week. While I'm not really a person who thinks \"Ohhh, I want a sandwich. I'll go out and get one\" since I can make one at home--when I do have a hankering for one-Sub Station II it is. They have a huge selection of cold and hot subs which you can get small or a large plus a number of salads (which I always say I'm going to try but I succumb to the siren calls of their Reuben). As opposed to Subway and others-they slice their meat right in front of you so it's not all slimy and gross and the staff has been nothing but nice each time They have a good number of tables plus an interesting decor that reminds me of thrift store trinkets which I just dig. And just like Chick Fil A, I crave it every Sunday since it's closed--that's really my only gripe."}
{"text":"These subs are great! Cut fresh and made to order every time. This is very similar to Jersey Mikes int hat that cut the meat fresh right in front of you. Almost 50 different types of sandwiches available to choose from. Staff is always friendly and are gracious for the business. Even if a Subway or Quizino's was in the area, this would still be my choice. About 15 tables available to sit in and they also over large subs for catering! It's even open on Sunday's from 11am-4pm, which is great, as it's hard to find a sandwich place on Sunday's open."}
{"text":"The sandwiches are great, especially the ham and capicola.  Service is friendly.  My only complaint is they're closed on Sundays.  What gives?  People still gotta eat every day of the week.  Last time I was in here the staff was on edge and the sandwiches were completely wrong.  Seems hit or miss these days..."}
{"text":"I'd given up on trying to find a great sub shop. But this place his the nail on the head. It's classic style, good ingredients, and daily specials lend toward a very pleasant experience, especially if you're looking for a quick bite."}
{"text":"The service is rude and he food quality has went down hill.  Came for lunch today and my sandwich was so small.  Jersey miles has my business now."}
{"text":"Pretty straight forward place. Regular sandwich and chips, no frills. Inside is pretty sub par but clean. I got a roast beef, turkey and cheese with chips and a drink for under $10. I would go here again because it was a fine sandwich but don't expect any kind of goat cheese, special sauces, or homemade chips."}
{"text":"The service is really friendly here.  I like how it feels personal and how the staff remembers you.  I don't remember ever getting much of a wait in line - either that's because their service is so quick or I just hit it right sometimes.  Meat is good, and they're not stingy.  I like the condiments/toppings, especially the pickles.  Tomatoes are fresh and good, too."}
{"text":"I love going to local shops and decided to give Sub Station a try. I live right across the street so it was very convenient. I ordered the small turkey and cheese sub (about 8inches). All subs come with lettuce, tomato, onions, salt/pepper, oil and vinegar, but I also added olives and banana peppers. They had tons of toppings and sauces to pick from. I think you can also toast your sub, but I forgot to ask.   Unlike other sub shops, they cut their meat and cheese fresh so I was able to see my sub being make from beginning to end.   My sub was pretty good. The bread was light and soft and the oil and vinegar mixture made it very tasty. Next time I want to try the spicy mayo on my sub! There are tons of options here so you can't go wrong. They also have daily specials for a sandwich with a drink for $6.   I would be back for a quick lunch soon."}
{"text":"I've been curious about this place for quite some time, and decided to stop there for lunch today.  Unfortunately, I left quite disappointed.  First off, the place looks extremely outdated on the inside.  There was a decent lunch crowd, perhaps because of their very convenient location on South blvd, but I honestly felt depressed in there by the decor.  Service was good.  Lady at the register was friendly.  I decided on the chicken salad, which was the daily special.  AWFUL!.  There was maybe 3 pieces of chicken and was smothered in a not-so-good tasting mayonnaise based sauce, and a heaping mound of lettuce.  I will admit the bread tasted good and seemed fresh.  Not to mention the prices are kind of high.  Overall, better than Subway I suppose, but not on the level of even Jersey Mikes."}
{"text":"Meatball sub is amazing with cheese and oregano. Small size drinks are basically kid size so shoot for the medium. My only real complaint is the people behind the counter can be rude/impatient. The meatball subs are so good though j always come back for them !"}
{"text":"Although the interior could do with an update, the food is delicious. The meats are sliced there and give an authentic deli vibe to the sandwich. The bread was fresh and crusty. I would definitely go back."}
{"text":"It is not an avante guard sammitch shop but it is quite good. As far as the \"rude or poor customer service\" I have been here five times and never have had a negative experience. Sometimes friendly or exceedingly friendly but never rude.  I would recommend as they have great bread and a good sammitch."}
{"text":"I love SubStation sandwiches. Their bread is really weirdly good and unlike any other bread I've ever had. I should have taken a picture of my sandwich, but I was too busy engulfing it to pause and pose it. It's just the right amount of chewy and salty, and it's perfect.   The service is always really fast, and I am in love with their All Cheese. I think it's #12. Get it all the way, and you have to ask for pickles. These shops sometimes look a little run-down, but the food makes up for it. It's good and local, so you get all the benefits of Jersey Mikes or Subway without feeling like a soul-less corporate whore."}
{"text":"I have been here several times, but I'm pretty sure I've only gotten one thing out of all the times I've been there - the hummus wrap.  It is very good.  Get it.  Oh, and add honey mustard."}
{"text":"Ordered the Ruben number 21.  Slowwwwww waited 13 min for a sandwich.  There goes half my lunch time. The Ruben was ok but the thing I did not like was when they sliced the meat then put it all together on a small plate and put it in the microwave.  Lmao... Really... I gave 2 stars because even being nuked, was just so so.  Slow service though.  Call ahead of you want it when you arrive."}
{"text":"I have not  been in here for awhile but they have remodeled the whole thing. I got a cheese steak sub and the steak was sorta checked too long. Also for 9.00 I would expect a lot more meat, for that price I will stick with Penn Station or Jersey Mikes."}
{"text":"I've been trying different deli's all over town and I would say that overall this place is just Ok. I would stop here before a subway .. Cold cuts are cut right in front of you so everything is pretty fresh. Unlike subway where the meat just sits in those containers at subway for days....  If your looking for a quick sandwich in your lunch break, this would be a good place to stop."}
{"text":"Worst cheese stake I ever had!  Meat was dry, came with peppers onions & mushrooms, no onions, 1 mushroom & the bell-peppers weren't cooked."}
{"text":"Although Yelp calls this Sandwich Sam, I'm fairly certain it's still known as Sub Station II. On my quest around Charlotte to find the best reuben I stopped in here and was fairly happy with what I was served. The reuben was huge - more than enough for lunch and I was barely able to finish it (and I can eat quite a bit). The reuben was proportioned perfectly, with the right amount of corned beef, kraut, cheese, and russian that is required for a good reuben. Although the ingredients were just average, the large, hot sandwich made for a great reuben at a reasonable price. It lived up to expectations and was middle of the pack as far as reubens go."}
{"text":"I've always been a fan of this chain and rarely find fault.  We have been twice now to this location since we moved to SouthEnd.  I still prefer the bread quality at the Independence/485 location, but this is certainly the once closes to home.  We went once and again a week later.  The first time was good and the staff was average.  Last week we went and the ladies working there were unbelievably rude and unhelpful.  They didn't even make the sandwiches correctly.  It was odd.    I'll keep an eye out on this one Yelpers.  Hopefully this was a one time oddity because their subs ARE by far better than Jersey Mikes/Subway/ETC."}
{"text":"Subway is good, Sub Station II is great. This regional (Southeast) chain piles on the meat, cheese and veggies just as well as the other big name sammie shops in town. This one is particularly my fave as it's so close to my house AND they are now open a few hours on Sundays. Which it seems that Sunday is always the day I'm hankering for a sammie.   Inside, Substation II is pretty straight forward - a small collection of tables and chairs and an sandwich bar to place your order. I like the #10 (Turkey and Cheese) and occasionally I'll have them add bologna on my #10. Yup, bologna, the delicious mystery meat. The bread is always fresh, the meat always meaty and overall I'm just happy to have a sandwich in my hands in no time flat. The employees here have always been patient and friendly, both in-person and on the phone while placing a to-go order. If only they delivered..."}
{"text":"Subway, smubway. Sub Station II wins in my book.  Nothing fancy here. Just a small shop that cranks out delicious sandwiches. There's usually a line, but the wait is never long. Pressed for time? Call in your order and pick up. You'll be in and out in five minutes.  Most of the small sandwiches you can get for around five bucks. They have a sandwich for everyone. I usually get a small #10 (turkey and cheese), all the way, add mayo and jalapenos. Sometimes I get crazy and go for the #13 (ham, salami, pepperoni). They do not skimp on the meat. The veggies and bread are always fresh. Sandwiches not your thing? SSII does salads as well.   Heads up: make sure the person at the slicer gets your ticket. I see so many people who forget and then can't figure out why it's taking so long to get their food."}
{"text":"First the positive.  It's a Mom and Pop type place which I always root for.  And I will say the customer service is very friendly.  Which is why it pains me to give such a bad review but I pride myself in giving honest reviews regardless of whether its the little guy or a big corporate chain. I tried this place one day for lunch while waiting for my car to be serviced.  Simply put- one of the worst sandwiches of my life.  I ordered a club sandwich because it was the only on the menu without cheese and as someone who never has cheese on my subs I get tired sometimes of always having to explain that I don't want any.  What I got was the poorest excuse for a club sandwich I ever had.  Just think of a sandwich you pack in a plastic bag that your Mom or one of your parents friends gave you as a kid with the cheapest ingredients possible.  And that's what it tasted like.  And guess what?  Even despite getting a sandwich without cheese listed as part of the sandwich, they still put it on the sandwich!  Earth to sub people.  A true club sandwich does not have cheese.  My goodness in some areas of the country that actually understand good food you'd be thrown in jail for ever suggesting such a thing (that's sarcasm).  I've had club sandwiches at about 25 diners throughout the Northeast and never once did they try to sneak cheese on there.  Not to mention that the worst club I had at those places far exceeded this one. So again I calls it like I sees it.  Again I like the spirit of Mom/Pop type places like these especially as more South Boulevard is becoming heavily commercialized and forcing out some of the little guys.  But a Jimmy Johns or Jersey's Mikes here taking over here would be a welcome site.  Sorry guys but its time close up (sub) shop."}
{"text":"I came in on a Saturday evening and there was only one person inside \"charging her phone\". The man who took my order was friendly.  The subs are good, a lot to choose from, but I would recommend take out.  The store is not the neatest or the cleanliest.  The case that had some of the cheese didn't appear clean and seemed to be very outdated.  The lady charging her phone seemed strange and a little sketchy.  Other odd people came in off & on as I was waiting for my food...none of which ordered food, just asked for random things.  It was ok."}
{"text":"I live right across the street from Sub Station II and go there frequently.  The food is always on point and service is good to.  Last time I went my girlfriend forgot her purse and the cashier came running after us a few blocks away after we had left -- Employee of the month!  As others have mentioned, the sandwhiches are similar to a Jersey Mike's -- fresh ingredients and toppings.  The pricing is similar too, but its supporting a local establishment."}
{"text":"This place is an abomination. The \"turkey\" was closer to the film that collects on top of soup that is left on an unheated stove for too long. The mere fact that this quality of meat exists is depressing. Additionally, I opted for a large sandwich and found approximately three slices of said \"turkey\" on the bread. Utter malarkey. Unless there is literally not a single other type of food that you would eat within a four block radius, avoid at all costs. Save yourself $10 and a stomachache."}
{"text":"Sub Station is a great lunch spot, with a large variety of subs and salads. The subs come with fixings, but there is a large list of additions if you would like. I arrived shortly after 12:00 and was surprised to see how crowded the place was, a good sign in my mind.   I ordered the #10 turkey and cheese with the fixings and added mayo and pickles with chips and a drink.  The service was great and my order was ready very quickly. I got it to go and was surprised they did not skimp on anything. Definitely a large helping of turkey, lettuce, pickles and mayo.  The sub sure hit the spot and I will definitely return.  Keep in mind the place does pick up around lunch hours, but the line definitely moves quickly!"}
{"text":"I hate to be the Debbie Downer, but I always thought their service is lacking. I come here every so often for lunch, and that's the worst time. I have to say they have gotten better, but for the most part they are still hit & miss with taking order and preparing the sub the way it was ordered.  Case in point, I was distracted by 2 people smack next to me having a conversation. I ordered my normal #38 Turkey Cordon Bleu (half). Somehow I ended up being charged for a combo which I didn't say I wanted. And instead of taking that off the order, the guy behind the register just looked at me like \"well, go get yourself a bag of chips.\" And when I got my sandwich, it didn't have anything on it that I asked for (all the way, no vinegar, with mushroom & honey mustard).   Their system is so outdated, that after you pay, they gave you a real print out little ticket from the cash register, which you then have to give it to one of the 2 people behind the counter making the sandwich. This system would work if the 2 sandwich makers are spot-on, but they normally aren't.    Having lunch should not be a frustrated event, and for that reason I think I'll at least give this place a break for a long while before consider coming back. If you want a sub near this area, just head to HT. At least it's cheaper."}
{"text":"The man serving me was very rude. I tried to ask a question before ordering and he brushed me aside.  Then I got my order and it was not what I expected - egg in chicken salad!? I had to chuck the whole thing."}
