{"text":"I was visiting my parents and needed somewhere to eat.  My mom wanted a really good sandwich.  I found this place online, read the reviews, and took a chance.  The inside was very small which proved to be a positive for this environment as they definitely need to discourage as much loitering as possible. When my mom and I pulled into the parking lot, we observed white guys \"dapping up\" every hand that walked by while enjoying a good smoke and leaning on their buddy's old white car. I went inside and the guy took my order and was very patient and nice.  As patrons ordered and received their food, it became obvious all food is placed in tiny, brown paper bags.  How cute and endearing.  The establishment is not fancy and oozes old-school, and it works for them.  I waited for my food and kept looking at the guys cooking and thinking to myself how familiar they looked.  I started to wonder did I attend high school with one of them, or did they fly into Charlotte-Douglass at the same time/day as me? \"Damn, I know that I know these guys.\"  Like a ton of hot dogs (fixed all the way) it finally hit me.  These guys were the dudes slapping every hand walking by and smoking when we drove up.  \"Shit, now what? Do I walk away (although I have already paid my money) or sit tight?\"  I chose to sit tight knowing full well they entered the sandwich shop right behind me.  I was so focused on the menu that I didn't see them wash their hands, but its cool though because maybe they did. Besides I can't see everything--I guess.  I got my food in its little brown paper bag with grease stains and love it.  The food  had that quality, old-school taste, packaging, and simplicity to it.  All in all.  I'm a fan--cigarette smoke and everything in between.    All you need to do is pray over your food and dig in.  You will not regret it."}
{"text":"Chili cheeseburger, one of the best in town. Delicious pork loin sandwich, chicken salad, chili dog, all good. I get fried okra instead of fries. Fried to perfect crunch. Everything prepared fresh. Just wish they had iced tea. No dine in."}
{"text":"This is a great whole in the wall place to eat at. Good food at a great price. The service is pretty good to. If you like burgers and hot dogs but don't wanna make them yourself or pay a lot of money."}
{"text":"The food is better than the look of the place would have you think. It's carry out only so keep that in my mind when choosing to get food from here. The service is fast & friendly. Food very reasonably priced with great daily food specials."}
{"text":"Great burger. Got bacon cheeseburger and it was very tasty and I'd say comparable to a cheaper five guys. I will certainly come back"}
{"text":"Great burger. I was a little disappointed at its thinness because I love a rare burger and it's virtually impossible to do with meat that thin...but the flavor was fantastic, the owners seem really nice and you can't beat the price! I'll bee back!"}
{"text":"My husband and I are new in town. We have been looking for good  burgers since moving to Charlotte.  I admit, I was hesitant because the building was shabby. Let me say, never judge a book by its cover. The prices are good and the food is excellent.  This is the best burger I've had in years.    The staff was very nice and welcoming.  The owner made my food while I ran across the street to Food Lion for cash. They only accept cash. He also let me know we would definitely be back. He was right, we will be back!"}
{"text":"I really don't understand all the 5 star reviews for this place.  The food is decent, but there is no seating, the place seems filthy, they only take cash, and it's in a sketchy part of town.  I will say the food is cheap, but they use frozen patties, and leave their fries under the heat lamp way too long.  I won't be back."}
{"text":"After some extensive Yelp research, it was my husbands idea to try this place.  Let me say, I was skeptical at first -- but holy crap, this place is awesome!! Best fried bologna sandwich I've probably ever had, and the hubs pretty much devoured his burger. It was so good that we try to stop by every other week!  Don't be discouraged by the area, this place is a true hole-in-the-wall but it's well worth it.  And FYI it's cash only."}
{"text":"Excellent sandwiches! Service is an \"at home\" feel! Great when you need a quick, inexpensive, no frills lunch!"}
{"text":"Ordered the bacon cheese burger with fries.Burger was juicy and the bun was fresh. Didn't have to wait long for my order.Deffinately a better value than Fiveguys!"}
{"text":"For the money and the time, this is one of the best deals in town in my opinion. Get the mushroom swiss burger and fries. No seating here. Just a counter.  Did I mention it's cash only? Totally worth your time."}
{"text":"Okay, so this is really what I call a hole-in-the-wall.  We were in the area (at Revive Salon) and pretty hungry.  The only restaurants available were Chinese food and The Sandwich Shop.  Well, that was an easy choice.  Here, you can only order food to go.  There is a small waiting room and there are no tables.  Service was friendly and pretty quick.  I ordered a grilled chicken club sandwich that was very good ($5.55 + tax).  However, the bread was really not thick enough to support the sandwich as it should have.  Mind you,  I was pleased with the sandwich but it seemed they used the thinnest of thin bread to make it.  The sandwich included the grilled chicken breast with bacon, cheese, lettuce, tomato, and mayo although you can omit what you don't want.  I am sure I will visit again when I am in the area and my stomach is calling.  I will choose this restaurant over Chinese food any day of the week.  Although the place is not visually friendly, the food is good to eat.  4 stars for the food and the menu variety 4 stars for service 3 stars for the restaurant overall"}
