{"text":"I would give negative stars if I could.
Unfortunately the food here is good however I will never patronize this establishment again based on the the  actions I witnessed the owner take during lunch during my visit.

It was not busy maybe 4 tables but he was clearly flustered in the kitchen which is visible from the dining area. He was throwing F'bombs around and was yelling I mean YELLING at the one server who was on duty about tickets getting messed up.
She was mortified and almost in tears when she brought us our soup. I told her to tell him we would never ever give him a dime of our money again and we left her 100% tip.

I have never witnessed an employee being treated with such disrespect in plain sight of customers.  I hope people remember this is how this owner treats his employees and will keep this in mind when they decide if they want to give him their money.  It was appalling!"}
{"text":"SAN FRANCISCO VISITOR ate here 3 times in one week."}
{"text":"Food was exceptional... Went there a couple weeks ago. The place is small but has great ambiance.  It is pricey but worth it.  Only issue is when you get there you walk right through the dining area and must wait for a seat by the bar.  My only complaint was that the waitress was overwhelmed and forgot to offer drinks of any kind.    Other than that I would highly recommend the restaurant."}
{"text":"Love this place. The food is excellent, the wait staff has always been attentive, and it's just a great little place that is fun and funky."}
{"text":"Limited menu, but very good food. I guess they on cook what they make best, and it works. Everything we ordered was tasty, hot and seasoned perfectly. We would definitely go back again. We had the Beans and Greens,, veal braciola, and two pasta dishes all great. This is a byob place, with reasonable priced and easy parking. 2 thumbs up."}
{"text":"This place never disappoints.   Beans and greens are amazing.   Spinach never wilted and just the perfect amount of garlic and onions.   Seafood was  on point tonight."}
{"text":"The location is great. The atmosphere is charming. The food is outstanding. The service is beyond horrible. Three waitresses congregated in the back area and had a conversation about Facebook and weddings and alien looking grandnephews at a volume that was so loud they should have just pulled up a chair and sat with us because I felt like I was part if the intended audience. The best part was the discussion about the one woman's first trimester and then her labor. And drink refills and seconds on bread were non-existent.  It's really too bad the help ruins the entire experience. A little service management would make this a great experience instead of a real loser."}
{"text":"Sort of a surprise New Year's dinner pick but what a pick!  It's a very small place (holds about 30 - 40 total) but will accommodate larger groups.  We had a group of 18 and they made it work for us.  The staff was great, very attentive and pleasant.  And the food...fantastic.  I had one of the specials, chicken marsala which was served over pasta.  Melt in your mouth good.  My chick had a seafood pasta thing that looked great - clams, scallops, shrimp in a spicy red sauce over pasta.  Others had crab cakes which looked good too.

This is one of those \"hole in the wall\" places that you'd never think would be great but I certainly recommend it."}
{"text":"Long wait time but totally worth it! Small restaurant with vibrant atmosphere. Food was excellent. Our server was completely swamped but remembered every little request. Very competent."}
{"text":"Stopped for dinner and had an excellent meal. Was very good all the way around, food and service was excellent. We will be back for sure The only bad thing was we sat near the front windows and they need washed really bad.."}
{"text":"I had the paninis a few times and they are homemade and tasty. Come with a side of pasta salad. Average lunch price for something homemade and hearty."}
{"text":"This place reminds me of something out of the Godfather - \"A place with good food where people mind their own business\". 

Unlike the restaurant in the movie, however, you can expect a good deal of loud talking... which to me is very Italian.  The restauarnt is small and the tables are right on top of each other, which makes you part of the conversation from your fellow diners.  Couple that with the BYOB policy, and you're in for some loud talking (table next to us had at least a dozen bottles of wine of the table for a party of eight!).  You have to shout a bit to be heard by your fellow diners, but that's part of the ambiance.

Aside from the noise, the food is fantastic.  I went with a party of four around 9 p.m. on a Friday and we still had to wait for a table, which is a testament to how good the food is in this place.  They have a pretty basic menu with a decent sized list of daily specials, which provides more than enough choice without being overwhelming.  Everything we tried was delicious - mussels marianara, cheese pizza and gnocchi with the gorganzola cream sauce were the standouts.  

Sarafino's represents an outstanding value.  The food is well priced and the BYOB policy helps keep the cost of the meal down as well.  This is one of my new favorites in Pittsburgh - I'll definitely be back."}
{"text":"This being my first review, and the fact that I am a \"self-proclaimed\" expert on the Pittsburgh dining scene, I find it ironic that Sarafino's will be the first restaurant that I write about. I say this because I have eaten at just about every high profile restaurant in and around the city and the last place I would have expected to find such a hidden gem would be in Crafton. No disrespect to all you Craftonites, or Craftoners, or whatever you call yourselves. The real irony of my writing this is that after haven eaten so many amazing meals at places like Eleven, Bona Terra, Davio, Alla Famiglia and Bistro 19, this little hole in the wall was so good that I only now decided to sign up on Yelp to tell all of Pittsburgh about Sarafino's.  GFOJC (girlfriend of JC, thanks Munch) had heard about this tiny BYOB through her colleagues and we finally decided to go last Friday night to check it out (they don't take reservations). One of the best signs of a good spot is seeing  customers waiting outside and sure enough there were plenty of hungry patrons standing out front on a rainy Friday evening. We enter tiny Sarafino's to find a casual, narrow space with a noisy open kitchen and white paper-covered tables??  I counted 44 seats with 2 or 3 tables able to accomodate parties of 6 or more.  There is no bar except a small little counter area where you can open your bottle of vino while you wait if you're lucky enough to snag one of the 3 or 4 bar stools. We decided to wait outside and chatted with a few of Sarafino's friendly regulars. We asked them what they recommended and of course their answer was \"everything is good.\" They all seemed to talk about their famous Fried Ravioli app, the Greens & Beans and their pizzas. Consider me a skeptic. We were 1 or 2 parties away from being seated so we ventured inside to check on our table status. While we waited for them to clear our table, one of the waitstaff dropped a complimentary plate, no a mountain of the aforementioned Fried Raviolis for the group of salivating patrons seated at the counter. I quickly moved in to get my piece of this fried pie which was drizzled with their almost-famous tomato cream sauce. I put 2 ravioli on a plate and quickly took a bite, looked at my dining companion, and smiled. She took a bite and smiled back.  I know what you're thinking.  Fried Ravioli, come on, how good could they be?? They were amazing!  Gently fried to perfection, plump, tender and full of sweet cream ricotta and the sauce is sweet and tangy.  Wow, if this was a precursor of things to come we were in for a treat.   We were finally seated in the corner, handed our menus and had my bottle of 2005 Poggionotte Nero d' Avola (highly recommended under $20) opened. The menu is small but with plenty of options and 4 or 5 nightly specials.  My lady ordered a menu staple called the Rita , which was Penne in tomato cream sauce with pancetta and onions and a little red pepper heat. Having enjoyed the Fried Ravioli so much, I decided to order the Cheese Ravioli entree special but asked if I could have the delicious tomato cream sauce instead of their homemade marinara. Our waitress assured me the chef would be happy to oblige. We also decided on the Hot Polenta app instead of the good-looking Bruschetta that had goat cheese, pancetta and sun-dried tomatoes. The table next to us were devouring it but we didn't want bread overkill since already at our table was this fresh-out-of-the-oven Mancini-looking small loaf of bread. The accompanying garlicky olive oil is delicious and the bread was so soft and warm. So far so good at Sarafino's.  Next out came the simple mixed green salad (a la carte) with a very good Italian vinaigrette, onions, tomatoes and crumbled blue cheese. It may have looked simple but it was very good. While eating my salad our appetizer comes out (my biggest restaurant pet peeve) in this giant bowl of soft polenta with a pool of marinara and parm cheese on top. Earlier I mentioned the \"mountain\" of ravioli on the appetizer, well the giant appetizer portions is a recurring theme here. After having barely put a dent in our 1/2 gallon of delicious creamy Polenta, our entrees arrived. Both were outstanding and pastas were cooked perfectly al dente. I am a sucker for good ravioli, two of my favorites being at Gran Canal Cafe and Legume's butternut squash ravioli, but I would put Sarafino's right there with the best of them. The Rita was very good and lucky for me there were plenty of leftovers.  Again, the homemade ravioli were perfectly cooked, filled with sweet ricotta cheese in a pool of that delicious sauce. We can easily be talked into dessert and coffee and boy were we glad we didn't pass on the delicious toasted almond cake.   Pricing is very reasonable with our entire bill being about $50 for what was a wonderful meal at a wonderful restaurant. To make a long story short, I know it's probably too late, but have I mentioned that I really enjoyed Sarafino's?"}
{"text":"Worst service I can remember at a restaurant. It's completely hit or miss. We were the first in line waiting for a table and waited 45 minutes to be seated and another 15 minutes before the waitress running around like a chicken with her head cut off delivered bread water and our opened bottle of wine. Fodd was good but a pizza and some pasta shouldn't take two hours!!! Do yourself a favor, get there at 5:30 on Friday or pick another night to go. If you don't get a good waitress or the first seating, you'll be sorry you didn't do takeout."}
{"text":"Sarafino's is a favorite lunch spot. The food is excellent and the bread with the dipping oil is simply irresistible. I am a big fan of the Alfredo with chicken and the sausage sandwich. You won't go wrong with a meal from Sarafino's!"}
{"text":"I have heard so much about the place and finally had the opportunity to visit for lunch. I loved the atmosphere as it was nostalgic and having Joe cooking our food only a short distance away made me hungrier by the moment.

The food didn't disappoint me at all. We were served a fresh out of the oven loaf of bread, delicious! My wife had a vegetarian sandwich with a side salad and after the hot bread and salad, well let's just say the sandwich had to be taken home! I had a veal over pasta and it was delicious! 

I would definitely suggest the paying a visit and don't forget your wine as it is a BYOB. The atmosphere is nothing fancy but is very cozy and exactly what you want when eating authentic Italian cuisine!"}
{"text":"The food was just very typical Pittsburgh Italian food. Same sauces with regular pastas. Huge portions of overly garlic-y food. Nothing truly to write home about. I just wasn't impressed. 

The restaurant was an old pharmacy. So, it is tiny. I think there were 15 tables. I felt crammed in and there were only two other tables with customers. 

The waitstaff kept going into a curtained off area just beside our table to get supplies. The coffee was in a huge carafe. The atmosphere just wasn't pretty and cozy as it should have been with such a tiny place. 

The food wasn't terrible, but it wasn't great. I'm not sure if go specifically to Crafton for this place."}
{"text":"I really like Sarafino's for the food and the atmosphere.  It really is small, but that's part of what makes it so special.

Last time I had a special which featured roasted chicken over a risotto.  It was outstanding.  And the thin pizza - just the right amount of sauce and cheese.

Be prepared to wait, but it's worth it!"}
{"text":"An excellent spot for dinner, I was genuinely pleased with both the service and the food during my visit.

Can't wait to head back to this place on my next visit to Pittsburgh."}
{"text":"If you want fantastic homemade italian food in a casual atmosphere, this is the place.   BYOB.  If they have the steak special - get it.  My husband swears it's one of the best.    The service is great.    It's small so you might have to wait, but it is worth the wait.  You won't be disappointed."}
{"text":"I ate here with a couple friends for dinner on a Thursday night. It was small but nice inside and our waitress was ok but not great. The food was good but all 6 of us felt it lacked real flavor. Everything needed salt. We got the greens and beans that everyone raves about and none of us felt that they deserved the praise they had received. It was a fun meal but more bc the company and not so much the food. Not sure that I would go back and I literally could walk there."}
{"text":"Stopped in to get take out. Ordered a pasta dish & a salad. Got home (2 min. Away) & salad was wilted & nasty!! The pasta barely had any sauce on it & was tasteless!!! For a lunch that cost nearly $20 - are you kidding me???!!!! Don't waste your money - I never will again!!!!!!"}
{"text":"The food here is EXCELLENT. If you love independent neighborhood joints that stress deliciousness over decor, this is a great place for you. It has maybe 10 tables jammed into a small dining area that creates a bit of a family feel between you and other diners. 

Though it is BYOB, they are happy to provide glasses and open wine bottles. There is a listing on the menu for a $5 cork fee, though my table wasn't charged for it. So if you're taking wine, put a cork screw in your pocket or purse.

As for the food, it really was quite good starting with the bread and dipping sauce. Our party of four had the signature greens and beans, a meatball panini, a linguini with red clam sauce (which my wife said was the best she's ever had), a linguini with white clam sauce, and a gluten free pasta with pomodoro sauce and everyone reported their enjoyment of their respective dishes.

Sarafino's loses stars for a situation we encountered at the end of our meal. With several parties waiting to be seated, it was clear that the head waitress was encouraging our server to get rid of us. We were never offered a desert menu, had to ask for coffees, and suffer through a clearly exasperated head waitress verbally berate our server for allowing us to order it. 

While the food was out of this world, the servers must be made to realize that they are every bit as important to patrons enjoying a meal as the quality of food they serve. I will return to Sarafino's because the food was that good, but if the servers bicker openly and make me feel unwelcome again, it won't matter how good the food is, I won't be back for a third time."}
{"text":"Love the menu.  Some of my favorites are beans and greens.  The Crabcakes are fabulous."}
{"text":"First time diner, will be sure to come back. The food was amazing, really liked everything we got. The bolognese sauce was to die for. BYOB allowed us to have a decent bottle of wine without a huge markup.  Its really small, and pretty noisy as everyone is essentially in one small room. (Hint:sit outside if you can). Not noisy bad, noisy like a big Italian family having dinner. Dont expect a quiet date night, (especially if you get stuck sitting next to the drunken, shrill harpie behind our table).  Perfect if you are going out to celebrate!"}
{"text":"This place was awesome. I loved the fetuccini Alfredo, it was so light and creamy and made from delicious cheese. The pizza was warm, fresh, and the fresh basil made it all amazing. Will be coming back most definitely!!!!"}
{"text":"BYOB with a $5 corkage fee.  this is a hole in the wall italian joint with food to die for.  the warm bread served with olive oil was delicious.  the greens and bean appetizer comes with spinach, garlic, onions, banana peppers, hot sausage and is simply amazing.  i ordered the mushroom ravioli special and was very pleased.  the price is reasonable and the BYOB is a win.  i will come back and i don't mind driving out of downtown pittsburgh to get here because the quality, the taste, the price, the BYOB, the atmosphere it's all worth it!"}
{"text":"Please reserve your table for a Saturday evening ! A 30 mins wait at 5:30 but worth the wait . 
It's a small place and hence a few tables are a little tight but then at times you don't mind being part of the crowd.
Let's come to the food-
The bread was nice and fresh and the sauce that came along with it was delicious! 
The Pastas that we ordered :
Sarafino's- excellent pasta . The fettuccine is probably the perfect pasta for the Sarafino. Not too heavy on the stomach and gives you the perfect mix of the Alfredo and pomodoro combined .
Pasquale's : The Penne was cooked to perfection and the sauce was kind of loose ( did not mix well with the Penne) and hence it felt I was having the penne separately from the sauce . The sauce was nice though -we did add an extra side of chicken to it. 
It was nice to see that the owner came out to meet a few people - seemed like there were a lot of regulars to the restaurant."}
{"text":"This is our second time here and it is really good. Great pasta dishes. Small menu and small dining area, but pasta sauces have BIG flavor. A very relaxed, small town Italian place with the atmosphere of a New York City hole in the wall,...and that is meant in a good way."}
{"text":"My grandma and I went for dinner here recently and the food was delicious. I ordered the crab cakes; they were delightful. The dessert - moscato berry cake, was divine! The waitress couldn't describe it but I took a leap of faith and ordered it anyway. So glad I did. Huge chunks of berries baked into a vanilla cake with layers of wine flavored cream in between. I moaned with joy the entire time I ate it. 

The service was iffy, our waitress seemed stressed as soon as she had more than two tables. She rubbed me the wrong way when she refused to let me pack up my own leftovers. She didn't seem to have enough knowledge of the menu items. 

We will definitely be back though!"}
{"text":"Really good food, excellent service, fairly priced. It's a small place, so it's intimate/cramped depending on your perspective. The diavola could be a little spicier, but that is easily fixed with some crushed red pepper. The gnocchi is made with ricotta. I'll be returning!"}
{"text":"Great local hole in the wall kind of restaurant. It's an old house, but the homemade Italian fare is consistently delicious. You'll find pizza, sandwiches and pasta on the menu. The greens and beans are fantastic and they always have several specials throughout the week. The crab cakes are my favorite! It's also BYOB so it's a great place to gather friends and have a casual night. There's always a wait on the weekends since it's a small, but they've recently joined No-Wait, which is great!"}
{"text":"A go to restaurant in Crafton?  Yes!  You have to know where it is and how to get there, but once you do, it is definitely worth it!!  You know something is going to be good when you walk in and you are only about 5 feet from the kitchen where the chef is pounding and pounding away on fresh veal!!

My wife and I love good Italian food and after Francos in Dormont closed, we were depressed.  But alas, we found a replacement...

Its a small place, but so are most of the great Italian restaurants on Mulberry St in New York City, so get over it.  The food is great, except the soup, I ordered the Pasta Fagioli, it was loaded with beans and pasta, but the broth was watery and bland, not my first choice, (that is the only reason I gave 4 stars vs 5).  BUUUUT, everything else was absolutely excellent!!  The Bruschetta was excellent which included an Italian salad in the center, Pasta with red clam sauce, Fettuccine with Oglio and grilled chicken, Veal Parmesan over linguine, and fresh bread hot out of a very, very old pizza oven with a classic oil dipping sauce...

For the quality of food and large portions, the pricing is reasonable...

If they had tables outside on the sidewalk, it would be just like Little Italy in New York!!"}
{"text":"Our first time at Sarafino's was amazing, every good thing we heard was true times ten. Our Server Holly made the whole experience even better. She was awesome and so welcoming.  The server makes or breaks a restaurant and she was outstanding. The food could not have been better.  Like having dinner at a true Italian grandmother's. The bruschetta is the best in the City. The bread and oil are amazing, little touches that really set Sarafinos apart.  The quality is first rate and it is presented beautifully.  Be prepared for a crowded atmosphere- but that's part of the charm.  Go. You'll love it."}
{"text":"Our waitress is rude and careless. Service is extremely slow in this place. The food is ok."}
{"text":"When you find good pasta, you eat it ;) this restaurant has pretty good pasta. We are not as familiar with the area, but a friend recommended this restaurant. We sat outside because the place was packed. It is BYOB, so we brought beer and wine. That is huge huge plus for us!
We ordered the mussels as an appetizer and they were very good. I had a seafood pasta with white sauce ! It was one of the evening specials. It was very good. Everyone else ordered with  pasta with red sauce or pasta with chicken.
I really enjoyed the restaurant. It is definitely worth a try if you love pasta and their pizza looked really good as well."}
{"text":"Ah, back in Pittsburgh after seven years. Actually, I've been back for a few months, but hey, I had to hit all my fave spots again before I could start cranking out the reviews. You understand.

Anyway, what I really want you to know is that Sarafino's is my favorite Italian restaurant, period. They're just as excellent now as they were before I moved. Not that I was worried they'd change, but it's good to know that this place has stuck to its menu and terrific daily specials.

Sarafino's is small and cozy, and as cliched as it might sound, it feels like family. The staff are always friendly and inviting, the owner a great guy who cares about his establishment. It's always seemed like a hidden gem tucked away in Crafton, and maybe that's the best thing about it. There are a ton of Italian restaurants around Pittsburgh, and Sarafino's is in a league of its own, off the beaten path.

So what's great here? Everything I've tried. The bread that is brought to the table has the best dipping oil I've ever had. It's sweeter than other places, and one could be forgiven for filling himself up on the bread alone. But that's just for starters. The famous greens and beans are just the thing if you're looking for something on the spicier side, and the wedding soup and pasta fagioli are fantastic.

My favorite thing on the menu, though, is the gnocchi. I've never had better. It literally melts in your mouth, which is what a great gnocchi should do. It's never chewy, never tough. I always get mine in the roasted red pepper sauce (there are plenty of other sauces to choose from; they're all tasty) with meatballs. And man, I love Sarafino's meatballs. They're one of a kind, milder than others, but perfectly complement the dish, while also soaking up the flavor of the main entree.

The seared steak panini and grilled steak salad are also must-haves. And the pizza? My fave in the 'burgh! A nice, thin crispy crust with a sweet sauce base and delicious toppings of your choice. Then there are the daily specials. The crab cakes with portobella mushroom on the side are amazing. Nothing but crab meat, no filler! And if they have the lasagna, you cannot miss out on that. It will split your mind open in a revelatory fashion, I kid you not. Then there's the veal parm, the ravioli...you get the idea.

So for those of you who actually favor joints like The Olive Garden or Bucca di Beppo, knock it off. This is the real deal. Of course, those of us in the know don't mind keeping Sarafino's all to ourselves. But you'd be missing out on one of the best if you didn't stop by."}
{"text":"People Love to go to the hot new restaurants, and Im not immune to the buzz... however, having been given the suggestion of this old establishment, I thought Id give it a try for my wife's birthday with my 3 young sons. While the decor of the place is very dated it has the feel of going to your grandma's house, and the food to match. I mean the food was exquisite! I had the scolioli (sic) special, the mussels in white sauce for an appetizer and my wife had the vodka pasta (The Rita?) and my boys split the meatballs & marinara. All of which were some of the best Ive ever had. The were extremely accommodating to my boys and served the food in a way that kept the kids occupied. And the bread was hands down the best bread ive ever had at a Italian restaurant which is a serious statement. Also, Pirates ex-manager and World Series winner Jim Leyland was at the table next to us and couldnt have been nicer!
An overall great experience!!"}
{"text":"The best greens and beans in town.

This place is cozy and friendly.  The food is always amazing and it is BYOB!"}
{"text":"Ok so if you like American Italian food this is a very average. Some dishes OK but mostly run of the mill American Italian fare. 

Best part it is byob. The place is very busy so there is a place for this kind of food. 

My recent visit was made even worse by a very bad waitress who was both rude and ineffective."}
{"text":"We were visiting the Pittsburgh area and checked out Sarafino's after a high recommendation from our Airbnb host, and it lived up to the hype. Had a delicious Cajun crab dish with homemade pasta that was a special for the day. We all enjoyed our meals as well as the atmosphere and the friendly neighborhood feel. One thing to know if it is your first time, it is BYOB."}
{"text":"What a great little place! As someone who appreciates a fabulous, homemade Italian meal, I loved Sarafino's! Chris and I have lived a few minutes away from here for a couple of years and people always asked if we came here (because they loved it). We finally got around to checking it out at the last minute on Saturday night. 

Since it was a Saturday night, I called beforehand to see if there was any chance we could put our name on the list to be seated earlier. The woman on the phone informed me that we needed to come in because she had a \"laundry list\" of names. We had nothing else to do that night so we still went and put our name on the list. The hostess let us know that we could go to the bar next door while we waited and they would let us know when our table was ready. After about 45 minutes, we received the phone call and we were seated at a small table in the corner. The inside of Sarafino's is very very tiny and large groups of people seemed to be the majority of customers that night. My ONLY complaint is when we were seated the waitress didn't come to our table for about 25-30 minutes- not even for water. When she finally noticed that we had not been taken care of, she was very nice and was apologetic about the wait and quickly brought us water and bread & dipping oil.

Once I tried the bread and oil, I knew this place was going to be amazing. The bread was fresh and the oil was addicting. We decided to start off with their famous greens & beans- if I'm being honest, this isn't something I would ever order and I wasn't super excited about it. OMG-- I was wrong. This dish was super flavorful and unique from anything I have ever had! Chris and I basically licked the bowl clean! For our entrees, it was almost impossible to pick- everything literally sounded mouthwatering to me. We ended up ordering pizza & pasta to split... AKA loading up on carbs... we were at an Italian restaurant after all! We chose a small pizza with peperoni & hot banana peppers and the Sarafino's pasta dish. The pizza came out first and was the perfect size for splitting with someone! It had an amazing thin crust and I loved every bite I took. I also loved the Sarafino's pasta dish. The roasted red pepper sauce was different from any other sauce I have had. It also had chicken & mushrooms mixed in it. Another plus of Sarafino's is their servings are huge- we even had enough to bring a decent amount of leftovers home... which is very rare for us!

My ultimate test of an Italian restaurant is if my 100% Italian \"I only eat authentic food\" Father would enjoy it.. and there is no doubt he would love it here. I look forward to coming back and maybe giving a 5!"}
{"text":"Great food and service. This is definitely a little gem in the neighbourhood. They don't take reservation, first come first serve, and bring your own liquor! Only a $5 cork fee. Their seafood pasta in red and white sauce are really good, crab cake is must to have! The best I've found in Pittsburgh area so far. Our server Holly is very nice, we really enjoyed the family dinner there."}
{"text":"Our local foodie friends have been recommending this BYOB Italian restaurant to us, and I finally went last night with a friend. Sarafino's is very non-assuming from the exterior, and the delicious hefty-sized portion home-made dishes make it a true neighborhood gem. In addition to a bottle of wine (only a $5 cork fee), we split the special marinara mussels appetizer, polenta appetizer, special crab cake entree, and Della's Spring Diavolo (with the gnocchi substituted in place of the rotini). They were all delicious, but my favorite dish was probably the mussels appetizer because I've never had them prepared that way before and they were so flavorful. Two thumbs way up - I will be returning soon!"}
{"text":"I LOVE Sarafino's!  They are BYOB and might be my most favorite place to eat Italian food.

Every time we come here (which is a lot) anything we order is always so delicious and perfectly seasoned AND the portions are so huge I almost always have leftovers for the next day. 

The servers are friendly and awesome - Daisy, Melissa and the newest addition Tonya - love all 3.  They all make us feel welcome and right at home there and we love coming to see them.  

Food wise, for starters we usually get the beans and greens but lately we've been getting the polenta - which is stick to your ribs delicious-especially when it's cold outside.

For dinner, my usual is the Rita's, switch out the penne with gnocchis and add meatballs - which I always say I'll get something different but never do because I love it so much.  However, we went on a Friday during lent so I had to find something else. What's great is they always have seafood/fish specials so I ended up getting the pasta scoglio in a red clam sauce - and wowee wow wow-  did I love it!  It was full of flavor and chock full of mussels and shrimp and scallops - every bite had a delicious bit of seafood-I was in love.

Hubby got the Chilean sea bass special - which was out of this world.  Honestly, everything we get here is so tasty you can't go wrong with anything you order - highly recommend trying this off the beaten track place - we absolutely love it.  

Ps I loved my dish but was so sad I didn't get my usual so when my sister wanted to come here for her birthday the next night I was thrilled to say - sure it's your birthday, whatever you want.   :-) guess what I ordered?"}
{"text":"Great wait for a table, but had lovely time visiting and catching up with friends.  Daisy was our server and did a fantastic job introducing us to the specials of the evening, from appetizers through desserts the food was phenomenal."}
{"text":"I give this place four stars only because our waitress wasn't that great. The food was really good! My husband and I both loved our dishes and it was BYOB which is amazing. Our waitress was just not nice or friendly at all. We will be back though."}
{"text":"Tried it for the first time.  I am sorry we didn't go there before.  Very good I got the Mussels with tomato sauce nice, not your typical butter and white wine. Also had the Greens and Beans they use spinach and add sliced sausage a good balance with just a little heat on the back end. Then I had pasta with bolenglese sausage tossed in too, not shabby a real homemade taste.  

Negatives
Crowded it is tinny so go early or plan to wait
Restrooms are NOT ADA up on second floor
No liquor so BYOB 
Portions are big

Positives
Food is real deal 
The have some off menu gems
Wear loose fitting pants and get a urber so you can sleep off the food coma"}
{"text":"We go fairly regular for weekend dinners. Food, atmosphere service is great. The loaf of bread and oil to start you off is really good. Sometimes a cramped wait but worth the food. BYOB is a big plus. Try a special."}
{"text":"Yum! Great flavors! Every pasta sauce we've had has been wonderful. Reasonable prices! Awesome atmosphere...you'll feel like you're sitting in your Italian gramma's kitchen! Some of the waitresses - eh, not always the most pleasant. But easily ignored as soon as the hot bread is delivered to the table! Must try!! Go at off hours or you will wait forever!"}
{"text":"After reading other Yelp reviews, I knew this was a must try spot. I went in with little expectation for the wait staff, but we were pleasantly surprised! Our names were taken down, we were showed where we could wait and only waited about ten minutes for a table. 

Our server was as sweet as could be and got our drinks and bread right away. If I had to leave after the bread and dipping oil I would have been ridiculously happy. The bread came out piping hot and the dipping oil was better than anything I've ever had. 

We ordered soup which came out right away and was tasty. Our meals came out only a few minutes after we finished our soup and we were not disappointed! I got the Rita pasta and my husband had the Sarafino pasta, both of which were incredible! 

We felt out of place because we were the only table in the restaurant without a bottle (or two) of wine! So we will definitely be taking a bottle next time we go!"}
{"text":"This place is simply incredible. We've dined in as well as received catering from them and our guests were blown away. Incredible food and a great atmosphere and BYOB. Seriously top notch"}
{"text":"Small quant restaurant which used to have great food. We were their last week and had less than average service and the same type food. We took our own wine only to find out that they now have ONLY small juice glasses to drink your wine from. So there we were with a 25.00 bottle of wine we brought back from Napa Valley only to have it stifled in a tiny glass. 
The waitstaff said they did it to save money.. unfortunately they lost money on us because we probably won't be back . My boyfriend ask the question. .  What's next red solo cups? Average food, average service and now no stemware.. nothing special anymore.."}
{"text":"So I had a terrible experience at this place. The waitress couldn't be less friendly. While in the middle of my meal, I found a dead fly in my drink. When I notified our waitress, she didn't seem to be very affected by it, and just said \"oh sorry\" and brought me another iced tea. I laughed and just asked for water. I'm sure it came from the same pitcher the dead fly was floating around in. As a waitress myself, I would have been overly apologetic if that happened to one of my guests. I also would have notified the manager and had someone come to the table. Disgusting. Will not be returning.

Oh- and to add to it, the other person I was withs order came our wrong. Most likely because the server didn't care to write our order down. If your memory skills suck maybe you should take notes.

What a joke!"}
{"text":"I've been here dozens of times over the past +/- 10 years and can honestly say that I have never had a meal here that wasn't really excellent. Both lunch and dinner have been great. Seating is limited and fills quickly (popular because the food is so good) so plan accordingly. All of the Italian dishes are as authentic as they get. Love the crab cakes."}
{"text":"A restaurant would do better to extend an offer of \"better service next time\" to customers who were less than pleased with their business rather than post insults and threats in response.

After particularly horrible service at this restaurant (now over two months ago) I posted a small review blurb to my instagram account which revolves around food, recipes, etc. Usually I stick to positive reviews but between bad, bad service, health violations and multiple other problems, it was a review that needed to be written. (None of these reasons had anything to do with the taste of the food mind you, as I indicated in my review, we decided to leave before ever having a chance to order a main course-about an hour after being seated-we begrudgingly ate our appetizer and salads we had ordered before the long wait of being ignored by our waitress as she served, checked on, and cleared plates from other tables-we didn't really care what the food tasted like at that point, we just wanted to leave and go have dinner elsewhere.) The end.

Skip to over two months later, a harassing, insulting, bullying and outright threatening comment was posted on the photo/review on my instagram account by someone (yung_bernie), seemingly suggesting they work there? by the comment \"my restaurant.\" Both the comment and the user were reported to instagram.

Simply nothing in response, or even better, \"We hope you'll give us another chance to serve you better,\" or something along those lines, which I've seen other companies do when given bad reviews-justly or unjustly-wouldn't have convinced me to go back, but it would have gone a long way towards \"customer service\" rather than a f-you. And the last line in the overtly insulting instagram comment threatened that if I ever came back they would put me in their \"gourmet pizza ovens.\" Don't worry, I would never have returned to this place anyway.

What kind of restaurant is it that gets upset at someone for having a bad experience and speaking up? Simply horrible."}
{"text":"I wish I could eat here everyday. Everything tastes so fresh and well made. The atmosphere is warm and feels like home to me. It's a little small and can get crowded quickly."}
{"text":"The food was delicious and the service was friendly. The bread also tastes freshly baked and was delivered warm with dipping oil/sauce. Amazingly delicious. We got the white clam sauce, red clam sauce, and Veal Parmesan - all three were delicious and we all had leftovers. I highly recommend the restaurant and will go back.

Also, they have a small lot on the side of the restaurant, but we saw it as we were passing it, so we just parked on the street. Plenty of street parking, too. The restaurant is very small, so getting there early is probably a good idea. I'm not sure if they take reservations.

(My dad went to the rest room and that is upstairs and apparently pretty far away, so not good for someone who can't walk too well.)

It is BYOB with a $5 corkage fee (even for a twist cap that requires no opener), which is a bit much especially since they don't sell alcohol, so it's not like you're trying to cheat them out of business, but their soda is insanely cheap, so if anyone isn't drinking alcohol it's a bargain. They didn't give us a bag for our leftovers, which was a problem when it was placed on the back seat and we got oil all over everything, since they just have the styrofoam containers that don't seal, so you might want to ask for a bag and/or hold your leftovers VERY carefully on the way home. There will be leftovers. Tons of food."}
{"text":"Love this place!  Things I love: BYOB.  You bring your own wine for a 5$ cork fee.  Margarita pizza is yum yum yummy!  I get it as an appetizer for the table.  The Rita's pasta is outstanding and I have tried the Gorgonzola gnocchi with is also amazing.  The prices were great for the portions you get as well!  The restaurant does not take reservations, which is a pain bc it is so popular.  Try to get there before 6 or there will be a wait.  Last time I was there we stood in the back and the waitress opened our wine for us and we had some of our wine while waiting."}
{"text":"First off, this place is really small, but love the old time charm of this place when you walk through the doors.  Overall the food is very good.  We tried their linguini in a bolognese sauce and the gnocchi with the roasted red pepper sauce which were both very good.  The bruschetta was also very tasty.  The pizza was nice and crisp, but overall didn't feel that the taste was anything special.  The service was a bit on the slow side overall, and our supposed 45min wait for a table when we got there turned into an 1hr 20min wait which was a bit annoying."}
{"text":"Excellent food, loved the bread and the olive oil / sun dried tomatoes dip was superb!  Now I am not a big salads person but the house salad with balsamic dressing was one of best I've had.  I had the 'blt chicken pasta with spinach that was also very good yet the chicken was a little dry. The waitress was friendly but it was very, very busy, so service got slow which I understand.  I just hate waiting 15 minutes for our server to realize we need our check."}
{"text":"Had a wonderful dinner at this local authentic Italian  place. Service was great, portion sizes huge. Will definitely return."}
{"text":"Food is still good but the service has gone downhill in recent years.  I sat there tonight for a full twenty minutes with an empty water glass.  So did my wife.  Hard to understand early on a Thursday night."}
{"text":"We had family come all the way from Tennessee just for the beans and greens . They were blown away . Just fabulous!"}
{"text":"I really wish I could give this place 5 stars, but it's just not quite there. I've been coming here since I moved to Pittsburgh 7 years ago, and it's remained consistent. The food is always very good, the service has remained average and the restaurant is untouched, and not in a good way. This establishment is a poster child for the, \"If it Ain't Broke, Don't Fix it\", ownership style. I understand that if you have a good customer base and they keep coming back that it's hard to justify making changes, but with so many great new restaurants coming to Pittsburgh, you better tighten up, or you'll get left behind.

For Example: 

I love the outdoor seating, but the chairs and tables are awful. I'm not a real big guy, about 200lbs and I'm nervous that I'm gonna break the flimsy dollar store chair. Easy Fix.

The restaurant is tiny and cluttered. There has to be a way to open it up a little and make it feel like the guests and servers aren't right on top of one another.

The menu is old and played out. It's time to start trying some new things. Challenge your chef, he might surprise you. Keep your most popular dishes and Pizza, but give the customer something exciting.

Once again, I do really enjoy and recommend this restaurant, but if they don't start getting with the times their loyal fan base will start to fade away."}
{"text":"Very pleased with our dinner here last night! Wanted to go somewhere special after getting off the plane from a trip to Austin Texas.. this was the icing on the cake! Greens and beans- fantastic. I ordered the Chilean sea bass over pasta in a light lemon cream sauce with mushrooms. Delicate and delicious! My date ordered the crab cake special and we got a side of meatballs to try. Everything was amazing can't wait to return!"}
{"text":"The Greens and Beans are pretty good.  The have a hot sausage inside the dish that kicks it out of the park.  I love the crab cake salad.  It is a large crab cake that has no breading inside, you are getting all crab meat.  It is breath of fresh air!

The restaurant is intimate and relaxing.  The tables are close, but everyone minds their own business.  They offer corking fees if you want to bring your favorite wine, or a first date.

If you ask them for a recipe, they give it to you.  I asked them for their greens and beans recipe.  They gave it to me!!  I think they felt bad for me because I live out of state."}
{"text":"Truly a neighborhood gem! Love the BYOB, reasonable prices and the food! I've had many different options on the menu and they don't disappoint. The crabcakes are totally phenomenal...they rally for the top spot against any seafood restaraunt. Totally crab, no filling. The bread....yum! Fresh pasta and ingredients. The waitstaff run and work HARD and the owners are so fun, accomodating...with their GIANT presence! If I was pressed to find any fault, it would definitely be the lack of AC or any circulating air on a summer's evening inside. It is oppressive, something a few ceiling fans might help.  We have melted thru a few dinners recently and think we may save this for fall/winter/early spring dining.  It's very cozy in the winter. The few outside tables under an awning are awesome but the summer sun does set out there. Otherwise, totally YUM!!!!"}
{"text":"When we first walked in, we were seated right away then....politely ignored for a fair bit as we watched the waitresses walk by, serve other tables, chat up regulars, etc

Eventually we were able to place our orders and my oh my...each dish that was brought out was almost more flavorful than the last!

Even the complementary bread was noteworthy. It's not made in house, but they toast it prior to serving it with the most delicious olive oil/tomato basil based dip.

For our appetizers, we went for the famed greens & beans which was both hearty and flavorful. I especially liked the addition of the spicy sausage. We also ordered the mussels in marinara (special). Holy cow, I couldn't believe just how many mussels were delivered! They weren't particularly large, but that marinara sauce was to die for delicious!

For entrees, we shared the veal parm, sea bass pasta, and crab cakes. Hands down, the sea bass pasta won. It was seared nicely yielding delicious, buttery, flakey fish over perfect al dente pasta. The crab cakes were also phenomenal. It was nearly all crab actually - a crab loaf, if you will. The Portobello mushroom on the side was also grilled nicely. The salad was a little forgettable and I wasn't a fan of the horseradish sauce. Our heaviest entree was definitely the veal parm, but it was still good. The breading wasn't too thick and the veal was fried nicely. 

We definitely had no room for dessert this time."}
{"text":"Delicious Italian fare. Great atmosphere. Attentive wait staff. Outstanding pastas and greens. Chicken dishes are succulent. Large portions. Less crowded at lunch. Definitely worth a visit."}
{"text":"This is just about as authentic as you can get! Everything from their pasta to their sauces are homemade and my goodness can you taste the difference in this distinctly authentic Italian fair. I ordered a pasta with spinach, mushrooms, pine nuts, and roasted red peppers, which was a nice alternative to some of the heavier cream and tomato based options. However you also can't go wrong with their pizzas or salads. The cherry on top to this mom and pop shop is that they can accommodate large parties, which make it great for family
gatherings and celebrations. I could not recommend this place more!"}
{"text":"great greens and beans. Solid Italian food but not nothing outstanding. Large portions, BYOB, with jelly jar wine glasses.  Either bring your own stemware or a modest bottle of wine.  A good place to go with friends."}
{"text":"Love this place. The owner, cooks are nice, some waitresses are nice, some are not.
The chicken panini or sausage panini with pasta salad is awesome. Portions have gotten smaller but price is the same.  Almond cake, evil good. Open 11a - 930pm (fri/sat 1030pm) CLOSED SUNDAY.
Saturday opens at 4pm.  I hate crowds and long waits, so if your like me, here are some tips. I  go on Mon,Tue,Wed nights anytime or Thurs, Fri/Sat night i go super early like 4-5pm. Lunch i go at 11am or wait until 2pm.  I avoid lunchtime between 12noon -130pm because sometimes there are no tables at all or get your food to go. In the summer they have outdoor seating, but its blazing hot.
The owners Dad (RIP) gave me alot of good tips about where to buy a house on the west end, because some areas only had volunteer FD, and brookline/beechview old sewer lines, etc...LONG STORY, LOL."}
{"text":"Sarafinos is consistently delicious! Greens and beans, Joey pie, polenta, gnocchi, Pasquale's, ducks special panini, red or white clam sauce-- you name it, it's delicious! Great little byob restaurant I highly recommend."}
{"text":"First off, some pretty good eats here.  Tasty pizza and soups. 

That said, they really need to get their customer service in gear. The staff always looks stressed and annoyed. 

First time I went, no one acknowledged us and after a good 5 minutes without even so much as a \"hello\" or \"one moment please\", we decided to leave. 

I gave this place one more chance. Despite the fact that it was empty at lunch, we were again coldly received. There's an ever present \"how dare you want a table\" attitude here. 

After waiting a good 15 minutes to even ask us for our order, we had to succumb to the constant banging and slamming from a cook who seemed to let out her aggression with a mallet. Kinda intimidating to say the least."}
{"text":"My fiance and I visited for the first time this week. Our service was a bit on the slow side but they were pretty busy so it wasn't a big deal. The fresh bread and dipping oil was the great start to the meal. We both ordered off of the special menu, I had veal parmesan and he ordered the wild boar ragu. Both meals were delicious! We shared a tiramisu and almond cream cake for dessert. I'd eat there every day if I could! Definitely a new favorite."}
{"text":"Found this on Yelp under Italian.  Small place. Great food. Huge Portions. Great waitress. No downside, except they didn't have much seafood. They did have a mussels appetizer than was really good though."}
{"text":"We dine at sarafinos monthly and always have an amazing meal. The staff and owner are friendly and make us feel like family. I definitely recommend."}
{"text":"This place is always packed.. once you eat here you'll know why. You can't go wrong with the Italian wedding soup or pizza. Can be a little loud and service on the slow side but it's worth it"}
{"text":"Told Friends:  We're coming your way, pick a dinner spot.  And they chose Sarafino's in Crafton.

So glad they did!

It's a nice corner restaurant that used to be a pharmacy (so I'm told).  Not a spacious dining area, but good for 6 or less at a table.

The smell from the kitchen is strong...  garlicky and wonderful.

The bread was fresh, crusty and disappeared fast.  I had the wedding soup which was pretty different, as I believe it had basil as the greens and no chicken.  Delicious and unique.

Two of us ordered the special which was an alfredo and roasted brussel sprout pasta dish.  Mind you, I was excited to see an Italian steak salad that DID NOT include the typlical 'Burgh French fries - but the brussel sprout pasta changed my mind and it was so good.  So WAY good.

Hubs, being the traditionalist that he is, ordered the red Bolognese with a meatball and a sausage - he was pretty happy, also.  Friend #2 ordered the house crab cakes, which she knew from previous visits were fabulous and they were pretty lovely, gotta say.

We split the almond dessert - yummy and we should've got it TO GO as we were TOO FULL!

The place is noisy and it doesn't take much for it to be crowded, but dang...  the menu has some items that definitely need to be explored further!  Be hungry when you get there--"}
{"text":"Sarafino's is a lively but cozy place with a pleasant ambiance and good food. I appreciate that the offerings are purposely prepared in a straight-forward manner, and not made with 11,000 ingredients--just old world Italian cooking is all. 

I had the special for the evening--two crab cakes with a house salad and a healthy-sized portobello mushroom. Those crab cakes were so much better than anything I have gotten in the Chesapeake Bay area in quite some time; they were light and lovely and delectable.

My hub had the linguine and white clam sauce; I tried it--it was to die for.

A highly-pleasing cappuccino for an after-dinner treat was only $2.95? Say what?!

As if it couldn't get any better, when owner Joe Caliguire was making the rounds in the dining room and found out that we hailed from the nation's capital, he comped us free dessert. We got the tiramisu cake and almond creme horn, and were they smooth, smooth, smooth, baby!

This is a peach of restaurant. I should have bussed Mr. Caliguire on the cheek, but demurred.  I coulda given the wrong impression and then got the local people gossipin' and all that, since I never met the man before.

No wonder he got restaurateur of the year awhile back. He understands both food and people, and how to treat them very well.

Pittsburgh--you are lucky and I am jealous."}
{"text":"This place is great.  I just dined there and had the RITA - a garlic/vodka cream sauce with penne pasta and a bowl of wedding soup.  BYOB!  The bar next store has basic beer stock so bring your own wine.

This is excellent Italian cuisine and inexpensive.

It's intimate seating with butcher paper lining the tables.  The staff was fun - this includes the owner.

There are 4 small cafe tables outside in front of the place.  Tonight there were 2 tables outside with diners - this brick road had very little traffic.  The place was nearly empty when I got there at 7 PM but began to fill by 8."}
{"text":"The other day, a marvelous surprise awaited us plebs at the Lawrenceville Asylum For The Criminally Inane.  A sales conference took place and a catered lunch from Sarafino's was provided for those who participated. Whoever ordered the food overdid it a bit, resulting in...leftovers! 

All it took was a page over the intercom for the unclean to stampede towards the break room, with me acting as pacesetter, leading the charge with fists shooting upward. 

*beep* \"Hey, we got pasta 'n salad dahn here. I repeat. We got pasta 'n salad dahn here.\" *beep*

To which I replied, roaring into the cold, dusty air like a Nordic warrior from ages ago, \"And we shall eat well on this day!\"

On the table sat two large aluminum pans. One was steaming and full of gooey, cheesy, crimson, meatless rotini. The other was chilled and contained an orgy of a salad that included spinach, Garbanzo beans, onions, potent banana peppers, onions, hot sausage medallions, and copious, preposterous amounts of minced garlic. 

Everything about the rotini was adequate from the soft pasta itself to the somewhat pasty sauce, but the salad--called Greens & Beans on the menu--was fiery, fragrant, and flagrantly in love with spices. Agog with this astoundingly appetizing antipasto, I simply could not stop eating it. 

Luckily we have a trio of refridgerators and not everyone could finish all of the food, which meant more for us the next day and the day after that."}
{"text":"I really like this place. The food is good as well as the service. The warm homemade bread is delicious. It is served with a very tasty sundried tomato dipping oil.
   The menu is quite limited and salads are not included with the entrees. 
I enjoy the cozy atmosphere, but there may be long waits as the seating is limited.
The restrooms are located upstairs and are on the dumpy side.
  Tonight there were several things that made my dining experience rather frustrating. The air was stuffy, it seemed like the AIr conditioning was not working well.
   There was also an issue with the power. The light would dim and the bright, thus happened every minute or so. Very irritating.
  The last issue was a ceiling fan that was out of balance and kept making a constant \"ticking\" noise as it wobbled.
 I think some much needed building repairs would make a huge improvement."}
{"text":"Seated promptly and received bread and olive oil sun dried dip (promptly)..nice but the bread was nothing special, seemed day old.  Since this is an old long time place stuck to the basics and had the penne with marinara sauce..it was good.  Was able to have a few bits of the Fettuccine Alfredo which was nothing special.  

BYOB was popular at many tables."}
{"text":"Moving from a place with zero good pizza, my husband and I ordered a pepperoni/mushroom pizza for pick up.

There's only a tiny lot and some street parking, so I'm sure it would be hard to park when it gets busy. When I opened the door to the restaurant, I was immediately overtaken by the wonderful smell. Maybe it was just my hungry stomach, but I was a little regretful we hadn't come to sit for dinner. It's a small, quaint restaurant and everything everyone had on their table looked delicious. The pizza did not disappoint. I'm sure we'll be back in the future to try other things from their menu!"}
{"text":"NOM! I work right down the street from this place but would have never known it was there if it wasn't for Yelp! 

It is very small inside but each table looked like they were thoroughly enjoying themselves. The chef waved to me as I walked in! I got take out and it was ready within 10 minutes! Nice.. 
I ordered the grilled chicken Panini ($7.95)... the selling point was the combo of roasted red peppers, banana peppers, and provolone with the house dressing... mmmm!  It said it came with a side salad... to my surprise it was a side of PASTA salad.. even better!

So my sandwich wasn't so much a Panini.... the bread they use isn't really pressed down as I thought it would be... unless there are different cultural norms for how one makes a Panini? Regardless, the sandwich was amazing. So was the pasta salad. Garlicky goodness! 

I can't wait to go back!"}
{"text":"First time at Sarafino's. Went on a Friday night around 6pm with my two sons. I use Yelp a lot but learned to take all reviews with a grain of salt and don't often write reviews myself. But for Sarafino's;
Small, filled with customers, told we'd have a 25 minute wait...and you wait, standing in a corner of the restaurant amongst servers, customers, looking into the open kitchen area. There's no bar, BYOB.
Everyone is happy. The waiting area gives us a birds eye view of all the plates coming out of the kitchen...all types of pasta, short ribs over pasta, lasagna...and at the end of the meal almost everyone is asking to have a part of their meal boxed to go.
We're seated in 20. Love the appetizer selection: greens & beans, polenta, all looked great but since it looked like most people couldn't finish their dinner portion, we passed on appetizers and salads.
Very competent, attentive, knowledgeable waitress. We had a lot of questions about the specials, and she answered every one!
One son had the special, veal parm, the largest piece of veal he'd ever seen. He loved it but could only eat 1/2 of the meal.
My other son ordered the special shrimp/scallops/mussels over pasta w/white clam sauce. Two comments, the scallops were the best he had and he loved the sauce. I ordered the  Sarafino's Pasta off the menu. I would place the sauce up there with some I had in Rome, the chicken, fresh mushrooms and red peppers melted in my mouth. The pasta tasted like it was homemade. DELICIOUS.
How lucky we are to have restaurants that look like little hole in the wall places, family run, but with authentic, fresh and delicious food.
Sarafino's is as good as it gets, if you don't mind standing in a corner waiting for your table- the wait is well worth it!"}
{"text":"What a gem!  There's absolutely nothing wrong with stepping back in time and enjoying a place like Sarafino's when the food and service are still firing on all cylinders.  It feels like a neighborhood Italian joint from decades past and the food is stuck there too (in a perfect way).  It's quality, old school Italian.  The limited menu is supplemented with fresh daily specials and everything is packed with flavor and enormous.  

We had a large business group come in not knowing it was a BYOB, so we hopped in the car and drove down to a state store to grab a mixed half case of good wine, which made for a fun experience in itself.  

Our appetizer pizza was massive, loaded with fresh toppings and shaved cheese, and we couldn't have been happier with it.  This was served alongside the largest charcuterie plate I've ever seen.  They heaped this thing with a mountain of meats, cheeses and marinated Italian veggies....delicious.  

I ordered the Scoglio (not sure on the spelling of that one) pasta special over the homemade gnocchi.  It was packed full of seafood and the red clam sauce was bursting with flavor and lots of basil.  It's one of the best Italian pasta dishes I've had in a very long time.  

I wouldn't hesitate for a second to head back here with friends.  It was really refreshing to step away from the high concept restaurants, the technology and trendy spaces for a night and just hang at an old school Italian spot with simple, delicious food.  Big cities are trying to recreate old spots like this, why bother when the real thing is still here at half the price."}
{"text":"Sometimes the very best restaurants are right in your own backyard and you don't even realize it. Sarafino's has been around for years but I have never taken advantage of it until now.

It is an all Italian restaurant where you can order most any type of pasta, pizza, and paninis. They have vegetarian options as well. Stopping here for lunch with my daughter I was debating about ordering the wedding soup but realized that with my panini and pasta salad that would be a little too much to eat.

My chicken panini was made cooked to order. The pasta salad was fresh. I simply enjoyed my meal. My daughter ordered a 10 inch cheese and mushroom pizza. You can also order it in 16 inch size as well. She ate the whole thing and loved it. The also offer appetizers and main courses if you are so inclined.

Located on East Crafton Ave near the borough building parking may be a bit difficult since there is currently construction going on the nearby Noble Ave and many people parking in this vicinity to take advantage of the busway. 

Open for both lunch and dinner, prices are fairly reasonable and definitely will return here on a future visit to check out their other offerings."}
{"text":"Every time I come here I tell myself I need to come more often. I've never had anything that wasn't delicious and the staff is great. Nominal corkage fee to bring your own wine makes it all the better and overall it's incredibly reasonable for dinner. Seats outside along the sidewalk too!  Last time I was in they had an arugula and pancetta appetizer pizza that was to die for. Please add it to the menu!!!"}
{"text":"Great, little hole in the wall.

Yes, it is so small. The waitresses are a little stressed, one forgot to bring out my food while everyone at my table ate.  That's the only reason I gave it four stars.  It could have been a five.

Food was fantastic.  Great alfredo and red sauces.  The crab cakes were suggested over and over but we found them to be dry. The HUGE Portobello mushroom that came with the crab cakes was pretty spectacular. We all basically licked the herb oil plate clean that came with our bread. I think we got three of those.
 
I had Sarafino's Pasta and I couldn't get enough in my stomach. My youngest son ordered Gnocchi with Alfredo and chicken, which I frowned upon. Then loved it. What a great combination - who knew?

Couldn't eat another bite, so I took Tiramisu home with me. It didn't make it. It wasn't the best that I ever had but it was slightly sweet and a great end to my meal.

I really can't wait to go back. I have a feeling it will be a little better. Owner was present and greeted everyone.  He walked around, talked to patrons, laughed and had genuine concern about the food.  NICE!!"}
{"text":"OMG!!! Want good and I mean good Italian food? Look no further because you've found it here. It's so good you'll not be able to stop eating and I suggest wearing elastic waistband pants! I kid you not. The food is so scrumptious you're not going to be able to stop yourself from gobbling it down like a crazed varmint.
Bread with dipping oil is so good. Love their pizzas, pastas and sausages. Not to mention the soups, salads and so much more.
I'd like to call this a home away from home because the cooking reminds me quite often of the kitchens of my Italian family.
And have I mentioned the greens? Oh jeez beyond delectable!
I'm growing hungry just thinking about all there is to devour.
Sarafina's, take me away!!"}
{"text":"Excellent, genuine Italian restaurant. I love the intimate atmosphere. The fresh bread always comes directly out of the oven to your table. The prices are extremely reasonable for nicely sized portions. It also means a lot to me when the owner takes the time to talk to his customers. On our last visit he asked where we were from, if we were satisfied, etc. I will absolutely be back."}
{"text":"This is a wonderful neighborhood  eatery.  The staff is friendly and treats you like you are family.  The pizza, pasta and soups are just like my Nana made.  It is a hidden treasure in Crafton.  It reminds me of the restaurants on \"The Hill\" in St. Louis.  The only draw back is that it is a little crowded."}
{"text":"For one, I liked the cozy atmosphere of this little Italian family-owned restaurant, but it is in need of some major renovation work. The ceiling is bowed from what looks like water damage, and it looks like they attempted to paint it, but didn't like the color, so they stopped after one row. Maybe that has some history or cute story, but as a first time customer, I wouldn't know. 

The service was ok...not too timely, but not neglectful. 

We ordered the special muscles appetizer - good. Too much salt, but good. No comparison to Il Pizzaiolo. 

The main dishes were also specials; I had the homemade cheese ravioli and my husband had the pasta svoglio with red clam sauce. The ravioli wasn't much to write home about. The pasta they use is really thick for ravioli. The sauce was ok. 
The pasta svoglio was better. Lots of seafood used in this dish, and I enjoyed the taste I stole. 

I don't think we'll return here before we try another Italian bistro, but it was worth a try."}
{"text":"Have you been to Sarafino's lately! Why not?? This is the most authentic Italian restaurant in the 'burgh reminding us of a back street in New York City stolen from a scene from The Godfather! The staff is hard working and always make us feel at home. 

Being that this location is BYOB, the atmosphere is alive with locals chatting about their week and lives, etc., over their personal wine selections. The beans & greens are the best around and their pastas are outstanding! Our daughter just returned from Rome and stated that the food at Sarafino's is as close as it gets in Pittsburgh for authentic Italian cuisine. You won't leave hungry! (There is a fight in our house to ensure that the coveted left-overs aren't eaten without permission!)

We always look forward to returning! I highly recommend!"}
