{"text":"This place is excellent. The outdoor seating in Shaker Square has an excellent atmosphere, and they occasionally have musicians playing in the outdoor patio. The drinks are delicious. The food is tasty, and if you pick something spicy they don't mind giving it a little kick (which is tough to find in the Midwest). The servers are polite and friendly - not over-the-top, but available when you need them and invisible when you don't need them. I will definitely be going back."}
{"text":"Food was quite good. Had the grilled cheese sandwich tapas, which went really well with the included tomato soup for dipping. Went with the Xim Xim for my entree. No complaints on either.  The drinks were good, but were definitely a rip off. The Caperinhas are delicious but overloaded with ice. This meant I had to avoid all their other speciality drinks. They then decided that they would ruin their good wine pairing with a pitiful pour.   The service bordered on terrible. Our waiter took forever to come around, and always wanted to give us \"more time\" to decide, which left us basically having to beg to keep him there to take our orders. They took away the drink menu after we initially ordered, and I should have taken as a sign, but I did request they bring it back around...which took 20 minutes. Finally, despite the very slow waiter, our bus boy was overly checking in with us trying to take away our food, even though I still had a good amount left. That happened three times...  Oh Sergio.... this could have easily been a four star review, but your execution was just poor."}
{"text":"First off, the food was great. No complaints here. Appetizers were excellent, main courses were very well done. We left content and happy. The atmosphere was really nice with Brazilian music playing in the background, low lighting, and little noise. Definitely a romantic place.  However, if you're looking for an authentic Brazilian restaurant, this isn't it. I lived in Brazil for a year and a half. Sarava's cuisine is more new-agey with some Brazilian thrown into the mix. I would say that about 50-60% really traces its roots to plates from Brazil. The rest of the menu looks great, just isn't Brazilian. If you've got a hankering for one of the staples, like picanha, feijoada, farofa, or pão de queijo you can kill it here. Other touches though, such as vinagrete and brigadeiro were not to be found.  Regardless, the wait staff was extremely attentive and polite. Service overall was excellent.  If I were back in the area I would return to Sarava."}
{"text":"Really lovely flavors; excellent service; nice drinks. Yes yes yes. Try the sea scallops (wonderful sauce!) and have the Brazilian lime drink (name of which I cannot spell or say). Everything that came to the table looked great. Lighting: dim. Long on: atmosphere. Happy to go back next time we're in town."}
{"text":"Sarava's strength is in the street plates and well made drinks. We always sit at a booth in the bar and order 5 or 6 street plates and caprihnas or martinis.  Love the tamale cakes and artichoke fritters! The food is consistently good, the servers are pleasant, and the atmos is a little exotic. What's not to like? The happy hour specials are a steal."}
{"text":"This was a wonderful neighborhood staple where a lot of good memories were shared. Their caipirinha on the patio in the summer was a real treat. RIP Sergio you are missed."}
{"text":"The food was good but I am disappointed the ambiance.  I came here with my sister and mother and we thought this place was going to offer an authentic Brazilian favela experience.  Instead of being kidnapped and ransomed for millions of dollars by Brazilian criminals and narco traffickers, we were treated politely, seated promptly according to our reservation, and not terrorized whatsoever.  This is neither the east side of Cleveland nor the Brazil that I am familiar with."}
{"text":"Just not my thing I guess, too bad because I heard authentic Brazilian is killer."}
{"text":"We came to Sarava on election day as the first stop on our restaurant week tour.  Loved the atmosphere here - it's nice to find a place in Cleveland to go out dressed for dinner ....   and was thrilled to see an Obama party about to take place .... Yeah Sarava!  My entree was phenonmenal - The swordfish was ok, but what really blew me away is that these people can do amazing things with squash and my salad (I was veg for 14 years).  Also, he best Xim, Xim was good, but definitely not that best I've had (that honor, believe it or not goes to Magnus in Madison, WI.... really, trust me on this).....  Finally, it is important to note that this Sarava beats the pants off the one near CWU."}
{"text":"I've been twice now and have loved everything.  The ambiance is beautiful and upscale.  I sat inside and on the patio.  Each time I had great servers and excellent service.  The spicy shrimp and the artichoke fritters were dynamite.  My entree was Xim Xim was equally delicious and well made.  The best part are the Brazilian drinks, the Caipirnha is the best drink ever.  I could drink those everyday.  Be careful, it is strong.  I would absolutely recommend this restaurant to someone looking for something new."}
{"text":"Sergio is always so gracious in saying hello.  The food and drinks were excellent as always, I love the chicken pasarinho."}
{"text":"Food absolutely AmAZing! Service was great. There was even live Brazilian band. Atmosphere very romantic!"}
{"text":"Crazy good food. Exotic imgrediants push you out of your comfort zone. New. Fresh. Diffrent. Delicious. If you are looking for a culinary adventure, look no further. Upon leaving stuffed with goodness, you will be convinced that everything is better with coconut milk."}
{"text":"I brought my parents here when they were in town and we had a great time.  The food was delicious and the service friendly.  What I appreciated the most was the incredible atmosphere.  The decor is well designed, but more importantly, from the second we walked in, the smell of the food being cooked just filled the whole place with an amazing aroma.  Great time all around and I think this is a no-brainer if you like Brazilian food."}
{"text":"First meal out in Cleveland did not disappoint. More of an eclectic mix of food than just Brazilian, it will likely satisfy any mood. Staff was attentive and nice. I recommend going with a group and ordering a bunch of small plates to share."}
{"text":"Love everything about the place. Great service...decor....live music and the location is great...anyone in the city can get to this place....Did I mention the food!.....Excellent!  Started off with the pao de queijo ....sort of like mozzerella sticks but better,,,the are triangle in shape, Perfectly breaded and fried with a great sauce to go with it. Entre options are extensive.....this was my 1st vivit here so I settle on the xim xim. A blend of shredded chicker and shrimp within an orange stew mixed with rice,peanuts,carrots.....absolutely delicious. I was skepticle since Im not the buggest fan of shrimp but I was very surprised and the dish did not disappoint.   Our server was excellent as well. Place seemed to pick up around 4pm on Sunday. Perfect place for a date with the girlfriend or wife....also good enough to take the kids or family our for dinner as well."}
{"text":"Loved it! You have to get at appetizer. Our table actually got three b/c they all sounded so amazing... and they were. All of our dinners we delectable too. I definitely found myself putting my fork in everyone's meal.  Downfall is that it can be pricey. An $8 side salad is a little much. But there aren't too many Brazillian/South American places around here so I suppose I\"ll deal with it.  Bring a date. It has a very romantic setting- mood lighting, relaxing colors, tables that are more private...plus then if you are a lady, you don't have to worry about price."}
{"text":"So I went with my brother, since he's got a major thing for Brazilian food.  We ordered Faijoada (sp?), Grilled Cheese, Grilled Cheese with chicken, Churrasca beef, and pork chops with polenta.  I had a much better culinary experience this time. 4 Caperinhas later, we were really, really pleased.  We also met a guy who will be filming Sepultura.  Quixotic.  ;)  By the way, the grilled cheese was superb.  It's not a grilled cheese sandwich.  It's grilled cheese.  I love rodizio cooked cheeses and this is the closest I've had in CLE."}
{"text":"It was good, nothing major either way. Solid experience. Great enviornment, lovely staff, the food was OK. Nothing crazy great, but solid."}
{"text":"Went for happy hour from 5-7, M-F. Prices are good only at bar. Good selection of mixed drinks and good house white. Their house red was not that good. All happy hour drinks are $5.00 and they have good selection of small plates. We ordered the artichoke fritter, spicy shrimp, and pan fried cheese with sauce. I meant to ask what the cheese was, but I'm guessing some type of Halloumi. I had been here a few days earlier and the service was a bit slow and distracted, despite being fairly empty. Much better service this visit and I will definitely be back.  Tip: park in back behind the drug store. The lot is free and safe, plus there is an indoor hallway that connects you to Shaker Square right next to the restaurant."}
{"text":"I currently live right near Shaker Square and this restaurant is one of my favorites. First of all, this place is huge, but for such a big restaurant, they are still able to have great service.  I love the small plates and  other happy hour specials.  I also like that i can cozy up to the bar and watch some sports like a civilized person without being surrounded by a bunch of knuckleheads.  Besides appetizers and drinks, the food here is excellent and well thought out.  I was a little afraid the first time I dined here.  I had visions of huge platters of meat being the only available thing to eat.  Thankfully, it wasn't so.  I'm not sure if I'd really even say this restaurant is Brazilian (Really, pizza?) but whatever the inspiration, whatever the style, it's working for them."}
{"text":"I went here with a few friends for happy hour before going to a Yelp event actually. They have a 3 plate special for $18. Drinks are pricy but well worth it because they were made fresh and not your typical place where you can pick up an average type of drink. I watched the bartender make one of the drinks and it was some mojito and she was literally shaking the ingredients real good and really putting some work into it. Some places I've been to didn't spend all that time and put some artificial stuff in so I know this was well worth it. As far as the food goes, we had their mussells which was okay to me. I've had mussells elsewhere and the meat was more generous elsewhere, but the flavoring was alright to me. I'm not too crazy over the buttery version but according to my one friend who is as crazy as me for mussells, it was good to her.   As far as the place itself, located in Shaker Square, it's a high end classy place if you ask me. Drinks were $7.25 and these were happy hour prices so I can't imagine how much they are normally. The ambiance is great if you're looking for a place that's a bit intimate. Great to bring a date! They had a small jazz group come in and play some tunes for us. We sat by the bar area so service was attentive from the bartenders. I would come back here another time for dinner and try their entrees which sounded interesting to try.   Big Plus: Patio area out so great place to sit out during warmer days"}
{"text":"Sergio's SARAVA is a must! I look forward to visiting Cleveland just to have dinner there. Fantastic food, excellent service, and beautiful restaurant. Cleveland, you need to support this restaurant. Every item on the menu hits the mark, and I love the small plates.  I can't wait to go back!"}
{"text":"This restaurant has permanently closed as of March 19, 2013."}
{"text":"My visit here was part of the 4th stop of 2012 CLE International Supper Club monthly gathering (http://www.yelp.com/events/cleveland-the-2012-yelp-cle-international-supper-club)  Just like some of the other reviewers,  the drinks served up here was awesome.  I had two Mojito with Brazilian Rum.  Both prepared not too sweet and hand crushed mint.  They went down very easy.  I however must admit I totally got the cold shoulder from the bartender in every taking my order for the drink.  The bar wasn't even busy.  It was clear he was intentionally not making eye contact with me even though I was standing in the center of the bar waiting to catch his attention.   My second and following drinks were ordered from the table while dining.  The tapas - light plates - of which I ordered three different kinds, 2 were a hit, 1 was a miserable miss.  I had the spicy shrimp - this had the best spicy sauce I've had in some time.  The sauce wasn't good because it was spicy but what made it was the aromatics and the heavier rich texture and complemented very well with the grilled shrimp.  It was so good that I even dipped the bread balls tapas I ordered in this sauce.  These puff small bread bites were soft and fluffy.   My 3rd tapas was the grilled beef - this dish came out absolutely cold and the meat was rubbery.  As I tried these it made me wonder that I thought Sarava markets themselves as a brazilian steakhouse.  Do people in brazil really eat cold chewy steak?  I don't think NOT!  I opted to get the Flan for dessert.  This was a tasty dessert, it was better than average however the price to portion ratio is not correct for this dish.  Overpriced.      All in all,  I'll go back for the drinks and the spicy shrimp IF I'm in the area.  The quality of food and service received isn't anything to make me want to drive all that way."}
{"text":"Food is alright, but in general this place gave me a faux-fancy vibe. It certainly seems like it's trying to be chic and sophisticated and elegant-casual, but when you get close, a lot of it seems to have flaws, from shaky, uneven tables and cheap feeling chairs to pretty but not particularly special tasting food. I got steak once, which was somewhat overcooked and about half the size I was expecting. I also got a pasta dish once, which wasn't bad but wasn't really great. Pretty bland sauce. the most disappointing thing was when we were there celebrating with friends and they suggest a bottle of champagne which ended up have a screw top; it tasted good, but I think that was only because it have just 5% alcohol, so it was practically just carbonated grape juice.  Basically, i think this place is a slightly over-priced, decent restaurant that wishes it was something more.  The sister restaurant, Sergio's in University Circle, is much much smaller, but has a very intimate feel, a very pretty, artistic atmosphere, and in the smaller setting they really seem to get the details right. The menu isn't quite as big, but everything I've had there is great. If you can, I would strongly recommend visiting this artistic, beautiful part of cleveland and getting dinner at Sergio's in U.C. on your way to an Orchestra concert or the Art Museum."}
{"text":"Yet another stop along our Yelp Int'l Supper Club tour...  Drinks? Ohmygod, yes. They were so good in fact that I downed three in a very short period of time. I had to stop myself from ordering another and I noticed a lot of our other diners were stopping themselves, as well. Wow... just FYI, the sparkling wine and passion fruit drink was divine.   Food? Eh... As much as I hate to admit it, I did not have a wonderful experience. In fact, across our table seemed to be hit or miss. I ordered the blackened mahi special and it came as tough as fish jerky. I get it--it's blackened, but it should still flake in the middle. I was having a hard time cutting it with a fork...not a good sign when you order a light fish. Everyone around me either had something they loved or something they wanted to send back. I will say the artichoke fritters, spicy shrimp small plate and curried scallops were awesome.   Other than that, the service was nice, but sort of burly at times. The waitress we had was training another server and it was sort of a mess. The main server smelled so much of cigarettes that you could choke on the scent as she reached across you. She also had a tendency to slam plates and dishes down in front of you. In fact, I had no idea why this gal was training another server.  Overall, I could see the potential of this place and the drinks and our company is what really made our experience. I think they should really shrink their menu down to one, small page of Brazilian-style specialties and keep it at that.  P.S. If you're in it for the drinks, take advantage of their happy hour specials. If not, you'll end up with a huge bill like I did... dammit."}
{"text":"Good:  * Happy hour specials - street platters for $4 each?  Yes, oh yes, please.  Especially when we're talking about the artichoke fritters. * Salads: Salada San Paolo (spicy and sweet!), Roasted Beet Salad * Main courses: Xim xim!   * Dessert: Delicious, delicious butter cake - the crust is just crunchy enough.  Ice creams are very, very good.  Bad:  The negatives really have very little to do with the food. * It's *LOUD* here.  I can't hear myself think half the time. * Their bonus point program is lame.  When you apply, the money you've spent that evening doesn't apply.  If you don't bring your card, your meal won't apply.  C'mon."}
{"text":"Atmosphere: Sarava is a really high class bar restaurant. The dim lights, the seating, the art and the layout of the room really sets the whole tone of this restaurant. There's also a jazz flavor to the bar, not to mention the live jazz band that plays there. The only complaint I would give is, during my 2nd dining experience there, I could barely hear what my friend was saying due to the jazz music that was just overflowing the room.   Service: The first time I was at sarava, it was for a company event where we blocked off half of the restaurant. Needless to say, the service was GREAT. However, the second time I came back with a friend, I felt the lack of treatment and attention being given to me. My waiter never smiled at us and he just seemed like he was so tired from a day of waitering that he really just wasn't friendly. In fact, when we got out check, the previous customer's check/receipt/suggestion form was still in the flap!   Food(s) Ordered: Lobster Hot Dog, Pan seared sea scallops, Duck Ravioli, Shrimp Baiana, Gnocchi with Lobster  Food(s) Quality: I ABSOLUTELY love their shrimp baiana and the lobster hot dog. The lobster hog dog is only on their menu certain days when it's their \"special\" so BE SURE to get it if it's there! It's basically teared lobster meat w/ green & red peppers placed into a bun. The meat is served cold. Despite the dish sounding rather sketchy, it is the absolute reason why I came back to sarava a second time. In addition, the shrimp baiana had a GREAT flavors to it with really nicely roasted vegetables. The menu says the baiana is a bit spicy but it's nice so it was perfect for me. The sea seared scallops are also a great dish although with not much scallops on the plate for the price. As for the Duck Ravioli, my friend LOVED it while I thought the flavors were overpowering and a bit salty. Hwoever, I would say it's a must try dish. It is duck wrapped in really thin pasta (ravioli) and then with a special fried breading. Definitely an unique dish. The Gnocchi with lobster was a special of the day; however, i wasn't a huge fan of it and didn't find the flavors to mix well.   Comments: I would go back to this restaurant for sure. The fact that they offer so many specials everyday is a reason to go back. So far, i've never had bad experiences there with their food quality."}
{"text":"I came here with a large party for NY's Eve dinner.  The food was excellent but the service was so terrible that I could hardly enjoy my meal.   Two members of our party were gluten-intolerant.  When we asked the waitress which options we could choose from, she acted really annoyed, which was bizarre given the fact that this restaurant has a gluten free menu prominently posted on their website.  They were running a limited menu for NY's, but it still seemed strange that our question was such a burden.  She asked the chef which items we could order, then came back and listed the entrees we could select from, all which would need to be minus the sauce.  She made it sound as though each entree would be dry and tasteless as a result, and made no offer to ask the chef to improvise a sauce.  I ordered the scallops, thinking they would be easy to dress up with butter, olive oil, lemon, etc.  Any decent restaurant with a decent chef should be able to whip up a simple dressing for scallops. I asked her directly if she thought the scallops would be dry, and she said yes.  Isn't that bizarre??  We were paying a fixed price of $55 for the meal, and here she is telling me that the food is going to be bad, and making no offer to help improve it.  My boyfriend started getting mad on my behalf at this point, and asked her if the chef could put something else on them such as olive oil or lemon, and her answer was, \"We are running a limited menu tonight, so we can't do anything for you.\"  Of course, my boyfriend didn't like this answer, so he said, \"Are you telling me that you guys threw everything out?\" By now, she seemed really mad and said,\"I can bring you some lemon.\" Then she walked away without taking his order.  (She later came back to get his order.)  When the meals came, the food was delicious, and of course the chef had made a delicious butter sauce for the scallops.  I could barely enjoy it though, out of fears that she had spit in my food or something!  God she had a terrible attitude.  If I come here again, I will certainly request a different waiter."}
{"text":"Wowie to Sergio's Savara. This was a fabulous experience.   The warm bread and butter that you get upon ordering is soo nice to start the whole dinner experience. Brought over one piece at a time, it's perfectly warmed and welcoming. But there is so much more...  My husband and I started with the Tamale Cakes. Phenomenal. The sauce that is lightly on the plate and cakes is wonderfully spicy and flavorful. Adding to an already sweet corn cake cooked and topped with some tomato, guacamole and sour cream. We both wanted to get more if we weren't so eager to see what was next.   My husband got the Angel Hair Pomodoro. The marinara sauce tasted nice and light. Not too thick and spiced so pleasantly with basil. Superb.  I was completely unable to finish my meal which was beyond good. So many great tastes put together into this delectable concoction, I don't even know how to explain. It was the Prata Misto which is  a savory vegetarian black bean over Brazilian rice, red onion rings, seasonal vegetables, farofa, fried spinach, and carioca tomato relish.  There is nothing wrong with our time at Sergios's Sarava. The service is professional and attentive and since we were there on a Monday in June the outdoor patio was open with ample seating. It was a wonderful experience and we can't wait to return."}
{"text":"Took my little brother here for dinner Sunday night.  The place was better than I remembered.  Attentive service, great decor, great food, and live music every Sunday.  For an appetizer, we split the shrimp inferno.  The shrimp were spicy and buttery and served with garlic toast.  Perfect.  I also had the trevisana salad, which was very good.  For the main course, I had the pichanha (Brazilian-style steak).  The steak was a bit more cooked than ideal for medium-rare, the sides were very competently done.  All in all, quite good, though very similar to what I've had at less expensive Brazilian restaurants.  My brother had the sea scallops, which were amazing, sweet and perfectly seared.  For dessert I had the chocolate terrine and French-press coffee, my brother had the tropical fruit with passion fruit zabaglione.  Both were superb.  A bit pricey, but a great place for drinks and small plates or for an upscale dinner.  And Sunday night is a great night to go, the music makes an already good atmosphere excellent."}
{"text":"Sergio, Sergio.  You really know how to woo a happy-hour-lovin' girl.  AMBIANCE: Ebony trim interiors, lofty ceilings, soft candle lighting complemented by the glow of Cleveland's silver skies.  Swank in clean and simple lines--the bar: a sleek and modern nod to the tiki bars of pinup fame.  Live jazz band not 10 feet away yet unobtrusive, melting into the woodwork.  Lounge areas with small tables for a more intimate respite.  Saravá: seduction is thy name.  DRANKS: Sergio's harbors a small but respectable selection of beers, wines, and Brazilian-style cocktails, poured on the heavy side.  (I'm looking at you, Copa Kiss & Mojito.)  But the Street Plates alone are worth an after-work quick dip into this luxe hideout.  EATS: Had only 2 plates, including a respectably tasty and surprisingly light beef churasco, but the obvious showstopper was the P.E.I. mussels.  Plump mussels simmered in butter broth* you wish you had more than the already 4 large slices of golden-crusted garlic ciabatta toast to mop it up.  I was ready to tip the bowl for a shameless, slurplicious finish but settled for more subtle teaspooning.  Hey there, what's going on?  Oh, you know, just feeding myself like a ravenous baby bird with this teaspoon here like it's a nourishing stew and not butter mussel juice normal people leave in the bowl when they're done nibbling ugly balls of succulent meat scraped off of iridescent shells.  You know, the uge.    (*reminiscent of Tremont Taphouse's mussel broth but understandably lighter, given TT's version includes beer, blue cheese and bacon)  THE CATCH / VERDICT: None really.  The cushions in the mini lounge area could use new covers.  Service was pretty regular but could've been a bit more attentive.  And maybe they could make a mintier, limier, less rummy mojito.  And the $18 HH deal--2 apps and a drink--isn't exactly rock-bottom pricing.  But for HH in Cleveland, it doesn't get much better than Sergio's Saravá."}
{"text":"I can always rely on Sarava for a good meal! The food is consistently delicious and well prepared. My favorite is the Key Lime Chicken, which is tender and flavorful every time, and since its an entire half chicken (for only $18 mind you), it makes for a delicious leftover lunch.   In terms of service, not the fastest or best service, but no better or worse than your average restaurant. I really like the ambiance of the dining area (classically modern), and patio seating in the summer is wonderful!  Overall, I'd definitely recommend it. Its one of my staples and I'm enjoying working my way through their menu!"}
{"text":"Zachary's family took us her for a nice dinner when we were in town this past weekend. This place is fan to the cy. Gorgeous and rich colors that, yes, make you think of Brazil. The seating was cozy and we could actually hear one another speak.   I started with the roasted beet salad featuring yellow and red beets, a really nice chevre and frissee. It is awkward to eat frissee because it's so springy and has the tendency to spring out of my mouth. I also ordered the artichoke fritters, planning to share them with the boo. They were amazing and definitely my favorite thing about the meal. They are very different from my beloved artichoke fritters at Cafe Fresco, but equally delicious. I think the plate came with 8 of these creamy fritters. I was greedy and devoured them all. For my entree, I went with key lime chicken which was one of the best chicken dishes I've had in memory. It was half a chicken which is a huge portion, so Z got the leftovers. The plantains were excellent as well. Great Job Sergio's Sarava. Thanks to Z's parents for taking us there. Mmhmm!"}
{"text":"I've been to the other Sergio's in University Circle, and I like the menu and the ambiance of this Sergio's better.  The patio outside is very nice, with lots of flowers and vines covering the area.  We went here for the Sunday all you can eat feijoada.  The feijoada was delicious- slow cooked, packed with flavor from the beans and various meats like pork loin, bacon, smoked sausage.  They serve it with green onion rice, diced tomatoes, and fried spinach on the side.  They also serve a crushed toasted light brown grain called farofa which I had never eaten before, but  added a nice crunchy texture to the main dish.  We will definitely be coming back here when we want to stuff ourselves full of hearty Brazilian stew!"}
{"text":"I dig it.  Sat in the bar area with a group recently and ordered a bunch of the Street Plates, aka small plates/tapas. The things we tried ranged from \"Just OK\" to \"Very Good and Would Order Again.\"  In the better category were the spicy shrimp, the mussels and the ribs.  The atmosphere I absolutely loved! Very chic, sleek, sexy. Somewhere to look good, be seen,host people:)  Interesting beer and wine list. Very interesting cocktail list though I didn't try any...  Seems like the small plates are the way to go to try a variety and get your money's worth.  Will return."}
{"text":"Most everything I've added here has been delicious -- and being a block from my house I'm here fairly often. IMHO, the best bang for the buck is in small plates or \"street plates\" as Sarava calls them. I especially like the crisp Spanish cheese, artichoke fritters, rainbow smelt tempura and mini angel hair pasta quiche. They've also got a raw bar and possibly the best (and almost certainly the biggest) urban patio in Cleveland (heaters at the ready, natch). The decor is dark, sleek and modern. I prefer their capirinhas to the mojitos, but the choice is yours."}
{"text":"This would have been a five star review if it wasn't for the foul mouthed patrons that believed the \"F\" word is an adjective! Nice place, great food, service was good. Next time I'll bring DUCT TAPE for the nasty mouthed patron that couldn't hold his liquor."}
{"text":"I was surprised to find a restaurant like Sarava on the east side of Cleveland. Having been to Shaker Square once, mostly for their farmer market on Saturday mornings (which is great by the way- I found butternut squash for cheap as well as amish apple butter), it was nice to walk into a nicer restaurant on the east side of Cleveland.  Walked in and was seated quickly in a nice little booth. A little dark to my liking, but a nice, well presented restaurants. Stuck with the restaurant week menu (I wish there was more selections), we ordered off of that..and I got a caipirinha to start off...which is a mix of a mojito and lime juice? It was okay.  Appetizers: Duck confit ravioli, goat cheese salad, or butternut squash bisque. I chose the bisque- GREAT. Not too heavy, not too thick-just right. The ravioli....looked small. The portion came out with three pieces.  The salad was just that... a salad. But I was surprised the bisque wasn't too thick or had too much stock in it...it was pretty good. I like.  Entree: I got the pork tenderloin. It was good! Not too tough, not too heavy- was in this great sauce. I'm not a fan of mashed potatoes...so although I knew the dish had mashed potatoes, I wasn't a fan how it consumed about half my dish. It's meant to be a side! A friend next to me got the trout..which was quite good. I liked how it had pecans in it...and it wasn't overdone.  Dessert: I got the coconut butter cake. MMmm. Good! It was a tad too heavy though, for my liking- I finished about half the cake. Another friend got the peach cobbler...I took a bite out of his, and man, it was sweet. Too sweet. I think they put too much sugar when they were boiling the peaches for the glaze. But the winner of the night- I took a bite out of chocolate terrine- OMG, I should have gotten that. A flourless cake which was so so so so good. That was the winner of the desserts. :)  I would come back to Sarava. It didn't seem like a Brazilian place though- but... still, a nice place in Shaker Square to stop and have a nice dinner."}
{"text":"Sergio's is famous for upscale Brazilian-American cuisine, and it's a little pricey, but the food is always fantastic.  Excellent cocktails - the white sangria is sweet and fruity, and the caipirinha is fabulous.  Their small-plate appetizers are delicious - I like the mini grilled cheese triangles with a tomato dipping sauce and the ceviche.  For entrees, the key lime chicken was excellent.  Overall, the restaurant is a little pricey, but the atmosphere is great - they often have live music - and the patio is very nice in the summer if you can get in."}
{"text":"What can I say? The ambiance was great. The music was great. The drinks were great. The servers were friendly and capable. The menu was inspired. The food was bad... and that's what I care about.  I went with a group of 8 and we ordered and shared everything. The Brazilian spicy shrimp entree was quite good as was the beet salad.  Everything else ranged from forgettable to poor. Most disappointingly, I ordered the Brazilian strip steak and it was like something I would get at a diner ala steak and eggs (without the eggs). This might sound harsh, but it is totally accurate. Sergio's employees - if you are reading this, my apologies, but you need to buy higher quality meat. You are probably getting furious and referencing that you buy your steak from some local organic rancher who charges you an arm and a leg. Well find somewhere else. Whole Foods' meat counter sells exponentially better steak than this.  The beef kebab appetizer tasted like nothing. Literally, chewy nothing. The fried cheese tasted like a mediocre mozzarella stick, albeit in a wedge shape. The pizzas had interesting toppings but were totally forgettable. I wanted to love this place but the taste fell far short."}
{"text":"Back in the Stone Ages, during my law school years, I used to insist upon going to Sergio's in University Circle for fancy dinners. I was a little disappointed that Sergio's Sarava, while still good, didn't quite equal its sister restaurant.   The space is really beautiful. The interior is dark, sleek and romantic and the patio is charming. The service can be a bit lackadaisical. But the caipirinhas were freshly made and delicious, so I got used to the slow pace.   Stick to the small plates. Those were interesting and delicious. The tamale cakes, ribs and artichoke fritters were fresh and vibrant. With the exception of the feijoada (lots of pork based yumminess with black beans) , the entrees were boring. The Xim-Xim consisted of a lot of rice and some shrimp overwhelmed by a lot of tomato sauce. My Brazilian Bouillabaisse was basically the same thing with the addition of some shellfish and fish fillet . Meh.  If you go, sit on the patio and listen to the band and order a lot of small plates and caipirinhas."}
{"text":"Certainly one of my faves on this side of town. Everytime I go to Sarava, I'm reminded of vacation in South America... its not so much the decor - but the food is spot on. So are the cocktails. Caipirinhas are perfectly done, and the street menu boasts small plates that taste like they're from a street vendor in Brasil. This place is a win all around."}
