{"text":"This place is nasty. I went there Saturday for dinner. The wings where overcooked. There rice was rice pudding\"YUCK\" and the chicken fried rice had really no chicken and was oily and a big glob of again I guess what they call Jasmine Rice more like minute rice that they didn't follow correctly. I immediately threw that away. Hey if you wanna good Japanese. Just come by my houses I can do better than this place. Never again! I would never recommend this place. Biggest waste of $25. Also the manager will allow you to eat food off her plated and drinks on the job"}
{"text":"This place is painfully slow. Been here four or five times and each time they've been \"short staffed\". Won't be back."}
{"text":"Saru is clean and the food was good.  It is new and has a few kinks to work out. We ordered spring rolls, two sushi rolls, and hibachi chicken. Sushi was good, spring rolls were not their normal spring rolls according to our waitress, but we were given and extra one to make up for it, they were decent, and the chicken hibachi was yummy! Hope they can keep it up. Nice to have a good place to go closer to home."}
{"text":"This was my third trip to this place. The first two visits were meh and the place was always empty.  Tonight it was packed and was an absolute disaster.  There were only 3 servers, one of which was the bartender and the other was training. At one point all three of them tried to take our order at different times. Every time the kitchen made a dish, a server would get it and then look out into the restaurant confused, not knowing where it was supposed to go.  I could hear them going from table to table asking, \"What did you order? Was it this?\"  Everything took forever: I had to constantly ask for drink refills, which only came once. Our appetizer took forever and when it came we had to eat it without plates because they were never brought to us.  I ordered sushi and wasn't given a dish for soy sauce...I wasn't eveb offered soy sauce.  Hibachi dishes came without shrimp sauce.  Our dinner took over 2 hours, which is insane.  Other customers were really upset and left without ever getting their food.  I felt bad for the servers, but it was an absolute dumpster fire tonight."}
{"text":"After seeing the now open sign daily as I drive home towards Lake park on Idlewild Road / Secrest Shortcut Rd from i485 my family and I decided to give it a try.  This little restaurant is in the Food Lion parking lot in Hemby Bridge.  This Asian Fusion restaurant has a full service bar and some delicious food. I had Hibachi Steak with rice and vegetables, we shared a Phoenix Roll and egg rolls. We had plenty of  food left over for lunch the next day. Good place to take the family and great place for a date, who needs to go to uptown Charlotte?"}
{"text":"Poor service, and their food wasn't very fulfilling. The sushi and rice they used was OKAY, at Best. Very slow service, considering my table of friends waited nearly an hour for our food and even then all of the orders weren't finished (there was four small orders).

Insulting to Japanese Cuisine and sushi culinary art as a whole."}
{"text":"Ordered tea  they had to make, it took about 20 minutes. Ordered soup it took half an hour to get there. Food was okay otherwise. Watch the menu they charge extra for fried rice but did not see it on the menu. They also did not ask about sides when it said you got one with the meal. Girl behind bar also talked smack when we mentioned the over change, not to our face but so we could hear it. felt sorry for the waitress as it wasn't her fault. Would not go back"}
{"text":"The atmosphere here was great. It felt so classy and upscaled. I only got the hibachi chicken, veggies and rice which was good. I would love to try their sushi next time I'm around. The food came out very quickly. We probably waited approximately 15 minutes tops."}
{"text":"Our party of four ate lunch at Saru today. I love their interior! The new menu has some great additions. Especially their sweet potato tempura. Perfect start to our lunch! Our party ordered the udon noodles, hibachi chicken and wings. The udon noodles are excellent! A delicious sauce with the perfect flavoring. The hibachi chicken also had a great sauce and the perfect ratio of chicken and vegetables. Finally the wings were amazing. Lightly breaded with ginger and soy. We love having Saru so close by. The service was very attentive as well! Ashley made great suggestions and checked on us throughout our meal!"}
{"text":"Where to begin...I felt very sorry for our waitress. It was her first night with minimal training. The restaurant does not have sections so the servers are running around like chickens with their heads cut off. On a Friday night they had two servers and one bartender (who was out on the floor more than she was behind the bar)...should have had a minimum of 3 servers and 2 bartenders. The calamari we ordered was so salty not even a sweet mango sauce to dip it in could help it. Every table around us seemed to have something wrong with their food (generally on the \"over\" side...overly salted, overly spicy, etc). It took forever to get any kind of food to our table. When my son needed a diaper change we had to take him to the car because they didn't even have a baby changing table in the women's bathroom. Needless to say, I am not impressed and I will not be returning and will encourage friends and family to not visit this restaurant."}
{"text":"I really wanted Saru to be a 5 star for me, and had hoped that in time, they will get there, but our first experience was so poor I had to start with a three. There's no question they were working out some kinks after recently opening and I believe they also had some chef turnover. I had followed their facebook page and reached out via messanger to find out when they'd be opening, so needless to say we were really looking forward to the opening. The amount of time and money invested in the layout/decor makes me feel this is just a hiccup and they're going to be a favorite of mine. The full bar is gorgeous and not ridiculously overpriced and since they're 'asian fusion' they have a nice amount of variety on the menu.

The first order was take out consistng of steak hibatchi, teryaki salomn, beef ramen soup and a rainbow roll. We had to throw the roll away, it was the worst take out we've had. Soup wasn't appetizing, but consumed by our guest.

We've had several more visits here, but the quality has never remained consistent. If it wasn't for how close they are to home I'm not sure we'd still be dining here. The one I love are they're wings, have a different five spice taste to them. Those are always good and one thing that never disappoints. Nagoya wings. 

Just to clarify, I initially wrote this review months ago, but had never completed the draft. I'd told my husband I wanted their wings earlier this week, but he said he thought they'd closed...sure enough I got no answer when trying to call and unsure of their operating status."}
{"text":"This place is legit.  It wasn't busy when we came in, and there was only one server, but she did a great job. The food is fantastic.  Hemby Bridge is an interesting spot for a place like this, but it's worth the drive if you're not a local like us.  Give it a shot!  It's delicious!  We tried several dishes.  He Asian fusion vibe allows something for all tastes."}
{"text":"Stopped in for lunch. Place was nearly empty. Service was VERY slow. Calamari was a \"featured\" appetizer. Ordered the calamari. Frozen/thawed chunks of squid. VERY strong squid flavor, heavy breading, with sauteed carrots and onions as a garnish (???)  No sauce for dipping.
VERY disapponting. Sushi was OK. Did I mention that service was SLOW? Another diner with me ordered beef w/broccoli. Inedible. Meat was tough and bad flavor. Waitress did not ask why it sat uneaten.
  We tried to pay, as we were already late getting back to work. Server took ANOTHER 15 minutes to figure out the tab.
  Bad food, bad service. I can't imagine what would happen if 20 or 30 diners showed up."}
{"text":"Good food reasonably priced! Large portions made with fresh ingredients.
The drink specials are awesome!"}
{"text":"Food was excellent!!  Prices are very reasonable.  Love to have a local sushi/hibachi place.  Service was very good.  Will be back!"}
{"text":"Service stunk. Had 1 girl running the bar and all the seating. 20 minutes for  a drink. Ordered a ginger salad and asked for it first she said absolutely. Sushi came first; Dragon Roll and Phoenix Roll were both really good. As we have the table cleaned my salad shows up. Might come back but probably better if you call it in."}
{"text":"As lovers of Asian food, we were excited to receive a flyer in the mail for this place. A new spot in the area? Yes please! While the dine in area is actually very nice, we opted for take out. Unfortunately, we were left unimpressed. It's not that the food was bad, it just wasn't good enough to make us want to get take out versus delivery from the place we've been using for years. 

What we ordered: California Roll, Philadelphia Roll, Godzilla Roll, Sweet & Sour Chicken, Sesame Chicken Combination and Teriyaki Steak

Timing: Quoted 15-20 minutes, took 35. 

Sushi Review: The sushi was the star of the experience for sure. Nicely prepared and very tasty. We purposely didn't go very unusual this first round, just to get a feel for it. While the California and Philadelphia Rolls were both very good, it is hard to mess those sorts of options up. The Godzilla Roll was phenomenal. Just the right amount of kick and, fried perfectly. The thing with the sushi though is, not all the rolls come in the same size. While the California and Philly rolls had around 8 pieces, the Godzilla was only 4. If not priced higher, I'd expect that but, being that it was almost $2 more, I was a bit surprised to see it was also a significantly smaller roll. 

Entrees: When ordering the Teriyaki Steak you are asked how you'd like it cooked. We chose medium. Unfortunately, the Steak was far from medium (more like well) and quite tough. It was also incredibly bland. No Teriyaki flavor at all. It was paired with stir fry vegetables that, were also quite bland and frankly very large. 

Sesame Chicken: I was pleasantly surprised with this. I am used to restaurants that use the same red/brown sauce for nearly all their dishes and just throw sesame on top to call it Sesame Chicken. That wasn't the case here. The chicken was sweet, but not too sweet, and cooked perfectly so the breading was light and crispy. 

Sweet & Sour Chicken: This was for my 11-year old son and, let's face it, it's hard to screw this one up. 

Extras: The fried rice is quite bland. I know the sort of fried rice you find at a Japanese restaurant often differs from that if a Chinese option but here, it was ultimately just yellow rice. No other ingredients. The egg roll wasn't bad but, I'm not a fan of meat in my rolls and these have some. 

Overall, while it wasn't a bad meal, I don't know that we will be back. I can't in good conscience recommend anyone make a special trip to try it out but, if you are in close proximity to it, and willing to take a chance, go for it."}
{"text":"This is my favorite Hibachi Bar and Grill in the Indian Trail/Hemby Bridge area. As soon as my fiancé and I walked in, we felt like we were in a restaurant uptown due to its classy, modern, hip atmosphere. The service was great and our hibachi steak and hibachi chicken was delicious! Highly recommend giving this new spot a try!"}
{"text":"I did takeout from this new place. The restaurant itself looks great. Really nice modern design, and the bar is stocked. Very nice people working there, too. 

I tried the beef with ramen, which was okay. I thought the ramen was a bit overlooked. I also tried a spicy salmon roll, which I enjoyed. 

I'm hoping this place, once it's settled, starts some lunch specials. That would be awesome! 

I plan to go back and try other dishes."}
{"text":"If you are a fan of microwaved food, this is your place! Not good, even the soy sauce couldn't save it! I've read reviews about service... that was not the problem. Well, they forgot my hubby's sushi, which I think is a good thing! I will not recommend. $50 for reheated food that tasted NOTHING like hibachi! I do not recommend this place!"}
{"text":"Very disappointed with the food here. Plus you are not even acknowledged when you walk in."}
