{"text":"How this place got 5 stars is beyond me! It's dirty the food is 2 star at the most. The minimal about we tried tasted nothing like traditional Vietnamese . The Pho looked Ike beef stew with noodles. Watched the cook wipe a plate she was serving to customer with a soiled white RAG. (The RAG was white but brown with dirt same rag she used to clean tables with) 
My appetite was completely lost over the filth. NEVER AGAIN"}
{"text":"Best beef satay noodle soup I have ever had! It is has coconut milk in the broth. A must try!!"}
{"text":"Pretty good family run business, Vietnamese foods are very authentic taste, very reasonable price, small dinning room. Recommended to try"}
{"text":"Had the Beef Satay Noodle Soup.  Although I still consider Bagolac's (no. 52) the best in the city, this one is very good.  It's spicier with more coconut milk.  The decor is lacking and a TV plays Vietnamese programming so come for the food, not the ambiance.  Will definitely return."}
{"text":"This place has really great Pho! Try the Beef Sate and Beef Brisket Noodle Soups. Prices are reasonable too!"}
{"text":"Found another Vietnamese restaurant that is Vietnamese but also Chiew Chow or Fukien that serves Satay Beef Noodle Soup (with coconut milk)!  Satay House does a decent job of the satay soup.  A much lighter soup base than the one in Noodle King.  I like it!

Another dish that reminded me of Singapore's Fried Turnip Cake with Egg in a sweet sauce - quote no. 7B - fried with chopped up spring onions.  So good!

The Chiew Chow noodle they serve is slightly different from your other Vietnamese restaurant.  It's because of their Chinese heritage.   It reminds me of the Singapore Teochew \"tah mee\" (dried noodle with soup on the side).  They also have the noodle soup version.  This noodle is served with pig innards - liver, kidney, spleen, pork.  They have 2 kinds of hot sauce that you can drizzle over your noodles.   This is a truly Chinese Vietnamese dish and if you are squeamish, please don't try it! 

Will be back for more."}
