{"text":"This is my new favourite place the owners are fantastic and very kid friendly !Had the pizza to day and it was amazing,my kids love the meatball sandwich !!"}
{"text":"Pizza had the perfect balance of chew and crunch. This is my new pizza joint from now on. Happy to find this place. Was given 2 free drinks and dips for picking up my order. Just go there and get a deluxe pizza, you're gunna love it."}
{"text":"Prior to this business opening, this location used to host an Italian Mom and Pop Dive restaurant. However, it served the most amazing Italian sandwiches with the customer service only a Nona could deliever.  Today, it has clearly been purchased by some younger hipsters (for better or worse). Now the dive restaurant has been completely renovated into a typical trendy atmosphere. The menu is still similar, but now only serving Italian sandwiches. The buns were great, the sauce was great as well. The Veal was good, comparable to California Sandwhiches but slightly smaller. I had mushrooms and jalepeno peppers. The mushrooms were from a can (or appeared to be), and the peppers were sliced jalepeno rings also probably from a can (but still very hot). The price for the sandwhich, toppings, and pop came to 14$. Again fairly on par with other restaurants. Overall, if you are in the neighbourhood and in the mood, its a safe bet you'll enjoy your purchase and feel satisfied. I just wouldn't go out of my way to track it down. San Francesco is still my #1. Yes the place is clean, friendly, and delicious. I would return if nearby."}
{"text":"I love the meatballs. I go all the time as my kids often ask me to get them their favorite homemade meatballs. My husband's loves their huge sandwiches. We are never disappointed."}
{"text":"If you are tired of California Sandwich and its sky rocketing prices and slipping quality this is the place to go. This place has quickly become my new lunch spot. The first thing that caught my attention about this place was that it was a Portuguese take on what is already a dominant Italian sandwich industry in the GTA. The interior is clean, visually appealing, and not cramped.   The service is amazing and quick. The owner/cook really made the experience for me, not only was he courteous he offered a meatball and sauce on the house while we waited for our sandwich's. The sauce is amazingly flavorful; if he sold it, I would buy it. The meatball was huge and tender while remaining juicy. After consuming the meatball sample both my friend and I where ready and excited to demolish a sandwich.  I ordered the Chicken with hot peppers, my friend the Veal with hot peppers. Both arrived to our table quite quickly. The chicken was juicy and packed with flavor. The breading was also quite good, crispy and not soggy from the sauce as is the situation I routinely have at California Sandwich. Speaking of sauce, there was enough on the sammie to coat everything while not being sloppy. The hot peppers where Jalapenos and where most certainly fresh as they still retained their crunch, not to mention heat. The buns also seemed quite fresh. The overall size of the sandwich was big, big enough to fill you up for a meal without being overwhelmingly full. My friends veal, the same story.  Since going I routinely come back for lunch with my father who now champions Saucy Kytchen over California Sandwich, our previous lunch haunt. And since then I have tried the Veal, Sausage, Pork, and Meatball. All of which are quite delicious. But I tend to gravitate towards the Chicken, Pork, or Meatball. The Pork itself is probably my favorite. The meat is cut into smaller pieces and marinated ahead of time which is the only way I can account for how delicious it tastes on its own.   All and all, great service and flavorful sandwiches make for an astounding combination and experience. Keep up the good work! I will be back!"}
{"text":"Great the first time went on a Sunday no enthusiasm from the cook my veal was cold and dry with hardly any sauce . Sorry !!!"}
{"text":"Last night got the munchies and searched on yelp to find something local to me for some good food.   Stumbled upon Saucy Kitchen. Small little place you wouldn't even notice this place. In fact I have driven past it over the last 5 years and had no idea it was there. Its just after Cawthra rd on the lakeshore. Younger owners who were amazing and nice. The girl taking my money was nice on the eyes too    I ordered 2 chicken on a bun sandwiches with cheese. I got mushrooms peppers and onions.    Sandwiches were large and the sauce was great.  The chicken was off a bit. Had a frozen deep fried kinda feel. The mushrooms were from a can.   Despite the not so fresh ingredients the sandwiches were great. I will come back."}
{"text":"I've eaten here a few times and today was just like the other times . The meatball with hot peppers was amazing and had the perfect amount of heat The sandwiches are pretty big and the buns are also very good. If you're in port credit and craving a sandwich you shouldn't look any further"}
{"text":"I really enjoyed my veal sandwich from here. It was everything I like in a good Italian sandwich. Perfect heat, perfectly cooked, sweet onions, zesty sauce. I was eager to try the Steak and Onion sammy, but they were sold out when I was there (later in the evening, so it's understandable).  The kid behind the counter was super-friendly and my service was very quick.  I'll definitely be back for that Steak n' Onion."}
{"text":"The best tomato sauce in town! You'll wanna try their famous Saucy Kytchen Chicken Sandwich! Loaded with a fried or grilled chicken breast, sauce and a fluffy kiser bun that melts in your mouth. Fresh bun fresh sauce and home made better than the other places. Nothing can compete with their sauce!  There are also Vegitarian options and you gotta order the favs beans with the Portuguese hot sauce that Is also famous! I wish we had a Saucy Kytchen on Kerr Street in Oakville! On a cold damp day all I can do is warm up to any saucy idea!  Good Luck Kevin"}
{"text":"Not impressed. Sandwiches are huge, yes, but lack flavour. I had the veal and my wife had the chicken and she said it didn't taste fresh so she threw it out.   Place is clean and the guy behind the counter was pleasant so thats why I'm giving it two stars. Fridge was empty other than bottled water so no real drink options. Very strange that this place gets such great reviews.  Very disappointed as we are in the area quite a bit and would've loved to have an Italian sandwich shop to stop in to. We won't be back."}
{"text":"Love this place!  California Sandwiches closed Sundays....tried this place...like it better.  Will be back for sure"}
{"text":"The eggplant is my true love, it makes the veal sandwich into an amazing meal, it also makes the spaghetti and meatballs into an amazing meal. It's also amazing on it's own. In fact I would put that on anything at all or nothing and be a happy happy person. But in an a sandwich with the veal, and the cheese and the onions and the mushrooms and the hot peppers? OH MY YASS. It's beyond fantastic. (It's also huge) However for late nights, the pasta and add the eggplant and well there's nothing wrong with that either. To be fair I wouldn't be upset with the pasta without the eggplant either. (They do call aheads too which is nice)"}
{"text":"I hadn't actually heard about Saucy Kytchen until I got one of their flyers in the mail which is odd because I've lived in Port Credit for a few years now and you think I'd know my way around by now. In my defense, it is away from the main area and sort of tucked away. I guess I should have made better use of Yelp's 'nearby' feature. Anyhow, seeing as my favourite Italian sandwich place in Mississauga (On-a-Bun) is now a whole fifteen minutes away (the horror, I know) it's nice to find a place where I can get a good eggplant parm...or pretty good anyways because there is a bit of room for improvement here.  The place itself is nice, clean and new looking. As AJ's previous review stated, it's under fairly new management or more accurately is probably only a couple of years old, at least in its current incarnation. Service was friendly and prompt early one Saturday evening (my first visit), though there were only a couple of people in the joint.   I went with the aforementioned eggplant sandwich, which is sort of a given for a vegetarian such as myself. A minor quibble is that cheese, onions and peppers are all extra ($.85). On-a-Bun includes cheese on their eggplant parm (and it's a dollar less to begin with) and doesn't charge for onions on any of their sandwiches...only the peppers are extra. This isn't a major issue but it is worth noting that the same sandwich is three dollars less at OAB. Different area, different establishment and perhaps a different sandwich, so I'll reserve judgment until I dig in.  The sandwich itself was huge (so comparable in size) and they certainly didn't skimp on the toppings, which is nice. If anything, there were actually too many onions on the thing to the point that they were spilling out all over the place. Oh well, better than being too frugal with them...in their defence I went back a second time and the sandwich was a bit better constructed, though I'd still recommend a pile of napkins! The pepper options are basically jalapeno if you want hot and green bell if you want sweet...I've tried the \"hot\" option twice now and I'm not really sure if the jalapeno peppers work all that well. Other places have peppers as an option and whatever they use, well, it's better. The jalapenos don't really mesh well with the sandwich...I'm not sure what else I would recommend (banana peppers, pepperonis, something marinated?) but what I do know is that they don't really work. The eggplant itself is certainly tasty, as is the sauce but if I did have one minor quibble it would be that it's not really a \"parm\". The breading is very light, in fact I suspect that may be why they only refer to it as an \"Eggplant Sandwich\". Still, good overall flavour and consistency, not to mention the sandwich is huge and quite filling.   Saucy Kytchen is a solid place when judged on its own merits but perhaps On-a-Bun has spoiled me. It's still the premier Italian Sandwich place in the 'Sauga but SK is certainly worth a try if you're in the area. And with a couple of minor tweaks it could be even better than it is already."}
{"text":"Veal was dry, and the hot peppers were little jalapeño rings. Fresh buns and tasty sauce though. I will probably give them another try."}
{"text":"Been here before and it's my goto sandwich place in the area... BUT not anymore.. Seems ownership has changed..  Here are some pertinent points: - machine down so cash only - nice reno.. but.. uh.. ego much?! - food quality and service got bad -- I used to love coming in and having a convo with the friendly people and then eating a great sandwich.. again, not anymore. - no peppers but got offered tabasco?! YHGTBFKM. - seemed pretty chintz on the toppings this time - also didn't see pizza on the menu?  Not going back.. too bad this place went into the sh1tter.. it's close and WAS good.....  -- [NB: from Dec/16, draft review finally cleaned up and posted May/17]"}
{"text":"There's something wrong with all the great reviews. These people either went when they first opened or they have never had a veal sandwich before. I feel bad rating this place so low but I can tell you it doesn't rate anywhere near a California Sandwich or even On a Bun or a hundred other Italian sandwich shops.  After driving by a thousand times (and seeing the OPEN light on when the place is actually closed) i stopped by around 2:30 on a weekday. The stools were up on the front window counter and it was dark inside, but the door was open. Inside, it looks like they are ready to close. There are no products in any of the showcases, the place is dark and the food prep counters in sight don't seem to be used. Anyway, I never judge a book by its cover, but I would suggest someone prep the place like its open. Take the stools down, put something in the showcases and clean up a bit, not to mention add a bit more lighting.  I ordered a veal sandwich with mushrooms and agree with the review that said the sauce tastes like Ragu. It was a toss up between that and bad ketchup. I hope I caught them on an off day. The bun was cold and the veal luke warm so overall it was cold. By the start of the second half, everything just fell apart. The veal was tough with ligaments making it difficult to chew. And I was a little suspicious when my sandwich was ready in about 2 minutes. Also, the payment terminal was down so nothing but cash, but I understand that can happen.  The interior is covered with pictures of a wrestler called Ray who must be one of the owners. I don't know what all those pictures have to do with Italian sandwiches. I would rather see pictures of Italy and fresh ingredients.  There is absolutely no reason why (other than maybe a couple of dollars less) that I would come here again with so many other great Italian sandwich places around. I never wish a business to close but if they keep going on as I experienced them, they won't be open much longer."}
{"text":"Amazing pizza, best veal and chicken sandwiches I've ever had. Always made and tastes fresh!"}
{"text":"Wow !  The food is so delicious ! The sandwiches are huge and delicious !! I had the eggplant and my hubby had the veal sandwich  ! We had a hard time to finish the sandwiches because they were so big.  The meatballs were soooo good ! Just like nonna's or maybe even better! The large pizza was so big it almost didn't fit in the box !  And the wings were awesome too ! Yes I will be ordering again from this place ! Well done"}
{"text":"Was driving through port credit today and had a craving for an Italian style sandwich. A quick perusal of the insauga.com top 5 list for best Italian sandwiches suggested this place as the number one of its kind in mississauga.   Be forewarned though: none of the stores in the little non-descript plaza it resides in have any signage, so put your trust in Google maps and you should be fine. If you pass the hasty market you've gone too far.   Walked in to find friendly staff and a clean, simple atmosphere with a minimalist approach to decor. Two high tables and some chairs pretty much rounds it out. Cashier and the store manager were both friendly, easy to talk to and willing to make suggestions.   Tried the veal sandwich (around 9 dollars, toppings extra) - within a few minutes out comes a humongous, saucy, and great tasting sandwich loaded with onions and sweet peppers and cheese. Tasty, filling, and lots of sautéed onions which were great. I haven't tried on a bun or some of the other locally acclaimed choices so I'm not in a position to compare but Saucy Kytchen certainly did not dissapoint.  Would go back, and if I could make a suggestion - go there on an empty stomach!"}
{"text":"You may not notice this place unless you're going there as it's a bit tucked away, but the food is great!  The Italian sandwiches (hefty portions as always) are delicious, and though it's a small place, they always make you feel welcome."}
{"text":"Was super disappointed yesterday when I went to get my husband and I sandwiches from Saucy Kytchen.  (And I love their sandwiches). Their new location is at 229 Lakeshore Rd E.  Arrived at 6 p.m. and the door was locked. Msg'd them on Instagram and found out they closed to get groceries. Ok, fine you need groceries, but to leave at the dinner hour, no note... nothing! Couldn't you have done this at 3 p.m. or 4 p.m.?!?  Very disappointed Saucy Kytchen!"}
