{"text":"Nothing memorable to speak of.  Went on a Friday night, and yes, as other reviewers have noted, the crowd is definitely older. As the night wore on mid-twenties individuals came in. However, the music was ok. As it changes nightly not much to say about this. They have a dance floor that was well used on the evening I was there. My friend and I sat at the bar, bartender was semi-attentive. My mixed drinks (Jameson and Ginger Ale) were weak and nothing to speak of, but I believe only $4. While I was excited to head here due to hearing they have live music 7 nights a week, I most likely will not be returning. Not the right crowd, vibe or cocktail for me."}
{"text":"Savannah's gone, but the group, now go's to the new bullfrogs cafe, in North Ridgeville. Carrying on Savannahs hope.."}
{"text":"Great live music. Great drink prices. Great crowd that comes out for drinks. Wide toilet stalls. Free pickles and relish"}
{"text":"Great place to dance or just listen to music which is played 7 nights a week.  Relaxed, casual atmosphere with Oldies music on Mon and Tue and  Contemporary , MoTown., Jazz, or Blues  the other 5 days of the week"}
{"text":"Oh lawd. Can this place get any weirder on a Friday night?   But man it's hilarious! The people watching is superb.  Last night we went up around 8:45pm before my uncle's band started at 9. There were some high tops in the back right side open & we took two - great vantage point for watching the band and dance floor. Not sure how quickly they usually fill up but Friday/Saturdays it's usually packed with \"regulars\" and what an irregular bunch of regulars they are. Last night consisted of an older gentleman in full on business apparel including tie, a 40 something couple dancing where I swear the dude licked his fingers and slapped her booty, a bar \"girl\" dancing with old men and people's boyfriends - the aftermath of which was hilarious. This place caters to an older crowd and if you know the place it's always been that way.  Haven't tried the food since they switched back from Rock West. As for the drinks they have a good selection of drafts. I wanted some frilly drink (think Bar Louie martinis) so I asked for something that tastes peachy - & I got ID'd, thanks sweetie! But they brought me a tasty drank in a martini glass. I was pleased & I think they were around $7 bucks. 5 drinks ran the boyfriend $35, not too horrible.  Parking is outside in the strip plaza. It gets full but there are extra spaces around back by the Mexican restaurant on the end.  I'll report back after trying the food!"}
{"text":"The only reason we decided to try out Savannah's was because my mom bought us a restaurant.com certificate - thank god we had that free $25.  1. a tip for servers - just because you see one of your tables has a restaurant.com/groupon/livingsocial/whatever - doesn't mean you should neglect them because you'll be getting a tip anyway - a lot of people typically tip better than that. - our server came up to us three times after we got our food - once to check on us, once to give us the bill and the last time to collect her tip. - terrible service.  2. the food - awful. for an appetizer we ordered the jalapenos stuffed with shredded chicken and wrapped in bacon - sounds delicious, right? wrong. three very small jalapenos on a bed of instant rice that was watery, mushy and flavorless.  jalapenos, chicken and bacon - no flavor just some heat.  the three of us tried three different sandwiches - one corned beef, one pulled pork and a patty melt - we all ate half and threw out the other.   3. we didn't stay long enough but judging by the crowd the geezecats brought in, i'd say it was awful.  Safe to say I'll never spend another dime at Savannah's."}
{"text":"One star cause I'm afraid. Savannah had good food.  Rock whatever had good food .  What happened?  I want to go there and try the food, listen to music - I'm beyond middle age and can't stand being around people my age. They act like old farts. I hate old music. I like hip hop.   If I ran that place for a few months, it would be rockin. Westlake police would be called a lot. It's what this town needs. Diversity mixed in with good music and drinks.    I'll have to bring my conservative husband in for dinner so we can watch and listen to the old hips swivel around. I'll bring in an oil can. After all I'm old too."}
{"text":"So apparently when I drive by Savannah's every weekend, the parking is full of every 60+ person on the west-side of Cleveland. A friend of mine and I were bar hopping on a random Tuesday night and ended up at Savannah's for a drink. Turns out it was definitely an oldies night, which I believe is every night. I think I saw a calendar that had a 70s night on it, but I would guess that receives a similar crowd...  The place was jam packed full of people my grandparents age! I mean they were getting down on the dance floor. Some of the moves were even a little ri-que! Every person had a drink in their hand too so the place is not hurting for business at all! Personally for the place, I expected the beers to be cheaper, I could go to ATC and get a $4 draft and have good eye candy at least.   After one drunk 80 year old man offered me a glow stick bracelet, and make a joke of staring at my chest, we decided to leave.   Definitely an experience, but one that I will not ever want to relive."}
{"text":"Pretty good food and usually decent service. I go to lunch here with people from work every so often and we've never had a bad experience here."}
{"text":"Try the Savannah Blackened Sandwich!  Michelle is a great server!  Good bands too!  Mostly blues which I love!"}
{"text":"Was out shopping at Crocker and my friend chose this place for us to meet rather than one of the overpriced uppity bars at Crocker.  It's pretty much across the street but feels like it's much farther.    I walked on a Saturday around 6 and was easily the youngest person there but 20 years.  I'm pretty sure I text my friend \"It smells like old people in here\" while I was waiting.  However, I'd rather have that crowd than MILF's and Cougars.    Haven't experienced the entertainment here, but I know they do have a lot of bands and heard it was fun.   I wouldn't mind coming back and checking it out.  Oh, parking sucks.  There's a lot but it's in a strip and I guess I went around dinner time.    Service was quick and semi-friendly; did the job."}
{"text":"Haven't been in awhile, but the entertainment here is usually very good - both on the stage and off the stage. They play jazz, oldies, you name it and the dancers are sometimes in their 60's!  Great bar and table service but don't go to eat during the entertainment since the service tends to suffer a bit. Very good, surprisingly, Sunday brunch - and you get to see the place in the light."}
