{"text":"Try the appetizer pizza! Then try one of the good salads or sandwiches! My wife loves the smoked turkey with extra honey mustard! I do the roast beef with extra horseradish! I have also had the greek salad with the spicy italian that is excellent! They close early though..."}
{"text":"I was impressed with this place.  Great deli/sandwich place, but also sports salads, panini's, fresh baked bread, bakery and even pizza.  I\"m yet to try the pizza, but I can vouch for the sandwiches and salads.  It is pricey at nearly $7 a sandwich, but I did notice some deals such as two large pizza, two toppings for $20.   It's worth a taste."}
{"text":"The food is mostly heated up in a microwave before being toasted in an oven. It cost $9 for 12\" sub so kind of pricey. The subs are bland but the pizza isn't bad. The workers aren't very friendly or personable."}
{"text":"The food is still delicious, but the past couple times I've tried to order, they've been out of meat. If they could keep their sandwich meat in stock, I would have no complaints. They make a great corned beef."}
{"text":"ugh! I honestly wanted to be a fan of this place (I love love love subs) The first time i went there i ordered just a good ol Italian sub (there classic, whatever they like to call it) the price i thought was stupid, i could get a subway footlong for less!  Anyways i got a bag of chips as well and a side of there chipotle mayo sauce (i was nervous for her to put it on the sub so she so kindly gave me a side, free of charge!) anywho got home was soo excited to eat this and honestly it just didnt satisfy my taste buds, Im not sure if it was lacking sauce (i had her put mayo on it) im not sure if it was way to meaty, was it the bread?? i have no idea i just wasnt crazy.  So the nice person that I am i went back......again! This time I was craving a phillycheese steak, they had one...................made with roast beef...........................CAN I PLEASE HAVE SOME BREAD WITH ALL THIS ROAST BEEF PLEASSE!!!!!! honestly ......i took about 4 (sloppy, messy) bites of this sandwich...and gaged (sorry guys) gross gross grosssssssssssss Its just not the quality sub I was looking for...........Dibella subs is where its at!"}
{"text":"I went there once, people were friendly, sandwich was average, and price was higher than other sandwich places."}
{"text":"I used to come in every week. But since I moved its been a little since I've made it in. The service I got today was worse than any I've ever received. My salad was disappointing, she had to dig through crumbs to find crutons for it. My pizza was undercooked. And the woman who helped me was very rude and demeaning. Especially when I inquired about desserts.  What happened to the nice ladies that used to run it? I felt like a burden more than anything. Without customers you will have no business. So they should try to put the focus back on making people feel welcome.  The food used to be amazing. Now it will probably be a while before I return."}
{"text":"Decided to have a sub tonight. Called a couple of times. No answer. Seemed odd. As it's 2 minutes from my house drove there Open sign on but no one inside. Got back in car to leave. Two employees sitting outside the back door. I guess they figure they have no competition. Went to Jersey Mikes. Ok not great. This was about 6:30"}
{"text":"Surprisingly good pizza from a sub shop! Nice crust and sauce, a good amount of cheese."}
