{"text":"Mom, dad, 14 year old daughter and 6 year old son went for dinner. When the reservation was made, I let them now I wanted to eat downstairs to see the band playing that evening. When I arrived, I was told that while our reservation was for 7:30, they wouldn't be open for seating downstairs til 8:00. When we closed out our tab in the bar, first, we were told by the manager that we couldn't eat downstairs, then when it was pointed out that we made quite clear our desires and that it should have been brought up over the phone when I made the reservation, or at arrival, the story became that we couldn't have the kids downstairs because it was a nightclub, and against state liquor laws.  I suppose I shouldn't be surprised if the manager wasn't familiar with state liquor laws, as he also told us that by allowing the kids to try a sip of our cocktails, the restaurant could get in trouble. After being reminded of that comment by a fellow Yelper, I went looking for information, and this is actually addressed in ORC (Ohio Revised Code) 4301.69(B), which says, \"No person who is the owner or occupant of any public or private place shall knowingly allow any underage person to remain in or on the place while possessing or consuming beer or intoxicating liquor, unless the intoxicating liquor or beer is given to the person possessing or consuming it by that person's parent, spouse who is not an underage person, or legal guardian and the parent, spouse who is not an underage person, or legal guardian is present at the time of the person's possession or consumption of the beer or intoxicating liquor.\" It seems pretty clear the state of Ohio is okay with parents letting their own kids try a sip of their libations.  There was no apology, no offer to make it right, no alternative presented. We spent over a half hour in the bar waiting for a table they appeared to have no intention of ever making good on. The only thing he did right was immediately and without question refund the unconsumed cocktail that had been intended to come downstairs with us.   The astonishingly poor service made the appetizers we ate look almost passable. $12 for seven shrimp in a shrimp cocktail? The calamari was okay, but a bit undercooked for my tastes. It could have been saved with some marinara sauce, but we did have the cocktail sauce from the shrimp cocktail.  On the plus side, the gentleman who was manning the bar was helpful and professional. I hope the staff are treated better than the guests, for his sake."}
{"text":"If I could give this joint a zero stars or a negative score, I WOULD!!!!! The worst service ever! Even worse was the table next to us had great service. I had to return our sprite & lemonade because they tasted bad. My boyfriend & I ordered the short ribs sliders with frites. I've been to Europe...frites are fries lol. Not here! There thin as a strand of hair & the sliders were flavorless. We then ordered the strip. I wanted it medium & it came out rare. When I asked them to correct it, they gave me the same steak back & didn't confirm if it was cooked correctly. We both had to add salt to our food. Needless to say, I will never be returning to this place! It sucked!!!!! We should've went to the cheesecake factory."}
{"text":"Overall, a disappointing experience.   The waiter was disinterested and dispirited.   I won't be going back."}
{"text":"My boyfriend and I had a Groupon...$35 for $72 worth of food. We went the same day we bought it, on a Thursday.  Upon walking in, we weren't immediately greeted. There was a woman taking her coat off behind the desk assisting another woman, but when they were done she completely ignored us. We waited around for another couple minutes and this dashingly polite man greeted us, told a few jokes, and checked our coats for us. Instantly forgiven.  The bar was full but there were only two tables filled. He sat us in a pretty romantic spot away from other people and we got to sit next to each other (yes, we're that cheesy couple!) Our waiter came immediately and explained our groupon deal to us, we couldn't pick our appetizer, we had to get the arancini, but we could pick any entree for under $24. My bf loved the arancini, I didn't care at all for it. He ordered the steak and blue cheese potatoes (I forget the official name) and was allowed to substitute the asparagus for a big honkin' piece of broccoli. They covered everything in a bourbon sauce that he LOVED, but I also wasn't a fan of. I ordered the crusted tilapia with risotto and string beans. Again, I wasn't a fan of my risotto or string beans, BUT, the tilapia was AMAZING! He brought me out some of their peppercorn ranch and it was even BETTER! I'm not a picky eater at all, I guess the stuff was just too fancy/weird for me.  Our waiter was awesome and funny too. The host at the door even put my coat on for me before we left, wonderful service. And for that, I give them 5 stars! I just wouldn't go back since their food didn't really fit my taste, but of course that's my tongue's fault, I'm sure it all would be tasty to others!"}
{"text":"First time in the Viagra Triangle tonight. Had a groupon for $40 and decided to try them out since their close to home. I did make a reservation but it was definitely unnecessary. There was less than 20 people and this place is big. Was pleasantly surprised with the warm greeting and the fact they have Lienenkugel Summer Shandy. Nice scenery and great music.  For apps we did the tuna napolean and arancini (fried risotto). The tuna is rare, crusted, sitting atop a tortilla chip (kinda, they call it a wonton) with a dab of wasabi sauce. Very light, refreshing and unique. If you like seared tuna, try this. The fried risotto reminds me of a mozzarella stick topped with sautéed onion and marinara sauce. This was really very good and more filling if you have a bigger appetite.  Entrees were; filet mignon and bolognese pasta. These dishes were five stars in my book. The filet is cooked medium, to perfection. Seared and seasoned like an experienced steak house. With the spinach, crab, mashed potato and bearnaise sauce, this is the best $29 I have ever spent. The pasta made me think I was in little Italy. Fresh pasta, tons of meat, parm cheese and truffle. Words cannot describe how good this pasta dish was. I was extremely pleased with all of our choices.  I hate the fact that this restaurant is not located in a more desirable area. I couldn't have been more pleased with my experience and I want other cool, young people to love it too. This place is a secret gem and I'm very lucky they are so close to home."}
{"text":"So wen't to SB81 after getting a Groupon to try the place, and walked away severely disappointed.   Lets start with the service: They have a patio, and having a dog we wanted to see if we could sit out with him! We called ahead by a day to make sure that we would be able to come with him, and were assured that it would not be a problem. Upon reaching, we requested a corner patio table to make sure we would be out of other patrons ways if they had any issues - this is where the problems started.  The hostess was taken aback with the fact that we had a dog with us, and became very brusque. Upon informing her we had called in and asked she hurriedly sat us down. Within a minute we had a manager come on out, and aggressively proceed to inform us that dogs were not allowed at that place, and we better stay in that table and not go anywhere else so that other people did not complain. Classy.  Throughout the meal we experienced snide remarks and digs at that, implying the fact that we should not be there.  If you don't allow pets - make it clear and I well get food somewhere else. Or let me sit and treat me like any other customer. Unacceptable.  All this could be better if the food and drinks were the saving grace. Unfortunately, they were not.  We ordered the Arancini as appetizers. The overall taste was decent, but was marred by the fact that by the time they got the dish to our table, it was already somewhat cool and soggy, and by the time we were able to get the waiter's attention for cutlery, it was worse. For the main course we ordered stuffed trout (saltless, bought out fairly cold and the sooner forgotten the better) and the pasta bolognese (covered in a layer of shallots with meat that tasted like it came out of a hamburger helper box).  Eeks.   The food itself would make the rating a 2-star. Couple that with the snobbish and unhelpful staff, and rude attitudes, this is a place that is going to have to be a 1 star in my book. Definitely NOT a place that is getting my patronage again."}
{"text":"Great patio for a dinner.  The service was excellent, friendly and fast.  We waited only minutes for the entrees, which were cooked perfectly and tasted fantastic.  Cornmeal-encrusted tilapia with lobster risotto and green beans and beurre blanc was excellent.  So was the ahi tuna."}
{"text":"As a first time customer I give it a two star. Service was great but atmosphere was NOT. We got there around 9pm on Saturday night and was very loud because of the Live Band downstairs and we sat next to kitchen that had their own music playing and singing all throughout the dinning room. NOT WHAT I WAS EXPECTING for the price of the dishes which the Filet Mignon(M/W) is as good as the cooks singing in the kitchen. What an experience. Place might be okay for after hour drinks. Not for dinner especially after 9pm."}
{"text":"We ate here the other night with three other friends. The patio was very nice. You have no idea you are right by a busy street. The food was good, but portions were very small. Also, my wife ordered a pepperoni pizza that was the worst pizza I've ever tasted. Everyone at te table tried it and the consensus was it was a grocery store frozen pizza that was microwaved. Our server was very pleasant, but between portion size and quality I'd have to say this restaurant struggled in our opinion."}
{"text":"It was my first trip here and I'm a fan!  I had the Arancini as an appetizer and it was absolutely delicious.  For dinner I had the crab cakes.  While they were tasty, they were the smallest crab cakes I've ever seen and there were only two.  As the entree I was very disappointed in the size.  It was more appropriate as an appetizer I'd say.  The service was attentive but the private room our party was in was pretty chilly.  I would definitely like to go back sometime!"}
{"text":"The fiance made reservations here for my 32nd birthday last weekend.  I laughed a little when he told me where we were going...after all I was turning 32, not 52!  Nothing like a dinner at one of the points of the famous \"Viagra triangle\" to make you feel older than you already are, right?  Anyways, we kept the reservation and I got all dolled up in my best cardigan set and orthopedic shoes (jokes...I've got jokes) and we actually had a very nice night!  Saucy Bistro has a very nice wine menu and the majority of the bottles are very reasonably priced.  I picked a Sangiovese/Syrah blend that was just wonderful.  We started with the calamari that was good, but not served with any type of sauce.  The batter had a nice lemon-garlic flavor and there was sundried tomatoes tossed with the calamari, but a nice aioli would have made the dish better.  For our second course we both chose the Bittaker salad.  This was one of the best salads I have had in a long time.  The vinaigrette dressing was amazing and mixed perfectly with the salty crunch of the bacon.  And the bleu cheese tossed into the salad was the creamiest and most delicious I have ever had.  I meant to ask our server who supplies the restaurant with their cheeses, but my food coma kicked in by the end of the meal and I forgot.  Damn.  For the third course I had the filet and my fiance had the prime rib.  We were both very pleased with our entrees.  My filet was cooked to a perfect medium and the crab with bearnaise sauce was the perfect addition.  We topped off our meals with the pistachio bread pudding which was a-maz-ing.  The service was very good, we felt attended to but not bothered by constant interruptions.  The one negative about our meal was the noise coming from the open kitchen.  I understand that restaurant kitchens aren't quite places, but I just seemed that the dropped a whole heck of a lot of pots and pans that night.  More than once during our meal I jumped because I was startled by a very loud bang coming from the kitchen.  If we go back I would request a table on the patio or more towards the back of the restaurant to have a more pleasant dining atmosphere.  Other than that, Saucy Bistro is a win in my book!  Watch out Cougars and Silver Foxes...the youngsters are moving onto your territory!!  PS - They have 1/2 price bottles of wine on Wednesday!"}
{"text":"This unassuming place is off what I would describe as a nondescript street in Westlake. I went to SB Eightone for a pre-Valentine's suaree, a \"shred your ex\" suaree to be exact. It was purportedly a singles event where one could bring a photo of an old ex to shred in their paper shredding machine. The reward in exchange for your photo was a shiny new ticket for $10 off of your bill--not a bad reward if you ask me. I did not know what to expect as I was not familiar with the town or the restaurant. I was pleasantly surprised. The food was excellent--I tried a risotto/marinara dish and it did not disappoint. It was bold, bursting with tomatoey flavor. I also had a warm mushroom salad that was yum. It had some very tasty herb dressing on it and the whole epicurean experience was complete. I look forward to my return."}
{"text":"The food was excellent, very top notch. Service was above average. Ambiance could use some work, mostly because the owners school age children were crawling all over the bar looking into the kitchen for part of our meal. Granted, they were well-behaved, but still. Food was great, including the calamari, excellent Bittaker salad (asked for mine without bleu cheese, his without cauliflower, and they mixed them up), great entree of smoked chicken ravioli and pretzel encrusted grouper. Dessert was very disappointing. Bourbon bread pudding, that was too dry and with not enough flavor."}
{"text":"My boyfriend and I came here before it was SB Eightyone and it was still called Saucy Bistro.  The first time we came here it was amazing! We had a stuffed Pablano pepper that was out of this world. We also had two pasta dishes which were really good.  The ambiance was nice also. It really did steer towards the older crowd though.  They advertised events for the Rat Pack and a couple other music genres from that era.    The second time we came was for Sweetest Day. We came for the Prime Rib special that they ran for every Friday I believe it was or it could have been Saturdays also..... We got the pepper again thinking it would be good but it wasn't as amazing as we remembered.  Don't get me wrong the food was still really good but the pepper wasn't as heavenly as we remembered......  We found out that the head chef that was there before when we first went had left.... His name was Mickey.  He opened a restaurant downtown. Which I can't think of right now......  His food is amazing.   Those two times were about almost 1 year ago. So when we saw it changed ownership and they had a livingsocial deal out we had to try it.  We liked the original so much we wanted to see how much they lived up to the old name. Turns out that they kept a lot of the original staff and some menu items. The pepper was still on there but we didn't get it this time around.  We got a stuffed risotto ball for appetizers which were OK.  They could of been a little bit better.  I got the Bolognese and Bonson got the Chirizo pasta.  Both were really good. All their pasta is fresh from Ohio City Pasta which was awesome that they are supporting local businesses.    When we sat down it took a moment or two to get our server over to us. Then when she did finally come over she kinda was spacey in a way. Sort of like Luna Lovegood from Harry Potter but not as smart..... In a Luna Lovegood way.  She said that the bread would be over in a moment and that she was going to give us a moment to look over our menus. Well mind you it was not busy there yet at all. We went a little early so the dinner rush hadn't started yet.  The bread took about 5 minutes to come to our table. When they dropped it off they didn't tell us what the butter was at all. It was good but the way I found out what it was was by hearing it being explained to another table,  Then we sat there waiting for our server to come over and take our order.  Which she wasn't to busy to take it unless you want to say she was because she was flirting with the kitchen staff..... After she took our order everything came out pretty fast and smoothly.  Like I said everything was really good. Bonson ended up ordering dessert which was a Mint Creme Brulee. All desserts are made in house except the ice cream which is from Mitchells another local business. :)    The Hostess was also amazing. Very upbeat and happy and also willing to answer any and all questions. She made a very good first and last impression. So Saucy food is still amazing and good service is a hit or miss. Just try and not get a Luna. :) This place would for sure get 4 stars if the service improved just a little bit more."}
{"text":"My wife and I had dinner Saturday Night we ate here before and was very pleased.  Well I guess their are new owners and its not the same place.  Our server was terrible she didn't know the menu, she forgot our drinks twice, never received our salads, dinner came and the steaks were over cooked and tough.  Told her how terrible and all she said is sorry the only thing we got fast was our check.  No one cares at this place and I will not return and warn everyone."}
{"text":"I had heard some good reviews about the spot and it's super close to home.  When I saw Yelp had a deal, I figured \"why not give it a shot?\"  Upon entering the restaurant, there was no hostess to be seen, so we wandered into the bar area which has multiple tv screens, but no open spots at the bar.  There was a staircase leading down and we could hear music, but were unsure if it was a private party, so we went back to hover near the hostess stand.  When a woman appeared we mentioned we had never been there and she asked if we needed a table.  After the initial confusion, we were seated in the dining room which was where the Rock/Blues band was setting up.  A male approached our table with 2 waters while the hostess cleaned the table off.  Menus were handed to us and we checked out the drink menu.  I ordered a glass of Zinfindel and my hubs ordered Tito's Dirty which specified a garnish of blue-cheese stuffed olives (one of his faves).  Drinks appeared rather quickly, but the martini was dropped off sans any type of olives.  Hubs asked, \"Where are the olives?\" and our waiter (never introduced himself, but was the water guy) said he would be right back.  When the waiter appeared shortly thereafter, the olives he presented were plain green olives.  I mentioned that the menu stated the drink came with blue cheese stuffed olives, he apologized and brought back 3 of the blue-cheese stuffed olives.  We all make mistakes...  We wanted to try an appetizer, so we decided on arancini.  It did arrive to our table quickly and was plated nicely, but there were 3 huge balls and not very much sauce.  The arancini were topped with spinach, red onions, shaved parmesan and very little marinara.  While the arancini were warm, they were not hot and the cheese was only at the center of the ball, making for a dry texture.  This arancini definitely would have benefited from more marinara sauce and a cheesier filling.  Round 2 drinks were ordered and my husband asked for a Sidecar (listed on their drink menu) and I asked for Chocolate Cake martini (also listed on their drink menu).  Our waiter had a hard time understanding so we pointed to the drinks listed on the menu.  He nodded, left our table and returned shortly to ask again what my husband wanted.  Not too sure why this was so confusing.  When the drinks arrived, the Chocolate Cake martini was creamy.  This was odd since the menu specifically stated it was \"classic style made with clear liquors\".  I pointed this out to the waiter and asked if the martini was really Chocolate Cake.  He read the menu description and left the table with menu in one hand and my martini in the other.  He returned with a new drink and apologized, explaining he had accidentally ordered the drink as a Chocolate martini.    I am not impressed with this venue, but the Rock/Blues band was good.  We didn't get up and dance, but there were plenty of 50 (and up) dancers shaking their booties out on the floor.  I'd be willing to try this place out again when the patio is open."}
{"text":"It is no surprise why the restaurant is never crowded.. Surf and turf old school. No local sourcing of food."}
{"text":"Went on a Monday night. There was one other table there. Space is nice. We were seated quickly. Got the arancia stuffed balls and a caesar salad which were both good. Ordered the sirloin for entree medium rare. The steak came out drenched in a nasty sweet sauce. The outside was burned to a crisp and the inside was raw meat. Threw half of the plate away. Not worth the price for the worst steak I've ever had."}
{"text":"As we pulled into the parking lot we came to the realization that we had been here before. It was seven or eight years ago and the name was Saucy Bistro. We had completely forgotten about our experience. Couldn't even remember what we had eaten or if the service was any good. Apparently it wasn't that memorable and, while we had yet to realize it, deja vu was about to set it.  Like hundreds of others (and just about everyone the was dining there during our visit) we were lured in by the Groupon - $35 for dinner for two. Not a bad deal. An arancini appetizer, two salads and two entrees. Sure, there are some restrictions, but aren't there always? You can't choose the app and the entrees are price-capped at $24.  Our dining experience started about 6pm on a Thursday. We walked in and that's when it hit me. The overwhelming smell of either air freshener or scented candles. Not good. The only thing I should be able to smell in a restaurant is the food. Isn't this restaurants 101? We stood there in the empty lobby staring at the empty host stand. Straight back there's a bar. What looks like a dessert case is filled with bottles of wine. Eventually, someone wanders up and takes us back to our table in the main dining room.  The kitchen is open to the dining room which I thought was a nice touch. A long banquette to the left, a few large round tables and some two-tops scattered about. There's a back dining area that I think features even more seating but given the sparse crowd I don't think it would be used that evening. The atmosphere was one of a wedding reception or the lido deck of a cruise ship. We were the youngest patrons in the restaurant by at least 25 years. Even the decorations on the wall featured old people. This must be where the Westlake retirement community holds their bridge meetings. Unless you have your AARP card and are prepared to complain about at least two food-related items you may feel out of place.  Our server, his words dripping with a noticeable Eastern European accent, was OK. Not great, not horrible. Fitting for this place. When I informed him that we had a Groupon he actually put a piece of paper and a pen in front of me and said, \"You just write the number for me, OK?\" Seriously? Now I have to write things down for you? I was a bit annoyed by this. Anyway, let's move on. Overall, he was pretty attentive. Water glasses were always refilled and he checked back after each course. He did, however, neglect to bring our table a bread basket. Probably for the better. Saved me a few hundred empty calories.  The food, in a word, benign. Clearly catering to a generation that loathes seasoning and hot food, nearly every dish we were served lacked salt and arrived at the table just north of lukewarm. Here are the details:  Arancini - A pair of golden brown spheres, filled with rice, mozzarella cheese, and red onions atop a bed of marinara sauce and wilted spinach. While not the best we've had they would be the highlight of the meal.  Arugula salad - Arugula, pecans, goat cheese and three pair slices dressed in balsamic vinaigrette. The greens were fresh and dressed well but the salad lacked sweetness to balance the bite of the cheese and dressing.  Bittaker Salad - Mixed greens, tiny bits of cauliflower, bacon, goat cheese and what was called Bittaker dressing. I wasn't a big fan of this one. I couldn't really taste the bacon (again, itty bitty pieces) and the dressing, way too much for the salad, was cloying and sticky.  Beef Short Ribs - Not a bad rendition of the classic comfort food. The beef, cooked in a tomato demi, was OK, albeit a little chewy at times. I expect short ribs to be melt in my mouth tender and these were not. My wife rather enjoyed the cauliflower, calling it a welcome reprieve from the typical mashed potatoes.  Seared Duck Breast - I hadn't had duck in awhile so I was looking forward to this. Warm arugula walnut salad topped with a dollop of what tasted like mascarpone, oyster mushroom risotto and roasted rep pepper coulis. The meat was cooked to the requested medium but I found the fat to be a tad rubbery. Possibly the result of a pan that was too hot. The walnuts added some great texture to the slightly mushy rice and I rather enjoyed the red pepper sauce. Not bad just not mind-blowingly good.  What can I say that would provide a succinct and justifiable summary for our SB Eightyone experience other than it was pretty good. Middle-of-the-road in just about every way, it felt like what would happen if you asked a 70 year-old restaurateur who had been out of the game for awhile to design a hip dining experience. A bit of a culinary anachronism. The Groupon helped to cushion the blow a bit. Without it our bill would have been $85 without tip (including two glasses of their cheapest wine). Maybe we'll come back in another seven years once we've forgotten about this visit."}
{"text":"Nice place.  Very good service, reasonable drink prices.  The bloodymary was 3.5 out of five stars.    Saw a comedy show here, great room in the basement for a show.  This is definitely where grownups  from  Westlake, Rocky River,  and Bay Village go to party. When I say grownup, that means they are older than me : ) For grownup, very, very white people they seemed to know how to party.  A few people were quite soused,  I would have been soused myself except that would mean a 40+ minute drive through the battle grounds of the west side.  I still had fun, met a few new people, danced, and made it to West 25th for some less grown up fun. Oh yeah and oddly there were a few east side peeps here as well.  It was nice meeting you!  Will I be back,? Maybe, 40 minutes is a long drive.  Oh yeah there were not too many TV's here, I liked that!"}
{"text":"I have dined here three times as part of a large group (~20 people) in one of the reserved rooms and have never been too impressed by the experience. I preface my review with this statement because maybe the kitchen is able to deal with small parties better than large ones, I do not know. The wait staff was quick to get water and bread on the table, wine in our glasses, and refill the glasses and baskets when empty. They had to walk around with their order forms to determine who got steak knives which I felt was unprofessional. The food came out quickly. The salads were fine. The entrees were kind of a disaster. My brother had several large clumps of stuck together papperdelle noodles in his fresh pasta dish. Three steak dishes were ordered, and none of them were cooked as requested. I do not think it is fair to charge $20+ for meals that so clearly miss the mark."}
{"text":"So I dropped a star because I feel like they changed the service, menu, and pricing.  The waitress we had was very professional it was almost too much. She could have been a little faster too, but I think she thought we wanted to relax, which was not the case, we were starving.   I mean you can't deny the food is just out of this world amazing but you pay for it. I had a Living Social, and before that for 3 beers, an appetizer, and two entrees, it was about $80.   So this is still a fancy date place. I'd prefer the waitress I had last year who was super cool and down to earth with tattoos and a buzz cut any day though. I do feel like the prices were raised. I think the menu changed a little bit but thank god they kept the fillet. It's the best.   The cool thing I did not know about SB is the downstairs bar area. I'll def be back to check that out soon!"}
{"text":"The Saucy Bistro recently relaunched itself as SB Eighty One, a fact of which we were not aware when we made dinner reservations there. What used to be a classic French restaurant has modernized into something harder to describe: nouvelle Italian cuisine meets bar food?   This is not necessarily a bad thing. The food was actually very good. The four of us started with three appetizers. The calamari with sundried tomatoes was perfectly cooked, with tender calamari and the tomatoes adding a bright snap to the classic. The duck confit bruschetta was more like shredded duck on toast, but also very tasty, and the Tuna Napoleon was brilliant, with thin slices of tuna on equally thin wontons. Our only regret was that we only got one slice each.  After the appetizers, though, the menu gets a bit confusing. The categories to choose from are a limited number of entrees, and then pastas, pizzas, and burgers. See what I mean about the French influence getting lost? Two of our party chose pastas. The Bolognese was pronounced the best ever, but the Chorizo was not a hit. The Filet Mignon was done beautifully.   Being rather full from the appetizers, I settled on the warm mushroom salad with grilled salmon. Honestly, I think I had the best meal of the evening. The salad was a delicious mixture of sauteed mushrooms and beautiful greens, and the salmon was cooked perfectly. (Note that I asked for the salmon rare and it came on the slightly past medium side, but was still moist. I do find one of the challenges in Cleveland is convincing chefs that fish does not have to be cooked to dry leather.)  The cocktails we had before dinner were delicious and interesting, and the wine selection is decent. The decor has been toned down to be a bit less French Rustic, but the tables are still decently spaced from each other and the ambiance still romantic. On the whole, I would say that this relaunch is successful. SB Eighty One is a good, if not particularly remarkable, place for a cozy date."}
{"text":"I went to SB Eighty One with my gal to see a magician and taste the food.  The ambiance was delightful, small, cozy, warm, and romantic.  The food was alright.  We shared the Tuna Napoleon appetizer which was fantastic.  Seared Tuna, sesame toasted crust with fried wonton and wasabi oils....man oh man. That was tasty.  My girl had Arugula salad, which was good, but definitely not a dinner sized portion.  I had the blackened group sandwich...great seasoning but the bread and bun was overwhelming. Overall it was a great ambience, good to see the magician and try something new but the food was short of something magical."}
{"text":"I just don't get it. I see ducks everywhere - lake Erie, local ponds, and yet you go to a restaurant like this to have one, and they charge you a murder. I actually started to wonder if they would give me the discount, if I already arrive with a killed duck ready for the roast.  Anyway duck here ( I am slowly becoming a duck specialist) was rather good - juicy, not overcooked, and even zesty. But I'll be damned to show up here without a groupon and pay $24 for 4 slices of rather common bird. Everything else was just ok. I still have no idea what was that Arancini appetizer ( rice balls with onions?) and if the huge dance floor is ever holding large dancing parties.  In general I was thinking all of their entrees should cost exactly $10 less for what they are. And the menu should include the detailed description and miniature map of hunting places for ducks. Just saying."}
{"text":"The food was very good - had the mussels (appetizers) and the arugula salad. Be forewarned that the Yelp coupon is only for 1 coupon per table. Four of us out of our  group of six had brought a Yelp coupon because it said 1 per person. The owner was very gracious and accomodated us, but doing 1 per person is a hard hit on a restaurant. We'll go back this summer to try out the patio. Also, an FYI, the happy hour prices are only in the bar area....and seems not to apply to wine & beer."}
{"text":"I found this place to be forgettable, and here's why: we only went a few months ago, and I barely remember the food. I do remember that we kind of got screwed with our Groupon, and couldn't order from the quantity of menu options we thought we would be able to, and that the food did NOT live up to the hype.  I also remember live music and dancing, and sitting outside on the lovely patio, which is why I can't drop my review lower than a 3. It was such a nice atmosphere for dancing and conversing with friends. Not so much for eating food."}
{"text":"Average at best. Ignored all the reviews and decided to give it a shot. The food was decent. The muscles appetizer was good as was the Tiger Shrimp pasta. The main problem was the disinterested staff. No one really cared. The dining room set up left something to be desired as well. We sat at a small table facing the kitchen and the kitchen staff who looked like they were bothered at any request. Take it from someone who took a shot, try it if you have a coupon, but don't get your hopes up."}
{"text":"I really cannot recommend this restaurant. For starters we went with a groupon that included entrees up to $24 each. We asked about the $29 filet and they said they could not include that. Fine, not a big deal. I wanted a $25 dish and they said they would oblige but it would be a $5 charge instead of $1. Whatever . . .  So we order drinks and my girlfriend's mojito arrives without sugar in it. It was disgusting. We ask the waiter to get a beer instead. When he takes it back to the bar the bartender says \"some people like them sweeter than others\".  Our appetizer comes out, some deep fried risotto balls. Less than stellar but not horrible just very dry. Salads come out with a remarkable amount of cheese on them. Our dishes come out and I will say the duck was pretty good. The sirloin, ordered medium, came out charred and nearly well done. We didn't see our waiter for 10 minutes before we could say something. We ended up skipping on dessert and took another order of duck home to replace the sirloin.  Our waiter was quite nice but not very attentive. This place just seems to not care about the details and expects to be viewed as a high class restaurant just because of the prices. I was not impressed and will not be returning!"}
{"text":"My guy and I went here because we had a groupon. The deal was for the Arancini appetizer, two salads and two entrees.   Initially, the place was pretty empty. There were three other parties there and the waitress sat us right in between two of them at a table that was really close to the two next to it. Couldn't help but listen to the other conversations over dinner, kind of distracting. There were plenty of other tables that might have been better for a party of two.   The Arancini appetizer was OK. It wasn't bad, but nothing special. It was basically a rice ball with cheese in the middle fried with pasta red sauce on top.   Second course, salads. We were able to pick off the menu. We both chose the arugula salad. Again, not bad, nothing super special though. The goat cheese on it was the best part. About this time, the waitress brought us some bread with butter with maybe with a hint of Italian seasoning in it. Bread was good.  Then we got our entrees and the whole dinner went downhill. I got the sirloin. He got the pepper strip steak. Pepper strip steak was  better than the sirloin, but not good. It was overlooked and the whole plate was covered in butter from the carrots that came with it. My sirloin was terrible.  Rubbery, overlooked, no seasoning. Not too much else to say about that. Really, if we wanted steaks, we could have gone to Applebee's and gotten better ones for cheaper. Probably wont be going back to this restaurant any time soon."}
{"text":"The after \"love to eat turkey\" place to come during the holiday weekend.  Meeting friends here for the Thanksgiving weekend rounds.  I made my rsvp for table of 6 on opentable.com.  Worked like a charm.  The outside is nice with a classy look.  The restaurant looks like it is part of any office building so if you don't see the sign you may miss it.  We started at the bar.  Every bar stool was filled with some hightop tables.  It wasn't a problem since we were being seated right away.  We ordered drinks and Calamari.  Calamari was prepared well with a sweet and tangy twist to it.  I ordered Tilapia, my wife ordered the surf and turf burger, had turtle cheesecake for dessert.  Everything was very good, cooked to perfection, and high end restaurant worthy.  Service was great but our entrees came out slow.  It took almost an hour for it to come out.  If we weren't all talking and catching up someone may have complained about it.  If I noticed, I'm sure others in our party did.   They have a lounge/niteclub on the lower level.  There was a strange smell that everyone in our party mentioned.  It smelled like sewer gases or something like that.  The live entertainment was good.  The atmosphere was great except for that smell.  One thing that I was annoyed a little by was that the server lost my credit card when cashing out my tab.  We found it on the floor after a couple minutes.  It wasn't a big deal but if they would have lost my credit card it would have turned me off enough to not come back or give negative reviews of the place.  I know this place is newer and going through some growing pains but if it doesn't address some basic issues it may crash before it launches.  I would definitely come back again for dinner and drinks."}
{"text":"The food was not fresh. Everything was grocery store bought and NOT homemade. This is supposed to be an Italian style place but should be very shamed. 1) The sause was definitely Ragu brand. For real, RAGU from the grocery store.  2) Their cheese platter app was served with Club brand crackers.  For real, CLUB from the grocery store. And cheese that tasted and looked like the pre-cut KRAFT cheese packaged from the grocery store. The grapes were wilted, also.  3) The shrimp app had a fishy taste. Tell me, have you ever tasted 'fishy' shrimp? If you ever had this disgusting pleasure, you would know it's either way too old or they improperly dethawed a frozen bag of shrimp. Yes, frozen old bulk bag of shrimp probably  bought at a Save-A-Lot.  4) Arancini was mushy and flavorless. I'm guessing bought in a giant size frozen bag at GFS.  5) I've honestly and literally had better pizza at my elementary school lunchtime and/or Chucky Chesse's.  And the list continues...  6) I went for a birthday party, in which they seriously sat us directly next to the band's speakers so we all couldn't hold ANY type of conversation.  There was no type of apppointed service yet any signs of organization.  When I tried to inquire about a glass of water to the the unhappy, mini skirt wearing 45-50 yr old female bartender who brought out apps, I was warmly snapped at with, \"We only have plastic cups and you have to get it at the bar yourself.\"  I do have to comment on the strong urinal smell confirmed by multiple guests so I wasn't thinking crazy when seated in the basement.  7) Positively, the live cover band was actually good.  I have to laugh at how my post is so brutely honest, but the owners should really be sad and cry about how God aweful they are portraying their family name.  I don't like to write negatively about restaurants, unless it's exceptionally unprofessional as this place. I'm just trying to save the hard working common citizens their time and money.   The only thing I can say that was good was that I didn't pay a cent of this overly priced crap! Poop on a plate. Maybe they are friends with Marc's or Giant Eagle?"}
