{"text":"Came here last month for a schnitzel which by the way, was phenomenal, and saw the Bratwurst option on their old menu. Although not a menu item, the owner ordered in a dish worth for my next visit (today). I wish now that I were a more eloquent person for the words that would be needed to describe such a succulent dish are beyond my capabilities. The flavor in every element of the meal, from the potato salad to the sauerkraut to the sausages themselves are incredibly unique yet complementary in such a way as to make you wonder how you got by with other variants before.

I would definitely come here again. If you get the opportunity, schedule the bratwurst a week in advance, it's worth the wait. The only shame is that normal sausages are going to seem so bland and pointless now."}
{"text":"Best schnitzel place in Toronto. Friendly service- cheap price. They're loosing the location moving out on Dec 31st."}
{"text":"Reviewed Dish: Schnitzel King & Schnitzel Queen

Reviewed during: Fri Lunch time
Service Speed: 3 / 5
Cooking speed: 3 / 5
Food Quality: 5 / 5
Food Quantity: 5 / 5
Price: 4 / 5 
Cleanness: 4 / 5 
Repeat: Yes

Most places inside St. Lawrence Market had a long lineup, so we decided to head to Schnitzel Queen and give it a try. Upon arrival, there's a long lineup, apparently someone ordered a takeout of 5 orders, and another 6 people inside are waiting for their food. But once those orders are fullfilled, we got our food at a decent speed.

The food arrived --- and it's massive! It could be a kid's Breakfast, Lunch, Dinner and midnight snack!
But most importantly, the meal tasted much better than California Sandwich (Both Claremont and Yonge location) and Uno Mustachio in St. Lawrence Market."}
{"text":"\"Uncle! Uncle!\" I whimpered, bidding surrender to the behemoth schnitzel dinner before me. Smothered in bacon, fried onions and mushroom sauce, this gargantuan pancake of deep fried goodness seemed to look back at me and bellow a hearty German guffaw.

Stranded castaways would surely fast after a meal here."}
{"text":"My pregnant girlfriend is in the hosiptal most likely giving birth today, her only request through the whole process today was schnitzel queen.  Her favourite thing is the carrot celery soup. And this gives me an excuse to pick up the oh so delicious A La Bernard. If this isnt compelling enough to make this place a regular pit stop for food, i dont know what would."}
{"text":"Voondah bah, very good service and very delicious schnitzels. Love this place! Very fresh too, made them on the spot not frozen, nice touch I must say."}
{"text":"It's like eating in your mom's kitchen. Tasty, portion size is huge & prices are very reasonable. Get lucky & snag a seat--otherwise, get it to go. So worth it. Everything is great!"}
{"text":"Perfect spot for a quick sandwich. Delightful owners, delicious schnitzel. Simple, good food."}
{"text":"JUST tried the chicken schnitzel with mushroom sauce. It is one of the best meals i have *ever* had. Crunchy coating, tender insides, balanced mushroom sauce. I was in lunchtime heaven!"}
{"text":"My boyfriend and I go there often for lunch.  Its always crowded because who can resist the smell as they past by! My boyfriend always gets a Queen Sandwich, he loves the idea of potato salad and schnitzel in one sandwich.  I always leave full and with leftovers. Its a good things these meals last me for days as they have short hours and are not open on the weekend.  The inside is small and has a fridge covered in family photos.  The place is a family business, and exactly the kind of business Toronto needs."}
{"text":"My son took me to the Queen. I was a little leery given the area, but so glad I gave it a chance! Contrary to what other Yelpers have noted, Karl and his staff were very cheerful and attentive. They made a particular fuss over an elderly diner, and carefully helped him choose a meal. I had the Queen and another in my group had the King - whoa! We only managed half, so my teen scored some great leftovers. Next time I would probably skip the sandwich and have the plate. Awesome."}
{"text":"Finally got the opportunity today to try out this place and it was Absolutely Amazing! I went with my Boyfriend and we ordered one Schnitzel King sandwich which comes with sautéed onions, melted kraft cheese, romaine lettuce, and bacon for $10. After chatting with the owner (I believe his name is Carl) for a few minutes while telling him this was our first time he asked if we wanted a soup on the house which we welcomed happily. Then soon after he asked if we wanted potato salad and by this time I felt like we had hit the jackpot. In the end we left with one humongous schnitzel that could be shared amongst 2 people and two sides for both me and my bf. 

The first thing I tried was the potato salad and let me tell you the potato salad was delicious with chunks of creamy potato and crunchy bits of onions and pickles. The schnitzel was painfully delicious as well. The schnitzel was thin and had the right amount of meat and breading. It was not salty or oily like some of the schnitzels that I have tried it was just simply delectable. The celery and carrot soup was definitely delicious as well. All in all. My boyfriend and I will definitely be going back soon! The owner is a super friendly guy and you can tell he loves what he does. The only bad things I can say about this place is that they are closed on the weekends!"}
{"text":"These sandwiches are like cigarettes. 
You know if you continue to have them, it'll kill you....but damn, it's hard to quit.

I think I'll go home and take a nap. The perfect thing to do after eating my weeks allottment of calories and fat in 1 awesome sandwich. 
Good thing St. Mikes down the street has a great cardiology dept."}
{"text":"The 'queen' on queen is awesome.  The schnitzel and mushroom sauce is a feast...the soups are delicious and the potato salad is tasty.  The new expanded seating is great, a big improvement over the other spot they were in.  Good job!"}
{"text":"I write this in the midst of a food coma.  Food was excellent and worth the visit.   

Had the gourmet schnitzel with the fixings."}
{"text":"I'm sitting at my desk writing this review because I need some thing to keep me from napping.  

I opted for the 'plate' which, in hindsight, was silly because I'm not even hungover.  It was incredible.   It was an enormous piece of perfectly fried , not greasy in the least, schnitzel with just the right amount of mushroom sauce, roasted onions and bacon with a generous helping of potato salad.  $10?  it's crazy.  Especially considering that I have half of my meal in a take out box.  

I ate at the counter with two friends and there was a constant stream of people coming in and happily waiting in the tiniest little area.   The owners are adorable.  I would have liked it to be less busy so that I could have chatted with them.  As it was, they were zipping back and forth cranking out the orders. 

go.  go now.   go often."}
{"text":"OK - let me start by saying that this is the first restaurant I've visited as a result of reading Yelp reviews. And oh my, I cannot believe in my three years of living in Toronto, I'd not even heard of this place let alone checked it out. 

But then, maybe it's a good thing after all, because had I known of this place, I can't even fathom how many hard earned pennies would have been spent on meals here!

Schnitzel Queen is essentially a tiny hole-in-the-wall shop on Queen East at Sherbourne, not one of the more glamorous foodie locales. Quite literally, it has four stool seats along a counter, and a tiny kitchen probably the same size as the one in my 500 sq. ft. condo . How the owners, a charming European couple barking directions and orders at one another, manage to churn out such delicious meals in such a tiny space is beyond me.

The food. Honestly, I have never had such delicious schnitzel in my life. Not in Berlin, not in Vienna, and certainly not in Toronto. It is so tender, so succulent and so large, I don't know if I will be able to have schnitzel elsewhere again. But truly, it is how you order it that is impressive. 

I opted for the King sandwich. What I was served in under ten minutes was a massive cut of schnitzel, lettuce, perfectly caramelized onions (as one who is generally not an onion fan, do not order sans onion!), sauerkraut, bacon, mayonnaise and processed cheese. Yes, I realize some may prefer non processed cheese, but trust me when I say the flavor somehow compliments the rest of the meal. All served between two slices of fluffy, fresh white German rye bread. Perfection. This sandwich quite literally was the size of a large dinner plate!

The potato salad, which I ordered simply due to other's recommendations, was divine. I admit to being fickle with potato salad, but it was not saturated in dressing, and the potatoes were cooked to just the right point; a mere one or two minutes more and you'd have mashed potatoes. Needless to say, it was the perfect side, though probably not necessary on account of the sheer size of my schnitzel sandwich!

Places like this remind me why I prefer to prefer stick to food on the lower end of the price range. In choosing to eat at the counter, I almost felt like I was in the couple's home in Germany, with a home cooked meal in front of me. All for under $15, including tip and tax (which, in true European fashion, is baked into the prices you see on the menu boards!).

To think, if I'd opted for a simple schnitzel sandwich and drink, I'd have paid around $7 - just think of the cost of street meat nowadays, or a combo at any one of the fast food restaurants in this city. It's unbeatable. 

For the record, I could only finish half my sandwich along with the potato salad. But truly, I'd never felt more excited for dinner leftovers in my life."}
{"text":"I was really excited to try this place then really disappointed. There was barely any meat, lots of bread and even more mayo. The only reason it got an extra star is because I love schnitzel."}
{"text":"I still dream of Schnitzel Queen's potato salad, which is so much more delicious than your standard mayonnaise and boiled potatoes...the Vienna Schnitzel dinner (regular pork schnitzel served with a slice of lemon, side of sauerkraut and potato salad). The portions were massive and the schnitzel was about the same size as the ones they served at Onkle Ottos in Stuttgart. In fact, eating Queen Schnitzel reminds me of Germany. It's authentic and above all, delicious! I would definitely not recommend going here unless you're going on an empty stomach. 

Since going to this place, I've been recommending it to anyone who loves schnitzel. Where else can you get an affordable meal that actually fills you up for $10?

So much food...so little stomach room...must go here again soon."}
{"text":"This place never disappoints. Food is fantastic and the staff are friendly. The Queen Schnitzel Dinner is just amazing. If you've never had one, you have to give this a try next time your in the area..."}
{"text":"Best Schnitzel in town! And now that they moved to the new location it's easier to get a seat and enjoy the great selection in house. It's always a huge portion that fills up a hungry appetite. Always freshly made from good quality ingredients. Try the potato salad. Highly recommend. 
Carl the owner and the friendly stuff will make it feel like home. 
Enjoy
;)"}
{"text":"So tasty!

Everybody working here is super friendly. We got in and took a seat as we were waiting for one more, the guy comes over and asks if he can bring us a drink while we wait. Our friend was late so the cook comes over and asks what we're thinking of ordering since they're starting to run out of some things (this was an hour before closing), we give our orders and heard them calculating what they have left, including our yet to arrive friend in the calculations, which I found super considerate of them. 

Most people seem to be getting takeout from here so every time I've been here it's been busy but there's been a few free tables. But let's get to the food! The potato salad and sauerkraut are so good! It's shameful how many places can't manage a tasty potato salad in this city. Both the chicken and pork are good options, I tend to prefer the former. The portions are BIG - one sandwich is enough for dinner and lunch the next day for me. Taxes are included in the prices."}
{"text":"This tiny little lunch counter specializing in schnitzel is über-German; kitschy Oktoberfesty German, not disaffected Sprockets German. Five of us went for lunch today and squeezed ourselves onto the four stools while a steady stream of take-out customers filled up the remaining space, no doubt shooting us dirty looks for infiltrating their secret lunch cove and slowing down their orders.

Bavarian husband Bernard was manning the stoves while Polish wife Teresa plated and served. I had the day's sandwich special: the Bayern, a Bavarian-style schnitzel with sauerkraut and cheese for $6.99. The default meat is pork but you can request chicken or veal for a buck extra.

Holy scheisse! This schnit is kolossal[1]! Like the size of my mousepad huge. Bernard, of the thick German accent and imaginary lederhosen, fries each one to order so it arrives piping hot and oozing with mild yellow cheese and melt-in-your-mouth sauerkraut. The entire thing is encased in thick German bread flecked with caraway seeds and finished off with mayo, lettuce and tomato. It is freaking delicious.[2] Alas, the Teutonic portion was too big for my wee Asiatic belly and I took the remaining half home, essentially getting two meals for $7.

The downside of this place is that they're only open weekdays 11-5 or so, and the neighborhood is sketchy but Bernard keeps a baseball bat in the kitchen. Presumably to chase off unsavory characters? Either that or he uses it to pound the schnitzel extra thin.

Bottom line: This place is wunderbar. Just be aware that if you eat in, you will smell like schnitzel when you leave.

[1] No, that is not a typo, smart-ass. That's how you say \"huge\" in German.
[2] I just looked up how to say \"delicious\" in German and it's \"schmackhafte\" which just confirms for me that German is a hilarious language."}
{"text":"Best schnitzel (milanesa in Argentina) I've ever had. 

I'd go to Toronto just to stop by here!"}
{"text":"Schnitzel Queen is the best! Discovered this last year when I was walking around the neighborhood + through Yelp reviews. Bernard and Teresa were the owners when I tried it and they make a mean schnitzel. I always get the dinner and that is enough to get me through the whole day without eating. Then the restaurant changed owners. I can't remember the name of the new guy who runs the place. When I first met him, he told me that he's a massage therapist who went on to be a restauranteur. I was thinking \"great! he might mess up this slice of schnitzel heaven!\" But I was wrong! Lo and behold his magic fingers that did wonders at the massage table are now doing stupendous wonders in the schnitzel kitchen! The quality of the schnitzel DID NOT suffer. Still great and as tasty as ever! Soooo happy ;) And his dose of youth is actually a breath of fresh air. Now Schnitzel Queen is open longer (used to close at 3PM but now they close at 7 or 7:30PM) and they now have a vegetarian option and do delivery! WOW! He made this awesome place awesome-er (grammar nuts are stabbing me now). Kudos to the new owner for rising to the occasion. I still see Teresa most of the time so I still feel like it hasn't changed that much, which is good. Cash only and when you walk in, you smell like schnitzel when you walk out due to the cramp space and inadequate ventilation. But hey, I'd rather smell like awesome schnitzel than curry or B.O.! LOL"}
{"text":"Went there on a thurday evening. Arrived at 6:30pm and ordered our meals, was told that the potato salad was sold out, we took the discount instead of doubling the other side. 

As we walked out at 7:30pm, we were surprised that they actually close at 7pm. The server didnt kick us out or notify us that they close at 7pm!!! They were happy that we enjoyed our meals as we walked out.

With such good food and great service, this worthy first 5star review."}
{"text":"It was afternoon on a Friday and me and my roommate were looking for a place to eat lunch. He suggested Schnitzel Queen and I was like yea lets go. I had heard about the place and people were raving about it. They are open from 11- 5pm on weekdays (Mon-Thurs) Fri- 11-4 pm and weekends they are closed. So its a bit difficult to make it to the place during normal working hours. Its located few blocks from Yonge and Queen in the Moss Park area. The neighborhood in itself is good with close proximity to mainstream Yonge St. The hours of operation is something everyone is concerned about for this place, but in my opinion its a very authentic family run place where there are only two people managing and running the place. Much Respect to them! 

The moment I walked in, i was surprised by the 4 seats of which two are high stools and two are medium stools in a bar seating like setup. The first thing we were told is that there is only 1 chicken and 1 pork left. Right there, I knew I had come to a place where the food is fresher than other restaurants. Its a German couple that runs the joint and the wife runs the show outside and the husband runs the show in the kitchen and makes the food. As we were seated and waiting for the sandwiches (I ordered the Big Chicken Schnitzel Sandwich) we were given one bowl of Potato Salad that they are famous for. The lady went in to get the salad from a bowl she had prepared in the morning. To attest that, the guy sitting next to us said, the potato salad is the best and its made fresh everyday. He definitely looked like a regular at the place as the lady knew how he wanted his food without him telling her. I tasted the potato salad and thought to myself, where have I been all this time without knowing there is this place in Queen St East that makes this kind of potato salad. I was blown away, and I thought of cancelling my sandwich and just eating a huge bowl of potato salad. As I was gobbling down the salad, the sandwich came. My friend ordered the King Schnitzel and I was looking at my Big Chicken Schnitzel. My first reaction was, why are there so much tomato pieces hanging out of the sandwich. Then I had a bite of the sandwich. It was as if someone had gotten into my mind and found out how to perfect the chicken in a way that I am blown away. I had found the place in Toronto where the chicken is cooked perfectly to my taste. It is not unevenly cooked where the middle is thicker than the sides etc. Its just perfect! I couldnt finish the sandwich and had to take one slice of the sandwich home. Overall, I ordered the sandwich and a coke and it came out to $8. Plus, unless you're starving for the entire day and eating this, you wont be able to finish this sandwich in one sitting easily. Finally, I would say my reaction to Schnitzel Queen would be- awesome sandwiches, amazing owners running the place who care about their food, very friendly and the potato salad is to die for."}
{"text":"Recently discovered this little gift and have been a regular ever since!  Fantastic, fresh, delish.  Don't wait, run there now!"}
{"text":"Solid 3.5

The portions are huge, the food tasty, prices low, and the owner is friendly. If you have a big appetite for some schnitzel and you are in the area, come here. 
Be aware that the location is small and there are a few stools to seat and eat at. 
This place will always have business, he has a loyal customer base and the competition is slim in the area."}
{"text":"The only reason you would come here is to get an amazing schnitzel. Please ignore the cramped quarters (um, 4 seats?) and warehouse vibe. There is only one goal in sight: pick up the BLT (and in my case, the Bayern to share). Both sandwiches were delicious: fresh, HUGE, and tasty. I can feel the fat enveloping my arteries but I will justify this by going on a sashimi and green tea diet all next week. 

My favorite amongst the two is the BLT (something comforting with the combo) but the Bayern (cheese was so melty!) is delicious as well. The meat was moist inside, crunchy outside, and about the size of both my hands! 

I must return - to try the Cordon Bleu! 

P/S: Thanks to Mike S for the awesome picture that convinced to come to this part of town! And yes, because I can't do better ... I didn't take the picture of the BLT. Just look at Mike's."}
{"text":"The schnitzel is amazing, get the full meal with the mushroom gravy. The best. Warm friendly service"}
{"text":"Great food. What ever you do don't eat there because you'll end up smelling like food until you shower again."}
{"text":"Tragically my office has moved away from the Schnitzel Queen and I can no longer enjoy their amazing sandwiches.

It's some of the best schnitzel I've ever had!"}
{"text":"Wow...the largest schnitzel but so tender and tasty. Complemented by great potato salad....Great value!"}
{"text":"I was in town from the US for a show at the Convention Centre, and heard this place was great. Drove over for lunch. Got the King w/ chicken. Went to pay, only to find their machine wouldn't take my US debit card, nor ANY credit cards, and I had $1 USD on me. I was about to walk away, when the guy behind the counter handed me the sandwich and told me to have a nice day! 

The verdict: one of the best sandwiches I've ever eaten. Soft bread, a beautiful schnitzel cutlet, topped with lettuce, bacon, carmelized onions, cheese, mayo and sauerkraut. Only issue was I ate it in the car in the Convention Centre parking garage and needed WAY more than the two napkins I got to contain the deliciousness. 

Highly recommended!"}
{"text":"I just LOVED everything about this place.  
Giant crispy Schnitzel, potato salad, sauerkraut.  Friendly accommodating service.  Very quaint and charming 'atmosphere'.  So nice to go to a place without pretension that is clearly cared for by real people enjoying what they do.
I wish I lived nearby so I could go when I'm hungover or simply in the mood for good, cheap honest food and friendly people."}
{"text":"I love everything about this place.  The owners are adorable - you basically wish they were your parents they are so adorable!  No pretensions, you really are sitting in someones little kitchen at the counter.  Food portions are enormous, love the schnitzel - and the sauerkraut is warm and delicious (i ate two portions).  Prefer the dinners to the sandwiches as the bread just gets in the way.  You have to try this place if you like schnitzel!"}
{"text":"Absolutely incredible.. The Snitzel is gigantic.. It's a whole meal in its self. Definite a must visit."}
{"text":"Wow - I've got problems. It's been 5 days since I last set foot in this German wunderhosen (what is that?! I don't know. Just roll with it) and with a grumbling belly I decided to read the mouth-watering reviews written by my secret schnitzel society. I call them mouth-watering because my mouth is now actually watering, bringing us back to my opening statement.

You know the place - if you've ever taken the Queen streetcar in an easterly direction, you've passed it. And I bet you've peered at the seemingly ancient sign, wondering if they truly ARE the Queen of Schnitz. Guess what? I think they are.

Things you need to know: 
1. They're only open like, 25 minutes per day. (11-5ish on most days, I think)
2. The place is miniscule. The sandwiches are much bigger than the space. There are 4 or 5 bar stools and you can pretty much lean on the wall behind you. However, this gives the spot a very cozy, lunchtime-at-auntie-Fran's-kitchen kinda feel. Just ignore the hordes of people who come in to grab a takeaway lunch.
3. The owners are soooo German and soooo stupendous. Bernard makes schnitz fresh to order (he's got a sandwich named after him, do you?) and his lady (I'm guessing she's his lady) takes the meat on a platter and makes it sandwichy.

Just thinking about that gargantuan... crispy... freshly pounded (like your mom)... oozing... sauerkraut-filled Beyern sandwich (the chicken version) is making me weak in the knees. What I'm saying is that if you're ever craving schnitzel, you want to go to here. (As an aside, I've never had a schnitzel craving because until 5 days ago, I'd never eaten it.) The chicken was perfectly cooked, and was really lovely with the 'kraut, even if it was a sweeter 'kraut than I'm used to. 

Best part? This $7 beast was good enough for two meals. Easily. So don't be a little schnitz, and get yourself to this gem."}
{"text":"Delicious schnitzel, nice owners, disregard kinda sketchy area."}
{"text":"Achtung! Go eat schnitzel at the Schnitzel Queen. Schnitzel sandwiches are HUGE, cheap, super-tasty and fresh. Go early to avoid the crowds in this tiny (4 stool!) joint. Me and a pal plowed through our sandwiches so fast, they gave us another on the house, just to see if we could make it fit! We did."}
{"text":"I had the pork Schnitzel King (comes with bacon, caramelized onions) and loved it.  A generous portion with nicely balanced flavours that would be insulting to label as \"fast food\" even though the service was extremely fast (and friendly, and funny) and the sandwich was a very reasonable $11 including tax.  The decorum only adds to the appeal.  

My friends and I have been looking for a solid sandwich spot to fill the void left after San Francesco changed owners and I can honestly say that Schnitzel Queen fits the bill.  Check it out."}
{"text":"Five star schnitzel!  Freshly made, super tender. Definitely more of a takeout place as there is very limited seating."}
{"text":"I've frequented Schnitzel Queen in Corktown and love it. As previous reviews have noted, the owners are adorable and wonderful cooks. Get the sauerkraut and cheese!"}
{"text":"Still top of their game.  This place is simply amazing for delicious food prepared by caring staff.  The new location just makes a good thing even better.  No longer are you tightly jammed in when you place your order .  Now there is room to stretch out and even tables/chairs to use!  Vastly improved comfort thanks to the new space."}
{"text":"A wonderful treasure in an unexpected location.  Forget your preconceived notions about this intersection.  You owe it to yourself to visit this place for some delicious, filling food.  

It is family run and that shows with their friendliness and attention to quality ingredients and good customer service.  Highly recommended.  The new, later closing time of 7PM finally makes this a dinner alternative too.  Awesome!"}
{"text":"After driving by for too many years and thinking I really gotta try this place. They moved locations but I still managed to drive right by all the time. FINALLY TODAY was the day.  Why didn't I go in sooner ? 
Great helpful friendly staff. All I got for takeout was very plain 2 Pork Schnitzels on a Bun. They told me that's called A Brown on Brown. They were great crispy on the outside very tender on the inside and they were huge. Will be back real soon to have a dinner with all the fixings."}
{"text":"Good Day:
Thank you for reading my post.
This restaurant was Horrible and it began with the arrogant staff.  They are not working at the Four Season's although they seemed to think they were.
When I arrived I was ignored by the staff for at least 5 minutes.  When I was finally acknowledged  I placed my order to the arrogant staff.  I ordered $35.00 of take out food.
They were more concerned with acting like baboons behind the counter.  
I asked how long it would take to prepare my order and they didn't know.  
The arrogance was unbelievable!
I had paid for my order and I stood there waiting for it to be prepared. 
It was now 25 minutes and no order was prepared for me yet!  The staff was more concerned about dancing behind the counter to there music!
I left with nothing, food or money refunded.  
They did not care.
I told them to take my order and shove it up their collective assholes!
They laughed at me.
Govern your self accordingly for choosing this dump!  You will be pleased that you didn't.
Dorothy who was the owner of the original Schnitzel Queen at Queen and Sherbourne would have been mortified!"}
{"text":"oh my. Why hadn't I heard about this place sooner? Great food, well priced, friendly service. The portions are enormous. I tried really hard to finish a junior queen schnitzel in one sitting, but there just was no room. We had a group order (various sandwiches) and everyone thought their meal was delicious! 

Schnitzel Queen, I'm impressed. i will be back."}
{"text":"That mushroom sauce.... Always choose the mushroom sauce! This place is one of Toronto's hidden gems. Although located in a questionable neighbourhood, this is the best place to get schnitzel. The staff are really friendly, service is great and I will definately be returning. By far the best food Ive had in a while, hands down."}
{"text":"Went here for lunch.. quaint little place. Word of advice, order in advance. The lovely lady who was multitasking like a rockstar had a huge order, but I didn't mind the wait. It was well worth it actually.. I ordered the Chicken with sweet and spicy thai sauce.. Scrumptious! The serving size was massive; I don't usually take some back with me, but I could not finish it all in one go. That's saying a lot, considering how prehistoric my appetite  usually is! The ratio of schnitzel to bread was almost 3 times the amount. Definitely going back! Yum."}
{"text":"This place is amazing if you're a fan of great schnitzel's, price is cheap $6 for the sandwich and $9 for the dinner both of which are heaping portions! Also the potato salad is home made and has a taste that I just can't describe, better then anything else I've ever had!

The only negative point I would take away from this place is it's lack of space, it can seat only 3 - 4 tops at most, my suggestion would be prepared to take your food back somewhere else, but for the price, quality, and portions they can't be beat!"}
{"text":"We got here on a Thursday evening at around 630 PM. The place is small and cozy and gives you the feeling of having dinner at your kitchen at home :) the place can seat a max of 4 ppl at a time. 

It looks like most ppl come here for takeout and are return customers who know what they want. The menu is really simple - the schnitzel with a choice of various toppings. We heard that they make really good potato salad but they were sold out when we were there so we'll go back again when we have a schnitzel craving!

Everything on their menu is under 10$ tax included. I feel it's a great deal given the quality and taste of the schnitzel!"}
{"text":"I love this place.  Although it's just a hole in the wall and a food destination easily missed, it's definitely one of my favourite spots I frequently visit.

Whatever you ask for will be schnitzel.  Schnitzel sandwich or dinner, you will not be hungry for a good amount of time.  The portions are spectacular and the food tastes amazing, but nothing fancy, just that everything served on a plate or in a sandwich works really well together.

You get a huge cut of schnitzel battered in flour egg and bread crumbs (I think).  It's fried to perfection, but don't worry, it  doesn't retain a lot of grease.  The good thing is that you can have your schnitzel as part of a sandwich, or as a dinner.  I do prefer the dinner because it's a little more manageable.

Sandwiches are complemented with many different toppings ranging from sauerkraut, mushroom sauce, potato salad and even bacon.  Pick your poison, you'll not be disappointed.

The dinner is simple, a piece of schnitzel topped with mushroom sauce, and sides of their awesome savoury sauerkraut and yummy creamy (not overly) potato salad.

The prices are extremely fair and the service is exceptional.  I really like the couple that run it.  Very friendly and always smiling with a bit of German accent to top it off.  I do love the Bavarian atmosphere.

5 stars."}
{"text":"Best. Schnitzel. Ever. 
Been meaning to go here for quite some time... well worth the wait. 
Great schnitzel, I got the schnitzel king -- it was amazing and lucked out with a seat at the bar. All the stars were aligned tonight."}
{"text":"Nice people. Taxes in. Massive piles of meat. Very tender. Loved it."}
{"text":"The schnitzel (which is sort of like a pork or chicken cutlet) was excellent. I also loved the small restaurant \"where everyone knows your name\" feel. The owner and worker were very friendly."}
{"text":"This place has the best snadwiches and dinners.Karl is a great friendly guy who prepares and makes eveything fresh...Always a pleasure to eat here ...Try for yourself and then tell yours friends and co workers...They wont be disappointed!!!!!."}
{"text":"Never open, one time walked in and there was some weird meeting going on... Terrible area.. Would not try again. Feels like a front for something else.  Why not get a bigger cage around your place?"}
{"text":"This place is as good as it gets.

Their schnitzel is wider than your face.  IF it is not, you should go see a doctor.
Unless you are like me, who manhandled and housed my sandwich like a boss, there is no doubt one of their sandwich can easily feed two.  They serve dinner platter as well, which comes with soup and sides.  Pick your poison.

I really appreciate the fact that the price is already tax included.  Drinks are a buck each,  4 seats available, so first come first serve. All orders are made fresh.

Some say their schnitzels were pounded by bare muscular hands, of whom wrestled hundreds of polar bears in his early 20s in order to be certified, to get that even thickness.  Others say their schnitzels were tossed like Sicilian pizza non stop and so rigorous that you can actually see it from space, to get that even thickness.  For all we know, their schnitzels are the shiznits.

The End."}
{"text":"One star off only for the \"cash only\" and limited seating. If only you made a real restaurant. Great food. Small operation. Food is made fresh so be prepared to wait or call ahead. Good portion sizes. Comparable to any great schnitzel house and I've lived and eaten the best in Austria."}
{"text":"I have been meaning to try this place for the last six months, went today around 12:30pm with my Swiss miss friend.  As everyone has mentioned the place is small but not in a claustrophobic way.  If it were busier may have felt the strain but it was us and one guy at the breakfast bar/stool eating area and a smattering of come and go take-outs.  (seats 4)

The order was: Schnitzel Dinner, beautiful piece of thin not chewy pork breaded perfectly, golden brown fried with potato salad and sauerkraut for 9.99 (included hst).  A small portion of mushroom sauce on top of schnitzel was just enough for a taste.  I love sauces and this didn't overpower the meat or smother it.

My Swiss Miss had the Schnitzel Sand w/cheese and sauerkraut served on a multi-grain bun w/lettuce 6.99 (includes hst).

Conversation was made with lady who owns the place with her husband Bernard who cooked our lunch.   They take turns doing the food.  My Swiss Miss had a lovely conversation in german with them that added to the whole experience.

The Schnitzel Dinner is enough for two so i took home what was left and added a solo schnitzel to it for the \"kiddies\" at home.

Will be back again for lunch and take-out for early dinners.  I love giving my $$ to family businesses that take great care in what they cook and really appreciate your patronage.

Bill was $23 (included 3 pops). Very reasonable....i also love the mish mash of diversity at Queen/Sherbourne.  Cash Only...open mon-fri  11-5pm.

**only thing that we critiqued was the fact the cheese was sliced kraft type, would have preferred real cheddar or swiss...not a big deal but worth noting."}
{"text":"Best place for Schnitzel in Toronto.  The quality and size of portions plus affordable price can't be beat anywhere  else.  The schnitzels are huge and hammered thin, the way it's supposed to be, still, giant portions and the option for half size at the new location.  The new restaurant is clean, comfortable, much larger than the last and decorated really well with a Bavarian Chalet feel.  Karl the new owner is great and nice to talk to!"}
{"text":"The huge schnitzel is simply delicious and satisfying. I couldn't finish the whole sandwich by myself. I usually would get a food coma after the schnitzel. :))) though i don't mind it at all."}
{"text":"This is my favourite place in the city. The portions are huge and I always get two meals out of one sandwich or plate. The Queen sandwich is my go to because it has potato salad and sauerkraut on it and for me those are two must haves when eating schnitzel. The food has stayed the same since the first time I had it 6 years ago. It's also great that they offer a veggie option for my sister who loves the eggplant schnitzel and can't wait to come back to the city for more."}
{"text":"This little gem-in-the-wall is worth the wait. I ordered the \"Queen\" sandwich and let me tell you - it's definitely made for two. I don't understand the idea of having the bun be half the size of the schnitzel - you'd be better off ordering the dinner, since you'll end up eating it with a knife and fork. Delicious potato salad and the sauerkraut is divine."}
{"text":"Massive portions for fair prices !! The Chicken Schnitzel Queen is really good...perfectly made Schnitzel with Sauerkraut and Potato Salad."}
{"text":"Does this place win for cheapest big sandwich in Toronto? Gotta be top 3. It's pretty tasty, but heavy on the bread and batter and light on the chicken. If you've only got $5 for lunch and you need to do a lot of physical labour, good choice. If you've got $10, there are plethora of healthier and tastier places to go, starting with Fusaro's and Ueno 1 block away."}
{"text":"This place is awesome. Schnitzels here are perfect. Best sandwich you could get. The prices are also really good. If i lived closer, I would get it everyday for sure.

The time I went, I got a schnitzel, ate it, and promptly went back in again for another. 

I never do that."}
{"text":"I'm no schnitzel expert, but Schnitzel Queen is the best. After discovering this place randomly, I've come back about three times now. It's definitely two meals in one and I always get the Schnitzel King because it comes with with Roasted Bacon, Onions, Sauerkraut & Cheese. Luckily my co worker likes the same one so now we just order one, split it, and its the perfect lunch. Also their potato salad is delicious! They only accept cash and debit and tax is included in the price. You can also order delivery or pick up. The new space is great because it can accommodate more diners. Can't wait until next time when I get that schnitzel craving."}
{"text":"Seriously good & seriously big portions! Before my first visit I already have an idea, based on other patrons' comments, of how big their servings are. When I got the chance to drop by, I planned to take out the pork Queen and share with the missus. Having been raised in an Asian home, we cannot eat this just with the bread itself. Are you kidding me?! There has to be rice! & lots of it!"}
{"text":"This is an amazing little mom and pop shop is the middle of Toronto. The quality is amazing and you can't beat the price. If your anywhere relatively close to this place you NEED to stop by!"}
{"text":"Best schnitzel I've ever had! Insane portions and friendly staff. Will be returning when back in town"}
{"text":"LOVE this spot. Ever since I began attending George Brown college in January of this year, I've been hitting the Queen at least once a week. My friends and I go right after our culinary demo on Tuesdays at 11am, it is the perfect time to go because we miss the huge lunch rush and always get 3 out of the 5 possible seats.

It took me 20 schnitzel's to discover the mammoth of all, the regular + cheese + caramelized onions + bacon. Thank god Bernard asked me to trust him one day as he hit me up with this beauty. Truth be told he originally added pineapple to it but going forward I felt the onions were sweet enough and the pine wasn't completely necessary. 

This schnitz sorts me out and gets me through a long day of classes. The schnitzel is perfectly cooked, crisp, tender and gigantic. I love it. For the $ you pay it's a steal. 

We go so often Teresa calls us her \"babies\", and in all honestly I feel like one (blushing). 

a STAPLE."}
{"text":"Acceptable at best. For me a large portion doesn't make up for substandard quality. Quantity over quality does not work for me,  for some it does. I suspect the McDonalds generation would love it here. I originally saw this place on dragons den and thought it would be worth a try, instead it tried me.... Its cute, small click-ish (not friendly) and just ok. Flavourless."}
{"text":"Big and delicious! Such a great atmosphere and love the old style German decor.  The owners and chefs are so nice and have a great sense of humor. With Czechvar on tap to boot, you can't go wrong. Can't wait to come back and try the fried cheese!"}
{"text":"I tried this place because of the reviews here on yelp and I saw them on Dragons Den. This is a cute place for sure, only seats 4 people at a bar type area. The owners and staff are very charming and friendly and can't complain about the service. The food was not what I expected. I didn't enjoy it at all. Presentation, taste and quality seemed to be lacking. So why 3 stars you may ask?  I think that although I didn't like it, it hits the target for the market they are striving for... Personally, I wouldn't go back. If someone wanted a schnitzel and suggested we go here, I would suggest trying a new place.  I can see why the Dragons chose not to invest."}
{"text":"Well then... 

I'm back to being a fan of this place after my long hiatus.   A friend mentioned it to me and I thought, yeah, I need to go back cuz I haven't had schnitzel in the longest time.  

I like the history of this place, read about it on their website.  

Portions have not changed.  Sandwiches are still the size of your face.  Prices include taxes which keeps everything straightforward.  

The current location is decorated in a Bavarian style - it's cute.

The line was long, the wait was long, Ritual wasn't accepting any more orders... but it was worth the wait.  I even got to sit at a table."}
{"text":"they have schnitzel and I love it, but the hours suck and the guy isn't very nice."}
{"text":"Felt like having schnitzel (yeah it happens) and in my searches this place kept coming up. So with an umbrella in tow I walked by this spot on a rainy day in January (it can happen). 
The place is miniscule and has only 4 seats, there is hardly any place to walk around. The menu is hand written on a white board with a paper version on the counter.
I decided to go with the sandwich and just to confirm I asked whether the schnitzel was veal, lo and behold I was told that they only have the chicken and pork version. Blasphemy if you ask me how can any self respecting authentic schnitzel place not have veal! After a bit of probing I was told that veal is more expensive and hardly any people order it. Oh the self proclaimed politically correct have struck again and have deprived the people of an authentic dish.
Never mind I ordered my chicken schnitzel sandwich to stay. I was asked whether I wanted sweet chili sauce on the sandwich as well. Puzzling IMO as its not authentic to say the least.  I waited patiently for my food and my apprehensions were washed away when I saw the sandwich. Very traditional serving, the chicken pounded  thin and fried nicely served on lettuce sauce and tons of tomato. The meat was cooked perfectly, right amount of crisp. A sandwich that will put any of the chain places to shame for sure.
Now only if they had the veal version I would come back for more.
Good stuff."}
{"text":"I love this place.  Freshly made schnitzel.  Hole in the wall.  Friendly service.  Excellent value.  As good as it gets!"}
{"text":"Amazing sandwich, you better be hungry though!!! I had the King and it was big, messy and delicious."}
{"text":"Amazing sandwich. Very delicious. I had a junior size Queen, and it took me 2 meals to finish it. That's how big it is."}
{"text":"so good. cash only. tiny 4 seats, takeout will be slow unless there's no other orders in front of you. if ordering onions (and you should), have mints ready for afterwards. didn't need a drink to accompany these sandwiches, they're deliciously succulent and chewy. 

I'm writing this review because I just had a schnitzel queen sandwich for lunch for the first time today and now 12 hours later, I reverently wish that I was eating another sandwich. I rank tasty food from 'would think about the food like a good ol pal' to 'i actually can't sleep because I want to eat this food so badly' and schnitzel queen is definitely the latter. 

these sandwiches keep relatively well, they're greasy but won't become that kinda gross congealed kinda stale after a few hours. buy a sandwich for lunch and keep half for dinner or share it with some character in moss park across the street."}
{"text":"God damn. Talk about bag for your buck. Couldn't finish the whole sandwich even if I tried. And flavour? These sandwiches ooze with flavour. Can't go wrong here. Extremely friendly staff as well. All around wonderful establishment."}
{"text":"Schnitzel Queen makes the BEST schnitzel sandwiches in the city, and quite possibly the best sandwiches period. The ingredients are fresh and the sandwiches simple and delicious. I asked today where the name of the Michael sandwich (schnitzel, lettuce, fried onions, cheese, bacon, mayo) came from. The owner told me that 2 years ago a regular customer named Michael, said \"why don't you put some bacon on that?\"... and so an incredible sandwich was born. One day I would love to have my own sandwich here (but what would they call it...?)."}
{"text":"Oh Schnitzel Queen - I love you!

I am so sorry I did not believe in you for 2! years when my office pals told me about your awesome food. 
In my defense: I am from Germany myself and you know how greasy Schnitzel tends to be over there. But still - Mea culpa for not even trying.
As you can see, I am making up for it though. 
Every week I am your now faithful customer - sometimes even twice!
Cause who can pass on your delectable Chicken Cordon Bleu or even just the plain Chicken Schnitzel Sandwich with that yummy sweet chili sauce? And all of that is a bang for the buck as I won't go hungry again until the evening.
But of course, I also shouldn't forget your Potato Salad though since it is equally delightful.
I just can't go wrong with you... So take care for today - We'll see each other again in no time. I promise."}
{"text":"Happen to walk by this place today and remembered seeing in via Yelp on my phone and thought 'what the heck, let's give it a try!' and we're are so happy we did!

Like other reviewers, this place is a diamond in the rough.  If you're purely judging by the exterior then there's a high chance you'll just walk on by.  It's really a small joint!  There are going to be 'unsavory' people in the area so be wary.

We happened to visit with a stroller and they managed to accommodate us by slipping the stroller under the counter.  Albeit there are only 4 stools at the counter, they managed to pull out another one when it got really busy.

Bernard is the gentleman who is so lovely and warm while his wife, only known as 'Mama' was so friendly.  You felt like you were eating at a relatives or even at home!

Had the Schnitzel sandwich BLT and it was so yummy.  Had it cut in half and it was enough for 2 to share.  The baby couldn't even resist eating some!

The next time we will try the Schnitzel dinner with the mushroom sauce, sauerkraut and potato salad.  Wish they had more room and were open longer hours.  They close by 5pm."}
{"text":"How can you not love a couple that owns a tiny- 4-bar seated place where the wife takes the orders and the husband pounds the meat...literally..in the back.

Nothing over 10$.
huge portions- great for a large lunch for two people or take for two meals.
just shared the Dinner - schnitzel with mushroom sauce, potato salad, sauerkraut.  Dude beside me had the bacon version (will get that next time).
Believe all the reviews- you will salivate just thinking about it!

This cramped little charming space is a MUST.
ps: It's because of this place that I enjoy sauerkraut now"}
{"text":"A nice little spot on queen street between Jarvis and Sherbourne. 

I usually don't like schnitzels but I wanted to give this place a try because of its high rating. Glad I did because I was not disappointed!

My girlfriend and I just visited this spot today. The two workers( not sure if they were the owners ) greeted and and were very welcoming. The serving size is fairly large so my girlfriend and I ended up sharing the 'Queen' chicken sandwich. She was really full from her and I was satisfied.

The sandwich itself was tasty. Since it was a big sandwich (even after cutting it in half) it got messy while eating it. It tasted good , but it was a bit bland for my taste buds. So I decided to add in the chipotle sauce and habanero sauce which made the sandwich much better. They have a few different sauces on the table which you can add yourself.

I'll visit the joint again but this time I'll try something other than the Queen. The price ranges from $10 $14 for a plate or sandwich, however it's worth it because the portions are gigantic!

My recommendation/ wish list would be to have a spicy schnitzel. I'd love to try that! Maybe a sandwich with jalapeño and chipotle sauce ! Yummmm"}
{"text":"This one falls into the \"hole in wall gem\" category.

It is not just the quantity, but also quality that deserves the five star. 

Service was wonderful, for this cozy place that has only four seat.

I ordered the Gourmet Schnitzel. Meat was tender and crisp, onion / mushroom sauce compliments the taste. Nothing beats an over-the-plate hearty Schnitzel in a cold wintery night."}
{"text":"These Portions are BIG! I mean BIIIIIIG! And so yummy!
I recommend the 'Bayern' special (with sauerkraut and cheese -try it -sooo yummy) for $8 incl. tax.
or the 'Cordon Bleu' with ham and cheese for $10 incl. tax.
I prefer the chicken bun, but pork is great, too.

The German owner and his wife are super nice.
But the food is only to go. Not very much space to sit. They close very early at 5 pm. 
So it is a great place for lunch 'to go'. Best value for your money in town."}
{"text":"Not many German restaurants in Toronto so this is a rare find. Their menu makes it look like you have a lot of options but it can be simplified into: Do you want a schnitzel in a sandwich or a plate? All the options on the menu only make a very very slight difference in terms of your toppings.

Whatever you order, chances are it comes with sauerkraut and potato salad. Their mushroom sauce is amazing. The Schnitzel itself is lightly battered, and seasoned just enough. 

I have nothing to compare it to in Toronto. It's similar to Japanese/Korean tonkatsu I guess? But the German version emphasizes more on large surface area whereas the Asian ones are more focused on making it more crispy and adding sauce.

Good taste and good value too. The meat portion is quite good for that price point. I would consider this if I'm in the area."}
{"text":"I freaked out as he opened the fridge and pulled out a slice of 'singles' process cheese. Really? That's what i am going to be eating? I haven't purchase processed cheese for years. The buns are from Costco. 

But this place is the best because the owner is quirky, loves his business, and makes a great schnitzel sandwich. Prices are tax included. The sandwiches are enormous so come with an empty stomach or a skinny friend. And you know what, the process cheese makes it! I will always make an exception for Schnitzel Queen. 

Are you tired of making your own sandwich? Give Karl a call, he will take care of you."}
{"text":"The flavour just isn't there.

The portions are huge and the price is more than fair (tax included)  but it wasn't very tasty. If you love spicy food, this just isn't for you. 

It delivers on being a proper schnitzel meal."}
{"text":"Extremely tasty, but be warned that if you stay and eat, your entire being will smell like the restaurant when you leave. Nonetheless, the food is superb, good portions and man, I feel like a nap. 

I would have never come here otherwise, but the rave reviews are correct! Large sandwich ($7.99-9.99, depending on what you want in it) can feed two people. We shared one. I would recommend the roasted onions (and with BACON) mmm. 

We arrived at just a little after 12pm on Wednesday. The line up to the small place, was at the door, with 4 stool seats (2 taken by a lady and her son reading the newspaper, how considerate). Others were here for take out. We waited about 10 mins before they took our order and about another 10 mins to arrive. 
We decided to stay and eat, and soon after (12:30pm) the rush left. 

OMG so tasty. but come with a partner."}
{"text":"Worst schnitzel I have ever had, Guy seemed to be angry and the kitchen looked dirty I was recommended to check this place out. I was disappointed, I don't recommend."}
{"text":"Schnitzel Queen is a small restaurant located on the Southwest corner of Queen and Sherbourne in Corktown that specializes in schnitzels. Schnitzels is meat usually veal, pork or chicken that's been thinned by a meat tenderizer, coated with flour, beaten eggs and bread crumbs, and then fried.

Schnitzel Queens lays claim to having the best schnitzel in town and they are probably right. The term hole in the wall is a term loosely thrown around by foodies but hole in the wall gem is a perfect description for Schnitzel Queen. Here's why.

Every time I go, I normally order the Chicken Gourmet Schnitzel ($14.50 tax included) which consists of a large piece of chicken schnitzel topped with a mushroom sauce, bacon, caramelized onions along with a potato salad and sauerkraut. The schnitzel is cooked perfectly, chicken is juicy and tender inside and the outside bread coating is nice and light. The mushroom sauce, bacon and caramelized onions are perfect toppings to the dish. The potato salad is great, nicely seasoned and just the right amount of creaminess. The portions are huge, the food is outstanding and is very very reasonably priced for what you are getting.

The service is top notch and the staff are always so friendly. It's always great to support local small businesses that makes amazing food.

The only downside is it's located in probably one of the worst neighbourhoods in the city but the area is generally safe in the day. Also, the rent is cheaper in that area and they are able to pass on the savings to customers which is reflected in the pricing. For what you are receiving food and quality wise, the food is very very reasonably priced. You go to restaurants for the food and not the neighbourhood."}
{"text":"Karl is a customer service God.  The schnitzels are great.  But I found the mushroom gravy lacking.  Now when I go I \"hold\" the gravy.
The potato salad is the reigning champion here."}
{"text":"Very overrated. Came here ending very ending of September, got a queen schnitzel with bacon... the toppings were weird and not very flavorful,  expected a lot more because the reviews are so great. Doubt I'd come back, ambiance was very unprofessional and the food was very undesirable. The staff were very snarky. Just didn't enjoy my overall experience. Sandwich was just ok."}
{"text":"This place literally never disappoints. I prepare myself mentally for a week before going - it's that good. The potato salad and the sauerkraut are so complimentary to the schnitz. Can`t wait to go back!"}
{"text":"Glad I got to visit this place before they will be forced to find another location for this hidden secret of Toronto.  Staff and Chef are friendly and cheerful.

They even have a kickstart campaign: https://www.kickstarter.com/projects/1725016172/schnitzel-queen-needs-new-location-urgent

Big schnitzel sandwiches or schnitzel dinners for great value (nothing over $10!) and it will definitely satisfy your hunger.  

I had the schnitzel king sandwich and it was the size of my face.  Nicely breaded and thin schnitzel piled with good amounts of bacon, sauerkraut, onions, and cheese.

I really hope they find a new spot so I can make another visit in the future!"}
{"text":"What more can I say about this Toronto gem. As a Toronto chef and passionate about his favourite eateries, little embarrassed that I did not discover this icon many years ago. Salute to the chef proprietor and many thanks for making my tummy very happy. Just no nonsense comfort food at a great price and portion. Thank you so much!"}
{"text":"Really good schnitzel, I've never had schnitzel before. The portions are GIANT. You can definitely share one...even the child sandwich. We called ahead of time and when we got there it was a tiny little shop that I assume is family owned. Super quick service and we got our order and was out the door in no time. The food is very good. Close to my work and definitely recommend this place."}
{"text":"The best bang for you buck! Great portion size, and extremely tasty! Slowly becoming an all time favourite."}
{"text":"This could be the best Schnitzel in Ontario! I've eaten at a few German, Austrian and Bavarian restaurants and none of them compare to the Schnitzel Queen.

I ordered the Schnitzel Queen (schnitzel, sauerkraut, potato salad, lettuce and tomato on a Kaiser bun) for $10.00. 

The Pros; 
The sandwich was so large I couldn't finish it in one meal.
The quality of the sauerkraut and the potato salad put it over the top

The Cons;
The wait was long (because the place is popular)
They only accept cash.

Regardless of  the cons, I will frequent this place often."}
{"text":"I've been here a couple of times and I definitely plan on coming back for more and more and more. The place has a great history - it's been passed from owner to owner to owner but each one has proudly adhered to tradition and the current one has taken great care of the place and the menu. The atmosphere is kept traditional and reminiscent of old German architecture and decor and service is friendly and quick. The times we've gone, my friend and I have always ordered the gourmet schnitzel (which comes with potato salad and sauerkraut on the side and mushroom sauce, bacon, and onions loaded on top of the schnitzel). We've tried both the full-sized pork ($13.50 incl. tax) and chicken ($14.50 incl. tax) and, although there honestly isn't a big taste difference between the two meats, we preferred the chicken - it had more of a tender texture. What makes the meal worth it is the amount of food you get for the price you pay. The schnitzel covers more than half the plate (it's a large plate) it's served on and comes loaded with toppings and the potato salad is probably one of the best I've ever had and it comes in a fairly large portion too - the potato comes in chunks and bits and it's seasoned perfectly to complement the schnitzel. The sauerkraut on the side adds acidity to the meal to balance out the flavours. My friend and I always talk about going back and, after one try of their schnitzel, you'll see why. A definite recommend. Their menu offers a good-sized variety - you can order your schnitzel as a dinner (which is what we did) or as a sandwich. Toppings for your schnitzel vary from optional sweet and sour chili sauce - Regular Schnitzel sandwich, to ham, onions, and cheese - Cordon Blue Sandwich, to Fried Eggplant dinner and Fried Cheese dinner. You can even order and/or take home their delicious potato salad and sauerkraut as side orders."}
{"text":"This is the best schnitzel in the GTA hands down. The meat is perfectly cooked and tender every time. The King is especially awesome with the fried onions and bacon.  Although I am usually a cheese snob I agree with those that say the processed cheese works here.  And it's enormous to boot. Would definitely feed two (or yourself twice. Service is great and friendly and the new location is an improvement. All hail the Queen!"}
{"text":"I heard there was a dead guy found in a crawlspace on parliament street. But two or three blocks away from that dead guy is a delightful lil place called the schnitzel queen. I ordered a regular schnitzel and it tasted amazing, my coworkers thought so as well.  And I've gotta say... It took me 46 minutes to completely finish the meal; massive meat portions.  I paid $5 for this phenomenon!! I ordered the solo once specifically because I didn't have time to commit.  That's just the chicken sans bread and some other non essentials. 

The people are always friendly and the German lady has unbelievably good skin. The man is very handsome as well.  Why is this information crucial?? Well, have u ever been to a street meat vendor who looked like he doesnt give a damn about HIS life?? All greased up, disgruntled and unkempt??? u KNOW he doesn't give a damn about your hot dog.  These German folks care; they love it.  And i love them.

To my understanding, the meat is a tenderized chicken breast. They must get  these chickens from the playboy mansion cuz they have GIGANTiC knockers.... I'm so glad they removed the nipples...  Anyway, 5 stars!!!"}
{"text":"What a great little place. Long live the 'Queen'! My favourite sandwich on the menu. Huge portion, no kidding. Eating a 1/4 sandwich fills me up. Keep up the great work."}
{"text":"My bf and I ordered a sandwich and a dinner plate through Justeat. 
Wow I truly enjoyed every single component of my dish. I am not a huge fan of potato salad, but I finished this one wishing there was more. Great job on making it not too heavy by adding generous amount of dill and sourness. Sauerkraut was more than just sour pickled cabbage. The chicken schnitzel was cooked to the perfection. It was juicy on the inside and crispy and light on the outside. The highlight of the meal was def. mushroom sauce. It was just so flavorful and made this dish ten times even better. I never finished a container of sauce before. I could eat it by itself. The schnitzel sandwich was literally the size of my face (and my face is not that small haha). Lettuce was fresh and they did not skimp on caramelized onions. 

We def plan on visiting the place and dine in there."}
{"text":"Many of my friends rave about this place.  I've had sandwiches from here before, but had never picked them up myself. I was in the area today and decided to try it out.

Schnitzel Queen is definitely in a sketchy area.  On this particular day, I was greeted by drug addicts screaming at each other across the road.  They were clearly upset about something.  The wave of gentrification that's creeping across this part of Toronto clearly hasn't washed over this block yet.

I studied the menu from the outside and decided what I wanted.  I went in to order only to discover that there were at least 4 different menus, all with slight differences from each other.  I did my best to order what I wanted, which was something with mushrooms and fried onions, but ended up getting it wrong.  Oh well.

After placing my order, a guy came in and they all spoke some Eastern European language that I didn't understand the entire time I was there.  It definitely wasn't German.  He finally left and they again acknowledged that I was there.

I eventually ended up with two sandwiches - one for me, one for the wife.  The sandwiches are huge.  They're probably big enough to share between two people as a meal unless you need to be really stuffed.   Not bad, considering all of the sandwiches are under $10.

The schnitzel is of good quality.  The cheese that was on one of the sandwiches appeared to be Kraft singles.  

There are a few stools at the counter if you'd like to eat in.  It has an old school diner feel.

This was my second attempt to purchase a sandwich here.  Last time, I wasn't carrying any cash - so remember, it's cash only!"}
{"text":"So in this very small unassuming eatery on Queen St. downtown, it a schnitzel literally the size of my FACE!, They don't play around here.... it's 10 dollars and you may not even be able to finish the one plate.... and it's really just bread, cheese (kraft singles slice I believe, don't hate it was perfect), lettuce, tomato and mayo and a monsterous slab of pounded pork, battered and fried to perfection... If you are mega hungry and wanna stuff face with some affordable goodness. This is the spot if you are in the area...... GO HERE!"}
{"text":"My first time at Queen Schnitzel, even though not in the greatest part of town. The sandwich makes up for the surroundings. I had the Queen version of their sandwich. I could not believe the size of the full serving, but the taste definitely matches the size. I will be back again."}
{"text":"This place is good, we used to go here regularly when we lived in the area. The potato salad is our all time favourite. Lots of european beers to try, cool little restaurant and eating inside is nice as well. We always got dinners so maybe one day we'll get a sandwich."}
{"text":"Portions are huge for the price. The sandwiches are one of the best ive ever eaten. Definitely would recommend others to give it a try! Also a side note, ordering ahead would be smart :)"}
{"text":"You will get schnitz-faced. Guaranteed.

Schnitzel Queen on Queen East at first glance is a rather unassuming hole-in-the-wall place in a rather hole-in-the-wall part of eastern downtown. But walk in and you'll feel like you just stepped in to the kitchen of someone's home. It's very small, with enough kitchen bar seating for 3-4 folks crammed in.

Karl the owner will gladly provide you with his finest schnitzel sandwiches, all under $10. And for $10, holy crapo these things are indeed huge! The slattering of savoury sauerkraut and other tasty stuff in a small bun... there is no way you can keep it all together before you even open your mouth and say ahh. Even half of a schnitzel is practically a full deli sandwich or a pretentious gourmet burger. I don't think the pictures posted here give an accurate idea of how big their products are, but I am not kidding. Better make room in your tummy, lest you get schnitz-faced.

Too bad they only open until 7pm. And only on weekdays. Cash only. 

{TTC: any Queen streetcar or the 75 to Queen/Sherbourne.}"}
{"text":"Can I give this a 4.5?

Anyways, I stopped in here because I was picking up the dogs from the groomers, and they weren't ready yet, and I was starving!  I will say that I didn't read the reviews before dropping in, it was a totally impromptu visit.

I ordered the King Schnitzel or Schnitzel King (whatever it's called), I wanted to order the Queen Schnitzel but they were out of potato salad.  To go.  OMG this thing was huge (see picture).  It was delicious.

It completely filled a massive take out container.  And smelled great.  When I was ready to dig in, I was super glad they cut it in half.  Half for now, and half for later.  (Actually my bf ate the other half).

the King had bacon, sauerkraut, cheese, fried onions?  and maybe mushrooms.  It was a super crazy sandwich. 

for $10, it's probably one of the best deals in town.  Definitely recommended."}
{"text":"I haven't had schnitzel at many places in Toronto, but I can only assume that this is one of the best in the city. Each schnitzel is made to order, so it's always hot and crispy when you get it.

My goto schnitzel dish is \"The Bayern\" which is a nice big piece of schnitzel on a bun with cheese, lettuce, tomato, and a big helping of sauerkraut. For me, Schnitzel needs to be eaten with Sauerkraut.

If you're in the area, for lunch, or even anywhere within 20 minutes of it, definitely make your way and give it a go. For $10 or less, it's as good as it gets."}
{"text":"I have eaten lots of schnitzels in my life. 
And this sandwich was definitely in the top. 
Ingredients are very fresh, and the schnitzel is freshly fried (Allot of European stores just keep the schnitzel under a heat lamp).

Very good sandwich. The only problem about this place is that it's TINY. Maybe 2-4 seats."}
{"text":"I am a big schnjtzel fan and have been dying to try schnitzel queen out for sometime now. However they always seem to be closed and imo thats part of the charm. I did however manage to finally eat there a couple of days ago and really liked the place. Schnitzel queen is a little away from moss park and so there are always a couple of characters hanging out around it but nothing too bad i guess. The restaurant hasn't updated itself in quite a while which means that it is really nice and charming although a bit run down. If you have more than three friends you're in for a bit of trouble because they have only four seats in their entire restaurant, two of which are lower than the rest. Now coming to the food. The food is really cheap and the portions are huge. You may find it difficult to finish what you ordered and so i recommend an empty stomach before heading out here. A lot of people have said that this is the best schnitzel in toronto but i am afraid I'm going to have to disagree. In my opinion, hungary thai makes a much better cordon bleu. Schnitzel queen  stuff their schnitzel with the cheese and the ham and instead top their schnitzel with it instead. They do however have sauteed onions which are pretty delicious and add to the greasiness of the meal. I managed to try their potato salad as well which was delicious. The couple that runs this restaurant are super nice and that of course adds a lot to the charm of the place. Considering everything i'd definitely recommend schnitzel queen and wish they were open a little later and on a few more days which would make it a lot easier for me to get there."}
{"text":"This place was the last stop on a Saturday restaurant tour of some spots around the Dundas east area. I had not had a schnitzel in a very long time so was definitely looking forward to checking this place out. The inside of the restaurant has this Alpine Chalet feel to it because of the various items and painted art-work that are decked out on the walls. Pretty warm and cozy vibe to it because it was definitely chilly outside that day.

I split a Schnitzel King Junior sandwich with a friend in our group. The sandwich was filled with roasted bacon, caramelized onions, sauerkraut and sliced cheese and a very bright green leaf of lettuce. The schnitzel tasted good and the coating was crispy enough and the flavor of fillings did not overwhelm each other. I'm just glad the taste of the sauerkraut did not permeate through each bite of the sandwich. Despite it being a junior, the sandwich is big enough to fill you up if you're not very hungry during lunch. 
Two other friends split a Schnitzel dinner with mushroom sauce, roasted potatoes and sauerkraut. That also came out looking appetizing with a pretty hefty amount of sauerkraut.

This is first schnitzel place I've eaten in a very long time and no disappointment about the meal."}
{"text":"This was my first time to the new location and under the new owners.  I can honestly say that the new owners have done an excellent job at keeping the tradition and flavours of the old Schnitzel Queen.  

I ordered the BLT schnitzel and my boyfriend ordered the King's Schnitzel.  It was the first time that he had ever had schnitzel and he loved it.  We both ordered small potato salads.  Since it was a slow day and they were closing up early they gave us large portions for the price of the small!  I really love the potato salad.  I like that they slice the potatoes thin, and I love the slices of dill pickle that add a little crunch.  The portion sizes are huge.  I ate half of the sandwich for lunch with some potato salad, and the other half for a snack later.  Not quite as good cold (or even re-heated later on).  But still tasty.  I love the flavour of the pork BLT schnitzel.  The onions add a delicious flavour profile to the sandwich.  

I like the new location b/c it's a bit bigger.  The decor is cute and Bavarian, and there are some small and regular size picnic style tables if you want to eat your food there.  Price is spot on, especially considering how much food you get.  

Can't wait to go back!"}
{"text":"I've been itching for a good schnitzel and read the reviews here on  Yelp awhile ago.  I have been dying to try this place for months but keep forgetting to go.  I'm so glad I remembered today!  

When I walked in, I was surprised at how tiny it was.  Very cute though.  I asked the gentleman what he would recommend as it was my first time there and he said to go with the classic sandwich.  I did.

It was $7.  They only take cash and I was 70 cents short.  I told the woman that I would have to run over to the bank.  To my surprise she said \"No, don't worry about it.  You get me next time.\"  I couldn't believe it!   

I walked back to the office as fast as I could to sink my teeth into this sandwich.  When I opened the box I couldn't believe how bit it was.  The schnitzel was the size of the box, and the sandwich wasn't short on toppings (lettuce, mayo and tomato).  I had enough for lunch, and an afternoon snack!  I bit the schnitzel around the edge of the bun and then ate the full sandwich with the bread.  So delicious.  

I will absolutely be coming back here.  And leaving a good tip!"}
{"text":"This review should have been written after my first visit but alas, it was incomplete as I didn't have a chance to really try the big attraction here...No, I'm not referring to the schnitzel although that is good!  

No, I'm referring to the renowned customer service by Karl and the potato salad.

You see, I came here on a dreary, rainy Thursday afternoon and it was unassuming.  You see, I've read about this place at great length and heard my sister rave about this place.  You see, I don't like to venture out too far east of Yonge that often because, well...It's out of the way and I don't like to venture into unfamiliar surroundings.  

Here's the deal.  The day we went, I wanted to go check out the new Sak's at The Bay.  Afterwards, we got here and were disappointed when informed they were sold out of potato salad.  My sister was not happy at all.  It was my fault for asking to go into Sak's.  To make matters worse, the guy who must have ordered us got his schnitzel dinner, complete with potato salad.

We wanted to try the potato leek soup but alas, like the potato salad, that was sold out too.  We shared a King and let me tell you.  It was great!  I normally don't like sauerkraut and the idea of kraft singles on a cutlet didn't sound too appetizing.  But let me tell you, that sandwich was incredible!  So much so that I still think about it now.  

While we were waiting for food, a bunch of people came in.  I mean, this place was full of people just waiting to order or waiting to pay.  It was packed.  I told Karl we were hoping to try the potato salad as that was the main attraction, he was sympathetic but said it's hard to figure out when a big rush is going to happen.  The girl was very friendly and polite, Karl on this day was busy serving up food and talking to a few locals but mostly he was working.  

Fast forward, Easter Monday.  I was still feeling guilty for causing my sibling to miss out on potato salad (she went to lengths to remind me that she wished she had it).  So I decide to walk down to Schnitzel Queen.  However, this time I decided to call first and make sure there was potato salad before I came.

I will spare you further narratives and get to the point.  Karl was much friendlier this time, the place wasn't packed and the food was amazing.  Some people complain that it's quantity not quality but these people are too picky IMO.  The schnitzel is very large but it's also tasty and it's paired with nice fixings!  I don't like egg in my potato salad, and pickles are seldom an ok food.  Yet they are in the potato salad!  It's amazing!  One more thing that makes this potato salad awesome you ask?  Unlike other potato salads which have chunks of potatoes, Schnitzel Queen features thin slices of potatoes.  

They say business is very brisk during the summer, but I hope they do well.  I'll make the trek down here when I can to support this place.  Prices are taxes included.  That way I don't have to figure out taxes, math can be difficult for some of us!

Oh, yes before I forget.  Their desserts are sometimes made in house and sometimes from elsewhere.  I got the creme puff and it was well priced for $3.  

The bread may not be crusty here, but the schnitzel compensates for it.  Plus, if you're talkative, you may find yourself having engaging conversations with Karl, Mustache guy (I didn't get your name) or the friendly girl (is that a real German accent?)"}
{"text":"From the outside it looks like a quaint little place but when you walk in you realize how tiny it is. It is like you just walked in to someone's kitchen. They have literally four chairs lined up against a breakfast bar. The family photos and magnets on the fridge right opposite the seating area makes it feel very homely. 

We all ordered the King Schnitzel sandwich ($10 including tax). It came with fried onions, cheese and what felt like a whole bottle of mayo slathered over it. The schnitzel is definitely gigantic. I had to actually split it with a coworker. It is a bit disappointing that there is more breading than meat but at $5 for my whole meal I am quite satisfied. Also, it is really heavy and tasty (of course because it is deep fried).

They have a lunch combo for $10.99 (a regular sandwich, soup and pop) which looks like more than enough food for two. Remember to bring cash, no cards accepted here."}
{"text":"Hot, fresh, fast, a huge portion, and delicious. I loved the decor and welcoming atmosphere!"}
{"text":"This place is one of those \"once in a while\" spots. It has to be cuz otherwise your heart would explode. I was out looking for lunch and saw the magic words: schnitzel sandwich. So I stepped in and ordered a cordon bleu. It wasn't the best schnitzel I ever had, but that was in Austria and they're gonna do it better every time, but it's the best I've had in Toronto. After a 10 min walk back to the office, the sandwich was still warm and the schnitzel still crispy on the outside w/ a nice chew on the inside. Mine also had lettuce, sauteed onions, ham, cheese and mayo for extra heart abuse. I ate it all in one sitting and felt like taking a nap right after. Not bad for 9 bones. Wear your stretchy pants and bring an appetite."}
{"text":"I arrived around 2pm to avoid any lunch rush. I was successful as there were only a few patrons. 

The best way I can describe the restaurant is that it has character (not quite a hole in the wall) and is small. 

Anyways onto the food. I ordered the chicken schnitzel plate wish mushroom sauce. I believe the owner prepares each schnitzel to order. I could hear the tenderizer flattening out the chicken breast.

For $13.50, tax included, you definitely receive a good quantity of food. The schnitzel is huge! The breading on the schnitzel is thin and crisp and the chicken was moist. The mushroom sauce was okay. I would have preferred a thicker consistency, maybe reduced more, so it would cling onto the schnitzel. There wasn't enough sauce. The flavour was interesting. It wasn't rich and it didn't have that satisfying protein (flavour); I'm ambivalent of the sauce. 
Without the sauce, the schnitzel did not have much flavour. 

The plate comes with potatoes salad and sauerkraut. The potato salad was lovely. It had an optimal amount of dressing, the potatoes were tender but still firm enough and the addition of the pickles or gurgions was amazing. The briny pickled flavour brightened the potato salad.

The sauerkraut I did not enjoy as much. Maybe I'm not accustomed to those flavours, but it tasted weird- potentially too acidic?


The owner is a friendly man."}
{"text":"Huge sandwiches. We've ordered takeout and also have dined in. Takeout is good, but dining in is better when it's cold out - you don't want a soggy sandwich. They also have czech beers on tap. One King Schnitzel sandwich is enough for two to share if you aren't too hungry. Really fun troll decor inside as well!"}
{"text":"This is a wonderful spot for some real deal. I love good schnitzel it is a comfort food to me as burger or pizza to someone else. They serve generous portion with a wide range of selection. The plater comes with potato salad and sauerkraut and I like the mushroom gravy as topping. They also have a fine taste of hot sauce, there are more than 5 different kinds to choose from. The owner is this very hospitable and happy person who always enjoy a good chat with the guest. I'm glad I discover this place and gonna bring lots of friends here!"}
{"text":"Craving a german style schnitzel in the heart of the city? Schnitzel Queen is that spot. Each schnitzel is made to order and you have many options to choose from. On occasion, you may notice the quirky personality of the chef that works there for a good giggle while he prepares your order. It's always a welcome sight and just adds to the charm of this establishment. The schnitzels are huge and will satisfy even the biggest appetites and will have you coming back time and time again. I recommend the pork queen for a true German experience."}
{"text":"Being from Europe, I've been to Austria and Germany and sampled authentic Viennese schnitzels and Sauer kraut, something that is very different from what you find here. I came here for lunch today to try their \"authentic\" schnitzel. Me and my husband ordered on Vienna Schnitzel and one Gourmet Schnitzel. The first one is a traditional schnitzel served with lemon and a side of potato salad and Sauer kraut. The latter one came with the same sides plus mushroom sauce, roasted onion and fried bacon pieces on top. I have to say I preferred the traditional one. Don't get me wrong, the Gourmet dish tasted good but it was just a little too much happening on one plate. My husband on the other hand loved that one. The Sauer kraut is delicious, just enough acidity to elevate the flavour of the schnitzel.
Staff were friendly and welcoming and the chef himself came out and asked us how we liked the food. The one complaint I have is that there's not much variety on the menu. Every dish consists of the same type of schnitzel served with a variety of toppings such as onion bacon, sauce etc. 
Overall a good experience which is why I'm giving Schnitzel Queen a 4 star rating."}
{"text":"Just went here for the first time. Such friendly staff and incredible food. Huge portions, and well priced. Will definitely be coming back here again."}
{"text":"Still as great as the old Schnitzel Queen, but even better. Really happy for Karl that he found a new home in the same area to keep the tradition alive. And what they've done with the space is beautiful. They even have tables and nice ones! 

Other positive changes include an option to order junior sizes of all the sandwiches, as well as swapping in chicken instead of pork. (Though the chicken is 2 dollars extra). But you have to appreciate those changes for those watching their figure or junior sizes for the kids.

If you haven't been before, I'd recommend the King or the Queen. I'm a big fan of their potato salad so I usually go with the Queen. But you can't go wrong with anything at this place. My background is Austrian/German so I've had a lot of schnitzel in my day, and I can vouch for this place being totally legit. It's where I go to get my schnitzel fix."}
{"text":"A friend of mine posted a picture of a schnitzel sandwich on facebook, and when I saw it I just knew I had to go here. Today I did and I was not disappointed. Coming from an Austrian/German background, my grandmas and my mom make a lot of schnitzel and I am usually picky when it comes to it as it rarely tastes as good as home. These guys know how to make good schnitzel. I imagine all of their sandwiches would be good because of it. The one I got today though was the King (bacon, cheese, sauerkraut, and caramelized onions) and I was thinking about it 5-6 hours later still. It was delicious! Do yourself a favour and try this place out."}
{"text":"Heard about this place many times.  Absolutely amazing schnitzel sandwich.  Place is small but  service is friendly and schnitzel is freshly prepared and tasty.  Definitely recommend."}
{"text":"Finally, after 10+ years of only driving by Schnitzel Queen late at night when it's closed, I made it in after a downtown meeting to pickup their #1 schnitzel sandwich. Huge to look at, but just right in terms of the amount of food as it's thin and light-tasting with big green lettuce leaves and about 5 slices of tomato. I'm going to make more of an effort to come back again to try their other offerings, as it would be a shame to wait another 10 years for this."}
{"text":"Giant sandwiches. Giant as in it took me 2 days to eat it all. Giant as in they seem like they were forged in the Krupp ironworks, not in a tiny restaurant on Queen St E. If mighty portions are what you're after, like the fire chiefs who were in line in front of me, then this is the place.

There is a downside to eating a beast like this. For the money, I would have actually preferred a smaller, better made sandwich. I'm not a fan of the super-creamy potatoes and eating that much starch and meat in one sitting made me just want to take a nap."}
{"text":"this place caught my attention after I caught an episode of Dragon's Den where Schnitzel Queen was on asking for an investor to expand.Glad this place found their new location within the same 'hood.Think they should have at least one location in the east,and west end of Toronto.I am hoping when traffic allows,this place will have extended hours on those days only.Allowing people to come in for dinner.Like others,I really liked the food ordered:schnitzel plate I had  included their potato salad, sauerkraut,plus mushroom sauce.That potato salad was one of the better ones,maybe they can sell in a larger format for walk-in retail? In just an hour,there was steady,late lunch traffic coming in.Such a laid back environment,where you received a greeting,and could just stare at the chalkboard menu to choose your food without pressure."}
{"text":"Went for the first time this week, based on the excellent reviews. Had the king schnitzel sandwich, which was probably the best schnitzel i have ever had! Only 4 seats in the place and located in the hood, but will definitely be back!"}
{"text":"One of the best schnitzel I ever had. Big portion , super tasty potato salad! Deffinatly recommend it to schnitzel lovers . Make sure you pay for the parking since the parking ticket guys show up in a second !"}
{"text":"Those sandwiches I had there... worth every single penny. They cut the sandwhich into half, there was no time when I was able to eat both half of the sandwhich. It's big with a lot of stuff inside. Love it!"}
{"text":"Best schnitzel ever. And huge!!!! It's for two, don't try to eat it alone, you'll go into a food coma.  Such friendly service! So great!"}
{"text":"Best schnitzels in Toronto. I ordered an Vienna Schnitzel plate. It was massive. The schnitzel was probably 10 inches in diameter and was served with hand made potato salad and sauerkraut. 
My chef instructor at George Brown recommended this place to me. The chef here really cares about the food he puts out. Nice cozy neighborhood hidden restaurant vibe. I would recommend this place to everyone. More people need to eat here. Schnitzel Queen does food the right way."}
{"text":"4.5 stars

I am on a journey of finding the best schnitzel places in Toronto, so I came here. 
I can tell you...Best schnitzel ever! Its huge! Its definitely worth the wait but the only thing I couldn't get past was the bun. It just would have been 5 stars with a better bun. Nevertheless, It was still fantastic. 

I strongly recommend you pay a visit to the lovely place."}
{"text":"I used to live at Queen & Parliament and every time I walked by the Schnitzel Queen I thought it was a front for a drug ring. The tiny German sandwich shop just didn't seem quite right in the middle of Regent Park to me! But years later when I ended up dating a German, I looked up the best schnitzel places on Yelp and lo and behold, there was the Schnitzel Queen on the top of the list.  The reviews were absolutely right!! Best, biggest and cheapest schnitzel in Toronto! What a great place! Couldn't be any smaller but BIG taste coming out of this tiny kitchen! Everything is perfect, from the sauerkraut to the potato salad!"}
{"text":"Schnitzel Queen is great food in generous portions at a reasonable price.

Pork or chicken, Jr or Full size, the dinners are a great deal and come with their signature potato salad that has finely chopped pieces of pickle in it, and their sauerkraut which is a bit sweet.

They have sandwiches too, but I prefer to get the dinners and have half for lunch and half for dinner,  that is how big the portions are!

Super nice owner, and the new location is just a little west of the original location.

Plus since the previous owner retired and sold it, they now have early evening and Saturday hours!  Bonus!"}
{"text":"Schnitzel Queen = tender, tasty, thin and crispy Schnitzel with addictive potato salad and slightly sweet Sauerkraut which makes for a hefty, coma inducing meal... but so worth it.

Much like Mystic Muffin, I want to bring them my business for their warm and friendly personalities as much as the great food!

Worth making a trip down there during the short window that they are open!


October 2013 update**

New owners, same great shnitzel!

And now longer hours so you can get it for dinner as well as lunch.

The potato salad is slightly different than before but still tasty.

Same great saurkraut.

With these longer hours we will be back more often!"}
{"text":"I had a lunch meeting to organize yesterday and of course I'm still going to take the opportunity to try something new.  I'm not one to order online but I found ordering from Just Eat to be really easy and amazing selection of restaurants to choose from.  I decided to try Schnitzel Queen after reading all the great reviews on Yelp.  It's such a nice way to make a meeting more exciting with an interesting lunch.

My colleagues and I were super excited to try this new place.  It was the first time for all 3 of us.  I got the Vienna Schnitzel dinner Pork, my colleagues got the Gourmet Schnitzel dinner Pork and the Queen Schnitzel sandwich.  We all thought it was delicious.  The portions were huge and love the sides of potato salad and sauerkraut.  We asked for the potato salad and sauerkraut on the side for the sandwich because they will put it in the sandwich.  When I called them, they said that they will make an exception to put it on the side.  I'm sure that we are not the only ones who would prefer the potato salad not in the sandwich.

I would definitely order from here again!"}
{"text":"Massive quantities
Tasty food.
The cook cares about his finished product and inquires with customers after meal has been served.
Ridiculously low price.

An all around win."}
{"text":"Chicken schnitzel queen sandwich is my go to - serving is huge, chicken is tender, crispy, and not too greasy , it's perfect. Potato salad and carmelized onions in the sandwich go perfectly. Worth the wait, but I usually call ahead and go to pick up. Only wish they were open a bit later!"}
{"text":"This place is freaking delicious. If you don't like it there is something wrong with you. My go to is the the Schnitzel Supreme dinner with potato salad and sauerkraut."}
{"text":"This is one of my favourite places to eat! The chicken schnitzel sandwhich is huge ($13) so if you just want a snack, ask for half a sandwhich. It's made fresh and the venue looks like a small german beer hall. The chicken is crispy and juicy on the inside and the mayo and lettuce on a bun is a perfect combo. A bit pricey but it's my go-to lunch treat if you are around Queen and Sherbourne. It's a busy spot for the work-lunch crowd so come early or order from Ritual."}
{"text":"love dive eateries especially this gem which is the size of umm maybe a little bigger than the schnitzel sandwich i ordered. The sauerkrauts and roasted onions over lettuce and a very crispy flavourful schnitzel surely relieved my stressful day. this sandwich is massive and it was only the queen. although I don't know if the king was actually bigger in size. I've been waiting a long time to come here cause it's not open on weekends. glad I made it because it was worth every dime. and literally you can buy it in dimes. Cash only please! 

you have yourself a stress free day schnitzel queen."}
{"text":"Bernard and his wife are part of the business as the food it self. Everything on the menu is worth a try, 

You can't go wrong. From the sandwich to the gourmet meal. The potato salad completes the meal. 

Have been a customer since 2009."}
{"text":"I love getting schnit-faced at the Queen! Although I do prefer ordering the King. Sometimes with real cheese, but the fake stuff actually works here with its creaminess. It's a beast of a sandwich. Meat is tender, fried perfectly. The caramelized onions and bacon are gold. I have yet to have a better schnitzel in Toronto, every time I order one somewhere else they wither in comparison.

I find it funny that I'm a student at George Brown, literally a 3 minute walk away, and no one knows about you guys! Do some advertising with the students. Us culinary's love to eat. 

The only thing I would change is the salads. Put some flavour in the coleslaw! vinegar, celery seeds, pepper, salt!! For the potato salad, add some dijon, lemon, herbs. Trust in the spices."}
{"text":"One of the best Schnitzels in Toronto, at least in the top three.

The wonderful couple that own and operate are cute as hell with the \"lipschin\" and \"darling\" stuff.

Both chicken and veal variety of schnitzel with or in combination with a homemade potato salad, (very German, very eggy), an interestingly different coleslaw.

Maybe its because I'm always there on a scooter, or that the gentlemen has an iPhone thing ... but I find the portions large, delicious and huge value."}
{"text":"Great place. Cheap large portions. The people behind the counter are friendly. Nice bun, large tasty piece of fried pork, what else do you want for $6.00? Just wish they were open later."}
{"text":"The best, and first, $10CAD i spent on a meal in Toronto. It's a very lousy neighborhood and I got to speak with many people working in auto garages and the like around the neighborhood. But the food speaks for itself. Juicy, thin, crispy schnitzel, served with top rate potato salad and kraut.

Yeah.. totally worth my $10. Take it, any day. I've paid more in NYC for less satisfying meals."}
{"text":"Delicious and huge portion for the schnitzel sandwich and dinner platter. The owners are super friendly also."}
{"text":"I can't believe I ate the whole thing. 

Seated at what appeared to be the kitchen set of a quaint Bavarian soap opera, we watched in wonder as this tiny restaurant met the Schnitzel needs of ravenous lunch-time Queen-easters. This place did not disappoint. My schnitzel sandwich combo served with soup and a pop was a steal at $10. It would have fed two easily! But I'm larger than life and ate the whole thing. Then I came home and collapsed on my couch pinned by the weight of delicious chicken fried to perfection. 

Upon waking wrote I this review. I shall return.

Obligatory Title Pun: This place is the SCHNIT.

Menu Readability: The specials are scrawled maniacally in marker through the kitchen.

Need to mention: They're only open until 5pm.

What this place teaches me about myself: Be not fooled by my svelte frame: I'll eat you under the table."}
{"text":"It's unreal how good this place is, hands down best schnitzel I've ever had. Even the junior plates are a ton of food and are quite affordable."}
{"text":"awesome food, prices incl tax and friendly staff! it's located in a bit unsafe part of downtown but that didn't prevent us from going still and we'll be back soon!"}
{"text":"Yesterday craving for german food. Found this small restaurant near my place. Their schnitzel pork chops taste like homemade (i were so surprised) and try their mushroom sauce is so delicious because they use alot of onion enchance the flavour. Definitely come back again."}
{"text":"Food is always amazing, service is always good. They never fail to produce incredible tasting food at an affordable price. One of the few places I love to go to eat meat. Would highly recommend to anyone if you're in the area. Can't say enough good things about this place"}
{"text":"Wow - really great sandwiches for a great value. I can easily split the Queen schnitzel sandwich with a friend and be stuffed. At $6.50 each that's a damn cheap meal. We brought ours home and steamed up some broccoli on the side. Will be back!"}
{"text":"All of the rumors are true, it is *that* good here. I've been thrice and keep on getting the exact same thing. I want to spread my schnitzel wings, alas, I am laden with meat and cannot.

The Bayern is the way I go. Schnitzel sandwich with cheese and sauerkraut. The darn thing smells terrible and tastes perfect. I haven't ever come close to finishing one, and I doubt I ever will. Inside is small and sterile and mama's in the front taking your order and papa's in the back making the good schnit. 

The owners love their new found Yelp fame (http://www.youtube.com/watch?v=HUDFAWPZIDU), but now sometimes run out of the goods a little earlier than usual. Try to make it by 3pm to make sure you get your fixzel, friends. 

PEPPER PROPS to JD for that review. She's so swell!"}
{"text":"Schnitzel Queen has tender, tasty, thin, yummy and crispy Schnitzels that is as addictive as eating their potato salad. The Sauerkraut is hefty, and makes you want to sleep after over indulging... but so worth it.

Nice service that is warm and friendly + great food!

Worth making a trip down here."}
{"text":"Looking for AUTHENTIC schnitzel, made by a guy who was put on this earth to show us all how it's really done?  Go here friends. 

Pick whatever you want, chicken or pork, both are amazing.  Want potato salad?  Sure!  Sauerkraut?  No problem!  Mushroom sauce?  BACON?!  What the hell, bring it on!

Have your mind blown by the pizza sized-perfectly crispy schnitzel.  You could eat just half and be satisfied, but of course you'll stuff your face and try to finish it.

D"}
