{"text":"A very inviting place with great food and beer selection. Nestled in the Troy Hill neighborhood, very attentive, friendly, and fun staff to take your orders. The atmosphere is fantastic and the food was sublime. Enjoyed Grist House Fire on the Hill on tap."}
{"text":"Loooove this place!  Had the seitan tacos and couldn't have been happier.  Awesome food and perfect ambience.  I'm thrilled to have a cool hangout on the North Side / Troy Hill.  Think I'll be a regular."}
{"text":"The drinks were good as was the service. But the food was poorly executed. I felt as though the meal had been emptied from a frozen meal box, microwaved and then left under a heat lamp. My companion's burger was clearly a patty chiseled off a frozen stack. I described to my friend as \"fancy food, if you don't like food.\" I probably should have sent it back, but I don't think anything better would've come back."}
{"text":"Tried dinner on a Tuesday night.  We started with the catfish bites then I had roast beef sandwich and my wife had a burger.  The catfish bites were a pleasant surprise, the other two dishes were nothing to complain about but nothing to recommend either.  After adding bacon the burger was $12 and not as good as what you get at any of the specialty burger places around the city.  Overall the menu was too small.  The wait staff was very friendly but almost annoyingly positive about every drink and dish offered.  It can't be so good that it's impossible to recommend one over the other.  The cocktails were a pleasant surprise, very good and reasonably priced.  I would give this place 4 to 5 stars as a place to go for drinks.  Also great job mixing some cheap beer selection with a few micros."}
{"text":"Yes. So much yes. I grew up around this area and was fairly familiar with Billy's. I was pleasantly surprised with the remodel that is Scratch! The decor is on point and the food is to die for. I tried the melt and it was outstanding, with brie and caramelized onions. They also have some of the best poutine I've had in Pittsburgh. They have a nice selection of wines as well.  The portion sizes were generous; I wound up taking a large helping of poutine and half of my sandwich home. From my understanding, they switch the menu out fairly regularly, so I'm excited to see what they try next! I'll definitely be back!"}
{"text":"First review! Decided to write because I was so impressed with this little hidden gem in Troy Hill.   Beautiful and super quaint decor inside, sat on the dining room side. Went in for an early dinner- I recommend reservations, we didn't have them but they were able to get us seated.  Our waitress was SUPER helpful. We had looked online, (please update your website! We came for halusky and crickets, neither was on the menu!) Since we had kind of picked out what we were eating we had no idea what to get at that point. But our waitress knew exactly what to recommend, and answered all of our questions. We didn't plan on getting a big dinner but we couldn't help ourselves at that point, she made everything sound SO good. (You can really tell when someone takes pride in their job, and she was definitely proud of the food they had to offer - we were also a little taken aback at the small size of the menu, but she explained they value quality and with the small size of the kitchen they are able to make some really delicious food.)  My husband ordered the chicken liver pate and I had the soup of the day for starters. Both very tasty! I got the porchetta as my entree and my husband got the steak frites. The porchetta was delicious and like no dish I'd ever had before. The waitress told us it's a traditional Italian dish, and they cook it for 36 hours. My husband loved his steak, it was a perfect medium rare and the fries are house cut.   The drink menu was also very good! We had ordered a prosecco on draft and a cocktail called a Sexy Vamp. The cocktail was so good my husband had to get one for himself, I wouldn't share. Also very impressive was that the waitress told us that all of the signature cocktails are made with Pennsylvanian liquors and all beers are from within 300 miles.   Really, with the great food and amazing service we will recommend this to our friends and definitely be back. Just don't look to the website for menu info!"}
{"text":"We walked out after sitting unattended for 10+ minutes on a not-so-busy Thursday evening. The hostess greeted us upon arrival, and told us to sit wherever we'd like... after which we sat at a table and were ignored. Very disappointed. The hostess delivered water to the table next to us, was chatty with others, but did not acknowledge us at all after we sat down. Not a good way for a new spot to build a positive reputation. Living nearby, we wanted to support a local business, but just can't abide with such bad (non-existent) service."}
{"text":"We have never been to a restaurant that all 5 Of us have it a poor rating. Beef \"cheeks\", beef \"tongue\" Really. Are you kidding? No thanks How about some regular comfort food. We used to go to Billy's all the timeThere was always something on the menu ! I got a grilled cheese sandwich which seemed the safest and Ask for some ketchup. Was told there would be an up charge for ketchup !!!'!!!!' Wasn't even ketchup. Tasted like marinara and tomatoe paste. Eeeeee! Our friend got Stroganoff with grits and horseradish Smelled  Bad and looked bad.  It's  great to try to be different but this may be going way too far Will never ever go back.  People in the kitchen all eating while preparing your food. No thanks I'd rather not watch that while waiting for my food.  I wish them well but the six of us were in total agreement that this place was off our list of go to places  should put a screen up around the dish and food prep. It was pretty gross!"}
{"text":"I love this place. It used to be Billy's, a neighborhood bar with average bar food. The remodel is breathtaking but the friendly neighborhood service remains. They have a rotating menu (check out the website to see what's on this week) for food and cocktails, and they seem to rotate their beer selection as well. As a regular, I was at first put out by this (but what about last week's favorite??) but I've grown to enjoy the variety. Friendly, warm staff and home cooked food, what's there not to love."}
{"text":"We were visiting friends in Pittsburgh and they recommended this place.  Great spot. The service was very friendly and welcoming. The renovations were great - open and airy yet they maintained the old school charm of the original building. The food was delicious and very affordable. We ordered a number of items and shared it all. The mushroom crostini is a must order.  We also very much liked the halusky and the lamb lollipops. The tomato crostini was nice and fresh and the fish tacos were very flavorable. Finally - my husband loved the beer list.  We'd highly recommend this place."}
{"text":"Great new place on Troy Hill!  As you walk in the door you are greeted by a rustic, early 20th century restaurant  ambiance, complete with a library ladder behind the bar and reclaimed rough hewn lumber as trim.   Although service was slow and the waitress delayed taking our food order (odd decision - why not take the order and explain the kitchen i s backed up.) Once we did order our food came quickly.   I chose the Rust Belt Charcuterie platter which was large, very well,priced ($13) and extremely tasty.  My wife had the Chicken + Dumplings ($14).    Excellent taps.  I had a Dry Laag. Catherine and I had well made craft bourbon cocktails.    We will come back. This was an excellent experience, very reasonably priced and worth the trip to Troy Hill!"}
{"text":"Everything about this place is fantastic. Wonderful people, excellent food, comfortable atmosphere. Yinz go check it aght !"}
{"text":"I have to look at some of the reviews and scratch my head - me and my wife live nearby in the North Side and had heard great things from our neighbors since they opened.   We stopped in on a Friday evening after work and sat down right away. Our server was awesome - really friendly, and helpful with any questions we had.   For drinks me and my wife ordered the Bertha, which was a slam dunk...make sure you try it. To eat my wife ordered the Halusky and I went with the low country Stroganoff, one of my favorite comfort foods. Now I'm polish, and this Halusky was a creative take on the dish...a bit different than our family recipe but still delicious. The stroganoff was served over cheesy & buttery grits instead of noodles that I'm used to, but it still rocked my world. I almost licked the plate because the grits were so good, and I typically don't even like them that much. I hope they decide to start serving them as a side or by themselves!   We were both pretty hungry so we decided to try an order of the Mac and cheese with hot sauce, and we cleaned that up as well. They must have thought we had never eaten before   When we were finished Don, their owner, stopped by our table and talked with us for a bit - really nice guy and clearly interested making sure this place succeeds.   Don't let the iffy reviews throw you off, this place rocks. If you want something vegan or a huge menu, you can find that nearby in Lawrenceville.   If you want some delicious comfort food that soothes the soul, come here - its what they're good at."}
{"text":"Overall I am happy with this place. The service started off very accommodating.  Had a wonderful waitress named Lori who was attentive and sweet.  The food was awesome. The arancini was the best I've ever had. The poutine was also 5 stars. Now, after Lori's shift was over, the service went south quick. The waitress never came to check on our table and I had to flag her down each time for another drink. Not once in about 2 hours did she organically stop to check in. Will I go back? Yes. For sure. And look forward to it. Would have given a solid 4 star rating but the service overall brings my review down to 3."}
{"text":"So glad that Chef Brandon joined Scratch.  Check out his new menu!!!   I went there with four girlfriends and we were blown away by the new dishes. So fresh and so creative.  !!!"}
{"text":"Once again, I have a conversation with a friend that leads to, \"have you been to Scratch yet?\" It's easy to wax on their - best brussel sprouts I have ever eaten, or the incredible chicken and biscuit but this meal is memorable from start to finish. The ever changing cocktails, the fresh local inspired specials all the way to a few choice perfect deserts. Head up the hill. You will be glad you did."}
{"text":"This was a recommended by a colleague and I made reservations on Open Table. Despite my friends arriving 20 minutes late, I had a drink at the bar. The bar/lounge area is casual and homey with a mix of sofas and chairs along with normal bar seating.   Two things that impressed me immediately with Scratch's service was they were able to transfer the bar tab to the table, and they had tables assigned for reservations rather than overbooking and scrambling for a table. These two characteristics are becoming less common in the age of Millennial dining and it's great to see Scratch is aiming higher.   There was a wide selection of unique cocktails. In chatting with the bartender most of their spirits are sourced from smaller boutique distilleries. As a Grey Goose loyalist, he suggested a different Pennsylvania disliked vodka which was like nothing I had ever tasted.  The food could be best described as comfort food tapas. For the group of three we ordered 7 dishes which was adequate for the table. The three favorites were the brussel sprouts, chicken biscuits and fried risotto. While the group are a more intellectual healthy bunch, all had a unique presentation, flavorful seasoning and excellent texture that modernizes your grandmothers favorite recipe!  The only critique I could find was the fact they had no deserts available. Even though we were one of the first groups in, the very friendly server stated they had run out. Other than this minor detail, I'd say the food and mixed cocktails were like none other I've had. I'd place Scratch on a short list of restaurants that set a higher bar. For a split second I thought I was in New York or San Francisco... Until I walked out the door."}
{"text":"Scratch was the most pleasant dining experience I have had in Pittsburgh thus far. The space itself is a mix between a dive bar and a fancy restaurant. They had a good drink list including many \"off the beaten path\" wines and beers. The food was fantastic! We ordered a variety of appetizers. The squash was amazing, as was the haloumi (sp?). We all had different main courses. I had the skate fish and it was the perfect combination of fish and batter. The pumpkin dessert was off the charts. Wonderful service. We are excited to return and happy to have found a place in Pittsburgh that has simple, great food."}
{"text":"Went last night not expecting the completely changed menu. The food was good and the atmosphere is still amazing but it is now way too pricey! They had some fantastic dishes on the old menu- the haluski was ridiculously tasty and every cocktail I ever had was unique and delicious. Anyway, a new chef with some new ideas and new prices. The food was good but wasn't great or what we were expecting and much more expensive than we were anticipating. My husband and I had the salmon croquette which was ok, a little on the dry side. My friends are both vegetarians and had pretty limited choices, which is a change from the old menu as well. Anyway, it is still a great little spot in Troy Hill I just don't think we'll be heading back with the new menu and prices as we have other restaurants we'd rather spend that kind of money at. I think Yelp needs to change this to $$$."}
{"text":"This place is the best, hip atmosphere and great food. The Hot Chicken and Pig Fries were the best. If your into drinks and cocktails, they have mixologists behind the bar to make you drinks from yesteryear to today. I definitely suggest trying this place for cool place to get some drinks and some great food."}
{"text":"My family ate at Billy's (the former restaurant on the premises) regularly.  Walking in and seeing how the new owners remodeled ... they did a very nice job.  Gone were the 2 levels of tables ... new hardwood floors modern decor.  Then it went down hill quick.  The alcohol options were a 2 sided 8.5\" x 11\" piece of paper.  The menu had 10 items ... 7 were vegetarian.  I was dining with a carnivore.  They don't serve ice tea. No steak option.  One chicken option.  We had cheeseburgers that were ok.  The homemade pickles were interesting.  Troy Hill residents are blue collar people who would walk to the restaurant.  The owners kept a waitress and cook from Billy's... I suggest you ask them what kept the seats filled with return customers.  If your goal is yuppie bar,  at least serve yuppie bar food.  If your goal is a restaurant change the menu.  One reviewer said closed by 4th of July.  I agree."}
{"text":"First time at Scratch and it was amazing. Sustainable, delicious food made with love. Menu changes frequently but the mushroom crostini is excellent and I've never had better chicken and biscuits. Highly recommended if you're looking for something different than your usual Pittsburgh cuisine."}
{"text":"My son took me here for an early Mother's Day dinner on Thursday night 5/10/18.  First impression driving up to Troy Hill was like a movie set of the best of Pittsburgh. The neighborhood was quiet and building is regal in a royal blue! I couldn't wait to walk inside! Greeted immediately and seated to our table. Server was knowledgeable and helpful but not pushy and did not hover. From start to finish this was an amazing experience with beautiful, flavorful dishes one after another. We started off with drinks and Giardinier seasonal pickles (which by-the-way is so much MORE and NOT pickles but PICKLED), I never knew green beans, celery, cauliflower and carrots could taste so delightful! Light, refreshing and only enhanced our appetites for what was to come! We had Sweet & Sour Pork Belly and the Fresh Cod (be sure to see the pics and descriptions), side was a delicious polenta! After pleasant conversation, enjoying delightful ambience and music (not too loud so we could actually hear each other) we decided to box some of the main course to enjoy the Olive Oil Cake. OH-MY-Goodness! How divine! A crispy, yet moist, flavorful cake on its own but then had all these incredible layers of fruit, cream and warm perfect pistachios and dusted in sea salt! It hit all the taste buds with an explosion of delight! GO to this place!!! Do it now!!!! You will NOT BE SORRY. I cannot wait to go back!! Mmmm....oh, and those leftovers - the BEST leftovers EVER!!! drooling yet?"}
{"text":"Stumbled upon Scratch via OpenTable and figured we'd give it a try. Boy...was I pleasantly surprised! We had a 3 pm reservation (opentable said there were only 7 left for the night) and we were looking for a late lunch so it was perfect timing. We were actually the only people at the restaurant for the entire time we were there (3-5:30) which was shocking.   Luckily, there wasn't any other reason other than weird timing that the restaurant was empty. Our waitress recommended ordering a bunch of plates to share, which we ended up doing. The arancini were not your typical arancini...but that didn't mean they weren't delicious. They fries were obviously freshly cut: potatoey pillows of fluff (other reviewers were right though...the ketchup didn't get the seal of approval from your heinz-loving guests). The chicken tacos were great, but the best thing we had was the mixed grilled veggie platter.   I had the strawberry mojito as a drink (which they also made virgin for one of our guests) which was refreshingly delicious! I really hope they start to fill up and get the recognition they deserve...I can't wait to go back myself!"}
{"text":"Enjoyed a very pleasant evening at Scratch last night.  The atmosphere is welcoming and cosy.  Our party ordered the artichoke appetizer which was very different and delicious! The heirloom tomato salad had truly local, fresh tomatoes!  Also excellent!  We ordered the trout and the spicy lamb sausage over rice!  Both entrees were perfectly prepared and so flavorful. The green beans with the trout were a big hit!  The chef stopped at our table later in evening.  Very gracious, nice touch. We ordered the vanilla and chocolate desserts which were gone in minutes!  I liked the fact that portions were nice size not too large.  Also it was a pleasure having just a few choices for a change.  Loved the evening and will return for sure!"}
{"text":"What a cute place hidden in Troy Hill.  We went for brunch and it has such a relaxing, charming yet hip vibe. The menu is limited and I went with the pancakes made with Rivertown pineapple beer. I was pretty disappointed as you only got 2 pancakes for $9. Also the pancakes were globed with way too much cranberry sauce that was over powering. I unfortunately left still hungry. Others in my party got the chicken and biscuits which they were then out of and a very small portion. The also had poutine which was a hearty portion and a favorite at our table. The service was great, I just which the portions were bigger for the price."}
{"text":"Such good food! Great service. Lovely atmosphere. You can order everything off the menu and split it. Brussels, shishito peppers, poutine, mushroom crostini... All amazing. Can't go wrong. Would come back as the menu changes. Honestly a gem in the city."}
{"text":"A great place for unique dishes and drinks. Great staff to assist you with ordering. I will definitely return with friends. Pittsburgh has truly become a foodie haven. Scratch is certainly a great place for inexpensive good food and great unique beverages. The poutine is delicious. If you don't know what poutine is, give it a try!!!"}
{"text":"I haven't been back since my first visit but I'd like to send my love to this amazing spot. I'm sadden by so many people's distaste. It's been four months since I have been back home in the Burgh. However, I still remember the Beef Cheek stroganoff, Spatzle, and Catfish bites. So darn good, the chef polite and engaging with our table. All the staff were considerate to our requests and timely for how busy the place was. I enjoyed the vibes at Scratch and pleased to know someone is doing it right, in an area where all my family grew up."}
{"text":"My bf and I loved this place! The food was really delicious. The ambience is nice, the prices are good. We tried the whole trout and frittata. We particularly liked the trout. Not every restaurant can cook fish this good, it was amazing. The service was also really good. They were really considerate about our requests and made sure we did not wait long even though it was a busy Friday night. I tried their specialty cocktail and it was delicious! Overall, we were really happy with the experience and would be going back!"}
{"text":"had dinner and drinks at scratch f&b. food was fantastic!  I had the beef cheeks stroganof, was served over grits with mushrooms and leeks! I'd highly recommend it to anyone! Also try the \"old fashioned\" from the cocktail menu. The renovation looks incredible!"}
{"text":"Came here a second time because my first visit was so good. I'm sad to say my second visit was a great disappointment.   The wait was forever long for our party of three. I think the problem with this place (in terms of wait times) is the tables are way too large and they'll seat parties of two at tables that seat six. The menu was small before and it is still small. They replaced the Reuben with a cheese steak this time. We were expecting the quality of food to be the same but sadly, it was not. Our table ordered the soup of the day (cream of cauliflower and leek), mac and cheese, gumbo, halusky and cheese steak along with several cocktails. Of all the dishes we sampled, the soup and mac and cheese were the best. In fact, we could've licked the bowl clean after the mac and cheese. We added hot sauce to it for an additional $.50 and it was worth it. The worst was probably a tie between the gumbo and the cheese steak. The gumbo was basically a shredded beef stew, lacking much depth of flavor. And the cheese steak consisted of mostly bread. The roll they used was perhaps too thick for their small portion of sandwich makings. I remember raving about the homemade pickles before but they fell short this time. I don't think they were ready as pickles yet; this time, they were basically just slices of cucumbers. I really hope they're not cutting corners now after having found some success.   Darn. I really thought this was going to be a gem of Pittsburgh but after tonight, I will sadly not be returning any time soon."}
{"text":"I had been to Billy's many times before, and was excited to see what would replace it. Scratch doesn't disappoint. Their chicken and biscuit is incredible, and they've got a great draft selection and interesting cocktail list. They change out their menu often (a little often for my taste. I found a sandwich I loved and it was gone the next time I went...only a few days later), but I've always liked what I've gotten (with the exception of carne asada tacos, which were a little dry). The staff is very nice. We've gone for trivia on Tuesday nights, and it's been great. A really nice addition to Troy Hill."}
{"text":"I was really disappointed by this place. There were great reviews online, and everyone said great things about it, so I had my hopes up, but it was a let down. First, the menu only had about half of the things their facebook page said it would have. Nothing chicken (my BF is a little picky), no vegetable pie, etc. Basically it was burgers or halushki. Meh. The drinks weren't bad, but nothing special. I had a veggie burger, and it was really really dry. My BF had a salad and catfish bites. He was not impressed. I don't know if we were there on an off night or what, but the server was swamped, and not very attentive. I probably won't go back."}
{"text":"Wife and I went for dinner and were treated so well. Not only is the food first rate, but the staff is competent, nice and very accommodating. Cozy environment too, I highly recommend giving it a try!"}
{"text":"Scratch is a hidden gem. Visited a few times now and it is definitely one of my favorites! It has a nice, home-like atmosphere and the employees and owners really make you feel at home as well. The menu is different and tasty--I enjoyed everything I tried thus far! The drinks did not disappoint, either! Although, I have only gone for dinner, I can't wait to go there for a trivia night!"}
{"text":"I have been here three times now and was surprised by the menu on my latest visit.  Other visits had very reasonably priced comfort food options.  Not anymore.  I keep seeing recent reviews with poutine, which was no where to be found on the latest menu.   That doesn't mean the food is bad, but just not what I expected and it was much pricier for a meal than before.  The quality of the porchetta was high, but it just didn't taste that great.  Especially with honey on it.  That is just a personal preference and I guess part of it was just my disappointment at the new menu.  It seemed extra fancy and that is not the type of person that I am.  My friend got the octopus.  The portion wasn't huge (he paid double for the dinner sized portion) and he complained that it had a ton of cilantro, which he isn't a fan of.   I also HATE the small two seat tables.  They are way too long and it felt like I was really far away from my friend when we were talking.  That has been a problem since they opened.   I am still giving the place 4 stars because I think the quality of the food is high and people who like a fancier dish should check it out. I am probably not going to be back, unless they go back to something like the older menu, but I think others with different palates should give it a try."}
{"text":"Cool spot. Vintage unique decor and placeware. Friendly staff. Quick service. Small plates great for sharing. Great beer list and funky cocktails. Really tasty food. Unique takes on classic dishes. Tons of fun games to keep busy. Will certainly be back, given the rotating menu."}
{"text":"Solid 4 star meal. My husband had the fish entree and I had the game hen. Both were absolutely delicious. We split the sweet potato small plate. It had a surprising but delightful flavor profile. We also splurged on desert, which was good, but paled in comparison to the rest of the meal. Staff was very friendly and helpful. Nice ambience. My only complaint is that everything on the menu is super heavy so come prepared to leave very full!"}
{"text":"An amazing meal - our 3rd here in 2 weeks. The menu may not be extensive, but everything on it is delicious - and unique. Arancini balls from forbidden rice are a must. The steak entre is among the best that I've ever tasted.  The olive oil cake is to die for - don't leave without trying it."}
{"text":"I love this place!! Great food! Great people! Amazing DJ. I celebrated my birthday here with a big group and we had such a great time!!! Do try the Brussel sprouts and the vege tacos!!!   Will come back for sure!! Thank you to the scratch team for their amazing service!!"}
{"text":"We came here specifically because the online menu had so many vegetarian options.  Their menu was totally different from OpenTable and even their own website, which was disappointing because the vegetarian options were what was missing.  That being said, we decided to stay and try it out because I eat meat and there were some vegetarian small plates for my boyfriend.  Everything that came next is best framed from the idea that we were not happy within the first 2 minutes because of the unexpected lack of menu diversity.   My boyfriend said his drink was very good. My wine was a standard deloach Pinot noir but tasted like the bottle sat open for days. It also was a very small pour for $13 which would lead me to believe it was the last of the bottle.   My boyfriend ordered the zucchini. None of the menu items have much description about how the items are actually prepared. We asked about the zucchini and it was not well explained by the server. It was...very different. A cold marinated zucchini dish that did not work.  My boyfriend is a chef and is usually pretty tolerant of things that reimagine common agreements, but this was not good.   The ricotta with the focaccia and the olives were very good.   I made the mistake of ordering the hot chicken as an entree. It tasted off from the first bite. Either like old meat or meat that was cooked and held. It was similar to chicken you'd expect to get in Chinese takeout. I was told it was confited then breaded and fried, which it clearly was, but there's no mistaking the flavor of meat that is \"off.\"  Our server was good aside from not describing the zucchini dish very well.  She was very nice.  The menu just was very disappointing and the things we ordered that they actually cooked were bad.  I heard great things about the restaurant previously but I don't know what changed as far as the menu or the kitchen to explain our experience tonight."}
{"text":"Was here once before for brunch which was great. We own a local gym on the north side and we do a monthly burpees & brunch on the last Sunday of every month. We like to support local business in our area. So we chose Scratch & definitely was not disappointed. We had a toddler with us for brunch and the staff brought over a magnetic puzzle for her to keep entertained with. We knew we would return soon & we did but this time on Friday evening for Karaoke. It was again a very nice vibe where everyone seemed welcome. The staff was friendly and accommodating. The only thing that I would mention was that one of members asked for vodka & cranberry and was told that they have no cranberry because they like to use local-which is awesome. However another ordered vodka & oj and it was poured from a Tropicana bottle. 100% for local but just needs to be consistent"}
{"text":"Troy Hill, you got it goin' on! Well, at least in the case of brunch. I can't tell you the last time I was in Troy Hill. Maybe never. Now, I'm ready to be a regular. That's how good the brunch at Scratch was on Sunday. Amongst my group of 4 we had the Breakfast Poutine, Chicken & Biscuit, Beer Cakes and 20 hr Pork Shoulder Hash. Everyone left very satisfied, save for the Beer Cakes buyer. And I agree, they were a bit too drowned in cranberry sauce and, in general, didn't seem that appetizing. The good news for me is that I ordered the Pork Hash and it was INCREDIBLE. Pork shoulder+scallions+egg+grits+other amazing stuff = SATISFACTION. I left full and happy, and at $13, it was the most expensive thing on the menu and worth every single penny. The atmosphere at Scratch is also cozy and welcoming, and the staff is friendly and quick. Unfortunately, they don't serve decaf, which I find silly considering how easy coffee is to make. But if that's the biggest brunch problem I have, then I'm okay with that."}
{"text":"my husband and I ate at scratches the place looked wonderful the service was not very good yes it was around closing time the chef gave us an attitude we ordered two entrées my husband ordered A pot roast dinner and I ordered a dinner with chicken his pot roast dinner had four pieces  of dice sizes roast one ^ two small golf ball sizes of  my dinner consisted of four pieces of chicken that were no larger than a dice I got one carat 1 baby potatoes the total bill was $36.00, everything was Ella cart but the waitress did not recommend anything because she was in a hurry. When I seen the portions on our plates I almost had a heart attack they were smaller portions that you would receive when you order a appetizer, we left hungry and disappointed we actually stopped at get go to get something to eat because we were starving. We are not cheap,  but we would like to have a meal to eat that would satisfy  us , and we are not heavy people we are actually on the thin side , we are food connoisseurs ,and love to eat out at least four nights a week,in our cases I would definitely not recommend anyone to go there without eating first. The food was delicious but there was nothing on the plates,  pretty good food but very very small portions you will leave hungry."}
{"text":"Place sucks. Also they are not open for lunch. Why bother? Exactly, you shouldn't. Plus, only street parking is available."}
{"text":"There's no better way to put this: Scratch has some of the best food in Pittsburgh. At lower prices, too.   The food is creatively prepared and everything is delicious. It's a fun vibe, a very community minded place to gather.   If you go on Tuesday night, they have Trivia on the bar side, and it's a huge draw.   They do everything right: great presentation, locally sourced food, and excellent service."}
{"text":"I was very excited to try Scratch, unfortunately the experience fell pretty short of my expectations. Despite the great renovations made to an old building, the service was lacking and the food was mediocre.   We tried Scratch on the Tuesday prior to Christmas around 8 pm and they were jumping. What the owners have done with this place is incredible! I've been to the old Billy's Bistro and always thought that with some TLC it had a lot of potential. The owners of Scratch saw that potential and capitalized on it. It's modern, but rustic, very casual, but it still feels like you're having a cool night out. The building is split into a bar side (the bar and about 6 2-4 tops), and a dining room side, we sat in the bar side. The bar side is very loud, and could really use something to help dampen the noise.   The service was slow and gave off the air of being inconvenienced. Due to a food allergy we asked if anything on the menu was, or could be made, gluten free. The server went back to the kitchen to ask, then returned to tell us that most things on the menu are vegan. We re-stated that we were looking for gluten free options, and after another trip to the kitchen the server said \"IDK, just get a burger without a bun.\" If you don't offer anything gluten free that is completely fine, but it would have been helpful if the server could have guided us through the menu with a little less attitude.   We ordered the Brussels sprouts (delicious), their house burger with out the bun, and their Reuben. The burger patty was decent but overcooked, and the fries were heavily seasoned with black pepper and their house spice. The ketchup that accompanied the fries was more akin to tomato sauce than ketchup, but we appreciate the scratch made effort. The Reuben was tasty, but by the time it go to me the bottom slice of bread was completely sogged out, and I couldn't even pick it up to eat it.   Overall it took us about an hour and half for an appetizer and 2 sandwiches.   I'll try Scratch again, I really want to like this place, hopefully the food and service improve."}
{"text":"a nice (only) choice in troy hill.  local booze, friendly woody vibe.  nice food.  they'll keep it up too!"}
{"text":"I had a great time at Scratch with friends! We made a reservation through Open Table for an early dinner and were pleased that it wasn't too packed when we arrived - we were able to have a drink at the bar before moving to our table. The bar area has plenty of seating and a large drink menu. We loved that there was a small area to the side with board games.  The dining area is cute and we loved that each table had a different set of salt & pepper shakers and the window seats had cat pillows! We sampled several small plates and enjoyed everything. The beets had great flavor.  Scratch is a good place for a special night out. I don't think we'll be regulars, since it is a bit pricier. But we're glad we tried it out and will likely visit again to celebrate something special (or to sit and have a beer while playing board games)."}
{"text":"To risk braving the terror that is Rialto Street you better be damn good. Sadly, though Scratch was pretty decent, it was not good enough for me to risk that hill ever again."}
{"text":"We were very happy with our decision to eat at Scratch.  Service was good and not overly fussy.  Our group had the stroganoff, the haluski special for the day, and a banh mi sandwich platter with fries and homemade pickles.  All were very good, and reasonably priced.  The sour cream pound cake tasted like, and had the texture of, a cake made from scratch, a rare find at a restaurant.  The beer menu was varied, with a wide selection bottles and tap.  Personally, we liked that the menu was simple, making it easy to choose.  Hope to go back to try some of the other interesting options on the menu."}
{"text":"The ambience, food and staff were so warm and lovely. Vegetables knocked it out of the park. What a treat! Definitely get the short rib and do not overlook the heirloom tomatoes. This place is doing everything right. Will definitely be back to further explore the menu. Such an easy hop from Lawrenceville."}
{"text":"I would not recommend this restaurant for these reason: 1. Too expensive for the really small potion sizes. 2. The quality of the food was not good. 3. I patdenham78@yahoo.com$2 extra for meat on my taco... 2 strips that were tiny on 2 tacos.  Really. 4. Limited menu and bar."}
{"text":"We're from Austin TX, visiting my daughter, and all the trendy stuff was booked. Their loss, our gain! The area's a little off the usual paths, but WORTH IT. (And we know about food.) Interesting ingredients, strong yet balanced flavors, good waitstaff. Come visit!"}
{"text":"Food was delicious. Carrot soup and Brussels sprouts were very tasty.  Appreciated gluten free and vegetarian options as well as meat dishes.  Cocktails were good and about half the price that I would pay at downtown or trendy Lville restaurants.  Service a little slow but not bad and they just opened so probably will get better."}
{"text":"Very tasty needs a little bigger portions but very good. Tried cricket tacos good. Brussels sprouts very good."}
{"text":"Since it's replacing Troy Hill's flagship restaurant, Billy's, Scratch's opening has been highly anticipated. We went tonight during their opening weekend, and the suspense was worth it.  The drink menu includes fairly-priced craft beers and creative handcrafted cocktails, along with the standard Miller, Yuengling, etc. and classics like an old fashioned. The Bertha, with lemon shrub, gin, and muddled cucumber and mint, was delicious.  The food menu features creative takes on familiar recipes and ingredients, with much-appreciated vegetarian and gluten-free options. The Brussels sprout appetizer was amazing. Seriously, just order it. I also had the Vegetable Pot, an updated veggie pot pie, which was perfect comfort food that still felt healthy. The thin, crispy crust was poured over the top and well seasoned with herbs and cheese. Because there was no pie crust on the bottom or sides, it wasn't too heavy. The filling was a blend of potatoes,  carrots and peas in a creamy vegetarian gravy.   The renovation is gorgeous, with lots of exposed wood, windows and open space. The atmosphere preserves the comfort of Billy's, but with a vibe you'd expect more from Lawrenceville than Troy Hill. Live terrariums on every table, well-spaced seating, and fun touches like board games, an area with couches, a jukebox, and pinball make it feel inviting. All of the staff were super friendly, too, and checked in to chat and ask for feedback.   I'm so glad to see this place in Troy Hill. It's great to have somewhere in the neighborhood that's casual and affordable enough for happy hour and hip enough to bring friends for a fancier date."}
{"text":"I had heard that Scratch went through a menu revision so most of the things reviewed and pictured here are no longer on the menu, which is unfortunate because it looks like they HAD a great menu. As for the menu on our trip to Scratch last weekend, we were all left disappointed in the food we received. A friend tried the goulash and was unsatisfied. My husband tried the tacos and gave me a bite. They were super bland. The fish had absolutely no flavor. He asked for more sauce hoping he could resurrect them, and it did help some, but not much. Then our waitress charged us for the extra sauce which was a little surprising. The portions are also super small so I'm guessing it is intended to be more of a lite bites or tapas type establishment even though you don't see any indication of that in the restaurant or on the menus. I would have loved the Reuben, Mac n cheese, haluski, cheese steak or the other items I see pictures here on Yelp but they are no longer served!"}
{"text":"This is a place I've been to twice now. The first time was with friends to check it out and hang out. The place was packed solid and there were a few bands rotating throughout the night. I had cocktails that were well made and the staff was quite friendly. I felt like the space the bands took up was a little much for how small the bar area is, but most people didn't seem to mind.   The second time I went was last night. A friend and I went just for dinner and sat at the bar.  They had a duet playing and I felt like it was a lot nicer than the bigger bands they had the first time I was there.   For dinner I had the vegetarian tacos but requested they be placed on lettuce instead of in taco shells. They made me the most perfect lettuce shells and the tacos were declicious. Lots of flavor and the perfect texture for the tofu.  We also split the Brussels sprouts and the summer squash + eggplant. First, the squash dish was very fresh and herby, but it wasn't a total party in my mouth. I felt like it was missing something. HOWEVER...the Brussels sprouts caused a hella mouthgasm to occur. They are deep fried sprouts with a balsamic drizzle and some ricotta cheese. I couldn't stop eating them, and I actually haven't stopped thinking about them since. I need them again. And if you're reading this review, you need them also."}
{"text":"My husband and I went with his parents last night, and we had an absolutely excellent dinner.  My mother-in-law heard a while back that they had haluski, and she really wanted to try it.  Knowing that spring produce would be on its way in, I figured we were running out of chances.  When I called for reservations, I was told I was speaking with the owner, Don, who is basically the nicest guy ever.  I asked if they had haluski, and he told me that it was no longer on the menu.  I figured the menu might change often, but I knew my mother-in-law would be so sad that she'd missed it.  After chatting, he said, \"Let me talk to my chef and I'll call you back.\"  He calls me back and says, \"Your mother-in-law will eat haluski on Friday night.  Come on in.\"  They made her a beautiful plate of gnocchi and braised cabbage, which she loved, and she felt very special and taken care of. Just such a lovely gesture, but that is not the sole reason for my 5 stars.  Our whole dinner was amazing.  First, they have great cocktails, and our entire table was happy with them.  I had a sparkling daiquiri and a sazerac, and I loved both.....that sazerac was seriously awesome.  We shared the hummus and the brussels sprouts.  The hummus was smoky, smooth and delicious, and it was served with a very generous portion of really great grilled bread.  The brussels sprouts were a huge hit, served with slivers of pears, nuts, goat cheese and a cider reduction.  My father-in-law (not a lover of brussels sprouts.  at all.)  kept saying, \"I've just never tasted anything like this.  These are delicious.  I've just never had anything like this before.\"  Very generous portion, and definitely enough for the four of us to share.  I had gnocchi and escargot, and the garlic breath I'll have for days is well worth it.  The gnocchi were not gummy in the least; they were light and wonderful.  The herbal green sauce was bright and pungent, and it was perfect with the escargot; I loved my entree.  My husband and father-in-law both got hanger steak, and it was so tender and cooked perfectly.  They shared fries.  Go there and order fries.  I swear they were the best fries; they were like pillows of potatoes.  We were so full, but my mother-in-law (who was wise enough to eat half of her plate of haluski and have the rest packed up) wanted dessert, so we shared the panna cotta, which was, again, enough for the four of us to share.  It was perfect, and it was topped with pistachio crumble and blood oranges.  The wait staff is lovely, and they clearly work well together.  The restaurant is beautiful and has a great atmosphere.  There are some really unique touches in the decor.  My father-in-law remarked on the way home that he appreciated that it wasn't too loud.  We will be back soon and we will be telling our friends.  If you don't often venture to Troy Hill, start now."}
{"text":"Warm atmosphere and great food. The New York Strip steak was amazing, one of my favorite steak dishes in Pittsburgh and at a fraction of the cost compared to your upscale steak houses. The menu is limited but changes so check their website for the latest dishes."}
{"text":"Went for brunch/lunch on a Sunday. Met by an owner or manager who immediately made us feel welcome and had a great waitress. We started by sharing a chicken biscuit that was really tasty and a combination of savory and sweet. Then we had brisket hash which was tasty if light on the brisket. We were not stuffed and so decided to split a BLT.... and am so glad we did. Perfectly cooked thick bacon, great tasty tomato on delicious bread. A+.  Next step will be a return for dinner."}
{"text":"Everything that I had was AMAZING!  We started with the carrot soup and the Brussels sprouts, and they blew my mind.  For dinner, I had the hanger steak, and we also got the stroganoff, which were both out of this world.  The food is all made from scratch, and it really shows.  The cocktails are delicious, and not too expensive. The staff were kind and helpful.  The renovations that they did are incredible.  They took a very dated building, and completely redid it, making it feel very homey and inviting.  Don, the owner, and Shipwreck, the front of house manager, told me that a lot of the materials they used to renovate were recycled, which I love.  I cant wait to go back!"}
{"text":"I would give this less than one star if I could.  This was definitely the slowest service I've seen in a really long time.  We both had the burger and fries.  I'm not sure why the  staff kept saying \"Isn't the burger AMAZING?!\" because I'm pretty sure I could go to Costco and get a 24 pack of frozen burger patties and have a better meal than I did there.  Also, if you're going to charge for ranch on the side, you might want to give the diner more than a .25 ounce serving.  The fries were good but with the amount of salt dumped on them, you'll need about a gallon of water with your meal.  TLDR - Don't waste your time.  Go somewhere else."}
{"text":"Scratch was only open for 2 weeks when I wrote my review, so I wanted to update since I have been here many times since then.   This is becoming one of my favorite places in the city. Great atmosphere, a pinball machine, reasonable prices and GREAT food. The owner, Don, is usually there and is extremely welcoming and hospitable. I forgot on two different occasions to check in with my Open Table reservation before our meal, and he very kindly took care of it both times to make sure I got my points for the reservation.   I've had a few different servers and they have all been wonderful! Rich took great care of us during brunch and was so friendly and personable. Noel was our server on multiple occasions, including a huge party of 11 for dinner, and we were all SO impressed with her service!  Their cocktails are great. My favorite so far was a warm Jasmine drink that had a dried Jasmine flower that slowly bloomed as it steeped. Now, the food....OH THE FOOD. This place is great to go with a group because they offer a lot of small plate options that are great for sharing. I've had the poutine with mushroom gravy, arrancini, tacos, chicken & biscuit, brisket hash and more...and everything has been amazing. I'm constantly impressed with the menu and the quality of the food. Check it out!"}
{"text":"It's not often that you find a place that provides excellent food, drinks, and atmosphere. This place he all three. Plus, the staff and owners are good people.   Today, I enjoyed the all-day brunch - including the eggs, apple-compote pancakes, and AMAZING hash browns. AND, the cocktail list is creative and reasonable.  I'm looking forward to coming back and experiencing the super-local menu."}
{"text":"Really not worth the price. I ordered the tagliatelle.  The sauce was bland, and there were not a lot of shrimp.  My husband really enjoyed his pork belly, which is why I gave the 2 star rating instead of 1. The arancini was average, nothing special. Scratch was just no where near as tasty as other restaurants at the same price point. Overall a pretty disappointing meal.  I did like the atmosphere of the bar area, would to back for drinks only."}
{"text":"When I moved back to PGH from LA, I lived 1/2 a block from Billy's. It was a local bar with casual (and good!) dining.   Fast forward 14 years, and I know own a house on top of Troy Hill ... just up the street from Scratch. (If anyone ever tells you life doesn't come full circle, they're a liar!)   While I love local dive bars, some of the old-school places on Troy Hill can be a little scary (and I'm a tough girl). I mean no offense to my neighborhood, but really .... they are. When I have 10 friends that want to do a bar crawl, I'll go into some of them. Until then, I'll hit up Scratch, Tammy's and the Troy Hill Inn.     So, when Scratch opened, it was a breath of fresh air.  If you've read my other posts, I'm not into trendy, pretentious establishments. I like a blue collar-feeling places that serves high-quality food and drink.  While the decor and menu are a hip and trendy, the vibe is down-to-earth and people are friendly ... it still feels like the Pittsburgh I love.  Definitely try the poutine and, when you're free on a Sunday, stop for brunch. If you're into a shot and a beer, you can get a Jameson and Miller Lite for $5.50. There's always a great selection of crafts on tap, many of which are regional brews.  The prices are completely reasonable and much less in comparison with other city neighborhoods.   The sometimes have live music on Thursday night -- I think it's the third, maybe last, Thursday of the month. We've also stopped in for the Tuesday trivia. We're both smart people and feel like idiots ... it's hard! But, if you're up on your pop culture knowledge, it may be up your alley. It wasn't for us :)   My only complaint ... the bartenders aren't always attentive. I've been in when it's not that busy (5-6 people at the bar) and rather than engaging with patrons, they're chit chatting themselves. I'm cool with that ... if my beer isn't sitting empty on the bar."}
{"text":"I am sorry I didn't do a review of scratch right away because I can no longer remember what I ate, but I do remember it was good! The service was excellent as well. The thing I was most impressed by was that they had Red Star Kombucha on tap along with a good beer selection. I thought that was quite awesome! I also loved the atmosphere of the place. I will definitely return and do a better job on my review..."}
{"text":"What a great place. We were in town for a wedding, traveling from Memphis, TN, and decided to the drive around the city and explore after the ceremony. We found Scratch and we are glad we did. It was literally the best food we had while in town. It was great. We were skeptical at first since we didn't know what half the stuff was but oh man. The chicken and biscuit was incredible! The burger was fantastic and the fries were the best we've ever had. Even simple chicken fingers were perfect! The owner was extremely nice and the waitress was as well. Great friendly people with great attitudes. My wife and I highly recommend Scratch and next time we are in Pittsburgh, if we ever are, we will definitely go back."}
{"text":"Scratch is ok, but I don't know how often I will be heading back.   It's about a 2.5. I was going round up to 3 stars, but as I wrote more of the review, I realized how little I enjoyed it, so 2 it is.   Went recently for trivia night, which was fun, as most of these are around town! We met friends there after being assured there was food, and headed down for trivia and a late, much needed, dinner.   So it was cooked pretty rare (and with no asking how well you would want it cooked,)but the burger was very tasty. Though at $12 and served with 0 sides, not something I was happy to pay for and would not order again. But I was starving. My friend's poutine was pretty good too, but again. 9-10 bucks. Way too expensive for fries with gravy.   Actually, I don't know if I'd pay again for...any food on the menu? The rest of the offerings, aside from the salads-which sounded pretty good, were not things that I really enjoy. The menu was pretty limited...I'm not sure if it was that way for late night only? Or if that's just how small it is all the time. There was very little to it, not what's shown here on the yelp menu page.  The drinks were limited too. And though my signature cocktail was delicious, I had two drinks at this bar and did not feel a buzz *at all.*  And I'd barely eaten all day!  And I'm a total lightweight!  So, just order beer/wine order with care?     Our server was totally friendly, but it took 40 minutes to get our checks, pay, and leave at the end of trivia. Splitting checks is a pain and I get that, but they were not busy and it shouldn't have taken anywhere near that long. We'd been planning to hit up another bar after trivia, but when it was almost midnight as we left, I started the party killing trend and just went home.  Overall, good food but not worth the prices. I raise an eyebrow at the yelp rating of $$ (under 30pp) Good luck getting an actual meal under $30 here"}
{"text":"We went for an early dinner on NYE. The place has a really unique yet comfortable vibe and ambiance. Our server was very helpful in describing the dishes and making recommendations. The food was absolutely delicious. The main dishes were pricey given the portion size was much more like a lunch plate. That being said, it was worth the food quality.  It was REALLY cold in the bar side which is where our table was. I had my coat and gloves on. Overall I would recommend this place if you're looking for a delicious meal."}
{"text":"I really, really loved this place. If it were in my neighborhood I would eat there every week. Greeted warmly, seated promptly, service was lovely and knowledgable. We had the olives and the giardineira with our cocktails, both were perfect little bites. We then had the halloumi (which was great) and the tartine (not a good value, mostly bread, but delicious). Water glasses refilled regularly (it makes a difference!) and the wine list is all reasonably priced with good choices. Steak for him, lamb for me, both done perfectly. That salsa verde - DAMN, so good. We declined dessert because we had too many apps, but the server encouraged us to take our time and finish our wine, which I really appreciated. We will be back, Scratch (get it, back-scratch?) :)"}
{"text":"A really great place that has amazing gourmet food and frequent events!   The owner is almost always here, going up to tables and chatting it up. It's really great. It seems he works just as much as everyone else and gets his hands dirty, and is good to his employees. That makes me feel good about eating here.  The food is great and so is the staff. This is a good place to be."}
{"text":"I took my grown kids here for brunch, the food and atmosphere is so worth the trip to Troy Hill. Comfortable, great wait staff and the food was excellent. I am a picky vegetarian and found many great choices. Don't miss out on a great meal and great ambiance. I will definitely go back."}
{"text":"I love this restaurant! The food is amazing and the service exceptional. Awesome drinks, too. Great for groups or a date night."}
{"text":"Upon moving to Troy Hill a few months ago, we have been anxiously awaiting trying Scratch. Troy Hill is about to boom and Scratch is just the beginning.  I am very conflicted on how I feel about my experience. There are so many things right and so many things wrong. Let's start with the ambience... Very good! Love the rustic look they're going for. It almost reminded me of a more modern ski resort. There's so much space as well! You have your main room with the bar and dining tables, then two separate dining areas.   On to the food-- I ordered a burger and loved it. Very tasty and the fries were awesome. They use a very unique seasoning that is making my mouth water as we speak. Their ketchup is also homemade apparently. Nothing better than fries with ketchup! For ten bucks, it was a good deal and very comparable to other establishments in the city. My boyfriend ordered the haluski. It was listed under \"dinners\" on the menu so we assumed it was going to be a huge bowl. Wrong. For ten freaking dollars, he got a bowl filled with 1/4 of haluski. We couldn't believe it. Not only did it take forever to come out, but it is a shame that management feels the meal is worth that much. It honestly could have been passed off as a side. HUGE rip off. He enjoyed it, but nowhere near worth the ten bucks.   Now here's what Scratch needs to work on-- It took someone a few minutes to seat us and give us menus just to wait another five or so minutes to have the waitress come over to grab our order. Both staff members didn't come off as friendly. I felt a sense of entitlement for some reason and I didn't feel truly welcome. Almost like they were better than me. Very pretentious. I understand the place just opened and they have to work out kinks, but staff is a major MUST. Don't hire people who don't understand customer service.   Following up with food and service, because my boyfriend was obviously still hungry after his meal, he ordered a burger to go. We waited, waited and waited at our table for it to come out. Finally, we noticed a brown bag was put out on the bar. It probably sat there for about five minutes till the waitress brought it over to us. We couldn't believe that the food sat there to get cold. I understand she was the only staff member at this point, but before serving drinks to a huge party of about six people, maybe she should have rung as out and sent us on our way. No sense of urgency.   I honestly want to give this place two stars, but I'm being generous due to the quality of my burger and atmosphere. I would like to stop back for their drinks because their cocktails looked fun and decently priced. However, I may wait a few months for them to work out kinks before returning. Hopefully management reads this and takes my advice."}
{"text":"My boyfriend and I went here on a whim after hearing a few good reviews and were blown away.  The food was incredible!  The lamb sausage appetizer had an impressive texture differential and everything - from my curry entree to my boyfriend's steak - was delicious.  I was even impressed with their craft beer selection.   Our total bill for everything (drinks included) was far less than expected.  We will definitely be returning the next time we are in Pittsburgh, as this is one of the best new Pittsburgh restaurants we have gotten to try!"}
{"text":"The food was great, but a little expensive. But two appetizers and one entree was enough for two people! The beer selection is pretty good and all local breweries. I would definitely return!"}
{"text":"Nice energy with great curry of all things. I highly recommend the corn dip - so delicious !!"}
{"text":"I am newer resident of Troy Hill, but because my mother grew up here with my grandparents, I am all about supporting local business. I love seeing new faces and things come to the Hill, so this is actually my second time coming to Scratch. I will still be coming for a brunch sometime soon as it is on my to-do list!   I brought my mom here for her first time, hoping to grab a light meal and check it out. We always went to Billy's for a fish sandwich when I visited my Grandma, so it always brings back fond memories.    When we both read the menu, I truthfully had to google a lot of the food items that were listed. Slightly intimidating, and different but change isn't  necessarily a bad thing! I was looking forward to getting the poutine that I loved so much last time to see it was no longer on the menu :(  Regardless, we wound up getting two \"seasonal vegetables\" or salads.  1) The Apple - Hit the spot! (Celery, Peanut, Aged Gouda, and buttermilk) Highly recommended and delicious! As our waitress described it \"an afternoon snack in a bowl\".  2) My mom got the chicory salad. (Endives, radicchio, citrus, walnut, currant, herbs) Truly, not bad either.  Service was good, atmosphere feels like you're not on Troy Hill, but it does bring in some new people.   What I would recommend is some staple food items that are big hits at the restaurant, consistency is key! Or as someone previously wrote - a bar menu with a few Troy Hill staples (burgers, Pittsburgh salad, fish sandwich). I think that would bring in more locals.  Hoping to see to see some changes here!"}
{"text":"Ok the appetizers were ... uh gone .... absolutely delicious!! Couldn't wait to take the picture before we killed em  so original fresh scrumptious"}
{"text":"SO MUCH YES. I got the Reuben and my lady got the low country stroganoff, and they were both delicious and extremely satisfying. Friendly staff, wonderful location, generous portions. I will definitely be coming back. Highly recommended!"}
{"text":"We went here last night for a birthday dinner and our experience was incredible. My husband and I decided to go early and check out the bar and happy hour. Our bartender was fun, knowledgeable, and very nice to talk with during our bar visit. He made our first experience at the bar a great one! We tried a few cocktails and a few beers on draft. I love that they place high emphasis on Pittsburgh beers, that is just awesome. The beer that I tasted was from Draai Laag and it was delicious! The bar atmosphere is great....there are games to play, couches to sit on, magnet tiles to build with, and a pinball machine! They even have a little library. I just love that!   We had a party of 5 for dinner and made reservations so our table was ready at 7. Everything on the menu sounded amazing so it was hard to order. My husband and I thought it would be a great idea to split a bunch of items on the menu so we could try more. We started with the brussel sprouts and the poutine fries. The brussel sprouts are out of this world!! I have always been a huge fan of the vegetable, but I have NEVER experienced such a remarkable blend of flavors. WOW. I am still yearning for them this morning and I just ate them last night. Seriously...the best thing EVER. The poutine was also a delight. After we devoured that course of food, we moved onto the chicken and a biscuit. We opted to try it with the maple syrup. HOLY cow...delicious!! The definition of comfort food at its finest. The flavors blended so well together. After we inhaled the chicken and biscuit, we tried the halusky and the risotto. YUM and double YUM. I absolutely loved the flavors in the halusky. Everything meshed so well and it was delightful. The risotto was out of this world...we actually shared this with the table. Everyone loved it!   Scratch is WONDERFUL. If you are looking for a comfortable place to go for dinner or a few drinks, check it out!! It's really close to some cool breweries, too!   Thank you for a great experience!"}
{"text":"Wow.  Very pleasant surprise.  Went with another couple.  From drinks to food excellent experience."}
{"text":"I came here with friends on a Friday night for dinner.  I had been here before with some of the same friends.  We sat at the bar as it was crowded and there was over a 45 minute wait for a table.  No problem.  The service at the bar was average.  We started with drinks which were reasonably priced with which we were satisfied.  I order Brussels sprouts as an appetizer after seeing how delicious they looked on the table of other patrons.  And delicious they were.  Next came dinner.  I had the Stroganoff.  I was disappointed that the portion size was half that I remember from the last time I had the same dish.  The beef was also tough and the plate was fairly bland.  This is shadowed by the fact that the fork I was given tasted like metal with every bite. The presentation of the food on a plate was less comforting than my previous experience.  I addressed my concerns with the bartender and she was friendly and offered to bring out more grits.  My friend order the goulash.  For 16 dollars he expected a larger sized portion than the two pieces of beef and carrot on a plate.  He described the meat as slimy, flavorless, and generally terrible.  The seitan tacos were decent but took a while longer to come out as the sauce was not in on the side as ordered.  Overall we would come back for a drink due to the nice atmosphere, but the food needs some work until we will eat here again."}
{"text":"It's a very expensive restaurant situated in a dilapidated neighborhood. And it's surprising popular. We arrived as soon as they open and they already fully booked so we had to sit at the bar. The food is tasty, I ordered the lamb chop, the first bite is delicious but the bottom is a bit too oily for me."}
{"text":"This is a great restaurant and bar in a cool part of town. I had the poutine during my last visit. The fries were incredible; crispy on the outside and creamy inside. The mushroom gravy was rich and luxurious and the cheese curds were fresh and plentiful. Amazing dish which paired nicely with a local Belgium beer from Draai Laag."}
{"text":"Brunch is it! This was a seriously hearty breakfast meal worth sharing among friends. We were visiting from out of town and wanted to have  a meal together on our last day. They take reservations online which was a huge help for our group of 6. The space is cozy and kitschy with mismatched dish-ware and mugs. They also serve dinner and have a bar. The only thing that was a little wonky was the service, there were about 3 different people handling out table, but instead of a seamless flow of roles, it came across confusing to us. We had to double check a couple things after ordering, but it all worked out.  Their menu changes pretty regularly, but expect local, seasonal fare, lots of vegan, vegetarian and gluten free options in the mix too. The coffee was strong and delicious, I enjoyed a couple refills. For my meal, the omelet was a serious win. I was raving about it the whole time I was eating it. Honestly, one of the better omelets I've ever had. The eggs were perfectly cooked and fluffy with the veggies and cheese all baked into the mix - sauteed and well seasoned roasted red peppers, kale, and feta. It came paired with homemade bread. So tasty! My boyfriend enjoyed the basic breakfast plate with bacon, scrambled eggs, and pan-fried home fries (tender and semi-mashed, but crispy edges). Others enjoyed the breakfast sandwich and the pancakes. Overall, everyone was super satisfied with their meals. It was an all around great time!"}
{"text":"Wow! What a find! Nice uncomplicated menu without a dizzying array of items for drink and food, but covering all the bases for a foodie! For drinks had an Autumn Mule and a Sunrise in Roatan, both well-crafted cocktails. Had a seasonal collection of small plates, a sweet potato dish, a turkey crepenette, and a carrot, vegan dish. Finished with a pumpkin brulee for dessert. Excellent all around including the service from server Lindsay. Located in a quiet, sleepy neighborhood just a billy goat's climb off Route 28."}
{"text":"Nice little place for a drink and some pretty good food.  The bar has a pinball machine in the corner, my memory may be incorrect but I think it was a Ghostbuster machine.  Did not play it. A comfortable dining area that was not real busy when we were there.  Started with the Ripe Tomato crostini that was very tasty with brie and a balsamic glaze.  I questioned, before ordering, if the tomato was ripe and not greenhouse tasting.  Our waitress assured me that it was ripe and tasty, she was not wrong, very good tomato along with tasty cheese and a wonderful balsamic glaze.  For the main course I had the Cricket-Chorizo taco.  The taco was OK but really lacked much flavor except for the cilantro, maybe I was expecting more."}
{"text":"Let me start off by saying that I WANT to like Scratch and because of that, I am willing to let minor things slide.  My first experience at Scratch was one I would consider average. I love the concept of taking you back to eating in your grandmothers kitchen. The comfort food and mismatched place settings add to the charm. I was a little put off by the tarnished silverware, but I get it. The drinks were pretty decent, but it seemed like the bartender wasn't stirring or mixing the drinks. I realized this after I got to the bottom of my first drink. The food, however, was fantastic. I am a huge Brussel sprout fan and I feel that they have some of the best in the city.  Tonight was my second time returning to Scratch. We did not have a reservation when we arrived. When we asked for a table for two, the girl replied with, \"You don't have a reservation? We're pretty booked tonight.\" I asked if there was a wait time and if we could hang out at the bar and drink. She looked at the computer and replied with, \"Looks like it's about a thirty minute wait.\" My fellow diner point out two open tables in the bar and the girl replied with, \"Well...that one is reserved, but that other is open. Let me get someone to bus it for you.\" Already off to a bad start. We get seated and our waiter, who was also the bartender, came over and took or order. He was a delightful character, very upbeat and positive. We ordered a cocktail, soup, two appetizers, and our main courses.  My cocktail arrived and was quite good. No complaints there. This was the last time we saw our waiter. Another server brought out our food...our main courses. I politely asked for our soup and appetizers which were promptly brought out to us by two other servers. The timing of things could have just been a little better. The food was fantastic once again, however we did order the pâté which was a larger than average portion, but only came with four little baguette slices. When we asked for more bread, they gave us three more slices. Half way into my meal, my water glass was empty. It continued to sit empty through the meal, then through the twenty minutes we sat there waiting for the bartender/server to bring us our check. Literally sat there for 20-25 minutes with empty plates, no drinks, while the bartender continued chatting with his friend's. it wasn't until another waitress noticed the annoyed look on my face that she asked if we wanted our check. Finally here comes the bartender! All smiles to hand us our check! I work in customer service and I am the type of person that will still leave a tip for less than satisfactory service. But come on! Making sure a guests water glass is always full is rule number one for any serving job!! I still left a tip although I'm sure it's not what he was expecting. The last thing that really killed me was the fact that when we arrived, the host made it sound like it would be impossible for us to get a table, yet as we sat and ate, the restaurant began clearing out. To the point that it was just us and two other tables. Why did you make such a big out of the fact that we didn't have a reservation when we were clearly able to pick out our own table and the restaurant was empty by the time we finished our meal? I'm sorry. I really want to like Scratch, but the service is very lackluster.  I only gave two stars because I really think the food is fantastic."}
{"text":"Soooo this one is tough. Please let me start this review by saying when people walk into your restaurant the appropriate greeting is \" Good evening and welcome to....\" Not, \"Can I help you\" as though the garbage man came in through the dining area.. So that was strike one. This place is also not easy to find and about as far off the beaten path as you can get. Parking was also not great. So to continue on my initial contact I was asked if I had a reservation. Now that's not uncommon even at opening but after being there for over 30 minutes there were two tables. So please refer back to my comments on how you greet guests....Ok let's try and get past this... So we ordered a vieux carre and a gimlet and they were both great cocktails. I looked over the menu and please let me clarify this is in no way a two dollar sign establishment. No worries there,I have been fine dining all week. My yellp record will support this. The menu was a bit limited. We ordered some olives and the lamb rilllette as a starter. I was encouraged to order everything at once and we requested some more time. Not well received.  So after watching complimentary cocktails given out to the table next to me I am perplexed? I hope they are regulars. The server comes back to the table and asks what we would like. I say I am still waiting for the lamb rilllette... I watch her write it down and go and place the order.. why are they just placing the order?? To make it worse she points out our table to the ball hat wearing kitchen staff in shorts and the exchange does not look pleasant. Ok now I'm done. If you are.a local I guess you can try this. I'm a Native son from out of town. The rilllette was good looking and the cocktails were good but not enough to warrant a trip up this hill to have horrible service. Sorry Yelp fans keep looking"}
{"text":"Went to Stratch with 3 friends and we had a great meal. Shared a bunch of appetizers and were happy with all - especially loved the Crab Arancini, Cacio e Pepe and the chopped marinated artichokes. But, our favorite was the housemade Ricotta served with warm focaccia - it was amazing! We split the Spring Curry and it was excellent - it had some kick to it - so be aware if you don't like spicy. Overall, an excellent meal and I want to go back soon - looking forward to ordering the Ricotta, trying the lamb sausage and checking out Trivia night."}
{"text":"The food was excellent and clearly made from scratch. The menu was not large, but it seems that the smaller menu meant that each item was carefully crafted.  The atmosphere was intentional and the wait staff were great. Apparently there is karaoke on certain nights. Recommend."}
{"text":"We had a reservation at Scratch to celebrate Father's Day and my husband's promotion. The GM Don was very friendly and accommodating - even making sure that our server knew about the special occasions. All of us huge fans of small plates, we were ready to eat!  We started by ordering...nearly the entire left side of the 'Smaller Plates' section.   -- The ricotta spread (thyme, black pepper, focaccia) was so delicious, we ordered it twice.  -- The corn zeppole and dipping sauce (jalepeno, lime, crema) was a savory take on one of my favorite sweet treats.  -- The asparagus (pistachio, soft boiled egg, horseradish) paired nicely with the crab arancini (old bay, scallion, lemon).  -- The zucchini (goat cheese, almond, red onions, herbs) was just as great as the ricotta.  -- My most favorite dish was the lamb sausage (basmati, deep-fried chickpeas, lemon, pomegranate, mint), which we also ordered a second round of because we devoured it.  -- The artichoke (Caesar, parsley, chilies) was my least favorite - but that might have been because we ate it last and I was starting to get full!   Although we drooled every time a server walked by with the hot fried chicken (cayenne, pickles, buttermilk, brioche), pork belly (crushed potato, egg, Aleppo honey), and hanger steak (broccolini, sunchoke, chimichurri, paprika - a patron and staff favorite), we moved on to desserts - both of them!  -- The vanilla (cream, almond, citrus) was a cool custard dish that played a great opposite to the other desert. -- The chocolate (chocolate ganache, fluff, graham) was my favorite, with a gelatin-type consistency to the ganache, marshmallow fluff, and Cinnamon Toast Crunch-esque graham crumble.   In addition to the voluminous feast: my husband enjoyed the curated beer selection; my father, who isn't normally that adventurous when it comes to drinks, enjoyed a craft cocktail - the \"Kali\" (lavender earl grey infused Faber vodka, lemon, Wigle rosemary lavender bitters, Zardetto); and, my mom and I enjoyed many, many glasses of Zardetto private cuvee, which is ON DRAFT.  A few notes on things I think could improve: Drink orders came out pretty slow. Order timing was fairly nonexistent. At most small plates places I've loved, servers understood cook times and adjusted accordingly to not overwhelm the diner. In this case, almost all of our food came out at the same time. I would have like a slower procession and a bit more time in between dishes so we could enjoy eating. Also, until we said something, there was no A/C on a pretty warm day, which made the room a bit uncomfortable - especially since we at so much!  Overall, the food at Scratch is absolutely worth your time and money. The drink options only improve the experience. And the restaurant is impeccably decorated, with a beautiful blue color on the walls and unique art pieces everywhere. I highly recommend Scratch for your next special occasion - or for no occasion at all!"}
{"text":"One thing that I've learned recently in da burgh is that when I walk into a new place and the line-up at the bar makes me think I've stumbled accidentally into an audition for a Smith Brothers cough drop ad, that I have just actually walked into the latest hipster gathering spot.  A friend and I had just finished some car business on Troy Hill and wanted to grab a bite somewhere, and he had told me about the hipsters taking over what used to be an affordable neighborhood dive bar and restaurant and turning it all upscale. Not finding anything else nearby (because frankly, Troy Hill isn't exactly a metropolitan haven), we decided to give it a shot.  Well all you Lumberjack Skinnyjeans and your girlfriends Summerdress Winterscarfs, get ready, here is yet another place where you can spend three hours of your wages on a meal in a heightened 'atmosphere' with toy portions and a handful of fancy 'homemade sauces' in a big space in an innocuous run down neighborhood.  (insert latest FB emoticon here)  We kept it simple and ordered the cheese burger. I've not been to a burger joint in quite some time, and we didn't feel like parking downtown for Winghart's and weren't quite in the Big Top Burgatory atmosphere mood. The burgers were $10, though my friend told me they'd originally tried charging $16, and discovered that they needed to bring it down a tad. If they were serving the exact same burger that I had for $16, then my response would have to be INDEED! They did come with a side of fries, which rounded off the $10 pretty well. Winghart's charges $10 for a burger, but that burger is substantial, without a side of fries.   The plates arrived. My only real distastes were that the buns were odd...almost like a small conveyor belt bun from Mickey D's. The burger was kind of small, and actually looked like a preformed frozen patty (not quite sure how they created that flat edged, perfectly uniform disc), and the home made pickles that came on the side for adding to the sandwich, if you wanted, really were not good. And finally, ease up a tad on the rock salt on the fries.  We opted to forgo the 'home made' ketchup, and I asked for some mayo and dark mustard, as that is my preferred sauce of choice for a good burger.  The burger came with a slice of tomato, and short pile of leafy greens that looked a bit like baby spinach, and we both got them with cheese. I mixed on my mayo-mustard mix, topped the burger with the tomato and greens, and bit in. Medium-rare, just as I'd ordered it. I must say, the flavor and juices were very nice (it did not come off tasting like a frozen patty, nor was it 'grey', as frozen patties tend to be, regardless of cooking time), and it was a decent burger for the average neighborhood joint. But in a town that prides itself on creating sandwiches that require a flip-top head to get one in your mouth, they might want to examine increasing the size to at least compare with the biggest burger joints in town. If they can do twice the size for $10...well, so could anyone.  The staff was very friendly, the service was very good, and the food came in a very decent amount of time. The atmosphere was comfortable in the bigger dining room, and I could see this being a hipster haven eventually, as well as a good 'neighborhood' spot.  However...  We were not in Shadyside or the South Side. Heck, we weren't even in Bloomfield. We were in the middle of a blue-collar residential nowhere. Several years back, when I lived in Morningside, some hipsters tried opening a somewhat uppity coffee house in the neighborhood. It lasted about a year and a half. Morningside is a blue collar residential neighborhood. Poetry reading, modern angst folk songs and pretentious coffee drinks are not the heart of the neighborhood, and no matter how hard you try, Morningside was not going to be a 'destination'. Troy Hill is hardly going to be a 'destination' either.   On the other hand, Bulldog's Grille in Morningside was smart. They took a drunken nuisance bar and cleaned it up. They made it JUST 'upscale' enough to be respectable and comfortable, gave a very good product at a reasonable price (not too cheap, not too pricey), and they really created the right niche for their otherwise barren wasteland neighborhood.  I would suggest that Scratch follow an example like that to really become something awesome for the neighborhood.  Bottom line is...burger was ok...I went, I tried because I happened to be in the neighborhood. If I was back in the neighborhood, if there was nothing else nearby to try, I might go back. But I wouldn't be considering this as any kind of repeat 'destination'."}
{"text":"Stopped in last night for dinner and had a wonderful experience as usual.  The menu is regularly eclectic and you can always tell that there's love in their dishes.  I started with the riccotta appetizer. It was very light, flavorful and fresh.  It certainly did not fill me up. For my entree I had the lamb sausage over basmati rice. The roasted chickpeas added a great texture to the dish.  The only constructive criticism/request that I would put into the chef is to please always maintain at least 1 to 2 appetizers with a protein.    While there are a ton of great options now in Lawrenceville, Shadyside, downtown, etc...I'd highly recommend taking your sweetheart up to mount Troy and visit this lovely establishment."}
{"text":"Wow this place has a new menu and it is really spectacular.  We had the homemade ricotta on amazing grilled bed.  So creamy.  We loved the two salads- they are really unique- the kale ceasar and the citrus salad with pistachios (blood oranges and grapefruit) with an amazing dressing which was so light and refreshing.  The gnochi was really light and the chicken was about as tender as I have ever had with a fresh lemon sauce.  The two deserts were amazing.  I have been to some top restaurants all around the world but these deserts were the best I have had- try the smores and the panna cotta.  Delicious.  Chef Brandon is a star!!!  We love that he is changing the menu and bringing new flavors.  The decor is very comfy- a great place for a great evening with friends and family."}
{"text":"This place is awesome. The staff are very friendly, and the food is really good. Good options for vegetarians, and the music / vibe is really cool. I totally recommend Scratch"}
{"text":"this is a place that I want to succeed so badly. has a great atmosphere, good food, fun cocktails, all at outstanding prices! plus it's set up in the classic Pittsburgh working class neighborhood of Troy Hill & trying to work with the community as much as possible. the only complaint I have is a big one... the wait, we had to wait for almost an hour for our food to show up. I will still most likely go back because I want them to do well, but if they cannot figure out some more speed, it's going to be a big problem going forward."}
{"text":"4.5 stars but I'll round up!  Visited last weekend and will be back. I've read this in other reviews and it's my only reason for not giving 5 stars -I had to google a lot of the terms on the menu. I don't claim to be super well versed in culinary terms but I also get out quite a bit and some of this was beyond me. Regardless the service was great and I didn't have anything that wasn't outstanding. Our foursome got the 40 mike salad, pickled vegetables, asparagus and some other small plate (hallouli?? Something like that) and it was all outstanding. My amberjack could not have been better and the tomato/yogurt it was served with was unmatched. Owner stopped us on our way out and was nice. Supporting locals business is easy when it's this delicious."}
{"text":"This was my Bday dinner. Me and two others. We had a cocktail in bar Bartender was great met owner very nice guy. Early around 5. Had Brussel sprouts as app. Fantastic. Pasta figule soup not sure of spelling, was ok. Not my idea of the soup but was good. Stroganoff as dinner fabulous. Chicken& biscuit and a Burger and fries dessert was a cherry crisp. A real nice experience and will be back!!!! The price so affordable for great fresh different food."}
{"text":"(Updated 3/22) It looks like Scratch has updated their decor and added a little bit of bar seating! I still wish they would consider adding more bar seating, and especially wish they'd consider adding a more affordably-priced bar menu so it's a more all-purpose neighborhood spot, rather than a spot only for a rarefied, spendy night out. Kudos, though, for some nice changes at Scratch!"}
{"text":"Brussel sprouts app was beautiful and nicely flavoured . I ordered the Haluski and my date ordered a burger. Haluski was a bit too mushy for me and I feel too overpriced. Nice selection of beers and passed on desert. I'll try again as we liked hanging out by the bar to play scrabble after dinner. Not loud or noisy and you can have decent conversation without shouting ."}
{"text":"live just down the street and I was very  excited about a new venue opening up but unfortunately that was the end of my  excitement.  I've given them 3 chances to win me over and each visit was more disappointing than the previous.  All I want is a medium rare burger, a cold beer and fresh cut fries.  Tonight again my burger is medium well, the fries greasy and dry. I could barely swallow it, especially after I watched the bar manager put his fingers in his mouth and wipe them on his shirt and not wash his hands!  I asked for salt to try to improve the tasteless dry burger. It was served in a bullet which is usually used to serve sides of sauce in, who knows whose hands had been in there before mine!  I heard the bar manager talking to two gentlemen who called ahead to ask if they could watch the Penguins game. The bar manager stated that they do not show sporting events unless it's requested?? Is this not Pittsburgh \"The City of Champions\"!?? The menu keeps shrinking and shrinking.  There is only One kind of dessert.  One of the entrees is grilled cheese and I think that it's  $8.00.  If you cannot cook a burger, then you are in a lot of trouble!  I asked for bacon and mushrooms and the bartender had to make sure that they had them? I'm thinking big slabs of thick bacon, succulent mushrooms and a thick slice of cheese,  no not even close.  The menu states Pennsylvania cheddar cheese and it's shredded? Seriously? The bacon was thin and cooked in the deep fryer. The mushrooms are seasoned with the same seasoning they put on the fries. No flavor.   $10.00 for a small dry burger and a handful of nasty fries. I showed the bartender that my burger was over cooked. She asked me if I wanted another one. No. There were 7 people including me at the bar, two couples at the tables and a few people in the restaurant. 25 minutes for a burger.  She comps my $2.50 beer.  I will not be back. I'm so disappointed. I'm a chef. There's no excuse for over cooked food and unsanitary practices.  They could have had a gold mine. \"The Strip\" is 5 minutes away where they can order the freshest foods available to serve in this restaurant???  They also have forgotten to cater to the bread and butter that kept \"Billy's\" in business all those years! What they can't make local food from scratch? You have to work with the clientele that patronize Troy Hill and give them what they want, consistent fresh food at a reasonable price. The place would be packed for lunch and dinner. Run daily specials, put the damn game on and we're happy.  I'm left scratching my head. I wish them all the best but I think by the 4th of July they will be scratched out. Don't go by the reviews on Facebook because it's censored by the restaurant."}
{"text":"My friend and I recently tried this place and it was amazing. The atmosphere is killer. I loved the wall design and the separation between bar and restaurant was designed well. We are crazy and ordered all of the appetizers, why not? They all looked so good we couldn't just pick 2. Our waitress was so nice and ordered them all spaced out, time wise so we could enjoy all of the dishes hot. Let me tell you... my taste buds were having a party! I will be back.. FOR SURE. The only thing I could possibly think of that was a bummer is that my stomach wasn't big enough to consume every last bite of that delishiousness. I have no idea why everyone on yelp isn't a 5 star! This place deserves it!!"}
{"text":"Solid stuff. Used to eat at the old Billys for 15 years. Just visited recently and was actually blown away with the food. Had mushroom crostini with goat cheese  which was amazing. Tried the pork tacos , again super tasty and well made. The biggest star was by far the French fries. Honestly I would have to say that for me they were the best fries that I've ever eaten in the city in my 25 years here. Huge portion and very good. Only one thing I didn't enjoy was the home made ketchup, I can say it's either a love it or hate it thing and I didn't enjoy it at all. I would go out of my way to eat here again without question."}
{"text":"Terrible service... I waited about 10 minutes just to order a beer, literally.  The bartender was making a mixed drink on the menu which was fine, but after doing so he decided it was more important to talk to some friends (or co-workers off duty) than to help someone else waiting to get served.  Finally, a different server who randomly showed up ended up taking care of me.  My buddy showed up about another 10 minutes later, and had the same experience.  We looked at each other and could only shake our heads in disbelief.  There's not much competition in the area, at least for what this place is trying to offer anyways, maybe that's why they don't seem to care about service much."}
{"text":"Delicious food, good sized portions-- not too big, not too small. Thoughtful, creative dishes but hearty and not too fancy. We will go back!"}
{"text":"I live down the street from the \"Old Billy's\" according to some of the neighbors and I can tell you straight, this place is the bees knees. They have great beers and fancy foods. Their Reuben is the freaking truth."}
