{"text":"Location: On the quays of the Old Port - if you walk down toward the water from Place Jacques-Cartier, it'll be right in front of you. The closest subway is Champ-de-Mars.

Event: This was a special event called Chef à L'Érable - an urban version of the traditional cabane à sucre that I used to go to when I was a kid. It was complete with antlers, snow shoes, maple syrup (of course) and electronic style 'rigodons'. Very cool. The guest chef for this even that takes place until mid-April, is the well-known Laurent Godbout, owner of L'Épicier. 

Service: Pretty darn good. My booking was super easy - I emailed them and Thomas called me back less than an hour later. He was super friendly and the process went smoothly (save for a few technical issues that we laughed about later). When I arrived tonight, he knew exactly who I was and treated me like an old friend. The rest of the staff were friendly as well, and kept our plates and water glasses full. 

Food: Everything was delicious. From the pea soup to the gourmet tourtière to the maple bacon s'mores. My only negative comment is that some of the items weren't very hot. As well, certain dishes were served to the table as a whole, which made things a little awkward since we didn't know the two ladies who were sat with us. As well, the portions weren't incredibly huge when you considered they were being shared between four people. That said, I enjoyed every dish - even the boudin noir and the pork - I'm not a meat eater AT ALL, so that should tell you something! Do not be afraid of the blood sausage!

Cost: I hate to say it but this was over-priced. The cost was $60 per person and included taxes and service (so that comes out to about $78 per person). At this price, I certainly feel that the dishes should have been prepared for people who came together rather than in a communal fashion. I get the sugar shack concept -this was an annual tradition in my family - but the reality is that nowadays, people aren't half as friendly as they used to be way back when, which seems to defeat the idea of sharing a communal meal. What I will say though, is that I left thoroughly stuffed. I don't think I'll eat for a week!

Note: For this event, you need to pay in full at the time of your reservation."}
{"text":"J'ai passé une super belle soirée hier à la cabane à sucre de Laurent Godbout, située pour la 4e année de suite a la Scena au Vieux-Port. C'était la premiere fois que je mettais les pieds ici et je dois dire que c'est un endroit époustouflant. Des plafonds de 20 pieds et plus, des murs vitrés qui laissent les dernières lumières du jour baigner la salle, une terrasse offrant une vue imprenable du fleuve Saint-Laurent... Pas étonnant que ça soit un lieu populaire pour des mariages.

Dès notre arrivée, nous avons été accueillies avec un cocktail de bienvenue. La mise en place des boissons était assez ludique; des pots masons avec un fond de sirop d'érable étaient vissés sur une étagère et les serveurs attendait qu'on en dévisse un pour ensuite l'allonger avec du vin mousseux. Tout ça accompagné de popcorn maison assaisonné à la moutarde et caramel!

Full disclosure- ce n'est pas réellement une cabane à sucre. Oui, il y a amplement de sirop d'érable sur le menu mais je dirai plutôt que c'est un restaurant qui fait honneur aux produits du terroir québécois- par exemple, la plupart des alcools venait d'ici (rhum Chic Choc, gin Ungava). 

Tout comme l'apéro, le reste de la soirée était ponctuée de surprises. On s'est régalées des pilons de poulet, du canard confit, des chips de kale (lol), d'un vol au vent géant avec des morceaux de ris de veau, des boulettes de dinde, d'une soupe à base de lait de saumon fumé et uf poché... C'était bon mais on est loin des oreilles de crisses et des bines traditionnelles. Pour clouer le repas, un bar de desserts est littéralement descendu du plafond, des beignes glacés sont apparus sur des mini arbres en bois, et on a eu droit à de la tire d'érable sur du lait glacé. On a passé le reste de la soirée sur un sugar high. 

Le service était efficace et j'ai aimé le fait qu'il n'y avait qu'un seul service, alors on a pu prendre notre temps pour tout déguster. Il y avait des plats plus réussis que d'autres mais en somme on a beaucoup apprécié notre expérience et plus particulièrement la créativité du chef. J'ai déjà hâte de voir ce qu'il va nous concocter l'an prochain!"}
{"text":"Nice outdoor ambience! Perfect for summer to hang out in the old port. They have cool veggie macarrons and nice precentation in all their finger food!"}
