{"text":"My fiance and I took a trip to Montreal for my Birthday and Seasoned Dreams was our first stop after our 6 hour drive. We were extremely excited to try their food seeing that we've been following them for months and fell in love with the menu. This restaurant is in the middle of nowhere, in an industrial area filled with graffiti (not very inviting). There is little to no seating, leaving us no choice but to take our food to go. The individual who served us was extremely rude and had a very a stink attitude. He acted as if he was doing US a favor. I asked for something that was on the menu online when he replied that is an old menu and the only food they have was on the paper menu that was taped to the wall. After looking over the limited menu, we ordered Mac n' cheese with shrimp and Half jerk chicken with fries that came up to $40. We waited about 45mins in our car before our food was ready. When we got back to our hotel we immediately dived into our food anxiously and almost immediately dived back out. The food was terrible! There was NOTHING jerk about that jerk chicken (Seeing that I come from Jamaican background, I know a thing or two about jerk chicken). The \"unseasoned\" Mac n' cheese was tasteless and had 4 measley shrimp. We were definitely disappointed and will not be returning on our next trip to Montreal. Oh and the 1 star was for display because they really do a great job at making their food look edible!"}
{"text":"food is good (fries,not so much) but u have to wait minimum of 2hrs for delivery, food actually came 3 1/2 hrs late once(new record for me)...chicken / mac n cheese / wings were cold, called in offered me 10% off on a $60 order.. lady on the phone is nice tho, yet food is expensive for serving size but unfortunately the delivery wait time is too long for me to bother again. better Caribbean options around that will come in under 45ms and their 10% offering showed me the level of customer satisfaction is obviously not on their priority list."}
{"text":"The first time I went here was during poutine week to try Jae-Anthony's jerk chicken poutine. I don't know how this wasn't already a staple in Quebec, until now. I also had to try his jerk plate, which was fantastic. I've been going back consistently every month, as he creates monthly specials that are always inventive.

The portions are generous, the menu is extensive, and the staff is always a pleasure. My only gripe is the location. You can take out or get it delivered, if you don't have mobility to trek out there. But if you do, the experience is worthy of the effort. They were building a patio, which is great for the summer. However, the area is a tad on the industrial side. You're there for the food,  so judge that only. Remember, you can't eat the wallpaper."}
{"text":"First the good stuff: Seasoned Dreams really does have fantastic food - which is why it pains me to give them a poor review.  The chicken is wonderful, the mac n' cheese has great flavour and the fried plantains are awesome. 

But just like another reviewer noted, the time it takes to get your food is just unacceptable.

The first time I ordered from them was from Just Eat. According to their site, I should have received my order within 45 minutes to an hour. I got it in 2 hours.  Still, Just Eat gave me a voucher and an apology and I thought I'd give them a second chance.

This time, I called for pick-up since according to their site it would only take 35 minutes. I arrived at the store and found a huge line-up of people.  By the time most of us received our food, it had been 2 hours since we had put our order in.

One would think that at the very least, they would apologize for the excessive wait time; maybe throw in free fries or a discount. 

Nothing. Absolutely nothing. No apologies whatsoever.

We won't be going back."}
{"text":"The food is pure magic.  We were a group of 5, 3 adults and 2 kids.  We ordered the bacon mac and cheese, the pulled porc mac and cheese, 10 wings, jerk chicken breast and jerk beef ribs.  I was so good we were all taking bites off of each others plates.  The kids spoke not a word once they started eating.  The adults, we were humming and dancing around as we savored each bite.  I tell you the food is amazing. 

Now there is one note, the place is small...for now because in August they will open patio space.  But they do deliver and cater and you can always pick up.  

Anyway you can get it,  get it!!!"}
{"text":"I had been feeling rundown the last week and woke up starving and in the mood for something spicy and comforting to refuel me.

I wanted West Indian food but my car was at the mechanic's, so I couldn't drive to my usual West Indian spots.

Time to try something new....

I did a quick search online and \"Seasoned Dreams\" popped up. I remember looking through their website before and had bookmarked it but never got around to going.

I dialed and was greeted by a friendly voice, 
I placed my order for jerk pork and replaced my sides with macaroni pie and added on a side of plantains.

About 45 minutes later  my food arrived  and the smell alone confirmed I had made a great choice.

I opened up the heavy container and my eyes were happy to gaze upon a generous serving of jerked pork and a huge, cheesy portion of macaroni pie.

I dove in and my mouth was immediately rewarded with fork tender, perfectly spiced pork, sweet, caramelized plantains and luscious, cheesy,  Mac and cheese that melted in my mouth.

I greedily devoured it and said \"Oh my God\" out loud, I couldn't have asked for a more satisfying meal.

My shih tzu , Maggie, was going crazy with the smells and I couldn't resist her pleading eyes, so I gave her some as well and she thoroughly enjoyed it as well:)

I can't wait to sample other dishes and I noticed that the chef also offers cooking classes, which I plan on taking very soon!

\"Seasoned Dreams\" definitely lives up to their name, i added them to my contacts and I will be ordering from they very soon!

Thank you chef Jae , your food is amazing!!!!!"}
{"text":"Good food. Tried the jerk chicken plate.   Only complaint is it's a little overpriced for what you get especially considering the location and the fact that it's take out/delivery only.  Otherwise nothing in the plate was bad and was all well seasoned."}
{"text":"I ordered the jerk chicken poutine with the just-eat app. I ordered it at 6:30 and it arrived at 8:30... 2 hours was way too long. By the time it arrived it was fully cool to the touch. 

The chicken was extremely salty. There was a generous amount, but I could barely eat it because it was SO salty.

The delivery driver wasn't very friendly either. 

Overall not a great experience."}
{"text":"Got takeout from here and wow it was amazing.  Ended up getting jerk chicken and mac n cheese.  The jerk chicken was very moist and flavorful.  The hot jerk sauce on the side was actually spicy and enhanced the flavor of everything you put it on.  I will definitely be coming back here."}
{"text":"The only reason this place gets 3 stars is because the food is very good...however the service is the worst I've ever seen... I ordered a mac and cheese for pick up, they said come in 20 mins.i was running late and got there in about 30 mins, and it wasn't even started yet...I had to wait for 45 more minutes to get my food.

I gave it a second chance and walked in and ordered a wrap and fries. Well this time it took 55 minutes, and it wasn't even busy, the owner was talking on the phone and having conversations with I guess friends who weren't even ordering food...

I'm done with this place and it's pretty sad because as I said the food is amazing...but their service ruined the whole experience for me.."}
{"text":"I've eaten at many Caribbean restaurant over the years both in Montreal and the islands. I'm glad i found someone new around the corner that not only delivers the goods but bends backwards to make sure you are happy. I ordered lunch for our office last minute and they managed to pull it off with an exceptional variety of great tasty foods. Boyd himself delivered as their delivery person had gotten into an accident. Hat off to Chef Jae and team!"}
{"text":"I used uber eats to order in from Seasoned Dreams. I first heard about these guys at poutine fest. A group of us ordered the 2 for 22$ deal for two entrées of jerk chicken with the option of rice, fries or half and half, or salad (not listed as an option for uber eats), jerk wrap with fries and a traditional Caribbean Mac n cheese. I called up the restaurant to change my side to salad only for all the orders. 

From time of delivery to order was around 1h 30 mins. To my disappointment, they screwed up our orders and have everyone rice and fries- no salad, they also gave me Portuguese chicken instead of jerk chicken- which was too spicy! I didn't bother changing because it was already late for dinner time. Jerk was way more preferable though. The mac n cheese was the highlight of my evening - lots of cheesy goodness.

I feel like this place is hyped up for what it is - the  food quality is great but a little more attention on service and giving out the proper orders would bring it up a few stars in my books.

I don't recommend uber eats - try yul eat for delivery!"}
{"text":"To be honest the first time I tried it they were just opening and they had nothing available on the menu and the food I was able to order I didn't enjoy. This time around when we wanted to order from them and instead of saying no I said \"let's do it\" it's 2018 let's give it a another go.

Food was fantastic! 

I got the jerk burger which was a huge patty full of jerk sauce and coleslaw and lettuce and mustard. The flavours were awesome and the burger wasn't dry like most over sized parties. French fries were seasoned and soft / soggy a bit but generally good. The jerk wings were great as well."}
{"text":"Hidden gem anyone? 

Wow, I can't get over the fact that this is probably Montreal's best kept secret!
Located in a small part of town, this is the greatest jerk chicken place.

I order the jerk chicken poutine which is to die for.. also Wednesday is 1$ wing day so I also took 10 lemon pepper wings which in my view are the best deal in town.

With just enough spice, I feel like the chef here has the experience to take you to the islands and enjoy the food they have down there. 

All in All, a must if your feeling jerk chicken!

Enjoy"}
{"text":"The chicken is absolutely amazing, but as mentioned in many other comments, the kitchen can be ridiculously slow. Still worth it, but it can be frustrating to wait 25 minutes for a 30$ order when you called an hour before the pick up, especially when the cooks don't seem bothered one bit about it"}
{"text":"I got the mac and cheese, which was amazing. My boyfriend got the jerk chicken with rice which was amazing as well however the chicken wasnt hot enough, we got it warm. And he had ordered fries as well but they forgot them. But anyways everyone makes mistakes, this place serves great food and the price is right!"}
{"text":"Mac n cheese: excellent! Ils ont réinventer le goût du mac m cheese! À essayer! 

Jerk poulet: Pleins de goût (épices et herbes), mais pas assez piquant. Demander un extra de sauce.

Poulet portugais: bah...ordinaire

Griot: Bon mais gras. Tendre. Goût acceptable.

Riz aux haricots noirs: Sec. Ordinaire."}
{"text":"Une véritable trouvaille, nichée dans un secteur industrialisé du quartier Côte-St-Paul. Un comptoir, un accueil chaleureux et une cuisine des plus appétissantes vous y attend. Je vous suggère fortement le mac&cheese, tout simplement délicieux. Idem pour le poulet jerk (juste assez épicé), les bakes et la salade agrémentée de coslaw. Vous ne le regretterez pas !"}
{"text":"Updating my review. It pains me to do this. Last night it took them 3 HOURS to deliver my food. 3 HOURS. 

8pm: I call to order 1 jerk chicken breast plate and 1 classic poutine. 33$. Knowing full well I would not expect my meal before 9:30pm. I was expecting a long wait. 

9:30 comes and goes..no food. No call. 

10:15 I call to see what's up, super politely point out i called over 2h ago and when about should i be expecting my food. 5-10 minutes the lady tells me, no apologies, i thank her saying ok. 

10:30 food still not arrived. 

10:45 driver calls me to say he's really sorry but due to construction he'll be at my house in 5-10 minutes. I inform him that's what i was told 30 minutes ago. He apologizes again. I appreciate it but at this point im too hungry to care. 

10:55 food still not here. 

11:00. 3 full hours after my initial call. Food arrives. Driver is sweet and i keep my cool but i inform him they have lost our business...i tell him i am sad to do so as the food is wayyyyyyy fabulous and i really enjoy it but that 3 hours is just totally unacceptable. He says he will put a note in my file so we can have extra whatever we want next time...it's sweet but it's too little too late. I am tempted to accept the offer but...waiting until i express that i am unsatisfied after leaving it until 3 hours after i call to try and salvage the situation?? No no no. That is not customer service. Call me at 1h30 minutes MINIMUM tell me whats going on...offer to throw in a drink or a soup or a free delivery charge. Don't wait until my food is cold and it has been 3 hours and i say that i cannot accept to continue doing business that way before you realize u f'd up. 

C'mon guys ur good...but i wont be back til u fix ur service time. I can deal w 1h30 for that amazing food. 3 hours is just....i mean c'mon man: 3 HOURS?!?!?! 

Tsk tsk."}
{"text":"GUYS GUYS GUYS THIS IS SUPER IMPORTANT.

Placed an order on JUST EAT and got a callback from the manager letting me know that they were out of one of my dishes (which is great considering half of restaurants just cancel the order). She was very nice and I offered to cancel / reorder to simplify things. 

Ordered (for my boyfriend and I) a half jerk chicken (comes with two salads and fries, we swapped ours for the Mac and cheese GUYS YOU HAVE TO DO IT. ITS SO GOOD)  also ordered 2 fish cakes and bakes (fried buns) and MANGO CHUTNEY DONT FORGET IT. 

We ate more than we needed. The salads were both delicious (a different consistency in the cole slaw that WORKED), greasy toasted buns, perfectly browned fish cakes, wonderfully delicious Mac n cheese, a spicy mango chutney and Jerk chicken that was perfectly charred. 

It was $30+5 tip. $35 for 2 people who were both VERY satisfied. I'm excited to try this place in person instead of ordering delivery. Can't imagine that Mac n cheese fresh out *drool*."}
{"text":"The food here is amazing. I ordered delivery and it was still awesome. The food quality was pretty excellent. The only thing that I had a problem with was the amount of time it took for their I'd to arrive. They also has very few menu items available. Those two things were downers. Other then that amazing flavour. Very interesting and exciting take on traditional Caribbean food."}
{"text":"Aside from the fact that I drove by it about 3 times, the Jerk Berger was unreal. This was my first time there and I will go back for sure. Great service also."}
{"text":"So after reading reviews and the pics ..oh the pictures lol
It just looked so good we decided we had to try it when we come to Montreal. 
So I order mav n cheese w oxtail and my partner ordered the cardiac arrest (poutine w jerk chicken n mac/cheese).
He loved it and said it was overly spicy which was great ..I mean it's pretty hard to screw up a poutine .
As for my food..I feel like the mac n cheese wasn't as cheesy or flavourful as I expected
 It was good but just not special. Nothing to take about for sure. Same with the oxttail it was good but I've had much better..
Was worth the try ..won't be back though ..really pricey food cost about 40$+
Didn't think it was totally worth those prices."}
{"text":"I have some mixed feelings about my experience with seasoned dreams. On the plus side the prices are very reasonable (especially considering the portion size) and they offer some original options to choose from. We ordered the oxtail Mac and cheese and the jerk chicken poutine with a side of biscuits. The Mac and cheese was very good , the oxtail and the Mac complimented eachother very well and the flavours were bold but not overwhelming , this was my favourite part of the meal. The biscuits were not bad , a little on the oily/sweet side but still enjoyable, one was definitely enough though as they were pretty heavy. While I'm a big fan of  jerk chicken usually I'm sad to say that I really didn't enjoy the jerk chicken poutine because I found that I didn't taste much spice just tasted powerful lemon flavour and not much else and I found that after a few bites it was just too much and didn't combine well with the fries and cheese. BUTTT I've read other reviews where others really enjoyed this dish so it may just be a matter of preference. We ordered this for delivery and while We did wait a while for the food it wasn't an insane amount of time and the food was hot and order was correct when it arrived. I would be curious to try this restaurant in person because I feel like delivery may not do it justice. While I personally wouldn't try the jerk chicken from here again I would definitely be willing to go back for more oxtail Mac and cheese or to try their other dishes."}
{"text":"Best place for poutine. Very delicious. I love almost everything on their menu except for the mac and cheese (my taste, because some friends love."}
{"text":"Food is absolutely spot on. The owner walks in every now and then and thanked us for coming. It seems to be a place people in the neighborhood know. Jerk sauce is splendid, salad is good, mac'n'cheese is made in house, to order, rice is well steamed and not overly oily, tasty snacks to choose from salted cod to soft shell crab sandwich. All of it in this tiny deliciousness haven of Seasoned Dreams. 

But I feel like the system has to be flawed. You will be waiting a lot. Even when they say up to 45 minutes, don't expect it before the hour mark. Delivery seems a lot worse. 

I'm no chef but the open kitchen lets you appreciate the delicate art of barbecueing. I saw them make the macaroni every seemed to order from scratch and that included cooking the raw pasta. The grill remained half full even if literally every order had some jerk involved. Groups were receiving simultaneous orders at very different times. 

I do take my hat off to the scrumptious sauces, the vibe and the menu. Just don't make plans."}
{"text":"Take out food of my dreams!
I ordered the jerk chicken mac and cheese on a particularly cold day and couldn't have been more pleased: the whole thing yielded three meals for me and was deeeee-liche every time.
I picked up my food so I had the pleasure of seeing the mom-and-pop biz in the flesh and the service was quick and friendly (with the same wonderful lady that everyone else has mentioned). I will definitely be back again. And again.
If you end up visiting them the place is a little out of the way so be sure to google map the location before leaving home."}
