{"text":"Neighborhood coffee store . Does not give you a chain feeling. Prefer this over the main US brand. Super Friendly management. Everybody is greeted by name and they take care of you."}
{"text":"I had one of those crappy days when everything goes wrong and suddenly a light goes off.   Literally.  My car's low tire warning light came on and I discovered that my \"new\" tire had been installed with an old-now-leaking valve.  What does this have to do with a coffee shop,  you may ask?   I decided to wait it out for a while, calm down and see if the tire deflated further.  Second Cup would be my respite on a sunny summer morning . So tired. Could barely keep my eyes open.  Time for coffee.   This location is busy, filled with students from a nearby High School and people doing business.  Why do you need an office when there's always a  Second Cup around?   This location is tiny and they have a few chairs and tables outside on the \"patio\".  Service was friendly.  Coffee was good.  My tire did not deflate further and I went happily on my way."}
{"text":"It's been years since I've been to a Second Cup, but in the neighbourhood and in major need of a coffee, I popped into this location. The barista was friendly and cheerful - definitely sharing some of that pep! I took a quick look at the snacks, which while they looked delicious, it was a little too close to dinner for a brownie (though, is it ever not brownie time, really?). I had a small vanilla bean latte. It was a bit on the sweet side, but smooth and delicious. The espresso flavour came through nicely. $4.10 for a nice sized small (similar to a tall at Starbucks). Quick, friendly service, clean location, and good coffee."}
{"text":"The customer service was excellent but that is not nearly enough when it comes to coffee, especially when it's been consistently disappointing.   I came here during last summer a few times and ordered different things, decaf coffee (was sour), regular coffee and it was not fresh, it tasted so light in that coffee flavour as if I diluted it with water, the temperature of all the coffees I've ever ordered here were all warm.  My coffee needs to be HOT, and if McDonald's coffees are hotter than yours then you have a problem.  The most disappointing thing was their iced coffees, I always get this customize to half sweeten and they are always inconsistent at their locations, adding this one to the list.  I wish staff just would receive all consistent training across all locations. When I ask for half sweetened, I know what half sweetened should taste like but at Second Cup it's always a hit and miss, sometimes it's not enough and sometimes it's still so sweet.   I don't go to Second Cups anymore due to their inconsistency.  Quite disappointing too as this location is quite conveniently close to my mom's house when I visit her weekly."}
{"text":"I love going to this place! I've been visiting here since I was in highschool doesn't get better than that!"}
{"text":"Came in Thursday for a cup of coffee to go. It was the Paradiso and it certainly wasn't fresh. I have no problem paying a premium at Second Cup, but I do have a problem with buying stale coffee.   Better monitoring of the standing time is required."}
{"text":"Best coffee in Canada and best Second Cup of them all.  Taleen and Tristen are always so awesome, they greet you by name when you walk in, make you feel welcome and want to return time and time again.  Friendly, fast and attentive.  Beats anything Starbucks has to offer by far.  Great coffee, great flavor, smooth and flavorful, not bitter and burnt like others.  This is a highlight of my trip each time I am in the area.  Give them a shot, you will not be disappointed."}
{"text":"Wow. A Second Cup, a Future Shop, a Greek Restaurant, a No Frills, a Pizza Pizza, an English style pub, a Milestones, and a Tipsy McStagger's Good Time Drinking and Eating Emporium. The shopping complex where this Second Cup is found is like the honkey preserve in Markham.  I feel like a Museum Fremen (http://dune.wikia.com/wiki/Fremen#Museum_Fremen) here.  There's a small patio with two tables. A reasonably large inside seating area is found inside.   It's a clean and well cared for Second Cup, lacking the generally trashed washrooms found in Toronto Second Cups. Does a brisk Sunday nooner biz."}
{"text":"It's consistent here so I really have no complaints. One time my Italian soda was flat because their carbonated water tap wasn't working properly but they were happy to replace it with another drink :)   Fast service, convenient parking, and very nice staff!"}
{"text":"Average coffee thats over roasted. They didn't know how to make an espresso; It ended up coming out as some strange coffee drink. Had to send it back. Went here only out of convenience because I didn't know the area."}
{"text":"This Second Cup is located at Warden and Hwy 7.   Have a hour to kill till feeding time after shopping at Shopper's and Future Shop, I decide to come here for some Internet time.. oh yes a coffee time!   I almost walked in to the Pub right next door...I think I am definitely still in my NYC vacation mood.. having some pre dinner drink early afternoon..   This Second Cup is one of the cleaner one I visit.. I have to admit that Starbucks staffs does work harder in terms of whipping down tables and cleaning out the garbage.   Tons of outlets!! They even have this multi outlets power bars, though located at the back of the shop, at least I won't feel desperate when my laptop is running low..   No sofa or armchair seating though... but at least the chairs here are all cushioned... you know what I mean if you sit on a wooden chair for over 1 hour!!   Staffs are nice and friendly... and laughed at my silly jokes!   I am so surprised that no one in the area has write a review.. so I got my FTR too!!"}
