{"text":"I experienced this restaurant as a miss.  The best thing I had, and it was VERY good, was the made to order at your table guacamole, fresh and tasty.  Sadly that was the only thing that I thought was tasty.  The margarita special tasted like the powdered mix and not much else.  The enchiladas I had also had awful powdered tastes like everything was from a package.  I won't be going back there, too many other better Mexican restaurants around."}
{"text":"Been there multiple times and we've always had a great time and great food! Thanks!!! the pineapple bowl dish is amazing!"}
{"text":"Great food and service. Margaritas better at Fiesta Jalapeño. I will definitely return."}
{"text":"Fabulous food. Great friendly service. And all at good price. The salsa verde gets your attention and you can't best the chicken burritos."}
{"text":"The food was fresh and very good. Flavors were spot on. Service was friendly and efficient. Way above the other Mexican restaurant in the city."}
{"text":"You have to try the guacamole! They make it for you table side! It is the BEST!!!  We have been here several time now and have never been disappointed. Great food, great service, great prices!"}
{"text":"Made it grand opening weekend so the wait was kind of long but totally worth it. The servers were so friendly and funny! The food was great and the over all feel of the restaurant was warm and inviting. The owner of the place makes his way to all the tables to make sure you are enjoying to food and the service and makes small funny talk for a short time. If you're feeling Mexican food try this place out! Will definitely be going here again."}
{"text":"Good food, good price, good service. Great selection on the menu, and you'll go wild for the chicken burrito ... the sauce is fantastic!!!"}
{"text":"First time there. Excellent service. GGreat food and reasonably priced. Wonderful experience. They should put black beans on the menu though. The  green hot sauce on the table is insanely hot. Be careful."}
{"text":"Great service.  Friendly staff.  Average food.    I had the fish tacos.  I'm spoiled by some fantastic fresh fish tacos and the ones I had tonight were disappointing."}
{"text":"Good place to get good Mexican food. I had 3 tacos. One chicken, beef and pork. They were good and the cheese and onion enchilada was very nice. Guacamole, salsa & queso are great.  The al pastor tacos were just ok. I would go back again."}
{"text":"Hands down best Mexican restaurant I've ever eaten at! Service was impeccable and food was delicious! Get the seafood fajita! Huge portion, enough for lunch the following day, and perfectly cooked crab, lobster, and fish."}
{"text":"The waiter I had was awesome and he kept calling me \"my friend\".  It took me back to my time in Mexico and PR when everyone else said that to me.  The food was good and their happy hour prices are awesome!  3pm - 8pm M-Th  I will be back."}
{"text":"My husband and I have been waiting for this restaurant to open.  We went the other night and thought it was great.  It is small and cheery.  The staff were very attentive and helpful in suggesting items.  My favorite was the poblano soup, although all the food was good enough that we will be returning."}
