{"text":"Really such a terrific place. The atmosphere is very modern and clean. I've only had take out and lunch because I have small children that don't enjoy Thai, but at lunch the service was spot on and the takeout was still super hot when I came home. The food is hand prepared and top quality. The fish, chicken and shrimp are all very good and the noodles taste like they were made to order. I highly recommend!"}
{"text":"The food is really good but the service still needs improvements! The place is nice and modern."}
{"text":"Am visiting Pittsburgh for a week and this place was within walking distance from my hotel. What a gem of a place. Charming, quiet, impeccably clean, the service is very attentive and helpful and the food is . . . Oh my, the food is amazing! I had two of their specials for dinner - Mango Salad and Penang Curry with Tempura Shrimp. Both were crazy delicious! Just the right amount of spice (mild for the salad and medium for the curry). I'm sure I'll be making another visit here during my stay."}
{"text":"Finally a great little place to catch an affordable meal in this part of Shadyside. Their take-out is great, dining in is great, and the spice and flavor is for real. Definitely authentic Thai."}
{"text":"My husband and I frequent most of the known Thai restaurants around the city. We rate Senyai amongst the elite. Great ambiance, extremely clean and superb service. Pad Thai and Pad See Ew left nothing to be desired."}
{"text":"Very clean and very cute. Service was super fast and food was good. Totally recommend. Keep in mind it's byob! $1 for beer, $5 for wine. Not bad!"}
{"text":"I got take-out pad se eu and the sticky rice dessert.  The decor is beautiful and staff are friendly.  The food was good.  The pad se eu didn't have the sweetness that I've tasted from other restaurants, but it was fine (just different).  I am excited that they are in the neighborhood and I am looking forward to going back."}
{"text":"Amazing! What a nice alternative to Noodlehead....great staff and a nice place! I recommend it!"}
{"text":"The new kid on the block in Pittsburgh Thai is certainly the best. This is a sleek and cozy new Thai restaurant specializing in central Thailand styles with excellent skill at balancing seasoning and spice as well as featuring more seafood options than you may be used to. 
*updated*

My first visit we got crispy rolls and larb which were both excellent, particularly the larb (a seasoned ground beef over chopped salad). The entree was the very satisfying crab curry which was a sweet and spicy yellow curry full of generous amounts of lump crab. The flavors were spot on and intriguing and absolutely balanced between the sweet of coconut milk, salty crab bits, and spice. Wouldn't worry about getting over seasoned here... which is important because these guys know how to balance heat and flavor expertly, something I don't get many other places. 

Our second visit (review update) we got crispy rolls again and this time shared and pad Thai. While we eyed a gorgeous plate of red snapper come out to our neighboring table (and will be trying next time!!!), the pad Thai was in no way disappointing. Opting for a very clean flavor true to the noodle, protein, and peanut without lots of citrus or rooty tones like basically every pad Thai I've had in pgh, this was truly refreshing. Sauce was was just enough to keep noodle sticky but not wet the dish and packed full of spice and savoriness. 

Staff and service and cleanliness all top notch.

FYI seating is limited so either don't bring more than 4-6 without calling ahead or do take out.

Help this new place flourish! An instant shadyside classic on Ellsworth!"}
{"text":"One of the best dining experiences I've had in a long time!  The food was top notch and the service and atmosphere amazing!   Will return."}
{"text":"Amazing. Best Thai food! Delicious and fresh green curry. Unique and delicious brown rice."}
{"text":"Absolutely phenomenal Thai food and great atmosphere. Very friendly staff and timely service. I would recommend making a reservation because the seating is limited. Will definitely be going back!!"}
{"text":"Food is pretty good, but overpriced for portion size. It's a better experience to dine in rather than take out. I ordered a couple times through Grub Hub and it was ok, but the spice level wasn't consistent with other times I've eaten there."}
{"text":"Very nicely renovated place with friendly service and great food. We enjoyed dinner here with orders of the Pad Medmamuang and Pad Thai, both of which were quite delicious, and one order of the sticky rice mango which was fantastic. 

Unfortunately I don't have much experience with Thai food so my descriptions are somewhat lacking, but if you're looking for all-around solid and decent grub this place should be able to more than provide. 

Again, really enjoyed the dessert! Warm and chewy and sweet and well balanced flavor. Yum."}
{"text":"My new favorite Thai place in Pittsburgh. Great food and super clean, which sometimes do not go hand in hand, but here they do. The staff are very friendly and accommodating. Pad Thai with shrimp is my go to Thai meal and this easily tops the other big Thai restaurants everyone raves about (don't worry, it's spicy enough).  The crab rangoon appetizer is also a-must."}
{"text":"Delicious food, great service with a friendly crew, clean, pleasant, peaceful environment. Try the ginger tea after dinner if you are in the mood for a tasty winter tea!"}
{"text":"this is a fun, hidden spot in shadyside that offers a modern twist on Asian and Thai food. we ordered the summer rolls, crispy rolls, and enoki mushrooms for appetizers. for our entree we ordered the papaya salad with shrimp and pad pak with tofu. everything was seasoned well and the spice level was just enough. 

Everything we had was outstanding and I would recommend this place to others. The staff was friendly and helpful with the menu."}
{"text":"The food here is so delicious! I ordered take out - massaman curry and iced Thai green tea. The restaurant is so beautiful inside! The hostess who gave me my food was incredibly nice and welcoming. I will definitely return to sit down for a nice meal. The flavor of the curry was so wonderful, I ordered medium and probably will go for spicy next time. It was so rich and flavorful. The best massaman curry I've had since I studied abroad in Thailand. I ate every bite and I have a small appetite so I think the portion sizes could be bigger especially considering the price. The drink was good too. Can't wait to return!"}
{"text":"The service was great! We ordered Pad Thai, pineapple fried rice, Tom yum soup and crab rangoon. Everything was delicious except the soup, the mushroom just tasted raw... I wish they could do better"}
{"text":"Quality ingredients, delicious food, good atmosphere, friendly staff.
This place looks like you're eating in a modern art gallery, and each table had fresh flowers. It's pretty small but definitely not crowded. I got the shrimp pad Thai, mild spice. The shrimp qwere huge and fresh. The noodles weren't all identically wide which makes them seem more authentic to me. If I went again, I'd get medium spice.
I tried one of my friend's crab rangoons, which was made with real (not imitation) crab and came with a sweet and sour type dipping sauce. They were light and crispy, with a savory but not too heavy filling.
You definitely get what you pay for, and I had enough pad Thai left over for a whole extra meal."}
{"text":"A friend mentioned that she has heard good things about Senyai Thai Kitchen so we checked it out on a recent visit to Shadyside. The three of us ordered the Eggplant with Chicken, Pumpkin Curry with Tofu, Senyai Moo Sup with pork and the special Mango Salad with Shrimp. All four dishes were fantastic. We didn't think it could get any better but when the Custard with Sticky Rice and Taro Custard came out we were blown away. They were incredible. We had ordered a Pumkin with Coconut dessert as well, but sadly they were sold out. I guess we will have to come back :). On top of incredible food, the staff are friendly, professional, and efficient. If we didn't live south of Seattle, WA we would be back often!!"}
{"text":"This is my best Thai place in town!! Everything is fresh and taste super good! Traditional Thai. Clean. Super good service"}
{"text":"They did a great job on this place. Very clean, with some modern accents inside. 

I had the house made dumpling and chopped pork salad. 

Both were great, well priced, and served quickly. 

You know you're at the right Thai restaurant, when your server is only person speaking English."}
{"text":"An amazing Thai restaurant?Beautiful decoration and delicious food. Love the crab curry best?"}
{"text":"This is the best Thai restaurant in Pittsburgh!! The owner cooks the food with such love and it shows in every dish. It was perfection!!"}
{"text":"The atmosphere is amazing. The smooth jazz playing in the background is very relaxing. The food was fantastic. We got Pad Medmamuang and pumpkin curry. Both were very delicious. Of the many Thai restaurants we've sampled, this is top 2 if not the best."}
{"text":"The decour was very lovely and parking wasn't too difficult to find even on a busy night, but most importantly the food was delicious. We had the Tom Yum soup and the Pad Thai. Both were very good and extra spicy (as requested). Would defiantly recommend Senyai to anyone!"}
{"text":"This place is crazy good. Super fresh! If you ask for hot you get HOT!!! They even bring a plate of extra hot chili sauce in addition. Beautiful interior, great staff. A little small on inside, but adds to charm."}
{"text":"Loved this spot. We had a table in the courtyard seating area, and the owners / chefs were involved in the operations of the restaurant and were very friendly. Had the stir fry mix of veggies and seafood, and the missus had crab curry. Both were fantastic. We also had crab rangoons and a few other apps. I get the feeling I could have ordered anything and come away happy. Would definitely recommend!"}
{"text":"Sad I didn't take any pic. Was too hungry. The potion was a bit small ( for me) They got 4 stars because 1. The price is a bit high from other Thai restaurants around town. 2. The menu kinda limited. Me and my husband both ordered lunch noodle dish. They both were so good. The spice was right. If I go back to Pittsburgh, I would definitely go back there again."}
{"text":"Service is great.  Dining area is small with only tables. Good portions.  Reasonable prices."}
{"text":"The service is slow, the food is pretty OK, the portions are SMALL, prices are high for what it is. It's trendy looking on the inside, and it's Shadyside - so you've got that I guess. Travel 10 minutes away and you can do MUCH better."}
{"text":"Food tasted very good!!! I got Pad Medmamuang; it tasted quite authentic and I like that they use fried chicken to stir fry! And the staff were nice! The place is nice and clean!

However, it's a little bit overpriced, in terms of price vs the amount of food. The rice served on the side was too little. 

So I may go back because food tastes great but may not go back (often) because the price."}
{"text":"Our group stumbled upon Senyai when we stopped in Pitt for dinner on our way back home to Maryland from Michigan. I love how it's in a house - definitely a different but welcome change since we don't have too many restaurants like that in the DMV area. 

The inside was small and cozy and I really liked the interior decor, but they unfortunately didn't have room for the four of us inside at the time. Instead of telling us we had to wait, they gave us the option of sitting outside. The weather was perfect and we've been stuck in a car for 7+ hours, so we took it. We were then left to the most lovely garden area, where the staff promptly set up our table. The lady even spent a few minutes trying to position our table so it wouldn't wobble. Our servers was always attentive and nice, and it made me happy to see that they seemed to enjoy their jobs and take pride in the restaurant. Also, the bathroom is super clean. Excellent ambiance, perfect for a date or just hanging out with a few friends.

In terms of food, the portion sizes was just right. The drinks were perfectly sweet. All entrees we ordered were flavorful, seasoned right, and cooked properly - especially surprised with the calamari. It was nice to eat one and not get rubber. My favorite were the two soups we ordered. My friend got Tom Yum, which was hearty and warmed my cold soul up. And I've always been indifferent with Tom Kha until I had Senyai's..and now I'm afraid I'll never have good Tom Kha ever again. Guess I have to come back here next time I'm in Pitt oh nooooo

In short, it was a stinkin' cute restaurant with awesome food and just as awesome service. Even hours later, my heart is still so warm from seeing the staff smile so much. Can't wait until I come back."}
{"text":"I recently tried Senyai Thai Kitchen with a friend for lunch. The door was difficult to open (felt locked to me but push hard) and I was a bit confused as to whether they closed in the afternoons or not, but someone let us in and we were seated straightaway. I appreciated the light, airy exterior and high ceilings, so different from most Thai restaurants in Pittsburgh. They're BYOB as well, so don't forget the six pack or bottle of wine ;-)

We began perusing the menu and settled on an appetizer consisting of minced, cooked chicken and vegetables in little pastry shells as well as some crispy spring rolls. Both were incredible, and I'm definitely planning on sampling more of their unique appetizers in the future. My friend had the red curry with chicken and I had the pumpkin curry. Both were ordered at a medium spice level (you can specify mild, medium, or hot) and each was on the milder side of medium but very tasty. I can easily say this was the best pumpkin curry I've had anywhere, and I'll definitely try other curries on the menu going forward. My friend's dish was wonderful as well, but I preferred the flavor profile of mine. Overall I really enjoyed the service, atmosphere, and food at Senyai Thai Kitchen, and I'm so pleased there's such an exciting new Thai option in Pittsburgh."}
{"text":"Although I don't eat hot spicy I give it a try when I was going to Laundry Factory. They have some no hot spicy options too. I pick it up the food and everything was very delicious specially their fried rice and Spring rolls. The restaurant was very busy that night with wait line. I like how it is decorated and it's atmosphere, it also have outdoor tables during spring/summer."}
{"text":"Really good curry (lots of choices!) and courteous staff. Get the hottest spice level!"}
{"text":"Decided to come here while I was in Pittsburgh based on the pictures and reviews on Yelp. This place is fairly small and is decorated very modernly. 

Upon our arrival, we were not greeted at all. I had to get the host's attention and was told that we must finish our meal within an hour as they have some reservations coming. This did not bother me, it was understandable as the place is so small and we had no reservations. What kind of annoyed me was that after we sat down, they did not give us menus right away.  When we did finally receive the menus, we had them for not even one minute and the waiter came to rush us in a very harsh tone. She was very rude, unprofessional and made our meal feel very uncomfortable. 

We ordered the golden mushroom as appetizer. My sister got the wide noodles with chicken and I tried to order the papaya salad on the menu. The waiter rudely told me that they did not have papaya and the substitute was the mango salad. That was fine with me as I also love mangos. I asked for my order to be made with the highest spicy level and the waiter kept doubting my order (very annoying). The orders came out pretty quickly. The golden mushroom was fried enoki mushroom. I love enoki and thought that this would taste good. However, as the mushroom is so skinny, when it is fried, it just tasted like fried dough and barely tasted like mushroom. My sister's noodle was okay, nothing extraordinary and would taste the same at any other Thai restaurant. I did like my mango salad because it tasted fishy and authentic. The mangos were crunchy so it gave a nice texture. The portion of the salad was however very small. 

During our meal, another waiter came by to check on us and he was extremely friendly and nice. Our waiter did not come to check on us and she just looked like she was pissed the entire time. 

We finished our food within 30 mins and wanted to try out their desserts. However, as it did not feel like a pleasant experience, we decided to go get desserts at another place down the street instead. 

Overall, below par restaurant experience because of the service."}
{"text":"We have been here three times now, so it was about time that I wrote a review! I have to say that this is one of my new Thai places in Pittsburgh. Here's why: 

The first visit, we showed up on a Saturday without a reservation. They let us sit outside on their beautiful patio, with the understanding that we would have to be done by a certain time for a larger party to come in. No problem! The service was always quick and kind. 

We ordered the fresh rolls, which come with a delicious peanut sauce. I had the green curry with chicken- their curry sauce is amazing- smooth yet spicy with plenty of veggies and generous amounts of chicken. My husband ordered the crab curry, and pronounced it to be his new favorite dish at a Thai restaurant. It is BYOB, so we enjoyed our wine as the sun sank behind us. Ellsworth is a fairly quiet street, so it was a pleasant place to dine. The owner was even enjoying a meal and glass of wine beside us! He very kindly asked about our meals and our made sure we approved of everything. We absolutely did and went back twice in a month to prove it! 

Overall a lovely place, and I look forward to many more delicious meals."}
{"text":"This place is AWESOME. I keep walking by it and am glad I finally tried it. I got takeout Tom Kha soup with chicken and shrimp Pad Thai. The Tom Kha soup was wonderful, both creamy/buttery and tangy from the lemongrass--I've found a lot of the time Tom Kha soup can be one or the other and this was just perfect. The Pad Thai was also delicious, also sweet and tangy at the same time. The full shrimp without shells but still with tail meat was also a nice touch. 

They also offered me a glass of water while I was waiting for my food which I thought was very nice and is something I haven't experienced before. This will be my new go-to take our place... really pleased and excited. They have red curry with eggplant, which is possibly my favorite Thai food, so I'll be trying that next time!"}
{"text":"Newest Thai restaurant in the block, the place does have modern and clean decor. But Food - I didn't find it particularly amazing. (It is better than Thai place that used to be on Walnut) I think I'll stick with Smiling banana leaf and Noodlehead for now."}
{"text":"Smaller restaurant with great deco and ambience. We went in for lunch and it was nice and bright with the large windows in front. The food was good but a bit pricier than other Thai restaurants in the area. I ordered the crab and kale curry - very tasty but could have had more crab meat and kale for the price. My friend ordered a chicken dish with vegetables. It was tasty and a decent portion size, but not mind blowing. I was a bit disappointed that there were no lunch specials. I ended up paying $24 with tip for my crab curry, which I think is pricey for a lunch meal. Service was decent - there was one waitress who was also the hostess, she wasn't super enthusiastic but got the job done. Otherwise, I would give this place a try. They have some very vegetable focused dishes which I appreciate. Might be a good idea to make a reservation for dinner or on a weekend as the place is small."}
{"text":"Quiet, very small and hip restaurant. Very cool ceiling design. The service was great and friendly. The food was excellent. But be warned - the spiciest level is not for the weak of heart. Ordered the shrimp pad thai which was great and very nice quality. A little small of a portion in comparison to other pad thai places that I have been too. But still plenty enough food."}
{"text":"Recently, we had a lively family reunion dinner here and Senyai proved the perfect venue. Every dish we ordered -- Pad See Yew, Pad See Mao, summer rolls, crab curry -- all of it was fresh and delicious. The owners could not have been more accommodating and our waiter dealt with the (considerable) eccentricities of our party with patience, grace, and good humor. It's BYOB but never fear. There's a beer store just around the corner and a massive wine store a five-minute walk down the street."}
{"text":"Food, service, and ambience were excellent. There were not so many tables so try to call ahead. Chicken satay rocked my world. The restaurant is BYOB, and there's a six pack to go-go on the corner. Give it a shot."}
{"text":"I enjoyed a wonderful lunch here back in the fall, with my son and his girlfriend.....The restaurant is beautifully decorated, although it's small there's a wonderful inviting openness to the space

Service was pleasant, and the food arrived in a timely manner.....The Food, oh my the food!.....From the appetizers/salad, to the delicious complex flavors of the entrees everything was as beautiful as it was tasty!"}
{"text":"Best place for Thai in my book so far in Pittsburgh,  you can tell they care about their ingredients and each bite is just the right heat and flavor.  I wish they weren't a 40 minute drive from me!!"}
{"text":"I've been on the hunt for green curry this good since I moved to Pittsburgh a couple years ago. Got that delivered with the delicious, crab-filled crab rangoons. Definitely my new go-to spot for Curry cravings!"}
{"text":"Great little place in such a cute space.  This find is in Shadyside where parking is a bit of a nightmare, but it's completely worth it.  Located in a house on Ellsworth, Senyai has a lot of light and a light décor.   The chairs and tables have an Ikea-esque feel to them, but they are comfortable enough.  The service was good and they were most accommodating when we walked in sans reservation.   

I got the Pad Medmamuang, which is Crispy chicken, cashew nuts, onion, carrot and  bell pepper in a roasted chili sauce.  It was just spicy enough and plenty of food.   Next time, I will remember to BYOB - $5 corkage for wine (on the high side, but whatever) and $1 for beer.   

We will be back for sure!"}
{"text":"Got take out from here and it was delicious! Really good spice level and friendly service. Personally my favorite Thai place in Shadyside! Also a cute and aesthetically pleasing location as it's in the bottom floor of a converted house!"}
{"text":"Nice atmosphere. Very small. BYOB. Food was very good, but I have had better Thai food in Pittsburgh. Spice levels are high even for the low numbers, so glad that we didn't over do it."}
{"text":"This place is a hidden gem. I love the atmosphere it creates and the food is amazing. I'm definitely going back!"}
{"text":"It was OK. The lavender lemonade was the best part of the meal.  The service was not bad. They did not take American Express as an FYI."}
{"text":"Beautiful atmosphere and decor. Food was delicious and service was fast. It wasn't crowded around 6:00 on a weekday. Curry could've been more spicy and noodles could've been less spicy and they were asked to be the same (medium/5) but it could've just been our taste buds"}
{"text":"I love Thai, so I had to check this place out as soon as I saw it. Was not disappointed!

The decor is modern and upscale, and the floor-to-ceiling window creates a lovely atmosphere. There are only ~6 tables inside - not sure if I can bring a group, but it was great for date night.

Came in on a Tuesday evening and were seated immediately. Service was great - they are very attentive and answered my questions about the menu.

We ordered the Senyai summer roll for an appetizer - it was very lettuce heavy but the peanut sauce was delicious. I had the Pad Prik Pao and my companion had the Si-Ew. I loved my dish - the tofu was perfect, it was actually crisp on the outside and had a firm bite throughout. As a vegetarian, I eat a lot of chewy, soggy tofu, and this was so refreshing!  Medium spice was perfect for me.  My partner's Si-Ew was ordered with Mild spice (he's very spice sensitive). It had almost no spice, and he even called it bland. Either they accidentally gave him no spice or the mild is just very, very mild.

The highlight for me (after the tofu) was the mango with sticky rice! This is my absolute favorite dessert and they did it really nicely. I love the toasted sesame seeds on top - you don't always see that.

Price-wise I found it reasonable, and there are plenty of other veg-friendly things on the menu. Definitely will be back!"}
{"text":"Best Thai I've had in Pittsburgh! We had the crab fried rice and Mussaman curry- both were so amazing. The place is super clean and charmingly decorated. Make a reservation if you can, as it seemed to secure you a desirable table next to the window. Do not skip dessert! The mango sticky rice is perfection."}
{"text":"With the 5 star rating we were really excited. Very average and not worth the price. Walk down to Noodlehead!"}
{"text":"This place was such a pleasant surprise! We made reservations for our anniversary dinner as other reviewers suggested. We were a little late but they still accommodated us. For appetizers we ordered chicken satay and summer rolls, both were decent. We loved the mains- panang curry and stir fry with lemongrass both were delicious! The decor is modern and chic and the place feels pretty upscale. Our server was very nice and professional. Loved the overall experience.. will be back very soon!"}
{"text":"I have been on the hunt for some great Thai food after going to Thailand and Senyai Thai kitchen did not disappoint. The space is very unique and the ceiling is one of a kind! The service was friendly and food was served fast. My friend and I ordered spring rolls, pad Thai, and a chicken and broccoli dish. Great tasting flavor and sauces in every dish. The menu has many different options it was hard to choose!"}
{"text":"This is our favorite Thai place in Pittsburgh. It is always a fun game for us to guess what is in the food because the combination makes an exquisite dish that is pleasing to the sight and taste. 

I would highly recommand this place. Their homemade dissert is amazing as well!"}
{"text":"This is a great space. The decor is modern but it is still cozy. Food was good but some items were pushed and didn't live up to my expectation. They also only do a hot scale of 1-3. We were told that 3 was habanero hot, so we ordered everything at a 2 and it definitely lacked some heat! We started with Tom yum soup with tofu that was delicious. We ordered the summer rolls which I highly recommend. We also ordered the dumplings which we were told were a fan favorite but they never came. And the kale salad with tomatoes, avacado and apple cider vinaigrette was pushed but fell short.  For dinner, we had the panang Chicken and prik king stir fry with veggies. Both were good. Then it was suggested that we order the crab curry and the Mama kee mao. Crab curry was good but it could have used some veggies since it only came with kale. The Mama kee mao came with shrimp and squid, but the squid was a little rubbery. The noodles were ok, but remind you of cup of noodles Raman. 

$5 corkage fee for wine and $1 corkage fee for beer."}
{"text":"I ordered my meal to go and had a great experience with the food. The Tom Kha soup was delicious - one of the best I've had in a long time. The flavors were crisp and there was just the right amount of spice (I ordered mild). I have a feeling I will be dreaming of the Tom Kha soup and craving it in days to come.

My main course was the Pad See Ew. It wasn't the best I've had in Pittsburgh but still tasted pretty good. The portion size was nice, enough for me to save some for lunch the next day. The proportion of noodle to greens to tofu was better than some of the other Pad See Ew dishes that I've had in the past. 

The service was fast and easy, for takeout. When I arrived, the decor was very inviting and I'd like to go back and dine-in. Overall, a good experience that will make me come back to Senyai as my local Thai restaurant!"}
{"text":"Finally amazing Thai food in Shadyside! I got takeout on a rainy Friday night and this Thai food hit the spot. Started with the Chicken Satay- the chicken was perfectly cooked with a tasty peanut sauce. For our main, we ordered the Crab Curry which was delicious & unique- I've never had a curry like this before! It was one of the more expensive curries on the menu, but totally worth it as there was a decent amount of meat & as it was SO flavorful! Also got the Pad Kee Mao- it was so good. In addition to the noodles, it was loaded with tons of fresh vegetables. I already know that I am going to be a frequent customer here!"}
{"text":"Some of my favorite curry in the Burgh.  The restaurant itself is nice and clean and intimate.  The take-out is just as delicious as the food served at the restaurant.  This place is great!"}
{"text":"I went there early Nov 2017 and had a very pleasant experience. They have done a wonderful job of the interior design and decor of the place.  It is bright by feels warm and cozy.  At the same time, the place has lots of windows with great urban view. The service is super friendly and welcoming.  The quality of food is good and I really enjoyed that the portions are not huge.  The best part of  our experience tho was the dessert! I had green tea ice cream with sticky rice and I should say it is probably my favorite dessert in Pittsburgh.  I would definitely go back, even if just for the ice cream.  Highly recommended."}
{"text":"First time visiting this gem tonight. Decor was modern, nice cozy spot. Entree was great, appetizer extremely salty. I ordered the KRA TONG THONG - which came in a nice shell, giving the meat and vegetable mixture some texture but as I told the lady who walked up at the end, it was unrealistically salty. My girlfriend ordered Prad Prik King which was very good and I ordered the Panang Salmon, which was very rich and creamy. Might return but they needed to be more susceptible when things aren't right, like that appetizer."}
{"text":"Food was excellent and the staff was very efficient.  Started with the tom kha soup,  had the shrimp appetizer and finished the pad prik  king with chicken. Brought a chilled bottle of white since it's byob."}
{"text":"Great food, ambience, and service. Highly recommend the Pad Medmamuang (cashew chicken) and the Thai Ice Green Tea!"}
{"text":"Went here because we were looking for a new Thai place. I do have to say that the pad see ew was delicious. We also got the Pad Thai - it was ok, it tasted a bit bland and it was nothing compared to the see ew. 

Would try again and get some other items! Service was great and was a very cute establishment."}
{"text":"My thai food was perfect. I ordered 'real thai hot' and they didn't disappoint. right on the edge of being 'too hot' i loved every bite. Best thai I've had in pittsburgh so far"}
{"text":"Delicious Thai. Love the outdoor seating and that it's byob ($5 corkage). The crab curry with kale is fantastic."}
{"text":"After seeing other reviews and pictures of this restaurant, I had to stop in for a quick lunch.  Very small seating area, but incredibly clean and very nice ambience. The staff were all very pleasant with everyone of them helping each other and smiling the whole time. I sat near the back of the restaurant towards the kitchen and took a few peaks of the kitchen work space. The kitchen was just as clean as the seating area, which is always a good sign. I loved seeing one of the cooks in the back preparing food by hand very meticulously. 

I ordered the Senyai Pad Kee Mao with a spice level 3(hottest level on menu). The food was incredible, very spicy, but without overwhelming or affecting the flavor of the dish at all.  

I have had quite a few Thai places in the city (6 others, I think) and this is by far my favorite experience I have had hands down!

These people know how far customer service, cleanliness, and passion in their establishment and food can take them, and I expect them to be around for a very long time! I will be back, frequently."}
{"text":"I had mixed feelings about Senyai Thai.  We called for a reservation and when we arrived were seated prior to the reservation time but the hostess seemed inexperienced, asking if my 7 and 4 year olds needed serve-ware!  once we offered , the food took a while but was extremely delicious!  The photos on the site are extremely deceiving, this place is SMALL but if you can manage to get a seat next to the window it is fun to watch the people walking by!"}
{"text":"This is by and large the best Thai restaurant in Pittsburgh. Authentic, fresh, and absolutely delicious. I've only done take-out thus far but the atmosphere is beautiful (look up!), clean, and bright."}
{"text":"I am really happy this place opened on Ellsworth as it is a very solid restaurant! They serve fresh food, the restaurant is clean and the service was good. Everyone enjoyed their dishes. I called ahead of time and they were able to put us down so that our wait was shorter when we arrived. 

The only reason I am docking a star is because I thought it was slightly pricey for the quality and portion size. I thought the quality and portions were good, but not so noteworthy that the price was justified."}
{"text":"So happy I found this place. The food was great and the owners were very nice and welcoming. Definitely worth going to. Also, byob was a nice plus. Go, you won't regret it!"}
{"text":"Sat outside and loved the vibe! The most authentic Thai food I've had in pittsburgh by far. The service was also great"}
{"text":"my friend and I were on our way to another restaurant, saw this and decided to give it a try. Quick good service, cute decor and fresh food. I had the lemongrass salad with grilled tofu, the summer rolls, and my friend and I hadddd to get the crab rangoons. All so delicious, I also got the thai iced green tea. It was a good quick affordable meal. It is also BYOB, always a plus!"}
{"text":"Great atmosphere, service and the Food is AMAZING!!! PAD SI-EW was delicious. The crispy rolls to start were also very good.  I wanted to drink the dipping sauce..lol   Very calm and relaxing and clean atmosphere. It's tucked away in Shaddy side but it's definitely a spot you need to try"}
{"text":"I would trade my massage with Abby practice with their staff. Their food is delicious and the restaurant Feng shui is spot on! The spicy fried rice with green beans ( ask for them for extra $) is phenomenal. I would go there just to drink blue lemongrass tea with my friends. Mmm a blue hot tea for kapha dosha."}
{"text":"I've been there twice. Once when first opened, & again,just recently. It's the best Thai food I have had in Pgh.. Very clean, & reasonably priced. They now have outdoor seating for warmer weather.I hope they are successful, as it's really good."}
{"text":"I went here a few weeks after it opened, so things may have changed since I came. I went with two other friends on a Friday night, so naturally it was pretty busy, and we were told it was a 45 minute wait. The servers were all pretty personable and friendly, but the wait was just too long for me. If I had to wait the same amount of time in the future, I'd probably not eat here. We ended up going to the nearby liquor store and getting a few ciders and drinking it while waiting since we were both bored and hungry.

So here's the thing: the reason why the wait time is so long is because a lot of the parties are there with groups and are socializing over bottles of wine. Even though they finish their food, they are just chatting and drinking the wine, which ends up taking quite a while. So that's one thing to look out for.

I got the pad thai, which tasted great! I have no complaints about the quality of the food, which was high. It was just too small for big boys like me. I finished it in around five minutes after waiting a little over and hour, partially because I was so hungry. 

The atmosphere was good, the place looks like a house and has a nail salon on the top but overall a nice feel if you're with friends."}
{"text":"Nicest staff. BEST GREEN TEA DRINK I EVAAAA HAD (the Thai iced green tea). So so so yummy. I ordered Crab Curry cause ma bf treated me to dinner hehe. Has jumbo lump-crab meat and kale with southern-style coconut yellow curry. He ordered the Grapow with chicken I think? Has green bean, carrot, bell pepper, basic spicy garlic sauce. Pretty solid meal! Pricier than other Thai places in Pittsburgh, but worth it. Service was fast. No issues."}
{"text":"We just had lunch at Senyai and I can't wait to go back. The space is bright and airy at lunch time; can't wait to see it at dinner.
We started with kra tong thong, \"Herbed minced chicken, sweet corn, carrot in pastry crispy shells.\" (Also has peas.) These were wonderful little morsels in a phyllo-like mini-cup that don't overfill you before your main meal. I had grapow kai krop, \"Stir-fried, crispy-chunk chicken, green beans, carrot and bell pepper in spicy basil sauce.\" This is a spicy dish and the heat level option on the spicy food is 1-3. I love HOT, so I ordered 3, expecting a \"Pittsburgh hot,\" which is not very hot at all. This was nicely spicy -- enough to give a little burn (to me, at least) but not so much that all you tasted was HOT! This was very, very good and another dish I would order again, if it weren't for the 20 other dishes on the menu I want to try.
My husband got spicy fried rice, \"Stir-fried spicy garlic sauce with egg, mixed with steamed jasmine rice, carrot, bell pepper, onion and basil. Delicious. About a 7-8 on the typical scale of heat in Pittsburgh.
I also had the homemade purple lemonade, which was slightly floral (lavender maybe?) and not at all sweet. Put some gin in it and you've got a great cocktail! Speaking of which, the place is BYOB with a corkage fee and has take-out menus.
We will definitely go back and take friends along in the near future."}
{"text":"Fast service and really tasty.  The spice rating is a bit conservative - I got a medium spice level dish and it was pretty mild."}
{"text":"The food is DELICIOUS! Got three different main dishes (eggplant, pumpkin curry, and senyai moo sup) as well as a mango salad and every dish was amazing. And the desserts (custard with sweet sticky rice and taro custard) somehow managed to even top the main courses. Absolutely delicious food, and very reasonably priced too! Highly recommend coming here- I will definitely be back."}
{"text":"Best Thai food I've had in a while! The flavors are so complex and I looooove that their spicy food is actually very spicy. You can ask for different levels of spice too.

I was just in town for the weekend attending a graduation, but I know if I lived in Pittsburgh I would be a regular here 100%."}
{"text":"Wonderful. Colorful. Delightful. Fragrant. Delicious. Some of the best Thai food is presented by an accommodating and attentive staff that strikes a perfect balance between good service and  friendliness. I am hesitant to say how great Senyai is out of concern that I'll draw crowds with which I'll have to compete for seating.  However, keeping  this one to myself would be downright criminal. Even the decor is  tasteful! And p.s.- keep that special hot pepper powder on my table every time!"}
{"text":"We decided to try this place because of the reviews. We thought this place was cute. What we ordered: a Tom Kha, Lemongrass Salad, and Red Curry. What they brought out for soup: a Tom Yum, and then when we said we ordered a Tom Kha the waitress wanted to tell us we were wrong so we just ordered another Tom Kha. What we thought of the food:

Tom Kha - Good flavor, but had cabbage in it, which was a little different than an authentic Tom Kha. 
Tom Yum - Had good flavor as well. 
Lemongrass Salad - Wasn't worth it. There wasn't much going on. I would pass on this one.
Red Curry - Needed more curry flavor. Just tasted like coconut. I would pass on this too.

We had to pay for the extra Tom Kha. Anyway, seems like the only thing we enjoyed here was the Tom Kha and the Tom Yum. Spicy also isn't very spicy here. I probably won't be back."}
{"text":"Cute restaurant with delicious food! Our server was extremely knowledgable and provided helpful recommendations on the items available. I ordered a Thai iced green tea and it was amazing! My friend got the purple lemonade - which didn't have much taste to it (but they let us know prior to ordering), however it looked amazing and was definitely picture worthy. 
We also ordered the spring rolls (which I don't usually like tofu), the crispy rolls (which were delicious and I don't usually like mushrooms), Red Curry (amazing and perfectly spicy), Pad Thai - chicken and moowei (probably not spelled correctly). Highly recommend!"}
{"text":"Adorable little Thai place in Shadyside. Now that Thai Place on Walnut is closed, its great to have another option for traditional Thai in the neighborhood! Also, they DO have a small patio on the side if you want to enjoy nice weather. Sorry this isn't a long review but if you're reading this to think about going there, just go!"}
{"text":"Wow! Absolutely the best Thai food in town! Great service and atmosphere to boot! I will definitely be back! I'm already craving the crab curry and purple lemonade!"}
{"text":"Love their ceiling and decor, the atmosphere was great. Got a coconut soup and a crunchy roll and everything was delicious."}
{"text":"I've driven past this place several times while doing my laundry at the laundromat down the road. On one laundry day, having not eating breakfast and it was already mid-afternoon, I was feeling pretty peckish. After dumping my clothes in the dryers, I walked to this restaurant. (FYI, there is no lot parking for the restaurant; there is only street parking). The dining area is very small, having maybe 8-10 tables. The decor was also very nice. I could tell they had recently renovated because everything looked new and spotless. I thought this would be a good place to have an intimate meal with someone...although the tables were pretty close to one another.

There were two waitresses, and I was greeted and seated promptly. As an appetizer, I ordered one of the specials that were written on the outdoor sign - the Thai dumplings - and got the Senyai Pad Kee Mao (spice level 2/3). For my drink, I got my usual water along with the Thai iced tea.

I hadn't known that Thai iced tea comprised of brewed tea, spices, sugar, and condensed milk. When it came out, I was wondering why it looked thick, creamy...and orange. I took a sip of it and... SUGAR BOMB! Ick! I'm not a fan of sugary or creamy drinks, and this was both. Although it was good for cleansing my palate of the spice of my main dish, I couldn't finish it.

The Thai dumplings were pretty good. Good filling to dough ratio. It was a little bland, though, even with the soy sauce dip.

Despite the mediocre beginning, the Pad Kee Mao was very good. Spice level was perfect; the portion was great for lunch; and there was a good balance of each ingredient. Unlike the first two things I got, I did finish this dish.

Overall, they had good service; tasty and filling main dish; and nice, upscale decor. For the first two mediocre items, I deducted a star (and a half), so I'm giving this restaurant 3.5 stars (not 4). Because this was my only visit, I'll probably come back again to check out some of their other items."}
{"text":"Perfect. Inside is modern and the food is is full of flavor. Great addition to the neighborhood. BYOB too"}
{"text":"Delicious food and awesome atmosphere.  Great service and at 5pm we practically had the place to ourselves."}
{"text":"we ordered a crispy roll as an appetizer, pad thai and pad see-yew for our entree. the crispy roll was not worth since it was $5 and only 3 rolls that could easily be bought at a store and fried at home. the pad thai and pad see-yew was pretty good and authentic. however it wasn't very filling and worth the price ($13 for pork or chicken). 
the interior was very new and modern. the service was also good, as they are quick and ask how your meals going multiple times. 

food 3.5/5
service 5/5"}
{"text":"Senyai Thai has really incredibly tasty food with a range of flavors, textures and freshness that are welcome, especially on hot summer days. The interior is modern and well laid out, though as a girl with big hips I did wish they had some chairs without arms or a bench seat available. Everything was brightly lit and clean, and the servers were super friendly. While I know that butterfly pea blossom tea isn't specifically Thai, the color appeal of purple lemonade (which changes to fuchsia or blue based on acidity) was a delight. Their tofu with ginger and basil was delicious and not greasy at all, and not afraid of a bit of spice (ordered a level 3, so there were pepper seeds and flakes in there). I'm thrilled to get to try this place, and look forward to coming back another time."}
{"text":"My fiancé and I stumbled upon this little gem a few weeks ago and decided to try it out for dinner. This place has a low key location, hidden from the busy parts on Ellsworth and is closer to the walking bridge near Spar Street.  It's interior decor is gorgeous.  Plus the service is very friendly and enthusiastic about their menu.

Now for the food... hands down one of the best Thai experiences I've had in the Burgh! We tried the Chicken Satay for appetizers, Pumpkin Curry and Senyai Moo Sup for our main entrees, plus one of the special warm desserts, taro custard (shaped in a cute little heart with toasted sesame seeds sprinkled on top)!  

I've always had an issue with Thai restaurants being heavy handed with their seasonings, but this place got it right! 

This is definitely going to be a regular place we dine at and I totally recommend it :)."}
{"text":"I was looking forward to take out lunch during a busy week at work. Called ahead to order.  When I arrived, clearly every college student moving in to Pitt and CMU had their family here. I hope that's the reason for the below par meal. I ordered shrimp green curry with brown rice.  Got charged for brown rice but was given white. Since I was already at my next meeting, had to deal. The shrimp were over cooked and the veggies were sparse. No broccoli as listed on the online menus and mostly cheap red peppers. For $16.50... a crappy deal. Spice level of 3 ( the hottest) was a 6/10.  Green Curry sauce was watered down compared to last time.   And my entree was five overcooked shrimp, five pieces of small eggplant, some green beans and peppers and lots of liquid. I hope it was just the college rush but will return to Banana Leaf or Thai Cottage for lunch at work. I loved it the first time so I hope it was a fluke."}
{"text":"Small and very cute little place on Ellsworth. I have been here on multiple occasions because the food is so delicious and fresh. They use organic chicken and that really makes a difference. Everything on the menu is delicious, I personally love their green, and massaman curry. The raw papaya salad is delicious and the ginger tea is a must order!"}
{"text":"I had a wide rice noodle soup with seafood. The shrimps came large and fresh, and the soup had such a great balance between the lemongrass and broth flavors..."}
{"text":"If you want to try fantastic Thai food, I will recommend this restaurant for you guys..love it ..."}
{"text":"Can I just say that the decor in this place is AMAZING?! It's absolutely so cute and very aesthetically pleasing!! We came at ~5ish on a Sunday, so it wasn't crowded and the servers were very attentive. 

We got the Kee mao and panang curry, both level 3 in spiciness. They gave us some hot sauce and crushed chili in bottles on the side because they didn't have any hot chili oil. 

The panang came with a side of rice and had lots of vegetables in it. The kee mao also had lots of veggies. We wished there were more noodles in the dish, but it was still pretty good.

I feel like the place is kind of pricey for the amount of food you get, especially in comparison to places like noodlehead. It was still pretty good and I enjoyed my experience here."}
{"text":"Interesting decor.  Check out the pictures others have posted.
This place is BYOB, which is nice.  We did lunch take out so not need for the BYOB.
Service was very friendly and asked if we wanted some water while we waited since we did not call ahead.  It did not take to long.  The Pad Grapow with pork was very good.  Three spice levels and medium is pretty spicy.  A crispy roll came with."}
{"text":"The favorite place of mine for lunch in the area. $10 lunch menu comes with a spring roll. Beautiful and chic interior combined with good food."}
{"text":"Honestly, food was just not very good and the service was very slow. Pad Thai was so bad that they took it off our bill, which was nice."}
{"text":"We were surprised to find Senyai on Ellsworth as we were strolling around Shadyside. Its modern looks combined with exceptional food (don't leave without trying the crab curry) makes for a restaurant we will return to as often as we can."}
{"text":"Senyai is a super cute little restaurant in Shadyside that my boyfriend and I decided to try last night when we both had a craving for Thai but didn't want to go to Noodlehead (again). The restaurant itself is beautiful and so clean. They recommend reservations because the restaurant is so small but we were seated very quickly at a table by the window. We ordered the Crab Rangoons which were delicious, I probably wouldn't get them again though because they taste just like every other crab Rangoon I've ever eaten. For dinner I got the Grapow Kai Crop Chef's Special and he got the Pad Medmamuang and both were INCREDIBLE! We both like spicy food so we both picked spicy level 2 on a scale of 0-3. It was the perfect level of spice. The portion sizes are bigger than they seem. I highly recommend Senyai Thai and we'll be back again soon! 
PS. It's also BYOB!!! $5 corking fee for wine, $1 for beer."}
{"text":"I can hardly believe how great this place is. It's beautiful inside and out. Moreover the food is absolutely spectacular."}
{"text":"Simply put.....my favorite Thai restaurant.Everything 
Was delicious...Everything!Green curry, pad Thai, egg plant with shrimp.No MSG!"}
{"text":"My husband and I went here about a year ago. We went with friends who recommended it. All of us loved it. We have been back numerous times since then and continue to bring new people to the restaurant. We think that it is the best Thai that we have tried in Pittsburgh. I love the stir fried seafood dish with eggplant and my husband loves their pad Thai. All the appetizers are great as well as the soup. My only criticism was that we were there recently and for the first time we could not talk to the friends across the table from us as it was so loud.  You must make a reservation because it is small but love the decor."}
{"text":"Great atmosphere and incredible food!"}
{"text":"Wow I was impressed by Senyai Thai Kitchen.  My wife and I were planning on visiting another Thai restaurant but we ended up deciding to go with this one.  For one this restaurant is on one of our favorite streets that has a few of our favorite restaurants so we knew this had to be a good place!  Also we saw that they got a lot of good reviews on Yelp so we were expecting something good and it really was!
First of all this is BYOB with a corkage fee of $5 for wine and $1 for beer.  Lunch is served between 11am and 2pm Monday through Saturday.  When you walk in it's bright inside and a nice  modern atmosphere.  It was inviting and a little small but not too small.  We got good seats along the window.  Our waitress was nice and gave us time to figure out what we wanted to order.  She went over the specials for the day and did a good job.

     We started off with their Shrimp and Pork dumpling for an appetizer.  I thought they were delicious.  My wife is the bigger dumpling fan in our family but I really enjoyed them too.

     For my dinner I ordered the Senyai Moo Sup with Chicken.  You can ask for hot, medium, or mild.  We both asked for medium but our waitress brought out the hot one if we wanted to add to it.  My wife did use the extra heat but I didn't need to.  About fifteen minutes after we ordered our dinner came out.  It looked really good and it was delicious.  I was really hungry so I cleaned my plate.  I ate slow so that I could savor it and so that I wouldn't finish my food and just watch my wife eat hers.  The flavor was great, the wide noodles were yummy, and overall a great dish.  My only complaint is for the price of the food I would expect a little more on the plate.  I was still a little hungry after and that was on top of splitting the appetizer with my wife.  Still this Is a great Thai place to visit if you haven't yet and I really do want to come back for more!"}
{"text":"I stopped over here for lunch and was seated right away by the window. Both the dinner and lunch menu were on my table. My waitress was very friendly and helpful although she had a little bit of trouble understanding me. The decor is exceptional with all types of artwork from Thailand on the walls.

I knew that I wanted to order the eggplant stir-fried which comes with carrots, bell pepper, basil in a brown sauce. You get your choice of meat -chicken, pork, or tofu. If you want shrimp that is $2.00 extra.  She asked me how spicy I wanted it and I always go with mild. With your meal you get a small crispy roll with sauce. This place is BOYB and they have a corkage fee. Take out is also available.

They have one gender neutral restroom.  Shortly afterwards, I got my spring roll first which was indeed delicious. Shortly after that I got my main course with a heaping mound of white rice. If you want another type of rice you can get that for a slight upcharge. There was only one other person in the room and she was enjoying Pad Thai which i understand is their signature dish. She absolutely loved it and my meal was outstanding! The brown sauce provided just enough taste needed to make my lunch enjoyable.

For my beverage I opted for the unsweetened green tea since I learned the Thai tea they add milk to it and it is already sweetened. I learned that cold drinks are non-refillable.  Again be aware of that if you want more. 

Having read about their desserts I decided to opt for one. I had the custard with sweet sticky rice. I loved how they warmed the rice to make it seem like I was eating both something warm and cold at the same time.

This is a charming Thai restaurant if you want to enjoy a Thai meal. The menu suggests no substitutions so that you can enjoy the Thai experience. Located on Ellsworth Ave near the bus way, you can find 2 hour street parking on Alder St nearby if you come during the day. Prices are reasonable and even the water glass I used had a unique design to it. Truly a great addition to the Shadyside area."}
{"text":"The crab curry is the best choice! Great decoration, really friendly and nice! We had a chicken pad Thai, herb wings and the crab curry! The herb wings is okay, nothing too special, pad Thai is more sweeter than what I had before, but the crab curry is delicious! Recommend ordering the crab curry."}
{"text":"Finally made it back for a second taste.  Sad I waited so long!

Couldn't resist getting the grapow kai krop (still delicious!), but also tried their pad si-ew and green curry this time.  Pad si-ew very nice but not amazing.  Green curry was a grand slam!  Perfectly balanced and light, full of delicious veggies.  The eggplant in particular (an Asian variety--not sure which type) was so tasty I that would be perfectly happy with just a bowl of their rice, eggplant and green curry.

As before, staff were lovely people and very professional.  To call them a neighborhood gem is a disservice.  Well worth a trip to Shadyside from anywhere in Pittsburgh.

Additional note:  Hard to imagine an easier online ordering experience.  For the sake of not coming off as a shill, I won't mention their platform by name, but IT. JUST. WORKS. and I wish most other local restaurants used it.  Doesn't require an app or an account.  Ordered and paid from my phone riding the P1 bus home from work and it couldn't have been simpler."}
{"text":"Attentive service and delicious food. Surprised that it wasn't busier. We walked in with 6 people and they graciously accommodated us. Server had good product knowledge and made great recommendations. Everyone at the table loved what they ordered. The place is super clean with modern decor."}
{"text":"Read the reviews and decided to walk over and check it out myself. I have to say it was a super pleasant surprise to see what a beautiful, bright, and interesting space they have made!  It's not a huge restaurant, so reservations would seem to be in order, but the tables were all well laid out, the dishes and glasses were all beautiful, and the staff were all very friendly. Most importantly, the food was very good."}
{"text":"Excellent Thai. Best I've had in Pittsburgh. 

Loved the fresh rolls, chicken satay, Pad Thai, and Mussaman Curry.

Great service. Accommodating to Gluten Free/Celiac."}
{"text":"I love it! I have been wanted to try this place for awhile. Now, this review is for my Lunch to go experience. I got three entrees to share with my friends for lunch. I got pad see ew, pad kee mao, and their green curry. Oh wow everything is phenomenal and I don't think I have any criticism or suggestions. One of my favorite Thai places in Pittsburgh now. I will have to come back to actually have their dining experience. My friends are I wish we ordered more because we finished it so quickly. I highly recommended all three of these dishes."}
{"text":"Senyai has become our go-to place for Thai food in Pittsburgh, even though we have to drive a good bit for it!  The interior is clean and well-lit, and the staff is always working to make us comfortable whenever we visit.  Don't be put off by the lack of parking on Ellsworth--head around back to park in the Senyai lot!  

The food is good, and many dishes can be made completely without spicy heat, a fact that my girlfriend appreciates.  The Kee Mao noodles were quite tasty, and anything with duck has proven to be delicious.

We will keep coming back again and again!"}
{"text":"My favorite place in Pittsburgh! The crab curry is amazing. The atmosphere/decorations are super cute"}
{"text":"incredible new place. phenomenal food and price points and the servers as well as hostesses are delightful. if i could i would visit multiple times a week!"}
