{"text":"I have been meaning to write this review for some time now. After having been to Seoul Garden some 4 times I can safely say that this is some of the tastiest most authentic Asian cuisine in the greater northeastern Ohio area. While Korean food might very well be an acquired taste for many American palettes, one owes it to one's self to try Seoul Garden and be awakened from their obliviousness to such Asian culinary delights that constitute Korean cuisine. For apps I highly recommend the green onion or kimchee  pancake, the deep fried dumplings or the kimbab (which is kind of like a sushi roll popularized during the Japanese occupation of Korea). Their soups are hearty and a meal in themselves. Also highly recommend the dolsot bibimbap.. it just doesn't get any better or more authentic than that. Haven't tried the bulgogi yet but intend to. The banchan served with each meal are plentiful and savory and could constitute a meal in itself for some. The only thing I don't care that much for is the traditional brown rice tea they serve gratis upon being seated. That is definitely an acquired taste for mainly native Koreans, it isn't bad it's just different. I personally would much prefer a nice Japanese green sencha or pot of Chinese Oolong tea; but this is a Korean restaurant after all so why not go all out. They also have a selection of Korean beers and some Korean rice wines available too and their house kimchee is divine. Sure, the service might be Spartan and gruff by most American standards but from what I understand this is par for the course in most authentic restaurants in Korea & east Asia. So don't let the misconceptions of some of the reviews here discourage you from trying Seoul Garden because you would be missing out on some awesome food at reasonable prices- and all from an authentically Korean family-run locale. For those yearning to try something a little different from the standard area concepts of east Asian cuisine though equally as tantalizing if not more so than Chinese, Japanese & Thai culinary delights- this place is a definite must-try."}
{"text":"Very good Korean food. The kal-bi was very well marinated, and side dishes were also very good. I loved my bibimbap too.... Everything was just very satisfying.   So happy I found a good Korean place in Ohio.  I will be back. Probably more than I should. :P"}
{"text":"I was very pleasantly surprised to find such authentic and delicious Korean food in the middle of nowhere, Ohio. The owner is an older Korean woman who is usually also the waitress. There are pictures on the wall of the exact dishes. I also think every single Asian in Ohio has discovered this gem and hangs out here.  Favorite is definitely the bibimbap in the hot stone bowl and the Korean sides they serve are so good - I always ask for seconds.  Note, it's only a ~7 min drive from Sheraton Cuyahoga Falls for all the travelers. I would recommend leaving your coat in the car, everything you're wearing will smell like Korean food immediately after walking into the restaurant.  I miss this place now that I'm not working in Ohio anymore!"}
{"text":"Good food, good value makes up (somewhat) for the service--it is what it is. Be glad if you get the right order in a timely manner."}
{"text":"This is a tough one because I wanted to give it 2 stars for service and 4 for food. As most of the reviews mentioned, service is not their strong suite. We walked in and the gentlemen who served us was a man with zero emotion. Straight faced, calm and had a glare that posed 1 question without even saying a word, \"What do you want?\".   He served our luke warm tea, spilling about 1/5 of my dad's tea but not wiping it up, so I wiped up the tea for him. How can you serve luke warm tea? That's like serving brown ice water. (maybe not, but you get the idea) Then my sister had the audacity to ask for just water (she's pregnant) and his look was as if he was in final jeopardy and wagered everything he had on a category he knew nothing about. Oh and for the parents with babies/toddlers, they don't have any high chairs. They have booster chairs, but no high chair.  Now onto the 4 star food. Goo-oo-ood stuff. With the rough beginning, our hopes to have good food was getting dimmer and dimmer. But luckily, once the panjan was served and dish after dish was coming out, we realized why people come to Seoul Garden DESPITE the service. We had a seafood hotpot, some grilled fish, sun du bu jjigae, and onion pancakes. All really good (thankfully). At the end of the meal, we had all but forgotten the shaky service. Good food will do that.  So word of advice, food yum, service bleh."}
{"text":"I went here because my son-in-law had a birthday and this is the place he picked, I couldn't really get out of it.  I was skeptical and looked it up on Yelp before we went.  I looked at the photos of the food and figured I would find something I might like.  I was pleasantly surprised at the appetizers that were served with the dinner, not sure what I was eating but it was all great. I decided to have beef ribs, which I asked the server to spice up.  I was not disappointed and everything I tried was delicious.  The experience was worthwhile.  This turned out to exceed my expectations and I will be back to try more!"}
{"text":"The best. No matter what you get, you can't lose. But don't go if you are expecting American Asian cuisine because this place is very authentic and delicious."}
{"text":"Excellent food and service! Recommend this place to anyone. Very nice people and very welcoming environment."}
{"text":"Korean Barbecue at its finest. The outside doesn't give it away but the menu, service and prices are right on point. The short ribs are awesome and the lamb casserole (Korean for big soup) was absolutely delicious. Highly recommend!"}
{"text":"best Korean if not only Korean place south of cleveland. You have to go in expecting service will be somewhat interesting as its not an Americanized establishment. With that in mind, the food is fantastic and atmosphere matches well with the quaint restaurant. Try the bulgogi and seafood soup, both favorites. Hate to see such a great place be only 3 stars because of some high expectations on service."}
{"text":"Honestly they offer expensive price low quality meal the picture manus on the wall is far away different from what they will provide I ordered a bowl of beaf soup and when it takes to my table it seems like vegetable soup honestly."}
{"text":"I LOVE this place! The food is excellent- particularly the 6 or so little side dishes that come with each main dish.  I usually order the Korean Style Chicken or Steak and their appetizer dumplings are phenomenal! The owner isn't a super friendly guy, but he's efficient and prompt. The younger guy that works there is friendly, helpful and willing to explain certain menu items should guests have questions."}
{"text":"I've been here multiple times over the years including during trips back home after living in korea. The family comes from Busan and this is evidenced in the cooking style - completely authentic completely Korean. The food here is exactly what you will get if you stop by a small family restaurant in sacheon, jinju, changwon, busan, gimhae, etc... Do not ever come here and expect the 'waiting on me hand and foot' experience of other restaurants in the USA. This is as real as it gets folks and service isn't the priority in Korea - food is, which, I am delighted to say theirs is simply superb. THIS is where I go if I want food from gyeongsangnamdo, my home province.  Banchan - freshly made with homemade perfectly fermented kimchi, perfectly cooked soybean sprouts.  Dishes - try the kimchibokumbap, definitely take a stab at the bulgogi (you won't find better fresher bulgogi anywhere unless you just bought a kilo in a TopMart in Korea proper). Their dolsotbibimbap reminds me of Jinju but am sad they don't have plain dolsotbap (usually you scoop the rice out and eat it with banchan while putting water in the dolsot to make a rice soup). Kimchijiggae(stew) is fantastic here.  Whatcha waitin for? It's not like a gimbapcheonguk is opening anytime soon lol."}
{"text":"I can't believe Yelp has filtered my review of this restaurant.  If yelp wants reviews they ought to let them be easily viewable.  My experience at this restaurant was abysmal and yelpers should be aware of how customers are treated here.  The owner is beyond neglectful and rude.  We were the first ones in the restaurant and waited 40 minutes with just water while a table of 8 and a table of 2 who arrived after we did got all their food including ban chan and main dishes.  We finally got up and left."}
{"text":"My first Korean food experience and the Bulgogi was awesome!  I have no idea what all of the sides were but a few were really good.  The others I could've done without.  Service was extremely quick and price was good. I will definitely be back!"}
{"text":"Very fast service.  Dolsot bibimbap was very good but wife's bulgogi was awesome.   Will definitely be back soon!"}
{"text":"Were they just having an off-day?   Look, I can handle terrible service. I lived in Russia for a while where you basically have to beg the staff to let you into the restaurant. But here our waiter actually fell asleep--a new one for me--and we had to wake him up to bring us the check. I realize it was slow, as we were the only ones in there, but this was a bit ridiculous.  Regrettably, even the food didn't redeem this place. The kimchi soup was tasteless, and the banchan were out of a jar. My fiance got the bulgogi, which we normally love but were dismayed to find was watery and bland. And insanely overpriced at $16 for a small plate. Maybe we ordered the wrong things?   Sigh. I've only had Korean a few times (all to great success) and really wanted this place to be stellar. Pearl Road it is."}
{"text":"Authentic Korean food! Take a look at their online menu before going so you have an idea what to expect. A nice assortment of food and drinks to choose from. Thanks Seoul Garden for always making my belly happy."}
{"text":"Tried this place for the first time after reading most of the positive reviews and was left disappointed. My review is based on my carryout experience. I ordered kalbi, the soondubu chigae ( soft tofu stew) and the green onion pancake. The prices were comparable to other korean restuarants near cleveland and parma. However, the portions sizes were very very little. The container were the soft tofu stew was only half filled. The kalbi order only had 6-7 small slices of beef. Taste wise, the dishes were decent but had better near cleveland. Again, this is purely based on the portion sizes they give for carryout orders. Maybe they give more food when eating in but im not willing to try again."}
{"text":"Definitely different from any other food I've tried. Some of the items I tried just weren't for me, but overall I really enjoyed the food. The dishes were plentiful as well. I'll definitely be returning in the future!"}
{"text":"Seoul Garden was excellent.  We moved to this area of Ohio about a year and a half ago and this is hands down one of the best meals, of any kind, I've had up here.  Well done.  Keep doing what you are doing.  We will definitely be back."}
{"text":"I love this place is very authentic Korean food. But you must sacrifice good food with maybe not so good service I've been here several times and will continue to come . Its very yummy"}
{"text":"I had the gal I on an occasion and it was a good dish to enjoy, except that the beef was not cut in a Korean style which is very thin. The place was also filled with smoke, that's for the one star."}
{"text":"Excellent Korean food! Great vibes! Awesome Korean drinks. The Tak Bulgogi (#7) is extremely good always."}
{"text":"Food was ok. The food looks good in pictures but don't taste that great. We ordered seafood hot pod and fried eggs. Hot pod tasted kind of plain to me. The fried eggs was good."}
{"text":"We have been here three times now and have loved it each time. It doesn't look like much outside but do not let that stop you from going in. Parking can be scarce!  The dumplings are amazing, we love them so much we have ordered a second round. They are crispy and the dipping sauce pushes the flavor over the top.   There is a great variety of banchan. Honestly, sometimes I have no clue what I am eating exactly but it tastes so good I do not even care. The kimchi is fresh and well flavored.  The fish banchan is one of our favorites as well as the potato.   We have tried the bbq beef, the beef ribs and the pork belly. We wanted to try the octopus soup tonight but the server said that it was very spicy and my husband can not even handle the kimchi so we opted not.   I love soy bean paste to dip in...you have to ask for it...try it out. It is salty and complex."}
{"text":"Really good restaurant at Akron place. Very authentic. Had a bibimbap carry out. But if you like spicy, ask for more hot source."}
{"text":"I have eaten here for years and if anything, has just gotten better. Plenty of side dishes, and still wishing I would get the squid.  My dol sut bi bim bap love just wins every time.  NEXT TIME!!!  I get the squid.   In the meantime, looking forward to the next meal I get at the best Korean restaurant between Cleveland and Pittsburgh.   THE BEST!!!  My background? Two years at Osan. But I travelled from Pusan to the 53rd due to \"work\".  I love this place! As authentic as any place I have found. Just wish I could get Bi Bim Myun, with hard boiled egg. Then it would be perfect!"}
{"text":"This is exactly what a \"fast food\" korean restaurant is like. The food is authentic....though they seem to dial down the spice a bit for american pallets. The service is mediocre but there are only a few people working. Many koreans go there which is a good sigh too. The only place ive found as good is ha ahn in cleveland."}
{"text":"So this afternoon, me and one of my friend stop by to eat here. This place is really small and very quiet. We order a few appetizer such as fried dumpling, kimchi pancake and I'm not sure what the other one was call. The food were very good. We love what we order. Glad we stop by and found this place."}
{"text":"First time that we three ladies enjoyed lunch here. First complaint would probably be the lack of handicapped parking, as well as the chipped tabletops and lack of silverware, other than a soup spoon and chopsticks. While we were waiting for our order, they brought assorted appetizers, although we had to ask the waitress what they were...seaweed, sweet potatoes, cucumbers, radishes, etc. I had the soup with dumplings and rice cakes...fantastic...and enough to take home for another meal."}
{"text":"My Korean best friend took me to my first Korean food restaurant and I have been hooked. And have craved often!   To echo, the service is mediocre -- but the food will bring you back! Its a family style, delicious joint!"}
{"text":"Excellent service and food quality!  I am Korean and have eaten at many Korean restaurants. I want to say the owners here make it a very good experience. I have now eaten here 7-8 times and I have had consistently good food. I am a person of habit so I tend to get only a few different kinds of dishes so the dol sot bibimbap and the duk manduk gook are my favorite!!   Feel confident that your food is fresh and you are dining with great owners that care!"}
{"text":"First time I have ever been to a Korean restaurant. Initially I am impressed. You get a lot of food and it tastes fresh. I had the short rib soup with deep fried beef dumplings. I liked both items. Even though I did not fall in love my first time here, I know that me and my daughter will be back. Looking at some of the other tables meals they looked great. The only negative thing is that the service was not helpful even when I said I have never had Korean food before. They didn't recommend anything and barely spoke to me and my daughter. Overall I enjoyed it though."}
{"text":"We've been searching for great bulgogi since we moved to the area 4 months ago. We found it here!! Delicious bulgogi! We asked for 5/10 spiciness and it was perfect, spicy but not too much for us (and we like it spicy). The side dishes and rice were great. Very nice waitress and service. If you want authentic Korean food, go here!"}
{"text":"Kalbi (short ribs) was delicious! It comes with rice and vegetable sides. Food is authentic! Ramen was good, but don't expect it to be like a homemade type of ramen. It was more of an instant noodle type of ramen mixed with seafood. It was only around $8 so I didn't expect a homemade type of ramen. It's 30 minutes away from me, but the drive was worth it. I will definitely go back to try the bulgogi!"}
{"text":"Best in OHIO!!! Nothing tastes bad! Can't go wrong with bulgogi, chicken soup, pancake, and all the little dishes you will get! The free green tea is delicious!!"}
{"text":"It's not a fancy dining room, but the food is fantastic!!! I love the BBC ribs, and the aperitif plates are delicious. The staff is friendly, the place is convenient, and the food is good. I don't ask for much more than that."}
{"text":"Amazing food except for the dumpling which were too hard and oily. Good service. The pork #8 was so delicious! Definitely get the kimchi pancake!!!"}
{"text":"Cane here last night for dinner with a group of 6 friends and we really enjoyed it!  I got the Green Onion Pancake with Squid and the Dumpling and Rice Cake Soup, husband got the Steak Stirfry. Everything was tasty, weblog bed trying all the different BonChon (sides) and loved our main courses. Everything is very flavorful, my soup was so comforting and warm. The broth was so light, yet wholesome. My husband loved his steak, said it was some of the best stir fry he's had. We'll be back!"}
{"text":"NE Ohio is pretty limited when it comes to quality Asian food. I'm in Cuyahoga Falls and the nearest Korean restaurant is 40 minutes away in Parma. Sometimes I don't want to drive 40 minutes to eat my feelings.  Seoul Garden is pretty good, but not excellent. Service kinda sucks, and sometimes the banchan isn't the freshest. The kimchi and oi-muchim are goddamn delicious, as well as the bulgogi, bibimbap & kimbap!   Service is alright, and you get your own drinks!"}
{"text":"My son and I ate here for the first time today and we loved it. We shared dumplings and soup. The soup was enough for 4-5 people although the menu says 2 people. The soup was very flavorful and satisfying, loaded with vegetables, beef, noodles and tofu, along with about 8 or 9 condiments. It's nice not having to go to Cleveland or Columbus for decent Korean food in Ohio. It's very very casual but our service was more than adequate."}
{"text":"I like this place a lot. One of the best Korean restaurants the area. Friendly people. Only thing is the price is a bit much, but you do get a lot of food."}
{"text":"Wonderful food! When you pill on all the side dishes with your meal, you end up with a feast. The first time I tried it, I got carryout, and the 2nd time I went with friends. Both times, the food was fantastic.   To make some notes about the service. This is a cultural difference. Americans want to be waited on hand and foot. We consider the service rude if the staff doesn't take the time to make sure our glasses are never empty or that they \"check back\" to make sure everything was alright. My friend, who's Taiwanese, said that in Asia, most restaurants are not like that. They don't go out of their way to be super friendly and bubbly. The guy who waited on us, did what he needed to do. Got the first drinks, took our order, delivered our food. And yes that was it. But if you take the time to observe the other patrons in the restaurant (the Asian ones) you'll notice its very self serve. Want more tea? Get up and pour some. Need a box? Same place as the tea. And the \"waiter\" never left the dinning room. If you really needed something you could probably just walk up and ask him. Think of the service more do it yourself. Do you need to tip like a normal restaurant? That's entirely up to you. I tipped well because I loved the food and enjoyed myself."}
{"text":"Truly authentic Korean food. Best service. Delicious food. I love hangover soup and kimchi pancakes! Best combination for Sunday afternoon. The place is affordable with bill per person around 10$-15$. Also what makes the place so special is Korean and Japanese beers! enjoy and remember to ask how spicy the food is, if you are not used to spicy hot Korean food!"}
{"text":"Holy fantastic!    Read reviews of other Yelpers to make my way around the menu.  Have to admit, I was clueless!   We started off with the green bean pancake.  Don't let the name fool you!  It was loaded with misc seafood!  The sauce was salty and yummy!  Oh, at this point, we knew we had to serve ourselves some drinks. Go ahead, make you way to the cooler!  Just smile!  lol  BF & I shared the beef something and it was enjoyable! We loved all of the accompaniments. Kim Chi, Tofu, etc- all good!"}
{"text":"Second or third time here and it wasn't great. I got the deep fried spicy chicken (kahm poong gi) which wasn't spicy at all considering how many red chilis were on the plate. The ratio of bread to chicken was all off.   My other friends ordered spicy dishes too but they were just loaded with the red pepper paste and also not very spicy. Basically not very impressed with all the new dishes we tried, better stick with the oldies but goodies like kalbi ribs, jae yook (spicy pork), and spicy japchae (cellophane noodles)  Love all the (unlimited) sides though!"}
{"text":"Look past the outside and dated decorations -- their food is amazing. Short ribs and bulgogi with the complimentary sides -- so so good. I love their Kim Chee pancake and of course bibimbap. Don't forget to try their ramen too.  Tip: all of the drink coolers and hot tea dispenser are self serve. You will get thirsty so don't be afraid to get up and grab a drink of your choice."}
{"text":"Great Korean food! Love the free rice tea. Was in town for a few days and visited this placed twice!"}
{"text":"Best Korean restaurant in this area!!  Love the seafood pancake and the short ribs. The side dishes are delish!! Love the rice there too!!! Cant get it anywhere else in the area!!"}
{"text":"First of all, Seoul Garden is a pretty authentic Korean restaurant. It is unlike most Korean restaurants that I have been to. Also, it's a place recommended by fellow Koreans. I like their side dishes which feature 5-6 different items from kimchi (cabbage, cubed radish, cucumber) to marinated bean sprout and dried tofu.   The place is a hole-in-the-wall and may be a turn off to some people. It also has a strong smell but that's not because of the building maintenance, it's the food that they cook. The owner barely speaks English and the service was so-so. The food was good and inexpensive though. A decent place for Korean food especially if you are looking for authenticity. Give bulgogi a try."}
{"text":"Tried it for the first time!! I was really excited and haves at anything actually Korean since living in China!  We went on a Friday night and every single table was being used!! It took us an hour to get our food and 35-40 minutes to get he appetizers.  I'm always looking to authentic Asian cuisine since I moved back home.  The food was good, but a quite overpriced. If I were to returned it would only be for a couple orders of dumplings!  Those were great! I might try the Bbq steak... But the hot pot isn't traditional make your own, and your don't get to Bbq yourself. There wasn't very much in or soup for it to be almost $30.  I am glad I tried it though!  I had a great time out with my sis and enjoyed myself."}
{"text":"Solid Korean restaurant in the Summit County area. I got the chicken bulgogi, which came on a sizzling plate. The bulgogi was very good, just enough spicy to give it a kick, but not so much that it was overpowering. I also have tried the kimbap in the past, which was very good. As standard for Korean fare, Seoul Garden provides you with a wide array of banchan, including kimchi. The price is very reasonable for Korean food. While this is not the best Korean food I have had in northeast Ohio, it is the only place in Summit County where you can get authentic Korean food, and it definitely delivers on good quality Korean food."}
{"text":"Absolutely love this place!  Their kimchee pancakes are awesome and the mackerel is the best fish I've had to date."}
{"text":"4 stars for the food. Service is spartan even for a Korean speaker. The food is basically what you get if you are invited over to the nice older Korean couples house. Kimchi jjigae was okay -a bit bland for my taste but with my acid reflux, probably what I should be eating. The bulgogi is the best I've had at the Korean places in the region. The ban chan (side dishes) were fresh and good -just not like my mom made nor at Koreatown Manhattan standards."}
{"text":"I know what I want so I get right to it. Smallest cup of water I've ever seen served, but no big deal. It was somewhat the end of the lunch rush (I thought). Service was a little slow and food was ok."}
{"text":"who knew you could find really good, authentic korean food in cuyahoga falls? first, off, let me say: i'm korean. whenever i read reviews for korean places, i want to know from people who've had korean food their whole lives how good a place is. let me tell you, this place is legit.  of course, like most restaurants, how good the food is mostly depends on what you order. that being said, let's get to it.  i went with another korean friend and 2 white friends. the 2 white dudes have never really had korean food before so it was up to me and my korean friend to show them the ropes.   they greeted us with some hot barley tea, which i haven't had in a really long time and instantly i felt like this was going to be a great meal. we ordered the yook-gae-jang, galbi tang, daeji bulgogi, kim bop, haemul pajeon, and dukboki. all were fantastic! i got to taste all of the dishes and they were very authentic. the only negative i have to say is the daeji bulgogi was pretty dry but the flavor was there. everything was cooked the way i was used to it being cooked, no surprises. it reminded me of eating at korean restaurants in atlanta where i used to live (great korean food!). the banchan was great. the kimchi was more fermented than usual at a restaurant (which i looove) but i understand a lot of people prefer fresh kimchi. we may have gotten an older batch, so don't let that sway you.  when we arrived, there were only korean people in the restaurant - a great sign. and then more nonkoreans started trickling in - also a great sign. it's always good that native koreans like the restaurant but that nonkoreans feel welcomed to eat there as well.   we got to chat a bit with the woman who owns the restaurant who told us it's a family business. she was super nice, however, i could see how non-korean speakers might have some service issues.   overall, i had a great experience. i would hesitate to say you're safe ordering everything off the menu but we had a pretty wide variety of food and all of it was great. i will be back whenever i crave korean food. it was such a great meal. thanks for giving me a taste of home!"}
{"text":"Ate here for the first time yesterday,  and was really amazed. I've eaten at Korean restaurants before,  mostly in the Atlanta, Georgia area,  and they were authentic,  great quality restaurants. This place tops them by a long shot.  The side dishes were excellent,  the tea was great,  and the lunch special was very tasty."}
{"text":"I live in Chicago and this restaurant is better than most in Chicago. I went to high school in Akron and my parents still live there. I try to come here every time I am in town. When it comes to the quality of their Korean dishes they are way up there. My favorite dish is their spicy chicken bulgogi. A great find and pretty much the only Korean restaurant in town."}
{"text":"I have been coming to this place for years, they have recently upped their prices while cutting the portions. They don't even even give you a full cup of water, they bring it in tiny cups and Te Yun is always annoyed when you ask for more water. Today we went in for lunch and the door was open and Te Yun said they were on lunch even though it was normal hours, but didnt lock the door so we assumed it was open. The woman worker told us to have a seat but Te Yun childishly pushed his chair and kicked the kitchen door in a pout. We got up and left, that behavior was unacceptable and rude. I even called to tell him what his problem was and he said we were rude coming into on his lunch break. He needs to grow up!"}
{"text":"This is the only and authentic Korean Food in the Akron area. It super expensive. I recommend this place for some bulgolgi and kalbi. Their soon doo boo is good too. Service is terrible and they are lucky they are they only authentic Korean restraunt around."}
{"text":"I adore this place. Maybe it's because they don't pull any punches. The food is the way it is: authentic and they could give a shit if you like or not. They serve authentic Korean and if you're looking to have it your way then go to Burger King. The Bee Bim Bop is pretty amazing.  I'm not a fan of the corn tea so I usually bring a huge liter of water."}
{"text":"Now this is what u call authentic Korean food! Been searching all around the Cleveland area for Korean food and this place is the second best place I found. The service could be a bit better since the place wasn't as busy but Im not complaining since the food was super good and of course I will be back !"}
{"text":"This place has been open for a very very long time. And for good reason! The food here is just great. Starting with bonchon, they offer the usual assortment which are all tasty and fresh. I usually order the seafood pancake, squid or pork hot plate, and the bul naak jeon gol. For me this is perfect combination of Korean comfort food."}
{"text":"This place is so good! This was my second time eating korean food and I will say this has been the best! The kimchi pancake was very tasty I will definitely be back"}
{"text":"No one would ever mistake this place for fine dining.  Service can be maddeningly slow during busy times and the setting is standard \"hole-in-the-wall.\"  I usually refill drinks myself when it gets backed up.  That said, the food is terrific and reasonably priced.  They provide a good variety of banchan (side dishes) and refill before dinner if needed.  Kalbi and bulgoki are favorites of the kids.  The chicken and squid are also recommended.  There is usually at least one Korean family dining when we visti, which seems to be an indication of the authenticity.  Definitely worth a try."}
{"text":"delicious! the grilled fish in particular was really excellent and fresh. My only wish was that the soondubu came with an egg to crack into it."}
{"text":"We went there with my family and had a great experience.  The food was excellent and the service was great.  My daughter has various food allergies.  I was  a bit nervous about ordering her something from the menu that was safe.  I spoke with the chef (?) and she confirmed the noodle dish I ordered for my daughter was safe.  Every dish we got tasted authentic and the flavors were spot on.  I highly recommend this restaurant.  The food is legit!"}
{"text":"Fantastic meal and great service. The Chapjae was very authentic and the various kimchi dishes were amazing!"}
{"text":"FYI, this review is about 14 yrs overdue ...  As a starving college student I used to scrounge up couch change with my roommate, and bum a ride with friends to come up to this place.  I didn't have enough money so I would split a dish with someone and order a bowl of rice to eat with the side dishes...I believe there used to be a small, Korean grocer next door, as well as an independent record store within walking distance...anyways, I digress.    I don't know if they still bring out the grilled meats on a heated stone plate, lodged in a wooden plank  (a staple of Korean BBQ, keeps things warm through the meal) but I remember it serving it's purpose well as the spicy chicken bulgogi, peppered with chili flakes, warmed my starving belly on that particularly cold day in November.    Back then, I couldn't afford to go to a place like this often.  I may have visited 2 or so times.  I still remember the family photos on the wall, and remember identifying with their immigrant experience.  Man, this place takes me back.  I always say that it's the banchan (complimentary, side dishes) that defines a korean restaurant, and this place makes each by hand.  An old school korean kitchen on the middle of Ohio    Go get you some Korean food, it's something else"}
{"text":"We've been coming here on and off for at least twenty years.  Excellent Korean food.  Don't expect a lot of conversation from the server(s) -- just concentrate on the wonderful food!  (Dolt sot bibimbop is my favorite! -- five stars for that one!)"}
{"text":"The food here was absolutely  outstanding but my experience was ruined because I left me jacket there and it was stolen. Yes I looked everywhere for it. Just be sure not leave any belongings behind"}
{"text":"I'm giving this place a 3.5 stars. On the one hand, this place serves the only authentic Korean in a 25 mile radius. On the other hand, there's nothing really outstanding about this restaurant for me to write.   Stopped in around 7pm on a Thursday evening, the place looks like a run down bar from the outside, inside it looks like a typical Chinese restaurant would. You can tell right away this place is family run, and the staff was friendly enough. We ended up ordering the seafood pancake (pajeon) an order of tteokbokki and the spicy beef soup (yukgaejang) as well as a bottle of makgeolli. The food did come out very quickly, along with the banchan. Each dish was okay, the pajeon was a little eggy and not crispy enough for my taste and the beef soup was spicy but not bursting with flavor. All in all it did satisfy my craving for Korean though, and considering it's quicker and easier for me to go here versus the Seoul Garden in Parma where there's always a long wait, I'll probably come back to eat here again.  Would recommend, but only if this place is in your neck of the woods."}
