{"text":"This is my new favourite organic cafe.   The first time I sat down and reviewed the menu, I was bit skeptical. I didn't think anything sounded that special.   I was very pleasantly surprised.   I had the goat cheese/honey and pear crepe served with yogurt with fresh fruit and granola.  EVERY bite I took was heavenly. Textures, flavours, freshness. All there.   My second visit I had the Himalayan salted caramel latte and a wild smoked salmon crape. FINALLY, a place in TO that serves wild salmon. Everything was delicious.   I love that everything is organic, fresh, non gmo.. And it's not vegan but has vegetarian as well as Flexitarian options.   Highly recommend."}
{"text":"I ate here twice. Initially I was happy that finally this hood had a healthy option beyond Camp. The neighbourhood is full of very good bakeries but  I was happy to have an organic option and my first thought was that the hard part would be stopping myself from going too frequently during my work-heavy months. I think I confused \"organic\" for 1. Healthy 2. Minimal ingredients and 3. Environmentally conscious.  1. Half the items have bacon in them and every rich special they put on the board outside stops me from going back in. Even the pics others posted show that the food is doused in creamy sauces and cheeses, so definitely not healthy which is what the hood does need. As I said, the area is full of bakeries and also artisanal chocolatiers and coffee shops, all of whom do sweet stuff better and cheaper and offer quality you can't get from pre-packaged brands like Dufflet so I really don't see why people would go in for the desserts/coffee. 2. The soups, sandwiches, and dessert I tried were overly contrived (again, see other posters pics).  Quinoa is used like pepper there, tossed on nearly everything whether it goes or not. But there's just a hodgepodge of items in every dish. If your ingredients are good, you don't need that much of that many competing against each other in every item then a bucket of sauce on top. I get the sense that they're still trying out ideas with the food but it comes across as constant experimentation, so there's nothing to really get attached to on the menu. Usually I try out a bunch of menu staples then settle on a favourite to come back for, but here I feel in a constant state of \"just trying things out.\" 3. I work long hours so I get lunch hour take out. All of the items I bought there came in styrofoam containers that were huge by comparison to the food.  Why be a restaurant that advertises organic so loudly while dolling out styrofoam? The other places I go to use brown paper bags or boxes, paper sandwich wraps, biodegradable containers or in the worst cases, tinfoil containers with paper lids. I just can't wrap my head around a place that is anti-GMO, all organic, with a zen decor handing me three giant styrofoam containers for three rather tiny items.   I went back again twice just for coffee but it was watery both times because the fancy drip they use to make it requires a lot of patience that the server didn't have so she forced the water through the grounds. Both times I dumped my cup when I got home. It would be an OK option if it weren't so pricy and if I primarily ate in (I'll never order their styrofoam again). I may give it one more try because I'd like the business to do as well as I'd initially hoped and since this is their first year maybe they'll work out the kinks."}
{"text":"Great asset to our neighbourhood,good food, great staff, friendly clean place. Worth stopping in often as daily fresh, homemade meals change daily,,, great sweet potato gnocchi, Cobb salad,,,,and this weekend sweet treat, maple bacon donouts"}
{"text":"Great gluten free choices!  All home made and a great cozy space! Soups, sandwiches snd yummy deserts."}
{"text":"One of my yoga friends and I treated ourselves to a post-practice lunch at a local bistro that recently opened in the neighbourhood.   After the workout and walk to the adorable bistro in Toronto's west end, we were hungry and wishing for a place that had big(ish)-sized servings. We crossed our fingers as we walked into the petite restaurant that just opened a few months ago. It had a welcoming atmosphere, friendly (and adorable) staff and local artist's creations on the walls. (I love supporting locals!)   The food: simply delicious! It wasn't pretentious, it was affordable, simple and really, really, tasty. I ordered the Pear & Cheese Crepe with the gluten free option, which the lovely server recommended.  With the Serendipity salad on the side, my plate was gorgeous, a good size and so good!  A great addition was the lemon and ginger iced tea the server recommended as well.  My friend's salmon salad was delicious too, based on the \"yums\", \"ooohs\" and \"ahs\" my girlfriend kept sputtering out between bites.   We topped our lunches off with a shared slice of carrot cake because...why not?  Their cake is from Dufflet and we all know how Dufflet carrot cake tastes. (Let me just say my husband and I had it at our wedding)  I'm going again. Maybe tomorrow, if I can!  If you're in Toronto's west end in Bloor West Village/Baby Point, you MUST dine here. I guarantee you will love it."}
