{"text":"If you're seeking bland, salty, Chinese food where every entree tastes exactly the same as the other...this is your place!"}
{"text":"Stopped here for the first time for dinner. The portions were huge! And its not expensive at all. I had broccoli and chicken in white sauce with steamed rice, and hot tea.  It was good. The staff was friendly. I'd defiantly go back if I'm ever in the area again and wanting Chinese cuisine."}
{"text":"We used to be big fans of Sesame Inn, eating in or ordering takeout a few times per month. But their quality keeps going downhill, and we find ourselves eating it less and less frequently. It's been awhile since we've had an amazing meal. Tonight, the straw that broke the camel's back was that two of my takeout items were inedible. The wonton soup was so salty that it immediately shrivelled my lips.. And when we removed our egg rolls and set them on plates, they left little puddles of oil. I hope they get their act together and rise back to their former glory. We miss the excellent food that we used to get."}
{"text":"Good stuff. The menu has a diverse selection of traditional dishes as well as some Thai dishes. Prices are reasonable and the food is tasty. Love this place"}
{"text":"Friends and I were looking to order Chinese food on a Sunday afternoon. Unfortunately, Sesame Inn doesn't deliver until after 4pm. They're prices are a little more expensive than other Chinese places I've been too and the quantity of food is less as well. Quality of the food we ordered was find though and ready for pick-up when we arrived. Unless I was really craving Chinese food, I'd probably go with somewhere else."}
{"text":"My favorite Chinese food!  Shrimp with Cashew and Bride and Groom are my two mainstays right now."}
{"text":"Sesame Inn is the place the wife and I like to sneak off to, for a pleasant lunch date, when I'm in the mood for General Tso's Chicken. I have yet to find another, as good as their's. The restaurant is always clean, the decor, beautiful, and the staff, always pleasant. We tried the location out towards Peters Township, some years back, but left disappointed. It wasn't the same IMO. That's okay, cause the Mt. Lebanon location is much closer, anyway."}
{"text":"I am from Pittsburgh but live in San Francisco now, and I come home to eat at this place Every Single Time. 

Best Chinese food of my life... veggie dumplings and some amazing chicken ALWAYS hit the spot."}
{"text":"This is the only Chinese restaurant I will go to.  The quality of their meat is much higher than anything I've found at the chain/buffet-type places.  I love the Ginger Chicken, Double Delight (chicken and shrimp in brown sauce), and the Happy Family (chicken, shrimp, scallops, pork, and beef in brown sauce).

I've had the Salt and Pepper Shrimp which were good, but I prefer Chinese food that has some sauce on it.

I love the baby corn that comes with the meal and the zucchini.

The prices are higher than your standard Chinese place, but I feel that you get what you pay for."}
{"text":"This place is great.  I got the general tso's chicken and the flavor was to die for.  Big portion of chicken.  Staff was very friendly."}
{"text":"Most consistent restaurant i've ever been too been coming here 7yrs still just as good as the first time!"}
{"text":"The Sesame Inn is a nice Chinese restaurant in Mt. Lebanon.  Inside is well decorated with mirrors lining most of the walls.  We went for lunch and found it to be unexpectedly busy (and parking was tight), but we were seated quickly.  Service was excellent.  Our server was very friendly and helpful and made sure our water glasses were always full and everything was to our liking.  The food was standard Chinese fare.  They also appeared to have a few Thai selections, although we did not try them.  Our entrees were nothing out of the ordinary, but the pu pu appetizer platter was quite delicious.  Meals are large and come with rice and soup for lunch.  Prices were reasonable for lunch, but are several dollars more for dinner."}
{"text":"Awsome had the beef fried rice so good worth a shot"}
{"text":"They have the best Chinese food in the South Hills!!!

I always get the amazing chicken and it is amazing. We have been going here for about 10 years or more and have never had a problem.

Have good lunch prices too

The only drawback is the parking is a little crazy"}
{"text":"Well it's our 2nd take out here at wasn't as good as 1st. I wasn't in a mood of eating a whole meal, so just decided to give a try to their sample platter of appetizers. My man ordered Thai cuisine which was fine, it's just the rice was kind old, seemed stayed in a rice cooker for a while... Any appetizers include coconut shrimp, egg rolls, crab Rangoon, bbq ribs and chicken teriyaki sticks. From all I got I ate chicken and ribs cause everything else was over fried, old & not fresh... And the main thing about this place it's not as cheap as all Chinese restaurants around mount Lebanon. I'll think about next time ordering food from there."}
{"text":"Foods are delicious, high quality. Very clean restaurant  and good environment, 
We all enjoy it,"}
{"text":"I walked in to place a to-go order.  The joint was very busy, but worth the wait -about 30 minutes. Very comfy waiting area just off the main dining room.  The Hunan Chicken was spicy without being too salty & the eggrolls were crisp but not greasy.  Only negative I'd give is to the hostess, who was a bit snarky when I ordered, but I'll give her some leeway based on the crowd that was there.  I'd go again."}
{"text":"I have been a customer of sesame inn for many, many years. Growing up in Mount Lebanon, my parents always ordered from here and since I have moved back 11 years ago ,I have ordered at least once a week for my family. A couple weeks ago I had a house full of people and ordered over $100 worth of food for delivery. I am sorry to report that there were tiny brown bugs ALIVE AND MOVING in our chicken fried rice. Myself and six other adults were not hallucinating, they were actually in our food. The kids had eaten before us and we did not notice until we sat down to eat. I called and the way the situation was handled was absolutely unbelievable.they told me I should have put the bugs in a bag. We left the bugs in the rice when we returned the food. They claimed they didn't see any. Seeing as though I am a regular customer who has never complained, I could not believe they would not refund my money for the food that we were unable to consume. I will NEVER ORDER feom sesame Inn Again. Totally disgusting..I worked in the restaurant business for many years and none of my managers would have handled this situation as poorly as they have. Despicable and disgusting."}
{"text":"We typically come over here for lunches which are always very good and relatively cheap. Personally I don't usually think of a dinner out at a Chinese Restaurant is going to be excellent but this place was Dyn-O-mite! 

We had reservations for 6 people on a Saturday night around 7:00 but got caught up in really bad traffic and couldn't make it until closer to 7:45. we called to adjust our reservation time and they had no issue to accommodate us. 

It is simple enough just to park across the street in the public lot than drive around for street parking I think that the lot may even be free on Saturday nights. The plate serving sizes are pretty large so it makes it easy for everyone to try a little of everything which is the way we ran the dinner with our group. We order way too much food to say the least. Everything was flavorful and served up[ hot and steamy. We had so many dishes that I can't talk about how awesome each one was but the one that really stood out to me was the mussaman curry and fried tofu.

Usually with a group of 6 or more a smaller place like this might be overwhelmed with getting the plates out in a timely manner and relatively close together but this place did an excellent job. I will definitely put this place in my places to go for dinner file after this experience."}
{"text":"This was a good experience. The presentation & service was nice. I personally enjoyed my dish as the noodles were tasty & the vegetables were crispy! There are a few vegetarian friendly choices (such as the Bean Curd Family Style), which was ironically thin on the vegetables, but quite tasty. I'm sure others would greatly enjoy this place, but the only way I could give the full 5 stars is if there were mock meats (& good), like the place I love in Philly, but that's just me! I do recommend this place."}
{"text":"We did like the food but sadly found out on the way out that they cook with MSG.
Why would anyone want to eat anything with MSG? They did say the will not use it if you ask."}
{"text":"Do not come here with kids. No changing tables in the bathroom. Food is decent but over priced. They put a pot of hot tea down on the table right in front of my 9 mos old after we had very obviously cleared that end of the table away. Our server did not even ask if we wanted drinks. No chop sticks or soy sauce unless you ask for it. Interior is dark and dated. Watched the owner play video games on his tablet while two servers were responsible for the whole restaurant. Don't waste your time unless you just want to sit at the bar and drink."}
{"text":"My family has been among the many regulars here for the better part of 15 years. Back when I knew absolutely nothing about cuisine I loved Sesame and returning now as a hypercritical jerk I still like it. Yes, it's not healthy, and yes you may hate yourself after a huge portion of fried chicken or oily noodles, but as a guilty pleasure there are very few rivals in the South Hills. 

The decor is frozen in time. The tea isn't fancy. The cuisine is inauthentic. But who really cares? Everyone is nice here and the fare tastes exactly as good as it is bad for any aspirations of health-consciousness. If you're really throwing caution to the wind then go for the fried egg roll and the wanton soup, both great, and be prepared to bring the majority of your entree back with you for another full meal or two. My one caveat would be that I don't like the non-Chinese features on the menu, i.e., go elsewhere for your Thai fix. 

A final shout-out to whoever designed the cocktail list years and years ago. The little logos for each drink and the accompanying descriptions are hilarious. (Flaming Volcano - \"An eruption of the finest rums fired with sacred nectars served aflame...\") I hope that person went on to an illustrious career in marketing (or perhaps poetry) because these are amazing."}
{"text":"We stopped here during Station Square's \"winter wonderland\" (which was awful, btw!). We got there around 7, and I was expecting the place to be packed, given that the lower floor was basically one huge crowd of kids. Surprisingly, it was near-full, but with no wait. 

We got seated quickly, and were kind of hurried to order by the server, which was understandable given the crowd. Our table (two parents + 5-year-old) got

* teriyaki chicken appetizer ($7)
* cashew chicken ($12)
* kid's chicken and baby corn ($6)
* pad thai ($11)

The good: The first two items were great . . . I'd describe them as on the very tasty end of the mall-grade-American-Chinese food scale. 

The unknown: My son ate all of the baby corn and fried rice before I could try it, so I can only assume it was good! 

The bad: The kid's chicken was very bland and gummy. Imagine if you got a package of supermarket chicken and basically just microwaved it in water. Ick. 

The amazingly awful: Okay so yes, I ordered Pad Thai at a Chinese place, maybe not a great decision. But there is NO justification for how gross the meal was. Imagine yourself at the zoo, smelling the elephant cages. That was how it tasted. I probably should have said something (\"Seriously, there is something wrong with this.\"), but they were clearly busy, I couldn't really figure out what to say, and I just wanted to eat and go home. In retrospect, I really wish I had. (What if it was spoiled and somebody got sick?)

The service was almost quick enough to satisfy a hungry and overstimulated 5-year-old, which is saying a lot. The portions were large enough that the three of us were satisfied with what turned out to be 1 appetizer and 1.25 entrees (cashew chicken plus baby corn). 

I wish I could give 1.5 stars, as my experience was somewhere in between \"eek\" and \"meh.\" I feel bad about the one star, since I'm mostly penalizing them for one bad dish, and I didn't give them the opportunity to fix it. But I never got my beloved Pad Thai. And what I got was so gross that I can't imagine going back!"}
{"text":"Nice atmosphere, good food - Sesame Inn gets an A in my book.  The service is good - I especially like the man who has been refilling water glasses since I was in middle school and always smiles at you.  There is a room off the main dining room to support larger groups, a full bar, and a great menu.  The lunch specials are very affordable, even to high school students, and can be packed on days when school lets out early.

As far as the food goes, everything is delicious.  The hot and sour soup is great, the ma po bean curd is the best I've ever had, and even their newest offering of pad thai is pretty good.  Whether you're taking out, eating in, or having food delivered, everything here is delicious."}
{"text":"I love this place!  I've been eating here since I was a little kid and it's always been a favorite!  
The lunch menu is a great deal because it includes a soup or egg roll, so we usually try to go for lunch.
The staff is always really friendly and quick.  My dad is a dentist in uptown Mt. Lebanon and even though this is a sit-down restaurant, you can always run in for a quick lunch and make it back to the office on time.  
Take-out is very convenient too.  We often get take-out and it's usually ready to pick up around 15 minutes after you order it!
I think the prices are pretty reasonable.  You can usually get lunch for under $10.  Dinner is a little pricier, but the dinners are definitely big enough for 2 people to share.
On top of all that, the food is really good!  I've lived in LA for a year now and obviously there are a ton of places to get Chinese food out here, but I still think that Sesame Inn is my favorite! 
I definitely highly recommend this place!  I know I'm always dying to eat here every time I'm in Pittsburgh!"}
{"text":"station square isn't my favorite place to be.  the reasons go something like this:

1. entering the square is a headache, never really know where to park
2. parking costs $ and remembering to validate is an annoyance
3. even after validating you may have to pay a few bucks for parking
4. exiting the square and taking a left isn't always easy- make sure to exit at a light
5. the mall at station square is a joke but it does have a lottery ticket machine!

The 2 best locations in station square are:

1.  Sesame Inn
2.  the lottery machine

Sesame Inn is good stuff.  The egg rolls are bomb.  Get a dish with shrimp in it.  The shrimp is gigantic.  The spice could use some help though.  Between Sesame Inn and PF Changs, I'd choose Sesame Inn everytime.  It's a hit in a very obscure place in station square.  It's my spot!"}
{"text":"It is the only chinese i will eat when i am in the area. Its delicious food and wonderful staff."}
{"text":"Phenomenal! The new sushi bar compares favorably to what I eat in Los Angeles.  I will absolutely go back.  The Chinese food is also authentic - sure there are basic things that satisfy most appetites but the variety is truly special.  Service is terrific - will absolutely go back next time in town!"}
{"text":"This is my favorite dine-in American-Chinese restaurant in Pittsburgh. The food here is always on point and the service is always attentive. You have to go upstairs to get to the restaurant but the little climb is so worth it. The decor here is very inviting, not bare and minimalist like many other Chinese restaurants and the restaurant is very clean. Everything I've had here has been delicious and fresh. Surprisingly, the pad Thai is good here too. I, however, have never ordered sushi here as it wasn't always part of their menu. Delicious, high quality American-Chinese restaurant."}
{"text":"I ate one bite of my Chinese and threw the rest away.  It was $40 for two take out meals and the beef sort of disintegrated in my mouth.  Not a good quality I would like to experience with meat."}
{"text":"My first five start review! Service is perfection, listening to little requests and confirming them with a smile. The hot sour soup was meh but everything else was amazing! Consistently addictive!"}
{"text":"It's a pretty nice place located in Station Square. The service was quick and efficient. Order food in bulk for a work party and they prepared everything so quickly for pick up.  

For a restaurant, I expected restaurant quality food, but what I got tasted a lot like the cheap stuff I can get at to-go places.  I had their general tso's chicken. The portions were good and came in a cute little container. I thought the sauce was a bit too sweet and chicken tasted a bit dried as in over-fried. I did enjoy the hint of ginger in the sauce though. 

Overall, the food at Sesame Inn was pretty edible, but the quality is not worth it for the high price."}
{"text":"If you are looking for authentic Chinese food, this isn't the place.  If you are looking for well made food with generous portions, you have come to the right place!"}
{"text":"Nice little space where you aren't sure at first you're in the right space, up the stairs and through the door and boom awesome restaurant. 

We got a lot of food. Vegetable eggs roll, which was ok but I'd like to try a different variety next time, it was a bit boring. I tried the egg drop soup which was great for my cold but not exactly a traditional egg drop soup. It had peas and carrots added which I've never seen before but it tasted delicious. 
We also got the sesame noodles which was a cold salad appetizer. My fiancé LOVED it. I thought it was good too very peanuty and yummy. Finally he got the Mongolian beef and I got the sesame shrimp. The shrimp was soooo good, a little spicy but not crazy by any means. I would definitely get it again. And the beef was delicious  too! 

They were super nice and everything came out fast. It was a good visit. We'll be back."}
{"text":"This place is Closed as of November 28 or something.   Upsetting BC of the drive to get down here and paid for parking."}
{"text":"Dissapointed. Dry rice, no flavor, greasy. Wonton Soup and a mediocre fortune earns this one (1) golden star. Used to be better."}
{"text":"So apparently they have this business listed twice under different names but the same address and the closing time is wrong on both sites. I just called to inquire about their closing Time. The lady said they close at 945?? Two stars because they seem to not be able to get it together."}
{"text":"Why didn't this list not wheelchair accessible? There's a flight of steps to go up and no other entrance. The one at Station Square accessible w Elevator. Put notices on these reviews of places accessible for wheelchairs and that includes bathrooms too  ! Make a ramp for disabled people in chairs or elderly who cant walk 2 flights up ACLU and Disabled rights would make be handicap accessible! Just so you know I been told that the station Square is closed? If anyone knows if its true please write. Today Jan 26 We went to McMurrays Sesame inn We had a great lunch and apps were great too! I asked for kung pow shrimp a little more spicy came same not extra spicy but I was hungry ate every bit. My friend had Triple delight she ate it all too usually she gets doggie bag. On our way out I asked why no delivery to my apt? I called weeks for lunch delivery and was told they deli ever across the street? -felt like I was in a seinfeld episode and I was Elaine! So I was told next time call ask for Joe? I will unless I order and go across street to a medical building and get it?"}
{"text":"Consistently good traditional Americanized Chinese food.  Take the hometown Chinese joint that most have an affinity for from their childhood, spruce it up a little, and what you end up with is Sesame Inn.

One of their several locations, Station Square is definitely the hardest to find, but don't let it fool you!  Relative to all the other food options in Station Square (sans Melting Pot (one of our favorite date spots - late night fondue!) and Texas de Brazil (which I haven't been to yet)), this represents your best bet for a quality meal unless you want to shoot for the Grand Concourse.

Stick with the General Tso's and you'll have a good meal that will satisfy your hunger.  The chicken actually looks and tastes like chicken and it's more than filling.  Sesame Inn's consistency transfers across all of their locations, which is a good thing to me."}
{"text":"My grandmother lives in Washington, PA. Several times a year, I go to visit her and we make the trek to Sesame Inn. I absolutely love their lettuce wraps, Pad Thai, and/or Singapore Noodles. We normally share the wraps and an order of the Pad Thai. It is a huge portion. Even while sharing, we still take left overs home! Great!!!!"}
{"text":"Tasty Chinese food and equally tasty sushi. Friendly staff."}
{"text":"Some of the highest quality and best Chinese food you'll find in the area, but with a price tag. This is a place to head to celebrate, not to consistently order out."}
{"text":"3.5 Stars. When you stay in Station Square, you eat in Station Square. Could be good or could be bad, depending on where you go. But, craving some Chinese food during lunchtime, I walked up to the second floor on the oddly structured building to check out Sesame Inn for the first time.

I was seated immediately and after looking over the lunch menu, I quickly decided on the General Tso's chicken with fried rice and egg drop soup. Naturally, the soup came out first and I found it very unique because it had chicken and vegetables in it. When I've had it anywhere else, that's never been the case. Although different, it was actually very good.

Soon after that they brought me the chicken and rice, which of course was enough food to feed a family of four. It tasted exactly like I expected, no better, no worse. Of course I couldn't finish it all, so maybe coming here for dinner would've been a better idea. 

Excellent service, reasonable prices and good food make this one of the better options in the immediate area."}
{"text":"I really like it. 

The food is tasty and the service is consistent.  And it's reliable - I've dined here or gotten take out many times and it is always the same, always very good. 

I can recommend the Amazing Chicken and the General Tso's. While neither breaks any new ground, the chicken is good and crispy and the sauce just a bit spicy. 

Egg rolls are crispy and good, too!"}
{"text":"My favorite Chinese food place in the city!! Great sashimi too!! I always get the pork fried dumplings, sashimi, and Chinese ribs to share with my bf. Soo good!"}
{"text":"YUMMY! Not your typical chinese food what-so-ever.
If you get the right waitress who can understand you she can help you work around the gluten free options and tells you what to avoid. 

They also have a thai menu, their pad thai and curry is very good. It has good flavor and is a large portion. I always have enough for the next day or two. 

Their lunch menu is the perfect size, it incudes a smaller portion, hot tea and soup/eggroll whichever you prefer, obviously I give both of those to whoever I am eating with. 

Great for Take-out!"}
{"text":"Decent food but delivery takes forever. We're literally less than a mile away down Carson street and it always takes just over an hour to deliver. The food is decent though and they always get the order right. 

Just order earlier than you think you should."}
{"text":"BF and I went here at 9pm on a Friday night, when they closed at 10, and I have to say everyone was very nice, considering they probably wanted to wrap up and leave. 

Plus, my chicken egg roll was amazing. BF's general tso shrimp was very good. 

Minus, we each got a very little bowl of rice, and when we packed up our leftovers we had to ask for more rice and received very, very, little containers. 

Another minus/plus, the flavor of my Capital Chicken was very good, a lot of chicken, good sauce, however, for $14, I had too many questionable pieces of chicken. I expect that from a cheap hole in the wall Chinese place where you pay $7, but for $14 and being the Sesame Inn, I definitely expected more!"}
{"text":"Very great service and my favorite sushi spot in pgh! Sushi is my favorite food so I have tried tons of places and this is my go-to! The rolls I recommend trying are the mango roll, heaven roll, spicy tuna, and rainbow roll. You will not be disappointed. I love heir cocktails also- I had a cucumber vodka lime drink which was so refreshing."}
{"text":"Mmmm!  Yet another update for Sesame Inn!  I was going over to the Byham after work last night for the Richard Thompson concert and I had a LOT of time to kill before the show.  I'm talking about 2 1/2 hours here.  So since I was dining alone and I had a taste for Chinese, I headed up to Station Square for some more Sesame Inn.

My tastes aren't all that exotic when it comes to Chinese.  The eggrolls here are out of this world.  The shrimp with peapods is a great choice if you just like the basics.  One bad thing about Chinese (besides an hour after you eat it....) is that they always give you way too much.  I wish they had lunch portions for dinner.  Good thing I was able to stop at my office afterwards and stash the leftovers in my fridge.  Leftovers for dinner tonight!"}
{"text":"We are staying at a hotel nearby so we thought this style food sounded good. We had the pork egg roll, egg drop soup and hot and sour soup. Those items were unspectacular. For the main courses sesame chicken and Singapore rice noodle. Well the sesame chicken was very greasy and taste like it was burnt in the deep dryer. The Singapore noodle was over cooked and mushy and was cooked with too much oil in the wok. Was not a happy meal. Will not return."}
{"text":"A wonderful place every time, I order things that are different, are they are find with it I like the volcano chicken with general So's sauce and they never make a fuss about it. And it still comes out perfect, no hassle ,"}
{"text":"Very good. This might be the first time I've ordered a dish with chicken it it at a Chinese restaurant and it actually looked like chicken. Usually you get those ground up and smashed into a uniform shape chicken bits in your meal at other Chinese restaurants so I was impressed.

The food here is really good. I've heard so much good things about this place that I was half expecting to be disappointed because I didn't see how it could live up to the hype, but I'm very glad to say that I was wrong. Everything was delicious and the prices were very reasonable. Highly recommended."}
{"text":"If Zero was an option I would use that for the number of stars to give Sesame Inn. Hair and my broccoli on multiple occasions for a takeout orders. Last evening hair on my avocado on my Pittsburgh roll. Last straw. Call this lovely establishment to get a refund (note: never called before to complain about the broccoli incidents) of which he refused to do and said I should bring back my trash and then I could get a full refund for my meal. When I asked to speak to the owner he refused that as well. I will never order from this disgusting place ever again, and I hope the health board checks out their kitchen. Disgusting food, terrible customer service. Be warned."}
{"text":"I wish I could give them 2.5 stars.  It's better than meh, but it's not a-ok.

There is a lot of nasty Chinese food in Pittsburgh and the Sesame Inn is better than most, but sometimes it's very, very bad.  I'm talking about the Station Sq location.  The Sesame Inn in Mt Lebanon is consistently delicious.

I do like getting lunch here because it's quick, it can be healthy (shrimp & broccoli), and it's around $10.  I will absolutely be back because man cannot live on Subway 5x a week and there aren't too many affordable lunch spots in Station Square.

Would I drive all the way into town to dine here?  Nope.  

Also, I have seen some kind of strange things here.  One time the two hostesses in the front got into a loud argument in Chinese, and then there was the time I walked by the restaurant and there was a server that was either passed out, napping, or dead at a table right in front of the window. 

That kind of set the bar low for my expectations of their service."}
{"text":"As much as I like to avoid a franchise restaurant, this is one of our go-to place for american-Chinese cuisine. I guess I'll take solace in the fact that I am still supporting a local franchise :) 

The place itself is pretty spacious and ideal for groups. They have two different seating areas including a full bar at the main area. The place is clean and the servers and service so far has been pretty good.

The food especially their in house specialties and traditional dishes are really good. No disrespect to the chef but if you're in the mood for the Pad thai or Sushi - I suggest you go to a thai or a Japanese restaurant.

So far during my visit here, I've had the Mongolian Beef/Pork, Amazing Chicken, General Tso ofcourse, Sesame Chicken, Mapo Tofu, Singaporean Noodles (don't recommend), Fried Rice, Lomein to name a few. I highly recommend the Mongolian Beef or Pork. Also, the portions served during the dinner hours are huge and reasonably priced - so order accordingly."}
{"text":"Favorite Chinese Restaurant!!  Always the best food with lots of choices.  Pricey but worth it."}
{"text":"My favorite Chinese in the Pittsburgh area.  Everything is top quality from the atmosphere to the food.

My favorite dish is the amazing chicken.  It is similar to general tsos but with a little twist.  I have also had the general tsos, sesame chicken, and the chicken fried rice and always been impressed.  

It is a little pricy, however the quality of food you get makes it worth it."}
{"text":"Excellent place and within walking distance from home makes it's a favorite place! I have nothing bad whatsoever to write about. The food, service and quality is perfect."}
{"text":"Sesame Inn was the place we went when we wanted Chinese food when I was growing up in Pittsburgh. My family owned a Chinese restaurant themselves and when they wanted Chinese food this is where we went. I remember the walnut chicken and the orange beef the most. What I would give to have some. The dumplings were also a favorite of mine too!! Just another place I will be sure to visit when I travel back to the Burgh."}
{"text":"Like a lot of Asian places in Pittsburgh, they offer a mix of Thai, Japanese, and Chinese dishes. I liked their Kamikazi rolls. I LOVED their House Duck Special. Soooo succulent. The service was really good. The decor is stately."}
{"text":"It's been a little while since I was at this specific location, but the chain--as a whole--is decent.

PROS:
Large portions
Flavorful dishes
Very nice staff
Obviously a clean restaurant

CONS:
Significantly overpriced for run of the mill Chinese food.
(It's just that) Very run of the mill, nothing is very original or unique from the norm @ Chinese restaurants.

Nothing much else of interest to really point out.
Very basic after that.

The restaurant is very normal for Chinese style restaurants.  
No frills."}
{"text":"Even though I'd been going to Pittsburgh for 3 years, I'd never been to Station Square before. On a friend's suggestion, we took the T from downtown Pittsburgh to Station Square. Sesame Inn is located inside a decidedly odd mall with twisty passages. The decor certainly is nice. We ordered Amazing Pork. I thought it was good but it isn't as spicy as it looks so I can't say that it is \"amazing\". Then again, I'm spoiled when it comes to East Asian cuisine because I'm a regular at Flushing Chinatown. No issues with the service. Prices are a bit higher than the average Chinese restaurant but that is to be expected because this place aims to be a cut above the average."}
{"text":"The oil to sauce ratio for my Kung pao chicken was 1:1 - maybe worse.  I couldn't eat it.  I literally had to rinse it off under hot water in order to salvage a few bites.  This isn't the first time that I have had this problem here.  Takeout is gross.  I won't be back."}
{"text":"This place is so hard to find.  I know it is in Station Square; that wasn't the hard part.  The hard part was finding the restaurant once I arrived at Station Square.  I really don't care for the organization of this odd mall, but that is another review.  Located at the North-East corner of the complex on the second floor, Sesame Inn is easily missed.  After having called the people several times on my cell trying to figure out where they were located, I was finally able to get to the stairwell leading to the front entry.  

Unintelligible Chinese people? Check
Chinese kitsch? Check
Good Chinese Food? Read on...

So far, so good.  Everything was appearing in place and had the proper feeling.  I was craving some good Sichuan food.  We were seated by the host and I looked at the menu solely to make certain that what I wanted to order was present.  When the server arrived I asked her some quick questions to make certain that there wasn't too much of a deviation from what I was craving and ordered:

Egg drop soup
Wonton soup
Panfried pork dumplings
Combination rice (no peas or carrots)
Kung pao, extra spicy, with only peanuts and red bell peppers

Our server was quite peppy and sounded like she was a first generation American since she spoke English flawlessly to us and then spoke Chinese to people in the back.  She was quick to bring out our Iced tea, Pepsi, and soups.  I was a tad taken aback by the appearance of my egg drop soup -- it was a deep red instead of a light yellow.  I spooned it through to make certain it was the right soup and found the cause for the deviation -- the addition of tomatoes to the soup.  Feeling comfortable, I tried the soup.  It wasn't bad, but it wasn't great.  It was thick and heavy with very little of that flowered egg/broth combination that makes for a very good egg drop soup.  I could live with a thicker soup, just don't take away the flavor.  The wonton soup also had that heavier feeling about it as compared to some of the lighter wonton soups that I have tried and enjoyed.

Our panfried dumplings arrived to our table and they smelled good.  While the skins were a little thicker, they weren't dumpling thick and the meat filling helped to balance it in terms of consistency.  The flavor was a bit muted, though.  Trying the dipping sauce, I received a bit of a shock.  Contrary to everything else thus far, it was quite vibrant. The dumpling sauce had a very strong acidic flavor to it and could possibly have use a tad less vinegar in the preparation.  Together, though, I enjoyed the dumplings and dipping sauce.  And, truth be told, I would rather the sauce be a little strong on the acid than a little week since I can always dilute with some soy sauce.

Our entrees arrived and they smelled quite good; but I had to send the chicken back.  There were mushrooms.  Sorry, can't eat mushrooms.  While waiting on the chicken to return, we started on the fried rice.  It wasn't bad, but it wasn't great.  It was fully cooked, but it was a bit soggy.  The meats were somewhat flavorless and only added another texture to the whole dish.  The flavor of the dish as a whole did not transcend being rice and meat.  A good fried rice really helps me understand the adage, \"Greater than the sum of the parts.\"

As we were finishing the fried rice, the new chicken arrived.  It was steaming hot and smelled good.  It looked to be more in a red sauce than a glaze as is customary with Sichuan foods.  I figured as long as it tasted good then there would be no issue.  I took my first bite.  It was sweet.  It wasn't piquant.  I had asked the server if items were spicy.  I had asked her about which peppers she thought were hot.  The chicken tasted okay, but it was nothing spectacular.  I continued to eat the entree and finished it.  It could have at least have been made from white meat since it was not spicy.  Oh well.

They don't serve Sichuan food here.  It is too heavy and sauce oriented.  I would say that it has to be some mixture of Cantonese, Hunan and Mandarin. Will I return, probably not.  Why?  I just don't like the Station Square location.  There are other Sesame Inn in Ross Township and Dormont.  I will most likely try again at one of those related restaurants to see if I like anything else on the menu.  For better or worse, it is one of the better Chinese in the area."}
{"text":"Great lunch menu, very affordable, and quick serive.  More enjoyable went you go vs. Ordering take out because you get hot tea."}
{"text":"I have eaten at 3 Sesame Inn locations now (several times). Mt Lebanon, the Canonsburg location and the Station Square location. The menus are all the same but there are subtle differences between each. For example, the kung pao chicken is breaded lightly at the Station Square location but is not at the Canonsburg location. Service is generally good and they are responsive to customized dishes or requests. Pretty good as far as Pittsburgh dining goes."}
{"text":"Sesame Inn has 4 locations. Station Square is the worst of all. I generally avoid this one but love the other 3. Still much better than most Chinese around town."}
{"text":"It's not that it was bad, just that it was basic \"Americanized\" Chinese food.  

We were there for lunch and specifically went because it appeared to locally get good reviews on Yelp.  Ambiance is dreary and bland.  Service was relatively quick.  Staff seemed friendly enough.  Menu was basic and did not have uniquely authentic Chinese dishes.  Comparable to a Panda Express in our opinion.  Maybe there is just not a market for Chinese food here in Pittsburgh. 

Again, it was not that it was bad, but not sure we will go back."}
{"text":"For the new Chinese Restaurant on the mount it is pretty decent.  Expanded menu with alot more choices than the old Golden Palace that was there.  Went inside to pick up a menu and there is a fresh new decor.  Placed a sizable delivery order and it was delivered in a reasonable time and everything was fresh and hot.  Very nice portions although some of their sauces are extremely salty.  Glad to have Chinese back in the mount, will order again."}
{"text":"The food here is better than a lot of your average Chinese delivery. The options are pretty standard, but their sushi is decent and well priced. Not gourmet, but tasty and regularly satisfies my fried Chinese food cravings."}
{"text":"Nice interiors ...food's just like any other chinese restaurant offering"}
{"text":"Came here on business from Los Angeles and it was the perfect dinner. Couldn't ask for more. Stop by you'll enjoy it."}
{"text":"This is one of my favorite chinese restaurants in Pittsburgh.  Food is always good and staff very friendly."}
{"text":"Less than average American Chinese menu. Wait staff was rude when I asked for some substitutions because of my diet...not cool. My dining partner order sushi and they said it was ok. My family style tofu dish was bland as I've ever had it. Egg Roll was greasy. The side of white rice was hot and free so there's that. Go to Jade Grille. It's one billion times better."}
{"text":"One of my favorite go to Chinese places in a pinch. Great for takeout especially. Food is typical of Chinese restaurants in the area. They have a few different locations. This location is a little annoying because if parking. It is also located on an upper level which could be a problem for some of you can't ascend stairs. Prices are pretty average. I've only ever had the chicken and broccoli, general tso's, sweet and sour chicken and orange chicken. All dishes were good and would get again. The food is always pretty consistent and has never been bad. Large portions too!"}
{"text":"Downloaded this app and made an account just to give a one star review. They would not pick up their phone and it went to a strange service line saying all lines were busy. The damn place is infuriating don't bother"}
{"text":"We've lived near this place for a few years only tried it recently. They have some awesome veggie selections and the food is delicious! The sushi was sooo good and the general tso's tofu was the best I've ever had. Really good service, large portions and we'll be back."}
{"text":"I had the general Tso's with a egg roll and it was Delicious!  The sauce was spectacular."}
{"text":"This is my first yelp review. I set up a account just for this review.  I was deeply sadden by the food I received today. 

I first started coming here since 1993. I have moved to Midwest four years later. However,  every times I drive thru Pittsburgh,I always stopped here. I really enjoy the general Tso' s chicken. As part of preparation, chicken was fried ahead of time,and fried again when you order, That is why their general Tso's Chicken was so crispy and aromatic when served. I did not have to make this stop, but after driving 450 miles, I wanted a decent meal.

Well, I stopped by and order the Dish for carry out. When I open them(it was not long, 30 minutes or less), they were so soggy, and based on my experience who grew up on Chinese food, it was not fried the second time. The difference? They tasted worse than Buffet dish sitting above the steamer for hours. 

Furthermore, I have ordered the shrimp with garlic sauce. Shrimp was hard to chew. It seems like the shrimp the simmered in the sauce for ages. There was no aroma from garlic or onion. 

Being a decent cook myself, I can tell you those dishes I ordered were not cooked by the main chef, or secondary chef. I suspect this is  probably made by the guy who station the fryer. Truly, the taste of those two dishes were so awful, I toss them out. I purchase those passing Pittsburgh, not really possible asking for refund.

I have had so much memory with this place. Rest assured, I won't be coming ever. It was so bad, I would not dear to try again. 

I do hope the owner sees this, and make a statement of this incident. I eager to see you standby your dishes again. If I see owner's rebuttal, I would love to call the owner to discuss this encounter further, and willing to be convinced to come back.

Sincerely"}
{"text":"Sesami Inn will deliver up to a certain distance, not sure what that distance is though. I can verify they deliver to parts of the South Side. Good Chinese food."}
{"text":"Must try the egg drop soup with tofu, vegetables and citrus. Good food at a great price.

The chicken and Broccoli is also very good."}
{"text":"If you have to eat at the mall this is really your best bet for the price. It isn't the greatest Chinese I've had in my life but I'd go back if I had to. Our service was good and we were in and out rather quickly."}
{"text":"I have been ordering take out from the Sesame Inn at Station Square for years now. Today was the last day that will ever happen! The person who delivered my meal was rude to the point that I felt the need to call the manager and complain. The conversation I had with the manager was even more inconsiderate. I explained that the delivery person was impatient and felt the need to explain to me that he had other orders on the South side to deliver. He cut me off several times and told me I had to be understanding because the delivery person was frustrated and under a lot of pressure. After attempting several times to have a \"discussion\" with the man - I hung up. Even before today, the quality of food and service had been creeping downward - and the treatment I received today was just too much. My business will definitely be going to another restaurant."}
{"text":"Absolutely amazing I usually don't venture out and we went to a new restaurant and I got a new dish, Capitol chicken it was truly amazing, wait staff is always there when you need them. would definitely go back!"}
{"text":"Their General Tso's Chicken is better than most Chinese restaurants in the area. When I visit various Chinese restaurants, I tend to always order the General Tso's to try to find which restaurant has the best in Pittsburgh. For $9, their lunch special is a pretty good deal, and you get a good portion of chicken, rice, and an egg roll. Overall, I would say the Sesame Inn is above average, and a good spot to pick up lunch if you are in the mood for some Chinese food."}
{"text":"Sesame Inn's stylized, fiery red signage and pagoda-shaped awning averted our gazes as we drove up Washington Road in search of unYelped eats. Entering its doors, we walked up a flight of stairs towards a commodious, white banquet hall of a dining room with sculptures and Oriental musical instruments furbishing the interiors. 

Sesame Inn is a local chain of somewhat upscale Asian restaurants with an emphasis on Chinese favorites, all of which I've seemingly had before in varying permutations. Deciding to eschew the familiar during a recent visit to this posh, penthouse-like location in luxurious Mt. Lebanon, I treated Kay and myself to some sushi and a sampling of Thailand. 

Kamikaze Rolls opened the proceedings with a tempura-battered flair and bombast. An artistically stacked and embellished sextet of bronze medallions filled with smoked salmon, cream cheese, tamago, avocado, and asparagus dazzled our taste sensors with a blend of richness, creaminess, tartness and a crunchy yet elegant mouthfeel. Earth-toned ribbons of various smooth, mayonnaise-based (?) sauces or condiments further enhanced the deep-fried fantasy like suds unleashed during a rave.  This is why sushi still captivates in spite of its now mainstream status. 

Desiring an entree I'd yet to try, I opted for a bazaar of a dish in Mussaman. My chosen protein of shrimp may have been what the course was centered around, but it was the exquisitely sour tamarind that truly made it shimmer albeit subtly. Onions, pineapple, string beans, and potatoes would make the Mussman nourishing while tamarind brought the sass, peanuts provided texture, and coconut milk tamed whatever magical fires the curry mischievously ignited. 

With above par service, ornate environs, exemplary food, and moderate pricing, one is reminded that PF Chang's is blasphemy and that Asian cuisine is better on lavish plates in restaurants than it is in cardboard cartons at home.

P.S. Sesame Inn does a nifty Sunday brunch that costs between $11 and $13 a head and includes  soup, salad (or egg roll), a beverage (champagne costs just $1 extra), and an entree."}
{"text":"As Sal G. said, finding the Sesame Inn is a little tricky inside the glorified  mall that is Station Square. Hint: It's up on the seldom-traveled 2nd floor, so climb the steps and keep walking along the balcony until you see it.  Or...just ask somebody who works there...like we did. 

I rather liked this stately, serene Chinese restaurant that Kay and I came to for a pre-concert dinner (Dream Theater and Trivium at the Trib Total Media Amphitheatre. Other metallions obviously had the same idea.).

I really was at a loss as to what to order, so I went with Lamb Hunan; a mildly spicy yet sweet dish loaded with a hodgepodge of fresh vegetables and protein. The lamb was just a wee bit gummy, but other than that I did enjoy the generous helping and the fluffy white rice that came with it. 


Kay has a knack for ordering things I almost ordered and making me envious over it. 

Honey Moon Duck: What I almost ordered. 

See my review for Root 174. Look it up. I'll wait.

Yeah, Kay scooped me yet again. Not only was this a similar scenario, but the boneless duck had the same crispy, moist, fall-to-pieces quality that Root 174's pork-fat-cooked-pork shank had and was so artistically plated, Kay was tempted to put the root-vegetable \"flower\" garnish in her hair for the brisk, magnetic, prog-metal evening.

Our appetizer consisted of an exceptionally gratifying sextet of boiled pork dumplings. Served with a refreshingly tart soy ginger dipping sauce, each potsticker was a supple, richly meaty joy in both wrapper and filling. Voluminous, velutinous, victorious. 

Sesame Inn has a very limited dessert menu, but due to the large portions, we were too full to partake. Give Sesame Inn a whirl for they are a reasonable, tony dining option if you find yourself in or around Station Square for whatever reason."}
{"text":"A small group and couldn't decide what type of food to get...so we went to Sesame.  Fun place for a small group, you can share and try different items on the menu.  

The Thai items on the menu caught my eye or was it my taste buds.  Enjoyed the Pad Thai Shrimp, while the menu states it is spicy, not to much, was expecting more spice.  Sampled another Pad Thai, forgot the name, and it was not as spicy as I was expecting but good.  The Amazing Chicken turn out to be not so amazing.  It was OK but expected more.     

SI is popular and I can see why.  Nice place and good service."}
{"text":"Good food, and our go-to Chinese restaurant. Very nice decor, with a good mix of traditional Chinese and Thai, plus sushi. But it can be infuriating when you want to order takeout because phone calls often roll to Verizon where you hear that they're not available. A regular busy signal would be better than wondering if the place is still in business."}
{"text":"Not entirely sure why this place keeps getting rated as one of the top Chinese restaurants in the annual City Paper \"Best of the Burgh\" edition. And not to be entirely unfare to Sesame Inn, but, it's just okay. The menu is extensive, comes with all the normal dishes you'd find at a good Chinese eatery. The basics, the specials, the chef's specials etc. it's good food, it's just not anything special. 

On a recent night I had the vegetable  fried rice and stir fried string beans. The rice had that smokey umami flavors we all love, nice chunks of broccoli, carrots, and straw mushrooms. The beans were crisp tender, again, the umami flavors we are accustom to from Chinese food shined through. But, again it's just not special. So why pay to park at Station Square when you can go to any Chinese restaurant with private parking and eat there?"}
{"text":"If someone asks me what my fav place to eat is, I always say here! Delicious, hearty portions & great service. 5+ stars"}
{"text":"Honey Moon Duck? Yes, please. Now, I haven't had it in over 6 years, but I do remember getting it at some point in my life [OK, several -- no, make that many] points in my life, and it was good.

It's Chinese Food. They have a decent dining room, they do decent entrees, and they do take-out. Are you looking for something more?

No; you really just want the Honey Moon Duck [for two; and yes, you'll be eating the whole thing yourself]."}
{"text":"The food was decent.  The service was terrible.  When we got to the restaurant, there were only seven occupied tables.  Only one waitress, and a man who seemed to do nothing except deliver change and receipts.  It took about 20 minutes for the waitress to take our order.  Food came out pretty quick after that.  We had to refill our own water glasses... thankfully the water pitcher was left on an empty table.

As for the food.  It was decent but nothing spectacular compared to other Chinese restaurants we've been to in the past.  

Seven tables is a lot to expect for one waitress.  I would have been more understanding if she was efficient or the man \"helping\" on the front end was doing something to help her.  We normally start our tip at 20% and go up from there.  The service experience was so bad here, we left 10%."}
{"text":"I have been coming here for years and I tell you I like the ambiance of the restaurant itself. Though this is a local chain, this is by far the best one. Amazing Chicken is well...amazing!"}
{"text":"We were freezing cold after sitting through a football game and I wanted Chinese food to warm me up. We almost turned away because of the look of the outside - don't let it fool you.  Go in, and upstairs and it will be well worth the choice.

This was one of the best Chinese meals I've had in many, many years. The hot/sour soup was very good, the egg roll, also good.  We tried the 3 Rivers Roll - OMG....I'll be craving that for a very, very long time.  We also go General Tsao's chicken - chunks of white meat and nicely crispy, lo-main, shrimp and garlic and a seafood dish (yep, only 3 of us, so WAY too much).  Everything was fantastic.  We'd go back in a heartbeat!!!"}
{"text":"My wife and I and our son love this restaurant. Once you have Chinese food here you will select this as your top Chinese restaurant. Everyone is so friendly, the service is excellent and the food always comes nice and hot. They also have some excellent Thai specialties. I recommend the KieWan if you like Thai dishes. The amazing chicken will keep you coming back time and time again.  I cannot recommend this place enough; try it and I bet you agree."}
{"text":"I have a unexpected love affair with seasme inn that started one night on account of take out and has been growing ever since. Seriously if you're looking for delicious American- Chinese food without all of the grease and questionable meat items- you'd be crazy not to try and fall in love with this place. 

I've never actually eaten in at the Mt Lebo location, I always just get take out because it is so close to my house. Typically, I order the General tsos chicken for me and the string beans with chicken for my fiancé- both come with steamed white rice. 

The portions are extremely generous, literally enough for two meals worth. The pieces of chicken are always huge and REAL- again not strange is this or is this not chicken that you might get from other Chinese take out places. The quality of the food is top notch and honestly though the prices are more steep than other Chinese restaurants it's 100% worth it for the quantity and quality you get. 

Also, each time I've gotten take out their staff have always been really friendly. Actually, when I give my number they have my past orders on file so if I'm re- ordering my go-to's (noted above) then it's a quick and easy phone call. 

Overall, love this place and I will continue to go here until my love affair burns out (which I don't see happening)."}
{"text":"Went in a group of four. Service was quick and good. The staff were nice to us. The rating I gave is the average over multiple items that we ordered and also includes a 4/5 rating for the service. 

Starting with the beauty Alaska rolls which are fresh and the salmon had a smoked flavor. I would give this 4/5 because I found the sauce to be overwhelming, but with appropriate quantities, the rolls were tasty. They offer 8 rolls. The price was reasonable for the quality and quantity. 

The chicken fried rice was tasty but the chicken looked dry and unappetizing. The fried rice minus chicken is a good dish with appropriate amounts of spice and seasoning along with veggies. I will give this a 4/5. 

The salt and pepper shrimp to me looked like a fried shrimp with some salt and pepper sprinkled over it. They served the shrimp over a bed of lettuce and garlic accompanied by few broccoli. The combination didn't appeal to me. In addition, the shrimp tasted like fried dough that lacked seasoning. Though the shrimp seemed to be good quality, the dish as a whole didn't impress me. I would give this a 2/5. 

The sesame chicken consisted of chunks of well cooked and seasoned chicken covered with sweet sesame sauce and topped with sesame seeds served over fried noodles. Based on the instructions on the menu, we thought this would be a spicy dish, but it ended up being a sweet dish. The person who took our order didn't tell us about the difference. However, I still liked the dish. The texture was sticky and mushy and the chicken pieces were too big. My rating for this dish is 3/5. 

I don't think I will go back again since I prefer Sichuan flavors. However, if you like American version of Chinese food, I recommend this place."}
