{"text":"Seviche has a lively, colorful atmosphere that added to the dining experience. Our server was very attentive and knew the menu very well. She was able to offer many suggestions. The rest of the wait staff was also helpful when it came to seating us, turning the air down, everything.

Served tapas style, the food is conducive to sharing and ordering lots of little things. We tried for all ranges of the menu and thought the dishes had interesting flavor profiles, were prepared well, and tasted great.

The seviche section allows you to choose a fish and a style of preparation -- they are delicious! The filet mignon was also a wonderful cut of meat.

Mojitos are a bit pricey at $9 a drink for the small glasses they are in, but are delicious all the same."}
{"text":"I'm writing this review after about 5 meals at Seviche.  I highly recommend it to anyone looking for a deviation to the standard American fare.  I'm usually with 1 or more friends and we order a number of small plates.  It's fun to share the experience - and the beer and mixed drinks are a bonus."}
{"text":"Pittsburgh has a serious lack of quality ethnic food choices, and Seviche is without question the best of the available options.

Having said that, Seviche is a worthwhile destination in its own right.

The ceviche bar is unique, and the recommendations of the staff were on-point.  The sauce / fish combinations that I chose were excellent.  I also ended up ordering a  bocadillo, which was full of flavor, perfectly balanced, and filling.  The kitchen sent out some complementary tapas towards the end of the evening which, though I don't remember what they were, were also delicious.

The wait staff was delightful, and kept me engaged the whole evening.

The beer menu is lacking, and they only have bottles.  It's definitely more of a wine and cocktail type of restaurant.

I'm tempted to dock a star because the music was obnoxiously loud by the end of the evening, but the overall experience was so outstanding that I'm happy to overlook it."}
{"text":"Inattentive and cold wait staff.  Portions are small and very overpriced. 3-bite tacos are $6.  Dinky plates of ceviche for $10. Having had authentic ceviche, theirs was unrecognizable.  Flavor profiles were boring and had almost no lime flavor. Would not return."}
{"text":"I visited on a Monday night around 10:30 pm for some late night tapas and salsa dancing. The downtown location makes parking a bit of a pain even on a weekday night. However, the food was quite worth it! The mac and cheese with bacon was absolutely delicious and the ceviche tapas was very yummy.

As for the dancing, there was a small crowd of dancers when I went, a little heavy on leads and a mostly older crowd. The dance floor was wooden so bring your dance shoes! They were playing a 50/50 mix of salsa and bachata. I only danced a few songs, but I had a good time."}
{"text":"Seviche is fabulous! 
We had great service for dinner on a Saturday night. 
Good wine selection, and a big list of various mojito varieties to start.
Our group shared a variety of seviche, all of which were  fresh and tasty, and very well presented. We especially enjoyed the fire and ice preparation.
We moved on to sample a variety off the Tapas part of the menu, and again, were pleased with everything. The mussels and the crab salad were especially good.
After all of that, we moved on to entrees, where we again couldn't have been more pleased.
It was surprisingly very affordable, given the amount of food and drink we ordered. 
Highly recommend."}
{"text":"This was a great first visit to Seviche! The drink selections were great as what the bar staff.  They were very open to making suggestions and were very knowledgeable about both.  The music was good and the atmosphere was very cool and upbeat.  We will definitely be returning here in the future and would recommend it highly.  Enjoy!"}
{"text":"Loved it! Had a fantastic evening! Great drinks, fun atmosphere, and delicious food! Tuna Tartar blew me away!"}
{"text":"Seviche was one of the best dining experiences I've had in a long time.  I had heard many good things and finally I was able to experience this gem.  

We had reservations for 6:00 but since it was a Friday, we wanted to go earlier to experience their happy hour.  Happy hour did not disappoint (not that any happy hour ever could or should).  We were pleasantly surprised that through Yelp we could take advantage of a check-in offer for free sangria.  Who doesn't love their first drink at happy hour to be free?  So the wife and I were able to partake in a delicious red sangria all the while saving $10....thank you Yelp!

Our waitress Lizzy (I think) was great. She explained the menu and atmosphere of the restaurant, was prompt with our drink orders, and wasn't overbearing knowing that we wanted to enjoy a few drinks for happy hour before enjoying our meals.  

The food is amazing.  We started with the fire and ice ceviche with jumbo lump crab meat...what a combo!  The ice part comes from a dollop of flavored ice or light sorbet.  It was hard to tell the flavor but it was delicious.  It cooled the mouth after taking a bite of the spicy jalapeños mixed in.  The whole fire and ice concept is well worth the price of admission.

Then the wife and I each had two tacos.  They are soft flour tortilla tacos and you select the style you want.  The wife got a taco with wagyu beef and one with the fish of the day which was calamari.  She loved both.  I had a bite of the wagyu beef and it was flavorful and moist.  I had the carnitas taco which is delicious pork with a nice spicy sauce.  But my second taco was the one I would have as my last meal...the BLT.  This stands for belly (pork belly) lettuce, and tomato.  The pork belly slab was huge and had a sweet crust that went so well with the salty belly.  I wish I could describe the flavor but you just have to try it.  Sweet, salty, delicious.  

Seviche has easily become one of my new favorite restaurants downtown.  Do yourself a favor and try it.  You won't regret it!"}
{"text":"Meh. Over priced. Under delivered. I've had better tacos in the back of a parking lot in Los Angeles than the tacos here. Oh. And in LA the tacos are $1 a piece. At Seviche? $7.  I've literally had better ribs from Aldi than the Boar Ribs at this place. I absolutely recommend that you steer clear unless you want to drop a healthy wad of cash on mediocre, overpriced food."}
{"text":"I came here twice: once when I ordered from the happy hour menu, and once when I ordered from the ceviche menu.  Happy hour was fun, and we ordered quite a bit of food for a reasonable price.  However, the seviche menu was rather expensive.  It was a date night, so we splurged and ordered the pricey plates--they were yummy, but our bill was on the high side.  Fire and Ice was probably my favorite."}
{"text":"We went here twice in the past two months. I would have given it 5 stars based on our first visit. Our second date night was good but not 5 star worthy. 

I highly recommend trying their seviche. The Fire and Ice is awesome with lump crab meat. The others were all good also. A group of us also tried some of their tapas. Everything was very good, especially the stuffed octopus. 

On our second trip, a Friday, two things happened. We walked in off the street as a last minute decision to eat there again. The hostess was annoyed that we didn't have a reservation and stated that we could only sit at the bar. Only 2 of the tables in the entire restaurant were occupied. We sat at the bar and briefly discussed the \"encounter\". As time passed and the place was not filling up, I checked Open Table and found that every time slot was open. We could have made a reservation as we spoke with the hostess and maybe she would have magically welcomed us again differently. Whatever.

The second thing was that one of the seviche dishes we ordered had a fishy taste. It was faint and it took some time for us to notice but, we decided to stop and not tempt fate. Everything else was fine. We didn't mention it at the time but looking back, I think we should have sent it back.

The drinks are good if not a bit weak."}
{"text":"This is not a Cuban or Latin rest, far from it and very over priced for what you get...."}
{"text":"I had the banana stuffed pork tenderloin w rum glaze & a Caipirinha.  He had quesedilla sliders or smthn. Nice atmosphere, strong drink, unremarkable food, cute waitress."}
{"text":"This was a restaurant I had passed many times while living in the city! I recently went this weekend and the food was absolutely amazing! There was no wait to be seated and the staff was super! The margaritas were amazing along with the empanadas and the stuffed octopus tentacle!"}
{"text":"It's okay. The food is ordinary. I do like that they have salsa on Mondays. The drinks are very okay too."}
{"text":"I'll have to agree with the previous reviewer on the decor of this restaurant.  Suffice it to say, it's not that great.  But really, people come for the drinks and tapas, right?  

Well, be prepared to pay.  About $10 per tapas or drink, both of which are ok, nothing to write home about.  I got the Pomegranate mojito which was not much of either.  At $10, I was expecting a bit more.  Same for my friend's caipirinha which was essentially lime juice - ugh.  Forget a wedge of lime, try 4 wedges - a bit too much!  The food itself - ehh.  The portion sizes are tiny and overall the quality not the best.  We tried their traditional seviche (it is the name of the restaurant) - ok.  Not really spicy enough.  The mojo pork - definitely not traditional (usually pulled), this was on bone and while well-cooked, fatty and where was the mojo?  The mussels and croquettas - more of the average we were beginning to expect.  

Crowd-wise, this was an interesting mix.  Business professionals, yuppies, random people just out.  In general, an older crowd upper 30s-50s (on a Friday night).  Oh, and just grab a table when you come in - no formal seating.

Not sure I will be back here, but sure was interesting to try."}
{"text":"Seviche gets 4 stars for it's amazing SERVICE (I was here for a birthday party with a big group) and it's wings.  I'm not much of a tapas fan and I had a friend who didn't eat seafood - so the menu was a little hard for us.  We ordered the wings and a sushi roll, which were both great!

The Wings - Nicaraguan style wings and cooked perfectly.  They aren't your sauce-y buffalo wings, but are a dry rub with some spice, which was just the right bit of spicy for me!"}
{"text":"OMG...this place is amazing. My husband and I are from Cleveland, OH and came upon this place by total accident. We truly had the best Tapas EVER!!! The service was amazing!!!"}
{"text":"We went to Seviche following a show at a theatre downtown on a Wednesday evening. We were visiting from Michigan and think this was our favourite dining experience while in Pittsburgh. We had an amazing server, Tony who suggested the fire and ice Seviche appetizer. What an awesome experience to try! (I ordered without the spice and it was still amazing..) we also ordered three tacos and a meal to split, the scallops. Overall I can't say enough positive things about this place and know I'll return if ever back in Pittsburgh. Everything was fresh and amazing and again, awesome service!!! Thanks Seviche and tony!! :)"}
{"text":"I can't speak to previous reviewers' knowledge of the changing menu at Seviche. I'm an out-of-towner who followed the recommendations of my fellow Yelpers in an effort to find somewhere to eat on the Strip before a show at Heinz.

What a delight. Seviche takes a very playful, creative approach to its Latin American cuisine. I had three different tacos and I loved all of them. 

Their bacon is thick and made on-site. Fruits complement the flavors of meats and shellfish. Sauces are fascinating. Great stuff.

I knocked off a star for two reasons: 

1) I was told the chorizo was Spanish chorizo, not Mexican chorizo. It was definitely Mexican. I know Spanish chorizo like I know my armpit. It physically cannot appear in the form of ground pork.

2) The flourless chocolate cake was good, but the portion was surprisingly small with respect to the generous portions of the dinner entrees, and I feel that $8 was a bit much for such a miniscule dessert.

Still, inventive, fresh food and attentive service. There are plenty of other menu items I'm eager to try."}
{"text":"Noisy but wonderful atmosphere. The food was amazing! Especially the fire and ice seviche!!! It is a must visit! Sit, eat, and drink. It is well worth it!"}
{"text":"This was a very fun, hip place. I went on Thursday evening and it wasn't too crowded, but still lively. The menu options are interesting and everything I tried tasted good. I had to different plates, a glass of wine, and split a dessert with a friend for $36, which isn't something I'd do every week, but it was OK. The waitstaff is very friendly and the atmosphere is fun. I'd go back. (though I don't know why this place is classified as Cuban. They have things from all sorts of Latin countries.)"}
{"text":"Mediocre is an understatement. Waiting for over 30 minutes for my main dish, the pork ribs that I ordered came out dry and flat in flavor. My colleague had the hanger steak and also complained that it was dry despite asking for a medium-rare. Seemed interesting enough to try, but I won't be back."}
{"text":"I can't believe I still have yet to post a review for Seviche. 
Been coming here for several years now, although it is still my favorite Cuban restaurant in Pittsburgh, I just haven't been able to come as often as I would like to.
With that said. Very enthusiastic and helpful staff. Great music. Great people. Great drinks. Even better food. 
We came with the little ones a few times and the servers even offered some mocktails for the girls to make them feel belong. 
The only complaint I will ever have about this place would be the parking situation, at peak hours or on weekends do expect to be several blocks away for street parking."}
{"text":"Wow. This place is amaZing. I was on a business trip from Dallas. I loved everything."}
{"text":"If you like Sushi and aren't afraid to try new things, this is the place for you!  As it stands, Seviche is one of my favorite places downtown - always great for a cocktail and a light, but filling meal, and is never disappointing.

As frequent diners, we typically stick to the same tried and true selections: The Crab Fire & Ice are excellent as is the Tuna Tartare and the Cuban Sushi Roll.  The Bistec (kind of like a Filet Quesadilla) is a great ending when coming off of the lighter selections. And the service, whether dining outside, at the bar, or at the Sushi bar, is consistently outstanding with friendly, knowledgeable staff, who is always eager to be a part of your experience. This past visit, Gina was our server, and she was fantastic - very personal and attentive!

Aside from the cuisine, Seviche also features house made Sangria and specializes in Mojitos... The perfect cure for the summer heat!"}
{"text":"The food was good, the service was excellent, but I left hungry. I'm a vegetarian, and the vegy food just wasn't that filling, so perhaps it's a better choice for people who eat fish/meat.  It was pretty loud and difficult to talk.

I went with a friend who cannot eat gluten, and the staff was very good at helping her find things she could eat.  They were extremely knowledgeable about gluten free food."}
{"text":"Food is delicious and well-prepared. Some unique things and Fire and Ice ceviche is awesome. Be forewarned that portions, even for medium plates, are small and very pricey. Dishes can be thought of as good bar food with a twist--good for sharing, not really enough to get full on, but definitely a place good enough for non-drinkers to enjoy themselves. Plus, Monday nights they have free dancing classes!"}
{"text":"Amazing!!! The fish from the seviche bar was EXTREMELY fresh and delicious. I went with a girlfriend around Happy Hour and stayed for dinner. The drinks were great (a bit pricey but tasty). We tried a little bit of everything and everything we ordered was wonderful. The service was FANTASTIC and the manager even did a stop by to make sure we were having a good experience. I will DEFINITELY come here again. I recommend the following dishes: Puttanesca, Agave, and Avocado Corn SEVICHES, CORN AND GOAT CHEESE CROQUETTAS, BISTEC with filet, and CHARGRILLED FILET MIGNON. Yum!"}
{"text":"The food and service were both excellent. I had the fire and ice ceviche and cauliflower au gratin and pizco sours to drink. It was excellent. I really recommend Seviche."}
{"text":"If you want to go on vacation, but not leave Pittsburgh, this is a place to try! The website says it best -- a South Beach/Latin vibe, between the decor and the food. It's really unique, in a good way.
Went for drinks and tapas (and seviche!), but I definitely will be back to try their entrees."}
{"text":"I've been here twice while on business trips to Pittsburgh. Both times I ordered the chefs table (seven course tasting menu) and both were great.  Each consisted of three different seviche preparations, three hot tapas courses and a dessert course. The portions are just right to make the meal satisfying without being over filling.  Definitely worth checking out if your in the area."}
{"text":"Dined there for the first time.  My husband and I tried the crab salad tapas, shrimp tempura and the pulled pork tapas and they were all excellent!  I found my new favorite drink...the Cuban pomegranite!    For a Saturday night, it was packed, therefore, the service was rather slow.  Our waiter wasn't the most attentive as we hardly ever saw him and took awhile between courses.  I'm glad we weren't in any hurry.   I thought the food was very good and I will definitely go back."}
{"text":"Great view of penn ave.  went for date night perfect. Classic margarita was my favorite drink.  Tacos were delicious we had one fish and one be pork. They were very flavorful.  My boyfriend had the carne asada awesome dish. Fries tasted like kennywoods.   I had the salmon it was amazing.  Then lastly finished up with desert the key lime cheese cake was on point very creamy and light at the same time     Waiter attentive.  Would revisit for sure"}
{"text":"Great place....love that they're changing from small plates to lots of plates, big plates, just plates full of really great food.
We had a delicious meal, the pisco sour was pretty darn good and the atmosphere was good. This is a great place to come to over and over."}
{"text":"We came here on a friday evening without reservations, so we took the outdoor seats. It was nice when the weather was good.  I usually check in on Yelp as reminders for myself to write reviews later. This time, I was rewarded by a free glass of sangria here! It was a little bit on the sweet side for me, but I won't complain since it's free :)

Since we arrived around 6:30, we ordered a few items from the happy hour menu. I like the  seviche from the happy hour menu. My friends tried the baja fish taco and they liked it. The BLT taco with pork belly was interesting and tasty. The  chicken quesadilla was good though not special. We also had Mojo nigiri. The fish was good, but the combination just didn't work well.

It was a good experience overall."}
{"text":"Make sure you go to seviche for their happy hour. Their appetizers are delicious! I would recommend the Mango Seviche and the curry coconut tostada."}
{"text":"What a beautiful night we had eating outside! We started with drinks, I had the Portuguese lemonade because I love ginger anything. It was perfect and balanced perfectly with our meal. Husband had the pisco and it was good too! 

We started with two ceviche, the fire and ice ahi and rhubarb shrimp. Both were delicious! The pear granita in the fire and ice was good!! We then had the charcuterie plate. What a delicious mix!! The albacore was my favorite. The picked veggies had a great flavor! We ended with the smoked salmon. It was perfectly prepared!! Flaky and moist and melt in your mouth good. It was paired with a delicious rice, that was addictingly good and a gazpacho sauce. 

Service was good. Food was great!"}
{"text":"My wife and I were only in Pittsburgh for two nights and after last nights great dinner we decided to return to Sevechi. The staff is very friendly and do a great job. This time we ate at the counter and watched the executive chef and his crew create some amazing meals. Again our meal was top shelf. If we ever return to Pittsburgh you can be sure we'll have a meal here. Ask for the server who looks exactly like actress Rosie Perez. ;-)"}
{"text":"The ambience at this place is great. If you are a seafood lover, this place will have many options. Being a vegetarian the head chef recommended some great mushroom taco options. He also recommended a mushroom entree, but they ran out of mushrooms, seriously? The pineapple salsa is amazing! The service at this place is alright, as the waiters take a long time. Getting chips and guac took more than 15 min, which is unacceptable. I would revisit this place to give it another chance though"}
{"text":"Get your Salsa dancing in and tapas! If they have live entertainment, you are in for a treat. This is one of the only places in Pittsburgh with great Latin food and music. I love all their apps, and haven't had dinner yet but will when I stop dancing."}
{"text":"Great stop for our overnight in Pittsburgh.  New menu...  We tried the salmon, chorizo taco (awesome), Baja taco (tasty), blt taco, and \"two little pigs\" (amazing), but the pork belly was the highlight of the night. Great service at the bar. Atmosphere was cozy and casual."}
{"text":"Yum!   The food is amazing and the service was outstanding.  We are pretty adventurous and asked our waiter to choose some items from the menu for us. I honestly can say that  there was not one thing that I did not like. I wish I would have paid more attenetion to the names of the items that we ate so that I could make some recomendations. If you like seviche and Latin American food I really don't think that you could go wrong with anything on the menu.   My only complaint is that I wish there was a little more room as it gets crowded rather quickly."}
{"text":"The food and atmosphere was great. The service was lacking to say the least. Three different servers, 2 messed up bills and the wrong charges. At least the food was original!"}
{"text":"I love the ambiance! It's very cool and trendy. The fire and ice ceviche is amazing, and the carne asada is to die for!"}
{"text":"Wonderful tapas style dishes, their fish is fresh and delicious.

Service is not the best, never got offered drink refills and our empty glasses/plates piled up."}
{"text":"Ok, when I lived in Pittsburgh, this was one of my favorite salsa venues.  It really does have a great vibe.  I dig the decor.  Staff is friendly and efficient.  I didn't ever actually eat there until a trip back last year and had this review been based on that experience it would have been 5 stars hands down.  Some of the best sushi I ever had.  I had been craving it for months when we went back to visit some family over Easter and I rushed to this place but was gravely disappointed.  Fish came out warm and limp and the criollo rolls (which were what I thought I had ordered last time) were a mix of raw fish and mayonnaise that brought about all of the worst possible associations.  Uh-uh.  I physically gagged when I put in my mouth.  Inedible.  That being said the staff was very accomodating, removed it from the bill and brought out the ginger ceviche to substitute which was very good in its own right unfortunately the rolls had already ruined raw fish for me for the night.  
To be fair, it may have just been an off night as I did have drastically different experiences, but it will be a while before I try this again..."}
{"text":"Food is nicely presented, tapas style, but really nothing remarkable.  If you don't go to dinner often, you would be impressed by the presentation and the fancy cocktails--which were very small and way too expensive for what you got.  Even the entrees (served a little bigger than tapas size) were nothing great.  Many better ethnic restaurants in the city!  Atmosphere is hip and trendy.  Dress to impress!"}
{"text":"Meh.  Call this rating 2.5 stars.  I live in the neighborhood and go to Seviche periodically.  The food is fine.  I wouldn't rave about it, but I do go back from time to time.  However, the portions are small and it's expensive.  (Not their fault, that's just how it is with tapas, it seems.)  Don't go if you are hungry - I have to order two or three dishes and the price runs up quickly.

I like to sit at the bar, but bartenders seem to have no personality - don't really engage in conversation or seem to acknowledge that I'm a return customer.

Having said all that, the place is always packed (note: closed Sunday).  I don't really understand it, since I think there are better choices, but in fairness, there are a lot worse too.

The restaurant is on a city street - no parking for Seviche itself.  Closest lot at 9th & Penn.

In warm weather there are four or five tables on the street - much sought after real estate.

Periodic music - maybe Thursday and Friday nights."}
{"text":"From an unusually interesting menu, chose soup, entrée, dessert. Each one a spicy but subtle combination of flavors, thoroughly pleasing. Very friendly and attentive wait staff, inviting environment."}
{"text":"Best.Mojitos.EVER. 

As a lover of mojitos, I've tried them at places all over the world and they are the best at Seviche. They have so many unique flavors - try them all...you can't go wrong with whatever drink you order here.

The food is good, but it's expensive for what you get. I understand that tapas are small plates, but Seviche's plates are extra small and expensive. I say skip the food and just come here to drink!"}
{"text":"Tapas with a twist! Interesting combinations of fish, sometimes with a hint of Mexican sometimes Asian. 
Really liked the all their tapas but not a fan of the big plate that we ordered. Though the flavors came out beautifully it was a little greasy for my taste, would have preferred it to have the fresh burst of flavors the smaller plates had. 
Other than this enjoyed the sangria, the presentation of the food and service!"}
{"text":"We go here as a change from other downtown restaurants. In a smaller room, we like the latin-asian fusion concept. Seviche has a vibe that we like & our 20s family members always seem to enjoy. Menu has enough variety to satisfy different tastes. Good mojitos & a nice happy hour are a nice bonus, although it looks like their happy hour is 4-6pm now rather than 5-7pm, which is kind of early for many of us who don't work downtown & certainly not very latin! Hey Yves, que pasa?"}
{"text":"In town for my birthday and decided on Seviche sure to great reviews and the gluten free menu. Service was amazing, our server was very knowledgeable about the menu and assured me my food would be prepared safely...very important for us celiacs! I checked in with yelp and got my free sangria, it was so tasty I paid for a second! The food was amazing, flourless chocolate cake is a must! We even got a chance to speak to the head chef. He was super nice and chatted a bit with us regarding the menu and their gf prep training. Can't wait to come back!"}
{"text":"Delicious food! Really accommodating, even changed up some of their dishes to make it vegan for me without substituting flavor."}
{"text":"I'm a Miami girl who loves her Hispanic culture... the food, drinks, and music here were good!"}
{"text":"3.0 / 5 - Asian Tartare with Tuna
2.0 / 5 - Cuban Sushi Roll: Very salty
3.0 / 5 - Bistec
4.0 / 5 - Peruvian Poke"}
{"text":"I first ate at a restaurant down in Florida by the same name, although I later came to find this was not the same one. I did my research, and thought this place really appealed to me. I like to try many types of food and have somewhat adventurous taste min food.  Since it is a tapas restaurant, I made sure to order off the tapas and ceviche menu rather than an entree. I ended up having ahi tuna ceviche in the Latina credo style with pesto and sriracha, the artisan cheese plate tres quesos,  Cuban sushi, and  my husband had the fire and ice crab ceviche with habaneros and prickly pear granita. We got lucky, and sat at the bar to watch the chefs, and the sous chef accidentally messed up a special order, so we got the mess up on the house. He served us a Peruvian  po me style ceviche with toasted pine nuts, pesto, herbs and spices and olive oil.  Everything was deliscious beyond words and full of intense flavor. The Cuban sushi which incorporated both salmon and tuna along with jicama was probably one of our faves. My ceviche was deliscious, as we're the pickled vegetables it was served on. The. Cheese plate included Manchego cheese, a marbled sage cheese and the barely buzzed beehive, a mixture of 4 cheeses with the end dipped in espresso grinds. The barely buzzed was strong and had wonderful taste. The fire and ice crab ceviche was spicy but not as spicy as I thought. The sensation of heat from the habaneros and the iciness of the prickly pear granita resulted in a sensation and flavor explosion. It is definitely worth trying. The Peruvian poke scallop ceviche was very flavorful and a nice counter to the spicier ceviches we had. For dessert we ordered soapapillas which came with a sorbet trio of strawberry, coffee and tropical. The  environment is very upbeat with lots of Latin infused music and bright colors and decorations reminiscent of jazz in New Orleans.  I had a wonderful experience with everything from the ambiance to the food and will definitely be back."}
{"text":"I have been coming to this restaurant since it opened.  My family and I would eat here at least once a month - it was always our favorite.  They continue to change chefs and employees.  They have now decided to completely change the menu.  No longer do they have 8 different fishes on display that you has the option of ordering with 7 or 8 different seviche preparations.  Those are gone. You can now order chicken and grits and other menu items that have nothing to do with the Seviche name. I am disappointed to say that I won't be back.   They no longer offer what they built their business on."}
{"text":"I'll start by saying that I miss Seviche's former menu -- ordering to your palate and preference (and to dietary restrictions) was much easier. That said, they still do a GREAT service to ceviche and sushi. Happy Hour is the best time to visit for the best deals (Friday is always a little nuts though) and to try some small bites from the menu. And I still haven't had a better Sangria in the city. 

Three tuna rolls (with all the wasabi aioli) and a pitcher of red Sangria for this reviewer."}
{"text":"Excellent and tasty small food.  Extremely expensive, so be sure it is a special occasion or an important date!  Check in on Yelp to get a free sangria.

The dishes are tapas-style and generally shared among your companions.  Order approximately 2-3 per person.  Some of the \"tacos\" were astounding and high quality.  Not much that I didn't like about it, service was above average.

Clientele is on the young side and kind of trendy, so it wouldn't hurt to dress up.  Great place to go after the opera or show."}
{"text":"I loved it. Perfect Pittsburgh summer night spent sitting in their sidewalk patio sipping on a margarita. The atmosphere was great, the service was friendly, attentive, and impeccable. I had the greens and shared the plantain chips with an assortment if salsas. Delicious!  The fish tacos were amazing. But my friend ordered the crispy tofu and it's blend if flavor had us all declaring it our favorite dish!"}
{"text":"This place is highly overrated.  Food is not that great AT ALL.  Decent, but terribly overpriced.  Decor is beyond cheesy -- they're really trying way too hard.  And to list this place as \"Cuban\" is laughable."}
{"text":"Their sangria is amazing, and they honored the check-in special.

Nice variety of dishes to choose from. We really liked the tapas style. Come for happy hour!"}
{"text":"The food was very good  FRESH AND FLAVORFUL but I'm putting 3 stars because for the portion size the price should be 30% less, but the portion sizes were appropriate, your not over fed and you leave feeling satisfied but not stuffed, they also do not give you enough chips with the seviche which is silly when your ordering 3 small portions of seviche for $18.... Also they should include sides (beans and rice perhaps) the plate seems to be missing something when they  bring out one chili rellenos by itself and it costs $14.... Now the drinks were very delicious but for $8 the mango mojito should be stronger or in a larger glass. Service is very fast! You easily get your seviche within 10 min, and your main dish come out like 10/15 min later. Service is good but they should pay abit more attention to when your done with your starter and then bring out your main meal, we were still eating seviche when they brought our main dishes out and the table felt abit crowded for about 10 min."}
{"text":"I was here with some friends for New Year's Eve and I must say it was pretty good. The portions are pretty small and the prices are pretty high but the food quality was great. The BLT tacos were by far my favorite. We also had chorizo pan and shrimp pil pil which were both pretty good. Drinks were also interesting and good. Portuguese lemonade was my favorite (tastes dangerously like it doesn't contain alcohol). The boyfriend had some jalapeño and honey drink that frankly sounded disgusting to me but he very much enjoyed!"}
{"text":"I wanted a fun and somewhat eclectic place for doing a moderately priced happy hour.  Under those guidelines and those guidelines alone, Seviche would be 5 stars.  I ordered several items off the Happy Hour and Tapas menus and was pleased with taste and value of the items ordered.

However, Seviche has its limitations....

--you must like your fish incredibly raw or your non-fish incredibly greasy.   The menu may be eclectic, but it's not as strong in variety- for vegetarians, for those who keep kosher, for those who simply have a limitation on ingesting greasy things.

.... you must like your music loud and your fellow dinner members in a drink-to-get-drunk kind of mood

... you must put up with an inefficient and inconsiderate wait staff that appears to be hired primarily on their ability to look good in a tight black outfit.

I usually don't like to call out  wait staff, but when I am taking out clients on a company's dime, I like to tip, I like to tip well, and I look for opportunities to reward such behavior.  I arrived at the restaurant when service was very slow, when wait staff were plentiful, and even then the wait staff seemed more interested in each other than in asking if I wanted anything to eat or more water to drink.  It didn't help later in the night that the wait staff didn't bring out some food I had ordered and didn't check on our table.  I'm not asking for Ritz-Carlton service, but gee, it would be nice not to be embarassed in front of clients by shoddy service...."}
{"text":"Wow! Again another great meal! Wonderful service! And with the windows open, a great downtown venue! Pittsburgh has great restaurants and wonderful people!"}
{"text":"An inauspicious start to our stay in Pittsburgh.  Our alleged \"5-10 minute\" wait for a table stretched to 30-40.  Multiple people in our party's orders came out wrong, including one whose food eventually came 20 minutes after everyone else's.  Geez, it's raw fish, how hard is it to prepare?  At least his meal was comped.  I wouldn't have minded a knife with my pork.  Bills: also messed up.

So much for the service.  As for atmosphere: other reviewers have mentioned the 80s decor; how about the overly loud music, making conversation impossible?  I guess that's ambiance for the beautiful people at the bar.

Food: not bad tasting and some decent presentations, but expect on leaving either hungry or broke."}
{"text":"We had really good drinks and food here before going to see a show at the Benedum.  Had a beer, mojito and sangria along with the salmon tapas and chile tapas.  For entrees, we had the mussels, nigiri and the tofu and octopus tacos.  All had great flavors and the service was fast so we made it to the show on time."}
{"text":"AWESOME! Let me start by saying that the three of us came here after out wedding event after 12am. we were looking for a place to grab a bite and walked by this place. Fell in love with atmosphere, great music, fun bartenders and amazing food. they had some of the best tapas, some sushi style dishes, and amazing mojitos! i frequent Pittsburgh and will make it a point to stop by this place every time i am in town! Some of the amazing dishes include : beef tacos, chicken tostada, pork empanda, fire and ice ahi tuna, cuban sushi roll. My mouth is watering just thinking about it! ohhhhhhhhhhhh and the mango mojitos!!!!!"}
{"text":"I was in town for a conference, and decided to head out for a nicer dinner with some friends.  Seviche did not disappoint!  It has a cool, urban atmosphere with great food and cocktails, what more could you ask for?  The waitress told us that up until recently, they were a tapas restaurant, but now they have also incorporated full entrees into their menu.  I recommend any of their ceviche and tacos!"}
{"text":"Came here after dinner and there were 8 of us. We were seated relatively quickly. We had a round of Caipirinhas which were good. We also had the fire and ice ceviche which was awesome.
The table next to us were from Brazil and another table from Argentina.
I would like to come back and have dinner here."}
{"text":"In the warmer months, sitting at a table on the sidewalks of Penn Ave is fantastic. Seviche has an awesome happy hour, great people watching, strong drinks and enjoyable patrons (young professional and post-show crowds). Order the Jimmy Roll. I could eat those for the rest of my life; so so good.

That being said, I was here last week after the symphony. It was a Wednesday, we sat outside - the place was fairly empty, yet our service was painfully slow. We mentioned that we were starving and ordered chips/salsa - but we didn't receive it until after we received our main food - which took forever. Boo. And refills were out of the question. Poor service on a usual basis, unless you're at the bar."}
{"text":"The food here is solid, especially for Pittsburgh. If you are staying downtown at the Westin, it's one of the better options (in one of the worst areas of the city IMO). We had a variety of food and all of it was on par for the pricing."}
{"text":"First let me say the food was awesome! The drinks were also great.

The service was AWFUL. I manage a restaurant and have also been a server for over 7 years so I know how hard you have to work as a server sometimes.  I'm not sure if since it was the end of the night she was grumpy and wanted to go home (I have felt that way many times), not making good money (again I get it), or just not a nice person. Our server's name was Chelsea and whatever was going on she clearly didn't want to be serving us.  

Our drinks took a long time to come out, so long in fact that we had our appetizer before our cocktails.  Once we had them they were very good.  When we arrived we had wanted to sit outside but it was full, once we finished our appetizer we saw the outside table leave and asked to move outside.  I have had tables do this a million times and while its annoying, you accommodate with a smile because thats your job.  We move outside and take as much of our table settings and drinks with us but cannot carry it all-- so Chelsea throws the rest down like she would like to actually be throwing them at our faces.  We next ask if there is smoking permitted outside. She very rudely said no as she was hastily walking away. Sorry, I didn't mean to offend you by asking if smoking is aloud outside.  

We got our food which again was amazing but then we sat for a very long time. Just hanging out hoping someone would help us.  I kept looking for our server but couldn't find her so I assumed she had gone home and maybe another server would take care of us.  Just then she came over and we asked for our check.  Evening finally over.

I have never written a bad review before.  I work in the restaurant industry and know how frustrating, hard, exhausting it can be.  BUT that is NEVER an excuse to be rude to customers. Period."}
{"text":"A 10pm - 12pm Happy Hour? That includes 1/2 off drinks and awesome Ceviche!
Yes please!

Came here with about 10 buddies for my birthday, and had a great time! Amazing food - the ceviche here is just mind blowingly awesome. Each bight is an explosion of flavour, with just the correct level of spices and acids to complement the fish. 

The food was delicious - I will never be able to look at grits in the same way again. 
The drinks are awesome and strong.

The only reason this place gets a 4 star was the servers seemed slightly frazzled - not sure if it was our group size that threw them off, but kept making little mistakes, like forgetting to take a persons order etc. They immediately came back and made reparations, but still.... 

4.5 star?"}
{"text":"Decor - not bad, but nothing really special.

Food - pretty good! I really liked the various types of seviche they offered which included the fire and ice, the crab and I believe the green seviche. Be aware that the fire and ice comes with a giant purple glob which is the ice! They come in little spoons (fancy, I know) so they are perfect for a group of people. I ordered the chicken mole which was good. I don't like curry that much so it was a little iffy but as an over all plate it is well done and the others liked it.

Service- they were very accommodating. I was with a table of 8 and they made the space for us. The waiter was new but very sweet. He did great for being so new! 

Drinks - delicious!!! The strawberry balsamic was great as was the black smoke. Also don't forget to check in for the sangria! 

I would recommend for anyone looking for a big group to go out."}
{"text":"I live in Chicago, and daily, I am tempted to hitch a bus to Pittsburgh, just for Seviche.

The first time I stopped in, I was going to New York on a bunch of buses, and I had a stopover in Pittsburgh. I couldn't find anywhere to eat, since it was late-ish, so I called Seviche to make sure my t-shirt-and-jeans were acceptable, and I was off to the races.

Great musicians, for starters. I wasn't smart enough to get any names, but they choose well. I was seated right in front of them, and I've got pretty sensitive hearing, but I didn't find it too loud or out of place. 

The service is second to none. I've literally never had better service anywhere. The recommendations were on-point, everything came out quickly, everybody was kind. I was pleasantly shocked.

On top of all that, you end up with world-class ceviche. I had tuna with orange and plaintain chips, and a crab dish I didn't note the details of -- but the fact that I got seconds in the first place says something of the quality. Because I don't get seconds.

You're out of excuses. Unless you've got a crippling seafood allergy, go."}
{"text":"This is my favorite restaurant in downtown Pittsburgh.  The seviche is amazing and the servers were able to give great suggestions on what preparations to use with each type of seafood.  I haven't tried the other food there because I love the seviche so much.  Their mojitos are also very tasty.  Highly recommended!"}
{"text":"Let me start by saying that this easily could have been a four star review, if the entree I ordered (salmon seviche tacos) was the food that I was served (no salmon).  It could have been three-star if they had told me the was no salmon for the tacos without me asking why there was no salmon after eating one, or if they comped something (anything!). But it wasn't, they didn't, and they didn't, so here we are at two stars.

The kitchen was slow, but the service was friendly.  The food was actually pretty good, particularly at the price point, despite the absence of the main protein. The Ahi tuna appetizer was very good, and despite a strong preference for my tuna to be served naked, I found it extremely well seasoned. I would have it again. 

I will be in the area again in a few months and I will give this place another shot at the four-star review it probably deserves."}
{"text":"Small plates, pricier drinks. I'm just not in the business of paying $14 a cocktail anymore. But the small plates of food were good, especially the chorizo mac n cheese. Yum! 

This place is perfect for meet ups with friends for a drink. I'd find a more substantial dinner somewhere else that is a bit more cozy. This place was pretty scene-y."}
{"text":"We visited Pittsburgh last week and dined at Seviche our last night there. Overall, the atmosphere and service was wonderful.  We ordered 3 types of seviche, one of the tapas, and 2 of the tapas for two. For drinks, we went with their traditional mojitos.

The mojitos were tasty, but not very strong. I'd give them a 3/5. 

The seviche - The downside - My husband and I wished that you could order multiple types of fish for each dish. Our waitress did a good job of making suggestions about which types of fish went best with each style of seviche. 

Fire & Ice with crab - a little too sweet, but overall a dish worth eating.
Adobo Pickled Kumquat with the fish of the day (whitefish) - this was our favorite, a good blend of tropical and fresh flavors
Jicamo Sofrito with Salmon - A solid dish. Worth ordering.

Tapas
Conch Fritters - These were tasty, crispy little nuggets. 

Tapas for 2 - 
Asian Tuna Tartare - This was our least favorite. The capers made the dish too salty. 
Mojo Nigiri- The sweetness of this dish overwhelmed the fish. It was tasty, but more like a dessert than a sushi dish."}
{"text":"Excellent: great cocktails, tasty appetizers, and the entries are awesome. We were a table of 6 and waited drinking cocktails. The wait wasn't long and we ordered several different dishes. All were really good!

The tacos are great, I had the jerk chicken which was really good, and we all had different and super good desserts:)

One of the best in the area!"}
{"text":"What a wonderful discovery this was. We wondered in without a reservation, but they still let us sit down. Nicholas was our server and was wonderful. He explained the menu and happy hour menu to us, made excellent suggestions, and was very pleasant.
 The food was fresh and everything was full of flavor. I highly recommend the tuna roll, the chilequiles, and the smoked salmon entrée. This is my new favorite restaurant in Pittsburgh."}
{"text":"The general manager has reached out to me to apologize and to offer a credit if we choose to go there again. I appreciate the way she has handled it, whether or not we decide to take her up on her offer."}
{"text":"Staff was very knowledgeable and helpful with pairing selections for the tapas menu which were fantastic."}
{"text":"In.  Love. 

What I had on Tuesday: 
fire and ice Seviche
Crispy tofu taco
Jimmy Roll

What I had tonight:

Crispy tofu taco
Seviche Taco
Tempura Fish taco. 

Totally should have either had the Crispy tofu taco thrice OR the same thing I had the other night. Everything was amazing except the Seviche and Tempura tacos were both just 'pretty good'. 

Go. Now. 

Came solo On a Tuesday night in June around 8 and on a Thursday night around 9. 
Service was was attentive but not intrusive . I had no issues with seating either night. Bar on Thursday and a small table to myself on the Tuesday. Amazed since the city seems jam packed with conventions and this place is very close to the convention center
Highly recommend. Get the crispy taco! Amazing. ."}
{"text":"My husband and I, dined at Seviche this evening for the second time.  We both enjoyed our entrees immensely.  I had the tempura fish tacos, and my husband had the seviche gluten free tacos.  The wait staff, the atmosphere and the establishment is a five star to us!   We would highly recommend dining at Seviche! In Pittsburgh,!:-)"}
{"text":"I came with my boyfriend and brother last Saturday without reservations and the staff was more than accommodating to get us in and to a table. The atmosphere inside is very different than the other more traditional restaurants in Pittsburgh, it was a nice change. Our waitress was extremely friendly and helpful when it came to the menu, drinks, and making sure to accommodate my seafood allergy in a mostly seafood restaurant. We all three ordered tacos, and the two pickiest eaters I know were both quiet and extremely happy with their meal and beer. The BBQ short rib tacos are always great and the horseradish crema is a perfect pair with the barbecue sauce. Definitely recommend!"}
{"text":"The food was average.  I've had better."}
{"text":"This place is incredible.
Recommended to us by a friend back home in Philly, decided to check it out on or visit to Pittsburgh. Really cool decor, awesome music, right next to huge windows, super fresh open, airy place.
Never had ceviche before, I do not like seafood. I WILL NOT eat crab or shrimp.
Seviche, for the first time, changed my mind. I mean really changed it.
Had a ceviche with KIWI in it?! Our entire meal was seafood... crab, shrimp, spearhead?? My husband and I LOVED IT. Licked every plate loved it.
Not only that, but what really made this place was the service. From the hostess, to the chefs, the bartender, and of course to our AWESOME server Carl - was so impressed. Working in service for over a decade, me and the boy always see jaded servers and people who just want to sell you something and not look you in the eyes, turn the table over and take money... not here. Total opposite. SO friendly, genuinely nice people, who make eye contact and are super knowledgeable about everything on the menu without trying to push us to get more... 
I'd come back every time I go to PGH;
totally recommended for everyone, all of the food was PHENOMENAL and we had a lot of it :p
Thank you so much guys, Best dinner we had on our honeymoon!
btw, the cocktails are amazing too :)"}
{"text":"Simple and Modern.

Environment: Modern Caribbean Vibe.  A chill date night or happy hour place.

Service: Hostesses, Waitresses, and Bartenders are friendly, attentive and knowledgeable.

Food: Light  and well prepared.  Tapas, small plates and a few entrees.  Chef's Bar.

Drinks: Freshly prepared mixed cocktails. Some reviewers were critical of the drinks, but it's NOT a bar but a restaurant.

Pricing: Average and 5 dollar happy hour menu bonus, great way to try food and drinks."}
{"text":"Would return regularly for the tacos! Had the beef short rib, fish tempura, and shrimp/scallop (special) taco - so good."}
{"text":"Too expensive for such small plates.  The food is decent but the service can be slow during busy times."}
{"text":"The tapas portions are small, but delicious.  The mojitos are wonderful, especially the Key Lime flavored one.  A fantastic place to relax and take in the atmosphere.  Mondays are latin dancing night, lots of dancers come in the evening to sway the night away, very romantic.  
A great place to people watch while snacking on delights from South America and around the globe.  Bring your wallet, a sense of adventure and humor, and you'll have a great time."}
{"text":"I was with a friend with a nut allergy and shellfish allergy. She ordered the chicken arepa which seemed safe, but she started having an allergic reaction. When we asked the waiter to confirm, he said he didn't know if it was cooked with peanut oil. He didn't offer to assist her as she was having an attack, or consult a manager, or even take back the meal. Adding insult to injury, she ordered a glass of Cabernet, and the server who delivered it said \"here's your merlot!\" When she reminded him that she ordered a Cabernet he said, \"oh, yeah, it probably is.\" I've never felt so disgusted at a restaurant's customer service in my life. We couldn't get the check fast enough. The food, when not causing allergic reactions, was good, but it's not worth the mistreatment of the staff. Our uber driver warned us to stay away from this place but we didn't listen. He was right."}
{"text":"Delicious! 

My first experience here was late one night after a show at Bricolage. We walked over and found ourselves just in time for happy hour. Not only were the drinks good (though the sangria really leaves something to be desired), but for someone who doesn't like fish of any kind, let alone attempting to eat something raw, this place is amazing. If you try nothing else, try the Fire and Ice with the tuna! It is AMAZING!!! (as I'm looking at the menu right now, I realize that they've changed it!! anyone wanna go try some of the new stuff?!?)  The trio of chips and salsa is also pretty good. One thing that I really love about this place is that the waitstaff is really knowledgeable about what is used in each sauce. For someone with a fairly strange allergy, its nice, for a change,  to ask if something is used to have an answer immediately and feel comfortable believing them.  

They have a great wine selection, too. I wish I could remember the name of the wine that I absolutely adore, but it's escaping me right now. 

I would have to say, though, that my favorite thing is Monday night Salsa dancing! It is a great time and they do lessons for beginners. I've missed it the last few months cause I work on Monday nights, but I'm so looking forward to a few weeks of down time over the holidays when I can put on my dancing shoes and give it another try!"}
{"text":"Surprisingly, I'd never gone to Seviche for dinner before until we decided to go for Valentine's Day dinner this year. Seviche serves mostly ceviche, sushi and tapas. In other words, small plates and high prices. 

The restaurant is decorated in cool colors and with modern decor. The music makes you feel like you're in the Dominican. It was definitely a nice atmosphere. 

For dinner, my husband and I opted for the a la carte menu (since they also had a prix fixe menu for v-day) so we could sample from their regular offerings. From the seviche menu: we ordered Crab with Beets and Oranges preparation and Tuna with Tiradito preparation. From the tapas, we ordered the Beef Arape and Asian Tuna Tartare. He got Dos Tacos (BLT and fish) and I ordered a Pork Shoulder large plate. Yes, sounds like an insane feast but each of those small plates were very small. Without going into detail of each dish, our favorite of the night was the Beef Arape. The beef cheek was comforting and savory while all other aspects (tomato, onions, chimichurri) provided a refreshing contrast. The common denominator in all the dishes was there was a fresh element to cut the richness in every one of our plates. 

I would imagine visiting Seviche in the summertime would give you a much nicer experience with the Latin music and fresh flavors. I definitely would come back when the food fits the weather."}
{"text":"Excellent cocktails and happy hour seviche and sushi specials!"}
{"text":"I had a great time last night in Seviche. I got there as soon as Happy Hour was starting. Happy Hour on a Saturday Night? That's unheard of!! We were seated at the bar where we could watch the chefs cook. Pretty Cool!! Our waitress was super nice and very helpful. One of the chefs came up to us and asked how we were enjoying the food and then offered us oysters. WHAT, AMAZING!!!! At one point I saw all the waiters dancing and laughing, they looked liked they really enjoyed their jobs. It was a great night with amazing food and even better service. You have to check this place out. I wish I knew everyones name."}
{"text":"The salmon entree was elegant and delicious and just filling enough, but the seviche, the dish from which the restaurant has taken its name, was just OK. Still, it was a nice ambiance, great service on a busy night, and pretty tasty cocktails."}
{"text":"I Highly recommend this place, drinks were very good and Tapas were delicious. Excellent service and nice ambience!"}
{"text":"Seviche offers a warm atmosphere in the cultural district of Pitt. Flying solo as a biz traveler I immediately went to the bar where the lady bartenders were ferociously whipping up cocktails, pouring Mexican beers, and dashing sangria. These ladies were working hard and with a smile on their face.

Make sure you check yelp when walking in because I checked in for a free sangria which was good (for the price). Then I ordered salmon seviche - fire and ice - this was an interesting combo which combined an icy topping mixed with warmth from peppers. The serving style was unique as there were individual servings in spoons - hard to tell the total portion, but i made a conscious effort to take my time and savor each one.

If texture and contrasting flavors are your thing then definitely go with the fire and ice. It was very good and the bar crowd is friendly. Post up and make some new friends - maybe share a little seviche and stories."}
{"text":"We were able to walk up and get a table without waiting on a Friday around 7. The service was prompt.  The food was very interesting.  We all ordered tacos, including a beef tongue taco. I had never eaten beef tongue, but the server said it was great, so I gave it a try and I am glad I did.  The kitchen was very slow.  We weren't in a hurry, so it didn't matter.  Some of the tables kept getting more patrons as the night wore on. One of them looked like a party, so the place was packed.  The servers were fast, although the kitchen was having a hard time keeping up. I'd go back, but not if I was in a hurry."}
{"text":"Everything here was really tasty! The happy hour specials are pretty good too. It is a little bit louder than I would like and got packed pretty quickly. The fire and ice ceviche was delish... I also liked the sushi. Not so much a fan of all of the fruity drinks on the happy hour menu, but they have other stuff too."}
{"text":"Kyle was our server, and Mike, the executive chef, were both amazing!  We had vegans and weird dietary restrictions and they were so informative and accommodating.  Great food.  Fun decor.  Open air seating. Great atmosphere!  And can't ask for a more attentive and dietary conscious staff.  If you come to Pittsburgh, this is a great location for all dietary needs."}
{"text":"This place is so tasty... expensive... but tasty.

The best thing that I had here was the crab salad, but they only had it the first time i went, boo.  The whole ceviche style is very unique, though portion sizes are small (I know, it's tapas).  You definitely might end up paying a lot of money and walking out a bit hungry... but everything will taste great!

The servers are delightful and are quick to make suggestions on what combinations work well together.  

The atmosphere is nice, though be careful if you get a high-top table near the bar.  There are several d-bags there (you can spot them easily, they're usually in leather coats) trying to hit on the girls, and it can be pretty obnoxious while you're trying to enjoy your delicious meal."}
{"text":"So after reading the reviews on Yelp, two snooty foodie New Yorkers walk into Seviche and take a look at the menu.  Ceviche, black bean hummus, and chorizo Mac n'cheese ... seems a little desperate and reaching, no? Kind of a limited menu perhaps?

\"Meh, this seems underwhelming, should we try somewhere else?  Well, we are here and ceviche does sound good, so let's stick it out.\"

WOW.  Glad we did.  How are they making money on the lump crab ceviche?!?  Fire & Ice Crab and Tuna Verde were both off the hook.

Oh, and Teresa is AMAZING.  Absolutely fantastic server/bartender.  Never had to ask for anything as she was completely proactive in handling our needs.

Salmon was flawlessly cooked: a little crispy on the outside but super moist within.  My partner in crime thought it was over-sauced, but I was cool with it.  Speaking of sauce, ask for the habanero chocolate mole/hot sauce ... pure crack.

Finally, hands down, best Pozole I've had outside of Mexico, and better than 99% of what I have had there (and I use to work in Mexico City!).

Don't think twice.  Go hungry, leave happy."}
{"text":"Nice Latin vibe!  A DJ was playing and the decor was a good combination of trendy with Cuban influence.  We really liked the Cuban paintings, the sangria and mojitos.  The portions are small, but full flavored.  We had pork empanadas, Cuban tacos, shrimp pil pil & tuna tar tar.  Overall good experience."}
{"text":"In town for business and used Yelp to find a place. This was a great find in downtown."}
{"text":"Seviche is definitely my favorite restaurant in Pittsburgh, and one of my all time favorites... and I have high standards. The Tamarind and Pomegranate Seviche is a really refreshing twist on a traditional classic. Also the short rib tacos were fantastic. Always great service and the restaurant itself is a really fun atmosphere!"}
{"text":"A gem in the rough ... Fire and Ice is fantastic with Hamachi, also try the cuban roll.  Be prepared to get out your wallet.  Portion size is small, but taste is huge.  All the dishes are very well prepared.  Seviche is my spot anytime I come to Pitt for business."}
{"text":"Great restaurant with a Cuban fusion menu.  The wait staff and servers are efficient and pleasant.  Food consists of tasty small plates as well as larger platters.  It's a lot more fun sharing the the eclectic small plates of Latin fused dishes.  Priced are quite reasonable and happy hour makes a dinner even more reasonable.  Desert was a decadent Mexican chocolate mousse.  Never been disappointed with our meals."}
{"text":"Yeah, nice place, the staff are very nice and gentle.  The food is good, maybe a little too small portions. They also have specials and international drinks!  Recommended."}
{"text":"Took my family here to show them a nice restaurant in the downtown area that has been able to stand the test of time in this restaurant booming city. They were out of their 3 best drinks before 7.30, and the fries that came with our meals were hard and frozen. I feel like these are small things that can be fixed. Seems like other reviews say similar things. Scares me for seviche! Hopefully they can get better. Love supporting the pittsburgh favorites."}
{"text":"This is an amazing restaurant located amongst other great places on Penn. Top recommendations are fire and ice seviche, octo taco and chips & guacamole. They have some great drink specials too, my favorite is the Seviche Manhattan. If you're going on the weekend, better make sure you get a reservation, they fill up fast and you have a very long wait."}
{"text":"Went in for a dinner before the theatre.  Just wonderful food, the service was exceptional.  We sat at the Chef's table and watched the staff prepare and push the appetizers out to the patrons.  What a great time. We had the Fire & Ice ceviche and Mojo Nigiri - both were delicious. For main courses we had the Diver Scallops and Carne Asada.  Again, delicious.  The service was good - the drinks were excellent .  Really, worth the visit and we'll be back."}
{"text":"My husband and I came here for date night and absolutely loved it!! Our waiter (Tony) was fantastic and very attentive - absolutely loved him! 

The seviche we ordered was just fantastic! The seviche du jour with candied jalapeños and smoked scallops was probably my favorite thing of the evening. I loved the mushroom and short rib tacos (I wanted to just somehow mix them together...). The brisket quesadilla was soooo good! Like so good I thought maybe I was overreacting, but my husband confirmed that yes, it is delicious. My husband's favorite of the night was the fire and ice seviche (we did tuna). His runner up was the quesadilla. 

Next time we come we'll probably stick to all seviche because it's just that good. Plus, I saw pumpkin tres leche on the menu, and I'm definitely going to have to save room for that."}
{"text":"The decor at this place is so tired, reminds me of The Max in Saved By the Bell or something from that era.  

The happy hour deal is good but I would stick with the alcohol.  The happy hour food is less than pleasing..  We ordered the pineapple salmon ceviche.  Small portion and  served with a few cheap stale tortilla chips. 

We did not stay for dinner so can not write about that:"}
{"text":"Great food and drink happy hour and good selection of fresh ceviche. Enjoyed the sampler appetizer."}
{"text":"I'll start with the positives - good atmosphere, tasty food, good cocktails. 

Why I gave it 3 stars - service wasn't very good, I felt like I had to flag our waitress down anytime I wanted something.Then the bill came. Not only did the waitress tell me she added an item that I didn't order because she didn't know where else to put it (we had a large party), but I saw that the draft beer I was drinking was $9 each. I'm in Pittsburgh, not Manhattan, so draft beer should not cost that much and that price was not listed on the menu. I talked to a manager who agreed to take off the item I didn't order, but wasn't as understanding about the cost of the draft beer or the fact that it wasn't on the menu. She was friendly, but felt she could have done more given the size of our party and the amount of money we just spent there. Probably won't return."}
{"text":"Once again, wandering through downtown Pittsburgh after work, Yelp led me to this place. We sat at the bar because the waitress seemed very concerned that we didn't have a reservation. It was Monday at like 6pm. It was cool though, since we sat in front of one of the guys preparing the seviche. Seeing all that food prepared made both of us super hungry. Anyway, checking-in to Yelp got both my coworker and I a free sangria. Not having drunk many sangria, it was pretty good. I like my sweet alcoholic drinks. Also they didn't skim on the alcohol just because it was free. 

We ordered quite a few dishes because everything on the menu looked so good. I got the mango salsa seviche on the happy hour menu, the pork belly tacos, and the tuna tartare. My coworker ordered their daily special, the berry tartare, the fire and ice seviche, and the tempura fish taco. 

Both of our favorites was the tuna tartare. It had chopped up tuna on top of a roll of rice, kind of like sushi. The mango salsa and the berry daily special were both just OK. Both of them were kind of smothered in a creamy sauce and served with a few chips, but they were both kind of bland. We expected the berry seviche to be kind of sweet, because that's what the waitress said, but I thought it was more vinegry than anything. For my pork belly tacos, it was a fried pork belly, so I didn't like it quite as much. I'm much more a fan of super soft melt-in-your-mouth pork belly. My coworker liked his fish tacos a lot, said it was his second favorite of everything we ordered. 

This was a really interesting place to try. I'd come back for the tuna tartare, but it was kind of pricy though."}
{"text":"We went here because it had a Gluten Free menu posted on their website. The waitress was knowledgeable about the entire menu and was able to speak specifically about the GF options. We went during happy hour which allowed me to try the Seviche for half the price. The Seviche was servers with tortilla chips and was very tasty. For our mains, my GF friend had the wild mushroom entree which smelled really good. She said the gravy was very rich but delicious. My other friend has the Baka fish tacos. She ordered two but received three. Kitchen bonus! I had the diver scallops. The scallops (5) were prepared perfectly. The grits the scallops were served upon were creamy and perfect seasoning however the arugula was very bitter and not enjoyable. It was served with chunks of either pork or corned beef, hard to tell because it was so dry. But the grits and scallops made this dish on their own. I would go back for sure!"}
{"text":"By far the best upscale Mexican/Latin restaurant I've been to.  The food is absolutely delicious.  My experience with most upscale restaurants is that the portions are small.  Seviche does not follow that rule, the portions are a good size! The service is superb.  Being that it was my first time there, the waiter was extremely knowledgable and answered all of my questions.  He was also very attentive, making sure my boyfriend and I were well taken care of.  The manager, Jennifer, introduced herself as well, and visited our table regularly to talk and make sure we were doing well.
  The food was the best Latin food I've ever had.  It was full of so many different flavors that all complimented one another.
 Overall, I would definitely return, and I can see Seviche being a regular spot for my boyfriend and I."}
{"text":"My fiance & I took a 3 night 4 day trip away to Pburgh.  We are foodies, and work in the restaurant industry, so we were excited to try some new places out.  Seviche was our 1st dinner on the itinerary. IT DID NOT DISAPPOINT!  From hostess to server to chef everyone gave A+ service.  We sat at the 'chef's table' which was a casual bar-like seating area where you could watch the Chef and (I assume) Sous Chef make your food.  Not only could we watch our food be artistically crafted right before our eyes, but the Chef was beyond helpful as he heard us talk amongst ourselves with answers to our  many questions.  We also enjoyed a couple rounds of signature cocktails.  Everything was timely, delicious, and we left satisfied!  Our server even ended up being from a small town near our hometown in Western PA!  Highly Recommend for foodies and/or adventurous eaters."}
{"text":"Really enjoyed my meal here and the price was right. Was here on a warm summer evening and sat inside but right next to the open windows, so it was perfect. I ordered lamb chops and got 3 for $15. They were somewhat small, but very meaty. They were placed on top of a potato like dish, the whole thing was delicious. My bf got the pork empanada, and although it was only $5, it again was meaty and filling. We were both happy. We each had a cocktail, enjoyed the people watching, and thought our food was delicious. The service was fine, our waitress was attentive and we had no problems. If only all restaurants could be that reasonable and have good food, life would be good!"}
{"text":"I came here with my friend and her boyfriend when I visited Pittsburgh on her recommendation and thought it was a solid fun dinner. The highlight of the meal was definitely getting a free peach sangria for checking-in on Yelp because the sangria was delicious! I really liked that they used sparkling wine and put a lot of fruit in it. 

Between the three of us, we ordered a pair of ceviches (scallops with black bean and corn ceviche and ahi tuna with their ceviche of the day, pineapple jerk), the Mojo Nigiri, the Jimmy Roll, BBQ Duck Mac n Cheese, and a trio of tacos (the baja fish, BLT and cheesesteak tacos). Overall, I thought the food was alright aside from some stand outs. My favorite dish was the Jimmy Roll because of the tempura and sriracha aioli. I really liked the scallop ceviche when paired with the plantain chips because I'm a sucker for anything plantain. The BBQ Duck Mac and Cheese was also unique and very tasty. Aside from those, I thought the dishes could be improved on. The Mojo Nigiri was good, but I would have preferred a little soy sauce to add some saltiness to the acidity. The ceviche of the day was a little too sweet from the pineapple. The tacos were nothing special and a little dry in my opinion. 

Overall, I think Seviche is a good place to have drinks and some small bites. I feel like my experience was a 3.5, but will round up to 4 since we got a free glass of yummy sangria. If you are planning on ordering a lot like we did, I would suggest requesting a table bigger than the small hightop we were given since our food could not all fit on the table."}
{"text":"I'd say this is a good place to just chill, maybe before or after you go somewhere else.  That's exactly what I did, so it worked out for me.  The service was good and the bartenders attentive to my alcoholic and food related needs.  The pork empanada was pretty great.  

The interior is a bit loud in a bad way, and the neon tubing (red, green and blue) cast a strange pallor on to that side of the room, but the rest of the lighting is kept at a pleasantly low level.  The bar was a pretty comfortable place for my room mate and I.

My recommendation is to toss a few back here and move on with the rest of your plans for the night."}
{"text":"Came here on a busy Friday night and got seated at the chef's table. It was an incredible experience because I got to see the chefs making the food on the spot. Would highly recommend asking for this! I tried the Fire and Ice ceviche and tacos (I think tofu and chicken?) and it was all really good. The service was great as well! The servers gave me great recommendations because it was my first time and they were extremely attentive. I would definitely come back with friends."}
{"text":"Foods phenomenal. Must Try the kimmy roll. Friends & I went here for dinner last week as a party of 7, only complaint was that food was very slow getting out & not one of us ordered a very heavy meal (all seviche & tacos), although I will say food was well worth the wait."}
{"text":"Pretty good and trendy spot with good small plates and drinks. The food was flavorful but a bit on the spicy side. The drinks were also good but a bit too sweet. Otherwise, it was a fun spot, great for people watching!"}
{"text":"Not impressed. The entrees were overpriced for the quality of the food as well as the portion size. I've never seen a seafood paella so small for $18. The atmosphere was cute and the sangria was pretty good but the food was disappointing. :-/"}
{"text":"Last night, we went to Seviche for the first time.  We called first before just in case we would need a reservation, but it was 8:30 so we had no problem walking in and literally picking any table we wanted.

We ordered the Pork Empanadas, Chorizopan, Hangar Steak, and Dos Tacos (Beef Cheek & Chicken).  The Pork Empanada was ridiculously insanely wonderful.  I would have eaten an entire massive plate size of those.  Next time, I might!

The atmosphere is fun and light and they played a lot of 90's music.  It's not an uptight atmosphere or super dressy.  There is a bar so you can just walk in and have a drink.  It was surprisingly a bit rowdy but seemed more like a late running work event.

Our waiter was nice also and not in our face.  It also had a friendly feel to the other customers.  Everyone was smiling at each other and saying hello like it was a local bar or something.  I liked that!"}
{"text":"Went on Sat night-didn't look too busy but apparently the only table they had open for our party of 4 was outside (even though we saw empty tables inside). Ambiance sitting outside was pretty nice, service was pretty slow/bordering on inattentive, food-portions were small and overpriced. For apps, we got chips & salsa and 2 kinds of serviche.  The best sauce was the red - smoky & good. Serviche 2 ways = disappointment x2. Very small portions. Tacos were small and should be cheaper but good flavor. Probably give 2.5 stars and never go back."}
{"text":"I've been here 3 times now. All were good except the time I left my wallet there, which sucked because they don't open until 5:00 PM the next day.  Needless to say no money was taken and i got my wallet back, so of course I returned to show my appreciation and they have good food. This is a great place to get a bunch of small dishes to create a meal or just have a small meal. The Ahi Tuna sliders are AWESOME. The Fire and Ice is also a great choice. It's a little loud but the unique menu makes up for it. The bartenders Kaylee and Autumn provided excellent service. I'll be back."}
{"text":"Although the price is a little high, the food is beyond delicious!!

Definitely don't go alone because you will have to order several dishes to get your fill and that will leave you with an empty wallet. Everything we tried was good. I loved the Pork Empenada. Sooo good. I also loved the Cuban sushi Roll. Everything else we tried was also delicious (peruvian poke, fire & ice, avocado & corn) but those two were my favorites. Dessert was also yummy. We ordered both desserts. The ice cream served on the little fried discs was delicious even though our server told us the completely wrong flavors (maybe those were the flavors from the day before?). The tres leches cake tasted good but the texture was weird. My friend and I both noticed that it was too dense.

All in all, I will definitely go back cause I crave that empenada in my sleep some nights!!!"}
{"text":"Great place to get tapas and ceviche.  They have changed their menu over the years and have taken off some of the popular options such as the cheese plate.  The\" fire and ice\" is a must if you don't mind a little kick!  Stop by on Monday for some free salsa lessons!"}
{"text":"My first time to Pittsburgh on business and this is the third great restaurant I've been to.  The venue is nice--high ceilings so it can be a bit noisy, but tolerable.  I started out with a tuna carpaccio that was quite good.  The divers scallops were outstanding.  They were served on a bed of grits with tiny cubes of very smoky bacon.  Sadly, you only get six small scallops, so for me it was more like an appetizer--I could've eaten three times the amount!  For dessert I had a peach pana cotta that was a great finish to the meal.  It tasted like a creamsicle, with a peach layer underneath and a traditional white pana cotta on top.  Slices of peaches capped the dish.

Service was a bit uneven considering the number of diners but not enough to cost it points.

I'd definitely return as there were a number of other interesting items on the menu.

In terms of value for the dollar, I would rate it a bit over the top.  My three items (plus iced tea) cost $48, so with tip it was pretty steep."}
{"text":"Food selection was really good! We loved the Seviche! We tried the peach,  grapefruit and kiwi,  and fire and ice,  which was awesome.  The scallop was good,  my mother loved the conch fritters,  pork empanadas were juicy and delicious. The tuna duo was awesome,  especially since I'm a huge sushi fan.  My husband also got the octopus taco which was great! The fried shrimp were huge! Service was quick and Overall a Great experience minus them forgetting the shrimp originally and my beef cheek arepa all together.  

 Thanks to yelp for the free glass of sangria for checking in too!"}
{"text":"Seviche has left me wanting to come back.  It's that simple. This was an excellent find in the Downtown Pittsburgh area and I could not have been more pleased with the service, atmosphere and of course, the ceviches were fantastic!

I have one cheat day a week and the day I went to Seviche was not that day! I needed something satisfying, healthy, full of protein and of course, delicious. I was on a mission to find some good seafood. I saw Seviche was nearby our hotel (the Westin) so we walked over on a Friday night and were seated right away.  The place was bustling with all sorts of clientele but I think this is mostly due to the fact that the Pittsburgh Marathon was going to be happening that weekend. That was why we were in town.  Anyway, it was busy, but not crazy.

I was instantly drawn to the ceviches and I decided to try the trio. They basically make them with your choice of fresh seafood.  I chose the following; Traditional ceviche prepared with shrimp, Avocado and corn ceviche with salmon and the Tiradito prepared with hamachi.  All selections are raw.  All selections were absolutely delicious, bursting with flavor in every bite. Next time, I want to try all seven!

Service was also on point. Our waiter, Dale was very friendly and accommodating to my (please no carbs on my plate!) requests and left the chips off my plate.  He was attentive and checked up on us often. I also thought the explanation of the menu was a nice touch even though being Panamanian, I am very familiar with ceviche. I still liked to hear him go over how it's made, etc.  Not a lot of waiters/restaurants do that these days.  They just ask you what you want and don't explain anything.  He was also very well-versed with the menu which seems to not be of importance for a lot of restaurants these days to have their staff actually know the menu.  

The restaurant itself paid homage to it's Cuban-style roots with gorgeous and colorful paintings adorning the walls.  The music was a mix of merengue and salsa which also fit with the theme.

In all, Seviche is a great place to get some Latin-fusion food in Pittsburgh.  It's suitable for groups and couples.  They boast a very popular happy hour here.  Stop by and enjoy some really deliciously prepared food. I will be back next time I'm in town."}
{"text":"Stumbled in here one night while I was in town on business and I'm sure glad I did! Free sangria if I check in? Ok sure why not, it was awesome and all the tapas we ordered were great as well. And the service couldn't have been better. Will be returning when  back for another business trip next year."}
{"text":"3.5 stars. Seviche is right in the heart of downtown Pittsburgh...free parking was relatively hard to find...so your best bet is some sort of parking lot 1-2 blocks from the restaurant. It's a particularly great, relatively trendier spot to meet up with friends after a long day of work/end of week. Their happy hours are actually good deals, despite relatively small serving portions (the fire and ice is definitely an interesting take on seviche, but be warned...each order is relatively small, so if you are somewhat hungry..you probably need to order 3 of them :))

What I like about their seviche is you can customize whatever types of seviche and fish/meat of you want. If you come with a group of people like we did, you can end up trying different combinations of those, too. Their quesadillas are just ok (I tried their mushroom one, and it wasn't as memorable), but as the name of this place suggests, you'd do best trying different types of seviche to make things more interesting instead.

P.S. Don't forget to check in for a free Sangria! This is a must for ladies...for guys...I don't think they care so much for those sweet cocktails though! :D"}
{"text":"I am dissapointed with the overhaul in their menu!!!! I have been to this place multiple times and it has a great atmosphere - upbeat, loud, great bar, awesome sangria, nice staff, however the \"recent\" lack of Seviche options does not go down well with me. Hence the 3 stars instead of the 4 (which I would have given them otherwise).

I was craving the Fire and Ice Oysters ever since New Year's eve dinner, and dragged the Mrs. to Seviche only to find their new menu - tacos, enchiladas, chips and salsa?? 

Well, not that I could do much I decided to go with the flow. Our server was Tony, who was very friendly, quickly got me a Sangria (free with a yelp check in) and explained the new menu. He recommended some popular dishes (tacos) that would accompany the limited Seviche dishes. We got the Crab Fire and Ice Seviche, Mojo Nigiri (they were out of Salmon so only Tuna), Asian Tuna Tartare, and all the tacos except the Seviche taco.

For the newbies, do not miss out on any of their Fire and Ice Seviches (in case they change their menu again). 

The Crab Fire and Ice Seviche was served in a spoon, beautifully doused with lime juice accompanied by Jalapenos (fire), Pear Granita (ice) and cilantro --- Perfect. I didn't care much for the fish taco, or the BLT taco which was just two think chunks of bacon, but the chorizo taco was good (was just missing some seasoning - more cilantro, lime juice, jalapenos maybe).  3 tacos and 2 Seviche dishes were plenty for me and I barely made it through to the dessert round - Tres Leches Cake i.e. white cake with sweetened milk and strawberries. I must say this was something I had not tried before The sweetened milk made the cake more sweet and moist and gave it a very interesting taste. I loved it!!! Could have eaten one more if not for my bursting stomach...

My food highlights - Crab Fire and Ice Seviche, Tres Leches Cake
My food disappointments - lack of Seviche options

I don't know if I will make it here with an empty stomach but definitely for some drinks and dessert."}
{"text":"Family came to town and took them to my favorite restaraunt (Seviche) and was really disappointed. It looks like there is a new chef because all the meals I've ordered in the past were completely different. The food is not nearly as good now. Service is great but can only make up for so much. I would no longer recommend this restaurant."}
{"text":"Ceviche is not often found on a lot of the menus around town. So to now have a ceviche restaurant is a diamond mine.


I am taking off one star because on my last visit the waiter accidentally poured a bottle of beer down my friends back. We were all dressed up to!!! First it was embarrassing to have a drink of any kind spilled on you, but to smell like beer the rest of the night is pretty messed up.
The waiter was training and the meal for my friend was free. That doesn't entirely make up for it but it was a try.

I love the lay out of ceviche you can actually watch the chefs prepare your food while you sit and wait. The restaurant serves both hot and cold tapas.

They serve some delicious mojitos and there are plenty to choose from, including mango.

The chorizo wrapped diver scallops are the bomb. The portion size is enough to fill anyone's tummy and I love seafood  with Latin flavors."}
{"text":"Helllllo love. My friend and I came here on a Friday evening around 8pm. It was relatively empty  considering the time, but the host informed us that there was some show happening.  With that said - if you're looking for a nice place to eat with a lesser crowd on a weekend, it's probably a good idea to go around 8.

We decided to take a seat at the chef's table, because watching your food get cooked is part of the wonder. We went with - the popular fire and ice seviche, octopus escabeche, pork empanada, salmon, aji papaya and a chef special by Trey - fried rice with papaya, pineapple and pork.

Despite its popularity, I wasn't the biggest fan of the fire and ice seviche. The prickly pear granita threw me off, and took away the flavor of the rest of the seviche. My friend however, loved it. So personal preference comes into play for this one.

The octopus escabeche was pretty good. Each individual item was well prepared by itself (avocado puree, basically guac, octopus, and red pepper9). I'm not sure it worked AMAZINGLY all together though. Again, my friend loved this one too... so maybe I'm just picky.

For the pork empanada, the flavors were great and I quite liked the pesto. The empanada was more so a ball shaped than a dumpling shape and that took away a bit of the fried aspect I was hoping to have.

Now on to the salmon. This was far by one of the best salmon's I've ever had. The salmon was PERFECTLY cooked. We actually asked for a \"lightly seared\" salmon, kind of the idea of a seared ahi tuna, but with salmon. This is something I would go back for without a doubt. This dish was quite hearty with the orange puree and rice, so something light afterward would've been nice.

The ali papaya (with crab) was one of my favorites and it was perfect after the salmon. It was light, tangy and refreshing and the malanga chips are a great touch.

Last but not least, Trey's fried rice was one of the best fusion fried rices I've had. I loved the addition of papaya in the dish, and the pork was perfectly charred. 

By the end of all of this, my friend and I were without a doubt food coma-ing and ready to pass out. Issue was, we took at the dessert menu and caved. I forget the name exactly, but we got a deep fried butternut squash donut, with apple butter and raspberry preserves. One bite and I forgot how full I was. They are to die for.

Looking back at the drink menu, it seems as though their online pdf is a little out of date... so I don't have a clear recollection of exactly what the drinks were. Both drinks were fantastic though, and can be see in the pictures! I got one with fresh strawberries, and there were a ton of them (mmm). I also got a free check-in sangria, which was good too.

This is my first time eating at a Big Y group restaurant and it's definitely got me wanting to try the others (Nola in the Square, Sonoma, Poros, Perle)."}
{"text":"Any place that rewards my check-in with a tasty on-the-house Sangria is A-OK with me!  Especially since I would have checked-in regardless.  We had 8:30 reservations on a Saturday.  When we got there, there were a few tables open in this hip Cuban style restaurant.  Our waitress greeted us quickly and supplied our Sangrias within 5 minutes.  She inquired if we were ready and I said I needed a minute.  She left to attend to a much bigger party, and we were quickly greeted by another server who explained he would be helping because she was taking care of a bachelorette party.  He described the menu, how ceviche is made and was very informative.  However, when he left our original waitress appeared as the party table was wrapping up, I am guessing to go party a little more hardy... 

I decided I wanted to try the Fire and Ice Seviche with salmon.  She kind of shuttered, and said most people don't choose that with the F&I... Ok I love getting suggestions from the servers... She said most like crab or Ahi Tuna... Well then I will go with the crab... It was fabulous... I loved the balance of heat and citrus and herbs to cool it down.  Definitely a winner.   The drink I decided on next was a Manhattan featuring Wigle Whisky, holy snikes, it was almost as much as my main meal!  It was good, had a punch, but I couldn't blow the whole budget on cocktails!  Or could I??

Next we both got a trio of taco's.  My husband went with BBQ Short ribs tacos, were as I played mix and match and got one BBQ Short rib, on Baja Fish, and one BLT.  We both really enjoyed the BBQ Short Rib taco but it was such a small amount of fillings in the shell.  The shell stood a good inch above where the filling ended.  Kind of disappointing there.  My Baja Fish was really tasty but it was a little dry.  It needed an aioli or slaw something.  Good flavor, just needed a boost.  The last taco, the BLT was by far my favorite.  Filled to the top with the pickled veg and romaine, and the pork belly boats sat on top.  I call them boats because they were big strips not bite sized cuts which I thought was way better than cutting them up.  The prices on our tacos were not bad but since the short rib one was so skimpy my husband was still quite hungry, so I talked him into getting dessert... HA!  Yea like someone really needs to talk him into dessert; ) He ordered the flourless chocolate cake.  It was good and he enjoyed it but it was a bit pricey for the size.  And unfortunately he left hungry.  I on the other hand was satisfied so I can't complain and I am sure we will be back to sample some other dishes."}
{"text":"You can make reservations so I recommend making reservations on Fridays and weekends. 

It is VERY dark and very loud in here. I liked the high ceilings and to me, it looked like a futuristic twist on an old-fashioned diner. 

The negative was that my food came out almost 15 minutes earlier than my parents' dishes came out. I got tacos, which could've been assembled when the other dishes were ready. So I pretty much ate alone as my parents were waiting for their food. I tried to wait but my parents told me to eat or the food would get cold.

For an appetizer we got the fire and ice crab seviche which was pretty tasty. I wish I could've tried the ahi tuna or salmon as well.

I got the 2 for $12 tacos so I chose the tempura fish, which comes with mahi mahi, kimchi verde sweet soy and a peanut aioli + the BLT, which comes with pork belly, cherry tomatos and jalapeno ranch. They were both SO good! My dad asked which one was better and I couldn't answer because I really enjoyed both of them. The choice of sauces and flavor worked so well together I was impressed! 

Going back to what I said about the food coming out way later, our waiter was still so nice. He apologized and had the manager come over. 

I recommend the tempura fish & BLT tacos as well as the fire and ice seviche!"}
{"text":"I was pleasantly surprised at just how much I enjoyed Seviche.  My fellow Yelp reviewers are spot-on regarding this restaurant.   I am in Pittsburgh for work every couple of weeks and usually try to eat somewhere different each time, based on the location of the hotel that I am staying at.  Seviche was within close proximity to The Courtyard Hotel and also a block or so away from the Benedrum Theater where I had tickets to see Cats, the Musical.  My dinner reservation was for 6:30, I arrived a little bit early so that I could check out Happy Hour.  Elizabeth and Josh were manning the bar and did an awesome job in making me feel welcome.  I ordered the much talked about Sangria, which was $5 during Happy Hour, but free based on my first check-in at Seviche, thru Yelp.   It was tasty, I must admit.   I checked in for my dinner reservation and since i was dining alone, I asked if I could sit at the Chef's Table, because I enjoy watching food prep.  I was seated and immediately approached by my server.  She asked if I had ever dined there before (no) and was I familar with the concept/preparation of their namesake dish (yes).  There are a number of seviche options to choose from and then there is also an option to add your protein.  The signature seviche is the Fire & Ice, I opted for the black bean & corn with fresh jumbo lump crab meat.   I had the opportunity to watch the prep of my dish.  The dish was served with an ample portion of plaintain & tortilla chips.   This dish was AWESOME!!!!! Everything was fresh and flavorful, I could have easily ordered another portion.   I also ordered the \"greens\" salad which was artfully prepared and served.  Mixed greens, tomatoes, and walnuts d in balsamic drizzled with balsalmic dressing.   My server recommended that I try the Junior Roll, which I did choose for my entree.   The Roll, is in essence and sushi roll, battered and deep fried then sliced into coins and topped with a mixture of avocado & crab topped with sriracha and then drizzled with a sriracha aioli and ponzu.  The Junior Roll was really GOOD!!!! Great recommendation.   Having the opportunity to sit at the Chef's Table gave me an opportunity to see who was behind putting out such great food.   Huge shout out to Dwayne....he handled all of the cold prep and service, but was also instrumental helping others (who seemed a bit new) keep track of their orders, grill items etc.  He was patient in giving them direction, while never losing track of the task at hand.   Dwayne....you ROCK!   I typically don't visit the same restaurant twice when I am in Pittsburgh, but in the case of Seviche, I might have to make an exception.  Highly Recommend this place!"}
{"text":"Stopped in for dinner.

Nice setting with cool artwork, decor and furnishings.

Ordered the tuna tiradito appetizer which was thinly sliced and very fresh. It was dressed with a cilantro-citrus sauce, sliced scallions, pickled shallots and shredded red cabbage. Very good and reasonably priced for $10.

Had a BLT, a calamari and a scallop taco as an entree. They best of them was the BLT but I felt they were all a bit overdressed which masked the flavors of the main ingredients. 

Service was nice and attentive."}
{"text":"Felt like a piece of Miami dropped in downtown Pittsburgh. Excellent banana mojito, shrimp ceviche, and very creative goat cheese & corn croqueta. Nice music. Fun crowd. Wonderful service. We sat at the bar with a nice friendly attentive bartender. To top it off, good happy hour prices and a free sangria with a Yelp check in. 
All in all, great experience. I hope to go back again soon."}
{"text":"This place is great! When I went I can't even remember what I exactly had gotten, but everything I ordered tasted amazing! Aka you can't go wrong with anything you get. We ordered 5 or so small plates, all of which were unique and super tasty. We'll be back :)"}
{"text":"Seviche has a reputation for being trendy and delicious. It definitely lives up to that reputation. I tried the pork empanadas, the lamb, and the churros. All three were very good, but the lamb really blew me away- I would venture to say it's the best lamb I've had in the city! 

The restaurant is located in a great area downtown, as well. The decor is very cute and it looked like they were setting up a DJ just before I left Friday night. 

I plan on returning to try more things on the menu"}
{"text":"Really good food. Especially the croquettas! Service is great too :-) Plus you get a free glass of sangria when you check-in on yelp. 2 thumbs up!!"}
{"text":"A colorful little place in the heart of the cultural district downtown. This place has got some flair!

Went here for a Saturday night out with a group who had pre-planned - reserved a few high top tables and had pre-ordered lots of tapas and pitchers of margaritas and mojitos. The place was pretty perfect for that sort of thing - easy to socialize, a staff that was attentive and accommodating, and just really super fun. 

I've been here before - sat at the bar, which again, involved tapas, mojitos and margaritas....see a trend? This place is meant for fun cocktails and flavorful little dishes. Perfect for good times!"}
{"text":"Had a great dinner last night at Seviche,  Of course we went for the ceviche as my gf and I are huge fresh raw fish fans and having a love for south american prepared foods I needed to give this a shot.  We tried the Tradito, Fire & Ice and Sofrito Mango preparations.  I felt out of the 3 tried the fire and ice had the most traditional and delicious ceviche flavor.  Alittle spice but nothing crazy and a great overall fresh, cold base too it.  The tradito was a little plain for me and just tasted like ahi tuna with olive oil and some spices.  The Sofrito Mango preparation was great aswell, served tartar style with plantain chips for dipping, would recommend also not to fruity at all.  
     I underestimated how much I would enjoy their 2 for $20 tacos, and I nailed the choices on that one. The carnitas were amazing , very tender and moist and just enough spice.  The tortilla was toasted very nice aswell.  Enjoyed the BBQ short rib taco aswell.  I would go back and stick to the small offerings like ceviche and tacos but none of the entrees really captured my interest.  I also enjoyed a pisco sour and red sangris, the sangria was one of the better i've had."}
{"text":"Just started my cross country trip. Pittsburgh was my first train stop. Had a 3-hour layover. Seviche is very near the Amtrak station. Food is great. And the free sangria for checking on on Yelp was a nice addition. Thanks. 

Another thing I liked was being able to sit outside. It was a bit cold and noisy inside. It is crowded, but it is the weekend in the Cultural District. So I was not surprised at the noise level inside. Outside was great. And because it had just rained, the humidity has dropped; so it was a great experience.

I had the chorizo and serviche tacos. Both were very good. The deserts also look good, but I decided against indulging this evening. The Tequila Lime Cheesecake looked particularly tempting."}
{"text":"we wandered in and had the tasting menu. JUST DO IT. IT WAS ONE OF THE BEST MEALS I'VE HAD IN A LONG TIME. all of the flavors were perfect. every one. i thought about taking a star away because of our weird waiter (i think he was maybe stoned...) but the food was just to freakin amazing i couldnt bring myself to knock it down. anyway. go. its amazing ."}
{"text":"I've been wanting to try this place for a while, and finally did tonight for happy hour.  I took advantage of the free sangria deal through Yelp, which turned out pretty good.  Thanks Yelp!  Three tapas plates off the happy hour menu were enough for two.  We got the smoky mango seviche w/shrimp & salmon, mushroom & chihuahua quesadilla, and mini chorizo tacos.  I didn't actually try the quesadilla, but the tacos were good and I loved the seviche!  I appreciated the service style, layout, and ambience.  I'm glad I finally came here, and I'll definitely make it a habit."}
{"text":"I have been here both for happy hour and for dinner, and the service, food, and drinks were all amazing both times. The happy hour is Monday-Saturday 4:30-6:30PM (see menu in picture below). I tried a mango mojito for $5, and it was honestly best mojito I've ever had! I have also tried their aloe spritzer and the free sangria from Yelp check-in, and I have really, really liked all of their drinks. I don't particularly like the taste of alcohol so I think their drinks are perfect for me because they weren't super alcoholic so they basically just tasted sweet. For food, I have tried the seviche and mussels and both were delicious and came quickly. 

The restaurant/bar usually isn't too crowded on weeknights so I would definitely recommend going then. The only downside to Seviche is that it is on the pricier side, so try it out for happy hour first if you're not sure if you'll like it!"}
{"text":"This was our first time to Seviche, so we were a little confused when we arrived and there was no hostess to greet us. Several servers walked by us and never acknowledged us. After a couple minutes a server asked us if we were being helped and then the hostess came from the back of the restaurant. The food was ok, but the service was lacking. Food came out slow, drinks from the bar were slow, and I kept hearing the servers tell guests that the kitchen was \"backed up\". I most likely won't go return and the experience wasn't good enough for me to recommend seviche to friends or family."}
{"text":"Never have I ever felt so uncomfortable that I walked out of a restaurant without ordering...until I came here.

I showed up with a friend last Fri. night around 10pm after a Cultural District gallery crawl.  I suggested this place since it seemed interesting and different, it had strong ratings on Yelp, and they offered a free glass of sangria for a check in.  When we walked in, it was fairly busy and seemed understaffed, and there was no hostess to seat us.  Since we were planning to order a few drinks and some tapas, my friend suggested we sit at the bar, and I agreed, so we walked over and seated ourselves.  A guy who looked like the manager or owner walked over pretty promptly and handed us some food and drink menus, which we perused for about 10 min.

Once we'd decided what to order, we set our menus down, and the guy who'd handed them to us came over to take our order.  The weirdness started when I said, \"Well, I'd like to claim my free sangria since I checked in on Yelp,\" only to realize that the guy purportedly taking my order had disappeared!  I gave my friend a confused look, and he told me that the guy had walked off right after I said \"Well,\" and joked that perhaps starting an order with \"Well,\" was unacceptable in this establishment.  It was at this point that I realized that we weren't sitting at the bar--we were actually sitting at the chef's table (which is structured similarly to the bar)!  My friend hadn't known this when he led us over there to sit, and I only happened to know that this was the chef's table b/c I'd read that they had one.  Nobody, including the guy who \"waited\" on us, had bothered to tell us this simple fact, or to suggest that we may want to move elsewhere if we weren't planning on ordering entrees--instead, they just ignored us!  At this point, we both felt weird enough that we got up and decided to leave, and did so without further ado.

I'm not sure if we were profiled as peons who didn't look wealthy enough to be sitting at the chef's table, or if this place was so understaffed that they decided to blow off anyone showing the slightest degree of indecisiveness.  Either way, the treatment we received was, quite frankly, unacceptable.  If the management thinks it's okay to ignore customers and make them feel uncomfortable, they won't have many of them left before long--not to mention any revenue.

P.S. We left and headed over to the Harris Grill in Shadyside, where we spent a cool $50 + tip on drinks and food."}
{"text":"I recently dined here with some out of towner friends, and two of the three of us really got into those tacos.  Mind, we all liked what we ordered, but those tacos were the special stars of the show.  In fact, that might threaten to overshadow the signature dish of the restaurant, which is various types of ceviche.  We tried that too, but MAN, those tacos... They were all very tasty, but my special favorite involved pork belly, and my friend's hubby was really raving about the fish taco.  They're decently sized too, so a trio of tacos with an appetizer should set you up right if you had a good appetite.  I would definitely come back for more."}
{"text":"Overall, the food was delicious and the atmosphere and the service was great! Just two things: their Pisco Sour needs improvement (it was missing some ingredients) and they need to incorporate the Peruvian Cebiche! Trust me, I'm Peruvian! Other than that, I would definitely come back again!"}
{"text":"A great place for food and drink. And if you like Salsa this is your dream come true place. I would highly recommend trying a couple of the tacos along with some if the signature drinks."}
{"text":"Had the chef's table and everything was awesome but the dessert which was merely really good. I would give Seviche a four-star rating, but the service was uneven. Friendly, but a couple of things were forgotten. Please don't let this warn you off, though. Seviche is worth a try.

Warning: this turns into a dance place at night. If you're loud music averse (I am) plan accordingly."}
{"text":"Great downtown spot for some lain style food. The have a great BLT taco  (who doesn't love home made pork belly! )

 They have salsa on Monday nights starting at 9:30 pm. So bring your dancing shoes. 

This is a great spot to check out!"}
{"text":"We had a great experience at seviche. They are only open in the evenings, with one exception, they are open on Friday for lunch.

While here we ordered the fire and ice, Asian, and tradito seviche. All were very good. However, we recommend the Asian the most.

For a cocktail, their classico mojito is excellent!

The service was very good with frequent visits from the wait staff.

The venue itself is loud with Latin music, so might not be the best for a dinner conversation, but they do have outdoor seating that can give you an environment for conversation. The music allows the venue for those who have \"moves\" during the week. Those who dance look like they know what they're doing, so bring your \"A\" game or sit and watch like me."}
{"text":"Come eat everything. The BLT taco is the best thing ever. I love the fire and ice ceviche so much. Please come try all of these foods. The people are so nice here and the drinks are tasty. You will hear the best music ever as well."}
{"text":"I am very torn on this review between giving 5 stars for amazing food, and 1 star for terrible service. 

I had the crispy tofu taco, and it was absolutely amazing. I honestly don't know whether I've had such a good mix of flavors. There were grilled shallots, pickled carrots, Korean BBQ sauce, and avocado. Basically all of my favorite things in my favorite food (a taco). 

However, the service was pretty terrible. Once we seated, we waited a while to be waited on, not too long for the food, but then a long time to get service afterwards. We asked to look at a dessert menu, it came like 20 minutes later, then we waited for 40 minutes and no one came to see if we wanted dessert. Our drinks were also delivered to the table next to ours. It was such a shame that a beautiful night of al fresco dining was ruined by such neglect. 

So basically, 5 stars for the food, 1 star for the service."}
{"text":"Spent an early Monday evening here for a private event.  Good vibe overall. Drinks were well made and complimented the food.  I had berry caipirinha and the hubby had the traditional caipirinha.  Enjoyed the pork empanadas and chicken tostada. Seviche was tasty an fresh. Fire and ice with shrimp was hubby'a favorite. Also enjoyed the cheese plate and salsa verde. Service was very good as well.  We will be back."}
{"text":"Food was just \"ok\" however the drink was made perfectly as requested. It was worth the first visit however I wouldn't return with all the other options around."}
{"text":"I really do love this place. The food is heathy and delicious and the servers (especially Tony) make it fun and a great experience. The best thing I've had is the tuna tartare something or whatever (just ask them and they can tell you). SO much flavor. It's delicious."}
{"text":"Went here with a colleague, as we were both in from out of town.  We came here based on Yelp.  Food was just okay.  We expected a bit more based on the reviews.  Seviche was okay.  The hot tapas plates were okay."}
{"text":"I just want to clone and date me. Is that too much to ask?

Solo date night: dinner and drinks at Seviche... So happy!! hehe (~o~)

Seviche is a Latin American dish of raw fish marinated in citrus juice... onions...tomatoes and chilies and sometimes flavored with cilantro....delicious!!

you have to order their tacos.!!!one of my favorite entrees was just munching on their specialty tacos...was very filling too!  pair with their signature mojitos perfect!

Drinks is one of the most important part of my meals....i ordered champagne... mojitos and a sangria..WOW..everything was strong and tasteful!"}
{"text":"Went there on saturday night, as it was filled with people that came there mainly to get drunk. It's first come - first serve, if you want to get a table. Food is OK overall. Their Sushi is pretty good though. Definately a good spot to pre-party with a bunch of friends. I wouldn't come here to eat though, at least on the weekend nights."}
{"text":"The fish looks fresh, the decor and ambiance are what you'd expect in the financial district, and how could you not love the concept of a mix-and-match ceviche restaurant?

Nothing was notably bad, but there was also nothing that I'd call notably great. We got conch, scallop and oyster ceviche, using the ice-and-fire, the standard, and the lemony ceviche toppings. The oyster with ice-and-fire was pretty innovative, but the flavors failed to amaze. Everything was a bit over-lemoned and under spiced, which was my main complaint with the place. We got a sushi roll, and it was nothing I couldn't have gotten at a generic Japanese restaurant across town. The prices were pretty steep considering the lackluster flavors.

If I'm being completely honest about my experience here, it was just so-so. I won't return, but if you like less strongly flavored raw seafood dishes, or are a beginner to raw fish, consider this training wheels."}
{"text":"This is my first time dining at Seviche and I came right during happy hour (5-7pm) on a Thursday with barely any diners.  I took advantage of the $5 tapas and ordered the smoky mango seviche w/shrimp & salmon, mushroom & chihuahua quesadilla, and coconut chicken curry tostadas. I also ordered 3 tacos: BLT, chorizo, and spareribs and the asian tuna tartare.  Everything was amazing and the service was impeccable!  Our waitress was extremely helpful and thorough when describing the menu and explaining how to order seviche.    

The tacos and tuna tartare stood out the most and I savored every single bite.  I loved how I could order three different types of tacos instead of getting three of the same kind like from most restaurants.  The tacos were pretty decent sizes and sure made me full along with the variety of tapas.  The short rib taco was tender and dressed with a delectable BBQ sauce , the BLT taco was topped with a thick cut of pork belly paired with tasteful pickled cherry tomatoes, and finally, the chorizo taco came with spicy jalapenos and salsa.  My fiance raved about the asian tuna tartare; it's basically an inside out spicy tuna roll topped with tobiko caviar and lotus chips.  Let's just say it was out of this world! It was just the perfect size pieces of sushi with delightful aioli sauce and a little salty from the caviar, finished with crispy pieces of lotus chips."}
{"text":"I went to Seviche for happy hour on a Friday evening. I work downtown and I never knew about this place, but really glad that I discovered it. First off, the waitstaff is wonderful. We couldn't get a table, so we sat at the bar and the bartender was awesome! She took command on a busy night. We ordered a bunch of tapas which were all tasty. And the food came out quickly. Seviche has good energy and a chill vibe. I will be back for sure."}
{"text":"I am Costarícan  so I am pretty familiar with fresh fish. I have to say that even though we were very close to the coast  the fish was very good and the tacos were spot on. Better than torchys in Austin."}
{"text":"New menu does not tickle my fancy. No more cuban sushi roll. Boo hoo."}
{"text":"This review is for Happy Hour and it's definitely mixed.  Here's the skinny.  

Service - 5 stars.  I was at the bar for a while and then a bar table (several) with a large group.  Service in both areas was very good.  Prompt and friendly.  

Drinks - 2 stars.  So the happy hour special had $5 margaritas, sangria, and mojitos.  They were small and weak.  I switched to a Captain and Coke - still weak and $8 apiece.   

Food - 3 stars.  I sampled the shrimp tostadas from the happy hour menu.  It was tasty, but tiny.  Four small tostadas that were only slightly more than one bite each.  The meals going to tables looked good, albeit a little skimpy as well.

No parking makes this a less than ideal happy hour spot for me, as I ended up spending over $50 between $9 parking, a few $8 cocktails, a weak $5 sangria, and 4 bites of food at $5, and a tip.   Might be worth a try as a dinner spot."}
{"text":"Great food, awesome service. One of many restaurant that make Pittsburgh a foodie city. Nice atmosphere too."}
{"text":"This place was great for a happy hour.  The drink prices were excellent.  We ordered margaritas, and I was totally shocked to see that they were hand muddled.  Good stuff.  I highly recommend them."}
{"text":"Customer Service: 5
Value: 1
Quality of Food: 2

I attempted this restaurant one evening on behalf of my company. Boy were all of us totally disappointed. WAY WAY overpriced food, and after spending $40 per person you still leave out the door HUNGRY... 

If you are hungry look elsewhere. If you are just wanting to socialize, nibble on some food, and waste some cash then this is the spot for you! 

I won't be back here if i'm buying, or recommending it to anyone who is hungry."}
{"text":"Seviche has been on my list of restaurants to try for a while now and unfortunately I am pretty torn writing this review. I wanted to love it, but I am not quite there yet. First things first, it's a very nice atmosphere with good music and outdoor seating for those warmer months. This was my first time trying tapas and I knew going into it the portions were going to be pretty small. Thankfully, I wasn't too hungry and just needed a quick food fix and quick this place was. My friend and I were in and out within 25 minutes I would say. 

When I sat down I had the meal I wanted in mind but couldn't find it on the menu. Our waitress said that was a seasonal item. I am coming to realize a lot of restaurants like to change their menus up and that always throws me off. I ended up ordering the Pork Empanadas which you get two of and checked in on Yelp to get the free sangria. Even though the Pork Empanadas were basically the size of 1 egg roll, they were very delicious. The sangria on the other hand was very weak. 

The only way I could see myself giving this another chance is for happy hour!"}
{"text":"The service was outstanding, the drinks were delicious, and happy hour was a great deal.  I literally wanted to high five the Chef as I left."}
{"text":"Food is okay - could be better.

But Loved the atmosphere and the live jazz music if you're into that. I am a beer guy but am told that the mojitos here are amazing.

Definitely, a good place to visit if you're in downtown."}
{"text":"Simply put, the food is delicious. However, the portions are extremely small. In order to leave this place full, you'll spend a pretty penny. I wouldn't recommend this place if you're a big eater but it would be a terrific spot to go before or after a show for a light snack and drink."}
{"text":"Coming into Seviche on a Friday night at 5:00 PM without a reservation seems to be unheard of.  Luckily, a couple cancelled a reservation last minute, and my friend and I enjoyed some Happy Hour drinks here.

I ordered a great regular Mojito (HH $5/ Reg $10).  At happy hour all Mojitos are only $5, and there were maybe 8 flavors to choose from.  The Mojito was good, and I would totally come back for this happy hour feature.  My friend had two glasses of Chardonay (HH $4/glass), and this also seemed like a great price.  The $5 tapas looked great as well.

While Seviche is out of my budget at regular prices, the Happy Hour is pretty fantastic.  I would encourage any other poor graduate students to check it out."}
{"text":"Wow... all we could say after this meal was bland, bland, bland. Everything sounded so good too. And our service was atrocious.  What a let down!"}
{"text":"Will start by saying this was my first time visiting.  The waitress told us the menu was brand new (and I see some reviewers that aren't happy about that).  It's not really a Tapas restaurant now, and i guess it's more mexican in nature than it was before (according to our server).

They have a number of tacos to select from ala carte and I went that direction.  Had a Chorizo (very good!), a BLT (basically pork belly with veggies...also very good) and lamb, which I didn't care for as much (lamb was a bit dry and didn't like the radishes).  As a table, we shared an appetizer that was basically fries covered with queso fundido and bacon.  Very tasty!  

Service was good, nice ambience, outdoor seating though limited.  Menu was appealing so will be back to try more."}
{"text":"I really tried to like this place several times. Previously,  I had came here for lunch, dinner and happy hour. First of all, their food is not that great plus the prices are pretty high for the quality and quantity of food. One of my favorite dishes is paella, however, their paella was just HORRIBLE. It came out in a little metal pan which made the whole dish taste like metal. There wasn't much meat at all. 

My friend and I came here for Happy Hour. We got two dishes from the happy hour special (pineapple seviche with salmon and comida de la familia) and a scallop tapas. We also ordered mojitos. I was so disappointed in the mojitos! It was so plain and I didn't like it at all. Note that I usually go with mojito as my drink. My friend couldn't drink it and had to ask the waiter to add flavor. The food was pretty bad and the portions were small. We didn't eat much of the food. However, the pineapple seviche with salmon was the highlight of the meal. We really liked the flavors.  Our waiter was super friendly and nice. 

Overall, I would really have to think it over before coming back here. For how much our bill came out, we could have went elsewhere that had good food and have walked out full!"}
{"text":"I've been meaning to try Seviche, as I knew it's previously been rated best in the burgh for happy hour.  We (of course) started with some of their happy hour cocktails: a mojito classico for him, a berry caipirinha for me.  We moved onto the seviche triple, and chose the fire and ice, corn and avocado, and asian tartare.  We asked that the chef choose the best fish to prepare with each, and he accordingly chose barramundi, crab, and tuna.  The highlight was definitely the asian tartare- DElish! We then had the Mojo Criollo sushi (tooooo much mojo for my liking), the grass fed beef tacos (very tasty), and the corn and goat cheese croquettas.  Our waiter (and the rest of the service) was excellent.  I'm not sure Seviche brings anything new to the menu, but because of the friendly staff and proximity to my house, I may need to give seviche another go!"}
{"text":"Absolutely love the tacos here. Haven't tried anything else on the menu because of my taco addiction."}
{"text":"Food is yummy! But, don't go here on an empty stomach because its Tapas = very small servings. We were really hungry! Their happy hour is still expensive though, but their drinks are very tasty and strong ;) Downside, its a little too expensive, the upside is that they do have pretty good food and drinks. It's only a few blocks from our condo, which is a plus :)"}
{"text":"We had a nice time here. We ordered Cuban Shrimp, Fire & Ice ceviche (crab meat as our protein) and Mussels.

 The Cuban Shrimp was great. You only get 4 though. I couldve devoured 10 lol. The jerk sauce was great and had an excellent spice to it.

A friend recommended the Fire & Ice which is the main reason why bobby and i stopped by. It was a cool experience and the ceviche itself was great! Next time I will most likely order without habaneros. I'm a weakling and my eyes and nose were watering the rest of my meal, hehehe.

The mussels were prepared nicely but they were very small. Most plates were of course since they are tapas, but the meat in the mussels themselves are tiny. Luckily the mussels were complimented with a nice sauce and toast. This made up for it the tiny mussels.

 Sidney was our server. She did an excellent job with recommendations.

When we first sat down, the hostess was very kind and explained the entire concept to us and also gave recommendations. 

Seviche has salsa lessons on Mondays at 930pm. I heard the DJ is super cool."}
{"text":"Came here for the first time last night and was very impressed. It is right downtown and has both indoor and outdoor seating. I suggest making a reservation.

Their drinks were very strong and I suggest checking in on yelp so that you can get a free glass of sangria. 

We started with the fire and ice seviche with ahi tuna and the jimmy roll. The jimmy roll was so good that I would recommend it to everyone! 

My husband had the special, two soft shell crab tacos $14 and he loved them. I ordered three tacos for $15 - the Baja fish, braised beef and cheesesteak. All were good but the cheesesteak was my favorite. 

I really enjoyed the food and will go back."}
{"text":"In pitt on business. They have a great drink menu. Fun place to grab a drink or two and get an appetizer.  Bartenders were really friendly as well."}
{"text":"Gluten free dinner menu. Tapas.  Sharing. Good drinks. Fun atmosphere. 

Each time I'm in the city I go to this restaurant. I like the chips and salsa, you get 3 fresh salsa choices and plantain chips with corn tortilla chips. Yum! 

They have salsa dancing on some nights and it's a great happy hour place. 

Everything I have had there has been fresh, tasty and loved by all I've been with:)"}
{"text":"If you find yourself in downtown Pittsburgh, this place is a MUST. If you like sushi or sashimi , you will certainly enjoy this!"}
{"text":"This may be my new favorite restaurant in Pittsburgh.  

Everything about our experience was fantastic!  We didn't have reservations but were seated at the sushi table.  It was very interesting watching as the various items were prepared.  

There are great happy hour specials on both food and drinks.  We were able to sample more than we would have otherwise.  There is also a free sangria if you check in on Yelp!  The $5 happy hour appetizers include a shrimp and a salmon ceviche.  We each tried one and both were tasty and unique.

I ordered the triple ceviche.  I enjoyed that there was a large variety to choose from.  All were very tasty.  I tried the traditional, fire and ice and corn and avocado preparations.  I asked the waiter for recommendations for which of my fish choices went best with each and they did a fantastic job selecting.  I also ordered the Nicaragua chicken wings since I had been to Nicaragua and love wings.  I was not disappointed.  I was stuffed but still was tempted to order more it was so good.  

The one down side is that it was very loud in the space.  Not sure if it is the design of the room or just the night I was there, but at times it was hard to hear conversation.

Overall a very enjoyable experience and I can't wait for my next visit!"}
{"text":"Happy hour goodness! Time to get my tapas and drinks on. You can now ask for a Tyra Banks and they'll know it's for a Negra Modelo. You know, dark/black model. Corney but still gets a good laugh. The number of personable, courteous and professional people I have met in Pittsburgh is astounding. Lizzy, manager of Seviche, is tops on that list. A native of Pittsburgh, this is a young women who's going places. She has a great smile and a sweet disposition. Go to the restaurants website and read about Lizzy. Then there is Diane, who calls me Elmo. It's what she heard me say. LOL! Thanks for picking tasty tapas. Remember Tyra Banks. And last but not least is, geez I'm so bad with names, a male server, who hooked me up with the local imperial stout, shout out to you too. You are great! Take a date, revel with friends...it's the company then the atmosphere would either enhance or detract. Seviche enhances!"}
{"text":"This was a memorably good meal. At Pburgh prices. My head almost exploded when I put those things together.

I hope you people understand what you've got in terms of price for value as a city, because it's like a price timewarp for most everyone else. I have never come back with a heavier wallet than I did in this town having still had a great time.

You know that point in your travels where if you have one more bite of road food, steak or grease you're going to explode and all you want is something light?

I can't think of a better reset for the mind and body than this place. 

Perfect drinks, ceviche in its yuppified sanitized glory is *still* fantastic, empanadas good, service exceptionally nice, room elegant and swank (trust me, you start to miss \"overdone\" in the Midwest.) 

Note: I was decidedly absolutely NOT dressed in Dolce, tanned, or hot looking that night.  Neither the server nor the empanada were rude to me.

I wanted to take this place back with me in my suitcase."}
{"text":"Love the small portions so I have an opportunity to try more. The waitress we had suggested the salmon for the main course, which I took her suggestion and tried, then after bringing out our food she disappeared for 30 minutes. Upon returning she informed us she was in the back having salmon for dinner herself. Huge turnoff! I couldn't even order more drinks because she was no where to be found!"}
{"text":"One of the very few worst experiences we've ever had. One star was given for the taste of the food, which was not great but at least good. All the other aspects of dining here failed big time. The drinks were awful, the ambiance was mediocre and similar to the canteen type of dining, the value (if we'd paid for our meal would be overpriced), but the most horrendous was the service.
Starting from the manager who was rude and doesn't know the elementary things about management and settling the things right way, so the patrons with unsatisfactory experience wouldn't leave her restaurant in such an anger that even the \"complimentary\" offers would not stop them. Actually the only good action she was at is cleaning the tables (which we observed while waiting for 20 to 30 minutes in between each of our dishes). And finishing with the most unpleasant, clueless and ignorant waitress and SLOWEST kitchen we've ever experienced (in spite of the hardly half full restaurant on Saturday night). 
So, no question we are not coming back and surely don't recommend anyone to repeat our experience."}
{"text":"I am sad. SO SO SAD! I was really disappointed by the service here. I was really looking forward to it, and even made it my birthday spot. They literally took over an hour to get us our appetizers and at least another 20 minutes to get us our actual food. Then they really messed up the checks. We were there for 2.5 hours! The food was AMAZING tho, which is why I am really sad. I definitely would eat here again, but the service is really making me reconsider it :("}
{"text":"I've been coming here for years and they NEVER disappoint. I like popping in for happy hour and taking advantage of the $5 tapas :-)"}
{"text":"Underwhelmed. Going on a whim and not making a reservation, we were able to secure seats at the bar without a wait.  We started by redeeming our free sangria (thanks Yelp!) and ordered tea- honey mojito.  Drinks came quick and were quite good.  Josh, our bartender gave us menu's.  We were ready to order in a few minutes but our order was not taken for approx 15 min, not a major thing as we were at the bar and the place was packed. We started with a fire and ice ceviche with lump crab, the ceviche of the day(can't remember what it was) with oysters  and three taco's(fish, BBQ short ribs and the pork belly).  Then we waited.....and waited.  Approx. 45 min later we got our ceviche,  to wait that long for what is essentially a pre-marinated raw seafood is absurd.  The portions were small.  5 small soup spoons of the fire and ice, which were just OK.  Only 4 small oysters on the half shell, much more flavorful then fire and ice.  Because of the size and wanting more then a spoon of ceviche, we then ordered tortilla chips and salsa. This came out in about 5 minutes.  The chips helped with the ceviche, but again we were underwhelmed by the guacamole and salsa, which were bland.  The corn/bean dip were good though.  About 15 minutes after the ceviche we got our taco's. Also a smaller portion. The fish and BBQ short rib, were average at best, but the pork belly were superb.  Still hungry and wanting something to remember, we ordered the special starter, duck Mac and cheese, an pork belly and fries( can't remember the name). Another long wait, which I don't understand because the crowd thinned and the cooks we just hanging out at the kitchen/ bar.  The duck Mac and cheese were good, a smokey cheesey flavor that was a unique take on a traditional side and pork belly and fries were as advertised.  Overall we weren't impressed, food was hit and miss, service wasn't the greatest but we were at the bar and the food portions were disappointing.  We won't be returning"}
{"text":"OMG.....the food here is amazing (although I will admit that I tend to be easily impressed)....but seriously, I found this little gem while staying at the Westin on a business trip and my colleague and I still talk about it.  The sushi was AMAZING, like nothing we've ever had before, and the few other times I went (yes, I went several times in one week) everything I ordered was fantastic. Also, the drink menu is fairly extensive (lots of girle drinks, perfect for a happy hour).  If I'm ever in Pittsburgh again I'm definitely stopping by.  Love it!!"}
{"text":"I don't give out the Five Star rating lightly, in fact, I'm a pretty picky Yelp!er. This place deserves each and every star no questions asked. 

Atmosphere: Fun, lively and extremely colorful. The artwork that graces the walls is super interesting to look at, and the music selection is PERFECT for the vibe they're going for. Furthermore, high ceilings and a good table layout has the place feeling like the best spot to eat in the area. 

Service: Our server deserves six stars, and from what I saw around us, it seems ALL the servers deserve the same. Friendly isn't even the word, she made us feel like we were guests in her really cool apartment, and by the end was basically asking us to move to Pittsburgh (in a non creepy way)

Food: Mouth watering... amazing... simply A+ with freshness and layout. 

Drinks: Strong and delicious 


If you're thinking of eating here, stop thinking and start doing!!"}
{"text":"My sister has been raving about this place to me. She stated that I must go there on my next visit to the Burgh. So here goes... We ordered  several dishes of which I can't remember all the names.  (Photos attached) The food was very good, I would have to come back one more visit to give it four stars. The drinks on the other hand were horrible, and my sister said they were not as good as her prior visits. She returned her Mango Mojito. It was replaced by one that was not good either. Lol"}
{"text":"This was a great find!  We had the salmon sushi, fire & ice shrimp ceviche, corn & avacado crab ceviche, ahi tuna ceviche.  We couldn't even pick which one we liked best.  They were all fantastic. Since we are not dessert people we decided to try the goat cheese and polenta small plate.  This place is great for sharing.  Top it off with a nice bottle of Malbec, it was great.  You leave nicely satisfied but not stuffed which is perfect.  If us Clevelanders ever find ourself back in Steelers town we would go back to this restaurant for sure.  I hate to admit it but we really liked Pittsburgh.  Don't tell our friends back home. ;)"}
{"text":"I read other reviews specifically about salmon, I was Intrigued so I ordered the salmon entree. It was served medium, which I am totally ok with. However, I found the fish lacked flavor/seasoning. It's served with a sauce but I felt it was missing something. I would be willing to try other stuff if I am ever I town again."}
{"text":"Just went for my second visit and it was just as good as I remembered! There's definitely something on the menu for everyone, and it's the perfect place to go with a group (small plates make for great sharing).

I was craving some fresh fish when we went, so we had plenty to share: the Nigiri and Cuban roll, along with the traditional, tiradito, and asian tartare seviche. The table favorite by far was the Nigiri; the citrus vinaigrette really made the dish. The best way to order seviche is to pick your favorite three fish and styles, and let your server pair them up. They know the best flavor combinations and you'll definitely end up with a great dish. I think the only complaint we might have about the fish dishes is that the sauce on the sushi plates kept the rice from sticking together.

We also shared a couple dishes from the tapas and bocadillos parts of the menu. Apparently most people pass on the tuna sliders since they're visiting for the raw, rather than cooked fish, but they were great, and definitely worth it for added bonus of the ancho fries on the side (I wish I could buy the spice blend they use on them, it was that good).

This is one of my favorite places to go in Pittsburgh when I'm craving sushi or fresh, raw fish. The only reason I'm not there more often is that it's a bit of a trek to get downtown (a good think too, considering it's easy to pay $40 a head if come in hungry and order a drink).

If you can, make reservations before you go (I made mine online an hour before we showed up), since the restaurant is a little small and seems like a pretty popular pre-show dinner stop."}
{"text":"The crab fire and ice ceviche is fantastic. The sangria was below expectations. 
Great service. And if you live in downtown, you get 22% off on Tuesdays"}
{"text":"Went with my 17 year old son as we were visiting Pitt for a college visit. Always like checking out new places and like ones that have a cool look/vibe in addition to good food. This place delivered.   Very trendy look, lively etc.  We got there around 830 on a Friday night.  Were told 20 minute wait but it really was just like 5-10.  The food was unique, well prepared and most importantly tasted great. We shared one of the sushi roll specialties which was really great..sushi with a latin twist..pretty cool. My son ordered one of the Ceviches..I had three of the Tapas type meals, steak quesadilla, Mussels and a cornbread/cheese type dish. I have to say it was all great.  Our bill was about $55 bucks which include a corona for me.   All in all Id def say check it out."}
{"text":"Good news: Good food, very good service.
Bad news: Tonight was Seviche's last night of service."}
{"text":"Hmmm...I thought I had already reviewed this place, but maybe it was a mental review that I failed to put into actual words.  

I think the food and drinks at this place are fantastic.  The ceviche that I've had has always been fresh and flavorful.  I recently tried their sushi and it was really good.  Their tapas are also tasty, but I think I prefer the ceviche and sushi.  

I usually get a mojito when I go and most recently I had the colada mojito which was coconut minty - which I quite enjoyed.  The waitress recommended that I try the drunken sailor if I'm a mojito fan and so I decided to give it a shot.  It was good, but my taste buds were a bit confused - the flavors were good, but they weren't reminding me of anything, which maybe is a good thing.

After consulting with friends, we decided it tasted like coca-cola with some basil flavor.  Sounds weird? - well try it and I think you'll be pleasantly surprised.  

Overall - I think this is a great place for dinner or grabbing some drinks.  Most of what is on the menu is tapas portions so keep that in mind when ordering.  You may need to order more than you expect to feel full/content."}
{"text":"Dark joint with easy listening Latin music.  Open kitchen allows you to see the chefs at work.  Long bar allows friends to gather.

This is a Latin/Asian fusion restaurant.  Small menu,  printed on paper so you know they serve what is fresh that day.

Wait staff very helpful in explaining what is what and what they like.

Grilled octopus stuffed with ground beef was awesome.  Tentacles were tender, cooked perfectly.

Pork shoulder was tender cooked in a smokey BBQ sauce...the polenta was unique.  It was steamed...if I did not know what it was, I would have sworn it was a light steamed egg custard.

Men's Room follow the motive, it was a bit dark with blue walls.  2 standees and 1 stall.  It was clean, dry and we'll stocked."}
{"text":"I was a ceviche virgin before I finally ate at the colorful South American resta-bar 'SEVICHE.' It has a cool, dark vibe ad I never feel overdressed... Something I struggle with in Pittsburgh as I like to dress up when I go out!

We ordered the shrimp ceviche as an app and it IMMIDIATELY sold me... The cold shrimp and chunks of avocado on tip of a friend plantain made me forget about my margarita... So, I ordered a ceviche taco for dinner, and it was not what I wanted it to be... Cold tacos are weird and I wasn't drunk enough for that. The OTHER tacos were awesome though.... So definitely get a few!

8 for drinks, 8 for atmosphere, 8 for service, 7 for food, 8 for fashion"}
{"text":"Went here during a weeklong work trip and it was awesome.  Eat at the bar.  I rarely do but Teresa and Liz were amazing.  Personable, sweet, and very informed about pgh activities.  Best service I've had. :))"}
{"text":"Came for dinner late on Monday night.  They serve food late and it was Salsa night, so decent crowd and a good atmosphere for a rainy Monday.  Also had Monday night football on so a nice touch there at the bar.  Had several margarita's which were good.  Had the chicken soup, which was appropriately spicey and a good size.  Then had pomegranate tuna ceviche.  It was average and not the freshest fish.   Had the salmon for entree, which was ok but strange.  It was sitting in a bowl of Cuban au jus and the quality of the fish was average.  Overall,  good spot for a decent late night dinner, but otherwise average food and fairly high prices."}
{"text":"Mojitos are pretty bleh.  It's close to being their signature drink and it ain't much. Had the frites with the sauce as an appetizer and that was meh too."}
{"text":"I didn't enjoy my first experience at Seviche. Kyle sat us pretty quickly and was very pleasant throughout the night. The server working with him while also pleasant, kept forgetting us and got our drink and entree orders wrong. The manager begun helping, we were a table of seven but her table side manner left a lot to be desired. The food was delicious but it was hard to tell if it was on its own merit or because we'd been waiting an hour and a half for it and were starving. It wasn't particularly busy. When the checks came, after being quite concise about how to separate them, they needed to be corrected three times. Kyle and the waitress working with him were apologetic for that but by this point we had been there since 7 and it was now 10pm. Salsa night had begun and the priority of the manager was clear. The table had only ordered drinks, chips and salsa and tacos. When we were finally able to leave it was 10:30pm, the duration of our stay was definitely due to the poor execution of the service and not our enjoyment. But for integrity, we would have just left like the table next to us, opting for Sienna Mercato instead. We wanted to just tip Kyle for his professionalism but were unable to as the gratuity is communal amongst the wait staff. I doubt I'll ever return when on the same block are no less than three other perfectly good options."}
{"text":"Sprung for the Cuban roll and Nigiri roll.  Both were excellent!!!  Happy hour specials on booze were phenomenal as well.  Can't go wrong with $3 dos equis lagers.  

On top of that, our server Dale was phenomenal and catered to our every need.  He even changed the tvs to a basketball game at my friend's request.  Talk about excellent service!

Also, everyone else in my party really seemed to enjoy the grass fed beef tacos, the pork empanada, and various ceviches.  

I would recommend this restaurant to anyone who's looking for a place to eat in downtown.  Also, make sure to ask for Dale.  He's the best!"}
{"text":"My sister, friend and I came to Pittsburgh from Philadelphia for the weekend a couple weeks ago. The first night we ate at Seviche. The food was prepared perfectly and the flavors were beyond reproach. The service was impeccable and the management and staff were very polite and helpful at all times. The price for the quality of food and the service was more than reasonable. The rest of the weekend our dining experiences at every other restaurant were major disappointments. We will definitely come back to Pittsburgh and eat here again. Unless of course they open another location is Philly and then we will be there almost every night... WELL WORTH GOING!!"}
{"text":"I ate here this past Thursday evening with my fiance for dinner.  We decided to stop here before heading out to a show and so both of us were fairly dressed up.  Upon entering the restaurant we were greeted at the door by the host.  We did not have reservations and he was having a hard time finding us a spot until we promised not to take too long of a time.  After that we were shown to a table that had a reservation for later in the evening.  While taking us to our table he complimented the bow tie that I was wearing as did the server whenever he made it to our table.  We were sat a high top table in the middle of the restaurant with bars to both our front and back.  Since it was happy hour, we decided to get some drinks that were on special with fiance ordering the sangria while I went with a mojito.  After our server left I checked in on Yelp and was pleasantly surprised by the check in offer of a free sangria.  Perfect since we had already ordered one!  The inside of the restaurant was bright and vibrant yet was also comforting.  I think that it also gave off quite a Latin feel which I imagine based upon the food was what they were going for.

For dinner my fiance and I decided to split a bunch of different small plates and also a roll of sushi so that we could try a bunch of different items.  Beyond the sushi roll we also went with a shrimp seviche that was on the happy hour menu and then a triple from the seviche bar from which you could pick both the preparation and the seafood.  We went with Shrimp in the Avocado and Corn seviche,  Bahamian Conch in the Traditional seviche and ahi Tuna in the Fire and Ice seviche.  The first item that came out was the sushi roll.  While I am not exactly sure what it was since my fiance was the one that ordered it, it was delicious.  It was topped off with something crispy and had a sauce (ponzu perhaps?) on its base that was delicious.  After we were almost done with the sushi roll the rest of our items came out.  My favorite of the bunch was the fire and ice with ahi tuna as it had a great taste and cold temperature as it went down and then the heat from the peppers came on the back end.  All were quite good though and I ended up enjoying them.

The bottom line for me is that I would head back here again in the future, especially during happy hour.  I loved the vibe of the place and also everything that I had to eat here.  The food itself would have been 5 stars had it not for for portion sizes.  You don't get a lot of food for you money here and I actually ended up eating a full pizza later in the night.  However, I knew that might be the case whenever I walked in and I was still mighty impressed with Seviche!"}
{"text":"Walked in here randomly while I was in town visiting with my parents. It was around 8:15-8:30 (a little after the dinner rush) and despite a few late night reservations, we were able to get a table. Being an out of towner, I don't know how long the place has been and how it stacks up to the neighborhood competition, but I definitely am a fan. The hangar steak was grilled to perfection and in just the right portion size. My parents got the chicken and the pork shoulder which were, although I only tried a bite of each, delicious. Throw in the decor and the other attention grabbing dishes on the menu, I'll definitely have to come back again the next time I'm in town."}
{"text":"Omg the best experience I have had in a very long time! From walking in to the appetizer drink and main course I can simply say I'm at impressed! The service is great and service even better! I'm so
Full I can't even
Feel my stomach! OMG thank you sooooooo much! The salmon will melt in your mouth the pink rose cocktail is strong and Cuban shrimp is DELICIOUS! I will return in the future! This is definitely my
Go to spot while visiting Pittsburgh! Wonderful experience!"}
{"text":"Don't get the steak. Came out cold the first time. Asked to heat it up and they brought it back cold again. Third time it came out but it still wasn't that warm. Frustratingly slow, waiters and waitresses were good but the kitchen was poor. Won't be coming back"}
{"text":"Stopped into Seviche on a recent Thursday night for a quick bite and yummy beverage.

i like Seviche for several reasons, including its location in the downtown area and that I don't feel like I'm in Pittsburgh. It's trendy and this is appealing to me as a young business professional.

So what did I order?

I ordered a caipirinha and their Cuban sushi role, which was served as described: sticky rice and nori roll filled with salmon, calabaza, jicama and avocado, topped with spicy sushi tuna, crispy malanga frizzle, Siracha mayo and cit- rus ponzu.

I enjoyed my first caipirinha so much that I decided to order another, but asked for more sugar in the raw (to sweeten it up a bit). There must've been a mix up at the bar, because my second beverage had no sugar. The waitress apologized and quickly returned with a new drink.

Will I continue to return? Yup! If you haven't been, stop in for drinks and some food."}
{"text":"Seviche is one of my favorite places to go downtown! As the name would suggest, seviche is a featured item on the menu and it has never disappointed me. The fire and ice seviche is the way to go if you've never tried it before. It has red onion, jalapeño and a prickly pear granata. I would also suggest the Asian tuna tartare. The tartare is served with a rice coin, ponzu and pretty little lotus chip! It's great when you just want to share a few appetizers and don't want anything heavy. The tacos are also delicious! My favorite thing about Seviche would be their cocktails. I recently had a caprese martini that was incredibly refreshing! You wouldn't think a drink inspired by a salad (it is garnished with a basil leaf, grape tomato and a mozzarella ball) would be so good but it is! It is almost like a really light Bloody Mary but with more alcohol. I would recommend anyone to try this place out if they haven't already!"}
{"text":"I find myself thinking back to all of the seviche restaurants that I've been to throughout the years. East coast, west coast, islands, etc. This place is the one that my stomach craves. 

The ambiance is great for a fun and upbeat dinner experience. It isn't quiet by any means, but you can expect to feel instantly transported into a lively atmosphere. 

I ordered a pitcher of sangria to begin. The flavors were well-mixed and not watered down (as it is many times in Pittsburgh). 

To eat, my husband and I ordered a triple serving of seviche: Fire & Ice (my favorite), Grapefruit Ginger, and Peruvian Poke. I found this to be a lovely mixture of textures and tastes. The presentation was also nice, with a variety of colors - which I found to be nice. 

I also ordered a few tapas: Corn & Goat Cheese Croquettas, and the Pork Empanadas. Everything came out cooked to perfection. 

Overall,  I was pleasantly surprised to find this place in Pittsburgh! 
 
I will say, make sure that you put in a reservation on weekends. We had a reservation, as recommended by a friend, and we are glad that we did. The place was packed!"}
{"text":"Amazing friendly wait staff that I can always rely on to make good recommendations! I love the vibe here and would recommend it to everyone especially for their amazing happy hour drink prices - full sized cocktails for $5 - decent price for such a nice place!"}
{"text":"Good service, passable and strange food.  

We were going to have a party of seven and they made accommodations for us outside.  It then started raining and they found us four stools at the bar which was fine because part of our party was arriving late.  Could have done without the superior \"don't know what we can do because we have reservations\" comment, but luckily someone else problem solved and seated us at the bar.

We tried to order double seviche thinking it was the ability to put two seafood items in one seviche.  It is not.  It is two orders of seviche at a slightly lower price.  Why can't they put more than one seafood in a seviche...?  We asked but it wasn't an option.  

The total food was two double seviche, conch fritters, pork empanadas and beef arape.

The seviche were crab in the kiwi grapefruit, tuna in the tradito, conch in the fire and ice and a hamachi in the tradito.  If the reason that seviche is spelled incorrectly is because they combined the words sushi and seviche, then that would explain these preparations. 

Other than the fire & ice, which comes in a serving spoon, the others weren't what is expected from a ceviche.  The seafood and preparation were piled on a plate which looked like and tasted like sushi preparation.  The taste was fine, but not at all what we expected from a ceviche.

The other three dishes were fine. 

The Portuguese Lemonade did get raves.  The other drinks were good too."}
{"text":"This is a nice low key spot to take a date or if your out with the girls .. They have super yummy lite apps if your watching your weight And the drinks are so refreshing so check this spot out my yelpers  
P.S. The staff are super nice"}
{"text":"Went to this place on a Monday night at happy hour, awesome. Had two mango margaritas for 5 bucks each and they are delicious. Right amount of tequila with mixer. For dinner I had the stuffed octopus (yup being adventurous) and chicken mole; both were great decisions. The stuffed octopus comes with about 6 pieces (octopus looks so weird), but is plentiful. The sausage fits nicely into the octopus and complements the chewy texture of the octopus and the caesar dressing adds a nice kick. The chicken mole is phenomenal; it is soft and tender to taste with a nice spice to it, and the cabbage almost looks like mashed potatoes but quite nice. Service is spot on, food comes out within 15-20 minutes, and plenty of seating available. Granted, I did go on a Monday night."}
{"text":"Had a solo dinner here at the bar while in town for business. First plus, the bartender steered me away from a bad drink. Redirected to the drunken sailor, I was a very happy camper after a long day of meetings. I followed it up with the cucumber/peach margarita and was even happier. I am a huge margarita fan (and make a darn good one). I usually do not like flavored varieties but this was intriguing. The two conventioneers next to me slugging Yuengling(don't get me wrong, I like it, but in a Cuban restaurant?) were also intrigued. It was tasty and fresh.
The bartender had excellent recommendations on the menu as well. The Fire and Ice seviche was a winner, providing good flavor and some nice heat. The empanada was a nice follow-up but the seviche starred.  
Good service, good food and all at a reasonable price."}
{"text":"I dined here for the first time on a  Friday night and have a mixed review to report. I guess I should preface this by saying it was their first night of their new menu and by this point in time they should have some of the \"kinks\" worked out. We did not know they had a new menu and not being entirely familiar with ceviche, we wanted to try that. Unfortunately their new menu only contains 2 ceviche appetizers. We had the salmon and scallop ceviche which was very good but not enough to split between three people. I chose the 2 tacos for my entrée-the barbacoa and the Baja fish. The barbacoa was supposed to be made with lamb, however they were substituting pulled pork for the lamb.I still decided to try it anyways. The pulled pork was awful and did not taste like pork. The other ingredients were high quality and tasty though-salsa verde,crema,radish,marinated onions, and avocado. The Baja fish taco was very good and if I would have known how good it was I would have just gotten two of these! It was tempura fried fish,chipotle tartar sauce, romaine, cucumber pico. The drinks were excellent-I had a banana mojito and a mixed berry capirhina and they were very well made. The apple basil mojito was had by one of my dining partners and I was able to sneak in a sip and it was delicious. Overall the experience was a good one-they just have a few kinks that need to be worked out in their new menu but I'd try Seviche again and will definitely be back for cocktails in the future."}
{"text":"We headed over to Pittsburgh for a little getaway the week after Christmas and saw the great reviews for happy hour here.  We stopped in just after 4pm on a weekday and were almost the only people there.  We sat at the bar and started off with the happy hour Mojitos.  Very minty and delicious!  We snacked on the chorizopan which was like a choizo slider, fantastic!  I noticed the free sangria offered with a check in on Yelp so I checked in and that was great too!  Wish we could have stayed for dinner but we often like to \"bar hop\" in new towns to try some different things.  
The bartender helping us was friendly and attentive.  We will definitely return!"}
{"text":"I came in at happy hour on Monday night by myself.  We were in town for a Veterans Business Trade Show at the convention center a block away.   I was staying at the Marriott across the street.  They gave me a free sangria  for checking in.  They had on nice music and the server came right away.  
They had a delicious happy hour menu $5 drinks and $5 small plates. (Sorry no picture of that menu). I ordered a Mojito and two small plates. I had a salmon mango salsa with chips and a burrito.  The food tasted fresh and lite.  
My daughter (University of Pitt) joined me and had the Jicama Sofrito with the fish of the day octopus. It was fresh and light. 
The interior nicely lit and decorated. The sound level seemed loud to me but there wasn't a lot of soft surfaces to absorb sound.  There were nice looking business dressed young people there.
The waiter was able to help with gluten free choices."}
{"text":"I've never been a fan of tapas style restaurants but the free sangria upon check in enticed me to go to Seviche and give it a try. Unfortunately, I'm still not a fan of this style. Our waitress was very helpful and explained what Seviche was and went into detail about the different sections of the menu which was extremely helpful. I went with an order of their seasonal Seviche with salmon. While it was definitely interesting, I wasn't all that impressed. I think it had nice flavor but it seemed overpriced for the amount of food you get. Which is one of the main issues I have with tapas. I understand the point is to order multiple plates to share but the plates are such small portions but typically very expensive."}
{"text":"Excellent!!!
First of all, Emily, our waitress was fantastic. Gave excellent recommendations, very cheery, and very attentive. The good menu had recently changed from tapas, which was why we were trying this restaurant, but the new menu was great and still able to be shared tapas style. Tacos tacos tacos, delicious!!!!!!"}
{"text":"Came here expecting some good food, drinks and service. The only thing good were the drinks and the ceviche. 

Let's start with the service. We ended up staying an hour and a half, mostly due to wait times. During that time our waitress came to us all of four times, which ended up being when she sat us down, once to replace my drink, and the other two times were to take our empty starter plates. We had to flag her down to get our check. Of our two starter plates, only the ceviche came quickly. The other starter, the papas fritas y queso fundido, took 45 minutes to show up.

On to the actual quality of the food. The ceviche was pretty good, though from the appearance of the scallops it didn't look like they had marinated for long enough. The papas fritas on the other hand was basically way overcooked fries and pork belly with an OK sauce and a little bit of some other sauce that was extremely spicy. I say this as someone who likes decently spicy foods, and from the amount of spice in this other sauce I'm glad only a couple teaspoons was put onto the fries. We were still hungry at this point and when our waitress came to take the plate for our fries away, we ordered a couple of the mushroom tacos. Luckily we got these pretty quickly, but they weren't very good. The sauce had a very weird flavor and both tacos had one spot where they tossed a large amount of black pepper on it. 

Overall, not enthused and not returning."}
{"text":"Great find thanks to Yelp! I was in Pittsburgh for about 24 hours and went here for dinner. Great service! Recommendations from server led me to order fire & ice (with ahi tuna), chorizopan, and the tacos (beef cheek and octopus). The chorizopan has great flavor but the bun was too much. Ate the meat and kale only and it was yummy! Surprisingly, I did not like the beef cheek. Too dry and flavor was lacking but that could also be because everything else had such great tastes and flavors!"}
{"text":"The food was subpar and the service below that.  We initially planned on a complete dining experience here, but after having the Seviche sampler, which only 1 of the 3 choices we selected was even above average we decided to take our taste buds elsewhere.  The decor is very nice, but the food and service don't match that quality."}
{"text":"What a great spot in Downtown Pittsburgh.  My wife and I were looking for someplace to celebrate our anniversary and wanted to try someplace we hadn't been to before.  Did a bit of research and the menu here looked pretty interesting.  We were not disappointed.  We'd made reservations and had requested the Chef's table.  It's a 6 seat bar top overlooking the Chef and his two assistants.  He spoke with us for a few minutes and explained the menu.  We arrived to catch the last half-hour of happy hour and took advantage of $5 Pineapple Kiwi Seviche and $ Shrimp Tostadas.  My wife enjoyed the Sangria that we got by checking in with Yelp.  The menu has a lot of small plates and appetizers.  We tried the Fire and Ice Seviche with lump Crab and the BBQ Duck Mac-n-Cheese to start with.  The seviche came in individual sized spoons for easy sharing since each bite contained a frozen concoction to tame the fire.  The Mac-n-cheese was a huge portion with fantastic flavors, we shared it and still had enough to bring home (we forgot it on the bar).  Next we tried the Asian Tuna Tartare and the Jimmy Roll.  Both were fantastic dishes and made fresh before our eyes.  We finished off with the Chocolate Flourless Cake and the Tropical Tres Leches Cake.  The service was great, all the waitstaff worked as a team to make sure all of the orders were delivered even if it wasn't to one of their tables.  We're definitely going to be heading back here.  We didn't try any of the awesome looking tacos or any of the entrées.  Top notch meal and we got out for about $100!"}
{"text":"I have to confess, I did not plan ahead and every place was booked on a Saturday night... Go figure! We were stuck ordering takeout. After much debate, we decided on Seviche due to its close proximity to the Marriott Hotel and its previous Yelp reviews. 

After calling, I was politely pull on hold for a couple minutes, and another polite employee answered to take my order. I ordered the Chips and Salsa, Jimmy Roll, and the Salmon. Oh the Salmon... That was the best, I loved the top crispy layer. Since I did get takeout, the dark sauce that came with it was on the side, in a cup. I enjoyed it so much I forgot all about the sauce. The Jimmy Roll was awesome and the chips were a hit. 

If the delivery guy wasn't so rough with the containers, the Jimmy Roll would have looked a lot better. (that was me)"}
{"text":"Awful. Came here with 4 friends for happy hour and sat at the bar. We all ordered mojitos and thought they tasted awful. I gave mine to a friend who basically would eat/drink anything and even he thought it was garbage. Ordered pineapple seviche with salmon and the oyster flight (3 to a plate). The girl who delivered the seviche spilled the sauce all down my leg and said \"whoops.\" The portion was so small, it wasn't enough to share at all. And In case you're wondering ... their \"Lime Pearls and Chili Foam\" oyster is a small oyster with Sriracha sauce drizzled on top. Awesome ... save your money and order a Dominos pizza at home. You won't regret it."}
{"text":"This place is owned and operated by the same guys that do Sonoma Grill (which is just down the street).  

I went there opening weekend and was impressed.  Its a little on the small side but it had an electric atmosphere.  The music was lively and the space was open and vibrant and really captured the feel of Cuba or South Beach.  Being the new night spot also atrracted the best looking people (save for me and my friends) which made for a better environment.  

We had some tapas which were quite tasty but I havent eaten any of their entrees.  If the apps were an indication, I think the entrees will just fine."}
{"text":"Okay; so I was in from out of town and found this place on Yelp, and they offered a free glass of sangria!!! SIGN ME UP. I was kind of nervous because I was dining alone, but the hostess was so nice and told me to sit at the chefs bar. (Awesome suggestion)

When I sat down I was greeted by my server Mark(who was the nicest guy) and explained everything to me and made some great suggestions. 

For my appetizer I went with the Fire & Ice seviche. So so so so so good. I ordered mine a little less spicy and with king Alaskan salmon. Let me tell you; this fish; amazing. 

For my entree I went with a dish called 2 little pigs. I'm sure you can tell by he name what it consistent of. Pork. Ginger ale bacon. Fried plantains. And grits with pineapple. This was mind blowing. 

For dessert I went with the peach panacotta. So delicious. No coconut for me though. Gross. 

All while drinking some amazing drinks throughout. The sangria was delish. And even more so bc it was free. I also got a manhattan. This drink is not for the faint of heart. It's strong and had an awesome bite! And for my finale I went with the grapefruit martini. It was a great night. Everyone there was SUPER NICE. By the end of the night I didn't even realize I had just enjoyed dinner alone, the staff and regulars were super engaging. 

All in all this was by far a great choice. The atmosphere is great. They have a chefs bar and a regular bar. And they were playing some pretty rockin music. It was also a beautiful night, so they had their giant windows open and it really set the mood. If you are in the area; THIS IS A MUST."}
{"text":"Stopped by this place for happy hour when staying in a nearby hotel in downtown Pittsburgh. They did have some good drink specials for happy hour, including $3 beers such as Negra Modelo.

We also tried the pineapple salmon ceviche but I was underwhelmed by it. It came with tortilla chips to eat with it that weren't very good at all. We sat at the bar and did get very good service from the bartenders, so that was a plus. So not a bad experience overall, though I probably wouldn't go back if I'm in the area again."}
{"text":"2.5* Friendly, unpretentious service, but unfortunately food failed to live up to the good reviews.

Good:  Aside from the service, Seviche has a prime location that it takes advantage of with their 'HappyHour' specials like $5 mojitos/margaritas & sangrias.  How can you go wrong with that?  

(Although the drinks, I suspect, aren't as strong as if you were paying the reg price!)

Not-So-Good:  Food is meh.  I had the Seviche + Chorizo tacos (2/$12).  Chorizo was so super salty and greasy, it was difficult to overlook everything else.  Seviche on the other hand was dry and needed some acidity to cut through the crispy onions.

I tasted the Seviche Salad ($8) and it desperately needed more acidity as well.

Bustling atmosphere and attractive specials will get you in, but the food may not bring you back!"}
{"text":"The Pork Empanada was AMAZING!  My mom & daughter both got the Bistec and it was wonderful!  Very tender and delicious beef.  The Cuban Sushi roll, Asian Tartare & Ginger Tataki were also very good.  The Sangria of the Day was ok.   We'll definitely go back.  A perfect place to stop before or after the theater."}
{"text":"I really wanted to like this place. It's my favorite type of food, after all. But, for the price and the hype, it kept leaving me disappointed. We both got a cocktail - I got the michelada verde. They were ok, despite the fact that the lime garnish was browning. We ordered from the happy hour menu and the regular menu - Kiwi-lime salmon ceviche (good, but was missing something), shrimp tostadas (ok, but very salty), and two little pigs (everything was cold, and the pork belly was way over salted, like biting into a greasy slab of salt). At least the service and ambiance were good!"}
{"text":"Went back a year later super excited! The service was slow & was served food on dirty dishes. Spent the next two days ill. It was so bad that 9 months later, I haven't been able to bring myself to eat ceviche. Never again at this place!"}
{"text":"Such an upbeat and lively spot! For a while, it was my friends and my, Happy Hour and evening grub hot spot. It is totally excellent to meet up with your girls for a ladies night with all of the liveliness in there. However, it is small in there and can be a bit cramped. But the energy is so nice, you will forget all about it. I had the Pork Empanadas and Beef Brisket Tacos. Soooo good. Honestly, I pretty much order it every time I go. I'm such a creature of habit sometimes, but hey if I love something, I'm committed! That's all!
If the weather is nice, there is outdoor seating. But right now our Pittsburgh weather is so bipolar!!!!!!"}
{"text":"The food was pretty good. My only negative comment was how dirty the restaurant is when you actually look closely. There's strings of dust hanging from the ceiling, and the open kitchen that customers can sit in front of is dirty and messy looking. Made the idea of consuming raw fish from a dirty restaurant a little scary for me."}
{"text":"Arguably the best rest. in Pittsburgh.  Surprised by the many 4 star reviews here, but probably due to the reviews by the locals who barely know what seviche is.  There is no peer for Seviche even in Manhattan, and perhaps the worst comment about the place would be the service...the girls are not always paying attention.

As for the food, just top notch...a creative Cuban fusion theme and I havent had a bad meal at the place since I started frequenting it a few years ago when I am in town.  Solid Mojitos as well."}
{"text":"Service sucked!!! Terrible service. Too many servers for one table and no one checks on you. Food was just ok!"}
{"text":"Excellent dining experience. The hostess was clearly experienced at ensuring diners have a memorable time while at Seviche. We had well-prepared drinks that went very well with our delicious tapas dinner. The atmosphere was pleasant and not overwhelming."}
{"text":"Since my beloved Fish Market has closed I was looking for a new place to eat at in Pittsburgh while waiting for Amtrak's Capital  Limited. This place fits the bill. 

The tuna tartare was spectacular. The salmon I had for my main course was perfectly cooked. They used gazpacho as a sauce. Brilliant, and I'm so going to steal that idea. Too bad the mains were served before I finished the appetizer. The spicy egg roll that was served as a side with the salmon was tasty, but the way he wasn't crisp as it should have been.

I had a great conversation with the manager, Kaylee. 

I'm looking forward to dining here again next time I'm taking Amtrak from Pittsburgh."}
{"text":"Wasn't sure what to expect with this one.  My wife wanted to go so we decided to try it out.  I was very pleasantly surprised.  We ended up with a couple apps and a double ceviche.  Everything was really tasty and we were quite full when finished.  The fire and ice with crab was pretty amazing and the jimmy roll was really filling.  

This is also a great place to people watch.  The windows were open to Penn Avenue so we could sit and watch the people headed down to the Pirates game and the cultural district.  It made for quite the contrast.  

We don't normally get to go out much downtown anymore, but Seviche will be near the top of our list in the future!  Try it out!"}
{"text":"I had the seviche starter and crabcakes for dinner. Everything tasted very good, I think the only problem with it was the portions are really small so don't think of sharing! 
My friend had the carne asada and that was great too."}
{"text":"This is the first review I've posted but rely on Yelp when traveling and looking for good food - so here goes! 
Seviche  from start to finish was amazing. We walked in with triplet 2 year olds, 2 babies and 4 adults and there wasn't a sign of hesitation that they didn't want to deal with our entourage (they even stashed our strollers and got extra high chairs). Kudos to the manager! 

Ok, the food and drinks: AMAZING!!! Our waiter made recommendations and they were great!! We almost ordered something and he slyly advised against it. We enjoyed the happy hour drinks and tapas. Not a single complaint. 

We ordered mohitos, sangria, and a way too good rum drink (had a long name). For our dishes we tried 2 ceviches (shrimp and salmon), brisket tacos, empanadas and pulled chicken dish.     

We had excellent service and excellent food! Thanks!!"}
{"text":"Went here last year with a friend. Mind you, we arrived early for our reservations, about 45 minutes early. This place was packed and they still seated us quickly. Given how busy they were the service was not slow at all. Our waiter was very attentive and nice, and explained the menu to us. This menu is basically a latin/asian/american fusion, and it is great. Very fresh seafood, and perfect portions. Mind you, if you are very hungry I may advise you to go somewhere else, as this is primarily a tapas place. I also had two drinks there, both of which were great. The ambiance was cool. They do have bands from time to time and salsa dancing apparently. The only knock for me is that the space is too small for the amount of people they are trying to accommodate. If they would take less reservations or get a bigger location, this would be 5 stars."}
{"text":"This place is incredible. The fire and ice Seviche is awesome and a must have. The tacos what can I say. Great seating and awesome views."}
{"text":"I'm not really sure how to write this review since my ratings in different categories are all over the place. First I will start out by saying the restaurant itself has a great layout with curb seating and two garage doors that let in fresh air from the outside. The art on the walls and overall design of the building is very catchy.

Food: I tried two different kinds of ceviche, The piquillo pepper and the ceviche of the day which was a honey crab with scallions. The crab was good, you could definitely state the sweetness of the honey but the pepper was rather bland. This one is more of the traditional ceviche and I ordered it with ahi tuna which is maybe why it wasn't so good but I've had some good ahi tuna in the past that had plenty of flavor. The menu said it came with avocado but when it arrived at my table there was none in the dish. I told the waitress who took my foo back and then informed me that avocado is not supposed to be in the dish. I showed her the menu and she said \"oh, it must be a typo.\" They were still kind enough to bring me a side of avocado slices but if that's a typo it was in my menu and my husbands. We then ordered that chorizo mac n cheese (good), The crispy tofu (better) and the chorizo and short rib tacos (best). The tacos by far had the most flavor and were definitely the best taco I've ever had. Full of flavor and spice! WE finished our rather large order with some chocolate cake that was rather too rich but very creamy. I'm not a big fan of chocolate so my husband ate most of it.

Drinks: When you check in here they give you one free sangria which was the white peach flavor even though there where pictures of the berry drink on the yelp app. When I received it the glass was only 3/4 of the way full. Again, from the pictures I had seen on yelp many customers glasses were filled to the top and my glass looked like someone took a sip out of it before they brought it to the table. The sangria was good, a subtle wine taste with some carbonation and fruitiness. I ended up ordering the strawberry cocktail which came with fresh strawberries and a mint leaves. Very decorative and very delicious too.

Service: As friendly as our waitress was she seemed a little in experienced to me. For starters when I ordered my sangria it took her 20 minutes to bring it to the table and that was after I had to ask her for it while my husband ordered his drink. She was very slow even though the place was only half full and I often had to look for her when I wanted something. The whole debacle with the avocado in my ceviche was blow because you obviously don't read then menu and know what should be in the customers food. Lastly, besides bringing taking our food orders and brining us drinks, she really didn't do much else. Other servers brought our dishes out for us to eat and once we finished eating we had to wait 10 minutes before she would come to our table. SLOWWW!!!

At the end of the day I would go back here for some tacos and maybe a cocktail or too, but I will be sitting bar side or getting my food to go."}
{"text":"Good food that's fresh and creative.  Fun atmosphere for a night out!  The drinks are amazing too!"}
{"text":"I'm not \"yelper\" but I have to write a review about how amazing the service was here last night! We came in before a concert, and the manager went out of her way to assist us with printing out our tickets to the show when we were in a crunch, and she was so sweet and nice about the whole thing! The bartender was wonderful as well, and so were the mojitos/food! We will definitely be back- it was such a good experience!"}
{"text":"Excellent drinks and a great place to salsa dance. We had a great time and it wasn't too busy to affect the dancing! Awesome place."}
{"text":"Second time going to Seviche. For the most part we ordered the same things again because they were just that good. Made a 5:30 reservation for Saturday night for a group of 4. I'm a big fan of the Caipirinha. I love the gritty bits of sugar in the drink and that it's sweet but not too sweet. My boyfriend and I split 3 things and each had a drink. The bill came out to be $50 which isn't bad at all for a nice dinner out. We ordered the Grass fed beef tacos, the Cuban roll, and Mussels. 
The Cuban roll is without a doubt my favorite thing! It is so good. It already has a soy based sauced and for $12 I could eat just that and be full. The tacos were very good. Three decent sized ones came out. I liked them but the Cuban roll blew them away. The mussels were delicious with a nice sauce and a crostini served on the side for dipping. 
Our waiter this time was nice and very efficient. I like that they make sure you know exactly how tapas style dining works. Our waiter the first time was my favorite. He was so smooth and easygoing he made us want to stay longer.
I'd strongly suggest trying to go during happy hour. They have it M-F normal hours and then later on Saturday from 9-11 I believe. A lot of cocktails (including the Caipirinha and mojitos are $5) as well as $5 select tapas. I believe they have specific ones on a happy hour menu, not just any tapas are 5 dollars.
I was happy to know that Seviche is a meal that we can have when we want to go somewhere nice that isn't going to break our piggy bank. The first time we added about $40 to our bill trying out all their cocktails so it is a lot more reasonable when you only have a drink or so. 

I love this place and highly recommend you try it!"}
{"text":"Came here on a Friday night for happy hour and pre-theater dinner around 5:30pm. At that hour, it was quite empty. It started to fill up closer to 6 and 6:30pm. The experience was pleasant and the food was just OK, but nothing memorable or something to come back to.  Their website's menu does not reflect their current selections, which was disappointing as I was looking forward to having their Asian-Latin inspired/fusion sushi. They decided to only keep 2 of the 4 most popular rolls - both nigiri style.  

For starters, I had a Sunset Margarita, which was really tasty. They are still promoting the free sangria if you check in on Yelp, but I was having technical difficulties and decided to give up on playing with my cell phone in front of my guest, and ordered the $5 happy hour margarita - glad I did. This drink was probably the best thing that I ordered. We also had the kiwi-pineapple salmon ceviche for starters, which I recommend as well. The ceviche was very flavorful... I liked the tartness of the pineapple and kiwi w/ the sweetness of the salmon ceviche. There was a nice balance of cilantro that wasn't too overpowering either. They served about 2-3oz of it, with a handful of corn tortilla chips. It was an appetizer for one person, but it can be sharable between two friendly and non-ravenous dinner companions :-) 

We later grazed on the salmon/tuna nigiri ($12 for 8 pieces), chicken quesadilla ($5), chicken soft taco ($5), and chorizo soft taco ($5). In the end, we split the bill and with tax and tip, we ended up paying $26 for the entire meal, which looking back, is a good deal for the amount of food we got. I would recommend everything that we ordered; it's all a nice balance between spicy, sweet, tangy, and savory. Little bites, big drinks, and a bright, colorful environment. The atmosphere is very loud, so it is difficult to hear your conversation if you don't sit close to each other. The interior decorations were kind of cheezy, and the music playing reminded me of some generic Latin-American pop party/Jennifer Lopez Pandora station. The TVs were all showing the Golf Channel. Weird. 

Don't think I will be visiting again unfortunately, just because I'm not a tapas/small plate kind of girl :-) And, as I walked down Penn Ave, I saw other restaurants that I wish I had gone to instead. However, the place was pretty packed by the time we left (around 7pm) so it does seem like a dahntown staple for Pittsburghers."}
{"text":"Always amazing service here as well as such an exquisite fusion of flavor. You can tell the staff here are all very passionate about what they do and how they make the atmosphere feel. Truly a TOP choice always for me in Pittsburgh."}
{"text":"I was not impressed. By anything. I will say that now I am more determined to make ceviche at home, which I'm sure will be better."}
{"text":"Tried this for the first time last night. It was pretty good, but one thing that really annoys me about any restaurant (see my review for Verde) is when the entire restaurant is filled up with reservations and they cannot even seat a walk-in for 2 people! And the restaurant is empty! Really?!

We had the Avocado and Corn Ceviche, the Mojo Criollo Nigiri, and the Avocado Estrato with Crab. All were delicious! The Mojo Criollo was my favorite. Everything tasted super fresh and flavorful. The servings were a good size (my date and I shared).

The wine was meh. You would think for a place that's like a tapas and wine bar, the wine would be better. I ordered the Frontera Sauvignon Blanc, which I often buy myself at the liquor store. No SLO wine? Hm. Lame. I hate paying $9 for a glass of wine at a restaurant I can easily buy myself for $10 at the liquor store. Seems more justified if it is at least a SLO bottle.

Service was good, and I had a nice time. I would come back."}
{"text":"A new, modern take on ceviche. I can definitely see this as a great place to go for happy hour as the Tapas menu and style of serving is fantastic. The atmosphere itself and location are amazing as well. For a group of 3 it was very convenient and easy to get a table (given that you make reservations of course).

I had the Fire and Ice ceviche with crab meat as the protein and everyone at the table agreed it was phenomenal. Great presentation and the right combination of spice and flavor. We also had the Smoked Peach and Kiwi and Grapefruit which were also fantastic but I didn't order them so I can't comment too much on them other than that!

For Tapas we ordered the Pork Empanadas (pulled pork, it was OK), Scallop Pil Pil (good) and Conch Fritters (great). We also split the Tartare duo (great), Dos Tacos (beef cheek and octopus... fantastic) and Chips and Salsa (Guac was great).

This rating is about 4 ish stars as there were some mishaps. The service started off well with our orders and food coming out promptly. As the service went on, we noticed it taking a lot longer. We had ordered Cuban Fried Shrimp which didn't come out until we asked several times (re: 35+minutes) for the small plate. This was after putting in an order for the Scallop which we received before getting the Fried Shrimp. We assumed they went out and caught the shrimp which took so long (they did taste very good though and I would recommend getting them). We also ordered Beef Arepas which we had never gotten. Unfortunate circumstances for what was an overall great dining experience. I wouldn't let that stop me from going there again though."}
{"text":"Very good! Like their tapas and their maragaritas were top notch."}
{"text":"I was craving seafood and something different.  I had passed Seviche several times and it was always crowded, but I assumed it was more of a bar/tapas place.  Was solo, so I ate at the bar.  The service was fantastic and the place had great atmosphere.  More important, the food was not only filling but fantastic.  I had a tuna seviche and the tempura shrimp, which was exactly what I was in the mood for.  Good drinks as well and not over the top pricey.  Only downside was the serviche came out  after the entree, which is probably a half star deduction."}
{"text":"Okay, totally loved it here & would visit again!! Food was great, especially the Fire & Ice, seviche roll,& pork empanadas! Only thing though was no olives in my dirty martini. But i mean, I got over that relatively quick."}
{"text":"Very good meal at an affordable price. The reason that I didn't give 5 stars was that the food was a bit salty for my tastes. Lots of options on the menu and great prices for Happy Hour. I would recommend as a perfect date night or grab a bite bed a show."}
{"text":"I came here during their reversed happy hour (10pm-12am).  I ordered a mango mojito and a chorizo wrapped scallop.  Each of the items were $5 each. They were so good my friends and I mentioned it both the next day.

If I lived in Pittsburgh, this would be one of my regular spots to hang out and have a drink."}
{"text":"Our first time here and we weren't really sure what to expect... Tony (out waiter) did a great job of explaining the menu and offered excellent recommendations. Next time we are in Pittsburgh, we will be sure to return!"}
{"text":"Came here Saturday night while in town for church, a.k.a. Hot Mass. Drawn by Latin cuisine and a free sangria upon check-in from the Yelp app, we walked in and, seeing no host, no host stand, and no sign saying \"please wait to be seated\", made our way to a table in the back. A server approached and asked if someone sat us. I said \"no, ...\" along with all the stuff I just typed out in the preceding sentence. He said no problem, but went to retrieve menus for us.Upon his return, he waited patiently while we obtained and presented our check-in offers. 

My compadre had never had ceviche, the national dish of many a Latin American country, and perhaps the honorary dish of South America as a whole. Seviche offered a handful of interpretations available with a modest selection of different seafood options, from standards like tuna and salmon, to cobia, and yellowtail. We ordered the fire + ice and the beet + orange with tuna and yellowtail. 

Before the ceviche even arrived, we were talked into some empanadas and pan con chihuahua. When the ceviche did arrive, we dove right in. The fire and ice ceviche is served as six shooters, so we toasted our trip and downed the first of three. It was delicious. Really satisfying. Being the signature dish, it was going to be hard to match, and the beet and orange was great in its own right, but definitely didn't surpass the first. 

Not soon after, the tapas made their way to the table. I opted to try the pan first, while my travel companion sampled the empanada. The pan con chihuahua ended up being my favorite dish of the night. the pork belly and pepper puree were exquisite, and the cheese didn't hurt either. I wished I had one or two more, but settled on my empanada instead. Having ran out of pork empanadas earlier in the night, the kitchen was serving up a chicken empanada instead. I was not disappointed, but do wish I had saved that pork belly for last. Now I know better for next time."}
{"text":"My favorite restaurant in Pittsburgh... I can't come to this city without stopping here! Worth every dollar. Tonight I has the tuna tartare and it was perfect as usual, and I had two tacos which were amazing. Also, the service is impeccable, always service with a smile. My waiter's name was Tony and I had him last time as well, he loves his job and it shows, he's very knowledgeable of the menu and willing to help with a suggestion. Awesome experience again!"}
{"text":"I'd been to Seviche a couple times before and enjoyed it, so when it came to planning my birthday dinner, I decided to try Seviche. Seviche was incredibly helpful as the dinner was being planned, even as there were changes in our group size (from 20 to 35 to 28) as close as the day of!

When we got there, they did an amazing job keeping separate tabs for the large group, and the food was fast and yummy.

Not only that but my siblings (who don't live here) surprised me with a bottle of wine and a dessert by calling ahead of time, and Seviche's manager kindly took care of all of this and executed it really well.

Great birthday dinner, and a fantastic experience with Seviche.  Thank you :)"}
{"text":"We stopped in for pre-theater dinner and LOVED it. Attentive, friendly and knowledgeable servers, excellent mojitos and wonderful food, we ordered 5 small dishes and everyone was awesome. Goat cheese croquettas, tuna sliders, vegetarian  tostadas all yummy. We will haventomgonto the theater more often so we can come back! Totally worth a drive from the south hills"}
{"text":"Fun place for drinks and appetizers after work. Food above average and yummy cocktails. Servers are all fun, nice chicks. 
Overall good place:)"}
{"text":"Terrible service. They are rude and condescending late at night because they want to close up shop. The tapas are expensive, but taste terrible!! Not worth the money! Don't go here!!!"}
{"text":"Last night, I had one of the best meals I've had in Pittsburgh in a long time. 

I started with the Beef Cheek Empanada, which I could have eaten a entire dinner of, and a (free by checking in on Yelp) glass of sangria. Since it was happy hour, I chose two tacos for dinner: the Baja Fish (with mahi mahi) and the BLT. The Baja Fish was as delicious as any authentic fish taco I've had in Mexico or Baja; and, the BLT (pork belly and pickled cherry tomatoes is my new favorite combo) was the perfect flavor profile of savory, salty, sour, and sweet. And, based on my mom's satisfaction with her choices as well, it seems Seviche is good at everything they do in the kitchen!

Our waiter Tony was incredible - friendly, attentive, and knowledgeable about both the menu and the owner's other restaurants, which I now intend to try. Even with a completely packed bar and full indoor/outdoor table (impressive for a Tuesday), we did not wait for additional drinks and the timing of our plates coming out was impressive. 

I am an immediate fan of Seviche and will absolutely be back to eat and drink my way through the rest of the menu!"}
{"text":"This place is very classy, with unique interior design and lighting. The venue is medium sized with a bar. I got the octopus tacos and my friend got an octopus taco and a beef cheek taco. We both agreed the food was very flavorful and filling. We didn't have room for dessert! If you're looking for something unique and different, this is a good place to try. The waiter was very helpful with the menu since this was our first time. Plus, we got a free, delicious sangria because we checked in on yelp! This place isn't for vegetarians however they do have a veggie taco."}
{"text":"Made it in time for happy hour! Yay! $5 margaritas were excellent. The pan con chihuahua (basically a small sandwich roll with cheese and cabbage inside) as well as the bean with egg dip were both amazing!  Ask for extra chips to finish the bean dip. The egg was surprisingly good in the dip. We had tofu tacos and mojo nagiri sushi as our main entrees and both were good. Nothing special, but the appetizers were above average. 

The waitress was very nice and explained each happy hour item and offered suggestions for what she liked. She was on point with the drink refills and ready for us to place the apps and main meal separately. Overall, the staff all worked together and various people would bring your food and provide extra chips if they noticed you were low. Everyone was very friendly and genuinely cared that you were satisfied with everything. 

The free sangria du jour with Yelp check-in was a plus. The drink we got - margaritas, mojito & sangria were excellent. I would recommend making a reservation if ur party is more than 2; most people did. There was just 2 of us so we only had to wait a few minutes around happy hour on a Friday. 

 Very cool atmosphere with cool old school Cuban pictures on the wall. I would go back again."}
{"text":"We stopped by on a recent week day evening for a little prelude to our holiday visit to Phipps.  The interior design is fairly bright and vibrant with interesting art behind the bar.  

We were greeted by our server Tony.  He was our guide to the menu and helped us with our selections.  I took advantage of the Yelp check in sangria.  Delicious.  BJ had a Sierra Nevada Pale Ale.  We started off our food fest with trio of chips and salsa of the day, which turned out to be an excellent starter.  We both loved the corn salsa.  The chips were plantain, taro root and tortilla.  My favorite was the plantain, BJ loved the taro root.

Since we were there during happy hour, we took advantage of a couple menu items.  We got a chicken quesadilla and the shrimp seviche.  Both were very good.  For our meals, I got the orange fennel salad with shrimp.  It was amazing.  BJ got the paella mariscos.  We got thought everything tasted very fresh.

For dessert, we had to try the rum cake.  I loved the crunchy whipped creme and the bruléed pineapple.  I thought that the cake was perfect.  Can't wait to try this restaurant, again!"}
{"text":"Went with my boyfriend for dinner and we sat at the bar on the right when you walk in. We had a couple different types of seviche and they were all delicious. I highly recommend!  Also has the BEST Cuban in the city. They use actual yellow mustard, haha. It is taco style rather than on bread, but could still eat five of these! Sushi was a little disappointing because of the rice-the texture was mushy, but you could tell the fish was high quality and fresh. Service was great. It was also salsa dance night which was fun and entertaining to watch. We will definitely be back!"}
{"text":"Cool room.  Lots of positive energy.  Great teamwork among servers to include the hostess who routinely checks on tables.  Fire and Ice Ceviche was the most famed flavor.  Try their Pisco Sour.  Closest to my experience in Peru and Argentina I've had in the states."}
{"text":"Wow, cougar city!  This must be where all divorcees end up going to find their next husbands."}
{"text":"We came just as the kitchen was closing so this review is only about the drinks.  The boys all had beers so I can't comment - not to mention its not like the place made the beers so you can't judge them for it.  They had a good offering of it though and I found that the servers at the beginning were attentive.  

I checked into yelp and it offered me a free Sangria of the Day...so I thought, why not?  I told the server and I got the sangria.  I'm a lightweight so I knew this would probably be my only drink.  As I mentioned I'm a lightweight... but when I feel like I got some fruity water served to me... you gotta know I am not exaggerating.  Granted, it was tasty fruity water, but really?  This is what you guys serve up?  OR was it served up this way because it was free?   

Seemed the people who were finishing their meals were enjoying themselves and I really thought the place was trendy and had a cool vibe.  However, a few more drinks were had by my hubby and cousin and the servers were really hard to find when we tried to order more drinks.  Based on that I'd say.... not the best.  I go back to Pittsburgh every so often so maybe we'll go back. Though with the increase in new restaurants downtown...there are so many more places to try... not sure we'll be back."}
{"text":"Seviche is great! After attempting reservations at two other places Seviche was one that was willing to take us earlier than 10pm so made a reservation for 8pm on Saturday. We tried to arrive a little early to grab some drinks but they had a high top table available for us in the back of the restaurant. We initially thought it was great since it was quieter than the front but after a few minutes Seviche turned up the music - while great music the volume was a con as I remember shouting during part of our conversation, which makes me laugh now. Our waitress who had a trainee along with her was hands down awesome. I thought I could be friends with her by the end of the night. I ordered the Broadbent Vinho Verde wine which was good (had a little carbonation and you could taste the grapes) so had a second. As for food, we had the fire and ice ceviche, asian tartare, tres quesos, corn and goat cheese croquettas, beef tacos and the fried donut dessert. I thought all were good and it was nice how the dishes were communal, enhancing the eating social experience. I'm not sure if I would come here if I were starving though given how many dishes we had to fill us up. However Seviche had such a fun vibe that I will definitely be back."}
{"text":"Food is ok.
Loved the atmosphere and live jazz music.
Very friendly and helpful staff."}
{"text":"I dined here with two of my friends on a Friday night.   We had made reservations for 5:30 so that we could take advantage of the happy hour specials ($5 margaritas and $4 glasses of wine sounded VERY appealing to me).  We ordered the pan con chihuahua and yaki onigiri as starters.  Both were only $5 during happy hour.  I enjoyed both of the tapas, but my friend really disliked the yaki onigiri; I think that the smoked shrimp mousse has a different taste that people either really like or dislike.  I ordered the fish taco and veggie taco as my entree.  The fish taco was excellent, but the veggie taco was just okay.  The flavors were there, but I couldn't even chew the mushrooms because they were so over cooked (important to note: I just picked them off and still managed to enjoy the rest of the taco).  The service was excellent, and the decor was very energetic.  I would definitely go again, but I would highly recommend making reservations, especially in the cold months of the year when they do not have additional outdoor seating.  Space is pretty limited."}
{"text":"I am from the burgh but recently move out of town. I have been to this place numerous times, but recently it has gone downhill IMO.  I took my Hispanic friend there two times and he actually told me to never take him there again. We went on a Saturday night in Sept and there was nothing going on..... The manager was bartending and was kind enough to introduce herself.  However, they were blasting obnoxious hard core vulgar RAP music the entire time. They were out of about 6 menu items and the $10 cocktail was very weak. If I'm going to pay top prices for food and drink (which I have no problem doing) I kind of expect a nicer atmosphere, an atmosphere they they supposedly try to project... to me, it was no surprise that there were many empty seats and just about as many patrons as there were employees that night. We will not be returning. I was actually embarrassed to have taken him there.    Overrated and over priced for what you get ?  Yes. 
Latin themed ?  Not."}
{"text":"We tried the happy hour specials. Free glass of sangria if you check-in on Yelp. Ordered the salmon, shrimp and pineapple ceviche: okay, a little bland. Tried the fried sushi rice balls with shrimp; meh. Had a chorizo pan which we didn't finish, but continued to re-live for the rest of the evening. Had a mojito and then a second one. These were definitely the highlight of the experience. Before leaving we ordered a non-happy hour, traditional hamachi ceviche. This was the best dish we had. Even though we concentrated on the happy hour drinks and bites, still a little pricey for what we got. Super-friendly bartenders. Probably wouldn't return if we were ever in Pittsburgh again (which also probably won't happen!)."}
{"text":"Their ceviche, mixed drinks, and tapas are superb, and the service we got was even better.  Amazing service :-)   Servers Cory and Christina are the shit, and GM Jeff went above and beyond to be a great host.  Am coming back for my birthday shindig Saturday night.  Thx for a wonderful night tonight, guys!"}
{"text":"I had 9:00pm reservations for 6 on a Saturday evening. I made the reservations earlier that evening, so this isn't the type of place that's booked weeks in advance. We were sat down as soon as we arrived. 

I would say business casual attire is fine. The decor is a little confusing. Kind of a jazzy/Caribbean/diner vibe. 

Make sure to check-in on Yelp to receive your free sangria! 

My girlfriend and I experimented with the menu. If you're not familiar with tapas, the portions are what I call \"sample size.\" However, they are packed with flavor and are reasonably priced. My girlfriend and I had 4 plates plus dessert and 3 drinks and our total was $68. Not bad!

My favorite dishes in order:
Pork empanadas - the pork was juicy and had incredible flavor, the herb pesto complimented the pork very well
Beef arepa - so much flavor from the beef and all the vegetables
Ahi tuna seviche (fire and ice) - served in \"shooter\" dishes. Refreshing 
Chilaquiles verdes - this was a larger plate. Pretty much a black bean salsa with chips and an egg. This one is filling if that's your end goal

The atmosphere could use some improvement, but with the small plate experience and excellent flavors combined with the reasonable prices I would eat here again. Kudos to the chefs."}
{"text":"The food is to die for.  I don't make it down very often because it is pretty pricey, but the food is absolutely amazing every time I go.  Definitely a unique restaurant with incredible flavors."}
{"text":"Love the free sangria with check in!!  Went with 5 work colleagues on a business trip- we each ordered different things from tapas to entrees and everyone seemed satisfied with their food.  My halibut was a bIt dry, but was paired with a tasty smoky hash-like mix of diced potatoes and pork belly or bacon that made the dish sing.  Service was slow at the end but understandable given that the waitress gave us individual bills- yeah!!"}
{"text":"This is my favorite place in Pittsburgh for a fantastic mojito and delicious tapas. There is always friendly and helpful service if you are need help picking something to eat (because with all good options it gets tough). The Cuban roll is out of this world delicious! Also, great happy hour options. Cheers!"}
{"text":"This place should be called Tacos, because they were on point. I don't even like flour tortillas but I couldn't stop eating them! The chips and salsas/dips was great as well. The ceviche was good but not traditional ceviche that I was expecting. Its more of a fusion food thing, good but was really nothing compared to those delicious tacos. The music was amazing they played nearly all of my favorites, it would have been great if there was room to dance. I'll be back again for more tacos and dancing on a Monday night."}
{"text":"Came here during a trip to Pittsburgh. We got there at 4:45 on Saturday and they were already booked! Luckily we found the last 2 seats at the bar. I'm not sure if they're usually this busy, but the Jazz festival was also going on outside. Surprisingly, they had a happy hour going on at this time too. I had a strawberry mojito and the strawberry margs for only $5 each! 

For food, we ordered the ahi tuna kumquat seviche, chips and salsa/guac, chorizopan, and an order of tacos (beef and octopus). The ahi tuna was really good, the kumquat seems weird but it actually went really well with the rest of the dish. I wish it came with won ton chips instead of tortillas. The chips and salsa were okay, the guacamole was the best part. The chorizopan I wasn't expecting to be in sandwich form. It was really good but kind of salty. Lastly, the tacos were SO GOOD. The beef was good but I really wish I would've ordered all octopus instead! There was so much flavor and the octopus had a good texture, not chewy at all. If I'm ever back in Pittsburgh I'd definitely come back here!"}
{"text":"This is a wonderful open air restaurant with a colorful and entertaining staff.  The ceviche is beyond amazing.  I asked for the spiciest drink on the menu.  She brought a jalapeño fruit drink that was incredible.   The giant scallop on polenta is delightful.  You can order lots of small plates or a large entree.   This is an excellent place for Peruvian fusion food."}
{"text":"Seviche has recently become one of my favorite happy hour spots downtown. I've never had trouble getting a table or spots at the bar, so it's a good option for spontaneous drinks/bites with some coworkers.

Happy hour runs from 4-6 and features specials on certain wines and cocktails for $5, as well as some $5 tapas. I believe there is a selection of discounted beers as well.

We usually order a few of the tapas to share, and I have loved pretty much everything I have tried. I have had several of the seviche options which have been full of flavor and tasted extremely fresh. From the regular menu I have also had the tuna tartare (it's a delicious combination with capers, onion, and a wasabi aioli) as well as the Jimmy Roll (tempura fried nori, crab, avocado, cucumber, and a spicy aioli--also very tasty and fresh).

Everyone has always been prompt and attentive as well, which rounds out the experience. Hopefully I'll be back soon for dinner."}
{"text":"Hopefully some day I can update this review if and when I make it back to Pittsburg! We came here really excited about trying the food but whoever is in charge of ordering the food needs to rethink their career!

They were out of many of their main ingredients! Ahi Tuna, fish of the day, octopus and yes empanadas. 

Very disappointing!"}
{"text":"First time at Seviche, we ordered 5 different plates and it was all really good.  My favorite would have to be the Crab Fire & Ice.  Decor is not my favorite but food and service is a 5 of 5"}
{"text":"Good food and open late.   Had the triple ceviche - traditional preparation with conch, the agave hamache and tiradito salmon (this one had a kick).

Also got the Chorizo wrapped scallops and those were excellent.  From the roasted corn polenta, wilted spinach, the sweet bbq glaze on the scallops and the freshly grated pepper to provide a kick.... everything in this dish was great.

You can also get many of their drinks non-alcoholic.  The mango mohito was pretty good --- nothing outrageously different -- but still good for $5

Service was friendly, they had a live singer / band on a Thursday night"}
{"text":"The tapas and small plate choices are great. Yummy cocktails. Pretty decor and great music. Nice place to stop for after work Happy Hour in the summer."}
{"text":"This is a great place to go downtown for happy hour, dinner or a night out.  The food is served tapa's style so you're able to try an assortment of dishes.  The best drink by far is called a Caipirinha.  It's Brazil's version of a Margarita.  Try to say that three times fast!  

The environment inside can only be described by on word, colorful!  They also have outdoor seating in the summer, so you can get your people watching on!  It's a great way to kick back after a long day!  Just remember if you are going there for some appetizers or dinner your bill can run up quickly!  I did that once and probably spent a weeks worth of grocery money in one night!  Was it smart, no.  Was it worth it, yes!"}
{"text":"Just walked in on a late Wednesday evening, following the advice of the concierge at our hotel. THIS PLACE AND THE FOOD ARE AWESOME. Chef Mike prepares Seviche like you never had before. The Tuna Tartar is a must have, as is the Fire and Ice Seviche, it just exploded in my mouth. However, the biggest reward is in letting Mike just put \"something\" in front of you. His creativity will amaze you and leave your taste buds baffled and yearning for more. And being Dutch, I have to mention that the food is also more than affordable, something that is increasingly rare when eating quality seafood dishes. Make sure you get seat at the chef's table!"}
{"text":"Seviche is typically a Latin American dish incorporating lime / lemon juice, chopped or minced seafood and tomato, onion, or cilantro (coriander). Seviche is not a typical cevicheria. It's a fusion of Latin, primarily cuban and Japanese sushi cuisine. 

 Amazing happy hour specials when I was here last September for a convention. Loved it so much I came in 2x in a 4 day stay.  Their tuna tartare w/ lotus root chip made quite a palate impression, slighlty spicy and savory but not to the point of overpowering the tuna, which would have been a shame as so fresh and flavorful.

I have to gush about their mojito, why? Simple: because it's the  best mojito ever! I am a mojito fan, I've had them in 3 countries and 5 states. Seviche's takes the cake, er, mint.  


+++ for ambience, crowd, and service."}
{"text":"Had the fire and ice app-- absolutely awesome.  Had the right amount of heat that doesn't cover the taste.
Had the Carne Asada for dinner and if I wasn't sitting outside I would have kicked the plate.
Service was extraordinary.  Really."}
{"text":"It was delicious, but they were out of about 4 things that I tried to order!  That just means it's fresh, so I wasn't upset (it was a little late for dinner also).  The scallops were amazing, by far the best dish, and the polenta was.... wow.  Best polenta I've ever had (and I like polenta)."}
{"text":"Very cool atmosphere. Had drinks and finger food on their outdoor tables and everything was great."}
{"text":"I miss the 80's, Miami Vice, etc.  Seviche reminds me very much of miami vice, don johnson, crocket...   I've been to seviche several times and it's a good spot if it's not too crowded.  It's usually either my first stop or one of my last stops  if I'm staying at the Westin and walking.  Last night it was my 3rd stop out of about a dozen stops and our server was so nice KATE I thought I'd write a review just to give her some props'.  I was there around 8 PM last night and we were able to quickly find a table even though it was relatively crowded.  I'd say the crowd for the most part is a little older than some of the other bars that I frequent, but friendly all the same.  It's going for the south beach theme and it accomplishes this with its high ceilings and art deco interior.  Bright lights big windows high top tables a few couches and a large bar with another sushi type bar.  The bathrooms are nice and overall the space is very warm if a little bit cheesy.  The service is usually good when I frequent here, but last night it was stellar.  Kate gave us great tips all night long and guided a very nice dining experience.  I had very deliciousl ketel one rocks dirty's most of the night and my friend had delicious mojitos'.  These mojitos are good, but for some reason I just love the ones at Dish.  We had so many small plates, I'm sure I'll forget a few.  We started with an amazing blue point oyster \"fire and ice\" which were fresh and delicious.  The preperation is spicy with habernaro peppers red onion and a prickly pear ice topping. It really is there signature dish and I recommend you get the fire and ice preparation when you come.  It's spicy and cool with delicious fresh seafood.  We followed this up with the crab and scallop, same fire and ice preparation.  This dish is light and flavorful and melds well with a stiff cocktail.  We also tried the tuna ginger tataki, which is quick seared #1 grade ahi served with ginger fennel and some type of mayo, I'd say spiced with wasabi.  It was also quite good.  We also tried the mussels which started good, fresh and plump, but then had a few that had not so much of a fresh flavor.  Overall it was a miss.  Go to Pointe Brugge for your mussels.  We may have had another dish, but can't quite recall.  Overall this is a good spot in the cultural district for an urban theme, stiff drinks, and light fresh food."}
{"text":"Absolutely loved! My boyfriend and I shared tuna tartare and ceviche for appetizers. We polished them off. We both ordered tacos. I got 2, he got 3. They were amazing! He also got a mojito. He said it was good. Only drawbacks are we had to wait about 30 minutes to get a table (it's a small establishment), it was very loud and the table we got was by the window and cold air was getting through. Prices were reasonable and food was absolutely delicious. I asked my boyfriend if we could go back in a couple weeks. Definitely plan on being regulars here. I recommend this great restaurant!"}
{"text":"I had a great time at this resturant on Pittsburgh light up night thanks to the excellent service I received. The decor is bright and colorful and the open kitchen is a real show. The food for the most part was really good. The problem was the items that were good were really good and bursting with flavor but they really over shadowed items that were less flavorful.  We made the mistake of ordering some  of the \"light up night special tapas\" that were put to shame by the rest of the meal. I was in a group of 4 at happy hour which allowed us to try many different tapas. 

We had 2 preparations of sushi,  the traditional preparation with shrimp was fantastic and fresh tasting while the avocado with corn prep paired with salmon was good but not as good as traditional.

We also had the beef brisket tacos and the salmon tacos, the beef tacos were very good with flavorful tender beef  but the salmon tacos which were a \"Light Up Nite special\" were not very flavorful at all and the fish, while cooked well was not seasoned at all. It was basically a small piece of fish on a tortilla.

We tried the Chicken quesadillas and Vegatarian tostada both very good with creamy melted the cheese and a great cre'me fraiche. 

The Cuban sushi roll was amazing the meld of perfectly coordinated flavors  made this my favorite dish of the night and I highly recommend it. 

I was conflicted by the Nicaraguan wings. The chicken was cooked perfectly but the sweet smoky almost charred flavor was a bit off this was not helped by the almost flavorless jicama ranch which accompanies them. I wouldn't get them agian.

The Corn and goat cheese croquettas were perfect creamy, crunchy, and delicious. The dab of herb coulis that adorns theses was the best sauce of the night. I wished I had a bowl of it for dipping. My only critique is I would have l loved more of  them.

However the Crab cakes, also a light up night special, are hardly worth writing about. Don't get them I'm glad they are not on the regular menu.

The free sangria came in handy with such an expensive meal but the mojitos were the star.

I will be coming back and I make it my goal to try the whole menu."}
{"text":"Popped in last night after a show with a friend to grab a quick bite and beverage. Contemporary atmosphere and more crowded for a Wednesday evening than I expected! 
We sat at the bar and were immediately greeted by the bartender. Service was very timely throughout our stay. 
I ordered the Asian Tuna Tartare upon the waitress's recommendation. It was delightful! A great mix of textures and flavors. 
A bit overpriced, I'd say, but it is downtown, so to be expected."}
{"text":"ATMOSPHERE: 5/5
The first word that came to mind when I walked into the place was \"groovy\". The neon lighting wrapping around the curved back walls, Cuban artwork that literally pops out of the canvas, brightly colored shelves holding Cuban themed sculptures, and funky shades of green, blue, orange, and red covering the place, all add up to make a lovely change of scenery from all the other restaurants of its caliber in the area.

LIBATIONS: 4/5
I had their pisco sour which was just as I've come to expect out of the drink from having it at many other bars. My friend ordered a Caiprinha (the only Pittsburgh restaurant I've seen so far with those on the menu) and it was a perfect rendition of the classic latin cocktail.
Overall I give them a 5/5 for the solid sour and for making true Caiprinhas, but will subtract one star for having the unoriginal, dull drink selection.

FOOD: 5/5
I ordered 3 tacos: the tempura fish, the huevos rancheros, and the BLT. They came out in my favorite little serving trays for tacos, the metal \"W\" holders that keep them in a perfect taco form. I started with the tempura fish which tasted like a great roll of sushi in a taco shell - the peanut aioli was a great touch too. The BLT was just good - nothing exciting but a good taco nonetheless. I finished with the phenomenal huevos rancheros. I'm a sucker for anything with egg in it, and especially this taco. The maple hot sauce was a perfect balance of hot and sweet which combined with the egg's texture and cheese flavor made for one hell of a taco (I'm getting hungry just remembering the taste).

Would definitely recommend Seviche if you're in the area and looking for a change of pace from the usual restaurants."}
{"text":"My wife and I have been here numerous times and love it every time. We love coming for happy hour and ordering almost everything on the happy hour menu. Almost everything we get here is packed with tons of flavor. Some of our favorite items are the tuna tartare, fire and ice, and the BLT taco. Drink wise, I loved the caipirinha the last time we were here. And its only $5 during happy hour!"}
{"text":"My husband and I went here for a date-night on a Saturday evening. We had reservations, but the place wasn't even busy. There was a DJ playing music very loudly......we could hear it from down the street. At times we basically had to shout at each other during dinner. 

It was nice that we arrived during happy hour to get the half-priced tapas and drinks. The Pan Con Chihuahuas were excellent. I also enjoyed the pork empanadas (my husband not so much since it was a fried dish). We were disappointed that they were out of tres leches? cake for dessert. Nothing else on the dessert menu looked good. Our server did a good job, but at times it was difficult to find her when needed. Overall, I think they would benefit from a larger menu.....the options were very limited. Also the tables are very close together, making it a less than comfortable date night. 

We will probably go back at some point, but I really hope that management takes steps to make improvements."}
{"text":"Thank you to our waiter and this amazing food.  Our waiter was super nice, the tacos here are so good, and the ceviche was so fresh. There literally was nothing I could say about this place that could be wrong expect maybe parking is hard to find.  I'd give it a full 5 stars but I didn't try the other entrees so I can not speak for everything.  But if the entrees are as good as the other items I did try then this place will be give a five next time."}
{"text":"The good:

The location and ambiance are festive. I enjoyed the wall art and layout of the restaurant. There is ample bar seating and a variety of table sizes. The menu has a good bit of variety. The Yelp check-in offer, free sangria, was great. The fire and ice seviche and jerk kiwi seviche were good.


The bad:

As other recent reviews mention, service was slow at times. Our seviche order was quick but our small (six) taco order took around 30 minutes. The seviche portions are a little small. The tacos had stale shells and quality not really worth the three tacos for $16 pricing.

The verdict:

Has promise, however, based on my experience, there are better options out there for the price."}
{"text":"Disappointing. Extra small portions, out of four items on a small menu and a unfriendly tatted up server. Sorry yelp you let me down this time! Ok the tacos redeemed the meal. Moving up to the stars."}
{"text":"Eh! Two things, no maybe 3. One if your restaurant is focused on Ceviche have the traditional on the menu for the purists. Two, don't have a Fish du Jour and the waiter tells you it is smoked scallops. Yes, it is seafood but it is not fish. 3, how can there not be a salad on the menu? Yes, the Seviche play on the word was tasty. Would I return, probably not."}
