{"text":"We had four dishes: Cold-sliced pork roll with cucumber and garlic sauce dip, Boiled spicy fish fillet, Xian Cured Pork in Bread, Pita bread soaked in lamb soup. Actually the fourth one is not what we ordered but the waiter placed a wrong order and refused to change...  Dishes are not terrific but generally fine. I personally like the cold-sliced port roll although the garlic flavor has been with my mouth for the entire afternoon. We spent around $25 per person."}
{"text":"Great lunch specials and cumin beef pancake sandwich is great or super dry. It suffers from inconsistency so you'll either have a superb meal or a pedestrian meal"}
{"text":"Very disappointed the waitress was very unfriendly and she only knew very little English. The meat that was served was straight up fat and didn't give back our refunds. It took 2 hrs just to get a plate of fried rice out."}
{"text":"Shaanxi Legend is a very cool looking place located on the Scarborough/Markham border just north of Finch. It was a tad difficult to find as the GPS doesnt take you to the plaza just north of Finch but to the plaza right at Finch. However once I found this place it was a real treat.   Expertly decorated insider with a large story telling mural on one of the walls. A fake \"upstairs\" area makes this place look big enough to be a 2 story restaurant.   This review is a few weeks late to be relevant, but given the amount of food we consumed here this evening a few weeks ago, it's likely taken me about this long to digest and comprehend everything we ate here. We were here for some sort of Mid Autum feast (similar to Thankgiving as I understand) but we ate something I believe was called a Wedding Feast which was comprised of 8...EIGHT....ya 8 courses! Non of which were small and each one was more filling than the next.   Rather than write a novel as is my norm I'm going to run through the courses and give some details and my thoughts on each one, In no particular order:  1. Steam Deep Fried Chicken - Really enjoyed this dish, I called this Chinese KFC Chicken bites as it was a large plate of bite sized deep fried chicken that came with some great sauces to dip in. BEWARE OF TINY BONES!  2. Fried Sliver of Pork - This was served as an appetizer and was the first course we received. I really enjoyed the cured pork (similar to a ham or porsciutto) with all the fixings it came with. Presentation of this was amazing too came on a mini table sized rack where all the pork was hung from the main bar.  3. Fermented Glutinous Rice with Fried Pork - I have trouble remembering this dish, I seem to recall a Rice dish with some pork infused into it that was no bad. Didn't stand out in my mind to be honest but I know my dinner mates enjoyed it.  4. Dates Pork with Rice - Eww...did not like this one bit. The name says it all, dates and pork with rice served almost like a sushi roll. I actually gagged a little when having this. I hate dates.....*shudders*  5. Sweet Rice Cake - these were pretty good  - forgettable.  6. Crab and Pork Big Ball - Loved this dish, it was a large container of what essentially was giant meat balls. I would have eaten just this for dinner. ABout the size of softballs!!  7. Hometown Fish - One of the first dishes we got, I was kinda skeptical about this as there was a FULL FISH floating essentially in our stewlike bowl. I know it was for eating but sometimes when my food is starring at me in the eye it \"fishes\" me out! The stew itself was really tasty and I loved the noodles and seaweed! BEWARE OF FISH BONES!!  8. Steamed Pork Elbow - My second favorite meal of the night, tender pork elbow served with bok choi, tear as much or as little as you want....beautifully seasoned. YUM!!!  Overall a really fun experience, I had never had Northern Chinese cuisine and I really enjoyed the overall infusion of spice into many of their dishes  16/30"}
{"text":"Came here out of randomness because Ramen King was super packed that day and it was super cold outside -40! So my party just barged into the next nearest restaurant in that plaza.  First impression, the restaurant decor was awesome. They had a high ceiling and the top was made to look like there's a second floor. It was very asian yet authentic.  I haven't tried Shaanxi food before as it's more of a Northern province. Hence, I wasn't sure what to expect but based on my knowledge, their culture usually enjoys food that are relatively dry and ain't saucy. Turns out I was right haha - we ordered the cold-sliced pork roll. It was sliced thinly but if you were not to dip it in their garlic sauce, it would taste bland.  Flipside, their mixed veggie pot was pretty good. I didn't expect it to be served in a simmering pot either. There were many types of vegetables cooked together including bok choi, chinese lettuce, glass noodle-like food, etc. We also tried their famous tea smoked duck, a traditional Northern type of dish. However, if you don't like meat on the dry side.. don't order this! Remember, it's their food culture.  Other typical dishes such as their pan fried dumplings and steamed pork dumplings were not bad. But one dish I didn't enjoy was their five-seasoned beef noodles. The noodles were decent but the stewed beef was really tough to chew on. Even though the soup base was flavorful, the meat couldn't compensate its overall taste.  Service was actually fine but the waitress' skills was not at par. She served us the mixed veggie pot and spilled a large amount of the sauce on the table. Then she came back only 5 minutes later to wipe it off. And for the pork roll, the rack was actually falling apart. She kept trying to mend and put it back on the spot.  We literally didn't want to move anything on the lazy susan to avoid any spills or wreckage haha. Nevertheless, her attitude was perfectly fine. The owner of the restaurant also came by to give us some food recommendations thinking none of us can read Chinese (which I totally can). It was nice of him though:)  Overall personal opinion: I'm not too fond of Shaanxi food in general because of it's dryness, so I always prefer food with sauce and flavour. Given the amount of food choices around Scarborough, I don't think I'll come back unless someone enjoys these dishes."}
{"text":"Nice small Chinese restaurant with some traditional Chinese foods. Been there couple of times,nice foods and good service,definitely above the average.  I like to recommend boiled spicy fish,nice."}
{"text":"I grew up eating more southern Chinese food, and my only encounter with northern chinese food is relatively limited to that of my grandma's dumplings and jajang mien. As a result I was quite interested in going to this restaurant to uncover some northern Chinese foods that I haven't tried. One of the dishes that stuck out to me here had smoked pork in it (don't remember what it was called), and it was actually really delicious with a really nice strong smoked taste to it. However, it is really heavy on seasoning, and quite spicy for me personally (I'm a lightweight in spice), so the waitress recommended this white bread thing that we used to make a sandwich out of the smoked pork dish. The result was awesomeness. Overall, I think this restaurant deserves a 3.5, however I would like to be more generous to support new restaurants that present cuisine that isn't quite typical in the area. Though Northern Chinese food is present in scarborough, Shaanxi food in particular is relatively new, or at least from my knowledge anyways."}
{"text":"Shaanxi Legend specializes in north eastern chinese cuisine. we had gone to this place in a group of 4. The restaurant was pretty empty this night on a saturday, partly because the heater is broken in the restaurant as explained by the staff, but we decided to try it anyway.  The food overall was not bad, the dumplings was handmade much like a lot of northern chinese food places and had a fair price for what you got. The Smoked Duck the taste was correct, it was just a little overcooked. but other then that, it was a good dish i would recommend trying, and the cold noodle, called cold skin on the menu, was good on the chili sauce which is the key to this dish.   The service at this place was the typical chinese place, which was no frills and efficient,   one major problem this restaurant had and doesn't effect my rating, was that it doesn't have a English Menu meant for this location, they only had a chinese menu. the english menu that they did provide, was for another branch restaurant downtown, which means they don't serve all the same food, and becuase of that many items on the english menu we tried to order was not available.   Anyone who wants to try this place, must go with someone who can speak chinese, or read chinese.   Overall i believe given the price and quality it is a decent restaurant and i would recommend others to try."}
{"text":"Me... and my fellow elder generation Friends do tend to have a \"THING\" for places that stir up our memories of the good ol' past.  Let them KIDS hang out at their Starbucks while I reminisce from the classical theme design of Shaanxi Legend.  Don't forget to look UP!  Funny how old people like myself can eat everything else, while \"Other\" supposedly younger folks can't even fit 3 more Soup Filled Buns into their meal.  Learn from ME to meal-feast, young Padawan-apprentice.   :P  3.5'd -----  4.3 Seafood w/Sizzling Rice($9.99)-- The addition of Wood-ear and Bamboo Shoots while having nicely cooked Fish Fillets and Shrimps made the Sizzling Rice a tasty dish I haven't had in awhile.    11.2 Sichuan Dan Dan Spicy Noodles($5.99)-- The Dan Dan Noodles have nice bite and picked up the sauce quite well while the consistency reminds me of Noodles from a Korean place but that was more udon-sized and this version here is more median.  2.5'd -----  7.5 Shaanxi Bread in Mutton Soup($7.99)-- Shaanxi Bread in Mutton Soup is nice accompanied by Sour Pickled Shallot and Hot Sauce.  My Friend liked Chinese Beef & Lamb's version much more even when it has no additional accompaniments.  8.4 Shaanxi Soup filled Beef Buns($4.99)-- Shaanxi Soup filled Beef Buns are as noted but I did like that the soup was more of the savoury kind than some Shanghai XLB.  As you can see it's not the same variation as the dough is thicker too.  1.5'd -----  7.1 Xian Cured Pork in Bread($2.49)-- Like eating blah Pulled Pork inside an English Muffin."}
{"text":"I went to this restaurant because I suddenly have a craving for Liang Pi (cold rice noodle). I searched around nearby areas and this is the restaurant.   Shaanxi Legend mainly serves north western Chinese cuisine. I love the tea smoked duck a lot. The skin is very crispy, and it has the smoky smell which I really love. The seasoning come onside along with the duck is very salty, so don't dip too much if you don't have a super heavy tasting tongue. The cold rice noodle is salty and sour taste. This type of taste is a little acquired taste, but people who like it just really love it. Adding a little chili oil if you are ok with spiciness, it is another whole new level of tasty. Their homemade dumpling is also very tasty. It is not too salty and the skin is so chewy.   Only problem with restaurant is that they don't really have English menu. So people don't speak or read Chinese may need to start looking to make a Chinese friend now~ haha.  Anyway, I would recommend this restaurant for trying."}
{"text":"The food here is very oily. The server recommended me a fish soup, which was absolutely tasteless."}
{"text":"Its sunday night, walked in with my girlfriend. it was empty, my girlfriend and I also got shocked. The server was unfriendly, very limited english, only speak mandarin. Ordered lamb skewer, fried eggplants with rice, and my girlfriend ordered some kind of northern chinese noddles. The food was nothing special, below average. What I want to say is not only the food, but the service, and the server. She was the only server because this restaurant was empty, I finished the tea, and I left the cap opened, she was standing there looking and crossing her hands. At the end, my girlfriend and I are pretty frustrated and we don't understand what kind of service this is. She still didn'trefill the teapot because we were going to have bubble tea afterward anyway. After I asked for the bill, she filled up the teapot as we were about to leave. It was a terrible experience and customer service. I don't think this restaurant is going to last.   Recommendation: Dont go."}
{"text":"???????????????dinner Time?????????????????????????????????????????????????????????????????????????????d??????????????????????????????????????????????d???????????????????????????????????"}
{"text":"Everytime I come here I always receive consistent high quality service from the owner of the restaurant. Although service could be slow due to limited wait staff. One waitress and owner himself serving at dinner time on Sunday.   The quality of food is consistent and worth the price. The usual dish I order everytime is pork belly that hangs on a cute wooden stack.  There's a new menu item this time that we came around, which is the seafood mixed plate. It comes in three different sizes. We ordered the medium size that came with so much food, all of us felt like we came out of dinner from a seafood all you can eat experience."}
{"text":"I came here on a Sunday after noon around 4pm, lured in by the delicious looking crayfish in the storefront poster boasting authentic dishes from Shanxi China. The place was quiet for a Sunday early dinner time, and the waitor looked inexperienced. He forgot to give us a part of the menu that included the seafood platters that we were hoping to order and it wasn't until we inquired in person that he brought the other half of the menu.   Overall the food tastes authentic. We ordered the cold and spicy glass noodle dish as well as their cold chicken noodle. Both were great. The seasoning in the dishes was pretty authentic in my opinion.   Our main interest was the seafood platter. There are three soup base sizes recommended for 2, 4, or 8 people if remember correctly. All three soup bases are spicy, as is the characteristic of cuisine from this part of China. My tolerance for spicy food isn't the highest but even I could enjoy this chinese red chili soup base because there were so many other flavors within the soup that made the seafood delicious. We ordered crayfish, mussels, crabs, and cuttlefish. The soup came with tofu, seaweed, bean sprouts, nappa lettuce. Everything came in a giant crockpot. Most of the seafood was great and enjoyed eating them (try not to wear light colored clothes though, I stained my white blouse like a 5-year old that day).   Crabs were a disappointment unfortunately. I had to drop the rating down because of this. The meat was mushy, not the kind of flaky meat texture you get with fresh crabs. It was clear that this mushy meat texture was a result of freezing and defrosting seafood repeatedly. The mushiness was like that of mashed potato :( not what you want in crab meat."}
{"text":"Newly opened Shannxi Legend is Chinese restaurant that is specialized in the cooking style of Shaanxi (which is in the Northwestern part of China)   The menu does reflects this regional cuisine but with a mix of the staples dumplings and noodles that offers in other Northern Chinese Restaurant. The use of peppercorn is spared, the emphasis are more on sour and spicy... sugar seldom used in the cooking process... so don't expect any sweet and sour item on the menu.   The waitress here speak Mandarin and really helpful and knowledgeable about the menu.   Shredded Potato Salad ($5.99)  - Potato crispy and fresh... but lacking the spicy kick as compare to other places I been to   Shaanxi Cold Steamed Noodle ($2.99)  - The Noodle are the thicker and wider versions  - again not spicy enough... and this is supposed to be a 2 chili dish  - the dried tofu puffs has a really interesting texture... which I enjoyed   Beef Noodles with Lanzhou Style Soup ($5.99)  - The soup based is clear broth but has good flavours...  - noodles though not hand pulled which is $1 extra has this nice, chewy texture and without that doughy taste..  - Beef is more like the preserved type... dried and chewy not the melt in the mouth tender  - good value for the money! The portion is huge!!   Note, the waitress recommended some of the Soup Filled Buns which is their specialities, might have to try those out... They are reasonable priced $4/6 but for 2 of us... if we ate 3 of those buns, we cannot eat anything else!   No Lunch Specials but they are have 10% off Grand Opening discount!"}
