{"text":"Only halfway through my meal and feel like writing already. Just had the manchow soup and for $6 I don't think you will get a tasty and spicy one like this one easily elsewhere easily. The restaurant smells great and the staff are super friendly."}
{"text":"Wow! A friend and I was greeted to a cosmopolitan but less chaotic atmosphere the moment we entered the door. An excellent place to have important business meetings. It has a predominantly Indian cultural look and feel with hints of other cultures in the decor and cutlery. A little dark in decor but certainly a unique place.

The food tastes great too. The cuisine is more of traditional Indian. Spice levels were just right (I love spicy food) that it truly delights rather than burns. I had the Havayali (sp?) Chicken and absolutely loved it. It felt as if it took a little longer than the standard 20mins for the food to arrive but, it was well worth the wait to have a proper hot meal.

The server 'Baani' adds the icing on the cake. She is always with a pleasant smile offering a polite-professional Service."}
{"text":"Great food there and good service. Prices are a bit high for the porttion size but food quality was good.  Nice elegant dinning experience. Great for a dinner date."}
{"text":"We went to the restaurant for dinner one Friday night within 15-20 days of it opening. There were only 3-4 tables occupied at the time.
First impression was cold. The atmosphere was very dull. The table cloth was dirty and the silverware had spots on. 
The waiter who came to fill the glass of water didn't even smile or make any eye contact at the first interaction. We ordered a subji, biryani, rotis and lassi. Subji and biryani came first, I had asked for spicy and they both were very bland. No Rotis came   Until I reminded them I am still waiting for them by which time the Subji was cold. No one even came to check if everything was ok or not. 20 mins in I had to call someone and ask them to cancel my lassi order as I was almost done eating and there was no point of getting the lassi at that time. The girl who was suppose to make the lassi came over to apologize saying that she forgot to make our order as she busy got doing something. I can tell you what she was doing- three of the staff members were explaining the menu to the table beside us ( still don't understand why you need three people to explain a menu..)
Am very disappointed with the service and food."}
{"text":"The food may have been good, but the really bad service forced us to leave this place with a bad review. It took them an hour to get us our apps. The papad was raw, the food was expensive for the portion that looked like a kid size meal. We paid $12.99 for a barely 1/2 cup portion of the meal. It was a real rip off. We were ok to wait but those portion sizes were really disappointing after that long wait. The server wasn't able to explain the reason for the delay either."}
{"text":"Its been one of my worst experiences in Toronto's food scene overall. Upon contacting them they said they had availability and on arrival we were put in an ice cold room with two tables so close that we could overhear them talking at normal voice pitch. There were no high chairs available at the restaurant hence they gave us a bar chair for our niece instead of relocating us to a table with probably sofas. The food was below average specially when they have very limited menu, our naans came before our sabzi and by the time the sabzi came, the naan was more like papad then naan. The portion size is enough for individuals and our malai kofta was still in the kitchen and we had finished our dinner. No one had a clue what a virgin mojito is. And when we asked for a serving for papad they served us khakhara which is definitely not papad! And we were told it is. When we said oh we know it is not papad. They said the kitchen ran out of papad on a long weekend which any good restaurant would be more likely be prepared for;than them. Our salted lassi was inedible. The service was a little sloppy and it felt they couldn't handle the events happening for a partially booked bistro and birthday party.Very disappointed."}
