{"text":"This is a fabulous bar! Great atmosphere awesome drinks and food. The food is way above your average bar fare. The weekend brunch is a MUST. Excellent staff and bartender's. One of the best bars in all of Madison!"}
{"text":"Food was mediocre but somewhat good. Pretty average burger but still worked well for lunch.

The problem came when I came to pay. The burger was a dollar more than what their online menu listed. They didn't take credit cards, and the ATM in the back was charging a fee equal to my meal. This bar did have credit card terminals, and when I stated this, the waiter became rude, saying that they were not hooked up, but they knew what they were doing. Well, obviously not, since all other restaurants (and even most food carts) take credit cards. Even I take credit cards! I had to walk an extra 20 minutes during my lunch hour to get sassed at.

Honestly, I was saddened to see such poor service from a Madison institution, but I'll stick with Paradise Lounge for my lunch hour."}
{"text":":-) Get more darts, but the staff is great for whatever you are looking for going out, pregaming, or just stopping in."}
{"text":"I love this place. The people here are all down to earth. The drinks are priced well, bartenders are super sweet!  My friends and I have always had a good experience!"}
{"text":"SHAMROCK forever! You really have to know what you're getting yourself into, though.... (the only way I can appropriately communicate the beauty of the Sham safely is through emojis which apparently aren't allowed here)."}
{"text":"Five stars for the Shamrock because much like the old Hard Rock Cafe motto of \"Love all, Serve All\" the Shamrock lives up to this. Bartenders are very approachable, the space is comfortable and not as divey as older reviews may have indicated. They make the drinks strong and they have a TERRIFIC wallet friendly happy hour. My favorite bartender is Wes and although I am sure he will not be there forever I sure wish he would stay there forever. The bar has a great neighborhood feel and it was nice to see it fill up after 10:00pm with a nice blend of guys in their 20's through....? All talking and seeming to have a nice time. The place is very straight friendly without pandering to them and I am always more than happy to pay this place a visit and that is saying a lot from a guy who has a hard time leaving the house let alone I am not a big drinker. I just go out for the social aspect every now and again and the Shamrock scratches that itch."}
{"text":"Well there is a First For Everyone.

Ok. I'm a tourist who walked into this bar. No big deal except I'm straight and this is a gay/alternate pub. I didn't know that when I walked in which I thought was funny. I'm usually a stickler for details  and living in South Florida with one of the biggest LGBT populations in America I'm familiar with this lifestyle and have no problem with it. You think I could have know this was gay bar, but nothing lead me to believe it was. Maybe that was done on purpose as a social experiment to see how a straight person would react when walking in. Do you leave? Do you stay? Do you hope no one sees you? Crazy $hit like passes thru everyone's mind, I don't care who your are. I just have the guts to type it.

The Awaking 

So I order a beer and ask if the jukebox is on. The Bartender who's name is also Dan says yes. I then look up by the TV and see the Rainbow Flag. I look to the left and see a bigger Rainbow flag on the wall. Well I'll be damn, I walked into a gay bar and didn't even know it. It felt like something out of comedy and I had to chuckle. Now I'm comfortable in my own skin and I don't panic and look for the quickest exit. I stay.

Ambiance

Very nice pub and Dan was really cool. I come clean and tell him that I didn't know what type of bar this was until I walked in. He says it happens to people all the time. So enough about that. I got my beer and shot the $hit with Dan. I played some songs on the jukebox. I noticed that this joint is very clean and more updated than the place next door, Paradise Lounge. I finish my beer and Dan asks if I want another one. Fuck it, why not LOL. I have another and then pay my bill. 

Verdict 

If I was gay I would love coming here, You can tell that it would be lots of fun plus it's a sharp looking pub. I will honestly say I would not hang out here because it's not my gig but the place deserves 4 stars for sure. Stay Hungry!"}
{"text":"Great spot!  We have always had stellar service from Luis.  He's hilarious, attentive, and hard working.  Even when he was slammed with customers (after the women's march), he remained friendly and focused.  

The food is delish, too!  The grilled cheese is simple but yummy, as were the chicken strips.  We shall return!"}
{"text":"Robert Mahr has really turned this iconic bar into something to be proud of. Remodeled bar area and interior had made it more modern but yet kept the feel of the previous Shamrock and it's roots. Food is delicious with their new menu and of course check out Brunch every Saturday and Sunday, you will be hooked!  DJ's every Thursday, Friday and Saturday!  Happy Hour is always fun and drinks here are inexpensive but yet really good!"}
{"text":"Ladies bathroom was very messy - felt very uncomfortable using it! Overall, the food was good but I would not be surprised if the kitchen was not up to food code. My husband owns restaurants and is very certain.. . Strange, rude man at the door also - clearly not made for being the face of a business ! Bartender with colorful hair was charming but did not return change when asked and acted needlessly unkind to a young man near us. Not execllent. Will certainly not be going again. -Barb"}
{"text":"Had a great time at this bar during a recent Saturday evening. The drinks are good, bartenders are very good and the patrons are very nice. There are a lot of TVs for watching the Badgers.

Just so you know, this is a gay bar, but it wasn't initially obvious to me. I was there with gay friends, and I knew that it was a gay bar before arriving, but it might have taken me a while to realize it had I not been with friends. Depending on when you're there it may be really hard to tell. It became more obvious as the really good DJ was spinning great tunes later in the evening. Speaking of tunes, the noise level was just right. Loud enough to be motivated to dance, but not so loud it would pierce your eardrums.

There was a great vibe overall, and I'd love to hang out there more often."}
{"text":"This is exactly what I was looking for. Gay bars are where I feel most comfortable, and this place is exactly that. Drinks are cheap, paint chipping off the bar... Even a little cockroach visited us tonight. Not disappointed. 10/10 would recommend. If I'm back in the area again, I'm coming here."}
{"text":"Great service and atmosphere. The happy hour has inexpensive drinks. The bar is very clean, nicely decorated and the bartender was excellent. Plus the music was very good."}
{"text":"This place has amazing food - especially the brunch!  Best Mimosa I've ever had - highly recommended.  The staff is also super-friendly!"}
{"text":"I stopped in here to see if the hype was true and I'm happy say it was. Very friendly and warm atmosphere and good music, plus bartender Trevor was cool and made me feel right at home. I didn't get a chance to try any of the food but I'll definitely give it a shot on my next trip."}
{"text":"One word...superficial. I wish the gay community could be more accepting. Please don't instigate a fight with one of my friends for not conforming to your version of \"gay.\" You have a great atmosphere but just need nicer bartenders. It was my friend's birthday and you kicked him out because one of your bartenders instigated a fight in the bathroom with my friend. Please be nicer, I really want to like you. Honestly I just can't understand. Will be calling management."}
{"text":"My favorite bar downtown! I absolutely love this place. Even when it's super crowded, the service is still fast and all the bartenders are fantastic. I also LOVE coming here for brunch and mimosas. So delicious! Everything I've ever ordered has been fantastic.

This is a great place for people that want to have a good time but aren't in college and don't necessarily want to be surrounded by rowdy 21 year old students. It's so much fun and there's always fun lights and dancing.

We always bring our friends from out of town here. Whether it be during the day for brunch and day drinks, or at night for drinks and darts. It's welcoming and the ambiance is lovely.

Highly recommend!"}
{"text":"Went to Shamrock for food and drinks at around 11am. I got a Shamosa to drink, which is basically a mimosa but with some tequila as well. It is slightly on the pricier side, but it does the trick. I also got a cheeseburger, which was grilled perfectly and tasted great, not to mention a great price compared to surrounding restaurants. There are not many windows here, which makes the inside pretty dark, but the staff are friendly and helpful. There are a couple of TVs but they are pretty small, so it would not be my first choice to go to to watch a game, but overall there food, drinks, and staff are great and I would definitely come back!"}
{"text":"A friend and I stopped at the Shamrock while looking for a place for a drink and food prior to a show.  Had I researched we might have noticed it was a gay bar before we ordered, but neither of us really cared to leave. The staff was exceptional and our food was absolutely amazing.  I had cheese curds and they were steaming hot, fried to perfection.  The bar itself was clean, service was great and there was a fun happy vibe in the bar as friends hugged and regulars chatted. I'd happily go back as the food I didn't order looked really great!"}
