{"text":"We had afternoon tea at the Lobby Lounge on a Sunday afternoon for eight guests.  The ambiance is wonderful, with live musician playing a piano rendition of modern songs.   The quality of the food platter was excellent. There was a large selection of sandwiches, biscuits and desserts for everyone and it was quite filling. Each bite had a unique and vibrant flavor. I was blown away, everything just tasted so good.  There is a big variety of teas. We poured ourselves a cup of tea and then rotated our teapots so that we could try everyone's selection. Each tea had its unique aroma and taste.  If I had to complain about one thing, it would be the speed of the service. Our waitress was friendly but there were only two wait staff in the dining area serving a lot of guests at the same, so it took a long time to get our bill and leave. It was an 1 hour and 30 minute seating time but we stayed for 2.5 hours because of the wait.  Overall, I had a great experience and I would love to come back."}
{"text":"Afternoon tea: very extensive tea selection.  The finger sandwiches and scones were good along with the desserts but not as tasty as some other tea places I have frequented.  Service is lacking here.  For such a nice place the waitresses need to pay closer attention to their customers."}
{"text":"My stay at the Shangri-La Toronto was impeccable: absolutely exquisite interior design, superb customer service, and the breakfast at Bosk (the restaurant) was delicious (the crispy French toast was incredible). Their attention to detail and emphasis on customer satisfaction is unsurpassed. I would highly recommend this hotel: its stellar reputation is fully deserved."}
{"text":"This review is for the high tea at the Lobby Lounge within the Shangri-La.  To start, the space is very welcoming and chic. You get a lot of natural sunlight and the sofas were quite comfortable. We booked the high tea in advance, which is recommended as it does get busy. Upon checking and being seated we were welcomed by a few different waitresses, all of which were quite friendly.  The first waitress boasted how the Shangri-La has one of the largest tea collections by a hotel in the world. As an avid tea lover my expectation really heightened at that point. Once we got settled in and sipped on the included prosecco a different waitress asked what tea we would like, at which point I asked \"what's a unique tea that you offer, something special?\" She was really taken back by the question and seemed borderline confused, to which she responded \"uhh, I really don't know - you can find any of our teas anywhere.\" LOL  Perhaps she was confused by my question because it seemed like she was almost offended that I would ask that. Further, the first waitress told us they have over 70 teas but only about 12 are presented on the high tea menu. At no point was I offered the full menu of teas...  Anyways, once we got down to it, the tea was quite good - especially the \"Royal Cream of Earl\". The accompanying tower of tea sandwiches/pastries was not only photogenic but very tasty, having such items as mini pastrami sandwiches, mini lobster rolls, cheddar quiche, blueberry tart, and a cherry verrine to name a few. All combined there were about 10 unique bites person.  No complaints about the food, aside wishing some of the bites were a bit bigger given the price tag of CAD$61. Something that did irritate me though was the fact that instead of allowing you to get a fresh second cup of tea, they just offer unlimited re-pour of boiling water. Anyone who knows anything about tea knows that it cannot be steeped multiple times, especially more subtle teas such as white or green. I was just in shock that a place like this wouldn't know that or just eat the cost of giving a few more grams of fresh tea.  All in all, I am happy we did this high tea. I was a nice 1.5 hour escape in the mid-afternoon which allowed us to just relax and reminisce about our trip to Toronto thus far. However, I wouldn't do the afternoon tea here again. Between the price and the pure ignorance regarding proper tea preparation it just isn't worth doing more than once."}
{"text":"My buddy rocco praises this place and he has every right to, its amazing. The amenities are fit for a king, great sauna, pool area, steam room and fitness area. The rooms are very nice and if you call the concierge they'll hook you up with anything. Stay here !!!"}
{"text":"this review is base on my entire experience at Shangri-La,  lobby, lobby lounge,  the hotel itself, amenities and rooms.  So,  Im always a fan of asian hotels.  There is simply a big respect and attention to service.  Im from Toronto and I always like to spend friday or saturday night at Shangri-La lobby lounge.  They have a beautiful light wood piano with a gorgeous pendant lamp above it.  They have a live band in the evenings or sometimes solo performance by great local musicians.  Servers are well-trained.  I Love their uniform too.  The hotel lobby decorations is simple yet effective.  Im wondering if they can improve the ceiling as it looks too empty.  I love that they tucked the check-in counter on the side.  One problem is that the concierge is not easily noticeable.  The washroom is nice,  I would say better than new four seasons toronto.    Amenities;  I would say simple and caters to the basic needs of the hotel and the residences.  Steam room, pool,  whirlpool, cabanas,  great layout for changing rooms and gym.  They don't have the amenities that are not really meant for a downtown hotel.  The hotel corridors and guest room has the big asian feel. Lots of artifacts along the corridor.  Don't forget to roam around the corridor along your floor.   The double door going to the bathroom and the asian decoration on the bedroom makes you think that you are in hongkong.  Basic requirements of a guest room are all present.   Stay here if you want a have a hassle-free hotel accommodation."}
{"text":"Lovely lobby-bar and cafe with perfect service and nice fireplace and live music and piano bar"}
{"text":"Just amazing in every regard. The lobby bar is the classiest act in Toronto. But don't tell anybody. It's always crowded and I don't want to draw more crowd. . Good luck and please don't go and take the last seat.patrickr"}
{"text":"Review is for Afternoon Tea in the Lobby 2 stars for Overall experience and 1 add'l star for ambiance & setting  Having had High Tea throughout the city (King Eddy, Royal York, Windsor Arms and also little indie coffee/tea shops) this one was rather disappointing.  LOCATION - you dine in the hotel lobby - I don't like to eat at coffee table height (I know, this is a personal preference, but I like a tablecloth to hide the carb-baby from the scones!)   - As it is a hotel lobby, there's too much chaos.  For example, there was some tourists settling down after a day of shopping, chatting and regrouping, using lobby WiFi to plan their evening and there were people that would come and go as their group got larger/smaller.  No problem because they're staying there and this is what you do in a hotel lobby, but it was chaotic.  When I go out for tea, I like the atmosphere to be serene and almost reverent, I get dressed up, linger a long time with my g'friends chatting, etc. and this is in stark contrast to what's going on around you.   - the additional star was given because we were given a reserved table right by the fireplace.  The gesture is a wee bit moot, as it's July; but I appreciate the forethought to giving our table one of the prime locations in the lobby.  SERVICE  - the women who work in the lobby are better suited to serving (liquor) drinks to lobby patrons, than to serving tea.  If you'd ordered a cocktail, you would be checked-in on, asked if you wanted another drink, etc.  If you're there for tea, you get your tea pot, your food and that's it.  No one checked-in to see if we liked the tea they had helped us choose.  No one asked if we needed our pot filled with additional water.  - When ordering our tea, they were explicit that it was one choice per person, no switching.  She said that the menu might mislead you in to thinking you can sample tea from the seven sections, but you only get one kind of tea.  Fine, that's about par for any tea service; but if other patrons have been confused/misled by the menu, why not change it?  The tea is delivered and then we waited over 30min for our scones/sandwiches/dessert tiered tray.  By the time the food came, our tea was tepid.  But we were so hungry that tea was an afterthought.  After they put the food down, no one ever came by to check on us.  Least of all, no one ever came by to ask if we wanted additional hot water, (which is unheard of, during tea service!)  FOOD - servings are very small - Desserts: not portioned out per person.  Some desserts, you have to cut in half to share.  There was a vivid yellow dessert that was very artificial tasting, I couldn't discern whether it was suppose to be lemon or passionfruit, irregardless, it tasted like yellow Flintstone vitamins. - Sandwiches:  Egg Salad tasted no better/worse than what you get from a sandwich tray ordered for corporate catering; Cream cheese & cucumber, all 4ppl at our table had a bite, and no one finished more than that.  It was tasteless, quite literally tasted like Philly cream cheese on Wonder bread.  Curry chicken on brioche was divine!  If I was given 4 piece of that as part of the sandwich tier, I would have given them one more star in my review!  Alas, you only get one and it's the size of a toonie.   - Scones: each person gets two types, plain and cardamom.  Both tasted the same.  Rather good, but other than one looking speckled, like whole wheat, they tasted the same.  For four scones (2ppl), you only get one small ramekin of clotted/english cream and two ramekins of jam.  When I say small, I mean that it probably holds the same amount as one of those packages of jam you get with your toast at your local diner."}
{"text":"We had a terrible and embarrassing experience on Dec 23,2015 that I hope no other guests especially those on business would have to endure.  My wife and I had taken out a business partner and his wife for a night out to a dinner and show. We decided to head back to the Shangri-La lounge for drinks and live music before calling it a night.  Normally we could just seat ourselves down, but this time around it was busy due to the holiday season. We spent a long time walking around awkwardly finding our own seats and only after we did sit down; the host came to vacate us - a pretty embarrassing ordeal in front of guests in the lounge.  We were told there was a waiting list and we would be 2nd/3rd on their list and not a long wait at all. We felt a little foolish having to give up our seats in front of everyone at this point but we were told to wait in the bar area. We found it strange that they didn't take our name or contact information but assumed that since we gave up our seats and told to wait in the bar area, they would recognize us by face and come and notify us when lounge seats were available.  At this point there was no space at the immediate bar area, but there were several high tables beside the bar. All of the tables had seats except our table. We commenced to order our drinks and about 45 mins passed while other tables with chairs emptied yet we were still standing on our feet (keep in mind the ladies were in high heels all this time). You would expect the servers to offer up the chairs at the tables to us once those tables were vacated. This is something you would expect as common sense customer service but not from this 5-star hotel you call Shangri-La.  After we had our drinks, we inquire with the server on the status of our seats in the lounge - he went to check with the host only to find that we weren't on the waiting list  all along!! Can you believe that? We were told there were now 5 or 6 parties ahead of us! Basically the host totally forgot to put us on the waiting list after kicking us off the lounge seats that we found when we first arrived. We had been waiting and standing at the bar tables like fools! What are these bar tables doing without chairs anyway? And how can your server not offer us some chairs when they became available? This is definitely not 5-star customer service as you would expect it.  My advice to management: with absence of a reception area/waiting area you shouldn't expect your guests to know where to find your host to put our names on such a waiting list. You come find US before we look like fools stumbling around. If you kick us off the lounge seats because there's a waiting list and advise us to wait in the bar area...DON'T forget to take our names down because as guests we are thinking you would come and personally find us to seat us when seats became available. Finally...your lounge host advised that the lounge manager would call me the next day to discuss the situation. It is Dec 27th (3 days after the day you promised to call back) and I haven't heard from you.  To all guests: Definitely not a 5-star hotel. We felt awkward, embarrassed, mad,  foolish and tired to the feet. In the end our night was ruined and we were so bitter about the whole situation. Definitely a night to forget. To add to this, I was treating my business partner and his wife...not a good taste to leave in their mouths. I had to apologize profusely to them."}
{"text":"This review is for regular high tea last weekend. Because seating is limited and it did end up full, i strongly suggest making a reservation. We were seated by the fireplace, which is really nice with the warmth of the fire. The decor/utensil is Asian styled, and waitresses wear Asian inspired Qipao. Savorys are  very delicate, not heavy. Sweets are not too sweet and full of flavour. The portion is perfect for 2 people. I orderef the lavender earl grey and it smells so nice and goes well with the food. An hour into our food, a pianist started playing jazz, and it just made the experience even better on a warm sunny afternoon. Highly recommend!"}
{"text":"Relaxing open space. The platter of food for high tea was good."}
{"text":"Stayed here for four nights, great service as always, very welcoming!  Service at Bosk in the morning is below their usual standard, food is average but expected overpriced.   Was a bit disappointed about the room service menu, chose the safest bet... chicken finger (lol), and Caesar salad. Both were noticeably good quality for such simple dish. Would order again for sure"}
{"text":"Stayed here for 2 nights with a few friends. We booked through hot wire or priceline, cant remember but the price we got was amazing!!  The lobby was spacious and smelled really pretty, the rooms were modern and comfortable. The location is also really good. We didnt get to try out any of the amenities but I really want to go back soon."}
{"text":"The quality of this place has dropped with the turnover in lobby management this year. Ungracious and inhospitable. Poorly portioned, severely overpriced food. Avoid it."}
{"text":"I've now stayed at the Shangri-La six or seven times and I'm not sure if it's that I'm not their target market, that they seem to be struggling, or what, but I've been unimpressed by the hotel.  Rooms have been visually interesting, and fine on space and layout, but it seems like they ran out of money and tried to finish it on the cheap because the finishes are fraying quite quickly.  Room service is poor to the point of absurdity.  Food shows up cold, ages badly during travel to the room and the options aren't very good, particularly strange considering the high end arrangement of restaurants in the building.  That said, you can't get anything from the David Chang restaurants from room service, so you can't blame him for the food, I suppose.  Lobby bar is fun and has good energy, but it's difficult to find a clear path to the elevators from the entrance if you're a guest (maybe that's intentional?  Again, perhaps I'm not the target market).   I've also had consistently poor service in the bar, with service staff seemingly overwhelmed and struggling to bring drinks/cheques in a reasonable amount of time.  My biggest frustration is the check-in / check out process.  It always seems to be time consuming and slow, whether I'm arriving at midnight or in the middle of the afternoon.  The service team at this point seems to be working hard, but perhaps the systems are poor and slow them down?  Hard to tell.  Ultimately, they seem to want me to sit down and relax for a few minutes during the process, when all I want to do is get in or get out quickly.  Ultimately, this hotel seems to be undershooting its potential, though Toronto's downtown hotel market does seem to be difficult and I've struggled to find other options in the area that are better.  Fairmont Royal York and the InterContinental are at a similar price point and service is better at both, but both of those hotels are much, much older and tired out.  Perhaps the market just doesn't support what I seem to find in other cities I visit regularly."}
{"text":"An excellent new eatery within the lavish new hotel. The location of this new development is very much striking. Please visit if you can."}
{"text":"Review for afternoon tea at the Lobby Lounge  Would have love to give this place five stars, but service was below expectations and food servings was unusual for afternoon  tea which makes for the okay rating.  Upon entrance into the hotel lobby, it was a wow factor with the high ceilings, grand piano, modern fireplace at the centre, lovely orchids at the tables and the jade planters near the back entrance. Everything looked simple, but elegant  decor, plus pretty sophisticated servers dressed in lovely Asian inspired theme dresses.  Their dresses reminded me of those  blue and white china plates from the Ming Dynasty.  Seating was casual  with sofas and chairs, but fact they wanted 4 ladies seated on the sofa was ridiculous.  Sure we can fit or perhaps have the child in our group sit at the sofa, but it won't  make for a comfortable tea experience when we have to watch our elbows every time we reached for our teas, so requested an extra  chair.  We were a party  of six.  Tea was served in large teapots and presses and they had proper strainer for individual servings.  Choice of various tea selections from the booklet for everyone's palate and teas were  available  both hot or cold.  Afternoon tea menu listed on a menu card placed on the table and selection was variety of finger sandwiches, scones and pastries.  All the sandwiches were fresh tasting and quite delicious as the flavours of all the ingredients were  prominent and blended well together.  Pastries were also tasty, but some of the desserts were just too sweet.  I have a sweet tooth and even I thought  it was too sweet, so I didn't manage to finish my desserts.  One complaint  was  the servings for the pastries as we've  been to numerous establishments for afternoon/high tea  and were always  served one pastry  per person on the same tiered  platter.  We were expecting everyone to enjoy what was written on the menu card.  When we brought  this to the server's attention, she informed us that  some desserts were  meant to be shared  as that's  the afternoon  tea experience to share.  We were  baffled at the explanation as we've never heard of this or experienced a shortage of food. Three of one dessert, two each of two desserts and only one dessert of another to share among three people, just doesn't sound appropriate and fair when everyone is paying the same price.  Since I was a little late, server forgot my order on the tiered platter even though my friends told them number of people and I arrived just shortly before my friends had their teas served, so I wasn't too late.  Server simply forgot, but was apologetic and my tier came shortly after. I managed to have one of each desserts for myself, so lucky for me, but it didn't  seem fair that my friends  had to share.  They do get bonus points for making everything in-house, plus having options  for gluten-free and a kids menu which we had both of in our party.  They were both served their individual tiered platters.  I had to ask for water upon my arrival and we also had to ask for a hot water  refill which was only replenished once which we weren't used to as normally the hot water would be refilled without  us asking for it.  Plus fact our server had disappeared after we brought the missing  desserts to her attention seemed bizarre. Our empty dishes only  got cleared once by another server.  Perhaps we were  used to places that cleared plates off the table as we finished  each tiers.   Worse part we were told at time of phone call reservation reminder that we had an hour and half seating limit, but lucky we weren't rushed out and ended up staying  an hour after our supposedly seating limit.  We still had  some food on our tiered platter including empty plates, no water refill either cold or hot. The lounge was busy, but we felt ignored and no service available when needed. We even had to flag another  server  when  we were  ready  to pay our bill as our server  was nowhere in sight and didn't  inform us that another  server  was serving  us because  we didn't  have anyone.  It was nice going to the Shangri-La for the afternoon  tea experience, but we probably won't  be back because of the lack of customer service experience."}
{"text":"We went here yesterday for afternoon tea with a Chinese New Year flare! It was the worst tea experience we have ever had- from the setting, to the food, and especially the service!   The sofas and low tables were very uncomfortable, not only for the adults, but for the kids too!   The food was terrible, and we left more than half of it behind. The scones had no flavor, but even worse, turned into a paste in your mouth!!! The other desserts were eggy; you should not taste or smell the egg in mousse! The sandwiches were mediocre, but the best food that we were given on the menu!  The service was beyond horrible. The waitress Adriana gave us attitude throughout our meal! She was rude when asking for our tea selection, and didn't come check on us once throughout our meal! We even had to ask another waitress for water, as she didn't bother with us once we ordered our tea, and we had to ask for our bill twice!   Overall, this was the worst afternoon tea experience we have ever had ( and we are used to going for tea wherever we visit- London, Paris, Switzerland, Seattle, etc.). Do NOT even bother with Shangri La Toronto!"}
{"text":"We were staying at the hotel as part of the Bliss Ball. We had a great check in and when we got to our room it was lovely. Nice jelly candies and lovely decor. When we arrived back from the ball though that is when the problems started. We wanted a nightcap in the lobby and were told they did Last Call at midnite because it hadn't been busy. Despite the fact the hotel was a sponsor of the ball and there would be a number of people coming back from the ball to the hotel. Then we asked for the Suty manager in charge. Unfortunately we did not get this lady's name. We asked her if we could order drinks to our room and then bring them down to the lobby to enjoy with our other guests who were also staying at the hotel. We were told we could do that. My husband went upstairs, ordered drinks, waited about 30 minutes for the drinks to arrive and then when he finally brought the drinks down to the lobby for us to enjoy the Night manager told us we had to get the glasses out of the lobby immediately or they could lose their liquor license. We told him that we all heard the previous manager told us we could enjoy the drinks in the lobby and he did not believe that all 4 people heard the same thing. Then the hotel raised the lights, shut the music off and turned off the fireplace in the lobby. We then asked if the night manager would comp our drinks since we no longer could enjoy them in the lobby and he said he couldn't do that. We told him again we were with the Bliss Ball and the hotel was a major sponsor of the ball and how disappointed we were with their lack of customer service and lack of empowerment in their employees. This hotel is lovely if you don't mind BAD service and one person not knowing what the rules ate and the left hand not knowing what the right hand is saying and doing. Shame on you ShangriLa. For such a nice hotel you really have Bad service. I hope lots of people read this review and walk with their credit cards to another hotel that can provide the service one would expect in a major city like Toronto. Since when does the bar close at 12 midnite because they weren't busy the night before??!!!!"}
{"text":"Always have a nice time at Shangri-La. The valet parking is quick and reasonably priced, and the hotel staff is always courteous and unpretentious as I enter eating a large bag a pop-corn and wearing a full denim outfit. Often very good music in the lobby bar...and steps away from ice cream at Noodle Bar."}
{"text":"One of the classiest and expensive hotels ever which you won't ever regret staying at. I got good deals through hotel.com and saved a lot more than contacting Shangri-la directly, for a one bedroom deluxe suite. They are so up-to date with the technology and amenities, the service is impeccable from the valet process to check out. The 3 times I've stayed at this hotel, I've experienced the same service and not even one spec of dust or dirt in the rooms. So relaxing and no disappointments. I always woke up late to have high tea at this hotel but I guess I will make another visit for that."}
{"text":"Wanted to find a nice place to celebrate my birthday, so decided to try the Lobby Lounge in the Shangri La Hotel. We arrived around 8:30 and were lucky enough to get a table right away. The pork dim sum was lacking in flavour. Sadly the crispy chicken which we had high hopes for was covered in paprika and lacked salt. The tapioca dessert and panna cotta were the best part of the meal experience but nothing outstanding. The service was excellent and the live music was great. All in all a decent place for drinks but avoid the overpriced and mediocre food."}
{"text":"Came here for drinks, the atmosphere here is nice, they had live music and very comfortable seating. Service was decent although not as attentive as I would have expected.  Drinks were good and some very interesting cocktails to try. A bit pricy but worth it!"}
{"text":"Extra information:  * Need to make reservation * Hightea service runs 2pm-5pm * Good for family  Back in university when Shangri-La hotel first opened up in Vancouver, going for high tea after class was something we liked to do. It was always a nice getaway from busy coffee shops and a place to chat and catch up over cup of nice tea and delicious finger food.  And then I realized that in last little over 2 years I've lived in Toronto, I've never even been to Shangri-La hotel before! So when the opportunity came along, I decided to check out their hightea with couple of friends.  Anyways, so the high tea is $40 per person and you get to choose your tea from their never-ending tea menu where they offer 68 choices. There is no dress code but people obviously like to get a little dressed up for such occasion and it just makes it so much more fun! (wow I sound like such a girl... no problem with that)  Finger Sandwiches  Roasted chicken and grain mustard mayo on mixed seed bread Egg and watercress with crispy Serrano ham on whole wheat Cucumber apple and cream cheese on country white Lobster and chive with curried mayo on brioche roll  Selected Scones  Warm chamomile and traditional plain scones served with house made berry preserve and devonchire cream  Selected Tea Cakes  Temptation- layers of chocolate ganache, raspberry compote, chocolate sponge and soft chocolate cremeux Coco- Coconut dacquoise biscuit, calamansi lime curd, topped with ginger and coriander infused pineapple Cafe au lait- Vanilla mascarpone cream, coffee cream brulee centre, white chocolate flakes and coffee soaked sponge Passion fruit sensation- Passion fruit cream, tropical fruits, mango coulis and passion fruit marshmallow pieces  For $40, high tea at Shangri-La hotel is very much worth it for me. I guess you could take that $40 and go hang out at some bar or a restaurant where you would probably walk out feeling full- but honestly, I go for the overall high tea experience and to chill with friends and not so much the food itself.  But if I was to comment on food, I didn't really enjoy any of their sandwiches except the Egg sandwich with crispy serrano ham on top. The rest I found to be quite dry and it lacked flavor. Scones were light and I can't resist berry preserve and devonchire cream.. I can put that on anything and it'd taste good. The stand outs were probably the desserts, ginger and coriander infused pineapple that were served with Coco tea cake was something I had on my dessert during Winterlicious at bosk and I just can't get enough of it!  For 2.5 hours my friends and I were there, service was excellent and I couldn't complain. However, do keep in mind that if you go during Winter, where the high tea happens is at their lobby which sits right infront of the entrance so it does get quite chilly. Clearly, high tea is not for everyone but if you want the experience, I would def recommend Shangri-La hotel."}
{"text":"Came here for some live music and drinks after dinner. It's very swanky and nice. Lots of couples having wine and dessert. Very romantic vibe with the live music and piano. I would defiantly come back on a Friday or Saturday to enjoy. Drinks are very expensive $20+"}
{"text":"Stopped to enjoy drinks in the lobby after dinner nearby, hoping to enjoy a bottle of wine with friends. We were halfway through our bottle when a server came up to us and told us we can't eat our cookies. I told her they were just from Momofuku Milk bar and she said we can't eat outside food, because if we were to get food poisoning they don't want to be responsible. While I can understand where this is coming from, seriously, let us eat our measly cookies... talk about poor hospitality. Points off. They are a bit rushy too, did not feel comfortable staying, and won't be back."}
{"text":"Four stars for the high tea experience; five for the ambience, live music, service, and people-watching."}
{"text":"If you want rude service...go here! The waitress was absolutely horrible, rude and not worth the tip, but she was standing over my shoulder watching me put my pin on to pay the bill. NEVER GOING BACK AGAIN!"}
{"text":"This review is specifically for the high tea.  It is $75 per person which includes a cold drink (champagne or sparkling juice) and your choice of tea. Personally, I think this is way too expensive for the type of food you get. I just came for a special occasion and for the experience. I probably will never come back because other than the service and the live piano music, it was nothing out of the ordinary. I am giving three stars for the beautiful setting and atmosphere. The service was amazing. However, I did not really enjoy the tea, I've had better (we ordered very berry and some sort of green tea) and I did not think the pastries were worth $75."}
{"text":"My boyfriend and I found an amazing deal on Expedia and booked a room for NYE. Our stay and service was nothing short of fantastic.   Rooms were clean, modern and spacious.   Read more on my blog: http://www.tobakiss.ca/ringing-2015-shangri-la/"}
{"text":"I generally focus on food, but thought I'd do one for my spa experience at Maraj Hammam Spa at the Shangri-La Hotel. I love, love the fact that the hammam is private! The steam chamber is quite large for one - having both a high intensity and a low intensity steam room. It was in Morocco when I first fell in love with hammams and am so glad that I can relive that experience here. The Caudalie Grand Facial was also fantastic. They tailor the facial according to your skin type. For me, the facial really did bring back moisture and radiance to my dehydrated and stressed skin.  Unfortunately, it is quite pricey (with an auto 18%tip) and the spa is small. I wanted to read a book, but the lounge/waiting room is quite dark - meant for relaxing (though, there is a lot of chatting). If you spend 200+ in services or 20 extra, you can gain access to the pool and sauna next door (part of the hotel), which is what I did so I could read my book and get away from the chatter. Despite the price and size of spa, I would definitely go back for the services."}
{"text":"Met some friends for drinks and munchies in their lobby / high tea area. Omg wines that you'd find at the LCBO for cheap were marked up astronomically. Same goes for the bar munchies. We got a few charcuterie boards. Barely any meat and way too much cold stale bread. Atmosphere great. Service was a mixed bag. The initial person who served us was lovely. The person who took over slammed a reserved sign on our table before we were even done ... I think as a hint for us to leave. I would have preferred a kind verbal mention before we sat down that we'd need to vacate the area in an hour. Love the restaurants at Shangri-La but never having drinks and munchies in the lobby anymore."}
{"text":"Unfortunately the two biggest problems with Shangrila Toronto is I've stayed in two other Shangrila properties so I know my experience should have been so much better and the price.  Everyone I worked with did what I asked but nothing more....No pleasantries or overly nice gestures, no smiles, and at times the concise nature of the staff bordered on rude.  Other Shangrila properties (Boracay & Taguig Manila) do a far better job convincing me my money was well spent.  I left Shangri-La Toronto thinking I should have just gone back to Four seasons or saved some cash and gone to a Hyatt.   The property is very nice and well appointed.  The room is smallish but the bathroom is large and nice with everything seemingly controlled by a provided iPad.  The room decor is slightly above average but the TV is large. The showers could be \"for two\" if it weren't for the French doors.  The shower head is a unique ergonomic mess.    The check in area is small and personal which I like a lot... feels less \"Hotel\" but the gentleman who checked me in did just that and nothing much else....  no explanation of the hotel features and not a whisper where the elevators were.  Unfortunately the lobby is. LOUD!!  Space is limited so the lobby doubles as a huge reception/bar.  The attached \"momo fuku\" restaurant is delicious and very nice.  Drinks are ridiculously expensive but nothing else on the menus seemed so.  The waiter told me , in a very concise many, flash photos were not allowed.  That's fine but again the experience was borderline rude.  Not harsh enough for me to alert management but it definitely impacted her tip.   In the end my biggest compliments go to the young lady who served me breakfast and the valets (which are Fast and very pleasant).  Great job u two!  Meh...  ."}
{"text":"I am disappointed that the lobby looks more like a living room than the lobby of a fancy toronto hotel...:( what happened at the design meeting ???"}
{"text":"*Review for Lobby Lounge*  I was really excited to try the Lobby Lounge at the Shang, so when a friend invited me for drinks, I did not have to think twice! Now, I always hate looking lost and as if I have never been to such a high-class place before...so I decided to put on my \"I am so bored because I have been to the Shang soooooo many times...ugh...\" face and walked in through the revolving doors (which is not the main hotel entrance...that is on Simcoe Street).  Thursday night was packed. I found myself petrified...standing alone looking exactly how I didn't want to be. Then, I noticed a lady standing in the corner who I think was the \"Help Desk\" Person. I asked her where I would check in for my reservations to the Lobby Lounge. She then took me to the Bosk area and said a lady would be helping me shortly. Which was seconds until I was whisked away to a seat right by the fireplace! What a great experience so far. Service was seamless as it can be.  The menu's are adorable. They come in books labelled by drinks, aperitifs, food (bar snacks), etc...My only dismay is that wine by the glasses (red and white) are very limited. The atmosphere is loud as we were sitting right by the piano. The first singer was crooning away on all the wrong notes so my girlfriends and I were a bit annoyed, but the jazz singer that came out after (I think he was a guest also) was absolutely amazing! Such a treat.  Love this place. Service is amazing. Can't wait to be back!"}
{"text":"One of my favourite places in the downtown Toronto core to grab a quick drink. Although, the live music always has me staying for much longer. The soul, r&b and jazz band on Wednesdays is just fantastic! So much soul."}
{"text":"Came here for the Nutcracker High Tea and had a wonderful time. The ambience around the holiday season is wonderful, with tasteful lighting and decor (not over the top), live piano music, and a wonderful selection of high tea snacks.  The highlight of the teatime tower for me was the Christmas tree shaped dessert because it had a very light minty flavor to it and tasted like Christmas. I also loved the spiced scone with butter and jam. It was very flavorful and decadent without being too heavy. The tea was also perfectly brewed. All the other items were also okay, but were not out of the ordinary. I am docking a star for the price: $61 CAD before tax and tip is pretty steep for high tea. The comfort of the Lobby Bar also left some to be desired. We got seated at a low table, which made it very hard to eat because we had to lean over a lot. We were also seated awkwardly side to side, so we had to turn to talk to each other. I wish that  we had gotten a regular table with seats facing each other."}
{"text":"Poor seating: couches and coffee tables. If you enjoy being uncomfortable, go for it.   Apalling service: Could someone please inform the staff that being stuffy is not a characteristic of refinement? I'm surprised anyone can breathe.  We booked a tea for a large group for a wedding shower. Our booking was made three months in advance and via email. We sent several follow-up emails including one a week in advance of our reservation, with updates about final numbers and dietary restrictions.  Upon arrival, we were directed to our seats, which were to be in two separate groupings. Despite speaking to management, the best that the staff could suggest was to move us to the cafeteria-style restaurant. The staff claimed they had notified us that we would be seated separately. However, there was no mention of this in any of the several emails, nor in conversation during the original booking.  We had asked if the furniture could be moved to allow us to sit together and we were told it could not. The reasoning provided regarding one vegetarian order did not seem logical. This lack of flexibility was disappointing in what is apparently a well-reviewed establishment.  We chose to take our party to a nearby restaurant, where we spent our money freely and made sure to tip heavily."}
{"text":"This review is for the high tea at the Shangri-La.  This was my first time doing afternoon tea at a hotel and my experience at the Shangri-la was just fabulous.  Reservations are required and if I remember correctly they require your credit card information.  The tea is served in the lobby lounge daily from 2-6 pm. The setting was quite opulent and had a relaxed ambience. We were seated near the back corner with a nice view of the fireplace and piano.  The signature tea is $65 and includes finger sandwiches, scones, tea pastries and a glass of prosseco. Come hungry as its a lot of food. The presentation of the tea and the food which comes in a 3 tier tray was gorgeous. All of the food was delicious. The only thing they could have done slightly better was the scone ... I felt the texture was a little bit off. At some point into tea the piano player arrived and we had some beautiful music to enjoy for a while.  I was being extra and wore a red fascinator because where else does one wear a fascinator if not during high tea ... so ladies this is your chance to be extra.   Valet parking was $25.  Overall, it was a wonderful experience. Having done my research of the other high tea places in Toronto  I think  this one is the best in terms of environment, value for money, quality and quantity of food. Having said that, now I'm determined to go to all other the high tea places in Toronto."}
{"text":"Always excellent service with attention to detail.  Possibly the best hotel in Toronto."}
{"text":"I am going to Shangri-La tonight with Marcus with high hopes and an open mind. I have been to Shangri-La Hotels all over Asia and while some were better than others, they all scored high with food and service. I have to admit, going to the one in Toronto tonight my expectations will be lowered. When Eddie was in town we were going to go and Eddie checked it out on his own to set up a reservation and he called me and said lets not do it. It is nothing like the Shangri la Hong Kong or Taipei which are two of our favourites. So tonight I will see for myself and while I expect to be disappointed, I will try to keep an open mind. Wish me luck! Anyone want to recommend anything on the menu?"}
{"text":"Review is for the lobby lounge/bar only.  Came here with some friends on New Year's Eve, so the lobby was predictably quite full. Coat check was fast and efficient, and we decided to start off with a bottle of Taittinger Brut. Although there was no more seating at the bar, our bartender offered to keep the bottle at the bar while we hung out in the lobby and come back for refills. Indeed, when we eventually wandered back to the bar, he excitedly waved at us and ran out from behind the counter to refill our empty glasses. Our bottle ran out, leaving one of our glasses half-full (or half-empty) and he promptly took out a new bottle to top off our glasses - a nice touch.  Despite not having reserved a table, a very friendly server eventually managed to find us seats in the lobby. She also recommended some very delicious cocktails for us to try (the French Connection and the Gin Basil Smash). Service overall was attentive and friendly and our server was definitely one of the highlights of our night   Excellent ambience, with contemporary Asian-inspired decor, high ceilings, and live music. Most of the lobby is dotted with comfortable chairs and large tables with paper lanterns, with a large glass-enclosed fireplace in the center. Despite the lobby being fairly crowded, it never felt cramped or stuffy."}
{"text":"It's a decent hotel. Well furnished... some things are great like the coffee machine, some things however though they look nice seem to be cheaply constructed (for instance on one stay some of the grout from the shower was peeling off, which is odd I think given how new the place is). Good service.   I really like their gym though. Concept 2 rowing machine, dumbbells, LOTs of cardio machines. They really just need a squat rack and barbell, and they'd be set. The gym was a little on the crowded side for a hotel gym... I think they actually open the gym up to non guests, based on the fact that there were people showing up after work and getting changed in the hotel rooms.  Just a warning to check your invoice. The last 2 stays, I've been charged for stuff that I didn't use. Last stay it was $50 for minibar, and the stay after $144(!!!) for one night's valet (I don't even have a car here). They did reverse the charges after I called.  My only complaint is that the housekeeping is a little inconsistent... some stays I get mouthwash, some I do not. They used to supply toothbrush, but that has stopped. On my very first stay, I got a few pieces of fruit, but that has not happened on subsequent stays. Some days, the espresso coffee pods may be ALL decaf!!"}
{"text":"What a beautiful hotel! My friend rented  room for her bachelorette and wow ! This place is gorgeous! YOu feel like your somewhere else ! You walk in, and your instantly greeted by people playing classical music on instruments. Wow. Rooms are lowly and have a great offering of room service and bottle service. Only downfall really is that you need a key to use elevator so if your a guest (as I was at this time) of a party or etc. it's a pain to have to go up and down multiple times. I also love how they have a great resto- momofuku attached. Super swank."}
{"text":"Amazing hotel, service and rooms!  Everything at this hotel is beautiful and high end!"}
{"text":"Enjoyed a lovely wedding here and was delighted by the service and ambience in their event rooms. The food was also delicious and pretty looking. Their service was top notch and they were always quick to fill your glass or take your finished plates. Definitely wowed by the experience."}
{"text":"I came here one time and enjoyed a glass of white wine in the front lobby area.  The seating was very comfortable, the atmosphere was relaxing with nice soft jazzy music playing in the background.    Lastly the service was okay.. I had to wait for the server to finally approach and ask if I wanted to order. After 10 min or so.    Nice relaxing atmosphere with free wifi access.  The staff working in the front was very friendly and accommodating.  I enjoyed my little experience."}
{"text":"I have been here on a few occasions when the somewhat unfinished lobby opened up for the first time during TIFF 2012. The lobby bar is expansive.  Huge.  And they have nightly piano bar entertainment. The drinks are pricey and the food (I heard) was good but my friend said, \"it' was alright..I just wish there was a lot more of it\" The mini-encyclopaedia of drink they give you at your table is impressive enough and worth a gander.  I have seen some of the suites and they are approximately as luxurious as you would assume them to be. There are a couple restaurants on site that I haven't been to.  I am reluctant since I heard momofuko was really underwhelming.  I have been to the original Cdn Shangri-la in Vancouver and I have to say it is MUCH nicer and MUCH classier compared to the Toronto version. The Toronto Shangri-la kind of.... looks cheap in my opinion.  It has some interesting decor but all the finishes somehow look second rate.  This is not one of the better hotel lobby/bars to spend your time in.  pass"}
{"text":"We had an impeccable staycation, we checked in the concierge had a great room set with a bouquet of flowers waiting in the room.  The spa was fantastic, the first time I received a true deep tissue massage in Toronto and my wife had a spectacular prenatal massage.   Dinner at boosk was exceptional, the food and service could not be topped (see my upcoming boosk review) our server Trevor and the manager were both really nice, engaging, and accommodating, there is absolutely nothing I would change as they are perfect!   I Highly recommend Shangri-La Toronto"}
{"text":"Great spot for afternoon tea as their lobby is beautiful. The downside is... it's in their lobby. There is a lot of foot traffic, especially from those trying to find Momofuku. They have live music in the evenings, which is a nice touch. For the price, I don't think high tea at Shangri-La is all that worth it... You can get bigger portions of the mini sandwiches at other places for cheaper. The service was pretty good, but I don't think I'll be returning based on the price alone."}
{"text":"Came for snacks and drinks on the evening of December 31. Asked for dimsum fromthe snack menu. They were not willing to give a mix of prawns and mushrooms. One could only choose from pork, mushroom, or prawns. Server took the order and then came back advising that they do not have any dimsums since they had too many orders. Asked for a manager and a lady who said she is a supervisor told a new story that their steamer was broken! We just ordered the sliders and drinks. Disappointed since we were there only at 6 PM. Too early for an institution like Shangrila to run out of snacks  and a clumsy excuse of a broken steamer."}
{"text":"Their servers can realllllly improve on the level of service considering $45 for the Easter high tea.  While I certainly don't appreciate our waitress who seem to have had a attitude problem, no smile, just blank stares and spoke under her breath as I had to repeatedly ask her to repeat herself numerous occasions.  She certainly never came to check up on us once.  She showed not the slightest hint of enthusiasm in her job especially when introducing the food presentations.  Hmm...  I appreciate the ambience of the high tea lobby and especially the trendy fireplace area.  We came here for my birthday and waited about 10 minutes while they setup our table despite having reservations.    The one thing I do rave and send high compliment is to the cream of earl grey tea that I had selected.  It was the best I have tasted in my life, very rich nutty flavour.  The finger sandwiches were tasty but nothing too extraordinary for high tea.  Scones were average good and the brioche buns were under average.  The top tier desserts were very much so disappointing.  It was overly sweet, cake was on the dry hard side."}
{"text":"Lounge area is nicely appointed and very comfortable.  The raised fireplace is a nice feature.  Service was fantastic, staff are very approachable and always eager to please. Rooms especially those on floors 5 and above have spectacular views of the city.  The bathrooms in the suites were impressive...very spacious and I liked they provided L'occitane products.  We only used the lounge for drinks, not food but the drinks were expertly prepared.  Hallway furnishings, carpet and phone desks are starting to show a bit of wear.  Gym and pool (skylight features)  facilities are outstanding and well worth taking advantage of during your stay. This is the first Shangri-La property I have visited so not sure how it compares to others."}
{"text":"We stayed here for our 15 year anniversary celebration and couldn't be happier.  They sent up dessert and wine for the celebration.  The hotel is beautiful and centrally located.  The concierge staff is very helpful for making plans.  We will definitely be back!"}
{"text":"Absolute superb staff that was very accommodating. Stay in their suites and it was spacious and the facilities which includes a 24 hr gym was awesome.  Pool was very nice and again their spa and pool staff was great.  Walkable to shops and tourist sites.  Right across from the great night lI would definitely recommend staying here. I would give it a solid 4  1/2 stars but since I can't choose that I'll give it a 5 because it's way better than 4 stars."}
{"text":"Beautiful, elegant hotel with comfortable beds and exquisite service!  The lobby is always full of energy with people mingling and enjoying cocktails.  All services were top notch and only hope I have the opportunity to stay here again."}
{"text":"I wasn't a fan. I know everyone seems to love it, but I did not. I found the crowd and ambiance to be stuffy. Too many people trying to pretend they're a big deal and be showy. Lots of people felt fake to me. (I'm looking at you girl in white fur twirling an umbrella obnoxiously the whole time). I was glad I didn't use valet, as it was backed up. (Parked down the street). Made for a quicker exit once I had enough."}
{"text":"Best high tea in Toronto. You get to choose your own tea pot and the appetizers were amazing. I would definitely recommend coming here for your first high tea experience. From sandwiches to dessert to great customer service."}
{"text":"Beautiful place, great service, detailed oriented. Even if different team members served me and my friend, each made sure to follow what we had.  In this day in age, information exchange to keep top level service with your customers is something very rare. Chapeau.  I didn't find the prices that high. If you take in consideration the location, service, beautiful foyer, live band, and great service, these prices are just."}
{"text":"Loved it. We went there for high tea and it was one of the better experience. I say that because we initially booked to go to Casa Loma for high tea and turns out they lost my booking and cancelled it a week before the event.   I've also been to quite a few other venues for high tea and Shangri La really lived up to it.   I am lactose sensitive so they made me high tea cakes and pastries without milk!! How very thoughtful. All the other places usually just tell me I should not eat instead.   The service was great, atmosphere was nice. I would definitely go back for more."}
{"text":"I have never actually stayed at this hotel, only been here a couple of times for events.  The lobby is very cool, feels like you are in a movie or something. They usually have the fireplace roaring and tons of chic people hanging out socializing and enjoying cocktails. The last time I was here they also had live music, which was awesome.  I have had drinks and food here, both were great. Most recently I was here for a whiskey tasting, which had passed hors d'oeuvres. I loved the pulled duck mini sammies, beef burger sliders and lobster spring rolls.  Should also mention the service level of the staff who work here is excellent. If you ask where something is, they physically walk with you to wherever it is you were looking to go. If I ever need to stay in a hotel downtown, I would try this place!"}
{"text":"Attended the high tea service in mid December and it was definitely worth it. The sandwiches were AMAZING and the desserts were Nutcracker inspired. Very original and delightfully filling."}
{"text":"Came here for drinks on a Saturday night, and was blown away by how beautiful this hotel is. We had our own table with comfortable, spacious chairs to enjoy the fantastic live music. The drinks were exceptional - delicious cocktails (especially the pear ginger one). The waitresses were very attentive and quick to offer a refill as soon as we were finished.   I will say, however, that $18 for a cocktail is insane. My second complaint is that we were there for two of my friends' birthdays, and had ordered two little birthday cakes to come part-way through the night. Instead of surprising my friends with the cakes, one waitress came and laid out 6 plates with utensils FIRST, followed 10 minutes later by two other waitresses holding cakes (no candles) and awkwardly saying \"So um, we have your two cakes here... who are they for?\" COME ON, Shangri-La! I would expect so much better from you.  All in all, it is a swanky place with great cocktails, but be careful if you are going there for a special occasion! They may just disappoint."}
{"text":"We went here for the Nutcracker high tea yesterday. Beautiful presentation of everything, but the taste of the pastries/sweets portion was lacking.  My friends and I all agreed that the finger sandwiches were very tasty, especially the mini lobster roll, but the cakes and mousse weren't really that great. Even my friend with permanent sweets cravings didn't feel like eating all of the cakes. I think we agreed that the only on that was okay was the marshmallow gingersnap cake.  In addition to food, you also get your own personal pot of tea. My friends and I all chose black teas. The Blue Mountain was pretty good at first but became really tarte after being steeped for a bit too long. I really liked the Kenyan Purple tea. My friend got the $15 Chinese black tea but she didn't like it at all. It smelled like a Chinese herb shop/bitter Chinese medicines. She only had a few sips and then left the pot untouched.  My friend has a nut allergy, and they gave her her own portions and a few replacements for some of the treats that may have nuts in it. Super nice of them!  It was a good experience, but for $60 a person, this isn't really something we would do often, especially not if the food isn't all completely amazing."}
{"text":"I came here to meetup a friend for drinks at the lobby bar. The lobby bar is quite pleasant, with 3 different areas (windows overlooking University Avenue and then adjacent to the concierge. On the evening I went, there was a piano performer to liven up the place. This place is very subdued and good spot to meet someone where you will not be interrupted by noise or other people.  They have a long selection of cocktails and a good selection of wine. I ordered the Italian red wine and enjoyed it. It had an oak aroma."}
{"text":"I came here for NYE (December 31, 2014) to have a nice getaway with my boyfriend.  This hotel is absolutely gorgeous. With a very modern and chic appeal to it, this appearance of the hotel and service of the staff definitely makes you feel like a million bucks.  When we arrived, our room (1715) was not ready, but the staff did not make us wait (+1). One thing that I have found with a lot of hotels around the world is that in a situation like that, they often make you wait...and wait...and wait, and wait , and wait for your room to be ready. Shangri-la's policy is not about that. Instead, they moved us immediately to another room, 1415.   Note that rooms go through 2 rounds of cleaning to make sure that they are absolutely perfect for guests. They do an initial round of cleaning, and then an inspection to make sure everything is good.  Our room, 1415, was a one bedroom suite. The room had a great view of University Ave. As stated by other yelpers, by mindful when booking a room, and be sure to request the view of University Ave./momofoku as most other angles of the hotel have obstructed views.  The living room was very cozy. Both the living room and the bedroom had 2 floor to ceiling windows with views of University Avenue. In addition, there are automatic shutters for the room (shears and blinds) for full blackout of your room to help you sleep at night. There's a TV in the bedroom that addresses you by name on the screen when you turn it on (niceeeeeeeeeeee), with full cable (free) and \"pay per view\" service of movies - I believe that each movie in the selection was approximately 12.99 (don't quote me on that price). The hotel also offers free WIFI for 6 days free of charge for hotel guests.  The bathroom had a remote-controlled television in one of the rooms. With all of the crazy futuristic gadgets and do-dads, I was a little surprised that the lighting in all of the rooms were not \"clap-ons\". xD.   My only negative comment about the entire hotel was that the beds were really uncomfortable for sleep. I'm used to pillowtop feel, with extra soft pillows. My boyfriend said that he felt that the sheets felt very thin. We both had difficulty with the pillows, as they were super high (uncomfortable with the neck - felt like my head was against my left shoulder when lying sideways on my right side). Though, this inconvenience never really affected my outlook on the hotel, as a whole. I just advise you to bring your own pillows in case you ever find you're in a position where you find the same.  We also visited BOSK - the hotel restaurant (we had a little mishap there, also... I had called to make a reservation two days prior, but I guess the woman that I spoke to never wrote it down, but I'll talk about that in the review of the restaurant).   The hotel lobby had a big NYE party as well, with sexy red and blue lighting all over the area. I regret not staying for that party, but it's nice to see that they like to give their guests an all-in-one experience (A+).  Be mindful that if you drive, there's a sneaky entrance on Adelaide on the left. Valet for one night will run you at $48 CAD. Note that this price was not inflated due to season or time of the year.   Overall it was a very pleasant experience and I couldn't have asked for a better way to spend my NYE. I'm very grateful to have had the chance to stay here."}
{"text":"Came to the lounge for dinner/drinks and what an increeedible atmosphere! The Pretty in pink sangria was amazing and the food was decent, but by far the best part of this place was the live jazzy music and the vibes. Lively yet cozy. Quite a fancy place and I was seriously underdressed (came here bc we were too late for our reservations elsewhere) but I still had an amazing time. Great for catching up with old friends over drinks. The calamari and veggie tartine weren't spectacular but I enjoyed every moment of my experience and I think the lounge is worth of the 5 stars. Would definitely come again! (NOT WEARING SNEAKERS!!)"}
{"text":"I had the pleasure of attending high tea in the beautiful Shangri-La hotel. Never having had the high tea experience before, I was a little unsure of what to expect. Of course I'd heard all about the delicate sandwiches and pastries and how it's all formal and classy (so no jeans). Beyond that, I was a little nervous that I would laugh too loudly of use the wrong tea strainer. Do I pick up the cup and saucer? Remember not to slouch. What if I take a bite of one of the little sandwiches with the crusts cut off and a piece of watercress gets stuck in my teeth. Is it rude to ask for a toothpick at high tea? I'm gonna say yes.  All jokes aside, when we arrived, we were treated very nicely and although there was definitely a formal air, it was by no means stuffy or snooty. It was a very relaxed atmosphere. People were laughing and having a nice time. I think that having it set up in one corner of the bright, spacious lobby gives a much more open and relaxed atmosphere. There was a long gas fireplace in the centre and huge black and white paintings on the massive pillars. The tables were coffee table height (or I guess in this case, tea table) Comfortable armchairs made it easy to relax and linger over your pot of tea. The tiered plate of goodies was just beautiful. There were several types of savoury sandwiches, fresh scones with whipped cream and jam, and delectable desserts that were as pleasing to the taste as they were to the eyes.  The service was excellent. They were always ready to answer our questions or offer extra hot water for the tea and she checked on us several times to make sure everything was just right. We were seated right by the piano but did not find the music was too loud. In fact, it was a really nice touch! Overall, it went beyond going to a nice place to have tea. It felt like more of an event or an experience. I really appreciated that because we were celebrating a special occasion. I'd love to go here again."}
{"text":"We walked into the lobby here after our dinner next door, for a few drinks. It's a mature crowd, and it was nice and calm on a Monday night. The guy on the Fazioli kept us entertained and the service was very good, as you would expect from a 5-star hotel. Certainly worth it if you want to lounge and sip on some fancy cocktails."}
{"text":"Stayed here 26 to 28 May 2017.  The hotel is top notch and the staff are engaging.  There was a love band in the lobby both Friday and Saturday nights."}
{"text":"The Lobby Lounge at the Shangri-La Hotel in Toronto is definitely a great place to relax and have a few drinks. Beyond the great upscale cozy lounge atmosphere with live entertainment and multiple fireplaces, the service is fantastic.  Their desserts are to die for! The presentation is absolutely gorgeous and the flavour profiles are super delicious. It may be a little pricey for some but you may change your mind once you try it. Everything I tasted was lick-the-plate good!  Warm Bread Pudding huckleberries and malted milk ice cream  Mango Passion Fruit Crmeux lime curd, coconut cream, marinated mango, coconut lime sorbet  \"B-Wall\" Honey Poached Pears walnut financier, milk chocolate, ginger molasses granola, spiced pear sorbet  Dark Chocolate Fondant smoked tea infused chocolate, graham crisps, sponge toffee, marshmallow ice cream"}
{"text":"Came to Shangri-La for the first time doing High Tea with a few university friends for some reunion time. It's in the Lobby Lounge, so in terms of space it is definitely a bit louder only because there is traffic in the lobby when people walk around. HOwever depending on where you sit you could be away from some of that noise. We reserved for 5 people and they put us kind of in a long U shape, which we didn't find that comfortable, so after a while, one of the girls moved to the opposite side so it was more of a shorter U and people could talk across each other with less awkwardness.  For 40 dollars per person (there is a 2 hour seating limit), each of us gets one pot of tea - basiaclly anything in the 15 dollar range is included and any of the other choices you just pay the difference to upgrade. They had many types of tea, and for people who like to pair foods with tea, it usually starts from the bolder teas and then to the lighter teas at the end. I love bolder teas, so naturally i went with a dark tea - royal earl gray. My other friends ordered the Chai, vanilla rooibos and earl green. The teapots are quite large, and they have a little tray to filter out any tea leaves as you pour the tea into your cup. I drink a lot of tea, so naturally i did finish the pot, and i asked htem to refill it with some more water, but obviously second time around the tea was much tamer. They give you milk to serve with tea if you like.  My friends had a number of restrictions; one of them coudlnt' do seafood, the other two wanted vegetarian options, so when they brought us our food, they did it so that all of us had the same top two tiers, but it was the bottom tier that was different.  Regular choice was curred lobster roll with chicken salad SW, cucumber SW and an egg SW with some deli meat on it. My friend who doens't eat pork/seafood, had a tomato filling in her roll, along with the same egg salad SW without the deli meat. My two other friends who wanted vegetarian had the tomato filling roll as well, cucumber SW, egg SW and a roasted mushroom SW in place of chicken salad.  As for the top two tiers, all of us shared the same items. HOwever, becuase it was 2 and 3, we had a bit of a rough time trying to separate into 3 portions; in the end two of the items we split into 4 anyway and then whoever wanted a second piece took it.   I started at the bottom tier and ate the SW, the curried lobster roll and the open egg salad SW. egg salad is what you would expect, but the bit of deli meat on top gave it a nice twist. the chicken salad was good. i loved the cucumber SW. But the curried lobster roll really hit the spot. it was delicious!   IN the middle tier was two types of scones with jam and butter. delicious. the scones were soft and fell apart easily when you cut it open, plus some of the butter and jam, it was a perfect match.  The top tier i saved for last, because it was all the sweets. They had this mango mousse with some kind of apricot filling in the middle , shaped in a dome. delight to eat, it was very good. They also had an eclair that had some caramel and nuts infused into the creme and it was really good. they also had one piece of what i would call to be a tart napoleon. i'm not a huge fan of napoleon myself, but i liked the tart factor which gave it a nice twist. lastly, we each had a little cup of chocolate mousse with some chocolated coated crackle on top. I had a feeling that was the most decadent so i did save it for last... it was indeed a wise choice :)  All in all, the atmosphere was quite lovely. After we sat for a while, someone actually opened up the piano and had played for a while - quite enjoyed that music! Also we were seated near a fireplace, the decor was very pretty, chairs were not as comfortable (we all ended up sitting at the edge). but the food, service was excellent and all of us were suprisingly walking away super full (none of us had really eaten lunch prior to the high tea).  Definitely would consider coming back again!"}
{"text":"We stayed here for Valentine's weekend and it was great. The room was beautiful! So spacious and nicely decorated. The bed was amazing and so comfortable, we didn't want to get out of bed in the morning. I loved how big and beautiful the bathroom was it made me feel like a queen.  The only complaint I have is that we called down to ask for a bucket of ice to chill some champagne 6 times. It took over an hour to get the ice and eventually we just went downstairs to the bar and asked for it ourselves. A little unexpected since this is supposed to be a hotel with great service.  I would stay here again, but would get my own ice instead of calling..."}
{"text":"I came here with my husband on a nice Sunday afternoon for some afternoon tea. Although no one greeted us, we were both welcomed warmly  once we inquired where it was located. Just a heads up, it's a lobby lounge.     The pastries and sandwiches were tasty. There were a lot of teas to select from as well, and a professional pianist  playing his heart away.   I wouldn't go back only because it's in the lobby. There's a lot of traffic, especially if you're sitting near the entrance area where we sat."}
{"text":"From beginning of my stay to the moment I checked out, my stay was fantastic.  The Shangri-La Hotel in Toronto feels upscale and looks beautiful.  The lobby is an open area with a grand piano and fire place.  In the day, guests sit around reading the paper and chatting.  At night, it's lively and people listen to live music while sipping on fancy drinks.  The room was exceptionally clean.  I actually checked out the floors and corners since I have a baby staying in the room with me.  Amenities were excellent and the dcor was stylish/comfortable.  The staff were helpful and friendly.  I dealt with about 5 different people and they were all wonderful.  No complaints!"}
{"text":"The worst experience in a lounge I've ever had in my recent lifetime. I was moved, shuffled from table to table - I had a waitress actually plop down a 'reserved' sign on my table while I was sitting there with no explanation.. WTF? Whilst being shuffled around arbitrarily, the pianist played at full volume and the servers never offered to move my drinks ever.. despicable service levels for an overpriced, bloated self important lounge.. I'm disgusted and will never return!!!  As a guest of the hotel and a frequent visitor, this treatment is a game changer. I will never book my colleagues and friends here ever again."}
{"text":"I travel a lot for work and although I'm a Westin and W Hotel fan personally, I decided to stay at the Shangri-La Hotel. And not to my surprise, I'm glad I chose to stay here.  The hotel is very stylish and you are greeted with great customer service each day. Although the rooms are a bit smaller than what I'm used to, the amenities and bathrooms are quite beautiful. The best part for me is when I arrive on Mondays to my room, greeted with chocolate treats on my desk!  The key factor for this hotel is also the widely spaced gym, full of all the equipment you need to get by and a nice pool to jump into one a week."}
{"text":"Out of sheer coincidence, my visit to this hotel happened to be the second consecutive weekend I was staying at a Shangri-La (the previous weekend was halfway around the world in Taipei). Although the hotel is right on one of the main thoroughfares through Toronto's core, the actual pickup/dropoff area is on the less-trafficked street a block over, making it easy and convenient to get in and out of the hotel. The lobby is pretty relaxed, with a fair number of tables set up for afternoon tea, along with a piano that will see a fair bit of use once you get to the weekend nights and the floor is packed with folks who are out on the town. Similar to the understated entrance, the reception desk isn't really much of a desk at all as opposed to a small area off to the side. The covered stream with koi adds a touch of Asian flair to the setting. There are plenty of elevators to get you up to the rooms, as well as to the fitness center, which has plenty of machinery and equipment, as well as a small outdoor deck where you can cool off and enjoy the view of the CN Tower.  As for the room itself - I wouldn't quite put it at the same level as the Taipei Shangri-La, but it was still very nicely-appointed. I enjoyed the long hallway back to the main part of the bedroom, along with the heavy Asian-style door leading to the bathroom. Both are reasonably well-appointed, with the bathroom clocking in a bit larger than average (and the two sinks are a nice touch). I was less a fan of the shower, which took a bit for the hot water to warm up, as well as the fact that it's a fixed nozzle - so it becomes a bit difficult to maneuver around if you don't want to be doused with cold water right off. The bed was comfortable, although I was less a fan of the shades - they didn't have any sort of electronic way of getting them open, so it required a lot of manual pulling on the cord to move it up and down. I would also say that some of the amenities (like those in the closet) felt a little on the older side - for a higher-end chain, I was expecting things to feel a bit newer, but some items seemed a bit aged. Power outlets were also not in the most convenient of spots relative to the bed either.  Overall, though, I did enjoy our stay here, and I would almost certainly come back given the convenience and centrality of the location. With a very reasonable rate while we were here, I would be hard-pressed to consider something else nearby. Bosk (the restaurant) is overall quite good, and especially when the lobby isn't filled with people partying it up, it has a very serene and calm feel. Definitely worth a stay to come back for."}
{"text":"My husband and I had the pleasure of staying here on a recent weekend trip. From our very first step in the door, we were greeted by a friendly and attentive staff, and this level of attention was sustained throughout our stay.   Our room was well appointed and luxurious, without being gaudy or over the top. I was thrilled to find a box of macarons waiting for us, along with a hand written note from the hotel manager. Each room is equipped with an ipad that controlled everything from the lights to the thermostat. The bathroom was gorgeous and had a tv in the mirror- now that's an amenity! Although we had to wake up early on the day of our departure, the amazingly comfortable bedding made it impossible not to steal a few more minutes.   Maybe I'm a rookie traveler, but for the price, I feel like a hotel with appointments, staff, and service like this (our slippers had been laid out, and our bed turned down when we returned from dinner), deserves no less than 5 stars!"}
{"text":"The lobby bar is FANTASTIC. There is live music nightly and the ambiance is sophisticated and lovely. The service can be a bit slow at times, but other than that this place is a must."}
{"text":"Business stay!  We just spent two nights last February. The bed was fantastic and the bedding and pillows were top notch. I prefer in TO than Vancouver. Great location too."}
{"text":"I can't think of anything lovelier than a trip to the Nutcracker ballet followed by Nutcracker high tea at the Shangri-La. Reserved months in advance, the place was packed with people wandering in trying to snag tables. Lovely, pristine restaurant right down to the washrooms.  The service was excellent and the pianist was very skilled. The food was great and they made my kid a special tea to accommodate her allergies. The sandwiches were good, scones better (especially that jam!) and desserts yummy. I liked that it was a reasonable sized tea and not overload. My favourite was the Yule log which was chocolate, coffee and Bailey's flavored. Mmm. My kid loved the scones best.  At $75 per person including Prosecco, this is fairly priced all things considered."}
{"text":"I had the femme fatale drink. It was delicious for $22, but I wish we could get a seat at the lobby bar. We had to sit in the bar and couldn't see the singer. Apparently they take reservations, which is good to know for next time."}
{"text":"Lobby area is lovely. Excellent service."}
{"text":"I came to the Lobby Lounge for high tea on Mother's Day weekend. The price is $46 for savoury sandwiches, 2 kinds of scones, and petit fours plus a big pot of tea. The tea menu is extensive. I went for the Dragon Mint which was fragrant and not too strong (the server lets you smell the tea before pouring). There are different price ranges for the tea, so if you go for one of the more expensive ones I think you will have to pay a supplement.   Beautiful lobby with plush seating, live music (on this occasion, a pianist and the later a talented young singer who did acoustic covers), high ceilings, and great people watching. They say there is a seating time limit of 1.5 hours, which had me a little worried because it took them over 15 mins. to take our order and maybe 30+ mins. until food arrived! While our tea had a slow start, the rest of the experience was excellent in terms of service and food. (I think there was a bottleneck as the place was really busy that weekend). However, they did not kick us out after 1.5 hours. My DC's and I actually stayed for almost 3!   In terms of food, my favourites were the lobster brioche rolls and the chocolate mousse cake with a crispy, coffee flavoured base. The scones, always a litmus test of high tea, were fluffy, buttery and soft.   I would rank Shangri-La alongside the Ritz as one of the best spots for high tea in the city! I'd come back for sure, especially as they sometimes have themed high tea menus (e.g. they did one for the Lunar New Year)."}
{"text":"the new kid on the block-- hello shangri-la!  the decor is so classy, the interior design is spectacular. doormen are all very friendly. perfectly located. what else could you ask for?  The rooms are pleasant enough, exactly what you'd expect from a swanky hotel like this one.  I LOVE the fitness facilities. Here's the scoop: in terms of machines, it's got quite a few weight machines, one erg/rowing machine, a lot of treadmills and ellipticals and bikes, one \"ski elliptical\", and a lineup of lemond spin bikes. The standard machines (treadmills, ellipticals, and bikes) all have a personal screen with tv and web surfing (really?! I can check my email while working out? is there no way to escape productivity any more?!). I've tried a number of them out and they all work as they should.  There's also a studio for yoga/pilates/spin classes (which I can't say anything about, since I haven't attended one). You need to pay for these. But when there is no class in the studio, you are free to use it however you like. The studio has a mirrored wall, a barre, yoga matts and blocks and cushions, lemond spin bikes, and a speaker system that you can plug your own iPod into.  The one disappointing thing is the pool, which I guess to be around 20ft long and quite narrow. It's a very nice ambient/recreational pool, with coloured mood lighting and everything, but it isn't great if you're trying to do a workout. Around the pool there are also little curtained cubbies/nooks, each with its own tv. I guess the idea is that you can hide yourself in there, draw the curtain... ... ...and... watch tv, of course. There is also a jacuzzi to accompany the pool, as well as a sauna.  The changerooms both have an individual steam room. They are well stocked in towels but unfortunately the showers leave a little to be desired. There is no place to hang clothes in/near the showers without the clothes getting wet. As such, I still have not figured out the best way to shower without dancing around the changeroom in all my unclothed glory.  There is a spa right next door as part of the facilities, and the spa uses the steam room and saunas as well. As of right now, there are no problems, but as the hotel gets more crowded, I can't help but wonder if there will be enough room for everyone in these areas.  As for the restaurant inside, BOSK, check it out here... http://www.yelp.ca/biz/bosk-toronto#hrid:VvrT5fg6lfshN2N8paq_tQ/"}
{"text":"The review is only for the lobby bar (unfortunately haven't had a chance to stay at the hotel)! This is a really lovely place to come for a drink. We were there on a Friday evening, and there was live music, a small band with a singer playing covers of lounge-style music. There's a good selections of drinks and you're served a small plate of complimentary snacks (nachos and wasabi peas). Drinks are expensive (glass of wine in the range of $18-$20) but honestly probably worth it for the ambiance!"}
{"text":"My partner and I have been staying to this property for 6 days. It was the 4th Shangri-la we have been staying at and were curious to see how it would fare in North America.   Our arrival at the hotel was seamless. The valet helped us with the luggage as soon we pulled and were greatly prompted at the front desk. Check-in took less than 5 minutes and the front desk employee went up with us to the suite, which is a nice touch. It would have been nice to be told we had free breakfast as diamond members but we found that out shortly after.   We had a king room with a nice corner bathroom giving on University Avenue. Both the bedroom and bathroom were spacious and well appointed. Only issue was that housekeeping forgot to take an empty water bottle from the previous guest and some clothing price tags in plain view.   Another issue was that 2 days in a row they forgot to bring new bathrobes and to offer cutlery with the fruit bowl in the room. Even though it sounds trivial, we were expecting a better attention to details that we got accustomed to in their Asia and Middle-East properties. Thankfully enough, once brought to the attention of the manager, it was immediately corrected and we were graciously offered a free dinner and a bottle of wine, which in the end made up for everything.   The employees were all very courteous and eager to make sure our stay was a pleasant one. They were also very friendly yet professional and it was clear they enjoyed working there.   We had dinner and breakfast at the Bosk restaurant, which I strongly recommend, the food was of high quality and the service impeccable."}
{"text":"This review is only for the afternoon tea service located in the hotel's lobby lounge.  At $300 plus a night, It doesn't look like I'll be staying here anytime soon. Pros: Excellent service Food was well done and presented Extensive selection of teas  Cons: desserts were not proportioned per person  I had the day off yesterday and decided to take my GF to afternoon tea here.  Reservations are required and they will need a credit card to hold the table for you.  There is a 1 hour and 30 minute seating time limit but it's really on enforced on the weekends if they're super busy.  Being held in the lobby of the Shangri-La, it's a very upscale feeling experience.  The afternoon tea is set up right in the lounge of the hotel.  They have chairs and tables available, but there are also couches and tables set up as well.  I actually prefer the tables to the couches.  While the couches appear more cozy and comfortable, they just weren't comfortable at all for me.  To sit and have tea as well is touch when you're not comfortable.  My personal opinion here  You're presented with a menu right at the beginning that lists all the teas they have.  They have a huge list to choose from.  My GF says most places only offer about 15 teas to choose from.  There must of been close to 100 teas to choose from here. If you're a tea buff, you love the choices to choose from. The teas range from $15 to $70.  The $15 teas are all included, the more expensive ones will be an added charge.    The food quality here is excellent.  It was well presented and tasted good.  The scones were freshly baked.  They were soft and warm on the inside though not as good as my GF's.  (sorry everyone, I had to put this in for my own good.. lol)  The sandwiches were all very unique and again well done.  The dessert were the stars of the show.  The only problem was they don't give you one of each for every person.  We got 2 of only one of the 4 items on the menu.  We were only given just one each of the other 3 items.  Little weird.  You will need to share some no matter how many people you come with.  The service was excellent.  The servers were all very nice in answering all of questions.  My tea was iced and as soon as they saw the glass was empty, they came by to make me a new one.  They were very knowledgeable about the items offered and it was a great experience overall.    I like this place.  It was a much better experience than my last afternoon tea adventure.  I'd recommend this place to anyone who hasn't given it a try.  At $40 a person, it might not be something you do all the time though."}
{"text":"Please note:  this review is solely for the Afternoon Tea served in their Lobby Lounge.  I am always on the quest to find the next best place that serves Afternoon Tea. I still haven't found any in Toronto yet.   They all are pretty much about the same: mediocre and overpriced.     Well, Shangri La was quite good, better than your average, I would say.   The tea pastries were really good, quantity was small (actually, SUPER small), but quality was there.   Service was impeccable. A three tiered tray cost $32 and a pot of tea cost between $15 - $40.   I wish they had a tray of tea leaves selection to show you because then I would feel justified paying $15 for a pot of Earl Grey.  But the waitress assured us that the teas were sourced all over the world from their tea connoisseur, so only the best.    The Earl Grey was a good pot of tea with floral hints.   I felt like I was floating when I was drinking it.   Really, was a delicious pot of tea.  Lolz.  All I can say is come with a full stomach, because their Afternoon Tea selections are dainty.  Everything tasted really good, not traditionally good, but with a \"modern\" twist type of good.   We ate everything on the plates:    Bottom tier:  three fingerling sandwishes  Middle Tier:  A selection of in-house made pastries: mini cakes, macaron, etc. (probably around 5 mini items). Top Tier:  Butter Scones x 2 (their in-house made jam was delish!!!)  If you're looking for a \"traditional\" English Afternoon Tea experience, this might not be the right place for that.      They just opened doors so I will give them the benefit of the doubt that a lot of things are still in \"development.\"    I will definitely come back again for Afternoon Tea in a couple months or so to see if there are any improvements or just to try their \"daily\" sweets of the day. =D*"}
{"text":"This hotel is as close to perfect as you can get.  I had the pleasure of staying here all last week for work and it was my first time there. Mind you, it might be just a year old. Anyway, the customer service, amenities spa experience, the gym, Bosk Restaurant, the staff (I could go on and on) were all fantastic. The lobby is gorgeous and there is live music every night.  My room was opulent without being pretentious--every room had an iPad, the toiletries were from L'Occitane and there was even a television in the bathroom---on the mirror. Oh, I didn't want to leave but thanks for the wonderful experience!"}
{"text":"I travel quite a bit for work and will stay at Hyatt or Hilton because they seems to have the most locations. I'm a Hyatt diamond and Hilton Platinum so I know my hotels.  If there is a Shangri La within distance, that will be my first choice. The hotels are 5 star in my book. Service is impeccable, rooms are clean and spacious, amenities are top quality and they cater to your every need. One feature I particularly like about this chain is that they will have your room ready for you the way you like it. For example, I tend to like colder rooms. I request to have my rooms at a nice 68 degrees and they make sure it's set that way by the time I check in. Some might say, what's the big deal, but that shows they'll go the extra mile to make sure your stay is comfortable.  My first time staying at the Toronto one. Believe it's fairly new. Must say, I wasn't disappointed. As expected, everything was to my liking. If something was wrong, they immediately took care of it.   One oddity that irked me a slight bit was during checkin. My work colleague and I arrived early around 9am. His agent said his room was ready. My agent gave me the line that checkin is 3pm and that my room was not ready. When I questioned why my colleagues room was ready and he could go to it but I could not, she found me a room. I get it, there's procedure and I'm sure the room I was assigned probably was occupied, but unless the hotel is fully sold out, spare me the line about checkin being 3pm. Most people know it. Just try and find a replacement room or offer options. Just a suggestion. Other than that, to those may be reading this review, don't let this last paragraph deter you from staying here. It's a wonderful hotel and brand. Haven't stayed at the Trump down the street, which I hear is very nice as well, but I'll stick with Shangri La."}
{"text":"This review is for the afternoon tea at the Lobby Lounge.  We were hosting a bridal shower with 12 ladies and I would not recommend any parties here.  They were not very accommodating and the seating was awkward as we were seated at two tables far from each other.  The entire time they made us feel like we were a nuisance and reminded us that we only had a certain amount of time for tea before we had to go, so it felt quite rushed.  When it came time for the bill they could only split it 5 ways, which makes no sense for 12 people, so we said just give us one and we will pay.  The waitress neglected to tell us that a few people already paid for theirs on the side, so then the calculations were all off and caused a bunch of chaos at the end for no reason. About the tea service.  So a few people ordered according to their dietary needs which they said they could  but for all of them they just ended up making everyones vegetarian.  Also, on the menu they list all the things that come with the tea service, but some people had to share their desserts on the top tier and some got their own.  Seems confusing and not fair, as everyone is paying the same price.  I would definitely rather go to afternoon tea at the Windsor arms or King Edward.  Lastly, the scones make the tea service for me, and the scones were ok.  Maybe a 3/5.  Tiny and just ok."}
{"text":"Had a wonderful time here after the theater, for my daughter's thirtieth birthday. Nice place for people watching and snappy cocktails! If you enjoy Moscow mules, definitely order them at Shangri-La. Apps and desserts were delicious. Service was friendly and courteous."}
{"text":"That's the way uhuh, uhuh, I like it! Uhuh, uhuh!  So Shangri-la is definitely the la di da that everyone should be talking about.  We stayed for the night, enjoyed live music in their grand lobby, an immaculate breakfast in the restaurant and room service was extremely polite and helpful.  Did I mention there's an app to control lights, blinds, temperature, etc.  If you happen to be in town for business and just want to treat yourself make a stop here.  Even if it is just to ogle all the high end auto's parked out back.  You can also access Momofuku from the lobby without ever going outside.  Which I guess is great if you're an agoraphobe..."}
{"text":"TLDR: great quality. Highly recommended. And I need to learn how to be comfortable having tea time with the bros. Or solo.   A very nice hotel, but to be honest I didn't stay here. I came here for the afternoon tea. I often went to the soho house around the corner and was told this was a great spot so I found a date and made a reservation. I don't have the balls to show up to a fancy tea by myself or on a bro date so waited to have a special lady. Unnecessary detail, but important to me. Hahah I find the company really impacts your experience.  Backstory, I like stories, I'm a huge fan of afternoon tea. My first girlfriend introduced me to it when we were travelling through Hong Kong. Now it's something I search out to find, again, as long as I have good company. That said, I have tried many spots in Toronto, with the help of dating apps. Swipe right if you want tea. Or food. Just sayin. Unfortunately, Toronto has been a little lacklustre. This is definitely my favourite one so far, but I have yet to try to omni king Edward.   Now excuse me as I put on my pretentious hat. My name is literally Phil (love) Cha (tea). So gotta do the name right! There are lots of things I keep an eye out for. The cups have to retain heat and things should match fairly well. Aesthetic is key. Including the service. The taste of course is the most important. And things should match up well. If the plating and tea are great don't give me cream cheese on white bread. I'd like something delicate and not too heavy. Scones, Generally are my deal breaker. The Shangri-La does well in pretty much every category. It holds up with some of the best.  Since the company was lovely and the lighting was great. It was a pretty complete package.   Also, they do special teas and menus I think around lunar new year.   Enjoy tea lovers!   Ps the character for my (cha) isn't the same as tea but whatever. Cha Cha Cha  Pps for just tea, some of the best I ever had was infuse tea. Check that spot out"}
{"text":"Went for high tea with my grandma and cousin, and we had a fabulous time. The black teas we chose were delicious and the dainties were all hits and wonderfully crafted. The sandwiches were delicately balanced in flavour, the scones were fresh and fluffy, and the desserts were not tooth achingly sweet, which I loved. The service was great as well, and I would definitely come back! Ambiance was nice and tranquil, I just wish the valet parking for 2 hours was a bit cheaper! (It was $22.) Well done, Shangri-La!! What a great afternoon!"}
{"text":"Gotta love the Shangri-La. Service is excellent and amenities are excellent.   Only complaint is the lobby is drafty by design."}
{"text":"Location: 5 Service: 5 Room: 4   Stayed here for two weekends back in June. Like most Shangri-la hotels, this one does not disappoint.   Highlight:  1. Great location! Right next to Momofuku and steps away from all sorts of great restaurants, walking distance to Queen St w, walking distance to greyhound station and the TTC. It really can't get more convenient than that.   2. Nice, large bathroom with pristine marble floors.   What could be better: 1. This hotel was built in 2012 but the furnitures are showing some age. The oriental elements in the decor is a little bit too chinois-y, could be a bit more subtle (like the Shangri-La in London).   2. It's located at lower floors of the building. I stayed on the 9th floor during my first stay and it was so noisy on Saturday night that I couldn't sleep till 4am. Asked for a higher floor during the 2nd stay and it was much quieter.   A very positive experience in general and will choose to come back for future trips in Toronto.   Additional tips on Toronto hotels in my experience: - Four Seasons has the nicest rooms - Westin has the best view (of the lake) - Hilton (probably) has the best value - Shangri-la has the best room+location combination"}
{"text":"Went here for high tea with my best friend two years ago. The lobby is beautiful. I was so enthralled by the water feature built into the floor! There was live piano music and we were seated by the fireplace (even though it was summer).   We went with the peppermint tea and Sita Chai. I'm not a tea person (shocker for an Indian girl) but this was AMAZING and refreshing. Loved the chocolate notes in the Sita Chai.   The sandwiches were a little bit bland, wasn't too crazy for the desserts but the scones were heaven and I'm still obsessed with them!"}
{"text":"I have to say this is probably the nicest hotel room that I have ever stayed in to date.  The washroom were beautiful, the amenities were excellent.  The room was really nice and had beautiful decor but wasn't so over done that you felt intimidated.  I fell in love with the pillows like everyone else :)"}
{"text":"Shangri-la has officially become my favourite 5 star hotel in Toronto!  We decided to stay here the weekend of our wedding, simply because it was about $50 per night less than my old favourite, the Ritz Carlton. I am SO HAPPY we made that decision, because the Shangri-La is unbeatable!   I love the modern decor and Asian influences. I love that I can control the lights and curtains from an iPad on my bed. I love that beautiful CN tower view that I had from my extremely deep master bathroom tub. I LOVED the customer service - they both sent a limo to pick us up from the wedding reception (a beautiful white sedan) and left us champagne, truffles and French macarons.   I honestly cannot express how amazing this hotel experience was. You will be treated like royalty!   As an added bonus, our room came with complimentary breakfast daily at Bosk, and it was an EXCELLENT breakfast with so many options and fantastic, friendly service.   Friends, it is worth the money even for a one-night staycation. Stay in a suite, you won't regret it!"}
{"text":"Had a suite overnight...Decided to get room service and breakfast in bed.   I have to say the food was great not the best though. The omelette was delicious but the chicken sandwich was bland. Presentation and service were also ok. Considering this is a 4/5* hotel I expected a lot more selection and flavour. The restaurant downstairs is amazing though!"}
{"text":"Shrangri-La is a high end Hotel Chain that originated from China and the Toronto location is one of the two only properties found the Americas(both North and South). These hotels are the best examples of modern day palaces, this location did not disappoint. After a long and stressful day of traveling we decided to head over to the lounge located in the hotel lobby.The hotel has a very modern oriental feel and there was a live band playing all types of classic rock songs from Sting, the Rolling Stones and many other rock legends.   It was super busy and happening, but the hostess helped us find a seat and we were seated after a few minutes. They have a full bar and we decided to order two pisco sours, which were very refreshing but missing the typical Peruvian touch. Then we ordered kobe beef sliders, shrimp with scallop dumplings, and a side of french fries. The kobe sliders were delicious, the meat was perfectly cooked and lightly seasoned, while the buns were nice and crunchy, the french fries were a good companion. The dumplings were larger than usual and you can taste the shrimp and scallop while the texture was nice and smooth.   For dessert we had the pineapple and banana sponge cake, and in my personal opinion that was one of the beautiful looking desert I ever seen (yeah and it was really good too).I wish so bad we can get a Shrangi-La property in the US, especially here in South Florida.The staff are like your own personal assistant and they never say no to any request. This hotel chain is a primary example of high end hotel and resort should cater to their guest."}
{"text":"Love the spa, I love the way the RMT  do it here.  Also the tents beside swimming pool area is a gem in this busy city.  It's so relaxing here.  Note that they require spending over $200 in order to go to the pool area for free.  Or else there's a $25 fee."}
{"text":"There definitely isn't a nicer hotel in Toronto. I love this place! It might be a bit pricey but the staff, the rooms, and the overall atmosphere is fantastic!   I highly recommend that everyone stay here at least one time!"}
{"text":"I went to Shangria La for my friends birthday. I had a great time, the service there is fantastic.   I had the Moroccan mint tea and it was ok, I was expecting more of a mint kick but it didn't steep long enough I guess. They were really nice enough to get halal meat for the sandwiches and out party really appreciated that!   The desserts looked soooo soooo pretty and also tasted good :)   For high tea it's more of the experience that you go for and at the Shangria La you'll get that.   I look forward to going back for their strawberry tea testing that is going on until early June:)"}
{"text":"I have only been to the lounge in the lobby for drinks at night with a few friends. The drinks menu are in a neat little book case, with books of their selection inside, which I thought was really cute. The prices leave something to be desired. You can typically gauge the markup based on their alcohol. A 1oz shot of Hendricks gin was $12, and a bottle of Flying Monkey was $9, whisky was around $15. So you are essentially paying for the upscale atmosphere, which, of course, is beautiful and cozy. I guess this is a place you bring someone to impress, as there were many obvious dates happening between all the candlelights.  The live music was pretty good, as long as you don't sit too close, for the risk of not hearing anyone beside you. Service was very attentive and polite, as you'd expect."}
{"text":"Very, very good hotel.   Much like all of the other 'cool' hotels in and around Downtown Toronto - all with pools, great restaurants, chic rooms and stylish bars full of stylish people - this is probably a little level above those.   The furnishings are incredible. Bathrooms, beautiful. Bed, technology in the room, lighting, etc.   Lovely.   My favorite part is the healthclub and spa, which is top notch. Sauna, steam, lap pool, gym, robes, slippers, the lot. And the young indian gentleman who manages the place, treats it like his own business. What standout service. From a towel waiting on the floor in front of you as you turn around - the guy is incredible at making you feel welcome and in a manner so discrete you have to tip your cap, and him. And unlike SPG and some other chains - this is all available to guests without fee.   Nothing like a long sauna, then steam and swim before your morning meetings.  My new oasis in Toronto."}
{"text":"I love the Shangri-La Hotel.  The Momofuku Noodle Bar and Momofuku Daish? are fantastic but I'll save that for another review. I came to the Shangri-La Hotel after dinner for some drinks, desserts and live music.  It's really nice because they have live music with different artists on most evenings and weekends.  We came on a Saturday around 8:30 pm and the lobby area was packed. We did lucked out and found a table. It's first comes first serve no reservations.  My aunt and I both ordered the Pino Grigio ($15 each for 5oz)and my other aunt ordered the green tea.  Later on in the evening I had the peppermint green tea.  They have over 200 selections of tea! We also got the caramel mocha for dessert to share.  The dessert was small but very rich.   They also have wasabi peas and chips for you to nibble on.   The live music started at 9pm and they take breaks in between and it ends at 1 am.  That area closes at 2am. The service is amazing.  They never rush you to leave even when there's a long line up waiting for seats.  I love the line of artists that performed. I've been there 3 times and all three times the artists are so talented. Very relaxing place to go for drinks after a meal or for a date night. The drinks are pricy but seeing that you're there for a while it makes it worth it.  The ambiance of the hotel is very soothing and smells so nice. I would highly recommend coming here!"}
{"text":"I love the high tea  All the desserts are impeccable and the drinks at the bar are fabulous  Best service too"}
{"text":"Ostentatious crowd, very Hong Kong, and the $88 drink on the menu caters to those kind. They took our credit cards in advance so we wouldn't dine and dash without paying. Insulting and in poor taste. This is Canada, be trusting and friendly like us, not look down on us.  Food in the lobby lounge was nothing great, not much variety either, drinks too were average to below average. If you don't mind a $21 club sandwich that is. The dessert was pretty good though."}
{"text":"This is a very nice hotel in a great location. We were able to walk everywhere.  The interior is beautiful and the staff were courteous and professional. The room was clean and the amenities were plentiful. The fitness center is well thought out, not just tucked away in a corner.  I would definitely recommend this hotel."}
{"text":"High Tea  I have always wanted to have tea at a Shangri-la Hotel.  When we saw there was one on our recent visit to Toronto we just knew we had to go!  Nothing was going to stop us from experiencing Shangri-la's High Tea, not even having tea at another hotel just three hours prior to securing our tea time at Shangri-la's Lobby Lounge!  The Lobby Lounge is absolutely beautiful!  We found a nice spot right next to the pianist playing some of our favorite songs and got right down to business...selecting a tea.   THE TEA MENU  The tea menu has several black, green and herbal options.  If you are as picky as we are then they will bring the tea out for you to consider.  One of the teas we saw actually had popcorn in it!    We decided to get Spiced Chamomile and Tea of Life and we were both very pleased with our selections.  Unfortunately, Shangri-la was not able to sell us our favorite tea to take home with us.   FINGER SANDWICHES We have no shame!  Yes, we ate these delightful sandwiches.  No, we were not too full from our earlier tea that afternoon.  We can confirm that it is possible to have two afternoon teas in one day!   Here is what you get:    - Ham and brie with apple on marble rye    - Chicken Salad with whole grain mustard on wheat    - Egg Salad on white    - Smoked Salmon and cucumber with cream fraiche on white  All of them were delicious.   I don't think we can really pick a favorite--even the salmon was quite delish and you know how we feel about salmon!   THE SCONES The plain and raisin scones are served warm and I dare you to try to just eat one!  The addition of the devonshire clotted cream and berry compote are not even necessary but it just makes the entire experience even more memorable.   SWEETS  Best part of any par-tea!  Just point us in the direction of the sweets and we are ready.  The pastries vary depending on the season but when we made our visit, Lobby Lounge was serving the following:     - Peach Tarts    - Praline Bars    - Profiteroles    - Passion Fruit Macarons    - Hazelnut Breton  If these are not enough, you can always pick something from the \"sweets tray\" a'la carte.   It goes without question that the High Tea in the Lobby Lounge at Shangri-la gets two pinkies up from us.  Our second tea was twice as nice and we are so ready to visit again!"}
{"text":"I have only stayed in Shangri-la's when traveling in Asia, but I really enjoyed the experience in their Toronto property. Great rooms, amenities, and service."}
{"text":"The high tea is amazing and super festive. The sandwiches were delicious especially the egg truffle. The scones were to die for and the desserts were all nutcracker ballet inspired. Totally worth it."}
{"text":"IF YOU WANT THE BEST... Shangri La Toronto is perhaps the best hotel in the world. Classy, sophisticated, phenomenal service, fun bar, great restaurant (Bosk) and more. There are so many things that distinguish this hotel: wifi is included as was breakfast with our package. Rooms are spacious and gorgeous. But every person at the hotel goes out of their way to make your stay extra special. Best hotel, highest recommendation."}
{"text":"Checking out of a 3 night stay today...and sadly I don't agree with my fellow Yelpers that this hotel is worthy of it's rating.  Let's start with the good: -- Check in was seamless and friendly. -- Due to our booking with Amex we were upgraded to a one bedroom suite. -- View from our room is beautiful. -- Room is quite spacious. -- Pool and gym are beautiful. -- Towels are nice and plush. -- Location is great.  Now the not-so-good: -- The rooms are definitely in need of an upgrade. Telephones are decades old, furniture is quite battered, and the pull out sofa bed is as hard as a rock. -- Room service messed something up 3 days in a row. (ex. milk wasn't brought with the oatmeal, etc.) -- Room service food is really bland and portions are tiny. (I weigh a whopping 100 pounds and don't eat too much, to provide some perspective.) -- We tried to have tea in the lobby lounge but we got up at left after seeing that the minimum price for JUST A POT OF TEA is $15. (The only way I could maybe justify the $15 is to have a view of Seine at the same time. And even then I'm not so sure.) -- Concierge didn't have very good recommendations, although they were VERY nice. (Don't go to 259 Host. This Indian restaurant was one of the worst we've ever eaten at.)  Overall I expected far more from the Shangri-La, especially at their premium pricing. Sorry for so much negativity but we definitely won't be staying here again."}
{"text":"This is the best place I've come across for large group functions. Usually, when food is being prepared for a large group, I'm prepared for the food to be okay at best, but it actually was very good here! The meat was not rubbery or overcooked, the sides and salads were good, the desserts were exquisite.   I also loved the mid-morning/mid-afternoon snacks - the yogurt with housemade granola and jam was DELICIOUS and I normally don't even really like that kind of thing. It inspired me to try making granola at home and having Greek yogurt at home! The scones they set out for the afternoon snack were also delicious, though I didn't like the fig jam. They also came with cream and a berry jam though, luckily!  If you ever have an all day or morning event here, they actually serve fresh-squeezed orange and grapefruit juices. All the other hotels claim to serve fresh juice but they came out of a box - I can tell! Shangri-La is the real deal.   The service is also very good, the environment is super beautiful, they provide an all-around lovely experience. Too bad they also are very expensive- you get what you pay for - so I've been told that my firm probably will not have an event here again. I hope they'll change their minds!"}
{"text":"I live in Toronto, but I love a good hotel so much that I will come up with any excuse for a staycation. Of all of the hotels in Toronto, the Shangri-La is now my favourite, and that is saying a lot.   They house Momofuku (ramen for life), they do a beautiful lobby high tea and most importantly they have the best service in the business.   I rented a lovely little suite to host a little hen-do for a friend, and they upgraded me to a Garden Suite free of charge. This suite was insane, with wonderful views and a huge garden terrace. We almost didn't want to leave and go enjoy our planned reservations."}
