{"text":"I have to agree with some of the reviews here. I came here for Summerlicious.
  
I\"ll start with the BAD.

Asahi Beer was not cold at all!!!!! Really, it was like you bought it at LCBO and walked home for 10min in the sun. Also, it came pretty late.

The dessert.... The blueberry gelato came half melted. Why???

The servers and staff are friendly but they looked often confused and unorganized. I think it's not them, but the owner should instigate better \"system\" and manual for good and efficient customer service. I saw food on counter waiting forever to be delivered to the table. When I got home after dining I noticed on my receipt that the server actually billed $1.3 for HST, not 13%. Fine with me, but I don't think it's good for the restaurant... They just need proper guidance. I think this shouldn't be a difficult fix. 

The GREAT

5 star food. 
Appetizer crispy rice was my favorite. I'll come back just for that.
Sashimi was good, too. 
Roll was good (I liked the rice) but a bit on the smaller side.
Pork belly was great, Filet mignon was good but it didn't taste fresh. (it had the old meat smell and taste) Sweet potato was too ordinary.
Has nice ambiance like you're in NY. 


The kitchen staff is great. Other department (servers, desserts, drinks) needs improvement! I'll come back!"}
{"text":"Great food. Went for summerlicious with a group of 6 and all the dishes were great. Sashimi was outstanding. 

I only bring down the rating because the hostesses are incompetent. They lost our reservation and it took 45 mins to get a table. I had the same conversation 4 times with the main hostess and she never seemed to remember the situation. Really really dumb and disorganized people."}
{"text":"I came here for Summerlicious in a party of two.

Course 1: Kinoko Salad & Chilean Sea Bass Dumplings
Course 2: Shibui Salmon Maki & Pirikara Ebi Maki
Course 3: Scallop & Veal Shoulder
Course 4: Asparagus & Cremini Mushroom
Course 5: Mango Gelato & Petit Gateau

There is something wrong with management. We had a reservation for 6pm and they made us wait - not even giving us a timeline of how long to expect when we asked. We weren't seated until 6:30pm. A family of three wasn't seated until 6:45pm. They didn't seem to care that we were waiting and didn't provide any apology. As feedback, some high-volume restaurants tell their customers that they only have so much time (2-2.5 hours) before their reservation is up and they normally enforce it. This might help improve the experience.

When we looked around at the servers, it looks like they've hired staff based on their appearance - everyone looks like a model and the girls wear especially low tops (breasts popping out) and tight clothing, and their service was subpar. They kind of lingered around as if they didn't know what they were doing. We tell the same girl 3 times that we wanted the bill (she had a lot of trouble with this) and that we wanted it split - even when we got the bill, we had to tell them to split it. The company could do a better job training their staff on customer service at point of contact.

Overall, the portions were small with every course. The appetizers were standout in terms of flavor and texture - order the Kinoko Salad. It seems like the owners don't know much about sushi though because the rolls are unimpressive. They're tiny and generic rolls (nothing special about a spicy salmon maki or tempura shrimp roll, esp. when they're so tiny).

Warning: The establishment houses Copa Cabana on the top two floors and Shibui Robata in the basement. They're both owned by the same people. I've eaten at the original Yonge & Eglinton location and they know what they're doing in Brazilian steak - not so much in Japanese food."}
{"text":"Came here for Summerlicious and will not return as management brings down the place.

Lots of staff moving about and plates were cleared and water filled frequently.

Came with table for 2 and the sashimi was served in a large japanese bowl filled with ice, which was nice touch.

Lamb fatty and delicious while the cod was nice mix of miso marinade.

Gelato and mousse I believe were homemade (server was not sure if they were. I was surprised server did not know)

When the bill came there was a mysterious 'Vero Still' charge for $1. Apparently this is some water from a $700 machine as was explained to me.  However I had ordered a drink for dinner and barely had a few sips, not to mention nobody had advised that they were charging for water.  Charging for water I did not drink.  Had I known I would have not ordered my drink. I don't mind paying if I ordered or drink/eat it known upfront.  This falls under the 'nickel and dime' category. 

We had actually asked for the regular menu also, however they said it was not available for Summerlicious.   Meaning we were willing to spend MORE money here to try other items to supplement our experience. 

The water charge was eventually refunded by a manager who came down from the upstairs (seems the brazilian portion probably is more important and brings in more money).  He defended the water charge even though we didn't mind paying if it was disclosed upfront.

Anyhow, would never return again which is a shame as food was decent. At least we got our 'Vero Still' charged refunded to keep us quiet, but maybe thats how they weed out their customers. We don't need to eat here again anyways, just disappointed that we could've eaten elsewhere with 100's of other worthy places to try.

Onto the next!"}
{"text":"This is some of the fresh-est sushi I have had in this city. The grilled items are grilled over a charcoal fire! The rolls and sashimi are awesome. The fish melted in my mouth. 

Great interior design, comfortable and cool.  Maybe not the cheapest place in town but the food is high, delicious quality. 

Only downside is that it's not completely obvious where it is from the street."}
{"text":"Fantastic service, beautiful decor and delicious everything, I recommend the spicy salmon and the pork belly."}
{"text":"This place needs to get its management fixed. The owners feel like the food will get them the ratings and customers without focus on the service. Why do I say that - make a reservation at 9:30pm, reach on time, 5 mins before someone at the front desk even acknowledges our presence (may be we are invisible after all!). Wait at their bar till 10:30 before a place becomes available - why even bother for a reservation? You'd hope it gets better after this but hell no! Fixed price menu - 2 of 4 food items on the menu out of stock! On the positives, the server was apologetic but it didn't help her trying to comfort us by saying she has had to handle so many customers angry for a similar situation! 

However, the chefs did an excellent job of whatever was available!

Given the abundance of excellent joints in Toronto, I'd give this a skip in future!"}
{"text":"I was super excited to try out Shibui as there are so many raving reviews here on Yelp. My friend and I went during Summerlicious.

HUGE DISAPPOINTMENT.

To start, we waited for 40 min for our table. While I understand it's a busy night, we did make a reservation weeks in advance. There were 3 hostesses circulating the front desk and they all looked just as confused as other impatient customers in the waiting area. When we finally arrived at our table, we excitedly glanced over the menu and ordered right away as we were quite hungry at this point. Our first course arrived after a reasonable 15-20 min wait. The sea bass dumplings was possibly the most overhyped  dish. It smelled extremely fishy (as in, fish that has been left cold for too long or just simply not fresh) and dumplings were lukewarm. The salmon maki was a little better, but it's comparable to ones I can find at any mediocre AYCE restaurant. The glaze was decent but at this point, my friend I questioned \"did we really pay $25 for this ****?\"

We waited - hoping that the 2nd course would be more interesting. Our extremely friendly waiter informed us that the restaurant was in fact overbooked and the kitchen could not possibly handle this capacity. I thought that Shibui should step up its operations management? We continued to wait... we realized that we had been sitting for almost 2 hours. It was ridiculous and we reached a new level of discontent. The couple seated next to us said, \"you guys should just leave, there's no point in waiting.\" We told our waiter that we could not wait this long as we have other arrangements for the night. He was very understanding and made it clear that he wouldn't charge us (in all honesty we only had 4 small pieces of dough...); he showed sincere apology and I almost felt bad leaving the restaurant because he was such a friendly guy. 

We left him a $2 tip anyway. Would I come back again? Definitely not."}
{"text":"I think the food here is good.  No complaints about that.  Was there for summerlicious.  It's a good chance to try a lot of different stuff.  Sushi was fresh and presentation of food was good.  

My main issue with this place was that it was viciously slow.  Food took a very long time, maybe 30 minutes to come out.  And continued to take a long time with every item ordered.  Not sure if they are understaffed or it was just a bad day, but all customers really suffered and looked very upset and bored from waiting.  Some people who just got in were frustrated with not being served that they just got up and left.  Maybe it's just the rush from Summerlicious......but I hope they can get organized a bit more here."}
{"text":"Think Guu with big quantities and same value

This place is great probably because it's so hidden, bet you'll never find it tucked away there, under copa cobana on Adelaide.

It's Guu (japanese bar) with bigger portions and respectively equal prices

Some Pros :
- Fresh food, and I mean fresh. You can see the kitchen 10 steps away and its open concept.
- Unique variety, every dish has been a hit
- Unique cocktails. There was a lemon grass drink that honest to god you could not taste the alcohol and it was pretty strong
- Good layout, good for dates and guys alike (they have a small sit down bar)

Some cons:
- A bit expensive, but it's like Guu so you're gonna end up paying about the same
- A bit slow service ... was one of the first few months/weeks they opened so maybe thats why

Give it a shot but good luck finding it"}
{"text":"Discovered this incredible place while I was going in for some Brazilian Rodizio at Copacabana......it was mind blowing!  I've never been much of a sushi or seafood person, but Shibui has opened up my mind!  I honestly never knew seafood could taste this amazing, the Black Cid is out of this world!  From the painstaking presentation to the incredible flavors from each dish....this is a spot that absolutely has to be discovered!!"}
{"text":"i came to this place last night and despite the reviews decided to give it a shot. This is also my first review on Yelp. We decided to sit @ the counter sushi bar were the kitchen was so we could talk to the chefs and watch them during the preparation process. The chef whom we found out is also one of the owners and head chef started to talk to us and guided us through our likes and dislikes , s we put the ordering in his hands. 
I have eaten sushi all over the world as I travel frequently for business ( on expense accounts ) so I have tried some of the best offerings available. 
This hands down was one of the best Omakase experiences I have ever had.
An Omakase means Chefs choice and he just prepares bits and bites and tastes for you from the sushi bar and kitchen.
For $65.00 a person it was amazing value.


Anyone who gives this place a negative review I feel either had this place on a bad day or their palate has become used to AYCE sushi, an experience that i would never ever try. 

For those of you who know real sushi this place is for you."}
{"text":"How is this place not jam-packed at lunch?  
You can't get much for under $20 in the downtown core.  

I guess it would help if you're in the know...  Lunch hours are actually not widely advertised since they haven't committed to a full lunch service just yet.  

Shibui currently has a $17 prix fixe for lunch.  This includes: soup, salad, your choice of one of their special rolls, then you get to choose a protein from their robata grill selection, a side vegetable, and you get to finish off with a small shooter glass of dessert.  (See photo of menu.)

I was quite surprised they give you a full 8 piece roll!  They aren't huge pieces mind you, but they could've easily given half (4 pieces) and it would still be enough.  The real wasabi had kick, unlike the tubed stuff.  We tried the lamb and black cod.  Solid  portions and the side veggies were cooked perfectly.  I ate the pickled vegetable and the daikon.  Nice and refreshing, good palate cleansers.  I still prefer the grilled choices as I'm not a huge fan of rolls in general.  I do enjoy them once in awhile though.  (See photos of rolls and plated proteins with veggie sides.)

After lunch, we were quite full.  Good thing the dessert was small because I wouldn't have been able to eat any more beyond that.  (I ate most of it and forgot to take a picture.)

Now that I've been here for both lunch and dinner, I have to say it's been amazing each time.  Overall, I did enjoy the dinner service better, but you just can't beat the value of their current lunch special.  :)

BTW:  The hostess this time around (there was only one) was MUCH better than the last time I was here (read my last review).  She politely greeted me and even offered to check my coat!"}
{"text":"This restaurant was a circus. Everything the staff could do wrong they did wrong. Poor customer service, taking order twice 10 min apart, wrong dish came out, over charged for several items not ordered... And the food was terrible!!! 
Poorly managed, poorly run, below average food makes this restaurant a FAIL!'"}
{"text":"What's the point of taking reservations if you can't keep them? We showed up 10 minutes early and waited until half an hour after our reservation time. The front desk shows no contrition and just tells us that we'll be called when a table opens up. I think we'll be spending our money somewhere else."}
{"text":"Another amazing meal at Shibui. Yuko, our server, was very poised and knowledgeable and all the food was incredibly delicious. The filet melted in our mouths! We mostly ordered the same things as before so see my earlier review for delicious descriptions of all the awesome food!

Try the sparkling sake!

One strange thing to note: This is the second time that I've made a reservation here and when I arrived, they told me that they didn't have it. Whomever is doing the staffing upstairs needs to hire girls who can use Open Table. I received a confirmation for both reservations, so obviously Open Table worked.

Then the hostess tried to seat me at one of the worst possible tables. There were several booths open so I pointed out that I had asked for a booth in my reservation. She quipped \"Oh, well, we didn't GET your reservation bust I GUESS I can seat you here.\"

There were two other booths open the whole night.

Regardless, everything else at Shibui was fantastic, and I can't fault them for the girls upstairs who don't seem to have their shit together. I guess that attention to detail, courtesy and brains weren't on the job posting, but extensions, short skirts and attitude were. Still, I sort of blame Copacabana for this since I've never experienced this sort of treatment downstairs from any of the amazing staff."}
{"text":"This place wows!  We've tried almost everything on the menu, pork belly and black cod are standout stars, but nothing really disappoints.  The app sashimi dish is surprisingly substantial in size, not to mention its freshness and quality cut. 

Secure a reservation or you may end up waiting especially on weekends. Definitely worth it!"}
{"text":"3.8/5 - I had really high hopes for this restaurant seeing as how many of my friends on Facebook had rave reviews about it. I felt that the value for the Summerlicious dinner for $25 made it worth my trip for how filling our meal was. We initially had to wait about 1/2 hour before we got our seats. I didn't find the service to be bad, but i think some of the staff could have been more attentive and warmer in their demeanor.

We started with a cocktail - Ume Yuzu Mojito (rum, yuzu, plum syrup, shiso leaf) $10. I was delighted by this drink, not only because I really like mojitos, but it wasn't as sweet as I was scared it would be. Very nice, I really enjoyed it.

For our Summerlicious meal, my friend and I decided to share everything. We got:

Course 1: Crispy Rice with Spicy Salmon & Spicy Tuna (both were very yummy!

Course 2: Shibui Salmon Maki & Pirikara Ebi Maki (they are okay...I found the deep fried ebi to be overdone and hardly tasted actual shrimp in it)

Course 3: Prime Filet Mignon & Black Cod (the first piece of the filet mignon was excellent... and then it kind of went down from there. Can't really comment on the cod other than it tasted very fresh. Wish I chose the Pork Belly instead!)

Course 4: Sweet Potato & Cremini Mushroom (can't complain, liked them both. We opted for the mushroom as they had ran out of asparagus) 

Course 5: Mango Gelato & Petit Gateau (both went very well together even though people had expressed the cake was nothing left to be desired for. They had ran out of the passion fruit mousse I was hoping to try).

All in all, I felt it was a pleasant meal but not one that I would run back to have round 2 so soon. It's a great place to go fro pre-theatre drinks place or for late-night drinks - I liked the ambience and cozy feel of the basement establishment. I definitely think they should have prepared enough food so that they would not be out of anything when a customer ordered, but overall I enjoyed the meal and may find my way back in the future!"}
{"text":"Very impressed!  I was given a \"sip and savour\" card which gives you 4oz of selected sake (to share with your companion) and then they give you appetizers that are paired with the sake. I am not a big drinker, so I went with the Mio, which I loved because it was sweet (my true drinker friends did not like), it tasted like moscato. The appetizers they served were absolutely delicious, so we decided to stay and have dinner.  We were a large group so we tried a lot of the items.  The quality of everything we had was exceptional!  The black cod and the sea bass were cooked perfectly and had just the right amount of miso glaze. I am not a big fan of lamb but the lamb chops were cooked perfectly and seasoned well.  Pork belly was so moist that it was difficult to cut evenly between us, delicious and melt in your mouth! Beef rib came in a long dish and were succulent and delicious.  I think the previous bad reviews were mostly from summerlicious...I find that most restaurants are not at the top of their game during those times.  This place is new and all businesses have growing pains.  They seem to have things fixed because both service and food were excellent!"}
{"text":"Came here for $25 Summerlicious dinner. Pretty good deal for 4 courses but it added up after ordering a $10 drink and $20 sake pairing. 

Ume Yuzu Mojito - great refreshing cocktail, didn't taste strong. 

1. Salmon Crispy Rice - rice was not crispy

2. Shibui Salmon Maki - average sushi, but impressed that it had 8 pieces! big portion. 
The Ebi Maki - didn't like.. crispy shrimp on top of avocado roll but did not taste shrimp. 

3. Black Cod in Miso Glaze with Asparagus
- Great, loved the soft, meaty cod in the sweet glaze
- aspargus and sweet potato was good 
- Pork Belly was a bit dry for me

4. Mango Gelato - half MELTED! Very disappointed about this. It came so rushed when we weren't even done the main course. Also it didn't taste good. 
The Passionfruit Panna Cotta was better, tasted like yogurt. 

Service: our server was new so she didn't know about the sake pairing. Apparently they all go with everything - then what's the point of a pairing??? Also it felt very rushed at the end with the melted dessert and bill. 

Ambiance: located in the basement of CopaCabana, it was very loud that I could barely carry a conversation. 

Overall: food was average, best was the cocktail and black cod. But because of the loud atmosphere and medicore dessert, I didn't enjoy my experience that much."}
{"text":"Was visiting Toronto for business and read Jane.W's review and went to check it out.
I have spent time in Japan, and am no stranger to Japanese food and its nuances.
And certainly try to indulge in Omakase (chef's choice) sushi when I can.

It was a quiet Thursday evening, I sat at the counter ordered Omakase and was able to thoroughly indulge, talking to Masaki-san about sushi, Japanese cuisine and watch him make the magic happen. 
Each piece of sushi was crafted to the chef's standard, he actually made one twice as the first wasn't good enough to plate, and all were described in detail and all were Oishi delicious. 
The meal was rounded out with a serious desert of sorbets, ice cream & fruit.
Check out the sake ice cream on English breakfast tea sorbet, it sounds odd but is divine.

Makaki-san knows his stuff, if you miss eki-bento, the challenge of the Yamanote line, and are looking for an Umai sushi experience check him out."}
{"text":"Attentive efficient and discreet service . The food was exceptional in its creativity, presentation and balanced aromas. A true culinary experience in a casual and friendly atmosphere. Well done!"}
{"text":"Conceptually - great addition to the downtown core and execution wise, the food is good (albeit a little slow). 

The flavours are there - the vision of the food is good. Trend wise, it's the same concept as we've been seeing pop up globally for the past 8 years - good japanese food, high quality, funky and trendy. Spice Route has lasted this long, so perhaps Shibui will as well. 


Where Shibui falls short is the front of the house. Many new restaurants have this issue. Perhaps they will work on this. 

The servers don't have their stuff together. The hostesses are over whelmed. There is no management presence in the restaurant. I had an experience where every single course had something wrong. Really - i haven't experienced anything this bad in a long time, but having worked in the sector, i have greater than average patience and understanding. What i did find unsettling though was the cowboy nature of the servers. I even had a server come up to the table who insured us that the extra dishes were free - the extra dishes being six pieces of mushrooms. The server did it because he cared (we weren't even his table) but it was actually quite insulting). The point - this is a managers job - but he was no where to be found. None of us expected anything for free - but an acknowledgement of the multiple issues or an apology would have been nice. 

If shibui wants itself to be what it's meaning to be - it needs to work on service and elevating the customer experience. I lean towards believing they will."}
{"text":"A little hard to find (it's downstairs under Copacabana). We tried a number of dishes and the unanimous favorites were the robata dishes especially the pork belly. The sushi items weren't very good so likely would not order again. Drinks selections were a bit boring, corporate beer brands, wine, etc. so maybe try a sake. Service was friendly. Prices are high for what you get but not odd for downtown."}
{"text":"Summerlicious review

I know Im late with this review but i still had a fun night here and decided to write one.

Price was fair, staff was friendly, and service was good!

Menu: 

Crispy Rice with Salmon  - This was really delicious. The crispiness of the rice added a new texture and me and my friends got really excited about what else was to come. 

Pirikara Ebi Maki - crispy fried shrimp, asparagus, cucumber, chili mayo sauce: presentation was really good and so was the taste. My table was filled with \"yummy\" and \"this is really good!\".

Cremini Mushrooms with Prime Rib Eye: again another excellent dish. the prime rib was cooked to my liking and the mushrooms were delicious as well.

Petit Gateau: I honestly wanted the passion fruit mousse but they ran out and so i settled for the cake. it was a rich dark chocolate cake. it was delicious but i felt i ended it on a low because Iv had better cakes before. My friends chose the mango gelato. After putting a teaspoon of the gelato in her mouth, her eyes widened and she immediately blurted out \"Oh F#$K\", only because it was that delicious (they made me taste lol). 

I would definitely come back and would recommend it to anyone."}
{"text":"This place exceeded my expectations! I had originally expected expensive small portions, however, each plate that came out was a hit! Portions were a good size too (not tiny like some izakayas or tapas bars, but not huge). We had the sea bass gyozas- these were not your standard dumplings. They were filled with delicious tender fish, well seasoned, just a well executed dish. For skewers, we had the pork belly (so tender, my dad was speechless when he had this), black cod, scallop, and corn. All of them were so good. We also tried a few sushi rolls, all very good as well! We already made a reservation to return for my Dad's birthday next week (for their Summerlicious)! They are on Open Table which makes it super convenient."}
{"text":"This place is amaaaazing. My friend and I came here for dinner on a Saturday night and we were impressed with the ambiance, service, quality and presentation of the food. The dishes here are served tapas style, so order about 6 dishes between two people. For the appetizers, we ordered the green tea soba salad w/ponzu dressing (delicious, fresh, crunchy!), toro sashimi. For the mains, we had slow cooked pork belly skewers, scallop skewers and the black cod. The quantity of the skewers= generous + good quality. !!! Black cod was thebomb.com. Also ordered the shibui salmon roll, also delicious. 6 dishes + 2 drinks (beer and plum wine) came out to be $123 not including taxes. Totally worth it/would come back."}
{"text":"Not sure on the negative reviews. Coming here during tiff on a Sunday night everything was running smooth and we actually had to slow service down since we were taking our time at the table.

For a small group of three the dishes are larger than what you would expect, at say a tapas style place, but still small enough to share and order quite a variety.

I am not going to try to remember everything we ordered but we did have three of the robata dishes as part of the dinner that everyone enjoyed. In fact we left with nothing leftover on any of the plates and very satisfied with the selections that our waiter helped us select for an experience we would all enjoy."}
{"text":"Wow. Completely worth it. I would recommend sitting at the high top table to watch the chefs cook. It was really cool watching them prepare the dishes and the executive chef and sous chef both asked us how we liked our dishes. 

The only downside is the service seemed untrained and relatively new. I really wish they would have walked us through what our dishes were and how they were prepared. Also, our 2nd course came out before the 1st course, because the 1st course took longer than usual. The mojito drink they had was delicious, but I cancelled my sake tasting because it came out after I had finished 2 courses already, and I knew I wouldn't get any context behind the pairings (I got 4 cups of sake at once... maybe this \"pairing\" is a choose your own adventure?). 

Standouts were the PORK BELLY and the sashimi. Wow. Probably one of the best pork belly I've ever had. So moist and melts in your mouth delicious.

Food: 5 stars
Service: 2 stars

Overall: 5 stars... I rate restaurants based on food, but really think the servers should educate themselves more."}
