{"text":"Chinese-owned Japanese restaurant, relatively cheap, located in the Chinatown area.  Value was alright, you can get a fair portion of sushi, tempura, rice and chicken teriyaki for about ten dollars.  Food is of varying quality, nothing special but functional for the price.  Service was somewhat poor (unless you speak Mandarin apparently)."}
{"text":"I love sushi and love all you can eat establisments so Shima ticks both boxes!   $18 (& $20 on Fri-Sat) and you get a paper menu to tick the food (inc. pop and dessert) you want but have plenty of additional menus in case you want to keep eating.  The quality was very good and service very effiicent and friendly.  Going to make this mu new 'go to' sushi place!!"}
{"text":"Popped in here after a visit to the AGO.  Pretty quiet but served cheap, tasty food quickly.  I didn't go for the all-you-can eat, but with my family sampled some udon soup noodles, tempura, eel and beef with green onion.  The whole bill for lunch for 4 came to $35."}
{"text":"My friend claims this is the \"best\" all you can eat sushi in town because the price is good and the selection is broad. I don't agree. The sushi rolls are huge and they fall apart and was nothing special."}
{"text":"I do enjoy the decor in this place. Its nicely lit and although its relatively small, there is still space between tables and booths. Their AYCE menu is a subsection of the full menu. I was kind of disappointed because although they have soft shell crab and beef sashimi on the menu, its not available AYCE. They also don't have just shrimp tempura to order; you must order an assorted tempura to get them. It was odd because you can order bbq shrimp, which is the exact same as tempura only with some different kind of breading.  There was a bit of a rough start to the dinner because my wife was putting soya sauce in her dish, and a small bug was in the bottle. She got a new  dish, poured some more and another bug came out. Not wanted to see a third bug, we changed the bottle.  I found their seaweed salad to be pretty good and their sushi to be on par with other restaurants. Although the sushi pizza was a little underwhelming (small with more crust than fish), what I did like about their sushi menu is that when you order their special rolls, you don't get the same size as any other maki roll. I like that because if you get the huge ones it doesn't leave much room for other special rolls.  Two dishes I enjoyed was the gyoza and their beef rolls. Although I wish their beef rolls were filled with enoki mushrooms and not green onion, it was still good.  2 girls serve the tables and I think they did a good job of keeping the food coming and clearing the dishes. There were some items we ordered that we never got, and had to order them again, but that can be overlooked since you could order it again.  I still think that Sushi Island is better, but the location is more convenient. One last warning; In our party of 5 on the bill there was a 10% surcharge. I'm assuming that this is the included gratuity, and if it was, interesting that it was only 10%. So watch out for that."}
