{"text":"Been here a few times to grab lunch when I work from home. Had several different things. All which were a little lacklustre.   Ordered a Philly Cheese wrap last time I went, which will be my last, I can recreate the sad excuse for a Philly cheesesteak for $2 at home... Was about $10 with taxes."}
{"text":"This is a good old school Leslieville spot and a staple for local workers and residents. The food is good and the menu caters to a lot of options. However, the recent update to the card machine to automatically assume you are leaving a tip was a bit too much. It automatically defaults to leaving a 15% tip and the proprietor will watch you as you input your selection, making things very uncomfortable. I think that assuming one likes to leave 15, 20 or 25% tip for a takeaway meal (as most people do not eat at the small cafe table) is a bit out of line."}
{"text":"Excellent food.  All fresh made with excellent flavour.  Cannot believe we passed this place so many times without trying.   This is our new regular lunch go to.  Give it a try"}
{"text":"3.5 stars  Cute little (mostly*) take out place with a big menu (see photo). I had the vegan baguette which was very good. Hummus, tomato, grilled onions, sprouts, orange peppers. Lots of regulars coming in for take out. Friendly cashier. Breakfast and lunch only.   *3 seats at window counter."}
{"text":"Nipped in here for a quick bite.    Never been here before.    I had a toasted veggie western, it was very good.  I forgot to order a slice of cheese as I normally would.  It maybe the first western I have ever had without the cheese. It nicely layered on the bread with a generous helping of peppers and onions.  Well made sandwich.  My husband had a perfectly prepared cheese omelette.  I also had a red velvet cupcake.  It just may have been the best red velvet anything I have ever had.  The cake was very moist and dense and the frosting was light and creamy.   Could easily have ate the inventory.  Strongly recommend!"}
{"text":"I feel dirty giving this place a 2 star review but I literally flipped a coin between 2/4 because I NEVER give threes.   Side rant over.   This place serves a singular two-dimensional purpose in my life, when I'm hungry/lazy/don't feel like travelling more than 30 yards for lunch - I go here.   The staff are nice, the prices are fair and you get what you order - really that's more than most establishments do, so already the place gets a pass from me.   Shirley's does certain things well here - but other things are extremely lacklustre. I learned early on to not experiment with the menu, treat it like a portapotty at a music festival - be thankful it's there... but get in, get out, and rarely speak about the experience unless it involves someone getting injured/embarrassed.   Would recommend the sandwiches, not a huge fan of the daily specials or menu items that sound too delicious to be true.   Call in your orders for quick service or be prepared to wait for a long time between the hours of 12:00PM-1:48PM"}
