{"text":"They have Vietnamese food!  and really good Vietnamese food at that! Also girlfriend had a great gyro!   New spot for quick good food. Super chill and friendly peeps.  Try the gyro rolls with the peanut sauce btw.. shits mmm fantastic"}
{"text":"I tried this place completely by accident and it was awesome! I pulled into the shopping center with the intention of grabbing some Burger King when I was in a hurry, when I saw a this gyro restaurant.  I made a quick audible and decided to grab the standard gyro pita and it was absolutely delicious.  The meat was juicy and there was plenty of it.  The tomatoes were fresh and the tzatziki sauce was tangy and refreshing. I'll definitely be back next time I'm in the mood for a good gyro."}
{"text":"We went there last night for dinner.  We started with a small hummus with an extra pita.  I just may have been hungry but I swear the pitas were the best I've ever had.  They were like they were freshly baked.  Man, they were great with the hummus.  I had the gyros plate and my wife had the chicken.  One thing both had in common were that they were piping hot.  This is something we both love.  My gyros was delicious and my wife's chicken was just good.  Once again, the pita shone on my order.  The fries were great, too.  It was standard Kronos meat but the pita was packed.  My wife's chicken was mildly flavored and came with rice, more hummus and a salad.  She thought everything was good but wanted more flavor.  The folks inside were nice and everything was cooked to order.  It's an option you should consider."}
{"text":"Okay I have to admit, I hardly ever write reviews but I had to for this place!! So the restaurant is running under new ownership, and it seems like they're doing their very best keeping it the way it was before. So, I went in and the owner was working the register; she welcomed me with a sweet smile that made me feel very welcome.  Anyhow, I decided to order the #16 which is the, \"The Gyro Meal\". It's got a very promising sign on it saying, \"Most Popular :)\", and let me tell you, you won't be disappointed.   The owner arrived with my plate engulfed with a huge amount of fries and a large, mouth-watering gyro, filled with so much meat and nice, thick slices of tomatoes and onions. I realized I finished the whole plate without feeling absolutely gross from eating so much. Once I finished eating, I can honestly say that I wanted more to bring home. Try this place out, you won't be disappointed!"}
{"text":"Mom & Pop establishment with some darn tasty gyros and some of the best fries I've had at any restaurant. They have an eclectic menu with some standard American fare, but the gyros are top notch. It's nearly unnoticeable from the street and I'm kicking myself for not finding it sooner as I live just up Hayden.   Mediterranean food at its finest, like a schwarma slingin' food truck parked in a strip mall and never found it necessary to move. Easy on the stomach and the wallet, the #16 gyro combo is the way to go. Heard nothing but raves about the salad from the table of red hat ladies next to us, and I fell in love with the tahini after first bite.   The obligatory Sriracha sauce adorned the table and mixed in with the ketchup for the fries made for a pleasant and fiery surprise. I highly suggest giving this place a try the next time you're in the area instead of wasting your money and time at the nearby BK Lounge. Family owned, by friendly people dedicated to bringing the best Mediterranean fare I've had in the Valley, give your tastebuds a treat today."}
{"text":"I can't believe that I just found out about this place! I know Lebanese/Middle East/Mediteranean food and this place is awesome! The beef shish kebob was tender and tasty..as good as I remember it at the famous El Morocco restaraunt in Worcester, MA. The Kafta kebob was fresh and very good, altough I like a little more parsley in mine. Gyro meat was typical (it all comes from the same place in Chicago), good fries, hummus, salad. I can't wait to come back and try the chicken and falafel! Nice guys running the place, too. I'm so exited that I found this place!!"}
{"text":"The food was excellent, I am new to the area and it's nice to have this kind of cuisine nearby."}
{"text":"I'm sure the folks here mean well, but the place is dirty and the food overpriced. I had the gyro combo, who cost more than a dollar more if you get it after 3 pm.when I asked about that, the owner said the only difference invent meal is when you order it. Then why increase the price, man?!"}
{"text":"This is the best falafel I have had in town. They make it from scratch (not from a mix) and it comes out amazing. I recommend the falafel wrap or the vegetarian plate (you can substitute the dolmades for more falafel for no extra charge)."}
{"text":"One of my absolute favorite places to eat lunch! The gyro spring rolls with peanut sauce are so tasty. I questioned the combination at first, but was completely won over by the flavor. The gyro, hummus, and pho are all yummy. I can't wait to try other menu items. Even better than the food is the service.  The sweetest woman that is there every time I go knew my name and order after my first visit.  Love, love, love this place!"}
{"text":"I had the vegetarian plate for work lunch and I'm impressed.  Great food, service, price, place.  Will come back soon."}
{"text":"I love this place...it could be considered a hidden gem...but it is always busy so it must not be hidden that well.  The space was originally a Taste of Chicago, but when the new owners took it over, they turned it into a Middle Eastern restaurant....but they still serve the hot dogs too!  They make the best gyros here, they warm pitas are always filled to the brim with the gyro meat, and their tzatki sauce is awesome!  The combo with fries and drink is just right for a quick lunch.  I have also had their falafel, which I really liked, they serve it in a wrap bread instead of a pita and smother it with tahini, lettuce and tomatoes!  I have gotten a few friends hooked on this place as well, and my friend Paul always has a hard time deciding between the gyro and a hot dog because surprisingly, they do both really well!"}
{"text":"LOVE THIS PLACE!! The food is amazing, the girls that work there are awesome! Me and a couple work buddies go in for lunch every once and a while and they always remember our names!"}
{"text":"I (and my family of 6) really wanted to like the food since we own an independent family restaurant in the Silicon Valley, ca!   But unfortunately most of us did not like it. Ordered the following: 1. Four falafel wraps (two with pita and fries).  The falafel balls were overbooked, too big and not cut up to be able to eat properly, the pita was too chewy. The sauces were good but there was no real spicy sauce, only siracha   2. The salad (instead of chicken falafel was substituted) and it was not bad per my father but again the falafel balls were overcooked. He did not find anything special and family owned about the place.  3. Sister had the gyro plate and enjoyed it thoroughly, the meat to her was perfect 4. Brother had the chicken gyro and unfortunately the sandwih had only a few pieces of chicken and thought it lacked taste   Overall, being family we really  wanted a family touch!"}
{"text":"This place is solid. Everything I have tried so far has been delicious and on point. They have an amazing Bahn mi sandwich, one of the best I've had. The bread is always fresh and toasted well. Pho is incredible, definitely try it.   For the Mediterranean side, the gyro meat is fantastic. I especially enjoyed a gyro spring roll, good fusion of flavors.  The owners and staff are a delight. They are so friendly and welcoming, I feel like this is truly a local gem."}
{"text":"This is a little restaurant not far from my house.  It is located in a strip mall and you have to look for it - I just happened to first notice it as I was becoming familiar with the area.  Since I am from Spokane, our ethnic restaurants are very limited,, and I was not very familiar with middle eastern food.  But I knew I generally liked it, so I stopped in for an early lunch.  And it was well worth the stop.   It is very small, probably more designed for take out, but they do have several tables on the inside and outside.  I sat at a table on the outside, and it was very pleasant - I read the newspaper, had lunch and generally enjoyed myself.  As I do almost everywhere I eat, I watched what other diners were having, just to see what the menu items were.  Since it was lunch, everyone seemed somewhat hurried, but definitely enjoying their meals.    I had gyro and it was delicious.  On later trips, I have had the different gyros, and some of their chicken dishes. The people are friendly, and at times the place gets really busy.  It is a great place to stop for a quick lunch.  The only down side is that they are a pricey for the size of the meal.  But because I like middle eastern food, I am willing to spend a little more, just to have the convenience of being able to have a restaurant like this in the area."}
{"text":"This was by far the best chicken I have ever eaten!! This place is a hidden gem! I will definitely be back."}
{"text":"A hidden gem.  The name is unfortunate because it fails to signal the fabulous Vietnamese Pho one will find here.  Service is beyond helpful, and the diners are mostly repeaters, a great sign for any restaurant.  Do yourself a favor and stop in.  Once you've done it, you'll be back again and again."}
{"text":"Absolutely love this place.  Gyros and other Mediterranean food is not a common plate in Scottsdale.  Not many restaurants accept the challenge to serve this kind of food and other chain brands that offer greek food have closed down.  I'm so glad people are fond of this place.  They have a variety of different food.  You can go for a hot dog or possibly a burger, or go with something different with a greek salad.  Prices are reasonable based on location but the food was excellent.  Come in for a try!"}
{"text":"Came by for a quick lunch just because I was in the mood for a gyro. The Mediterranean and Vietnamese fusion menu was unexpected, but intriguing. I ordered a Gyro Banh Mi and was impressed. The baguette was perfect, and the traditional banh mi veggies went great with the gyro meat. The staff was very friendly and welcoming to all. And, I couldn't help noticing they knew most of the clientele by name!"}
{"text":"A great place for fast Mediterranean food.  Brothers, Anthony and Edward serve up quality food at reasonable prices.  Everything  they serve is great from the hummus to the freshly shaved gyro meat.  Good salads, grilled chicken, hot dogs and fries too.  It has a Chicago Hot Dog dive feel!  That's why I like it even more.  But best of all Edward and Anthony welcome you every time you walk in with a big hello and smile.  Anthony is at the counter taking your order and Edward is cooking away in the back."}
{"text":"Stop in today! Very friendly staff and the food was really good. Would highly recommend!"}
{"text":"I just moved here from Little Armenia in Hollywood, so I've had Zankou and Falaffel Arrax many times, and wouldn't you know it, my new fave falafel joint is right in my hood...Shish Kebob's & Gyros.  The falafel sandwich is like a middle eastern burrito from Chipotle, It's that big and in a tortilla rather than open pita or wrapped flatbread, plus it's filled with cucumbers, tomato, pickles, lettuce and sauce and slightly grilled to seal it up and make the tortilla warm and crispy, all of which is way more than anything I ever got in Little Armenia.  The gyro is also great and they always seem nice and efficient (also unlike anywhere I frequented in Little Armenia).  I like me some Pita Jungle too but this place is more authentic and not as crowded so I can grab my food and go.  Even customers eating in were talking to eachother about how much they love the place and visit at least once or twice a week...now i'm one of them."}
{"text":"Hooray for new ownership! The food is as good now as it once was and the family owners are as nice as can be! Bebe, Lisa and their family make a pointed effort to know you by name and remember the details in your order. Favorites include the chicken pita wrap meal and the kufta platter. The chicken is perfectly seasoned and the French fries are perfectly crisped. I crave the French fries now! The staff makes every effort to know you, your order and ensure everything is as you like it. They've upgraded to a nice flat screen tv, so it's like dining at home. Bebe, Lisa and their family wish you well - by name - and look forward to your next meal. We love supporting locally owned neighborhood spots and have already been back four times in two weeks!"}
{"text":"Place is legit. Cheap & super tasty. Very kind people that take good care of you. Always friendly. Food is up fast. Very convenient location. Eat here weekly :)"}
{"text":"This is a very unassuming and quaint place off of scottsdale and Hayden, but don't let that fool you! We went in and were immediately greeted by a very friendly lady (forget her name) running the register. I ordered the gyro meal with a Vietnamese iced coffee, and my sister the beef pho, which were reasonably priced. Service was quick, with our food coming out in under 10 minutes. Iced coffee was great to start with. My gyro came in a warm pita and was very well made, and the meat was perfectly cooked and delicious. Fries were crispy but not over cooked, and weren't over salted. My sister really liked the pho, and was surprised because she didn't expect it from a gyro restaurant! It wasn't oily and under-cooked like some places I've had pho at, and was very full of meat and noodles. Overall very good. Friendly staff, fast service, excellent food. Will be returning."}
{"text":"Wow, just wow! So glad we stumbled upon this place. Not only was the food amazing but the customer service was unbelievable. We had the traditional gyro with fries and it was the best one I've ever had. They're prices are extremely reasonable and the food is made to order. They were so incredibly friendly when we ordered and even remembered our names when we were leaving....I wanted to cry. If you can't tell, I really liked this place."}
{"text":"The gyro is ahhhhmazing, as well as the chicken kabob!! Seriously my favorite Greek restaurant. Family owned & the food is fantastic, their fries are to die for as well! Highly recommend!!!"}
{"text":"First time here.  Can you believe a shish kabob place that also has vietnamese food?  Yeah, that's right.  Two for one.  Here's what we tried.    chicken pho-- large bowl of hearty broth. substituted the noodles for extra chicken.  NO problem.  Came with bean sprouts, jalapeños, lime, fresh basil... the usual.  Good flavor.    vegetarian platter-- included greek salad, hummus, falafel and a PILLOWY pita.  Not that cardboard pita that is sometimes served.  I didn't want the grape leaves so they gave me extra falafel.  The greek salad had a lot of feta cheese--too much in fact.  It was made creamy like into a dressing, but their generosity with the feta made it too salty.  Did I eat it?  You bet.   Hummus was delicious as were the falafel.  Crunchy on outside, soft on the inside.   It is counter service so you order and pay and then they graciously bring you your food with a great smile.   BTW, we were greeted warmly when we came in and that goes a long way in establishing a connection with the customer.   Loved the food and thought the pricing was very fair. Will be back."}
{"text":"Cool concept, great food, great prices.  The gyro spring rolls need a little something more... kind of plain but the meat and sauces are good. Maybe a little mint and bean sprouts?  The chicken pita / fries were delicious. Everyone I went with enjoyed their meal."}
{"text":"Had their Gyros, it is amazing.  And they have French fries nailed.  Great food, amazing every time i go in."}
{"text":"I work nearby and have come for lunch, for years. It was run by a Greek family. The food was good, but always found the manager abrasive. When the new management came on board, it was an Asian group. I feared that the menu would change or the quality could decline. Instead, the selection remained mostly the same however was now better than ever.  In addition to that upgrade the manager Tracy (sp?) is incredibly friendly and attentive.  She referred to me by name upon my second visit, several weeks later. Wow!  You can often hear her great others by name and asking \"the usual?\".   Lots of repeat customers.  It's a small place, but there is indoor and outdoor seating.  Great value, taste, and interaction earns five stars."}
{"text":"Reading the reviews, this place seemed like the dumbest paradox ever. Greek and Vietnamese, two of my favorite cuisines, served together in one place seemed like an idea destined to fail. But I'll be damned if I don't take my words back - this place offers some of the best of both.  If you just want a classic Greek place, this will hit the spot. The gyro pita is the same goodness you'd expect at any other place - fluffy pita, with plenty of meat, tomato, onion and tzatziki. Meat is actually solid - not too oily, but well-seasoned and has hints of browining. With fries and drink at basically 8 bucks, it's a solid lunch option.  Which is what made the twists on the gyro even more exciting. The gyro fried rice felt a lot of fun. Not the best I've had, but it had a good mix of veggies and wasn't oily. Six bucks for something new on the table was a nice alternative. Plus the gyro banh mi somehow actually works - salty gyro meat working with pickled veggies, cilantro and jalapeno really works. But in that care, you can make it go as far as you want in the gyro direction or the banh mi direction with your sauce choices.  As for hard-hitting question... yes, the pho is ACTUALLY GOOD! The chicken and pho broths both had really good flavor, with the beef having meat balls and thin steak. It really holds up with the best of the Vietnamese places down closer to Mesa/Tempe, and they even bust out the plastic bowl, spoon and plate of veggies! You don't really think of pho as an over-the-counter food, but I'm glad it is.  I think Shish Kabobs & Gyros will be my diplomatic location for work lunches when we can't decide on a cuisine. Or maybe I'll be a madman and eat both."}
{"text":"Mediterranean and Vietnamese fusion.  Just missed the one year anniversary of this lovely restaurant by one day! The one item that caught my eye was the gyro spring rolls. This variation of both cuisines intertwined was a delicious combo along with either of the sauces: taziki sauce or peanut sauce. Both complement the spring roll well but I'm more favored to the peanut sauce because of the added saltiness flavor. But depending on your cravings for the moment either would work well. I like this as the healthy and light eating option.   Like the spring rolls and sauces, the Vietnamese egg rolls are also specially hand made by the owner the day before for freshness. It's filled with clear glass noodles, carrots and I believe ground pork. Quite delicious as well!   Owner and staff are super friendly and have the passion for both cuisines which makes this a unique spin to verging flavors. Will be back to try other items!"}
{"text":"Great place!!! They truly value their guests and provide an A+ experience! Food is wonderful, fast, and of great quality"}
{"text":"Total surprise finding this place. I was at the cupcake shop and needed lunch and this little place was in the same shopping center. Even more surprising was the type of food served which is mixed up fusion (but not combined) kind of food. The chicken gyro at 6 bucks was among the tops in the area with nice chunks of white meat tucked into the pita and the usual list of condiments inside. The Tzitiki sauce was a bit watery, but still serviceable. Many people were ordering the chicken eggrolls and I got a few as well. They were made with white meat and were crunchy and a nice treat at anytime. Good to have found this place."}
{"text":"Great food, hard working staff that will tweak your order to exact way you like it. They are friendly and priced fairly. I recommend this local restaurant to everybody."}
{"text":"Absolute best gyros and fresh French fries we have ever had and we are very particular! The customer service is absolutely outstanding! We go out of our way to eat here. Never had a better gyro! Thank you! Definitely check this place out!"}
{"text":"There were only four people in the restaurant and we waited over 40 minutes for 2 gyro pitas. Slowest service I have ever encountered.  Unacceptable for a order at the counter type of restaurant.  The food was good but not worth the wait.  The staff did not appologize at all for the slow service or explain the delay. They really need to get their act together or this place will be out of business soon."}
{"text":"I have a hard time giving out fives, but given the price, service, and food, it's worth five. great for what you get - a good price and great food from nice people. lunch is a good time to dine in, dinner is a good time to order out. the gyro and chicken gyro combos are great, so is the chicken wrap. everything is delivered to your table by the chef immediately after it leaves the grill - so make sure you try the fries. tell Anthony hi."}
{"text":"We are locals and really appreciate customer service happy faces and people in the restaurant industry that are committed to quality. We really appreciate this restaurant every time we go it always seems to be the same great quality."}
{"text":"I give this 5 stars not because it's fancy and fabulous service, but because it's just fantastic when you eat their food!  Family owned, and by the way, the family is so charming, and they are so kind, and they know how to make greek food that is delicious, affordable, and memorable.  But remember, it's not fancy!!!  We have the gyros, I have the Israeli salad that is outstanding, and sometimes I even add chicken to the salad.  Lots of people come in and just do takeout.  They do have seating for maybe 20 people max.  By the way, the family is Vietnamese, but someone taught them well!  They also have Pho, but we haven't tired of the mediterranean food yet, but one of these days, we will give their native food a try also.  We really appreciate this little neighborhood restaurant and hope you will also!"}
{"text":"The Lady or co owner was very rude and said to me \"You Americans are rude and spoiled', I only requested the correct sauce advertised with my dish, she gave me something else and didn't bother to tell me they were out of the proper sauce.  We Americans are what keeps them in business. Myself and many others are have decided to avoid this place!"}
{"text":"I tend to steer clear of restaurants with more than one specialty, but thus place is absolutely fantastic. In the 20 min I have been here, I have seen the staff greet people by name as they walk thru the door, provide amazing customer service and have some totally kick ass pho! I regular came in and ordered a Greek salad, another chicken pho, and another a gyro meal, so I'll be trying all of those soon! Small, local business with the sweetest staff. 10/10 will return!"}
{"text":"The staff is so nice!  I had the chicken pho.  Very tasty and I'm pretty sure the chicken was all breast meat.  Reasonably priced.  I'll definitely be back."}
{"text":"Good food. Had the chicken kabobs. Comes w/ rice (or fries) and salad. Quite a bit of food. Could almost share between 2 people. A little pricey for the kabob plates ($11-13) but considering the quantity and quality I was okay with the value. Will definitely return. Pleasant mom and pop working the place when I was there."}
{"text":"I'm updating my review to 4 stars, as this place has consistently delivered with the delicious menu items.  I've found a diet salvation in the form of gyro and chicken spring rolls, they are absolutely easy, filling, fresh, and cheap! I got them for lunch AND dinner yesterday, and Tracy, one of the owners, was sweet enough to remember me, and my name.  She is always there and so smiley and happy, she is a real treat to see when you are starving and know you'll be satisfied soon enough.  The hummus is my favorite other than Greek Wraps in Peoria.  I try to order hummus at almost every resturaunt, sort of like a competition I keep for the places I frequent.  Lucky for me Shish Kabobs and Gyros is right around the corner from me, and thier hummus is in my top picks.   Update to four stars, but still holding out on five mostly becuase it still seems like a takeout place.  I'm sure with increased business the decor will improve, as these ladies seem to give thier business 100%.  I'm excited to have this spot so close to my house."}
{"text":"Some of the best gyro meat I've had. The restaurant is small and very clean. The cashier took my name for the order and when I exited the restaurant she called me by name and wished me a good weekend. Very kind."}
{"text":"This is definitely a regular lunch spot for me. The food is very good, very fresh and very healthy. Some people have written that it is expensive I guess compared to the 99 cent menu at the Burger King in the same center they might be right BUT 5 bucks for a big tasty gyro is not in my book even almost too expensive. The chicken wrap is one of my favorites and at under 6 bucks a great value"}
{"text":"Anonymous little place, unremarkably decorated, and the seating is uncomfortable if you're over 6 feet tall.  However, I would walk naked through Juarez in July to eat one of their falafel sangwiches - it's really good.  The gyros are good, too, and the dogs are okay, but the falafel wrap they make is unreal."}
{"text":"I was really looking for some good comfort food and I'm so glad I found this little hole in the wall. This place has a very relaxing, \"family-owned\" atmosphere. Everyone was very friendly and the food was excellent. I will definitely be a repeat customer."}
{"text":"We had initially planned to go to Noci (next door - next time), but the lady (owner?) inside Shish Kabobs & Gyros waved and smiled at us and invited us in - it would've been rude not to check it out.  This place was a new-to-me combo - Middle-Eastern (Greek/Israeli) and Vietnamese food - you can get a cafe sua da with your gyro if you want!  I go the Banh Mi sandwich with Gyro meat and a cafe sua da (Vietnamese Iced Coffee).  The sandwich was good (though the tzaziki sauce was a little bland) - the sandwich had gyro meat, the pickled carrots that normally top Bun dishes, onions, jalapeños, cilantro.  Big sandwich, too - you won't leave hungry!  The cafe sua da was pre-mixed (I prefer when it's dripped at the table and I pour it over the ice and sweetened condensed milk myself)...good, but not the best in town.  The people working here were all very nice - the food was very good, and the prices were really nice.  Give it a try!"}
{"text":"I only ordered the hummus and pita here, so this review is based on that.  The hummus was incredibly fresh and tasty.  I could eat it all day long.  I want to return to try some of their other stuff.  Not much here besides the food though, very regular looking place."}
{"text":"Two visits...would have been a 3 star but on the second---and for the second time, they were just CLOSED with no reason why. (yes the hours on the window said they were to be open)...  Food was good but pricey. Service does not match the food."}
{"text":"This place is my favorite lunch spot and the customer service is excellent. My faborite items on the menu to get are the Kufta plate with rice and the egg rolls. They even have a vegeterian plate that is delicious regardless if you are or not. Never would have thought the Vietnamese/Middle eastern food would mix so well!!!"}
{"text":"If you get to cross paths with me and have been around my inner circle, you know I am all about cultural diversity. What an awesome concept to combine Asian, Mediterranean and Greek into my fave neighborhood gem and office go to lunch spot!!! Staff is utterly gracious and always so welcoming. I love the family unity and closeness. Every time I walk in they know my name, give you smiles that are hugs to the soul on the long days you need it.   The place is tiny but why not have reason to canoodle. Otherwise soak up sunshine and observe patrons on the patio. The longest I have had to wait is maybe 10-15 minutes. I have dined in and service is as attentive just as when I do take out. I highly recommend the gyro spring rolls with the peanut sauce. The egg rolls are just the right crunch with the usual sweet dipping sauce. My top fave is the banh mi with grilled chicken and extra spicy sauce and a side of tzatziki. OMG. Can I just be their ambassador of goodness? Come explore and I promise you'll feel like you traveled to paradise!"}
{"text":"Best Vietnamese egg rolls in town. Best gyro in town. They know you by name. Love this place!"}
{"text":"Love this place! The owners are so so nice and make great food. The pho, gyros, and rolls are delicious!"}
{"text":"The food is very consistent here, I recently went back after a long time to get a gyro, for $9 With a drink and extra meat, I was slowly slipping into a food coma at work after lunch. That's how good the food is here, now I have not tried many items here besides the gyro salad and the gyro sandwich, but knowing how fresh and tasty the food is I don't think one could go wrong ordering anything here, pure quality food."}
{"text":"We arrived just past 6 PM closing time.  The owner was kind enough to let us order and prepared two excellent meals.  An excellent Gyro!"}
{"text":"I like it a lot.  We look for Mediterranean and Asian food and have found a lot of the other Scottsdale places, with often disappointing results.    Until now.  They not only have Greek/Mediterranean food, but also Vietnamese.  Some of it is fusion, but it seems to work.  The banh mi sandwich is great - the bread is so fresh, makes me think they are baking it there.  The gyros plate is also excellent, and HUGE with a full sized salad.  My only comment would be that it needs tomato and onion aside from the salad for the gyro and the pita uncut, but I am sure they'd accommodate any requests and I will do just that next visit.  The people are super friendly and generous, not stingy with food and extras at all.  It is a huge winner in my book."}
{"text":"This place has pretty good sized gyros, a meal is about $10. While the gyros are pretty good. The service is what makes it 5 stars. The lady who usually works the front is the nicest lady. I recently started working in the area and had been twice, by the third time she remembered my name when I walked in. And im definitely not the only one she remembers by name. Part if me enjoys going here just for the service, good food as well."}
{"text":"I love it here! They knew my name the second time I came here! The food is delicious and my favorite is their falafel pita-yummy."}
{"text":"Salty!!!!!! Ordered Greek gyros salad and it was so salty couldn't finish it. Came with just a little feta, not dresses and their sauce is just sour cream. Nice service, not good food"}
{"text":"I had a kabob and gyro sandwich, their namesake, to sample their food for the first time. A little salty but decent on both. It was interesting to find Chicago style hotdog on the menu and could hardly resist the temptation but I was there to try the kabob and gyro. It took a little longer than i expected  but not long enough to over-dramatize it. I guess most places aren't grilling their kabobs and fresh gyro meat  to order.  The pita was soft and delicious and if I am nearby I will definitely stop in for a couple of those Chicago dogs because the place just gave me a feeling that those dogs are gonna be nice and tasty. Good place for a late lunch if you aren't in a rush."}
{"text":"Great food! Very friendly! Love supporting local businesses. The owner always remembers you when you come in and provide great customer service."}
{"text":"Probably one of the more underrated-- and unfindable-- Vietnamese restaurants in Scottsdale. This restaurant is only open during the weekdays, and has some bomb good Pho and spring rolls. The problem is that I had trouble finding it the first few times because the restaurant name doesn't indicate pho! But once you get the name memorized.. excellent pho (and gyro too) for super decent price ($5.99 on most gyro items; $7.25 for pho)"}
{"text":"I've not been to many gyros and kabob places before so I decided to try this one because it seems like a nice little place that's geared toward getting your food faster. I was not disappointed, the food was excellent, I had the ground beef combination (#2) and the beef was extremely tasteful and full of flavor. I got my food in a quick manner and the staff was extremely helpful and courteous. I won't hesitate to go back here for lunch while at work, it's a delightful place right in the middle of Scottsdale."}
{"text":"This is our favorite place for Mediterranean food--truly the best in Scottsdale! Very friendly people and a relaxed environment. Great for take out too!"}
{"text":"I was jonesin' for some really good pho and was not looking to drive over to Glendale where I usually scratch this itch.  'She' and 'K' did not want anything Asian after Dim Sum last week.  Googling around I found this place.   Greek/Viet menu seemed a little odd, then I recalled the Chinese/donut takeout places in Orange Co. and 'K' said OK to Kufta.  Rather than phoning our order in, since this was our first try, we decided to drive down and wait on our order, we also picked out 2 backups menus in case. . . Surprise!  Nice, tiny, clean strip mall shop, that smelled wonderful.  Cheery staff that welcomed us and answered our question and took our order.  I wanted some beef pho and got 3 *homemade* chicken eggrolls.  'K' got the Kufta meal as expected.  Chicken Gyro for 'She'.  Everything was double checked and packed carefully.  Bag over the pho broth container, add-ons in a sandwich box.  Gyro wrapped foil in a foam box.   40 minute drive later, we have dinner.   Everyone was happy, the eggrolls were tiny, crispy gems with a little sambal and Hoisin sauce. Delicious!  Moved this place into the permanent list.  This is really great food at a Friday night price.  I will be recommending this place to my friends. Most of their business appeared to be take-away, repeat customers are greeted by name.  Go and enjoy."}
{"text":"OK, this is sad. I went in @ 4:30 since I knew they closed early on Fridays to pick up dinner for 2.  My wife & I absolutely loved {past tense} the place.  Their Gyro plates & Gyro salads were tops!  \"WERE-tops\" I noticed their signs up with new telephone # AND later Friday hours AND Saturdays, so I asked since when?  And the very nice ladies said since we are NEW OWNERS and we want to capture more dinner customers.  They used to close late Friday afternoons for the entire weekend.  OK, good, I was encouraged.  Well... I ordered two complete Gyro Dinner Plates to go.  Allow me to say to our surprise when I got the food home that: A} The large styrofoam dinner containers are sectioned off with main/large area + 2 much smaller slots for sides.  What was in the main/large area?  Nothing but totally flavorless yellow rice - did not even have a rice flavor = nothing/nada AND pita bread.  B} One of the smaller back side dish tiny pockets had the SMALLEST PORTION of Gyro Meat I've ever seen when called a Dinner Plate and it was not very flavorful. Certainly not delicious, a bit greasy AND did not by any means come close to the wonderful & crispy Gyro meats the former/original owners had always, always served = an utter disappointment.    C} The other smaller back section pocket had hummus.  It looked like the yummy same the former owners served.  BUT, it did not taste as good by any means.  Overly oily and quite more bitter.  D} The accompanying side salad container had a decent size Salad with onions, a very few greek olives, Feta, extremely razor thin cuke slices {more like shavings} and a few thinly half slices of tomato.  The salad was OK, not great.  Missing was the crispy iceberg lettuce the former owners always served and decent size pieces of cuke & tomato.  The best part of it was their still reliable dressing.  So, I don't know how else to say it BUT, this was no mistake or accident.  The meats are NO LONGER up to par or crispy-ness and, now, quite greasy.  The portion on their most expensive take out dish was so small it wouldn't fill a yoghurt cup.  And sadly the Hummus was way, way, way sub-par.  This place under the original/former owners on a scale of 1 to 10 served \"10 Quality Foods\" No one goes there for ambiance or comfort, it's for take-out or sitting at simple, old-style luncheonette type tables.  It's not uncomfortable but, no one goes there for ambiance - you used to go there for good food.  Only now, it's not.  I am not one to trash a place and I won't now.  Simply, if, if, if the new owners read this and wonder why they're loosing customers, it's because they have a long, long, long way to go and significantly improve before we will ever go back.  When you pay reasonable money for good food, you are satisfied.  Here, now?  NOPE!  One can only hope they improve.  In the meantime, we'll just have to rely on the Gyro place on 92nd & Shea in the Sprouts Shopping Center... it's back up along the far right-angle of the shopping center southern end.  Their Gyros & Greek food is now, much, much better.  It's terribly sad when a local place you rely on goes south in quality literally overnight.  But, if they don't seriously improve, they will not last a year here.  Too many other good options in Scottsdale.  AND yes, the restaurant business is never easy.  It just begins and ends with quality.  Especially if you expect it.  This place was, as little as a few weeks ago, great.  Not anymore and that's sad!"}
{"text":"since hearing this establishment was under new ownership i wanted to embrace the change, at first i noticed the prices went up which i can understand having a higher operating cost. Now on to the food, we ordered a couple of plates with chicken and kefta, the chicken was very salty, im not sure what is was marinated in to have that salty taste, the kefta was not prepared the way it should be, i didn't taste cumin, onion,cilantro or a hint of chili powder. The salad with both meals, the Italian dressing with both meals had no hint of mint under previous ownership and i strongly believe it was store bought seeing i have kraft Italian with the same consistency of what was served to me. Nice lady owner but shortcuts will be noticed by a middle easterner real fast"}
{"text":"The food was pretty good, and the staff was so friendly and welcoming! I would definitely recommend this place if you're looking for a gyro or some tasty French fries."}
{"text":"Always top quality food. Great selection of both Mediterranean and Asian food - how often do you find those together?  The owners are polite and attentive.  The place is simple, but clean. Always the best!"}
{"text":"Vietnam meets Israel. You wouldn't think they'd mix well, but hot damn, they do. So good. So very good. My wife and I cane here with our 2 year old on a whim based on the reviews. It was a great choice.   Both my wife and I ordered the Chicken Kabob pita meal (#13: comes with fries and a drink), the gyro spring rolls (Holy shit. Amazing. The peanut sauce with some Sriracha is wonderful), some of the homemade eggs rolls and an order of baklava. All in all, it came out to be roughly $30. Not a bad deal for the amount of food and what an amount it was.  First off, the pitas were STUFFED to the brim and then some. The tzaziki has a nice tang from the yogurt and all the veggies were very crisp. The chicken was wicked flavorful and tender. Each bite was better than the last. It's also worth mentioning even the fries were delicious. The egg rolls were piping hot and super crisp. While great on their own, with their sauce they prime choice. While not large, they were the perfect size.   Finally, the baklava. It was tender yet crisp and packed with flavor. Even my daughter couldn't get enough. I was pleasantly surprised that the phyllo dough stayed as crisp as it was with the honey.   It's also worth mentioning every one of the employees were extremely friendly and had some solid recommendations. It's a good hour from our house but it is worth coming across Phoenix to get to."}
{"text":"Really liked Gyro meat.  I came here to pick up lunch to go yesterday, really likes the gyro I ordered. Like other good Greek restaurant, takes time to have food ready. They make food after we order.  Gyro sandwich had a really good flavor and generous portion. I actually couldn't finish everything. A combo meal comes with fries, $1 more fit seasoned fries.   Since I was eating at a park and didn't want to mess with ketchup, I decided to try their seasoned fries. It had a nice seasoning to it, glad I upgraded to seasoned fries.  They had other dishes I wanted to try, namely falafel.. Looking forward to coming back to try more of their food"}
{"text":"New owners are two women who are so sweet and work so hard. Great hot dogs, delicious Gyros. The former owners let the place slide. This place is so clean and the personable owners will remember your name. If you took this off your list because of the former owner, try it again, you will be pleasantly surprised."}
{"text":"The food isn't bad and I really like the french fries. The usual staff is good and eager  to serve."}
{"text":"LOVE, LOVE, LOVE this place!!!  We found it about a year ago when we were in town looking for Pho and sooo happy we did!  The pho is amazing, falafel is delish, and our daughter likes the chicken wings.  The variety is perfect for our family because we each like to order something different and then split our meals and satisfy ALL of our cravings!  We drive about 45 minutes from Mesa to enjoy their food...it's that good.  The owners are the best too!"}
{"text":"Gyro salad was big it equals 2 meals for me. Most popular item that everyone I saw getting was the gyro pita meal.  And the gyro meat melts in your mouth"}
{"text":"Oh Oh Oh how I love this place. I highly recommend the gyro salad, the hummus, the chicken kabob plate, fries, well...everything I've tried has been wondreful, and I love the couple that runs it. They are the best, never TOO busy at lunch time and we've always been able to get a table. It's more than earned it's permanent place in our lunch rotation."}
{"text":"I need to go here every week. They have the best Fusion food.  They're bonmi gyro sandwiches are too dumb to die for!!!!"}
{"text":"Super slow service. Waited 30 minutes for 1 gyro. Plan on waiting. Definitely don't go if you only have an hour or less during your lunch break."}
{"text":"Best gyros in Scottsdale. Yum!  The Greek salad is crunchy. The taziki sauce is tangy and the pita is fluffy. Highly recommend"}
{"text":"Absolutely my favorite greek food in AZ!. I'm from NY where I think I get the best so I was looking for something that would fulfill my craving for good greek. This place is the real deal. The service is amazing, they are so sweet and remember everyone. The Greek salad with lamb and grilled chicken is my go to EVERY TIME! Amazing!"}
{"text":"I just tried this place on Thursday and it was absolutely wonderful! I just got back from Greece in May and their chicken pita rivals the amazing pitas in Greece.  The marinated chicken is amazing I can't wait until they open up today to go back!)"}
{"text":"Great food.  I loved the gyro. The vegetarian plate was great too.  My kids said it was one of the best places to get gyros."}
{"text":"This is a great little place in a strip mall off Hayden Rd just south of Shea Blvd. The owner and her family are very friendly and the food is excellent! The Vietnamese Pho soup is wonderful and the Gyros on pita bread is the best.  It is so refreshing when a restaurant gets it right and delivers on good service, quality food at a reasonable price and does it every day."}
{"text":"Gotta love a Greek-Vietnamese restaurant... what a country!  All we got were a couple of lamb Gyros style wraps and boy were they good. I went back and got another one the next day.  It takes several minutes to make them, but be patient, it's worth it.  If I lived here permanently, this would be one of my standard lunch places."}
{"text":"Came for lunch on a Saturday afternoon.  Told our Gyros and Vegetarian plate would take 15 minutes.  An hour later, the food finally came.  Gyros was marginal - the pita was cold and not toasted.  Falafel was mealy.  Salad was soaked in dressing.  just a horrible experience.  The cook was nice and apologized for the slow service.  The counter lady was irritated that we asked about the status of our order.  And $20.00 for this fast food experience!"}
{"text":"I stopped in for a quick bite to eat on a Friday night. Lady at the front counter who I am assuming is the owner was so sweet and welcoming that I think I would have given them five stars even if the food was horrible. But the food was actually amazing too! Everything came out really fast and very hot. I love this place and will definitely be back!!!"}
{"text":"Gyro meat is the best in town. The owners are super sweet and take good care of you. Delicious food reasonably priced. I dont live in the neighborhood but if Im somewhat close I always stop and pick up a #10 the Gyro Salad Yummm"}
{"text":"Moral Dilemma - do I keep the \"amazingness\" of this hidden gem to myself or do I share it with the world?  Reality is, this is the best \"gyro place\" I've found in Phoenix, hands down, with some fun additions like Vietnamese coffee and Chicago hot dogs :).  Gaurantee it will surprise you!"}
{"text":"Man oh man let me tell you, I have never had a more pleasant restaurant owner take my order.  And the food was fantastic! Highly recommended."}
{"text":"Excellent food and service! My family thoroughly enjoyed every item. Their hummus is so delicious, gyro meat was cooked perfectly, pita was fluffy with crispy edges, and salad was delicious. I can't wait to try more menu items! So fun to have so many types of food in one restaurant."}
{"text":"This place is great. The people courtious and the food is tasty. Glad I took the trip.  The mix of Greek and Vietnamese is a great combo.  I RECOMMEND the gyro spring roll. YUM!"}
{"text":"My wife and I went in for some takeout tonight.  Our first time here, as we live in the neighborhood and wanted to try it.  It was AWESOME!!!  It hit the spot and the the owners who helped us were super nice and friendly.  We will be back many times.  Oh yeah, I had the Gyro and a side of Hummus with warm pitas.  Cheers"}
{"text":"Great place for a quick bite . Greek,Israeli,Thai and Vietnamese...they have a little of everything . Pleasant staff . Combo meals are fair priced . Plenty of sauces to choose from and you can either get fountain drinks or can/bottle ."}
{"text":"Their gyro was delicious and had plenty of meat in it. The owner was super friendly and warm. The place was very clean."}
{"text":"This place was good!!! The owners were super nice too. This was a cute Vietnamese/Israeli restaurant. We got a gyro spring roll, domas, fries and a cafe sau da as a snack before going to a function. Fries were delish, domas were good, and the spring roll was good - came with both tzatziki and peanut sauce! The meat was over flavorful, but I wish there was noodles in it. Not a dealbreaker at all, still very tasty.   It was a different take on things, great idea. I would love to come back to try more dishes.Then we walked off with the Cafe sau da! So happy, I would definitely go back"}
{"text":"Fantastic gyro and chicken wraps. All the veggies are fresh, the meat is cooked perfectly, and the wrap bread is warm and soft.  The staff was very pleasant as well.  I ate 2 of their good-sized wraps in less than five minutes. The other guests seemed alarmed in my peripheral vision, but I was too busy inhaling to pay it much mind.  I think I just picked up a pita habit."}
{"text":"The service is so friendly and welcoming .  That alone is worth the busy lunch rush . Food was nice and fresh . Chicken very tender and juicy , I had the #13 . A favorite place with my coworkers ."}
{"text":"This was my first time here but it won't be my last!  I ordered the gyro salad.  The portion was huge, the meat was nicely seasoned, and the veggies were fresh.  The person who took my order was very friendly.  I enjoyed my experience here & plan on bringing my hubby in for his gyro fix."}
{"text":"We moved to Scottsdale a couple a months ago and have tried a few gyros spots. This one is by far the best! It's a smaller place but the gyro meat was cooked to perfection. It was a little crispy on the outside and juicy on the inside. The best part was the service, just a smaller restaurant doing things the right away. We can't wait to go back."}
{"text":"From the food to the service, absolutely stellar. It's a family owned and they are very nice. The food though...yum! I had the gyro meat bahn mi and spring roll. Match made in food heaven. The spring tasted better IMO with the peanut sauce instead of the tatziki sauce. I highly recommend the bahn mi sandwich with the spicy mayo. Price is on point to the amount of meat in the sandwich. Give it a try and you won't be disappointed."}
{"text":"Awesome service and good food. Salads are big with the meals and great prices! The owner is very nice and very accommodating. Am definitely coming back."}
{"text":"This place was perfect for when i was craving a gyro.  Their gyro meat is really delicious and the size of the gyro does not disappoint.  The pita was super fresh.  I didn't even need to order the fries because the gyro by itself is plenty of food!"}
{"text":"Discovered this gem yesterday - wonderful food and helpful staff. Loved homemade falafel wrap, gyros and Israeli salad. Baklava was perfect ending for our delicious dinner"}
{"text":"The grilled chicken salad is not made with real chicken. Disgusting. I paid nine bucks, ate one bite and dumped it. The \"Greek\" dressing was flavorless Italian. The tomatoes were overly ripe. Sure, the worker was nice and remembered my name as previously stated in these reviews, but was that worth the wasted money? No. Did she not notice I threw the salad away and left ONE minute after she brought it? Unreal. I will never go back. Why is it so hard to find a REAL Greek restaurant in this huge town!!?"}
{"text":"It's OK, there are many better gyro shops in Chicago, but for the location, it is the best around. Friendly service too!"}
{"text":"Hey Everybody! I'm Jewish now. This place just converted me. The most precious and delicate falafel I've ever indulged my mouth with came from this humble, unpretentious little gem of a place. Unbelievable.   I've eaten falafel in every city, but this was the show-stopper. Hallelujah.   Oh, gotta go, late for synagogue! (where's my yarmulke?)"}
{"text":"We were looking to kill a little bit of time and thought we'd try this place. Staff is very nice and accommodating. We had the gyro and it was excellent, fresh pita, meat wasn't over cooked, and the tzatziki wasn't overwhelming. They have something for everyone, including a Chicago hot dog. Food comes out so fast, it's amazing. Stop by!"}
{"text":"I am backed up on reviewing, frankly.  So this one is a couple months overdue.    I met fellow Yelper Brian S here for lunch.  I ordered the Gyro plate as I wanted some Greek salad with the meal.  Well the plate deals here are huge.  Two people could probably manage just fine sharing one of the plate meals.  Lots of meat, sauce, fries, salad, dressing.  I didn't finish and still I had no room for baklava after.  Sad.  The decor is pretty basic.  I would class them as a good lunch spot or cheap dinner joint, not in the \"Out for a nice meal\" class."}
{"text":"Its a small spot.  The food was good enough.  Not enough to write home about, but not bad either.  I had a falefel sandwhich on pita.  The pita was just o.k.  Nothing special.  The falefel was cooked right and wrapped with lettuce, cucumbers and tzatziki.  I am from Detroit.  We have a lot of great middle eastern restarurants.  I mean, you can throw a stone and hit 3 great ones without a problem.  I guess I am spoiled by these wonderful places.  The food here is good.  The ones back in Detroit have set a very high bar for me.  Still in search of that falafel that will make me pine for it when go back to Detroit cuz this wasn't it."}
{"text":"This is an excellent place for lunch, I only warn that this place does take a little longer to get your food, but worth it. You're going to be upset if you have a 30 minute lunch break, you're going to be late getting back, unless to go. Chicken was tasty, veggies fresh, wrap was crisped perfectly and wasn't a gigantic carb filler. Delicious food."}
{"text":"Pickles.  That's what I said, pickles.  I've never had chopped dill pickles in my Tabouli salad.  I was pleasantly surprised.  The balance of the salad was the standard bulgar, onion, tomato, parsley and a light dressing.  It was all well balanced and very fresh.  The portion size was just right (a small dinner plate).  It was garnished with thinly sliced tomato and purple olive.  It appeared to have been freshly chopped after I ordered it.  This was a plus.  I also had the Falafel wrap.  It came out in a warm, grilled tortilla.  Contents included a pickle spear (yep, again), lettuce, onion, tomato and a sauce that was like a tahini sauce.  It would have been better with a stronger, more tart sauce, but it was still good.  The Falafel was very good too but they could have put in a few more hunks.  The place is small (only about 8 tables inside).  You go to the counter, place your order and wait.   I sat and they brought the grub out to me.  I'm guessing most everything is made-to-order.    There is outdoor seating.  Prices are great.  Finally, I heard that their Gyro Platter and their Greek Salad are both highly recommended.  I wanted Falafel and I always get Tabouli.  It's worth another try to see if the recommendations are on."}
{"text":"Wonderful food, wonderful owners.  I used to go to this place when it was owned by someone else, and it was very good.  Then it went through two ownership transfers.  I decided to go there as I thought it would be an easy place to go with kids and I was having steak craving, so I wanted the Sultan Kabob.  So when I arrived I admit I was disappointed that there wasn't any steak kabob, but the woman at the counter seemed nice and they had a wide assortment of food on the menu....so very good for me and my 4 and 2 year old...so we stayed.  I was not disappointed in the least.  I splurged on the Combo plate...and of course my son (4) ordered a hot dog (that's a 4 year old for you).  My kids and I LOVED our meal.  The two types of meat they served in the combo plate were EXCELLENT...spiced perfectly...not overly spicy, you could still taste the meat itself, but just PERFECT.  I'm very sensitive to spicy food.  I usually order 0 spiciness, but this just had a hint of spiciness. My son even tried my combo plate and said the meat was a little spicy but good.  Delicious!  The desert were I think pita bread cooked some way with sugar and stuff on it.  Sooo good!  The only recommendation I might have on the combo plate is for them to add a 3rd protein such as some chicken.  You can tell they take pleasure in their cooking.  I'm so tempted to go back for the Beef Pho tonight, and I'm excited to know that they have the Pho soup on Saturday nights.  The biggest thing to top everything off is the beautiful family running the business.  It is a woman owner, and it seems the females in the family all run the business...her sister(s) and mother.  They are extremely personable.  Each one of them came out to have a conversation with me...a luxury I expect they may not be able to keep up with if they get busy enough due to their good food and customer service.  The owner's daughter was sitting at a table, and she was as sweet as can be.  She was an asset as well as kids love kids of course, and my 2 kids seemed to look up to her and she was a distraction for them while they waited for the food (which was very quickly served).  A+++  Food, Service"}
{"text":"This is a solid spot if you want to grab a quick lunch. Definitely a hole in the wall place, they have a Greek and Vietnamese inspired menu and you order at the counter. This is a place you go to for food, not for ambiance.   The service for me is what tipped it to 4 stars. Really nice employees willing to chat with you and walk through the menu with you. They make sure you know everything that comes on an item and are happy to make changes to your order. They brought our food outside to us and even checked in to make sure everything was tasting okay later.   The food itself was solid. I got a gyro meal which came with a side of fries and a beverage. They have  some soda basics (coke, Diet Coke, sprite) and iced tea. My total was just under 10 dollars. The gyro was large in size, and the pita was great. It came with lamb, tomatoes, onions and tzatziki sauce. The lamb was okay, could have been a little fresher, but still tasty. I couldn't finish the side of fries because I was already so full! If I return I will likely get the gyro by itself.   Overall this place will work if you have a craving for Greek/Vietnamese with no frills attached. I have heard really good things about the vegetarian plate if you like hummus and falafel. Lots of my coworkers frequent this place, so perhaps I need to expand my menu choices too!"}
{"text":"After months of battling Israeli street food cravings and refusing to eat Middle Eastern food in the US, I finally gave in. This place was recommended to me by Israelis, so I figured an Israeli recommendation was the next best thing to eating actual Israeli food again. I was correct.  The people are super friendly, and they don't give a shiz that the place is a total dive because the food will speak for itself (until you inhale it). It's all made right in front of you, the ingredients are authentic, it's cheap, and everything is slightly too delicious to be considered healthy. I was immediately transported back to the streets of Jerusalem, and all was well in the land of my stomach.  I'd recommend ordering a falafel wrap or a gyro, depending upon your carnivorous inclinations. Both will rock your world. If you're vegan, the falafel has some kind of ranch-tahini thing going on, so just ask them to leave off the ranch bit and you're good to go. Then, ravage your tin foil-wrapped treasure with the passion of a thousand suns."}
{"text":"Love the falafel wrap with tahini. Falafel is homemade and not from a box. For $5.99, I could eat here everyday. Maybe I will.  Has outdoor seating as well, which I like. They seem to have fewer hours in summer... Like it looks like they close at 6pm M-F and at 4pm on Sat in summer. Hopefully they will update Yelp with any changes to the schedule."}
{"text":"I've eaten here almost 1x's a week for 3 years, it's very good!  They have a typical middle eastern menu... gyros, kabob, pita, salads, and of course hot dogs. They also sell bryer's ice cream and do shakes and floats as well.  Their plates are a nice size, moderately priced, and most importantly, very tasty.  I usually get a plate with 1/2 chicken kabob, 1/2 gyros with fries, salad, and rice for $10.50 or so.  My coworkers always get the gyros sandwich with fries and a drink for about $8.  The two brothers who own this place are real nice guys and care about their customers.  I highly recommend this place."}
{"text":"This place rules. Vietnamese food and/or Mediterranean? What a bizarre mash-up, but I am not complaining. I've tried the banh mi (B+) and a chicken combo w/ salad (again B+). The food, storefront/inside, etc. is more like a 3.5 star joint, but with the uniqueness of the place, I'm rounding up."}
{"text":"I had pho there today and was less than impressed. The broth has no flavor and the meat is cheap and gross. Pretty sure top ramen has more flavor.... The only reason I gave it 2 stars was because of the friendly service and their $1 egg rolls that were good... kinda tough to mess up a fried roll. ?"}
{"text":"Wonderful staff. Kind and helpful. Wish I lived closer. I would go all the time. Such great flavor and fresh food!"}
{"text":"Best place in north Scottsdale for fresh falafel and hummus. She makes her falafels from scratch! Only open til 6 pm so great lunch spot or early dinner."}
{"text":"Made to order, quite the variety.  Everything I got was delicious and the service was great.  I'd recommend over several other options nearby..."}
{"text":"For a falafel, hummus & pita lunch this place is hard to beat.   This small, family place serves up hot & delicious food at reasonable prices.  Falafel are homemade and quite tasty."}
{"text":"Like, love love love this place!!  Nicest staff and the food is amazing, different mixture of foods all delicious.  My favorite is the vegetation plate#7 is my favorite."}
{"text":"Good Mediterranean food, gyro, hummus, fries all tasty.  Greek salad was nice as well.  ask them to brown the meat a little more mine was cooked but not crispy enough."}
{"text":"I had not been there for about six months in that I retired and no longer in the area. Had a lunch at SKG with a friend and they remembered my name. Good consistent food, clean, and fair prices. After six months and not being a regular, they remembered me!  Outstanding."}
{"text":"Delicious!! Super kind staff and speedy service. Everything on their menu is delicious."}
