{"text":"Food was ok tasty, small portions for the rolls but I guess they were only $8. Decor was nice music was a bit loud for lunch. It may be better for a dinner place."}
{"text":"Just okay, but I don't think I will go back. Nothing stood out to me at all."}
{"text":"Mmmmm....amazing different things on the menu...spicy tuna stuffed avacado was amazing!! Can't wait to go back!!"}
{"text":"Reading previous reviews about this newly opened restaurant, it sounded like it was going through some growing pains.     However, I've driven past Sho for months now, waiting for it to open, so I wanted to see for myself.   I'm glad I did.  My friend and I met for lunch last Friday, and ordered up some of the usual suspects:  4 orders of sashimi, 2 special rolls, and Miso soup.   A complimentary appetizer was dropped off at the table when we arrived.  Frozen grapes were delivered at the end.   All told, it was under $50, which was reasonable for the amount of food we received.   The sashimi pieces were healthy sized, which I appreciate.   The special rolls (one veggie, and one \"Fire Dragon\" roll) had excellent flavour.   They were a hit.  Overall, everything was very good.  No complaints.     The one quibble was in the \"growing pains\" department, as others have noted:  we needed to remind our server to bring the second special roll.  I think it was more the fault of the chef, not seeing it on the order card (which we filled out).   However, it was a minor issue, as we were well into everything else.  And our server WAS super friendly, and otherwise attentive.  As for the restaurant itself:  nicely designed, with a modern, open plan.  And though I didn't visit upstairs, the lounge apparently is quite appealing as well.      I can see myself returning for dinner, and then afterwards retiring upstairs for a couple of pops."}
{"text":"I've gotten takeout here a couple of times now. I love the sockeye sashimi, and I have yet to see it on the menu elsewhere in Calgary. They serve it with lemon slices, and put it on little ice bags for takeout. I also love the crispy sushi that comes in wonton skin cup. The Rainbow and Dynamite rolls were pretty good too.  I do wish they had real crab and not imitation. I also didn't care for their spicy tuna roll. The tuna was shredded and mixed with the sauce, and it had a bit of a weird flavour.  As I was getting my takeout, I noticed that people were coming in and had reservations. This is good to know, since Kinjo across the street is always busy and doesn't accept reservations. They are open til 11 pm, which is great if you want a late dinner.  They offer 10% off takeout orders, and I was glad that they automatically applied the discount without me having to ask them for it."}
{"text":"Worst experience ever! I have been many times to this restaurant, lately it has started to fail as a business. Service ... texting while working. Grabbing the food to serve with fingers. Dishes not clean. And the food you order goes to the wrong table or what you order they make something else. I was here the other day and we waited to be served anything from our order. It was 50 minutes to receive one roll. It was in the counter ready they just didn't serve. I asked why only two servers. \"Oh our manger just decided to walk out and go boxing for the day\" really ? So we cancelled the other half of our order didn't want to wait another hour. I hope the restaurant gets their stuff together. Whether changing management or getting more servers or ones who know how to handle food in a clean manner. Won't be returning. To Hanna Sushi I go for now on. Can always count on great service and food there."}
{"text":"So far super impressed with the service and sushi!  You have to try the flaming roll :) YUM!"}
{"text":"The restaurant is clean and bright. Great servers, awesome drinks and the sushi was very good. Until about 4 hours later when we all got sick. :(   I would have been willing to go back until that happened."}
{"text":"As a true sushi lover, I've been to plenty of sushi joints around Calgary. But Sho offered something that no other place did: a refreshingly modern taste on sushi.   I usually hate it when places incorporate modern or fusion concepts into their cuisines. Many restaurants turn a delicious, simple dish into one of overly complex and convoluted flavours. That being said, I was skeptical at first of coming here. But, like others, I heard fantastic reviews of the restaurant and decided to check it out for myself.   I came here on a Friday night with my family (all together, a group of 5). We came around 8pm and it was packed. The atmosphere was vibrant and lively and luckily the hostess was able to seat is right away. She gave us the menus and took our drink order without us having to ask and it didn't take long at all before the food came after placing our order.   The food itself was absolutely delicious. I highly recommend the fire dragon roll. Not only is it quite a spectacle to the eyes but the flavours are a pleasure to the senses. We also ordered the crispy sushi (sushi filling in a small, crispy wonton she'll) and it was amazingly light yet still retained its body and flavour.   For the five of us, we paid around $200 which is relatively decent considering we ordered a lot of nigiri. At the end, we got frozen grapes (a great way to end the meal) and the waitress did not rush us to head out.   Overall 5/5 for both food and service. I applaud you, Sho."}
{"text":"went to meet for lunch at 11 (when it opens) hostess didn't open the doors the first time I checked to go into the restaurant - the open sign was illuminated. so I went and got my brother and we walked back towards the door and again not open. hostess came out and said they were still setting up and it would be about 5 min so we could wait outside. didn't open until about 11:15 and it was because we were about to leave and go across to Kinjo.  food was mediocre for the price had some good looking rolls to try next time."}
{"text":"Went with my family for dinner on August 15. Food was okay, service was good. We ordered sushi and rolls and were unpleasantly surprised by their tiny portions. For instance, 8.5 bucks for 5 tiny pieces of Dynamite Roll! I have never seen them being so tiny - literally each piece about 1/2 inch thick. Next time we'll go to Li Ao or Kinjo as we always do."}
{"text":"This is one of the best sushi spots in Calgary.  You often see the owner walking around and greeting people, and on two occasions, he suggested we order something new and gave us a free menu item to try (and both items turned into go-to items every time we eat there: for example, the Roulette Beef is *delicious* with a sesame sauce to die for- we actually ask for spoons to eat it all, because we are classy like that...).  The appetizers are just as amazing as the sashimi and sushi, and we always finish with the delicious black sesame ice cream- you *have to* try it! The only downside, and I've noticed other reviewers have commented on this too: terrible music. If you luck out you are seated further away from the speakers at some tables than at others..."}
{"text":"Duck sushi, need I say more! Unique menu, great quality and great atmoshphere. Glad I finally made it here."}
{"text":"Ate dinner here tonight with my wife and our 6 yr old.  Really liked the food. We've been a few times and have generally been ok with it but they seemed to have their \"a\" game on tonight.   Wife and I split the fire roll and dragon roll with some assorted nigiri sushi. All really tasty and fresh.  The red tuna tonight was amongst the best I've ever had in Calgary. Our 6 yr old son had the teriyaki salmon and he loved it.  Devoured the whole thing.  He refers to teriyaki salmon as \"the most delicious fish\" and tonight he was not disappointed.  Service was good. Atmosphere was good too. We'll definitely be back."}
{"text":"This is my group of friends' newest favourite sushi place so I knew sooner or later, I'd be dragged to eat here despite NOT eating sushi.   Nice, clean, busy space - we had a bit of a wait but were eventually seated (and luckily, there is plenty of room to sit while waiting for a table), but it was Saturday evening and we hadn't reserved, so that's not surprising as we were a group of six.  I ordered the udon bowl and also a order of yam tempura - and both tasted really good. The Udon bowl could have had a bit more flavour (spice) to it, but for $6 I'm not going to complain. The Yam tempura was very fresh, well cooked inside and out with a light coating of tempura and tasted great.   In total, my bill was less than $11 - and I was quiet full afterwards, which was great, considering I've never yet gotten away with spending that little money in a Japanese/ Sushi restaurant before.  The sushi that got ordered by my friends looked really fresh, and they said it was delicious. As for drinks, a couple of people at the table got bellinis - which were expensive but massive and looked absolutely delicious.   Dining here also provided a good dose of amusement - our waiter was trying to flirt constantly with all the guys in our group (all 4 whom are straight), including placing napkins in their laps, etc etc. Not particularly professional of him, but the abundance of males at our table meant that we were getting really good service in terms of getting our water topped up constantly, food delivered promptly, so none of us were about to complain :)  If I HAVE to go for Japanese food (and with my group of friends, there's no way I'm escaping doing so frequently) then I'd rather go to Sho than anywhere else."}
{"text":"Sevice was poor, there was hair in my Spider Roll and very over priced for what you got. Enough said!"}
{"text":"Such a fun atmosphere and the food is delicious. Great date night spot."}
{"text":"Came for an early dinner with a friend in the middle of the week and the place had two other tables, so parking was easy (private lot) and no wait to be seated.  First impression was cool; a modern place that looks upscale on the outside, but when you walk in you you feel better about wearing jeans and a sweater than you did a minute earlier.  Pretty casual atmosphere.  We were sat immediately, but drink service was way too slow for only having 3 tables (and waitress brought us 2 Coke's instead of the 2 KOKANEE'S we ordered).  They provided a complimentary nut/seaweed wrap/ginger which was nice.  Ordered shrimp tempura as an appetizer and a mix of 8 simple and more hearty rolls between the two of us (leftovers for munchies later).  The rolls came out before the tempura which I didn't like as we ordered the HOT tempura as an APPETIZER.  The sushi itself was a sight to see, amazing presentation, they had some creative looking rolls I haven't come across in my sushi days.  The sushi was very tasty and impressive.  We had leftover sushi to take home, but we realized we forgot it at the table when we got to the car in their parking lot.  We went back inside literally 1 minute after leaving for the staff to tell us that they had already thrown it out.  Why would we ask to have it packed up if we weren't going to take it?  They could've run out to our car to give it to us, I could see my car from inside the restaurant the whole time and my friend was smoking outside while I went to the bathroom before we left.  Moral of the story, remember to take your sushi with you!  Overall I would come back for seconds.  The price was decent, the place was nice, the service was average, and the food was great.  Close to Chinook Mall.  Service 2/5...Food 5/5...Price about $40 per person (keep in mind we had a lot of leftovers)."}
{"text":"Him: Can we go to Sho for dinner? Me: Fo' Sho  Hahaha, ok ok, that was my one Dad joke for the day.  I'd never been to Sho before, and since it was my dinner date's fave sushi restaurant, I happily agreed to go.  I was surprised at the fresh, thich cut sashimi we got considering we are in landlocked Alberta! And I appreciated that the sauce for the agedashi tofu was served on the side instead of in the bowl with the tofu (which most places do and you get a soggy mess).   The fire dragon roll legit comes out with actual FIRE. You need to get it, not just to see a flaming dish (it is pretty cool) but the spicy tuna, unagi and volcano sauce with the added crunch of tempura crumbs is an texture and flavour bomb you need to try.  I was quite impressed with Sho, and look forward to future dinners here!"}
{"text":"Had lunch here for the first time today.  Service was excellent and the food was terrific.  Prices were reasonable as well.  Will go here again for sure."}
{"text":"Overpriced, small portions, and quality is lacking.  On top of that the service was poor.   I expected to pay for a premium (trendy Japanese) however what we received was subpar.  Hopefully they are new and will improve."}
{"text":"The menu selection here is amazing!! There are so many options for any sushi palette. I liked how you check off on the menu what you want, which is pretty standard as from what I've seen, and then the server will go over it with you. Your food doesn't come all at once, which is also quite nice. The server and hostess were both very friendly.   The raw fish comes on a bed of ice, which compared to kinjo, is great! Everything was perfectly cooked, the tempura was crispy and not heavily battered. The tables are a good size for plates.   Their drink selection was nice with lots of wines and cocktails. The only thing that would have been nice is if their dessert selection wasn't so American (or,  chocolate cake, Apple pie, Cheesecake and so on). Other than that I have no complaints!"}
{"text":"Very good place , will go back there for sure !! Service and food are great. The sockeye salmon is very good"}
{"text":"Great atmosphere, so warm, cozy, and classy. Waitresses/ waiters are very friendly. Food is fresh and quick. On the ball with drinks too. Easily my favorite sushi bar!!"}
{"text":"My initial response to Sho on Tuesday 9pm visited: Hostess was great with provide sample of appetizer (Kimchi, seaweed, and spicy peanuts). Service was a minor missed due to waitress lack of interest or motivation to refill our water. Food was great I order Tempura Udon and Fire Dragon Roll.  The price seems little expensive what they offer. Overall fresh food but stale services...."}
{"text":"Bottom line this restaurant is not your typical Japanese restaurant. The interior is modern, and if it weren't for the sushi bar being visible you wouldn't know you were in a Japanese establishment.  The portions are small, for the price but the food tastes good The presentation of the food is also quite nice. If you want more traditional Japanese food, in a more trad. setting then this place isn't for you. Every table gets a three portioned sample dish with salted peanuts, nori (Seaweed), and kimchee. Also every table get's a little skewer with frozen grapes with your bill, after you've finished dining. To sum it all up, if you like Japanese food and you like bigger portions try one of the older Japanese restaurants in town.  Ginza in Willowpark would be the one I would suggest."}
{"text":"We've visited Sho 3 times. The first time was amazing, the second time was meh and the third time was great. I find their specialty rolls delicious, their squid legs are amazing and the service can be hit or miss. However, with prices well below Calgary averages with quality that is about the same, definitely worth a visit."}
{"text":"Probably one of the best sushi restaurants in Calgary. Tried the Spider Roll... the best I have ever had. Other items, such as the sashimi and tempura are equally as good. Service was excellent as well. Recommend highly if you are into quality sushi/fish."}
{"text":"A nice sunny day deserves a patio and since we were feeling in the mood for sushi but wanted to enjoy the sun we decided to go here.  I have to say I really enjoyed the ambience and great service Sho provided but I felt like the food fell short of expectations.   I know, it's a fusion type sushi restaurant but does that mean that all your rolls have to have some sort of deep fried/tempura to them?   We ordered a variety of rolls and none of them stated that the crab/shrimp/salmon or any meat were going to be breaded... so when they showed up I was disappointed that none had the freshness I was craving.   They were of course all tasty, but I felt a bit ill afterwards since I tend to stay away from fried foods. I can see this place being a great location to take someone to introduce them to sushi or for some that doesn't enjoy fresh/raw fish."}
{"text":"Trying to find a restaurant that will take walk-ins on Valentine's Day is not easy...  After our first failed attempt, my sister and I tried Sho Sushi. I was really happy we tried it out!   Considering it was dinner time on Valentine's Day, service was fantastic. Our sushi came within a reasonable time and the servers were very nice and welcoming.  The sushi was also very good! Good sushi for affordable prices. That's good for me :)   The only reason I'm not giving it 5 stars is because my sister and I both agreed that there wasn't too great a sushi selection. I've been to a few sushi places (with about the same menu prices) that had a much larger sushi selection.   Other than that, the sushi was delicious and the experience was fun!  I was very happy we decided to stop by."}
{"text":"Best high end but authentic sushi I've found in Calgary. The food is fresh and delicious. The servers are knowledgeable and friendly, and were able to help us out picking a reasonable cold saki (we're niave in this regard - but good match, thank-you). The atmosphere is spacious and relaxed. It is fast becoming our favourite sushi place."}
{"text":"Really enjoyed my dinner here!  The restaurant itself is spacious, clean and modern. The give you a trio of samplers on the house as you sit down: some toasted nori, spiced nuts and kimchi (I think. I only tried the nori).  I had the miso soup, the tuna sashimi and the agedashi tofu. My mom had the chicken skewers, and the Ninja roll.  The tuna sashimi was amazing! Great size, fresh, and the correct temperature. One of the best I've had in Calgary! My mom really enjoyed her chicken skewers and ninja roll also.   They have a great variety of sake on display that I look forward to trying on a future visit!"}
{"text":"Let's put the story about what happened the first time I was here... in the attic.  Do-over night!   What to do on a Tuesday night, when your movie starts at 10:45 and everywhere else closes at 10? To Sho! Where you will be waited on by the nicest tiny Japanese lady, whom, even when manning a grip of busy tables, was a total boss when it came to service. She was polite, funny, FAST, knows the menu incredibly well, and did a great job of making sure everyone around her had a wonderful evening. Like moving the empty table next to us closer, so that we had more room for food and the protozoa-esque containers for chilled sake.   Love! I'd like this place even if they had mediocre food, because our waitress was such a blast to be around. Thankfully, that was not the case. Her favorite sake choice, the pear flavored, was refreshing and possibly deadly, so while it was tasty; I refrained from having more, lest I fall asleep at the theater! The Dassai 39 sake was also light and fruity, although it tasted stronger. I had a hard time deciding which one I liked best. All of it!  Yes, Sho's fare leans more toward westernized sushi, so if you're coming here expecting to relive the experience you had when you wandered away from your tour group in Tokyo and stumbled across Hattori Hanzo's Kaitenzushi Restaurant; gurrrrl you are in for a world of disappointment.   Westernized sushi can still be good noms in the right place, and Sho is one of those places. The spinach gomae here was on point, and the yam tempura was perfectly crispy on the outside and soft on the inside. I also love that their special Veggie Blossom roll wasn't so big that it was awkward to eat. The rolls here have a good rice to filling ratio and are very reasonably priced! Between the two of us, the bill came to under $29; super reasonable for 2 drinks, tea, salad, appetizer and three different rolls (at 6 pieces per roll!). Not to mention, they threw in a complimentary dessert of speared frozen grapes. Totally refreshing and the perfect end to a cozy dinner! Let's go again."}
{"text":"Since Japanese is one of my favorite types of cuisine, we decided to try Sho Sushi on Macleod for my birthday dinner.  It was conveniently located and had some great reviews so I was excited to check it out.  Atmosphere:  4/5  I was surprised that it was not too busy for a Saturday evening, but we also came quite early.  Interesting decor with a modern and classy feel, and I especially like the open kitchen area.  We were seated at one of the tables with high chairs.  I like the quiet and relaxed atmosphere - great for catching up with friends over conversation.  The back area also had some interesting wall paintings.  Bathrooms are modern just like in Japan!  Food: 4/5  We ended up having salmon sushi, beef tataki, ocean seaweed salad, spider and samurai rolls.  The menu has a number of creative rolls which all sounded very tasty.  I like the option of having black rice for one of the rolls.  Everything was very fresh and tasty, and I especially like having the rolls seared right in front of us.      Service: 4/5  overall friendly, attentive and efficient  Price: 3/5  Reasonable for the type and amount of food  Overall: 4/5  I enjoyed my experience at this Japanese restaurant.  It has a great and relaxed atmosphere to have quiet conversation, as well as some creative choices for sushi rolls.  I would return again to try some of their other menu items."}
{"text":"always been a fan of sushi, but at SHO I found the best sushi restaurant in CALGARY. the quality of food is wonderful and I really sugest to try their sushi pizza. that is the cherry on the cake. thanks to their friendly staff to make your night an wonderful moment."}
{"text":"A whole gluten free menu!!! I have been meaning to try this place for a while as my friend has raved about it. So we decided for some Sunday night sushi and picked this place.   Beautiful decor, love the lights and layout. And as mentioned they have a full gf menu. They didn't have some things that I love, on either menu. One being inari. But oh well. I had the miso soup, salad, salmon sushi, seared beef and the spicy tuna and cucumber roll. Aside from the spicy tuna and cucumber roll, it was all very Good. The tuna was mushy and grossed me out. Prices were reasonable, for my husband and I it was $44.   It was really slow, which my friend said isn't common for them, but we weren't in a rush so wasn't too big of deal. Server was good though, she was nice, knew the menu, gave her faves and came around just enough to check on us."}
{"text":"Another great lunch! Great service, amazing sushi! Tuna Tataki is prepared perfectly, best in the city!"}
{"text":"This place is a good sushi spot if you're not feeling for AYCE! Love coming here if I'm not that hungry for AYCE and just want some sushi. The prices are fair and you can definitely eat a lot with the variety of food choices the have! Try the seared choices, fire dragon roll, tiger roll, and rainbow roll! The restaurant also has  quite a nice setting, and the servers are friendly."}
{"text":"If you Google \"Best Sushi Calgary\", Sho turns up in the top three.  Sho is definitely better than the last few sushi restaurants I've tried.  I'm not sure about \"best\" ... but I haven't recently had better.  I like the vibe.  The layout is open, the decor is modern, the waiters are friendly.  I still can't wrap my head around that yelly thing that staff at a Japanese restaurant do when a new customer arrives... but they do it at Sho.  So that's fine, I guess.  As always, I had salmon and tuna sashimi, avocado/cucumber and salmon maki, and edemame.  They also brought a random appetizer tray of peanuts, seaweed and kimchi.  The food was good, good and good.  My special lady friend had a salad, which was apparently good too.  We both commented to ourselves that the red tuna tasted a little \"fishy\" but ... whatever.    It was a fine late-evening choice.  I like Sho.  I like it a lot."}
{"text":"For a while I've seen Sho's construction along MacLoed trail and wonder just how good this place will be when it opens. Is it possible to have ANOTHER fav sushi joint in the south? Maybe. I'd like to say this place has potential.  They offer the recognizable items one can expect to have in sushi restaurants: sushi, sashimi, rolls, takoyaki, tempura. But one doesn't have to look hard to find unique items: they carry aburi style sushi, crispy sushi, and smoked duck sushi. They also carry an impressive list of sakes that are scattered around the dining room available for purchase.  The last few times I was here I had their common items like tempura, takoyaki, spicy salmon rolls, and their take on the spider roll. Their cooked appetizers were crispy and weren't over done, but their sushi were just good enough to be satisfying and enjoyable but I have to be honest and say my favourite places still hold a firm standing.  But I greatly suggest going here to experience great sake tasting. Their servers and managers were great to talk to about sake and often made suggestions. One time we even had a chance a sake I was eyeing on the shelf! I would suggest getting their Negi Toro crispy sushi, and their smoked duck sushi.  Finally, I find the sushi prices fair and here. The rolls were under $8.00 and allowed me to get several to try without staring at the menu too long, trying to choose the ONE ROLL to have for the rest of the meal because it was over $15. It's a sushi restaurant, not a Subway joint. That said, Sho is not a place for those silly stoners. Nope."}
{"text":"We were looking for something new and we remembered that we had never been to Sho.  We had a few appetizers and some rolls.  All and all the food and service was pretty good.  The only issue we had was one of the rolls had listed ingredients that did not include salmon, which my wife is allergic to.  The roll came and clearly had salmon on it.  We thought that we had ordered the wrong roll or something so when we asked we were surprised that they had changed the roll and not the menu.  Of course they quickly redid a roll for us with the ingredients on the menu but if it had been mixed inside it may have been difficult to see. I chalk this up to the restaurant being pretty new and we will definitely return. No where near the best sushi in Calgary but a nice change if you are looking for that something new."}
{"text":"I have been here a few times with friends and have came back because we all really liked it. Food is very fresh. Service was great. I would recommend it, give it a shot!"}
{"text":"We were told it was great. So we met friends here. So we waited to be seated...NOT busy...no one was around so we went to sit ourselves and she came over and sat us right beside the other 2 tables that were full in the entire place. Sat us without saying anything...no \"hello\" no \"how are you\" nothing. I'm looking at all the empty tables  so we get up and move ourselves. It still took 5 min for someone to come take a drink order.  Once we ordered food it came out lightning fast. Food was good. I'm a stickler for service though and this place sucked! No thanks! Go somewhere else."}
{"text":"Love it. excellent service. superb sushi and you can get brown rice! stampeder roll you are my favorite. so fun for a date or evening out with friends. excellent atmosphere. my favorite sushi nice and fresh. excellent service"}
{"text":"Great interior Food quality average  Service pretty good Price over priced   I would come here if I want a nicer atmosphere But for food quality I'd go to kinjo across the street"}
{"text":"Service was excellent. Food was delicious. We tried a number of dishes. Our favourites were the Fire Dragon Roll, Black Cod and a Sashimi Tartare (was a special item not on the menu)."}
{"text":"Creative and really yummy sushi for decent prices. The sashimi are great and there is a wide selection of fun rolls to try.  They do a production of coming out to your table to sear your tuna, which makes it really fun. There are several options for sushi within a few blocks but this one is always great! We also tried the Matcha Ice Cream this time, it's as good as it sounds."}
{"text":"What amazing sushi!  I'm definitely no sushi expert but next to pizza, it's probably my favourite thing to eat. Half the time I don't even know what's in the sushi I'm eating. But I know good sushi when I taste it!  Can I just say, wow. Sho's sushi is amazing. I'm so in love with it. My favourite gobble of the day was the Tiger Eye Roll. Not the healthiest of choices since it was deep fried and filled with cream cheese, but man was it good. And I mean GOOOOD. We also tried the Fire Dragon Roll, which comes to you on fire (awesome, right?) and tastes pretty rad. We also had the California, Spicy Tuna, Ocean Mountain and Rainbow Rolls, and every single one of them was delicious. We made a point to order light-ish today since we're usually guilty of ordering about twice as much as we can eat, but after today we'll be back enough times to try everything on the menu, I'm sure. I'm so, so impressed with Sho."}
{"text":"I've never heard of this place before coming for a birthday dinner. There's a private area in the back enclosed off with a curtain so it's a great place for a private party. The food was actually really good and well priced. I think we had only the one server helping our party and some guests could sense her annoyance near the end when we had cake cut. They offered the rest for the staff to have and she kind of rolled her eyes at them. I guess they don't get these types of offers often? I dunno...but at other establishments they really take kindly to the gesture of free dessert for the staff. Anyway...I'd still recommend Sho for Japanese food. In fact, I would probably come here just for dinner on our own time."}
{"text":"It's a great restaurant for date night or friends.  Other then that VERY over priced.  Don't get me wrong the restaurant itself is beautiful & very modern. The sushi rolls are tiny and HIGH END price which I think it pretty bull.  The sashimi is okay, not the best.  Great drink menu, lots of different kinds BUT very expensive too.   7/10 because it is a great place. Good food BUT expensive compared to other places in the city."}
{"text":"Review #6 of Yelp's 30 Day Challenge 2012  Let's go fo'sushi? Fo'sho!   I like Sho. I like the big bright windows. The casual yet classy decor. And the fact that there's a sushi roll you can order that comes all lit up! Yep, it's on FIRE! I also enjoyed that we ordered waaaaay too much food, came out stuffed, and yet someone didn't feel like we broke the bank. Another different, stand out item - sushi pizza (deep-fried sushi rice topped with salmon mayo and black tobiko).  Other items ordered: vegetable tempura, chicken fried noodles (yum!), Asian tofu and tuna tataki.   What made the visit better was the cocktail I ordered. Was it a pina colada of sorts? I want to say yes.. but honestly I cannot quite remember. It was delicious at any rate and looked so cool in the glass! (See? http://www.yelp.ca/biz_photos/F8nkAcuCNH-09AWnfv_oWw?select=SFcCQiiUd-JfEtsoorOIHw#RgsGk6HUbFEIEOPoZI4S_w).  Anyway, food was tasty, service was good and I liked the vibe I got here. I'd give it another go."}
{"text":"Amazing food with great presentation, friendly staff with superb service and reasonably priced. Would highly recommend anyone to try... Also have a go at their lunch special"}
{"text":"Opened to the public today! :)  Japanese sushi & cooked food tapas style. Very large space, they even have a lounge area upstairs! Sushi nigiri pieces are $2 & up a piece.  Rolls come in smaller amounts as it is tapas style, so it's smaller portions and meant to be shared.  Had seared nigiri pieces... not bad but they really need to sear it and not cook it - but our waitress was just learning (first time)  Dinner for 4 (pretty full) was $66 before tip (food no drinks) which I thought was pretty decent.  I would come back and try it again...especially after they've settled down."}
{"text":"Sho sushi is a pretty low start, if you are interested in my opinion.  They are definitely built like an expensive, impressive and cool place - but are not able to live to their own expectations, at least at this point of time.  Service is very uneven - from waiters being extra-polite, to seat manager seating her buddies to the best spot and tucking the rest of the clients wherever.  Food doesn't look right even on the photos from their walls, but the actual quality... that was the very first place in Canada where I actually got a fish bone in my sushi. Never happened in a way cheaper and crappier places.  Sashimi was cut with an axe and ridiculously (I mean, ridiculously) overpriced. And overall pricing policy was way beyond and above the actual quality of the food.  Paying that much money for a \"just opened\" decor, tiny parking, uneven service and horrible kitchen work? Meh, I don't think so.  The only reason there are two stars and not one is my honest hope that Sho would be able to improve in the future - and appreciation for the politeness of the waiters who worked with us.  But I am not going to check those guys in at least a year now. By that time they should either die or become worth the money they charge."}
{"text":"I understand that Sho is a pretty new place so when we tried it out earlier I was expecting that there will be a few issues. I just didn't think there will be a lot.  Parking: There is ample parking in the area but one side of the restaurant only goes one way coming from MacLeod Trail. I wish they designed their parking area to have a better flow where you didn't have to go out to the street just to get back in the parking space.  Service: My husband and I arrived early and were the first and only customers when we got there. The miso soup came right away but we had to wait 25 minutes after the miso soup came for the rest of our orders - I didn't expect the wait time to be that long for 3 rolls in an almost empty restaurant. Our server was friendly but she just wasn't around much to refill our water or check if we needed anything else.   While we were there I think they were having a little bit of training. I'm fine with that but I thought that the owner/manager was talking a little too loud which kind of interrupted the conversations of the customers dining.   Food and Price: I think everything was reasonably priced given the size of the servings. We ordered: Miso soup - I thought it's lacking in flavor. I couldn't get much miso flavor from it Spicy Salmon Crispy Sushi - the concept of it would have been great but the spicy salmon itself wasn't seasoned well Rainbow Roll, Spider Roll, Dragon Fire Roll - all these rolls were really great (favorite would be Rainbow roll) and all the ingredients tasted really fresh. I thought that all the ingredients came really well together. I just hope they will be more careful with their ingredients next time as I got something (don't know if it's a shell or plastic) really sharp and hard with my Dragon Fire Roll.   At the end of our meal, they gave us frozen grapes for dessert. Maybe they should just chill them instead of freeze as I almost hurt my teeth when I bit into it.  Will I try Sho again? Maybe because I was impressed by the food but I'd probably wait at least 6 months and wait for them to settle down."}
{"text":"I went to Sho for a friends Birthday with 4 other guys. Found that the tables and the space was a little to small, for the amount of plates that we ordered. That being said they were very efficient at clearing them.  Portions seemed pretty tiny, but were priced pretty good for what you got.  Didn't seem to have anything that really stood out and different on the menu, though they did have one plate of sushi they lit on fire, and that was great.  Would definitely be interested in going back again and trying them again - The space itself though, very good, great look, very modern."}
{"text":"We had been eagerly awaiting their opening since we first saw the construction..! Went in for my daughters first birthday..! We were greeted and seated promtply..! First thing we noticed was the abundance of fruit flies -no big deal as this is summer after all, but it was probably because there were 3 citrus wedges under our table... :-P  We ordered a variety of things including a chicken stirfry for our little birthday girl which the server had assured us was non-spicy and appropriate for a toddler to eat (provided we cut the noodles etc.) We started to receive our food in intervals and each dish was more magnificent than the previous -the tataki was sensational..! The fire and ice roll came out flaming..! The presentation was particularly innovative and refreshing..! However we of course were getting impatient as our toddlers stirfry still hadn't arrived... We finished everything and it still hadn't been brought to us... The server was avoiding us (and our empty glasses) by this point so i had to get up to go inquire where it was... She assured me it was \"in the pan\"... 10 minutes later it arrives... I asked if it was forgotten about as it had been 55 minutes since we had placed our food order and she said, 'No, it was all typed in at the same time!\"  My starving (now tired) daughter scarfed it down..! Our bill was not reduced in any way to compensate for the ill timing... We paid and left...   Will not be returning as it was an awful experience with no explanation..! Even if she had sent the manager over to apologize I wouldn't be so irrate... It was unprofessional and made for a very unpleasant first experience..."}
{"text":"We were hankering for sushi after a long day and were disappointed that our usual staple, Kinjo was closed for renos for the evening.  Our luck had a turn for the better when we saw Sho, pretty much across the street.  Their dining area is quite large and well laid out.  The hostess greeted us and was quite friendly.  Our server was amazing.  She was prompt and knowledgeable about the different menu items.  She was also quite friendly and accommodating to our allergies (sensitivity to sesame seeds).  I was really happy to see a few fusion type items on the menu.  The beef taco was quite tasty.  The \"crispy sushi\" in a wonton skin cup was interesting.  One would usually raise an eyebrow, mixing these two combinations but it worked for me.  I got the special scallop one.  With a couple drinks, appetizers, two rolls, sashimi, dessert and some full bellies for less than $70 it wasn't too bad for price."}
{"text":"Average sushi place we ordered $200 worth of sushi between 4 people so we got to a lot of variety and 80% of the things we ordered were ok very average tasting nothing stood out except I loved their seared sushi and their pork belly bao (super tender pork) wish I had only ordered those two things and I would have been super satisfied. The only other thing unique they have is their fire dragon roll which they light on fire and stays on fire for a bit"}
{"text":"I did common on this restaurant few weeks ago, where is my common?"}
{"text":"This place was a nice find! Very affordable and fresh. We got a number of plates and enjoyed everything. The sushi Pizza was fun-- I have a salmon allergy so they subbed scallops for me! Our fire dragon roll was really neat, which came out on a flaming rock."}
{"text":"I was here with my family for my birthday. The music was at the right volume and the place looked clean. I ordered a few pieces of nigiri. The fish was so fresh I actually moaned. Amazing. I also ordered the spicy tune roll and the California roll. It was very spicy but super fresh. My husband had tempura shrimp,  sweet and sour tempura chicken and some beef. It was fresh and very delicious.  I have always loved the open kitchen concept and this was great.  Then they brought out an amazing red velvet cake gor my birthday equipped with singing  The only downside I had was the woman's rest room had no toilet paper or soap. Kinda gross but I alerted the server and it was resolved.  The men's apparently was clean and up kept. We will definitely be returning."}
{"text":"me and a friend had lunch, the tables are small.....for the price  i had better....it seems weird when different ethnic background speaks japanese....when you come in to the restaurant....pretty friendly though"}
