{"text":"Went in with a buddy I had the Burger and he had the steak sandwich. Burger was good my friends steak sandwich was overcooked since he asked for it medium rare but the bartender fixed it no problem and a fresh sandwich came out within a few mins. The manager then came by and checked on us and offered up his apologizes. Good atmosphere for to watch the game and even with the hiccup of the sandwich it was dealt with very politely by the bartender (Jen) and the manager (Josh). Definately go back not sure why the hate for this place sometimes so I felt inclined to write this to maybe sway it the other way."}
{"text":"Dissapointed! Went for burger night. Really went to watch Stanley Cup and ordered food. Beer selection poor. Does Canada have any microbrew that doesn't taste like old shoes?? The burger were ok but pretzel bun was dry & tiny, the meat was soft and cooked nice but the cheese and condiments were very BLAND! Fries was bland. Sweet potato  fries were tasty! Service was gr8! But prices were kinda high! All in all was really 2 stars but good service makes it 3."}
{"text":"Definitely better food than the location I went too in Scarborough. I'm happy my mean wasn't overly salty this time as I was pretty hungry.

my girlfriend and I were seated right away by whom I'd like to assume was the owner or the manager. he was very polite and friendly. 

our server was over right away for to take our drinker order and gave us time with the menu. 

I had just finished at the gym so I asked for nutritional information regarding some items on the menu. now the server was nice enough to get me the calorie count of the items I had asked for, but calories isn't everything when you're reading labels. I asked if I could see the actual table, and she never brought it out, so of course I had to google it myself.

After our order was taken and food came out, she came once to take another drink order. we were there for 4 hours... when it came time to pay our bill, I had to walk around the restaurant to find her. at the beginning we had asked for separate bills, she still brought one, when we reminded her about our request she got frustrated and we heard her sigh.

overall, I enjoyed my food and that's why I gave it 3 stars."}
{"text":"I hoped to have decent expectations from a chain restaurant like this but it didn't happen.  Mostly due to food quality and more importantly, customer service.

After watching a movie (Deadpool--great movie!), we headed over to Shoeless Joe's for dinner.  Initially, the service was fine.  The restaurant was quite empty for a Saturday night at around dinnertime in a busy area.  I should have clued in on this, but nonetheless, we ordered our food.  My husband had the Prosciutto Chicken Sandwich and fries and I ordered the Buffalo  Chicken Fingers with a side of Mediterranean Salad.

My husband said his meal was great, but I was unimpressed with mine.  The Chicken Fingers were so crispy that I couldn't stick my fork in it.  There were also black burned bits on many of them.  There was a brown lettuce leaf in my salad and some mushy red bits, which were \"roasted red peppers.\"  Didn't see that in the menu description for the salad or I would have ordered mine without the peppers.  My husband was kind enough to save some fries for me so I could eat something...too bad the bottom batch of his fries were crusted with salt.

Eventually, the manager (Edwin?) came by we discussed my experience.   I showed him why I was unhappy with my dinner, but I mentioned that the service was great.  He comped my meal and offered a complimentary dessert (Caramel Pretzel Bites).  This is where the service took a nosedive.  Another server came and dropped the plate off at our table with our saying a word.  I couldn't even ask her (or anyone else) for an extra fork.  Hubby and I had to share the one fork for the dessert.  Manager never came by again to ask how we were doing.  Original server walked quickly by our table.  The restaurant was still not busy so I don't understand why I was a Social Pariah.  For complaining about the quality of food that I was paying for?  Eventually my husband flagged the Original Server for the bill and we paid cash just because I knew that they were not coming to check on us if we paid with a card.

I have NEVER experienced poor customer service like this in any restaurant I've been to, especially from the manager. If this location of Shoeless Joe's doesn't care for my business, then the feeling is mutual; I am never dining here again.  

There are many other wonderful dining establishments in this plaza, so do yourself a favour and check those places out.  I wish we had."}
{"text":"Our waiter was super nice! This is hands down one of the best meals I've ever had. Everything from the food to service was good! You definitely get what you pay for. The tvs in each booth were a plus!"}
{"text":"Tried their Buffalo Chicken Flatbread with Lattice fries with BBQ sauce. This stuff is pretty damn good! By far probably the most delicious flatbread I've had at a sports bar, it's practically restaurant quality. The BBQ sauce is tangy and Smokey and pairs well with the Lattice fries. The toffee pudding was alright, I may not order it again just because of the texture. It reminds me of a warm carrot cake slathered in caramel."}
{"text":"the hostess leonora made my trip to shoeless joes an amazing visit! she was very welcoming not mention the food was delish and service was quick- way to go, i'll be coming back!"}
{"text":"Did you know Shoeless Joe's has a salad that consists of lobster AND shrimp???  In order to guarantee my consumption of veggies, slap some lobster and shrimp on it and I'll be all over those suckers! 

Mmmm... mmm... mmm... heaven!

Granted the dressing needed some limey tang in order to match the menu description, but I didn't care... I had my seafood faves intertwined with mixed greens and cherry tomatoes. Which means Mo is one happy camper!

We did order an appy, but we all know, the lobster and shrimp trumps everything else available on Shoeless Joe's menu... well at least in my opinion!"}
{"text":"Went tonight before a movie.  Ordered coffee. Cold coffee. Ordered fish and chips. Fish smelt off. Manager smelt it and said the batter was new and it was either that or the oil . She took it off the bill.  I'll pass on this location."}
{"text":"I've eaten here a few times - the food is delicious, and reasonably priced. Service is usually good. I highly recommend the wings!"}
{"text":"Great place to watch the game with your friends. Love the ultimate cookie. So delicious."}
{"text":"Great place. Wings were great portion was small, the sliders were on point. Great hang out spot."}
{"text":"Always one of my favorite bars. Especially if you're there to watch sports! Excellent service, and a really good menu with better food than any of the other franchised bars. Constantly changing and evolving. Just wish they had better beer options."}
{"text":"Today's experience was a shit show.   Not only did we wait an hour and a half for food,  once it came it tasted like gasoline and was bitter.  I couldn't even eat my order of fish tacos.   Our table was basically abandoned, I had to go ask for our bill, and the bartender lied about the manager being available.   We were seated at about 645 and didn't get our orders till almost 9 pm.  I will Never give this establishment my money ever again and I'll be sure to let others know how terrible the service and food is.  It is unacceptable service especially in this location. 

The only reason you get 1 star is because your hostess was accommodating, listened and tried to be helpful.   If it wasn't for her I suspect we would still be sitting there waiting for our bill."}
{"text":"A nice sportsbar with nice girls. The seats are oké and the music and TV are also good. But we came for some food. We did order both some burgers. It was not special. The fries were not good. I guess the cook was a plumber in his previous life!? Next time I'll go to Moxie's just next door."}
{"text":"Last month, I did a staycation in Mississauga. 

It was a Sunday. I took in a matinee at the Cineplex at Courtneypark. After the movie was over, I walked out and needed to grab some dinner before heading over to see Depeche Mode at the Air Canada Centre. 

I rarely hang around the Courtneypark area to dine. I decided to stay. 

I hadn't been to Shoeless Joe's in years. I broke my streak and went in. 

I'd say that I was there at around 4:30 pm. There weren't too many folks in there. I was immediately seated at a booth. 

I ordered the following items:

- Championship wings in honey garlic, with carrot and celery sticks, and ranch dip
- Diet Coke
- Slam-dunk donut holes, with chocolate raspberry, bourbon caramel, and limoncello dipping sauces

The wings were delicious. I love honey garlic wings when the garlic lingers well after you have consumed them. They were flavourful and perfect. I didn't want fries, so this portion worked nicely for me. I washed everything down with a Diet Coke. 

I had eyed the slam-dunk donut holes since I first saw it on the menu. I normally don't go for donuts, but the limoncello dipping sauce made me curious. I loved the chocolate raspberry sauce the best. The limoncello and bourbon caramel come in second and third, respectively. The donut holes came out warm and yummy. No complaints!

If I do need a bite to eat after a movie, this place is a pretty good choice. 

(207)"}
{"text":"This Shoeless Joes is found and the same plaza with the theater and Putting Edge and Demetres. It's a sports bar. There a tv screen in the wall beside every booth which is cool.

The food options here are not that interesting. Nothing looks unique or tasty.  The appetizer options suck and there's not much going on here for vegans. Nearly everything has meat. The appetizers were actually kinda expensive at $14.99 on average a piece.

The service on the other hand is great. This cutie named Kyle was our waiter. When I stepped out for a second, he waited for me at the table to place my order and even came back to check if I came back yet.  

At one point I asked another waiter to ask our waiter to come to our table for an additional order. He said he would be happy to take it himself.  He took the order for us, and even checked in later to make sure the order was ok.  Another waitress came to check in tok and make sure everything is OK. I never got such kind and attentive service....and this is just a Sports Bar.  

Kudos to the staff here."}
{"text":"1 star is too much. Worst lunch ever. I get 1 lunch out per week on Fridays and managed to walk out of this place hungrier than when I arrived. We waited over 45 minutes for our food before we had to leave without eating. The manager could have cared less. Just said sorry about that you don't have to pay for your soft drinks.

Oh great thanks for that now I get to go back to work starving. If you can't handle the amount of customers in your restaurant tell people about the long wait BEFORE seating them and killing their whole lunch!"}
{"text":"I've seen this place many times when I'm at the AMC complex but never tried it out until today.

My friend ordered their chicken spring rolls and I got their Santa Ana chicken salad. I'm glad I ordered the dressing on the side because they gave me a lotttt of dressing. Btw, I didn't use the dressing at all. I automatically knew the salad wasn't fresh and were from the pre-packed salads that you buy at grocery stores. $10 for pre-packed salad? I don't think so. I got to try the chicken spring rolls and they were pretty good with the dipping sauce that came with it. Also, their ice tea is wayyy overpriced...it was about $2.80ish.

No wonder I never felt the need to try Shoeless Joe's out...it's nothing special."}
