{"text":"Note:  Take out only.  That said, GREAT BBQ!  Get \"The Shredder\" the pulled pork sandwich.  Get it w/o the slaw which is pretty disappointing, but the Mac and Cheese is great.  Pulled pork is much better than average and not  overly smothered in sauce.  Speaking of the sauce, pretty darn good.      I bought a bottle to have at home even though I make my own.   One of our \"go to\" take out joints."}
{"text":"ICK!  I ordered the pulled pork sandwich and it was seriously the fattiest meat I've ever tasted.  It wasn't \"pulled\" pork meat--it was more like pork chunks.  I got a little nervous while waiting for our food because I kept hearing the dinging bell of the microwave emanating from the kitchen.  Not a good sign.  Their sauce is very tangy...tasted like a lot of apple cider vinegar.  The boyfriend got the brisket and he said is was decent.  Being a BBQ snob I can tell you it didn't look anything like brisket I've eaten in the past.  The baked beans were good so I'll give them credit, and the macaroni and cheese was pretty good.  This is strictly a carryout place.  Skip it and head to the hood for a meal at Hot Sauce Williams on Carnegie.  That's probably the best BBQ joint in Cleveland."}
{"text":"I am not sure if ribs and pulled pork qualifies you to call it a BBQ place.  

A nice place, exactly the way I like them.  Big guy sitting behind the counter.  \"Pulled pork? coming right up.\"  The he goes and makes it!  Also got a small mac and cheese.  Hey tough times.

Now for the pork sandwich.  Must of been the bottom of the bucket, mucho grease.  The way I like it (not sarcasm, it is the good part).  The meat very tender, and moist.  Not much else to it though.  Just greased pork... The end.

Mac and cheese was not good at first. It had that pasty texture of cheap cheese.   As I got farther down it got better,  I will dismiss the badness due to temperature.  It had a richness that gets you in the back of the mouth.

This is a 7 out of 10 on the BBQ place scale.

Note: I am hard on BBQ places, but look 3 stars, and I will go for the ribs.  Update soon."}
{"text":"Best pulled pork sandwich I've ever had.  It's just a take out place, nothing fancy, and I didn't try anything else.  But I would go back for the pulled pork sandwich for sure.  They are closed Sunday and Monday I believe."}
