{"text":"Food was good. Regular bar food. Service was terrible. Debit machine wasn't working. Waited a half hour for my bill. Had to run across the street to Jack Astors for cash. Then when I walk back in I see them walking around with the debit machine. All this time the waitress' were chatting at the hostess station."}
{"text":"I really wanted to like this place since it is so close by to where I live. Sadly it did not meet my expectations. The food was reasonable... but nothing to write home about. The service, put in short, was terrible! We had to wait almost over an hour after the waiter took our order to actually get our meals as we watched other customers who came in much after is have thier meals served to them before us! When the manager was approached about this he seemed genuinely regretful and compensated by taking 15% off of our total bill and desserts were on the house. That sounded like it would make up for the late meal and seemed to please us all at first but after he left the service continued to be slow--seemed to take forever to actually get these desserts to us. All in all, the food is good but service here is obviously inconsistent."}
{"text":"Amazing first experience. The hostess Nicole made my family and I feel welcome. She was sweet, friendly, and knowledgable about the menu."}
{"text":"Only thing i can say is the service was horrible!!!! The waitress was too busy flirting with another table she took 45 minutes to bring our drink. I had to complain for my drink to arrive. Never going back"}
{"text":"This place is so badly managed, and the staff is so full of themselves. We waited 10 minutes by the front door to be seated in an empty restaurant. There were more staff members than customers in the place. When we asked for a booth they took us past all the empty booths on the lower level and up to a \"half-booth\" on the upper level. This had a table so small that only 2 appetizer plates would have fit. Service is NOT their priority. After being treated so badly, we didn't bother staying for a meal."}
{"text":"I went with my friend on a weeknight for dinner and we were so excited to try out this new place! The menu had so many options it took us a while to pick what we wanted and we both went with a pasta dish. The server who was helping us was really nice and accommodating. They let me tweak their pasta dish so that it could be vegetarian and it didn't feel like a hassle at all (again the server was extremely nice and understanding and offered so many options). The atmosphere is nice with a giant bar and lots of screens to catch whatever game you want. Food was great for the price and it's a huge portion. One thing I definitively recommend is their dessert donuts, we got those to share and they were nice and warm and amazing to end the meal with."}
{"text":"Let me start my feedback off by saying bad customer service. If you are planning on doing a party and try to make a reservation don't bother. They make excuses and the manager never returns calls. There is plenty of restaurants around the area so you will not get my business. I do not recommend shoe less joes."}
{"text":"I was torn between giving this place a 3 or a 4 and decided since the trend is going more towards the 3 that I'd give this total rebrand the benefit of the doubt and give ol'Joe a 4 for now. 

We've all been or seen Shoeless Joes, they're an iconic Canadian restaurant chain who, until recently had an uncertain brand identity in my opinion - kind of a casual sports bar, kind of meh and unremarkable, wait are you the same as Crabby Joes? With this new flagship location in Vaughan towering (literally) above all nearby options, Shoeless Joes stand out amongst the chains and you can bet this trend will continue.

They've taken all the best parts of the cool-hip indie bar, meshed it with the sexy sophisticated of Real Sports/Moxies/Earls and come away with something truly visually impressive. This location stands two stories with an ice-like main bar that wraps around the main room surrounding a two-story centre bar tower which is adorned with multiscreen 4k televisions abound - and a cosy main floor patio to accommodate overflow from the more popular rooftop and that's just the main floor.

With regards to the second floor, there is a second smaller dining space with its own bar attached to a massive rooftop patio the first of it's kind for this plaza and perhaps for the city of Vaughan. I foresee the upper floor being easily booked for private events seeing as the main floor has so many seating options.

The restaurant's architectural aesthetics and branding aren't the only things that got a facelift either. The menu is vast, detailed, adorned with high res drool-worthy pictures and leatherbound. The food seems to be all new with a few old favourites hanging around - be forewarned this is no longer JUST a wings and beer with bad burgers joint, they've truly stepped up their game.

Our group ordered the feta cheese bruschetta flatbread to share, a quinoa salad with salmon, the Mac Mini Sliders and the steak sandwich for our meals. The flatbread was nicely done, finished with a balsamic reduction and a garlic sauce and big bold tomato flavours.

The salad and Mac Minis also were home runs according to my dining companions. only my meal was a miss at first - the steak sandwich. It was not a sandwich but more of an open-faced deal with only a bottom bun. It took them twice to get a medium rare cook right on the steak but I think they try to get by with lower quality beef on this dish by smothering it with a highly salty gravy. My theory on steak is simple, buy it right, season it right, cook it right, and if you do all those things you can leave gravies and heavy sauces... right on the counter (or garbage). But at only 530 calories when paired with a salad it is one of the surprising healthy options on the menu.

The only other disappointing item was their bar menu. They've made an attempt at a variety of cocktails and punches but failed to pair their indie-vibe with craft beers - it's a straight big 3 beer companies vibe in here which definitely have their place - I'm not saying get rid of the big guys, I'm saying make readily available beers that match who you're trying to be.

Overall, there are enough good points here for me to come back - it's definitely the place to be for watching your favourite team or special event. Looking forward to coming back again soon

Eatcrest Out"}
{"text":"Hi y'all love this place tried to eat something new.  Didn't work the burger was missing more meat. I wanted a cow not a calf. I wanted Caesar salad It was a 1.00 more..why make It an option?!? The sangria was great especially when I watered It down. The seeds nearly killed me (That's how I like It) but this place get full stars for our waitress. I don't know her name but she looks like Archie music teacher in riverdale season 1 (watch It it's amazing)"}
{"text":"We came for the wings and they tasted great! I was surprised at how big this place was and the interior design was nice. Our server was great, I will for sure come back."}
{"text":"Went there tonight with my wife for dinner and had drinks and we shared the double stacked nachos.
The beef was very scarce and there were way too many ring peppers, and not enough jalapeños.
Too much lettuce. They need to add more beef.
Would not recommend this item.
Service was good otherwise."}
{"text":"I was attracted to this place because of the outdoor patio that was located on the second floor. I arrived here with a friend on Saturday at about 8pm and the wait time was 40mins. We ended up waiting 30mins before we were notified by text. 
I didn't end up getting a seat in the patio but it's okay, I was starving by then. 
I agree with some of the reviews where there were a lot of empty tables so I don't really understand why the wait was 40mins? 

I ordered fish and chips while my friend ordered a vegetarian wrap. We both thought the food was decent. I wouldn't have expected more from a sports bar. One thing I liked was that we ordered a pitcher of sangria and in the glasses, there were sliced fruit and ice, which was nice.

I really like the décor and ambiance at this Shoeless Joes but I probably won't make an effort to come here often, maybe in a couple months after management works out a couple kinks and manages the customer flow better."}
{"text":"Not very good at all. We were very disappointed with our first and last visit to this location.
From our server who wasn't very pleasant, and not knowledgeable, the food took very very long to arrive, and did not taste very good except for the burgers (I'll give them that)
Gluten free options are not actually gluten free, including the fried, sweet potatoes fries which I was told would be, untill I ordered the over priced burger, which was my only option as I'm tiered of salads being the first GF option, and I was told the flatbreads were not good as they taste like cardboard  and we were misled with our GF options over the phone. Although the ladies on the phone were pleasant, it didn't help our situation when we arrived hungry and were hoping to see more options! Very disappointing. 
ESPECIALLY THE Slow service, small portions- HAVE TO POINT OUT ;  the calamari which was tiny, and half of the tiny portion was breaded peppers, not a shareable app what so ever, I did not have any as it's not GF , however my family did, and did not like them at all. 
No wonder there's not much of a wait here compared the all the other places near by.  
The decor is fairly nice, except we found the seating too close together and too open, over all wished it was better!"}
{"text":"Despite other restaurants in the area and negative reviews my friend and i went here around 1pm.. it was a beautiful day out so we sat at the 2nd floor patio. 
There were only 2 occupied tables and us, we sat down and waited a little while for the waters to arrive.. shortly after she took our orders, We wanted to try their daily promo (half priced apps), so we got the fish tacos- waitress asked me if I wanted 3 or 4, and i said \"whichever is the promo\", we also got a chicken wrap for myself and burger for my friend.  

The fish tacos came out after 10-15 mins, they were good, I've had better, but these weren't bad. 

Then we waited for the mains...... and waited... and finally  after a whooping 45 mins, our BURGER/ FRIES and CHICKEN WRAP/HOUSE SALAD arrives!!!! The best part was that another table who came a long time AFTER us got their whole order AT THE SAME TIME AS US!! 

What kind of service is this? First of all, why does it take that long to make a burger and chicken wrap (with bits and pieces of their chicken fingers in Buffalo sauce)? 

At this point I just wanted to pay the bill and leave, so we call for the bill..... and we waited... and waited, and then waved down another worker and he got our waitress to grab us the bill. 

The bill comes, and we are charged the FULL price for the fish tacos.. I told her there must be a mistake and she proceeds to tell me \"oh no, It's only half price if you purchase a drink, and since you only got water it's full price\". And she walked away. ARE YOU SERIOUS? So, at NO point did you think you should've MENTIONED it? I mean, surely you would inform us after I pointed to the HALF PRICED APPS section on the menu and said \"I want these fish tacos\".

I will NEVER return to the place when there are so many other options around. Maybe they need to get more experienced floor staff AND kitchen staff."}
{"text":"First time coming to Shoesless Joe's restaurant ever and I did not enjoy it at all. We asked for table for 3 and one of my friend was running late so we want to wait for him before ordering. Server kept asking and asking so we eventually gave in and ordered the nachos. Other friend came and we decided to order the entree. I ordered a maple bacon Caeser for $14. I didn't expect it to be through the roof amazing since it's just a Caeser salad at the end of the day. 
Got my food then while I was eating I noticed I don't have any bacon in there and so I spoke to the server and told him I ordered a maple bacon Caeser. He apologized and 2 mins later he came out with 2 lowsy strips of bacon. Honestly I would thought it would be chopped up and mixed into the greens. I guess i was expecting too much when I get charged $14 for a Caeser."}
{"text":"My friends and I come here all the time whenever we're looking for a moderately nice place to hang out. The patio is definitely one of my favourites. Very nice vibe and they have cute lights strung all around the rooftop patio.
The food is also amazing. I've ordered the berry pecan salad with grilled chicken many times and its a great option if you want something light and not too heavy.
Also, their white berry sangria is AMAZING. I order it every single time I go there.
It's not too busy during the week however, if you were go to on a Friday or Saturday night there are a lot more people and its much move vibrant. Either way, one of the nicest sports bars in vaughan."}
{"text":"The layout and design has so much potential. I could see this place being an amazing spot on game nights. I visited on a Tuesday night and there was an hour long wait to sit at either patios the one downstairs or the one on the roof.

Aint nobody got time for that so we ate in the dining room. The menu has a decent amount of options. I order the beef stroganoff and my friend ordered the crusted chicken. She enjoyed her food a lot watch out for the jalapenos they are spicy. My stroganoff was good but I did feel they were stingy on the beef.

The waiter was nice but could of been more attentive. I would of liked some ground pepper and cheese for my pasta but was never offered. Overall I would go back nothing horrific happened to turn me away.

 Oh the tropical sangria was quite refreshing."}
{"text":"Service and food is horrible! The hostess at the front forgot to seat us. Told us to wait few minutes, we saw other walk-ins that came in after us get seated right away. After waiting a long time I went up to ask, She asked me if I had a pager or if I got a text,(I don't remember) but I said no because she never asked in the first place. Then after scrambling through her list she had someone seat us. Waitress also forgot about us many times, nachos took 40 mins, and it was only after we asked about them again, that someone else brought them to us. They were stale like they had been sitting under the heater for a long time. The rest of the food was average. The staff is very focused on themselves and not on the customers or their job. The only reason why I gave it 2 stars is because the venue was nicely done."}
{"text":"After our best at symposium cafe on good Friday we came here.  They seated us immediately and had us served and out of there in an hour.  This was a good thing since we had a TFC game to get through and just wasted 1/2 hour at another restaurant waiting to be served.  I had the chicken and chickpea bowl.  It was ok but unfortunately served with slimey cucumbers which is hard to forgive. Everyone else in our party enjoyed their food though.  As a table we tried the Ruben, the clubhouse,  and porchetta sandwiches and two kids meals. It's hard to mess up sandwiches.  Seems like this is a place to go more for atmosphere then food quality, but it will do in a pinch."}
{"text":"The second floor patio is gorgeous on a beautiful day with good weather. This place is HUGE. Seemed pretty cool, had that 'new' feel to it. Food was mediocre and service was poor. The waitress was not attentive at all. She took our order, brought drinks out, brought food out and we never seen her again. She didn't check up on us to see how we were doing, if we needed refills (which we REALLY needed) and when I did see her on the patio, she was busy flirting with a few guys at another table. Not so much an issue, I mean the girl needed to get her tips, but still. Just disappointed with her lack of effort to tend to the table. At the end when she brought the bill, she gave us a sob story that its hard to work on the patio because there's 2 flights of stairs and EVERYTHING is downstairs. This MAY be true and is not her fault because maybe it just isnt managed effectively. So yes, we still ended up giving her a good tip despite the sad service. Not in any rush to return but their drink menu looks attractive so wouldnt mind coming here for a few drinks on the patio."}
{"text":"Place is brand new, only 2 months in operation, it has that new crisp feel to it still.
It's huge, big main floor, outdoor patio, then a second floor almost as big, plus another rooftop patio!
Beautiful trendy decor, more on the sports bar atmosphere hut definitely on the higher-end side. Great for watching games, since it's a large space so it can fit alot of ppl and they have a wide variety of beers selection on tap.

In terms of service though, it's a little slow, considering that the place is brand new, only about 25% full when I visited it, and there seems to be a good number of servers, yet, service is on the slow side.

Food quality/taste isn't anything special, very mediocre which is unfortunate considering that their menu is HUGE with some really cool and unique items such as flatbreads, thai pad bowls, pecan crusted chicken etc...but the taste is flat and misses that spark!

We have ordered the home run nachos with chilli beef and asian chicken bites to start, followed by Buffalo chicken and the pecan crusted chicken. None of these seem to impress us with taste.

Too bad since the atmosphere is amazing, I will certainly visit one more time for the sake of giving it another chance, because it's new so hoping they will improve and take these reviews into consideration.

Atmosphere 10/10
Service 4/10
Food 3/10"}
{"text":"We came here on Saturday afternoon. It was moderately busy. The restaurant looked great both inside and out. I love the decor. It reminded me Wegs but fancier. 
We were seated right away. Our server came and took our drink and food orders quickly and accurately. 
I ordered the short rib gnocchi and my boyfriend ordered Southern Chicken Sandwich. He ordered French onion soup as an appetizer. 
The soup was super tasty. Lots of onion. The bread was soaked perfectly. It had just the right amount of salty ness. And the temperature was perfect. You could eat it right away without burning your mouth off, but it was still hot. 
The short rib gnocchi was good, but a bit on the bland side for me. The gnocchi were well cooked but very thick. The beef had a lot of fat attached to it and was a bland. Honestly, the best part of this meal was the garlic bread. It was amazing. I would not order this dish again. 
My boyfriend really enjoyed his sandwich. It was fresh and tasty. The fries were delightful. 
The service after our food was delivered got a little rough. Our server disappeared and left us no time to
order dessert as we had to be somewhere. However, she was very polite and professional throughout our meal. 
All and all we had a positive experience. We would definitely return if we are in the area."}
{"text":"Had lunch here today. The place inside is beautiful. We saw the patio on the top floor from outside which looks amazing so we decided to stop in to give the food a try. We sat on the bar side inside the restaurant which was close to the patio so the doors were open. It was good because the weather was was good today. We wanted to order the artichoke and spinach dip but the server said they didn't have any today. So we just ordered our entrees. I had the bbq chicken strips with market fries and my bf had some kinda sandwich (can't remember the name). Both dishes were okay. The chicken strips were kind of dry but had a nice bbq flavour. The only thing was that the server never came back to ask if we wanted anything else once we got our food or if we wanted a refill on our drinks which we did. I kind of had to make eye contact with the waitress to get a refill on my drink. All in all it's a nice newly renovated spot."}
{"text":"The lit up bar, sexy wait staff, and high ceilings make this place attractive. Too bad the service and food is mediocre at best. Fun spot to have a beer with the guys/girls for pre-drinks."}
{"text":"Came for the cute rooftop patio... it ended up raining so we didn't get to use it. Not their fault anyway. We went on a week night, so we didn't have to wait at all. Ended up sitting upstairs which was nice. This place has a great atmosphere, every modern looking. Has very cool lighting underneath their bar area. Service was pretty on their game. No complaints there. 

I ordered the classic burger. Which had prime rib patty on a bun with lettuce, tomato, red onions, and a dill pickle slice. Served with fries. Was not good at all, sounds great, not great. The meat was really dry. I definitely do not recommend getting a burger. Try something else if you can. The fries we're great though. I had the sweet tart sangria, which was good as well."}
{"text":"First time here was a disaster. Very slow service, never replenished drinks, people missing food etc. All around disaster. Food was mediocre, atmosphere and design not bad better then old SJ.  Manager took over our table and compensated us well which was very nice of him. Which led me to come back to give it a second try. This time we came on a Monday and hardly anyone in there and service again was on the slow side. I'm a server and as a server you want your food ordered and out and drinks flowing. Drinks is where the monies at. Had the fish tacos and wasn't a fan of them. Found them to be too deep fried and hard and corn shell falls apart. Was hoping to like it better second time but disappointed."}
