{"text":"I used to come here quite often, but apparently their portion has become way smaller than when it just just started. You get only 4 slices of fish even with large size. I guess I'll stop going there."}
{"text":"I heard great things about this place and it didn't disappoint! 

- The prices were great and they had some good deals for two people meals. You can choose the type of fish, the taste (level of spiciness), and toppings (for an extra $1.99 each). The dish comes with onions and some with tofu so even without other toppings it is still delicious. 

- The regular size is enough for one person. I went with my friend and we ordered two regular sizes. It was a good amount and we had no leftovers. The large size is for two people but is large! 

- The plates are shaped like fish (cute!)

- A fire burning candle like thing under the plate kept the dish warm and bubbling the whole time.

- The place is small but decorated well. It was clean and cute!"}
{"text":"Their food is really good and pretty affordable too! One thing that they're lacking is that the server can't speak English as good as I hoped."}
{"text":"Monday lunch, only 5 or 6 tables and we waited for about 25 minutes to get our dish. The filet is not fresh, only few pieces of Chinese cabbage as side, taste bad. But the price is too high,
$19.99 for one order. You know the frozen filet in super market only sold for $2.00/lb."}
{"text":"We're a huge fan of anything spicy, especially involving peppercorn and chilli oil. ??? (fish cooked in spicy peppercorn and chilli oil) is one of our favourite dishes, so of course we had to try out this place! We ordered the large Alaskan Cod Fillet with quail eggs, mushrooms, wood ear fungus, cabbage, and potato noodles. The pot is shaped like a fish too, so cute!! This place is almost like a hot pot place, and we over ordered because you cook other stuff other than the fish. We weren't expecting each dish to be such a huge portion, so order less!! The chilli oil broth was very spicy, perfect for us. The fish seemed a bit over cooked but I think cause they cook it prior to serving it. Other than that it was delicious! The service was also amazing, they kept refilling the fuel for the fire, and made sure we had enough broth to keep cooking the food. So excited to come back and try out other things!"}
{"text":"Overall - 4.0/5.0

Apparently this place is a franchise that originated from China so we decided to give it a try. The restaurant was very clean with interesting decor. 

We ordered the special cod fillet with chopped chilli soup base. Additional toppings that we selected include lotus root, cabbage and glass noodles.

The cod fillet was fresh and tasty. The soup base was just the right level of spiciness and was also quite flavourful at the same time. It was not the numbing spice that you would get with loads of peppercorn which is the kind that I do not like. It was a very satisfying meal and I would definitely come back again!

They have an option for regular or large for the grilled fish hot pot. I think a large would be ideal for 2-3 people and 1-2 people for the regular depending on how big your appetite is. They also have other seafood hotpot options including crayfish."}
{"text":"Their lunch deal is out of this world. Spent $11 per person on a giant platter of fish. Tasty and not overly saucy, and had leftovers for another meal!"}
{"text":"I've seen this place before in LA, and thought I would try it here. It is a small little store, not many tables. 

The food there was pretty good. We ordered the alaskan cod for the kids, and the other cod (I can't remember what it was called) for ourselves. The waiter recommended that we order the large for ourselves, but the small for the kids. Big mistake....the portions are quite large. Between the four of us, we couldn't finish all of it. I would recommend for two adults and two kids, just get one large or two smalls. The black bean sauce wasn't really good, but the spicy one was fantastic. Another recommendation would be to add the transparent noodles. They were the best. The udon wasn't very good and the kids didn't like it very much.  

The thing we didn't enjoy was the service. It was like the people were just too tired. It wasn't very busy, but we felt that they were dragging their feet, wouldn't check in on us, forgot our cutlery and drinks. That is where they lost one star. 

Overall, I would go back again."}
{"text":"The fish is good. But the side dish I literally just tasted soy sauce and chili oil. The service is pretty bad. It's not the lunch time and you need to ask for adding water, napkin and dishes. We literally finished the fish and they didn't give the rice. And keep giving the wrong dish."}
{"text":"We were here for lunch and were able to take advantage of their lunch combo for 2 people which included a full steamed tray of Alaska cod fillet -- you could choose the type of fish (or vegetable), the type of sauce -- rice, Sichuan kimchi, cabbage, and a drink.  It was really worth it all for just $19.99!!  What a steal!

We selected the \"hot pot tofu\" sauce to go with the fish.  This sauce had three chillies displayed on the menu.  You could also add additional toppings into the tray so we added black fungus, luncheon meat, and lotus root for $1.99 each.

This hot pot tray of the Alaska Cod Fillet was in the shape of a fish!  How cute!  There was a flame applied underneath for the food to boil and to stay hot throughout the meal.  The cod fillets themselves though were already cooked and you could eat it right away; this wasn't a typical hot pot type of meal where the ingredients in the pot arrive raw.  As the flame continued to heat up the food, the spicy oil became hotter and hotter so beware of that. 

This was an incredible meal!   It was one of the best meals I've had.  The Alaska cod fillets were sliced thinly and very meaty.  The chunks of tofu were piled on top of the fillets with lots of green onions.  The luncheon meat was hidden away under the fillets with some black fungus and lotus root sticking out from the pile."}
{"text":"Hands down , one of the best hot pot place , I have ever been. Don't waste time, if you don't like fish."}
{"text":"It's good to note that this place takes a bit to prepare! It took them about 15mins to get the fish on the table for it, but then we had to wait for the dish to boil and get hot! The staff was really nice. They explained and gave honest recommendations that helped with our experience. 

We had the Beef Hot Pot in Spicy Tofu for one and the Atlantic cod in Spicy Chilli for two with quail eggs, potatoes and tofu! 

They were both very good dishes, however, without rice and more add-ons, it's not filling. Aside from our add-ons, the Beef came with turnips and onions, and the Cod came with just onions. The quality of the beef and the fish were not bad either! In terms of the add-ons, for $2 each, they give a lot of each item. I thought they would be cheap with it, but I was wrong! 

The Spicy Chilli is manageable in terms of spiciness, and the Spicy Tofu was a little bit numbing but very flavourful! We were scared it would be too spicy to eat, so we ordered the smaller dish for that one. Both bases were great! 

We'll definitely be back again, but will load the fish dish with more add-ons. However, the dish is not that deep, so I'm curious how they will fit it in. Will there be less of each item or is there a deeper dish they have?

We also ordered a rice and two herbal tea drinks, and it came out to be $63. It is a bit pricey for what it is, but there is quality, it was flavourful, and there aren't many places like this in Toronto. It's a hot treat on a cold day!"}
{"text":"Sichuan Kungfu Fish is a Chinese restaurant located in a small plaza in Richmond Hill that specializes in spicy Sichuan fish dishes. I went this past Saturday around lunchtime to see if warranted all the positive reviews or was it just another place that just served mediocre spicy food.

We decided to go with a large steamed tray of Basa fillet ($19.99 plus tax) at a chopped chili spicy level (two chillies). The spicy levels range from curry (one chili), chopped chili (two chilies), hot pot tofu (three chilies) and the peppercorn spice (three chilies). The more chilies, the spicier the dish. We also ordered a regular dish of spicy crayfish ($12.99 plus tax) which came to about ten spicy crayfish. We also two steamed rice (.99 cents each plus tax) and added enoki mushrooms and cabbage ($1.99 each plus tax) to the steamed Basa fillet dish.

The steamed Basa fillet dish was incredible. The fish was lightly pan fried before it was put in the broth to give it some form and it was so tender and moist and soaked up the broth perfectly which had onions and chopped chilies in it and great flavour to it. A lot of places have dishes that are really spicy but the food is mediocre but this dish was perfectly spicy and a great dish that was executed perfectly.

The spicy crayfish was good, definitely very spicy, and a reasonable size. The only thing I would recommend is letting the crayfish sit in the broth longer to better absorb the broth.

Eating at Sichuan Kungfu Fish feels like you are eating a great home cooked meal. Hearty and so tasty but not overly complicated. If you love spicy delicious food, I definitely recommend Sichuan Kingfu Fish, it's definitely a hidden gem in Richmond Hill. The prices are reasonable and the portion size are a fair size and most importantly the food is spicy and delicious.

They also had a promo for 15% off for people that posted pictures of their food to WeChat which is a free messaging and calling app used by the Chinese community."}
{"text":"Nice decoration, order special cod fillet with chopped chilli was great, love the taste and experience, picture says it all"}
{"text":"I came here on a Wednesday afternoon and there were a few tables occupied already at around 12:45. And by 1 ish, I didn't expect it but it was almost already a full house. The space is quite small though. The decoration is quite unique and classy. Seatings were comfortable and staff was friendly. 

This place mainly eats hotpot fish. But for my actual fish eaters that like the entire fish this place isnt for you because they only serve fillets. But for people that dont like bones then this place is great. The lunch combos are pretty worth it. I got the 16.99$ lunch combo and it included 4 large pieces of fillet with cabbage and onion inside the soup. Cabbage kimchi, two bowls of rice, and 2 pops. We ordered an extra side of lotus root and bean curd for 1.99$ each. There were 8 different soups to choose from. All soups are free meaning you didnt have to add extra money for any soups which is a bonus. There was 4 spicy and 4 non spicy soups. We got the chili one which consisted alot of red chili, green onion, and tomato. The more you eat it the more flavourful and spicy. Omg so so so spicy. The table beside me ordered the most spicies one and he asked for extra spice. Like how??? I was literally dying from the heat. Since the combo came with two pops it saved my tongue and esopagus. The hot pot had fire underneath so it kept the fish hot. The fish was pan fried before they put it in the soup so it was super tasty. The lotus root and bean curd went so we with the soup. The bean curd was was a little chewy even after leaving in the soup for so long, but it soaked up all the soup so it was still so good. 

All in all the combo was such a good deal. I would definitely recommend trying the combo first because it included everything you will order for the soup (pop and rice) to survive the heat."}
{"text":"3.5 stars: Friday night dinner is quite busy at this joint. Got seated without a reservation but space is I-can-hear-the-next-table tight. Service was okay, not particularly warm & friendly.

Ordered one of their Dinner Combos: Special Cod Fillets with Chopped Chillis (2 chilli heat level). I asked to swap the luncheon meat with something else but it was not allowed, so we asked them to omit it. 

We were served a hot tea and a cold, purple sweet-sour plum drink. Our large tray of food arrived at the table after average wait time, which seemed longer because the dish of Japanese seaweed appetizer was small. One of the wait staff obliged when we asked her to take a photo of us. 

Cod was tender but contained a lot of small bones (glad I didn't bring my kids). It simmered in a flavourful broth containing cabbage, black fungus, diced red peppers and an interesting type of vermicelli ~ almost an inch thick, translucent and chewy. 

Husband & I *just* managed to finish the whole dish, and neither of us ate more than half a bowl of rice. Glad we didn't add any other ingredients / side dishes. 

In summary, this is a place to try something new and the food quality is pretty good (based on our Cod Special). Don't expect too much in terms of ambience or service and you will probably leave happy on a full stomach."}
{"text":"After coming here the first time to try, we have come back many times. If you like fish, this place is great. If you're not, then you might want to try but it might not be for you. 
The restaurant bring as taste of Chinese flavor in a hot simmering dish. The menu is simple; choose your fish/bone or no bones, then choose your flavor or seasoning (most are spicy), finally add any ingredients you would like into the soup.
We always get the \"chopped chili\" fish. We have also tried the Sichuan Numb Pepper and non spicy flavors and they are all good but spicy is best. 
The best time to go is on Monday-Thur where they have a combo menu that includes ingredients in the soup and an included bottle of a flagrant sweet tea.  Lunch is also cheaper.
Staff is very friendly. They speak English and Mandarin.
Will definitely come back again."}
{"text":"Enjoyed our meal here! We had the Alaskan cod and seafood combination, and both orders were for th smaller size servings. The waiter told us that the smaller sizes were individual portions, but when they arrived we were a little bit shocked! Honestly, we did finish them both (there were two of us), but we were super stuffed after. The menu might seem a bit pricey, but if you're not really hungry, two people could get by with just one small serving I think, with some add-ons (about $2 each, we had the quail eggs). That way, it actually works out to be relatively inexpensive.
One thing though, the waiters couldn't understand me when I was trying to ask for soy sauce; everyone had a laugh about it later though, haha."}
{"text":"Tried this new place in Leslie, not knowing what to expect and decided to trust my yelp instincts and I wasn't disappointed. The place is clean and service is prompt. This used to be a congee place. We ordered the seafood combination with sliced chilis. It came with mussels, shrimps, fish and crab meat. The broth was very flavourful. The fish was tender and flaky it melts in your mouth. I would want to try other combinations like the pickled cabbage and peppercorn. There were lots of add ons to choose from, from veggies to tofu. I would definitely be back."}
{"text":"I saw a lot of hype about this place through social media, and it seemed quite promising though didn't meet expectations unfortunately.

My other half and I came here on a Tuesday night. We were the only table in the place and arrived at 5:02 PM. We quickly looked once at the menu and asked about the special and were told its past 5, so the special is no longer valid. Fair enough I guess, 2 minutes past 5 is still past 5. 

We ended up ordering alskan cod fillet with curry sauce, black fungus, lotus root, and broccoli. We also ordered a bowl of rice, as rice is not included. If you order JUST fish, you will get fish, onions and your chosen sauce period. No rice, no other sides beside a cup of tea. Just fish, sauce and onions as per server explanation. The curry sauce was the very liquid curry, not a thick style curry but still decent tasting. Each side costs starting at $1.99, so if your a bigger eater your bill may start to add up quickly. Otherwise, just ordering the fish again you just get fish, onions and sauce.

When the plate of fish came out it looked quite large, and presentation wise quite Instagram worthy. Taste wise, it wasn't overly salty or weird tasting. But that's about it, nothing extraordinary or bad, just decent.

Please note as well, a lot of photos show a very large platter of fish. But we were surprised that while yes, the platter appeared large, the depth of the actual platter was only about a fillet or two deep. Meaning that when looking at the platter from the side, really the actual depth may be 25% of the width outside. Not sure why the platter looks so thick outside, with so little usable room inside?

Being the only table in the entire restaurant, it would have been nice to get our tea refilled without needing to flag someone down after sitting there for 45 minutes, but when flagged down they did come right away.

Another side note, when we walked in the first thing we see is one of the workers napping sprawled across a bench using one of the available pillows. Classy.

Generally I wouldn't personally come back. But if a friend wanted to come, I may tag along."}
{"text":"The fish here is just so so. Compare with a Chinese traditional one (a good one), I will give the food a 6 out of 10. The service is bad, always forgot my order and gave me the wrong thing, I will give the service a 3 out of 10. Therefore, I don't want to come back again."}
{"text":"Headed to Sichuan Kungfu Fish to taste their authentic dishes. On our visit, we ordered Atlantic haddock fillets (with Chopped chili soup base), special cod fillets (with ketchup soup base) and lamb (with curry soup base). Base on my experience with Sichuan food, I would say this restaurant is one of the best in Toronto & Markham area.

For the Atlantic haddock, the fish is very soft and tender. The way they put the side dishes is rather clever. They lay out the sides on the bottom of the container so the spiciness doesn't get to the fish. Essentially, this will prevent the spice covering the fish and override its freshness. For the soup, I consider it as medium spicy with a bit of sour flavor. The spice comes rather slow but it intensifies after you swallow. While I was tasting the soup base by itself, I also tasted a bit of sweetness and was thinking whether they put sugar in the soup base. Interestingly, they used onion to act as sweetener. This is perfect for all the health conscious individuals.

While you think Sichuan food is all about spiciness, their menu contradicts the traditional belief. Their restaurants offer 8 different flavours and half of them are non-spicy! 

For the non-spicy option I chose the special cod fillets with ketchup soup base. The fish is extremely soft and smooth, it literally flows into my stomach effortlessly. Again, they have laid the fish on top of the sides and left the fish with its natural flavor. Their ketchup soup base is very tasty and the sides have fully absorbed the tomato flavor leaving me a remarkable memory.

For the curry lamb, the meat is very fresh and soft. They present it with a bit of rawness so you can adjust how well you want to cook your lamb. The idea of having a bit of rawness on the lamb is ingenious. There will be fire underneath the container so you have full control on how well you want to cook your lamb. For my dishes, they added broccoli to the curry, and this unique combo is extraordinarily. I wouldn't think of this combo if I haven't tried it myself. 

I am actually not a big fan for fish due to their fishy smell and taste. Today I made an exception for Sichuan Kungfu, and they have definitely opened an option for my future diet. The way they place fire underneath the dish (to keep the food hot) have taken away the fishy taste for being left cold. 

For those anti-fish eaters, I highly suggest you give Sichuan Kungfu a try as you will not regret coming here. 

For all fish lovers whom are seeking for high quality fish, they will definitely satisfy your desires."}
{"text":"Lunch Special is always the way to Go?!

A set for 2 people from $16.99 is quite a bargain to try out Sichuan Kungfu Fish. And I am impressed and will be coming back.

Lunch Set #2 with Alaska Cod Filet in Peppercorn Spice ($19.99) includes 2 order of rice, Sichuan Kimchi App, 2 can of pops and Cabbage Topping. 

We really enjoyed the broth: not too spicy but with enough kick. Funny thing was that we enjoyed all the additional toppings (Wide Vermicelli + Lotus Roots) more than the fish itself. The cod filet is just as thin and mushy as the basa. I will probably stay with the basa and just order extra toppings!

Service is surprisingly friendly. They even moved us to a bigger table without us requesting! 

Pro Tip: post a photo on WeChat for a free ice cream

I do like the option of hot pot for 1 as I can enjoy my spicy broth even I coming with my non spicy eating friend.

But for now, I still want my friend to come with me during lunch to share this lunch set for 2!"}
{"text":"Came with friends for dinner and all of us agree that the crawfish is a Must try! This is a very small restaurant so if you have a large party I'd highly recommend that you make a reservation. Only criticism is that although the plate looks big, the actual portion is quite small. The fish doesn't come with any side ingredients (e.g. mushrooms, vegetables, etc.) and you have to order them separately. Considering that you have to pay between $1.99 to $3.99 for the sides, we were expecting a full plate. In reality you only get very little...like we got 6 slices of the lotus roots... Felt a little ripped off. All in all, it was a decent experience."}
{"text":"Basically, everything is great. I loved eating sichuan baked fish in China so I was super thrilled to see a restaurant serving it here in Canada for the first time.

Food 5/5
Just like China. Flavors are rich and powerful. I love spicy food, especially when its ACTUALLY as spicy as advertised. The food here doesn't disappoint. (They also have non-spicy options.)

Service 5/5
The service is terrific. I don't usually expect much service at Chinese restaurants in the west but this place definitely sets the bar high. One of the girls that works here (full time I assume since she's always here when I come to eat) is super nice and accommodating.

Cleanliness 5/5
No complaints.

They also take WeChat pay and Alipay."}
