{"text":"Truly one of the best places to get butter chicken in the city. really nice staff too. one of them took me into the kitchen to show me how the naan bread was made which was pretty neet. Dishes are big enough for 2 people to get full on aaaaaaaaand what else can I say to meet the Yelp word quota... oh there I go. looks like I got it. Eat butter chicken here."}
{"text":"Very good Indian food for the price. Good bitter chicken.naan and chick pea curry. Very good prices as well. New location opened this year at the queen and broadview area."}
{"text":"Quite a fan of this place, they always have fresh servings of their dishes and replenish them often, so it's not like you'll go there and get hours-old meat or veggie dishes. They make fresh naan themselves, it's a small kitchen but very well organized and efficient. The service is great, the front person is very polite, amicable and collected. I don't eat at a lot of Indian places in town, so I can't compare very much, but I'd say that I'd still like more choice on the menu. What they have are the standard Indian dishes you'd see everywhere, ie; Butter chicken, saag paneer, chana, dal, chicken tikka, samosas, pakora... It'd be nice to have a greater variety of meats and veggie dishes/combos (Like recipes from other regions of india perhaps). They have snacks which I haven't tried yet, so maybe that's where I might find the specialty.   I think they're starting out, so hopefully they can make some good business and progress from here. After that, whether you prefer their dishes or another place's same dishes is only a matter of preference and, well, taste. I like butter chicken no matter who makes it, their's taste much sweeter than I usually have, and I think the saag paneer has great paneer, but the saag could benefit from more spices. Otherwise, I recommend their wraps, since they're made with their fresh naan, but be careful because it could get messy to eat!"}
{"text":"This review is limited to the fish wrap at this place. I've tried it twice. I've also had the shis kebab, to me that was standard.  But the fish wrap was AMAZING!  They fried the fish to order, perfectly cooked (moist, tender and flakey) and the seasoning fit perfectly - it wasn't overly drenched in a different flavour, you could really taste and appreciate the fish.  I live in the area and this is going to be a frequent take out stop for me for sure."}
{"text":"Walked by this little joint few times and decided to give it a try tonight. I am surprisingly pleased with the cleanliness of the place. Food is decent and l particularly like their freshly made Naan. Wish they do delivery as well. This is my new found \"go to\" take out place!"}
{"text":"Nothing special about there meat special. 2 small pieces of meat in each portion. The rest is just sauce and too much rice. The rice to meat ratio is well off. It's not worth $5 let alone the $10 I was charged."}
{"text":"Live in the area and go here all the time. It is a fast food take out spot...very delicious, generous portions and always friendly service.    I highly recommend it...can't beat their $10 combos!"}
{"text":"The food was amazing. showed up at 9pm on a Tuesday night and expected to see some slim pickings BUT everything looked so fresh. It even tasted delicious and the portions are very generous. Would definitely have again and go to as one of my regulars. Price is on point! Also the staff was very friendly and told us we would back"}
{"text":"You just buying some meat juice with2 small Piece of beef or chicken on a rice this is one of the cheapest place on portion i ever seen except rice portion and left over veggie complementaries have your self a nice ripping"}
{"text":"Don't order Lamb biryani, literally they just mix rice and lamb curry, that's not the way biryani made. and literally very small portion and little piece of lamb 4-5 piece tiny piece. and the price are too much for $13 bucks plus tax???? ($15) really this place is rip off, first and last I'm comin here. NOT GOOOODDDD!!!!!!!! I'M NOT COMING BACK!!"}
{"text":"Ordered the chicken tikka and it was sooo sweet almost tasted like a desert dish. The vindaloo even though same price was much smaller then the tikka masala, that too was a bit sweet. I think both dishes had the same gravy and they added chilli powder to the vindaloo and sugar to the tikka masala. I will not be going to this place again. I also think they add food colouring to make it look appetizing."}
{"text":"Ordered the baingan bharta (eggplant) dish. It tasted good but don't think there was any eggplant at all. It was a creamy tomato curry with peas, onions and peppers but didn't see or taste any eggplant. I only opened the container when I got home so it was too late to return but the dish name was written on the container so don't think it was a misunderstanding. Plus for the quantity, it's slightly overpriced."}
{"text":"Amazing indian place. I just finished a meeting and was starving and was looking for some restaurants on this street. I decided to venture into this small restaurant and oh my lord is it ever tasty. Very delicious and gd pricing"}
{"text":"This sweet spot is in Riverside not Riverdale! Made my fourth visit here tonight for take out and I can conclude this joint has it going on. The portion size and quality are totally decent. For $10 I get two meats and two veggies, rice, and lovely naan. The dishes are tasty and fresh and the meat is good quality. I am so glad Siddartha moved into my hood!"}
{"text":"Amazingly fresh and tasty. Really nice people. Lots of options and a very reasonably priced, large, combo plate with fresh baked naan.   Love it and go here often. You must try if in the area."}
{"text":"Went back. Ordered the same fish curry. Noticed it was a different guy cooking but didn't think think anything of it. Well, it was nothing like the first time. It was like night and day. Average at best this time."}
