{"text":"In Pittsburg for work, searched \"wine bar\" and this was #1 so I decided to try it. Cute place! I went on a Sunday night, not their most popular time, but very relaxed atmosphere. I sat at the bar and the bartender was attentive without being pushy, answered all my questions. She recommended tonite bisque to combat the cold weather; I hate tomatoes, but I loved the bisque! Calamari to start was under done. Cool interior, great food options, I'd recommend for smaller parties."}
{"text":"I am definitely a fan of Sienna in Market Square.  My husband and I went here for the 4th time yesterday.  We arrived around 6:30 and were happy to find they had open tables outside.    We ordered the stracciatella on a recommendation from a friend.  The cheese was fresh and gooey and delicious with the fresh, toasted bread.  We were similarly not disappointed by the arugula salad.  We were eating light, so we both got flatbreads, which we enjoyed: the meatball and ricotta and the arugula and prosciutto.  In the past we've had the shortribs, sea bass and a seafood risotto special and have enjoyed it all (with the exception of one misstep: my husband ordered the quail once and found it tasty, but too small for an entree).   The atmosphere is relaxed, the service is always good and the food is always delicious.  We will definitely come back!"}
{"text":"Stopped in here for lunch and found the food to be okay.  The bar and eenvironment are nice and the staff seemed ample.  Something just didn't seem right throughout the meal .  Sorry I cannot give it a raving review."}
{"text":"If I could give zero stars I would.  Came in for lunch today while downtown for the arts festival. Myself and my friend both got an order of the stuffed meatballs.  I took one bite and felt mush in my mouth, they were completely raw inside.  My friend cut one of hers open and also raw.  When I told our server she said they are served medium rare, who serves a veal and pork ground meatball medium rare? No apology took them backed to be cooked more.  Well the cooks cut all the meatballs open to finish cooking them defeating the purpose of having cheese stuffed inside since it then all cooked out.  When they were brought back to our table by the manager he just said \"here\" and put them on the table.  Will never be back!"}
{"text":"I have been here twice, and I liked what I got so much the first time that I ordered it again!   Their tomato bisque is so yummy and you can't go wrong with a glass of Chianti!"}
{"text":"This is sort of Italian restaurant. We arrived and were seated at a very wobbly table that our waiter promised to fix but never did. The area was so dark it was hard to read the menu without using my phone light-the table next to us also used phone light. Our waiter was very prompt and explained the menu. We wanted to split a salad but he said they were small so each ordered-they were very large and drenched in dressing. Both our main courses were less than mediocre- the tomato sauce had too much cinnamon and the fish was very bland. Maybe other dishes are better but we won't be back."}
{"text":"The food was fantastic! The meatball, the fish, and the dessert all exceeded expectations! We were very pleased with our waiter's knowledge regarding wine and food pairings. Most certainly need a reservation, but we very much look forward to coming back. It was a true food experience!"}
{"text":"One of my very favorite places in the 'burgh-- everything I've ever ordered there (been there 4 times in past few months) has been succulent and delicious. Surprisingly un-ordinary real Italian food, not a place for boring Americanized pasta dishes. (Their octopus and beef osso bucco are to die for.) The only tricky thing is their menu frequently changes, which is great, but some of the things I've loved there aren't always there every time. They should keep the beef osso bucco on every day. :)  Very friendly bar/server staff, relaxed atmosphere."}
{"text":"FANTASTIC!  My best friend was planning to take me there before we went to a show, instead we took a couple friends of ours and made a party of it! A little pricey but WELL WORTH IT! I had the gnocchi and it was incredibly filling, the portions were reasonably sized. I also ordered a meatball (everything is a-la-carte) which was easily the greatest meatball I have ever eaten and ever will eat haha. It was made with multiple types of meat and stuffed with cheese with a tomato sauce, cheese and garnish on top. Service was good also, she was a little slow about getting our check but we were also in a hurry to get to the show. I will be coming back for sure."}
{"text":"Sat at a table outside on a warm autumn evening; it was delightful. The pasta dish I ordered had chunks of butternut squash and was delicious. The chocolate dessert was also wonderful. I was with two other people who ordered different dishes and we were all happy with out choices. The only minor complaint was that it's too bad that Market Square isn't closed to cars, because that would make sitting outside even nicer (every once in a while one would drive by with a booming stereo on), but of course the restaurant can't do anything about that."}
{"text":"I stopped in for a late lunch after walking the square and other areas of downtown Pitt. The meal was excellent.  Form the Sienna chopped salad to the stuffed meatball pasta. All fresh and house made. Amanda was an excellent server! I will be back if I make it back to this burg."}
{"text":"The service was alright, the food was mediocre, and the wine was awful. Make sure you ask them to let you sample it, because my friend and I just went ahead with the Pinot Grigio and it tasted very sour and stale. I ordered the risotto and felt slightly disappointed with it, but I'm a huge fan of risotto so I might have developed certain expectations (such as the right amount of salt so that it isn't overbearing) and it's possible that other people might not notice or care about these certain details. I love a lot of the restaurants in market square; this one however left me wanting more."}
{"text":"Gnocchi was not good. It was too oily and there was barely any gnocchi on the plate - there was more mushrooms and bacon than gnocchi. Especially for the price it was not good at all! The flatbread was okay - I would rate it 3 stars. Service was good, though. Also, they did not have butter for bread. I didn't know a restaurant could not have butter."}
{"text":"My second visit and I'm so glad i came back. First of all, they serve my favorite wine, Nero d'Avola. I can vouch for the Greens and Beans appetizer - it has escarole, white beans, sausage and a marvelous Chianti gravy. The parmesan-stuffed meatballs oozing deliciousness, and the buccatini (tube-shaped spaghetti) were perfectly al dente. Homemade gnocchi were flavorful little pillows accompanied with wild boar (!), zucchini, beans and bacon in a tomato sauce. I will definitely be back to try some of the other items."}
{"text":"Caesar Salad way too fishy. Lunch special way too pricey for the amount of food. It was ok tasting."}
{"text":"I had another tasty meal last night. I did deduct a star this time since our server was not the best and the plating of our entrees was sloppy.   I ordered the Octopus again. I could not resist. It was just as delicious, juicy, and sweet as it was last time. Yum. My husband ordered the veal meatballs. I never would have ordered the meatballs. I'm not a big meatball fan. Nonetheless, I am NOW. Loved the veal meatballs, gooey cheese, pignoli nuts served with a bright, fragrant, fresh, and sassy tomato sauce. Double yum. I was tempted to order meatballs to go.  Sadly, my sweet corn lobster risotto was not on the menu. In its place is lobster risotto made with zucchini. I like the menu evolving with fresh seasonal ingredients although disappointed that their website menu states they still have the sweet corn risotto which is why my disappointment lingered.   I was also disappointed to see cheese thrown on my plate and hanging off the side. Really? Is the expeditor sick today? Nevertheless, the dish tasted great. Another perfect al dente risotto coupled with grilled tomatoes and cubed zucchini. Everything tasted delicious but I will confess I am unsure the zucchini did anything for the dish. The sweet corn on the previous preparation added an undeniable sweet profile- the zucchini..not so much. Nevertheless, I practically licked my plate clean as I love the remaining flavors.  My husband had the papperdelle bolognese. Another dish served with food seeping down the side of the plates. Aesthetics aside- Wow! Another delicious and flavorful dish. I loved this. The noodles were fresh and soft bathed in a rich and complex tasting bolognese. Every ingredient was present and required. Lovely dish I would recommend highly.   Lastly- the chef's tasting menu. I asked our waiter what today's tasting was and he said whatever the chef decides. Yes, I get that hence the name. But what has chef decided today? Still fumbling by the waiter. Hmm. Not sure if this is the impression that the restaurant is seeking to make but I never do blind tastings. The only chef's tastings I have seen and partaking in were able to tell me before ordering what I would be receiving today.  It's a shame they lost out on making more money from me and who knows how many others if they would just explain it daily."}
{"text":"Wonderful atmosphere and great service. First time at Market  Square and this was a great restaurant to experience the the evening. I had the duck with blueberries and it was great ! Would definitely return!"}
{"text":"Love the lunch atmosphere. Bread was crisp, and the deli meat fresh on the lunch special. Was talking about the pasta salad for a week after...you have to try it! Perfect portion for a mid-day meal. Wait staff attentive and knowledgeable. A favorite within walking distance from my office. Get there earlier than noon."}
{"text":"Meatballs were not a let down at all. Our meal was really exceptional. The flavor was rich, the ambiance was perfect, and the service was great. The location was central for experiencing downtown Pittsburgh.   Overall great experience."}
{"text":"Pittsburgh has recently become a point of call for me, and one of the first things I do when entering a new area is consult with the Yelp universe.  Once again I've been the beneficiary of our community's generous input, as Sienna is an exceptional find.  Fantastic Italian inspired food, affable associates, and a contemporary decor will keep me coming back.  Had the Osso Bucco the first time around, and had to force myself to stop eating well after I was full.  Tonight I'm having the Chicken Picatta, and it's a delectable treat. Kudos Sienna...you have yourself a fan!"}
{"text":"Here with 5 friends recently.  The food was fabulous-- can't say enough about the lobster risotto which was so full of lobster flavor it was amazing.  The calimari was perfect-- crunchy and crisp and not at all greasy.  The desserts--we shared 3 different ones--were wonderful. Our waiter was knowledgeable and friendly. Overall a super meal."}
{"text":"Exactly what we were looking for.  Large, tasty portions. Nikki provided exceptional service. And, very reasonable with the pricing.   My family and I really enjoyed ourselves."}
{"text":"Excellent experience.  Wonderful food.  The outside seating was great.  Perfect weather and there was music in the square.  This is not a restaurant for children.  But they were very kind and my little ones enjoyed the experience.  The bolognese had adult flavors but was hearty enough to get 2 thumbs up from the pre-schooler.  Sausage rissotto was quite good.  The grilled calamari was delicious.  The fish special was just excellent.  My foodie friend from out of town was well pleased!    Staff and Chef were absolutely superior in attention to detail and knowledge about nut allergies.  We will definitely be back!!"}
{"text":"This is my first-ever review on Yelp! I went to Sienna Sulla Piazza last night for the first time and loooved it! We had made a reservation and were seated immediately. Our waiter was very nice - it did take a little bit for our order to be taken (we had waited about 15 min. after initially being greeted, where we then asked another server to get ours for us). That was the only \"downside\" to the evening. After our server came to us, he apologized for the wait and was super attentive the remainder of the evening. My date ordered a flatbread and I ordered the tomato bisque and the sienna chopped salad. The portions were perfect and the pricing was definitely reasonable. We kept saying over dinner how good everything was and how nice everyone (the hostess, servers, etc.) was to us. We will be back there for sure!! :)"}
{"text":"Nice atmosphere, great location, and yes, very romantic! The food did not deliver! I asked for heirloom tomatoes  and got colorful grape tomatoes. The arugula salad was small and didn't have much dressing, the bolognese pasta was sweet with carrot flavor and didn't taste gourmet...and the other dish that I had was the escargot...ok, but not great! I would not recommend this place! I'm a foodie!"}
{"text":"The service here was amazing. The server or runner were always coming over to ensure that we were well taken care of. We started off the meal with the meat and cheese plate which was delicious. My husband ordered the ceased salad and the bucatini pasta with meatball and I ordered the risotto. The food was delicious and the wait staff was very knowledgeable on what was on the menu."}
{"text":"Pluses are a nice area of outdoor seating facing  Market Square.  The Caesar salad was tasty and light:  recommend skipping the prosciutto and anchovies.  The four cheese flatbread is thin crust and oven fired.  It tasted fairly bland and had too much ricotta.    The unfortunate thing that disappointed me about this experience was the excruciating slow service after I was seated:  thus, a three star rating."}
{"text":"Really enjoyed this place during a recent business trip. The pastas are delicious and different, the wine selection is very good, and the service is friendly. Highly recommend it."}
{"text":"Stopped in for a drink and a snack with my husband at thr bar. The mule was gingery and good. We got the orzo mac and cheese and also the mushroom bruschetta. Both good. However with the bruschetta could use some more mushrooms. Felt it was a little skimpy. Overall a decent place for a bite and drink. Only suggestion I'd have is to have the bartenders speed up the pace a little. For not being busy taking 4+ minutes to make a cocktail is a little excessive. Would return!"}
{"text":"Awful. Terrible staff very rude. Food was meeeeh ok I guess but over priced for mediocrity. Never again"}
{"text":"First visit for us on a Saturday night.  We thought the ambiance was appealing/cozy - brick walls, warm lighting, mixed woods.    Nice wine offerings and our server seemed to be knowledgeable about them.  We both had classic caesar salads, which were fine.  I ordered the quatro formaggio flat bread and my husband ordered bucatini with mozzarella-stuffed veal meatballs.  Both dishes looked great, but turned out to be woefully overcooked.  The flat bread crust was as hard as a boxed pretzel and it lacked overall flavor (aside from too much salt)  as well as any basil as listed on the menu.  My husband's dish arrive unnecessarily steaming, which may explain why the marinara had a brownish tone, yet tasted old.  He said the meatballs were just okay, not great.  Maybe it was an off night.  The bill was reasonable, so maybe we'll give it another shot some day."}
{"text":"Went on a Wed. evening and of 4 items, the 4 of us would only re-try the beans and greens appetizer. Didn't enjoy struggling to see food because of poor lighting design for our table in between the bar and patio opening."}
{"text":"My aunt and uncle came into town and from Atlanta and they heard from locals they should try Sienna for dinner. I live on the south side and had never heard of it so I was excited to go there.   My boyfriend and I met them there and the atmosphere was very cool. We had reservations and were seated straight away. The server was very attentive the whole night and he suggested delicious drinks! I had an agave tequila cocktail and it was so uniquely delicious! We ordered a few appetizers, four main courses and two deserts. All of them were delicious and they came out at what seemed like perfect timing. My favorite of all that I tried was the pork chop. It was juicy and perfectly cooked.   I would reccomend this place for anyone- from a romantic night with your significant other to a relaxed night with family! The prices are higher because the restaurant is more upscale, but I will definitely be back for a special night!"}
{"text":"I had high hopes for a wonderful evening at Sienna Sulla Piazza but those expectations were dashed on the rocks by uninspired food, fair to poor service and  a sound system that blared inappropriate music for an upscale restaurant.  I had read a lot of good reviews of Sienna which had my mouth watering.  Unfortunately I had a below average experience.  The restaurant itself is small, with tables both indoors and outside.  We had made a reservation for a table inside and were unfortunately seated under one of the many speakers from the restaurants sound system.  The ceilings were quite high but the loud rock music which rang out from their system was very annoying and made it difficult to have a normal conversation with my dinner companion.  I don't mind loud music but I prefer to experience it at a club or concert where I have paid, knowing that my ears will be ringing by the time I leave.  In my opinion, Pink Floyd and The Doors are totally inappropriate music for what I was expecting in a fine dining atmosphere.  (By the way, I love those bands, just not when I'm shelling out $$$$ for dinner)  I asked the waiter if he could have them turn down the music but was told, (for some reason) that the spotify system that it was playing from, could not be adjusted.  Okay, I was a waiter for ten years and know all the tricks of the trade and I know when I'm getting a load of BS .  The menu is small and although it has definite variety as far as Italian specialties, (pizza to pasta to an octopus salad), it felt as if the chef was handicapping himself with such limited variations under those themes  The wine, cocktail and wine by the bottle listings are also small but with good character and moderate pricing for a downtown Pittsburgh restaurant.  My dinner companion went for a glass of wine (11$) house salad and one of the homemade pasta specialties, which was suppossed to  have a variety of seafood.  I chose the octopus salad app and the short rib entree.  The house salad was uninspired with lots of iceberg lettuce, mixed with a few field greens and tomatoes, all chopped up to a pulp and drenched with some type of bland dressing.(7$)  The octopus salad was served warn with white beans, a red pepper puree and some arugula (11$)  a good size portion, with a hint of spice and actually, very good flavor, despite the over infusion of mustard seeds.  The seafood pasta entree, which was served, tossed in a lobster cream sauce was dull, with nondescript flavoring and not a lot of seafood.  I will say that the homemade pasta was quite good but for the price, there wasn't much of it (24$)  Important to note that chef Matt Porco must have gotten a good deal on a ton of shishito peppers (found mostly in east asian cooking) because too many of the dishes on the current menu feature them.  The braised short rib(also 24$) had my mouth watering and even though my ear drums were being assaulted with blue oyster cult and leonard skinnard, I was ready to dig in.  Once again, portion size for the beef rib was small. It lay in a large cloud of mashed potatoes which were in need of salt and pepper and flavor.  Around the potato was a ring of pickled jardiniere (cooked vegetables, sometimes pickled)  The meat itself was dry and there was no sauce whatsoever to help with flavor.  The pickled garnish was over empowered with vinegar that its pungent aroma overwhelmed the meek flavoring of the rest of the dish.  Desert menu is skimpy with only three deserts, one of which incorporated balsamic vinegar into it's pastry cream.  The menu also features flat breads which we did not have but looked interesting.  However I always say that if i want  good pizza, I will just order it from my favorite pizza shop in my neighborhood, where I know won't be disappointed.  I think it's safe to say that mediocrity reins supreme at Sienna Sulla,"}
{"text":"Brilliant ambience! The layout of the restaurant allows for either a quiet meal or socializing with a group, since there are 2 distinct sections. Servings are quite large. Well crafted meals, good wine selection too."}
{"text":"Visiting in town and ended up in Market Square for dinner. Decided on trying Sienna.  Good food, but I had to ask for a server to take our drink order. By that time, we had also placed our order. Once again, the food took way to long to be served. Service staff was cordial,but distracted. Had to ask for our check as well. Probably would not recommend."}
{"text":"I love this little place right in Market Square. I had the eggplant pram which was a whopping portion if delish. Friendly service and a feast little patio made for a lovely, if very filling, lunch"}
{"text":"Sienna had always been a favorite stop for their remarkable stracciatella,  however they now serve what seems to be dry string cheese with purred carrots and tomato jam and burnt toast.   Total disappointment.   Secondly, their pasta dishes left much to be desired.   I ordered the mushroom agnolotti which was anything but traditional agnolotti and it was undercooked and dry as can be.   Also, the portion size was laughable for $19.00.  Our waitress was wonderful and we didn't mention how disappointed we were with the food and just figured it wasn't worth it as it would be our last time at the restaurant.   Shame that such a lovely restaurant took such a dive into a lack luster establishment."}
{"text":"Great place to have a cozy and rich meal. Great wine selection and delicious food. Service is excellent."}
{"text":"Decided to come here on a Saturday night, we had reservations but on this particular evening it didn't appear that they would've been needed. I wish that I would have asked to be seated at a \"regular\" table but there was a large group of folks dining in the front of the place so we were seated at a \"high top\" table close to the bar area. The \"high top\" was certainly high and it wasn't the most comfortable place to have dinner. Moving on we tried a bunch of items and really went all out and were very satisfied with our choices.  The Rabbit Rillette was on the menu and a rillette is something that I can almost never pass up. It was rich and flavorful and the serving size was quite substantial for the price. We then tried a caprese flat bread which was very fresh tasting and a nice change of pace after the Rillette. I then had the Chianit Braised short rib entree, this meat was cooked almost beyond perfection if that is possible. The flavor was so savory and the meat was so incredibly tender I felt almost as if I had ordered a roast. I'm not sure if it wa a normal butchered short rib as the meat was actually boneless and that surprised me a bit nevertheless what's good is good, Right?  The service was nothing short of perfect, the server was very friendly and knew what he was talking about when it came to the menu items. I would certainly come back here again but would hope to sit at a more comfortable table if I have made a reservation in advance."}
{"text":"Great addition to Market Square, but typical Italian food. We had a great time and the drinks came quick, but the food came a little slow. We waited for 35 minutes between salad and entree. Not horrible, but we were four guys and hungry. The salad was the best part of my meal. I had the Sienna Chopped. The short ribs off the bone... Not that special. You would also think a Mac&Cheese Risotto would be awesome, but it was not. Good pricing and a nice venue, but maybe do a progressive night in Market Square, starting with salad or apps at Sienna and then dinner somewhere else."}
{"text":"Went on a Sunday evening - busy, but must have been busier Saturday since they told us they ran out of mussels Saturday. Had the flat bread appetizer instead and it was excellent - nice texture and flavor. Calamari also very good. Bolognese entree was delicious - portion was more than enough. Service was okay - long wait after we were given menus and between courses."}
{"text":"What a great way to spend a lazy Sunday evening.  Very nice selection of wine, friendly & helpful staff and a chef that takes traditional Italian dishes and puts just a little spin on then.  The Arugula salad was a very nice starter.  Light with a blend of tartness and sweet (from the strawberries).  I then had the meatballs from the appetizer menu for my main coarse.  They were described as the best and did not disappoint.  I would recommend Sienna on the Square"}
{"text":"The food is decent and a good place for lunch, but their reservation snobbery earns them 2 stars.  Twice I have gone to eat there when numerous tables remain open and am told no tables available.  The tables were still open 45 minutes later.  That recently happened with 8 empty tables.  After eating at a neighboring spot, I counted 9 empty tables.  Seems like an odd way to run a business."}
{"text":"Food - 5 stars Hostess - 1 star.  Awful.  The food at Sienna is fantastic (the only reason why I have been back more than once).  I live in NYC and am pretty picky about my Italian restaurants.  I'm currently in Pittsburgh on a long term work assignment- staying downtown, and therefore I eat dinner out every night alone.    I have gone to Sienna both for dinner and lunch.  The meal both times has been fantastic BUT the hostess (same one both times) was rude, condescending, and inappropriate.  I hope management reads this and has a talk with her.  I understand that I am one person and would NEVER take up a big table on a busy night at a restaurant.  I'm happy sitting at the bar.  That being said-- on a Monday night in an empty restaurant, I expect to be welcomed kindly.  No looking me up and down, and quesitoning \"on, ONE person? Dining ALONE? Well... I guess we have space for you at the bar.\"  No kidding, in the empty restaurant- thanks.  Then I went there again at lunch (WANTING to eat at the bar) when it was early and there were tons of tables open and the bar was full and again-- the look, the grimace.  It is a SHAME that a restaurant with such fantastic food (meatballs, octopus appetizer, flatbread, and wine selection are AMAZING) chooses to put such an ugly face forward.  I would love to have Sienna on my weekly restaurant rotation but instead am opting for Meat & Potatoes (MUCH busier but still recognize me with a warm welcome) and Penn Avenue Fish Company (same thing-- busy but welcoming)."}
{"text":"Good location and interesting menu but service was weird with waiter who changed his fake French accent everytime he came out. Food was ok not stellar but still a good lunch spot. Hostess attitude about reservations vs walk-ins was ridiculous given the low traffic in the door lol"}
{"text":"Located near NOLA and the Nicholas Coffee Co, Sienna is small enough to miss if you aren't careful.  I had the Antipasto Flatbread and tomato bisque for a quick lunch on a brisk November afternoon.  The flatbread was flavorful, spicy, bordering on overdone, but tasty.  The cheese and ingredients had separated from the bread, and given that it wasn't fully cut was sort of a pain in the butt to eat. The tomato bisque was good, served lightning hot(even when taken back to my desk), and definitely did the trick of warming me up.  While I think execution was slightly off on the flatbread, I definitely see promise in the overall menu and the freshness of the ingredients, like the herbs on top of the flatbread. The flavor was definitely there.  If you're sharp, you'll notice that they chose the English spelling of Siena over the Italian.  I was lucky enough to be there years ago, visiting the Piazza del Campo and the famous Siena Cathedral, amongst other sites."}
{"text":"Wow, I am surprised by some of the reviews.  We just got into town, went walking around without yelping.  Went to market square and walked around.  Tuesday night about 6:30.  We wanted some vino, saw people outside Sienna drinking vino, said let's try it....  Ordered glasses of wine at happy hour prices--$6 each!!! from CA, that is a bargain.  Looked around, liked the vibe, liked the bartender, said what the hey?  Ordered three things--the mussels, the roasted beets, and a flatbread pizza.  They were ALL wonderful.    My fav was the mussels--oh my gosh.  The sauce...make sure and get bread to sop up.  Yeah, don't be a Miss Manners--sop up the sauce....  The beets were different.   But I liked them.  They were surrounded by ricotta and went well with bread.  The flatbread was good, had an entire arugula salad on top.  And the service was great.  We sat at the bar, the bartender was great--sorry, didn't catch your name!--and gave us great tips for things to do.  My first impression of Pittsburgh is very good....."}
{"text":"Just stopped in here for a late lunch/early dinner.   The place is on the small size but that didn't matter to me as it was pretty empty for lunch.   As an appetizer, I had the sausage and bean soup. While it was just a tad more salty than I would have liked, the taste was amazing. The sausage and white beans combined to make this a hearty soup on a cold day here in Pittsburgh.   For my main meal I had the Bucatini, which comes with two mozzarella stuffed meatballs. This did was even more amazing. The pasta was cooked perfectly and it certainly tasted home made. The meatballs were out of this world!  They also tasted home made, but I'm not sure if they are. And the sauce that surrounded everything was absolutely delicious.   Overall, a fabulous experience and I would definitely come back here again."}
{"text":"This is a great place in a very nice location! We had the wrapped Atlantic salmon and it tasted great, but expect the eggplant to be slightly undercooked, and hence, crunchy. So if you're like me and prefer soft well done eggplant make sure you mention it to the waiter! The staff is very nice and friendly and the service was great."}
{"text":"If you want Italian food in market square go to Pizzaiolo Primo (formerly il Pizzaiolo) because this restaurant will not impress you. My family and I went to dinner here on a Saturday night. First sign of a bad restaurant is that it has many vacant tables. The next sign is when they're out of everything you actually like on the menu. If those two signs aren't enough, a haughty waitstaff and a chef who is unable to accommodate a vegan should really send you packing. The already underwhelming and limited menu was not friendly to anyone with allergies or dietary restrictions and the fact that a \"chef\" couldn't come up with anything vegan was beyond us. Even though the chef had vegetables and pasta, he refused to put the two together to make a dish. In my opinion he wasn't actually a chef but perhaps a cook told only to make menu items. The waitress was rude, the manager never came to speak with us, so we paid for our overpriced drinks and left. The funny thing is I wouldn't have bothered to review this place but they \"canceled\" my OpenTable reservation so I wouldn't write a review on that platform. Now I'll make sure to write my review everywhere else."}
{"text":"I love this restaurant. For certain one of my favorites in PGH particularly for a date night. Enjoyed a late date night meal with a reservation @ 8:45pm, which was as early as possible to lock down early on the morning of the same Friday. They are a must here I would say. Our server was a cool dude, and suggested we try a really awesome Zinfandel by the glass, which I think were maybe $8 per. This visit split the Octopus Antipasti which was a star, and the Meatball and Ricotta flatbread which may be the best of the two or three others that I've tried on different visits. The meatball on this one is far supreme to any pepperoni I have ever had on a slice of za'."}
{"text":"The food was delicious.  The braised rabbit was a fun meal to try.  I definitely recommend it.  If you are looking for a good Italian restaurant in downtown Pittsburgh this is the place to go!  The only thing that was a little weird was you could see where the staff stood when they weren't busy."}
{"text":"Went here yesterday.  Attentive service, drinks were great, nice bar scene.  The greens and beans are excellent.  I also had the meatball and Ricotta flatbread, superb.  The meatballs are awesome, make sure you try a few.    I will be back."}
{"text":"Ordered duck, not bad, except a little salty; very good/romantic Italian environment, only that I'm alone here for work"}
{"text":"We had terrific service from the time we made our reservation (Vanessa) right through our meal (Kim). The house-made linguini was excellent (with pancetta and peas). Also a perfect Striped Bass. Great experience."}
{"text":"The food here was ok but not to the level expected at this price point.   The service was fair a bit snobby.   What really put me over the edge was they absolutely refused to bring butter to the table for the bread. I'm the customer!  No alterations would be made to the entree-- there are some vegetables that I don't like and again at that price they should be able to accommodate a customer request."}
{"text":"We live downtown and this is our favorite local restaurant, our go-to. The food is consistently very good, and although the hosts could be warmer to people when they walk in, the bartenders are GREAT (Amanda, Derek). The rest of the wait staff is good as well. The decor put me off when I first visited---it's kind of ugly and cliched---but the lighting makes up for it and creates a cozy ambiance. Overall, a very comfortable place.  Pretty much everything I've eaten there has been excellent, with just the occasional \"miss.\"  Last year, they offered an unusual rendition of chicken piccata, served on a ragu of chickpeas, that was incredibly good and sent me there more frequently than I visit now.  I keep hoping they'll bring it back.  Overall, a winner in the square."}
{"text":"I was in Pittsburgh for work and my coworker chose this place out of the blue. We were not disappointed!  The food was nothing short of amazing and the service was incredible.  We had the gnocchi and the bolognese as well as the veal and mozzarella stuffed meatballs. Dammit! So incredible!  So if you're downtown and you want excellent Italian, Sienna On the Square is the right place. A full meal with drinks for 2 people was less than $100 before tip."}
{"text":"I had arrived at sienna on the square early for my reservation, so I waited at the bar for the rest of my party. The bartenders were great and allowed me to taste one of the wines before I decided on which I wanted.   After my party arrived, we were seated and the attentive waiter took our orders, but he would not allow us to substitute anything. I do not like gorgonzola cheese. I think it is disgusting and tastes bad, so I asked the waiter if he could substitute a different cheese like feta on the salad I was going to order. He told me the chef does not allow any type of substitutions to anything and that I could have it without cheese. Well this was unacceptable to me because there wasn't much else on the salad to begin with, so I opted to not purchase it. I also asked well what if someone is allergic to an ingredient, would you not substitute something in that scenario and he said the chef wouldn't. So, I personally thought the chef was a bit full of herself and lost her establishment money because I ended up not ordering a salad. The rest of my meal was fine, it didn't compare to what I had while I was in Italy, but then again I didn't expect it to.   I think this is a great place for wine and plan on going back for happy hour only. No food."}
{"text":"Love it for lunch!  This is by far my favorite lunchtime spot.  Their flatbreads are great.  The arugula and prosciutto flatbread is like a pizza and salad in one.  Anything with the meatballs is tasty. I haven't ever had anything here I didn't like.  The service is usually efficient, but never knocks my socks off.  The ambiance would be great for a romantic dinner."}
{"text":"Came here for dinner with the hubby's boss and this place is the perfect restaurant to take someone from out of town to, especially when you don't know what they like to eat. Can't go wrong with Italian, right? The space is intimate and warm, yet modern and trendy. Sitting outside in market square adds even more of the downtown Pittsburgh experience.   I don't have Italian food often, but when I do, I really appreciate a homemade pasta, which Sienna on the Square has. As an appetizer, we shared the Mozzarella Stuffed Meatballs, which were very moist and flavorful. I ordered the Linguini Carbonara as my entree, while the hubby got the Mafalde Bolognese, and the boss got the Pan Seared Chicken. My carbonara was delicious, but I found the sauce to be very strong on the black pepper, which I personally enjoyed, but I would imagine others might find it to be too much. I can't speak too much on the other dishes but our waitress told us the recipe for the Bolognese sauce here is much like the recipe for Emporio's (in case you've tried it at Emporio); the only difference is Emporio's only has pork while Sienna on the Square's has veal, pork, and beef. Good to know!  Even though the food was rather enjoyable, I found the food menu to be quite limited. The drink menu, on the other hand, used up quite a few pages to list all the options. However, it's still a nice place to enjoy dinner outside in the heart of downtown."}
{"text":"Perfect environment for a date night! Staff was very knowledgable and helpful when selecting dishes. Indoor/outdoor dining was a huge plus! Also, it wouldn't hurt to call ahead for reservations."}
{"text":"AMAZING! The food is delicious and the servers are great. If you love italian food this place is a must try, both lunch and dinner menus are amazing and they switch them up with the season. We visit often and they already recognize us. One day we went in and it was packed but they still squeezed us in since we are regulars, that meant a lot."}
{"text":"Great location and atmosphere. Friendly staff, quick service. High quality ingredients in the sandwiches and pasta salad at lunch. Competitive prices for the square. Would have loved to stay longer! Definitely try it on your lunch break if you're in the business district."}
{"text":"We love all their restaurants: This one, Sienna Mercato, Emporio and Il Tetto. Have never been to Mezzo, but heard it's amazing too.   Met a friend here for lunch today. Had been here before for lunch and dinner and you always get amazing service not only from your server, but also the hostess and other people who work there. They treat you like family and not only care about your experience but you as a person.  As I walked over for work, Skylar was very friendly and did a nice job of keeping her company, which was very sweet. Our waiter was great too, but unfortunately I can't remember his name. Most restaurants don't put enough emphasis on service, but to me it makes or breaks an experience.   I had the homemade bucatini (pasta) and meatballs stuffed with mozzarella. Both were very good. The meatballs were the best. The mozzarella was oooey gooey, which is exactly what you want. The pasta was ok, but I felt like there wasn't enough of it. For $16, I want more than a few fork twists of pasta. I'm sure they're trying to make the meatball the star, but I think they should have given me more pasta.   My friend had an Old Fashioned, which she loved. However, $13.50 was a little extreme for a small glass. She really enjoyed her arugula salad and it looked delicious. She also had the tuna sandwich, which she said was delicious. I'd definitely want to try it the next time.   Definitely go check it out. The service alone is worth it plus as an added bonus, they have great food."}
{"text":"A group of 6 of us went in at 6:00 on a Saturday evening without reservations. They had one table available which was reserved in 90 minutes so we had to be out by then. We agreed and I'm glad we did. Joanne, our server, was amazing. She explained everything very well and steered us in the right direction. Everything was excellent and the portions were a good size for the price. Definitely recommend to everyone."}
{"text":"Their flatbread appetizers were my favorite part of the meal. The prosciutto and arugula one was my favorite. For the rest of the meal I tried their restaurant week offering (Salad, Pasta, and Dessert).  The salad was simple and fresh, but not memorable. The pasta was well made, in a very traditional execution. I guess I was hoping for something a little more unique and with a little flair (like their flatbread). For desert I chose the zeppoli. Sadly they were somewhat small, so they lacked the moist inside I expect from a zeppoli.   This was a Yelp get together, so of course we discussed the meal. Out of seven diners the consensus around the table seemed to be that the meal would best be rated a 3.25, but until Yelp lets us do fractions of a star, it'll have to be a 3."}
{"text":"Awesome food and great cocktails are paired with friendly and professional service. Constantly good place to eat."}
{"text":"Had the most wonderful and romantic dinner here my first time in Pittsburgh. My boyfriend and I came to town to apartment hunt as we recently relocated to the area, the waitress was nice and tons of suggestions of things to do and places to see around town. She had extensive knowledge of the wine list and the food menu and offered up great suggestions for combos. The food was amazing and very seasonal. If you are looking for a good date night this is a fantastic spot."}
{"text":"Came in on a busy Wednesday night, sat at the bar. The bar is nice with comfortable seats . I also like the atmosphere here, with dim lighting and well docorated interior. I ordered a Miller light with a glass. This is the type of establishment where the bar tender pours it into the glass for you, which is nice. To eat I ordered the muscles. They were good, they were covered an orange creamy reduction with them that tasted like it had tomatoes in it. It also came with toast that was made on a grill giving it a nice flavor. Service was very friendly throughout my visit. I would come again."}
{"text":"Overpriced, just okay pasta.  I ordered the Mafalde Bolognese and I was quite disappointed... not only was the portion size smaller than the average, but it also just tasted like carbs. Of course, pasta is carbs, but good pasta has well-crafted noodles with a texture that doesn't feel like I'm just munching of boiled pieces of dough. The pasta sauce wasn't outstanding either.   On the bright note, my friend ordered the flatbread, which looked good.  The only redeeming factor for me was that Sienna has a nice, upscale ambience. But, I think that there are better options in Pittsburgh.  --  taste / 3 aesthetics / 3 vibe / 4 service / 3 price for quality / 2 OVERALL / 3"}
{"text":"After reading the reviews, my mom and I made a reservation for before a show and had no problem getting in for a before show dinner. The waitress was very nice and offered us suggestions from the menu. I decided on the Bucatini with the Mozerella Stuffed meatballs and the entire dish was to DIE for. I did not have a problem with the portion sizes - in fact, I had leftovers! The tomato sauce was perfectly chunky and not at all from a can/jar and my taste buds were just in heaven. I would highly recommend this restaurant for any special occasion. It is a little pricey, but well worth it."}
{"text":"Hands down one of the best Italian Restaurants in my hometown of Pittsburgh.  The restaurant is small and quaint. The atmosphere reminded my of a NYC restaurant. Staff is wonderful. Bartender made my wife a great dirty martini. I ate the Bolognese dish with an added meatball stuffed with cheese and my wife had the gnocchi. All pastas are homemade. Dessert topped off the night perfectly."}
{"text":"Nice place for casual business lunch. Well organized service and reasonably priced.  However, the drinks and food are just ok. Some of the spaces in the restaurant, particularly the rest rooms,  are rather beat up and need refurbishment. Staff were efficient and very readily available."}
{"text":"Never ventured here for dinner, but I've used Sienna Sulla several times for business lunches.  The fact that its a smaller venue, takes reservations, and has a simple menu for quick choices makes this a great joint to have a conversation at (barring the around average noise levels for a lunch rush establishment).  The chicken parm sandwich is great, but definitely a stomach bomb (it'll require coffee afterwards to not need rolled into work afterwards) and the flatbreads a decent as well.  Judging by other's reviews, I wouldn't mind checking out their dinner service, but I doubt I'll get to that soon."}
{"text":"This is probably one of my favorite places in town. Have been here many times and never had anything I didn't like. My favorites are the meatballs and flatbread. It's nice that there is valet parking after 6. You really have to plan ahead if you want reservations for weekends. Service is good and prices are reasonable."}
{"text":"It was a warm sunny early April day & we enjoyed sitting in the outdoor space. The mushroom pizza was the delicious. Try it if you like mushrooms!"}
{"text":"I am giving this restaurant 4 starts based on a salad alone. Crazy, right? Well, the chopped salad was delicious. The cucumbers, tomatoes, and onions are marinated, and then tossed into the chopped romaine. The gorgonzola adds a nice bite that complements the red wine viniagrette. Because I shared a flatbread with a friend, I didn't order meat on my sald, and to be honest, I think the salad stands alone. It really was that good. I am very picky about salads, and when I find a restaurant with delicious salads, the place quickly becomes a staple for me.  I shared a prosciutto/arugula flatbread with a friend, and I enjoyed the crispy crunch of the crust. The prosciutto didn't stay in place very well, so my hands got a little messy, but it was very good nonetheless.  It was a bit dark inside the restaurant at lunchtime, and I almost forgot that the sun was shining outside. But, the decor is tasteful, and though it is smaller side, I think the restaurant's size adds to the intimate, quiet feel of the place.  I was able to get a quick reservation for lunch, and I look forward to trying Sienna for dinner. There were quite a few items on the menu that I would like to try next time."}
{"text":"I saw squid ink linguine on the menu, and I knew I had to try it. It was an unctuous, hearty pasta dish, that was probably the best pasta I've ever had. Served with mussels and spicy sausage in a savory lemon/white wine sauce, the squid ink tasted nothing like I thought it would. It wasn't fishy tasting at all! It was salty, but not too much. It was a full-bodied flavor that was just too amazing for words! Highly recommend!"}
{"text":"My wife and I ate dinner here prior to a show at Heinz Hall for the Pittsburgh symphony. The food was spectacular and the service was very great. Our waitress, Amanda was very nice and accommodating. I highly recommend a reservation as this restaurant is not very big, but it has a great ambiance. The food was great. We split the goat cheese flare bread which was very good and flavorful. I had the bolognese and my wife had the bucatini with stuffed meatballs. He bolognese was really good with a very unique spice. I recommend the panna cotta for desert as well."}
{"text":"The last time I ordered a flatbread outside of Papa John's was nineteen ninety never.  It's not usually my thing. I was feeling fiesty tonight, so I decided to \"start\" with a Caprese flatbread.  When it arrived, it was clear this bread would be my starter and finisher. It was BIG.  I believe the juicy grape tomatoes were marinated in some sort of balsamic perfection incarnate.  Shreds of basil complemented this flat piece of masterpiece and I'm still full just thinking about it. Jonathan D. ordered the Beef Ravioli + a mozzarella-stuffed meatball.  Both two thumbs up.  The only thumbs done portion of the evening was the bread selection.  Straight outta Shur Save I suspect; and a warm loaf of Breadworks would be just the ticket to a five-star review IMO.  BUT, extra points given that Mario Lemieux was seated at the table next to us. Truth. It was incredible.  So, Sienna - thanks for that!"}
{"text":"The chef of Sienna Sulla Piazza has not once but twice sent my taste buds on an Italian vacation. On my first visit the entire restaurant was reserved for lunch including three seats at the bar.  Impressive me thinks yes.  Sienna Sulla Piazza is a small 14 seater restaurant but obviously it's beloved by many for it to be booked solid for lunch!  From the first sip of my prosecco I knew that I was in good hands. The chef even brought the food out to me himself. The greens and beans were so flavorful and cooked with stewed fresh tomatoes and were served with grilled bread. I also ordered a Ceasar salad. To my surprise the anchovies in the salad where actually fresh not canned! After realizing this I knew things were done way differently at Sienna Sulla Piazza. Even though I was stuffed to the gills I just had to taste a dessert.  I got the raspberry tiramisu. It was so good I felt, gluttonously naughty eating it.  On my second visit I had the Mediterranean olives and gilled octopus.  The octopus was topped with roasted red peppers and oh so tender. Sienna is apparently chef owned, which the bartender explained makes a world of difference in how the food is prepared.    Bonus the bartenders are super friendly!"}
{"text":"Decided to stop here for lunch while walking around Market Square. It's not the biggest restaurant you'll find around here, but it's certainly the coziest. It looks like a former street level garage, with all brick walls/floors and low ceiling, which was wisely converted into the upscale, Italian spot. I liked the vibe and feel of it almost immediately.  After looking over the various menu options, I decided on the Homemade Sausage sandwich with a side of pasta salad. Sometimes this can be a risky order in some places, not knowing the consistency or spiciness of the meat. Neither was an issue as the sausage was tender, not fatty, and seasoned perfectly, not too bland or too hot. I just wished there was more of it or a smaller accompanying bun. The pasta salad was also good compliment side dish, pretty standard.  The bartender was somewhat apathetic, maybe battling a case of The Mondays, but this was a pretty solid place otherwise."}
{"text":"Marvelous food and excellent service.  Sienna is mostly a small plates restaurant with delicious Italian cuisine.  We shared a Beans & Greens appetizer that came with a Chianti reduction sauce that was delicious.  I had the homemade Gnocchi, which I am generally picky about, but these were fabulous.  My date had the Chicken Picatta, which was prepared with crimini mushroom, fried red skin potato, caper, lemon, and parsley.  Excellent.  Also, I got a mozzarella stuffed meatball that was very tasty.  Lovely outdoor dining that spills out into historic Market Square, I am recommending this restaurant very highly."}
{"text":"So I've absolutely been dying to try this place. And I will definitely give it an A+ for service. However, I wasn't SO thrilled with the food....  It was good, don't get me wrong - it's not that I was...unhappy with my meal...but I wasn't so happy with it either. It could have, however, been the dish that I chose. I ordered a special that the waitress so kindly told us about...it was some sort of fish (and shame on me for not remembering the name of it), which sounded SO appealing -  served over a bed of sweet potato and fennel hash...but the fish itself was a bit too...fishy. It was a white, meaty fish, and the hash that it was served over was delicious...but ultimately the fishiness just, wasn't appealing. My arugula salad was awesome though - mixed with fennel and a light vinaigrette - such a tasty starter -  I never thought to put fennel in my salads and will definitely be making that for myself. The roasted red pepper spread that was served with the bread at the table was also great.  Though ultimately a little bummed with my main course, the service was excellent and the atmosphere was relaxing. Exposed brick walls always seduce me, and the friendly attentive staff was refreshing.   I sat at the bar for my first glass of wine - made it just in time for happy hour the bartender informed me, 5-7 on weekdays - half off wine - always a selling point for me :-)  I wouldn't be opposed to going back and giving this joint another shot."}
{"text":"I love this restaurant!  I eat here at least once a week for lunch and the food is always excellent.  They have the best salad and I am addicted to it (the chopped salad in case you are wondering).  I also love the flatbreads.  The service is quick and the atmosphere is lovely.  It is wonderful on a nice day, with the front open of the restaurant opening onto Market Square.  It is best to make a reservation on opentable if you can because it does get a big crowd between 12-1.  I have also gone for drinks after work, they have nice wines and drinks and it is a very pleasant place to relax."}
{"text":"Stumbled upon this little gem on yelp when my mother and I flew into Pittsburgh to see family and wanted a bite to eat before heading out to the burbs...anyway, I can't say enough good things. Service was friendly, decor was tasteful and warm, and the food was delicious! We were so happy that we decided to take a chance on this place. I hope it continues to do well:)"}
{"text":"Very nice ambiance. It's especially nice in the summer when the garage doors are opened into market square. I had the gnocchi which was a very small portion. My friend had the 4 cheese flatbread which was very good."}
{"text":"This is a really strong 4 out of 5 more, not quite 5 but essential a 4.5.  For appetizer I had the Chicken Liver Mousse.  Im a big chopped liver fan and this was fantastic.  They give you these large texas toast like pieces of tuscan bread and a large servings of their chicken liver mousse which is finished with honey and pistachios.  It was such a nice light texture, not grainy or chunky in the slightest.  Great unusual start to the meal.     For an entree I had the chinati braised short rib.  This was a venture to me because i never had tried short rib but am a big Osso Buco fan so i figured it was worth a try with the waiters recommendation.  He was so right, extremely tender, pot roast like taste but chianti braising was phenomonal.  Portion size was a little small and I felt the orzo mac and cheese had a very light taste that didnt do much for the dish.  The short rib itself was something I would come back for alone.  Very nice atmosphere and beautiful restaurant to dine in during the summer as the entire seating area benefits from their garage style lifted entrance. Will definitely be back."}
{"text":"Fantastic - I had been traveling for the last 2 weeks and went out for my first  night alone just to catch up on emails. Not only was the food great, but the bartender was fantastic.  One of the better prepared Old Fashions I have had in a while.  Also, no fan fair about preparation, Madeline, just did it great.   She also recommended the Lemon Spaghetti, which was fantastic.  Great find and will be back on my next trip to Pittsburgh."}
{"text":"I absolutely love this place. The ambiance, food and service are all on point! This is a great place to go on date night. The bar tenders are the best. Highly recommend to get a drink before meal!"}
{"text":"The hubby and I went here before the opera on a Friday night after not being able to get into Nola and we were really happy that we did.  I started out with a glass of reisling which was definitely on the sweet side.  Since I love sweet wine, I was in heaven.  WE then ordered two apps - the mushroom bruschetta and the crab cake.  We order crab cakes almost everywhere we go, so there is a lot of comparisons that happen.  This one lone crab cake was definitely not high on the list of the best - it was too small, not that fantastic of a flavor.  However, it was served with an awesome lemon and basil sauce that complimented it well.  The mushroom brushetta had fresh tomatoes, a pile of arugula and interesting mushrooms covering the grilled bread.  It was amazing!  A great combination of flavors and the grilled bread really added to the flavor.    For the main course, I had the butternut squash ravioli and a veal meatball.  J had the pork chop.  When my plates came, the meatball was about the size of my head and was covered in marinara.  All of it was delicious.  The meatball was perfectly cooked, had just the right amount of mozzarella inside and the tomato sauce was sweet, but not too sweet.  The butternut squash was interesting.  I think that for such a delicate flavor, you need a thin, not strongly flavored  dough.  Unfortunately, this one was very al dente and too thick.  Also, there wasn't really enough butternut squash in the ravioli for my taste.  What I did taste was fantastic, but there wasn't really enough filling.  The sauce was a thin sauce, not really sure what it was, but it was really good with the ravioli.  It was topped with tomatoes and braised short ribs that were awesome.  J's pork chop was moist and flavorful.  It was served on a bed of pulled pork.  It was interesting and different and he loved it.  Sadly, we didn't have enough time for dessert.  But we will definitely be back."}
{"text":"I can truly say with out a doubt that I've NEVER had a bad experience at Sienna. Last week on Valentine's Day was the best.   It was my fifth experience at Sienna fourth for dinner. We were greeted with smiles from hostess and manager, Mike. Seated immediately and greeted again by, Matthew.   First, I'd like to thank Chef Porco for hiring such an attentive, knowledgeable staff. Particularly, Matthew. His attention to detail of the menu was very impressive (and we love the French accent!). Our first order was an Italian Montepulciano for $40.  We decided on three courses...the anchovy crostini and the mussels arrabiata. Both very flavorful and yummy. I almost forgot about the homemade bread with white bean spread flavored with truffle and olive oil. Yummy!  The mesculan salad may seem simple but the kalamata olives, whipped goat cheese and red pepper vinaigrette just made it a much greater experience for the taste buds.  It was difficult to choose the last course. I'm a big fan of their meatballs and I knew I couldn't resist. So the Bucatini with their signature mozzarella stuff meatballs (size of baseballs) won! My sweetheart ordered my second choice, the Lamb Osso Buco...a large delectable portion of meat with mashed potatoes and carrots. As decent and fair minded Americans, we, of course, shared plates (thanks sweetie!). All courses were delicious and unique. The lamb tender, falling off bone. The meatballs melt in your mouth. We did not leave with a doggie bag.  Kudos to Sienna for your efforts to ensure that the service, food, and atmosphere is unique, fun, and delicious. I hope more restaurants can use you as a benchmark, particularly with service and knowledge of food and wine."}
{"text":"Was looking for a place that had a tasting menu and found this place. The atmosphere was nice. We sat at a little table to the bar.  Wasn't the most comfortable seating but the staff was friendly and the food was really good. We had a salad plate that had 2 different types one with beets which I loved because I LOVE beats and the other had fresh mozzarella which was good as well. The risotto we had was also very good. The texture saw perfect. We also had a pork dish that was cook to perfection. The drinks were ok. Honestly none of the drinks were stand outs. This place would have gotten 5 stars if not for the uncomfortable seats and small table. I would definitely go hear again but would ask for a different seat."}
{"text":"The likes: the service was good, the chicken parm was decent, and the prices were reasonable. Nothing too memorable though. It was easy to get a seat at the bar at lunchtime. Portions were just right!  The dislikes: it's very dim even in the middle of the day... It made me feel like it was 7pm at noon. The pasta salad was sour and the bread of my sandwich was bland."}
{"text":"Sienna is perfection from top to bottom. They're veal meat balls are to die for I had the mushroom gnocchi. The pasta was light and the dish really highlighted all the mushrooms without being overbearing. The pork tenderloin was cooked perfectly. I thought it would be a bit much since it was wrapped it bacon, but too my surprise it was not too greasy or salty.  Don't miss out on the chocolate tiramisu for dessert. The service is continually above par from the hostess to the management. This restaurant is perfect for a group of friends, colleagues, or a special date."}
{"text":"Made a reservation here for an anniversary dinner on Saturday night. The staff was very friendly and attentive. Ordered the crab risotto and the quattro formaggi pizza. The crab risotto was AMAZING and the pizza was cooked to perfection. It was very quick too!"}
{"text":"The clams appetizer was good even if they were small.  As for the MAFALDE BOLOGNESE, the pasta was probably undercooked but the sauce was tasty.  I initially thought the pasta was supposed to be harder than most pastas so I did not ask server to take the dish back.  Kitchen might need quality control.  Service was friendly."}
{"text":"Kim was amazing.  Her recommendations were spot on.  The manager was friendly.  He interacted with the guests and wait staff.  This was a birthday dinner and we were well taken care of.   Enjoyed our first time here.   Will do it again!  Thanks yelp for the tip n"}
{"text":"The food is fantastic, but the service is not.  Had a salad and pasta with meatballs and it was all very delicious.  The service was terrible. The AC was dripping water on us at our table and the host refused to move us to a new table and expected us to just get water dripped on our heads and food all night. We insisted that we move to our server and eventually were moved to a large family style table with another family that we did not know...awkward.   Our server also semi-neglected us because she was trying to give speedy service to another table who had to catch a show at 7:30. Well, we were going to the same show and her focus on them and lack of attention to us made us late for the show.   Sienna needs to step up their customer service. They want to be an upscale restaurant, but they're providing diner-style service."}
{"text":"All I can say is OUTSTANDING! Great food, drink, service and even the piped in music was great. FRESH FRESH FRESH."}
{"text":"Dinner last night with friends at Sienna was enjoyable, but not memorable. The restaurant is warm, dark, and cosy. We were very happy with the service. The downside was the food, which was ok, but mundane. The pastas, which all four ordered, were bland. The menu is largely the same as the original menu when the restaurant opened. Sienna is still an attractive restaurant but needs to be updated to regain the destination status it used to enjoy."}
{"text":"Had an excellent birthday dinner there yesterday.  Had the bucatini with mozzarella stuffed meatballs - awesome!  Our server, Elena, was one of the best we have had in a long time. She is a rarity these days.  Will definitely be back as well as recommend to family and friends."}
{"text":"One of the best cocktails (Dulce De Leche) and dessert (Rustic Tuscan Apple Cake) I have had. Definitely on my top three list  Also had the chef's meat and cheese tray as an appetizer.   Bartender was friendly and knowledgable.when my friend ordered a \"coffee with a surprise\". The bartender made an amazing drink up on the fly."}
{"text":"Was a perfect experience. Atmosphere is fantastic; service was impeccable; food was delicious...and of course great wine! 3 of us started with the Pear & Bleu Cheese flatbread.  We moved onto soup and salad and each was delicious. FYI, the Caesar is a true Caesar with anchovies in the dressing... One person had the scallops, one had the spaghetti, one had eggplant ravioli. Each plate was clean at the end...always a good sign! Want a good drink?  Get the harvest punch. Dangerously delicious."}
{"text":"Great atmosphere but not so great food. My husband and I were down in Market Square for dinner and figured we give Sienna a try. We sat outside with our 2 dogs and they were very accommodating. The waitress was great, she even brought over a bowl of water for our dogs.  We started with the bread salad appetizer which was the best dish we had that night. Quite different than a normal house salad. It was very good.  For our entrees we split the mushroom flatbread and the mushroom ravioli. Both dishes were ok. Nothing bad however just felt they were both missing something. Can't quite put my finger on it but I've had better.  A couple complaints would be; the menu is pretty small and their vegetarian selection is even smaller, their food portions are very small as well, and their prices are high much too high for the quality and amount of food you get. Our bill came to almost $50 and all we ordered was 1 appetizer, 1 flatbread & 1 vegetarian pasta (no drinks, no alcohol). That's much to pricey for the food we got. I don't mind paying higher prices for food but I expect high quality and to maybe even leave the restaurant with some left overs.  I wouldn't worry about checking out Sienna, there's other Italian pizza/pasta restaurants around Pittsburgh that are much better."}
{"text":"This makes my third time at Sienna on the square. I seemingly tend to stick with the appetizers. I decided to treat myself to a drink tonight and I was also craving calamari. It was a total win-win situation. The calamari was cooked to perfection, super tender, and lightly breaded. The sauce was a delectable smokey red sauce. The portion was small, but packed a lot of taste! I also ordered the cocktail of the day which was an Old Fashioned and equally good. Wasn't watered down like typical happy hour specials. I really need to give dinner a try there. I'm sure I won't be disappointed!!"}
{"text":"i am a food critic of critics and i have not one negative thing to write about except that i am stuffed.  The red skinned potatoes are perfection, the goat cheese salad perfection. bread and red pepper hummus dip superb.  Nikki was a perfect waitress, tending to my every need  The 4 drinks i had were handcrafted and marvelous and I am very very picky about drinks.  The ginger beer drink was perfectly presented in a copper mug. They infuse their own syrups or ginger beer.  The lemon drop rosemary martini was next to my favorite.  The cucumber lavender was as drinkable as kool aid  the exotic tequila and carrot drink was very nice and pretty  FLatbreads are very crispy and will not dissapoint.  I hope they keep up the good work. This is about the only 5 star I ever gave a pittsburgh establishment. I cant wait to go back  This is serious eating. NO weekend chefs working here. THis is fine dining. Portions are high quality and small so dont be expecting huge piles of garbage like other places serve  you get what you pay for!!!    OH, the chocolate lava cake was bar none."}
{"text":"I don't get it.   This place gets write-ups and great reviews, and I cannot for the life of me see why.  The food is mediocre.  Some of the combinations on the menu look innovative, but in practice, there is a lot of stuff on the plate that doesn't really add to the flavor of the dishes.  My agnolotti didn't need 7 kinds of vegetables accompanying it when they were all mushy and flavorless.    The service is worse.  Our waiter was astoundingly condescending and unfriendly, explaining what tapas are and what bolognese sauce is - I guess we look like we think our idea of great Italian food is Pizza Hut -  and slow...it took on average 15 minutes to get each drink, not because the bar was busy but because he was standing at the end of it BS'ing.  The price of the meal was not in line with the amount or quality of the food we received.    In sum, this place is thriving in a downtown area with otherwise great restaurants, when it is on the level of a pretty good place in a far suburb.    For exceptional Italian food, walk 150 feet across Market Square and go to Il Pizzaiolo."}
{"text":"Awful. Service poor. Beef short ribs tasted sour. Risotto very salty. Many better places ti eat. Avoid"}
{"text":"An unexpected treat. Small and intimate restaurant in the middle of market square. Make reservations if you don't want to sit at the bar...but it is worth the wait. Meatballs were fabulous and the the butternut squash ravioli was savory and delicious. We will definitely return next time we're in Pittsburgh."}
{"text":"Amazing. This was the best meal I have had in Pittsburgh. I had the rabbit confit gnocchi and it blew my mind. Every bite was heaven on earth. Save some bread to mop up the sauce. Hubby had the Chianti braised beef and it was so tender and incredible... fell apart on his fork. Superb. Excellent. Marvelous.  Very hip, intimate, sexy. Will be back!"}
{"text":"The food was mediocre at best. Nothing impressive and was even more disappointing because it was a very pricey meal. We got the goat cheese flat bread which was okay, wasn't exactly what I expected but was fine. The brussel sprouts were good. However the main courses were disappointing. I got the hanger steak, specifically requested medium but got a medium rare steak. A friend with us was vegetarian and got the gnocchi without the sausage. However when we tasted the gnocchi it tasted like nothing and the other pieces of her dish tasted flavorless. My husband got the chicken which was okay. Overall not worth it for the price and wouldn't return. I believe these reviews are inflated by people reviewing it for their happy hour. But definitely wouldn't recommend it for the food."}
{"text":"Stopped in here while in town and since I didn't have a reservation, I had to sit at the bar. It's a cute little restaurant in Market Square with both indoor and outdoor seating. It was restaurant week in Pittsburgh, so I went with the $20 3-course meal which included a choice of salad, entree, and a dessert. The arugula salad was good with roasted peppers and fresh shavings of parmesan cheese in it. The Rigatoni & Shrimp pasta was in a basil pesto creme sauce and was OK, but I wished it had a few more shrimps other than three of them. I went with the tirimisu and was quite disappointed. First off, it was served in a glass cup, which I've never seen before and it had a distinct citrusy taste to it. I love tirimisu so I've had a lot of them over the years, and this was by far my least favorite.   Service was just OK and a bit slow for my liking. Portion sizes tend to be on the smaller size here, but I'm OK with that as I don't want all the calories. Between the 3-courses, I left full. The price was good for what I got, but this was a reduced price for restaurant week, so had this been any other week and I paid normal prices (around $26 for what I had), I would say the place is a little over-priced."}
{"text":"Dear Sienna Sulla Piazza, you are delicious. Thank you for making my mouth water.  Okay so maybe that's not quite how this review is gonna go but its pretty damn close. Anyway, I've been to Sienna twice already for lunch and I can say both experiences have been great. My server/bartender the first time was amazing. I can't remember what her name was but all the suggestions she gave were spot on. Plus, she let me try some fun wines that she thought I might like. That visit I had their meatball and ricotta flatbread, greens and beans, and their cheese plate. Id highly recommend their Greens & Bean. It's not a large portion but what you get is extremely delicious. Their meatball & ricotta flatbread pizza wasn't half bad either. Not my favorite but definitely worth a try if you want to get a little craaaazy pizza wise.  My second visit I went with Tessa M. We decided to sit at the bar for lunch and snack on yet again for me but for Tessa her first time the meat plate (i can't help it if I like meat and cheese), the two fist sized meatball stuffed with a little sliver of cheese (i wish there was more), and both the pulled pork BBQ sandwich and tuna melt. Personally I don't like tuna and I don't think I ever will so I wasn't a fan of said melt. But the pulled pork on the other hand was delicious full of flavour and a bit of tang. Tessa might say the reverse but I can't help what I like.   We could've opted for dessert but alas we're tiny women so we can only stuff our faces so much. At the end of the day it was definitely a satisfying visit. I'm looking forward to trying more scrumptious bites here!"}
{"text":"There's some great things about Sienna: (1) Great location, nestled right next to Nola in the heart of the square (2) Heavy Pours! (I'll be back for a happy hour in the not too distant future) (3) Atmosphere.  One thing I wished it had, but didn't find, was food so good it would keep me coming back!  We started with the tomato bisque and the sausage, potato, and kale soup- for me this was the highlight of the meal.  The tomato bisque had just the right balance of acid and cream, and was served with a grilled crostini.  The sausage and kale soup was also very tasty and full of their homemade sausage, which we later ordered as a side- it was so good!  We thought this was a lead up to some phenomenal mains, but we were a little disappointed.  We tried the beef ravioli, which unfortunately had a creamy tomato sauce very similar to the bisque, and the prosciutto and arugula flatbread.  I LOVE prosciutto and arugula, but in my opinion it's best served simple with a little bit of olive oil, a couple of shaves of spicy parmesan, and cracked black pepper.  The flatbread had a tomato and melted mozzarella base.  Together, with the prosciutto and parmesan, this was just too salty for me.  The service is top notch and the bartender was incredibly attentive (try the lost at sea, you won't regret it!);  these 2 factors certainly contributed to their \"Best New Restaurant of Pittsburgh 2013\" title.  Overall and all things considered, I will be back to try more from the menu- this place has too much going for it for me not to give it another shot! Hopefully you'll see this review upgraded in a month or two!"}
{"text":"What a wonderful little restaurant!  The food, ambiance and service was excellent. I can't wait until I can visit Pittsburgh AND eat at Sienna again.  And I think I could eat the roasted beet appetizer and the flatbread with sausage every day and never tire of them."}
{"text":"So I called to make reservations for lunch at Bella Serra in Market Square and discovered upon my arrival that they were now Sienna.  The good news:  great location, some nice outside seating, and a fairly small indoor area that has a nice, rustic Italian feel.  The bad news: service was a little slow during lunch and it took forever for someone to take our order.  Also, I ordered the margherita flat bread.  It was piled high with finely chopped basil, which I love, but the edges of the crust were way overcooked and impossible to cut through let alone bite through while the center of the flat bread was way too soggy.   They seemed to use canned or at least marinated tomatoes.  As a result, there was a ton of sauce/liquid, which made the bread so soggy in the middle.  I think they would have been way better off with thinly sliced fresh tomatoes.    Having said this, I'd like to go back and try something else off the menu to see if that is any better.  The styling on the plates of the other guests looked appealing and it looked like a good wine list.  I'm thinking I may just have ordered the wrong thing."}
{"text":"Arrived with a group of 12. They were able to seat us at two tables next to each other. The waiter made the night fun. He was funny, joked along with the group and knew the menu inside and out. That insured that we all left full and happy. Fresh pasta dishes were the bulk of the choices. Calamari app was super good.  Was a fun atmosphere."}
{"text":"Delicious, unique modern Italian food!! Friendly staff, great service. Been here several times for special occasions and a few times for happy hour- never ever a disappointment. Great food that you can't get elsewhere, mozzarella stuffed meatballs from heaven, and stracciatella I seriously dream about. I've ordered a different pasta dish every time (from menu items to specials) and never been disappointed! Good people who even comped a round of celebratory drinks for us during our last anniversary dinner. It's a great spot in market square well worth checking out!!"}
{"text":"Had a great meal here on a crowded Saturday night. Service and the food were very good. Try the meatballs stuffed with mozzarella. Probably the best meatball I have ever had!"}
{"text":"My husband took me on a date to this restaurant. The meatballs that we ordered for the appetizer were \"very good\" in my husband's words. We both enjoyed his gnocchi with rabbit. I ordered the special of cod, which ended up being too mild in taste. For dessert the cannoli could have used yummier chocolate chip and lemon filling. The zeppole tasted dry and could have used more chocolate on top. Our waiter was nice. Our dishes came out at a good speed, but we had to wait a little while for our bill to arrive."}
{"text":"This place was really good! I ordered the mushroom anglotelli, tomato soup and the chopped salad. The mushroom pasta had a great flavor, and I love mushrooms but the amount on top was a little excessive. The tomato soup was rich and creamy, but so heavy -'definitely couldn't finish it. The salad was good except I do not like cucumbers and unfortunately the cucumbers, tomatoes and onions are a package deal. Very good meal and great service!"}
{"text":"Last night was my first visit to S.o.t.S.  We ordered the appetizer special (grilled ricotta) and the meatballs and they were both fresh-tasting and delicious.  For our main course our table ordered the gnocchi and the torchio, which were also both wonderful. The sauce on the gnocchi was a little salty but that is my only complaint, if you can even call it a complaint. The torchio was my favorite dish of the evening and I can't wait to go back and order it again.  The cocktails were well-crafted and the wine list was extensive. Our server, Kim was very knowledgeable of the menu, including the wine.  Overall great experience. 5-star food without the stuffy atmosphere."}
{"text":"Sienna on the Square, formerly Sienna Sulla, is one of the most underrated restaurants in Pittsburgh. You wont find it on any of the \"Best Restaurant\" lists, At least not any that I've seen. However, it continuously turns out some of the best food you can find in the Burgh. The prices are very reasonable, the ambiance is on point, and the service has always been impeccable. I think the lack of respect from local Bloggers and food critics probably stems from the fact that this place is in the touristy Market Square, but take it from me, this is not just another tourist trap disappointment."}
{"text":"The restaurant has a great environment, and the food is great. However, the service is terrible. Wait staff is terribly unfriendly."}
{"text":"Food here is exceptional, service is solid. I had the chilled corn soup, which was superb. Interior ambiance is low lighting, brick walls. Eggplant parm I had for lunch was the best I'ver ever had. I returned the next night and had the risotto.  Price is fair considering the quality of the food. I would recommend this place without hesitation."}
{"text":"The food was great, atmo was awesome and the staff was super nice but... I'm not much of a meat eater and there weren't many options for me.  All the pasta had some form or pork or red meat and most all the vegetarian dishes were really carbie.   It's a great spot but not vegetarian or gluten free friendly"}
{"text":"I never had a bad experience at Sienna On The Square. Everything on their ever-changing menu is fantastic and I'm obsessed with the dim lighting and HUGE meatballs. I think Sienna is underestimated because of Sienna Mercato but I will always support the original!"}
{"text":"I have only been here once so far. I can still taste the braised beef in red wine pasta I had. It was so delicious and had so many layers of flavor. The pasta was homemade and reminded me of the homemade pasta I used to make with my family. The only thing that I didn't like about my experience is that there was Disney music playing!! Who heck plays popular Disney songs in a very nice Italian restaurant?!"}
{"text":"Terrible service. Server acted like infant when asked if he could ask the kitchen for alternative dish. Do not ask the chef to deviate from menu. Will cause server to have meltdown. Never been to so called fine italian where you could not change pasta. Manager not much better. Server had no idea about wine list. Complete idiot. Would not recommend when visiting pittsburgh."}
{"text":"This is one of my wife and I favorite restaurants in town.  Food is consistently good.   Service is attentive.  Some staples on menu, but changes regularly.  Food never disappoints!   Generally have cheese/meat board or tartar.  Pasta is always good.  Love their meatballs.  Get the Brussels sprouts when on menu.  Deserts can be hit or miss, but generally good as well.  Reasonably priced for quality."}
{"text":"One word - WOW!!! This place was a great find! Perfect day and wonderful atmosphere! Food was perfect and service was exceptional. I had the Chicken Parm Sandwich and my family had the pizza (sausage). All were amazing. The beer and wine were great too! Eat here!"}
{"text":"I'm assuming my experience here was atypical, but my lunch was terrible. I walk in at 11:15, there are no other customers. I say \"one for lunch,\" the hostess says \"all I can do right now is a table outside.\" I really don't understand why I was forced to sit outside at a wobbly table on a slanted sidewalk when there were literally no other customers. I order the eggplant parm, then sit at my table outside in the chilly air for 25 minutes. As I'm about to leave, the waiter brings my eggplant parm, which is gigantic, but overcooked, greasy, and tough. How do you make eggplant tough? I complained, the waiter got the manager, he asked me if there was something wrong with my chicken parm. I said it was eggplant, I waited for it for a long time, it's tough and chewy, he apologized profusely and asked if he could package anything up for me, but I was really turned off at that point and just left. Walking back I thought that maybe it had been overcooked chicken parm, and that's why it was so tough; I called the restaurant and asked the manager, and he said no, it was eggplant, but I really can't help but think they served chicken to someone who ordered a vegetarian dish.  Maybe I just got a poorly-cooked plate. But please don't make me sit outside when there are plenty of tables. It felt like shame seating for people eating alone. And if food is taking long (25 minutes for lunch?), some acknowledgment or reassurance would be nice."}
{"text":"Wow. Yep. Amazing! I order the Caesar salad, it was very good. Very tangy, different than anything I've had before. I also order the Siena sandwich with the pasta salad. It was so good! My husband ordered the sausage and ricotta flat bread, I didn't try it but he said it was so good! I would definitely come back! Delish!"}
{"text":"I had a great experience both times I ate here (once for lunch and once for dinner).   Their pastas are phenomenal and cooked perfectly. The salads are delicious. My friend loved her chicken parmesan. Very affordable for a nice lunch, and they take reservations.   I was shocked by how good the house red (collefrisio) was. Will definitely go back and recommend to friends!"}
{"text":"Went here for my girlfriends birthday on a blistering cold day in Jan.  Unlike some other restaurants, where it might be cold inside when it's 7 outside, it was nice and cozy.  Very good service from a very short server (sorry I forget her name).    So onto the food, we decided to order one thing from each section of the menu and share.    First course-Greens & Beans- I loved, gf did not.  I think she was expecting more of southern style, even though she is Italian.    Second course- Mesculin salad- all the flavors went very well together, the pear & goat cheese, and red onion vin.  Third course-Braised Rabbit Pasta, absolutely the star of the night, I could eat this everyday.  Last course- Prosciutto wrapped Salmon.  Salmon was done correctly, but I don't believe there was any prosciutto wrapped around the salmon.  I could not see or taste it.  Also, I really didn't enjoy the eggplant caponata paired up with the salmon.  Personally I thought it was a strange pairing with the salmon.    Overall good experience, one of the better dinners I've had in Pittsburgh, will return."}
{"text":"Sophisticated real Italian food with small outdoor area near the square for people-watching. Not your standard tourist Joint. Perfectly-cooked duck. Meat and cheese plate came with an enthusiastic and friendly explanation. My 10yo daughter ordered the meat and cheese plate and earned a visit from an impressed manager!"}
{"text":"The pasta was wonderful and so were the meatballs I got.  I don't make it downtown often, so eating here was special and delicious.  I had my baby with me and they were very accommodating (she is a good baby so she wasn't any trouble to begin with!).  It had a great atmosphere too, fun place to catch up with my friend!    My only complaint is that it was a little salty, but I am not use to much salt in my diet so that is just me!!!  I would recommend this place to anyone!"}
{"text":"In town for dinner with friends and we decided on this place. The waiter was more than accommodating. It was the food. . My friends ordered Confit Chicken Piccata.    (The key word is \"confit\"....Confit (French, pronounced [kfi] or in English \"con-fee\") is a generic term for various kinds of food that have been cooked in oil or sugar water (syrup). Sealed and stored in a cool, dark place, confit can last for several months. Confit (\"prepared\") is one of the oldest ways to preserve food,[citation needed] and is a speciality of southwestern France.)  My friends received two greasy chicken legs with a slice of lemon in top. When my friends explained that they didn't realize it would be a \"chicken leg piccata\", and after back and forth with the manager, he finally removed the uneaten greasy chicken legs from their bills. He also stated that he would be changing the wording of the menu that evening, but said \"Confit is a word used in fine dining establishments!\"  Fine dining? Your waiters are wearing t-shirts and jeans and one of the most expensive items on the menu was the Swordfish special for 23.00! Not fine dining. Casual. Just like the attitude."}
{"text":"One the basis of one visit - great service, fabulous gemelli. As with a true Italian restaurant, there are a lot of dishes with pork products.  Unlike true italian, the dishes are \"fusion\" creative. I had the gemelli with lobster cream and was still thinking about it the next morning. What is the thing in Pittsburgh about Shisito peppers though? I can't deny that the flavor was a tasty addition, but they seem to be on 98% of restaurants in downtown Pittsburgh. Attentive, friendly service. Very well stocked bar.  Why not five stars?? I don't know - I think that's reserved for the very special, like Tony's Trattoria in Bologna before his mom turned over the sauce making to the daughter-in-law.  Sigh."}
{"text":"Inviting little Italian restaurant with an intimate, upscale feel in the middle of the market square. It's open front lends itself to a great view of the square while dining.  We had the bucatini with mozzarella stuffed veal meatballs and I enjoyed the Mafade Bolognese made with veal, pork, beef, tomato, milk, and carrots. Both were delicious.   We started with the authentic Caesar salad made with fresh, crisp romain, a made from scratch Caesar dressing with anchovies topped with large shreds of aged Parmesan. Delicious.   The generous portion of meatballs were made fresh, bursting with flavor, light and fluffy; not dense like the golf balls other restaurants might serve.  The dish included a very thick, long noodle that was made fresh and sauced with a rich and flavorful red sauce. Our server claimed they are known for their meatballs, I have no doubt this is true. Well done.   The Mafade Bolognese was jam packed with flavor and I couldn't put my fork down; if I wasn't with company I would have seriously licked the plate. The made from scratch noodle was wavy, like the edge of a lasagna noodle; a perfect vehicle for transporting large quantities of this delectable sauce.  A thick, slightly sweet red sauced was subtlety spiced with what I think was cinnamon that really made the whole dish just pop. A very unexpected but delightful surprise.   Service was spot on as you would imagine.  The quality of the food, the inviting atmosphere offers much more than you might imagine for a reasonably priced establishment such as this.    Well done. I will be back the next time I'm in town."}
{"text":"I have to agree with Rachel--the atmosphere is fantastic, and the food (and in my experience, service)--not so much.  This place is beautiful--exposed brick, modern styling, dark woods, candlelit.  Picture-perfect date night material.  My husband and I walked in spontaneously and sat down at the bar five minutes before the end of happy hour, and the bartender gave us MAJOR attitude when we ordered off the HH menu.  (Chill, dude! Five minutes is five minutes!  The next round will be full price!)  We also split a flatbread and an appetizer, and there was really nothing special about it at all.  The chef was watching us eat from the kitchen door and he made me feel guilty for not enjoying the food.  I also had to ask for them to turn their one television to the Pens game, and got attitude for that request as well. (It's a hockey night!!  This is Pittsburgh!!)  I don't think I would come back unless I wanted to chat over drinks with the husband or a friend."}
{"text":"I ate here for dinner late this past Thursday night with my girlfriend.  We were downtown already and decided to see what was open in Market Square at a later time on a weeknight.  I actually was unaware that this restaurant was even there since the last time I had walked by it had been Bella Serra, but boy am I glad that it is.  The inside of the restaurant is not too much different from the previous restaurants here with the brick walls showing and some art.  They did add a rolling door to the front that allows it to be open to Market Square.  For dinner I decided to have the strazzopreti & wild mushrooms with a side of orzo mac & cheese while my girlfriend went with the tomato bisque and a poached pear salad.  We asked that it all be brought out together and within a reasonable time period it was.  My strazzopreti and mushrooms consisted of the pasta, an assortment of mushrooms, spinach and onions in a cream sauce while my mac and cheese looked pretty non descript.  At first I was unsure of how I would like my pasta, but wow, was it good.  The pasta seemed fresh and was cooked al dente giving it just a slightly different texture than the large number of mushrooms that it was paired with.  Overall it had a nice earthy flavor that I thoroughly enjoyed.   After finishing my pasta I moved onto my mac & cheese.  It might very well have been the best mac and cheese that I have ever eaten at a restaurant.  It was very rich and creamy and you could actually taste the mixture of different cheeses.  I only wished that there would have been pepper on the table to cut into some of the richness of it.  While I was eating all of this my girlfriend was also enjoying her meal.  I was able to taste her poached pear salad, specifically the roasted garlic mascarpone port vinaigrette and it was extremely tasty.  The bottom line for me is that I would definitely head back here in the future.  I went in without any expectations and it and it totally blew me away and so I am looking forward to trying some more of the chefs creations."}
{"text":"Best restaurant in market square. I have been here several times and never had a bad experience!  Highly recommended."}
{"text":"We ate outside last night which is always great in market square. The drinks are all very expensive, but if wanting a fancy wine night could be your spot. The server was knowledgeable about our questions on the menu but did not stop at our table nearly enough or apologize/explain/let us know our food would take an hour and half. We got an appetizer which came out quick but forgot the bread we had asked to eat with our meat/cheese for and by the time she came back to the table it wasn't as worth it. But then we ended up filling up on bread because our meals took so long to come out after the appetizer. And during that time not once were we apologized to, offered anything, and were avoided other than the server stopping back to try to get us to get another drink. By the time the food came it was mediocre at best- I got a crab cake and salad she got a pasta dish. We didn't even want it but ate what we could or had (I ate mine because it was about 3 bites in meal) paid the over priced prices and left with regret of choosing here. Very disappointing and regret not asking for a manager. Won't be back"}
{"text":"Too much grease from olive oil to whatever else they use - average at best. Lettuce was brown and the calamari was fried - expected more from this dining experience.  Too many other choices to go back..."}
{"text":"When needing an escape from the office yesterday, I asked a friend if she was up for lunch. Neither of us had been to Sienna Sulla Piazza yet, and since we're always seeking out new dining experiences, we decided to check it out.   She made a reservation via Open Table for 12:15. We arrived promptly and were seated very quickly. The restaurant is smaller than I had anticipated but well decorated. I particularly loved the bar that has a beautifully lit wall highlighting the attached shelves filled with bottles.  Though I really wanted to try some of the pastas listed on the menu (the Ricotta Gnocchi and Beef Ravioli looked delightful), I thought that the prices were a bit steep for lunch. I really didn't want to spend $18 on an entree. Instead, I ordered the Classic Caesar Salad, and my friend and I split the Prosciutto & Arugula Flatbread. I am very picky about salads but enjoyed the Caesar. However, I do agree with Rachel C's review that the salad was a bit salty... even without the optional Anchovies. The pizza was descent but didn't blow me away. I felt like something was \"off\" when eating the pizza but couldn't quite put my finger on it. After having thought about it, I think that the classy prosciutto and arugula toppings did not match the more dive-pizza-joint style cheese, sauce, and crust.  I would definitely be open to checking out Sienna Sulla Piazza again to try some additional menu items. However, I think competitor Il Pizzaiolo right across Market Square - though more expensive for lunch - delivers better value for the money overall."}
{"text":"Best waiter encountered in the Pittsburgh restaurant scene in recent years. Food was tasty and  has great potential.  Slightly over-cooked bass buried under too many potato strings but with an absolutely delicious sauce. Grisly yet still delish veal meatball sloppily presented on too small of a plate in a truly authentic red sauce. The tuna, bolognese, and salmon were also ordered and fellow diners enjoyed it but didn't rave. Will definitely return to try other dishes."}
{"text":"Great food - our group had a range of meals from swordfish to skirt steak to flatbreads and salad.  Everything was great.  Service was good. Cocktails good and prices were reasonable."}
{"text":"I have been to Sienna several times for lunch, but I decided to take an out of town friend there for dinner last week.  I ordered the salmon entree, and it was excellent. The salmon was done a little more than I would have considered medium-rare, but it was very good, and the arugula and tomato/eggplant dish were unbelievably flavorful, so I did not mind at all.   I enjoyed my meal so much that I went the next day with a client even though we did not have a reservation.  I ordered a 'side arugula salad' with a side of a mozzarella-stuffed meatball.  I also ordered the tomato/eggplant that accompanied the salmon the day before because it was that good.  The meal was great, and we were very glad to be seated even though the restaurant was packed. The service was pretty good each time. I do not think I have ever been dissatisfied with the service.  BTW, the Malbec Nieto wine from Mendoza, Argentina was excellent as well.  It went really well with the tomato-based dishes that we ordered."}
{"text":"The first thing you notice about Sienna on the Square is the ambiance. Low lighting and candles compliment the brick interior setting the scene for an intimate dining experience. I would return again just for that experience.  Our waiter, Tony, was very friendly and knowledgeable about the menu, creating a great dining experience. Service was fast and convenient. I had a glass of Pinot Noir and the risotto which was so delicious. I'd say it's one of the best in the city. I only wish the menu was slightly bigger with more options.   I was able to make a reservation  at 9 pm for 10:30 pm the same night. I recommend this spot for lunch, happy hour drinks, dinner or late dining."}
{"text":"The service was excellent. Very attentive and also describes the dishes very well. I just wish they would allow for substitions. For example I had the truffle gnocchi which was amazing but it came with duck Ragu. I would have preferred a scallop or shrimp. I understand that chefs like to prepare things a certain way as it is an experience they want to deliver consistently. I am just one of those people that likes to substitute. The food was delicious. We had a bruchetta to start that was vegetarian. Very fresh and flavorful ingredients. We didn't have dessert. This is a rather small restaurant and there were a few larger groups yet the noise level was still very comfortable."}
{"text":"Always great service.   Pleasant knowledgable staff.  They always make great wine recommendations to compliment meals.  The menu has some great variety so there is more than likely something for everyone.  Outdoor seating when weather permits and cozy inside.  I would probably check reservations due to popularity.   Anyways I think you will like it.  SERVICE IS AWESOME."}
{"text":"Chicken took 25 mins to cook fresh (that's ok if food turns out great) but then was rubbery and under seasoned. Halibut was fresh and tasty. Even though we had reservations they tried to stick us at high top in the bar vs regular table. Server was nice."}
{"text":"We had gone to Sienna previously-just for drinks- and had looked at their menu then and had wanted to come back so this was the perfect opportunity. We grabbed two seats at the bar and perused the menu. My boyfriend ordered a Sangria (he was not impressed) however I drank the Rosemary Lemon Drop (he loved that though) and the first one I had was good but the second one (made by a different bartender) was hands-down 100% the best cocktail I have had in a very long time! My boyfriend ordered the braised rabbit,which is actually what I wanted, however I decided upon the prosciutto &arugula flatbread. That way I could taste his rabbit and he could try the flat bread.The braised rabbit was one of the best tasting entrees I have ever had at a restaurant! It was cooked very tender and was not \"gamey\", the sauce tasted as if it had wine in it, was creamy but not overly so-it was just amazing! The flatbread was surprisingly very good as well. It was a little overly salted, however, not so much so that it distracted from the other flavors.And it was very evident that all ingredients in both dishes were very fresh and authentic. The bill was a little higher than we would have liked. In particular the Rosemary Lemon Drops were $10 each which is steep, however, the second one I drank (and I don't believe I have said this in a long time) truly was worth $10 based on taste and presentation. Overall, I am excited to go back and try another entree besides the flatbread.I think next time I will order a rabbit entree for myself, even if my boyfriend gets it again, because it was just.that.good."}
{"text":"We ate here before a concert. The inside is dimly lit (mood lighting that is very atmospheric, but the party next to us was using their cell phones to read the menu). Speaking of which, the menu is limited yet somehow also diverse. More options appealed to us than we could eat at once, so we resolved to come back to order the other ones. This time we shared the arugula salad (which gave off a beguiling aroma like summer BBQ?) and a glass of rose. The wine was delicious, and I do not know why I continue to be surprised at how small the pour is at fancy restaurants. Hubby liked his flank steak with sweet potatoes two ways, while I found my charred scallops with cauliflower three ways to be an odd, monochromatic mixture of textures. Next time we can afford $50+ per person, I would like to try the beets and risotto."}
{"text":"Lovely little restaurant with outdoor tables so you can check out the goings on at market square. I ordered the shaved artichoke salad to start but they were out of artichokes. I was so sad as it sounded delicious!  So we had the ceasar salads, I had the scallop risotto, and Chris had the mushroom flatbread. The ceasar salads were good but be prepared to really like anchovies as the dressing is loaded with them. The scallop risotto was fantastic. Creamy, decadent, scallops were perfectly cooked as was the risotto. I would hands down order this dish again. But the flatbread was best described as interesting, and not in a particularly great way. To start it was loaded with truffle oil so all you could smell was the truffle oil. I could smell it from across the table. It was a bit too much. The flatbread was described as kalamata olives, mushrooms, and an egg on top. I was disappointed that the olives were a paste as opposed to slices of olive and either the truffle oil was too over powering or this paste had no flavor. Either way there were no briney, yummy, olivey goodness. If I had closed my eyes, I would never have even known they were present. And as far as the runny egg on top, it created a texture that just wasn't pleasant. I think if the egg had been slightly more cooked, the truffle oil reduced, and whole kalamata olives been used then this would have been a fantastic flat bread. All in all I think we would go back. Service was great, the setting on a beautiful summer afternoon was wonderful, and I'd like to try their dinner menu!"}
{"text":"I came here a few times for lunch and overall had good experiences. I recommend making a reservation if you're coming right at lunch time during the week, I've used Open Table a few times to do this because they get packed pretty quickly.   For food, I highly recommend the house made stracciatella! I've had it a few times and it's wonderfully delicious! I've also tried the crab cake sandwich and their famous meatballs that are stuffed with cheese on the inside. Overall the food was good."}
{"text":"I loved this business lunch where we all ordered flatbreads, which were delicious, generously portioned, expertly baked, and beautifully presented.  I highly recommend the one with mushroom, garlic, arugula and goat cheese. The ambiance is cozy and perfect for a winter day, the service was quick and attentive, and the location was right next to the cute Christmas market."}
{"text":"This was one of the most enjoyable Italian meals I've had outside of Italy. Perfect Pasta, Amazing Calamari and a Flat Bread I could eat everyday. 4 of us shared various items and we had a hard time deciding who got to enjoy the odd number of slices on the flat bread.  The Calamari was so tender and the smoky dipping sauce was to die for. Every item is well worth the price and the atmosphere and service is outstanding and so pleasant. We had a relaxed and enjoyable meal and couldn't have picked a better place to eat. We will be back on our next trip."}
{"text":"I travel to Pittsburgh a fair amount for business, so I'm always in search of good lunch spots. I can safely say that this will earn a high spot in my stable. My coworkers steered us here on a recent visit, and it was a lovely experience. Service was efficient but not rushed, and all of us were quite enthusiastic about our food. I had a delightfully rich carbonara that had the perfect balance of peas and pancetta in a sinful egg sauce. Aside from nearly falling asleep in a meeting after that, I couldn't have been happier with lunch."}
{"text":"Had an excellent birthday dinner there last Saturday.  Had the bucatini with mozzarella stuffed meatballs - awesome!  Our server, Elena, was one of the best we have had in a long time.  She is a rarity these days.  Will definitely be back as well as recommend to family and friends."}
{"text":"Every so often I stumble upon a gem of a restaurant that deserves mention! Sienna Salla Piazza on Market Square in Pittsburgh is one of those places. Executive Chef Matt Porco's rendition of a superb Mesclun Salad is a true tribute to his culinary experience and high standards. Sauces were prepared to perfection and presentation was impeccable. From appetizers to main courses, it was evident only the finest ingredients are used at this establishment."}
{"text":"Walked in around 6 with no reservation and was able to be seated immediately. After about 30 minutes, the restaurant was just about fully seated. The table started off with mozzarella stuffed veal meatballs which was recommended and they are definitely worth a try! The Caesar salad was a bit salty for my liking and the bucatini with mozzarella stuffed veal meatballs was very tasty."}
{"text":"Dined outside there for dinner last week.   The food was quite good.   I particularly liked the chilled corn soup.   Meatballs were also very good as other reviewers have said.   The rabbit pasta was very flavorful although you need to like game to enjoy it.  The waiter was upfront about that which I appreciate.  It is noisy, at least when all the outside tables are filled because the weather is good.  Crowd was mixed from business people dressed at the high end of business casual to tourists and kids in shorts.   It was a pleasant mix of people having a nice evening out and there were some between table conversations which appeared to be welcomed by both sides.  More of a community/small town feel than most downtown restaurants.  We were seated on time and served promptly so we didn't experience any of the problems that others have reported with timing or service but then we didn't have a show to go to and just wanted to sit and talk over good food in a pleasant atmosphere for two hours.  Prices seemed fine to me and cheaper than most of the higher end downtown restaurants ($40/person plus tip for 1-2 drinks + soup + pasta and no dessert)."}
{"text":"Linguini carbonara was excellent. Flavor was really nice and the pancetta and noodle cooked perfectly.   I was most disappointed by the portion size. It's more appetizer than dinner portion. My girlfriend had more soup than I did linguini.   Her soup by the way was fantastic.   Pass on the salads if you're thinking about ordering them. Forgettable and lacking flavor."}
{"text":"Food tasted good but not sure how it looked. Atmosphere is nice and comfortable but the lighting is awful. The place is very dimly lit, and during lunch the front of the restaurant was open to direct sunlight. So, it's dark with a glare at the same time. Very annoying. The food and service however was very good. Open-faced eggplant sandwich was tasty (not bitter) and substantial. Pasta salad was good and s nice size portion. I will definitely go back. Just need a small flashlight and polarized sun glasses."}
{"text":"I'm never disappointed here. Food is top quality, atmosphere is relaxing, outdoor seating is perfect, pricing is amazing for the quality. Perfect every time. Arugula salad with chicken is perfect for lunch."}
{"text":"We came here last night and the service, food, and ambiance were great! We had drinks and appetizers, the sangria is delicious and the meat and cheese plate was wonderful! We took a seat outside and it was great to people watch and listen to the music at the restaurant next door."}
{"text":"This is another one of those palce3 I'd give 3.5 stars to if I could, but because I can't I think 3 is more fitting. There wasn't anything horrible about the place, at least not for us, but it certainly didn't leave me wanting more. Some of the other reviews complain about the price of the food for what you get; and I sort of agree. The greens and beans appetizer is 9 for what the waitress called \"a very small bowl\", and she was not kidding. On the other hand I got a grilled chicken sandwich that came with pasta salad (or chips) for $11 and I felt I got what I paid for. I was a decent sized chicken sandwich, with a nice sized bowl of pasta salad.  The taste of the food is the same way. Once again, my chicken sandwich was pretty good. It came on a nice focaccia bread with a fancy aioli and (I think) provolone cheese. I was not a fan of the pasta salad though; it had a funny spice that I was not fond of. Erin loved it though, so.... And if you are a beans and greens lover, these are not the usual. There was sausage and chunks of tomato, which as an Italian I had never seen before, and very little actual greens. It wasn't bad, just not what one expects ordering beans and greens. A large part of the menu looks like wine and cocktails, but I don't drink so I'm no help there.  I don't know, it was just kind of eh."}
{"text":"4.0 star rating 8/11/2015 Meatballs!!! This was recommended by a local at our hotel. The fried pickle appetizer was delicious.  So yummy. No complaints.  I ordered the meatball slider. I got two which ended up costing 7 bucks. A bit overpriced if you ask me.  The menu allows you to select a meatball consisting of different flavors and then let's you add a sauce or gravy. I got the spicy meatball with mushroom gravy. You can then turn it into a slider, sandwich, or eat the meatballs with the sauce/gravy. The flavors were there and the meatballs were good. My only complaint with the sliders is that is was not hot. Not even lukewarm! Disappointing for the price your paying.  We also ordered tater tots. They cooked them too long. My daughter had the mac and cheese. Cute little noodles but not a lot of flavor.  Overall one of the better meals on this trip. I would recommend it if you don't want to stuff yourself."}
{"text":"My meal was absolutely delicious. I started with the Classic Caesar and then had the squid ink Linguini alla Puttanesca. The service was excellent. The only downfall for us was that although I loved my meal, the rest of my family is picky and this is not your traditional Italian restaurant. It was not easy to get my daughter a plain buttered noodle and there wasn't a lot of choice for the others. So when you read the reviews and see \"comfortable Italian restaurant\" don't be fooled like me, and check the menu first. It is an excellent restaurant for inventive Italian cuisine - just leave the kids at home ;)"}
{"text":"We go here often for happy hour and it's always great. The food is delicious (especially the pizzas) and they have a decent wine list that's reasonably priced. I like the atmosphere too, very cozy. Never sat at a table though, so can't speak to that, but the bartenders are really nice and knowledgeable, especially Hillary."}
{"text":"WORST RESTAURANT EXPERIENCE I HAVE EVER HAD.  I am not exaggerating in the least bit.  The series of events that occurred in the hour and 20 minutes we were here completely put a negative damper on the rest of my family's night  Let me preface this by saying that as a higher-end restaurant in a downtown area, located near the all the theaters, a place like this should check to show schedules and plan and staff accordingly.  Obviously the place was understaffed because we were not the only ones getting up from their tables to complain to the manager.    Because I took into account that it would be a busy night in the area, I scheduled far ahead and made a nice reservation.  We got there promptly at 6 and were all delighted by the beautiful decor.  I knew we may run into a problem when we all knew what we wanted before anyone even greeted us at our table because we sat there for a little under 10 minutes without anyone acknowledging us at the table.    Regardless, quarter after 6 rolls around, and we place our orders completely: appetizers, salad, and main entrees.  It took a while for the appetizers to come out, but I thought maybe that was just this place's take on the classic \"take your time\" Italian setting, which I am not opposed to.  So, I was fine waiting a little bit so our table actually had the time to talk.  Once the appetizers did arrive, I was a little shocked at the portion.  There were just about 3 bites of greens and beans to go around for $8 and the beans weren't even cooked enough... I mean what I had was delicious, but since we all shared a couple appetizers, I only had one bite.  Same with the octopus: served atop of the most beautiful plate.  It looked elegant, but it was pretty measly.  However, I understand the smaller portion of octopus because it's obviously a more expensive ingredient than the greens that go into making greens and beans.  I digress...  Another 15 mins goes by, then finally the wedge salad that my parents ordered arrived.  Now this wedge salad was the best part of our meal.  In fact, it was damn near delectable.  But it was soon easily overshadowed by my hunger and the look around the dining area to see many people waiting for their meals.  At this point I started to get nervous: it was getting close to show time, and I could feel that our food was no where near ready to arrive to our table.  No less, I felt optimistic when we asked our waiter after another 10 mins when our meals would be coming.  He responded, \"well, it won't be 20 minutes, maybe more like 5 or a few.\"  He gave the excuse that the cook is bringing the food out in the order it came into the kitchen.  Well, bullshit because the gentlemen who came in 20 mins after we ordered complained about their meals running late, and soon after their plates arrived.  **FUNNIEST MOMENT OF THE NIGHT: At this point the manager came over, saw our empty table, and stack of appetizer plates, and asked how our meals were!  You kidding, I almost killed over.  This is when he then told us the \"there's a show, and we are running behind\" excuse.    I am sorry, but when I plan ahead and make a reservation because I am so excited to eat at this place and start my night off right, the last thing I want to hear are these dumb excuses and being told to just wait a little longer is even worse.  It was 15 minutes to show time.  We had officially been sitting there at this restaurant for an hour and fifteen minutes.  It was time to throw in the towel, and hurry and make our way to the show.  My father asked our waiter for the check for everything we had eaten and told him we were leaving.  Well, he brought the check, and GUESS WHAT, it had all the entrees on it!    Instantly, my mother jumped up, and I never let my mother get mad in public, especially at a restaurant in the restaurant setting.  I never think its cool to yell at a staff member or a manager, but this time was different.  This was easily the worst restaurant experience I had ever had.  What's worse is that I was so excited to eat here.  I had spent time looking at the menu the week before and getting excited about what dish I was going to eat.  When my mom went and talked to the manager, he had his face planted on the kitchen computer screen.  She told him our series of events and how it was ridiculous, and then she said we were leaving and she asked how much we owed for what we had eaten so far, and he said he didn't want anything.  At least at this point I left with some respect for the guy that he didn't fire back or state that he wanted the $25 for the food we ate.    As we left, I was so upset.  Like I said, I had been looking forward to this night for the past 6 months, and I was extremely excited about trying this place after I had read all the reviews.  I was very upset with the way the night ended.  Sadly I will probably never be back, and every time I am near Market Square or think of that night and show, this poor experience will be in the back of my mind."}
{"text":"We ended up here due to convenience.  Since I work in the PPG building, I've grown a little tired of the other Market Square options.  I wasn't super hungry, so I just ordered a salad with the marinated olives as an appetizer.  I've been back three times since, and here's why -   The salads are the perfect portion, and they are AMAZINGLY priced.  They also offer interesting flavor combinations in the different salads. The olives are just too yummy.  I've ordered them every time, and they are always different.  Love that. The white bean paste with garlic and truffle oil they serve with the bread is out of this world.  I could eat just that for my meal and be totally satisfied.    Sienna is a great addition to Market Square.  Eventually I'll be back to try an entre, but I'm so in love with the salads, I haven't got past them yet!"}
{"text":"Lunch with a friend/client. Great atmosphere, great menu, delicious meal."}
{"text":"I've been here twice before, once with a friend for happy hour drinks and another time to meet up with my son and daughter-in-law for dinner before a show. I had excellent experiences both times. Today I stopped in for a bite for lunch and the excellence continues.   The ambience at Sienna is contemporary with low lighting and Caribbean infused jazz playing just loud enough in the background to create a cozy, inviting and, dare I say, romantic atmosphere.  The bar is fully stocked and they carry a modest selection of craft beers. It's finally getting warm enough now outside that they were able to open the front wall (garage door style) of the restaurant exposing the place to the sights and sounds of Market Square. They even offer sidewalk seating for those early enough to snatch up a table there. I, however, wasn't so fortunate and took a seat at the bar.   After taking a stool I was promptly and cheerfully greeted by the bar keep with a glass of ice water. I glanced at the menu and hesitantly decided on the Open Face Chicken Parmesan Sandwich with a side of pasta salad. I say hesitantly because I haven't had a good chix parm in the Downtown-CBD yet.   It took less than ten minutes for my meal to come out and I was oh so pleasantly surprised. In front of me was a juicy plump chicken breast covered in delicious Italian inspired marinara sauce (that was obviously in-house made) topped with a generous coating of provonello all sitting on top of a lone slice of focaccia. A pinch of basil sat capped off to the side on the provonello as if to say, \"we believe in attention to detail\". It's been a long time since I had chix parm that simply looked this good. If the presentation gets an \"A\", the taste of this here dish gets an \"A++\"! The side pasta salad was a nice touch. It was dressed lightly and paired perfectly with the parmesan.  My total bill came to $11.77 plus tip.  If you've dined enough in the Downtown-CBD you know you can spend a lot more for a meal of this quality.  I really can't say enough good things about Sienna Sulla Piazza.... Excellent service, comfortable atmosphere, delicious meal all for a more than reasonable price.  Five stars just doesn't seem enough."}
{"text":"small but comfy. staff was fantastic.  calamari was really great - sauce was killer.  soup ribbolita was awesome.  i could eat that everyday of my life.   house made pasta was a bit to doughy for me - i make my own very often so i'm a bit prudish about pasta.  it was a good meal through  waiter Adam was excellent."}
{"text":"Came for dinner with 8 people - able to make a reservation and had the table ready for us when we came!   SERVICE - overall was great. Our waitress checked in with us enough and helped us decide on orders when we were indecisive. She definitely knew her stuff and could offer extra info and sound recommendations.  Also, they were a bit stingy with bread though... my friends really liked the pear-hummus spread but they didn't seem to want to give us more? Even though the food took a bit to come out.   FOOD - I can only speak for the Truffle Gnocchi, but OH MY this is the best gnocchi pasta I've ever had. The sauce was delicious, savory, just woodsy enough with the truffle. There were at least 4 different kinds of mushroom, all of which went so well with the duck confit and dark sauce. The chives were a little strange, but added great green color to the dish. Good portion, wasn't too full but very satisfied after.   VENUE - sat at a long table with benches near their garage door opening. So nice! It was a beautiful day out and we got to see the sun set a bit. Inside is quite dark, but super clean and rustic-feeling.   Overall, a little pricier than I'd like for pastas in Pittsburgh, but I mean it was delicious!"}
{"text":"The octopus toast was to die for, but the food was to die from, sadly. Ok, it wasn't that bad, but it was SO over salted, and when you are dropping big bucks on a romantic dinner, you don't want to leave with a lip puckering salty taste in your mouth. The ambiance was lovely, the waitstaff was accomadating, the area is cute and good for out of town visitors (and parking, if it's a weeknight after 6 p.m.). Still, when you drop $100 on a dinner for two, you expect a bit less salt."}
{"text":"While the food was good, the poor and slow service diminished what would have otherwise been a nice dining experience."}
{"text":"It pains me to write this review as at one time this was my favorite restaurant in Pittsburgh. But so much has changed and not for the better. To begin the level of service. There is now an indifference that seems to permeate the entire waitstaff and bartenders. Almost just going through the motions. Any thought of putting the customer first has disappeared. But more importantly the quality of the meal has fallen. My lady friend and I stopped for a meal the other evening, a salad and snack with a glass of wine after the Penguins game. The snack being the Mozzarella stuffed Meatballs in Maranara Sauce. We waited a long time for them to arrive, over twenty minutes. And as we broke them apart with forks to eat we noticed two things. The were horribly undercooked, still rare in the middle....and there was mozzarella stuffing them. My lady friend and I sent them back and finished our salads as it was late and left. There are much better options in Pittsburgh at present."}
{"text":"Honestly, there are far more interesting places to visut,"}
{"text":"I stopped in for lunch on a Saturday around 12:30. My girlfriend and I were seated right away by a very welcoming host. There is seating available outside with a nice view of Market Square, so that's where we decided to sit.   The service was very fast and the waiter was also very friendly. We started out with the Wild Mushroom Bruschetta as an appetizer, which was delicious and ended up being a fine choice. I ordered the open faced Eggplant Parmesan sandwich which was served with your choice of homemade chips or pasta salad, I chose the chips. My girlfriend went with the Chicken Parmesan sandwich.  We were both very satisfied with our meals. Neither one of us could finish due to the large portions. But I will come hungrier next time and clear my plate, it's that good. The flatbread also looked great so will most likely order that next time I visit.   Overall, I think Sienna Sulla Piazza is a great addition to Market Square and definitely worth visiting!"}
{"text":"Nice environment. warm and inviting.  We meet some friends and this is one restaurant that you can actually talk and hear your follow table mates.  Yea to that!  We were seated at a high top and I do mean high top.  Higher than normal and the seats were hard to get into if you are not tall and harder to get off if you are shorter.  Oh well! Service was excellent.  From the busboy to our waitress.  She was able to describe and explain many items on the menu and wine list with a very detail description! As to the food.  Just OK!  Started with a liver appetizer that was a special and it was tasty but the liver was a little overcooked and a little tough.  Our Sienna Chopped Salad was way overdressed, just saturated with dressing and had very little flavor.  Even the gorgonzola seemed flat due to the overdressing.  My Lemon Spaghetti was OK, but again over saturated with sauce and the only real flavor was the lemon lacking any basil or spinach flavor that it should have had.  Was able to get a taste of a meatball.  It was good, not overcooked like most restaurants and tasty but not as good as my Mom's.  I guess I am over the meatball craze.  After the misses on the app. and dinner, we decided against dessert."}
{"text":"I got the Bruschetta and to Bucatini with mozzarella and stuffed meatballs, amazing! The pasta was a little undercooked but overall the experience was great! Our waitress was very prompt and professional.. would go again!"}
{"text":"Excellent atmosphere in market square. Food was absolutely Devine. I had the octopus to start and I must say that it was the perfect way to start. The swordfish entree was both visually appealing and an absolute delight. A precise mix of saltiness with the slight acidity of the lemon, combined with the wine reduction sauce was perfectly married together. I would definitely recommend this place to anyone visiting from out of town."}
{"text":"The food was very good.  Homemade pasta and everything tasted incredibly fresh.  Nice quiet atmosphere.  Service was excellent.  My only complaint would be the prices.  I know it's homemade, but it's just pasta for $22, and you don't get anything else with your meal, not even a salad.   And $6 for one (small) meatball!  Really?  I'd probably eat here once a week if the prices were a little more reasonable.  It was good, but not worth the money."}
{"text":"We made a reservation for a Tuesday night and arrived on time, but still had to wait a few minutes for our table. The restaurant is on the smaller side, so it was mostly filled.   I had the \"Hopeless Romantic\" (tequila blanco, benedictine, cinnamon, apricot, lime) and it wasn't bad, but it was really weak. My friend agreed that her Rosemary Lemon Drop (vodka, limoncello, lemon, rosemary) was weak too.   For my entree, I chose the linguini with mussels. It was good and there were more mussels than I expected, but there wasn't much of the linguini. The dessert we shared was the raspberry tiramisu. We've never seen tiramisu placed in a glass cup before, so that was kinda cool. Both of us agreed that it didn't really taste like tiramisu though.  Their menus are folded into squares like napkins, which is cute, but mine was ripped at the edges. Unless that's what they were going for, might help to reprint them on new sheets of paper.  Weak drinks and small portions for everything (food and drinks), but decent food and great location in Market Square. Worth a try I guess if you like Italian and are looking for a place with a nice atmosphere.  Taste | 3 Atmosphere | 4 Presentation | 3.5 Service | 3 OVERALL | 3"}
{"text":"On my recent trip to Pittsburgh, I visited Sienna Sulla Piazza in Market Square for dinner with friends. I can't remember the last time I visited Market Square. It's changed quite a bit.  Unfortunately, I had partied a little too hard at a bachelorette party the night before. Sienna had an excellent wine menu, but I had to pass on that. I wasn't sure if I could handle real food, especially rich Italian food, but Sienna's Housemade Ricotta Wild Mushroom Gnocchi ($19), surprisingly, helped cure my hangover. I asked them not to include the pancetta. Fantastic gnocchi dish with gorgeous mushrooms.   John got his haircut earlier in the day, and the stylist told him that Sienna's food is great, but the portions are small. He ordered one of the vegetarian flatbreads and a side of brussel sprouts. Uhh, these portions are definitely NOT small at all. He ended up with way too much food! (Perhaps we're used to NYC portions?)  Great service, great food. Next time I'm in the 'burgh, I'd love to stop by to try more dishes and explore their extensive wine menu. Until next time, Sienna!"}
{"text":"Underwelming.  Portion sizes are so small you can literally count the number of strands of pasta in your dishes, but the prices aren't so small.  Had a squid ink pasta dish with shrimp. Came with perhaps 14 strands of linguini, 7 very small shrimp, and mostly breadcrumbs. All for $26. I've never considered breadcrumbs to be more than an garnish or binding ingredient and was quite disappointed in this dish.  All of the portions were small. Food was just ok. Not food allergy friendly.   Meh."}
{"text":"2.5 stars, leaning towards a 2 based on the price.  Went on a Wednesday night at 7, with reservations.  Got there fifteen early, got seated on time.  The front of the restaurant is *loud*; with a waiter talking to the table next to us and a somewhat unpleasant pair on the other side of us, the noise was a factor here.  Got much better when the waiter wasn't dealing with anyone.  Anyways, it's a loud restaurant.  That's by no means a dealbreaker, and really common for Downtown.  Crowd was mixed, the most represented group there when we were in were 50-something guys wearing polo shirts, half tucked into khakis.  The food: - I had the pork, which was decent, my wife had the gnocchi, which was good, but more doughy instead of melt-in-your-mouth. - We had the bruschetta, which we were told took 12 minutes.  (Weird to be that precise, but OK).  Some other waiter/waitress apparently swiped ours... so it took nearly half an hour, as our waiter thought someone had already brought it to us. - Salads were good; aces. - My wife asked for a meatball with her gnocchi, which they forgot; it came about ten minutes late, and warm, but not hot, which left us wondering if they finished cooking it.  The meatball?  Not all that. - Portions were fine dining, and not red-sauce-stuff-your-gullet; I liked the portions, and left pleasantly full.    Service: - good, but with us having a very quick set of orders when we sat down, it took 45 minutes to get the first of our food... which was an hour after we first showed up.  Ouch.  So, the food was decent, but not as good as some other places around town at the same (or lower!) price points.  Either the service or the kitchen botched this one, and for \"restaurant of the year\" and at a premium price... yeah, that sinks it.  (We spent $100 after tip; two entrees, two salads, one appetizer, no booze.)  For better red sauce Italian, I'd try Lydia's in the Strip, and save a bit of money.  For better Italian, especially gnocchi, I'd go to Dish Osteria in the South Side, and still save a bit of money.  If I hear good things, I'd be glad to check back here, but we left disappointed on our first trip."}
{"text":"Great food, but a little pricey for the serving size. Great atmosphere whether you sit inside or outside. Service was typical; nothing over the top."}
{"text":"I had the prosciutto wrapped Atlantic salmon and it was perfection. The poached pear martini was delicious. The bread was served with a bean dip that was pretty dull and the place was extremely dark, but the service was awesome. Definitely worth a second trip."}
{"text":"We were lucky to grab a last minute reservation on a Saturday night and couldn't have asked for a better meal!  This wasn't my first trip to Sienna but it had been awhile.  Beautiful ambiance with the Christmas lights, our waiter was friendly and attentive, and the food was divine!  I wasn't sure I wanted a \"heavy\" pasta dish and I was pleasantly surprised by the light fluffy potato pockets, and the squash and braised rabbit and sprouts were so delicious it didn't even feel like a traditional pasta dish.  Best of all:  three entrees, one soup, one salad and a dessert, and a few glasses of wine and the bill was only $108. Oh...and there's valet parking...so the whole experience was fabulous.  I can't wait to go back!"}
{"text":"I had loved this place (read my earlier review). However, they have been trying too hard to the point of being pretentious. I have tried taking my colleagues to this place for a happy hour at 5pm and despite having an empty restaurant at that time, they were playing hard to fit a group of 6 people (we were flexible to split into two groups as well). Leaving that incident aside, I met up with a friend last evening at the bar area and again had a bad experience. Also, they were the first restaurant I have seen in Pittsburgh to charge me two bucks for ice to go along with my whiskey! Thanks but no thanks!"}
{"text":"The hostess is anything but inviting, so don't let that put a damper on your evening. We had dinner reservations for 9:30, so we arrived at 8:30 for pre dinner cocktails. I highly recommend reservations as this is a small place. We had stopped in here a few weeks ago for drinks and were back for dinner. We ordered French martini's and they were very tasty. I stopped at one as I had not eaten and was beginning to feel quite shaky. Our table was ready and we were seated. Our waiter was knowledgeable about the food and gave his recommendations. We both decided on the bucatini with mozzarella stuffed veal meatballs for dinner, I ordered the orzo Mac n cheese as an appetizer as I was starving, and my boyfriend had the tomato bisque. The tomato bisque was very tasty, and my orzo Mac n cheese was very creamy and delicious. I must note that there was not salt n pepper on the table, and that must be because you don't have a need for it. All dishes are seasoned well. Our dinners arrive and again, everything is extremely tasty. The meatball was seasoned perfectly and the mozzarella oozed out when you cut it in half. I will definitely be back again. This is a great place for drinks, celebrations, or anything in between."}
{"text":"Got reservations to Sienna on the Square during a recent trip to Pittsburgh with my wife and another couple.  I booked it due to the high ratings here on Yelp.  First impression of the restaurant is that it is located in a central, hip area on Market Square.  You can easily go for drinks at a bar in Market Square before or after your meal here.  My first impression walking into the restaurant is that it is a lot smaller than i thought.  It has a large bar with high top tables along with the rest of the tables.  We were greeted by a friendly hostess who sat us immediately (the wait staff is also very professional and attentive).  The one thing that I did not like was the amount of space between the tables.  We were seated near the bar, so we had people standing near our table, and my wife seat was backed up against the seat of the occupied table behind us.  I got a spicy old fashioned drink which was excellent and a blue cheese salad which was excellent.  For the main dish I got linguini carbonara which was top notch, made al dente, which is my favorite.  Also go for a meatball on the side (it has mozzarella inside of it!).  One added incentive for me is the cool music that was playing, which was mostly 90's rock music.  I go to Pittsburgh annually so I would 100% go back here.  Highly recommended."}
{"text":"Had a nice dinner and walked friends to car. Later evening 10:00 and we asked manager if could have a drink at one of multiple empty tables and were told no because not enough servers.  $250 dinner and 20% tip and could not accommodate us.  Will never go back.  McDonalds service standard"}
{"text":"Fabulous meal!  After driving around hoping to stumble on a great restaurant while visiting Pittsburgh, I consulted yelp and spotted Sienna. 4 stars and 2$ (I'd say leaning toward 3 but well worth it) -- my kind of place.  Everything was home made -- pasta, sausage, meatballs with a mozzarella core.  I highly recommend the gnocchi. Great atmosphere, great music, great food, great find!"}
{"text":"i really liked sienna. i didn't know what to expect going in, but i certainly wasn't disappointed.  we ordered the parmesan stuffed meatballs and the meat and cheese tray for appetizers. the meatballs were good as were the fancy meats and cheeses. for entrees, i split a tuna melt and a bbq sandwich with Sheryl T. the bbq was good, very interesting with the veggies in it, but the bun was a little soggy. the tuna melt was delicious, and a lot more filling than i expected. we got a side of pasta salad with one and chips with the other. the pasta salad was good but nothing super special. the chips on the other hand were quite possibly the best i've ever had.. the rosemary-herb topping made them irresistible. our bartender was also super nice and helpful. they gave us the wrong bill by accident but he quickly fixed that for us, and the price turned out to be quite reasonable."}
{"text":"So darn good and seriously the best meatball I have ever had! Get one or two with your entree. They are delicious and stuffed with mozzarella. Not only was the food A+, but the service was stellar. Our server, Ryan did an amazing job of recommending food as well as pairing drinks with our choices. It was clear he was a foodie and gave us some other great recommendations of places to go around town. Thanks Ryan and Sienna! We'll be back!"}
{"text":"Me and the hubby went today for lunch. It was alright . I am glad we tried it but we are in no hurry to go back. I have to say there is a cool , hip, chic vibe but the food was just okay. The hubby got the crispy BLT which is crispy pork belly, tomato, truffle aioli, and arugala. The pork belly was not really crispy and it was a little dry. The flat breads, we tried two. I got the caprese. It had mozarella , cherry tomatoes, basil and roasted garlic. The crust was crispy and good and it was tasty. I say there was a tad too much garlic (& I love garlic). The hubby chose the prosciutto and arugala flat bread. The hubby was not keen on the tomato sauce. I did not mind it. The prosciutto was good. The crust, the very edges were crispy but the inner crust was soggy. It was just all right. We are not in a hurry to go back."}
{"text":"So many good reviews...   My boyfriend and I wandered in on a Saturday during lunch to try a new restaurant. The atmosphere is very nice, the service was okay, but the food was disappointing. The food wasn't horrible, but it wasn't good either. I ordered the grilled chicken sandwich with chips. The chips were good (maybe a little over seasoned), but the grilled chicken was bad. The chicken tasted like the grill (not in a good way). It had an odd taste and smell to it.   My boyfriend had the crab cake sandwich with pasta salad. I had a bite of his pasta salad and it was good. He said his crab cake was full of filler and not a whole lot of crab.   Meh- I would give it another shot since fellow yelpers have rated this an average of four stars..."}
{"text":"Went here with a friend due to their appealing website and ability to book a last minute reservation.  We both had our eye on the gnocchi but they were out.  My friend had the linguini with mussels and I had the bolognese - both were good, but not great.  They left us with room for dessert, so we split the raspberry tiramisu which should probably be renamed since it didn't remind us of tiramisu at all.  Also worth mentioning that their cocktails are tasty, but were weak on alcohol content - disappointing for $10 a glass.  Overall decent meal in a nice setting, but there are probably better options."}
{"text":"Although the lights in this place are so dim that I'm never sure if its open, Sienna is a delightful and incredibly underrated dining spot! Each item i have tried is fragrant with so many textures and tastes that it makes my tastes buds dance. I came here for dinner and started with the octopus antipasti, which had just the right balance of lightness of arugula and richness of its sauce. I am a born and bred New Englander and know my seafoods, so i was skeptical to try their Seafood Gemelli. However, it exceeded my expectations! Sienna's homemade pasta, cooked perfectly aldente, adds a new texture that you don't get from regular pasta. The lobster sauce it came in was aromatic with so many flavors and was balanced perfectly by the other vegetables in it. The only negative I can think of is that the restaurant seemed very dark and the music didn't fit the mood i wanted for a nice dinner. Overall, I left Sienna with a happy stomach and an empty wallet. I would do it all again."}
{"text":"While I was visiting the annual holiday market I decided to try this place out for lunch. I was seated immediately. The area where I was seated was a bit dark but if you go up a small flight of stairs there is better lighting with additional seating and a full service bar.  Since this place is Italian, I was inquiring about one of their soups called apple and caramelized onion. The waitress explained that is not your traditional French onion soup but is flavorful. I proceeded to order the eggplant Parmesan open faced sandwich. It comes with your choice of chips or a pasta salad. She told me that this sandwich is large so I decided to pass on the soup for the time being.  I got my lunch fairly promptly and she was right! There were actually two eggplants on the sandwich covered with marinara sauce, provolone, and basil on ciabatta bread. The eggplant was delicious! My only problem was cutting it even though I was given a sharp knife. it was not dry nor overcooked so I wanted to enjoy every bite of it.  The pasta salad that I requested definitely tasted homemade and there was so much of it that by the time I had eaten everything, I was grateful I didn't order the soup.  They offer free WiFi there and the waitress was very friendly and attentive to my needs. Best of all the meal is very reasonably priced for lunch. They do offer flatbreads as well as a price fix menu for $20.00 where you can pair an entree with a side of pasta.  I arrived at noon shortly after it opened and by the time I left the place was packed with people. Reservations aren't necessary for lunch but I would suggest it if you plan to come while the holiday market is going on. People will be looking for places to get out of the cold weather.  I was very pleased with my lunch and plan to return soon."}
{"text":"I had a great dinner last night at Sienna Sulla with a colleague while visiting my company's Pittsburgh office. I had the Caprese (tomato mozzarella) salad to start which was fresh and delicious. For my entree, I really enjoyed the grilled swordfish which was poached in olive oil and served atop rounds of fried zucchini and succulent oven roasted tomatoes. My dining companion's tomato risotto was an outstanding melange of creamy Arborio rice studded with sundried tomatoes and basil.  The decor at Sienna Sulla was a cozy mix of exposed brick walls, swirly glazed glass tabletops and low lighting, all of which made for a pleasant dinner ambiance. There were a few tables outside but the interior seemed more inviting so we sat inside by the large bay window looking towards Market Square.  Our waiter was knowledgeable and friendly but not intrusive. I would happily return to Sienna Sulla when I'm back in Pittsburgh!"}
{"text":"I went here for the first time on a date this past Sunday. The waitress was wonderful and complimentary and the food was beautifully presented and delicious! To our surprise they brought out a basket of bread with a garlic butter. My lovely date got the Lemon Spaghetti w/ shrimp and we both loved it. I can still taste it now. Mm! We wined, dined and talked of life, like an Italian dinner would expect. Mangia Bene!"}
{"text":"This was my first time here! One word...AMAZING! There's outdoor seating or indoor, and you get the best of both worlds! Interior lit with candles and soft lighting so you can cool off while not feeling closed in. We had the stuffed meatballs which have an incredible sauce. Then I had a life changing meal, the Pan Seared Chicken, with mushroom risotto, escarole and thyme jus. It knocked my socks off...so many restaurants have good food, but this is a step above. I'd come here every night if I could! And the beer in a cold glass is a nice touch:)"}
{"text":"I am completely sold on Sienna!   I dined late on a Friday night with the significant other. The atmosphere is very intimate and romantic, perfect for our little date night! We were promptly greeted and had our drink orders taken. Service was fantastic throughout our meal. The real star of the show was the food though, oh the food!! I am beyond particular about Italian food in Pittsburgh. If I'm going to order pasta, I was it to blow me away. The food at Sienna knocked my socks off!   We started with the Octopus, and it was prepared deliciously. The sauce that accompanied it was just as delicious. The only thing that threw us was the beans that it was served with. Neither of us particularly liked them, but at the rest of the dish emphatically. Next we had our entrees, we both had pasta. I had the bolognese and my partner had the rustic gemelli. Both were out of this world!  I loooooved the sauce in the gemelli, and the bolognese had the perfect portion of meat and sauce. The noodles were fresh and cooked to perfection.   All in all, I cannot wait to come back! I'm already dreaming of the day!"}
{"text":"I've been to Sienna On The Square only once, and I don't think I'll be going back. While being a nice little restaurant, it's terribly over-priced for such low quality food. I was there during lunch hours, and there was only one other table. I ordered one of their sandwiches, with a side of pasta salad. The sandwich was big, but dry and tasteless. The pasta salad was way too sour tasting, however it was also tasteless other than that. Their drink selection is decent."}
{"text":"We stopped for an early dinner on a family getaway to Pittsburgh. First, the location is great of course. Dining outdoors at the Market Square on a warm summer afternoon - it's great as it is. I like the menu, it's not too lengthy but offers a nice variety to choose from. Great service; they bring you free bread. (the one reason I didn't give them all 5 stars is that they don't have butter. Instead it's bean paste that comes with the bread and it wasn't all that great. I want my bread to come with butter, please!) The rest of the menu items we ordered were great! The flat breads are delicious; salads all look good.  The raspberry tiramisu on the desert menu is a must! Overall, good food, great service and great atmosphere."}
{"text":"Love the atmosphere.  Unfortunately didn't really love the food as much...  We went during Pittsburgh Restaurant Week so we were able to sample a little taste of everything.  Add in a couple flatbreads and apps and we seriously did some damage to the menu!  Hearing that the flatbreads were the way to go, we choose the tomato and basil and prosciutto and arugula.  The winner was absolutely the prosciutto.  The tomato one fell very flat against the flavorful prosciutto.  We also ordered the stuffed hot banana peppers.  They also fell flat and didn't offer half as much flavor as this usually flavorful dish should.  Plus, they were uber tiny.  Literally two tiny peppers that were barely able to be split between two people.  I had the Caesar salad for the first course, which was way too salty.  I realize that it was probably \"authentic\" in the way they used anchovy, but it was overkill.  If you're ever looking for a killer Caesar head to Lidia's in the Strip, they know how to do it!    Second course was the Rigatoni and Shrimp.  The rigatoni was al dente, which I like.  The sauce was okay, but nothing special.  The shrimp was the standout of the meal.  It had three jumbo shrimp and all of them were fresh and delicious!  If those shrimp weren't included the dish would have been a letdown.    The third course I chose the cannoli duo.  I was really not impressed.  It was a grainy filling and I wasn't too into the lemon/chocolate chip combo. It left me craving a real dessert somewhere... hence drinking more afterwards:)  My dinning buddies all agreed it just wasn't a memorable food experience.  There's dishes I still think of because they were so good.  This joint is new, so hopefully they have a bit to work on some things... hopefully!"}
{"text":"Fantastic! Hip, forward-looking without pretentiousness. Service was spot-on...friendly without being overbearing. Flatbread was hubby's fav. I loved the chicken liver pate...great idea to combine with honey but there was just a tiny bit too much of it. (So I'll give them an A++ instead of an A+++). Bolognese was the best EVR. Considering breaking in the back door to steal the recipe. Seriously that good. And really, what's a little breaking and entering for a perfect bolognese?"}
{"text":"My fianc and I had our anniversary dinner here and unfortunately we were very unhappy with everything we tried. We ordered the octopus for our appetizer which had very bitter vegetables and sauce. My sangria tasted very fresh but there was a strong mint tone to it that I did not enjoy.   They serve their bread with a creamy spread that reminded me a little of refried beans. It was unusual, but had a nice taste (fianc hated it). I would prefer dipping oil. This is not the place to come if you want simple, classic Italian food. Their entrees are all ruined by the bitter veggies and sauces, and the vegetarian options are sparse. I ended up getting the four cheese flatbread which was very greasy and had a nice crisp to the crust...if you only ate the edges. Fianc's prosciutto wrapped salmon was undercooked in the middle and sitting in a pool of disgusting red sauce that he said ruined the entire dish. Not to mention tables are so close together that you can hear everyone's conversation! Was a disappointing choice for our anniversary dinner, but the one plus is that the service was great and our server knew the menu extensively."}
{"text":"The homemade pasta here caught us slightly off guard. It's like super thick spaghetti or pasta for the bolognese. The bolognese was extremely heavy in carrots which was okay, but not what I expected. Altogether, not for traditional Italian food lovers, and very expensive. Staff is friendly and helpful though."}
{"text":"Quite the Italian gem in downtown Pittsburgh, Sienna is an excellent experience with wonderful ambiance at a fair price.    My party was promptly seated and served on a Wednesday night by a pleasant french man.  Each of our dishes were quite flavorful, however my roasted quail was clearly the showstopper.  Succulent, tender and incredibly tasty, the saucy combination of brussel sprouts with walnuts and bacon with just a touch of rosemary was quite impressive.  Other winners at the table were the enormous veal meatballs and the butternut squash ravioli (although the portion size was small).  The papperdelle bolognese stood out as bland in comparison to the other entrees I tried.  Although small inside, Sienna has a beautifully dark atmosphere and is absolutely a great restaurant for a night out on the town or after a show.  One of the better eateries in market square if one is willing to fork over a few extra dollars for a memorable experience."}
{"text":"This place was phenomenal!  The food had so much flavor, but it also was different! We went on a Saturday night and sat outside the weather was perfect and the atmosphere was great! The hostess was SUPER friendly, we made our reservation online(i do not recommend this) and it did not show in the computer as the time that was originally reserved. I made the reservation for 8:30 and it showed in their computer as 9, but I thankfully kept the conformation email. The hostess seated us immediately with much apologies for the mix-up and she continued to check up on us throughout our meal! I would HIGHLY RECOMMEND that you try this place! We will definitely be going back! CALL TO SCHEDULE YOUR RESERVATION, do not book it online!"}
{"text":"Loved the ambiance - great little venue and the food was sublime. I had the Campanella and my husband had the Bolognese and  of course we started with the meatballs - ever bite was perfect. The seasoning and sauces were just right and the pasta was the perfect al dente, although for homemade pasta it could have been a little thinner and more delicate. The staff was great and we finished the meal with lemonchello. Having never been to Pittsburg and not sure about their dining scene- we were surprised and delighted by Sienna's and highly recommend it for anyone looking for a great meal!"}
{"text":"We visited for a family celebration on a Saturday evening. Seating was available inside at high bar type tables or outside at bistro tables. We chose outside and it turned out to be great. The menu can be previewed on their website and was not large but we found something for everyone with no problem. Our food choices all were delicious and service was good. There was a small but nice wine list. Afterward we strolled through the Saturday Market enjoying the various artists and vendors. All in all a lovely summer experience."}
