{"text":"I'm very happy with this restaurant I have not had one bad serving of food at this restaurant and I have been coming here over the last couple of years now. It seems everything you order tastes very good. When you come in everyone is very welcoming and is happy to seat you at your table. The service is really good and your food almost comes out too fast which is a good thing that most Restaurants don't seem to have. I would recommend this place to anyone who likes Chinese food."}
{"text":"S.P. is 2 blocks away from me, so I thought I'd give it a try. Ordered grilled pork and veg. dumplings, ginger chicken and their special fried rice. Grilled dumplings were hard and greasy, double deep fried maybe? Or sat out too long and fried again. Tried one and through them out. Ginger chicken, disappointing, what you would get at a shopping mall food court (lots of batter). Fried rice was good, done just right.  Off night maybe, take-out? $36. wont be back.  Will stick with my Favorite, Pearl Express."}
{"text":"First, I'm a Chinese person, born in Hong Kong, but grew up in Canada since age 2.  My parents grew up in Hong Kong. This is by far our favorite Chinese restaurant in Calgary, for quality and value.  They have both authentic / traditional Chinese food as well as more Westernized Chinese food.  The food (both authentic and Westernized) is amazing, full of taste and flavor. For example, we pre-order the soy sauce half chicken and the soy sauce with a subtle sweet taste is marinated with the chicken so it's juicy and flavorful (as opposed to dry). Much better and more value than Chinatown and places like T & T. You can order half sized dishes such as the sweet and sour pork which is light and crispy on the outside and juicy and hot/tender on the inside. Not all their items are listed in their English menu so you may have to ask for any special dishes. Their dinner also comes with a traditional Chinese soup of the day. The people are nice, sometimes a bit rushed/busy because they are busy inside and also take many delivery and pick-up orders."}
{"text":"All the dishes I've had here are fabulous, dahling. Their beef in black pepper sauce hot plate is AHmazing! Their salt and pepper seafood (squid, scallop and prawn) is crispy, light and perfectly salty & peppery. AHmazing!  Quantities are generous.  Food comes out fast. The decor and setting are clean, quiet, nice, spacious. The typical touches of beckoning cats & a fish tank are all there too (all placed to generate prosperity of course).  Let them beckon you! You won't be disappointed."}
{"text":"Signature Palace Restaurant was established serving authentic Chinese food like sweet and sour pork (popular menu item) in Signal Hill community before internet was invented. (which means that Yelp wasn't exist during that time.) They serve very good sweet and sour pork, fried rice and deep fried salt and pepper squid from the past and still maintain the quality standards until today. When I was in elementary childhood, my parents always ordered take outs or dine in Chinese food from them either they are lazy to cook or I only remembered craving the ice cream from ice cream truck whom drove by my house once a while as my dinner main course rather than them......   Anyways, as I recent returned to this restaurant for Mother Day's dinner, things are slightly different than I remember in childhood. Décor been renovated few times in the past, but my parents said the food and staff are remain the same (friendly and quality standards). Which I agreed with my parents, because they served fresh good food and services and they are always packed with dine in and take out orders.   I guess upcoming Father Day's dinner, they will choose that location again...... Sigh! (I rather have ice cream from ice cream truck for dinner........\"Correction\"........ I meant dessert afterward if the ice cream truck still exist. Oh wait! We have internet now, so I can order ice cream online... just kidding."}
{"text":"We arrived just after the lunch rush. We were seated at the very back behind a screen at a table with no forks/plates/etc. We were then ignored for the next 20 minutes, no one even walked by to take our drink or food order. We left without ordering and I'm pretty sure they did not even notice."}
{"text":"More often than not Chinese restaurants in the SW cater to non-Chinese customers, so I was pleasantly surprised at how authentic this Chinese restaurant is.  It is therefore no surprise that this place attracts a lot of people to eat here.   The food is good and consistent with other authentic places in the city.  Service is friendly.  It's s bit loud in the restaurant even by Chinese restaurant standard, partially because of the low ceiling and hard surfaces."}
{"text":"Drove there after reading positive reviews. Had the shrimp hotspot. The shrimps were boiled- maybe 6 of them in all and the sauce was a bland and tasteless white flour mix .  Feeling hungry, we ordered Ginger chicken . Big mistake ! It was deep fried chicken, covered with a sweet and sticky sauce. KFC would have been a better option."}
{"text":"This is a pretty typical Chinese joint with good food and consistency. I usually get take out and it is always unlike other Chinese places is filled with asians. I think that's a good sign."}
