{"text":"Awesome dive bar. Great for cheep beers and burgers."}
{"text":"You can eat a full dinner here for under $10!!! The food is not gourmet, but it isn't bad either. It has a dive bar feel with a lot of regulars. Drinks are cheap and open mic is on Thursday. It's so inexpensive that it's definitely worth a try."}
{"text":"I love this place! It's not the \"coolest\", but the staff and people are always great! Food and drinks are super cheap...you can eat dinner and have a few cocktails for under $20! Great local business run by great people."}
{"text":"Great local bar! Cheap eats. ! Soups homemade! All the food is yummy! Great place to come and hangout with friends!"}
{"text":"I was not expecting much other than simple \"pub grub\".  I ordered the plumber hamburger and was surprised how good it was.  The fries weren't too bad either."}
{"text":"I have been coming here since I was a kid love this place the food is so affordable but it's home made not like the chain restaurants box crap and if u go there a few times they will learn your name. Absolutely love love love their breakfast best place in town for the price not corporate big wigs good people serving good food for a reasonable price"}
{"text":"Lent Dinner review

Cheap eats with several fish options. I did not realize that the only option for Pierogi was as an extra side.

The waitress did not flinch when hubby ordered a fish fillet and all I ordered was the Pierogi... if I had noticed the price was only $2.50 I wouldn't have been so surprised when only 2 appeared.

They were well cooked and the onions were nicely caramelized... but it was a rather meager dinner.

We are not bar folks and did not order alcohol.  We seemed to be the only people who were not regulars so we did not get the friendly & chatty service.

Might come back to try the hamburgers... and watch a game on the big screen in the back room... will skip next year for lent though."}
{"text":"Great dive bar!  I have been here for breakfast on a few occasions.  The food isn't amazing, but it quick & cheap! 

I have been here for lunch too and had a couple of drinks- still very cheap and it does the trick!

Local dive- cash only!"}
{"text":"Went again to see what it's like to sit at the bar.  Not a good experience.  While we were there, our first bartender clocked out and another one came in.   The service from both of them was the same - not rude, but indifferent, walking by our empty glasses, having to be flagged down and asked for a refill, even though it was a slow night and almost no one else was at the bar.   Still like the food for the price."}
{"text":"Holy Crap! 

This is the best dive bar in the area."}
{"text":"Great place to go for breakfast! Love the prices & the service is great! Not packed or loud either"}
{"text":"Horrible lent fish fry. Catfish and cod, fries and salads had no flavor. I would have been better off heating frozen fish and fries in my oven."}
{"text":"Get past the decor, or lack thereof. Just get in the door and order something! It will not disappoint. You'll leave wondering if the owner has realized it's not 1950 anymore with how affordable the food and drinks are. The waitress in the bar area is honestly the best around. She's super friendly, faster than lightning and has a memory that won't stop. 

I've eaten several things here over the past few years and everything has been really good. My absolute favorite is the chicken basket, I've never had such good fried chicken. Ever. The turkey reuben is yummy, the meatloaf is awesome and their spaghetti is great as well. Some things are only available certain days but you're guaranteed good food every time."}
{"text":"This place has been here for decades. If you need ambiance and hipster approved surroundings, go elsewhere. If you simply want nice people to make you a good meal for a fare price, you can't go wrong here. The breakfast is fast and like grandma used to make."}
{"text":"one of my favorite dive bars in the area. free foosball, cheap drinks, and (the best part) it's usually empty. the bartenders have always been really nice, too. also, since it IS a local dive, you never know what you're going to see there.

the food is pretty good, too!"}
