{"text":"The first time I walked into the Farmer's Market, I was blown away and shook...SHOOK to the core. I marched around the food court area over and over again trying to decide where I'm going to spend the $20 bill cradled in my hand, which was marinated in hunger-sweats.   Finally I settled on Simply Good Eats on the premise that because I haven't eaten anything that day, I needed some sort of breakfast. Oddly enough I settled for Salmon Burger and an order of Poutine. But I also made a mistake of ordering with my stomach and got a slice of pizza as well. My sweaty $20 bill turned into a handful of change :S.  The pizza was ready to go but because it would take a while for them to prepare the Salmon burger and Poutine, they gave me a helium balloon for a table marker (?). It didn't take too long, at least it seemed like as I was working into the slice of pizza. When the burger and Poutine had arrived, I was immediately reminded of how much food I had ordered...again. The Salmon burger was very delicious and seemed fresh, it didn't have that suspicious pre-frozen tinge to it. The Poutine was ok, but I wouldn't suggest it on a Poutine crawl.  I'd like to come back and try this place again, they did order a bevy of breakfast and diner items. I just have to remember and discipline myself next time that I can always come back, that this isn't the last day on earth so I don't have to order everything on the menu..."}
{"text":"Lunchtime. Hungry. Lines at a few stalls in the Calgary Farmers Market... but not at Simply Good Eats. It seems to be a common conclusion that any place without a lineup must have something wrong with it. Stop thinking that way. You end up waiting in long line ups and often miss food that will hit the spot otherwise. Simply Good Eats is simply... well, good!   Burgers, sandwiches, waffles... it's a varied menu with a little something for everyone. I ordered a mushroom burger and a vitamin water. The burger was one of the daily lunch specials and came with fries. With the vitamin water, it was all less than $10 and made fresh to order.   The table numbers are rather ingenious too. To avoid a slough of people waiting around the counter, Simply Good Eats has helium balloons attached to a little post, each with a number on it. You take your seat and put the balloon on the counter. When it's ready, it's brought out to you... the floating balloon makes you easy to spot!"}
{"text":"Review: dessert.  it's always a good time shopping at the Calgary farmers market with all the different trinkets and such the locals are offering. Took a break for lunch and decided to try the dessert waffles here.  Food: I ordered the strawberry waffle and it is simply delicious. The ingredients are fresh and the waffle was fluffy. Everything was correctly portioned and balanced well. Although it was a simple dish, they sure executed it well here. I will return to try their savory dishes.  Value: fairly good price for the portions you are getting. Best to share the dessert with a group, unless you are me."}
