{"text":"Worst food I have ever ordered in my life we ordered through grub hub 2 gyros, 2 fries and 2 sodas.
First off it took almost 2hours for the food to be delivered.
Second when it got here the fries were warm but raw; honestly, it was as if they drenched frozen fries in oil then microwaved them. (I tried to cook them to at least make them edible but nothing worked) 
Third the gyro meat was burnt, dry and tasteless.
Lastly the tazaziki sauce was watery and bland.

On the positive side they got our order correct right down to the special instructions such as no tomatoes and extra sauce. They even threw in a free extra soda for taking so long.

All in all I will never order from this restaurant again!!!!"}
{"text":"Great middle eastern food in a nice atmosphere.  Warm and friendly staff.  Tried the kebab sandwich with lentil soup. Loved both. The tahina and date dessert was also delicious.  Surprisingly good bar for middle eastern place.

I'd go back if I were local."}
{"text":"Absolutely delicious! I always try to eat somewhere new when I come to Phoenix and you cannot go wrong here.  I ordered  gyro, baba ghanouj and hummus with meat and was very satisfied.  The price is right too! I will definitely eat here again."}
{"text":"Food is very authentic and the portions are huge. The bread is not any store-bought stuff but baked  fresh. So excellent place if you are tired of westernized middle eastern places. The Sunday's buffet is worth every bit of the 15 bucks. They serve everything on the menu and more. 

On the bad side, service is just pure abysmal. It may be the language barrier or lack of knowledge on customer service, the service is just sad. Waitress takes order after 10 min and then comes back after 10 min to ask you what you ordered and then comes back with your food and ask you if you ordered that. It's that bad. During the Sunday's buffet, the place is a complete zoo. Hardly any place to sit and the place is a complete chaos. 

Suggestions: Take  customer care very very seriously. In America, customer care can make or break a restaurant. It's ok not being able to speak English fluently as long as there is some love and care in the food and service. People appreciate authentic good and this place has it. However, the service can totally keep this place transitioning from a very average eatery to an nice authentic place to eat."}
{"text":"Sinbads restaurant has amazing food everything is always fresh from the little side salads to the kabobs. They are the only place that make there bread from a tandoori oven right in front of you, best part is you can watch them make the bread broom scratch it's always fun to watch. The place is always clean and and comfortable. If your looking to try middle eastern foods for the first time or just looking for a great place to eat check this place out you and you won't regret it"}
{"text":"I love this place! Went with the hubby once, took the kids another and had dinner with the brother. Everyone loved it. Just recently ordered online and picked it up and that makes it even better! Check it out and try anything....everything is fantastic =)"}
{"text":"Amazing food and fantastic service! Definitely worth a visit when in the west valley!"}
{"text":"I would greatly appreciate it if the restaurant contacted the customers if they are going to be later than usual. I placed an order at 8:05pm an hour later they tell me the order is on its way. At 10:00 pm I reach out again and they say there was a mistake in the kitchen. And they would be delivering in another 40 min. I opted to wait, when I wanted an ETA, they told me the order had been canceled. That is just not right. I dont think i will he ordering from here. 

On the other hand I was excited to have this food because of the good reviews, but this just really disappoints me."}
{"text":"First time visiting this place and definitely the last. The food was alright. Service was bad. The one thing that irritated me the most was seeing the waitress wiping the utensils with the same cloth she wiped the table with. Disgusting! If you chose to be lazy/unsanitary, at least provide the customer with the choice of plastic utensils. Hence the one star. On a positive note, the bread was delicious."}
{"text":"The food was wonderful; could have had better service; never offered drinks or took our order. I'm assuming their system is their own; order upfront and wait at a booth for your food.  I have had wonderful middle eastern food and that was in Alex, Egypt. Their service is just like ours and more; we sit and server will come to us, the norm for places that are called resturant."}
{"text":"They did not have my order that i ordered online before hand, the wait time was LONG. I got two gyros and a steak sandwich. The steak sandwich was SUPER greasy after a few bites i was unable to continue. The gryos were decent, ^^ second star is for the gryos the first is for the decent prices. However I wont be returning it was pretty gross. I ended up throwing 80% of it away. I also order dolmas and they were good."}
{"text":"Awesome homemade bread. My falafal sandwich was huge and amazing. Best middle eastern food in Phoenix I've had so far."}
{"text":"My bf is from Iraq so we frequent this place often. Shawrama is my favorite and hummus of course. The food is always amazing here. Sometimes the people could be a little nicer but I think that's the sensitive american in me!"}
{"text":"Got some food delivered from here. Homemade bread, hummus and cucumber yogurt dip were all great. However, the chicken shwarma I got was made up of very dry, small pieces and did not have a lot of flavor. Menu also said entree came with lentil soup and two salads, which I did not receive. Instead it came with a side of hummus and some sort of eggplant salad, and since I had already ordered hummus as an appetizer I really didn't need another side of it. I also ordered a piece of baklava for dessert which was maybe 2 by 3 inches in size. After reading the other reviews I was excited to try this place.  I ended up being  really disappointed in my meal."}
{"text":"I've been here a few times and have liked everything I've tried.  The pita is amazing. You can watch it bake right in front of you. The gyros are gigantic (you can get 2/$7) and are very high quality with fresh vegetables and generous portions of meat on that delicious pita. The meat plates are really good too. The Shawarma is tasty,  the soup it comes with is realty good too. The staff are kind and helpful, but the language barrier does make interacting a little difficult. I had some questions that couldn't be addressed because of this. I definitely know where I'll be Sunday for that buffet! Great place, give it a whirl!"}
{"text":"I've been going to this place for years, and the food is awesome! the place isn't fancy and you have to serve your own drink but what the heck.... i always go with the sinbads combo, and every time it hits the spot!  the pitas and the bread is fresh made, brought hot to your table....   the owners are very nice its a family owned business"}
{"text":"Tried Sinbad's for a second time today to give it another shot because I really didn't want to leave a bad review based only on our first experience. The first time we went there it seemed like it took forever to get our food; but we chalked it up to an isolated incident and thought perhaps it was just an off day for them. We went back today (it's been about 6 months since the first visit) and ordered two Gyros and one piece of Baklava TO GO. When we arrived, we were the only customers in the restaurant. We waited and waited and waited some more. In the meantime, we decided to take a seat at a nearby table while we dripped sweat and continued to wait. Everything on that table from the napkin dispenser to the salt and pepper shakers looked like they were breeding grounds for some horrible sickness. I looked around to find the other tables looked very much the same -- no cleaning standards here at all. Twenty-five minutes passed with no food in sight, but we did see about 6 different workers doing all sorts of tasks. At the 26 minute mark, we decided to leave without our food - the place was not clean and our food was not even close to being ready. It amazed me that if they were going to make us wait, there was no offer to sit, no offer of water in the overly warm dining room and no apology for taking so long after say, 15 minutes to reassure us, the food was indeed on its way. Nope! Just wait it out and we really don't care what you think, how unclean our place is, how hungry you are, how long this is taking or how hot it is in here. So, for you folks who are thinking of ordering it for delivery, please know this is NOT cleanest place so you are taking your chances with whatever is eventually brought to you. For those of you considering dining in, I sincerely hope you get your food faster than we did (not) today. And I hope they start incorporating some cleaning standards for the dining room and the tables. The only time we were acknowledged after placing our order was after we left. As we were getting into our car to leave, one of the workers dashed out as if he was surprised and angry we were leaving. When my brother told him it was just taking too long, he made an incredibly frightening arm gesture towards us. Yeah, be careful with this one, folks. I know my brother and I will never ever go back. S l o w, unsanitary AND scary........a really bad combination."}
{"text":"Worst customer service ever!!! So rude! The lady in charge with the red hair was rude!!! I would never go back! Food was cold as well"}
{"text":"Low nutrient density, lots of carbs, low quality cut lamb chop too dry, kofta kabab sandwich burnt and too much lamb fat inside the mix, chicken is just like supermarket roti chicken yet at slightly below restaurant prices, the lowest quality food you can find for a little cheaper than an average restaurant. Plating and food presentation is nice though, like a higher middle tier restaurant. The scallion decoration was nice touch."}
{"text":"No nonsense Middle Eastern food. Creamy hummus, house made bread, olive plate, and rice. All delicious! Way more food than I could eat. Service was acceptable, but not particularly fast. Watching the baker cranking out bread at quick place was fun as well.

N*joy..."}
{"text":"I'm so bummed you guys don't deliver anymore. I guess I'll see you when I'm in your neck of the woods :( \Figure out your delivery please!"}
{"text":"Id give it 5 stars just for the bread. It was amazing!!! The food was pretty good. Our server was a young girl who looked like she did not want to be there. She gave short answers and wasnt friendly. The guy however was great and kept asking if we needed anything. Very hospitable. I would go back just for the bread."}
{"text":"Food is good, but placed an order on grubhub and  delivery time was almost 2 hours. I had to call the restaurant several times and when the delivery driver showed up he used the excuse that he had been pulled over. I ordered the family combo meal and was shorted on 2 soups. The portion for the salad, pickles, hummus, and yogurt was very small. I felt like I was probably shorted on that as well. Food is decent but can get better service without being shorted on food from other locations. Disappointed."}
{"text":"My husband went there for lunch today. He ordered two gyros, they took quite a long time to make them so he figured it'd be really fresh. Nope, the meat was old, tough and burnt. He called to let them know and instead is apologizing, they hung up on him. First, and last time we'll ever get food from there."}
{"text":"Talk about bang for your buck! I've now been to Sinbad's twice, and both times I left stuffed to the gills, and eagerly awaiting my next visit, and thinking about what I'll order when I return. 

The menu has all the standard Middle Eastern staples; the clientele in my two visits has been almost exclusively Arabic-speaking; the location is \"hole-in-the-wall.\" The entrees are big enough to share, and are served with free appetizers of hummus, Arabic pickles, and jajeek.

All in all, worth the drive to the West side."}
{"text":"Most authentic restaurant around! The bread alone here is worth a visit! Everything has wonderful flavor I recommend the grape leaves and hummus!"}
{"text":"Wow. Excellent food! Bread made in front if you. Portions the size of Texas! Come hungry! Prices are great too!"}
{"text":"Sinbad's was clean. The bread was fresh.. yet I have had better falafels...My Husband says his shawarma meat was very dry...
I don't believe we will be going back."}
{"text":"I'm no middle eastern food connoisseur but enjoyed food here by recommendation. 

The food: My friend picked out all of our food. What I loved was the soup (I think it was lentil) and flatbread, this dessert dish they served with a simple syrup and seemed similar to the phyllo dough they use to make baklawa without the nuts etc and a side of i think mascarpone or maybe it was just whip cream. It was good nonetheless. We also had some vegetable egg dish and a chicken shawarma which I wasn't a fan of either but then again I wasn't hungry when we came here. 

The cost: 2 entrees, a dessert, and soup with flatbread was so filling just under $32. 

The service: we ordered at the counter and paid at the counter. We were given recommendations and were thanked etc. The little older lady serving the food was adorable. She didn't speak English but tried her best to show us how to eat the food. 

The atmosphere: again not a hipster joint but it's really about the food. There is a bread making corner with a view through window where they made the flatbread and shawarma etc. the tables were clean and it didn't smell of anything unusual."}
{"text":"The food is the right price, tasty and authentic. However the food take a little while to get out to you so expect to wait  at least 10 min for a gyro. 

This makes it a so so lunch spot if you are on your lunch break, but a great place to go if you are having lunch with a friend."}
{"text":"New building is incredible, significantly improved. food is still amazing, it is now a place I would take people to, and not feel odd about how dirty, hot and cramped it is.

A real gem now!"}
{"text":"One star because negative stars is not an option. I can't begin to explain the level of indifference and lack of customer service I experienced at this place. It started with them letting us know that they are out of the complimentary lentil soup and I asked if they can provide us with hummus plates which they agreed to so I didn't mind and then it all went downhill. The following are the issues we had during our experience here: 
1. They gave us hummus with no bread to eat it with and we didn't even get the opportunity to ask them for it  
2. We ordered 4 burgers, which were mediocre at best and that's just me being nice. And one did not have a burger bun but rather was on pita bread and when asked he had the audacity to ask us what is wrong with it. 
3. Once they brought the food they did not bring any utensils and after 10 mins of not being approached we just walked up and got our own utensils 
4. The steak sauce on the table expired months ago. 
5. The food was awful, borderline inedible 
6. They never brought our drinks out after repeatedly being asked and we ultimately just cancelled our drink order 
7. Rather than offering to give us a discount for the unacceptable service they seemed dumbfounded when I refused to pay the full amount. 

Being in a business where customer service is your first and utmost priority, I'm surprised that they had the amount of business they did and are not out of business. When a customer walks up to you and tells you the food was horrible and he can't not eat it and your response is yea I know, you know you are in the wrong business. If you are in Phoenix and trying to find a place to eat and this place is your only option do yourself a favor and go to sleep hungry."}
{"text":"This is the favorite of my family and friends for eating economically. These people are working long hours to bring some great etnic cuisine to a not so great neighborhood. Thanks Sinbad and the Samoon and Kobbos are the greatest."}
{"text":"This place was recommended by a colleague and I was in the area at a meeting. Decided to go in and take carry out.  Wow!  2 gyros sandwiches for $5 and 2 whole rotisserie chickens for $11.99!  Then you can get a big container of humice for only $3.99 and the BEST homemade pita I have EVER had and you can watch them make it through a window!  Check this place out! People were coming in and buying big stacks of the homemade pita to take home and I can see why! The people were really nice and proud of their food. I will be frequenting this great little new gem on Glendale Ave!"}
{"text":"Had lunch there recently and will NEVER be back.  The guy who took my order was rude and aloof, as if he really wasn't paying attention to my order.  And guess what?  He fucked up my order!  Then he acted like I was lying.  With a huge amount of attitude I was eventually brought the right order...and overcharged for it!  Don't patronize this shit box.  It's dirty, they play freaky middle eastern death music, and they don't seem to care for anyone who isn't one of 'them'.  I believe it's an unsafe environment in a very sketchy, low-budget neighborhood.  STAY AWAY and spare yourself any aggravation whatsoever."}
{"text":"Well, I am sitting in this restaurant 46 minutes after placing my take out order of 1 dinner, 2 soups, rice and 2 pitas!  I have eaten here and the food is good enough but never again!  47 minutes now.  Place is not busy at all.  Ridiculous!  If you can't wait forever I would suggest another restaurant...

Update:  finally received our take out after 55 minutes.  They shorted us one soup, one hummus, and no bread!  I brought this up and they begrudgingly completed the order.  Got home and the #12 steak that I ordered was over cooked so much that it was barely edible.  Black all over.

I believe that they could really care less.  So many people coming in for bread that one order doesn't matter to them.  Shame......."}
{"text":"Well, we finally got in there last week to check out the expanded location. The food was extremely good, as always. 

As a vegetarian, there's not a ton of choices for me in terms of entrées. They do have a wonderful falafel. Mainly, however, I go there for the appetizers.  And I'm just a huge fan of their breads. 

Anyway, it's no longer a hole in the wall. The dining area is delightful. And, I could tell that the folks working there had a little extra bounce in their step as a result.

It's the perfect place to stop by on your way home to pick up a falafel sandwich or a gyro. or just grab a package of their bread. But, once you walk in and see the place, you will want to stay and have dinner.

I have yet to try their breakfast, and I will update my review once I have."}
{"text":"I meant to write this review a while ago but life happened! This place is legit, don't come if you are in a hurry, it sometimes takes a little while but it's well worth the wait. I wanted to get the kunafa but they were out of it so they gave me free baklava instead. I couldn't believe the amount of food that you gave me for the price, the bags were actually heavy. The soup was amazing, and the bread was so soft and delicious and was perfect for my Gyros and also the hummus. It also came with rice which was super flavorful and buttery. Overall this place is awesome if you are looking for some great Middle Eastern food! Also the owner is very nice and he goes out of his way to talk to people and make them comfortable"}
{"text":"Found this place on 24eat. Com and couldn't wait to try it.  It said delivery could take up to an hour so I sat back and waited.  When an hour came and went I tried to call the restaurant and got busy signals. When I looked up the business hours it said it was closed. After about 10 more minutes I drove to Jack in the box and got a munchy meal. When I got back, there was a really mad guy out side my apartment. It was an employee, with the recipe in one hand,  yet no food in his hands!!  I couldn't believe it.  But at that point I had food and not going to take the order. Almost 2 hours :("}
{"text":"Omg! Don't go here! 
Awful experience! This was my 2nd & last time coming to this restaurant. Last time was ok, but this time I ordered through yelp. After being ignored by the young girl behind the counter, my food was left to sit for 10+ mins. Then I was handed the wrong food 3x. The first time I just assumed it was right & walked out the door. I was almost to my car before one of the employees ran up to me to ask me for proof of what I ordered, vs what was in the bag. After realizing that they gave me the wrong order he ran back in with it. Then he handed me another bag, once again I figured small mistake no big. But no, this time he ran up to me again claiming that once again he gave me the wrong food. So ok, a bit annoyed but what ever. After all this he hands me a bag with like 10 items in it. Not my order. I brought up the fact that they gave me the wrong food for the last time a man whom I had just seen touching raw meat, without washing his hands--opened the foil on all the food with ungloved hands & yelled, insisting that we had the right food. I took it & left, (since I had already paid via the Yelp app)... I threw it out in nearest trash can & plan on bringing up the exp. w/ my bank."}
{"text":"Let's start with food is awesome at this place and very affordable.  The only kind of a problem is the service.  They don't seem too friendly and it's hard to put order if u don't speak their language.  Also they take a bit too long to serve u even when place is empty.  But food it's definitely worth the wait."}
{"text":"2 Gyros for $5. Free soup, free bread!! I love this place. The meal portions are so generous!! The workers are so nice. Downside in a not so nice area and it has no air conditioner"}
{"text":"We got food to go there on Christmas day. First off as everyone knows there are not many options on Christmas day, so thank you for being open. The down side is that the food is not very good. There was simply very little flavor on anything that we ordered.  The cost was high, so there is just very little chance that I will ever go back."}
{"text":"The bread and hummus is good! Everything comes in larger portions which is a plus. One thing I noticed was that there was a ad for % off. But the rep there said that they didn't offer it, even though I could clearly see it. Anyways again loved the bread and hummus."}
{"text":"I'm really surprised with how low of ratings this place got! Maybe it has something to do with me always getting it delivered?

Sinbad's is my GO TO when ordering dinner. I get the same thing: Falafel with hummus instead of olives. It ends up being $11. Comes with delicious bread. Some of the best hummus, falafel and pita that I've ever tried!

I always ubereats or Postmates this place, I've never been inside so I cannot speak for what the place looks like.

All in all really good- the only \"thing\" that I don't like is it's rarely consistent. Something is always different whether it is the packaging, or the layout. The bread recently changed and while it's good, it's nothing like their old bread. Sometimes I would get hummus with my falafels and other times I would get olives (that's why I started ordering falafels with hummus instead of olives, specifically). But these are minor things that I overlook!"}
{"text":"Food's decent - staff is generally friendly. The place is a little rough by US standards. Actually, it was a lot like places I went in the middle east in a number of ways. If you're squeamish about sparkling walls and counters, this probably isn't the place for you. If you're willing to overlook a bit to have some traditional middle east food, go for it - you should like it."}
{"text":"Customer service is not the best. You're on your own when you walk in. Just look for the cashier and place your order there. They handed a customer about 10 round breads and a plastic bag. I think I'll drive over to Arby's for my gyros next time."}
{"text":"I have ate here a couple times now and both times waited forever on food even with very few customers in the building.  Also I had a different waitress each time but they acted the exact same way like as if they don't even want to be there.  The food isn't worth the wait either it's not bad but its definitely not worth waiting an hour and a half for."}
{"text":"It's Ramadan and I am surprised on the how cold the food was even though 30 mins after fatoor food shouldn't be cold. Keep the food heated. On other days when it's not Ramadan the service is horrible the food is good but you'll have to pay the price. I don't make bad reviews like this but after today I had my fatoor I was really upset because I was fasting all day and tired I wanted a hot plate of food but I get there half the food is gone and just cold and the service was 0/10"}
{"text":"If you are looking for a delicious place to eat Middle Eastern food this is it. The lentil soup is what I started off with and it was extravagant. Not too thick and not too water. The tabouleh salad is delicious too. I ordered the tekieh it doesn't taste like lamb but like beef instead. It is so soft and good. The service was wonderful. Eva is a great waitress and checked on us at the perfect time. Love this place and plan to come back"}
{"text":"I use this restaurant for Mediterranean/Arab themed dinners for groups of about 15.  We get 3 of the Sinbad's combos as takeout and it comes to about $100 and usually feeds us pretty well.  I'm not a big fan of their grape leaves, and that's usually a draw for me.  In general, the sides aren't that great, but the meat is good and the bread is fresh and always excellent.  
With the big mosque nearby, there's a lot of good options in this neighborhood, but Sinbad's is probably my favorite."}
{"text":"Excellent food, great service and very good prices. So glad we came here for lunch. It was so worth the wait to eat here. Ordered half a chicken with rice and the meat shawarma plate. Each dish comes with a free soup, 2 appetizers and 2 bread. The half chicken also came with a choice of (marag) side. The portions are very generous. Everything was delicious and fresh. The bread was baked right in front if us. Wish it wasn't too far away from home otherwise I would've been here every day! Definitely coming back any time I'm at this side of town! Strongly recommended."}
{"text":"My favorite place ever. 
I love the fact they make fresh bread it's awesome reminds me of back home. Their food is amazing their hummus is to die for .....  
I love sinbad I got all my work hooked on their food. So simple I just call them and place my order 20m not even it's so ready come on for a whole dental office their fast. I always want to thank Zman the cook. And hayder owner son. Top"}
{"text":"Great food! Staff was also very nice and food arrived very quickly for my 3 colleagues & me. I got the shish kabob (#1) on the menu. It came with soup,  hummus, and tabouleh. The best was the soft fresh bread made in their bread oven which you can see from the dining area. I would come back here every day!"}
{"text":"Being born and raised in Iraq I can for sure say this is the best Iraqi resturant in the Desert. The food is so authentic that makes me feel I am back in my hometown. I gave it 4 stars only because their service is far from the best. People who work there are not the nicest you will ever see, orders are often delayed and they even mixed up my order twice."}
{"text":"I was looking for something different and came across them on Grub Hub. I ordered through the Grub Hub app for delivery and was VERY PLEASED! When I received my order I was so pleased that everyone who came into the office, I offered to try a bite. I ordered the Shawrma Chicken meal which came with 2 sides (I choose hummus and yogurt w/cucumber), soup, and bread (pita or Arabic bread). All this for $12! And let me tell you...it was enough to share, and I still had enough for dinner. 

  I have since ordered many more times and have even gone into the restaurant to dine in and have NEVER been disappointed with anything I have ordered. If you want great tasting Middle Eastern food, try this place out. 

Oh! And their stuffed grape leaves and baklava are to die for!

HAPPY EATING!"}
{"text":"Orded 14a family dinner. It was good. I didn't like the humus and other stuff on that tray. But that is my taste. The meat is good big round bread is good. I wish I had the taste for it but I would recommend this place."}
{"text":"Middle Eastern bakery/Deli and it was the bomb. Had lamb shank and it came with everything they had in the place I think."}
{"text":"We been wanting to try this place since we drive by it all the time .Omg!!! This place is great ! The food is absolutely delicious freshly prepared and the bread is amazing ! It's atmosphere is very clean ! The staff very friendly and appear to be happy as they work .You can see them bake the bread in view with their open oven ! 
You will not be disappointed we will r"}
{"text":"Good food, great prices, and absolutely wonderful fresh bread! 

Very friendly staff! 

Definitely will return whenever we are in the Phoenix area!"}
{"text":"I felt like I was teleported back to the Middle East for a bit.

When you walk into Sinbad's it doesn't take a Middle-Easterner to realize that this is an authentic, family-run joint.  It smells good and they are making fresh bread even in the midst of lunch time.  

I ordered the special: two Gyro's for $5.  Trust me, I know Gyro's are Greek (typically referred to as Shawarma's in Arabic and made with Arabic pita's instead of Greek ones), but that's how they advertised and made them.  However, they had plenty of options available in Arabic jargon and fresh pitas for sale too.  The interior is very basic, with simple tables next to an open kitchen and Arabic televison playing in the background.  

The Gyro itself was pretty good.  It tasted fresh and came with plenty of fixings, but it was missing a bit more meat.  The service was a bit slow (but I lend that to the authenticity) and very cordial.  

I hope that this will not be my last time here and I put my stamp of approval on Sinbad's for the time being!"}
{"text":"I've ordered some takeout and they were very good about getting it correct and accommodating my modifications.  The area is not the greatest.  Most of the people don't speak English, which doesn't matter, because everyone understands the menu and money.  Simple.  The bread is what makes this place a very good choice of cuisine as it's made there in front and you're able to see how they prepare foods.  Big portions and the hummus + cucumber spread are a must."}
{"text":"Delivery took way too long being that it's right down the street, none the less the food was great!!!! 2nd time around we picked up the food parking was horrible. But again the food was very good, fresh bread, tender meat, and the salad and baklava are divine!! Either way we will eat here again."}
{"text":"I totally feel like Yelp let us down on this one. We've eaten LOTS of mediterranean food, and this wasn't anywhere close to the best. To the point that I was wondering if we were in the right place. The service was super friendly, almost to the point of being overbearing, and the 3 of us ordered about half the menu. Unfortunately, I liked maybe 1 thing. The schwarma with rice was insanely dry and bland, the tabbouleh tasted like it was mostly onions, the pickles had a really odd flavor (probably they were fermented), the hummus needed flavor, etc. The bread was good, but bland. Seriously, Mediterranean food is all about flavor, and this food had none.
That and the creepy movies playing on the tv in the back of the restaurant were enough to make me wonder what all of the other reviews are thinking. Seriously, go to Pita Kitchen in Avondale."}
{"text":"Horrible experience! My parents took me there last weekend, every single dish was bland, service was terrible, 3 of our orders were wrong, the fries tasted like McDonald's, their buffet selection: all the food was cold, none of the food was placed over a hot plate like most buffets, AND it's expensive, where the hell is the health inspector! Only their bread was good cause they take it out fresh from the oven.
I don't understand all the business they had that day on Sunday all 5 us had a horrible experience... 

For our Arabic readers."}
{"text":"Food is very good
Bread is wow
Kabab is wow 
Falafel is very good 
Shaorma is good
Just the furniture need to be changed.  
But food is super good"}
{"text":"Tip: order online for takeout for the cheapest prices.
If you call the order in its more expensive and if you dine it costs even more. 

Food is good for the price. The beef and chicken kabob are the best. The Chicken shawarma can be dry and the beef lacks seasoning. The lentil soup, hummus and all tge sides are delicious. The bread is fresh amd so good."}
{"text":"The food is delicious! I got the hummus and meat with two breads!!!! The best hummus I've tried and the meat was well marinated! Ohhh my the breads are made their sooo warm and soft!!! Try it out!"}
{"text":"Being middle eastern I'm pretty picky with my food.  This spot hits the spot. You get a lot of food and the fresh bread they make is something you don't want to miss out on.

I'm not a fan of their hummus, or other condiments that the give with the sinbad combo. Lentil soup is good, as are he kabobs and rice. I'd pass on the shawarma.

Give it a shot!"}
{"text":"I ordered a a full sheet of baklava for an event I was having yesterday!. They were ready exactly at the time I needed (although I was late picking them up...lol) and they were simply DELICIOUS...Our guest devoured them ..I think I am coming back on Sunday for the buffet after church !.............Thanks Sinbad's for helping my event a success!"}
{"text":"Went there on purpose because they said they had a bakery and they did

I bought a chicken shawarma sandwich as well but they put too many pickled vegetables in it which completely over ran the taste of the chicken

The bread was just okay the rolls were flat and didn't seem like they had been allowed to rise long enough"}
{"text":"I went there today for lunch with a coworker, not sure of what we would be walking into.  The strip mall is pretty sketchy and the seating is extremely limited. It took a few minutes to be served (which was difficult because we were hungry and they had great smells coming from the kitchen), and we had some communication issues, but the staff was very friendly. I ordered the gyros, and was provided with free hummus, bread, pickled beets/cabbage, and a cucumber dressing (like tzatziki?) all of which were extremely tasty.  My gyro was extremely flavorful, and served on a warm pita (not to mention, super cheap!).  I will definitely be back."}
{"text":"Nearly a buffet of free appetizers (tabbouleh, hummus, soup, fresh bread, tzatziki) come with any of their kabobs and $5 for two gyros which are delicious as they are large.  The three of us walked away with more food than we ate and spent $25 for pretty much a four course meal... Not to mention it was all completely delicious!  Don't let its hole-in-the wall looks fool you!  If you like greek/middle eastern food you are doing yourself a disservice by not eating here."}
{"text":"The bread is amazing! I like taking out, and we order the hummus with meat and extra bread. Always delicious! It seems family friendly and the service was polite and prompt. 

Update: We have ordered from Sinbad's using GrubHub twice, both times my order has been incorrectly delivered I'm not sure if it's an issue with the restaurant or with GrubHub. The food is delicious but if you want it served correctly go to the restaurant."}
{"text":"The food is good and authentic and since they are a locally and family owned place I think they deserve four stars. 
If you go there, don't expect a nice dine in experience. The location is not one of the best in Phoenix and the place is very small, hot, and not the best looking. I have been there twice now and both times we decided to take out. Prices are very reasonable and the food is made fresh."}
{"text":"This place is awesome and very consistent with their quality! I'm surprised at the negative reviews because I've never had to wait very long and received pretty good customer service. My husband knows the family who owns it, and they are great people- refugees from Iraq. Plus, lately I've noticed anywhere we go out to eat since January, either the portions are much smaller than before or quality has gone down (maybe because of the increased minimum employee wages?) Not here! We even have leftovers to take home with us!"}
{"text":"So yummy! We ordered the family meal and loved it. Loooooots of yummy, flavorful food. Next time I'll remember to ask for yogurt. Delivery was timely - we live five miles away and it took about 45 minutes. Definitely recommend."}
{"text":"Great restaurant food is always fresh Their bread is the best always ready and hot. I always get the Sinbad Combo Platter enough food for 2-3"}
{"text":"This place is all right. We were in the neighborhood and I was craving their bread so we stopped in the restaurant. We went to the counter to order to get two bags and the lady said she could only do one ? Her coworker said there's lots of bread in the window so we could get two. We also wanted some kanafa and inquired about the price and it seemed expensive per piece but cheaper by the pound ?? Once again, seems like mixed communication signals. Anyways, we finish paying for our bread and she brings them out to us with the bags and sets them on the table and we bagged them ourselves ??? 

Despite the customer service or lack of it, their large loaves of bread is one of my favorites. It's soft and warm and even has a bit of chew to it. Great for wraps and just eating plain. The kanafa was a different shape than I'm used to, in rolls rather than squares and it was fine."}
{"text":"If you don't know this about Phoenix, I'll tell you: The west valley has the most authentic ethnic food in the state. Beautiful  food from beautiful people from all over the world. The digs are usually not fancy, and that's part of the charm.

The food here is a great example of a west valley gem. It's amazing, truly amazing. The fresh bread is warm and the hummus so creamy. The lamb, chicken, and OMG the rice! Ordering for delivery is easy, quick, and ridiculously hot, and we live in Midtown. Impressive. I am soooo happy we were lucky enough to discover this gem. They def deserve a 5 star rating on Yelp."}
{"text":"I love bread. I can't imagine being gluten free. I simply cannot. I hear you get used to it eventually, but I'd cry myself to sleep every night if I couldn't eat fresh bread. 

Walking into Sinbad's, I looked to my right to see a guy pulling paddle after paddle of fresh bread out of the oven. The smell was heavenly. I suddenly felt ravenous.

After perusing the menu and being notified that they weren't going to have dolmades available until tomorrow, we decided on the #5 entree, which is shawarma beef, soup, bread, and two appetizers (we chose eggplant with peppers and hummus). 

Okay I need to take a minute. Remembering this meal is making my mouth water. 

The soup was tasty, but man.... when our bowtie'd server brought out the basket of still-warm bread, I felt so happy. I pulled apart that soft bread to make what was going to be one epic sandwich. Popped open the bread, added in the hummus, layered in the eggplant with peppers, topped it with shawarma, cucumbers, tomatoes, and onion and... all I can say is, Yes. Do this. 

Over the course of our meal, I enjoyed watching the door. Many people coming in and getting to go orders on a Saturday. People grabbing a huge bag of the bread to bring home to their families. Everyone was in a great mood. And why wouldn't they be? This stuff is great. I'm certainly looking forward to coming back on a day when they've got dolmades available."}
{"text":"Super amazing food and reasonably priced! The food here is authentic and full of flavor! The portions are huge and the people nice! Falafel and humus here are the real deal!"}
{"text":"Stopped here for lunch this week. It had been awhile. The food is just as good as I remember and now they have air conditioning ! A big portable AC unit setup at the back near the restrooms blowing cold air towards the dining area. It really makes a difference. This place is still the definition of a hole in the wall, but the food is so good, I promise."}
{"text":"My order took over an hour to get here and it was cold when it did get here. The driver tried to tell me he didn't have change and thought I should just give him a $15 tip when I told him he could take the good back he \"suddenly\" had change. Two of the containers were crushed and food everywhere in the bag. The service and good was terrible. I would not recommend this restaurant to anyone. When I tried to call the restaurant to talk to the manager I was told he was too busy. Never again"}
{"text":"While visiting Phoenix we arrived at Sinbads with a friend from the middle East who was excited to share food from his culture with us as where we live there are few options available. He ordered in his dialect from the waitress, a beautiful smiling middle aged woman. We were served a delicious soup and a large variety of appetizers, 2 full size which we ordered when we sat down, hummus with meat, which was so delicious. And Falafel, (I'm not sure on all the spelling of these), then we had small portions of Baba Ghanouj, tabbouleh, arabic pickles, an olive salad, and a form of potato salad as the included appetizers with our meals and Amazing fresh bread. I was excited to try to cucumbers with yogurt but he gave her the choice of what appetizers to bring and that wasn't one of the choices. The young teenage waitress seemed a little like a typical teenager these days, a little impatient and did not give the best customer service, but she gave much better service than we has the evening prior at a way more expensive restaurant downtown. . Our friend ordered the lamb shank, it was delicious and big, I had the meat keybab, which was ok...bland, I'd try something different next time. We had also ordered a Chicken dish, but after having all the appetizers we knew we were going to be full  So when they said it was going to be awhile we canceled it as we had more than plenty of food. we couldnt eat it all, and couldn't take with as we were staying in a motel. I then had a really good dessert, I'm allergic to Pecans and Walnuts so the little waitress did double check and they use Pistachios, which is good to know. The food was good, large quantity and reasonably priced. I cant wait to visit Phoenix again so i can go back to Sinbads."}
{"text":"The tiki sauce made this meal amazing. The hummus was extremely creamy. Taste like they didn't use enough garbanzo beans to make the hummus. It was a skimpy portion. The pita was ok. The chicken was extremely dry and tasteless. The guy helping fill up the box was rude as well as the cashier. Had this at the Arab fest. For 12 spent for this meal should come with a drink."}
{"text":"Delivery service was just terrible. It took them 75 minutes (they quoted 45-60) to get the food to me, and it was barely warm. When the driver showed up I noticed that one of the food containers was on its side. Opening it up revealed a gloppy mess of falafel and hummus. Really not great. The beef shwarma had to be heated up, as did the pita. Overall, this was a frustrating experience and a complete disappointment. Maybe things are better if you go into their restaurant but I won't be following up."}
{"text":"Another trip to Glendale to test drive a car for my friend when we got hungry, drive by this middle eastern place that had 4.5 stars on yelp. I'm not sure what the raves are all about. I'm being generous with my 1 stars: 1 star for the fresh bread, 2nd star for the soup. 0.5 stars for the appetizers ( uneven hummus, ok baba ghanouj, yogurt dip, some eggplant salad as they were out of fattoush & tabbouleh). These appetizers come with the $30 combo chicken & meat plate served on a bed of rice. 0 stars for the olive oil ( looks mixed  with other oils). -2 stars ( that's negative 2) for the dry over cooked unseasoned meat & chicken. This place does not represent even a semi decent middle eastern food. Avoid."}
{"text":"It was a (satisfactory) surprised! It's total locally owned and operated...food were really good and inexpensive. This is not a typical daily (nor weekly nor monthly) food that I would try, but the one time I did - it was really a good experience (food and ambiance and service). So, I would come back here soon...in a few months."}
{"text":"This place is great. You will probably not find better pita bread anywhere. The gyro is fantastic! I have been here a few times and that is the only thing iv'e had. I recommend getting the combo with 2 gyros instead of gyros and fries. You can see where they bake the bread! They also have a giant rotisserie going that you can see from the dining room that was filled with chickens! The food is 5 stars, the dining area is a little old fashioned and could use a refresh. The people who work here are super friendly and welcoming. If you live in the area, you need to make this your gyro spot!!"}
{"text":"Wow delicious and authentic Iraq food in Phoenix!
#20 - Gyro Special Plate:  tasty and well seasoned gyro meat accompanied with crisp french fries, and a drink for only $7
#9 - Lamb Shank w/rice on a bed of basmatti rice served with soup, bread (baked on site), a smoked hummus and macaroni salad appetizers all for $13.

Unfortunately the server was authentic Iraq too, not bringing the silverware until after we got our first dishes, and bringing the appetizers 5 min or so after the main course.  However she was very friendly.

We're told Sun (1-5 pm) buffet $15/person has a great spread of Iraq food."}
{"text":"Today was the first time I ever came to Sinbads Halal restaurant and I am so very happy I did.Another restaurant inn the area Hop Stop diner promised me a previously placed order from a week ago but instead of taking care of me they decided it was better to make up lies and excuses instead if helping me I needed for a gathering that I promised I placed the order a week in advance left my name and number but when I went there on the promised pick up time they said your out of luck we just didn't care enough about you. Luckily Allah blessed me and sent me to Sinbads where the owner said Marc \" I got you\" and prepared me a special combo and the best naan and lentil soup ever"}
{"text":"Found this place waiting on pizza next door.  The food is very good.  They make the bread fresh and have an adjoining market.  The customer service is where they lose stars.  Difficult to say who was working and who was hanging out visiting.  I waited a little while at the register before someone came to help me place my order.  I called to place a to go order and was placed on hold,  I listened to the counter person take order after order for almost 10 min before hanging up. Might be better to walk in and order over calling in."}
{"text":"My son and I  stopped in yesterday after Friday prayers after the Masjid, I arrived at 2:09, I ordered the fish and a Gyro and 4 pieces of bread. 
Unfortunately for me, my order was severely delayed,  our order wasn't ready for more than 1.5 hours!
They did offer is 2 drinks instead of 1 for our patience.
Once home,  the fish was very dry and burnt! I couldn't even eat it.
I am very dissapointed to say the least. 
As much as I try to support local businesses , I will more likely find another restaurant. 
Extremely dissapointed."}
{"text":"My friends love Mediterranean food, specifically kabobs and meats. So, needless to say, we've been to a large number of the Mediterranean, Persian, and Arabic spots around the valley. Although the best place we've found for Middle Eastern food is \"Persian Room\" up in North Scottsdale close to where live, their prices and atmosphere are right on par with the likes of \"Fogo de Cho\" and other similarly luxury Scottsdale area restaurants. That's where Sinbad's has the the edge over \"Persian Room\" in our book, It serves authentic Iraqi and other Arabic meals that compare very similarly to the quality of the food at \"Persian Room\", but at half the price. All be it, they lack the sophisticsred, luxury atmosphere that \"Persian Room\" has, but that can also be a plus for Sinbad's as, for most people it really doesn't make that much of a difference. 
Not only are their prices great, on Sundays they have a all you can Eat Buffett for $14 that includes most of everything on their menu and a drink. The staff is helpful and friendly, you can't really go wrong with Sinbad's. I will definitely be coming back to this spot."}
{"text":"Used Grub Hub for delivery. Some food is a little pricey, for example some appetizers cost more than $5. Over-all I thought it was decent and way better than this other place. They gave me 2 huge pieces of flat bread, that was pretty cool. I ordered the 2 gyro special and they were great. It would be nice if all the dishes came with sides though."}
{"text":"Pita bread made fresh daily and their meats fresh roasted also. Salads so tasty. My favorite gyro place by far. Worth the drive!!!!"}
{"text":"First visit, recommended by a friend and fellow Yelpers. The place was crowded which is a good sign but there was chaos which isnt such a good sign. 
Order hummas, grape leaves and blakava to go. Not impressed especially since they didn't give me any bread for the hummas, even though I asked. Good thing I had pita chips at home. I will try again, I believe in second chances. Hope the next visit is better. 
I felt the food lacked flavor but then the only comparison I have is Pita Jungle which I live."}
{"text":"I saw so many good reviews and the owner came out one night while we were ordering food next door to a homeless woman so we decided to give it a try. Oh No. We walked in during the lunch buffet and it was busy, several people were at tables and three people were ahead of us. We stood there lost for a moment not sure if we were going to buffet or order off the menu. After walking by us a few times the waiter? finally took notice and we decided buffet. He told us to take plates and we picked out what we wanted. First off, the food is delicious, amazing and it smells great. However, the service was the worse we have ever had. The waiter?, no one came to check on us, no one offered us water or Naan bread, even though every other table had them. We got up and asked, not once but twice, could we order some naan bread, none came. Three groups of 3-5 people came in after that and they all ordered, got their food and 6 other buffet goers came ate and went, all of them were offered water, soda, bread. Not us...So we just ate our food and went to pay our bill, it was 37.45. Never again, I don't mind paying high for good food and great service but great food and no service, no thank you. Never again, I suggest if you're going to eat there, don't go when it's busy or you will be ignored."}
{"text":"We ordered the combo meat mix platter for 4, it was great, my husband ordered the lamb shank and it was a huge portion. Loved the hot fresh bread giving 4 for a slightly undercooked meat, although they corrected and for the delay in drink ordered. Otherwise, great service and welcoming environment plus priced right."}
{"text":"It was right up the street from my house so I decided to give it a try. I was decently impressed. They changed the 2 gyro special from $4.99 to $6.99. It was a little confusing bc half thier marketing said $5, the other half said $7 They weren't my favorite that I've ever had, but they were pretty good. I wished for a little more garlic in the tzatziki 

The interior is very nice and the huge glass window to watch them bake the fresh breads was a welcomed surprise

I'm sure I'll give it a try again, see what else the menu has to offer"}
{"text":"Food was disappointing.  Waited for a long time while they said the wait was 10 minutes.  The falafel itself was alright but cold.  Wouldn't recommend it."}
{"text":"Great food.  I love the fresh baked Bread here. The service is good and the new establishment much more nicer than the original location.  Food peons are very filing.  Most times I can't eat my whole meal."}
{"text":"I've ordered delivery several times here and almost something different every order. Everything is so tastey! The 2 chicken with appetizer is a smoking deal for 17.99! The chicken arrived wrapped in a large flat bread(they really know how to make the best bread here)! Ive never seen that before but it was such a bonus. Needless to say, Sinbad is probably the best hidden gem west of the i-17 freeway."}
