{"text":"I was waiting I'm in line with my mom and she was ordering u was still looking at the menu next thing I hear is the chef inside the kitchen talking really loud to another female staff \"OMG she is so fat she could be 4 times of you\" to the female staff in Cantonese. I don't look like a Chinese with all the different color in my hair. He was staring at me while he was talking about me. I stared at him for 5 whole mins crossing my arms. He then knows I heard every single world that he said about me so he quickly shut the door to the kitchen. I told the boss about this but of course the boss was protecting him. I'm a paying customer, I'm not begged for food,and he has not rights to judge his customers. The owner should have ask the chef to come out to apologize to me about what he had said and which no apologies was giving to me at all. I'm warning all people not to go here at if you don't want to be criticized."}
{"text":"Located among the string of BBQ shops on Broadview Ave, just south of Gerrard in East Chinatown. It was a random pick-and-choose, and I decided on this one.  Sing Sing BBQ is a small shop, offering the standard BBQ options behind the counter, as well as a hot food counter, that includes tofu, noodles, sweet & sour pork, and daily specials. The prices are cheap, starting from $3.00 for 1 item + rice option, $3.50 for 2 items. Vegetables are $0.50 more, but with all that meat, I suggest you to order the extra veggies.  All meals come with a bowl of daily soup (usually with some type of melon). You can also request roasted BBQ pork sauce or onion & ginger sauce, free of charge, to go along. The person cutting your meat will ask you if you want it lean or half fatty/half lean. Most people opt for the half fat/lean because it has more flavour and isn't as dry as the lean.  With my order of BBQ pork and roasted pork with rice, it came to $4.20. Not bad for lunch. I decided to eat in, taking 1 of the 4 tables available. Most customers take out, so seating is usually available.   The restaurant itself isn't exactly the cleanest and the employees are loud in their chatter with one another. One of the employees decided to sweep the floors while I was there eating. Another decided it was a good time to swat at flies in the restaurant.  Food was average. Decent price. Terrible eating experience though. If you want to visit this shop, stick with take out."}
{"text":"pretty good stuff & great fried rice."}
