{"text":"This place is just great! We have been here for breakfast, lunch and dinner and it has been great every time. It is so cheap and you always get so much food and so fast to. They have a huge menu which is awesome! The workers are always so happy and take good care of you! They just remodeled it and it looks so nice inside and the bathrooms are always clean. Great place!"}
{"text":"We went here for a family Christmas brunch last month. Having lived in town for nearly 20 years, we had always seen but never actually been to SIR Hobo's. We had no idea what we were missing. When we first sat down, we were greated by a jolly waitress with a thick, possibly Greek accent. Her nametag said her name was Gerestina, but her attitude said she loved her job. The complimentary water was, in a word, exquisite. And the meal only got better. But the biggest surprise was when, about 20 minutes into our meal, a homeless man with a whooping cough and a peg leg stumbled through the door and colapsed. The cook came crashing out of the kitchen, carrying a CPR mask in one hand and a bloody meat cleaver in the other. Through his quick action, the cook was able to resucitate the homeless man. As we all applauded, the homeless man stood up to shake the cook's hand. The homeless man was crying and gave every single person in the restaurant a great big bear hug. It seems that SIR hobos still certainly cares for our fine city's hobo community."}
{"text":"My wife and I just had an outstanding breakfast!  Great food, great environment, great service, great ownership.  Need we say more! Jim & Fae"}
{"text":"The food is very good for the price. The salads and fruit cup are always fresh and tasty. Their serving one salad now with salmon, mixed greens and strawberries that is wonderful.  The service is quick, through and friendly. The coupon in the weekly paper is great at defraying the cost too.  It's a great place all the way around. It's a family restaurant that accommodates for that nicely.  I strongly recommend it."}
{"text":"Good value.  Owners are always working and are good people.  They had a fire recently which closed the place down.  Not sure they've re-opened yet, but if not, hopefully soon."}
{"text":"Great atmosphere, food is good. Staff is very friendly with good customer service skills. I like the diversity of who they employ. I routinely visit over the lunch hour. Breakfast food is the best. It nice to have a local hometown restaurant that's been around for awhile"}
{"text":"This is one of the more generic \"family\" places out there, but I actually did enjoy it. Now, I'm one of those folks who believes breakfast should be served three times a day, so my breakfast in the afternoon hit the spot. The sausage was tasty and the hashbrowns were just perfect.  Someone else got the shrimp basket. While the shrimp itself was meh, the serving was huge, and the breading was quite good.  I'm sure some other options are subpar; just reading the menu turned me off to a few of them, but for breakfast, this is your spot."}
{"text":"Absolutely horrible.    The building has been recently remodeled because it burned.  I'd guess the insurance company didn't cover a replacement broom, vacuum and cleaning supplies. My arms stuck to the new table, the floor was really littered with garbage and my silverware was dirty.  Gross.  It was 2pm on Sat and dead.  No excuse for dirty.  The waitress was really nice, I think her name was Sarah.  She was personable and attentive.  She's the only reason I'd give this place a star at all.  I ordered a Gyro sandwich.  It came with fries and a bowl of soup.  I ordered Broccoli Cheese soup.  I think if I heated up some Velveeta and added a gallon of water to it, then tossed in a bunch of dirty, uncut broccoli, I could duplicate the Sir Hobo recipe.  I wish the rest of the meal was that good.  When the Gyro arrived, it reeked of rotten deer carcass, the plate was filthy and the fries were colder than Alaska in December.  I'm not joking.  The Gyro tasted so bad that I had to spit a mouthful of it into a napkin and slug down a glass of water to cleanse the horse-s--t taste from my mouth.    Sarah noticed that I hadn't eaten my food, she offered to remove it from the bill with out me asking.  I would normally applaude that gesture, but some older foreign lady (I assume the owner) came over and told her not to do that.  \"I'll make you new sandwich,\" said the old lady. I declined.  I figured I couldn't choke down another bite of the garbage they call food.  I paid my 9 dollars for a lousy cup of liquid Velveeta and left.  I bet the Dairy Queen across the parking lot is glad that Sir Hobo's is back open.  I wonder how many people have done what I did... walk to DQ and had an ice cream cone to try to clean the aftertaste of death and decay from my mouth.  Never again.  I'd go to DQ instead."}
{"text":"I have been here several times and this place never disappoints!  Always fast, friendly service and the place is spotless!  I usually order one of their breakfast skillets, but I've tried other things and it's all been great!  They have a very good selection, so it's not difficult to find the thing you're in the mood for!"}
{"text":"I recently went here with my family for breakfast and I look forward to going back soon. The menu had many options for breakfast, even for Vegetarians, which I am. I had the Veggie Skillet which was delisious and my husband enjoyed his inlet as well. The portions where large and the quality was high. A very clean place with a very friendly wait staff. Good kids menu too!"}
{"text":"Good food, service and atmosphere. Your traditional breakfast options but good quality and many items to choose from on menu."}
{"text":"The 4-5 times we've been here, we have always received prompt and friendly service. The menu has good variety and plenty of choices. The food is great and comes in portions too big to finish. I highly recommend Sir Hobo's for breakfast."}
{"text":"This place is always packed; however, the increased popularity is working against it. I took my mother, step father, and fellow siblings here for Mother's day. It took fifteen minutes just to get the attention of the waitress. When the food finally arrived three out of five of the orders were completely wrong. The waitress basically just negotiated back and forth with us until we agreed to eat what we were served.   On a side note, the owner (older lady) kept staring at our table with a look in her eye that could have gotten her a role in the movie Scarface.  Unfortunately, the owners no longer care about quality like they did before the business burnt down. It's just a numbers thing at this point.  They lost a lifer that day."}
{"text":"I cannot wait until sir hobos open up again. This place has the best breakfast anywhere!  The skillet are to die for. This service is as good as any diner in Chicago."}
{"text":"First time here took carry out breakfast back to work. Biscuits and Gravy are not that tasty. You could eat them but wouldn't recommend. However their corned beef hash was very good! I would go back based on the hash and just get something different than the Biscuits n Gravy too bland and had a funny taste"}
{"text":"NEVER going back to this place.  We went for breakfast as a table of four.  It was packed, Sunday morning breakfast.  Three of the four breakfasts went back.  Two of those came wrong again.  One of those came back wrong a third time.  It took so long for the waitress to come back my wife had nibbled on it, eating around the block of Velveeta she specifically asked to be cheddar.  When we asked for consideration on the bill, we were told that she had eaten it, so no discount would be given.  We asked to see the manager.  The waitress returned and threw the bill on the table saying that she would take the breakfast out of her tips.  When we told the hostess, she offered a 10% discount off the bill.  Too Little Too Late.  There is no excuse for a menu omelet (that's right, not a special order, menu) to come out wrong three times."}
{"text":"Now reopen and beautiful.  Come in and check it out."}
{"text":"Terrible service. Half of our food didn't come out until we asked about where it was. When we brought it to the attention of the owner, he argued very rudely with my party"}
{"text":"Restaurant looks good on the inside but the food itself you could make better at home.  Seriously I just had a the Two For Four or whatever they call it and got two pancakes, two eggs and bacon.  The menu item itself gives you 2 sausage links and 2 bacon but the waitress told me I could get all bacon (4 slices) in lieu of bacon and sausage but neglected to explain it cost an extra $2.  Service was extremely slow and the owners don't speak very good english when you try to expalin the problems to them.  Overall, I intend to never return as there are other fantastic breakfast places within miles of this place."}
{"text":"Ate here for a work lunch. Food was good, nothing spectacular. Reminds me of Country Kitchen esque food."}
{"text":"We stopped for breakfast based on some positive Yelp reviews   Basic breakfast fare.  Eggs, sausage, hash browns etc. The pancakes were over cooked and slightly rubbery.  The offset was the biscuits and gravy.  It was excellent.  Sausage was better than average as well.  The waitress did a fine job.  Sadly the hostess/cashier, not so much  For breakfast- a good choice"}
{"text":"We went back here for the second time since the remodel.  Both times we had breakfast items.  We've never had lunch or dinner food here, and from reading other reviews it would appear that is a good thing.    The remodeling looks nice, and it's now a no-smoking establishment.  But neither of these two aspects can apparently help the fact that your elbows and/or arms are going to stick to the tables.  Maybe it's a trap!  Like flies on sticky paper!    Service was good both times, and breakfast food is solid.  But if they can't keep the tables clean, what else is filthy dirty?"}
{"text":"I want to write nice things.. I sooo want to write nice things.. so here goes.. the place has a nice warmth to it.. family friendly, which is always a plus for us... well that's it  food- just not good.. wife's reuben- the corned beef tasted.. let's go with questionable. Kids got hot dogs, ugh, just buy a better brand people! I had the Gyro.. it was serviceable, a little heavy on the sauce, but fine.  Service- waitress didn't give a d*mn about anything.. so yeah.. 2 stars.. maybe we will try again, but I don't think so"}
{"text":"I admit I come here often. Rarely do I interact with a business where i sincerely look forward to going back again, and again. Sir Hobos presents a high quality product, in a casual, CLEAN, modern, comfortable atmosphere. Their service is impeccable, fast, eager, sincere, efficient, they aim to please the customer. Sir Hobos is a customer centered business, it's all about treating the diner with respect and meeting their needs. The food is plentiful, always fresh, and reasonable in price; three winning ingredients to a successful experience. Try it, you might like it too."}
{"text":"Tonight i took my 8 yr old little girl to this restaurant for dinner this evening and had the most horrible experience of my life. Don't go here if your a good looking woman because it doesn't matter if your with your child or not because you will be leered at by the owner as well as all the male staff. And even be hit on by the disgusting cook...not sure if these men are albanian or mexican but they were disgusting pervs! Waitress came to my table and said Carlos the cook says \"Hi.\" I said \"what1?\" and she said he said he knows you...really!? Told her well i don't know him. I told her then ask him what my name is....she did and came back and says he thinks you look like someone he has seen before. WOW! Unbelievable and with my little girl there. I guess all blonde good-looking white woman look alike and Carlos knows them all! Owner was made aware and i asked to have cook come apologize to me and my daughter for ruining our evening. Owner didn't seem very apologetic and i personally think owner went back and told his staff to check me out because as soon as we were seated i saw him go into kitchen and a few minutes later some guy came out of the back and eyeballed me the whole time he walked by my booth. DISGUSTING....i will never be back there again! BTW, not that it matters, but i was wearing sweater up to my neck and above the knee skirt with flats....hair up. I am an RN BSN and BS degree in biology. Felt like i was being treated and leered at like i'm some stripper on a pole!!! Bus boy asked what happened and was appalled as well as waitresses...upon leaving owner didn't offer any compensation but waitress came and said we fare so sorry here is a piece of chocolate cake. Food sucked and i through left overs and cake in garbage. Hadn't been to this restaurant in yrs and will never go again!"}
{"text":"We stopped for brunch on the way home from an overnight trip. Our food came out pretty quickly and was delicious.  I was expecting Perkins-quality food and was happy to find it was much better!    The decor was not what we expected - at all!  Big screen tv, awesome rustic chairs at the tables, frosted glass and stone room dividers - it was nice!  I ordered the Two Four You breakfast combo - 2 eggs, 2 pieces of bacon, 2 pieces of sausage, 2 pieces French toast.  The only complaint I had was that the bacon was a little over cooked. The sausage was legit sausage - not like freezer links you can warm up in the microwave in 30 seconds.  It was all good.   Aaron had the Irish skillet - which he gets everywhere we go - it was good as well. Portions were great. We left feeling satisfied, but not like we over did it.  Our waitress was so sweet and attentive - we tipped her 50% of the bill just for being so awesome.  We are glad we stopped!"}
{"text":"Ate here yesterday, had some good lunch at good $$. Saw my friend that works here, made some good business calls, talk business with my friend. Free Wi-Fi is always nice.  Had a good and productive hour. I like Sir Hobos. I will come back."}
{"text":"I've only been there for breakfast, but it's good solid diner food."}
{"text":"I've been here twice and I'm not a fan. Although the malt/shake my husband ordered with his meal WAS stellar. Everything else we got though... nope. Mediocre at best."}
{"text":"My boyfriend and I came to watch the game and have brunch, and ended up waiting 45 minutes for our food. We were hungry and had just left another restaraunt where our server was terrible and no where to be found, so it was pretty disappointing to wait almost an hour to eat. The food was good when it finally came and our waitress was very sweet, but none the less a disappointing experience."}
{"text":"Was not impressed when I came for lunch. I ordered the ribeye steak sandwich with seasoned fries. The sandwich was very big but the steak was a really cheap cut of meat. I couldn't even take bites out of it, it was so tough. Every time I tried, the entire steak would just slide out from the bread. It was a pretty disappointing sandwich. I would not recommend.   The seasoned fries were solid. I also tried their chicken noodle soup, which was really good and appeared to be homemade. The service was pretty poor. The waitress was not friendly at all."}
{"text":"Breakfast was awful..ordered and in about 2 mins got our food.  Like they took it out of the microwave.   I had an omelet and the tomatoes in it had turned bad and you could smell it.  The american fries were boiled potatoes not fried at all and had no taste or seasonings.   My friends sausage patties were gross also.  I will not be returning.   If you spend a ton of money to remodel a restaurant you my want to start with the chef/cook."}
{"text":"It is what it is, a nice local diner-type place.  It's not going to knock your socks off, but it beats throwing money at chain restaurants and the food is usually above par."}
{"text":"I love Sir Hobos! We come here all the time for breakfast. It's never too busy and I have always had great service and great food. After they had a fire, they rebuilt and upgraded the place nicely and it look beautiful inside. The prices aren't bad at all and for the quality of the food, it is DEFINITELY worth it. They serve breakfast and lunch/dinner, but I usually always opt for the breakfast. I hope this business stays around for awhile!"}
{"text":"We used to live in Sun Prairie years ago when we first moved to Wisconsin.  The first place we ate at was Sir Hobos.  At the time, the menu was really basic and not much seemed to be \"homemade\".  To be honest, we stopped going there.  As was mentioned below, there was a fire and they did a complete redo of the restaurant.  The food seems a bit better.  I do agree, though, with another \"Yelper's\" judgement on the cheese soup.  Yuk.  It's so thick, it heaps up on the spoon.  I've eaten there a few times since the rebuild and it seems they are trying to change.  I hope they try a bit harder this time.  A note:  No carpeting this time around.  It's very noisy.  And the TV's do not help."}
