{"text":"I, too am wondering why the there's such a poor review for such a lovely place.  My mom and I had a wonderful lunch. My scone was excellent and the Devonshire creme divine. As to my pot of tea, it was plentiful and perfect! I have been to other tea rooms in other cities and this is certainly in my top 5. You will not regret a visit to Sisters Tea Room!"}
{"text":"Love this tea room! It is beautiful, the service was wonderful and the food was delicious. I would definitely recommend a visit if tea rooms are your thing. They also have really fun special events."}
{"text":"LOVE LOVE LOVE this place!  Victorian style tea room.  The tea selections are nice, the food is scratch-made with love, the staff is INCREDIBLE.  

Food favorites include:
their soups, chicken pot pie, finger sandwiches, scones, salads... well everything is delicious.

Tea favorites include: Cherry Rose Sencha, Nutcracker, Earl Grey Créme, Lemon Chiffon, Winter Blend

But what really sets this place apart is the people.  Julia, Teresa and the entire staff are just so warm and friendly.  The experience here is like traveling to  a friend's home for a great afternoon tea party.  

I highly recommend you make your way here ASAP"}
{"text":"I'm not sure why the other review for this place is so low--I had a lovely time at Sisters Tea!

My party made reservations ahead of time, which is an absolute must. Like many tea rooms, Sisters is small, and space fills fast. The restaurant is located in the bottom floor of a house, with multiple rooms acting as dining areas. My group wound up in our own private room, which was lovely. The decor is about as adorable as you would expect, full of lace, china, and antique charm.

Now, it's important to note that wherever one does tea, portion sizes are almost always tiny and prices high. But I still very much enjoyed my meal. I got the fresh greens salad (delicious and severed with the most adorable dressing container ever), tea sandwich sampler, and scones (I opted for one of each of their offered flavors, Irish buttermilk and lavender). Everything was quite tasty!

The only problem we had during our visit is that after being seated the servers seemed to forget about us tucked away in our little room. After a while we poked our heads out to ask for service, and then it was smooth sailing! And once we were assigned a waitress she couldn't have been lovelier.

I would definitely go back to Sisters Tea again."}
{"text":"This tea house is absolutely delightful!  I went with a small group of coworkers looking to take a break on a particularly hectic day - Sisters Tea hit the spot! The atmosphere is quiet and darling. Collectively we ordered soups, the lunch salad, the tea sandwiches and the pot pie. Not a complaint to be had! We ordered three seasonal teas that came in generous \"small\" pots - the chocolate-dipped strawberry was our favorite! While so many restaurants try to outdo one another with unique and flavorful combinations, all of our dishes were simple, fresh and delicious. The red velvet scones were perfection - slightly hard outer with a soft dry core. I would recommend this place to anyone looking for a wonderfully quaint meal!"}
{"text":"Visited during the special Mother's Day tea with my mom. It was a set menu with a prepaid price including tax and tip. The house itself was decorated very cute with many different designs of China and tea pots. Part of the charm is checking out the charm. I will spend more time checking out the gift shop when I return as the seatings were on schedule and it was full in the house! 

We started with a scone with butter and lemon curd. I would have preferred clotted cream to the butter and I found the scone to have little flavor and over dry. The next course was creamed asparagus soup in a tea cup. It was delicious with a rich cream and asparagus flavor and it was pleasantly light. The salad was fresh, lightly dressed and crisp with good flavor. The two bite treats followed: an artichoke mini quiche that was delicious, the cucumber cup with Boursin cheese and chive was cute and the ham wrap was tasty with good ingredient combination. A traditional tea sandwich would have been good here. The lemon cake was a pleasant ending. There were only two hot tea choices. The lavender chamomile lacked the lavender flavor to me but I enjoyed it still. 

I can't wait to return and try the regular menu, I could tell they made all their offerings from scratch. Nice job sisters!!!"}
{"text":"Such a cute place with a ton of charm. I went for a friend's birthday party and had such a nice time. The food was ok, however their scones are SO good. The tea itself was nice as well.

I just wish it was a bigger place...I would definitely book this for my bridal shower if it had a bigger party room :/"}
{"text":"After giving sisters another chance I stick to my pervious review. My wife and I went there for brunch and it was disappointing. It's really sad because I love the fact they are open on Sundays. Their food just falls short. I mean the place itself is beautiful and the service was even good but the food fell short if my expectations. I had the scotch egg and French toast both were just okay. The scotch egg was very dry but the breading was tasty. The French toast was not really French toast, more of a dense bread pudding. My wife had the quiche and she was not happy with it. It was overly salty and had no crust. We both had the scones and both of us thought they were more like a hard dry biscuit. I had the stars and strip tea and it was pretty good but it came in the smallest tea pot ever only rendering two cups. My wife got a much bigger tea pot and she also like her tea. 

Overall we will not plan on returning unless we need something from the gift shop which is lovely and well priced."}
{"text":"Love this place! Everything about this place is so amazing. Ambience, food, service, decoration, story related to this place, it's all so amazing! It's obviously a tea place so do not expect huge portion size. Whatever you order is like a side dish along with tea. They have everything a tea lover can expect. All kinds of tea and tea cups! Very beautiful, lovely little place run by sisters. I definitely recommend this place for tea lovers."}
{"text":"Very cute place. Nice people and good food. Love all the small details. My favorite sandwich on the afternoon tea is the roast beef. They also have a very good selection of teas"}
{"text":"My sister and I have dined while sipping our tea, pinkies up, at Sisters' Tea on multiple occasions and also attended a couple of their special event teas!  Each visit has been more than just a meal--each has been a delightful experience  as the teas are perfectly steeped, the cuisine is tantalizing, the service is thoughtful and exceptional---they think of everything!  We look forward to our next visit!"}
