{"text":"Been to Six Pence a couple of times now and have been satisfied every time.  Food is good and reliable.  Fish and chips and burgers both memorable.  French onion soup was also very good.  Drinks were average although there is a decent beer selection.  Has both a porch and a rooftop patio for nice weather dining.  Located in the heart of Baxter Village so parking is a bit of a pain - but there is a lot at the back of the building and a side door entrance.  They occasionally run coupon specials in the local papers too.  Good, reliable, unpretentious food - and great service too.  Knocked a star off for parking and one for the mixed drinks."}
{"text":"We stopped into Six Pence Pub in Baxter Village on our way from Charlotte to Greenville, SC to visit with friends. From the outside the pub looks like a traditional English pub complete with phone booth. Inside the bar and dining room are beautifully decorated with dark wood and tin ceilings.   We enjoyed delicious wine and beer then ordered something lite. I had seen the french onion soup coming out of the kitchen all night so I figured it had to be good, right? Both of us ordered the soup and sandwich. We both got the french onion and I got the turkey sandwich and my wife got the roast beef. The french onion soup was not good at all. The onions were thick and not fully cooked/carmelized like french onion soup should be. The broth and cheese were great but the onions, where not good at all. The sandwich was just a sandwich, nothing exciting to report there.  The website says they stay open till midnight on the night we went but around 10pm we started getting pushed out the door, literally. Our waitress asked for the bill/tip book so she could leave. We left around 10:45pm after being asked to move tables so they could put the tables back together for the next day.   We had a great time with our friends, the atmosphere was lovely, but the food and service was a let down. If we did go back, which isn't likely, we'd stick to the bar area and just drink."}
{"text":"Great food! Definitely one of my favorite places in Fort Mill.  The Firecrackers are to die for, and it is always worth trying their seasonal drinks.  The only reason I am rating this 4 stars instead of 5 is that sometimes the service can be slow, but it really just depends on how you have."}
{"text":"Absolutely a horrible experience we waited to be seated for way longer then we were told and the staff was completely rude I recommend not going here for a better experience dinning"}
{"text":"Good of course is not perfect to a Irish theme. The beer is very good, is just like a Irish drink. Have to try their chips with any item of your choice. A good time to go is during lunch when it's not as busy. If you are looking to go to the bar it will get very busy. There is usually live music and people singing. Enjoy!!"}
{"text":"Both times that we haven eaten there really enjoyed it.  If you do not have small children you can eat on the roof.  This is a special occasion only for us.  It is out of my budget for ordinary eating out with a family of 4."}
{"text":"Great selection of beer. Roof top dining is worth the trip alone. Try the fish and chips they are flaky and best with the hand cut chips."}
{"text":"Solid meal. I had the chicken strips. They were awesome. Right balance of meat, seasoning, and breading. The wife had the bangers and mash and fried pickles. She was definitely a fan. We will most definitely come back again."}
{"text":"Weird maybe, but this Six Pence English Pub location has some of the best Nachos. I do wish they had more tvs and played Rubgy games. Great beer selection. The Rooftop rocks."}
{"text":"On a positive note...the music was good.  I've been here several times and like the overall atmosphere.  The food however is just ok...but my big complaint is the service.  It has never (been here at least 4 times) been good and if I am alone..as a single female...it is even worse.  I have tended bar and waitressed and believe good service should be...attentive.  I usually sit at the bar but did  notice...I was not the only one with poor service.  The bartenders seem to have too many other duties to tend to their customers properly.   So overall...that must be a management issue.  Food is mediocre...Really...I think with a bit more effort...this could be good...but it has to start from the top."}
{"text":"terrible bar service.  If you have 8 TVs don't have them ALL on the same channel. Its a bar put some sports on the TV and not soaps!! Hire a bartender that actually will talk to a customer.  terrible.!!!"}
{"text":"Better portions when it first opened.  Service seems contingent upon ordering high priced drinks.  Water drinkers ... good luck."}
{"text":"I love their chicken salad and I love their grilled chicken salad there shepherd's pie is to die for in the service is awesome I love this place."}
{"text":"Very good fish and chips. Never had to wait. Prices were reasonable."}
{"text":"Honestly, I expected better. I went on an April Saturday late afternoon / evening about 6pm.   Pluses:  Fun decor; I really like British Pubs.  I passed on the rooftop simply because I didn't have my shades and it was crazy bright up there.  Good choices of beers on tap. My SmithWick was ice cold.  Minuses:  Perhaps there were better choices on the menu, but I was Jonesing for a good Reuben.  I chose that and the sweet potato fries.  The fries were seasoned nicely, but they came out undercooked and somewhat crunchy in the middle.  The Reuben dissapointed, in that the meat was not all that tender and tasted like the stuff you would get from a package at the grocery store deli. Plus not enough 1000 island dressing.  Also, and just as important--from the time I walk through the door, what was lacking was a sense of welcome and attention. I sat at the bar counter and the bartender made little or no effort at any conversation or chit-chat. To me, this is part of the atmosphere of a neighborhood bar. In fact she almost seemed put out that I was sitting there. There were 3 or four other waiters and waitresses standing around the bar adjacent to me talking among themselves,  about things like their work schedules when they could have been attending to customers if only just to check in.  There are several other choices in Baxter Village that I will try going forward."}
{"text":"Tried to get a seat on the patio or the rooftop terrace to have the host tell us he couldn't sit us outside at the table because it was a table for 4 people and there was only two of us. He told us he could sit  us at the two person table inside even though we asked to sit outside.  We walked out of there and he apologized! We are both in shock that the two of us wouldn't be sat at the 4 person table."}
{"text":"Great service!  Great food!  Awesome atmosphere!  Thank you Six Pence!"}
{"text":"Good pub food. The fish and chips and Scotch eggs were very tasty. The fish was seasoned and cooked perfect. The beer selection was good too.   The menu had a lot of options if you don't care for the typical pub fare.   There is a beer garden on the roof. We didn't get to check it out though."}
{"text":"Open on thanksgiving day what more can you ask for.   Great service and good food. Enjoyed a pot roast plate at the bar and more than satisfied.  Nice pub with British flair in Baxter village fort mill. Check out their outside rooftop patio during summer. Overall nice place to hang out."}
{"text":"I'm Irish, and kind of a big fan of Fish & Chips.  So even though this is a British pub, I had to weigh in to say Six Pence, while not totally authentic, is about as good as any I've had in Charlotte.    Also good is the Shepherd's Pie, and the Beef & Guinness.  Appetizers are less compelling than the entrees.  The bar area is separate from the restaurant, and pretty forgettable as a bar goes.  Nothing really special at all there, including the couple of tiny TVs.  I've been there with the family a bunch of times, and in general the food is pretty good.  It's priced a little bit high, but they do have coupons.  I forgot which days, but kids also eat free one or two days a week (definitely helpful on the budget)."}
{"text":"Rueben burger... nuff said. Menu is a little pricey but you get quality and delicious food for what you pay so... Great chill atmosphere and friendly staff too."}
{"text":"Fish Sandwich was good when we got it. Ordered it but the waitress ordered crab cakes, when informed we had ordered the Fish Sandwich she got us the right thing. Prices are high for a restaurant but a good pub??"}
{"text":"Maybe Cam Newton should have used the Six Pence Pub as an example instead of the Titanic -- after all, both sunk.  The general manager in particular needs a lesson in manners and proper restaurant management.  He had the nerve to argue with my father-in-law when he said that his fish was overcooked.  According to the general manager, it was my father-in-law that was wrong - because the fish is NEVER overcooked.  What ever happened to the customer is always right?  That may be the way most restaurants are run, but apparently not the Six Pence Pub.  The general manager was unapologetic and refused to accept that MAYBE this one meal was not satisfying to this particular customer.  The end \"discussion\" with the general manager should really have come as no surprise as the errors and lackadaisical attitude of the staff should have served as fair warning. The meal started inauspiciously when our appetizer never arrived.  We had to remind the waiter who finally brought the app, but more than 20 minutes after we first ordered.  He was, however, kind enough to warn us that our meals were being plated.  Rather than have our entrees become stale under the heat lamps, we sent back the appetizer.  Things did not get better.  I already told you that the fish was overcooked.  Same with my burger.  It appears that the kitchen mistook medium for super well done.    After we ate, the assistant manager stopped by our table and he, unlike his boss, was at least respectful and tried to understand our issues. Still, he offered nothing to improve our experience.  No round of drinks or offer of dessert, which would be customary at most establishments when the kitchen/wait staff err.  Not here though; he did not even comp the meals that were ill-prepared (taking just $5 off a $70 check).  Then, da-da-dum, we met the General Manager - Mr. I Know Better Than You.  Overall, even though the food itself, once properly prepared, was fine, the entirety of the experience was unacceptable."}
{"text":"The staff tonight was gracious and professional when we announced our \"pop-up\" gathering in the bar. It was our first event, so we could not predict how many people would come. We were thrilled with the turnout of 25 and the Six Pence bar staff did a great job of managing the crowd and keeping everyone happy. Bravo!"}
{"text":"I've enjoyed every time I've been to the Six Pence Pub...never had bad service or food.  Beer selection is great here.  The food is good, but it is pub food...if you want a fine dining, culinary experience, Fratellis or the FishMarket across the street can accomodate you.  The menu is vast, something for everyone...good food to enjoy with a cold drink.  Why do I keep going back to the Ploughman's Lunch?  So simple, and yet the combinations of the different items in the aggregate is so delicious.    Hint: This may seem elementary, but if you want to eat, do so in the dining room.  Roof top seating and bar area are really for enjoying drinks...the food service can get slowwwww in these areas at times, especially when they are busy."}
{"text":"OMG OMG OMG we have been dying to try this place since we moved here and all I can say it beat my expectations! I ordered the scotch eggs and holy smokes it was beyond delicious never had it before but here is all I can say is wow! My husband had the crab cakes and it blows Bobby Flays to shame sorry Bobby! I'm so in love with this place I can't wait to check out the roof top bar when it's not raining! Not to mention our bartender was awesome"}
{"text":"If our bill for our family of four had been $25 less I would say Six Pence is a solid 4 stars. As it is, we had a good meal, but we did not have a $100 meal.   An app, salad, burger, kids meal, cup of soup and small portion (there are two size choices) of fish and chips and non-alcoholic beverages is not a $100 meal. It was all good. No complaints there. Service was good as well. The food is just too expensive for what it is."}
{"text":"This place is great.  Closer to my work now so I tend to frequent more often.  However,  this has always been a favorite.  The food alone is phenomenal - Shepards pie to the Theoh so good Gouda burger. The French Onion soup is also divine.   The BEERS...  well,  they have a fantastic selection of standard staples and local faves.    Great for large groups and ample parking on the back side. Worth a visit even if only for the food!!!!!  Ashley, Dolton, and Lauren are wonderful.  Great ambiance, delicious food and tasty brews.  All in one I would say!"}
{"text":"Stopped by on a Saturday afternoon for lunch and decided to sit in the bar area. It was very quiet with only a few other tables with guests.  I got the grilled chicken salad (eggs, cheese, tomatoes and cucumbers) with homemade ranch dressing. The salad was a great size and the chicken had a good grill taste to it. My boyfriend had the pot roast and he said it was good.   Our server/bartender was great. Seems like a good place to pop in to watch a game or a locals place to be."}
{"text":"This place has all the little things needed for a good after work drink!   They have slightly better bar food then the norm! Monday bartenders were very attentive and as seasoned as any Friday or Saturday barkeep!   The ambience was exactly what I was looking for in Fort Mill! Will definitely return!"}
{"text":"This is a typical bar type food only it has a few pub favorites like pot roast and other things like this.  I had the pot roast it was a bit dry but very tasty. We had the firecracker's for an appetizer and nachos all of those were good. The onion soup is very salty and has no other taste.  My wife had the salmon and it had no taste whatsoever. So stay away from that.  My father had the fish and chips and said it was decent. From what we were told its their best seller."}
{"text":"Pleasantly surprised with this place!...Saturday night with a large group and well taken care of. Solid beer selection, and great appetizers...but the burger was worth the trip all by it's self!! Not the cheapest place but acceptable based on the quality of food. Live music was ok...bit too loud and nothing special...if not it would've been 5 stars."}
{"text":"Oh em gee. I'm not a big burger fan but lawd! I'm not 100% sure  about the name but their Marybeth burger is amazing. (if that's not the right name sorry lol) It has pimento cheese and a fried green tomatoe on it! I also have tried their fried mushrooms with ranch and BOTH are awesome. I'd like to sit up stairs next time on the balcony. It's located in the Baxter area in Fort Mill, it's nice place to walk around :)"}
{"text":"HAPPY ST PATRICK's DAY. Came here for a work lunch. Left full. Got the \"Bigben\" burger medium rare. The burger was large, 1/2 pound. Left with half the burger for dinner. Got the sweet potato wedges as well. They weren't too crispy or chewy.   The rooftop was nice and there was a good breeze. They CANNOT bring draft beer upstairs, so you are limited to bottle or cans on the roof."}
{"text":"I was excited because they have a roof top patio. Got to the roof and was disappointed. It just lacked character and seemed like an after thought. The drinks were good and good was decent. The bar area was nice and they have live music. I would like to see an upgrade to the rooftop patio and have it be the main attraction!"}
{"text":"First time here but pass this place regularly but always shied away because only 3 1/2 stars but Started with the smoked salmon appetizer was absolutely fantastic will definitely order again . Tried the  hi Ken vegetable soup and was excellent also had the fish and chips as dinner and they were very good liked the chips not your regular fries you find elsewhere but round cut fries very good . Sat at the bar and the bartender Ashley was great she helped out with what to order and very attentive. Will definitely return."}
{"text":"I waited one hour to be seated on St Patrick's Day. The special was corned beef and cabbage. To say it was extremely salty is an understatement. I definitely will not go there again on 3/17."}
{"text":"Service was poor, waitress joselyn was bored. Ordered Scottish egg, clearly microwaved. Bad service on patio, no others here.  Forgot glasses had to ask staff . Sad to say, we've eating here years ago. Much better. Sad"}
{"text":"We came here last night to try something different. The atmosphere was really great: romantically lit and warm and quiet. I wanted to sit on the roof but they only open Thursday-Saturday. Oh well.  The menu definitely has British and Irish influences, but I guess it would be better classified as \"fusion\". I had the honey shrimp salad and my boyfriend had the bangers and mash. The salad was really, really great but I kind of wish the shrimp didn't still have the shell on the tail, because I felt I had to either cut it off or eat it with my hands. That's just nit-picking though. It was truly delicious. I tried the bangers, and they were quite good. Our waitress, I think her name was Bev but I can't remember, was super nice and helpful.  After dinner we went to the bar for a drink. I had the Strong Bow Cider and Justin had an Irish coffee. Both were very good. The bartender, Bradley, was incredibly kind and personable, and let me taste the Pumking beer (AMAZING! But I didn't have 9 dollars to spend on it) and even gave us a free taste of a specialty Fall drink. We had a great conversation and overall, it was a great experience.  I'll definitely go back."}
{"text":"Five of us ordered food with apps and everything came out cold. Every single dish.  Scotch eggs are terrible when they're served cold."}
{"text":"I had no idea six pence pub had a beautiful rooftop dining until recently! I've always enjoyed the food but having drinks at sunset on the rooftop made six pence pub one of my new fav spots. There is plenty of room and a full bar. Cute lights strung across for night time too. Ruben is always my go to here."}
{"text":"Decided to check this place out after seeing it during a visit to the area. Had the Big Ben burger. I was not impressed. The quality of this $13 burger seemed a bit lacking. I may be wrong, but the burger seemed to pre-made. Pre-made or not, it was not of good quality.   On a good note, the fish and chips were fantastic. My wife had them and was very pleased.   Good with the bad..."}
{"text":"Just had dinner. Fish and chips were nicely done. My wife ordered the Ruben sandwich (which she kindly shared with me for a piece of my fish).  The sandwich was also very flavorful. The best part of the meal may have been our server. Amy was very friendly and we enjoyed her sense of humor and good service."}
{"text":"I've been here three times with all three being sub-par. The service is horrible at best.  The roof top bar is great but getting a drink for my party of four was like going to a cafeteria.   On a bright note the food has always been good.....it is too bad the service sucks."}
{"text":"Jacob and I eat here quite frequently. We love this place and if we ever have trouble deciding where to go eat this is one of our easy \"go to's\" because we both enjoy it a lot. Tonight in particular we had a great experience. We ate up on the roof (our favorite spot to eat here) and Chris was our server. He did a great job interacting with us and not showing any stress although we knew he was pretty busy. Clay the manager was actively helping Chris which is great to see because I go to far too many restaurants and see managers not doing much more than holding up the foundation. Clay and Chris together made sure we got our food exactly how we wanted it and kept our beers full. We will definitely continue being regulars here."}
{"text":"Pretty good food and service  Parking sucks like everything else in Baxter Not worth the trouble"}
{"text":"Cool place. Had a tasty (if small) crab cake sandwich. The patio is really nice."}
{"text":"We stop here a couple times a year and enjoy it every time. Tonight we both had the crab cake dinner with hush puppies, sweet potato wedges and cole slaw.  The crab cakes are about the best you can get inland with this neighborhood pub atmosphere.   Paul was our waiter and we connected with him immediately! We have common roots and enjoyed his service and the conversation.   Will come back again soon and hope they continue to have the crab cakes and that Paul is there on our next visit too!"}
{"text":"A great location for those who live in the Baxter residential area that can literally walk out their door and around the corner. Good thing I don't live in here or this place would probably break ma bank!  So the location is absolutely fantastic in that respect. Otherwise, the Ft. Mill area hasn't really been my cup of tea. If I find myself working late, sure, I will more than likely take advantage of their bar, which is of a fantastic old time decor, well laid out, and is well stocked. Bar maid service (drinks, shots, etc.) is fairly decent.  The food quality is good, but in my opinion I think it could pair better with pricing. The service on food specifically could use some improvement. I usually come here expecting to wait.  Ideally, this is a great low-key hangout joint with a friendly wait staff, good food, good variety of drinks, and an exceptional atmosphere with great decor. Multiple TV's in both bar and dining rooms."}
{"text":"I've been to Six Pence Pub 4 times and have been impressed with the food and service each time.  I recommend the fish & chips, shepherds pie, catfish & shrimp, and chicken tenders."}
{"text":"This is a decent place for lunch that has quality appetizers, and decent sandwiches. We have gotten together with friends here for meetings, and at other times when we happen to be in the area. It is a little better than standard \"pub fare.\" Not anything special, but certainly better than some places in the area. The service is usually quick, and the food normally decent."}
{"text":"Everyone in our party ordered fish and chips. Definitely the best I've had in the Charlotte area. Cod was fresh very white and flaky and the breading was not too thick or too thin. Personally though I prefer a beer battered English fish and chips but this was still delicious. My co-diners ordered fried mushrooms as an appetizer and said they were delicious. My 3 year old niece was with us and the waitress was soooo nice to her. Service was excellent!! I've been here once before for drinks and appetizers and had the fried pickles. They were spicy and delicious. My friend said they were too spicy for her and yes I have a higher spice loving level than most. My only other suggestions are that the fish and chips should include cole slaw. That's like a standard and it would be nice if the bar music was confined to the bar side. There is a great divide between the 2 which is nice for families but the whole time in the restaurant we were listening to Rush and other metal bands. Will definitely be back!"}
{"text":"I agree with Chris B on many points, but I think Six Pence in Baxter deserves three stars because the food is halfway decent.  If you have been to either of the other Six Pence Pubs (Savannah, GA, and Blowing Rock, NC), this is one is much newer, nicer, and slightly larger.  One thing I like about it is that the bar and the dining area are separated by a glass wall.  That keeps the rowdy people at the bar watching sports out of your way if you just want to come and eat.  However, there were still a table of about 8 people near us that were mostly drinking and probably a bit loud for a cozy-esque dining room.    The food - it's okay, but most of it's overpriced.  $20 for Atlantic salmon is very high - most places don't even charge that much for the far superior tasting and sustainable Alaskan salmon. A not too generous, albeit not skimpy, order of pot roast with 2 slices of Wonder style white bread and some veggies was $14.  However, it was okay.  It's been a while since I've had that the fish and chips because that was definitely overpriced for the portion.  Towne Tavern up the street has a better one, for less money, plus you get more.  The smoked salmon was four pieces of salmon and instead of cream cheese the dip is cheap sour cream with dill in it.  I will say the sweet potato fries are fresh, very good, and they give you a lot.    This place also has a cool rooftop patio in the summer.  There's not much to see from up there except for the streets of Baxter and the interstate, but it's still nice.    It seems the only time we go here is if we have a Groupon type deal or a coupon, and it still ends up costing slightly more than it's worth.  But the server was nice and we had a decent meal, so 3 stars is the verdict."}
{"text":"Located in Baxter Village, I have driven past this place several times but have never stopped in. Large, easy to read signage and the typical red phone booth out front make the place easy to spot.  The atmosphere inside is fairly standard for an Americanized English pub, lots of dark wood, tin pan ceiling, and lots of English style artwork adorn the walls. The food is hit or miss, I got the fish sandwich and pub fries and thought they were fairly good. My wife got the pulled pork sandwich with slaw; the pulled pork was about 60%-70% fat and was pretty bland. The service was somewhat slow and a bit confused. We had two different waitresses coming by trying to take our orders, we would order from one and the other would come by asking if we were ready to order. At one point the waitress came by and picked up our plates before asking if we were done with the food that was left on them... we weren't. They seemed friendly enough, but didn't even know what beer they had on tap.  They have about 10 taps, and are all mainly the standard import selections; Guinness, Harp, Bass, Old Speckled Hen, New Castle, Smithwicks, etc... They do have 1 or 2 rotating taps for seasonals. Not a bad selection, but not great. The other issue is they serve the beer nearly ice cold, most of the beers on tap should be served a little warmer, the beers were so cold that they were nearly undrinkable until we were almost ready to go...  All in all, if it weren't for the atmosphere this place wouldn't have much going for it. The food is not bad, bit it is a little pricey for the quality."}
{"text":"Probably the worst service we've experienced in a long time. If you cannot serve up on the deck you shouldn't   Took forever to get our drinks, mostly didn't have what we wanted. We tried to just go with it. Had to ask and wait for silverware, the sour cream was in two cups so when my husband went to pour it on the nachos it flew off into my purse and the ground. They finally asked us if we wanted our empty plate cleared. Really?  Food was ok. The beef on the nachos had no flavor. Spices??"}
{"text":"Always have a great meal here! We love that they do full menu on the roof now, so nice enjoying the sunset with drinks and dinner."}
{"text":"Not even worth one star. Horrible service horrible food and horrible mixed drinks. Nothing positive to say but walk across street to Akahana or beef o Brady's before spending a dime here."}
{"text":"Ate here the other day on the bar side at lunch. We're only a few others here at the time.   4 stars for one reason... Beer selection was lacking but maybe I just expected more.   Food was great. I had the Hawaiian salad and I was surprised at how good it was. I will definitely be getting it again. My buddy and a burger and sweet potato wedges and he said the burger was great. The wedges were to as I stole a couple.   The bartender was nice and knew about the food and beer so that's a plus. The place was very clean and laid out fairly well."}
{"text":"Was told this is one of the most popular places around and was very disappointed. The fire cracker appetizers were tough and lacking in flavor. The French onion soup was bland and unremarkable. Two parts of my dad's meal were forgotten. The beer selection was very limited. When the manager came around and asked how everything was we said it was not very good, merely okay. He asked what was wrong and we said it wasn't bad but it was simply just there, not enjoyable, and that two items had initially been forgotten for my dad's meal. The manager's reaction was to say \"I'll take that. I'm just glad the other items made it to you before you finished eating.\" Not a good response. That said, the atmosphere was pleasant and our server was nice. The side salad was good also."}
{"text":"Me and a date stopped by for a late lunch on Thursday 5/10 at About 3:00 pm.  The patio was nice and quiet and shady.  Dennis was our server and he was ok except it took forever for him to close out the check.  We ordered the French onion soup and Fish n Chips.  The soup tasted good but was only warm when served and the onions were stringy?  The Fish n Chips were not served with traditional malt vinegar and the portions were extremely small given the price.  No value for your money. The fish had a good taste but looked like it came straight out of the Gorton's frozen fish box.  Not what we were expecting for a British Pub. The patio earns two stars."}
{"text":"Ate there twice was not ecstatic with the service or the food. I walked out one time cause we were sat and waited 20 min and noone came to us to check in as we walked out the hostess said in the most condescending way to have a nice night. So I went back like I always do to give it another chance the bar was empty on a Saturday, the servers and bartender were chatting about what type of music to play( the selection was horrid btw). I noticed that the Guinness I got was not poured properly( I watch intensly when they Pour) it was way to cold and small. Was not impressed and won't be going back. I'll just head to mchales or heck if I have to Ri Ra in Charlotte."}
{"text":"Good eat and drink. I liked the firecracker appetizers, veggie quesadillas  and live music in the bar area. The rooftop is a must partake when in season."}
{"text":"Had lunch at SPP on a beautiful Sunday afternoon. My first trip, the wife has been several times. Great food and service. Everyone made us feel very welcome. Our server, Trevor, did an excellent job. Started with the Spicy Blue Cheese Chips, and the fried pickles. Both were superb. The on to the fish and chips. Flaky succulent cod, and the chips were perfect!! Can't wait to get back and try the rest. And we loved the great look and feel of a British Pub!!"}
{"text":"Stopped in for lunch today. We had the Honey Shrimp Salad, Burger with Hush Puppies and the Fries with cheese.  Everything was delicious. Best overall food I've had anywhere in the CLT so far.  The Hush Puppies were so food, I could eat them all day long. The service was excellent, but there were hardly any customers on a weekday afternoon at the bar area, so I can't tell if it would have been worse at busier times.  Would go here weekly if I lived closer!"}
{"text":"Absolutely the worst service ever.  We were seated and forgotten.  Took 15 mins after ordering drinks to get drinks.  Another 15 after that for the appetizer that we ordered with drinks.   Never got our food.  Spoke to manager cancelled our order and paid for our drinks and app and left.  Time of horrible experience 1 hour.  Left hungry and went elsewhere.  Never again will we go there.  I can only suggest others avoid this place as well.    Only gave it 1 star because it wouldn't allow me to do negative"}
{"text":"What a nice location this place is in will be back for sure. Didn't hit the bar had lunch a superb fish and chips."}
{"text":"The service was friendly and the food was great. Ordered the fried pickles and it was a very generous serving with the perfect amount of spice. Also the bangers and mash were delicious."}
{"text":"Dinner on New Years Eve was inedible.  Started with the French Onion Soup, which was so salty we couldn't eat it.  This from a person who LOVES salt.  Ordered the special of Prime Rib.  It was pretty good, but the roasted potatoes and collard greens served with it were also too salty to eat.  Very disappointing.  This will be the very last time we go there. Have been disappointed before, but this was the end.  No more chances for Six Pence."}
{"text":"Had an enjoyable dinner there.  The wait staff was friendly and helpful.  The food was typical British pub food.  Over all the food was above average.  By aware that the menu is on several sites and has changed from some of the examples.  The prices went up as well.  I was disappointed that the Welsh Rarebit I found on an online menu is no longer offered.  I agree with the reviewer that said the dining area was bland and would add noisy too!  Worth the visit."}
{"text":"Went for lunch got there a little before noon and was lucky enough to find a parking space in front of restaurant not great parking only on street  Had a burger fries and a beer liked the way they made fries Everything was good barmaid was OK not crowned st bar on a Saturday  Prices were ok 5.50 for a beer and 9.95 for a burger  But they charge extra for cheese on the burger Seemed cheap to me  Not sure if I'll go back"}
{"text":"Been here several different times, always enjoy my meal. Authentic Irish cuisine, it feels like your in Ireland almost! I most recently had the catfish and shrimp platter with roasted veggies and rice, so delicious! You have the option of sautéed or Cajun fried. Highly recommend!!"}
{"text":"This is a great place, my British friend completely endorsed the Cumberland sausages in the bangers 'n mash.  Really good sweet potato fries, great club sandwich and Churchill's firecrackers are very good as well. Spot on!"}
{"text":"Great little pub. Great service, food was very good"}
{"text":"I eat at Six Pence often. It is a good pub. Try 'Churchill's Firecrackers'. They come complete with 4 wraps filled with cheddar, jalapeños, green onions and bacon. Their fish & chips are awesome. My second favorite entre is the Tyler Platter. It has 5 Chicken Tenders. I like them drenched in barbecue sauce. The platter comes with fries. I swap them for a salad."}
{"text":"On a rainy day in Ft. Mill, what could be better than a British Pub?  Even though I am not a beer drinker, my college buddy visiting from Kansas did us proud with the suds.  He also chomped down on some fish and chips, while I went for a pretty basic chef salad.  It impressed me that this pub offered both traditional fare as well as a number of lighter dishes. There was a very light Monday lunch crowd, which made the noise level almost nothing.  Service was excellent.   I thought the price was a bit inflated for a lunch for two, coming in at over $50 with the gratuity.  The chef salad should have been in the ten dollar range, instead of over $14.   The iced tea should not have exceeded $2.00, but it was $2.75.   This is why I am giving this a four star review and not a five star one.  Otherwise, it was a fine experience inside of Baxter Village.  Cheerio."}
{"text":"Great service and delicious food just about sums up this restaurant. Six Pence is a British Pub. It has of course a British menu to choose from but has some southern options as well. It's located on Market Street in Fort Mill, South Carolina.  It's in a really nice expensive area with an \"uppity vibe\". So, if you come here expect to spend some money. I spent $41 here and I was by myself. But, I enjoyed it.   They offer a full bar with several draft beers, martinis, wines and bottle beers. They have daily specials such as the following:  Friday's     $7 beer flights Saturdays $5 house margaritas  Sunday's   $5 Bloody Marys  Events: They have live music Thursday to Saturdays according to their website.   It seems this British Pub attracts locals and tourists alike. Six Pence has an inviting atmosphere with peaceful ambience along with plenty of trees outside for shade in case you want to sit outside. It looks like most locals sit at the bar if you ask me. As I walked in, the bar was full on a Friday evening. So, I decided to sit outside as they do have outdoor seating  Menu items ordered:  shepherds pie, salad with ranch dressing and French onion soup.  All 3 were delicious dishes. The best was the French onion soup. The Shepherds pie was great too as it was made of melted cheese, mashed potatoes, beef stew (which was at the bottom of the bowl), green peas, carrots and etc.   History:  Six Pence was established in the historic district of Savannah, Georgia. This Six Pence opened in 2006 in beautiful Baxter Town Center.   I had no problem in finding a parking place which was across the street behind other shops and businesses.   Features:  It has outdoor seating, inside dining room, patio, a rooftop terrace. It's a comfortable British Pub along with a bar of course.   On Scene:  My waitress really took care of me. She had a great attitude and made my dining experience very pleasant. She didn't mind refills and other items that I asked for.  Final Thoughts:  Well I enjoyed my dining experience at this British Pub and would return. Before coming by, I recommend visiting their website and calling ahead for specials and menu items as some of their menu items like soups change daily."}
{"text":"This is the third time we ate at this establishment and it seems to get better each time. I'm not a big fish and chips fan but on this occasion I felt like trying it out and it was well worth it.  It was delicious,  I'm not a tartar sauce fan so I opted to just put fresh squeezed lemon on it and that is all I needed.  Pot roast and loaded nachos with ground beef was also fantastic.   I used the malt vinegar to drench my chips and it was all great.  Waiter staff was on point and kept everyone happy.  I highly recommend this place for food if your in the area but if your just into appetizers and drinks, the rooftop bar is amazing as well."}
{"text":"Love it!  So beautiful inside, great atmosphere; feels cozy and authentic.  Was really quiet on a Monday night; first time I've been there, so I don't yet know how busy it is on weekends.  The firecracker appetizers were a great recommendation by our server--who was very friendly and attentive--and the Guinness was perfect.  Will definitely go back!"}
{"text":"Service was a little rough at first but turned out okay. Great fish and chips! I could have a half and half... First time in ages!!!"}
{"text":"I've been to Six Pence several times and I just have had average experiences... the food is just OK, mixed drinks are not well made (thin), the beer selection is decent, the service is below average. Kudos go for a nice rooftop bar."}
{"text":"Great pub food and local brews. Stopped by on a quick trip to SC and tried the veggie quesadilla (as recommended by our waitress). It did not disappoint!"}
{"text":"I've been here twice.  The first time we sat outside and it was sunny, and lovely. The fish and chips and fried pickles are memorable too.  Really enjoyed the staff, they were friendly and helpful and gave us samples of the beer when we couldnt make up our mind.    The second time we sat in the bar and my husband loved the firecrackers and his burger.  I got the she crab soup having never had it before in my life and it blew my mind.  It was absolutely amaxing, the sweet crab flavor with the bread they provided to nom it all up in.  Both visits were great ones.  We will be back."}
{"text":"Let me qualify my five stars by saying I've only been here twice, and got one of their burgers each time. Now that that's out of the way, the burgers here are excellent. Juicy, delicious, cooked as ordered and with creative toppings.  I had the blue flame, which is not as spicy as the description implies (which is a good thing) and another time a Roadhouse. Other selections also sound great.  Service was good, ambiance is upscale pub. Burgers are fantastic."}
{"text":"Good food and wine/beer menu. Awesome custom burger joint. Try the Reuben burger with hand cur fries or chis."}
{"text":"My friend and I came in just as they opened. We were greeted with a smile and shown to our table on the porch. The chairs are metal and dug into my back a bit. They're better if you lean back, but I prefer proper posture. We took our time ordering, and the waitress was understanding and on top of refills. I got the fish and chips and she ordered the pasta. We both enjoyed our meals, which we hit without much wait. I ordered the small plate and still took half home for another meal. Overall, great service and food. I'm not in the area often, but I would certainly return."}
{"text":"The bartender is lots of fun! Happy to experiment with drink ideas! The live music is always great. Recommend the shepards pie and fire cracker wraps! Hummingbird water is delicious as well. Great atmosphere and friendly staff!"}
{"text":"I only stopped here because I was walking trying to find the fish market(right across street....duh!) but I was so hungry & on the wrong side of the street pushing my son in a wheelchair.  So the front entrance is not ideal for strollers or wheelchair! Plus the fact that the woman who entered before me just let the heavy wood door shut on me!  I was seated quickly & this was great seeing it was around 12 on a Friday afternoon. I felt strange in that there were 3 menus given to me, a beer one, entire dinner/lunch & lunch specials.   I admit I only walked in the door because it said on chalkboard outside they had she crab soup. Which being a southern dose seems strange in a place that to me has a Irish direction. Fist of all on my fod, I am from Chalreston SC area, I know and love my she crab soup.... this was not even close! it was a thin milk broth of a crab flavor with a few nice tasting crab chunks thrown in. A true she crab should be thick cream with lots of blue crab in it and some roe that make the pink color. sent to the table with some warm sherry. this version left a lot to be desired. I would say it was a crab bisque!  I had the fried cod sandwich with pub fries. now on their menu was a aray of foods including meatloaf and a shepard pie. so I gathered we were leaning towards the irish theme. but went with the fish sandwich anyway. the crust was nicely flavored and crispy but not drained enough before put in my french bread. as it arrived to me in a plastic basket sorta opened, i immediately removed the totally wilted piece of romaine lettuce and the over ripe tomato slice. I tasted the serving of freshly made tartar sauce and was pleasantly satisfied. I slathered it on my bread and began to devour my fish sandwich. the pub fried were strange for me, it was like thick sliced chips they were seasoned well, but i felt they were missing something, maybe some vinegar to dip in???  i did like how large & nice the restrooms were, as a woman you rarely find a bathroom that is clean enough with area for changing a child with some privacy. I dont think I will be back but will tell my hubby to check it out"}
{"text":"The restaurant is cozy and somewhat dark with a separate bar area and dining area. Service was quick and attentive. They have some different beers to experiment with and even let you sample some you're not familiar with before you commit.    Food was OK but not great. I had half a turkey sandwich and salad. My turkey sandwich was a bit dry and bland and the salad was forgettable. As bars go and as bar food goes you could do much worse."}
{"text":"this place is right between the 2 and 3 stars.  Ahh Yelp limitations!  We got married in Blowing Rock, and the Six Pence there is legendary for saving me with a late night salmon BLT, or for hosting my entourage in our quest for last minute liquid courage before the big event.  That site is smaller, but the food is much better.  This Six Pence has an extraordinarily great structure - much larger area, separate bar area to keep the noise confined, and everything is nice new wood.  It's a treat.  The food, however - my salmon BLT was not what I had fallen in love with in Blowing Rock.  The food was uninspired - the big bacon strips were good, hard to mess those up...  We did the groupon, so the price ended up being fair.  Without that I might have had more of a beef."}
{"text":"Great bar with a decent selection of beers on tap. Friendly service and relaxed atmosphere. It gets 4 stars.   Food gets a solid 3 stars. Better than I expected, except for the really overcooked vegetables. How can you go wrong with roast beef and gravy?  A short drive and welcome relief from the never ending string of chain restaurants in Rock Hill."}
{"text":"I've been here a few times. The location is nice. We took the elevator and sat on the patio area. View is nice and and there is also a bartender up there. Service was pretty good. Drinks were also good and decent price. That whole area was nice and relaxing and a great place to have a drink and to catch up with friends. I will definitely come back when it's not so hot!"}
{"text":"I ate here with a group of friends from out of town on Saturday night.  The atmosphere was good and we sat at one of the larger round tables below a chandelier that looked like \"it could kill all of us at once\", a friend noted.  Since I was at an English pub, I selected the small order of Fish & Chips and I was fairly impressed by the size of the cod and the right amount of breading fried enough where it wasn't too greasy.  The fries or 'chips' were standard, but the fish was good and large enough for me to be happy.  I even took one of the large pieces home for the wife.  My friends got a myriad of things and they all had good things to say due to the large portions, especially the nachos.  Another English-fare eats include Bangers and Mash from what I remember.    After dinner, we went to the rooftop and had a drink or two.  It was a nice night for it, and the lighting was good and we had a friendly server upstairs who offered a sample of beer that we weren't familiar with.  I would come back if I was in the mood for English food and rooftop scene in Fort Mill."}
{"text":"Six Pence Pub is an English themed pub.  The restaurant has a neat English decor with an English themed menu.    For a starter, we ordered an order of Scotch eggs.  The menu listed it as \"eggs\" (plural) and I asked if that meant 2 eggs.  The waitress explained that it was served as \"sort of like 6 half eggs\".  The preparation was different than any other Scotch eggs I've tried.  They were a bit skimpy on the egg portion (I think it might have been 1 and a half or 2 eggs divided into 6 pieces for serving) but they were generous on the sausage portion of the dish.  Despite not being what I expected, they were pretty good.  For my meal, I had the Shepherds Pie - which was pretty traditional although it was prepared with beef instead of lamb. It was served with a generous side salad and was quite good.  My wife ordered her \"go to\" dish -- salmon -  which was their special when we were there.  The salmon \"special\" was listed as a Bourbon glazed salmon.  My wife said the salmon itself was good but it was very  skimpy on the Bourbon glaze.  The mixed veggies were decent - had a good flavor but were a bit over-cooked.  Service was excellent.  Our waitress was very personable and was very efficient.  She was attentive without being intrusive and timed the dishes well.  Six Pence offers a good selection of British and Irish beers as well as a variety of other craft beers.  Overall - service was good / food was good / prices were reasonable."}
{"text":"Wanted to surprise my husband, we were both pleased. The atmosphere was true Irish, the food great. Looking forward to eat again, this time on the rooftop with a view. A lot of food and not a big bill."}
{"text":"After having lots of great experiences at English style pubs in my home town, I was hoping for something great, but Six Pence might have been the largest let me down on my trip to NC.  The interior was pretty neat and had a great atmosphere, but my party really wanted to go to the roof-top-seating, which the roof has a decent view of the town, but the seating was questionable. They can only fit 4 people per table and my party of six were fixed on sitting on the roof, so our waiter offered to move 2 table together but they are bolted to the floor tiles (even though we thought it was questionable), so when the waiter picked up table and roof tile, the manager or bar tender came over and started to tell us off even though we weren't the ones who were doing it. We instead just moved 6 seats to one table and it was cramp. The service already being off on a bad start, also got worse when our waitress took a considerably long time to take our orders and bring us our drinks.  As for the food and drink, the drinks were weak and served in dinky plastic cups ( probably because we were on the roof ), but what was the greatest disappointment was the food. I got the simple pub burger because everything else was 15-20 dollars. Even then, the burger was 12 dollars and only came with a single piece of wilted dried lettuce and flavorless bland (cheddar) cheese and a few drops of mayonnaise on a dry onion roll. You get a way more flavorful and juicy burger at Culver's for less than half the price. It was so bland and flavorless that it made me not even want to take a picture for this review. The only upside was their potato salad.  My friends also got the Shephard's pie which looked pretty pathetic. For nearly 16 dollars it was only the tiniest bowl of ground beef with mashed potato on top with a side salad. These prices are pretty high for really really basic food.  This was probably the least favorite place from my vacation to Charlotte especially since there are tons of amazing places around to eat."}
{"text":"First time at the Pub!   We ordered Shepard's Pie & Fish&Chips - it was so yummy, we gobbled it up. The service was incredible - we didn't have to ask him to replenish my coke/water he did it himself. The location is absolutely amazing and beautiful! A great place to hang out for the night!"}
{"text":"Always a great place to grab a bite or a brew. Never had a bad experience! Everyone is friendly and the atmosphere is great!"}
{"text":"Really quiet on a Sunday because people drank the night before. Typical Irish pub. We sat upstairs on thr deck. Nice day. I ordered a crab stuffed portobello mushrooom. Way too much mozzarella, bland spinach, crab ok. No sauce, that sucked. But, the saving grace was the Shepherd's pie. Oh, me lads and lassies, GET THAT SHITE! I was disappointed in came in a small crock, but it was rich and decadent, potatoes were delicious and it was smothered with cheese. It came with a saad, which was useless, I'd rather have a big, fluffy biscuit to sop up the beefy sauce underneath. I Kept dipping into Baldie's because after that mushroom, I was starving. Next time I get my own. I'll be back for that"}
{"text":"This is one of my and my wife's favorite places.  The food here is just plain good. I am a big fan of their fish and chips but the burgers we've had here have also been excellent. I'd say the food is also a half step more authentic than your typical pub of this type.  My only real complaint is that it is a bit pricy for pub food.  I guess you get what you pay for and I must admit I am willing to spend a little extra for better than your average pub food.  But $6 for a bowl of onion soup and $14 for the small fish and chips are just examples of it being just a little high (IMHO) That said we will be back again."}
{"text":"Average pub atmosphere, but their dinning room is dull as dirt. Their food leaves room for improvement while their drinks are typical. The staff is knowledgeable and friendly, but lile I said, their food and drinks need improvement"}
{"text":"Great place for a beer and shepherds pie.   Love the vibe of the place and roof top is a great place during the  day.   Visit here while in baxter"}
{"text":"Wasn't super impressed at our first visit on New Years Day. Restaurant was empty but took nearly 20 minutes to receive our waters and have our orders taken. Asked hostess for pencils/pens for kids to color on the back of their place settings and found out they had crayons the whole time...never offered to us. The lunch menu is overpriced. We ordered nachos (approx $14), fish and chips (approx $14) and a kids' grilled cheese (approx $8). On Sundays (and Tuesdays) kids eat free but this was never told to us by our waiter--just fyi. The food is \"meh\"... nachos were large but pretty tasteless; just beans meat and cheese with lettuce thrown on top of a pile of tortilla chips. The fish and chips came with two pieces for deep fried fish and some homemade potato fries... really missing something like a pickle, some fruit or veggies...something. The best part of the meal was the potato chips that came with our sons' grilled cheese. I think those are made in-house and were fantastic. Service was pretty bad honestly. After being made to wait for so long our drinks weren't refilled until we were ready to leave. Also didn't get checked up on throughout our meal to see if we needed anything. Waiter wasn't aware of beers on tap, etc. When we paid the waiter shorted our change and only returned large bills which was pretty tacky. Disappointing."}
{"text":"We sat at the pub bar tables. Ordered draft strongbow cider, bass, and a half&half (guinness+harp). All our drinks were delicious, except we were thrown off with the 16 oz. \"pints.\" waitress was very nice and attentive. Our food was fish & chips (small size), bangers & mash, and the salmon. Everything was delicious! We got the bread pudding for dessert which was huge and very good. I've never had bread pudding before but I couldn't imagine it being better. Warm & sweet. The interior was clean and nice decor."}
{"text":"SPP is in the Baxter Town development. It's a tidy little everything-is-here community and SPP follows suit.  I had a local brew, which was nice to have available. Chicken wings were plump with an excellent buffalo/bbq combo sauce. I could have used a couple of extra minutes in the deep fry for mine, but they were good. The entree for me was a Flaming Blue burger and a side of collards. The collards were a highlight and the burger had several flavors going on... very tasty. It was cooked correctly (medium for me) as well. Service was almost too good... very attentive."}
{"text":"I can only speak for the bar side, as I never eat pub food as a rule. I am more of the organic vegan type.  The atmosphere is great. All wood with British decor. They have a nice variety of beer on tap. Some good imports, and even a local microbrewery selection.  You could get a Budweiser too, if that's your preference   The bartender is always friendly, and on his or her game. Very important. I enjoy getting good service at a bar.  BTW, my friends that do eat pub food live their fried pickles."}
{"text":"While attending a conference in near by Rock Hill, a group of us located this district and came for drinks and dinner.  Five of us came to Six Pence to have a drink and get to know each other while we waited for the rest of the group.  The downstairs bar was cute with a great atmosphere.    After dinner a group of us returned to relax in the roof-top patio.  Again very well done but they were not able to retain the Irish feel in this area.  Too bad.  While the beer was excellent as expected I ordered a tequila and tonic.  What was served was in a plastic cup with more ice and drink and the selection of \"bar\" tequila was horrible.  The wait staff was attentive but I was so put off, that I didn't order another round."}
{"text":"The burger's really good. The place is well kept and spacious. It's in Baxter which is an area worth visiting, one of the cooler areas in Charlotte. They have a cool rooftop bar but everyone in your party has to be at least 21 and they don't have a TV up there. They do, however, have a good bar to watch games."}
{"text":"We visited Six pence this past weekend.  My husband ordered the stoufers pie, he loved it.  I ordered Amy's light pasta.   It was really just gross.  I have ordered this a few times in the past and always loved it.  This one was drenched in dressing, I returned it.  The manager came out and said it shouldn't look like that, and said they would recook it.  It came out again the exact same way.  I literally poured the juice out and it filled a bowl.  It tasted like it was soaked in Italian dressing.  The manager never game back out and they took the meal off the ticket but still charged me for the chicken.  The service was horrible as well.  I don't think we will visit again."}
{"text":"While visiting Charlotte, our friends took us out to Six Pence to grab dinner after a stressful day of fooling around in the pool.  We had a large group so it took a few minutes to assemble a table, but we didn't wait very long for a Saturday night.  I ordered the turkey club with sweet potato wedges.  Both my order and a friend's came out on the wrong bread.  Being foolish, I didn't notice they had given me rye bread until I'd already started eating so I didn't send mine back.  The sweet potato wedges came with a side of ranch dipping sauce (or blue cheese, not completely sure).  The food was okay, nothing spectacular but you can't expect much from pub food.  Our waitress was highly entertaining.  She warned us against the soup of the day and when we inquired why she let us sample it for ourselves.  Note: Never go for something called Cream of Beer, especially if it is served cold.  I had a good experience at Six Pence.  The price was right and the service was quick.  From what my friends tell me, they have a great beer selection (although I didn't try anything)."}
{"text":"Stopped in for lunch. Not very crowded but we chose to sit in bar. Bartender had to cover whole area. We waited for a while and then another group came in. Bartender gave them menus and took their drink orders. Did not come to our table until we got up to leave. After a few minutes we asked for a table in the dining area. Quite a while before we saw our waitress. We ordered she crab and French onion soup and asked for the soup as an appetizer. We also ordered fish and chips to split. The she crab was wonderful, the onion average. After about 3 bites, waitress brought the meal. Fish was very nice, chips were soggy and cold. Wings seemed to be the best deal of the day, lots of folks enjoying them."}
{"text":"Interior of bar cool. Beer selection decent .French onion soup very good . Scotch eggs were awful .  Don't understand their take of scotch eggs at all . They should stop serving them ."}
{"text":"If you're in the Fort Mill area, this restaurant is worth checking out. The food menu is HUGE and everything I've tried has been awesome. They have a lot of draft beer options as well as a full bar, plus during the warm months they have a rooftop patio to dine on (and you can get there by elevator after a few too many drinks!). The staff is incredibly friendly and helpful, my experience has always been a positive one here.   I recommend the pork chops for dinner, the burgers are great for lunch as well!"}
{"text":"I'm not much of one for bars but when I'm in the Charlotte area I always make a stop at Six Pence. The food is decent, pretty standard bar food fare but I rarely eat there. Beers are priced fairly but shots are on the expensive side. Bartenders are friendly, attentive, professional and generally willing to talk if you and your friends are in the mood for a good conversation. It can get a little loud on weekend nights but never too rowdy; I've never seen a fight or anything like that. Also, if the weather is nice make sure to check out the rooftop bar."}
{"text":"We had opportunity to have a family dinner on Friday at this dinner at lunch his location in Fort Mill, South Carolina. This is a beautiful complex and location for both shopping and eating.   This is worth the drive to just be able to see what's in the area and available from McALLISTERS Deli, to fish, steak and other venues for breakfast, lunch or dinner.   Food was good, service was good and location excellent."}
{"text":"We came here for lunch with my team on weekday  Crowd is good, people are nice  Service is on time, this is second time I came to this place.  I liked it"}
