{"text":"Friday night they got a really bad JD, who plays the same music every time a few sons only and keep repeating it all night it gets boring. Some people call this a salsa club, but it is not, they don't play salsa. This place does not attract a lot of people; it is small and plays bad Latin music. Don't waste your night there!"}
{"text":"Went in for a late lunch. Worst margaritas ever! Food was mediocre and overpriced. Service was terrible! Had to ask for napkins. Never got silverware. Waitress never checked on us to see how food or drinks were. When we were paying our bill, she asked about our almost full drinks. I told her they were terrible. She acted like it was our fault for not telling her. Hard to tell you when you don't ask!"}
{"text":"The staff was so RUDE! 1st door guy said we could come in for free anytime Fri night. We came back about 20 min later. Different door guy and some old ladies who would not let us in, said we had to each pay $10. The place was ghetto and empty. We went back to Bar Smith (next door) who had much nicer staff, no cover, great drinks & drink prices, and awesome music. Sorry Sky Lounge, you suck."}
{"text":"This place is very fun...saw Piano Man there...great concert.  They specialize in tribute bands and it's the nicest showroom in town...we are headed back to see the Bob Seger tribute concert in March.  There is a two item minimum besides your tickets...either drinks or food..."}
{"text":"from what I remember (and was told!!) we had a blast here!  drank and danced after a suns game for about 3 hours.  Music was great for dancing....not sure about the comments here about no alcohol on the bottom floor, but there si a full bar on the ground floor...maybe I missed a basement...but then again , I am over 21 so I wouldn't care.  Great time, will go back for another!"}
{"text":"DONT USE YOUR CREDIT/DEBIT CARD! Bartenders will tip them self after you leave Even if you already tip them with cash!"}
{"text":"Food poisoning alert!!  I am in town for the superbowl and grabbed a quick lunch here on Friday. Today is Monday and I am still sick. My wife and I shared a sampler platter of appetizers and we have both been sick since. We think it was the ranch dressing that came with the meal. Thanks for ruining our vacation!"}
{"text":"The view is amazing! We luckily we happened to stop in during happy hour which made it more reasonable for drinks and apps. Drinks were 2 for 1. We had an old fashion and caramelized pineapple manhattans. We also half priced appetizers: roasted tomato fondue and ahi tuna poke. They were both delicious but I would recommend eating the poke first as the spice of the fondue killed the taste. We loved the experience but without the Happy Hour discount it would have been very expensive."}
{"text":"If I could give this place zero stars, I would. I called to see if they were open on Thursday night and the girl who answered the phone had EXTREMELY poor phone etiquette. I haven't even been inside the place but if they're going to be answering their phone like that chick did, I'm not even going to bother setting foot in there.  She answered the phone and while I was asking my question, it appears as if she was talking to someone else in front of her. That's got to be the most annoying shit ever!!"}
{"text":"Been there a few time and had a great time good venue. Been there with friends from out of town and never had a bad time. Always enjoyed  suggesting just be a little strict with the dress code."}
{"text":"Amazing view of Vegas Strip  I had appetizers and drinks one night while I was in Vegas and I must say I enjoyed every minute. The drinks were tasty and the food was good. I had the sliders. Amazing view esp at sunset and night time."}
{"text":"Firstly, parking, if you don't want to get towed, most areas are $10 near by. The line to get in was long but it didn't take that long to get in which was amazing, maybe 15 minutes. There was no cover for ladies but it was $20 for guys. Oh and we came on a Saturday night around 11:30 for context.   The first floor is 18+ and it was hip hop/latin. The second level is 21+ and it was hip hop/latin. The second floor was much nicer, it had a terrace and a larger dance floor. When it comes to music and atmosphere, it's great."}
{"text":"While I totally understand the appeal of this place, as the view speaks for itself and the lavish ambience and exclusive entrance up the elevator seems like a pregame night in heaven, as I say and all of my reviews, I don't care how upscale the place looks - if I don't get good service it's just not worth it for me to stay there. I was there with a group of about 10 people, both family and friends and we sat down, ordered a big round of drinks and also a huge appetizer. The drinks were dropped about 20 minutes after we ordered them, and the appetizer never came. We waited for about an hour, we finally asked for our bill and said we had dinner reservation somewhere so to take the appetizer off the bill. When we said this, the server looked perplexed as if she had no recollection of us ordering the appetizer to begin with. in a boring conclusion, the appetizer was removed from our bill and we all laughed thinking \"what the hell?\" Before we left, we went out side to the balcony that overlooks the entire city of Las Vegas and took photos, which was nice. We then proceeded to dine at Rivea the restaurant next-door. Check out my next review to learn more about that place."}
{"text":"Went there with 3 friends, place was dead from 8:30-11, no one really in there....the best thing was the $2 coronas and the $1 drinks tickets i got from a smoking hot cougar in a BMW by the downtown sheraton one night."}
{"text":"The days and hours of operation need to be updated it's definitely not open on Sundays. I would give zero stars if it were an option."}
{"text":"Don't know why lots of people dislike this place for. I think it's pretty cool. I had a good time here. Upstairs gets a but crowded but beside that it's pretty good  music is really and that's what I look for."}
{"text":"5 stars for the drunk females and 1 star for the place being so small! lol ;p It's 21 and over on the second floor and below it's 18+ they don't serve alcohol at the bottom."}
{"text":"Saturday night they had like 3 dollar AMFs.  Thats cheap.  And they had 2 dollar beers.  Thats cheap.  It was kinda dead, and the fact that the bottom floor was 18 and up, it was hard to tell if the ladies were old enough for this guy.  So i stayed on the top floor, which ended up getting me shots purchased by a group of southwest airlines flight attendants.  Seemed like a decent place.  Its right next door to 2 other clubs, and i chose this one cuz some homeless guy outside said this place had hotter chicks."}
{"text":"So we are from Europe and have lived in Mexico, Miami and Los Angeles. Call me crazy but isn't there ANYWHERE in Phoenix to dance. God forbid you go to Sky Lounge on a Saturday night. OMG. Downstairs is 18 and under and upstairs was pounding and I mean pounding bass with hard super hard rap and for att least 8 songs we waited for one danceable song..........nada.   Waaaah. So we left."}
{"text":"We stopped by Sky Lounge for few drinks after the Chris Brown Concert ...  I had never been in here before so I didn't really know what to expect nor did I have too high of expectations ... We ended up coming in here because we didn't want to wait in line to get into the place next door and someone out front handed us a few complimentary shot tickets...  The music was decent, but it was quite slow inside.  You have to take into consideration it was a Monday night though and probably only open because of the Chris Brown concert going on ...  We redeemed our complimentary shot tickets upon arrival @ the bar and were served two warm tequila shots .... Gross and hard to drink, plus we weren't given any salt :(  Fail ...  We stuck to drinking gray goose & sodas with lime and they were pretty safe for the most part ...  We managed to make the best of it and had a good time regardless of the situation.  I would give this spot a solid two star rating - there wasn't anything particularly exceptional about the inside/interior of the lounge - it appeared to be pretty average for a lounge.  Overall - It was just pretty much okay/mediocre for the most part ... They should have offered more drink specials to get people in the door for a Monday night ....would i come back? Ehhh maybe if I was desperate to do something after getting done @ Talking Stick Arena."}
{"text":"I have to say just like most everyone else I was not fond of the $10 cover charge on a friday and less than an hour to close.  The other thing is it I'm new to PHX and I mentioned this to the guy out front before asking what time they close. It would of been nice of him to be have mentioned \"You are new so I'll let you know our bar just closed at 2 & we are not serving any more drinks\" but he didn't.   They do have a Latin dance floor on the first floor which i liked the songs they were playing. As far as the 2nd floor its Hip-hop all the way which is nice in case you get tired its almost like 2 clubs in one.  I think I would check this place out again if i get there earlier and have someone to dance with cause every girl I saw that got asked to dance just turned every guy down no questions asked! LOL"}
{"text":"1 star is more than this place deserves. We came in one afternoon and they were out of every kind of beer, we ordered a burger and it was disgusting. It tasted like horrible meat and was so over-seasoned. The staff was horrible. We tried telling them how bad the food was and they did not care at all. I would NEVER go back to this place again. DO NOT COME HERE!!!"}
{"text":"Rude bartenders who don't treat their clients like they matter.  walked in since some promoter gave us a pass for a free drink and when we went to redeem it the bartender looked at us and said \"I don't know what that card is, go ask who ever gave it to you what it means\". Being in the service industry, it's imperative your bartenders are briefed before each shift of any promotions or you run the risk of them running off clients with their incompetence. Left this place without spending any money and opted to pay a cover at the bar next door, bar smith, with much better service.   Never will return as long as they hire people who think they are owners when they are just serving drinks behind the bar."}
{"text":"It is what it is.. overpriced alcohol for tourists. I recommend coming here for a beer. It's truly the only thing reasonably priced here. Don't expect an employee discount."}
{"text":"My girlfriends and I were in Phoenix for a weekend away from SF and unfortunately, there weren't very many options for classier places in the area we stayed in.   Sky Lounge was across the street from Hotel Palomar, so after dinner and a few drinks, we decided to check it out. Even with our buzz, this place was a bust!   We had to pay $10 cover (which isn't really a big deal) to get in to a place w/c wasn't even nice (interior-wise) and had a practically empty downstairs area. However, that might be better than going upstairs with all the creepers looking to prey on drunk girls.   Wasn't our scene, so we left after 15 minutes and $50 poorer."}
{"text":"HORRIBLY RUDE!!!  I'm staying 2-3 blocks away and they are blasting music outside on a Sunday night after midnight.  Apparently they can do this until 2am.  They are known to do it regularly.  Police and mayors office won't stop this.   I'm never staying in Downtown Phoenix again!!!!!  Why are you blasting music throughout Downtown Phoenix past midnight on a Sunday?   Downtown Phoenix sucks because of your loud music!  Be a considerate neighbor on keep the noise inside your club and out of my hotel room!"}
{"text":"I played here once and thought this spot was pretty cool. I liked how it was layed out and all but it was not that great of a location for DJ's/Dancers. It's ok but it did seem to be a bit too small for the crowd."}
{"text":"The owner was extremely friendly and very attentive. Had my first ever fish taco it was amazing. Also has carne asada taco which were full of flavor."}
{"text":"Got two beers. Guinness and pabst. Expired and bad. Replaced with Miller high life. Same thing. Over two years old. Terrible service.   Don't get beer here."}
{"text":"Wonderful new menu!!! The chicken quesadilla was delicious. Thank you Lilly for the wonderful service & Freddie for the great happy hour too!!  We will be back!"}
{"text":"Been here a few times over the last 5+ years but I must be getting older or the crowd has really changed.  The music was average, some Latin pop/dance stuff.  If I was exaggerating about this next comment than I would be a pig, but it's the truth, --- there was a LOT of very large women here, all in their shinny, way too short, way too tight clothes.  Again, sorry but it was the truth.  Had a couple of drinks and left.  Didn't even go hang around the under 21 section downstairs.  Just kidding, I would never do that."}
{"text":"This place is a joke.  The girls that were handling the cover wouldn't give me my money back from being in that place for only 1 min...   They weren't apologetic at all... On top of that, no one was in there."}
{"text":"My female best friend and I were in town for the night, road-tripping. It seemed like a nice place inside - totally empty, but it was late and a weeknight, so I didn't think much of it. I didn't have much of a problem with drinks, or service until later that night... and that's why I'm taking the time to give this place a 1-star review.  This is a review about a certain bartender, whose name my friend and I never got, but he said he was Chinese and Colombian.   The area seems to close down early.... even though there seemed to be a basketball game getting out. The bartender said he was closing up early, directed us to another bar (closed when we got there) hand we found a place nearby. Shortly after, the same bartender showed up at the bar, started drinking with us. I don't remember much about the conversation, except for some lies this guy was telling us, saying that he was running the bar after two weeks of working there, that he didn't live in Phoenix, he lived in New York - later, he forgot that he said that, and told us he lived in the same city in California that we did.  By the time the bar closed, I was getting pretty sloshed, and he proceeded to invite himself to our motel room (I thought my friend invited him, and my friend thought I did), and by the time we got to my friend's car, he insisted I sit in the back seat.  I'll skip some details here, and make a long story short:  I puked on the ride home, so I spent the rest of the night sobering up. The Chinese/Colombian guy kept pushing weed and beer on my friend (who's a lesbian, by the way) and when you're a man, you can tell when a guy is being a sleazeball and trying to get into a girl's pants. It became blatantly obvious that he was waiting for me to pass out so he could do what he wanted, and so I forced myself to stay awake. Again, I'm skipping on a lot of detail here, because Yelp really isn't the place for that. After he had long overstayed his welcome (which was never offered in the first place), my friend went to the bathroom, and I mustered all the civility I had left to ask him to leave as nicely and non-offensively as possible. To this, he insisted that unless I reimbursed him for the pot and beer he brought (neither of which I personally imbibed) he didn't have to leave. I bit my tongue. Shortly after, I could hear him talking about me outside when he and my friend were having a cigarette. I snapped, had to get rude with him, pulled my friend inside and slammed the door in his face.   The point of this whole review is this: Ladies, watch out for this sleazeball bartender. He'll try to get into your pants by the most disrespectable means."}
{"text":"Latin/Electro/Hip Hop Bar/Club.. if that is a thing. That's what Sky Lounge is.  I had a great time here celebrating one of my best friends being back in the valley. Down stairs looked very empty. It had an open dance floor and a long bar, and different music than from what is upstairs. Upstairs... oh dear... it was packed. There was a DJ from the Hip Hop station in AZ 98.3 and dancing everywhere.  There are VIP Tables on the balcony, kind of small space and not hte typical VIP service where your table is protected. A lot of randoms were just sitting and stole some beer from another table. just. great... lol.  Summary: Music awesome. Ambiance it is a club so be ready for it (at least the second floor) vip service needs improvements"}
{"text":"Why are locals treated badly?  And at this time of all times (shooting)...   The most unwelcoming place I have been to lately as a Local. Sad, for I live on the Strip! I had not visited Sky Lounge in 2 years. Back then always had a good experience. My  Bartender most often a Hispanic gentleman...and gentleman he always was to me and all customers.   I was overlooked today while tourist/visitors were welcomed. How did bartender know I was local? Is a lone female assumed to be a prostitute? My drink order was wrong. Ordered a French 75 and incorrect liquor used. It was Happy Hour so I wasn't going to complain. The drink was untasty. Drank one (2for1) but left the other.  Ordered food and was not given utensils, nor offered any. Yet the couple to my left and the 20 somethings to my right were catered to, given a warm hospitality welcome...   The saving grace was a bartender/bareback  Who asked if I needed anything.   I work in the service industry, serving minimum 500 people per day. I will not return to Sky Lounge and when asked about places to go by my customers, I will definitely tell them to avoid Stratosphere and the Sky Lounge!"}
{"text":"Very expensive. I didnt like the place, the waiter started to rush the floor while we were eating. Pizzas not really good."}
{"text":"This place is awesome! I usually get the VIP on the second floor. Service is always great people are always friendly and there is always something happening there! From foam parties to all dressed in white events! I would definitely recommend checking it out if you want to have an amazing time down town PHX"}
{"text":"Been here over a dozen times, had some good and some bad. Overall the place is okay with me. The 1st floor never plays any good music, 2nd floor is where it goes down! Gets pretty packed on the weekends."}
