{"text":"Great bar and restaurant. Nick the Chef brings interesting new specials every week. Stop in and try his offerings. Also ask for Kylie as your server. Delightful individual who will make your time there enjoyable."}
{"text":"Great people and awesome food along with one of the best patios in Gilbert.  The cajun wings are delicious and their Jagermeister is the best around."}
{"text":"Dana & Kristen are the best!! I love coming and sitting at the bar! I've known Dana since 2008 & have recommended Slates many times. The kitchen is inconsistent. You never know what will come out!"}
{"text":"Breakfast, Lunch and Dinner 7 days a week! Live music, a beautiful patio, happy hour... The list goes on and on! Slate is a great place for happy hour with friends or a delicious prime rib dinner! Bring the kids because they eat for 99 cents! Open to the public, so don't be afraid to try something close to home!"}
{"text":"Great breakfast. Had it delivered, and everything showed up in separate containers ensuring each ingredients quality was preserved. Extra steps taken with everything. Great biscuit sliced and grilled, same with the English muffin, poached eggs were proper runny, ham was crisped up, holandaise wasn't broken, and sausage gravy was spot on. Best American breakfast I've had in a while. I'll be getting again. Oh and even being delivered my hash browns were still crispy. Well played slate!"}
{"text":"The food here was really good and Dana the bartender has a great personality.  It's a great place to hang out after a round of golf or just to pop in for a bite."}
{"text":"Very disappointing service. Went there on Sunday morning and saw 5 open tables. We were offered bar seating which frankly sucks. Talk about about being seated at the back of the bus. No more business for this place!!!!"}
{"text":"Went in for a late lunch, and sat 5 minutes while 2 servers behind the bar talked, and 1 at the counter surfed her smart phone. It wasn't busy. We decided to eat elsewhere. Hey Slates, what happened to the great service you used to have???"}
{"text":"Went for prime rib night. Food was very good. Service was excellent. Would have totally enjoyed the experience except for the music. So loud that couldn't have any type of comfesatiodm. Would like to return. But the music is a turn off. ."}
{"text":"The only thing keeping this from a higher rating is service which sets the tone for the whole meal.  It is never the same twice, our perception is that they are always training new servers and an atmosphere of chaos and/or not enough help surrounding the prep areas very noticeable when golfers stop in between the 9th and 10th holes during the day or when a large group finishes in the late afternoon. Follow up by servers during the meal seems rare or not timely.  During our most recent visit two tables near us asked several times where their food or drink was and servers seemed at a loss?   Food is good, portions are generous, prices inline with quality and dining area comfortable.  Indoor and outdoor seating available, fireplaces on the patio for winter, nice view of the 1st and 10th tees to watch golfers while you are dining and two TV's to watch sporting events."}
{"text":"Tried this place using door dash. I ordered fish and chips which was twelve bucks. I got three thin little chunks of white fish and burnt fries. My wife ordered the quesadilla with steak and I have to say the fish and chips were a rip off. The quesadilla was okay but the fish was disgusting and the fries were burnt and soggy. How does that happen? Won't patronize this place again. Denny's has better quality options."}
{"text":"It was a wonderful surprise! Food was amazing and the atmosphere great! Can't wait to go back and sit outside by the fireplace! I had the fettuccine alfredo with chicken it was amazing! Everyone loved their meals! Meatloaf. Prime rib. French dip sandwich. My husband has been searching for a good piece of  walleye and found it!"}
{"text":"We showed up at around 1:00 pm for lunch and the place was dead. We stood at the hostess  station to be seated for 10 minutes before I finally went and found someone to seat us. After being sat, no one waited on us so I went and found a menu by my self. The waitress finally came and took our order. The food was ok and in my mind subpar. I will not be eating there again anytime soon."}
{"text":"My husband and I had breakfast here and the food and service were great!  Clean light and bright eating area with a view of the golf course from the window.  It was to hot to eat outdoors on the patio, but when it cools down that would be a nice place to enjoy lunch or Apps/Sipps with a view of the course and golf carts going by.  We had typical breakfast faire and it was good and came to our table promptly.   The lunch and dinner menu have more options than breakfast.  Also they have some specials sometimes.  It was seat yourself (open seating) when we went."}
{"text":"went there for breakfast had cornbeef hash very tasty wife had pulled pork tacos w/poached eggs she was not as pleased as i but i thought it was good she thought it could use a bit more fluff ie avo fresh tomato ect ...i agreed service was excellent and very lovely as well"}
{"text":"This place is amazing! Everything we had on the menu was superb & the service was top notch! Bruschetta, lobster roll, crab cake sandwich, prime rib, drinks...all so tasty! Blake was our waiter & he was vey friendly! Plus, kids meals for 99¢?! Can't beat it! We will definitely be back!"}
{"text":"Slate Bistro and Bar is located inside of Trilogy Golf Club at Power Ranch.  It is, despite the guard gate, open to the public.  They serve breakfast, lunch and dinner.  I have eaten all three meals there and they do them all well.  In fact, Slate has been nominated for the Best Breakfast in Gilbert 2014.  The prices are some of the best I have seen for both food and drinks.   There is a full bar as well.  Slate has a very nice ambiance and feels as though you are in a nice restaurant without the stuffy air.  It is a great place to grab a meal after a round, get a few drinks for affordable prices or have a long meal.  The menu has a little bit of everything to hit all tastes and they do offer specials on certain nights.  There is even live music on certain nights, usually Mondays, Tuesdays and Thursdays.  Make sure to call ahead on weekends as they do sometimes close for weddings.  They also do offer reservations and while in snowbird season helps.   Slate is a really good, consistent non-chain restaurant in an area lacking restaurants.  Definitely a good find."}
{"text":"This place is just terrible on their BEST night! I've never really been a fan of the food but the drink prices are great and the service was always okay so we became  \"Members\"........This last year it has gone down hill FAST! Just left there from having dinner with my two Kids......Chicken fingers were burned and tasted like they were from yesterday...or the day before. They comped them. Which is their job so I won't get too excited about this. My sandwich was okay, nothing super memorable other than the BURNT chicken fingers. Took a Burger with bacon home to my Husband....the bacon was BLACK....so BURNT it was really quite unbelievable they would serve it to anyone. Burger, bun, and bacon and about 12 french fries for $12! No lettuce, mayo,  tomato, onion or a  pickle. My Husband said it was most deffinetley a frozen patty! They comped one kids meal due to the BURNT-ness of the chicken fingers! I have to say I have never really seen burnt deep fried food until tonight! So on that note I really have to give them some KUDOS. With one kids meal being comped and two Adult sandwiches and another Kids meal it was still $40! RIP OFF!!! I just can't imagine going back again. The last  4-5 times I have been there it has been a NIGHTMARE...with comps and long waits and forgotten items. I have decided not to give their food anymore chances so IF I do go back it will be to drink because as I mentioned above they have Great prices on their drinks."}
{"text":"Really a great place to eat regardless of if you live in Trilogy or not. Breakfast is fresh, haven't had much experience with lunch but my wife had a sandwich that she loved. The Benedict is one of the better I have had. The only reason I didn't give it five stars was the wait staff. While very nice, it seems as though there is always someone new who is training. I would assume a high attrition rate contributes to this. It may be had to keel staff there due to the low check amounts caused by great prices....as well as placement in a senior community ( not know for leaving the best tips ). The clubhouse is always clean and presentable. There is a bar and often you will find golfer on their way in or out to play but have never had a experience with drunken weekend warriors there that you find at a number of other clubhouses in the valley. Never had the loud profanity often found in clubhouse bars. It's for this reason that I enjoy taking my two young sons there for breakfast. The have great kids plates and are very accommodating to families with kids...something also hard to find in clubhouses."}
{"text":"It's my first time trying this place and I did it through door dash. Let me say this review in no way reflects on my dasher. He was fast and courteous and kept me up to date.    I order the chicken Cordon Bleu, chicken tenders with fries, and mini dessert sample.    For the chicken Cordon Bleu I had mashed potatoes and asparagus for my sides. That asparagus were good. The actual chicken Cordon Bleu itself was very thin and not a lot of filling. I'm used to a nice big round piece with a good amount of filling this one seems like it was frozen and then fried/cooked. I also found a white hair in my garlic mashed potatoes.   For the chicken tenders and fries I have to say they were both good in taste but they give you two chicken tenders that are very thin and fries. Not worth the money in my opinion.   For the mini desserts sample I have to say it literally means mini desert temple. These are the smallest samplings of anything I have ever ordered and I would never order this again for five dollars."}
{"text":"The food here is disgusting. We tried to order food from the menu only to be told that they no longer had any. They were in the midst of changing their menu. Then provide a correct menu. We finally settled for the French dip sandwich.  The meat was old and rubbery.  The cheese was one slice of cheese. The bread was gummy from the meat juices.  The waitress decided to forget us after that. She hung out near the bar the rest of the time. We had to wave her over just to get our check."}
{"text":"I have ordered from Slate a few times now. What on earth do they do for their shrimp cocktail to be superb compared to others?  The last order I placed contained 3, yes, 3, orders of their shrimp cocktail. It's one of the few places around (for delivery) that have it on the menu. $11 huge shrimpos, charred lemon and house cocktail sauce. Incredible! I eat the leftover cocktail sauce. Go on, feel free to judge me but it's that good.  The burchetta surprised me when it arrived because I was expecting the bread slices similar to other places with mix and match bruchetta boards. Slate has what would be bite size bruchetta for me, sliced in half so they're nibble sized, for me.... again, go ahead and judge me. It was delicious but I certainly wanted more. I'm likely to skip next time just due to the cost vs the portion.   I've also had their Kale salad. I have to admit, it was more kale than anything else and for me, it almost tasted as though the quinoa wasn't properly toasted off to get rid of that fast quinoa has when it's hit boiled. Not my favorite although the kale was fresh it just didn't do it for me.   I would live on the shrimp cocktail though and I know it's a weird item to go on and on about. I'd like to give their dinner menu a try only I keep finding myself ordering around lunch time before dinner is offered.   Next? That lobster risotto. I will def update once I've tried a few more items out."}
{"text":"Awesome Happy Hour prices!!!  Chicken wings were nice and crispy, but needed a little more of a kick.  The nachos were just ok, but the flatbread was delish and the beer frosty cold. Our waitress Dana was helpful and friendly.  The restaurant itself was nicely decorated and clean.  Overall, a very nice experience!!!"}
{"text":"We live in Trilogy and love this place!  Food is always good and the staff is very professional.  We like the atmosphere and feel privileged to have this place so close.  Menu has many options and everything we try is great!!!"}
{"text":"Played golf at Trilogy on Saturday went in for drinks and lunch after,  there were 5 people behind bar no one even came to take our order until we went to bar.  They said they would send someone over this took another bit of time,  we placed drink order asked for ice water with our beers, beers came no water.  She did give us menus but never came back to take order or ask if we needed another drink, she and every one else too busy texting on their phones.  The only way we got our tab was to ask a waiter to bring it, then they tried to charge us for food we never even got to order.  This process took even longer to get out of there.  POOR SERVICE POOR MANAGEMENT !!!  We went down the road to Blue 32 Sports Bar great service, will never stop in at Slate again!"}
{"text":"Our family and friends love this place. Shannon the bartender is awesome and it's a great place to hang out and get a Great meal after a round of golf.  Suprizingly the cost is reasonable too! Best of all the happy hour will blow you away. Best part is you don't have to live in trilogy to take advantage of the 15% member discount at slate."}
{"text":"Favorite place to eat. Great food and drink. Nice atmosphere. Service is terrific.  Entertainment is really good, especially Laurence the Brit."}
{"text":"Food was AMAZING!!! Ordered from Doordash and they actually separated the toppings for the nachos, which is so on point! Chef board was packed with flavor and had equal amounts of everything. The grilled shrimp were so flavorful! Meatloaf and grilled portobello were delicious. Looking forward to dining in the restaurant!! Thank you!"}
{"text":"Consistently great service & good food  Friendly staff. Happy hour prices & wide variety of  selection to choose from during this time. Children's menu also has a nice variety . Nice view of golf course & San Tan Mountains"}
{"text":"We rented a home for a few months inside TRILOGY at POWER RANCH and I'd stop at SLATE on my way home.  At least a couple of times per week, I'd stop either at the bar (in hot months) or on the patio now as it's cooling down.  I give 4 stars because it IS KIND OF A SENIOR place (i'm no spring chicken but the menu is pretty standard) BUT it is a lovely place to relax and just enjoy.  Everyone is friendly. The other patrons are warm and happy. It's a good feeling to stop here even during the dog-days of summer.  I have to give a SPECIAL SHOUT OUT TO the BEST SERVER - Mickey (MIchelle). She knows everyone and is so warm and kind and welcoming to all her guests. I always look for her when I go because I know she will take care of me.    BUT generally everyone else is very nice here too.  It's NOT a great contemporary menu nor does it serve anything adventurous.  I could make tons of suggestions as a caterer ---- BUT you cannot beat the GOOD FOOD and GOOD COMPANY and great service - Especially by MIckey (Michelle)"}
{"text":"Visited Slate today enjoying golf. Decided to try lunch. Ordered the hamburger which had a lot of free options to add. Service was not overly friendly but efficient. Food came out quickly and hot. Comparison is i have visited cold beer and cheese burgers several times. Slate burger was bigger better and less expensive. Will return"}
{"text":"Good food, efficient service, and reasonable prices.  Nice place to take out-of-town guests."}
{"text":"Had a great time at Slate. Good food and drinks.  Will definitely be back. Our waitress was Lexi and she was awesome."}
{"text":"The Club used to be one of our favorites...but lately the food has been going downhill-quickly.  Sent all 5 of our meals back last Saturday night."}
{"text":"This is my go to place for when I don't feel like cooking and for prime rib.... it is always great. It is a great place to stop in for an appetizer in the afternoon for happy hour. Everyone is friendly and they make you feel at home. It's located in Trilogy but is open to the public."}
{"text":"WOW...a hidden gem.  At least it was to me, but no more!    Slate is located within the Trilogy Golf Club and is open to the public. We gave it a try based on the advise of some friends and were not disappointed.  We had a small group, 3 couples and we were in the mood for something new.   The service was AWESOME, the place was clean and the price was great.  While you can wear casual clothes, you felt like you were at a nicer, non chain, type restaurant...    I ordered the angus tri tip which came with garlic mashed potatoes and vegetables.  I believe the price for this meal was around $15.  My husband had the friday night special which was prime rib, potato and vegetables..$20.  The food was DELICIOUS and it was served just quick enough!  We all split some appetizers pre dinner-mozzarella sticks, Spring rolls, Buschetta and Calamari and again, all was really good!  Here is some more good news....Happy hour is everyday, all day! WOOT WOOT.  I believe all the drinks: beer, wine and mixed are around $2.75- $3.50!!!  I can't wait to go back and try the breakfast...So glad we were recommended this place..its pretty great!"}
