{"text":"Wow!  I was not expecting  that.  This converted house just served me an excellent  lunch.  I will be returning  for sure."}
{"text":"Worst service. Worst food. If you enjoy iceberg lettuce with a puns of cheese, boxed pasta with mediocre sauce and Burt pizza this is the place for you! The restaurant itself is a cool spot but unfortunately there wasn't anyone over 16 working there which made the service terrible. It took an hour to get pasta and salad which seams really long for something simple. They brought the wrong dish and never cleared our glasses or dishes as they started to pile up. I was also with a group of people and none of our food came at the same time although we ordered all together. Poor manners and no management around. The food didn't even make up for it. Bad."}
{"text":"I stopped in for lunch after honestly having driven past this place many times. The interior dining area is comfortable and modern, and their slice/soup or salad option won't break your wallet for lunch. The pizza itself wasn't much to write home about; though the sauce was good, and the crust just right, it was just a little on the greasy side. I'd be willing to come back and try a whole pie for takeout, but this place would be good if you wanted to take a date out for pizza/italian.

Considering that you can't swing a dead cat by its tail and not hit a pizzeria in Mentor, this is one of the ones worth trying since it is a locally owned business surrounded by chain stores."}
{"text":"I have been here twice since this location opened in Mentor. One time I had the Eggplant Parmesan and it was just average. The other time I had the spaghetti bake, I believe it's called. That was pretty good and enjoyable. Their house salad dressing is really good and is available for purchase to take home."}
{"text":"Very pretty atmosphere. Great happy hour selection and prices!! I went with coworkers and it was very cozy and inviting. The staff was also very friendly and helpful. The food is good, the drinks are good! There's even a nice fireplace in the corner. I also like that the \"take out\" area and is separate from the dining room so it don't feel like a \"pizza joint.\" Have and will recommend to others."}
{"text":"Went with my wife for dinner.  It's a small place (a converted house), and the area where you wait for a table is right on top of other guests.  They've also crammed as many tables into a small space as possible.  If you're looking for a quiet spot to enjoy a conversation, this isn't the place.  

Our waitress was very nice and accommodating, I certainly can't fault her for anything.  I ordered the chicken parm, and it was served as a whole breaded breast (not pounded flat).  As a lot of people are aware, when you're breading and frying a whole breast you have to be careful to cook the center without burning the outside.  Slice wasn't aware.  The center of the breast was still pinkish and undercooked.  With beef, that isn't a big deal.  But you HAVE to thoroughly cook chicken.  The red sauce was good...not spectacular.  And I felt it was a bit overpriced.  I wouldn't mind paying $45-$50 for a dinner for two if the meal was better."}
{"text":"Everything is awesome... The food, the staff, the delivery, the dine in (track lighting lil bright haha) but classy Restraunt. Best Italian food by far in Mentor!! I went 4 times in one week!!"}
{"text":"We were returning home from vacation and not in the mood to cook. We googled pizza places near our home and thought the menu looked good.
We ordered the Hot & Slicey and BLT pizza with avocado, as well as a dozen garlic Parm chicken wings. We LOVED everything. The Hot & Slicey had this amazing roasted red pepper sauce, spicy but sweet. The crust was delicious, chewy and really held its own with the other ingredients. There was a ton of toppings on this pizza too, not just one or two pepperonis like other places. 
The BLT pizza was good as well, but there was a ton of mayo on the lettuce (which is in the description). I just wish it was slightly less mayo laden, but I hate mayo so that's my problem.
Wings were cooked perfectly, and the garlic palm sauce (rub?) was so good!!
A perfect ending to a vacation, and we will definitely be ordering from them in the future"}
{"text":"Love this place. We take out all the time. We also pick up there salad dressing for our salads on a monthly basis. 
I just wanted to say tonight I came in with my younger two kids and a younger man helped me with my order and carried it out and held the door for me when I came in. It's nice to see the younger generation have manners and Slice should be proud to ha e such good workers !!!!!!"}
{"text":"Delish. Split a small pizza, wedding soup, side salad & fresh chocolate chip cookie dessert with my 10 yr old son . Everything was awesome. My picky eater loved his first ever wedding soup & ate all the pizza. The fresh chocolate chip cookie was far more than that. It came all gooey in a pan with vanilla ice cream & whipped cream. Yum. We could not finish it. Great first visit."}
{"text":"Horrible experience!  I have dined there in the past and always was just ok with the food, but this last dining experience assured me that I will not be going back. Upon entering the dining room we notice the floor was not so clean and when we sat down our table was very sticky.  I ordered the linguine with clam sauce.  The linguine was so over cooked it was pasty.  The clams looked more like ground meat then actual clams and over all there was no taste to the dish.  I had the waitress take it away and they did take off our bill.  My friend who ordered the Char-Grilled Chicken Salad had more cheese then any other ingredient in the salad and fair to say very little grilled chicken.  We had constant visitors at our table; Flies!!!!  It was unnerving as we swatted them away!  The icing on the cake was when my friend was given a to go box container for the rest of her \"salad\" and before she could put food in  to it droppings of water fell from the ceiling into the open container.  We looked up and above us was a HVAC duct that was sweating and droppings were falling onto the tables.  This would make sense as the booth on the other side of the dining area which also has the duct overhead had a sign indicating \"Don't seat here!\" I wish they would have also put it on the booth where we were sitting before we entered."}
{"text":"Wedding soup is fabulous, pizza is great, I had a Italian sub was delicious, but I was disappointed it doesn't come with lettuce and tomato, banana peppers, an extra charge, first time I had a sub that didn't come with fixings, my only disappointment, I hope they change."}
{"text":"This is one of my favorite stops for pizza here in Lake County. Service is always fantastic and we have never had a bad pizza. The only reason I did not rate them the full 5 stars is because the dining area is very cramped and uncomfortably cold all year round. Food quality is excellent, but certainly not the best ambiance."}
{"text":"The food is good, but the service is terrible. They have one waitress working so if they're busy have fun waiting."}
{"text":"The pizza at Slice is very good, and they have a great variety of toppings. However, the asiago stuffed gnocchi with the abruzzi sauce is my go-to every time. I crave it constantly, and could probably eat it every day. It's so pillowy and the sauce is incredible. It's just a little spicy, though I've noticed they've been making it a little spicier lately, which is even more delicious. Also, the spinach cheese bread is delicious, as is their marinara sauce on the side."}
{"text":"Having been a Pizzazz customer for years and years, finding Slice was like winning a game show as  I'm no longer in the Mayfield Heights area  often.  I always get the grilled chicken salads  and they're exactly the same as they always were. They're getting a bit pricey so we don't go as often as I like but I do buy the salad dressing and make salads at home.

Thank you for being here!"}
