{"text":"Business hours may want to be updated for Sunday nights... realize it's slow, but when there's 1:15 min left 'til closing, really shouldn't turn people away. Seems like a cool atmosphere though, but didn't enjoy the immediate CS vibes :/"}
{"text":"A group of friends (6) met at Smokin Fins last night for happy hour - what a fantastic time we had!  It was our first visit to the restaurant and we were not disappointed!  We sat at the bar - Josh - was our bartender & server and Nate, General Manager (their \"Yelp\" names) - both did a phenomenal job of keeping our food orders coming, which was probably no easy task, as we tried a wide variety of items.  We began with oysters on the half shell - they come with a couple of sauces on the side and you have the option of dressing them or eating them plain.  They were tasty, fresh, and delicious!!  Moved on to the Avocado Crisp, which is like a small pizza with shrimp, avocado pieces, and a yummy sauce.  The steamers, in a white wine sauce, were very tender.  We had to share the Buttered Crab pot - this is definitely a \"to be shared\" dish - the crab was nestled in a old- fashioned Mason jar soaking up the melted butter.  It was served with toasted french bread for dunking - almost like eating crab in San Francisco!!  We will definitely come back again and again and continue making our way through their menu!  Thanks for making our Wednesday night enjoyable!!"}
{"text":"It appears the Ahwatukee area has been saved from the vacuous culinary wasteland proliferated by fast food and fast food hybrid (i.e. Chipotle Mexican Grill Et Al) restaurants that plague our vista with unimaginative options -

I visited Smokin' Fins Friday, March10th and was pleasantly impressed on many levels:

~  Quality of food, fresh, tastefully prepared
~ Creativity of food - superb and well-plated
~ Restaurant staff - professional, courteous, prompt, friendly
~ Overall experience - outstanding

I sampled several items that are noteworthy: Oysters on the half shell, very fresh; Lobster Stuffed Avocado - a brilliant flavorful item imaginatively prepared; Lobster Tater Tots - definitely does not hide the lobster content, a very innovative item; Lobster Mac & Cheese - no skimping on the lobster in this dish, it was very good - but hey, it's Mac & Cheese so while good it can't rate in the \"most Innovative\" category; Mahi Mahi (daily special) - was very good as well.  The fish was prepared perfectly.

Another honorable mention - The Icetini's, which are poured into a \"glass\" crafted out of ice (it melts away gradually into an outer vessel that supports the ice-glass).  What a clever concept.

The ambiance like the food reflects attention to detail.  It edges toward upscale without being pretentious.

In summery, it was clear that the management of this restaurant has a well thought-out concept and business plan with well-trained staff that are carefully executing their opening.  Of course, much of the true test will follow, however, by virtue of the consistency in food and service unless something seriously derails this establishment I see no reason not to expect more creative dishes and experience's from Smokin' Fins."}
{"text":"Staff was very friendly and inviting! The restaurant itself had very nice decor and comfortable chairs with bright open patios that matched perfectly with the weather. The drinks we ordered (margarita and Mojito)could have been better for my liking, they lacked alcohol and flavor. The food though was exceptional! We ordered ceviche, bison cedar plank burger, and diablo roll and they were all perfectly cooked! They had vibrant full bodied flavor which I highly recommend all of them!  All this paired with attentive staff made for a great first impression. We will be back."}
{"text":"Everything on the menu looks delicious, good atmosphere and nice food! Seafood dishes are delicious!"}
{"text":"Just finished happy hour here and everything was amazing! Service was attentive, ambience was classy and clean, and the food was delicious! We got the calamari, kicking shrimp, and shrimp and avocado crisps. My sister barely let me eat two pieces of calamari before she finished off the plate lol. By the time we finished our food and drinks the manager came by and gave us a free roll of sushi because they made an extra! It was the Mojo roll and we loved every bite! Will go back for sure!"}
{"text":"There is thee places if you want perfect fish here. Angry crab, Sushi brokers, and this place. Don't taste the oysters or you won't ever have raw oysters from any other place. #BestOystersEVER"}
{"text":"Great friendly service .... but the food is inconsistent. From the few times I've been there I have come to realize that I never know what I'll get or how I'll get it. Dry tacos, undercooked sushi rice ( not al dente, closer to raw) + no ginger or wasabi just to name a few. Half the meal will be right and the other half completely off. May give them one more chance. Great staff, Good menu, Mediocre Execution."}
{"text":"I was VERY impressed with this fine establishment.  I am very picky with sushi and this place hit the spot!  Sundays are all day happy hour with great appetizers and drink specials!  

If sushi portions are a big thing to you like it is to me ( I hate paying for sushi that's tiny) this place aims to please!  The rolls were thick (wink wink) and  filled us up!! 

We had the platinum and the El Diablo roll both were sooooo good!  We had appetizers and drinks for happy hour specials!  I will post pics.  The sushi was buy 1 get 1 half off.. wow!  This is definitely a must go to restaurant in the east valley for sure!   I loved it!!!!"}
{"text":"Wonderful menu/a nice variety. I tried the Kobe Tacos and Tri Tip - loved it! The atmosphere is better than average and the staff is very friendly."}
{"text":"Excellent service, food and ambience.  Great new addition to Chandler. Great variety of food and apps."}
{"text":"We were so happy to have found this restaurant!  The service from our server Omar to the managers (Nate was one of them) and of course to the kitchen staff! The food was good and more importantly (for us) they were willing and able to cook some fish tacos and vegetables for our son who has allergies to dairy, egg, wheat, soy & nuts!  Thank you so much! For me and my husband, we ordered oysters, clam chowder, halibut & lobster oscar entree and cedar smoked salmon. Awesome place with great service! We will back and have spread the word to our friends!"}
{"text":"This is amazing for it just to have opened on Monday  (March 6th)! The Lobster Mac n Cheese, Kahlua Pig, and Southwest Ahi (which I shared with my family)were all delicious. The place is nicely renovated from the place before and service is great even though they just opened on Monday. Also the chocolate spoon cake was amazing, if you love chocolate(me)!!!! Overall this is must try."}
{"text":"We stumbled upon this restaurant while going to Longhorn Steakhouse next door, and wanted to give it a try. We were told it's only been open about three months. We tried the Calamari appetizer, the Kahlua Pig entree and the California and Rock Lobster rolls. The portions were more than enough. More than the size, the rolls were fresh and very tasty, but the Lobster was a little too spicy for my wife. The pulled pork dish was exceptionally tasty. The service was excellent, but the place was noisy (no noise abatement). The lighting was lovely at first glance, but at our table it was dark. The food was so good, the prices were within reason, so we'll definitely return."}
{"text":"We were starving when we walked in which led us to ordering more than we could eat. We had sushi, shrimp tacos, the shrimp crisp which is AMAZING, lobster Mac and clam chowder. It was all delicious and the service was good. We can't wait to go back on Sunday for ALL DAY happy hour. Prices are really great too."}
{"text":"The food was excellent . This place has a great look and atmosphere . Great Bloody Mary and the rock lobster roll was delicious"}
{"text":"Incredible atmosphere, friendly/professional associates, and wonderful entrees!  The chef (Carlos) is willing to be adventuresome and provide flexibility to the menu.  Nate and Sarah (Managers) are accommodating and make you feel like part of the family!  One of the BEST restaurants and eating experiences I've had in the Chandler/Ahwatukee area!  I highly recommend this wonderful restaurant...GREAT DINING EXPERIENCE!

Marshall Richards"}
{"text":"Moving here from Oregon I give this place 5 stars becouse the seafood is great here! The staff is amazing and very down to earth!"}
{"text":"We've been dying to find a sushi place out here! We had our go to place in Utah where we were regulars and we really struggled to find anything even half as good out here. This place gives our Utah place a run for their money for sure! Awesome decor, super nice staff and their sushi is amazing! Great experience!"}
{"text":"My son and I went here to try their Sushi.  Note:  they have some, but this is not a sushi place.  We kept it simple - sake salmon nigiri and California rolls for the sushi.  It was of passable quality, but nothing I'd go out of my way for.  They advertised a unique calamari dish, so I tried it.  It too was all right, but nothing special.  Finally, I tried the roasted cauliflower and Brussels sprouts appetizer:  this was way too salty - I had to send it back.  They remade it for me with about a quarter of the salt, but I still walked away feeling like I'd eaten a salt lick.  I felt pretty terrible after leaving the restaurant.

The waitstaff was well-intentioned, but inexperienced.  There were lots of apologies for delayed service, reading from notes, wrong meals served, etc.  

Maybe I missed the meals that would make this place more popular, but I give this place a solid \"meh.\"  I won't likely be back"}
{"text":"Newly opened and in a beautiful space and convenient location. Bright and airy. Went for lunch, and was quite impressed by the menu. All of the dishes coming out of the kitchen looked really good. I ordered the Vegas Roll. Delicious and generous. Wait staff courteous and attentive. I will go back!!"}
{"text":"This place is really good so far! Went with some friends because we heard a new place opened where stingray used to be and decided and try it and we have no regrets! The sushi is good and unique but I would not consider this a sushi place, they have a lot more than sushi. My friend got a pasta and she really loved it and the calamari was delicious!! Definitely will be coming back to try even more!"}
{"text":"The atmosphere is nice but too bad it's too hot out to enjoy the awesome fire pit on the patio. We went here for dinner on Saturday night because my husband wanted sushi. Who knew it was sushi plus so much more?!!! The icetinis are good. It is basically a drink served in a ice sculpted cup. Drink fast before it melts.  We started with the calamari which was tasty and then shared the \"el diablo\" sushi and Khalua pork. All food was great! Service was excellent. Our sever recommended an awesome Malbec. Would definitely come back to try something else."}
{"text":"First time here for happy hour! I decided to check this new restaurant out since I used to eat at the Stingray Sushi that used to be in this location. My boyfriend and I ordered 2 sushi rolls and a mahi taco and shrimp taco. Everything was fresh and delicious. If I could change anything maybe less/smaller diced jalapeno and onion on the tacos because it overpowered the mahi and shrimp. I will probably return to try everything else they offer."}
{"text":"Excellent sushi, above par service, and great happy hour specials. Will be back soon to try other menu selections. Give this place a try!"}
{"text":"We tried this place today for the first time and we were very disappointed. The service was good and the kids meals were huge but the sushi was NOT GOOD. The rolls were sloppy to say the least. The pieces were so big you couldn't fit them in your mouth and they were drenched in sauce. I would expect more for the average price being 13 dollars per roll. We will not be returning and I would not recommend this place to anyone!"}
{"text":"Everything was so amazing here! From the delicious lobster tots to the yummy bread pudding for dessert! Highly recommend"}
{"text":"My mom and stepdad come here on happy hour every Friday night. I joking every once in a while and have been there for a few party diners, but the food and staff is nothing short of amazing. I recommend going during happy hour! Their happy hour is phenomenal! And honestly has the best vibe there. The only thing is happy hour can get a little loud but they have happy hour all day Sunday too! So that's a total plus! It would be a great lunch place for the family or a little date :)"}
{"text":"Nice decor, good food, a bit pricey, not a great beer selection."}
{"text":"Between 2-stars \"Meh, I've experienced better\" and 3-stars \"A-OK\", I gotta go with the lower rating.

It was our first time.  Arrived a little after 6pm on a Friday, the place looked great -- not crowded anywhere -- and the staff were very friendly and efficient, not too pushy.  

But the food.  First visit, standard dish calibration: Calamari were in soft breading and and cooked to barely brown.  Didn't overcook the meat but there was little flavor and no texture, no chew of any sort.

What sort of place is this?  Prime rib and wedge salads, plus sushi and famous for seafood?  Over-the-top corporate menu.  My wedge salad was big with lots of garnish but only kind of resembled one; definitely not a knife-cut wedge of iceberg.  In comparison, the Caesar was tiny, with  shaved Parmesan but without any apparent Romaine.

My wife's plank-grilled salmon was reported as quite good, but my sliced roast beef sandwich on baguette was sub-par: all the meat was piled in the middle, where it was cut, to look abundant; half the baguette was empty.  A soup-bowl of jus for dipping wasn't much help though the small ramekin of horseradish was potent.  Regular shoestring fries were quite good but \"spicy barbecue\" seasoning on the side didn't impress. 

When we left at nearly 7:30, only 5 tables of 20 were occupied inside, plus a few seats at the bar and on the patio.  Prime time for dinner and nobody there?   Maybe that's the message."}
{"text":"The service was very good. The drinks were strong and tasty and the meals were also great. An overall pleasant experience."}
{"text":"The worst dining out experience in my whole entire life ever! We ordered 2 chilled dirty martinie's, it was served warm, we ordered stufed avocado, it was served so raw, so we couldn't cut with a steak knife.!!!. wth!! We ordered miso soup, it came out totally room temperature, we sent it back, they reheated, it came out the same!!! They reheated a 3rd time, it wasn't boiling, but it was ok. I got an Ahi with scallops. It was totally cold and arrugula was wilted. And tuna was so salty, my mouth was burning from the salt! Unfrikinbelieveable!!!!!!! 
The manager took care of the bill, that's a star for that.. Thank you,  but anyway night was ruined. WORST EXPERIENCE EVER!"}
{"text":"This may become a local favorite on a Friday night. Tried the platinum roll and excellent. Great ambiance and good service. Love the decor. Cocktails are good."}
{"text":"Ohhh This place is just too cute!! Atmosphere was darling! I ordered the pistachio halibut which was a special, and I must admit that it was a little bland. However, I would love to come back and give something else a try just because I loved the atmosphere!"}
{"text":"I stopped by for dinner at this location. It's sad to say but I wasn't pleased at all! It all started with the poor attitude of the hostess. The menu looked great and appetizing which drove me here but was so disappointed! The ambiance and people were great but food was less than exceptional. I wasn't too hungry and so I ordered a light dinner. I had the fried calamari which was delish and no complaint. I had the seared tuna salad and wasn't pleased at all! The lettuce was room temperate and other veggies were soggy no crunch to it at all. The seared tuna tasted like it's been seared since opening and sitting in the refrigerator. So sad to say but how can you mess-up a salad?!?! Hopefully others had a better experience than I did. Totally disappointed!"}
{"text":"We visited for Happy Hour with our 2 toddlers. We ordered the Shrimp & Avocado crisp, Calamari(smallish portion) from the HH menu both tasted great. Also tried the Louisiana Pasta dish and I was NOT impressed by the overwhelming pepper flavor. We tried the Coronita Margarita and the Fins Mule both were fine. We will be back to try other entrees and Sushi because others we noticed looked pretty good. Check it out for yourself!"}
{"text":"A great spot to try! The food no matter what you order is good. We had a sushi roll it was a popular,but can't remember the name. The bison was amazing with veggies and mash potatoes! This is a newer place and is always busy. The servers are very friendly and attentive."}
{"text":"This is a great spot, good food good atmosphere. A little overpriced but all in all a great place to go for a bite and some drinks."}
{"text":"As a party of 3 we tried Smokin Fin for the first time. The fish & chips are delicious and the fries nicely crisp. The bison Cobb burger is beyond tasty with bacon and Gorgonzola cheese.   Service is friendly and efficient. They even have 2 patios if you enjoy dining al fresco . Plan to try the sashimi on my next visit"}
{"text":"There wasn't a option for 6 stars. Amazing food, great service and comfortable atmosphere - trifecta. This is a can't miss. My wife doesn't like seafood, so she was confused by the naming convention, but the steak tacos are KILLER!!!"}
{"text":"Great atmosphere, delicious food. I recommend calamari for an  appetizer. The salmon was excellent. I saw some other items on the menu that I will try in the future. Definitely worth trying and the staff was very attentive.   Nothing bad to say."}
{"text":"Great food and great atmosphere, BUT, husband and I went for happy hour and I wasn't completely happy with the hour!
Menu said $1 off house wine for happy hour so I chose the $8/glass Pinot Noir. Server said they were updating their wine list and no longer carried my first choice. So we then chose the $10/glass of Pinot. The server then returned and said they were out of it. All that was left was the $12/glass. Now you'd think by now they'd at least offer the $12 glass at a lower cost. Nope. It was just a turn off. Either update your menu or monitor your inventory. $24 for 2 glasses of wine isn't happy hour in my book. We didn't get the $1 off either because apparently this was a premium wine. I did mention my issue to the server AND the hostess but don't think either of them cared to consult with a manager. Not sure we'll be back."}
{"text":"Everything we've tried here is incredible. The mango shrimp tacos.. the diablo roll.. ahi tuna salad, you can't go wrong. We took our family here while they were visiting and on their last night here they asked \"can we just go back to smokin fins?!\""}
{"text":"Atmosphere is great, service was great, food was good- not great. Everything we ordered (kickin shrimp, spicy tuna roll, and el diablo roll)  tasted good but it's all drenched in sauces. I would order the spicy tuna without the aioli next time! 

For drinks we both ordered the happy hour mule and it was good but inconsistent- mine was heavy on the vodka and my fiance's was heavy on the ginger beer."}
{"text":"This used to be one of our favorite places locally. Had dinner there last night and  was very disappointed. I ordered the mahi tacos I would say they were about 70% fat... Yes !! I don't know how you get huge hunks of fat out of mahi but I did. I told the server about it and his response was wow. That's it, just wow. We went a couple weeks earlier ---it was wonderful. But before that we went two times when the food was really bad. We look for consistency in restaurants and this place seems to have lost it."}
{"text":"Had a really nice night out at smokin fins. Sat at the bar and tried the jalapeño and cilantro margarita. It was so good. Our food, pulled pork bbq sandwich with cajun fries, and tater tot  lobster rolls were to die for. Our bartender was excellent and was  very cool and attentive. Her name was Lindsey and she was awesome. Great place for fun creative drinks and really good food plus a nice atmosphere."}
{"text":"Stopped in for early dinner. Group had burgers, salmon, blackened fish tacos and shrimp tacos.  Table loved the sprouts and cauliflower appetizer.  Everything presented well.  Service was excellent with right level of attention."}
{"text":"Well, this was my first visit. I arrived around 3:30 and I was the only one at the bar. There were a few other patrons scattered around the restaurant. In my Yelp search I put in \"Happy Hour Margaritas\" near my current location.  Smokin' Fins came up saying it was within 10 minutes from me.  So I gave it a try. 

Happy Hour prices food range from $6 - $12.  I was torn between trying the Smokin' Nachos or the Crispy Brussels & Cauliflower. The Crispy Brussels & Cauliflower dish is flash fried Brussels and Cauliflower with blue cheese crumbles, bacon and sea salt. I asked the bartender which dish did she prefer, she said Crispy Brussels so that's what I went with.  The food took a while to come out.  As I was sitting there starting to wonder where my food was, I heard the bartender ask someone to check on it.  I ordered my second drink before my food came out. 

It smelled delicious when it was placed in front of me.  First bite, yummy - but salty!  My first bite I made sure to have a piece of everything on my fork.  The flavors were awesome.  I took a few more bites, same thing - a bit too salty.  Also, for a flash fried dish, it was heavy in grease. Maybe it was the bacon, not sure.  All the flavors together are out of this world good.  I think they should do without the added sea salt because the bacon gives it more than enough salt.

For the drinks ... prices range from $4 - 8 bucks.  I'm not a Corona girl, so I asked if I'd be able to get a regular Margarita on Happy Hour. The bartender said \"Sure\".  I wasn't informed there would be an upcharge.  No big deal, but I think it should have been mentioned.  The Margarita she made me was only OK, my second drink was simply Tequila with a splash of Sprite because again, the Margarita was only OK.
Overall, I wouldn't visit Smokin' Fin again alone for Happy Hour.  It's kinda boring.  Some place you can go alone and don't feel alone because the food, service and atmosphere is awesome, this was not the case with Smokin' Fin.  I'd return, but with friends."}
{"text":"WOW, tonight was our first time at Smokin Fins, and it was terrific!! We had the Scallop Ahi Tuna dinner, mahi mahi tacos, California roll, dragon roll and calamari.  Every thing tasted delicious!!  Even our 13 year old son was asking if this was a place he could come back to with his friends! 

The service was great as well! Our server Nancy took great care of us.  Their company values were clear... quality and service.  

We will definitely be back!!"}
{"text":"We discovered this fairly-new local place after picking our car up from a repair and checking Yelp reviews, and what a great find!! Smokin Fins has an extensive menu of tempting items, and while we stuck to appetizers and drinks this time, we'll definitely be back to try more great things on the menu. The atmosphere, which includes an indoor-outdoor patio, couldn't be better. Our waitress, Cierra, was very friendly and helpful, and we especially enjoyed interacting with the manager, Nate. The food and drinks were delicious and we definitely felt valued as patrons - something that is sometimes hard to find. This is one of our new favorite spots and there is no doubt we'll be back with friends and out-of-town guests!"}
{"text":"Had the spicy tuna roll, amazing!!  Come check it out.  Great food and great service!!"}
{"text":"Holy (not-so) Guacamole!  Came here for a business lunch with some colleagues and couldn't have been more pleased.  The waitress was very attentive, knowledgeable of the menu, and had great recommendations.  The Baja Chicken salad was on point, and my manager absolutely adores the bread pudding.  Will be coming back here time & time again.  

Thank you for a wonderful experience :)"}
{"text":"We went for dinner with 2 other people and my husband can't wait to go back.  Service was awesome and food was delicious.  My son said the sushi was way better than the sushi at that popular spot at Chandler Mall.  My husband had oysters and salmon.  He loved both dishes.  I had the pulled pork sandwich which was yummy and flavorful, but so soggy I had to eat it with a fork.  The crispy fries were wonderful.  As for the service, I think our server was Omar and he could not have been better.  Friendly, helpful and everything a server should be.  My husband spilled his Manhatton about two sips in and Omar was there immediately to clean up the mess and replace the drink.   Open since March, and not yet that busy.  We will be going back!"}
{"text":"Was here on business travel and decided to give this place a go. What a gem! I'll definitely be back. Great food with eclectic options.  Lobster tater tots? Hell yeah I want some of those! Delicious."}
{"text":"Just tried this place for the first time last night, and it was absolutely amazing! From the incredible ambience to the top notch customer service, the whole experience was a perfect 10. But of course the main story is the food- and it was a complete knockout. The sushi was beyond fresh, the appetizers were unique and fun, and between the 6 of us, not one person had a single complaint on any of the dishes- which is quite the feat. Don't be hesitant to try even if you aren't a fish person, the steak tacos and the kahlua pig were fantastic! This is definitely a must try in Chandler!"}
{"text":"I picked this place at random to have my birthday get together at. I saw some of the poor reviews but decided to go against it and check it out anyways. We got one of the long tables at the back next to the patio dining, they had the area all open so the nice breeze outside would come in. I was stunned at the decor and atmosphere of the restaurant, my friends were all at awe as well. 

We were all seated and our waitress served us drinks and appetizers. I am pretty sure every time something came out we were all amazed! The drinks were all delicious, the appetizers were amazing. I wasn't too crazy about the lobster tots, it tasted more like cheese mozzarella to us. But we got oysters, cucumber jalapeño margaritas, some rum drink, and some bloody Mary's and they were all amazing and delicious. The margaritas didn't taste sugary and nasty, it had a nice flavor. The Bloody Mary had a beautiful display of bacon and shrimp on top, my friend asked for extra spicy and they delivered. Whoever made this drink know how to make a real Bloody Mary cause it was tasty. 

Finally our dinner came out and everyone kept saying \"oooohh wow\" because the display was beautiful. We all had to try each others dinners because everything looked so good and we were not disappointed. Everything from the shrimp tacos, wings, mashed potatoes, sushi's, sashimi, and rice was unique and delicious.

Our waitress was patient, visited us often (we were a big group of about 8). She filled our waters, answered questions, gave us recommendations, and accommodated well. 
We were so happy about our experience here that we are already planning another night out to this place. Thank you for making my birthday the best and most memorable. I can't wait to come back! :)"}
{"text":"Happy to have a nice sushi restaurant close by. The sushi is very good and fresh. The space is very nice and clean. The service is excellent. Also, sushi shouldn't cost your whole wallet and Smokin Fins is priced just right. Happy Hour prices are good too."}
{"text":"The food, drink and service are all great!  The shrimp on the happy hour menu is so tasty.  The lettuce wraps are better than any I have ever had.  The crisp on the happy hour menu was a good surprise, as it was not greasy and it had a lot of flavor.  There are mahi tacos that are great, too.  This is a comfortable and friendly place, and I look forward to returning."}
{"text":"Second time at this restaurant. Food, drinks and service all EXCELLENT!!!!  It's pricey, but worth it"}
{"text":"So far, so yummy!  My google phone told me I had to go to this brand new place in Chandler and since I do whatever my google phone tells me, I went.  Glad I did.  First off..way cool ambiance and decor.  And now for the menu, fish, fish and more fish, but what they do with it is fresh and inventive - according to the menu.  First timers, for happy hour...great prices...so we tried their calamari, cup of clam chowder, two sushi rolls.  Normally not a fan of cream cheese in my sushi roll, but since most of theirs seem to use habanero cream cheese I decided to try..glad I did.  Rolls were fresh topped with amazing fish, nicely sized, and great presentation.  Waiter was nice and kept our ice tea's filled and checking in on us.  We finished with their Mango Cake, moist, creamy and yes..mangoey...in a good way.  Next time I'm getting their Smokin' Bloody Mary which looks like a meal in itself.  I think the prices are pretty fair actually and I like their share's are priced so you can get a few and indeed share with your mates, always a plus when you want a little bit of everything."}
{"text":"We had higher expectations for this place. We so wanted this place to be a new go to restaurant for us to frequent. The yelp reviews and the food pics were just what we were looking for. It has a great location and the service was excellent, but their food on this experience spoke a different language. 

We had the HALIBUT & LOBSTER OSCAR and the SEARED SCALLOP & AHI. For two $25+ plates these should have been delicious, especially noting that the Oscar dinner was one of their signature dishes on the menu. The Halibut and the vegetables were great, however, their could have been a little bit more lobster and a little less of that thermidor sauce. Overall the dish seemed to be a bit bland, but had enough food to fill you up, had it been tastier. The Scallop & Ahi dish was also disappointing as well. First thing we noticed was the lack of food on the plate for $25. It had a very scarce arugula bed and the vegetables seemed to be an after-thought. The scallops were fine, but the yellow fin was ruined by this extremely peppery rub that over powered the flavor of the fish. It was just too much! 

I really hope this was just a one-off visit. I want to give this place another try, but convincing the other half will be very difficult with this experience being our first one. First impressions really set the mark. Very disappointing..."}
{"text":"We were very skeptical after assuming this location had a curse on it. Barcelona, Big Fat Greek, Mongolian BBQ, Stingray Sushi...All failed for various reasons. Thought SF was another attempt at a sushi joint, but was pleasantly surprised. Didn't know it was a chain with diverse menu and decided to give it a try. Tried sushi, Blue Point Oysters, lobster deviled eggs, shrimp avocado crisp, and our 3 year old had the Mac n cheese. Solid draft beer list and a lot of cocktail options. Zero complaints...service was super friendly, didn't even notice the chalkboard next to the bar with all the fresh seafood options on it. If sushi is not your thing there are plenty of fresh seafood options like cedar planked salmon, pistachio crusted Alaskan halibut (getting that next time), the list goes on. For having so may items on the menu they really did everything we had fantastically. Think even the pickiest of eaters could find something to enjoy here. Support it...I think this place could be around for a long time."}
{"text":"Was looking for a place to take coworkers for a nice, but fun, environment with a large drink and food menu and this was just the place! They don't take reservations for parties under 6 but we didn't have to wait. Food was amazing, wine and beer was delicious (didn't try the cocktails). Price and service was great. Location is in a nice shopping complex but don't let that throw you off."}
{"text":"I went for my birthday last week and LOVED It! The atmosphere was fun but relaxed. Delicious happy hour menu and great service from Michael, and everyone else who brought us food, etc. I'll definitely be back for sushi, drinks, zucchini!! They have a small patio area that opens up to the bar area of the restaurant. They had TVs with some basketball games on but def not a sports bar. Menu ranged from sushi, bar food/sandwiches, and snacks to steaks and seafood options. Full bar with house made drinks!"}
{"text":"Great little place. Solid happy hour. Can be a lil spensive if off the main menu.

The calamari is one of the best in all the valley, shipped in from Rhode Island. Must say, I was impressed. 

We also tried the lobster stuffed tempura avocado which was a bit spicy but made up for it with the lobster mix.

Now, since the Phx heat is waining, it's time to amp up the patio. Chairs please!"}
{"text":"I have been excited to try this place since it opened. Their menu sounds awesome
 My hubby and I went to try some Happy Hour menu items. Ordered calamari, mahi mahi tacos and the flash fried brussel sprouts and cauliflower with bacon and blue cheese. The calamari was not crispy. The mahi tacos were OK. I thought we'd love the veggies, because..well it sounds awesome and it was pretty darn good except the larger brussel sprouts were almost raw. Oh and for the bar not being crowded, service was not stellar. One more thing I hesitate to mention, is I heard a waitress say, (while picking up drinks) \"is there a bug in there?\" Ugh I wish I hadn't heard that. I want this place to succeed, but they need to make a few changes."}
{"text":"Great new place in town. I believe our AWESOME waitress, Nadia metioned that it is locally owned and you can expect an awesome fusion of Asian, Mexican and Northwest cuisines. We had the fish tacos, Spicy Tuna rolls and the Baja Chicken Salad. All of which were exquisite. I will definitely be back to try the other Sushi options as well as the Noodle options. Cant wait! 

I truly recommend this place. Enjoy!"}
{"text":"Great food. Very diverse menu for all kinds of pallets. Would definitely go back! Sushi, halibut & crab served at our table.  All were excellent."}
{"text":"Service was awesome. Sushi was good. Happy hour specials just ok, could be better. Edemame was great. We will be back."}
{"text":"Great food, great service and a great happy hour!!

Try the Atomic sushi roll - it is yummy!"}
{"text":"Went here for happy hour on a Thursday night.  Had the oysters (half doz) for $12 and they were decent but not as good as the Angry Crab in Mesa.  The oysters are Blue Point and are from the Northwest area- good quality.

Their mango shrimp & mahi mahi street tacos for $5 each were outstanding.  Although street tacos are small (think tapa size) they did not skimp on the mahi nor the shrimp.  You get some fish in every bite.

Some places have happy hour wines that are hit or miss for taste and quality.  Their $5 happy hour wines (cab and chard) were very good.

What sets Smokin apart was the great service.  We had a gal named Andie who was a cut above in service and attentiveness.   As the saying goes \"service that is attentive and not intrusive\" was in play here.   She has a great personality and when we asked details about some menu selections, if she did not know the answer she went to the kitchen to check and quickly returned with the results.  If you have had servers elsewhere who guess, don't know or worse they shrug their shoulders, you appreciate a good server like Andie."}
{"text":"I know this isn't technically what this review was supposed to be about however the Decour and decorations around the restaurant were absolutely my style so instantly I felt at home!! However what this review was supposed to be about is the food the ambience and the people in the energy; in those as well we're up to par and the food was spot on as I took the advice of my server, and went with all of her recommendations like the... stuffed avocado appetizer, cedar smoked salmon, and the two house special sushi rolls!! Yes LIGHTS OUT!!"}
{"text":"Service was great, our waitress name was Rachel. Food was ok.. I came with my family which was a group of 15. We ordered a bunch of items from the happy hour menu. The calamari was good! The nachos and grilled oysters were ok... The kobe taco, mahi mahi taco and lobster tater tots were dry... We regret ordering so much... 

I'd recommend the dragon roll. The paradise roll and sunset were were ok..."}
{"text":"Really enjoyed a family meal here this evening. Staff was very friendly, food was tasty and it was a fun environment."}
{"text":"I'm sure happy to have them in the neighborhood and the operation seems very smooth so far. The shrimp tostada is tasty but very heavy. I don't know that it needs both cheese and sour cream. Calamari are tasty but could be more crisp and I don't love a creamy dipping sauce. We asked for Thai ginger sauce instead."}
{"text":"We haven't tried a lot on the menu; we always get the their calamari and poppin' shrimp, (or whatever their called) and a couple drinks. The service is good, food is good and the drinks are good.

I'm an amateur mixologist so when I watched the bartender shake a Mojito after adding the soda, I was puzzled. Granted, it was just one shake, but when only 20% of the content is soda, that's all it takes to flatten it. I said, \"did you just shake that Mojito?\" and she said, \"yes\". I asked her, \"won't that make it flat?\" and she said, \"Oh, no\". Uh, yea. It will.

But, since it wasn't MY Mojito, I don't care. If I order one there, I'll tell them not to shake it. Nice place that doesn't attract too many screaming kids."}
{"text":"Last 2 times we have been there everything was way TOO SALTY. And I like salt. Won't order a main dish again."}
{"text":"I have driven past this place numerous times and read a sign touting \"freshest seafood\" so I decided to go with my 2 teens.

We started with the calamari..unbelievably bland. The batter had no flavor and the dipping sauce tasted like a slightly spicy ranch dressing.

We followed with the dragon roll and platinum roll. Both were so bland and the seafood in them was almost nonexistent. Such a disappointment. We usually will stuff ourselves with sushi and we actually left about 10-12 pieces it was so bad. 

I will say the staff was very friendly and attentive but I will not be returning."}
{"text":"We arrived just in time for happy hour pricing was over. We were pleased our waitress was able to place our order before it ended.  The cream cheese poblano soup and calamari were very tasty!  The steak tacos were good, nothing spectacular but still tasty. The side salad was fairly bland but the rest of the food we enjoyed. Our server was prompt and friendly. Non happy hour prices go up quite a bit so we will try to hit them during HH."}
{"text":"The staff was extremely friendly, helpful and attentive. 9 out of 10.

Atmosphere was nice. We sat outside on the patio in a small lounge section close to the fire tables, weather was great, seats were comfortable, was relatively busy but not loud, not too bright, not too dark, very comfortable. 7 out of 10.

Prices were OK, a little on the high side, but not too bad. 7 out of 10.

The food was good, not exceptional, not bad. We had a glass of wine which was definitely poured on the light side, a $13 bloody Mary, a dragon roll which was really good, the mahi tacos which were decent and a poke-bowl which was really good.  The poke bowl was not delivered as we ordered it, but the exceptional staff went out of their way to fix it and ensure we were well taken care of. They even ended up comping it, which was unnecessary, but very thoughtful. Fresh ingredients, really nice presentation, reasonably good flavors, good sized portions. 8 out of 10.

Overall, this was a good experience. The staff couldn't have been nicer, from the GM to the hostesses to the wait staff, everyone was terrific. We would likely go back during happy hour and try some other food and drinks. I'd recommend trying it at least once."}
{"text":"Great bar food!  The cauliflower and crispy brussel sprouts were awesome! There is good music, comfortable booths and a nice friendly bar! The sushi is great, try the sushi squares, an amalgamation of really tasty tidbits!!  For me, an HM food person, especially at a bar, I like this joint!"}
{"text":"Had the lobster tater-tots, they were pretty good but nothing amazing; nice way to start. The cedar plank salmon was, however, exceptional. It was very well done, came out on a plank of cedar with embers still glowing. It was hot, flavorful, moist, just really well done. Service was nice, ambiance was nice. If I'm near by, I'll go again !"}
{"text":"Try the avocado appetizer. It was amazing!!!  Service was really great and we enjoyed dining outside. Just a little on the pricy side but we enjoyed it and will return."}
{"text":"Wow, we had the worst lunch in memory.  Worse than pathetic shrimp salad,  tiny, limp shrimp with terrible greens, blackened bacon bits.  Even I couldn't eat it.  The other order was steak tacos--on 2 inch flour tortillas, with salad and small piece of steak on each.  

It certainly wasn't crowded--only one other couple at 12:00 and now I know why.  Probably should have sent the salad back, but didn't want to ruin a reunion with friends.

We won't be back."}
{"text":"Lobster Mac and cheese was phenomenal. Will definitely be coming back to try other items on the menu."}
{"text":"Food is awesome I don't think you can go wrong with anything on the menu.  We couldn't decide on a sushi roll and my wife is off raw fish due to being pregnant so the chef made a his and her's!!!"}
{"text":"My dinner companion was raving about Smokin Fins and insisted that we go there for dinner. Per my SOP I checked Yelp and was oh oh look at all the poor reviews. Well I'm glad I gave Fins a fair shot. We requested a booth off to the side as we had a lot of catching up to do and our hostess gave us a couple of seating options. Nadia immediately stopped by brought us water, took our cocktail order, explained the specials and left to order our drinks, perfect. If you like bloody Mary's you have to try there's it's an appetizer in a tall glass. It arrives with shrimp and bacon, and all sorts of BM type stuff. My martini was served exactly as ordered chilled to perfection and accompanied by 2 blue cheese stuffed olives.

Our server, Nadia, was excellent and very patient with us as we must of talked for 15 minutes before even looking at the menu. I did finally order the center cut tuna and it was grilled to perfection (rare). I asked for a spicy sauce to accompany my fish and was provided with their special hot sauce. It was perfect. My companion ordered a bountiful chicken Caesar salad and she barley finished it. 

Post dinner we continued chatting and since the restaurant was only 1/2 full we were not rushed out. During this time our server refilled our water glasses and told us to not worry there was no rush.

Yupper, great, food, atmosphere, & service 5 stars baby!"}
{"text":"This place was an awesome surprise. The ambiance was comfortable and inviting. The food was excellent and the pricing was fair. Our waitress Colleen absolutely made entire experience fantastic."}
{"text":"So excited for this restaurant,  we saw it being constructed and was a very fast renovation.  
Very Impressive decor , staff is friendly and knowledgeable! 
We started with the lobster tater tots (awess) entrees were sea scallops and ahi & kahlua pig both absoultly mouth watering. Sea scallops paired lovely with my favorite wine Kim Crawford . Our server Chelsea was amazing and knew exactly what was the best! thanks well be back for sure"}
{"text":"One of the top 2 restaurants in Arizona. The other one being firebirds. This was our first time to Smokey fins and were really impressed. We live in goodyear and will be making the trip back out here. The atmosphere is great. The menu wide selection there is something for everyone. We did smoked ribs great. And the cedar salmon was excellent. The prices were perfect 2 adults 1 child 54 dollars out the door. I'm telling you Im A picky person and not one thing I would change."}
{"text":"Good,  service was decent.

Sushi was good.  Salad was good.  Poblano soup was my favorite part of the meal.

Fried ice cream was a bit strange.

Nothing stuck out to make the experience wonderful but it was okay."}
{"text":"Good food good atmosphere and great service. I only wish they had more food on the HH menu."}
{"text":"There have been only a few times that my co-workers and I have gone somewhere and ordered three different dishes, and everyone of them was delicious.  This was one of those times.   They do everything right here.   The fish is delicious, but that's not to say that their menu won't delight a non-seafood eating person as well.  They really have all the bases covered.  It will definitely be added to my standard rotation of restaurants."}
{"text":"Incredible menu and great kitchen to mouth service execution! Deserts are rockin too!"}
{"text":"The food is amazing! The service is great. The prices are very reasonable. The portions are big. The only problem is trying to decide what to order - literally everything on the menu is Delicious!"}
{"text":"What a great place! Have been here three times, in the last 2 weeks and have not been disappointed with any of the menu items. The Sushi rolls are wonderful. And they have a cod special, that comes on a bed of saffron rice that is so good! The staff is great, as well. The hostesses could use a little fine tuning, but the wait-staff and bartenders are second to none!"}
{"text":"I wanted to like this place, specially looking at their menu online,  but when the smell of fish hit my nostril, it was un appetizing considering the doors were all open.

Sat up on the 6 top high table and my neighboring tables were a lot closer than what I would have preferred.  

Happy hour menu was good specially the calamari and BOGO 1/2 off sushi.
I like the fact that I was able to substitute fries for veggies as my side when my dad ordered his cheeseburger .
I didnt get the Baja chicken Salad being served on an iron skillet though..did they run out of platters.?!?!?! 

Reason for the 4 star...smell of fish, slow food delivery, and too close for comfort in seating  other than ....I'll try it again. .."}
{"text":"the food is amazing for such a great price! not to mention our server was very involved and recommended so many good things. everything on their menu sounded good and tasted even better. highly recommend for anyone who wants a fancy meal at a reasonable price"}
{"text":"FIrst let me explain the 2 stars - we decided to try out the sushi after friends said it was good.
We got to Smokin Fins at 6:30 pm thinking we had plenty of time before the Happy Hour menu was over at 7:00 pm. But the wait list was 40 minutes long and we did not get seated until 7:10 pm. Since Happy Hour was over we did not get Happy Hour pricing even though we were waiting on the list for 40 minutes. Left a bad feeling about the service and management. I heard a few other couples expressing their opinions about the same thing but management just said \"Sorry\"  Now for the good part. The restaurant had a nice atmosphere and was relaxing inside and outside. The food presentation was impressive.  Service was just OK. The sushi was cut very think and cooked just perfect. If our dinners were not so good we would not return. Since the food was so good, we will give Smokin Fins another chance on our next sushi craving."}
{"text":"Some of the food here such as the appetizers were great. My meal was pretty bland though. It was a noodle dish made with what felt and tasted like spaghetti and the broth wasn't too flavorful. I did not get to try the sushi but if I come back I will. One of the waitresses was kind of strange and kept talking to us about personal issues... she was nice though and the service overall was good. Not the best experience but it wasn't bad by any means."}
{"text":"So this review is long over due. The family an I where on this side of town (Ahwatukee or Phoenix depending who you talk too.. lol) and we where in the mood for sushi and burgers, yeah I know strange combo but Smokin Fins had what we where looking for. When you walk-in through the massive wood doors your greeted by the host/ hostess and seated. Yes I know that is nothing special but it's done with a smile and that should be noted. Okay now the menu !! But let me back track a bit since going here we have ordered all of the appetizers!! Our hands down favorite is the bacon and Brussels sprouts !!! Okay back to the menu, we have loved everything, and have yet to be disappointed in any way. In fact, recently this is our  go to place on Sundays because you can't beat the specials. Plus the manager there always seats us in our favorite spot by the wine bottle wall. Oh did I forget to mention the AMAZING WINE AND SPIRITS!  Yup all bold caps because that's what you do when you really want to express how much you like something. WE REALLY ENJOY SMOKIN FINS THE FOOD AND DRINKS ARE AMAZING AND THE STAFF ARE ON POINT."}
{"text":"If your looking for sushi this is not the place, the rice is so thick it's gross. Definitely don't order water, they give you tap water and it taste like dirt, no seriously like DIRT. The service was good and the atmosphere is nice but that about all they got going for them. The manager was nice and discounted our check so that was nice but overall I was disappointing"}
{"text":"So, we were told the calamari is very fresh and has great flavor. It did taste very good and we were excited for our dinner. My wife got the Kailua Pig as it was also recommended. Unfortunately, it was horrible!!! The pork tasted like it was a day old and it was way too sweet. The pork came with beans and they were way too salty. We also ordered the Caesar salad and it was doused with dressing. Had to ask for a replacement with dressing on the side. This place was a disappointment and way overpriced! The service was the best part of the meal."}
{"text":"Good place for a quick bite to eat...  Tacos were great and the Bloody Mary was amazing!"}
{"text":"Smokin Fins is fantastic!  My wife and I have been here a bunch and it's always great. Everyone is customer-oriented and the food (the most important thing) is great!  Love, love going to Smokin Fins and highly recommend this gem of a restaurant."}
{"text":"This restaurant has great ambiance, however, the food is good but not great. The service is disorganized.

We ordered Lobster Deviled Eggs (as an appetizer), and Steak Tacos and Key West Cobb as entrees. After a long wait, the deviled eggs and tacos arrived at the same time. The entree salad was delivered after we queried about it. We were never asked if we wanted a refill on our drinks.

Whilst the food was good, our overall experience was ok. This is a fairly new establishment, so we'll give it some time before we try it again. Hopefully it'll improve with time."}
{"text":"Well.....

This spot was a suggestion. After reading reviews and scanning the menu....I was pleasantly and satiably surprised. Dropped in the Chandler location and in an area where patrons including myself have the luxury and option to choose restaurants, bars...and dining, I'm glad I went with this place. 

Not overly crowded, customers were chill and staff was amazing; friendly and hustling! Ambiance was cool and distressed! I liked. Now for the fare....

Plenty goods to select from; went with the lobster burger and smoky fries and my company had the tuna salad. Washed down with a crisp fresh IPA. Our waitress Nadia was absolutely amazing. Her customer service, attention to detail....smile and professionalism enhanced our evening. Great job Nadia! Oh yeah....the food was fresh and incredibly delicious!! End of story.

We'll be back."}
{"text":"Oh wow. The food here is fantastic. Mexican and sushi. So much yum. Service was good. The only downside was that we were missing a sushi roll for a good portion of the meal that came super late, after most of us were already finished eating. We'll definitely be back, though."}
{"text":"Great outdoor patio, altho it might be too hot as it's over 105 today - May 24th - in Phoenix.  Unique, delicious selections. There's something for everybody"}
{"text":"Headed here the first week they opened. Had the calamari and deviled eggs off the appetizer menu and could have finished the night hovering on this part of the menu! Dinner'd with scallops entree and a mac & cheese dish. Sat at a high top that 8 near open patio. Great ambiance, great food. We'll be back soon."}
{"text":"Ordered their Lobster Mac & Cheese for lunch. The only lobster was the tiny pieces  of the claw, which was extremely tough and very fishy tasting.  I sent comments to Smokin Fins Chandler management and corporate office regarding my experience but no response after two weeks. Smokin Fins doesn't seem to care about their customer's experience. Service was average. Food was terrible.  Avoid Smokin Fins at all costs."}
{"text":"I have been waiting for a place like this to open in Phoenix. If you love oysters GET EM!! The reverse happy hour is awesome! I haven't had one bad thing here yet! I'm very sad this opened and I'm leaving in a few months."}
{"text":"There are no big words to describe how much I loved it here! I had the California rolls, and they were absolutely mouth watering! It was my first time eating there and I have no regrets. The food was perfect, and I came home stuffed and well fed."}
{"text":"We came for lunch and were greeted and seated right away. The place is decorated simple but elegant. There's is outdoor seating as well. The lunch menu had my head spinning! So many great choices! As an added plus they have blackboard specials. The beers were super cold, YIPPIE! Our waitress was knowledgeable on the menu. We stared with the calamari. It was so tender, lightly breaded and beyond delicious. We did have a bit of a wait for our lunch and our waitress explains the ticket never printed in the kitchen.... our food finally arrived and WOW! Even thought it said the burger was stuffed with crab meat it seemed more like the crab was mixed in with the burger. The Mac and cheese had so much lobster claw meat it was ridiculous! We looked at the dinner menu, not a whole lot of difference from lunch menu. This is a definite return to place!!!"}
{"text":"I'm here on business and was taken here for dinner and I can't wait to come back. We had a feast of shrimp tacos, lobster crab stuffed mushrooms burger seafood nachos and it was a taste explosion. You gotta try this place!"}
{"text":"This is my second visit and my last. Ordered the dragon sushi and was not impressed at all. Did not have a good flavor. My husband ordered the clam chowder and it looked like oatmeal, it was as salty. The edamame was overly salty as well. This location was a Sting Ray and boy do I miss it!"}
{"text":"This fusion place is the best!!! My taste buds feel like they have been lost without a home....that is until they were graced with the glorious flavor votex that happens in my mouth each time I eat a tasty morsel from smokin fins!"}
{"text":"We like the variety of food/drinks, the food is of great quality, and the staff is great as well as the ambience.  As far as certain foods:     Tacos could be cooked a little longer (we have had them twice now) and they somewhat fell apart. We all prefer them crispier.    Ceviche wasn't like traditional ceviche (more like a tossed salad - dryer).  Salmon, ribeye and sides were all great as well as the California roll is all good."}
{"text":"The restaurant is dimly lit and is very spacious -- it was a nice place to sit down for dinner. The waitress was nice, but the service overall was not up to par. Waters were rarely refilled, we were forgotten around the time we were expecting the check, and one of the plates was dirty. Her friendly demeanor made these things easy to brush off, but that is what is keeping this place from 5 stars.

Their beer list is short, but there are some decent options. The menu says to ask the server for beers on tap, so I am assuming they change it up often. There are plenty of interesting cocktails listed. We were pretty happy with the food. The calamari was solid, and we ordered a really good happy hour appetizer that I do not see on the menu now -- it was like a shrimp and avocado thin crust pizza, but the exact name of the dish is escaping me now. 

I had the honey chipotle salmon as my entree. That was just about as good as salmon gets! The honey chipotle glaze had a great flavor and the right amount of spice."}
{"text":"I had stumbled across Smokin' Fins while looking for some cool new healthier eateries in the area, and I consider this place an unknown hot spot!

It wasn't hot in the sense that it was super busy on a Saturday evening a little after 9 when we arrived (but it was literally a little warm inside - I would have appreciated a little cooler climate this time of year inside a restaurant) ... It was quite slow/empty at the time we arrived, but that is no shocker seeing how this area of Chandler is not known for a lively night life scene. 

The ambiance:  I loved the chill atmosphere - it was nicely decorated, fresh, modern, trendy, hip, cool.  At first glance it appears like a cool spot to hang at that you would find in N. Scottsdale, and it was even better since they offer a reverse happy hour after 9pm Fri & Sat - love it!!!

So does Smokin' Fins live up to all the great yelp reviews?

For the most part... YESSSSS!!

For drinks: we tried a glass of Pinot Grigio and one of their seasonal mango icetinini's which was neat-o ... I've never seen one of these ice martini things before!

For eats:  we tried an order of edamame, the seared divers scallops, and chicken tacos.  The edamame was pretty standard - it's pretty hard to screw that one up!  The chicken tacos were yummy! And the scallops smoked on cedar wood with bacon ranchero sauce were amazing (nice presentation too!) - that is a lot coming from someone who loves scallops and tries them nearly everywhere he goes!

The service:  our waiter was good for the most part; always asked if everything was okay and if there was anything else he could get us (minus his screw up on the food charges)

The only slip up:  I noticed when I reviewed the bill today - that since it was happy hour we should have received the happy hour prices on the edamame and the tacos, but as you can see on the bill (picture) ... our waiter charged us the regular price on both of these items and only deducted $1 for the icetinini happy hour special.  So essentially, I ended up paying more than I should have $1 on the edamame and $8 on the Tacos.  Note that on the bill it says mahi mahi tacos, but the waiter substituted chicken in for the fish.  

So with tax I probably over paid by approximately $10 ... If I return during happy hour I will double check the bill before paying and walking out.  It happens, but I won't be able to give a 5 star review based on that sort of gross negligence/lack of due diligence.  My advice to other yelpers would be to review your bill thoroughly if you come in for happy hour ... 

Overall, this new local trendy hot spot earned a solid 4 star review in my book, and I will return for reverse happy hour to diligently see if my next server calculates the happy hour specials correctly on my bill  ;)"}
{"text":"Cool place.  Formerly StingRay.  We had oysters, avocado crab/lobster app, bison meatballs, poke bowl, halibut, honey chipotle salmon and the ahi entree.  All very good, seasoned well and fresh.  Tried some drinks including a few martinis that come in an ice insert inside of a mini martini glass.  Small but very cold and tasty.  Nice ambience and enjoyed it."}
{"text":"Absolutely outstanding! Food is off the hook and the atmosphere is fantastic. The young lady I believe is the an owner was also incredible and told us some great stories about the the quirks of the building. This is my new go to place. I highly recommend it. The Poke Bowl is a MUST have!"}
{"text":"Amazing service and fantastic calamari. My husband loved the poblano soup. We had sushi and it was delicious. We also really loved the vibe and atmosphere. We will be back to try other menu items!"}
{"text":"What a find. I've driven past this place 25 times and wondered if it was any good. It definitely is VERY good. We had sushi, lobster deviled eggs, a fantastic cheeseburger, and more. Even the pickiest eater can find something delicious on the menu, and the wait staff are INCREDIBLE. I'm headed back there this afternoon for happy hour!"}
{"text":"Two tries. On our first visit, we shared two great appetizers, lobster tots and the calamari. Both were so delicious and inventive, I had super high expectations that were dashed by the sushi rolls, fried shrimp in almost every roll, cream cheese which belongs nowhere near sushi, IMHO.

We decided to give it a second try, due to the appetizers, and try other items. The shrimp and avocado crisp was good tasting but not crisp in the least and lacked avocado. Lots of shrimp though.

The salmon Caesar was really good but huge.

My husband ordered the Captain Crunch fried ice cream. Expected a crunchy crust, not even close.

I ordered a glass of over priced Chardonnay that was so bad I had to ask for a glass from a new bottle."}
{"text":"I'll start by saying the inside was very chic and the staff seemed very helpful and friendly.  However, the food itself was a little bit of a disappointment.  I got the CA Rolls and they reminded me of the pre-made rolls at the grocery store.  I expected a lot more from a place that has the word, \"fin\" in their name.  At any rate the rolls were dry and pretty tasteless; they seemed pre-made.  I also got the deep-fried avocado, which looked amazing, but the crispy deep-fried skin to soft avocado ratio was a little off for me.  There came a point where it felt like you're just eating an avocado, which I suppose could be awesome given your taste.  All-in-all though my biggest issue was with the fish.  For a place that has fish listed in a majority of their menu, the expectations should be higher."}
{"text":"We loved this restaurant! Great atmosphere, our server was prompt and the food was delish! The pricing was very competitive too compared to other good sea food restaurants in the area. We will definitely be back!"}
{"text":"Great variety and choices. I love this place. Will always come here when in Chandler area. Thank you for the great food and price."}
{"text":"I only had the calamari and the roasted poblano soup - but Wow!
Both delicious.

Indeed the calamari is light and crispy-tasty.
That soup- to die for!

I will be back-and ready to scarf
I sat at the bar, and Meg B was a wonderful waitress.  
She was a good singer too! Fun gal . 
Nice ambiance ...not busy for a Sat. I hope they stay in business! Seems robbed a tough corner; I've watched several restaurants come and go. 

The name seemed weird- but I'm sold - on the food 

I can't wait to come back."}
{"text":"On Saturday night, I again came back to Smokin Fins for the second time, and of course had another amazing experience. I had dinner with my boss RJ, and we were really taken care of. The manager Nate was fantastic and accommodating. Thank you again for always taking such good care of us when you come in to eat!"}
{"text":"Me and my family went to the restaurant last night for the 1st time wanting to try something new and place had good reviews and now I see why, we will be definitely be going back. This place has great food, great service and there menu has something for everyone. The atmosphere is nice an clean. Im very happy we found this place. Also this place has a great happy hour as well by the looks of it."}
{"text":"Been here twice since it became Smokin Fins. I think the food is excellent and the service is very much improved. Good patio as well. I will for sure be going back."}
{"text":"Friends recommended this place so we decided to celebrate our anniversary here. It is only a couple of miles from our house, always a big advantage as we hate driving in traffic! The ambiance is nice. Hostess was very friendly. She tried to sit us at a high-top, which is uncomfortable for me because I am short and my feet kind of dangle. I asked her for a regular table or booth and she didn't think she had one. I pointed to the empty table about 20 feet away and asked, \"How about that one?\" and she sat us there. She was very nice about it and said she hadn't seen it. Our server came over shortly and asked if we wanted a drink. We told her we were first timers. I asked about their happy hour specials (they have some nice looking apps but their drink specials are just $1 off--soso). She was VERY nice to bring us a taste of their house chardonnay and house pinot gris. Neither of us liked either so we order $11 glasses of vignney (I can't ever spell it!). It was nice but I thought over priced. 

While we were figuring out the drink situation, we also ordered the happy hour calamari. We also decided on the Platinum Roll and Rock Lobster Roll with an order of Hamachi Nigiri. 

Let me start by saying, I have been eating sushi for about 25 years. I have had it all over the world and I am pretty particular. 

It took longer than we thought to get our food as it didn't seem that crowded. We watched other food coming out and everything looked fabulous. They do a great job plating their food! The servings are good size--thankfully, as it is a little pricey. The Platinum Roll ($15) was very good but the Rock Lobster Roll ($13) was kind of dry and bland. (HH is buy 1 roll, get 1 roll 1/2 off) Not what we were expecting. The Hamachi (yellowtail) was divine (2pcs for $6). It is always my favorite part of eating sushi and actually, I should JUST order Hamachi. I call it dessert and save it for last!

Notice I didn't say anything about the calamari? Yeah... it never did show up! That was very disappointing, but we were full anyway, so it was probably just as well. They made a GRAND gesture of taking it off our bill (really? of course you should take it off our bill!! We never received it!!)  

We want to go back and try the seared scallop and Ahi ($25). Maybe we will have better luck next time. Server was friendly, so I don't how she messed up...."}
{"text":"The sushi is really fresh and delicious! I had yellowtail, salmon, tuna nigiri. I've had sushi a lot here and in California and this place is up there with some of the best sushi places. The atmosphere and service was amazing. I will be back regularly!"}
{"text":"Omg soooo good! We loved everything! It's hard to find a place that fits so many different peoples needs. Drinks were amazing and so was the food! Mac and cheese, burgers, tacos, all amazing!"}
{"text":"Happy to welcome this unique place to the neighborhood. The name doesn't do it justice but the extensive menu made it difficult to choose. 

The rich and buttery poached crab was fantastic albeit a bit pricey for an appetizer. We tried the highly touted calamari and were satisfied but not overly impressed as they are with it. The lobster quesadilla was a crazy combination of flavors that worked. 

Interesting \"icetinis\" served in ice glasses and a few other creative cocktails make it worth a revisit."}
{"text":"This was a wonderful dining experience. The menu had a number of unique items, when I return I'll be trying something new. We started out with the Lobster Deviled eggs, which were light and tast. The bacon on the eggs were a great touch. Our main course: the Southwest Poki Bowl, very fresh with an interesting twist of southwestern veggies and spices. My wife had the Baja Enchilada Stack, which was seasoned well and very tasty. These were two completely different taste profiles, which was nice to have. We also took home the Roasted Poblano and Jalapeno Cream Soup, which tasted great the next day. Prices were moderate, the atmosphere was pleasant and the staff was friendly. Great job!"}
{"text":"Had a great time here. The food was amazing! We had great cocktails, sushi, & entrees.. We will definitely be back."}
{"text":"This was my first visit, it will not be my last.  We ordered the calamari, brussel sprouts, and deviled eggs. 
Good lord they are all delicious. For my main I ordered the fish and chips perfectly cooked and delicious. 
My recommendation is try try try!!!"}
{"text":"Consistently fresh, perfectly seasoned, original dishes with some of the best service around! Love the decor and ambiance! This place never disappoints!!"}
{"text":"I absolutely love this place. Awesome service, great food, yummy drinks, and the decor is on point. Whoever decorated it and came up with the theme did an exceptional job. Prices seemed fair for what they serve and the presentation. Good sized portions. I would definitely recommend this place and we will be going back!"}
{"text":"Nothing bad to say about this place! Everything from the service, to the food, and prices are fantastic (especially during their all day happy hour on Sunday!) For my first visit I went with the ceviche, and Mango Tango sushi. I will definitely be coming back here to try out some other dishes!!"}
{"text":"Hi yelpions.

Quick review of the 4pm happy hour here. 
Good-
Calamari 
Salad w citrus dressing (small tho)
Shrimp taco

Meh-
Kobe taco dry, used sauce from the calamari to save it.
Kicking shrimp 

I didn't really feel the main menu. I was just craving chips and guac,  but didn't see any. Maybe some  pictures would have convinced me to go bigger.

Ordered fish n chips for the 3 yr old who hogged the calamari.  French fries nice and crisp. Sent it back though, just didn't agree with us. Ordered another round of calamari,  and tacos.

No physical  dessert menu,  but ordered and shared the chocolate cake!

Would stop by again!"}
{"text":"My new fave restaurant. Great decor, fun and friendly staff, awesome service, good music, and AMAZING food. Lots of comfy booth seating. Don't miss the lobster stuffed avocado...so so good. Deviled eggs with lobster were also good to share, and also the calamari. Hubby had sushimi and I had dragon roll- yummy. We will definitely be back!"}
{"text":"The menu was very limited and the food was underwhelming. I had the Kobe Flank Steak and my friend had the Lobster Mac & Cheese. The Steak was over cooked, tough and the seasoning was horrible. They are putting some truly terrible seasoning on this meat. The lobster was okay. I probably won't come back."}
{"text":"Before getting into it I want to say this place is great, service is great and they have a beautiful patio with fire pit. 
NOW....
I started off not real thrilled, coming in for happy hour with friends and opening up the menu to see the most unfriendly-vegetarian menu in history. Being a bit grumpy I dismissed them on my list of places to ever go again. My friends know the GM, Nate, so they called him over to complain on my behalf. Nate was so great in how he discussed their menu. Basically they can do meatless options on a lot of the menu- you just need to know to ask. He said that the owners and the Chef had decided years ago they didn't want to throw an unimaginative \"veggie roll\" or \"avocado roll\" on the menu as an afterthought for the vegetarian visitor. They like to build all their meals thoughtfully. I am good with that! Nate also gave us the history of Smokin Fins and how they came to the Ahwatukee area. That is a story you can find out for yourself when you come in and ask for Nate!

As I said, service is great here and the atmosphere inside and out so comfortable! Go to Smokin Fin!"}
{"text":"I came here with my son today & I'm so glad I did! We both munched out on movie popcorn so we weren't too hungry but the menu looked awesome. We shared a Dragon Roll, Lobster Mac'n'Cheese, & Southwest Poki bowl. The mac/cheese had large pieces of lobster in it... usually restaurants are really chintzy with it & it had real bacon too! The sushi roll was really tasty... almost too pretty to eat! The Poki bowl was better than I thought it was going to be... LOTS of fish included... not just ahi but salmon & yellowtail. It had mixed greens, pepitos, rice, roasted corn, & edamame. We sat in the bar area & Josh served me a \"nectarini\"(?) made with nectarine vodka & served in a glass ice mold...quite nice. A nice, filling surprise on a Sat afternoon"}
{"text":"Hands down theeeeee best restaurant in Ahwatukee right now. The Menu is great! Huge variety and everything we've tried has been awesome. They have a lot of Shrimp and Lobster options and they do NOT skimp on the Shrimp. The Bread Pudding was to die for. The service was great. Fast and friendly! Prices are decent. The portions are huge you can easily share an entree. It's so nice to have a new restaurant in this area that is not a chain!"}
{"text":"If you are thinking this is a fish place, it's not. Not a whole lot of choices for seafood. We thought it was a bit over rated as well. The cedar plank halibut I had was appetizer sized and overly expensive for the portion you get. Had some tasty sounding things on the menu, looks like they're targeting a bar crowd to me."}
{"text":"This place is amazing! They are newly opened in March 2017, not busy at all, staff is more than friendly! Their sushi rolls are amazing along with the happy hour specials but 1, 2nd one is half off. The tacos were street tacos but packed with fish and shrimp and so filling. Also the lobster Mac and cheese was so rich, huge pieces of lobster, so fresh! 
Definitely coming back again.
Sarah the manager very tentative and even stops to talk to you and welcome you in.
Great date night!"}
{"text":"Absolutely love this place. Fabulous and diverse, casual food. Terrific service and very affordable. Sara is the manager-who wants to please and is on top of everything. #lobsterdeviledeggs #stackenchiladas #nadia"}
{"text":"Took my wife here for her birthday and found a gem , from appetizers to sushi will be back many time to try the entire menu."}
{"text":"First time at smokin fins for a birthday lunch. I had a spicey tuna roll and the diablo roll. Both were very good as was the fresh tortilla chips and chi polte sauce.
The menu looked quite diverse and the decor was nice. Nice bar set up and the service was on point.
My only gripe were the prices. Maybe a happy hour is a little relief but chowing sushi off Happy hour will cost you some bucks."}
{"text":"Great food and great service!!! Ask to sit in Colleen's section. She made great recommendations and the service was second to none! Try the lobster stuffed avocado!!!"}
{"text":"Loved the place !!  Great meal, gotta love good Salmon, mmm. 
Great staff, and atmosphere. I'm hooked !!!"}
{"text":"Nadia and meg  are amazing I had a blast and the food is great! I love the el Diablo!!!! Thank you for a great lunch"}
{"text":"Awesome!!! We tried Smokin Fins for the first time tonight. Staff was super friendly and helped negotiate some pretty tough dietary restrictions. We ordered the cedar plank salmon with veggies which were both perfectly cooked, the fish and chips (also reported to be great), the mixed poke bowl (yum) and the smoked salmon and arugula salad (I substituted the wasabi soy dressing at the waitress' recommendation which I would definitely do again). Food was excellent, service was attentive and there are so many other menu items I want to try so we will definitely be back soon."}
{"text":"Sunday happy hour all day!!! This place is great, loved every bit of it. We had the coronitas for our beverages, delish! The blue point oysters were on point! The shrimp app was so good. We loved the sushi rolls as well. The tacos(shrimp and Kobe beef) were just as good as everything else and finished it off with the mango cake. What a great cake. We will be back for some entrees next time!!!"}
{"text":"The oysters were awesome but the sushi was really dry and not worth the money! If you want something worth the money, shrimp tacos all the way and the shrimp appetizer. It's a cool atmosphere! I have had better service though. Good for a big group get together."}
{"text":"I've been here a number of times and have to say each time it is really good. Their happy hour is great and on Sundays there's all day happy hour, always a bonus. Their sushi is comparable to any other sushi place and they have probably 8 different rolls on their menu. They do tacos which are sooooooooo good and then rice bowls. The cilantro lime rice is delicious. They have these lobster tater tots that are very yummy. I really enjoy the halibut it's served in a cream sauce with asparagus and some cauliflower mash and I thought it was a top seller but it wasn't on the menu tonight which I have to say was disappointing but the tacos were still great. The Nashville chicken is amazing. They put a little spice in the batter and it's a white breast no bone. Perfection. The only problem with this dish is there wasn't enough chicken I think they should have done 2 pieces especially with the price. The patio is always packed which is a great sign. The midterms are a little more intense then they probably need to be but I get it, it's Arizona."}
{"text":"We will definitely be back. Our first time was great. Had the avocado lobster app. The Brussels & cauliflower app. Strawberry martini. Southwest poki. And el Diablo roll. All awesome. 

Also the fried ice cream. Was ok. The lavender cheesecake was great."}
{"text":"The food was very good and so was the service. My 3 kids even enjoyed the char grilled oysters and Kobe beef tacos."}
{"text":"Great experience at Smokin' Fins. While the food was certainly delicious, what really stood out was the excellent service we received from our server, Colleen. She was very attentive and knowledgeable. We look forward to dining here again."}
{"text":"Smokin' fins is a lovely sit down eatery with a great number of options. The ambiance is casual but you could still make it a fancy night out. There is outdoor seating which is nice in the evenings. Additionally Sunday has all day happy hour so it os half price on certain appetizers and all rolls.

Everything on the menu is presented well and seems especially appetizing. My first visit I ordered the halibut florentine and my mom ordered the ahi salad and we ordered the habenero clams to start. Each dish was nice and well portioned. The clams were alright. They tasted good at the time but they were not that memorable. The ahi salad had a lovely wasabi dressing that paired well with the flavors. It was a tad sweet for our tastes so we added some extra soy sauce. The halibut came with delicious mashed potatoes which I found quite enjoyable but the fish itself was a bit dry. Service was lovely and they came around often to refill water and check up on us.

On my second visit, my family ordered almost all the appetizers and some rolls. I have to say the appetizers are quite good, my favorite being the shrimp avocado flatbread. I highly recommend any appetizer with shrimp. The flavors are bold and there usually isn't breading to muddle up the freshness of the seafood. Unfortunately the rolls were not up to par with my usual sushi places. The rice is a bit dry and there isn't much bite to it. There could be improvements to the taste and texture but the presentation was beautiful. All in all I believe the more western dishes are great but if you want sushi I would try a different spot."}
{"text":"I can not say enough good things about Brian, Nadia and Chef Rachel at Smokin Fins. I felt welcomed the moment I stepped through the door with a \"hello, how is your day\". They went out of their way and made me Keto sushi (no rice). The atmosphere is all you could ask for... relaxed and calm and inviting. The food is very fresh, beyond tasty and the presentation is to die for. I will definitely be back and can't thank them enough for making my day! Piano night on Wednesdays if you want to enjoy a glass of wine and a romantic classy night."}
{"text":"We tried this new restaurant tonight and we were very impressed! Great service, took a reservation, and they fly their seafood in daily! I can vouch for their lobster MAC n Cheese. Very tasty!"}
{"text":"We were nearby checking out the Arizona Grand Hotel and saw this pop up on Yelp and we are so glad we did. We started with calamari with the lime dipping sauce - very good. Then the fiancé got the Diablo roll and spicy tuna roll. Be warned, they do have some pretty solid kick, but were delicious and tasted very fresh. I got mahi mahi tacos which were on the messy side but also delicious, refreshing, nice lunch. Service was excellent and the music is good too - lots of cool remixes, excellent atmosphere. Check it out! 5*"}
{"text":"Great unique food and tastes! The sushi is authentic and filling the lobster tater tots are the best! I hope this place stays around for a while because they are great!"}
{"text":"Not sure how they got four stars from others. Nice atmosphere but The menu is too diverse and lacks focus. Sushi snd salad were mediocre. Clam chowder was good. Server didn't know they had a weekend prime rib special. The prime rib came out medium well and I had to send it back. Same for my friend's rib eye which had a very odd tasting rub. When prime rib came back it was practically raw and yet very chewy. Manager came out and apologized but we will not return."}
{"text":"We shared a few happy hour appetizers, and they didn't disappoint. We ordered Shanghai Edamame, Kickin Shrimp, and 1/2 Smoked Steamers. All three were amazing, but the Kickin Shrimp really out-shined everything; you need to order it when you visit. Our waitress was super friendly and tentative. The atmosphere was relaxing and the Bloody Marys were very good."}
{"text":"While staying in town at the Courtyard Marriott with my boo and his sister we decided to check this place out for dinner since it was literally a two minute walk for us. I loved the vibe of this place, very open and bright. It almost reminded me of being in So Cal near the ocean. 

We started off with a couple of drinks. I really liked he concept of the icetini, but wasn't crazy about the flavor. 2/5 The cherry limeade I had though was on point, very tasty. 4/5 For food we shared the lobster stuff avocado. Essentially it was a tempura breaded avocado stuffed with lobster goodness and a couple amazing sauces. This was definitely a 5/5 for me. For an entree we shared the southwest ahi. It was also very good, loved the corn salad hat came with it. 5/5 

I think the only thing I wasn't crazy about with this place was the price. It seemed a little expensive for what it was, but I'd still come back again if I'm in the area."}
{"text":"We had a wonderful Valentines Dinner here last night!  They had added several dinner specials for Valentine's Day - two people in our party had the halibut dinner.  It was fabulous,  also recommend the Shrimp Fettuccini & the Ahi!"}
{"text":"Folks...I'm perplexed by how this place has four and a half stars rating. Yelp has failed me this round. 

It was a Saturday night, filled with hope...a lot of hope for the Smokin Fins. We arrived around 8ish and the place was somewhat hopping. I say \"somewhat\" only because there's people but it's not quite packed. We were seated right away and immediately we decided on our drinks. Margarita and the Beach Bum. Both drinks sounded great on paper but left us feeling empty and sad. Beach bum lacked alcohol and had way too much syrup. Not a very well crafted cocktail at all. Already it was a sign for us to leave yet we stayed against our better judgement. 

For food, we ordered calamaris, lobster tater tots, steak tacos, and southwest poki bowl. All of which were unsatisfactory to say the least. Our appetizers were salty and entrees just bland. We had to ask for sauce to help make these dishes better. It shouldn't be this way. 

To all my foodies out there, skip this place. Don't be a victim of bad food and cocktails."}
{"text":"Smoke: Check
Fins: Check 
Smokin' hot quality? Ehhhh 

My experience in three words: Crash and burn.

My experience in more detail:

Smokin Fins serves grilled meats, seafood, as well as salads, bowls, tacos and soup/stews. The restaurant itself is really large and has a contemporary warm feel to it. We were in the area and decided to dine here since it had been on my bookmarks list.

We started with the lobster tater tots. For close to $10 we got 4 thumb-sized breaded \"tots\" which were more like croquettes since it consisted of mainly mashed potato with a bit of shredded potato in the mix. I didn't really taste nor discern any lobster flavor nor see any noticeable lobster meat and it was really super salty for my tastes. 

For the entrees I went for the cioppino because you don't see it on menus very often and because it had the \"SF\" symbol meaning that it was a favorite. Not to be overly suspicious, but my first thought when I saw that symbol next to the price tag was, is it a self proclaimed \"favorite\" because it is the most expensive seafood menu item on the menu? I figured I'd roll the dice, take my chances and see if the cioppino lived up to its status!

I probably should have known better than to get a San Francisco signature dish in Arizona. When it came out I was initially really impressed with the presentation since they included a half portion of snow crab legs in the \"stew.\" However, those thoughts soon went up in smoke as the entire dish itself was really disappointing. I'll even venture to say I really hated this dish. The plus was that there was a lot of variety in the cioppino: shrimp, clams, mussels, fish, and crab legs. However, the mussels were super tiny and the clams were not cleaned well at all. The sandy grittiness permeated throughout each clam and the more I ate the more the clams dispersed the grittiness into the surrounding stew, causing all the seafood to become gritty as well. You could say it tasted like the beach for I felt like I was eating tomato infused sand. One BIG no no was that they served me clams that were completely closed and could have been very dangerous to eat for anyone not in the know about seafood safety. The fish had bones in it and was served with the skin on. I don't enjoy eating rubbery fish skin if it's been put in a stew but that's my own preference. The crab legs themselves were so salty I couldn't actually taste the natural sweet flavor of the crab. The best seafood out of the whole mix were the shrimp but due to the sand in the dish they were gritty when I bit into them. 

I also really didn't like the actual stew the cioppino was in. Cioppino is normally more broth-like. This felt like I was eating a bunch of canned stewed tomatoes or eating a chunky marinara sauce.

The cioppino was served with 3 pieces of smoked grilled bread. I liked the smoke flavor but 2 of the 3 pieces were so charred on the outside that I was basically served burnt bread.

I had a bite of the honey chipotle salmon which I liked better, but had the same problem of being grilled for so long that it had an unpleasant bitter char on it. 

The only redeeming quality of my meal was the friendly service. 

After all that I was still hungry. I went to a nearby Chik-Fil-A right after my meal and felt more satisfied eating a grilled chicken sandwich for $5 lol. Quite honestly I probably would have gotten better food for cheaper at Red Lobster across the street (Burn!). 

The decor and service are nice, but it's all smoke and mirrors if the food isn't good!"}
{"text":"I enjoyed this place. Took my boyfriend for his birthday. We order the calamari which was AMAZING! I loved that key lime sauce it came with, the California roll was pretty basic nothing to crazy but that's the only roll my boyfriend will eat and I'm pregnant so I couldn't try the other sushi rolls. He ordered the shrimp scampi and I ordered the bison burger with no blue cheese. He likes this scampi because the shrimp were HUGE and he had like 10 of them and my burger was delicious. Get the smokey fries !"}
{"text":"Have tried multiple dishes and everything has been excellent from salads to sushi to 24 Nashville chicken, and tacos they have all been excellent. Have only been in for lunch and new favorite in the area."}
{"text":"Great HH choices to choose from, fast service and though the restaurant is new, you wouldn't know because all the servers have the flow down and energy high. I was pregnant when we went in for dinner but I will absolutely be back to try the cold cocktails I noticed everyone ordering."}
{"text":"I ate here a few weeks ago and it was amazing. The happy hour prices are unbeatable and the food was delicious. The experience was really brought together because of the server. Madison was very attentive and gave great recommendations. I will definitely be coming back."}
{"text":"This restaurant was really good. Came for happy hour. Loved their pinot noir house wine. Ordered miso, edamame and the El Diablo. The miso soup was probably the best I have ever had. The edamame was edamame. The El Diablo was just okay. For  $14.95 I thought i was going to get this spectacular roll that was phenomenal. It was decent. Overall, I enjoyed the atmosphere at the bar and would come back here and probably just order off the happy house menu."}
{"text":"Went this afternoon not expecting too much as I am not real fond of sushi. All I can say is WOW! From the time we walked in the staff was very attentive to us going over some menu items. The place is gorgeous, open air and really looks excellent. We had shrimp cerveche verde and it was very good. Then came The calamari by SUPRISE and it was amazing. Excellent quality rings only (which is how it should come). Didn't even need dippin sauce yet Had a horseradish based sauce that was good but could have been spiced up with a touch of Siracha sauce. MGR Sara and Josh made our visit with a brief history of Smokin Fin. They are both great at what they do and with staff like that and food like we had this place is a sure winner."}
{"text":"Heard rave reviews about this place and wanted to give it a try. All I can say is the food was extremely salty. Don't know the chef is heavy handed but every dish is seasoned more salt than it needs to be. I ordered the tater tots lobster, clam chowder, and a couple of rolls. By the end of the night I had 5 glasses of ice water."}
{"text":"So you say you're a foodie? And you have'nt been here?!?! My only complaint was I born with only one stomach. Too much good stuff to choose from. Sushi, eclectic seafood creations, fresh as f!#*! Its all there... on point drinks to wash all the goodness down. Ask the bartender for some Jimmy Juice in your Greyhound.... with a cherry on top"}
{"text":"Sooo yummy!! I had one of the best Spicy Tuna roll...so fresh and I accompanied it with a miso soup. No tofu in the soup but who cares, right?! Wish I would have discovered this place earlier on my trip. Will be back if I'm the area again for work."}
{"text":"Two things that brought me in from reading the reviews are no longer available... 

1. Happy Hour on Fridays & Saturdays after 9pm 
2. The Steamers

just my luck i guess.. our server did mention the steamers are seasonal and may come back in september. 

casual setting and good for a date night! service was prompt, friendly and was offered a sample of the clam chowder."}
{"text":"We had a great dinner here. The food was wonderful!  We started with the crispy calamari and outstanding brussel sprouts/cauliflower appetizers. The california roll we ordered was fresh. The fish and chips were very good.  The fish was very flakey and not greasy.  The french fries were crispy and not oily. The salmon was cooked to perfection! It came with fresh roasted vegetables that were great.  The mango and shrimp tacos were very good.  There was a lot of mango which was very nice. The service was outstanding. We received a fried ice cream dessert because we were celebrating a birthday.  It too was excellent! I would recommend this restaurant for anyone wanting great food and service!"}
{"text":"SF-I really enjoyed your food. I have to take a star off for poor grammar and deceptive ad practices. I don't know what a smoked fin is, but I sure as heck didn't see it on the menu. We had the lobster stuffed avocado which was some kind of treat that must have been concocted by a team of scientists hell bent on making this a better world. The smokin mac cheese was very good, but how's about a little more andouille sausage? Give it up Mr. Fin (if that's your real name). Oh, and give those scientists a raise!"}
{"text":"Great spot for an excellent dinner with friends! Good seafood menu! We had the pecan crusted Halibut great choice! We also had the key lime Calamari and the Lobster Avocado toast
The food was well prepared and we started planning our next visit on the way home ! The happy hour is well worth you time found a great value for some good food and look forward to our next visit!"}
{"text":"Awesome,  everything we ordered was great.  Lobster Tater tots,  Kahlua pig,  Atomic roll.  We will be coming back.  Order an icetini for a special treat."}
{"text":"I love love love this place.  I come here as often as I can.  All day Sunday happy hour.  AMAZING drinks!!! Try the Smokin Gun if you like whiskey.  Lobster tater tots of friken awesome for an appetizer.  Same with lobster Mac n Cheese for a meal. The atmosphere couldn't be better for a relaxed yet not sloppy feel.  Music is chill. Service is on point,  strong drinks and I've never had to wait."}
{"text":"Don't believe the hype. Nothing about this place is good other than the sake. My soup was tasty but no where near hot. Nigiri sake wasn't even fresh enough to bite into. I'll pass."}
{"text":"A friend and I decided to try Smokin Fins because we heard they had amazing sea food. We came and sat at the bar, and were immediately greeted by the bartender who was very friendly and helped us pick some of the house specialties. The food did not disappoint we started with their lobster stuffed avocado, and got entrée salads and pasta and the portions were very generous and the food amazing! To top it off we tried their bread pudding which was probably my favorite item we tried. Highly recommend great food, service and atmosphere."}
{"text":"Great happy hour and amazing food.  We have been here a few times, long wait to get in during the peak hours however I would say it's definitely worth the wait."}
{"text":"Great menu -great food and absolutely the best bread pudding around! Very friendly staff! Hope this place stays around!"}
{"text":"I have been here twice since they have opened and both times have been great experiences...They clearly know what they are doing here.  I have read they are part of a chain, but from the good quality it tastes like someone's personal effort.  I'll be here often!!!"}
{"text":"This restaurant bills itself as a \"concept\".  I'm thinking this translates to \"We have a corporate menu that we create in our corporate kitchen, following Generally Accepted Accounting Principles\".  Watching the activity here, and trying the food underscores that definition.

Normally, I choose to dine at local chains or independent restaurants, you know, the kind that eschew words like \"concept.\"  This was different, a birthday dinner for a close personal friend of my wife.  So, inner Esteban says \"suck it up, buddy, and try to enjoy the experience.\"  You see, I had already viewed the website and knew what I was in for.

Okay, enough of that - I'll just get to the experience.  We were quickly seated at 6:00pm on a Saturday (red flag) and provided menus for food and beverages.  There was no beer menu, but the server recited the tap offerings, starting with Coors Light.  (another red flag)  The server was kind of just doing his job.  He exuded a sense of \"I'd rather be someplace else, but I survive on the meager tips I earn here\" and really was, well, let's just say his serving style was \"hands-off\".  He spent more time chatting with the bartender and other servers than actually attending to his guests.  That pretty much describes the entire service experience.

I ordered a Blue-Cheese wedge, and the ladies ordered a sushi plate.  Birthday girl had been before and ordered a sushi she called a \"caterpiller\".  Uninterested server-guy did ask if it had antennae, but was fairly unconcerned after that, but did suggest the Dragon (which, upon delivery, looked nothing like pictured on the website.)  The ladies loved the sushi.  My salad was dry - barely any dressing on it, the bacon bits were stale and burnt and it was pretty much a lame salad.  Oddly, there was no ground pepper offered, and no seasonings of any kind on the table.  By the time uninterested server guy returned so we could discuss this, I had about three bites remaining and the point was moot.

For dinner, I had the \"Nashville 48-hour marinated\" chicken.  Wife had a Seared Ahi salad and friend had Fish and Chips.  The Ahi was cooked nicely, but the salad was just a pile of lettuce, as in No. Other. Vegetables.  (not as pictured).  It was also so light on the dressing, wife could not tell if was there and had to ask for more.  The Nashville chicken breading had good flavor, but again, looked nothing like the picture.  (I keep hammering on this because that is how corporate restaurants work - every dish should look like the picture.)  The chicken was clearly dropped in the used-oil fryer straight from the freezer.  This makes it tough and difficult to chew, which is not how a chicken breast should be.  It was also sopping in grease, so much so, I had to use a bar napkin to soak some of it up.  The plate was at least half-full of their disgusting looking seared vegetables - essentially zucchini and squash.  There was a mound of nondescript mashed potatoes under the chicken.  Birthday girl said the Fish and Chips was rubbery, and not much else.

All said and done, not my favorite restaurant experience.  I'm sure they have a market, probably the people that are taking a break from Applebees.  Me, I\"m like meh, there are better ways I can blow a hundred bucks."}
{"text":"Thanks again Stephanie. Best service we had on our stay in Phoenix. Ask for Stephanie!! Today we were in the area for a little shopping and found this restaurant it's on the side of a plaza ...being from California I was weary about the fish. So we check it out... it's empty but little did we know we were five minutes early from open and they let us in with welcoming arms... the manager sat us down and we immediately asked any recommendations and she gave us 4 which 3 of them we tried...first the tempura avocado half (best app by far) which was something out of this world... second we tried the special which was a grilled shrimp and strawberry salad... this is definitely for all those who agree raspberry vinaigrette is a bit to strong this was on the milder side... one recommendation is use a different salad mix rather then the garden leafs.... now to talk about the fish we had the sunset roll as well as calamari the sunset roll was outstandingly fresh as well as a nice kick of spicy to it. The calamari is a must try.... however the food was not only good but our server Stephanie guided us through the entire menu... including knowing every beer on draft... she also knew the lunch special and keep in mind we showed up right as the doors opened and she was ready for us. I thank her for making my birthday lunch amazing for my boyfriend and I."}
{"text":"No need to go to Scottsdale for ambience, class, quality, service, and amazing food from a different and varied menu. The atmosphere is so perfect with choice of inside/outside/sports bar including fire pits. Prompt seating and perfect service. 6 of us had Asian, BBQ, salad etc. plus excellent appetizers and drinks. Desserts to die for. Great evening, we'll be back."}
{"text":"Calamari is awesome. Sushi is worse than the grocery market. Waitresses nice and pleasant to look at. Restaurant is designed well too."}
{"text":"The sushi here is awesome. The only thing preventing this place from getting 5 stars is the HH could be better. Other than that though, my husband and I were impressed. This is where he will be dragging me next time when he gets his next sushi craving!"}
{"text":"Soup was cold when it came out, oysters were decent, the steak tacos fell apart, had minimal flavor and the steak was burnt and very thin. The Seafood Paella was not very good. Shrimp was the only good part of it. Clams and Muscles, you got the shells and no meat.  The Lobster stuffed Avocados was pretty delicious.  Service was Five Stars, but the food is def 1/2 to 1 star."}
{"text":"I noticed that this restaurant opened up couple months ago or so. When I looked through the pictures on yelp everything looked pretty good so came to check it out.. the restaurant is very spacious and love their chandeliers.. we ordered the el diablo roll and the kahlua pork along with a sangria.. everything was good but the sauce on the pork was missing something.. but other then that the food was pretty good. Going to give this place a 3.5 stars for now bc we had to flag the waiter down for more water and he forgot to bring out the sangria in the beginning"}
{"text":"Phenomenal food and service. I would recommend it to anyone. They have a large selection and more than just sushi. Definitely coming back!"}
{"text":"A little pricey, but the lobster Mac and Cheese was so good. Nice chunks of lobster. Enough for my husband and I to share with an appetizer before. The mushrooms we're good too! We will be back!"}
{"text":"Great new addition to Cha-tukee, super tasty seafood/grill. The lobster Mac and lobster toys were delicious. I really loved the Ahi+scallops plate. Two of my favorites together makes choosing a non-issue. Great casual cool setting and nice patios and open setting with good music and friendly fast service. We will definitely be back!"}
{"text":"I've been here at least 5 times, and every time I go it is phenomenal. The staff is always super friendly and helpful. They are knowledgeable and the prices are extremely reasonable!"}
{"text":"Came again. Omar told me to get honey chipotle salmon. And I do as I'm told!  NO REGRETS!!  I will order this dish the next 8 times for sure.  I can't believe how in love I am. This place does NOT suck."}
{"text":"Great place. Love the ambiance and the area. Brian our bartender/server was very nice. Found out that he is originally from the area that we currently live in. Nice conversation. Also spoke with Nate on our way out. Nice guy. Wish they had a location near the Tucson Premium Outlet. We could use something unique down there."}
{"text":"Chicken was so spicy I couldn't finish it. I ordered a pre-dinner cocktail, a bourbon mule, with caramel, orange liquer, and candied bacon.  I got a bourbon, with an orange slice.  I sent it back and got the same thing with a little orange liquer.  I complained again, it was a $10 drink, and the server said they were out of caramel and candied bacon.  I wasn't impressed, probably won't go back."}
{"text":"We decided to try out Smokin Fins based on reviews posted on Ahwatukee 411 and based on reading the menu and house rules on the way....I have to say, Smokin Fins met and exceeded our expectations!  The place was packed but we got lucky and snagged two seats at the bar for drinks and dinner.  The  Judith Point calamari is as advertised - delicious (ask for a side of the spicy aoli to go with it).  I had the Caesar salad with blackened seared Ahi instead of the salmon and they were happy to accommodate that request. My wife had the shrimp tacos. Both dishes were delicious!  Madison delivered great service and we had a chance chat with Nathan the General Manager who shared the history of Smokin Fins....we had a great experience and are taking the whole family back on Monday evening (kids included). Sarah was terrific at setting up our reservation in advance complete with booster seats for the kids.  Nice to have a great place like this in the area - it was sorely needed!  Cheers to Smokin Fins!  Make sure not to overlook the \"Sides\" on the menu - I did, but my wife found them!!! Great, creative house rules, especially - \"Cheap fish is not good and GOOD fish is not cheap!\""}
{"text":"Best Banana pudding I've ever had!!! Great service... clean new place. Highly recommend"}
{"text":"I was looking for a new place for my friend and I to try so, as usual, I turned to Yelp. Impressed with the reviews here, I decided to try Smokin Fins. The folks here did not let me down! Only opened since March of this year, this little gem is sure to become a favorite spot. The atmosphere is upbeat and fun yet comfortable. The server was friendly, well informed, and checked on our table just the right amount of times. The menu has a nice variety but at the same time was not overwhelming. The food is fun and unique and so, so, so delicious. We had the avocado and shrimp crisp, fried calamari, lettuce wraps and edamame. Each dish was cooked perfectly and the portions were just right. So happy to have found a new restaurant! Cannot wait to return!!"}
{"text":"This place is amazing.  We came in on a whim for Friday night date night.  We ordered the stuffed mushrooms and kicking shrimp appetizers, along with the oysters.  All three were amazing.  After apps we split the Chipotle salmon, which was amazing.  No desserts though, because we were stuffed by then.  Service was attentive, atmosphere was a little loud, but not too bad for a busy Friday night.  Overall a great experience!"}
{"text":"I would have no hesitation returning!  

This is casual, modern and clean!  Many seating options and a sizable menu. They feature sushi items, poke bowls and smoked items. Along with items that are cooked on cedar planks. 

I wanted to try it all!  I tried their smoked wings!  I found them nicely smoked, plump and some crispness. Plumb and smoky...yay!  They come with a yellowish sauce to dip them in. It had a smooth slight spice flavor...excellent!  Enjoyed the wings!

Tried the seared scallops and ahi tuna resting on a cauliflower purée and arugula. With small cherry tomatoes and roasted cauliflower.  The scallops were perfectly cooked medium rare. Melt in your mouth. The ahi was cooked perfectly rare and well spiced. I really enjoyed the roasted cauliflower. Wish there was more cauliflower and one more scallop. 

The service was wonderful!  Friendly and efficient. Free wi-fi. Clean bathrooms."}
{"text":"I am coming back. I was very impressed with the menu and everything we ordered was outstanding. Spicy Lobster Roll, Philly Roll, Shrimp Scampi and Lobster filled Avocado. This is a new favorite Sushi place. Ambiance is chill, with a sharp, clean, contemporary look. Patio was awesome as the weather allowed us to relax outside."}
{"text":"Second and LAST TIME we try this place.  Looked forward with anticipation to this restaurant opening. Tried it shortly after opening and the service was terrible.  We figured it was just the vagaries of opening a new restaurant.  Went this afternoon, March 19, and were seated promptly on the patio.  And seating was the only service we received.  Three waiters came out and looked at us but made no move towards us.  We obviously weren't seated in their section.  Another couple was seated after us and received attention immediately.  They obviously WERE in the right section.  Smokin Fins blew it.  We eat frequently so it's your loss."}
{"text":"The food was below average. The service is worthless. Our server didn't even care to be working at this place from my observation. She was rude, she forgot to put the order in, she didn't know the beer list. We had to wait 30 minutes for 1 sushi roll and a salad that we didn't even eat. I won't be coming back."}
{"text":"Don't know why this place is never busy- the food is very good.

It's my second visit- the calamari is very good and I love the poblano chili soup.

The bar waitress, Megan, is adorable and efficient. 

I hope more people come here - because  i want it to stay open! 

Pics coming"}
{"text":"Great experience at Smokin Fins.  We were planning on going to Tokyo Joe's but changed our mind. So glad we did!! We were treated amazing.  From the assist Manager Sarah and our nice young waitress Cierra! We were so impressed that we had dinner there 2 nights in a row.  
If you're ever in Chandler, Az and want to eat some great food check out Smokin Fin.The sushi, salad, tacos and drinks were amazing."}
{"text":"My friend and I came here for drinks and appetizers after work and we fell in love with this place! The decor, the food, and the very impressive drinks will surely have us coming back for more! They also have an awesome outdoor patio set up that is ideal for intimate gatherings or just a late drink. The staff was also very friendly and attentive. My only complaint is how rushed we felt when the time came to clear our plates. It seemed as if our server was anxious for us to pay and leave, she came by our table numerous times inquiring about the check and it made us feel inclined to leave...even though it was a Monday night and relatively empty. Aside from that, I suppose it could be chalked up to her having a bad night, our experience outside of this was great. 

P.S. I also saw the bread pudding coming out of the kitchen FREQUENTLY, I didn't try it but I most likely will next time."}
{"text":"Decided to try a new sushi restaurant for Mother's Day. Ordered the calamari that the menu states is a restaurant \"fave\". Cooked well but the sauce was to not for me. My mom and I always have bigger eyes than stomachs when it comes to sushi and this day was no different. Three rolls were ordered the sunset, platinum, and the macadamia. Sunset was by far the best, I actually wished I would have ordered two of them! I had one their icetini, presentation was pretty and it was very tasty. 
Service was below average (it was not super busy when we were there) and that was the main reason for the 3 stars.  Took about 5 minutes to even get someone to say hello to us once we were seated, once water was delivered it took two different request to get my glass refilled. 
I will go back to try a few more items that came out if the kitchen and looked great and hope for better service."}
{"text":"Food is great, portions are generous, beer list is good, staff is super friendly and attentive.  Do not leave here without trying the lobster tots!"}
{"text":"Started off well, Asian server with the tattoo 1/2 sleeve was super nice. After taking our food order she was never seen again so I had to stop a different sever, which I HATE to do, in order to get another beer. The server that I stopped was nice and took care of it pretty quick. 

Then the New England clam chowder came out and was more like Curry Clam chowder. Should be advertised as their own spin on Clam Chowder...didn't like it, literally 3 bites and couldn't eat anymore. No problem because you can't please everyone and it just wasn't to my taste, HOWEVER the manager asked about it then made the comment, \"Sorry we'll take care of that.\"  Now I'm not into freebies nor was I looking for one, but when you make a comment such as that I was expecting to at least remove the soup cost or ask if we'd like a different soup since we didn't like it. 

NOPE, neither happened. 

I felt bad not leaving a tip for the 2nd server who ended up basically giving us the check and nothing else.  Literally, she did nothing else...since by the time she was assigned to our table we were done and only needed the check. 

The place was NOT super packed and the male server I mentioned earlier was easily taking care of his several tables all around us and providing what appeared to be great service. 

I most likely won't go back nor recommend this place. Sad too because the restaurant is nice and I work nearby so I was hoping I had found a low-key spot to enjoy happy hours and team meetings, but after this 1st visit I doubt that'll happen.

Edited to add a positive note, happy hour nachos and happy hour steak tacos were pretty dang good."}
{"text":"So the most famous thing is salmon cooked on a plank.   I obviously got it because it's my MO, to get the thing that this restaurant is known for. 

Salmon came out excellent.   It was even served on the plank so you know they didn't use it again and you can actually see the burn marks. 

I didn't try the rest of the menu but if this is quality, I would be happy to try more off the menu."}
{"text":"Stopped for a late lunch...shrimp rice bowl was very good and same for Key West Cobb salad. Miso soup was good but could have been a bit warmer. Service was top notch and drinks were hand poured and generous. Would definitely stop again."}
{"text":"You guys, I had 7 whole medium sized shrimps in my scampi. Sound the alarm, the apocalypse is coming, because this is quite an amazing feat.

This place just opened so the service is excellent with them constantly checking up on you and making sure everything is up to par. We'll see if they keep this up a few months down the road though as things tend to slip, just like when you're out of your honeymoon phase in a relationship and you finally feel comfortable farting in each other's presence. They've definitely invested into this place's decor and I could see this being a place just to catch up and drink, even for those who squeal like a frightened pig at the idea of seafood. I loved the patio area - definitely doesn't make you feel like you just parked in some monotonous Chandler shopping plaza. 

Food was excellent and everything came out on time. They make sure you understand from the get go that they use sustainable seafood which I can appreciate, though I'm weary about such claims. I'm so glad I ordered what I did. I normally don't order it because Shrimp Scampi dishes tend to usually only come with enough shrimp sized to feed a goldfish, but the portions were perfect and hearty to my surprise. No longer am I afraid to order any shrimp dishes at this establishment, in fear that it'll only disappoint me. Kind of like when I get the mail hoping I'll get something other than bills. 

I do wish that they put some complimentary bread or snack while you're waiting. Besides the menu, they have specials everyday so be on the lookout for that on the chalkboard. I came with a party of 5 and everyone's food looking pretty amazing presentation-wise. The soup comes filled to the brim so if you were expecting to have to order a side salad, you might want to think twice as that baby could fill you up by itself. The only thing I wouldn't recommend is any of the nigiri because I don't think you're getting your money's worth for what they serve. They aren't an Angry Crab kind of a restaurant, more of a fish and general American food restaurant so don't come expecting any other sea creatures. 

They have my favorite type of seating: booths - but just a limited amount so if you're hoping for one, just make a reservation with that request. Red Lobster across the street finally has some competition after a couple of failed attempts in this very same space. This restaurant was meant for Gilbert or Scotty, but somehow ended up in boring Chandler which I am so grateful for."}
{"text":"My favorite place to head to after work! Great food AMAZING sushi! Enjoy fire pits and icetinis. The service is always impeccable"}
{"text":"Stopped on for lunch and had a great meal - the clams were amazing with perfect seasonings and bite!  The shrimp avocado crisp was wonderful and the special was salmon tacos with an unbelievable creamy cilantro lime rice!  Service was great - thanks John!  Prices reasonable - will be back often!"}
{"text":"This place was amazing all the way around great food great service friendly enjoyed the whole experience tremendously. Sara was awesome will definitely be back."}
{"text":"When my friend first recommended that we go here for happy hour and I looked up their menu, my first thought was, what a variety! lol. 

Good lord, this place has everything! sushi, mexican, american, and really good drinks! We came for happy hour so I ordered an icetini. I think it was the strawberry one. The concept for this glass is nothing like you've seen. So they pour your drink in a piece of ice that's shaped to fit in the glass. So you're drinking your drink out of a piece of ice. It's a good concept because it keeps your drink nice and cool, however, since the ice melts, it drips everywhere when you're trying to drink it. lol. 

For food, we ordered the lettuce wraps, calamari, and kickin shrimp. Everything was delicious! the shrimp was a bit spicy but it's still really good. 

Customer service was also really great, they have a cute outdoor patio. They have happy hour every day I believe. all day on Sunday!"}
{"text":"Felt like I was in my San Francisco bay area. The sushi exceeding my snob sushi expectations. You must try the deliciously tempting clam chowder. It will simple nock our taste buds stocks off. Megan the bar tender and greeter warmly welcomed me. Mentioned all the wonderful unique drinks being offeted.  The cute decor was accented with multiple screens offering the latest sports games.  If your craving high quality sushi that's fairly priced, I would strongly recommend this rock star place."}
{"text":"Appetizers were good, no complaints really (we got asparagus fries and edamame)

However two people at my table ordered sushi rolls, and the rice was extremely dry/undercooked. The manager was nice and had them remake the rolls with \"new\" rice that was only slightly less dry. The roll itself (Platinum roll) was almost entirely rice on the inside with only minuscule pieces of fish on top. In the end they gave us free appetizer coupons, but we would have rather had the sushi comped. 

I had the Southwest Poki Bowl, which was good enough. Flavor wise it was great, however the fish was on the light side and didn't taste very fresh. For $14 that could get you a giant Poke bowl at one of the many nearby places, so I also was a little let down.

I wanted to give 2 stars but I would have felt bad - the service was good, and everything looked pretty at least; the execution was just off. If I ever come back I will have to try something else."}
{"text":"Great place to enjoy an alcoholic beverage along w good seafood! Service was excellent thanks to Kohn and Sara the manager! Great wine list! Can't wait to return. Bison meatballs amazing w arugula and Parmesan cheese. Will definitely return"}
{"text":"I went back for my second visit, and I am so impressed with the way the kitchen respects a good piece of fish. I ordered the salmon Caesar salad, and I'm not exaggerating when I say that it was the most perfectly cooked piece of salmon that I have ever had. Not even the slightest bit overcooked, as often is the case. The rest of the salad itself was perfectly fine, but every time I think about that piece of salmon, I wish I had a plate of it in front of me. I'm going to have a hard time not ordering it again the next time I visit."}
{"text":"#666

Hosnaps!  Check out that number!  Sizzle!  Devil!  Hiss!  Fire!  Diablo! 
...Rock & Roll?!?

I couldn't figure out what I wanted to write for my 666th review.  I was thinking about a place with the word \"Devil\" in it but the closest I got were janky places that were Sun Devil related.  Then I was thinking about a spicy place but I kept running across Szechwan food which I admit isn't my favorite.  One thing led to another and I landed on Smokin Fins.  This place sounds both cute and super delicious without me having to burn my culo.  And even better, this is where I celebrated my birthday! 

I had ordered the Brussels & Cauliflower [Brussel sprouts and cauliflower flash fried with blue cheese crumbles, bacon, and smoked sea salt. $9.99], Platinum Roll [Crab and cucumber inside topped with Salmon, Ahi Tuna, Hamachi, and Ebi Shrimp with layers of lobster-crab salad, spicy aioli, green onions, and tobiko. $14.99], and two alcohol beverages [a Spiced Mule and a Smokin Gun].  And what's even sweeter, the waitress brought me Tempura Ice Cream for dessert since my friends told her it was my birthday when she asked if we were celebrating an occasion.  How thoughtful! 

My food was amazing.  I am absolutely in love with that Brussels & Cauliflower appetizer.  It was salty, the texture was crispy, and the bits of bacon and blue cheese gave all the vegetables a nice explosion of flavor. The Platinum Roll was tasty and I enjoyed every bite.  It's one of their signature rolls.  I also got to try my friend's Seafood Risotto and it was so delicious.  It had just enough white wine to make my skirt flip!  I also ate half a Blackened Cod Fish Taco which had good flavor.  The Key Lime Calamari was also quite impressive.  Lightly coated calamari rings, perfectly fried, and served with a side of key lime aioli.  Yum!  As for the Lobster-Crab Stuffed Mushrooms, wow!  They're small but packs a lot of flavor.

The decor was gorgeous.  We were seated at a long table by the back patio so it was a tad on the warmer side.  As the skies got darker, the lighting made the ambiance nicer.  I had a great night with some of my favorite people in the world.  Thank you for a great birthday dinner, Smokin Fins!   I would love to come back to try their other dishes! 

A fish should swim three times --- in water, in butter, and in wine!"}
{"text":"This place is so beautiful! Right when we walked in we were greeted with a smile and from then on everyone was so nice! I love that they have the u shaped booths and that's were we sat! The waitress, Sierra, went over all the specials with us and took our drink order right away! We both started with the Jalapeño Cilantro Margaritas and they had such a good spicy flavor and I'm picky with my margs! Second we got a dozen oysters... they came with an Asian sauce that took them over the top and really made them unique! Next I ordered a Tempernillo Wine  and my husband got The Smokin fin cocktail with makers mark that they lit on fire along with candied bacon!! Definitely order this drink because it was so good and definitely a sipper cause it packed a punch;) Next the 6 Spice Ahi with fried rice and spinach! And the big finale... Bourbon Caramel Bread Pudding! Wow!!! We had to get rolled out of there! Everyone was so sweet and they really took care us! I would definitely recommend this place to anyone!"}
{"text":"The food was phenomenal, we got everything in a decent amount of time. It wasn't busy at all!

The two rolls and appetizers were fresh and tasted amazing! I would definitely recommend this place! 

And I'm definitely coming back!"}
{"text":"I started my meal with half a dozen oysters. It was fresh, delicious with no fishy smell at all. I highly recommend it. I ordered two sushi rolls (order 1 roll & the 2nd roll 1/2 price during happy hour). It was quite delicious. Service was outstanding, server was very attentive, and the general area is relaxing, clean, and well decorated. If you are looking for a place for a date night in Chandler, I highly recommend this place."}
{"text":"Great food! Not only seafood, they have burgers, pasta, along with their fresh catch fish of the day & sushi. Their sushi rolls here are to die for! They have friendly staff who are super informative about everything on the menu. Their lobster stuffed deviled eggs are so delicious, but then again everything seems delicious there. Sushi rolls are nice & big & very decently priced! Will definitely be back"}
