{"text":"What a great place to get your smoothies, paninis, and acai bowls! Smooth eats has the best prices you will find around and they use all the best quality ingredients in your product and it really shows in the flavor it's awesome! Not to mention the staff of smooth eats are the nicest and friendliest people I've encountered in any eating establishment thus far. This is certainly one of my go to spots from now on and I will be here on a regular basis from here on out! Amazing place and gets two thumbs way up"}
{"text":"$7 Turkey Panini with Pesto is absolutely delicious.  All natural smoothies with no added sugar.   The most delicious spot for a meal and reasonable prices."}
{"text":"Great place! Staff is super friendly and was great with my kid. Highly recommend. Dole whip was amazing!"}
{"text":"Was craving something healthy for dinner in Vegas; specifically an açaí bowl and found smoothie eats! The food was amazing and the service was even better. I could t believe how fresh everything was. If you're downtown, I HIGHLY recommend making a stop. I'll be back again for breakfast."}
{"text":"Just starting off with saying, this place is A MUST GO TO!!! Every single item here is so purely unique and delicious. Not to mention, how incredibly welcoming the owners are! They have exceptional service and are so sweet. The paninis and smoothies we had were amazing. Really nice for a healthy, but delicious treat. I can't imagine anyone not enjoying the entire experience when come here. Do yourself a favor and stop by!!"}
{"text":"Best service and quality food you can get downtown for lunch or breakfast. Would definitely recommend every single thing on the menu."}
{"text":"Wow! Amazing food and more importantly, amazing service! The kindest and most charming staff of any restaurant I've been to in Vegas. Generous portions of healthy and delicious food!l"}
{"text":"Really solid downtown option! 

We tried both the grilled cheese and the italian panini. 

If you're looking for that perfect Instagram cheese pull, this is your sandwich. The cheese just oozes out. It's a really good grilled cheese. I wish they had one cheese in there that's a bit sharper (like a sharp cheddar), so the flavor of the cheese still comes through when melted. 

The italian was super flavorful. I loved the pepperoni and the pesto. This is an EXTREMELY oily sandwich, though. Be prepared for all the grease. You're going to need napkins.

Smooth Eats is TINY, so I would recommend you eat on the go. Otherwise, you'll have to try and score the one table.

If you work downtown or are looking for a quick lunch option, check it out!"}
{"text":"Beet smoothie very delish and healthy. The owner was so nice as well! They also own the donut bar around the corner. Just visiting Vegas but will visit again when I return!

Really enjoyed my grilled cheese panini crispy and cheesy! I asked to add in the turkey...so yummy"}
{"text":"I've been here three times. Great customer service every time :)! My first time I ordered a grilled cheese sandwich on wheat (10/10) seriously, the cheesiest grilled cheese I've ever had !! I also ordered a Flex smoothie and a cookie and everything was yummy ! Second visit I decided to order the S.D. Toast for breakfast and it did not disappoint at all (the avocado was perfect too!) and finally, today I went back in for a quick fix aka a Flex smoothie and once again, I'm satisfied. Good atmosphere, good food, and good people :)"}
{"text":"I wish we had this place back in NY! I was on a hunt for healthy breakfast items and found this place on Yelp! So for the last few days i've been enjoying the Fairytale bowl and oasis avocado toast. I love how the fairytale bowl is similar in consistency, but offers a completely different taste to the traditional acai bowl. I even purchased many of the ingredients used to prepare the bowl. Please note the saying \"good food takes time,\" applies here because everything is done to order and prepared freshly. Be prepared to wait a bit, but it's definitely worth it!!!"}
{"text":"Wow this place rocks! Amazing customer service and a cool patio out back to sit and eat! The green goddess smoothie I had was to die for! Even my frenchie LOVED it! My husband had the Coates's panini and that was excellent! I can't have bread and the owner was so kind to make a gluten free version of their turkey sandwich using avocados instead of bread- it was amazing! Easy parking and great place to grab something quick and healthy! The donut show next door was amazing as well!!"}
{"text":"I loooove this place!

I have been here several times and each time I'm impressed. To say its an upgrade to Downtown is an understatement. 

I'm not familiar with their whole menu because we get the same things every time.

My SO gets the green one because his favorite fruit is mango. I need to steal a sip next time because I have never tried it. He usually slurps it right down. Yum. 

I always get the Beet Box because...well BEETS!!!! Its not too earthy and its not sweet. Just the way I like it. 

I somehow time it perfectly and get to grab a \"few minutes fresh\" wheatgrass shots. Always yum. 
Their ginger cayenne shot is good but it will put hair on your chest for sure. 

They have Dole Whip now. Yesterday when I was there the owner gave me a sample...lets just say it was sooooo good I wanted to order a huge bathtub of it. He said a large portion is $6, seems like a great deal!

The owners (gentleman & wife) are super duper sweet and their business partners own Donut Bar. 

Who doesn't love a high quality yet $5 smoothie?!?!
I'll be back again and again!"}
{"text":"Awesome place!! This is my second visit. I love the dole whip and the guys are AWESOME!!! A dope addition to the downtown community"}
{"text":"Today I picked up a smoothie bowl, some smoothies, and Dole Whip with my family. I love this place. Everyone that works there is great. The drinks were so good. They were healthy and tasted good. The owner was there and he knows how to make smoothies. He knows what's up if you're not sure what to get. 
What did we order?
Fairy tale- this was good. The mix if blue berry, granola, and dragon fruit over the smoothie mix is just delicious.
The goddess- this was my favorite. If you read the ingredients you might be discouraged on the taste. I think it's great!
Dole whip- when is this not good?
Golden Glow customized- it was great packed with goodness.

Good people, healthy, and delicious.
Now, go visit the place and get something delicious and healthy."}
{"text":"Best Toast & Smoothie bowl I've ever had. Everyone was really nice and the food is both healthy and affordable. Loved it!"}
{"text":"Super yummy food and friendly owner! We looked this place up while in Vegas as a healthy option and it was awesome! I got the avocado toast with the sundried tomato pesto and it was sooo yummy! If you like savory then give it a go. Oh and I got the blue açaí bowl. I can't remember the names but so pretty with the white dragon fruit!"}
{"text":"Love this place & the owners are awesome!!!! Everything is good that I've tried!! I've been coming here since they're soft opening and it's always amazing!! I can't wait to taste the tomato soup!! 

UPDATE: I had to update my review because the owners recently changed. Not sure how I feel about the new change just yet. The previous owners were awesome people and were always good to me. They had had such great energy & I loved the vibe every time.

If you didn't know the previous owners and you're just coming here for the 1st time, you'd probably think it was great. I ordered my caprese panini one of my usuals and it was still good. However the vibe just wasn't the same . And service is a big chunk of any business. I always was disappointed because I tried calling in my order because I know it takes a little while and I was on my lunch break but unfortunately they did not answer the phone. So I spent almost 1/2 of my lunch just waiting for my panini. Usually I call in and just pick it up. I'm not writing it off completely, not just yet anyways, but I probably will not be coming back as often as I used to. The girls that were there weren't rude or anything like that, they just weren't as fun and personable, low energy. It's just a much different vibe. Like I said if you're new to this place you'll probably love it."}
{"text":"Saw a post on Las Vegas Foodie IG and had to try their bowl and toast out. Made the trip before heading back to LA and I am so glad I did. Super delicious and healthy! The guys here are amazing as well! Cherry on top. Definitely going to stop by every time I am in town"}
{"text":"I've had two smoothies from Smooth Eats so far and both were fresh, tasty, and filling. The staff is friendly and fun, which makes for a pleasant visit. I'll be back regularly since I work within walking distance!"}
{"text":"Staff is super nice, super cool. Oasis toast is the perfect way to start my morning! Love the vegan options :)"}
{"text":"What a great addition to the downtown area! Smooth Eats stepped into a former juice bar but added friendly service and a limited but well-executed menu. It's definitely an upgrade in my book.

The smoothies are all $5 and you can add on extra ingredients like flax seed, protein, etc. but I stick to the basics. The Beetbox and ProGreens are solid smoothies... actually, they're liquid, like they're supposed to be, but the flavors aren't overwhelmingly earthy, bitter, or sweet, which seems to happen when I take a chance on chain smoothies. 

They have paninis, toasts, and acai bowls for those wanting something more substantial. So far, I've only tried the SD Toast (sundried tomato pesto, avocado, cilantro, sea salt) but I was impressed. I plan to try their strawberry version on my next visit!

TIP: If you're driving, this grab and go business is in a paid parking area. Short of them getting a dedicated parking space out front, your best bet is to pull into the lot around back and be quick."}
{"text":"My first time here today. Decided to try a smoothie and a Cali toast. I got the pro green smoothie, which has spinach, kale, banana, pineapple, mango, and he added a shot of ginger. Normally green smoothies that I have tried are gritty and doesn't have the best flavor. This smoothie was not that at all! It was very smooth, and extremely refreshing and tasty. The Cali toast I got was the S.D.  It had sun dried tomato pesto, cilantro, avocado, and sea salt and cracked pepper. I make avo toast all the time at home and this blew mine out of the water! It was delicious. The sun dried tomato pesto had the best flavor. I seriously am going to be sad looking at my avo toast every time I make it and compare it to the SD."}
{"text":"Delicious!! Great açaí ball!
The service was great and the food is served in a very nice way. go and check it out!"}
{"text":"What an awesome healthy option in downtown Las Vegas! The menu sounded delicious. The shop it's self is small but cute. The owner of the shop was very nice and educated me on the different juices and even let me take home a menu. I will definitely be back to try some of that beautiful toast that I've seen so many pictures of."}
{"text":"Delicious smoothie bowl, a great addition to downtown! Can't wait to go back :)"}
{"text":"after all the deep fried and high sodium foodstuffs of Fremont and the Strip, I needed something less processed to balance me out.

this joint is not big at all: a counter, a drink fridge, and workspace. after ordering, you can enjoy your unfried edibles in the ample outdoor space, just beyond the lobby.

the pro greens smoothie was just fantastic. maybe my body was craving freshness, but I felt all kinds of energized and cleansed after drinking it. the mermaid toast was a nice treat. literally tastes just like cream cheese on toast. that spirulina done snuck into my body."}
{"text":"This is what I live for, unique eats and awesome service not to mention I love business owners who are super dope and very passionate. Chad and Lindsey were uber cool and uber nice and really took the time to connect with us and I'm sure they do the same with other customers and of coarse Logan who hooked me up with the best mermaid toast ever. All in all 5/5 for the crew.

The place is brand spankin new and is making a big slash with the food scene. I came down for their not so secret, secret menu item the \"Mermaid toast\" man not only does it looks good it taste even better. 

I also got the apple cider vinegar shot with heathy blue stuff and it was mixed with their very own filtered water. Best apple cider shot I've taken. Followed that up with their ginger shot and man oh man did I felt so good. 

My girls loved their Dole whip which was of coarse refreshing and delicious and I can't wait to come back and try their avocado toasts and of coarse the mermaid bowl.

The best part of all this yummy eats is that it's all super healthy for you. Chad really took the time to explain all the ingredients and their health benefits and his conviction and pride for his food really shows through the knowledge and passion he has for the products he serves up and for me that gets a 2 thumbs up and a 5 star for sure. 

Love this place and will absolutely return and if you haven't been you must come!"}
{"text":"I stopped by for a Green Goddess Smoothie and it was very healthy and refreshing! I will definitely stop by in next time I am in Vegas. The owner was very informative and pleasant."}
{"text":"Love this place. Everything so fresh and healthy. The owner very nice and helpful. I got the berry smoothie and grilled cheese was very delicious will definitely be coming back"}
{"text":"My boyfriend was craving an açai bowl today so we stopped by this place. I can honestly say I have never had such a great experience not only with the staff but also with the bowls. Chad the owner was so warm and welcoming, he  gave us the perfect recommendations! my boyfriend got the regular Acai bowl  and I got the blue magic bowl. It tastes as good as it looks!!"}
{"text":"I like wheatgrass shots!! Brand spanking new! Fabulous crew of Donut Bar plus Chad. Two smoothies, orange & green, 2 wheatgrass shots. Service with Smiles, clean, friendly, thoughtful! Right now they have a petite selection of tasty sandwiches too. Simply fabulous. Support something Nice"}
{"text":"Omg where do I start... avocado toast has been taken to a new level!!! My absolutely favorite is the fairy tail bowl. The beautiful blue color packed with good for you nutritional benefits. This beautiful bowl is too pretty to eat. It gets its color from blue majik spirulina , topped with dragon fruit, blueberries, granola & chia seeds it was frekn AWESOME! I love great tasting health food and this place is it. You guys are really doing something amazing. I can't wait to try the other things on the menu. TWO THUMBS UP!"}
{"text":"My favorite spot to grab a healthy no sugar added smoothie or a mouth watering $7 Panini. The turkey was today's choice and will feed me for two meals the melted provolone and pesto were such a compliment to the sandwich.  Reasonable pricing and fresh food. Easy parking next door too!"}
{"text":"I ordered the fairy bowl and it look very beautiful to eat indeed but the flavor combo was not there for me. It was very subtle and there was just not enough toppings to eat with filling. It did look alot better than it tasted. I had high hopes but it didn't exactly meet them."}
{"text":"This place is tucked into downtown Las Vegas, right by Fremont St. it's got a variety of smoothies, sandwiches and bowls. Everything is made fresh and extremely tasty! If you need to purge your system from everything Vegas, this place is an ideal option."}
{"text":"My daughter and I were in from outta town (from Seattle)  and decided to try this place after walking around Container Park. Owner (I'm assuming) and his wife were very welcoming. I had grilled cheese panini  with a very warming bowl of tomato bisque. My daughter had the Darkhorse smoothie bowl which was meticulously constructed by his wife, she loved it!!"}
{"text":"Much more affordable than the Cosmopolitan's Juice Standard (as one juice is $13-$15) and their treats pack more flavor than Pressed Juicery's. As someone that's been a constant Pressed Juicery customer, I can say that with confidence. Super friendly staff and super yummy, nutritious treats. Refreshing smoothies, juices and paninis are offered in this tidy, quiet little pocket of joy."}
{"text":"Blue magik is bomb and the sd toast! Everyone is super nice, accommodating & informative, love it love it and will definitely be back soon!"}
{"text":"Small places pack a punch... very friendly, service good, unique food, very health... about of God covers but my favorites: FAIRY TALE bowl and GREEN GODDESS simple the best"}
{"text":"Came here on our summer vacation to Vegas, and read about this place, we decided to grab a quick meal before heading to do all the touristy things, this place was amazing loved that is a whole in the whole and prices weren't bad compared to the strip, the SD Toast was amazing, so was the Turkey Panini Sandwich, and the grill cheese we all had different sandwiches to try them and they were all on point. We also got the berry smoothie and it was refreshing. Definitely would recommend this place for a quick bite. The staff is also friendly."}
{"text":"Good for what it is- a quick smoothie and toast bar. Service was quick and the items were good and fresh. The mermaid toast was good but not much flavor to it. The dark horse smoothie bowl was refreshing and good for the price."}
{"text":"Great new addition downtown 

This place is a great new addition downtown it popped up on my yelp and I decided to check it out and I'm glad I did ... I came early in the morning there wasn't anyone but me.. it smells AMAZING in there 

I decided to get the fairytale bowl and the turkey panini ... there was only one person working I believe he was the owner he was very friendly and nice he told me to check out the donut shop next door ( I had been there before ) 

They have a cute sitting area outside with tables and cool paintings on the walls 

There was a little time for my stuff to be made he was the only person working... he gave me some of the stuff that's in the fairytale bowl while I waited it was sooooo amazing 

I took my order to go but man was everything perfect!!! The panini was nice and warm with yummy melted cheese and the bowl omg I can't even say enough except perfection 

If you are in the area you need to check this place out you will not be disappointed"}
{"text":"Now this place rocks. Avis bowls, wheatgrass shots, smoothies and CBD in your smoothies
And try the Dole Whip"}
{"text":"Customer service is top notch. Fresh ingredients. The owners care & it shows in their finished product. I don't go anywhere else now they are open."}
{"text":"We were looking for a juice bar and found this hidden gem...everything is made fresh, friendly service we had breakfast there 4 out if the 7 days we were in Vegas"}
{"text":"Had the Italian panini and the girlfriend got the Fairy Tale bowl, both of which were amazing! Would definitely recommend this place as well as the Donut Bar next door!

Customer service was great at both locations! Will definitely be coming back before we leave Vegas!"}
{"text":"I woke up one morning scrolling through my Instagram feed and here I am. I found Smooth Eats. The colorful toast grabbed my attention so I headed downtown to try out this Instagram worthy food. 

I ordered the Mermaid Toast which has almond cream cheese spread, with blue majik spirulina, and gold flakes. The presentation alone is beautiful! The taste was surprisingly good too. It was a mixture of salt and sweet but more on the salty side. It was definitely filling as well. It filled my hunger for a good 4 hours. I also received one of their green smoothies which had a lot of fruits, vegetables and protein. 

The place is located downtown around the corner from Donut Bar on the right side. The ordering area is very small however you can take your food/drink to go or go to their back patio where you can sit and eat. 

I liked how it's healthy, presentation ready and local to downtown! I'll definitely want to go back to try their galaxy toast!"}
{"text":"I came here to try the mermaid toast and it looks just like the picture! So pretty blue with majik, edible gold leaves and vegan cream cheese. Strange the coconut cheese doesn't taste like coconut and wish that the toast was toasted a little bit more, but it was yummy! Vegan food in general is expensive, ($9 for two pieces of toast), but I got it as a treat.

The flex smoothie is delicious; so smooth and not sweet with lots of natural peanut butter. For $6, a 24oz cup is quite filling!

The grilled cheese looks delicious and he put extra cheese. Also, they have vegan cookies! I tried the lemon poppyseed and personally, it's way too sweet for me, but if you like dense crunchy fudge, then you might want to try it.

The owner Chad, is extremely friendly and generous. He was very knowledgeable with all his ingredients and gives helpful recommendations. You can see he's so passionate in what he does and he even greeted us outside cuz we didn't know where to park; there's a 15min parking zone but other than that, it's paid street parking to which is enforced every 20 mins."}
{"text":"They have the most hip and trendy foods that I have seen from Mermaid toast to açaí bowls it's all great! It also makes for a very aesthetically Boujee picture, especially if you eat in their court yard. I highly recommend you visit it's an experienced out won't regret."}
{"text":"This is the best smoothie place I have been to in Las Vegas. They use all fresh ingredients, organic ingredients. Chad the owner was a pleasant individual. He shows a lot of pride in his business. My smoothie was awesome. Taste so good. I will be coming here more often. Chad you ROCK!!!!"}
{"text":"I came here for a second time yesterday. It's located on 6th street downtown. There is plenty of places to park out front, all were metered so bring a card or quarters. 

When we walked in we were greeted promptly. Everyone was super nice and the menu is simple and mostly healthy. They are also very VEGAN friendly, which I really appreciate. 

We opted for an avocado sundries tomato toast to share and wellness shots. We asked for the toast on wheat bread. When it came out I was pretty surprised because the bread is super thick and there was a lot of avocado... which was like heaven. The wellness shots were turmeric and ginger... they were amazing. They have a cute patio and court yard to sit and dine... which was perfect. They offer smoothies, coffees, smoothie bowls, soups, toasts, and other perfect healthy treats. 

Will I be returning? It was one of the best toasts I've ever eaten! I will definitely be back for more!"}
{"text":"Good food. Quick service. Killer smoothie deal. Can't wait to come back. Great spot to grab a lunch bite."}
{"text":"Awesome new little smoothie bar! They also have Dole Whip!! The Piña Colada was great, and staff is very friendly."}
{"text":"A cute spot in Downtown Las Vegas. I had seen a few reviews and the pictures looked enticing. Let me tell you! This place is amazing... food is great... service was spectacular!! I walked in with no idea what I wanted (other than something avocado toast) and they guided me through the menu and offered a sample of an amazing smoothie! I got the Green Goddess smoothie and the Oasis Toast! A little pricey... I'm trying to ball on a budget... but absolutely worth it!"}
{"text":"Not a place to order for claustrophobic people due to a very tight space when entering. My friend wanted to know if they had vegan options available but unfortunately not at the moment but took her suggestion at heart. I ordered the S.D and The Kicker sandwiches along with the pro green and beet box smoothies. The sandwiches came in a plastic container as open faced, which was perfect for sharing one of each type. The smoothies were perfect to drink under the 87 degree weather. I love how the patio out back is shared amongst the other shops in the building too. One down side to being a healthy food joint is they don't recycle which should always be considered with the vibe they give off as green friendly."}
{"text":"This is a little new gem that opened up down town by donut bar. If you know donut bar you will find this place. My friend told me about this place on yelp so I checked it out. I saw they had dole whip so I got more than excited because they were advertising it. I walked a while to go get some. I got there and they didn't have the stuff to make it. HUGEEEEEE bummer because I Walked all that way for it. I'm not upset because I ended up getting something  else but others aren't like that and might have been pissed that had advertisement up for something they didn't have yet. I'm understanding because I'm in the business but some others won't be as happy.

They said they would have it soon so I'm hoping that's true. I would say this place is in a good location being where they are. I do hope they succeed because we need a healthy alternative down there. 


I ended up getting a smoothie bowl that was incredible. It has hemp seeds, granola, blueberries and DRAGON FRUITTTTT!!!!  The dragon fruit was amazing it tasted like a subtle kiwi. If this place continues I hope they bring in more different exotic fruit because that would sure separate them from others. Especially with the farmers market so close. 

Besides the dole whip I only suggest two things as a new business, have different size bowls because I can eat a lot more and like options. Also add some more Berries on it because a lot of the bowl was just smoothie, needed some MORE to go in it to be considered hearty.


Thank you guys for your awesome customer service and great bowls. I will be back and on the look out for dole whip ;p"}
{"text":"I am active duty military and not a resident of Vegas but the customer service is paramount. Family owned business that is extremely friendly with awesome deals and some of the healthiest smoothie sandwiches and more!! The staff was very professional and knows a lot about what a healthy life style looks like."}
{"text":"Downtown eateries are very near & dear to my heart-- so with that being said, I expect a lot out of them. Replacing Grassroots with the same blue print sounds like a good idea, but you need to match their standards or raise the bar higher. 

I ordered the first smoothie from the menu the Power Up. Kale, spinach, banana, mango, and water. I'm trying to find a word to describe it and I'm actually shrugging my shoulders in the \"meh\" sense. It was just that. Not terrible, but it didn't leave a lasting impression either. I think of the great smoothies that I have had in the past, and notice that they have a handful or more of ingredients and usually have more texture to them. The smoothie was only $5 WITH tax, but I wouldn't mind paying $7-8 if the smoothie had oatmeal, flaxseed, cocoa nibs, dates, avocado, or something a little more substantial that might cost a little more to produce.  

I'll definitely be back again in a few months to try another smoothie, and see where they're at!"}
{"text":"It's been a while I wanted to try this place based on the good reviews, I took the fairytale smoothie bowl and I wasn't disappointed!! It's honestly BY FAR the best smoothie I ever had!! I didn't know I could love that much a smoothie, this guys are genius."}
{"text":"This place was dope. The owners are who served us. Great people with a great product. I think we had something called the blue bliss. It was fire. Go support this local gem."}
{"text":"Great customer service, first time going I got dole whip and decided to try a panini. It was okay nothing special. I honestly only went to get the dole whip but the person I was with got one of their bowls and said it was good!"}
{"text":"Great service and the price point on their bowls is amazing. Great way to recover after a weekend in Vegas"}
{"text":"Cute smoothie place with other food items available on the menu. I had the dark horse smoothie bowl and it was delicious and refreshing. Staff is very friendly."}
{"text":"OMG. Oasis toast was the best avocado toast I've ever had. And I've had my share of these Hipster, IG famous and worthy toasts. Blue spirulina mixed with their divine coconut cream cheese, fresh and generous portions of avocado, topped with cilantro and gold flakes make this toast truly original and delicious. It's $14 but comes with two large pieces which my sister and I shared. I could have honestly eaten the whole thing myself, but we also shared a fairy tale bowl, another IG worthy bowl that has the same blue spirulina mixed with non dairy milk and topped with blueberries, chia, dragonfruit and granola. There is ample outdoor seating in the back, as well as lounge chairs and a fire pit! Lots of vegan options and service incredibly friendly! Our cashier also worked at donut king around the corner and recommended a vegan donut there!"}
{"text":"Always great to find Vegan food. Great ingredients at a fair price. Green smoothie was great"}
{"text":"Great guy, really good food made from quality ingredients in front of you! Way cheaper than most bars of this kind."}
{"text":"One of my FAVORITE places!!!! Staff is always so friendly! C.D. Avocado Toast is my go to! Love the environment and the design of the place is perfect!"}
{"text":"I went to the establishment a few weeks ago on a Sunday to find them closed when the website and fb posted hours stated they were open. I messaged them on fb and they were very responsive. The owner reached out to me personally, apologized and told me to comeback and he would take care of me. I wish I brought someone with me because it was the best experience. Mostly all organic and delicious vegan options. I sampled the fairy tale bowl, avocado toast and dole whip. The owner even brought be a half dozen donuts. I'm glad I gave it a second chance. This is my new sweet treat healthy spot. Congrats to chad and his beautiful wife on their baby! Here's to a future full of health, wealth and many successes"}
{"text":"Yummmy! This place is amazing and the service is great!!!
You should try the fairy tail bowl! Love the color and the taste!
And their sandwiches are really good!!!"}
{"text":"I heard about the new smoothie spot in DTLV. I ordered the berry delight with no almond milk and it was amazing! $5 for a 25oz smoothie in downtown!! Heck yeah! The staff is super nice and I'll be back to try the panini sandwiches. They also are bringing Dole whip and I'm going to be the first in line"}
{"text":"I got the fairytale bowl. it was delicious AND beautiful (and so was the dude with the long hair who made it lol hmu)

would definitely be a regular if i lived in vegas. will come back for sure whenever i'm in town :)"}
{"text":"I'm so happy that Smooth Eats has opened downtown. Such a great addition to Downtown Las Vegas. Simple, clean, tasty and local friendly. I LOVE it. I got the ProGreen smoothie and it was so good. Exactly what I was hoping for. I will be back. :)"}
{"text":"Great Avocado toast without a bunch of fluff. Plus, the smoothie was SUPER healthy - not like a milkshake as you'd get at most places. 

They're also really nice :)"}
{"text":"I didn't even know it was possible to find a place like this nowadays. They make smoothies with only fresh ingredients, and concentrate on nutritional content combinations without losing delicious flavor. Turmeric and carrots in my smoothie? Flax seeds and greens? YES PLEASE!!! You know me too well... without actually knowing me. 

The guy that works here is very friendly and upbeat. His wife and him run the place, or so it sounded like. 

What first drew me here was the social media photos I saw of the exquisite avocado toasts (which are equally amazing). But I left really sad... that there isn't one near where I actually live. 

We might stay downtown next time we visit Vegas just so we can be closer to Smooth Eats and VegeNation."}
{"text":"This place is my new favorite. And even if the food wasn't done of the best things to eat in downtown Las Vegas, I'd still go here because of the owners.  The service is great but most importantly, they care about what they're presenting you with."}
{"text":"I routinely travel to Las Vegas for work and this is by far my favorite thing about being in Las Vegas. Smooth Eats is consistently amazing. You must try the fairy tale bowl!!!"}
{"text":"I have to admit that I am an eat with my eyes first kind of guy. I'm also a sucker for a panini. Smooth Eats is a juice bar, smoothie, shop, and quick bite type of spot down town. They don't have any seating but have areas to eat that they share with the neighboring businesses. It's more of a grab and go place.
I tried two of their paninis- one had a sun dried tomato pesto with turkey and the other had basil pesto with Italian meats. The sandwich was a good size and the flavors were great. They have very fresh ingredients. I also tried their piña colada and a couple of their juice shots which were amazing! The lemon cayenne one is nuts. 

The prices for everything were pretty average to high in my opinion. You get what you pay for and healthier foods are a bit more. Definitely doesn't break the bank and definitely worth the cost.

My last two cents for not giving them five stars was I felt the panini wasn't cooked long enough. The cheese was barely melting and the very center of the sandwiches were colder. Just a couple minutes more maybe? 

They care pineapple dole whip though and it's amazing.

The staff is super nice and helpful and I'd definitely recommend this place."}
{"text":"SO GOOD. Got some avo toast, you get a lot for what you pay for. And also a smoothie. SO PERFECT. And a Italian panini. I'm very happy with my order. The guy working was very nice. I would highly recommend this place."}
{"text":"So far so good.  New healthy smoothly/juice/power bowl shop with a few food items. Being from Cali, I'm happy to have more healthy options on the downtown lunch rotation.  I had the SD Cali toast and was very happy with flavors and portions. They also serve Dole whip!  FYI- just for take out, no seats."}
{"text":"Awesome cozy juice, smoothie and healthy eats place in the heart of DTLV. I got the ginger shot and carrot turmeric black pepper smoothie and it hit the spot. Big parking lot just behind the building which has a side street entrance. Lovely people running it as well - highly recommended."}
{"text":"While my friends are at Donuts Bar, I am here at Smooth Eats getting my smoothies and bowl on! Smooth Eats is my new favorite place to eat and drink. Not only are they beyond vegan friendly, everything is so fresh and flavorful! The staff is awesome-sauce! Their prices are reasonable with such fresh produces. 

I personally love the Fairytale bowl. It's filled with amazing goodness: Blue Majik Spirulina, Banana, Kiwi, White Grapes & Coconut Milk, topped with Chia Seeds, Granola, Blueberries & Dragon Fruit

I am also a big fan of the the Dark Horse bowl as well! It's filled with: Acai Sorbet, Mixed Berries, Strawberries, Banana, & Coconut Milk, topped with Sesame Seeds, Granola & Blackberries

I also love the DOLE WHIP! And the Smoothies! Everything is just AMAZING!"}
{"text":"This place is awesome!! Fresh food, delicious smoothies both at a very reasonable price! Plus the day that I went in, they had Dole Whip!! I LOVE Dole Whip! My experience was great and the food was yummy! They are an easy walk from work and a quick car trip from home! I will definitely go back and when friends come to visit from out of town I will share the fact that we can get a Dole Whip there too!"}
{"text":"Had what I needed after a long night of drinking in Vegas. I got the green smoothie and, the Italian panini. The owner accidentally dropped the smoothie, which really wasn't a big deal, because he replaced it immediately. And on top of that, he added a complimentary dole whip float because he felt guilty about the incident. I must say, I am a constant visitor of Disneyland, but the dole whip here is awesomely better than Disney's!"}
{"text":"P dope. Yum. Health. Would eat here again. Friendly staff and a healthy array of options to add to your meal."}
{"text":"These paninis are unreal. This very nice dude made me a custom amazing grilled cheese sandwich that is out of this world. I highly recommend this place. Amazing food, great service. Go eat here now."}
{"text":"Smooth Eats is my new favorite place to eat and drink. Not only are they beyond vegan friendly, everything is so fresh and flavorful! The staff is awesomesauce! I've had the SD, Cali toast each time because I'm addicted lol. The Flex smoothie is amazzzzing as well as their juices. They've got a friend in me  I love the fact that they're right downtown and they have sitting outside in the back where you can enjoy your food and read a book or gather with friends."}
{"text":"I tried this place on a whim right before work. I got the Italian sandwich and it's delicious - perfectly toasted bread, flavorful combo of cheese/prosciutto/pesto, made fresh. I saw another review mentioning it was an oily sandwich, but mine wasn't at all. I was able to eat it on the go very easily. I will definitely return to try the avocado/strawberry/balsamic toast and a smoothie!"}
{"text":"We stopped here because I was craving a smoothie and based on the yelp reviews I ended up trying the fairy tale bowl, which is truly amazing.  It has an indescribably delicious taste and the added bonus is the color.  We also had the Dole vegan pineapple soft serve, which was equally amazing.  A must try while in Vegas!"}
{"text":"I must say, I am quite a sucker for foods that are beautiful enough for social media, especially those that mirror the cheeky insider food videos you see on Facebook. With that being said, this place can definitely be classified as a one of a kind foodie Mecca, with vibrant, fancy, and healthy foods galore! I live relatively far from downtown, but I was in the area and was so excited to finally have an excuse to try it. Upon entering, I was immediately greeted by the staff and they gave me recommendations of what to try and even suggested that I check out IG if I was just going by what looked pretty (which was funny). The menu had a variety of options many of which were nutrient dense and vegan such as the smoothies, bowls, and mermaid/unicorn/rainbow toasts; indulgent options included things like paninis and grilled cheese. I decided on the $10 fairy tale bowl which was reminiscent of the typical acai/pitaya bowls that we know too well, however the star ingredient is a type of highly nutrient algae called blue magic. The owner made sure to make it look as \"instagrammable\" as possible, which I highly appreciated! Taste-wise, this tasted as delicious as it looked and to be honest I liked it better than some acai bowls I've had in the past. What was interesting about this place was that it was small...veeeery small, like, the size of a closet. I had no issue with this but perhaps there would be some people that would want to sit and enjoy their food with friends. I am looking very forward to going back to try the interesting, vegan, social media-worthy, gold flake adorned, mermaid toast!"}
{"text":"I've been here twice so far. The first time, I ordered the ProGreen smoothie & an açaí bowl. The cashier (which I later discovered is also the owner) responded to my order with, \"Are you sure you don't want the blue bowl?\" while pointing to a photo of it. I should have taken this to be a sign that their açaí would not be so great but I love açaí bowls and ALWAYS try them when they are on a menu. The green smoothie was good. It tasted just as expected. The açaí bowl came out watery and immersed with sesame seeds. I find it a bit odd to have sesame seeds in an açaí bowl but was willing to try it...ehh, it's definitely not appealing to my taste buds. 

The second time, my boyfriend and I were in the area, and I decided to give their IG popular items a try. I ordered their fairy tale bowl and the mermaid toast. The toast just tasted like toast with vegan cream cheese on it. It wasn't something I would order again; however, their fairy tail bowl did live up to expectations! This bowl's presentation is very BLUEtiful. The blue green algae taste is well hidden by the blended fruits. I tasted prominently green grapes...not sure exactly what the blend was. My boyfriend ordered a soup and sandwich, and he thoroughly enjoyed both. 

I will be back to try more!"}
{"text":"The fairy bowl was delicious and beautiful. I loved this place I'm definitely returning. The Kicker toast was also amazing."}
{"text":"Just came back from Smooth Eats and enjoyed a delicious green smoothie. Chad and Lindsay were awesome, explaining their ingredients and philosophy during my first time here. 
Smooth Eats is a fantastic spot to enjoy healthy, high quality options. I'm looking forward to trying the Dole Whip when I go back.

Being a frequent Vegas visitor, Grass Roots was one of my favorite stops to balance out the indulgences here and I'm stoked to be able to replace it with Smooth Eats in my rotation when I'm in town."}
{"text":"Overall: great smoothie bowls, Instagram worthy, cute shop

If you're looking for a light breakfast off the strip, this is a great place to go. They have a small menu but its just enough and everything we tried was excellent. We had both of the acai bowls, one with an acai base, and one with a blue colored base with blue majik spirulina. These are Instagram-worthy bowls. They put a lot of time into making them look nice and it pays off! They also taste great They are a little light on the granola compared to other acai bowls I've tried but that didn't bother me. The flavors were light and fresh. They have a cute outdoor sitting area which is perfect in the morning before it gets too hot. But beware- the smoothie bowls melt fast! We also got one of the avocado toasts which was a generous portion and also Instagram-worthy. This was an excellent breakfast and worth a little drive."}
{"text":"We were drawn in by their Dole Whip sign but ended up getting the Fairy Tale Bowl and Green Goddess drink. It's so... blue! And very tasty. We were told about the Blue Majik and its healthy goodness. A nice surprising spot for an alternative healthy lunch."}
{"text":"The Fairy Tale bowl is the BEST bowl I've ever had. I'm too lazy to write yelp reviews, but this place is worth it. It's freaking awesome."}
{"text":"Probably one of the healthiest option in Las Vegas. Literally 1 block away from \"The heart attack grill\", in this no man's land of carbs and lipids comes this very cute heaven of fresh and tasty food. I got the green goddess smoothie (yes, I know;) packed with spinach, kale, banana, mango, pineapple and a blend of power food like spirulina. I asked extra chia seeds and they just added it free of charge. Additionally I asked blueberries and avocado on the side that they sparkled with chia seeds. On top of serving tasty and good food, these guys were very happy to make something that wasn't on the menu. Affordable, good, healthy and strongly recommended!
Genuinely a nice place with nice people with nice food. Came out with a smile and a happy tummy."}
{"text":"Stopped in real quick for some DOLE WHIP! It was delicious, even for $6.

This particular place is a very small storefront with a menu to match. A couple bowls, and toasts, shakes/smoothies and dole whip."}
{"text":"Beautiful toast. Great healthy options. The owner is a really cool guy who obviously loves what he does"}
{"text":"Wonderful breakfast/brunch joint in Downtown Las Vegas. Great service and fresh, delicious food for  great price. I would definitely recommend the Fairy Tale Bowl - so unique, pretty, and delicious."}
{"text":"My partner's attention was caught one day when we were passing by the Donut Bar (or maybe it was a new business ad on Yelp... who can remember?). Point being, this kind of place is right up our alley, since he is a vegetarian and I'm not, and this place has something for both of us. Admittedly, I'm not such a health food nut as he is, but I love me some smoothies. 

We were originally attracted to their claim on Dole Whip, but their machine hadn't been delivered yet, so we were mildly disappointed. Af first. Their menu is still evolving, and they have a few \"off menu\" smoothie bowls that caught our attention. 

I had the acai bowl, topped with chia seeds, granola, and blackberries. It was delicious, and the bowl was a decent size. It could have used some more blackberries, simply because they are one of my all time favorite berries!

The owners, I presume, were very, very courteous and helpful. We enjoyed their service immensely. They even offered to try to fake he Dole Whip, without the soft serve machine, but we declined so they didn't have to go through extra effort for something they don't even serve yet. The gesture was appreciated, though. 

I can't wait to see what else is in store for this up and coming business. 

SUPPORT LOCAL BUSINESSES!"}
{"text":"Delicious & healthy smoothies, just what we needed after a wild Vegas night. The owners are the cutest & sweetest couple that took the time to explain everything in our smoothies & the health benefits."}
{"text":"F*cking great!! 
Great smoothies and the DOLE WHIP  
Thank you for the great experience, the atmosphere was welcoming 
Can't wait to come back"}
{"text":"This place is amazing !!! Chad makes the most awesome smoothies & is always pleasant & enthusiastic. My boyfriend & I are here at least twice a week & we are always pleased with the excellent  service & recommendations"}
{"text":"Ughhhhh! This place is so gooood! The dole whip is delicious and the grilled cheese sandwich is so perfect especially in sourdough bread (I love cheese)! I wish I could have had more time to try more things at this neat little brunch place but alas, they close early and I couldn't come back before the end of my trip as I was in Vegas just visiting. I would love to come back and try more from smooth eats! Try this place NOW!"}
{"text":"No hours posted, they are open when they feel like it. Went for dole whip early and they said it would be about an hour and a half wait. Haven't been able to try it as they always seem to be closed. Surrounding businesses are busy on Sunday morning yet, they wish to keep closed. Don't want my business, no problem!"}
{"text":"Had SD Cali toast. Delicious! The sundried tomato spread is great. Very generous with avocado. Only problem I had is there is no coffee. But can be overlooked. Definitely will be back."}
{"text":"Very friendly and prompt service. Staff is knowledgable of health benefits of ingredients. Green smoothie with added tumeric and black pepper was refreshing, like a palate cleanser. I had the S.D. avocado toast. I feared it might be dry, but it was delicious with the spicy, perfectly salty pepper spread and generous avocado and cilantro."}
{"text":"I've been here a few times & id say it's definitely a hidden gem of Las Vegas. Hands down, awesome owner & awesome foods! I've had both smoothie bowls, panini and the spicy toast with avocado!"}
{"text":"Amazing ! Thanks here now ! 
Great service very knowledgeable about drinks pro green is my personal favorite"}
{"text":"Loved this place! So cute inside. Owner was so nice and the food and smoothie was delicious! I'm local so I'll be back soon!"}
{"text":"Smooth Eats offers the best smoothies and toast combos downtown. The smoothie prices are amazing, and the Kicker toast is to die for. Don't leave Las Vegas without stopping at Smooth Eats!!!"}
