{"text":"A hidden treasure!  We try to make it to this place once a week, a great place for a quick lunch or a nice dinner, often times dinner comes with live jazz.  You will not run out of wine or liquor choices here.  Must try's include: Crab Wontons  (Best in town!!!!) Most of their dishes are great and can be had with rice or noodles."}
{"text":"Excellent food. Got crab puffs (tasted like east coast style), spider roll, and drunken shrimp. Was more than enough for my husband and I. We didn't get any beer but they had an excellent craft selection. Fair price and great food with good service."}
{"text":"The food is great but every time we come the service sucks. They forget to refill are drinks, the cooks forget to cook all are sushi and we have to get up out of are seats to get are waiter and ask for the rest of are food. Longest we have waited is 45min to get are bill. Like I said great tasting food not so good service and attention. Good thing out of it was after we had to get out of are chairs to get are food they took the two sushi plate off the bill."}
{"text":"Personally discovered this place a couple months ago and I am trying to eat here as often as possible before I move this summer. I have tried 5-6 different bowls and have licked every one clean. Fresh ingredients, all together delicious. My favorite so far: Drunken Noodle.  Kind of weird entry behind the Party City, but very cool vibe inside and amazing food. Try it. Thank me later."}
{"text":"I love this little place!  The food is GREAT, and they have a nice Happy Hour too! They have 3 high tables right outide their front door.   They have live music certain nights of the week.  Young attractrive waitresses, friendly. Great atmosphere, I feel like I am in San Francisco when I eat here? The people that come here are a different crowd than Ra.  I think they come here for the great food/atmosphere I feel, rather than the types of people that go to Ra for their Happy Hour if you know what I mean.  Every roll I've tried is good, and there is some type of noodle/tofu/mushroom/broccoli dish that I REALLY like.  As with any place, it depends who is cooking it, it may come out a bit different every time, but all times have been good!  This place has a nice Happy Hour also, but I'm willing to pay full price for the food here.  No blasting loud music like at other sushi places around.  This is a great place to take a date. Way more of a local place rather than a chain.  I've been coming here for awhile, and it looks like the word has gotten around.  There was never too many people here, and I couldn't believe it.  I was just there this past weekend for dinner at around 7pm, and it was packed!  I like to see this place like that and do well.  I just only wish they were open later!  They close at 9pm on weeknights."}
{"text":"This is my second time here. If I came back it must be good. For a small hidden place the service is friendly and everyone is willing to speak and chit-chat. Kristin is a great server too. Sushi chef does a great job with a variety of rolls and the wok chef knows how to throw them noodles. Overall great experience and would recommend to all."}
{"text":"We use to come a lot. Haven't been back in a while but will when we are around and in the mood. It's good sushi with a pretty cool owner."}
{"text":"This place is not the most fantastic place I've ever been but it was good. The service and the food were nice, again not excellent but good. I do have to say though that the crab puffs were great. I would definitely recommend trying it out. I am going to have to try Happy Hour since it keeps getting such great reviews then perhaps I'll give it a full five stars."}
{"text":"been there over a 100 times never had bad food or service. Great place for lunch."}
{"text":"Love, love, love Asia! We haven't gotten a bad dish yet, the Orange Zesty Chicken is awesome! Everything is super fresh and comes out almost too quickly. Staff is nice & actually remembered us, which was a first for us. Looks like we've found our place!"}
{"text":"First off I wanna say I have been waiting to come here for awhile I always pass it but never have the to stop or never hungry. So i when last week and I was happy I did. Very good food, One of the better Asian Fusion places I been to. Good flavor and good size meals. The services was good also. I will go back again for sure"}
{"text":"Been driving past this place for a while & decided to give them a try. Really good food and lots of choices of types of Asian food. Our server was very nice, helpful with directing me when I asked questions. The story of how the owner got started with his restaurant in Australia is quite interesting, as well. I came here for lunch and the prices were in li e with what I will pay for lunch ($7- $9) with good portion sizes. I will be back soon."}
{"text":"It's location hurts its business but this place is the real deal. The owner John is the main chef and you can tell he loves his craft. My wife loves their sushi and I strongly recommend their stirfried rice! If you are in the area and want to have a good variety of Asian food and quality service, check these guys out!"}
{"text":"Great food, but to be honest the service is less than desireable. We sat for almost an hour with no water in our cups and no food.....our sushi rolls were forgotten about! After this experience, I just don't know if I can return."}
{"text":"Went for the first time Friday night with my daughter and was very please despite mixed reviews. Yes, it is small and cramped. Yes, they need more servers but the 2 they had were great. The food makes up for all that. It is the BEST Asian food I have had since moving to Arizona 14 yrs ago. I cannot wait to go back!"}
{"text":"We've  been coming to this place for a while now and we love their happy hour menu. Their entrees are pretty awesome as well. The service is fast and they are very nice."}
{"text":"Great menu with lots of variety in choices. The food was hot and very good. Tables and sitting area were crowded together, but not bad for such a small locality."}
{"text":"simply the best calamari I've ever had (probably because they also serve sushi).  We've been here numerous times and the food is always superb!"}
{"text":"We went to Asia today for the very first time.  Wouldn't have tried it if it weren't for our Groupon.  Tried it.  Loved it.  Will definitely go back.    Appetizer + 2 entrees + dessert = $27.08 with tax. (we drank water) Add in tip, and it was a great meal for a great price.   They were able to substitute tofu for any meat on the menu, and were able to hold one of the four veggies in my dish, no hassle, no problem, and they got it right the first time.  My Tofu Satay and egg noodles was yum.  Hubbie's dish was great.  Crab puffs were amazing.  Macadamia Rum Cake was delish.    Service was awesome.  Our server did a great job, even when the joint was packed.  She mentioned that Friday evenings they have live music, and I'd be amenable to going back and checking that out.    Things I'd change:  table size... it was a tiny little table for two, not enough room to do business on... so not a great place for a business lunch/dinner.  I'd also not sit by the front door again.  Every time someone came in or left, the heat blasted in and tried to roast me.  Other than those two things though, our dining experience was wonderful.  We will go back and I would recommend it to my friends."}
{"text":"I have only eaten here a few times but the sushi was good every time. I like the unique rolls from here and they come out quickly. They are a little bit on the pricey side, but the food is always great and the rolls are large. I would recommend this sushi spot."}
{"text":"Really like the food but won't go back due to customer service. Went there today arrived 15 min before they opened. Didn't realize they opened late today. Decided to wait to eat there. Actually waited about ten extra min before going in so we didn't walk in right at 3. Staff looked at us like we were crazy and then said the wouldn't open for another 15 min. Wouldn't even seat us and let us wait with drinks until they were ready, we weren't in a rush but just didn't want to drive elsewhere. Which we ended up doing anyways out of principal. If your not going to open until 330 don't put 3 pm on your door. Will not go back, don't care how good food is. Lucky for us. Sushi is everywhere here."}
{"text":"We went back here before a concert at the Mesa Amphitheater for a quick dinner and drinks.  Freaking awesome margaritas.  Our waitress made them, so maybe it depends on who's serving you, but she was spot on.  Fresh lime juice and tequila.  None of that mix crap.  Food was stellar once again."}
{"text":"The food was okay.  The metal shard that I found in my takeout noodles ruined any good benefits though.  Especially since I emailed them to let them know, and didn't hear anything back."}
{"text":"This place is casual and good. The best seat in the house is at the bar where you can watch all of the food being prepared. It has a neighborhood feel and has a lot of regulars. The Drunken Chicken and Shrimp is my absolute fave (be specific about how spicy you want it). The Shrimp won ton soup is great also. Everything is made in house even the crab puffs, which are yummy."}
{"text":"We end up at this place when one friend in particular comes through town. He's a big fan and we don't mind it. Usually generous cocktails, the sushi is great, but all the noodle dishes end up tasting the same in my opinion. Not bad, necessarily, but not spectacular. The Vegas Roll will keep me coming back."}
{"text":"A really quaint, multi cultural asian food experience. The drunken chicken and shrimp are awesome. Convenient location right on Baseline and Stapley. The staff is very friendly, entire premise is clean. Can't ask for more than that."}
{"text":"I can't say enough about the food, drink and atmosphere.  I've been coming here for a few years and it's always VERY VERY good.  It's been my pleasure to convert quite a few friends into believers.    Oh yeah... the vibe!  it's sweet!"}
{"text":"Disclaimer: this is a bar that serves a full menu.  It's very cozy and a bit tight so be warned.  They seem to attract a huge crowd because of the live music and weekly specials.  Definitely a place for locals and live band lovers.  I would suggest this for friends or couples looking for good food and entertainment on a budget, but probably not for families."}
{"text":"This was our first time here and we came at the recommendation of Jenni L.  We really enjoyed our meal here this evening.  Our party was 6 and we easily found seating and were quickly served.  The ambiance is nice - dark place, modern decor and styling.  The menu is very simple but offers quite an eclectic 'asian' selection of food.  I chose the curry noodles with chicken and was impressed with the flavor as well as the juicy texture of the white chicken meat (hell, I can't even get my chicken breast that juicy at home!).  Noodles were cooked well.. not soggy and not too hard - but perfectly cooked with a bit of a bite to them.  Our server was prompt and friendly and we enjoyed our evening here.  The food was highly filling (their bowls are friggin huge!) and I seriously didn't expect to be able to eat all that they served me (but I did!).  I would come back again if I were in the neighborhood."}
{"text":"Everything that my husband and I tried today was amazing. I am glad I got to try something different of what I normally would because i was really pleasantly surprised. We also order one sushi roll because we had to try at least one and we loved it! Definitely will be coming back to try more things. Place is really small, and there was only one server, but we came when it was really slow and the service was pretty fast. All in all very happy we got to try this place out."}
{"text":"I was out this way recently and was pleasantly surprised to find that this place is still in business and going strong... especially since I hadn't been there in 10 years and many restaurants do not make it.  They serve a wide variety of Asian foods, from all different countries, and while I'd always thought it was good, I was pleasantly surprised that my co-worker, who is Chinese and knows her Asian foods much better than I do, also thought it was good and even wanted to go back another day when we were working out that way.  If I still lived or worked in this part of the Valley I would come here more often, so if you do, take advantage of it!"}
{"text":"Lived in Singapore for two years and traveled to all around Asia..... Would not recommend.  The dishes we ordered all looked alike and curry was a noodle dish with green in it.... No curry taste at all.  Would not recommend."}
{"text":"Great wok'd meals as well as great sushi! Drink specials and happy hour sushi! Try the drunken shrimp and chicken! The seafood curry is incredible too!"}
{"text":"Bomb , everything is good and it's a great place to come have a drink for date night or lunch:)... Food is great give it a go"}
{"text":"So the food was delicious. We had a great meal. My son had the Mongolian beef. I had the fire something beef. Anyway both were delicious. But. We came in and seated ourselves. This is a very small place. Like it could have one server it's that small. There are two on tonight but neither of them decided to get us menus when we sat down. So I went and got them. That was after sitting there for about 5 minutes. After retrieving the menus it was another 10 minutes before the server came up to us. When she finally did she wasn't very knowledgeable about the menu. That's okay we both chose great dishes. Anyway we never got refills on soda the waitress at one point took my sons glass to refill it and never came back. We never got napkins. I asked for them mind you but never got them so after 10 minutes I went to the bar. She forgot. Of course. She never brought water after I requested. Again another 10 minutes. She actually left the restaurant area. I can't express how tiny this place is. Eventually I got tired and asked the cooks behind the bar for water and refills. Something I would never do but we were thirsty from the food. All in all I'll order out here before I'll ever eat in again. The food was great minus the edamame. It was meh."}
{"text":"Amazing food! Friendly staff and such a welcoming and comfortable atmosphere! Definitely recommended to everyone! Cant wait to eat here again!!!"}
{"text":"Tucked away in the restaurant heavy area in Mesa lies Simply Noodles. I have been here more times than I can remember in the last 6 or so years.   They have a number of Asian noodle and rice bowls from various countries. I've never had a dish that I didn't find enjoyable. The Hong Kong flat rice noodles are my favorite. The sushi on the other hand isn't as great. It isn't horrible but definitely isn't up to snuff compared to a conventional sushi bar. If you're try to decide between just or noodles or sushi, choose the noodles. The crab puffs are amazing. They are served with a plum sauced which is to die for.   The service seems to be pretty hit or miss. Usually the service isn't bad but sometimes you get the occasional server that takes an extremely long time to come around.   The jazz on the weekends is a nice touch. Sometimes a bit loud but usually not the case. All in all, I would heartily recommend SN."}
{"text":"I really enjoy this spot. Everything is fresh and made to order. I get the chicken fried rice and add vegetables nearly every time. I have been known to eat the same thing week after week. This place is gotta good vibe to it as well. Enjoy!"}
{"text":"Amazing place tucked away behind party city. Amazing food, great service. They serve sushi as well as Pan Asian cuisine. I tried the Singapore Noodle Curry today and was not disappointed! I will definitely go back here!"}
{"text":"Been here over a dozen times. Tried most of the menu. Everything is excellent. Can't go wrong here.  Service a little slow sometimes, but the food is always great."}
{"text":"This is an update.  The place used to be better when the father and son worked all the time.  I imagine that is hard to keep up that level of hardwork so I understand it.  Unfortunately, the last two times we went, the  food seems to be getting worse.  Its still pretty good but not overly special lately."}
{"text":"Not a bad little joint. I love to be stuffed into a tight corner next to the regular 10 bar fly's that get crunk off saki for at least 3 hours every single day. Your seats are about 3 feet below the bar patrons seats so you'll get a good eye full of butt crack the entire time. Felt like the waitress had a killer game of dungeons and dragons she desperately needed to get back to while i asked her what was crackin on the menu. Besides that, it was good food. Big portions which is good (Unless you're a \"real\" human that loves getting 2 slices of lettuce and pinch of meat on a plate). Check it out and sit as far away from the bar as possible."}
{"text":"First time here but I really can't say it's the last time. I ordered the Singapore Noodles with Chicken....it was too salty and I think the curry threw it off...I think I just ordered wrong. I also ordered a coke that just tasted....weird. Service was slow but nice."}
{"text":"This review could have had a higher rating but heres what happened.  So I yelp a nearby place for lunch and this comes up but as noodles something or other which has 5 starts with 2 reviews.  I cant find it...do I call and its pan Asia...so I ask oh did you change the name? The girl says no I dont think so...any ways we decide to eat here and go in. The place was pretty empty, just another couple at the bar.    The waitress quickly comes over and gives us menus and drinks. So right on the top of the menu it says ...formally simply noodles?  I realize  that our waitress is the one who answered tbe phone. I asked about the special that was on the chalkboard and she turns to the other patron at the bar and asked him to explain it to me? It was some chicken over cucumber salad..so she adds..well I have only sold one of those so I don't know if its very good. Really?   So I ask about some other dishes and end up ordering a shrimp and chicken curry noodle ..my husband orders a beef noodle dish ... both were delicious!                                           Neither dish was exactly as yge waitress discribed them. But honestly really good food. I love that I could've sat at the bar and watched the food being prepared.               What I dont love is families sitting at the bar with 4 teanagers.  So the bar area is cool for watching the chef...but it is a full bar. I mean 3 girls came in and sat at the bar telling the waitress that they have a party of 5. About 5 minutes later the parents come in with another young girl...but what if there were no parents? Either way. ..not cool.  So 5 stars for the delicious food and the chef who knows the menu:)   3 stars for the quick waitress that literaly knows nothing about the menu or the restaurant itself.  0 stars for allowing minors at the bar."}
{"text":"The rolls the best, I suggest monkey plays wit fire or the lazy dragon."}
{"text":"I've been coming here since it first opened and I can honestly say that the fried rice is to die for!  I've probably tried everything on the menu by now and I have not been disappointed.  Granted, there are some things I didn't like but that's because I'm a little picky.  I like the ambiance and the overall atmosphere, it's a small quaint place that is enjoyable. Like some have already mentioned, the service isn't exactly stellar or top notch but I think that's par for the course in this type of business depending on which waitress you get.  It's happened to me a few times already but I'm not afraid to bring it to their attention."}
{"text":"Couldn't accommodate our small party because it's a small place. Last I recall about this place the food was good but service slow. Don't come here during peak time."}
{"text":"Really small place with really good live jazz music, food & drinks. The food prices are low but drinks are a little high.  Make sure to check out their facebook page to find out when they have live music:  http://www.facebook.com/AsiaInMesa  Overall, this is my favorite place to go when I want a mellow night out with my hubby.  Looks like this restaurant is FKA \"SN Pacific Rim Asian Kitchen\" and has a separate yelp account at:  http://www.yelp.com/biz/sn-pacific-rim-asian-kitchen-mesa-2"}
{"text":"We stopped in for lunch today based on a friend's recommendation. Wow! We were not disappointed with anything we had. Ak does a good job of categorizing their lunch meals by region (Japan, Malaysia,  Vietnam,  etc.) My fiance and I explored Vietnam and Japan. The Udon noodles were so flavorful and the crunchy thin chicken was a perfect blend of spice and texture.   Even Though we didnt drink this time,  the bar selection was comprehensive as well. It's not a very big spot but very comfortable. The bar area takes up a lot of the room but the sushi chefs are fun so you will enjoy the company."}
{"text":"I'm a big fan of the food and drink offered here.  Lots of noodle and stir fry places put a lot of green/red peppers and bamboo shoots in the mix so they can skimp on the good stuff (meat and other veggies).  This place has a good balance of ingredients in all of the dishes I have tried.  My boyfriend commented that he really likes the noodles, he was sad to finish them off before he had eaten all the chicken in his curry.   The bar has a lot to offer but the prices are a little steep considering the happy hour specials other places in the area offer.  The food on the other hand is very reasonably priced with large portions."}
{"text":"Oh the Asian Kitchen is amazing. The menu is divided into different Asian Countries but the best thing on the menu has got to be the Ancient House Special Fried Rice. It is just divine- not greasy or heavy at all. They wok fry the rice with egg, shrimp, and chicken. If it's your first time coming here I implore you to try this and you'll be coming back for more like the Drunken Shrimp and Chicken which has a great spicy peanut sauce.   The killer entrees come in huge portions, I normally have to take half of it home and enjoy later.  They also have a good sushi menu and a great sushi chef who is personable and pretty darn fast. My favorite sushi on the menu is the \"It's Always Sunny in AZ\" and the \"Big Buddha Roll\". The service is always great, the happy hour rocks, and they have live music on Friday nights. I can't believe this little gem is located in Mesa, but it's definitely worth the drive."}
{"text":"John and his crew are awesome! I have never had a bad experience, although at times lunch can be packed and service a tad slow, relax... The food and drinks are worth it. When you have food made to order and have it be how you want it, sometimes it can't be rushed. I can say, in my numerous times at AK, I have never been let down.keep it rockin John!"}
{"text":"Asian Kitchen is a nice little place that serves pcific rim cuisine...the decor is nice and small.   I had the drunken chicken & shrimp...it was delicious and full of flavor.  As far as asian food goes this is a hidden gem and far supirior to mom & pop places and they typical chinese buffet.  One star less since I wish they had a larger menu selection."}
{"text":"I am incredibly surprised this place has a 4 star rating. I recently moved to the area and drive by here quite a bit so after checking yelp decided to give it a try on a random week night. It was pretty dead and the waitress was nice enough but completely forgot our appetizer, which we had to ask to have removed from our bill (we figured we wouldn't bother with it since we had already been served our entrees). I got the Singapore noodles with chicken and was incredibly disappointed. It was disgustingly salty, even after drenching it in Siracha I still couldn't eat it. My fiance got the Teppanyaki beef and yakisoba which was not in fact yakisoba (yea, I know the difference). Not every Asian noodle is the same people! He could at least stomach his meal. I ended up grabbing something at Fry's on our way home so I wouldn't go hungry for the evening."}
{"text":"Horrible food, service, dirty tables and although I have eaten here before and found it decent this time it was less than eatable! We barely touched our food ,famous fried rice is a joke according to my Asian wife!"}
{"text":"Not a good start, little black ants on table but figured maybe it was the rain. Waitress was super friendly and accommodating, we moved tables twice because of ants. The waitress brought us spring rolls on the house. We ordered lantern noodles with chicken and shrimp. Enough to share for 2 people. Bottle of merlot $24. Relaxing environment. Food was ok, selection of wine on black board. Restaurant open till late."}
{"text":"This place was ok. I went with Sharon H. And we split 3 rolls and only one I really liked the others were just ok. The viva Vegas roll is awesome and I am not usually a fan of Vegas rolls. The seaweed salad was average but lacked flavor. We got one roll that had eel inside with I think cream cheese and crab with eel sauce outside and it wasn't that good as it just wasn't a good combo. The other was something again with cream cheese inside with some other stuff and salmon and avocado on top. This roll was the 2nd best but still lacked flavor and I didn't like that the cream cheese over powered the fish.  All there fish was fresh but seemed to lack flavor. The cost was also pretty high for 3 rolls and a salad at $40 before tip and we didn't have drinks.   I might be willing to come back as the food wasn't bad and the Vegas was awesome but I may look elsewhere first"}
{"text":"Fantastic food and service.  Owner John is more than accommodating when you have any special requests on menu items.  Also a fantastic vegetarian place to eat!!!"}
{"text":"Great find this place is very cool. Small but love the atmosphere, staff, food selection, wine selection. If your looking for a casual time out sit at the bar and watch the chef's Chef it up!!!"}
{"text":"Nestled in a sea of mundane suburban chains lies a true oriental gem.  The menu is laden with tasty dishes from up and down the Pacific Rim. Easily merits inclusion into the workday lunch rotation."}
{"text":"Atmosphere: 10 there was a live band playing and the music was phenomenal Food was excellent !! Must try the Viva Vegas Roll"}
{"text":"Mmmm. This is my favorite Asian cuisine! It is a small, independently owned business with a WONDERFUL menu, fairly priced, and friendly staff. They have the customer in mind :) I could eat here everyday. Good for happy hour drinks and appetizers"}
{"text":"A must try, once you do this place will be a 2-3x a week place for you...not to mention John the owner always has an out of the box delicious special..."}
{"text":"Family and I have been here several times before and everything is great. The service was extremely polite and knowledgeable. Food was outstanding and the price very reasonable.   The restaurant was almost packed but the noise level was low enough to keep a conversation going."}
{"text":"Worst service. I went when I was pregnant and unable to eat raw fish. The server didn't even know what she was bringing out. I asked her if she could ask someone and she just walked away. The manager was aware of the situation and didn't even care. I had to pay for a meal I didn't even eat, although I was extremely hungry. I will never eat here again."}
{"text":"Great food The menu offers Japanese, Chinese, Singapore , Malaysia and Vietnam   We sampled the fried rice, udon noodles, egg rolls and the drunken fish and chicken. Service was prompt and our waitress new everything about the dishes on the menu   Everything wAs great  They also accept the passport card"}
{"text":"Every time I have gone here the service is lovely.  Cool vibe, too.  Unfortunately, after multiple attempts neither I or my husband have found a meal that we really like.  I really want to love this place too!"}
{"text":"Okay, I was just trying to talk my friend into yelping and he mentioned wanting to yelp Pac Rim, I was like OMG! I totally forgot to Yelp it!  EEEEEEEEK!  So I took my mom and son here like, I don't know, a few weeks ago.  It was Friday night, and we arrived at about 6:30 after going around the intersection like 2 times LOL... its kinda easy to miss.  Or I'm just blind.  Ne way... It was PACKED!  We found a tiny table right by the door and I froze everytime someone came in or out, but then another table opened up and we switched seats.  I shared with Dom.  Mom and I both ordered fish dishes and they were both OUTSTANDING.  Very fresh, flavorful, and lots of yummy veggies and rice.  We also had a margarita, they were fine.  But I'm really picky about my drinks and hardly anyone makes a good margarita.  So, yeah, I will be going back ASAP.    The decor is cute, the ambiance is really swanky, and apparently they have live music too.  I would love to come sit at the bar - have some drinks, and the calamari which I hear is really good, and take in some cool music.    Our waiter was really nice and service was quick.  They cook everything right in the middle of the bar area.    One thing, its REALLY small, but I think it adds to the charm.  GO HERE PEOPLE!"}
{"text":"My wife and I were craving some asian noodles and stumbled upon this place.  Some might be wary to try this place because it shares a building with Party City (essentially behind the store), but some of the best restaurants I've been to can be found in least than ideal locations.  When we entered, we were welcomed immediately and pleasantly surprised by the overall vibe.  The bar was packed and overlooks the open kitchen where flames were shooting above the woks.  I was keen on the reggae/island/jam band background music as well (Passafire, Dirty Heads, Slightly Stoopid to name a few of the bands).  Once seated, we noticed the beer and wine options written on the walls and were  very impressed with the large selection.  Service was speedy.  We quickly got our drinks and ordered the spring rolls as an appetizer.  They were very flavorful.  My wife and I both noticed a cinnamon taste at the end of each bite (possibly Chinese five spice).  For the perfect spring roll bite, I recommend dipping it in the plum sauce along with a bit of Sriracha.  For our entrees, we were looking for spicy dishes and went with the Hokkien Mee and Lantern Flame.  Both were very tasty and hit the spot.  When it comes to the level of spiciness, I would say it was on the mild side for my liking (still delicious).  However, my wife and I are heat fanatics, so me stating it was mild would probably mean that the dishes had adequate spicy flavor for the general public.  The portions are hearty, so there was plenty for leftovers.  You certainly get your money's worth and then some.  We will definitely be back!"}
{"text":"Great food... Fresh... Yummy.. Original.  Absolutely the worst service in the history of the known universe (ok,  maybe thats a slight exaggeration... But only slightly)"}
{"text":"I am incredibly excited to have discovered this place. I've spent years searching the valley for what I considered to be \"coastal state grade\" sushi, and I believe I've found it. The quality of the fish  that is served in the sushi is incredible. It actually has some structural integrity!! For those of you who eat sushi, you know what I mean. This stuff isn't slimy at all. It is extremely fresh! They also have some pretty incredible beers available. I was stoked to find some awesome IPA's, and to find out that they frequently bring in new ones. Fellow hop-heads will sympathize with me on this. I highly recommend this place if you enjoy a nice, strong IPA and some quality sushi!"}
{"text":"I love the dishes here, everything I have ever tried has been excellent.  I used to live up the street and I would go often, now I only get to go every 6 months or so and it is always great.  Service is good too."}
{"text":"This place was alright.  It is very difficult to find!  It is basically connecting to Party City, but there is no signage that you can easily see unless if you are standing right in front of it.    I found the place itself to be clean-ish.  I'm in the food industry, so I'm picky and with the poor reviews on here, I was looking for evidence of anything unhygienic.  We were given the option to sit anywhere, and the first table we were going to sit at was very dirty, with food bits all over it.  The second table we looked at was exactly the same.  We stayed for about 40 minutes and no one made any effort to clean the tables while we were there.  There was one other table, only seating 2 people.  There were a few people at the bar, but otherwise, I'm not sure what the waitress was busy doing.  Aside from that, the dishes, the table we finally ended up sitting at and the tableware seemed clean.  I did not see any ants.  The food was good, but nothing amazing.  I prefer the bowls at Tokyo Joes, but they were still pretty good. Really large portions!  The atmosphere was nice.  It is a small restaurant, and it was very empty when I went.  There are a couple TVs, but the restaurant was not loud.  If it gets busy in there, I imagine it gets loud quickly. I ordered the seafood curry bowl.  Their shrimps in the bowl were great!  They did not taste fake.     The waitress was nice, but I don't know what she was doing because she didn't take our drink order and there weren't other tables.   She made some good recommendations from the menu and seemed to know the food pretty well.  I liked that they could tell me that the seafood curry bowl did not contain any chicken or chicken broth, since I only eat seafood, and not fowl.  It looked like they had a huge selection of booze and a good selection of beers and wine."}
{"text":"Nestled away in a hard to notice spot in the Mesa Grand behind Party City is this little joint.  Not too packed, not too loud.    The menu, while not expansive, has a few tempting listings from different locations throughout Asia. Asian fusion and sushi.  Let me just say this to you die-hards: WHITE PEOPLE ASIAN. You get my drift?  Also, not dim sum as listed on Yelp.  We ordered, and food came quickly. A seaweed salad, inari, Viva Vegas Baby! roll and a lemongrass vermicelli (bun to those loyal connoisseurs of Vietnamese fare.) The selections were tasty.  My only criticism, thus removing a star, was for service. A few \"hey bro\" regulars at the bar kept the attention of the staff. We were waiting on drinks several times and then when we gave the check, Danielle didn't come back for.ever.  She made drinks for some people, chatted, seated a few parties, chatted... This is kind of a drag when you are in a hurry on lunch hour.  It wouldn't have felt so long if maybe I had some beverage in my glass....(sigh)  This place has the beginnings of something great. I enjoyed it overall and would come back."}
{"text":"In short, slow service, average food and a poor attitude by the wait staff add up to a disappointing meal.  [BTY - Yelp maps this place 6+ miles from where it actually is located.]"}
{"text":"Cool little neighborhood hole in the wall. Seems pretty busy during happy hour 3-6  The garlic shrimp were very good  and made fresh. Lettuce cups were good. I tried happy hour sushi for the first time and ...well......so so. The rice was less than fresh and sort of hard on my spicy tuna roll but the crab roll was a bit better. Fresh moist rice is key and in az........rice gets hard in minutes. I'll go back a few times for happy hour and report back..... This place reminds me of those little secret places in tempe. The interior needs to be freshened up a bit."}
{"text":"The place looks a little thrown together, I was immediately confused by the atmosphere.    I ordered miso soup, eel nigiri, the lazy dragon roll, and the ancient fried rice. My husband and I shared, and thank goodness we did. The portions are HUGE.   Miso was fabulous. It didn't taste like miso paste in hot water. Very, very good.    Eel nigiri was charred and didn't have as much unagi sauce as I'd like. I did not enjoy it. My husband loved it, though.   The ancient fried rice is HUGE and TO. DIE. FOR. I will be back just to have this rice. You must get it, and share if you can!   Lazy dragon roll was decent. There was a weird kick to it that I didn't expect. It threw off the Asian flavor of the roll. Again, my husband loved it.   We'll be back, but not for sushi!"}
{"text":"Such a great place! The happy hour is awesome! Who doesn't love 2 for 1!!! The fish is great quality and the rolls are well done. I love how different the las vegas roll here is (kinda hard to eat but very good!) The people who work here are very friendly and the live music on Friday is great fun. The food from other countries I have never tried but I hear great things! Check it out for me and let me know."}
{"text":"Been here a dozen times and its always been just ok. This time I waited an hour for sushi! Pretty sure the waitress didn't ring in half our order. Sat here 20 minutes without water.  Spicy salmon roll was salmon roll with a dollop of sriacha on top? Only reason why I'm Giving it two stars and not one is because the live music was pretty good. Won't be back any time soon."}
{"text":"They were out of spring rolls when we went, and they also didn't have any white rice ready, but the food was actually really good. The beef was super tender and juicy and the chicken has a nice char on it. Overall, I was quite pleased."}
{"text":"im not sure who thought of calling this an asian restaurant when it compeltely felt the owner have not tasted nor seen the real version of what they were serving. singapore noodles had no broth, no shrimp, and the noodles are short and broken. even the curry chosen is green when it's supposed to be red.  yaki udon-they used hoisin sauce?! its crazy i have not seen a yaki udon with barely any breading coated with hoisin sauce?! what? beef teppa yaki. even if you google beef teppanyaki it never comes out as stir fried noodles!!  completely dissapointed with this one specially our not necessarily a cheap meal. :("}
{"text":"I don't mean to be hurtful, but I'm looking forward to the day I poop this out.  The \"hot\" tea was lukewarm at best, the edamame had a metric ton of salt on it, the crab puffs were fried in what was obviously old grease (not even kidding, they had a McDonald's french fries taste to them), and I'm pretty sure my shrimp tempura roll didn't even have shrimp in it. My mother got a roll and it tasted sour, for some reason. Calling that stuff \"sushi\" is an insult to Japanese culture. Got everything boxed up, paid the overpriced bill, walked outside and threw it in the trash can."}
{"text":"Its Our first time here it was good... The noodles are fresh and the sushi too.One thing I dislike is the appetizer pot sticker other than that im happy with my Malaysia noodle...Everyone try the Malaysia spicy noodle with shrimp and chicken you won\"t regret it....."}
{"text":"The ambiance at this place can't be beat! Live music on most nights, great wine and drink menu, and plenty of food options. The food is great, the decor is fantastic and every experience I have with this place has been phenomenal!   I highly recommend it for dates/intimate evenings."}
{"text":"I have been going to Simply Noodle for over a decade... and now I have to stop. The service has gone down hill to the point where I just can't do it. I have brought many of my friends here and even they are starting to see how bad the service is. I was here during lunch with my dad and toddler. There was only 1 other table with people. It took forever to get our crab puffs and forget drink refills. We were starving and having a hungry toddler is never fun. We had been there more than 45 minutes when I asked how much longer until our food would be ready. I had to get up and ask since our server didn't come near the table. I was told another 20 minutes. We packed up and went to Chick-Fil-A. I really wish John would take care of these issues since my friends or I loved to come hear once a week or more."}
{"text":"great waitress, but super slow service in the kitchen. It took forever to get our food and it wasn't even busy. probably won't go back."}
{"text":"I have lived in Gilbert for almost 10 years and I am so bummed that I only recently discovered Asia. This has become my new favorite place to eat, actually I have never had a favorite place. There have been places that I liked a lot, but never a favorite.   I love the vibe, the owner John and all of the staff make you feel very welcome. The sushi is super fresh and delicious. I am working my way through the entire menu.   It is really cool to have discovered palace that I can bring family and friends and business associates. If you do decide to visit Asia, don't be surprised if you see me. According to my credit card statement, I am there a lot."}
{"text":"Total Experience was good, large portion size, as far as Authentic is concerned, order lantern flame and they severed char kway teoh, Order Malaysia Hokkien Mee, this dish doesn't even look close to the Singapore or Malay dishes in these countries."}
{"text":"3.5 stars for service.   They are BUSY. And that's a good sign that the locals like coming here. They even have a lot of walk-ins placing to-go orders. But they need to work on scheduling more staffing on a Saturday night during prime dinner hours. They were slammed with only two waitresses working the floor, the bar and the patio area. Immediately after sitting down, I could tell service was going to be slow with all the other tables waiting to have their orders taken. We waited a good 5 minutes just to get our menus. We almost walked out, but we were starving and craving sushi and decided to stick it out.   It's a small restaurant hidden next to a Party City. Even their menu is small. The setting on the inside was cool because the focal point was the sushi bar where you can easily view the chefs doing their thang. If there were more waitresses working, this place would easily get 4 or 5 stars, but they didn't even have time to explain which rolls were what when they dropped off our food.   The prices were good - large hot sake for $2.50! The sushi was alright. Our waitress forgot my mom's drink and my seaweed salad. The chef also was not able to make our spider roll, but I'm not sure why. This may be a local favorite, judging by all the patrons that come in and know each other by name. But if they just beefed up their staffing by one more waitress, they stand to gain more regulars."}
{"text":"Our meal was delicious, the service was good and it was neat to be able to sit at the bar and watch the chefs prepare everything!"}
{"text":"WOW, really loved this place. Alot of places skimp on the shrimp, beef or chicken in noodle dishes and nope...not at this place. You get your $ worth and it's not expensive! Definately will be back and this place has beat a few other asian places i've been loyal too for years! Give it a shot!"}
{"text":"I love everything about this restaurant. Their food is amazing and so healthy. The band that is brought in to play jazz music is amazing. I love that it is such a small and quaint restaurant. Highly recommended!"}
{"text":"Great drinks, good happy hour (3-6) yummy sushi, the severs are awesome. Love this place. You can either try something new or get your favorite but there's so many options and jon will walk you through it for the perfect fit"}
{"text":"This was our Favorite Asian Restaurant for several years. I don't know why, but for the past 3 years none of the food as been as flavorful . The only dish that we still like here is the Ancient Fried Rice, but again it is no where near as good as it used to be. We don't go very often now."}
{"text":"This place is closed   We had stopped by this place twice. There is simply a paper sign to notify customers"}
{"text":"Really enjoyed our meal there last night. Food was fresh, reasonable and served with a smile. Would recommend to anyone and we' re definitely going back."}
{"text":"Thanks to Groupon (free advertising, guys), my family got a heck of a deal on our dinners.  The atmosphere was cozy, but can get cramped real quick come Friday's happy hour.  Their spicy spring rolls were made of a thicker won-ton type wrapper. They fried ours a little too long, so it had a slightly burned taste, as well as char marks. The plum sauce was overpoweringly fruity. One of my least favorite spring rolls ever.  Their satay beef was very peanut buttery. Not great, but tasty enough.  I thought their teppanyaki beef and yakisoba was excellent!  Their hong kong flat rice noodles were very mild. Kind of like grilled chicken and noodles.  Children and most geriatrics may find this to their liking.  The spicy yellowtail sushi was served seaweed on the outside. Very good.  Amanda was a great waitress. She worked us a great deal, and offered suggestions."}
{"text":"My husband and I tried this place on a whim. For a Saturday night this place was hauntingly empty. We were seated right away and our server promptly took our drink orders. The prices for sushi are on the high side but I ordered a roll and two pieces of nigiri anyways. My husband ordered the garlic shrimp noodles.   We listened to a decent cover band while we waited for our food. But like I mentioned the place was empty so I felt kind of bad for them. When our food came we were less then impressed. For the price I expected much larger rolls and a better cut of salmon. My husbands dish was bland tasting and made even worse by the old hot sauce sitting on the table he used to add a kick to it.   The gist of the evening is we had semi ok service (we did wait forever for the bill) and really not ok food. We will probably not be back."}
{"text":"P.S- HAAAPPYY HOUR starts at noon on Sundays till late in the evening...  go get your happy on!"}
{"text":"Yummy yummy yummy! This is a great place for sushi. Small, quieter than most, with a great staff. Definitely don't be shy and try the \"Trust Me\" roll. I've never been disappointed."}
{"text":"So I went here for lunch today with a friend and it turns out the specials that are advertised on here are no longer being offered, however, our nice waiter let us have the happy hour menu as it was still advertised. Very nice! So she got some sushi for wonderful prices (two rolls for 5$... seriously?!?! wow!) and I got the lettuce cups, which were really tasty, and the potstickers which were not good. They were fried, but not real crispy, and they had this gloppy, weird tasting sauce on top and then served with just soy sauce. Kind of weird and overall not pleasant. The food they were cooking smelled good and the lettuce cups were really yummy so I would come back... probably just for happy hour though."}
{"text":"Sushi  was not too bad except for seaweed, not so good. However, happy hour menu is not much to offer  compare to other place. The price is kind of high for the size of a roll which is kind of small."}
{"text":"The owner and staff will keep you coming back again and again! Great service and very friendly. And the food is very nicely prepared. Delicious fried rice and great sushi."}
{"text":"Fresh food so expect it not to be quick. All food is made from scratch and so delicious you can taste the freshness. Parking is easy and the staff is very attentive. Great wine selection and a full bar. Atmosphere is delightful but if you want large group seating this isn't the place. Very cozy and intimate. This will now be our local hang out as it's just like our home of Seattle."}
{"text":"This place is awesome!  I love sitting at the bar and watching them cook,  they have an open kitchen and everything is made fresh even the soups!"}
{"text":"Listed by Get Out Mag as a hip noodle house (formally called sN Asian Kitchen), Asia is said to have a cool black/white/red decor motif with a sushi bar. The restaurant - described as cozy - features noodle dishes from Japan, China, Vietnam, Malaysia and Singapore. Also, there's live jazz music Friday and Saturday nights.   So, ask yourself: Would that tempt you? It certainly did me, and at 7 p.m. on a Saturday, my sushi-lovin' friend and I met here.   We were immediately shown to a corner booth and given menus. Our server was friendly, albeit a tad eccentric, which we didn't mind. Her quick, matter-of-fact manner was something we couldn't decide if we liked. But, that's okay.   Our first challenge was to pick out our drinks. The wine list is HUGE. There's also specials they write on a big chalk board. Narrowing it down to a few selections took a few minutes... and my friend was disappointed to be told twice that they were out of the drink of her choice (including one of the sakes on the menu). Bummer. I went with the J Lohr Wildflower red blend. And I didn't like it. I told our server that I should have taken her suggestion and gotten the Writer's Block Zin and I was hoping I could send back the Wildflower.   \"You don't like it?\" \"No, sorry. I don't.\" \"That's okay. I hate it. It's so popular, though. I don't understand why.\"  Uhm, good to know. For being honest about other wines, she certainly held her tongue when I placed my order.   My friend and I split the Salmon Salad app, with fresh spinach and pine nuts. It was very tasty. The Salmon was tempura, but I didn't find it too fried to enjoy.   We then shared the Best of Asia - 3 pieces each of yellow tail, tuna and salmon, lightly seared and flavored with garlic, paprika, ponzu and a jalapeno on top. HOT! I had two pieces and left the rest for my friend.   The Big Buddha Roll, which we shared, was very, very tasty. It was a little spicy, but in that good way I enjoy. This roll was double wrapped with soy paper on the outside and had crab meat, avocado, cream cheese and salmon inside. YUM!   About 3/4 of our way through dinner, the server brought out my new glass of wine. Uhm, ok.   \"Sorry, I totally forget.\" \"But at least you remember,\" my friend remarked.   As for the atmosphere, it can only be summed up this way: Airport.   I got the feeling that if I walked out the front doors, I'd be inside an airport terminal, headed to whatever gate I needed to be at to make my flight. The interior of the place, like my friend pointed out, seemed to be the type of place that \"you cram things inside a space that don't really fit or belong.\" Bingo!   The sushi bar/kitchen takes up the bulk of the space, with a short sushi bar area to its immediate side. There's a few tables scattered about, as well as a few booths. The decor is red, black and white - Get Out was right about that. I just would never call this place cozy. They did turn down the lighting around 7:30 which helped immensely.   As for the music, it was nice jazz. The trio set up in a corner and played a few songs. Sax, drums, guitar - what else do you need? On our way out, while the band was on break, we learned they weren't even a band... and that they just kind of set up and played in an impromptu style. Regardless, they were enjoyable. They didn't really fit the motif of the restaurant, tho. It was more of the \"airport restaurant trying to be a cool lounge with live music.\"  When the bill came, I was pleased to see our server did not charge me for the glass of wine I sent back. I appreciated that.   Yet, the bill was a bit too high for the type of service/experience my friend and I had here at Asia. $46 for 2 people? Ouch. Both the Buddha Roll and Best of Asia were $12 a piece (the former totally worth it; the latter not). The appetizer salad was $8. My friend's sake was $2 (bargain) and my glass of really great Zin (a new fave) was $9. All in all, it added up. But I definitely would not go back to throw down that kind of money at a place that reminded me of an airport restaurant.   Also, while we were waiting for the server to run my card, I flicked with my forefinger what I thought was a piece of paper, though in my mind it looked like a tiny, tiny fly. Turns out the \"piece of paper\" sprouted legs and started to crawl across the table. IT WAS A BUG! Ew. Gross.   This place has potential, but it'll need a real overhaul to entice me to come back.   Redeeming traits: *HUGE wine list (almost too big; it's hard to decide) *Full bar with beer selections, including a couple Asian favorites *Sake choices for cheap *Big Buddha Roll that's one of the best rolls I've had - anywhere *Live music - sure beats pop music blasting overhead *Clean bathroom with a vibrant green scheme - with several men's magazines to flip through (Weird, eh?) and a pic of Audrey Hepburn on the wall"}
{"text":"Went with my wife and her sister for lunch.  We shared a plate of calamari and it was perfect, to say the least. Crispy with a light batter and not over cooked. I had a Vietnamese spicy beef noodle bowl and was immediately won over. My wife had a crispy chicken and egg noodle bowl and couldn't say enough about how great the lunch was ... If we lived here it would be a regular stop for us. Hidden away, great staff ... No way you can go wrong."}
{"text":"Do not eat sushi here. The service was good, the bartender was pleasant, but the fish was terrible. We ordered tuna and salmon nigiri which was completely dried out and, in a word, disgusting. I have to assume the other reviews refer to the wok menu, because the sushi was a health code violation waiting to happen."}
{"text":"Customer experience was horrible.  My friend got her food before me and finished it before me. One server, one chef, poor experience. Will never come again. BTW I'm still hungry"}
{"text":"So I haven't been here in forever and recommended it for our Saturday night family dinner because it was amazing. Unfortunately it was better then than now. We waited an hour from when our whole party arrived to actual food in front of us. And when it did arrive, some dishes were cold (from waiting on the counter while the others were being made) and they weren't as good as I remembered. The Shenzhen chicken was super sweet, the Hong Kong noodles were bland as was the fried rice. The saving grace was the Teppan-Yaki beef. If all the dishes were as flavorful as the beef it would have been excellent. The waitress was sweet when she came around but ultimately drinks were not refilled without asking and I had to ask for chili sauce (to balance the sweetness) from the bar cuz she didn't check back with us. I probably won't be back, but will remember the restaurant as it was, and erase this dinner from my memory!"}
